{
    "chapters":{
        "1":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Erika",
                "Natalie",
                "Nick",
                "Dan",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Each story begins with two key choices, #1 possessed character, #2 possessing character. The first character you chose will be the possessed character, and the second will be the possessing character, after you have made that choice it's off to the races. Once the story starts you can go in any directions and start with any character, however the story should be moving towards the initial relationship chosen.<br>\r\n<br>\r\nThe way of possessing is up to you, go crazy. There are no restrictions on subject, it is rated XGC for a reason. Sex, incest, gay/lesbian, etc. Transformations are a secondary category if you wish to add them to your story it is encouraged, but don't feel that it must be put into the story.<br>\r\n<br>\r\nFollows is a list of the first 4 characters, these will be the characters that are going to be possessed in the story:<br>\r\n<br>\r\n#1: Erika is a 20 years old junior in college. She currently lives in a dorm with a roommate (designed by the author). She is very attractive, with long black hair, and dark green eyes. She has a very curvy body just a tad overweight, D cup breasts, wide hips, and long legs.<br>\r\n<br>\r\n#2 Natalie is a 38 year old single mother of 3. She is a housewife with a part time job living mostly off of her deceased husbands wealth and life insurance. She has two daughters and one son. She is slightly overweight however she clearly works out. She has fiery red hair and green eyes, DD cup breasts, wide hips, and fairly normal length legs with thicker than average for her height thighs.<br>\r\n<br>\r\n#3 Nick is a 18 year old freshman in college. He has just moved into a dorm on his own. He's a thin nerd with glasses and some fairly nerdy hobbies. He has never been with a woman. He's using college as a reason to reinvent himself, hoping to become more sociable than before. He is skinny with brown hair and eyes, and tall - 6' 4''.<br>\r\n<br>\r\n#4 Dan is a 45 year old delinquent father of two and lawyer. He has two daughters which he only sees once a year, whom live his estranged wife. He is a very attractive man, with sharp features, blue eyes, salt and pepper hair, and 6' tall. He works out a lot keeping his body muscular. He has a bit of womanizing streak to him, the reason his marriage failed.</span></div></div>",
            "created":1374814800,
            "id":1635012,
            "title":"It begins"
        },
        "11":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Ryan",
                "Tim",
                "Rachel",
                "Lynda",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Erika is the one who will be possessed; now chose a character to take control of her.<br>\r\n<br>\r\n#1: Ryan a 25 year old man down on his luck. He is stalking Erika's roommate Rachel. He was fired from his job recently for sexual harassment.<br>\r\n<br>\r\n#2: Tim is 18 years old and a senior in high school. He is Erika's brother and is over to see her campus.<br>\r\n<br>\r\n#3: Rachel is a 20 years old junior in college and is Erika's roommate. She is a fairly attractive girl with red hair C cup breasts. She is a shy girl and still a virgin.<br>\r\n<br>\r\n#4: Lynda a 62 year old woman dying from cancer.</span></div></div>",
            "created":1374814800,
            "id":1635018,
            "title":"Erika"
        },
        "111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Head to the police now",
                "Head to the police in the morning",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>I was arriving home from class when I heard sniffling from inside my dorm. Opening the door I saw Rachel sitting on her bed crying. I tossed my bag onto my bed and sat down next to Rachel. \"Whats wrong honey.\" I said as I embraced her in a hug. She was slightly surprised and hesitant at first but she allowed me to hold her.<br>\r\n<br>\r\nWe sat there for a few seconds before she cleared her throat and slowly began to speak. \"I can't... deal... with it anymore.\" She sputtered out.<br>\r\n<br>\r\n\"Deal with what?\" I said inquisitively Rachel told me everything, this came as a surprise to me.<br>\r\n<br>\r\n\"A man has been following me for the last week.\" Immediately my blood began to boil. \"He approached me yesterday to ask me out. I was totally creeped out by him though so I said no and moved on, thinking it was over. Then yesterday he was everywhere, when I left the dorm, when I got to class, when I left class, all day.\"<br>\r\n<br>\r\nI pulled her into the embrace more. \"It's ok tell me everything.\" I said with great concern in my voice.<br>\r\n<br>\r\nShe stammered at first. \"Then... then when I was heading back here he approached me again. This time he told me I had to go out with him. That we were soul mates. He told me that he was in love with me.\" She paused readying herself. \"Then she grabbed me and pushed me up against the wall trying to kiss me.\" I was shocked worried how far this had gone. \"I screamed and it seemed to worry him so he backed off and seeing that other people were looking he ran away.\" Relief came to me in a large wave, nothing had happened... yet.<br>\r\n<br>\r\n\"I'm so sorry Rachey.\" I said as I stroked her hair. \"Starting tomorrow I will go with you. to class. We should go to the police and see if we can't get a restraining order.\" Rachel nodded slowly.</span></div></div>",
            "created":1374901200,
            "id":1635186,
            "title":"Ryan"
        },
        "1111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Ryan leaves and they get to the police station",
                "Ryan continues to advance",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Do you want to go to the police now or in the morning?\" I asked her gently not wanting to push her into anything.<br>\r\n<br>\r\n\"May as well get it over with.\" I let her out of the hug and grabbed my bag.<br>\r\n<br>\r\n\"Ok let's go.\" I held my hand out to her to pull her off the bed. I grabbed her purse and put it around my shoulder we would probably need her ID and what not.<br>\r\n<br>\r\nWe walked slowly toward the police station that was only two blocks from campus. Rachel suddenly froze next to me reacting to a man walking towards us. I saw the terror in her eyes and knew that this was the man that had been stalking her. I put my arm in front of Rachel between the man and her, he stopped moving as if he noticed me for only the first time.<br>\r\n<br>\r\n\"Get out of here ass-hat.\" I said seething.<br>\r\n<br>\r\n\"Rachel... I love you... you and I belong together.\"<br>\r\n<br>\r\nRachel suddenly spoke up. \"I don't love you... I don't even know your name, or how you know mine.\"<br>\r\n<br>\r\nHis face lightened slightly. \"Oh well I'm Ryan... and...\"<br>\r\n<br>\r\nI interrupted him. \"Just shut it, we don't want to talk to you.\"<br>\r\n<br>\r\n\"Please Rachel...\" He said as he put his arm up in invitation.<br>\r\n<br>\r\n\"Please just leave!\" Rachel shouted.</span></div></div>",
            "created":1374901200,
            "id":1635191,
            "title":"Head to the police now"
        },
        "11111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "When he left the two girls he stumbled on a mysterious shop",
                "He went back home to plot his next move"
            ],
            "content":"<div class=\"\"><div> <span>Ryan backed away slowly then began to walk away. We waited until he was gone before continuing to the police station now in a bit of a hurried walk.<br>\r\n<br>\r\nWe got to the station just fine. Slowly the process began of creating a report of verbal and physical assault and stalking. They got us to describe him to a sketch artist and told us it may take some time to find him. Until they do, they can't file a restraining order without a last name. They also told us that they would fax the sketch to campus security whom would keep him off campus if they see him. They told Rachel to never walk alone until they find him. Finally they got an officer to give them a ride back to their dorm. This entire process to several hours and it was now past midnight.<br>\r\n<br>\r\nIn the meantime what is Ryan up to?</span></div></div>",
            "created":1374901200,
            "id":1635192,
            "title":"Ryan leaves and they get to the police station"
        },
        "111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Open the scroll",
                "Head home"
            ],
            "content":"<div class=\"\"><div> <span>I was walking back home from seeing Rachel again. What would I do, she didn't love me, I had to make her love me, I had to. Nothing in my life had been working out since being fired I had to have this. If only Rachel would love me I could get it all back.<br>\r\n<br>\r\nI was brought out of his simmering thoughts when I saw a shop in an alley I had never seen before. The sign merely read Magic. Magic was certainly something I needed right now. I entered the shop looking around at all the odd items on the wall. \"Sorry we are about to close.\" The patron said as he looked up to me. His face changed from contempt to a sinister smile. \"Well I guess we can stay open for you. I have exactly what you need.\"<br>\r\n<br>\r\n\"How do you know what I want?\" I asked.<br>\r\n<br>\r\n\"Oh well I can see as clearly on your aura as your face, that you want something you can't have. I can help with that, although in a bit of a round about way.\" The man pulled a scroll off the wall. \"This spell will allow you to possess what you seek.\"<br>\r\n<br>\r\nAt first I thought he was insane, but as I looked at the scroll it seemed to call to me. \"...how much...\" I said without thinking.<br>\r\n<br>\r\n\"Well let's see $100 should be just fine, cash or credit?\"<br>\r\n<br>\r\nI grabbed my wallet and handed him my credit card, which was already nearly maxed out, this would make it as such.<br>\r\n<br>\r\n\"Good.\" He took the card and ran it through his machine. He tossed the scroll to me and I walked slowly out of the shop. I stood there for a while my mind completely blank. Suddenly I woke up and turned around to see that the shop was gone. I was still in the same alleyway, but it was just gone.</span></div></div>",
            "created":1374901200,
            "id":1635199,
            "title":"When he left the two girls he stumbled on a mys..."
        },
        "1111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Back to Erika and Rachel",
                "Stay with Ryan"
            ],
            "content":"<div class=\"\"><div> <span>I opened the scroll to at first see writing that appeared to be as arcane to me as Chinese did. However a few moments later and the letters began to reorganize and reshape themselves until they were in English. The title or the scroll was Possession. I began to read the description of the spell. It would turn me into some kind of slime, and I would be able to take control of anyone's body.<br>\r\n<br>\r\nAs I read I realized this was my in, I would simply become someone Rachel trusted. That stupid bitch that was with her would do, they were roommates after all. However if I didn't go now I may have much more trouble getting close to them. Soon everyone would try to keep me from getting to my love.<br>\r\n<br>\r\nHe rolled up the scroll and began to walk towards campus.</span></div></div>",
            "created":1374901200,
            "id":1635201,
            "title":"Open the scroll"
        },
        "11111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Ryan is in the bathroom waiting for Erika",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Rachel and I got out of the police car and the officer walked with us back to our dorm room. \"You ladies be safe, both of you, if he has already assaulted you, you are both in danger.\" The officer said with a stern but clearly caring voice.<br>\r\n<br>\r\n\"Thank you officer, so much.\" Rachel said as she walked into the room.<br>\r\n<br>\r\nHe looked at me. \"I'll go tell the campus security now, there's a good chance the stalker will be in the area tonight, but that's really all I can do for tonight.\"<br>\r\n<br>\r\n\"Thanks.\" I said as I slowly went into the room and closed the door. Once inside I looked at Rachel \"I'm gona go get a shower.\"<br>\r\n<br>\r\n\"Alright, I'm just gona get to sleep.\" Rachel said as she pulled off her clothes. <br>\r\n<br>\r\nI left to the dorm bathroom.</span></div></div>",
            "created":1374901200,
            "id":1635203,
            "title":"Back to Erika and Rachel"
        },
        "111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Ryan keeps forcing himself into Erika",
                "Erika notices and starts to resist"
            ],
            "content":"<div class=\"\"><div> <span>Not surprisingly the bathroom was empty since it was nearly 1 in the morning. I turned a shower stall on as I began to pull my shirt off. Looking up into the mirror I thought I saw some weird black goo going into my ear. \"I'm in.\" did I just say something? I looked back up at myself but for a moment I didn't look like me. Then the feeling went away and I looked like me again.<br>\r\n<br>\r\nI pulled off my shoes and pants. When I suddenly I brought my hands to my bra pushing it up off my breasts. I looked shocked in the mirror then my face twisted into a a different look, one of lust. \"Such great breasts.\" I said as I fondled my own breasts.<br>\r\n<br>\r\nI snapped out of it for a second what had I just said? The event seemed to fade quickly and I reached behind me to unhook my bra. I let it hit the ground as I looked into the mirror admiring my breasts, they were great.<br>\r\n<br>\r\n\"Almost as good as Rachel's, I bet hers are much better.\" a sick smile grew along my face.<br>\r\n<br>\r\nNo, what had I just said about Rachel? This time the memory did not fade instead it became more powerful. Rachel did have great breasts, she was a very lovely girl. I thought about Rachel as I pulled down my panties.<br>\r\n<br>\r\nA new thought came from within me, Rachel was not just a lovely girl she was a sexy girl. She was down right hot and I really liked her.<br>\r\n<br>\r\nI stepped into the shower and thought 'Well I like her as a friend at least anyways.'</span></div></div>",
            "created":1374901200,
            "id":1635208,
            "title":"Ryan is in the bathroom waiting for Erika"
        },
        "1111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Erika gets into her room",
                "Erika takes back control before she gets to her room"
            ],
            "content":"<div class=\"\"><div> <span>As the water hit me I felt something grow inside me. I didn't like her as a friend, I loved her!<br>\r\n<br>\r\nNo, this isn't right. I crouched down and held my head, tears streaming down my face.<br>\r\n<br>\r\nI love her, I love Rachel. My hands slowly reached towards my pussy and breasts.<br>\r\n<br>\r\nWhat's happening I don't love her, I want to protect her!<br>\r\n<br>\r\nI will always love and protect her, she will be mine. My hands began to work hard into my pussy and on my breasts.<br>\r\n<br>\r\nI... I... do love her. Slowly I began to enjoy the sensations.<br>\r\n<br>\r\nI want to touch her breasts, lick her pussy, I want to be with her.<br>\r\n<br>\r\nYes, of course, I can't deny that I want Rachel. I came hard as I thought about Rachel and how much I loved her.<br>\r\n<br>\r\nI walked out of the shower and looked at myself in the mirror. Rachel was mine, I loved her, she belongs to me, we should be together.<br>\r\n<br>\r\nThe wicked smile on my face seemed right. I dried myself off and put on my panties and shirt. Bundling up my other clothes I quickly walked back to my room.</span></div></div>",
            "created":1374901200,
            "id":1635211,
            "title":"Ryan keeps forcing himself into Erika"
        },
        "11111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Erika forces her to take off her clothes",
                "Erika comes to her senses before it's too late"
            ],
            "content":"<div class=\"\"><div> <span>I opened the door and threw the bundle of clothes I had onto my bed. I looked at Rachel whom was sitting there on her phone. I wanted her so much.<br>\r\n<br>\r\nRachel turned to me. \"Hey Erika I want to thank you for everything you've done today. I don't think I could get through this without you.\" I sat down next to Rachel and smelled her hair, something I had never done before... or was it... no something I had always wanted to do.<br>\r\n<br>\r\nA knew thought came to me, I wanted to kiss her more than anything.<br>\r\n<br>\r\nI turned her head towards me and to her surprise I kissed her. I opened my mouth and forced my tongue into her. I felt my nipples harden.<br>\r\n<br>\r\nI loved her taste so much, I wanted more!<br>\r\n<br>\r\nIt was true she tasted just as I imagined. I released the kiss. Rachel was shocked. \"What are you doing Erika!\"<br>\r\n<br>\r\n\"I want you!\" I said with a wicked grin.<br>\r\n<br>\r\n\"Please stop this, I can't deal with this right now!\" Rachel said as I undid the buttons on her blouse. I pulled the blouse off her roughly.<br>\r\n<br>\r\nI want to see her breasts so bad. \"Take off your bra.\" I demanded coldly.<br>\r\n<br>\r\nRachel began to cry. \"...no...\" she said quietly.</span></div></div>",
            "created":1374901200,
            "id":1635216,
            "title":"Erika gets into her room"
        },
        "111111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Ryan starts to take Erika over completely",
                "Rachel pushed Erika away and runs away"
            ],
            "content":"<div class=\"\"><div> <span>I paused for a moment, what was I doing? If I really did love her, why was I forcing myself on her. I need to stop.<br>\r\n<br>\r\nI can't stop though, I'm so close. She belongs to me, and I to her. She will love me as I love her. I reached around her back and unhooked her bra, she was still holding it to her chest. I wanted to see her breasts so badly, to suck and nibble them. I embraced her again and kissed her forcefully. She dropped the bra in the shock. I lowered my head and began to lick and suck her nipples, they were the perfect size. Everything about her was perfect. \"Now take off you panties.\" Rachel was in a mixed state of arousal and shock. \"When I saw you last month I couldn't stop myself from moving ever closer to you. I love you Rachel.\" I said as I watch her slide her panties down hesitantly.<br>\r\n<br>\r\n\"What are you talking about, we have known each other for years?\" Rachel sat on the bed now naked.<br>\r\n<br>\r\nI stopped for a moment, I have known Rachel for years hadn't I?<br>\r\n<br>\r\nNo, I only met her last month, I saw her leaving a coffee shop after having lost my job.<br>\r\n<br>\r\nYes, that's right, I lusted after her for 3 weeks before I even got within 20 feet of her. \"Whatever you say honey, I just want to taste that wonderful pussy of yours.\" I lowered myself down to her crotch and began to lick and suck.<br>\r\n<br>\r\n\"Oh my god, Erika stop this!\" Rachel said however her body began to react to my touch as she moved her hips forward and her pussy began to wet.<br>\r\n<br>\r\n</span></div></div>",
            "created":1374987600,
            "id":1635447,
            "title":"Erika forces her to take off her clothes"
        },
        "1111111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Ryan continues to take over Erika's body",
                "Ryan decides to leave Erika's body now"
            ],
            "content":"<div class=\"\"><div> <span>\"No Erika, please, just stop.\" Rachel plead in a combination of moans and crying. I backed away for a moment, who was Erika? Was I Erika?<br>\r\n<br>\r\nA sudden feeling overwhelmed me, I knew the answer to that question was a complete no. I wasn't Erika, not anymore. I was Ryan.<br>\r\n<br>\r\nI stood up, and grabbed my head, no it wasn't true, I am not that stalker. I am... who am I...<br>\r\n<br>\r\nI am Ryan, that's right. I looked down at Rachel finally completely sure of myself. I pulled my panties down as my clitoris began to push out of my body. It emerged and become a penis.<br>\r\n<br>\r\n\"What the hell! Erika, why do you have a penis!?\"<br>\r\n<br>\r\nDid I have a penis? Is that normal?<br>\r\n<br>\r\nYes of course it was normal, I always have had a penis! I want to fuck Rachel, how else could I fuck her.<br>\r\n<br>\r\n\"Oh honey.\" I said with an evil grin across my face. \"Erika isn't here anymore, I'm Ryan now.\" I said as I shoved my cock into her.<br>\r\n<br>\r\n\"How, the stalker!?\" She said as she moaned slightly. Quickly I began to feel my arousal rise to new highs. After a few minutes of thrusting I felt myself about ready to come.<br>\r\n<br>\r\n\"I'm about to come, I love you so much Rachel!\" I came into her pussy. Rachel eyes dimmed as I came inside her and she fell limp onto her bed.</span></div></div>",
            "created":1374987600,
            "id":1635452,
            "title":"Ryan starts to take Erika over completely"
        },
        "11111111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Ryan completes the process destroying Erika",
                "Ryan decides to keep Erika intact"
            ],
            "content":"<div class=\"\"><div> <span>I pulled my penis out of Rachel. This was amazing I now had full control over this body, but I could still feel remnants inside of me. I stood there for a few minutes simply examining my new body in the mirror nearby. I wasn't sure exactly how I had transformed the body, but I did know exactly how to get rid of the remnants of the old owner of this body.<br>\r\n<br>\r\nRachel began to awaken from her fainting spell. I looked at her, she would need to watch me do this to her best friend. I needed to show her that I had the power here. \"Please, just leave now, you got what you wanted...\" Rachel said weakly.<br>\r\n<br>\r\n\"I don't think so, I like this body. I think I will make it mine permanently.\" Rachel began to cry again. \"You see the longer I am in this body forcing my will into her mind the closer her personality will become to mine. Eventually if I keep forcing my will she will become me. Then even if I leave this body it will still be me in here. She will have my memories, my feelings, my personality, there will be no way to tell us apart.\"<br>\r\n<br>\r\n\"Just leave her alone, your already controlling her body, you would be killing her!\" Rachel plead with me.<br>\r\n<br>\r\nI simply smiled. \"I can already feel her personality becoming closer to mine. I'm forcing my way into her.\"</span></div></div>",
            "created":1374987600,
            "id":1635454,
            "title":"Ryan continues to take over Erika's body"
        },
        "111111111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Ryan succeeds ",
                "Erika fights back reversing the process"
            ],
            "content":"<div class=\"\"><div> <span>Rachel said something else as I forced my will into myself. Inside my mind there were two people, myself and Erika. The landscape in my head became clear to me, as if it were real now.<br>\r\n<br>\r\nErika stood there crying, she knew everything that had just happened, but she was unable to change anything. \"Why...\" Erika looked at me tears in her eyes.<br>\r\n<br>\r\n\"Because you tried to keep me away from her. This is my retribution.\" I said to her as I walked closer.<br>\r\n<br>\r\n\"You made me rape her... I never wanted...\" Erika was clearly in shock.<br>\r\n<br>\r\n\"Don't worry very soon she and I will love each other forever, but before that, I need to do away with you.\" I could see the fear in her eyes as I now stood in front of her.<br>\r\n<br>\r\n\"Haven't you done enough, your willing to kill me?\"<br>\r\n<br>\r\n\"I won't kill you, I will just make you me.\"<br>\r\n<br>\r\n\"How is that any...\" Before Erika could finish the sentence I stabbed my hand into her gut. Slowly tendrils came out of where my hand was. Erika began to scream as she felt herself being overwritten.<br>\r\n<br>\r\n\"How does it feel, becoming me?\" Erika looked up at me her eyes pleading with me. \"Can you feel my love for Rachel entering you.\"<br>\r\n<br>\r\nErika lowered her gaze staring blankly into the distance. \"I...I...yes...\" Erika felt new emotions entering her. She loved Rachel, if she couldn't have her, no one should.</span></div></div>",
            "created":1374987600,
            "id":1635888,
            "title":"Ryan completes the process destroying Erika"
        },
        "1111111111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Back out of the mind-scape with Rachel",
                "Rachel runs away before the transformation is over"
            ],
            "content":"<div class=\"\"><div> <span>I felt my resistance crumble, I was losing myself. Memories began to pour into my mind, being a boy, constantly afraid of a drunk father. My first girlfriend cheating on my with my best friend. The stupid bitch at my work, I asked her out and she refused me. I couldn't hold myself back anymore. I told her she had to go on a date with me. She stabbed me in the back and turned me into my supervisor.<br>\r\n<br>\r\nThen I meet Rachel, she was brilliant. All of my problems washed away when she was around. I needed her, I loved her. More than anything else in the world. Now I had nearly completed my final objective. Destroying my former self was an important step, but not the last step.<br>\r\n<br>\r\nStill inside my mind I looked down to see Ryan's hand inside my gut, the resistance to the tendrils ended and instead I began to welcome them into me.<br>\r\n<br>\r\n\"That's it, accept me. Soon we will be the same.\" Ryan said to me smiling.<br>\r\n<br>\r\nI smiled back. \"Yes, your right, or course. I can feel you, I want you in me now.\" I hugged him and pulled him towards me. As my mind changed the representation of my body began to change as well.<br>\r\n<br>\r\n\"Who are you?\" Ryan said knowingly.<br>\r\n<br>\r\nI felt the changes increase quickly, my body was changing, I was becoming something else, my breasts shrank, my dark hair became brown and shorter. \"I'm...I'm you!\" When I said that I felt a snap, I changed all at once. Ryan removed his hand just as my body settled into it's new form. I was Ryan now, in body and in mind.<br>\r\n<br>\r\n\"Good, now let's complete our plan.\" Both Ryans said in unison. \"First we must change you into a female version of myself.\" Said the original Ryan to me. \"Thanks to your old self, I am a wanted man, my life is over. It will be easier to stay in the shell of Erika if you are female.\" The first Ryan explained.<br>\r\n<br>\r\n\"I couldn't agree more, but only you have that power.\" I said coldly. Once again the original Ryan stabbed me, this time I changed quickly, I was reshaped in a female version of Ryan. My breasts were C cups, I had long brown hair and brown eyes, wide hips, and long slender legs. I drew off of Erika's old memories to gain any skills I would need to live in her body. \"Perfect.\" I looked at my new body.</span></div></div>",
            "created":1374987600,
            "id":1636059,
            "title":"Ryan succeeds "
        },
        "11111111111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Ryan reveals his final plan",
                "Rachel is able to resist"
            ],
            "content":"<div class=\"\"><div> <span>I looked up from my meditation only a few seconds had really passed. I brought my hands to my mouth and black ooze began to pour out of my eyes, ears, nose, and mouth. It formed into a ball.<br>\r\n<br>\r\n\"Oh thank god, he's left you Erika.\" Rachel said with great relief.<br>\r\n<br>\r\n\"In a way I guess.\" I grinned at Rachel evilly. \"He of course changed my personality into his first.\"<br>\r\n<br>\r\nRachel brought her hands to her mouth and gasped. \"Oh god. He's out of you now you can resist, fight.\" She started to cry again.<br>\r\n<br>\r\n\"You don't seem to understand, I want to do this now. I want nothing more than to love you and soon you will love me too.\" I said as I shoved the ball of black ooze into her face.<br>\r\n<br>\r\n\"No stop!\" Before Rachel could get anything else out the ooze filled her facial openings. Quickly she went quiet.<br>\r\n<br>\r\n\"Are you in?\" I said to Rachel.<br>\r\n<br>\r\nShe grinned. \"Of course. Now for the finale.\"</span></div></div>",
            "created":1374987600,
            "id":1636063,
            "title":"Back out of the mind-scape with Rachel"
        },
        "111111111111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Inside Rachel's mind Ryan begins to merge with her",
                "Rachel is able to resist"
            ],
            "content":"<div class=\"\"><div> <span>I looked into Rachel's eyes, god how I loved her. \"I... I can feel him inside me. Please help Erika.\" I sat down next to Rachel and pulled her into a hug.<br>\r\n<br>\r\n\"Just accept it, it will be easier that way.\" I felt my nipples harden and my penis become hard as I felt my breasts mush against hers.<br>\r\n<br>\r\n\"Please I don't want to die.\" She seemed unable to cry now, and she accepted the embrace more than a moment ago.<br>\r\n<br>\r\n\"Oh you won't die, I... well the I that is now in you wants to merge with you. I want to become one with you. I would never kill you or your personality like I did with the former owner of this body.\" I explained as I slowly kissed towards her pussy.<br>\r\n<br>\r\n\"What! I don't... want...\" Rachel began to moan as I got to her pussy, now she was finally being more honest, clearly I was already influencing her.</span></div></div>",
            "created":1374987600,
            "id":1636068,
            "title":"Ryan reveals his final plan"
        },
        "1111111111111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "It works Rachel begins to love Ryan",
                "Rachel resists and reverses the process"
            ],
            "content":"<div class=\"\"><div> <span>I was exploring inside Rachel's mind, in order to merge with her I would need to change two things about her. I would need to change her revulsion for me, and make her want to merge with me, otherwise it wouldn't work. This was as much as I was willing to change her, I was slightly worried this would change her from the amazingly perfect person she is, but I had to risk it.<br>\r\n<br>\r\nI found the representation of her mind and moved towards it.<br>\r\n<br>\r\n\"Please stop this Ryan, I don't want this. If you really love me you will stop.\" Rachel plead with me.<br>\r\n<br>\r\n\"I love you more than you can know, for now at least. Don't worry once I change a few things we will live happily ever after.\" I said to her as I stuck my hand into her. she looked down and began to scream. \"Nothing to worry about.\" I smiled at her.<br>\r\n<br>\r\n\"I...\" She stammered.<br>\r\n<br>\r\n\"Now how do you feel about me?\"</span></div></div>",
            "created":1375074000,
            "id":1636071,
            "title":"Inside Rachel's mind Ryan begins to merge w..."
        },
        "11111111111111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "They merge",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I... I love you.\" Rachel said clearly surprised, she brought her hands to her mouth as if she could take back the words.<br>\r\n<br>\r\n\"Good feel that love grow, you and I will love each other forever.\" I smiled as she move towards me and kissed me on the mouth. This is what I had been waiting for she finally was returning my love!<br>\r\n<br>\r\n\"Oh Ryan, I was so wrong, I love you so much.\" She pulled me into a embrace forcing my hand further into her.<br>\r\n<br>\r\n\"Just one more change my lovely.\"<br>\r\n<br>\r\n\"Please isn't this enough we love each other, this is what both of us wanted right?\" She was still resistant to being changed.<br>\r\n<br>\r\n\"No we must become one, one mind! one body!'\" I shouted as I forced my will into her. She began to convulse as my will enveloped her, I had pushed much hard than I ever had before.<br>\r\n<br>\r\n\"YES! Of course your right we must merge, we must become one!\" She shouted back at me suddenly.</span></div></div>",
            "created":1375074000,
            "id":1636078,
            "title":"It works Rachel begins to love Ryan"
        },
        "111111111111111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "The transformation continues into the real world",
                "Back to the real world"
            ],
            "content":"<div class=\"\"><div> <span>Rachel began to push towards my body, and as she did more of my body was forced into hers. \"It's happening we are becoming one!\" Rachel shouted seeming so pleased.<br>\r\n<br>\r\n\"Yes my love.\" Their bodies began to lose their shape as they mushed into one another. As they did their memories began to merge, each could see into the other's past. Their knowledge began to merge, everything they knew fought for control, their beliefs, their emotions. The struggle did not last long however, neither personality was dominate the merger would fix that. Neither personality existed anymore, they were a different person now.<br>\r\n<br>\r\nThe body began to take shape, it was female since both personalities wanted the body to resemble Rachel more, it had more of her features. Each however was accented with Ryan's genetic information, their breasts were DD cups now, hips much wider, and butt grew out much more. The females in Ryan's family were very vulturous and it showed in this new body. She still had Rachel's red hair and green eyes, but other than that ever feature was slightly different. Before Rachel was a very beautiful woman, but now this new person was extremely beautiful, clearly centerfold material.<br>\r\n<br>\r\nThe eyes opened. \"We are one, once and for all.\"</span></div></div>",
            "created":1375074000,
            "id":1636092,
            "title":"They merge"
        },
        "1111111111111111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "The end",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>I looked into Rachel's eyes, she had begun to spasm so I stopped licking her pussy. She suddenly opened her eyes. \"We have become one!\" I felt so happy, I had succeed they had merged! Suddenly her body began to bubble and twist. I looked horrified had the merger failed was she dying? My fears were put aside quickly as I saw her body was changing. She was becoming far more voluptuous, clearly their merger was powerful enough to cause changes of a major scale. She was now the image of beauty, I loved her even more now.<br>\r\n<br>\r\n\"We did it, it is over now.\" Rachel looked at me with the same green eyes as before.<br>\r\n<br>\r\n\"How does it feel Rachel?\" I was so mystified.<br>\r\n<br>\r\n\"Amazing, everything I could hope for. Also don't call me Rachel anymore, I think I will go by Rae now.\" She purred as she pulled in for a kiss.<br>\r\n<br>\r\nI pulled away. \"Oh Rae, your so fucking hot now. I think I love you more.\" I began to think. \"Well maybe I should change my name too. I can't go by Ryan in this body, and Erika doesn't feel right, I did kind of kill her.\"<br>\r\n<br>\r\n\"Your right, hows Erin sound to you.\" Rae smiled.<br>\r\n<br>\r\n\"Perfect.\" I said to her as we embraced in a very deep kiss.</span></div></div>",
            "created":1375074000,
            "id":1636101,
            "title":"The transformation continues into the real world"
        },
        "11111111111111111111111":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "content":"<div class=\"\"><div> <span>We continued to fuck for the rest of the night, and morning. I found that each of us could turn our clitorises into penises and return them back at will. After graduating I filed a legal name change with the court, my name was now legally Erin Armstrong, Armstrong was my last name when I was Ryan so it seemed to fit. Rae didn't need to change her name legally since it was more or less her old name shortened.<br>\r\n<br>\r\nMany people noticed the changes in Rae, however it was dismissed as plastic surgery. I noticed that slowly my body sifted to that of the female version of Ryan. It was slowly enough that I was able to hide it from everyone. Now we live in flat while Rae is in her graduate program and I am working to make ends meat. We broke off communication with our former families hiding from them as best we could.<br>\r\n<br>\r\n\"Will you marry me.\" I said staring deeply into Rae's eyes. I held the ring out to her. She looked at me and smiled.<br>\r\n<br>\r\n\"Of course! I love you so much Erin!\" We hugged and kissed. We were probably the closest couple ever. Since there was so much of us that loved the same things. The merger made Rae different enough that things never got stale though.<br>\r\n<br>\r\nLater that month we eloped since we had no family to invite. Now we look forward to each second together, after all we love each other.</span></div></div>",
            "created":1375074000,
            "id":1636104,
            "title":"The end"
        },
        "113":{
            "choices":[
                "They go out for dinner.",
                "They stay inside for dinner.",
                "They order chinese takeout."
            ],
            "content":"<div class=\"\"><div> <span>Erica dumped her bags on the ground as she let herself down on the couch. It was one long day, boring professors, jocks trying to get her to notice them. Luckily she didn't have to endure any of these things here. She was all alone together with Rachel of course. She suddenly heard a sound from Rachel's room. Erica quietly opened the door. She saw Rachel sitting behind her computer, on the screen was a dating site. Opening the door further she stepped inside. Rachel looked up with a scared face but relaxed as she saw it was Erica. <br>\r\n<br>\r\n\"Glad you're here.\" She said putting a smile on her face. Erica put her hand on her shoulder as she stared at the dating site. \"A dating site, really? Rachel you're much better than that.\" <br>\r\n<br>\r\nRachel shrugged as she stared at the screen. \"I know, but I don't how else to meet the perfect partner. I mean I c-can't go up to somebody and ask them their phone number.\" <br>\r\n<br>\r\n\"Why not?\" Erica asked, she did it a lot.<br>\r\n<br>\r\n\"Because I'm too scared for that.\" Rachel looked down in embarrassment.<br>\r\n<br>\r\nErica hugged Rachel tightly, Erica could feel how Rachel relaxed a bit. \"Rachel, you just have to wait a bit, love comes for anyone.\"<br>\r\n<br>\r\n\"Oh Erica how I wish I could be like you.\" Rachel muttered.<br>\r\n<br>\r\n\"That wouldn't be good, who else would order me to do my homework?\" Erica joked.<br>\r\n<br>\r\nRachel laughed a bit as she looked at the clock. \"It's dinner time, I haven't prepared anything yet. Should we still make something or go out?\" </span></div></div>",
            "created":1375074000,
            "id":1636380,
            "title":"Rachel"
        },
        "1133":{
            "choices":[
                "a potion",
                "a piece of paper with some words",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Why not get some Chinese? Erica suggested. \"There's this new restaurant I've heard about. Should be really great.\"<br>\r\n<br>\r\n\"Sounds good. I'll set the table.\" Rachel smiled.<br>\r\n<br>\r\nErica ordered the Chinese and asked it to be delivered. She got an old Chinese lady on the phone. \"And do you want the special?\" She asked at the end of the call.<br>\r\n<br>\r\n\"The special? What is it?\" Erica inquired.<br>\r\n<br>\r\n\"It's special, so do you want it?\" The lady asked.<br>\r\n<br>\r\n\"Would that cost me more?\" Erica asked.<br>\r\n<br>\r\n\"No, it's free for you only. Whose name I can put on it?\" The lady asked.<br>\r\n<br>\r\nErica thought Rachel could use a special in her life. So she gave the lady Rachel's name.<br>\r\n<br>\r\n\"Our delivery boy will be there in ten minutes. Enjoy your meal!\" The lady told Erica as she hanged up.<br>\r\n<br>\r\nErica returned to the dining area to find Rachel having set the table already. Just a dinner between friends.<br>\r\n<br>\r\n\"So, how long does it take?\" Rachel asked flipping up her cellphone.<br>\r\n<br>\r\n\"Ten minutes but I've got a surprise for you.\" Erica giggled.<br>\r\n<br>\r\n\"A surprise? What is it?\" Rachel asked a little afraid.<br>\r\n<br>\r\n\"Relax it's completely harmless, but I can't say anything further about it.\" Erica didn't even know what it was.<br>\r\n<br>\r\nTen minutes later the doorbell rang and a boy of Asian descent delivered their food. Erica paid him in cash. \"My mother told me to enjoy your gift with the person you most like.\" He said as he walked away. Erica raised her eyebrow up. A weird saying that is.<br>\r\n<br>\r\nWhen Erica came back, Rachel put out the food. \"Hey what's this?\" She asked as she put out a box. \"I don't know, must be the surprise I ordered for you.\" Erica mumbled as she was eating some shrimp crackers. <br>\r\n<br>\r\nRachel opened the box and revealed...</span></div></div>",
            "created":1375506000,
            "id":1639437,
            "title":"They order chinese takeout."
        },
        "11331":{
            "choices":[
                "drink the potion there.",
                "drink the potion when going to sleep. "
            ],
            "content":"<div class=\"\"><div> <span>\"What's this?\" Rachel asked as she held up a bottle with blue liquid inside it.<br>\r\n<br>\r\n\"I don't know, doesn't it have a label?\" Erica asked. <br>\r\n<br>\r\nRachel held the bottle up, it didn't have any kind of label  on it. <br>\r\n<br>\r\n\"So, what am I supposed to do with it.\" Rachel asked as she sat down again. <br>\r\n<br>\r\n\"I don't know, drink it?\" Erica answered sarcastic. \"It's supposed to be a surprise. And I don't think a Chinese restaurant will send us poison.\" <br>\r\n<br>\r\n\"Look you don't have to drink it now. You can also drink it before you go sleeping. What do you think of that?\" Erica asked.<br>\r\n<br>\r\nRachel thought about it and decides to..</span></div></div>",
            "created":1376110800,
            "id":1643614,
            "title":"a potion"
        },
        "113312":{
            "choices":[
                "A blob of slime at the far side of her bed.",
                "a ghostly image of Rachel floating in front of her."
            ],
            "content":"<div class=\"\"><div> <span>\"I'll drink it when I'm going to bed, maybe it well help me dream up some nice dreams.\" Rachel told Erica.<br>\r\n<br>\r\n\"Fine with me. Now let's clean this mess up and watch some TV.\" Erica suggested as she picked up the bowls. <br>\r\n<br>\r\nThey quickly did the dishes together and then went to watch some TV. Well actually half sleeping half watching it was. <br>\r\n<br>\r\nTime flew by and around midnight Erica and Rachel decided to go to bed. Tomorrow they didn't have anything special planned but they would usually spend some time together. They said goodnight to each other and went to bed.<br>\r\n<br>\r\nErica removed the make-up she was wearing, pulled off her clothes and put on a nightgown. And she had to admit it drove the men wild when they saw her like that. Her breasts would come a little out. Erica lay down under the sheets and quickly started falling asleep. She wondered what the potion would contain for Rachel, she didn't knew she would be finding out soon.<br>\r\n<br>\r\nIt felt like Erica had slept for hours when she suddenly heard her name being called. She opened her eyes carefully and saw to her amazement..</span></div></div>",
            "created":1382677200,
            "id":1684165,
            "title":"drink the potion when going to sleep. "
        },
        "1133121":{
            "choices":[
                "\"Sure, where do you want to enter me?\"",
                "\"No way, I'm just grabbing you.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Huh?\" Erica said still sleepy as she saw the jelly like thing lying on at the end of her bed. \"Who said that?\" <br>\r\n<br>\r\n\"It's me, Rachel.\" The voice said and Erica saw the jelly jumping up and down the bed. Erica was sure she was dreaming now, a weird dream but still.<br>\r\n<br>\r\n\"I must be dreaming.\" Erica said as she pulled off the sheets and crawled over to the jelly. <br>\r\n<br>\r\n\"Finally I thought you were going to stay asleep like that.\" The voice said coming from the jelly.<br>\r\n<br>\r\n\"Rachel is that really you?\" Erica asked finally realizing that her best friend's voice came from the jelly. <br>\r\n<br>\r\n\"Yes, it's me. And this is all your fault.\" Rachel said as she jumped up and down again this time out of anger. \"If you didn't make me take that potion none of this would have happened.\"<br>\r\n<br>\r\n\"That potion did this? What happened to you? Where is your body?\" Erica asked looking around.<br>\r\n<br>\r\n\"Still asleep. That's the weird part. When I woke up I was in a dark place which turned out to be my panties. Should have worn another pair, those things were really tight. Anyway I slipped out of my panties and saw my body just lying there in bed. I don't know if it's still alive or anything like that, I crawled over to your room and luckily you never close your door so here I am.\"<br>\r\n<br>\r\n\"Heavy.\" Erica said. \"So we need to make sure your body isn't dead or anything like that? Let's go.\" Erica said already standing up.<br>\r\n<br>\r\n\"Wait!\" Rachel said as Erica turned around to face Rachel.<br>\r\n<br>\r\n\"Do you know how long it took for me to get here. I'm as fast as a snail. You'll need to carry me.\" Rachel said longing. <br>\r\n<br>\r\n\"Okay.\" Erica said friendly as she knelt down next to her friend. <br>\r\n<br>\r\n\"Um I know this might sound weird, but I really would like you to carry me some other way.<br>\r\n<br>\r\n\"How? I don't have to carry you into a bag or anything like that?\" Erica asked.<br>\r\n<br>\r\n\"No, not like that. I was just curious if I could enter your body like this and let me be carried.<br>\r\n<br>\r\nErica thought about it and said...</span></div></div>",
            "created":1455308820,
            "id":2103194,
            "title":"A blob of slime at the far side of her bed."
        },
        "11331212":{
            "choices":[
                "Yes, she should.",
                "No, she shouldn't. "
            ],
            "content":"<div class=\"\"><div> <span>Erica gently lifted Rachel of the ground. Holding Rachel like that felt really weird, like she was holding jelly inside her hands. Looking like that it was hard to resist not to eat Rachel if she didn't know any better Erica would say she was a piece of jelly. <br>\r\n<br>\r\n\"Aww.\" Rachel sighted as she was taken by Erica. <br>\r\n<br>\r\n\"Come on silly, we have to find your body.\" Erica said as she opened the door to her room and walked over to Rachel's room. Inside she saw how clean and proper her roommate's room was. Everything was tidied and proper, no clothes were seen lying around unlike her own room. Erica saw Rachel's body just lying in her bed, her eyes closed. It was just like she was sleeping. <br>\r\n<br>\r\n\"Oh look at my body.\" Rachel said as Erica gently put her on her own body. \"It's like I'm really asleep.\"<br>\r\n<br>\r\n\"It sure is, very creepy.\" Erica said as she looked around. Erica noticed the potion took was on the ground. Erica scoped it up from the ground, she saw there was still a drop inside of it. Erica pondered if she should drink up the last drop.</span></div></div>",
            "created":1458508680,
            "id":2120354,
            "title":"\"No way, I'm just grabbing you.\""
        },
        "113312121":{
            "choices":[
                "agreed with Erica to switch bodies.",
                "agreed, but suggests Erica stays a slime creature."
            ],
            "content":"<div class=\"\"><div> <span>Erica held the potion in her hand and while looking at it something inside of her told her to drink it. Like it was the last bottle of beer so compelling and yet could be so dangerous. But what the heck, YOLO right? Erica held the tube at her lips and felt how the drop went between her lips inside her body.<br>\r\n<br>\r\n\"Erica, are you crazy? What did you just do?\" Rachel asked freaking out.<br>\r\n<br>\r\n\"Relax Rachel, I just wanted to taste it, it's rather sweet isn't it? It tastes like...\" Erica couldn't finish her sentence as she felt woozy all of a sudden. The whole room was moving and she felt sick all. <br>\r\n<br>\r\n\"Erica! Erica!\" Rachel shouted but Erica couldn't hear her best friend. The bed of her best friend sure did look nice. Perhaps she just needed to sleep it off. Erica staggered through the room until she reached the bed. With a crash she just let herself fall down on the bed next to her best friend's body. Her world immediately turned dark after that. She then began to dream, she was in some kind of wet cave which was vibrating like crazy. The only thing she could do was move forward. Erica did so and then she finally reached the exit, it was a bright light with some black string dividing it. Erica didn't care she needed some air. So Erica moved forward and squeezed past the black thing. <br>\r\n<br>\r\n\"Wow, that was weird.\" Erica mumbled as she looked around herself. This, this was a weird dream. It looked like Rachel's room but only bigger. <br>\r\n<br>\r\n\"Erica?\" She suddenly heard a voice. Erica looked next to her and there she saw Rachel in her slime form. <br>\r\n<br>\r\n\"Rachel? What happened to me?\" Erica asked concerned.<br>\r\n<br>\r\n\"What happened to you? You're just like me now, a slime creature thing.\" Rachel said.<br>\r\n<br>\r\nErica looked down and saw she was indeed some slimy thing.<br>\r\n<br>\r\n\"So that tunnel I just escaped out was my....\" Erica asked.<br>\r\n<br>\r\n\"Yes, that was your vagina. You just escaped from your vagina, how freaky is that?\"<br>\r\n<br>\r\n\"That's totally weird. Speaking of which what do you suppose we do now?\" Erica asked.<br>\r\n<br>\r\n\"I guess it would be best for us to return to our bodies. I mean I don't know how long I can stand being this small.\"<br>\r\n<br>\r\n\"No way girl, we have to enjoy our freedom. Do some fun things.\"<br>\r\n<br>\r\n\"Like what? We're way too small to reach anything, we don't even have hands.\"<br>\r\n<br>\r\n\"But imagine us sneaking into places like this? I mean nobody would see us.\" Erica said moving around.<br>\r\n<br>\r\n\"Yeah right, I'd rather return back to my body or your body for that matter, they look the same from here.\" Rachel said.<br>\r\n<br>\r\n\"Rachel that's it!\" Erica said excited as she came up with something.<br>\r\n<br>\r\n\"What is it?\" Rachel asked confused.<br>\r\n<br>\r\n\"Since we're these slime creatures and came out of our bodies, would it make any difference if we would go inside someone else's body?\" Erica asked.<br>\r\n<br>\r\n\"I don't know, I suppose not.\" Rachel answered.<br>\r\n<br>\r\n\"Exactly, so why don't we switch? I'll go into your body and you'll go into my body.\" Erica suggested.<br>\r\n<br>\r\n\"Are you serious? That would mean that we...?\"<br>\r\n<br>\r\n\"Switch bodies? Totally, wouldn't that be awesome? I mean you can find out what it's like living like me, and vice versa. \"<br>\r\n<br>\r\nRachel thought about it and...</span></div></div>",
            "created":1463241300,
            "id":2147895,
            "title":"Yes, she should."
        },
        "1133121211":{
            "choices":[
                "Erica as Rachel.",
                "Rachel as Erica. "
            ],
            "content":"<div class=\"\"><div> <span>\"Okay I guess. I mean we can always go back when we take that potion right?\" Rachel asked Erica.<br>\r\n<br>\r\n\"Sure.\" Erica said all excited about the prospect of going inside another body. \"Now let's go before this stuff might run out.\" Erica said as she made her way to where Rachel her body was still lying. When Erica was finally upon the bed she heard Rachel speaking to her. \"Wow, it's way easier with you. You were only wearing a thong tonight underneath.\" \"Yeah, I told you, you totally need to get them as well.\" Erica told Rachel as she made her way to Rachel's body. Rachel was wearing pink pajama pants and top. So Erica made her way through the trouser leg of the pajama bottom to reach Rachel's vagina. She crawled her way through noticing how soft Rachel's legs were. They were really something to look forward to. <br>\r\n<br>\r\nFinally Erica reached Rachel's panties. Pink panties to match her pajama's. As Erica looked for a way to easily squeeze around, she found that this wasn't the case. She just had to squeeze past her leg in order to get inside her panties. When Erica thought about it she giggled: \"I never thought I would find myself in another girl's panties.\" She then reached Rachel's vagina enclosed by her natural forest. Erica knew one of the things she would be doing. She then squeezed herself inside Rachel's vagina, not sure what to expect. When the last of her slime entered the vagina, Erica began to feel strange. She felt herself spreading throughout Rachel's body, not knowing what would happen. Everything turned surreal and at last black. <br>\r\n<br>\r\nErica then felt a hand touching her shoulder. \"Erica, you alright?\" The voice asked awfully similar to hers. \"Yeah, just five more minutes.\" Erica said turning the other way. <br>\r\n<br>\r\n\"No, you silly. Open your eyes and look.\" The voice said incredulous. Erica opened her eyes sleepy but they got wide open when they saw who tried to wake her. In front of her was a familiar copy of her body. The same black hair, the same face, even the same nightgown she was wearing.  Was that her body?<br>\r\n<br>\r\n\"Rachel, is that you?\" Erica asked confused. Rachel nodded as she grinned. Erica looked down and saw the pink pajama's Rachel was wearing earlier and her hands were also different. \"Rachel, we did it.\" Erica grabbed her friend who fell down on the bed with her. They both laughed at it and examined each other for quite some time. \"This, I didn't foresee.\" Rachel said as she sat down next to Erica. <br>\r\n<br>\r\n\"Me neither, I thought it was just some kind of dream you know. A very weird dream, but okay.\" Erica said admiring Rachel's nail polish skills. <br>\r\n<br>\r\n\"So what do we do now?\" Rachel asked nervous. <br>\r\n<br>\r\n\"What do we do? We try this thing out of course.\" Erica told Rachel. <br>\r\n<br>\r\n\"But tomorrow we have classes, are you sure you can fit in with my classes?\" Rachel asked unsure.<br>\r\n<br>\r\n\"Of course, there's nothing to it. We can do this Rachel!\" Erica said hugging her friend once again.<br>\r\n<br>\r\n\"Okay, I guess you're right. We can tell each other tomorrow what we need to know.\" Rachel said standing up. <br>\r\n<br>\r\n\"Well, I guess I'll go to my room.\" Rachel said making her way.<br>\r\n<br>\r\n\"I'll go to sleep as well. Sleep tight.\" Erica said. <br>\r\n<br>\r\n\"You too.\" Rachel replied. Then both girls thought the same thing: \"But not before I have checked out my new body!\"<br>\r\n<br>\r\nWho to follow?</span></div></div>",
            "created":1477683240,
            "id":2229626,
            "title":"agreed with Erica to switch bodies."
        },
        "11331212111":{
            "choices":[
                "Erica decided on a deep exploration of her new body.",
                "Erica decided on going to sleep."
            ],
            "content":"<div class=\"\"><div> <span>Erica stood up slowly as she walked over to the mirror in Rachel's room. Erica still couldn't believe what just happened. It still felt like a dream; all of it. Rachel turned into a slime creature, Erica drinking the potion as well and their plan to switch bodies. It all just seemed like a dream, but now it turns out to be reality. <br>\r\n<br>\r\n\"Look at me. I'm gorgeous.\" Erica said as she heard Rachel's voice or something similar like it talking as she looked at herself in the mirror. The mirror displayed Rachel's look. Her cute little nose, her sparkling blue eyes, the cute looking freckles on her cheeks and the small petal rose like mouth. Not to mention the long red hair she possessed. Erica touched it as she couldn't believe it, it felt so thick and curly. Erica couldn't believe Rachel had this type of hair without having to do a thing for it. She loved it. <br>\r\n<br>\r\nErica touched her face, or Rachel's face, as she felt around it and saw the reflection in the mirror copying her action. Pinching her cheeks, rubbing them, pulling her nose up and sticking out her tongue. All that was just her doing it. This was unbelievable. And then the rest of her body as well. Erica looked down at the pink pajama top and bottom she was wearing. It was typical something Rachel would wear. but not something Erica would. <br>\r\n<br>\r\nErica carefully undid the buttons of her top though the last one was a bit of a hassle. Apparently Rachel sewed it back on. A skill of Rachel Erica didn't have. Erica once tried, but it never worked out. She wondered if now that she was in Rachel's body she could sew as her. That was something of later though and Erica pulled the pajama top off. Looking  in the mirror Erica was happily surprised. Rachel looked well...amazing. She had pale skin which made a beautiful contrast with her red hair. Her breasts were smaller sized, C-cups she imagined, but they looked nice. Erica tried not to stare too much at them and concentrated on the rest of her upper body. Rachel's waist size was smaller than Erica's, probably because Rachel tried to eat healthy and work out once in a while. Erica carefully touched her stomach area, amazed by how it was much smaller than her own. \"Nice Rachel. You have really got something here.\" Erica said amazed by it. <br>\r\n<br>\r\nErica then pulled off the bottom of her pajama pants and shove it away. She was wearing Rachel's pink panties. The same panties she crawled through in her slime form. \"Weird.\" She said to herself as she touched the area. \"To think I crawled through there.\" Erica then frowned and pulled off the panties as well without a moment of shame. She wanted a full inspection of Rachel's body. Erica was surprised to see Rachel had a bush around her nether regions. Something she had taken care of. Erica was pleased to see the carpet matched the drapes. \"Something to take care of yet.\" Erica said as her fingers gently took hold of her bush. Erica then concentrated on the rest of Rachel's body. Her hips weren't that large and while Erica maintained a jiggly ass, Rachel's was less noticeable. \"Though I think a guy wouldn't mind one like this.\" Erica said as she slapped it a little. Finally her legs were nice, smooth shaven as Rachel likes to wear skirts often. <br>\r\n<br>\r\nAs Erica looked at herself in the mirror she liked what she saw. It wasn't as sexy as her own, but she could do with it. While looking at her naked reflection Erica thought of something which made her reflection turn as red as the color of her hair. She wanted to see what she had to work with and masturbating as Rachel would give her the right info. But doing it as Rachel was a weird thought. She could also just dress up and go to sleep. Tomorrow was a whole new day and things could get hectic. What to do?</span></div></div>",
            "created":1519677060,
            "id":2458099,
            "title":"Erica as Rachel."
        },
        "113312121111":{
            "author_id":"rilo43",
            "author_name":"Rempa21",
            "choices":[
                "Next morning comes early.",
                "Next morning comes late."
            ],
            "content":"<div class=\"\"><div> <span>Still unsure about what would happen Erica lied down on Rachel's bed as she prepared herself mentally. Erica felt she was going to cross a line here; an important one. On one hand she didn't want to use her roommate's body as some sort of jerking off material; but on the other hand it felt exciting and thrilling to find out how Rachel's body would perform.<br>\r\n<br>\r\n\"Okay, just once.\" Erica promised herself as she closed her eyes as her hands were drawn to Rachel's breasts. She imagined Tony, a guy she regularly dates, playing with her breasts. Seeing his handsome face, those cute dimples in his cheeks playing with her breasts. Erica carefully began to play with Rachel's breasts, rubbing them gently, occasionally giving her nipples a little twist. Erica slowly felt a familiar feeling coming from down. <br>\r\n<br>\r\nErica looked down at Rachel's nipples. They were cute, even with them being pointy like they were now, but there were no competition for her own nipples. Erica had what they called inverted nipples and when they would come out they were pretty long, unlike Rachel's here. She often licked her nipples like that, but with Rachel's nipples that was no option.<br>\r\n<br>\r\n\"Down we go.\" Erica mumbled to herself as her left hand continued rubbing Rachel's breasts while her other hand snaked itself down to Rachel's pussy. Erica smiled wide as she gently began rubbing it. It was the weirdest part of all. Erica was used to masturbating in her own body, but doing it in someone else's body was amazing. Erica could feel the difference in pleasure zones between herself and Rachel's body. Not to mention how tight her pussy felt now. Probably because her body was still a virgin, but even then it felt pretty tight. This was one of the best things that happened to her.<br>\r\n<br>\r\nWhen the orgasm came, Erica didn't know what to do. She didn't want it to come, but Rachel's body couldn't contain itself any longer and she felt herself coming.Erica was surprised when she felt how Rachel's fluids flew away. <i>OMG, Rachel is a squirter.</i> Erica realized. She never told Erica this before. <br>\r\n<br>\r\nErica felt herself comfortable in Rachel's body as she was enjoying the afterglow. If Rachel's life was like this, this was one of the best thing she ever did. Erica continued having orgasms for three times after which she felt tired. Putting on the pair of panties she pulled off earlier, she went to bed with a grin on her face.</span></div></div>",
            "created":1579969980,
            "id":2778217,
            "title":"Erica decided on a deep exploration of her new ..."
        },
        "1133122":{
            "choices":[
                "Erica agrees with Rachel taken her over.",
                "Erica tells Rachel to go back to her own body."
            ],
            "content":"<div class=\"\"><div> <span>Erica her eyes were bulging as she saw the sight in front of her. Rachel was just there floating in the air, right in front of her.<br>\r\n<br>\r\n\"R-Rachel is that you?\" Erica asked as she let out a yawn. <br>\r\n<br>\r\n\"Yes it's me, don't your recognize me.\" Rachel asked a bit mad.<br>\r\n<br>\r\n\"But how did this happen? It didn't have to do anything with that potion?\"<br>\r\n<br>\r\nRachel put her arms over each other. \"Yes it did, after I took that potion I started feeling weird inside, I felt so warm inside I thought I was going to boil alive. That was until I pushed myself out.\"<br>\r\n<br>\r\n\"Pushed yourself out?\" You ask confused.<br>\r\n<br>\r\n\"Yeah, out of my body. Now it's just lying there in my bed, I think it's still asleep or something.\"<br>\r\n<br>\r\n\"Wow, so how does it feel?\" Erica asked interested.<br>\r\n<br>\r\n\"Pretty cool, I don't feel any warmth or cold. And I can fly around.\" Rachel demonstrated as she did a loop in the air.<br>\r\n<br>\r\n\"That's sweet.\" Erica said watching her doing it.<br>\r\n<br>\r\n\"Well there's something I wanted to ask you.\" Rachel asked standing there a bit shy.<br>\r\n<br>\r\n\"Lay it on me.\" Erica said sitting up in her bed.<br>\r\n<br>\r\n\"I was wondering if I could try to take over your body for a while?\"<br>\r\n<br>\r\n\"Wait what why?\" Erica asked.<br>\r\n<br>\r\n\"Well, you're so much prettier than me, and I really want to try your life. And you own me one for drinking this potion, Rachel added.</span></div></div>",
            "created":1383454800,
            "id":1688522,
            "title":"a ghostly image of Rachel floating in front of ..."
        },
        "11331221":{
            "choices":[
                "are her hands waving in front of her.",
                "herself in the mirror after a long day."
            ],
            "content":"<div class=\"\"><div> <span>Erica thought about it. It would be understandable that Rachel wanted to take over her life, she was her best friend and roommate. And besides if Rachel really wanted to take her over, she just could do it without Erica's permission. <br>\r\n<br>\r\n\"Fine, you can do it but there are two rules you absolutely have to hold on to.\" Erica pleaded. <br>\r\n<br>\r\n\"What would those be?\" Rachel asked a little annoyed.<br>\r\n<br>\r\n\"First you have to promise me not to do anything that would ruin my life. For example sleep with a bad boy.\"<br>\r\n<br>\r\n\"Don't you do that normally?\" Rachel asked smiling.<br>\r\n<br>\r\nErica smiled at the thought of that last guy, yeah he wasn't exactly a saint. \"Okay scratch that last example, just don't do things I wouldn't do.\"<br>\r\n<br>\r\n\"And the second thing?\" Rachel asked curious.<br>\r\n<br>\r\n\"Um, I'm not sure if it's possible, but when you take me over could you let me see everything and that sort of things. Not to intervene of course, but just to see how you handle things.\"<br>\r\n<br>\r\nRachel thought about it then she nodded. \"Okay that sounds good to me.\" <br>\r\n<br>\r\n\"Great, so how do you want to take me over?\" Erica answered excited.<br>\r\n<br>\r\nRachel shrugged. \"I guess I'll just go pass through you.\"<br>\r\n<br>\r\n\"Do you want me to take a special position? Lying, standing?\"<br>\r\n<br>\r\n\"Just lying like that would be fine.\" Rachel answered. When Erica got excited she tended to ask useless things.<br>\r\n<br>\r\n\"Okay.\" Erica said as she lied down on her bed. \"Good luck.\" She put up a thumb. <br>\r\n<br>\r\n\"Thanks.\" Rachel said as she blushed a bit. <br>\r\n<br>\r\nRachel slowly moved down as she phased right into Erica. Her body trembled a bit as Rachel passed inside. <br>\r\n<br>\r\nThe next thing Erica sees...</span></div></div>",
            "created":1389848400,
            "id":1728478,
            "title":"Erica agrees with Rachel taken her over."
        },
        "113312211":{
            "choices":[
                "Rachel stays inside to explore the situation a bit more.",
                "Rachel goes outside to enjoy life. "
            ],
            "content":"<div class=\"\"><div> <span>Erica saw her hands waving slightly in front of her as she studied them. <br>\r\n<br>\r\n\"Did it really work?\" She heard herself ask. She moved off her bed and towards the full sized mirror standing in a corner. When she stood in front of it, her eyes went wide open. Her hands were going in her hair, feeling the softness of it. She walked closer to the mirror, studying her eyes. Rachel's had been blue ones, now hers were green. Erica took a deeper look as she pulled off different faces, looking from sexy to really weird. \"I'm really you, Erica.\" She talked to herself.<br>\r\n<br>\r\n<i>\"Sheesh Rachel, is that the only thing you can think of.\"</i> Erica thought.<br>\r\n<br>\r\nThen Erica's hand went to her chest. Her hands weighted the gain of flesh she had just gotten. Her fingers even twisted a nipple. \"You're really sensitive Erica.\" Erica mumbled. She then pulled the nightgown over her head as she looked once again in the mirror. Her fingers felt around her stomach, she was a bit overweight but Rachel didn't seem to care about that. <br>\r\n<br>\r\nHer hands were resting on her hips, she was big, but not unattractive. Erica then pulled off her thong, she was a bit surprised to see that the area around her vagina was clean shaved. \"I guess I have to do that too, it does rather smooth.\"<br>\r\n<br>\r\n\"I have been telling you that for years.\" Erica thought. <br>\r\n<br>\r\nAt last Erica turned herself around and looked back in the mirror. Erica had a real nice ass, and judging by her reaction Rachel seemed to like it too. She gave herself a little slap, and giggled from it.<br>\r\n<br>\r\n\"Now what to do?\" She asked herself.</span></div></div>",
            "created":1398402000,
            "id":1786496,
            "title":"are her hands waving in front of her."
        },
        "1133122112":{
            "choices":[
                "The first outfit.",
                "The second outfit."
            ],
            "content":"<div class=\"\"><div> <span>Rachel turned around and slowly walked over to the mirror. Erica could see her eyes looking around the campus and then they were focused on the gate to the outside. Erica's index finger touched her lips as she closed her eyes suddenly. Erica knew Rachel was thinking if she would do that then.<br>\r\n<br>\r\nErica then suddenly felt her eyes opening and her mouth grinning. \"I think I want to go out Erica, if you're seeing this. I think there are still some places open, and I really want to go out and enjoy myself for once.<br>\r\n<br>\r\n<i>That's the spirit girl, you go!</i> Erica thought as Rachel finally began to take chances in her life. <br>\r\n<br>\r\nErica then felt herself walking over to her closet and opening it. \"Hmm, what shall  I wear?\" Rachel pondered out loud as she took clothes out of the closet and lay it down on Erica's bed. <br>\r\n<br>\r\nRachel then sorted through the clothes, until she finally had two outfits she wasn't sure about. Which one was the best?<br>\r\n<br>\r\nThe first outfit was a simple cocktail dress with an open back and a pair of black pumps. <br>\r\n<br>\r\nThe second outfit was a shirt with a plunging V-neck, a tiny mini-skirt and high heels.</span></div></div>",
            "created":1429938000,
            "id":1969319,
            "title":"Rachel goes outside to enjoy life. "
        },
        "113312212":{
            "author_id":"sweet3",
            "author_name":"Chad White",
            "choices":[
                "Possess Rachel",
                "Possess another friend "
            ],
            "content":"<div class=\"\"><div> <span>Erica comes back into reality and sees her reflection. \"Hey!\" Erica still had no control over her body. <br>\r\n<br>\r\n\"Oh I'm sorry Erica. I didn't know how to let you see too.\" Rachel says.<br>\r\n<br>\r\n\"Well get out of me now. You had your fun.\"<br>\r\n<br>\r\n\"Okay.\" Rachel says and she slides out next to Erica in ghost form. \"I'll be right back.\" Erica rolls her eyes and Rachel comes back in the room in her normal body. <br>\r\n<br>\r\n\"Try to go into ghost form again.\" Erica questioned. <br>\r\n <br>\r\n\"I'll try.\" Rachel lays down and tries to leave her body, but she won't budge. \"It won't work.\"<br>\r\n<br>\r\n\"Oh shame. You were having so much fun. I'll be right back.\" Rachel sits on the bed and Erica leaves the room. Now in Rachel's room, Erica enters and finds the potion with still some left. She immediately grabbed it and drank a sip, leaving still a bit left. Erica got light headed and started to sweat. She lied down on the bed and pushed herself out of her body.  </span></div></div>",
            "created":1401166800,
            "id":1803245,
            "title":"herself in the mirror after a long day."
        },
        "1133122122":{
            "author_id":"sweet3",
            "author_name":"Chad White",
            "choices":[
                "Head back to Erica's apartment",
                "Live the life of Brooke"
            ],
            "content":"<div class=\"\"><div> <span>Erica fled the house in ghost form and went straight to her friend Brooke's house. She always adored Brooke, and wanted to be like her. She entered in through the bedroom and saw Brooke drying herself off from the pool still in her bikini. <br>\r\n<br>\r\n\"Hey Brooke.\" Erica says.<br>\r\n<br>\r\n\"Huh, what? Who's there?\" <br>\r\n<br>\r\n\"It's me, Erica, but I'm in ghost form.\"<br>\r\n<br>\r\n\"Oh my god Erica what happened!\"<br>\r\n<br>\r\n\"Nothing really. I just came here asking of a favor.\"<br>\r\n<br>\r\n\"Sure, anything for you. Are you okay?\"<br>\r\n<br>\r\n\"Yes. My body is fine, but I want to borrow yours.\"<br>\r\n<br>\r\n\"Mine! What for?\" Brooke looked concerned. <br>\r\n<br>\r\n\"Well we have always been friends and like this just happened so suddenly and I only have one chance to use it. And I want to use it on you.\"<br>\r\n<br>\r\n\"Awe that's so sweet. So wait you want to possess me?\"<br>\r\n<br>\r\n\"Yea.\"<br>\r\n<br>\r\n\"Eh. I'm a little iffy about it, but fine. Will I get my body back soon?\"<br>\r\n<br>\r\n\"Of course!\"<br>\r\n<br>\r\n\"Alright. Come on in.\"<br>\r\n<br>\r\n\"Okay bend over.\"<br>\r\n<br>\r\n\"Like this?\" Brooke lets her arms fall down to the ground and left her butt exposed. <br>\r\n<br>\r\n\"Yup, now spread your ass cheeks.\"<br>\r\n<br>\r\n\"You have to enter in my ass? Oh well. Take my body fast before I change my mind.\" Brooke pulls down her bikini bottom exposing her ass completely. She spreads her cheeks apart and Erica saw her asshole. Erica stepped back then ran forward, head first into Brooke's asshole. \"Woa!\" Brooke screamed as she fell forward and suddenly Erica took control. <br>\r\n<br>\r\n\"Yes!\" she cheered in her new body. \"Hmm, I wonder.\" She sticks her index finger down her ass and smells it. \"Yup still has that Brooke smell from when I raided her panties in high school.\" She laughed and left the room. </span></div></div>",
            "created":1401166800,
            "id":1803255,
            "title":"Possess another friend "
        },
        "11331221221":{
            "author_id":"sweet3",
            "author_name":"Chad White",
            "choices":[
                "Erica returns to her body to get more potion ",
                "Erica searches for Jamie "
            ],
            "content":"<div class=\"\"><div> <span>Erica left to her apartment in Brooke's body. She walked in almost forgetting who she was. She saw Rachel sitting on the bed still. <br>\r\n\"Brooke?\" <br>\r\n\"No, Erica.\" She smiled.<br>\r\n\"Hey that's my potion!\" <br>\r\n\"We got it together so I deserve some too.\" <br>\r\n\"I guess so.\" Rachel pouted. \"Good choice too! Brooke's like the hottest girl on campus!\"<br>\r\n\"What? She is so not! I only chose her cus I know her well enough.\" <br>\r\n\"Oh, okay then.\" Rachel replied. \"So who do you think the hottest girl is?\" <br>\r\n\"I don't know.. I don't really have a ranking.\" Erica blushed.<br>\r\n\"You're definitely thinking of that girl Jamie from dance class.\" <br>\r\n\"Well she is pretty cute.\" <br>\r\n\"Why don't you go and take her for a bit and I'll take Brooke.\" Rachel suggested.<br>\r\n\"Is this gonna be a thing now?\" <br>\r\n\"This could be a really cool thing. But we should get more potion soon.\"<br>\r\n\"Okay where?\" <br>\r\n\"The restaurant.\" <br>\r\n\"Well have to try but for now I'm gonna leave Brooke.\" Erica said.<br>\r\n\"I know where you're going hehe.\" </span></div></div>",
            "created":1405918800,
            "id":1831591,
            "title":"Head back to Erica's apartment"
        },
        "113312212212":{
            "author_id":"sweet3",
            "author_name":"Chad White",
            "choices":[
                "They wake up ",
                "Something went wrong"
            ],
            "content":"<div class=\"\"><div> <span>Erica exits Brooke and flies back to her room. Brooke's body collapsed on the floor and Rachel caught it. She placed Brooke on the bed. Erica re-enters her body and retrieves the potion. <br>\r\n\"Okay there should be enough left for 2 more possessions.\" Erica said to Rachel.<br>\r\n\"Okay good, cus this bod looks good for me.\" Brooke's body started to move a bit and she woke up.<br>\r\n\"What's going on? Where am I?\" She looked up and saw Rachel smiling. \"Who are you?\"<br>\r\n\"That's Rachel.\" Erica said. <br>\r\n\"Oh hello. Did you possess me successfully Erica?\" <br>\r\n\"Yup! Only for a bit, like I promised.\" <br>\r\n\"My butt feels weird.\" Brooke said agitated.<br>\r\n\"Sorry.\" Erica replies. <br>\r\n\"Give me the potion Erica.\" Erica handed Rachel the potion and she drank some. Her body fell over and a ghost like form appeared.<br>\r\n\"Where is she going?\" Brooke said.<br>\r\n\"Oh, she's gonna take you off for a bit.\" Erica said.<br>\r\n\"What? No! I don't know her.\" Brooke shouted. But Rachel didn't hesitate any longer and dove down her throat. She woke up and stretched.<br>\r\n\"Oooh yea, I think I could get used to this. Erica you can keep the rest of the potion I have nothing to worry about now. I think I'm gonna keep this body.\" <br>\r\n\"Well alright then. I'm gonna go find Jamie.\" She walked out the door and headed to the dance studio. When she got there, she could see Jamie practicing inside. \"Wow isn't she gorgeous.\" She murmured. Jamie frolicked around and danced to a classical tune. Erica decided to wait around for her and follow her to her room. When Jamie finished up, she changed her shoes and walked to her room. Erica followed behind, trying not to be noticed. Once she got into the building, she saw Jamie opening her door. \"Hey Jamie!\" She yelled.<br>\r\n\"Oh hey there Erica. What's up?\" <br>\r\n\"I was wondering if you could help me review some steps real quick.\"<br>\r\n\"Ummm. Alright, I guess I have a couple minutes. Come in and show me what you need help with.\" Erica's followed inside giddily and sat on her chair. \"Okay so which dance?\" <br>\r\n\"Okay just the beginning of wind song.\" <br>\r\n\"Okay, watch.\" Jamie jumped up and down reciting the dance moves. Erica watched her body as it moved. It was a perfect dancers body. And she could have it. <br>\r\n\"Great! Thanks so much!\"<br>\r\n\"No problem.\" <br>\r\n\"So I wanted to ask something else.\" <br>\r\n\"Okay.\" <br>\r\n\"I wanted to know if I could borrow your body?\"<br>\r\n\"What do you mean by that?\" <br>\r\n\"I have this ability to possess people and I wanted to know if I could use it on you.\" <br>\r\n\"Oh I don't know. That sounds kind of weird.\" <br>\r\n\"It's okay. Well would you want to try it on someone else?\"<br>\r\n \"Could I use it on you?\" <br>\r\n\"Sure, I suppose.\" <br>\r\n\"Yay!\" Jamie jumped up and down. <br>\r\n\"You have to fall asleep first.\"<br>\r\n\"Alright.\" Jamie took a few sleeping pills and went out like a light. While she was asleep, Erica looked around and observed Jamie's body. She was wearing black leggings and a white tank top. Her feet were bare and exposed. Erica always had a crush on Jamie, and had some desires. She always wondered what her feet smelled like. Erica crept up behind her and looked at her feet. She stuck her face in them and inhaled deeply. She quivered and went back for more. She kept smelling them until they didn't smell like anything anymore. So she started liking them. She sucked every toe until they were fully cleaned. She thought about possessing her there, but she wanted to be fair with her. Maybe she could play around some more until she woke up. Erica jumped onto Jamie's bed with her and began to dry hump her. She grinded on her ass and laid on top her. Wow she was having a great time. The last thing she desired to do was smell her ass. She lifted Jamie up and placed her bottom directly on her face. A strong smell flew right into her nostrils, since Jamie had been dancing for so long. She couldn't help it anymore. She threw Jamie off of her and got out the potion. Right before she drank it, Jamie woke up. <br>\r\n\"Am I Erica?\" <br>\r\n\"No not yet. Here. Drink some of this and then enter me when I drink it as well. Jamie drank it and her torso flopped to the side of the bed. A ghostly figure came out of her and hovered around the room. Erica quickly drank the rest and passed out as well. Erica flew over to Jamie's rag doll body and flew strait into her head. She woke up and was pleased to feel her new body. Jamie's spirit flew into Erica's ass and she rose up like a toddler. <br>\r\n\"Woa it's weird walking in someone else's shoes.\" <br>\r\n\"You get used to it.\" Erica, now Jamie, picked up her shoe and began to sniff it.<br>\r\n\"So you had a foot fetish for me and that's why you wanted my body?\" <br>\r\n\"No not just that.\" She picked up a pair of Jamie's panties. \"An ass fetish as well.\" <br>\r\n\"Oh wow, well same to you.\" <br>\r\n\"Really?\"<br>\r\n\"Yes, since you walked in I've wanted to smother you. You think I didn't feel you licking my feet?\"<br>\r\n\"Oh haha well, my feet now.\"<br>\r\n\"Maybe after this we can do this more often.\" <br>\r\n\"Alright.\" <br>\r\n\"Have you ever smelled your own ass before?\" Jamie says in Erica's body.<br>\r\n\"Of course!\"<br>\r\n\"But not from another persons body.\" Erica's body smiled.<br>\r\n\"Bend over.\" Jamie smashed her face into Erica's ass and began to sniff. \"Oh my god yes!\"she began to finger her self and she fell over.<br>\r\n\"Let me help you.\" Erica sat on Jamie's face. \"Wow this is weird siting on my own face. Let me smell yours.\" Jamie got up and pushed her booty up. Erica dove right in and began sniffing. <br>\r\n\"Oh my goodness this is amazing.\" The two girls laid down on the bed and started to kiss. Jamie then slowly put her hand down Erica's dress and started fingering her. Erica did the same to Jamie. They came then passed out on the bed with their hands down each other's pants.</span></div></div>",
            "created":1405918800,
            "id":1831613,
            "title":"Erica searches for Jamie "
        },
        "11331222":{
            "author_id":"sweet3",
            "author_name":"Chad White",
            "choices":[
                "It worked",
                "It didn't work"
            ],
            "content":"<div class=\"\"><div> <span>\"Come on! You made me drink the potion and look what happened!\" Rachel said.<br>\r\n<br>\r\n\"No. I don't feel comfortable with you in my body. That's just so, weird.\"<br>\r\n<br>\r\n\"It is so not weird. We are roommates, practically sisters.\" <br>\r\n<br>\r\n\"What are you going to do with it?' Erica asked. <br>\r\n<br>\r\n\"Just live out a day as you to see what it is like. Then I can see if your life is really better than mine.\" <br>\r\n<br>\r\n\"Well nothing is really happening tomorrow, so I guess just for a day?\" Erica said hesitantly. <br>\r\n<br>\r\n\"You're literally the coolest person in the world.\" Rachel said and did a flip in the air.<br>\r\n<br>\r\n\"So how do you do it?\"<br>\r\n<br>\r\n\"I'm not sure. I haven't done it before.\" <br>\r\n<br>\r\n\"Well in movies they enter through the head or the back. Or they just walk into them.\"<br>\r\n<br>\r\n\"I could walk into you I guess.\" Rachel suggests. <br>\r\n<br>\r\n\"Alright sure. YOLO am I right.\" <br>\r\n<br>\r\n\"Haha true! Now just stand up.\" <br>\r\n<br>\r\n\"Okay.\" Erica says still nervous.<br>\r\n<br>\r\nErica stands up and turns her back in front of Rachel. Rachel could not believe that she was getting a free pass to use such a hot body! <br>\r\n<br>\r\n\"You only live once so why not live in the body you've always wanted.\" Rachel said and smiled sinister like.<br>\r\n<br>\r\n\"Wait what?\" But before Erica could react, Rachel flew into her body.<br>\r\n</span></div></div>",
            "created":1401166800,
            "id":1803240,
            "title":"Erica tells Rachel to go back to her own body."
        },
        "114":{
            "author_id":"xhion",
            "author_name":"Xhion",
            "choices":[
                "They swap bodies",
                "Lynda merges whit Erika's awareness",
                "Lynda has the control over Erika's body, but she's still there."
            ],
            "content":"<div class=\"\"><div> <span>  She had a lot or regrets; when Lynda was a kid, her strict parents never left her go to a party whit friends, nor to have a boyfriend or even wear a revealing dress.  When she turned 20, she married an old man who married her, but he was even more controller than her father; her husband never let her out or have a friend, in top of that they'd barely had sex, after the first two kids (both girls) he said that he didn't want more babies and he didn't believe in any contraceptives, so she went along with it. At her 30 she found that her husband had an affair whit a young and slutty girl, he left after that.<br>\r\n  But Lynda never got over it, instead she just sank in her sadness, showing a good face to her few acquaintances while she let herself die deep inside; she just let the time pass, dreaming of a new life, a life in which she was an ongoing teen, wearing miniskirts and high heels, a life in which a handsome young man fucked her hard, making her scream in pleasure... a life in which she was happy.<br>\r\n<br>\r\n  But now it was too late, she was no longer a teenager, she was an old grandma, lying still in a hospital bed, waiting for the dead to come for her. The only visit she had was her young granddaughter Erika, which would enter to her room in any second.<br>\r\n<br>\r\n  The door opened slowly, but the one who came wasn't her granddaughter but a guy in a white coat, he had the word WEIRD in all over his face, weird and broken glasses, brown messy hair and a rare grin in his smile.<br>\r\n<br>\r\n -<i>You're going to die</i> - Lynda didn't knew what to answer, she knew already she had a few days before the dead came for her, what was the point in make her suffer?, yet her meek nature didn't allow her to point it.<br>\r\n<br>\r\n -<i>Tell me </i>- Continued the Mad scientist -<i> Do you want lo live?  </i>-   Lynda eyes grow wide, of course she want lo live!, who doesn't?; yet the only answer she could make was to nod.<br>\r\n<br>\r\n -<i>Good</i> - the man seemed relieved ins ome way - <i>You see, I'd develop a machine that would let you live, even to have another chance, but the wretched doctors didn't want me to use it...  You see, in order to use my device, you need a donor support, someone who you know, someone of your family; do you have someone like that?</i><br>\r\n<br>\r\n  Lynda nodded once again, she felt joy deep in her heart, she may have a second chance to start over again, someone had listened to her prayers, this was a dream come true!. <i>-I..do</i>.<br>\r\n<br>\r\n-<i>Great, I'll give you this, you can only use it once, so... don't miss. </i> - The guy handed her a weird taser gun, whit a cable connected to a circlet. -<i>You must put on that, and then fire it, easy, isn't it?</i><br>\r\n<br>\r\n  The guy left the room, leaving Lynda disappointed... \"A toy... he give me a toy.... and I believed in him... but what if not?, what if he was for real?\"  she had nothing to lose (or so she thought), she put on the circlet, and when Erika step on the room to greet her grandma, she fired it against her.<br>\r\n<br>\r\n  </span></div></div>",
            "created":1398056400,
            "id":1784244,
            "title":"Lynda"
        },
        "12":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Tim",
                "Whitney",
                "Paige",
                "Bob",
                "Another Choice"
            ],
            "content":"<div class=\"\"><div> <span>Who will be possessing Natalie.<br>\r\n<br>\r\n#1: Tim a 18 year old high school student and her son. Fairly average looking guy, he is the only one in the family to get his Dad's brown hair, and brown eyes. He's a bit of an outcast in school, and is unsure of his future.<br>\r\n<br>\r\n#2: Whitney a 16 year old high school student and her daughter. She's still growing but is clearly following in her mother's genetic foot-steps. A tad short for her age, at 5'2'' but she is still likely to grow taller as her mother and father were taller. She has slightly darker red hair than her mother but similar green eyes, C cup breasts wide hips and fairly stout legs.<br>\r\n<br>\r\n#3: Paige a 21 year old college student and her other daughter. She is the spitting image of her mother with the same hair, and body shape, however her breasts are D cups. She also has heterochromia (two different color eyes) one green and the other blue.<br>\r\n<br>\r\n#4: Bob a 43 year old plumber. He lives two houses down and tends to repair almost everyone's plumbing on the block. He is divorced and harbors secret lust towards Natalie. He's overweight, and slightly balding.</span></div></div>",
            "created":1375765200,
            "id":1641199,
            "title":"Natalie"
        },
        "121":{
            "author_id":"blavcleo",
            "author_name":"Mr.nice",
            "choices":[
                "Red",
                "Blue",
                "You choose"
            ],
            "content":"<div class=\"\"><div> <span>Notice-Tim aka you)<br>\r\n<br>\r\nYou was limping home from school though the streets because you was trying to make friends with some girls and they beat to the ground and squish your penis calling you pervert for tripping over a girl and you said sorry to her twelve times.<br>\r\n<br>\r\nWhitney:http://images.nubiles.net/galleries2/jewel/fresh-teenie/01.jpg)<br>\r\n<br>\r\nYou still limping though the street in the night time with bruised leg until you see all the girls was inside your house with your sister Whitney one of the girls who helped them kick your ass.when get inside all the girls looked at you like a monster you went upstairs and told your mother but like usually she doesn't believe you because of favorites.<br>\r\n<br>\r\nMom aka Natalie:http://gallys.scoreland.com/images_content/CattGreen_27236/01.jpg)<br>\r\n<br>\r\nYou quickly ran out the house towards the park their was a mid age man with a beautiful woman( <a rel=\"nofollow\" href=\"http://fhg.eveangelofficial.com/PROMO/content/eveangel/pics/50801ea/fulm/001.jpg\" target=\"_blank\">http://fhg.eveangelofficial.com/PROMO/co...</a>)the man said.<br>\r\n<br>\r\nMystery man Pov<br>\r\n<br>\r\nOkay boy what's wrong with you don't tell me all women are treating you like shit,also your shaft been abused by some women to well I think I can help you with these pills  have to pick to choose these things don't worry am doctor here's my papers.<br>\r\n<br>\r\nBlue:a pill that restore your genitals a little to well.warning major side affects<br>\r\n<br>\r\nRed:a pill that will magically shed your skin by sweating the cause a exiler that regenerate any damages.warning don't let people touch you while you have sweat on body major side of affects</span></div></div>",
            "created":1401166800,
            "id":1803329,
            "title":"Tim"
        },
        "1212":{
            "author_id":"blavcleo",
            "author_name":"Mr.nice",
            "choices":[
                "Baker",
                "Crystal",
                "Amber,Stacey"
            ],
            "content":"<div class=\"\"><div> <span>You wanted to rape your mom for all the bullshit times so you took the blue pill you snatch it out of his hand and said thank you and gulped it down.You started to walk away until you felt dizzy and sleepy until almost fell over.<br>\r\n<br>\r\nBut the mysterious man catch you before you fall.<br>\r\n<br>\r\nNotice-mystery man is now called doc because... Enter your answer➡️(            )now back to story.<br>\r\n<br>\r\nCome on sex slave this needs to get home before the real affect happens to him.<br>\r\n<br>\r\nBlue other affects:able to make hormones that attract females,grow or shrink your penis and posses females by focusing your energy into your penis to penatrait a female though the skull then the penis Absorb the brain and act as the brain.when female is infected you can morph them in almost any way,also you gain great strength and speed and high senses.<br>\r\n<br>\r\nAs you ran as fast as your legs carry you zoomed to the door and put him in his bed nicely and wrote a letter about his ability and you left into the dark.<br>\r\n<br>\r\n<br>\r\nTim Pov <br>\r\nYou open you eyes and you hears birds but their isn't a birds around here since explosion at the experimental planetarium.oh well you walk to your bath and notice your buff now well not hulk buff but still buff,when you looked down your pride was back it's total prime.after you wash up looked at your desk and read the note it told you about your powers and grew a evil smile.<br>\r\n<br>\r\nNow who should I get revenge on first before mom.wait should at lest test it....nah<br>\r\n<br>\r\nVictims<br>\r\n<br>\r\nMiss.Baker(<a rel=\"nofollow\" href=\"http://images.ancdn.com/galleries/output/dwc/veronicakris/watermark/vertical.jpg\" target=\"_blank\">http://images.ancdn.com/galleries/output...</a>)<br>\r\nCrystal( <a rel=\"nofollow\" href=\"http://fuckedhard18.net/mallory-photos_files/p/05.jpg\" target=\"_blank\">http://fuckedhard18.net/mallory-photos_f...</a>)<br>\r\nAmber and Stacey(<a rel=\"nofollow\" href=\"http://www.spicetwins.com/hosted/twins_beach/images/SpiceTwins01.jpg\" target=\"_blank\">http://www.spicetwins.com/hosted/twins_b...</a>)</span></div></div>",
            "created":1401166800,
            "id":1803375,
            "title":"Blue"
        },
        "123":{
            "choices":[
                "go to the attic to find some cool junk to sell.",
                "go do a little shopping with her mom.",
                "go indulge into some pleasure. "
            ],
            "content":"<div class=\"\"><div> <span>\"Are you getting enough food? Are you only eating deep-freeze food? You look rather thin.\" Natalie asked as she was cooking a couple of pancakes. <br>\r\n<br>\r\n\"Yes, mom, no mom. And my friends say otherwise.\" Paige answered as she got her second plate. <br>\r\n<br>\r\nPaige lived in the dorms for the rest of the year, but in the summer she would spend her time at home. Right now, her mother was trying to overfeed her again. How she could be so embarrassing sometimes. They talked on the phone during the rest of the year and every time Paige had to promise her mother she would do her best and wouldn't get into any trouble. She was so glad her friends weren't around to listen to those calls, and especially to hear about that part not getting into any trouble. Paige got into trouble many times in the past, and lucky for her, her mom hadn't found out. <br>\r\n<br>\r\nSometimes she just wished she could be like her mom. She didn't had to get through college, instead she met dad and they married shortly after. Her mom didn't have time to study after they were all born, especially after dad had died. So lucky, Paige thought. <br>\r\n<br>\r\n\"I think I'll pass on a next round mom. I'll go to my room for now.\" Paige said shoving the plate away.<br>\r\n<br>\r\nHer mother looked at her as she went round the corner. She was the oldest, but also the one she worried the most about.<br>\r\n<br>\r\nPaige wondered what she should do? As fate would predict she would...</span></div></div>",
            "created":1389848400,
            "id":1728490,
            "title":"Paige"
        },
        "1232":{
            "choices":[
                "Paige ends up in Natalie's body, while Natalie and the driver are dead.",
                "Paige ends up in Natalie's body and vice versa with the driver being dead.",
                "Another possibility."
            ],
            "content":"<div class=\"\"><div> <span>Before Paige could do anything, her mom came after her. \"Before you go, I wanted to let you know that there's a sale going on at the mall. Even at some of those stores you like to shop at.\" <br>\r\n<br>\r\n\"No way.\" Paige said kind of interested. She did wanted to buy a new wardrobe, the party outfits she had were all worn once and Paige had a rule of wearing an outfit only once. Of course with her budget that meant mixing existing outfits, they were always a success but she was all out of ideas. <br>\r\n<br>\r\n\"So I was thinking of shopping together, on my treat.\" Natalie added the last part to ensure Paige would come with her.<br>\r\n<br>\r\n\"Oh mom that would be totally awesome.\" Paige said excited. Perhaps she could even convince her mom to buy new shoes for her. <br>\r\n<br>\r\nSo Paige and Natalie both gathered their purses and stepped inside Natalie's old car. <br>\r\n<br>\r\n\"Oh mom, when you're going to buy a new car. This one is way too old.\" Paige commented as she smelled that same old smell the car had.<br>\r\n<br>\r\n\"Paige, you don't go buy a brand new car just because it's too old. Cars don't grow on trees.\"<br>\r\n<br>\r\n\"Ugh I know mom, but you've got some money left from dad. I mean I wouldn't want to drive around in a car like this.\" <br>\r\n<br>\r\n\"That's because you don't own one. And I have to take care of the money properly, I mean I still have your brother and sister at home, they require the money as well. And I always need to set something aside in case the TV or the refrigerator gets broken.\" <br>\r\n<br>\r\n\"Yeah, yeah.\" Paige said uninterested. \"But could you at least buy some new clothes for yourself.\" <br>\r\n<br>\r\n\"What's wrong with what I'm wearing?\" Natalie asked as she looked down at herself. She was wearing one of her favorite summer dresses with a pair of flats.<br>\r\n<br>\r\n\"Don't take this wrong mom, but those clothes are way too old. You definitely need to get new ones.\" Paige said pointing at the dress she had several years now.<br>\r\n<br>\r\n\"Tell you what.\" Natalie said looking at Paige as she crossed the crossing. \"When we get to the mall, you may pick a new outfit for me.\" <br>\r\n<br>\r\n\"Sweet.\" Paige said as she always liked picking clothes for others. But then she saw a car coming from the other direction which her mother didn't see. \"Mom, look...\" Paige tried to warn her but before she could say anything more the car hit them. After that everything turned black.<br>\r\n<br>\r\nHow did it work out between Natalie, Paige and the other driver?</span></div></div>",
            "created":1497804540,
            "id":2338210,
            "title":"go do a little shopping with her mom."
        },
        "12323":{
            "choices":[
                "That will happen.",
                "No, something else happens."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It could also be possible that Paige ends up in Natalie's body and the other driver inside's Paige's body with Natalie may or may not ending up in the driver's body. How about that?</span></div></span></div>",
            "created":1497804660,
            "id":2338211,
            "title":"Another possibility."
        },
        "1233":{
            "choices":[
                "She took her Natalie's body over completely.",
                "She and Natalie both control Natalie's body.",
                "Paige acts like her mother's subconscious."
            ],
            "content":"<div class=\"\"><div> <span>Paige locked the door to her room, or better said her old room. There wasn't much in the room anymore, a couple of posters of a boy band, a wardrobe and her bed. <br>\r\n<br>\r\nLying down on bed, Paige wondered what she could do now. Nobody was around to text, all of her \"friends\" were off into foreign country. She was the only one who decided to go back to the parents. <br>\r\n<br>\r\nPaige was squirming a bit, she hadn't done it since she came here, but having nothing else to do, she didn't have a choice. <br>\r\n<br>\r\nPaige pulled off the tank top she was wearing over her head and threw it into a corner. She then pulled her shorts off and threw them into the corner with the top. <br>\r\n<br>\r\nPaige was proud of her body, and although a bit fat many boys found her attractive. That's why she slept almost every other night with one. She even once got with a girl in bed, the pleasure was good too.  She asked the girl to go again but she refused. <br>\r\n<br>\r\nPaige first hugged her breasts tightly, she moved her right one knowing that was her sensitive side. Pulling her nipples she let out her first moan and her first orgasm of the day. Boy was she in need of this. Paige began to play even harder with her breasts, she pulled the bra off and began to tear her nipples which hurt her but made the electric shocks keep going constantly. <br>\r\n<br>\r\nKnowing she would be wet down, Paige first rubbed through her panties. She was really wet today, her juices were pouring out. Pulling her panties off she began to rub her clit. Her moans got louder, but she didn't care anymore if anyone would hear them. All of her siblings were out, and her mother was usually busy downstairs. She began to put her fingers inside, first one, then two at last three. She was on a roll here. Paige turned around and was now in the doggey stand. If only she had a cock within her, that would feel so much better. Any one would be good. Just a few more seconds. She lied on her back again, final having the big one. Pulling her clit a bit she felt the wave hitting her. She felt like she was in heaven. Her body was done, and in one way more than she thought. <br>\r\n<br>\r\nPaige didn't noticed at first, but she felt as light as a feather suddenly. Like she didn't have a care in the world. When she opened her eyes, something was wrong. She was floating in the air. When she looked down, she saw her body lying there sleeping. Paige was in shock, what happened to her? Paige dived a little in front of her body. There she was, just like she was sleeping. Paige knew of ghosts their power, they could take over people's bodies. Her mother's one for example. Paige grinned at the thought of that. <br>\r\n<br>\r\nShe swam through the door  and downstairs. There she saw her mother reading a magazine. Wearing a yellow shirt, with a long skirt.  This was going to be awesome. And without a notice Paige dived right into her mother. <br>\r\n<br>\r\nHow did Paige possess her mother?</span></div></div>",
            "created":1390712400,
            "id":1733411,
            "title":"go indulge into some pleasure. "
        },
        "12331":{
            "choices":[
                "Go and find something else to wear.",
                "Go check out her old body.",
                "Go and do something fun."
            ],
            "content":"<div class=\"\"><div> <span>When Paige woke up she felt a little groggy. Like she had drunk too much at one of Eddy's parties. But instead of a headache, she felt a pleasant feeling inside her.<br>\r\n<br>\r\n<i>Wow, I better try that again. </i>She thought. She then wanted to stand up and go back to her room, but then felt a little dizzy and quickly sat down. Something was odd, but what?<br>\r\n<br>\r\nPaige looked down and her eyes bulged as she saw what she was wearing. A yellow shirt with a white skirt, these clothes were really not her thing. They were way totally not fashionable!  And that wasn't it at all, her hands looked much more wrinkled and she was wearing bracelets and a few rings on her fingers. Her sight was then set on her breasts, they looked they had gotten bigger too. <br>\r\n<br>\r\n\"Nice.\" She said out loud. Wait a minute, that wasn't her voice. What was going on with her? Paige stood up and quickly ran for the living room mirror. In it's reflection she saw Natalie staring back at her, with a confused expression as well. Paige slowly raised her hand and saw Natalie doing it as well. She looked to the right and saw Natalie's reflection doing the same.<br>\r\n<br>\r\n\"Wait that means I'm my mom now.\" Paige said out loud. Paige looked again in the mirror and giggled. \"I don't think it's that much of a downgrade I suppose. Mom doesn't look that bad for her age.\" Paige raised her shirt, so she could admire Natalie pudgy waist but what's more important her pretty breasts. \"Wow mom, you don't do anything with these.\" She mumbled as she weighted them. They were pretty nice. Paige lowered her shirt and thought about what to do. </span></div></div>",
            "created":1400475600,
            "id":1799072,
            "title":"She took her Natalie's body over completely."
        },
        "123311":{
            "choices":[
                "Paige chooses some new underwear. ",
                "Paige picks no new underwear. "
            ],
            "content":"<div class=\"\"><div> <span>Paige thought about it. Her mom wasn't doing anything special today. How about a little shopping for her mom? And perhaps something extra on the side for her. It was the perfect idea. <br>\r\n<br>\r\n\"But first something else to wear. I look way too old wearing something like this.\" Paige commented as she looked at herself in the living room mirror. <br>\r\n<br>\r\nPaige walked upstairs to her room as she noticed how her hips were more noticeable. She could feel them going from left to right. Kind of sexy, but in an odd way. She quickly thought about how much fun it would be at the mall. They were having a sale today, Paige was going to ask her mother, but since she was her mother now. <br>\r\n<br>\r\nPaige entered her mother's bedroom. It was a bit too \"perfect\" as she would describe it. Everything was white in the room, white curtains, sheets, even her closets. Some of her mother's clothes were even a matching white. That was not going to happen today. <br>\r\n<br>\r\nPaige first pulled off her shirt and skirt, standing only in a white bra and panties. Granny panties, the worst. Paige thought as she stretched the material. <br>\r\n<br>\r\nUnderwear wasn't on her to do list, but should she put it on anyway?</span></div></div>",
            "created":1404277200,
            "id":1821499,
            "title":"Go and find something else to wear."
        },
        "1233111":{
            "choices":[
                "Go to Paige's room.",
                "Go to Whitney's room.",
                "Go somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>Paige didn't want to see \"her\" body wearing this kind of underwear, it was just horrible. So Paige slowly lowered her underwear and stepped out of it. Paige was surprised to see a bush surrounding her vagina, seems her mother didn't care that much about it. <br>\r\n<br>\r\nPaige then undid the strap of her bra and let the bra fall on the ground. Paige looked at herself in the mirror, her breasts were indeed bigger than her own. A cup bigger nevertheless, Paige waited the two beauties. \"Wow, mom, you're so hot.\" She thought as she stared at her reflection. She tweaked her nipples a little, she felt herself getting slightly wet from it.<br>\r\n<br>\r\nPaige then knew she had to get some new underwear, but where? She could go to her own room, Paige kept some nice bra's and thongs in her bag. Or she could go to Whitney's room, she was smaller sized but she would have some nice things.</span></div></div>",
            "created":1405227600,
            "id":1826961,
            "title":"Paige chooses some new underwear. "
        },
        "12331111":{
            "choices":[
                "her body knocked out cold.",
                "nothing, her body was gone. ",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Paige her stuff was way better than Whitney's,  Paige almost ran up the stairs but she had to stop as her breasts jiggled too much. \"Doesn't matter.\" She mumbled. \"You girls, will not go anywhere without me.\" Reaching the final steps of the stairs she held her breasts together as she ran again. She opened the door to her room and quickly went to her wardrobe. Paige thanked her mother for putting her underwear in there, this was way much easier to check out than to search her bag. <br>\r\n<br>\r\nPaige found a few thongs she liked and her favorite push-up bra. With the breasts she had now, they would look even bigger than before. <br>\r\n<br>\r\nPaige first grabbed the thong, it was actually more string than fabric but who would care. She raised the string until she felt the string wedging itself inside her ass. A look in the mirror she kept in the room, revealed her mother's ass was even bigger than her. She grabbed her butt cheeks as she kneaded them. <br>\r\n<br>\r\nPaige then put on her black push-up bra. Getting it on was harder than she thought, her breasts were trying to get loose. But when she finally held them in, she saw the beauty of her mother's body. The cleavage the push-up bra made, together with the thong made her mother's body seem more like a porn star than a mother. <br>\r\n<br>\r\nPaige realized she was getting horny, and seriously needed some quality time. She turned around to her bed, where this morning she had her breath taking orgasm. Lying on her bed was...</span></div></div>",
            "created":1405573200,
            "id":1829014,
            "title":"Go to Paige's room."
        },
        "123311111":{
            "choices":[
                "Paige continues with her plan.",
                "Paige continues with dressing up. "
            ],
            "content":"<div class=\"\"><div> <span>Paige was surprised to see her body like that. Her body was lying flat on her back with her legs spread. Paige could see how her juices were staining the sheets. Paige walked over to her body, she felt her wrist and luckily found a pulse. It was a bit faint but it was still there. <br>\r\n<br>\r\nPaige looked her body over, she was looking pretty good from over here. She wondered, maybe it was odd but making out with her old body did have some certain charms to it.</span></div></div>",
            "created":1406437200,
            "id":1834220,
            "title":"her body knocked out cold."
        },
        "1233111111":{
            "choices":[
                "Paige's old body suddenly is being taken over by someone.",
                "Paige hears someone downstairs.",
                "Paige continues getting dressed. "
            ],
            "content":"<div class=\"\"><div> <span>Paige looked down at her old body, the thought of making out with it turned her on. She put her hand in her panties and then began massaging her clit. She needed to get ready for this; it was a once in a lifetime experience. <br>\r\n<br>\r\nPaige pulled off the push-up bra and thong and crawled on the bed towards her lifeless body. Her eyes were still open and Paige quickly closed them before continuing. <br>\r\n<br>\r\n<i>Otherwise it just looks like I would make out with my corpse, gross!</i>She thought.<br>\r\n<br>\r\nPaige grabbed her old head and kissed her former lips. She could taste the cherry lipstick she put on that morning. Paige then put her tongue inside her old body's mouth. She tried to play with her tongue, but her tongue would just lay down lifeless. There was no action in it and it frustrated Paige. <br>\r\n<br>\r\n\"Dammit.\" She cursed. \"Why couldn't you be alive? Then I could really make out.\"<br>\r\n<br>\r\nPaige then looked over at her former breasts. Though her own chest was bigger and prettier, her former breasts still looked nice. Paige took a nipple and sucked on it. She played with her left nipple while sucking the right one. She would always get horny that way. Paige saw them getting bigger. <br>\r\n<br>\r\n<i>Glad that's still normal</i>. Paige then thought of something. Paige moved her breasts on top of her old body's breasts and then began rubbing them. This felt good, her old breasts were soft and squishy, just how she liked them. <br>\r\n<br>\r\n\"I wish this had happened earlier, then I could do this a lot more. Mom, you're amazing.\" Paige let out a moan. But still it wasn't enough to even give her an orgasm, she only felt herself getting a little wet. <br>\r\n<br>\r\nPaige then turned her attention to her old vagina. It was getting wet too. Paige put her nose in front of it, the smell was really sweet. She then began to lick her vagina like that. Paige her thoughts were only on getting an orgasm as fast as she could. With her other hand she began to finger herself. Her old body was just lying still, only for getting a little wetter than before.<br>\r\n<br>\r\nIt didn't take Paige long to get herself an orgasm. The feelings she received were intense as she began to squeeze her breasts to further stimulate the shocks coursing through her body. <br>\r\n<br>\r\nShe wasn't done yet, there was one thing she wanted to do. With a lot of effort she managed to put her vagina and that of her old body against each other. Paige then began to rub. At first she didn't feel anything, but then it began. She felt herself getting hornier, her movements were getting faster and so did her breathing. <br>\r\n<br>\r\n\"This is amazing.\" Paige screamed. <br>\r\n<br>\r\nWhen she had her orgasm it was the biggest one she ever had. She could feel her juices pour into her old body. It was a magic moment, one she would remember forever.<br>\r\n<br>\r\nWhat happened next? </span></div></div>",
            "created":1411102800,
            "id":1858885,
            "title":"Paige continues with her plan."
        },
        "12331111111":{
            "choices":[
                "It's your mother Natalie.",
                "It's someone else."
            ],
            "content":"<div class=\"\"><div> <span>All of a sudden Paige's old body moved upwards just like something poured inside of it. Paige just looked as her old body's eyes just opened up and fluttered. Paige was  in shock as she was wondering who was inside her body.<br>\r\n<br>\r\n\"Who? Who are you?\" Paige asked curious.</span></div></div>",
            "created":1455914700,
            "id":2106463,
            "title":"Paige's old body suddenly is being taken ov..."
        },
        "12333":{
            "choices":[
                "Paige does something innocent again.",
                "Paige goes a little further. "
            ],
            "content":"<div class=\"\"><div> <span>When Paige woke up, she felt a bit heavy in the head. She had dreamed she had such a masturbation session she was a ghost and took over her mother's body. What a weird dream. When she opened her eyes, she felt something was wrong. She couldn't move anymore, she was stuck somehow. But then a hand moved in front of her. And her mouth opened: \"What was that?\" She heard herself say. She moved up a bit from the couch and then sat back. Looking down Paige noticed the same outfit her mother had been wearing. Was she her mother? But why couldn't she do anything?<br>\r\n<br>\r\nThis sucked, totally. Paige couldn't do a thing, she had to look at what her mother was reading, her eyes couldn't look at anything else. Trying to remain calm, Paige began reading the article. It was terrible. This really is the worst.<br>\r\n<br>\r\nSomehow her mother had the same thought, as she went to the next page. Wait, did she do that? Paige tried again. She thought of to scratch her nose. Natalie didn't react to it. Then Paige thought of not giving an explicit command, but to give the cause of the action. She thought how her nose itched. And like that, Natalie scratched her nose a bit as she continued reading.<br>\r\n<br>\r\nThis was amazing, Paige thought.<br>\r\n<br>\r\nMeanwhile Natalie suddenly felt herself getting happier suddenly, she didn't know where it came from.<br>\r\n<br>\r\n</span></div></div>",
            "created":1390885200,
            "id":1734437,
            "title":"Paige acts like her mother's subconscious."
        },
        "124":{
            "author_id":"thedude2",
            "author_name":"Inta Thabody",
            "choices":[
                "Janice the paranormal enthusiast is at the door.",
                "Bob feels an urge to call one of Natalie's friends.",
                "Get familiar with this body and its curves."
            ],
            "content":"<div class=\"\"><div> <span>Bob maneuvered his blue work van through the quiet streets of the neighborhood toward the house of his next client.  The rolling mass of metal and rust rolled unsteadily on as gears grinded and big metal tools rattled about in the back of the old beat-up van.  Hitting the occasional pothole brought strange noises from the metal monster and, without fail, a mighty jiggle from Bob’s potbelly as his rotund form strained against the greasy blue work suit.  Bob had been doing this job for years and had gotten fairly good at it, and he was even able to make decent money at his work, but the recent divorce from his wife had rattled his finances and forced him to postpone the purchase of a new vehicle, which he really needed.<br>\r\n<br>\r\n<br>\r\nThe van rolled to a grinding stop in a driveway close to Bob’s own house.  He reached down, grabbed a rag, and wiped his hands, but of course this did little to make him presentable.  He wiped the grease and sweat from his face, only a slight improvement on his image.  He gazed into the rear view mirror at himself, almost like a kid planning to go out on a big date.  Looking back at him was his 43-year-old face, one that had aged beyond its years because of the physically demanding nature of his job.  His smile was wide, but his hair had thinned recently.  He tried to cover his balding with a comb-over, which made it more obvious.  He smiled at himself in the mirror, gazing upon his pudgy, unshaven face and double chin.<br>\r\n<br>\r\n<br>\r\nBob opened the door and ungracefully exited the van.  He began to walk slowly to the door, each step labored because of his weight.  He always carried a bag of M&amp;M’s; he could hear them rattling around in his pocket, and, without even thinking, he would reach down every minute or two and grab a handful with his left hand.  That contributed to his weight problem, of course.  His right hand carried a rusty orange tool box.  <br>\r\n<br>\r\n<br>\r\nBob reached the porch and knocked on the door.  He tensed up as he waited for a woman he had harbored a crush on for years—Natalie Redford.  She was a beautiful woman of 38, with hair as red as fire hanging down past her shoulders.  She is about 5 feet 8 inches tall, a good 5 inches taller than Bob.  Natalie’s body was the stuff of legend to him.  She’d gained some weight recently, what with her nearing 40 and having carried 3 children, but this had served to make her all the more curvy and voluptuous to the hapless plumber.  She had fair skin and a set of breasts so large they jiggled with every step and threatened to burst through her shirt.  She had a slight pouch in her belly that was downright cute and a lovely bit of thickness in her arms and legs.  She had a narrow waist that flared out into a set of wide, child-bearing hips and a lovely ass.  <br>\r\n<br>\r\nBob just finished munching nervously on a handful of M&amp;M’s as the door opened.  Bob smiled as the beautiful Natalie received him warmly.  “Hey, Bob!” she said, “How have you been?” as she motioned for him to come inside the house.  She was clad today in a figure-hugging green skirt that matched her beautiful eyes.  Covering her top half was a thin white blouse against which her breasts strained mightily.  Bob could barely tear his eyes away from her long enough to say “Oh not bad, Natalie; how are you?”<br>\r\n<br>\r\n“Well I've had some bad luck lately, Bob,” she explained, telling him to follow her upstairs.  Bob waddled after her as he stared at the sway of her hips as she climbed the stairs.  “See,” she continued, “we’ve got this noise that we hear when we turn on the warm water; it’s like the whole house is groaning.”  The two reached the top of the steps, and Natalie took Bob into the bathroom nearby.  She reached down with her dainty hands and turned the left faucet, and suddenly the plumbing seemed to groan or roar or…whatever the word was…it wasn’t something plumbing should do.  “That is a problem, Natilie,” Bob declared good-naturedly, “have you called anybody else about it?”  “No, Bob,” she said, “you’re the go-to guy around here for plumbing” she said.<br>\r\n<br>\r\n<br>\r\nBob smiled as he slowly bent down and prepared to get on his back to gaze under the sink.  “The kids are at school, so I’ll be here if you need anything.  I took the day off from my receptionist job.  I’ll leave you to your work, Bob, and I’ll be downstairs doing some yoga,” Natalie said, “I’ve got these few Christmas pounds I’m still trying to get rid of,” she said with a slight laugh as she patted her belly.  Bob quietly hoped Natalie stayed just as she was.  “Natalie, I’ve got weight hanging on from about 1988; if you figure out how to get rid of it, you let me know,” he declared as he motioned to his own gut.  “Will do, Bob,” Natalie declared with a laugh as she headed down the stairs.  Bob watched her curvaceous form disappear down the stairs longingly…and munched on some more M&amp;M’s.<br>\r\n<br>\r\n<br>\r\n<br>\r\nAn hour had rolled by, and sweat rolled down Bob’s rough and whiskered face.  “Still can’t find the problem,” he said to himself as he exited the space under the sink.  Bob began to slowly make his way, his joints stiff, toward the door of the bathroom because he needed another tool down in his van.  As he stepped slowly toward the door, Bob’s feet suddenly flew out from under him, going up where his head should be as his rotund and overweight body thumped loudly on the slippery tile floor.  Bob hit his head hard.<br>\r\n<br>\r\n<br>\r\nSuddenly, Bob’s eyes shot open.  Instinctively, his hand shot to his head as he rubbed it.  “Dammit,” he said, “I gotta be more careful…this ol’ body can’t take much more of thi…” Bob stopped himself.  He realized his head didn’t hurt at all.  It should have been throbbing, but there wasn’t any pain.  Bob looked around confused.  Suddenly, he beheld something on the floor—his own unconscious body!  “Oh my god!” Bob said as he leaned over his own sweat-covered body as it lay in a heap on the floor.  Bob staggered back in shock.  “What the hell happened to me?” he asked himself.  After a few seconds, he inched forward, seeing his belly move up and down slightly…apparently his body was still breathing--alive.  A dozen or so M&amp;M’s were spilled on the floor.  <br>\r\n<br>\r\n<br>\r\nBob slowly stepped over his body as he tried to grasp the situation.  He looked in the mirror and got another start when he saw no one looking back at him.  “What’s wrong with me?!” he said, panicked.  <br>\r\n<br>\r\n<br>\r\nBob slowly and uneasily made his way down the stairs.  “Natalie?” he called out, “you’re not going to believe this…I don’t know what the hell’s happening.”  No answer.  He looked about the house until he heard the TV, up quite loud, coming from the other room.  “Natalie?!” he called out as he moved toward the sound.  He found Natalie in her living room in a wonderfully tight-fitting spandex suit, her ass in the air as she assumed various positions, imitating the movements of the people on the screen.  “Natalie,” Bob called.  Nothing.  “Natalie, help me,” Bob demanded as he ran over between her and the TV.  Still nothing; she looked right through him.  Bob still found himself a bit distracted by her heaving cleavage.  <br>\r\n<br>\r\nNatalie stood up, breathing heavily, apparently wanting a break from her work-out.  Sweat rolled down her beautiful body.  She sat down gracefully in a chair.  Bob, beginning to panic, decided to try once more.  He went over and carefully knelt down right in front of the beautiful woman.  “Natalie, you gotta help me.  PLEASE!” he begged.  Ignoring Bob entirely, Natalie looked right past him and flipped the channel on the TV.  <br>\r\n<br>\r\nBob was despondent.  Natalie laughed as she gazed at the television.  “I’m in my Mom’s body,” came a voice from the TV.  “I loved Freaky Friday when I was a kid,” Natalie said to herself.  Bob, fearing he would never recover, began to stand up slowly.  Suddenly, though, he lost his balance.  “Shit!” Bob screamed as he fell in the direction of the oblivious Natalie as she sat on the couch.  The strangest thing happened; Bob did not crash into Natalie or hurt her as he fell.  Instead, his form fell into Natlalie’s body, merging with it and forcing its way inside.  <br>\r\n<br>\r\n<br>\r\nNatalie’s sweaty body convulsed and shook for a few seconds.  Her breasts jiggled, and her belly shuddered slightly.  The woman groaned and grunted momentarily; it was as if something was inside Natalie, and her own spirit and mind were working to force it out.  After about five seconds, all that stopped.  <br>\r\n<br>\r\n<br>\r\nBob suddenly felt that he was sitting again.  He opened his eyes slowly and cautiously.  His eyes darted about the room as he looked for Natalie.  “Where did she—“ Bob stopped upon hearing his voice.  His hand shot to his mouth, as the voice seemed not to be his.  He could see bits of red hair hanging down into his field of vision.  Looking at his hands, Bob noted that they were dainty and fair-skinned, with jewelry adorning the fingers.  Bob put his hands on the arms of the chair and very slowly stood himself up.  He struggled to do so, as he looked down and saw, hanging from his chest and barely contained by a black spandex top, a wonderful, sweaty, and heaving pair of breasts that rose and fell with every labored breath.  “Oh my god,” Bob said as he beheld them and slowly moved toward a nearby mirror.  His hips swayed as he walked.  He felt that hair bobbing around the back of his neck.<br>\r\n<br>\r\n<br>\r\nBob looked in the mirror and beheld the body of Natalie Redford, the curvy, beautiful woman he’d loved for years.  Her face was a strange combination of blank and chocked as Bob gazed upon his new body.  He reached up and cupped the breasts he had admired for so long, moaning as he did.  He slapped himself on his full and motherly ass.  “An interesting day at work I guess,” Bob mused to himself in his host’s shocked voice and stared into the mirror.  <br>\r\n<br>\r\n1)\tBob hears a knock at the door, and it’s Janice (the lady from down the street who is obsessed with the paranormal).<br>\r\n2)\tBob feels a slight urge to call his friend Amy (who Bob doesn’t know, but Natalie does)<br>\r\n3)\tBob can’t resist exploring his body.           <br>\r\n</span></div></div>",
            "created":1398574800,
            "id":1787900,
            "title":"Bob"
        },
        "13":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Natalie",
                "Whitney",
                "Paige",
                "Rachel",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Who will possess Nick.<br>\r\n<br>\r\n#1: Natalie is his 38 year old single mother. She is a housewife with a part time job living mostly off of her deceased husbands wealth and life insurance. She has two daughters and one son. She is slightly overweight however she clearly works out. She has fiery red hair and green eyes, DD cup breasts, wide hips, and fairly normal length legs with thicker than average for her height thighs.<br>\r\n<br>\r\n#2: Whitney a 16 year old high school student and his sister. She's still growing but is clearly following in her mother's genetic foot-steps. A tad short for her age, at 5'2'' but she is still likely to grow taller as her mother and father were taller. She has slightly darker red hair than her mother but similar green eyes, C cup breasts wide hips and fairly stout legs.<br>\r\n<br>\r\n#3: Paige a 21 year old college student and his other sister. She is the spitting image of her mother with the same hair, and body shape, however her breasts are D cups. She also has heterochromia (two different color eyes) one green and the other blue.<br>\r\n<br>\r\n#4: Rachel is a 20 years old junior in college. She is a fairly attractive girl with red hair C cup breasts. She is a shy girl and still a virgin.</span></div></div>",
            "created":1382677200,
            "id":1684304,
            "title":"Nick"
        },
        "131":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Over to Natalie",
                "Continue with Nick",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>I had just gotten rid of my mother, she had brought me to school and was helping me move into my dorm. I quickly put stuff away wanting to get out in the world. I knew college would be my last real chance to reinvent myself. I didn't want to become a jock or anything, and I had a few hobbies I was going to keep doing, but I swore to myself I would go to parties and what not.<br>\r\n<br>\r\nI knew there would be some fairly major parties over the next week with school starting, so I put on my coolest looking clothes and headed out to find some.</span></div></div>",
            "created":1382677200,
            "id":1684307,
            "title":"Natalie"
        },
        "1311":{
            "author_id":"hyral",
            "author_name":"Hyral",
            "choices":[
                "Natalie arrives home and looks at the scroll",
                "Back to Nick",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Natalie was heading back from sending her son off to college when she saw a cool little antique shop. Natalie was quite the antique collector, she would buy items fix em up and sell them on ebay for a profit. Although she also had a part-time job she didn't really need to her widow's life insurance would keep her and her family well-off for the rest of their lives, but that didn't mean she couldn't have fun making more money. They certainly weren't rich either, but all three of her children would be able to get educations with their trusts, she had enough to retire on, and the house was paid off. Other than that she paid for the day to day things with her job, her hobby, and very safe investments.<br>\r\n<br>\r\nShe got into the store and wasn't seeing much of interest. The old lady shop owner spotted her and knew immediately what Natalie needed. \"Ah, I think I know exactly what you are looking for.\" The old lady said.<br>\r\n<br>\r\n\"Do you?\" Natalie was skeptical she really hadn't seen anything at all so far.<br>\r\n<br>\r\nThe old lady went behind the desk and pulled out a golden scroll. Natalie looked at the scroll as the air seemed to shimmer around it. \"I think you'll find that this is what you need.\"<br>\r\n<br>\r\n\"...yes...I...yes...\" Natalie murmured as she stared deeply at the scroll. She slowly walked towards the desk and register and dumbly fumbled through her purse until she revealed a credit card. The old lady took the card and swipe it through. She then handed the scroll to Natalie whom without a word walked slowly out of the shop.<br>\r\n<br>\r\n\"Good doing business with you.\" The old lady smiled wickedly.<br>\r\n<br>\r\nThe next thing Natalie knew she was in her card driving home, she looked at the clock and noticed she had been on the road for over an hour already, and was nearly home.</span></div></div>",
            "created":1382677200,
            "id":1684309,
            "title":"Over to Natalie"
        },
        "13111":{
            "author_id":"bob365",
            "author_name":"Bob365",
            "choices":[
                "Back to Nick"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Natalie looks at the scroll and it reads: Write the names who you would like to connect to more. Missing her son, she wrote “Nick”</span></div></span></div>",
            "created":1507185120,
            "id":2396629,
            "title":"Natalie arrives home and looks at the scroll"
        },
        "131111":{
            "author_id":"bob365",
            "author_name":"Bob365",
            "choices":[
                "Nick slowly becomes his mother"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will add points if plot of title below followed!!!</span></div></span></div>",
            "created":1509323280,
            "id":2408686,
            "title":"Back to Nick"
        },
        "1311111":{
            "author_id":"gwarner",
            "author_name":"Onlyonekey",
            "choices":[
                "He becomes her at his current age",
                "He grows up into his 30's",
                "Something else happens",
                "Something else happens"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, so what happens specifically?</span></div></span></div>",
            "created":1561510860,
            "id":2678569,
            "title":"Nick slowly becomes his mother"
        },
        "13111113":{
            "author_id":"bob365",
            "author_name":"Bob365",
            "choices":[
                "Continue this"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Nick turns into her at her exact current age, and she is at first unaware of the changes of her son.</span></div></span></div>",
            "created":1561640940,
            "id":2679332,
            "title":"Something else happens"
        },
        "135":{
            "author_id":"norman33",
            "author_name":"Norman33",
            "choices":[
                "Sarah, the nerdy girl with a great body down the hall",
                "Candi, the college bicycle as in everyone gets to ride, slut",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>College was supposed to be a chance to reinvent himself, but Nick has found that no matter where you go, there you are. He can't seem to get over his insecurities when it comes to women. He swears they can smell the geek on him despite spending every penny he could on the latest fashions. It wasn't until he found that old book of magic in the college library that he felt there was help. He searched through the book looking for love spells, but the side effects warned by the book were to many to accept. Nick then found something with promise. It was a possession spell. \"What better way to understand women than from the inside\", Nick thinks to himself. Nick gathers the ingredients, prepares the potion, and then goes over candidates. </span></div></div>",
            "created":1477684440,
            "id":2229630,
            "title":"Someone else"
        },
        "15":{
            "author_id":"blavcleo",
            "author_name":"Mr.nice",
            "choices":[
                "1",
                "2",
                "3",
                "4",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>Now people this is manly women here but there's a man to.<br>\r\n<br>\r\n1.paige:http://fhg.1by-day.com/PROMO/content/1bd/pics/6865/fulm/001.jpg)marr ied,one kids,stay at home house wife.<br>\r\n<br>\r\n2.natasha:http://ddfcash.com/PROMO/content/ddfbusty/pics/6656/fulm/001.jpg)d ivorced,on kids,job accountant.<br>\r\n<br>\r\n3.kate:http://images.ancdn.com/galleries/output/mfhm/siennajohnny/watermark/ vertical.jpg)single on kids.also a striper.<br>\r\n<br>\r\n4.kelly:http://images.nubiles.net/galleries2/natasha_malkova/nude-babe/01.jp g)daughter of Paige,personality lazy tomboy.<br>\r\n<br>\r\n5.tom:age:13<br>\r\nDetail:dark brown hair male,skinny build also dark skin.<br>\r\n<br>\r\nPersonality:shy,hates outdoors really smart.</span></div></div>",
            "created":1398661200,
            "id":1788000,
            "title":"More choices"
        },
        "151":{
            "author_id":"aridwd",
            "author_name":"AridWD",
            "choices":[
                "Jake",
                "Charles.",
                "Alternate lifestyles/personalities."
            ],
            "content":"<div class=\"\"><div> <span>Paige is a 35 year old woman who is mostly a stay-at-home mother with a working husband named Charles and a 18 year-old son named Jake who is in his last year of high school. To state that this woman will have her life changed is quite the understatement.<br>\r\n<br>\r\nAs a 35 year old mother, she doesn't let herself be lazy with her health, taking daily jogs in the morning and sometimes with her husband in the evening. Compared to most mothers, she's definitely a MILF by other standards. Of course, even Jake had to admit that and is happy to have such a beautiful mother.<br>\r\n<br>\r\nThat said, she can come quite nagging sometimes and highly expects Jake to pick up after himself. Unfortunately, Jake is a lot looser than his mother wants, so he can't always please her. It can be said that her insistence on getting things done as soon as possible annoys her son greatly. He has always taken up his life easily and overall, while he studies, he pretty much is average in comparison to some of the smarter students in his class. Paige, of course, only wants the best to be shown in her son.<br>\r\n<br>\r\nOn the other hand, Charles is a 38 year old father who is a little overweight, his job taking priority over his physical health. He takes much joy in his wife Paige, enjoying the sex they have every weekend when Jake is out hanging with his friends. Like Jake though, he feels she is being a little too strict on their only son. Yet, since he's working, he can't be critical to say he has a major part in his son's life compared to Paige.<br>\r\n<br>\r\nWho will first possess Paige?</span></div></div>",
            "created":1509327060,
            "id":2408707,
            "title":"Paige"
        },
        "154":{
            "author_id":"xhion",
            "author_name":"Xhion",
            "choices":[
                "Paige",
                "Tiffany",
                "Kevin"
            ],
            "content":"<div class=\"\"><div> <span>Kelly is the one who will be possessed; now chose a character to take control of her:<br>\r\n<br>\r\n#1: Her mother Paige, a 33 years old woman, she's married but it's quite unhappy about her actual life style; resentful against his husband and her lost youth, she's always trying to control Kelly and change her attitudes and style in order to avoid becoming like her.<br>\r\n<br>\r\n#2: Tiffany is 18 years old and the head cheerleader, she's a total bitch, always bulling Kelly's friends; Her dream is to become a model like her mother and so she always dresses in fashion.<br>\r\n<br>\r\n#3: Kevin a 22 years old Goth, he works on a Boutique and has a crush on Sara, Kelly's BF.</span></div></div>",
            "created":1400216400,
            "id":1797170,
            "title":"Kelly, the lazy tomboy"
        },
        "1541":{
            "choices":[
                "the necklaces.",
                "the ring.",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey mom.\" Kelly said as she entered the living room. Kelly just came back from another day at school. It was Friday, so she was in a better mood than the rest of the days. <br>\r\n<br>\r\nPaige on the other hand was sulking as she was lying on the couch watching another of her soap opera's. It was another dull day, just like all of them. She went to the pedicure this morning to get her nails done with a couple of friends and this afternoon she took it easy. But it was boring, like all other days. <br>\r\n<br>\r\n\"Hey, how was it?\" Paige asked as she was still watching her soap. <br>\r\n<br>\r\n\"It was okay, a Jock at school asked me out though, I turned him down.\" <br>\r\n<br>\r\n\"Wait what? You turned him down, why?\" Paige asked her daughter, she couldn't believe what she just heard. <br>\r\n<br>\r\n\"Yeah mom, he looks great and all, but all muscles and no brains. Do you know what he said when I asked him what our future perspectives would be, huh? He said I would stay at home taking care of our kids, while he would go and be a major football player.\"<br>\r\n<br>\r\n\"And could he be a big player?\" Paige always liked the jock types, those thick and big muscles she loved it. And being the mother-in-law of a major football player could have it's benefits. Perhaps she could go look after him, if her daughter would be away. Paige smiled at that thought.<br>\r\n<br>\r\n\"I guess so, there are a couple of universities interested in him. But that's not the point mom, he just expects me to go sit at home doing nothing while he's out there. That's so old fashion.\"<br>\r\n<br>\r\n\"Hey, watch it young lady, me and your father have done the same thing. And look at how happy I am.\" Paige showed off her pearly whites. <br>\r\n<br>\r\n\"Yeah mom, while dad is away for months you're sitting here alone with me. That's some live.\" Kelly rolled her eyes. \"And besides that's not even the worst that jerk said to me. He even told me to change the way I dress.\"<br>\r\n<i><br>\r\nThat's something we both agree on.</i> Paige thought. For years she tried to change the way Kelly dressed. She would suggest skirts and dresses, but the more Paige pushed Kelly, the more she rejected it. In the end she dropped it, though she couldn't resist making comment once in a while. Kelly had gone to school wearing jeans, white socks, sneakers, and a pink tank top. It could be so much better.<br>\r\n<br>\r\n\"And that's something I will never change mom, not even for a guy.\" \"Well I'm going to be upstairs.\" Kelly shook her head, letting her long and curly hair bounce on her neck. Paige was always a little jealous of her hair, well actually she was jealous of everything Kelly had. Kelly had such a tight and pretty body, Paige couldn't believe she was still a virgin. When she was Kelly's age, she was already pregnant of Kelly. It was an accident of course, she didn't want to be pregnant at that age. She wanted to do so much more, she wanted to get in college, hang out at party's every night, and have sex all day long. Instead the man who would become her husband, stayed with her, promised to take care of her and their child. She accepted it of course, but she always resented that decision. If he was like one of those other jerks she knew from that time, he wouldn't have looked back at her and she would have given up her child and get on with her life. Now she was a house-wife, a loaded one, but still, she never could enjoy her youth as much as she wanted to. <br>\r\n<br>\r\nBut that wouldn't be long, Paige received a gift this morning from an old friend. The friend promised her it would help fulfill her deepest desire. To be young once more. Paige grabbed ... from the table.</span></div></div>",
            "created":1411534800,
            "id":1861297,
            "title":"Paige"
        },
        "155":{
            "author_id":"xhion",
            "author_name":"Xhion",
            "choices":[
                "Alice",
                "James",
                "More."
            ],
            "content":"<div class=\"\"><div> <span>These will be the characters that are going to be possessed in the story:<br>\r\n<br>\r\n#1: Alice is a 18 years old only child, she comes from a wealthy family and its the perfect girl whit blond hair and blue eyes; her father is always working and her mother spends her time doing charity and having tea whit her friends.<br>\r\n<br>\r\n#2: James is a 30 years old unemployed and lazy guy, he lives whit his mother and spend all his time in the internet watching porn; he loves anime and magic.</span></div></div>",
            "created":1400216400,
            "id":1797174,
            "title":"More options"
        },
        "1551":{
            "author_id":"xhion",
            "author_name":"Xhion",
            "choices":[
                "Katherine",
                "Jo",
                "Dean"
            ],
            "content":"<div class=\"\"><div> <span>Alice is the one who will be possessed; now chose a character to take control of her.<br>\r\n<br>\r\n#1: Katherine a 17 years old girl who loves books and fiction stories, she's kind of a nerd, often ignored by guys. Both parents are kind of hippies and have a handsome older brother that is very popular whit the girls, he's always watching after his little sister \"Kat\".<br>\r\n<br>\r\n#2: Jo: A 34 nymphomaniac whore, her dream is to build a brothel whit beautiful girls or a obedience school (or both), she's quite skilled into persuade people into her schemes.<br>\r\n<br>\r\n#3: Dean, he's a 46 years old man, he's kind of a masochist and sick guy, he likes tattoos, piercings, and all types of sex; from anal to necrophilia.</span></div></div>",
            "created":1400216400,
            "id":1797189,
            "title":"Alice"
        },
        "15512":{
            "choices":[
                "Jo takes over Alice's body and Alice takes over Jo's body.",
                "Jo and Alice share Alice's body.",
                "Jo takes over Anna completely, expulsing Anna's soul from her body."
            ],
            "content":"<div class=\"\"><div> <span>\"Are we almost ready yet Jo? I really can't wait for it.\" Whining Betty asked as she jumped up and down in her circle. <br>\r\n<br>\r\n\"Almost, just a little more dust over here.\" Jo said as she read the lines of the spell once more. She knew she had to do this right, this was her only chance, one little slip and everything could turn out different.\"<br>\r\n<br>\r\nJo looked around the room, it was small, very small with only a bed inside it and nothing else. This was the room she worked in, customers coming in and out every day. All satisfied of course. But Jo dreamed of something much more. She always wanted to own her very own brothel with the most beautiful girls around. Girls that would pleasure and do anything for the client, just as she always did for her own clients. Jo looked down as she saw her naked figure, she didn't look that bad. Her D-cup breasts may be fake, and her butt as well but she always had enough clients. Problem was that she was addicted to having sex, a few hours without it and she would go crazy. And that was the whole reason she was standing here with Whining Betty. With her own body Jo knew she could never build up her own brothel, she would want to keep all of the customers to herself. But if she had someone else their body, then it would be something completely different. That's why she turned to Whining Betty, Betty was still in her twenties, had a tight body and was an all-natural beauty. <br>\r\n<br>\r\nOf course when Jo proposed her scheme to Betty she didn't agree to it, but when she heard about the amount of clients she would receive she agreed with Jo. And that's how Jo always managed to persuade people into her schemes, a natural charm. <br>\r\n<br>\r\nJo and Betty were standing in two magic circles, Jo only needed to pronounce the magic words and they would switch bodies. With Jo inside Betty's young body and leaving Betty in Jo's sex crazed body. <br>\r\n<br>\r\nAs Jo began to recite the ancient spell, a group of girls were gathering in front of the room outside. <br>\r\n<br>\r\n\"Must I really do this?\" Alice asked the girls of the group.<br>\r\n<br>\r\n\"Of course, we all did this.\" One of the girls said. <br>\r\n<br>\r\n\"It's not dangerous, you just have to go inside and tell her to do you.\" Another girl said.<br>\r\n<br>\r\n\"Do what exactly?\" Alice asked confused.<br>\r\n<br>\r\n\"Something funny, now go in.\" Another girl said giggling. They all pushed Alice closer to the door until she walked herself to the door. Alice took one last look at the group of girls. They were a couple of older girls. Alice didn't have many friends, so when they asked her to join their group she jumped to the chance, but before she could join them she had to their initiation ritual. She hoped it wasn't scary inside. <br>\r\n<br>\r\nWhen Alice opened the door, the other girls quickly ran away. They would never allow Alice to join their club, they only did it to fool her. Laughing uncontrollably they ran out of the street. Just imagining how Alice must look like when she would find out what door she entered.<br>\r\n<br>\r\nJo was finally ready with the spell and she could feel the circle working already. \"Yes, yes I can feel it. Now honey, just don't move and stay calm.\" Jo told Betty. Jo slowly felt her spirit detaching from her body as she was floating in the air. It really worked, the spell worked! She had to thank that wizard for giving her that spell and those medallions. She got it for only a blowjob, if she knew it would work she wouldn't have mind having him inside her for all that matter. Jo felt her spirit being drawn to Betty standing in the circle, wearing the other medallion. Jo had been wearing the same medallion, when her soul would enter Betty's body, Betty's soul would come out and be drawn into Jo's body. Betty's body was ready for it, Betty drank a special mixture that needed to be prepared to allow the spirit to pass inside her. Jo could swear she had tasted it before, but could not remember what. <br>\r\n<br>\r\nBut then it happened. The door suddenly opened and the force of it knocked Betty down, making her lose the medallion in the process. Jo could only watch as the medallion flew into the air and then by chance landed right on the girl who came inside the room. \"No, I need to go back. Stop! Take it off! Jo said as she waved her arms around trying to prevent crashing into the girl. Alice however could not move as she saw the ghost fly straight for her, she tried to cover her face. Jo tried to move herself away, but it was no use. Her soul was being drawn to the girl's body. She then felt herself being pushed inside the girl's body, the girl looking shocked.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1435208400,
            "id":1998631,
            "title":"Jo"
        }
    },
    "info":{
        "author_id":"hyral",
        "author_name":"Hyral",
        "brief_description":"Various stories of possession and the corrupting transformations they cause.",
        "created":1374891540,
        "description":"<td align=\"left\" class=\"norm\">Each story begins with two key choices, #1 possessed character, #2 possessing character. The first character you chose will be the possessed character, and the second will be the possessing character, after you have made that choice it's off to the races. Once the story starts you can go in any directions and start with any character, however the story should be moving towards the initial relationship chosen.<br>\r\n<br>\r\nThe way of possessing is up to you, go crazy. There are no restrictions on subject, it is rated XGC for a reason. Sex, incest, gay/lesbian, etc. Transformations are a secondary category if you wish to add them to your story it is encouraged, but don't feel that it must be put into the story.</td>",
        "id":1944869,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1579969980,
        "modified":1579969980,
        "pretty_title":"Possession and Transformation"
    }
}