{
    "chapters":{
        "1":{
            "author_id":"crispy112",
            "author_name":"Crispy",
            "choices":[
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span>\tToday started like any other day. The sun had risen to illuminate a cloudless sky, save of course for the Pegasi city of Cloudsdale, which was visible in the distance. Ponies of all shapes and sizes bustled about the small town of Ponyville, going about their daily business. Today was different, however. Today you were going to actually do something.<br>\r\n<br>\r\n\tYou had a new friend. Twilight Sparkle, a young unicorn from Canterlot. Before yesterday, you hadn't had much contact with the mulberry mare, but you wish you had. She was beautiful and talented, and had gained quite the reputation during her short time in town. She was well-known for her adept understanding of magic, it having earned her a renowned status on multiple occasions. Yes, she was practically famous. And you were her new acquaintance.<br>\r\n<br>\r\n\tWhen you met yesterday, she had invited you to visit her for lunch, to talk and learn more about each other. And this is what you were going to do today.<br>\r\n<br>\r\n\tYou continue to trot down the same dirt road you have been for about five minutes, making your way to Ponyville's library. Finally, you halt before a large tree, probably the largest one in town. You easily recognize it as the library, as it appears to be more than just a tree, but a building. Yes, this is surely it. You approach the thick trunk of the tree, a wooden, double-segmented door greeting you. You knock on it without knowing why. It is a public library, after all.<br>\r\n<br>\r\n\tA distant \"Come in!\" comes as a response from within, and you enter.</span></div></div>",
            "created":1350231900,
            "id":1446571,
            "title":"The Beginning"
        },
        "11":{
            "author_id":"crispy112",
            "author_name":"Crispy",
            "choices":[
                "\"Sure!\"",
                "\"Sorry, you'll have to find somepony else, Twilight.\""
            ],
            "content":"<div class=\"\"><div> <span>You step into the hollow tree's interior, slowly looking about the room as you walk forward. You see a tremendous amount of books and scrolls, stacked onto shelves that appear to be carved into the elaborately-decorated wooden walls. The room is primarily circular, with a ringed wooden floor, as though the entire interior had been simply carved out of the tree. At the center of the room, there's a stump-table with a wooden bust of a stallion you don't recognize resting atop it.<br>\r\n<br>\r\nYou spend an abnormal amount of time examining your surroundings before actually laying eyes on the pony you're here to see. The mare is on the opposite side of the room, standing at a podium composed of what appears to be a tree stump. Her head is buried in a large book, her attention focused on it alone.<br>\r\n<br>\r\nYou decide to get her attention. You pipe in modestly. \"Ahem. Excuse me, Miss Sparkle?\"<br>\r\n<br>\r\n\"Huh? Who is it?\" Her ears perk up as she yanks herself from the book. She looks around the room frantically before laying her eyes on you, putting on a relieved expression. \"Oh, it's you! I'll be honest, I almost forgot you were coming today.\"<br>\r\n<br>\r\n\"And I guess you forgot that you told me to come in a moment ago, too, huh?\" you reply jokingly.<br>\r\n<br>\r\nTwilight chuckles nervously. \"Heheh, I'm sorry. There's this really old book that I just dug up from a pile in the basement, and I guess I really got into it.\"<br>\r\n<br>\r\nYou chuckle as well. \"Oh, that's alright. You mentioned lunch yesterday. What have you got planned?\"<br>\r\n<br>\r\nTwilight quickly explains her plans for the afternoon to you, and the two of you begin. The afternoon goes as-planned. The two of you have lunch and converse over the course of an hour or two. You didn't need her to tell you that she was a well-organized pony, as she obviously put a good amount of time into today's itinerary. When all was said and done, you both returned to the library.<br>\r\n<br>\r\n\"Thanks for inviting me to spend the afternoon with you, Twilight. I had a great time today!\" you say to your new friend.<br>\r\n<br>\r\nShe replies. \"Oh, it’s my pleasure! I love meeting and learning about new ponies. I hope we can do this again soon!\"<br>\r\n<br>\r\nAnd so you begin to take your leave. However, as you exit, you suddenly feel compelled to turn around and ask about that old book Twilight mentioned. You turn around, laying your gaze upon her. She's already buried her head in the book again.<br>\r\n<br>\r\nYou pipe up, just as modestly as you did when you first set foot into her abode. \"Uh, Miss Sparkle?\"<br>\r\n<br>\r\nHer ears perk up, just as they did earlier. She turns to face you with a somewhat annoyed expression, waiting for what you have to say.<br>\r\n<br>\r\n\"You're really into that book. May I ask, what's so interesting about it?\"<br>\r\n<br>\r\nTwilight's expression lightens up a little. \"What's interesting about it? I'm just trying to figure out what language it's in! It looks like a book of spells to me, but I can't be sure.\"<br>\r\n<br>\r\n\"If you think they look like spells, you should try to cast a few.\" you say.<br>\r\n<br>\r\nShe ponders this for a moment. \"Well, I guess you’re right. I don't really have to understand them to cast them, but I don't know what any of them will do... I have an idea! Why don't you help me find out what they mean? I'm sure I'll be able to reverse anything that happens to you.\"<br>\r\n<br>\r\nYou mull this over... Should you help her find out if these are spells, and what they do if they are?</span></div></div>",
            "created":1350305400,
            "id":1447248,
            "title":"The Beginning - PART TWO."
        },
        "111":{
            "author_id":"dorangrey",
            "author_name":"dorangrey",
            "choices":[
                "Transformed somehow! (mental, physical)",
                "Changed in size! (fat, macro, etc)",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>\"Great!\" Twilight says, clapping her hooves, \"Let's get started!\"<br>\r\n<br>\r\nFive minutes later, the two of you had constructed a circle of protection, with magic runes to ensure the safety of everypony in the room.<br>\r\n<br>\r\n\"Ready?\"<br>\r\n<br>\r\n\"As I'll ever be,\" You reply, taking a deep breath.<br>\r\n<br>\r\nTwilight's horn ignites, and you're engulfed in a brilliant purple glow. Warm magic tingles your body, and strange shapes float before your eyes. Inside, you feel your guts twisting as the spell takes effect.<br>\r\n<br>\r\nEventually, the glow dies down and the tingling stops. Twilight is staring at you with wide eyes. With a tinge of panic and anticipation, you look down to see the effects of the spell. You have...</span></div></div>",
            "created":1430598120,
            "id":1972546,
            "title":"\"Sure!\""
        },
        "1111":{
            "author_id":"wolfwacther",
            "author_name":"wolf watcher",
            "choices":[
                "Mind",
                "Body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did your body change or just your mind?</span></div></span></div>",
            "created":1443025260,
            "id":2038654,
            "title":"What happened"
        },
        "11112":{
            "author_id":"uliovka",
            "author_name":"Uliovka",
            "choices":[
                "She takes your head off",
                "You inmediately fall to pieces"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, let's do this,\" Twilight says as she takes the book with her violet aura, moving the pages and checking every single symbol. Suddenly she stops and says, \"Aha! this one looks promising.\" She points the tip of her lavender hoof to the paper.<br>\r\n<br>\r\nThe unicorn's horn began to shine as her eyes analyze the shapes of the ink on the paper. Moments after, the ethereal magic of Twilight moves in the air until it reaches the body of her guest and sinks into his skin. \"Whoah!\" You say as the magic surronds your body until it dissipates into the air. A few moments after... nothing happens.<br>\r\n<br>\r\n\"Did it work?\" You ask nerviously.<br>\r\n<br>\r\n\"It probably has a delayed effect or it's not something you can phyiscally see,\" Twilight replies, \"Maybe we need to perform a few tests to know any significant changes in your body or psyche.\"<br>\r\n<br>\r\n\"Very well...\" You say, anxious about what you'll find out.<br>\r\n<br>\r\nTwilight takes some air and expels it slowly, walks to the stump and sits. Then she takes a feather and starts writing, \"First of all, thanks to the apparently lack of visible changes, we need to know if your physical capabilities improved. I know this is precarious, but I'm going to take the heaviest books off the shelf and then give it to you, alright?\"<br>\r\n<br>\r\nYou nod at her and move yourself to the other side. Twilight's horn shines and books from the room form a pile just above your right side.<br>\r\nYou look at  the insane amount of books, worried. \"Twilight... what will happen if I'm not able to carry all of this?\"<br>\r\n<br>\r\nThe lavender unicorn replies, \"Relax, I'm not going to smash you. I'm going to put one book at a time until you say you can't hold it, okay?\"<br>\r\nYou lift your hoof and after a deep breath, you say, \"Okay Twilight, I'm ready.\"<br>\r\n<br>\r\nYou see the first book lying in your right hoof, then two, three, four. You think, \"Maybe this worked out after all...\" Twilight continues to add more books. Seven, eight, nine...<br>\r\n<br>\r\nThen you hear a pop followed by the sound of books falling to the floor. Both you and Twilight see your entire right leg lying on the floor. \"Sweet Celestia!\" You scream. Twilight stumbles and after a few moments, she says, “You're not bleeding. Tell me, do you feel any pain?”<br>\r\n<br>\r\nLooking at your hoof, you reply, “Actually... no.” Twilight stands up and approaches your severed limb. She touches it with the tip of her feather. Surpisingly, you can feel it as your leg twitches a little.<br>\r\n<br>\r\nThe unicorn takes your hoof with her magic and examines the new flat stump on the side of your leg. It appears like it should attach to your shoulder, because the same kind of stump is on your shoulder. “It has new skin and a coat of the same color that surronds it,” says Twilight as rubs the feather with against the stump. Suddenly, you feel your right leg squirm by the reflex of your muscles. You chuckle a little at the sudden sensation.<br>\r\n<br>\r\n“The new skin is very sensitive,\" she says, \"Now one more thing... can you still control it?” While you stare at your detached hoof, you close your eyes, concentrate on your leg, and command it to bend itself. You feel your muscles contract, then open your eyes to see your floating leg bend in the air to your command.<br>\r\n<br>\r\nTwilight walks toward you and puts your severed hoof against your shoulder. Suddenly, your leg reattaches to your body as if nothing had happened.<br>\r\n“You're kind of fragile now,\" she says, \"You should avoid carrying heavy stuff.”<br>\r\nNow we can continue doing tests on you...<br>\r\n</span></div></div>",
            "created":1560050640,
            "id":2670574,
            "title":"Separation spell (NBM/Modular)"
        },
        "1112":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "Smaller",
                "Bigger",
                "Fatter or something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your body glows with Twilight's purple light. You feel dizzy and disorientated as some kind of physical change happens. Looking down at yourself you find yourself getting...<br>\r\n</span></div></span></div>",
            "created":1430609220,
            "id":1972633,
            "title":"Two line bridge chapter "
        },
        "11121":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "You shrink to around doll size",
                "You shrink to a different size"
            ],
            "content":"<div class=\"\"><div> <span>The library around you appears to be getting larger by the second and you seem to be moving further away from the circle. it quickly dawns on you that neither the library nor Twilight is getting any bigger, your getting smaller!<br>\r\n<br>\r\nYou look up at Twilight's face, hoping to see if she intended this to happen, but all you see is a nervous smile. Is she amused? Panicking on the inside? Or waiting for results?<br>\r\n<br>\r\nWhatever happens you hope you won't be stuck at the size you shrink to. if she could do this to you, it should be a simple matter for her to undo it, right?<br>\r\n<br>\r\nYou wonder how small you'll shrink. The size of a doll? Small enough to fit on her hoof? Or smaller still?</span></div></div>",
            "created":1430609280,
            "id":1972636,
            "title":"Shrunk in the wash"
        },
        "111212":{
            "choices":[
                "You are at size of ant!",
                "You are at microscopic size and Twilight can barely see you!"
            ],
            "content":"<div class=\"\"><div> <span>You continue to shrink smaller, smaller and smaller... as you getting really nervous about your situation. You don't know when the shrink will stopped anytime soon!<br>\r\n<br>\r\nFew seconds later, the shrinking spell has finally stop. But you're now truly tiny. So tiny that you cannot longer see Twilight's face from at distance.<br>\r\n<br>\r\nMeanwhile, Twilight stares at the circle where you had shrinking, she steps toward and takes a closer look where you are. While she lowers her head toward the floor, you look up and yours jaw dropped. Twilight Sparkle is a size of goddess to you!<br>\r\n<br>\r\nHow small did she makes you?</span></div></div>",
            "created":1441335540,
            "id":2029772,
            "title":"How small you make me?!"
        },
        "1112122":{
            "author_id":"cmwrite",
            "author_name":"CMwrite",
            "choices":[
                "In time for winds to sweep you out of Twilight's Library ",
                "By the thunderous step of Twilight who has bad news for you",
                "And it was night time and Twilight is no where to be seen"
            ],
            "content":"<div class=\"\"><div> <span>A speck, a dust mite, you don't know how small you are as every second Twilight gets closer to you her size grows dramatically. Her face is a mere milimeter from the ground and you make out every detail on her face, from the details of her pupils to even the tiniest details on her eyelashes. She is so astronomical, it was intimidating. Things wasn't looking good when you notice that her eyes is scanning the floor, trying to find you. Suddenly, a booming thunder could be heard, you realize, that the so called thunder is actually Twilight speaking.<br>\r\n<br>\r\n\"There you are!\" Twilight's eyes widden as she spot you, but barely considering she is squint her eyes very hard. Soon a purple aura surrounds you as you were being lifted up. Everything became a blare to you as Twilight hovers up to her eyes while she stands. You wanted to say something, only to covered your ears as she spoke again. <br>\r\n<br>\r\n\"I can't believe it, you're so...so microscopic. I almost mistake you as a speck of dust or something like that. Here, let me put you somewhere safe.\" She says as she looks around and see a piece of paper on a book. She walks towards it, yet, you could feel and hear the planet shattering step from below, and you being hover for crying out loud. Each movement Twilight made felt slow, yet powerful at the same time until she set you down on the paper.<br>\r\n<br>\r\nYou gulp when you had to look up and struggle to see her face. Her expression seemed to be a mixture of excitment, curiosity, concern, and amusement at the same time. You were about to say something but once again, covered your ears as she spoke. \"Wait here, I'm going to check something.\" She says as she walks to where the book that had the spell she used on you. You watch as the lavender pony flops on the ground and stuff her face in the book. You have a feeling you are stuck here for a while.<br>\r\n<br>\r\nHours has passed and you fell asleep. You woke up later...</span></div></div>",
            "created":1508313420,
            "id":2403083,
            "title":"Micro adventures awaits"
        },
        "11123":{
            "author_id":"dorangrey",
            "author_name":"dorangrey",
            "choices":[
                "Fatter!",
                "Pregnant!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You gasp, seeing that you've suddenly become...</span></div></span></div>",
            "created":1430985480,
            "id":1974702,
            "title":"Fatter or something else"
        },
        "112":{
            "author_id":"crispy112",
            "author_name":"Crispy",
            "choices":[
                "The door is surrounded in a pale violet aura!",
                "Nothing. You leave Twilight's home and return to your own without incident."
            ],
            "content":"<div class=\"\"><div> <span>Twilight Sparkle suddenly puts on a disappointed expression. \"Oh... I guess that's alright. I'll just have Spike help me sometime,\" She chuckles nervously. \"Enjoy the rest of your evening!\"<br>\r\n<br>\r\nYou return the farewell turn back around. As you start to head out, you can't help but feel just a little bad about turning her down to your own idea. You approach the library's door and push it open, when suddenly...</span></div></div>",
            "created":1350744540,
            "id":1450277,
            "title":"\"Sorry, you'll have to find somepony el..."
        },
        "1122":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "You run into Twilight later",
                "You have second thoughts about your second thoughts",
                "Twilight decides to experiment on herself or friends instead"
            ],
            "content":"<div class=\"\"><div> <span>You quickly trot away, looking over your shoulder the entire time.<br>\r\n<br>\r\nTwilight might have a reputation as a brilliant mage, but how much did you know about her anyway? When you were in the library something didn't feel right. You wondered just how safe those experiments really were, and you couldn't help but feel there was something.. not right beneath her surface.<br>\r\n<br>\r\nYou look over your shoulder the whole way back, but as far as you can tell Twilight wasn't following you. You hope this doesn't drive a wedge in your budding friendship with her.<br>\r\n<br>\r\nOnly when your home do you finally relax.</span></div></div>",
            "created":1430604780,
            "id":1972594,
            "title":"Guest writer reporting in"
        },
        "11223":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "She experiments on herself",
                "She experiments on Spike or one of her friends"
            ],
            "content":"<div class=\"\"><div> <span>\"Well that didn't go so well.\" Twilight said to Spike. \"And this put's me behind schedule.\"<br>\r\n<br>\r\nSpike shook his head.<br>\r\n<br>\r\n\"I told you couldn't expect a pony you practically just met to let them experiment on you.\"<br>\r\n<br>\r\n\"I suppose not. Oh Spikkeeeee.\"<br>\r\n<br>\r\nSpike backed away, recongising that mad scientist look.<br>\r\n<br>\r\n\"Oh no! You are not experimenting on me!\"<br>\r\n<br>\r\nTwilight sprinted towards him, easily closing the gap.<br>\r\n<br>\r\n\"But it's for the good of ponies! I promise I'll undo any change you find undesirable.\"<br>\r\n<br>\r\nSpike raised his hands, making a clear barrier.<br>\r\n<br>\r\n\"Forget it! How about you experiment on yourself?\"<br>\r\n<br>\r\nTwilight looked thoughtful but frowned.<br>\r\n<br>\r\n\"Not a bad but if something goes wrong who will undo the spell?\"<br>\r\n<br>\r\n\"Well surely one of your friends will agree to it!\" Spike said.<br>\r\n<br>\r\nTwilight rubbed her chin.<br>\r\n<br>\r\n\"Hmmm.... but I am behind schedule....\"</span></div></div>",
            "created":1430605320,
            "id":1972600,
            "title":"Not saying I'll be a permanent fixture but..."
        },
        "112231":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "A pyshical change",
                "A mental change or something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Fine, I'll do it myself.\" Twilight said. \"But at least help me setup.\"<br>\r\n<br>\r\n\"Ok but only if your promise not to drag me into this.\"<br>\r\n<br>\r\n\"I promise.\"<br>\r\n<br>\r\nFive minutes later, the two of of them constructed a circle of protection, to minimize any possible damage.<br>\r\n<br>\r\n\"Ok I think I'm ready. \" She levitated a book towards her, flipping through it. \"Now let's see... what should I start with? Mental or physical transformation? Maybe try to turn myself into another specie? Or something else?\"</span></div></div>",
            "created":1430606100,
            "id":1972609,
            "title":"Might be back here tommorow"
        },
        "112232":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "Twilight talks Spike into accepting or experiments anyway",
                "She get's one of her friends or something else"
            ],
            "content":"<div class=\"\"><div> <span>Twilight moved closer even as Spike kept trying to back her. Her head was lowered, leaving her horn pointing right at his body.<br>\r\n<br>\r\n\"Come on Spike, I'm behind schedule and your my assitant. I promise I'll do undo anything undesirable and let you keep anything that's safe.\"<br>\r\n<br>\r\n\"No! Twilight don't do this!\"<br>\r\n<br>\r\nTwilight grimaced.<br>\r\n<br>\r\n\"You've helped me out before.\"<br>\r\n<br>\r\nSpike held his head, as though he was dizzy before backing away again.<br>\r\n<br>\r\n\"Yeah and my head's still ringing from before. What about Rainbow Dash? She should be nearby. Or Pinkie Pie? I bet she'd try anything.\"<br>\r\n<br>\r\nTwilight rubbed her chin.<br>\r\n<br>\r\n\"Hmm I could probably talk Applejack or Fluttershy into it and Rarity owes me a favour... but what if I offered you some gems? Really delicious ones?\"</span></div></div>",
            "created":1430605680,
            "id":1972603,
            "title":"Weighing her options"
        }
    },
    "info":{
        "author_id":"crispy112",
        "author_name":"Crispy",
        "brief_description":"Even the most innocent of visits can go wrong when somepony gets curious!",
        "created":1345691700,
        "description":"<td align=\"left\" class=\"norm\">This story takes place in the My Little Pony: Friendship is Magic universe.<br>\r\nThis is an interactive story that revolves around transformation and the fun that comes with it. <i>Almost</i> anything goes. Feel free to let most of your fetishes run wild, be it size changing, gender swapping, or whatever else you conjure up.<br>\r\n<br>\r\nThere are a few restrictions and preferences, however:<br>\r\n<br>\r\n1. Please please please, don't skimp on grammar, spelling, and the like. Make sure your additions are readable and in English, as well.<br>\r\n2. No super-short additions, or ones that go completely off track. The story needs to make sense as it progresses.<br>\r\n3. All additions are to be written in second-person perspective. If you don't know what that is, look it up.<br>\r\n4. Try to avoid death as often as possible, or at least make sure readers have a choice other than death if it should come close.<br>\r\n5. The main character starts as an adult male. This is subject to change, of course, but I felt I should make this clear. Yes, transformation into a human is plausible.<br>\r\n6. The story isn't restricted to Twilight Sparkle. You're free to introduce other <b>existing (OCs are a no-no)</b> characters later on, but please make sure you do it in a way that makes sense.<br>\r\n7. I'm not going to stop you from adding content like scat and waterworks, but since I know a lot of people don't like it, please include some fair warning.<br>\r\n8. Leave plenty of open options. Story arcs that only go in one direction with no branching choices are dumb.<br>\r\n<br>\r\nI'll check in from time to time and make sure everything is in order here. If I see and entry that seems to completely disregard these, I'll edit or remove it, depending on how severe it is.<br>\r\n<br>\r\nRemember, anything goes, including homosexual content. That means that you may find material that offends you. Well, the solution to that is simple; Ignore it or shoo.<br>\r\n<br>\r\nNote: I'm a mediocre writer. My contributions will probably be rare and not all that great. Sorry about that.<br>\r\n<br>\r\nNow please, enjoy!</td>",
        "id":1886768,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1560050640,
        "modified":1560050640,
        "pretty_title":"Fun Experiments with Twilight Sparkle!"
    }
}