{
    "chapters":{
        "1":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Go to the Shop to pick up tools for \"Tye Ups\" path",
                "Shop to pick up \" Aids to Digestion\"",
                "Shop to pick up \"For those small and Large\"",
                "Shop to pick up \"Smelly and intersting body Parts\"",
                "Shop to pick up \"Change of Pace or Body Aids\""
            ],
            "content":"<div class=\"\"><div> <span>Welcome to the Hotel de' lion, a place to explore your wildests tastes, as you enter the lavishly decorated gateway a huge lion greets you. \"Good morning valued customer, welcome to my humble abode\" As you reach for your wallet he smiles \"Pay at the end of each day, thats how we do things, easier for this old lion to tally up your bills. Now let me help you along, we have lots to do, but ya gotta get equiped first.<br>\r\nThe big lion points five signs and then gives a thumb signal to a hotel shop behind him. Feel free to take what you need, it'll be added to your bill. You notice a few humans and furs behind the lion shivering 'Ohh, you can by escorts for the night too, he thumbs toward the furs. Now where to first. </span></div></div>",
            "created":1054184400,
            "id":159576,
            "title":"Welcome to the Hotel De Humongous Lion"
        },
        "11":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Collars and leashes",
                "Spools of Rope and Chain",
                "Racks and other torture devices",
                "Thongs and undergarments",
                "To be added later"
            ],
            "content":"<div class=\"\"><div> <span>You enter the somewhat intimidating store, it's front is covered with chains and all sorts of rough stuff, a few doubts linger in your mind. As you walk in you notice a few of the other patrons eyeing you with calculting glares, making side comments about various things that you would guess are not in your best intrest. the general feeling is slight menace. you feel like you want to get your buisness done as quick as you can, like most people comming in behind you<br>\r\n<br>\r\nThere is everything you can immagine here, you gander at the various shelves stocked with all sorts of items, they tend to fall into the large and small categories though slight variations in appearance provide selection, there are no prices marked on anything. you see other customers, both furs and humans pick stuff up and walk out. Where do you go to </span></div></div>",
            "created":1054184400,
            "id":159577,
            "title":"Bindings and things to make things Intersting"
        },
        "111":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Pick up the Small one",
                "Pick Up the Large one"
            ],
            "content":"<div class=\"\"><div> <span>THe wall of colors and leashes looks like somethig out of a pet shop, all sorts of leashes and collars are visible, many looking intimidating. You eventually focus on some steel ones, with chain leashes attached. they have a few small decorative spikes on them and thats about it<br>\r\nThe small one looks like it would fit around the neck of a human, the large one seems like it would fit around the neck of something a hundred feet tall and a neck as broad as a tree trunk. You gulp. And think about your choice, what does this enormous one mean, and what must it cost <br>\r\n</span></div></div>",
            "created":1054184400,
            "id":159579,
            "title":"Which Collar"
        },
        "1111":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "A real fat lion looks you over",
                "A massive, Wide Gator with a bone through the nose comes in"
            ],
            "content":"<div class=\"\"><div> <span>You gulp as a shiny piece of gold lands in your hand, and the small spiked collar twists and squeezes around your throat, nearly choking you as a long leash appears, thethering you to a spike in the ground.<br>\r\nYour now being inspected by other shoppers.</span></div></div>",
            "created":1054184400,
            "id":159580,
            "title":"Credit one gold coin a day! Services Rendered mayb"
        },
        "11111":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Lance takes you to his room for adult fun",
                "Your brought to the Gymnasium"
            ],
            "content":"<div class=\"\"><div> <span>You look up at the lion, it's not normal, first off it's got a sea green basic body color with a spearmint green mane, it is also so fat that you wonder how it's legs can carry it. he is fat in all places, even the pastel yellow though thats staining to keep a hold of the big lion in many ways \"My names Lance\" He says in a rumbling tone, you shy away \"I'm buying you\" He says and tugs the leash on your coller \"not sure how long you bought for, see what good you are\"</span></div></div>",
            "created":1077598800,
            "id":189931,
            "title":"Lance, Fat Green Lion, looks lazy"
        },
        "111111":{
            "choices":[
                "Suck him off in bed",
                "He fucks you in the hot tub"
            ],
            "content":"<div class=\"\"><div> <span>Lance pulls your leash to get you moving. You don't want to, but you have no choice. While following Lance to where-ever he's going, you decide to do the best you can to keep Lance in his room, or someplace till his time with you is up. Thankfully, Lance decided to \"play\" with you in his room. Walking into the room, you see that It's alot better than your room. It even has a hot tub. \"Now, what should we do first?\", says your temporary master.</span></div></div>",
            "created":1137733200,
            "id":297095,
            "title":"Playing"
        },
        "1111111":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lance says \"I'm horny!\" Lance lays on the bed, splays his legs and an enormous tube comes springing forward. \"Come on up here and suck on this!!!\"<br>\r\n<br>\r\nWill you? </span></div></span></div>",
            "created":1273554000,
            "id":881766,
            "title":"Suck him off in bed"
        },
        "11111112":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "You meet other people in this jailish thing",
                "nobody is willing to risk talking"
            ],
            "content":"<div class=\"\"><div> <span>You just can’t.<br>\r\n<br>\r\nYou look him in the eyes and apologize “I’m sorry I just can’t.” He looks annoyed and tells you to anyway. You again politely refuse.<br>\r\n<br>\r\nHe stands back up holding your leash. Powerfully he picks up your pants and removes something from them. “Excellent”. This was unexpected, “Wait what?” He retrieves the keys to his room and yanks you to your feet. “I was hoping for a challenge, looks like your it!” Helpless against his strength he leads you to the front door, “A challenge? You don’t understand I don’t want to. I’m not fooling around.” He opens the front door and steps through, you do your best to hesitate inside, “neither am I” he responds while yanking you through. Suddenly you are outside and on his leash, you turn around to dash back inside but he’s already locking the door. “No wait! I’m naked please let me get my clothes!” He doesn’t respond and begins to leave holding your leash. Eventually the slack runs out, you feverishly twist the door knob but it’s locked, then the leash yanks you away.<br>\r\n<br>\r\nHe calmly walks whistling away ask he drags you naked through the resort. You do your best to cover yourself. When you checked in you didn’t have time to read the map before you were collared, you have no idea where he’s taking you. As you walk you don’t see many other humans. Well free humans. Every human you encounter is in a cage, on a leash, or in some medieval bondage on display. Every last one was also naked, ever single one also had a collar locked on their necks. Maybe coming here wasn’t such a good idea. <br>\r\n<br>\r\nEventually things look familiar, the Ty-ups shop. Thank goodness he must be returning you. Some of the other humans that were checking in behind you had ventured the same as you did and now were collared and leashed to spikes in the ground or in some kind of dungeon devices waiting to be bought. This was not in the brochure. Infront of you a very attractive woman was picking up a collar like you did, “hey wait don’t do-“ she turned to respond but the collar clamped around her neck as she did. Seeing your situation she tried to take the collar off but it was no use, she looked around nervously as a wolf looked hungrily at her. Lance looked at the other leashed humans, and looked like he was about to drop you back off when he snapped his fingers. Yanking your leash he drug you past the leashes to the back. He must be looking to change you out for another one. You exhale deeply and hope the next person to buy you would be less…male.<br>\r\n<br>\r\nHe walks up to the counter, shoves you into a small cage sitting on the ground on a pair of tracks leading to a door in the wall, pockets the key and rings the bell. A snake-woman appears at the window. Lance leans against the counter by the window like a jock hitting on someone working fast food. “I bought this human this morning, and it’s refusing to do what I’m demanding it to do.” The lady’s serpent tongue flicks the air and she looks disapprovingly into the cage at you. “Do you want to return it for another? We have a new batch coming in today.” Lance smirks and says something you can’t hear. The snake woman chuckles and smiles at you, “Certainly sir, we can do that. Are you aware of the fee?” Lance flicks your gold coin up from between his fingers. You recognize it “Hey wait that’s mine!” She scolds you, “Mind your place, don’t make such accusations. Mr Lance can you come back before close, we will have a human will be ready for you.” He flirtatiously boops her nose and gives her the thumbs up and cage key before walking off. <br>\r\n<br>\r\nYour cage slides through a hole in the wall just big enough for it to fit through. “I’m really sorry I didn’t live up to expectations, I don’t think being bought on a leash is for me. Can you take this off of me?” You say while subconsciously tugging on it. The snake woman wheeled your cage past what looked to be dozens of other naked humans locked into cages, all of them looked nervous or resigned to their situation. Your cage loudly clicked into an empty alcove and she leaned down to look better at you. “Your response to being on a leash is perfectly normal little human. You just need time to get used to it.” There isn’t much room to move but your hand finds the lock of the cage and futilely tries to open it. “No, I don’t want to get used to it I want it off and to be let out!” She gets up and walks away without responding. “Come back here and let me out!”<br>\r\n</span></div></div>",
            "created":1573794000,
            "id":2747001,
            "title":"no"
        },
        "111111121":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "the lights turn off for the night",
                "the snake woman returns"
            ],
            "content":"<div class=\"\"><div> <span>The humans across the isle look back at you anxiously. A stunning woman quietly spoke to you, presumably trying to not be heard by the snake woman. <br>\r\n“How long have you been here”<br>\r\n“Just this afternoon, I put on this collar, this lion bought me, tried to make me suck his cock and brought me here after I refused.”<br>\r\n“Oof, you got a colorful first buyer.”<br>\r\n“First and only, I’m not doing this again, not without some kinda limit or something.”<br>\r\n“You are going to have to suck his cock, you know that right?”<br>\r\n“What?” the feeling of relief went away and left a chill in it’s place.<br>\r\n“He’s coming back for you. He bought you and it hasn’t been a day, he still owns you. Right now you are here because he’s getting you in trouble with the Pound so he can get what he wants from you. He’s gonna keep owning you until he’s bored, out of money, or satisfied.”<br>\r\n“Wait, I don’t get like a veto at the end of the day?”<br>\r\nShe looked puzzled back at you, “Um…no? Where did you get that idea?”<br>\r\nPanic about being unable to flee from this cage beings to sink in from all sides. “I just assumed, I mean where is the fun for me if I get stuck with someone I don’t like?”<br>\r\n“That’s the kind of important deep thinking you needed to do BEFORE clamping that thing around your neck. This isn’t some kinky fetish island. We humans are NOT on the top of the totem pole here. Didn’t you read the booklet you got when you checked in?”<br>\r\n<br>\r\n“Well um no…I put it with my luggage and had it sent to my room, I started to wander and wound up here.”<br>\r\nShe looked legitimately frustrated at you and her voice raised a little with her temper. “Ugh, people like you are why they are so strict with us. Listen up and listen good, where you came from we humans are top dog. Here we are NOT. We are here to serve these furry people. The resort makes it cheap for us to come here so we can amuse their inhuman guests, it’s not particularly interested in how much fun we humans are having. Tomorrow when your owner comes, you thank him for his attention and suck his cock and HOPE he lets you go. Alost of these guys are satisfied when they assert their dominance a few times.”<br>\r\n“What did you mean he was getting me in trouble with the Pound? What is it and can they make me suck his cock?”<br>\r\n“Well the Pound where you are” She motions to the rows of cages.<br>\r\n“Wait, I’m in a pound? Like for animals?” the understanding of the prison just shifted violently.<br>\r\n“Duh. Here we are their animals. The Pound is for helping us integrate to a fur dominated society. To answer your question, they have a demerit system that gets progressively worse. Since you are new and this is your first offence you can probably get off without any penalty. Just try to keep a low profile until your checkout date. They can’t actually make you suck his cock, but they can make it the lesser of two things you don’t want to do.”<br>\r\n“Can I explain to them that I didn’t know what I was getting into? Surely they can be reasonable about this.”<br>\r\n“They aren’t going to help you, every human here is here because they are breaking a rule or disobedient. Their function is to train us to serve our betters. If you resist you are going to get in trouble.”<br>\r\nThe man in the cage next to her piped up, “I tried the same thing. They locked this thing on me to punish me for resisting.” He pointed to where his penis should have been. Instead a golden penis cage in the shape of a lion head swung between his legs. “Rack up too many demerits and they put you in one of these.”<br>\r\nShe opened her legs to reveal a chastity belt too, also with a golden lion head. “Just like an animal pound they do neuter us by locking us in these things. How’s that for a deterrent?”<br>\r\n“What? How long do you have to wear those?”<br>\r\n“It varies a lot from person to person. Obey that lion guy and get out of here.”<br>\r\n“I’ve never sucked cock before.”<br>\r\n“Well learn fast, it’s gotta be better than being in the Pound.”<br>\r\n</span></div></div>",
            "created":1573794000,
            "id":2747002,
            "title":"You meet other people in this jailish thing"
        },
        "1111111212":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "penis cage to lock your cock",
                "chastity belt to cover your pussy"
            ],
            "content":"<div class=\"\"><div> <span>Your new friends instantly become silent when they hear the snake woman returning, long before you did, they both motioned you to be quiet. Without a word she retrieved your cage and brought it to a small office with restraints of all kinds. There was a guy in medieval stocks still in the corner with welts across his back and bottom, and a woman hanging from the ceiling by her wrists, and a person of unknown gender whimpering from a metal sarcophagus. There was a fourth human in a cage like yours on the floor, and while noticing this individual the lock clicked open on the cage. The door popped open and before you knew it her tail removed you from the prison. Freedom! This could be your chance to escape. You twist and flail with all your might and break free. Success! After plummeting to the floor you run to the only door of the room, but you find it locked. There isn’t an escape here. This room is meant for beings once and a half your size, but it feels smaller than a shoebox. A fierce yank around your neck pulls you from your feet. The leash on the collar is bringing you back to her. When you turn around your leash is in some kind of wench returning you to the bench next to her, she’s not giving your resistance the slightest heed, in spite of your total effort to escape it. Upon being drug up into the air and onto the workspace, she secures all four of your limbs to a metallic frame and pulls you taught, possibly to the limit of what the human body can stand before you hear each restraint lock into place. <br>\r\nIron clad panic erupts inside of you with the strength to match your restraints. “What are you doing with me?!? I’m a guest here you can’t treat me this way!”<br>\r\nAmused banana yellow eyes look at you through her glasses, “I can’t? I’m pretty sure any humans in the pound I can do whatever I please with inside the rules.”<br>\r\n“I demand you let me go! This isn’t what I wanted at all!”<br>\r\n“Um…..no. That’s not happening. I take my job here very seriously. I didn’t get to be the best by letting humans out of the Pound willy nilly. Now stay still.”<br>\r\nShe her hand produced a perfectly sized<br>\r\n</span></div></div>",
            "created":1573794000,
            "id":2747005,
            "title":"the snake woman returns"
        },
        "11111112122":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "She's iron and happy you are leaning your new place",
                "She's not entirely heartless and gives you an opportunity"
            ],
            "content":"<div class=\"\"><div> <span>The lid is removed blinding you with an illuminated magnifying glass. Without any delay she loops the belt around your hips and between your legs. Your arms and wrists are immobile in the frame and you can only watch as a padlock is threaded through the front of the belt. It’s cold and intimidating against your body. The reptilian grin on the woman’s face is blocked by a mirror “Here you go little human, take a look.” Your frame is reclined backward and you have to strain your neck to look far enough down to see most of the mirror. Your own body blocks the view but if you hold your breath and twist so your body you can see it. Just like the woman across from you in the hall of cages, there is now a golden lion head chained between your legs, holding a large swinging padlock in it’s teeth. There is no key in sight. Your eyes dart all over where your pussy should be hoping to find some flaw in the bet to escape it. Already its tight and uncomfortable. A scaly digit flicks the lock. It swung around in the lion’s teeth, while it swung around it gave you a mild sensation like electricity, it was arousing and concerning. This should not be on you, instinctively you want to grab it and force it down off of your body, but you cant. “Take it off of me.” Her forked tongue flicks the air. “Nope, you have to wear that until the Pound thinks you are serving our guests as intended.” She produced a small phone and snapped a photo of you as you were angrily asking her just what the hell that meant. She paused and raised what would have been an eyebrow if she had them. “It means just what the booklet says. Humans on sale are guaranteed to serve whomever buys them, if they are unsatisfactory their owners can have them disciplined or get a refund.” You pause processing how institutionalized this place seems to be in favor of the furs. “I didn’t get to read it before this happened!” She chuckles while beginning to undo your restraints, “Well I suggest you find a copy. I will tell you that the resort suspends your checkout privileges until you are free of demerits.” Your hands are now free and you instantly start feeling the chains around your hips and find them to be completely inescapable. She pushes your hands away and flicks the belt filling you with no shortage of blunt discomfort. “You little human have a demerit.” The phrase, suspend checkout privileges, echoed in your head. The restraints on your feet are removed leaving you sitting on the frame, forgetting your are naked but with one hand on your collar and the other on the belt’s padlock. “Wait, so I can’t just quit my vacation and leave?” She picks up a cage and loudly sets it down next to you on the table, “Nope, not until you get a mark of approval from your owner and the Pound removes your demerit.” Your legs are like lead, “Wait, owner? Like real owner, this isn’t some kinky game place? I thought this was a fun place for humans and furs to mingle.” You are bluntly forced into the cage and she beings shutting the door. You panic and try to keep it from shutting. She without much effort keeps it from opening any farther, “Where do you think you are going to go? You tried this before little one. You better behave or I’ll put another demerit on your record.” You stop instantly and the shutting door knocks you to the other side of the cage as it latches shut, your mind whirls at how belittled you are. Getting out here isn’t a possibility maybe once the lion picks you up you can get away and get out of here. <br>\r\n<br>\r\nFrom inside the cage the woman seems notably taller, the room seems bigger, the cage seems bigger, this is a scary situation. Hours ago you came here for fun, now you’ve found out there is a possibility you cannot leave. Small and helpless isn’t an emotion you tolerate in yourself, but for this moment you can’t do anything and decide that this time you will let it run it’s course and get out of your system. Your cage swings with her stride. She carries the cage through what appear to be unsecure areas of the Pound, if there is a chance for escape this might be a good place for it. Carefully you hand moves to the latch and you start trying to work it open. After a few moments, she violently whips the cage around in front of her and she leans over. “Escape attempts will absolutely not be tolerated. Ten demerits is the customary punishment.” Your knees give out, you aren’t sure what it takes to remove a demerit, but it’s probably not pleasant. She gets out her phone types something, and turns it around for you to look at through the bars. Mortified you see the picture she took of you right after she installed the belt, your limbs are pulled to the ends of the frame your have an unpleasant look on your face because she shot you mid sentence, and the lion’s head is smaller than you hoped but at least it covers some of you. You resent having a photo of your breasts out of your control. <br>\r\nAbove your image is written.<br>\r\nName: Shannon Larrity <br>\r\nSpecies: Human<br>\r\nDemerits: 11<br>\r\nOwner: Lance Chambers<br>\r\nHabitats(s): Owner’s quarters, Kennel# 2, Human’s quarters<br>\r\nArrival: Self surrendered, May 15th <br>\r\nDuration: Two week acclimation<br>\r\nDeparture: Suspended<br>\r\nDays in training: 0<br>\r\nEscape attempts: 1<br>\r\nNotes: Has not read the rules<br>\r\n<br>\r\nThere was more but your head spun. Horrified at the cut and dry nature of this situation you fall back to your butt and lean against the bars, forgetting for a moment you are still mostly naked in a hallway full of strangers and apparently predatory furs. Your cage is picked back up and she talks to you without looking at you, “Escape is completely impossible by the way, I can see it in your eyes. As long as you have one of our restraints locked on your body” your hands return to the collar and chain running over your hip “you are tagged and we know where you are. If you run away you won’t be gone for long and earn a whopping pile of demerits. Besides there is nowhere for you to go. Humans haven’t settled this island just us furs.” <br>\r\n<br>\r\nYou are silent for a moment letting that panic from before run it’s course in your system. She looks at you and sees the expression on your face.<br>\r\n</span></div></div>",
            "created":1573880400,
            "id":2747484,
            "title":"chastity belt to cover your pussy"
        },
        "111111121222":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "Now",
                "Later"
            ],
            "content":"<div class=\"\"><div> <span>I silence the two of you walk the halls until she suddenly enters another room similar to the one you were in a moment ago. She locks the door and opens your cage. She dumps you onto the floor and unbuttons the top few buttons on her shirt. She looks down at you , you feel extremely vulnerable and small presented with the sudden shift. “Alright little miss, you screwed up out there, but I’ll let it slide if you do something for me right now.” What could she be thinking now? Your force your panic down so you can focus on whatever this opportunity is, “What is that?” The woman sat down in a wheeled chair across the room, “I want my nipples licked, and sucked on, now. You look like you are getting the lay of the land here and want those demerits gone, lets help each other.” <br>\r\nThis was not as objectionable as sucking that lions cock, though you have never been into women before. Well, this was something you could live with. You’ve never seen all of her at anything other than point blank. She’s much taller than you remember. This room was also clearly meant for larger furs. You agree and walk over to her. The seat of the chair was about shoulder height to you. <br>\r\n<br>\r\nYou look awkwardly and put a hand up hoping she would help you up. She grinned down at you, “No, learn how to do this on your own little pet.” Angrily you take fist full of skirt and pull yourself up her legs to her lap. You thought she was about as tall as you and sat down realizing the top of your head doesn’t come to the bottom of her breasts. You stand on the chair with your legs spread around her right leg, you grip her shirt and angrily growl, “I am NOT anyone’s pet”. She laughs and forces your face into her breast, “Whatever you say little girl, less talking more sucking.” You force your hands into her boob and get some distance, “Take off your shirt so I can get to them.” She laughed lightly, “Nuh unh, you serve furs now remember? Do it yourself.” You lean a little to your left and work on the next button on her shirt, it fights you and you give it a yank and a grunt before it pops free. Once free you turn back to her and point at her eyes, “I DON”T serve furs!” The grin on the woman’s face faded, “You know what, maybe you aren’t ready for this, you’ll serve furs eventually if you want your demerits gone.” An arm moves you back and she buttons her shirt back up. You grab her hands as best you can without falling off the chair, “Wait! Wait wait. You’ve just surprised me, this is a lot to take in. Please just give me a sec.” Annoyed she did not give you a sec, instead her left hand pulled your hair and lifted you up by it, “Well you don’t have one, either you serve furs now or your serve furs later.” The pain was incredible and your arms tried to support you at this angle. “OW OW OW. PUT ME DOWN!” From somewhere her foot hat retrieved the cage and held it next to you. She swung you into her breast, “Serve furs now” then she shook the cage which rattled loudly next to you “or serve furs later.” <br>\r\n</span></div></div>",
            "created":1573880400,
            "id":2747502,
            "title":"She's not entirely heartless and gives you ..."
        },
        "1111111212221":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "The snake woman is satisfied with you",
                "The snake woman is a snake and wants more now"
            ],
            "content":"<div class=\"\"><div> <span>Hanging from your hair you growl out “Now” She stops swinging you between her breast and the cage, “What now?” You know what she wants you to say, she must really be enjoying this. “I don’t want to say it. Camon just let me get this over with?” She moved you further up to eye level, “Say it, you are in training to be a pet, the sooner I can get you to be have well the sooner you benefit too.” You hang there for a moment, “Fine just put me down.” She does not, you growl “FINE! I serve furs now.” She still holds you in the air by your hair. “WHAT? I SERVE FURS NOW! PLEASE PUT ME DOWN THIS HURTS SO MUCH!” Her forked tongue flicks your face and chest, “Say it happily.” She wants more? “NO!” Her hand bobs up and down yanking your hair, “FINE! Please let me serve furs now, please? I want to serve furs now.” <br>\r\n<br>\r\nA tremendous crash comes from the cage that she dropped back on the floor. “Very good little pet, don’t forget that you are going back in that no matter what.” Finally your feet feel something underneath them as she releases you. You take a moment to recompose yourself. Then begin unbuttoning her shirt. “Very good little pet. You are learning. I can train any of your kind.” You fumble with the third button, “Not like I have much choice.” This time the woman sat up, you got a face full of breasts that knocked you backward, you grip the top of her bra to keep from falling off the chair. Her hand wraps itself around your throat and the other pinches your entire left breast between it’s thumb and pointer finger, then the right. “You will address your superiors in a happy voice or not at all.” She leans back pulling you to her, again you bounce off her breasts and on to her thigh. Your entire chest hurts, the pain knocked the wind out of you. “Stand up, get to work.” Slowly you pull yourself up and finish unbuttoning her shirt. Grey scaly skin glistened in front of you. Your next obstacle hung infront of you. A glossy grey bra containing a pair of glossy grey breasts. It was clearly straining. Exacerbated you look at them, they are huge, it might be their actual size, or jealousy, or your situation making you feel inadequate. The buttons were tough with little tension. This…is a challenge. “Wha…how?” without waiting to see if she scowled you go to work, thankfully this one unclasped in the front.  The pressure from inside keeps you from getting the slack you need. “Having trouble pet?” Shit, stall for time, “Um no, your boobs are just so nice and big I am admiring them.” Your entire chest is pounding while you are trying to catch your breath. “Well our bras work the same, hurry it up.” Finally it unclasped revealing two perfect huge scaly grey breasts. Momentarily you wonder if you were the same height as her who had the bigger pair. A hand clasps your head “Finally” in spite of bracing yourself against her breast, the hand forced your head down onto her black nipple. You’ve never kissed another woman’s nipples before, this was new, this is all kinds of new. Her superior size made her nipple the size of a golf ball, and areola larger than your head. <br>\r\n<br>\r\nThis was humiliating. She forced you from one to the other for a few minutes, then stuck your head between her breasts and squeezed nearly suffocating you. She laughed as you pounded against her breasts. Eventually you fondled both of her nipples and she let you breathe. She turned you around and did it again, it was more horrifying this time as the world was crushed when her breasts engulfed your view. Her laughter echoed from all around you. You grabbed her nipples with much more difficulty and when her breasts parted and you could see out, she was taking a picture of you still engulfed by her snakeskin tits. You were so short on air and didn’t complain. <br>\r\n</span></div></div>",
            "created":1573966800,
            "id":2747739,
            "title":"Now"
        },
        "11111112122211":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "Lance collects you in the mid afternoon",
                "Lance appears after dinner with a guest"
            ],
            "content":"<div class=\"\"><div> <span>You collapsed onto her leg but she straightened it up and you slid down it, past her foot and into the cage, her other foot slammed the door shut behind you. She grinned while working on her phone for a moment. “Thanks little human, I love doing that with new girls.” You stand back up in the cage and look up, “So we are square? You are going to get rid of my demerits and let me go?” She restored her business like appearance and picked you back up, “No. I two of your points, one for each one of my ladies. You still have Mr. Chambers to take care of.” You began to swing as she unlocked the door and resumed her original course, “I did all that for nothing? You lied to me!” She walked out of the building ignoring your attempts to communicate. Outside you were carried and now the sun was getting low. There were dozens of people outside, all furs, not a human in sight. You were carried to a golf cart and placed on the luggage rack. While she was starting it up she turned her phone to you, it had the same image of you from earlier and the same set of statistics, truthfully she did reduce your demerits to 9. Your relief was obvious to her. She drove to where your room was, “Now listen up, be a good pet girl, once you get approval from Mr. Chambers, come and see me. I liked what you did for me and I think I have some other uses like that one. You’ll be all squared away by the time your original two week stay here is up and you can leave. My office is in the pound, and my villa is #2 Cliffside.”<br>\r\n<br>\r\nMuch to your relief you see your room, it’s a stand alone small bungalow. Your cloths and things are inside. You made plans to have a good scream and get this out of your system. The golf cart stops and something is wrong. Your cage is lifted from the cart and carried toward the door. This place is too big, it must be for a larger fur. <br>\r\nThe door number said 12, the same as yours. “Is this my place?” She sets you down on the ground as she retrieves a large lion head topped key from the chain swinging by your door. You don’t remember a large lion head topped key hanging from a chain by your door. You also do not remember seeing a large lion headed padlock, outside your room, locking it from out here. “Wait who’s place is this?” Opening the door she walks in, “Yours of course” Your dining table is now taller than the cage you are locked inside and you are standing up. “No way, this is a room for a giant, not me.” She rummages around the bungalow. “No it’s your’s, Mr. Chambers asked if you could be shrunk to better accommodate him. We obliged.” This had to be a lie, “No way, you can’t shrink people.” She returned with your suitcases, “I bet you thought humans were on the top of the world too, now look at you, you are wearing a collar and brought home in a cage. You are a pet, a little human pet now, not whatever you were when you got here.” This has to be an elaborate plan to mess with her. She flicks your suitcase open, “Um here, try this and believe me.” She throws your fancy evening outfit bra at you. It’s clearly too large, not believing her you try to put it on but it’s obvious it doesn’t fit. Defeated you sit against the bars, she pulls it back out ad holds it to her chest. “A too small for me, you cute little humans are delightfully petite. Not a “ she looks at the tag” 36D anymore are you?” You look at her in spite as she throws it clumsily back into your suitcase. She leaves with all your luggage. “WAIT! What are you doing?” She returns after a few moments, without your luggage and a small envelope. Ignoring you she sets it on the table above and kneels down to look you as close to in your eye as she can. “I’m leaving you here for your lion, he asked if you could be returned to your room.” Not exactly what you were hoping to hear. “Why are you taking my luggage?” She stood up and walked away, “It’s on deposit with the resort, you have to pay your bill daily here, unless you have a wallet hidden on you somewhere. No? You can pay your bill with your luggage for a while.” You are so angry you shake the bars, how unfair can this get? “I HAVE money! It’s in my wallet…which…is in my pants, that the lion guy took from me.”  So no clothes, even if they don’t fit, shit, “Wait, can I have something to wear?” She turned back to you from the front door. “Pets don’t wear clothes. Besides there is nothing in here in your size.” You shake the bars desperately, “I can wrap myself up in a towel or something?” She flicks the lights off, “Sure, if you can get to one.” She began to close the door to the bungalow. “WAIT! LET ME OUT!” She paused long enough to say “Sorry, no pets are allowed unsupervised in our rooms.” She shut the door and locked it. “BUT ITS MY ROOM! LET ME OUT!”. Silence for a moment and the lock rattled and the door opened, she poked her head in, “Please tell Mr. Chambers that the key to your cage is in the envelope on the table.” She quickly left and locked the door leaving you in the cage on the floor of your own room in near total darkness. Moments later far louder clanking came from the door as she locked it from the outside with the lion headed padlock. <br>\r\n<br>\r\nRage and frustration erupt inside of you and in an you yell at the top of your lungs into the darkness, “IT’S MY ROOM I’M NO PET! LET ME OUT OF THIS CAGE! LET ME OOOOOOOUT!” In the gloomy privacy of your unlit “too large for you” room, the panic from before erupted without restraint inside of you, you kick and yank on all the bars of the cage until you are exhausted. Tears in your eyes and muscles on fire you collapse leaning on the bars of the cage with your head. Your eyes find the liquor cabinet and it’s mirror door, moonlight bounces off of it and you can see yourself. You scarcely recognize the woman in the reflection. Her size is wrong, she’s not sitting at the table but in a cage under it. Her composure is gone replaced with matted hair, sweat and tears. The lace nightie she treated herself to after getting the promotion was not on, instead she’s naked and wearing a heavy golden collar and a little lion’s head, that was sparsely more than a G string was locked between her legs. She was not free at all, locked into a tiny cage that’s impossible for a regular woman to fit into. The woman in the reflection glares at you for a private eternity. Through focus, will and habitual rehearsed self-confidence you focus on breathing. A cold deep breath is pulled into your lungs. Both women stand up, shaky at first and more confidently until the two are standing solidly.  In unison they wipe the tears from their eyes, fix their hair, and a few deep breaths later they are composed, reassuring each other. Together they admire each other’s confidence, give small critiques for the “power poise” that followed you every where they have been in life, and a silent promise to get out of here. The helpless prisoner in the cage was replaced with an empowered free woman that would get out of it soon. Sure she was naked, but she was a confident naked, not meek and vulnerable. The collar and belt were temporary decorations that are not part of her. You stare at this woman as your mind completes restoring itself in spite of the day. You blink and the woman you helped restore across the room returns to being a moonlight reflection in the front of liquor cabinet. You don’t know how you are going to get your size restored, yet, but is no doubt you will.<br>\r\n<br>\r\nTomorrow you will get the hell out of here, fix the demerits, and never ever return to this damn place. Then get even with Karen in accounting for raving about this place and convincing you to come here.<br>\r\n</span></div></div>",
            "created":1573966800,
            "id":2747750,
            "title":"The snake woman is satisfied with you"
        },
        "111111121222112":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "Lance wakes up first",
                "The cheetah girl wakes first"
            ],
            "content":"<div class=\"\"><div> <span>A loud rattling outside informed you that it was time to work your way out of this mess. Alright Shannon, time to do this. Briefly you eye the woman reflected in the liquor cabinet, you are both ready. The door swings open gently and giggling drifts through. Not the voice of the lion you met before, someone else? <br>\r\n<br>\r\nNo, Lance is here, carrying a clearly drunk female cheetah over his shoulder. Well this wasn’t expected, but maybe this could be something you could use to your advantage. With any luck he will already be somewhere farther down the path toward being happy, you can get out of her a little easier. <br>\r\n<br>\r\nTogether the felines entered her room, taller than you expected but not so much to overwhelm. This shrunken perspective is unusual but not so dramatic to completely uproot your resolve. She laughed and swing her dress side to side in her hand, she was naked and enjoying it. Her dress repeatedly swung into him flirtatiously, with a feigned smile he calmly grabbed it and threw it back outside and asked her if she thinks she will be needing it. Her response came in some incomprehensible words and a sustained nibbling on his ear. He carried her through the door, dropped her purse on the table above you and then notices your cage. “Hey hey hey. Didn’t I tell you! I have my own little human. Check her out.” He sat the pillar of drunken sex drive down on the table and picked your cage up to show off. <br>\r\n<br>\r\nClumsily your cage is picked up and brought before the two giant cats. He looked you up and down lustfully and the urge to take a few steps away is squashed by your need to keep him happy and get out of this mess and at least pretend to be enthusiastic. He twists your enclosure to the cheetah, “I bought her in the ty-ups shop and had to take her back for some improvements.” He spun the cage so she can look at you, a pair of massive cheetah print breasts are suddenly inches from your face. Matching paws grip the cage and turn it to a side and you slide to the bars, looking up at the woman. “Hummm. She’s sorta cute. If you like that smooth bland look. So what’s that between her legs, are you afraid she’s gonna use that to lure you from us full size women? Is that one of your improvements?” She wobbled and barely strung the words together to make a coherent sentence. His eyes peered over the top of the cage, seemingly upside down to you from your perspective. They drifted down to where your golden lion’s head was chained. “Um…not mine babe. I guess the pound did that? It doesn’t matter, she’s a human and-“ the drunk shoved his head outta the way and filled your vision with face. “That collar is preeeeetty. Is that what you put on her?” Annoyed he removed his shirt above you. “No she did that herself when she got here I think.” Clumsilly her paws spun the cage trying to get you to turn over, momentarily she dropped you but caught the cage. “I don’t see anything else, wha’td you do?” While on your back and looking down you could see his shoes fall to the floor. “I sent her back for discipline doll, she was disobedient and I didn’t want to waste my money.” She spun your cage around continuing to look at you with a sort of unsteady interest. “Well, that’s not really an im-improvement. Do you see how small the boobies are on this little humie? Improving her would be biiiiiiger boobs, like mine, see?” She squeezed the cage against her right breast and it bulged through the bars. <br>\r\n<br>\r\nLooking at a breast as big as a bean bag chair pressing against the cage distracted you as Lance picked both the woman and her holding you up. “Maybe we should see if they can give her tit’s like yours? Isn’t imitation the best flattery, or something like that?” Together he carried the woman to your bedroom. Firmly his massive paw removed the cage from her hands and placed you on a luggage stand by the dresser. Silently you wonder if the dresser that towered over your cage still had any of your clothes or possessions in it. <br>\r\n<br>\r\nHe threw her onto the bed and she wobbled back to a sitting position and helped him with his pants. They fell away and much to your amusement the lion had on space ship themed boxers. Those too were removed by her hands. Mercifully he was between you and the cheetah, sparing you the view of the cock you will probably wind up having to learn how to satisfy to get out of this. Much to your disgust this might be a good time to figure out what pushes his buttons. You sit down and lean forward to keep an eye out for useful hits. At this point his backside made it difficult to see anything but you did your best, also you did your best to ignore his “Fucking in a human’s bed, how hmmmmmm superior is that?” belittlement. She rocked a little side to side giggling, “It is so cute they think they are the on the tippy top, oooohhh, maybe we should make this one our pet, can’t we like do that?” That was an unpleasant thought for sure. “Sure babe, we can do that, but first you have something else to do.” His hands disappeared behind his chest and her body language stiffened for a moment, “Nuh unh! I’m not that kinda girl chester, there’s just one spot you are putting that.” He yanked her up to him and they embraced each other for a moment. <br>\r\n<br>\r\nUncomfortable memories of your college years burbled up from the past. Freshmen year your senior roommate made a point to fuck your boyfriend in front of you after she tricked you into her closet. Well boyfriend was a strong word but excellent sex buddy was something that just took too long to explain to people. Ugh, when you get out of this mess and get the belt off, you are finding some 20ish boy and getting your brains fucked out. For the first time you finally feel frustration from having the belt in the way of what you’d pay money to get your hands on. This was weird but some part of you reluctantly was getting off on this. You played with the lock and the same unnatural electric buzzing went through your system. The arousal you are feeling cannot possibly be just form watching the felines or the lock, the lion’s head has to be doing something. Maybe it’s supposed to drive you up the wall into doing kinky stuff? Would the resort do this to people? A while back you didn’t think so but now you are not so sure.<br>\r\n<br>\r\nSuddenly a salvo of wood squeaks and groans redirects your attentions. He had her bent over the footboard of the bed, and her toes could barely touch the ground. It was sort of adorable watching her flail around stuck over the footboard, his hips and hands kept her just where he wanted her and she was pulling the sheets out trying to dislodge herself. They became more intense, grunts, roars, purrs, the thrusts became stronger and her knees curled up. Her paws on the sheets had their claws out and were tearing huge gashes in the bed. Once in a while he’d forcefully pull on her tail and reposition her in spite of her clearly ingenuine protests. His rhythm changed. She weakly turned her head slightly and between gasps asked him to slow down for her. He didn’t respond, instead his thrusts became extremely powerful and he was in the final stages before his climax. She noticed this but it was too late to tell him to slow down. A series of intensely powerful thrusts moved the bed against the wall, then broke the footboard completely. Breaking wood and bestial howls force you to cover your ears. <br>\r\n<br>\r\nHe lay exhausted on top of her and she wiggled beneath him, “Uggg, really, get off dude.” He laughed in his debilitated state, “Hahaha, too late doll, too late.” Slowly she regained motor control and unable to stand slid down the slope of the bed toward it’s base. He lay there chuckling in post orgasmic bliss. What an asshole, didn’t pay attention to any of her ques to match pace through the entire time. The cheetah girl and you have something in common with that. No matter their makeup, ugh, boys. She very weekly sat on her knees, “You asshole, I was like right right there, you couldn’t just keep going for me couuuuuld you.” The booze and exhaustion seemed to be hitting all at once, she mumbled more frustrated accusations and in the midst of pointing, fell backward and passed out. Silence followed, wearily the lion eventually lifted his head up to see his conquest sprawled out on the floor. Then turned his head to you, “Heeeey human. Guess what you are doing tomorrow?” One hand stood his penis up straight and the other pointed to it, apparently he felt he still needed two hands to bring his erection to your attention. Typical, it’s almost the length of your leg and he’s insecure enough to draw this much attention to it. He passed out moments later. <br>\r\n<br>\r\nSuddenly the only person awake in the entire bungalow is the only human and the only one who can’t do anything. With nothing left to do, you sit back and flick the padlock on the belt. You can’t put the fire out behind the belt but maybe you can let it burn down. <br>\r\n</span></div></div>",
            "created":1574529600,
            "id":2750621,
            "title":"Lance appears after dinner with a guest"
        },
        "1111111212221122":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "She turns out to be kind",
                "She does not have a high regard for humans"
            ],
            "content":"<div class=\"\"><div> <span>The long night reveals the only method to power down the hunger behind your belt. Don’t let the lock move, at all. It’s sliding around in the teeth of the lion head causes the sensation. Walking around seems to put it on the very lowest setting but that’s almost beneath noticeable. It took maybe an hour for the belt to power down from where it got to last evening. Never before did you want to play with yourself like this. In a moment of shame you were reduced to grinding on the cage’s bars like a stripper on a pole. You haven’t slept. At all. Between sleeping the night before when the snake lady deposited you here and dozing most of the day, even through a long boring night, you cannot rest. <br>\r\n<br>\r\nBoring did not fit the situation well but you most definitely are. Your situation was one of extreme disadvantage, and feet away two giant cats slept that could easily do what they want with you. Unfortunately those predatory creatures out there were your only way out of this mess. A large amount of disgust at the pig-lion on the remains of your bed prevented you from looking at him, so your eyes drift to the other woman in the room. Even collapsed on the floor as she was, the lines on her fur and extremely directed physique, she was resplendent. Indecent maybe what with being blackout drunk in bed rubble. In human society having attraction to these fur creatures was hit or miss with being accepted. Internally they didn’t really do much for you. Face to face thing were a little different but you aren’t really sure how just yet. The cheetah girl was indeed attractive, skinny and a type of animal muscular that you don’t have a way to describe in human terms. Her boobs were indeed massive, on a human they would look fake, on this inhuman cat, somehow they belong. Between her comments and the snake woman’s. You wonder if in this society you are lesser endowed. Your parents put their backs into it and gave you a great genetic roll of the dice and because of that you’ve always appreciated having an edge on other ladies, in your head you categorized yourself as being 2/3rds up the “hotness scale”. Here however you imagine your position to be farther down and insecurely ponder tools at your disposal. <br>\r\n<br>\r\nHer ear twitching was the first thing that’s moved out there in hours. Instantly you are on your feet, then unsure to why really. The feline rolled groggily, then very slowly planted her front paws and knees on the ground and stood up. She twitched and stopped abruptly and her eyes darted around the room with increasing urgency. You have seen plenty of your friends black out drunk and knew the pattern, she was seconds away from throwing up. Before you recognize what you are doing you hop in the air and wave at her, “Hey! The bathroom is out the door to the right, then on your left!” Her eyes instantly clamped on to you when you started moving, instinctual for a predator’s eyes to locate a suddenly mobile object in their vision probably. She moved with a weird drunken grace our the door holding on to whatever her hands could find to balance herself. Moments later you could hear you were correct, and a few moments after that you heard the toilet flush telling you that she made it. There was silence for a bit before you heard the shower start, for some reason the idea of a fur cat taking a shower seems strange to you. You figured they just bathe themselves like normal cats, file that under things you now know. <br>\r\n<br>\r\nA few minutes later she returns, somehow looking absolutely glossy, was there soap in there for furs? Well this place seems to be built for their benefit, why wouldn’t there be? She had the headache walk, just like your power poise, you frequently use that walk to drag yourself home after the lights in the office make the occasional attempt to burn your eyes from your head. She was in the “everything hurts” phase for sure. She began crawling around the floor looking for something, you lean over but can’t find it, whatever it is. Clearly she can’t find it either. “Looking for your purse miss?” She stops moving but doesn’t raise her head up, “Yea”. You try to keep your voice down so the asshole on the bed stays asleep, “It’s on the dining table out there.” With a lot of effort she stands back up slowly. “Thank you, um, have you seen my shoes?” You stay close to the bars so you can hear her, “You didn’t have any last night when you got here. Sorry.” Weakly she walks past you mumbling about a bad shoe night. You wonder if she’s coming back but does a few minutes. “Thanks again. Good luck with that asshole.” She leaned against the doorframe, “Just tell me one thing, at your size, how does-“ she pointed at him and then you and back to him-“how do, you know. I don’t know humans, is your junk, like a shake’s jaw and opens or something?” Momentarily you are mortified of the thought of him trying to shove his cock in you at this size, or at all honestly. “What? Ew no. No…nooooooooo. That is not happening. Besides, even if I liked him.” You point to the metal covering your “junk”.  Her eyes drift down to it and she tries to chuckle but only a snort reaches your ears. “That sucks, I would go insane. So what does he use you for then?” The indifference with the cheetah’s implication of you being used like nothing more than a sex toy caused your mouth to drop open. Are humans really so far down on importance you are considered a sex toy? Or is it just because you are tiny? She sees your mouth open and makes some connections in her mind, “Oh, I see, that must have been why he went for it last night. Well, have fun with that.” She turns to leave. Quickly you reach out of the cage after her, “Wait wait wait wait!” She doesn’t, “Wait please! I know you didn’t last night, I don’t want to either!” She slows and turns back to you. “Please take me with you? Please? Can you help a girl out today?” She looks at you, your cage, the passed out asshole on the bed and grabs the cage with either annoyance or she’s just exhausted and weak, you can’t tell. <br>\r\n</span></div></div>",
            "created":1574529960,
            "id":2750626,
            "title":"The cheetah girl wakes first"
        },
        "11111112122211221":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "You follow her back to her room",
                "She takes you to back the pound"
            ],
            "content":"<div class=\"\"><div> <span>A thousand nerves in your head relax. Finally a friendly person here. You are getting away from this lion guy, step one Is almost complete. She looks at your cage, “Ok, how do I get you out of there? This is heavy.” You steady yourself to one side, she’s not lying and is having trouble carrying the cage, “On the table where your purse was, there should be an envelope with the key.” Moments later she plunks you down on the table and has you out of the cage. Then walks to the door of the bungalow, you climb down from the table and quickly chase after her, increasingly eager to leave. <br>\r\n<br>\r\nShe opens the door and a harsh bleaching blinding light hits both of your eyes.  It’s got to be noon? You both recoil, she far more quickly than you, and swiftly shuts the door. “Shit! Shit shit, oh man.” What could a giant cat be afraid of? Wait not giant, you are just small, and human in a land of creatures with little regard for you. “What’s wrong?” She doesn’t look at you but gestures to you and then her body, “What’s wrong? I’m naaaaaked! I can’t go out there like this. There are kids out there! Oh man, how much did I drink last night? Way to make bad choices girl, way to make badddddd choices.” Wanting to leave ever more desperately you replay last night in your head for answers, found them! “He threw your dress outside when you came here. It’s probably right outside the door.” She looks up, “Really? He threw my clothes outside? Fuck this guy. We are going to have to wait until those kids are gone. Then somehow survive that light.” You search solutions in your head. “Can wrap ourselves in the towels in the bathroom?” She sat against the wall pressing her paw against her head, “Maybe you could, but you really don’t want those towels anymore.” Mildly concerned about what she did to them you force the thought from your mind, “I’ll take your word for it, um, check his pants for his sunglasses, he had a pair when he got me yesterday.” A genuine look of appreciation appeared on her pained face, “Really? I’ll look around, um…. I really hate to ask, but….could you get my dress?” A shiver went up your spine, “Me? Out there? I’m naked too, I can’t go out there.” Desperation inches in on her face, “Please? Nobody cares about you being naked, your human, besides, your less naked than me.” Ire rises inside of you for her considering the chastity belt clothes, furthered by the fact it does at least cover something. Suddenly you are aware just how naked you are infront of someone, for the first time in what feels like days. An instinctual reaction causes you to cover your breasts. “What do you mean nobody cares, I’m still mostly naked.” She parts a pair of fingers to look at you, “Wait, you know you are naked? Aren’t you humans like always naked?” Where the hell did she get this idea?!? “Do you think we are always naked?” Her eyes closed and she resumed resting, “I’ve never seen a human in the wild before, only pets. I didn’t know you had clothes.” If nobody cares about naked humans you must really be somewhere you shouldn’t. You try to contain the shock this news brings you, “Um, yes, we have clothes, just like you do, or at least from what I understand anyway, most of us don’t go around naked, it’s highly unusual. I don’t exactly want to be naked now or most of the time really.” A genuine look of compassion crosses what uncovered parts of her face you can see, “Wow, um, I guess uh, I need to learn a little more about your kind, um, this is gonna sound really rude but can you please still get my dress? We’re both naked and need to leave, but the people outside won’t notice you like me.” <br>\r\n<br>\r\nShe’s right, it’s time to leave, what’s a few more of these creatures seeing you naked mean in the long run? Focus on the goal, power poise, objective clarity, now speak it, “Fine, I’ll get your dress, but you are taking me back to the pound and giving me the mark of approval I need to get this thing off of me and I can get back to my life, deal?” A hand the size of your forearm is help open in front of you, “Deal.” You high five the hand and she opens the door. The same burning light hits your eyes, you can’t see much but you can hear the door shut most of the way, kids playing dangerously close, and wind in the leaves. Colors start to materialize and in no time you find the dress, it’s a red strappy mini dress thing with a small opening running the length of one side. Cute. Feline children are indeed playing, uncomfortably close, they notice you for a moment then go back to kicking their ball around. It looks like the cheetah woman was right, nobody cares.<br>\r\n<br>\r\nYou drag the dress as carefully as possible back in. Inside it’s a black tomb while your eyes adjust. Her voice calls you over to her in the darkness, “Your name is Shannon Larrity right?” The dress is pulled upward out of your hands and you stand there waiting to see again. “Yea, that’s me…” A furry paw picks you up and puts you on the floor and lays you flat, then pulls your arms over your head. Suddenly you roll as you are wrapped up in something, “I found your wallet in his pants, next to his and the sunglasses you told me about.” Your wallet? The asshole must have been using your money, having it found restores some of your sense of self. You stop rolling on your back and she moves your hand to the unwrapped end of whatever she wrapped you up in. “Alright Shannon, lets go.” The door opens again and the light is less harmful. You follow her outside, her fur wrapped in the red dress is a breath taking combination. The gold rimmed glasses compliment everything nicely. She’s still wobbly in pain but you doubt anybody notices. The dress is barely long enough to cover everything, she must have been at a high end bar or club last night. You are caught off guard enough to forget you are covered for a moment. Looking down it seems she tore part of his pants apart to make you something that covers you comfortably. Granted it’s wrapped like a towel around you, but it goes from your armpits to your knees and you aren’t naked. “Hey, thank you. I appreciate this.” She looks politely down at you through the purloined sunglasses, “I had to find something for you, we can’t just accept being naked against our will go without a fight.” She shut the door softly, then locked it with the padlock and, after a few moments of struggling, yanked the key from the chain on the door. “Unlike last night this time this asshole is staying inside until I am satisfied.”  She slid the key into her cleavage and asked if you were read to leave. You couldn’t say yes fast enough. Together the pair leaves the lion behind and walks away from the bungalow. “My name’s Lucette by the way.”<br>\r\n</span></div></div>",
            "created":1574530920,
            "id":2750634,
            "title":"She turns out to be kind"
        },
        "111111121222112211":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "The elevator ride continues uneventfully",
                "The elevator makes stops on the way to the 17th"
            ],
            "content":"<div class=\"\"><div> <span>Upon walking down the lane something peculiar happens to your analysis of your situation. You are free from the lion pig, but not free at all. You can trust no one right now, Lucette seems to be trustworthy at the moment. Wandering off from her seems dangerous, who knows what the next person to grab you might do. They might do nothing, if you go through life fearing every one as a predator, you’ll live a stressed existence. Though here people are literally predators, even Lucette, she’s part cheetah, that’s not something to be disregarded. Thinking of Lucette, her pace has slowed and somehow she looks pale. She stops and holds a hand against her head, “Hey, I’m sorry but I’m gonna need to go back to my room, I’m having like a really hard time right now. You want to relax there for a bit?” This wasn’t getting you out of this situation any faster but you don’t see the harm, she genuinely seems to be in the throws of a significant hangover. “Ya know, I really could go for that. Lead the way.” <br>\r\n<br>\r\nThe direction didn’t change much at first, but before long your path leads to a very exclusive looking high rise hotel building. Luxury cars you’ve never heard of before lined the font. Perfectly graphite grey granite stones imitating natural rock form the walk into the building. You read it’s name, The Velt and below it another sign reads, “All humans on premises must checked in at the front desk to be tagged and picked up. Humans must be caged in all public areas. Unattended humans will be sent to the pound at their owner’s expense. Trespassing humans will be sent to the zoo.” Well it’s good to know humans seem to be considered barely tolerated vermin here. Lucette stops just out of earshot of the bellman. “Ok, stay close to me, don’t talk, and I’m going to have to put you in a cage to get you to my room. Can you trust me for this?” Reluctantly you agree. Being put back in cage has little appeal, wandering to the Pound alone has even less. She stands back up, “Sorry Shannon, I forgot this part, I’ll it over with quickly.” <br>\r\n<br>\r\nTogether you walk to the bellman and she pushes her way through the door impatiently, he almost lets it swing shut in your face, clearly distracted by the red wrapped cheetah woman.  She turns to him and scolds him, annoyed he demands she put a leash on you. In a swift motion she does indeed to that with her tail. All of that was done without her breaking eye contact with him, she concludes the interaction by flipping him off and walks away with you in tow.  You appreciate Lucette her sticking up for you. She smolders her way over to the front desk, catching many eyes along the way. She leans over the counter flirtatiously kicking up one of her legs in the process, “I’m going to my room and have a little human with me, what do I need to do?” Her tail lifts you by the collar up to the counter and leaves you there. That was an unpleasant surprise. Behind the counter a regal looking leopard woman sat in a Velt uniform. The look she gave you was one of near completely reluctant tolerance, then back to Lucette, “Room number miss?” Lucette squinted for a moment either the light or simply remembering something causing her pain, “1713”. The leopard plinked the keyboard for a moment and produced a small plastic band, that without any consideration to your consent grabs your leg and snaps it around your right ankle. “I’ll be back with the cage, remember in all public areas humans must be in cages.”<br>\r\n<br>\r\nLucette leans toward your ear discretely, “Steak, chicken, or vegetarian?” The woman was returning with the cage very quickly, not really sure about the context of the question you blurt out steak. Again with no consideration the leopard grabbed you off the counter top and deposited you in the cage. She really was not paying attention because when she shut the cage she shut Lucette’s tail in the door. She roared in shocked surprise and tried to extract her tail form the door but it was stuck. It took a moment for the leopard hadn’t realized what she’d done, that moment was significantly more obvious to Lucette as she howled “Open it!” twice before gaining the woman’s attention. Seeing Lucette’s fur up and teeth out was terrifying, there was a significant primal danger to her entire hungover day after club dress appearance. It was a very strange sight. Finally the leopard’s eyes got wide realizing how brazenly she was providing terrible customer service in front of the entire lobby. Lucette’s paws were on the counter and the claws were leaving scratches on the stone, she wasn’t moving, as if her anger was taking the energy from physically displaying her emotions and building itself instead. Calmly she demanded it opened again, the leopard was frozen. Lucette had had enough, she reached over the counter and grabbed her whiskers, calmly looked her in the eyes and growled out “Now would be a very good time miss kitty” The manager walked over, “What is the problem---Susan, release our guest’s tail immediately!” She didn’t so the manager produced a key from his keyring and did it for her. Lucette’s whole body collapsed, probably held upright but the adrenaline. She righted herself after a few moments to find the manager and receptionist’s eyes open with concern about their guest’s impending complaints. She ignored them tenderly running her tail through her hands and wincing when she found the injured part, about six inches from the end. <br>\r\n<br>\r\nIn a hurt hungover exhausted rage she picks your relocked cage up, snatches the key that as finally produced from the leopard’s hands and points to the manager with the hand holding her tail. “I expect a steak delivered to my room at four in compensation for this. Four o’clock, the savannah steak, 1713. And so help me if you broke any bones in my tail you will comp my entire visit here. Or you (pointing to the sign Velt behind the manager) and you (pointing to the leopard) cat scratch fever, will hear from my attornies, is that perfectly clear?” They were a bit stunned and she held her tail at them, “Do you know how important a cheetah’s tail is? Its how we run so fast! You know, our defining trait?!” The manager began a barrage of apologies and the leopard sat there still uselessly stunned. Lucette didn’t wait for them to finish as she rigidly walked to the elevator and mashed the button. Once the door closed she collapsed to her side.</span></div></div>",
            "created":1574742960,
            "id":2751833,
            "title":"You follow her back to her room"
        },
        "1111111212221122112":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "These teenagers are interested in Lucettte",
                "Horrifyingly they are interested in you"
            ],
            "content":"<div class=\"\"><div> <span>Lucette stood weakly and with the hand holding her wounded tail made a series of attempts to push the button for the 17th finally ending in scucess. She looked at the damage to her tail, then back to you. Her eyes were glossy and unfocused, her expression was blank, and she looks as if she’s about to pass out. Poor thing, between her hangover, a long hot walk at noon in the sun, no food and the shock to her system she’s having a rough day. She starts repeating “Almost back to the room, just a little further.” You don’t know if she’s talking to you or using the last of her strength to make it. Concern for her well being and yours forced a question up your throat, “Hey, Lucette, are you gonna be alright?” She’s weak but rigid, “Yea…I think so, I’m getting really dizzy. Lemme give you this, it’s too…” trailing off. With one hand clamped on a railing, she leans over and gives you the key to the cage. Too much? It weighs ounces, maybe she means too much to carry. <br>\r\n<br>\r\nThe elevator lurches, stops and opens. Outside a family of jaguars were waiting for the elevator. They were treated to the view right up the dress of Lucette as she was leaning over. The father figure and one of the girls grinned awkwardly, the mother figure covered the eyes of the remaining girl. The mortified matriarch urgently tries to address the situation, “Wow, um, we’ll catch the next one. Do something about this Percy! PERCY!” She slapped then slapped the shoulder of the father figure, “PERCY!” He broke his trance and returned to the moment, “What? Oh! What do you expect me to do? There’s no, ‘butt cheetah send on’ I mean, no ‘on cheeta butt send’, damnit I mean, ‘send cheetah on button’ out here.” She slaps him upside the head, “Really? Your children are right here. Right kids?” The girl with the hand over her eyes adds to the dialogue, ”I don’t see what either of you are talking about. My vision is spotty.” The other girl seeing a moment to inject some sass weighed in as kids do, “I’m with dad on this one mom. I’m pretty happy right here.” The mom throws her hands up, “Oh haha, very funny.” The elevator doors closed and the oldest kid’s eyes looked at you hungrily. Normally her gaze would cause you concern but at the moment you were looking at Lucette, she was struggling to stand back up. The elevator rocked as it resumed it’s ascent. Weakly she tried to communicate something but after incomprehensible syllables exited her lips she collapsed, rolling off your cage onto her back and swiftly out of consciousness.<br>\r\n<br>\r\nUrgently you being trying to work the key into the lock to get out to check on her. “Lucette? Can you hear me?” Your attention is on the lock but you keep talking to her trying to bring her back every way you can. “Lucette, babe, you gotta wake up so we can get to the room. Cammon Lucette! You don’t want to be that girl found passed out in an elevator.” Outside the flattened cat does not respond. The key is equally unhelpful. Eventually in frustration you shout her name at the top of your lungs. Right as the elevator door opens, you didn’t even know it had stopped. This is the 17th floor, down the hallway is her room, somewhere. The doors are open and the hallway awaits but you can’t leave Lucette like this, even if you had a choice. Outside in the hall you can see a shadow move, but with the lighting out there you cannot decide if it’s one person or many. From the footfalls it sounds like many. You hope against hope that whatever comes is going to be kind. Moments later what you heard approaching appears and is a trio of teenagers. A maybe bearish boy, a racoon girl, and another boy looking like an ox. They must have heard you and came to investigate.  Teenagers, great, not what you were hoping for. Well you are about to find out if they are good teens or bad. By their attire and attitude, a sinking feeling twisted your stomach into a massive knot. <br>\r\n</span></div></div>",
            "created":1574743080,
            "id":2751835,
            "title":"The elevator makes stops on the way to the 17th"
        },
        "11111112122211221121":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "The Minotaur collects you and Lucette for himself ",
                "Both of you are saved"
            ],
            "content":"<div class=\"\"><div> <span>The racoon girl looked down on the passed out cat, “Whoa, club candy is out cold.” The two boys advanced and she took a picture of the sight on her phone. The ox reached for her purse and started to fumble with the clasp. The bearboy however poked her face to see if she was close to waking. Your heart sank when her head bounced away from repeated pokes. This was unacceptable, the parallels between humans and furs were all too strong and this behavior filled you with a kind of focus and rage that supersede your diminished frame. For moments you mull over the potential dangers of attracting their attention, to hell with it, Lucette is the closest thing you have to a friend right now. The girl stood in the doorway keeping the elevator from departing, leaning against it’s side in amusement. The ox was pilfering her purse taking all the valuables he could find, and the bear had loosened the strings on her dress and reached between them to feel her breasts. Wholly unacceptable, but from your cage you can’t do anything.<br>\r\n<br>\r\nYou can’t do anything. But someone passing by could. Never before in your life have you considered calling for help, either too proud or not desperate enough, maybe even because that would acknowledge that you were in a situation that you cannot handle on your own. You take a deep breath to scream for help, wishing there was anything else you could do. You try to exhale but it doesn’t work. Another breath for a scream, and you squeeze air out more quickly. Another breath and you scream as loud as you have ever made noise before in your life, you see stars and your throat feels like it’s being torn apart by sandpaper. Your loathing of this moment bolsters your resolve to be heard by someone and you squeeze more volume from deep down inside. “Heeelp! Someone! Anyone! We need help! Please someone help!” <br>\r\n<br>\r\nAll three of the teenagers jump in unison, either not having noticed you or simply by the volume of your call. They wait a moment for you to stop howling. The girl stays by the door bemused, “Whoa, the runty bitch has some pipes on her, anyone else’s ears ringing?” The ox with the purse had dropped it and after looking you indifferently up and down continues pilfering it’s contents. The bear’s lust appears to have lined you up next for his attentions. First he tears Lucette’s dress wide open to expose her spotted tits, “Get a load of these, they are perfect.” Coldly the girl raises her phone and snaps another photo. “Better than mine? Careful how you respond bud.” He leaned over and started licking Lucette’s exposed chest, “Hey, that’s not fair, how can I compare what you have to these knockers?” The racoon didn’t respond. “Babe?” <br>\r\n<br>\r\nThe racoon was suddenly much taller than the boys, not taller, higher. She made a creaking sound that attempted to recover the boy’s attentions. “Guys…gaa uuyss!” Around her neck were massive fingers that hers’ couldn’t pry off. Standing behind her and holding her aloft with a single arm was a massive midnight black minotaur wearing an equally dark suit. The gold thread matched his jewelry and nose ring. The boys froze. A powerful and low voice rumbled up from somewhere in that suit. “That is no way to assist a lady.” The bear stood up immediately and squared off with the newcomer. “Lady? This is some piece of party trash that passed out –“ he had begun to point at Lucette and pick his next insult, couldn’t, and then turned to look down at her for more ammunition. The moment his eyes were off the minotaur a colossal booted foot blurred off the floor and kicked him square in the side through the bear’s arm. This sent the adolescent against the side of the elevator hard enough to rock the car. He slid down clutching his arm and side together. So surprised he didn’t offer any smart ass retort. Bovine eyes fixed on the ox, followed by the voice that sounded like it echoed from the end of the universe “Return the lady’s valuables boy.” He obeyed, only returning the cash. Do you point this out to the goliath? Could he be a bigger danger than some pervy teenage thugs? Obviously he has no issue being violent, and if his poise is an example, he will have little regard for any challenge you and Lucette could offer. He was still for a moment, “I see you have damaged the lady’s dress. How about you make amends, put your wallets and phones in her purse.” The boys hesitated, then he shook the girl, she tried to croak some instructions and then tossed her phone to Lucette’s purse and pulled a small studded walled from her vest and did the same. Apparently following their leader the boys did the same. “Not very good, I said in her purse, not on.” The ox scrambled to follow the instructions. <br>\r\n<br>\r\nThe tower of muscle took a heavy step into the elevator and retrieved your cage and placed it outside the door. Firmly he placed the girl down on her feet and went back to retrieve Lucette. Anxiously you watch as he picks her up. The ox takes a swing at him. It hits him right in the side of the face. It does precisely nothing. The ox realizes the height of his folly too late and the minotaur moves his whole body like rolling boulder and slaps the boy against the far wall. Sending him dazed to the ground. The girl assumes a defensive posture but makes sure to stay as far away as she can from the midnight titan. “The fuck was that mister?” Lucette is now in his arms as he turns and walks out, not concerned about any attack from the remaining teenager. “That was as you kids say, a bitch slap.” She stood over her dazed cohorts, “The hell it was, you sent him flying!” He turned around and in an amused voice responded, “It was indeed a bitch slap. I slapped him, and he took it like a bitch. Now give me your vest miss.” She stood with her mouth open, you were unsure if it was in regard of the comment. “Do I need to issue another bitch slap in this elevator?” She silently yanked off her vest and threw it at him. He exited the elevator and let it resume it’s journey. <br>\r\n</span></div></div>",
            "created":1574921940,
            "id":2752835,
            "title":"These teenagers are interested in Lucettte"
        },
        "111111121222112211212":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "Lucette's friend returns to find you caged on the floor",
                "The four o'clock steak comes knocking"
            ],
            "content":"<div class=\"\"><div> <span>Your chest unclenched, once the doors shut. You’ve worn corsets before, and played with a tightness to see what it was like to pass out and then aborted at the last moment. This was much the same. You two were safe from the teenagers. At some point you realize you sat down in the cage, still clutching the key and somehow have managed to keep your fabric towel dress thing in the same place. Now is this minotaur the flame under a frying pan? You silently hope not, the ease he handled those teenagers makes him a spectacularly intimidating slab of muscle.  Your concerns fade quickly as he turns and takes a knee so you can see Lucette better, he had just finished tucking the girl’s vest around her exposed chest before he spoke to you. “Forgive my bluntness miss, did they hurt her or you in any way?” His voice was deep, like a bass speaker. You respond finding your voice horse and scratchy from your calls for help, “Na-no. No, she passed out in the elevator and they found her. The bear boy thing undid her dress and felt her up, that’s all they did to her.” He turned his head away and asked an unseen party if they heard what you said. You listen for a person you’ve completely failed to realize is there and to your surprise you find her.<br>\r\n<br>\r\nSitting hidden behind a planter is a woman in a cage similar to yours with phone leaning against the inside bars, “Yes master, just a sec.” She continues talking into the phone, you can’t exactly hear what she’s saying from here, a moment later you hear the phone’s end of call chime. She turned to her…master and with great relief informed him that security is waiting for the teens at the elevator in the lobby. <br>\r\n<br>\r\nHis attention returned to you, “I assume that was you I heard. That was a very brave thing you did little one.” You still haven’t stood back up, either the scream or nerves having taken more than their fair share of your energy, “Well she is my friend, or I think she’s my friend, even if she isn’t what they were doing was entirely vile.” His hand stretched out and brought the other caged woman next to you. Your eyes stay on Lucette hoping to see signs of her waking up. “So what has caused your friend to pass out in the elevator?” You have no desire to expose her hungover state but there is no alternative, “I think she partied too hard last night.” Calmly he makes a comment about how he understood from his party days, it was a comforting tale that was probably designed to calm and might be embellished. Finally he introduced himself, “Well brave one, I’m Mr. Bowman, what are your names?” He was significantly the most polite person you’ve met to date, “My name is Shannon, my friend here is Lucette.” He repeats your name slowly, asking for your last name. “Oh, Shannon Larrity.” He looks you in the eye, more like a peer than anything else, “Well Miss Larrity, it’s a pleasure to make your acquaintance. Do you know  Lucette’s last name?” Much to your embarrassment you don’t, but when would you have learned it anyway? “I’m afraid I do not we’ve just met.” The woman in the cage next to yours politely adds her analysis, “Excuse me master, the tip of her tail seems to be hurt.” Instantly his eyes find the damage and his demeanor becomes slightly more serious, “Is this injury from a different event miss?” Your annoyance about the cage returns swiftly without anything more serious to distract you from it, “Yes, the woman who locked me in here shut her tail in the door and didn’t get it out quickly.” The woman honked a stifled laugh out, “Lemme guess, a leopard behind the front desk?” You nod. The minotaur snorts angrily. “Miss Larrity, this is my prized property Miss Eva. Miss Eva, this is the brave Shannon Larrity.” The woman waves at you with a genuine excitement to meet another shrunken woman in the same situation. <br>\r\n<br>\r\n“Your friend here needs her rest. If you will allow me I will take you both to your room.” To your surprise you remember the room number through the events of the last few minutes, you don’t recall making a note of it. “Our room is 1713, it would be great.” He has unlocked the woman’s cage, “By all means. Miss, Eva would you mind finding their room key please?” Hurriedly she has already plunged head first into Lucette’s purse, “Of course master.” Extremely long legs remained outside the purse as she rooted around. The both of you sit in silence for a moment before she exits the purse with the room key. “I’ve found it master.” She hands it to him and returns to her cage. <br>\r\n<br>\r\n“Thank you, now can you help me get our neighbors to their room?” She pauses a moment and stretches her legs and hips, then her upper body and arms. “Of course master.” She has the build of an Olympian, muscular, feminine, tall, golden hair, and a light blue toga to complete the look. It’s see through showing off more of her body, and doing precisely nothing to hide the large golden nipple rings. With a bit of envy you notice she’s not wearing the lion’s head between her legs, but has a third golden ring piercing there too. With little effort she approaches and grips your cage and as the minotaur stands back up, to a near titanic height, she drags you nearly effortlessly behind him. <br>\r\n<br>\r\nUnsure just what social etiquette is appropriate you blurt out, “Hi?” Eva responds with a shockingly little amount of strain in her voice. “Hey there, how are you doing? That was quite the scare.” That was more relaxed than you expected. “I think I’m ok for now, how about you?” She continued dragging your cage down the hallway easily, “Oh you know, I’m eighteen inches tall, so…my aspirations for the day are….low.” You chuckle with that terrible pun, you hope she’s not completely miserable behind the humor. “So have you been at this place long? I just go here three days ago.” She shot you an apologetic look, “Lemme guess, they had you collared shrunk pretty fast didn’t they?” With some annoyance you flick the loop on your collar, “Yep, apparently I’ve made some mistakes, you?” She grins with some regret, “Same.” Her collar was infinitely more ornate than yours, not just a gold band twisted into a hinged loop, hers was what looked like guided lace, covering a considerable bruise. You point to her neck, “That’s a fancy collar, did he do that to you?” She strains for a moment dragging you over the change of flooring leading into 1713, “Yea, it’s pretty isn’t it? He had it ready when bought me out of the Ty-ups shop. I thought I was gonna get out at the end of the day, but apparently at the end of the day, if you are human their option to buy you permanently comes up before your option to be released or go for another day.” Well that’s terrifying news, “I’ll make a note to never try that, I meant what happened to your neck” Her tone changed from amusement to dislike, “Oh that, that was the spotted bitch behind the front desk.” The same woman? “Do you mean that leopard woman?” Eva chuckles, “Yea, if she’s still down there with my master gets there, there will be hell to pay.” <br>\r\n<br>\r\nTogether all of you have stopped outside 1713. Mr. Bowman points to the door next down the hall and informs you that they are in 1714. With no effort he opens the door and holds it for you two ladies before entering. He carefully follows making sure not to bump Lucette or Eva’s empty cage. Seeing an 8 foot tall mythical creature move silently is just one more surreal thing you didn’t think you’d see. With a pang of unease you watch him carry her into the bedroom, but your faith is rewarded when he returns a moment later and goes to the kitchen to retrieve a towel wrapped ice pack and glass of water to put in her room. Eva patiently leans on the bars of your cage but at their farthest point, trying not to alienate you. Once you relax for a moment your mind digests your situation some. For the first time you have the chance to talk to another woman, a human woman, about this trap you’ve wandered into. Just as you open your mouth to start the first question of a barrage piling up in your mind. Mr. Bowman returns to the living room and snaps his fingers pointing to the empty cage. Eva stood up and immediately began walking back to hers, “Wait! Eva! I have so many questions!” The colossus walked past you and closed the blinds. Eva shouted back from across the room, “If our owners get together to talk I’m sure I’ll be able to give you some answers ok?” As he walked back he took a knee and looked you in the eye, “If you need anything Miss Larrity, please don’t hesitate to call. We will be back sometime after eleven pm. If Miss Lucette hasn’t woken back up please leave us a message and I’ll see she receives medical attention.” That was extremely courteous, you do your best to say thanks to the generous offer.<br>\r\n<br>\r\nWith that he stands back up, retrieves Eva, she waves and they walk out the door. Leaving you trapped in her room, but more importantly trapped in the cage still. You forgot to ask them to let you out. With nothing better to do, you try the key in the lock again. Maybe in a calmer place it will work this time. It doesn’t. You shake the cage door violently for a moment and decide just to wait. Lucette is gonna let you out, you will relax for a bit, then you can go back to the pound and resume your plan of getting out of this nightmare. Feeling safe around her you unwind the fabric covering you and lay down on it. The room was dark, cool and critically, safe. It’s a perfect place for a nap, and instantly sleep comes to visit you. <br>\r\n</span></div></div>",
            "created":1574922120,
            "id":2752837,
            "title":"Both of you are saved"
        },
        "1111111212221122112122":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "After some further relaxing and recovery it becomes time to return to the shop",
                "Knocking on the door interrupts the peaceful moment"
            ],
            "content":"<div class=\"\"><div> <span>Polite repetitive knocking rattles through the door to Lucette’s room and into your sleeping fantasies. It continues with muffled sounds, unending and eternal they slowly become clearer. “Room service for Lucette Winspear, room service.” Thumping and feline squeak drift into your sleep and gently wake you up. For a few moments reality is surreal and you confuse your dreamscape and reality. Eventually it sets back in, like falling down into a pit. The cage is still all around you, the room is still massive, and you are naked but still comfortable and safe. Lucette might be awake, memories are not exactly reliable when mixed with dream soup. With any luck she will be here in a moment. <br>\r\n<br>\r\nHer voice pierces the dark, “Shannon? Where are you Shannon?” FINALLY! Time to get out of this cage, “I’m in the main room Lucette!” Her footfalls quickened and did the concern in her voice “Shannon? Shannon Larrity? Are you here?” Again you reply, but she didn’t hear you. Finally she comes hastily out to the room and finds the cage and the woman inside standing and waving to her. “Oh thank goodness, there you are Shannon. Lets get you out of there right now. I am so sorry.” Lucette approaches topless, the remains of her dress hanging around her hips. Quickly you hold the key out for her and she takes it, all but tearing open the door for you to leave. Instantly you do just that feeling far better about the entire situation. “I woke up and realized I didn’t know how I got back or what happened to you. I feared the worst.”<br>\r\n<br>\r\nBy the time you exit she has already walked to the door. Either uncaring about the state of her attire or oblivious. She opened the door and a warm light permeated the dim room. A racoon teenage boy or maybe young man stood in the hallway with a cart that had a dome covered plate on it, “I have your Savannah Steak Miss….” He trailed off mid-sentence clearly distracted by Lucette’s undress. She looked at him waiting for him to wheel the cart inside and with a grunt of disapproval covered herself as best she could with one hand and with the other pulled the cart inside with the other. He snapped back to attention red faced, or would have been red faced, under the fur. Lucette’s annoyance was on the surface and even from behind you could read it. He stuck his hand out expecting a tip, he must be new, her body language was not of someone feeling generous. Her hands dropped to her legs and only her wrists moved in an agitated staccato manner pulled her dress the rest of the way off. A quick flip of one of her legs kicked the dress into the hand not holding the door and she struck a pose for a moment. The boy’s bewilderment could probably have been seen from the other side of the ocean kissing the side of the resort. Mid bewilderment the dress holding arm became the only source of motion as she threw the ruined red dress into his face and shut the door before he could remove it. <br>\r\n<br>\r\nThe naked cheetah was far more energetic now, and coordinated, probably having slept off the worst of her hangover. She picked you up and hugged you. Being smushed between another pair of breasts, still not a welcome feel. But wasn’t cold and scaly like the last set. She released you onto the couch and wheeled the cart over. The couch is tough to walk on but you manage a few steps back so you can more easily communicate with her. “You are looking a lot better, did you have a good nap?” She smiled in relief at you, “OMG, so much better. So before we talk about anything else, what the hell happened? Last thing I remember is yelling at the people behind the front desk.” <br>\r\n<br>\r\nYou recap few minutes following her tail getting shut in the cage to Mr. Bowman returning the both of you here. Following the tale Lucette seems to be more grateful for you sticking your neck out than she was concerned about having passed out in the elevator. She must party hard to be accustomed to it? <br>\r\n<br>\r\nShe removes the dome of the plate and begins to work with some utensils you cannot see., “Well at least I didn’t ruin my dress for once. Bastard teenagers. I’m gonna need another shower, fucking perverts.” Hunger hits you like an avalanche, it just no occurs to you that you have not eaten since the pound? Did they feed you? No they did not. How did you manage to survive almost three days with no food and not notice? “You are all kinds of alright little hum---I mean Shannon. Thank you, I really appreciate what you did for me today.” Momentarily one of these giant furs being appreciative catches you off guard, “You are welcome. We can’t just let someone walk all over us right? Besides, when I went for nights out with the girls we never left one behind.” She stopped with the utensils and leaned over the cart, “I think you would be fun to have a night out with.” That was an unexpected comment of camaraderie, “Wow, um thank you, but I think I need to get, ya know back to normal before I go out for drinks.” She leaned back and went back to the dinner, “What? Oh tonight? No no no no. We gotta get you back to your normal height and get those things off of you. Then I can introduce you to my friends and we can go dancing or something.” Looks like you have made a friend. “Yes, think that sounds like a ball.” She leaned back over the cart at you, offering a small plate, probably an unused coaster for a drink, covered steak cut to small pieces and the accompanying sides. <br>\r\n<br>\r\nLooks like you have made a friend that views you as a peer here. Well you are stuck tiny but it’s good to know that even if nobody else does, Lucette has your back. Internally emotions threaten to break out of your control but will power molds them back into enjoyable quantities and shapes. She rounds the cart and lays down naked behind you on the couch, which is a little uncomfortable for you. She flips the TV on and places her plate on her stomach, “You don’t mind if I watch racing do you? It always seems to be on when I’m getting through a hangover, it’s almost tradition at this point.” With all the tires and engines’ noises that seems like the opposite of what anybody would need but to each their own. Your mouth has a golf ball sized bite of steak in it so a thumbs up is the best approval you can offer. Far above you on the couch she pauses mid first bite of steak seeing you have to use your hands. Once the meat was in her mouth she pulled out the fork and casually tosses the fork on to the floor and enjoys the rest of the meal with her fingers. A few minutes into your meal a spotted fingers wrap themselves around your waist and slides you back against her thigh, at first you are uncomfortable being pressed against another naked woman, but after placing you there she resumes eating without a word or a look. It was far superior to sitting on the edge of falling off. You relax against her leg and eat the rest of your meal as content as you have been since arriving here.<br>\r\n</span></div></div>",
            "created":1575574980,
            "id":2755880,
            "title":"The four o'clock steak comes knocking"
        },
        "11112":{
            "author_id":"humanturian",
            "author_name":"HumanTurian",
            "choices":[
                "You want something tender; you pick Brad",
                "You like it rough; you pick Gunther"
            ],
            "content":"<div class=\"\"><div> <span>One customer steps forward: he's an alligator, easily six-foot-ten and absolutely massive, with form straining against his cut-off jean shorts and red suspenders. He's got a swollen gut that hangs a good half-inch over the waist of his shorts, and his arms and legs are meaty enough to rival your torso in thickness. At the end of his long, broad snout is a bone, which he wears like a barbell piercing, gleaming white. <br>\r\n<br>\r\n\"Oh yeah,\" he grunts in a rumbling baritone, thoroughly looking you over. \"I like you. Nice smooth skin and light tone, not hairy, and you got a sweet little mouth.\" He reaches forward, grasping your leash and jerking you into his gut. \"So how about it? You wanna walk on the wild side?\" <br>\r\n<br>\r\nA hand claps onto his. <br>\r\n<br>\r\n\"You know better than to be rough like that,\" another anthro chastises the gator. It's a bull, with a chiseled physique under his shining ebony fur. He's much shorter than the alligator, only an even six feet, and wearing even less clothing (just a skinny side Rio bikini that's lime with yellow-and-blue Hawaiian flower patterns on the front and back, the hip straps being royal blue). His pearl-white horns are fairly short and don't look especially sharp, but he still says, \"Gunther, do I have to have an argument with you about this <i>again</i>?\"<br>\r\n<br>\r\nThe gator growls. \"Back your ass up, Brad! I saw him first, so I get him!\" <br>\r\n<br>\r\n\"Why don't we let the man decide for himself?\" Brad suggests. \"If you don't trust him to figure out which of us he wants, then how do you expect him to give you any?\"<br>\r\n<br>\r\nGunther thinks it over for a moment, and then grins toothily. \"All right, I like that idea. So who's it gonna be, shrimp?\"</span></div></div>",
            "created":1313125200,
            "id":1167177,
            "title":"A massive, wide Gator with a nose-bone"
        },
        "1112":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Pick Up Somthing Else",
                "Go back out the shop door and to the \"Tye Up Rooms\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Clamps around your neck and you grow to massive size, you hear a faint sound about price in your ear but can't make it out, you also notice that you've grown alot more fur.. you've become a huge wolf </span></div></span></div>",
            "created":1054184400,
            "id":159581,
            "title":"Huge Dog Collar"
        },
        "11122":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Tie them too You",
                "Tie them to someplace"
            ],
            "content":"<div class=\"\"><div> <span>You move through the corriders, getting only the occasional look at your large form, most people are smaller than you, but you follow the signs to the designated ball room. you look by your feet and see a few humans on the ground, looking around, you smile broadly \"This is going to be FUN\" you chortle </span></div></div>",
            "created":1054875600,
            "id":160713,
            "title":"macro wolves and there tie ups(WIP)"
        },
        "111221":{
            "choices":[
                "Penis",
                "Somewhere else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Grining evily you seize 3 screaming humans and tie them to your..</span></div></span></div>",
            "created":1189400400,
            "id":443540,
            "title":"Gotcha!"
        },
        "1112211":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "They start licking your penis",
                "they refuse to; they've chosen their fate"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You order the humans to \"suck me off, or else!!\"</span></div></span></div>",
            "created":1245474000,
            "id":711316,
            "title":"Penis"
        },
        "11122112":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Back to the tye-ups shop"
            ],
            "content":"<div class=\"\"><div> <span>You hear chatter from your penis danglers. \"WELL, WHAT WILL YOU DO?\"<br>\r\n<br>\r\nYou hear \"no, we still have our pride!\"<br>\r\n<br>\r\n\"FOOLS! YOU HAVE NEVER HAD PRIDE! AND NOW YOU NEVER WILL!\" you push them into your cock; an undreamed of rush of pleasure went shooting up through your body. You could clearly feel the furs pushing away from your cock, and could hear \"no!!!\" Don't do that, you thought, you'll only die tired! You chuckle and push, with no effort at all, on the furs. They slide in.<br>\r\n<br>\r\nThe journey down was not faced with enthusiasm by the furs, (to say the least!). Many cries could be heard from outside as the furs went through the stage of the grieving process  when they find out for certain that they're going to die.<br>\r\n<br>\r\nYou chuckle to yourself, thinking \"hey, we all grieve in our own way!\" You look down and laugh out loud; you could see screaming faces as the furs slide into your balls, or their new name, your \"orbs of triumph!\"<br>\r\n<br>\r\nThe furs land in your balls; its soggy, and smelly in there! There's a shallow pool of creamy liquid; the furs scream out. Then they all run to the wall and start pounding, \"trying\" to break through the membrane of flesh that is your balls.<br>\r\n<br>\r\nYou chuckle again, feeling this stimulation, and think \"Pound all you like, ALL you're doing is quickening your own demise; awakening my nuts, and telling them to start producing the liquid that will ultimately bring your deaths! PLEASE continue to pound, you're making me feel FANTASTIC!!\"<br>\r\n<br>\r\nThe furs soon realize that pounding on the nutsack wasn't a good idea, because the valves above their heads contracted, expanded and opened, and some more of the creamy liquid that was making their feet soggy, began to pour out.<br>\r\n<br>\r\n\"Having fun?\" you say to the furs, \"I have been, and am right now. This will never compare to the pleasure you'll give me, while unwillingly ending your lives!\" You chuckle, and head off to a tree to lay down, to start pumping.<br>\r\n<br>\r\nThe furs are now chest high in cum now. They're forcibly sent up the tube they came down. It seemed that the exit was in sight; it was a glorious sight! Their hopes were shattered when they saw your claw cover the hole. The furs were pushed up against the claw. <br>\r\n<br>\r\nYou began to rub harder and harder. <br>\r\n<br>\r\nThe cum was slowly tearing the furs apart.<br>\r\n<br>\r\nAfter two minutes of vigorous shaking, you remove your claw. Your tongue was hanging out the whole time.<br>\r\n<br>\r\nLike a shaken up soda can, the furs were propelled out at lightning speed to splatter against the tree.<br>\r\n<br>\r\nYou lay on the ground, twitching from the pleasure for several minutes.</span></div></div>",
            "created":1299992400,
            "id":1069973,
            "title":"they refuse to; they've chosen their fate"
        },
        "1112212":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "taunting"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You tie them to your toes! </span></div></span></div>",
            "created":1299992400,
            "id":1069976,
            "title":"Somewhere else?"
        },
        "111222":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I think you'd all make wonderful rings for my stinky toes!!\"</span></div></span></div>",
            "created":1249189200,
            "id":737660,
            "title":"Tie them to someplace"
        },
        "1112221":{
            "author_id":"heythere",
            "author_name":"Bobbeh",
            "choices":[
                "Pheonix",
                "Dragon"
            ],
            "content":"<div class=\"\"><div> <span>You pick the humans up and press them against your grey paws \"hahhhahaa how does it smell?\" you say as the humans are pressed against your black pads \"hahahahaaa that feels good feeling flesh on my warm pads!\" you scream in pleasure \"please noooo dont make us do this! please!\" the humans plead \"hmmmm\" you think to yourself, \"ahhh ok then\" you say as you pull them away from your paw \"lick my pads clean humans!\" you order the humans \"p-p-please....no\" one of them begs as you extend your paw towards them. \"YES! YES!\" you scream at them \"you will lick them! or else!\" your voice booms at them \"ok ok wel lick them!!!!!\" says the humans. They start to lick your pads \"yes thats right lick them in fear!\" you say in pleasure. Then all of a sudden you hear someone behind you say \"hey! stop that! leave them alone!\" someone screams \"huh?\" you ask turning around. You look behind you and see a figure about the same size as you \"you heard me! i said leave them alone!\" it says again, you see the figure and its a.......</span></div></div>",
            "created":1267678800,
            "id":845919,
            "title":"Continue"
        },
        "11122211":{
            "author_id":"heythere",
            "author_name":"Bobbeh",
            "choices":[
                "\"ok lets go\"",
                "\"no thanks\""
            ],
            "content":"<div class=\"\"><div> <span>You see a pheonix standing behind the same size as you are \"no torturing the smaller customers!\" it says \"oh? sorry i...uhhhh didnt know\" you say nervously the pheonix looks down at the humans \"oh so sorry about that it wont happen again\" it says as the humans leave the room \"what was that all about?!\" she asks you angrily \"ummm...sorry i didnt know i....im sorta new here\" you respond \"wait.....new...here? all anthros know of this place unless...\" she looks at your collar \"ahhhh thats why\" she says taking your collar off \"hey what the.......???\" you say as you return to your normal human self \"so your a human! that explains it!\" it says staring down at you \"look im sorry i didnt.....\" \"say no more\" it interrupts \"newbies tend to do this\" it says \"anyways im Sarah and you are\" she asks \"oh im Kyle\" you respond \"well hello Kyle\" she says picking you up \"you seem lost, howd you get here little guy?\" she asks \"umm i dont know i just ended up here\" you answer \"hmmm how about i take you to my place little guy?\" she asks \"we can get to know each other better...you know\" she asks you softly \"uhhhhh......\" you think to yourself</span></div></div>",
            "created":1267678800,
            "id":845925,
            "title":"Pheonix"
        },
        "11122212":{
            "author_id":"tom11",
            "author_name":"nope!",
            "choices":[
                "Drop them on your giant cock!",
                "Put some in your smelly sock!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey! Don't start the fun without me!\" The dragon says with a sly grin, walking over next to you and sitting down next to you, rubbing a paw on some of the humans and smirking down at them. \"Hey there, I'm Jacob, nice to meet you. I think we could have a lot of fun together....What's your name?\"<br>\r\n\"Kyle. Nice to meet you! Now then let's get back to torturing these puny bugs!!\" You say, grinning and slamming your paws down and knocking some of them over as you chortle above them, picking about half of them up and rubbing them across your enormous, musky paws, and pinning a few between your toes, where the smell was by far the worst. 'What will I do with them next?' You thought...</span></div></div>",
            "created":1281762000,
            "id":936281,
            "title":"Dragon"
        },
        "111222121":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "The humans do it in fear, and recieve a surprise (reserved)",
                "Those cocks are smelly, they don't do it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You say \"Lance, I think some of these humans would serve their purpose if they licked our cocks.\"<br>\r\n<br>\r\n\"Brilliant idea Kyle!! The dragon addressed the trembling humans, \"listen up, we want you all to lick our cocks!\"</span></div></span></div>",
            "created":1333774800,
            "id":1311053,
            "title":"Drop them on your giant cock!"
        },
        "113":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Spank!",
                "Tickle!"
            ],
            "content":"<div class=\"\"><div> <span>You pass by racks and other torture devices in a lazy faishon. Then you bumb into a shifty looking Wolf in a trenchcoat<br>\r\n<br>\r\n\"Hey Buddy\" He says in a low whisper<br>\r\n<br>\r\n\"If you had to choose between a spank or a tickle what would you choose?</span></div></div>",
            "created":1175490000,
            "id":394913,
            "title":"Spank or Tickle?"
        },
        "1131":{
            "author_id":"readasaur",
            "author_name":"Readasaur",
            "choices":[
                "\"Do you like Spanking?\" ",
                "\"Do you like Getting Spanked?\"",
                "\"My room isn't far from here...\" "
            ],
            "content":"<div class=\"\"><div> <span>You gulp at the question, forbidden fantasies that occupied your mind when ever you got aroused started to rise to the forefront. <br>\r\n\"Which one...?\" You tried to stall, but there was only one real answer. You knew it was dangerous to voice your desires to a stranger, especially in a place like this, but if there was even a small chance he could grant it...<br>\r\nYou look around nervously as the wolf lifts his fedora and leans closer to listen. \"I... I guess... Spanking...\" You try to say casually, but you can't hide the desire in your voice as you say it. <br>\r\nThe Wolf grins at you, a predatory smile that only a guy like him could manage. \"Is that so? Well...\" </span></div></div>",
            "created":1303621200,
            "id":1093709,
            "title":"Spank!"
        },
        "11311":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "The Males, Consist of a Raccoon, a Stag Deer, and a Skunk",
                "The Females Consist of a Zebra, a Giraffe and Jackrabbit"
            ],
            "content":"<div class=\"\"><div> <span>\"Yes...\" You say \"I do.\" <br>\r\n<br>\r\n\"Then boy do I have something to show you.\"<br>\r\n<br>\r\nYou have two choices of three potential spankees three males, three females each individual a different species <br>\r\n<br>\r\nChoose your victims based on gender preference. The Wolf Said<br>\r\n<br>\r\nWhich one do you choose?</span></div></div>",
            "created":1342242000,
            "id":1378786,
            "title":"\"Do you like Spanking?\" "
        },
        "1132":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Be tickled",
                "Tickle someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I'd rather be tickled\" you say quickly<br>\r\n<br>\r\n\"Good for you!\" Says the wolf \"Tell me would be tickled or tickle someone else?\"</span></div></span></div>",
            "created":1175490000,
            "id":394914,
            "title":"Tickle tickle tickle"
        },
        "11322":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Dolphin",
                "Husky"
            ],
            "content":"<div class=\"\"><div> <span>'I'd rather tickle someone else\" You say quickly beginning to get nervous<br>\r\n<br>\r\n\"Wonderful!\" Exclaims the wolf \"Come with me.\"<br>\r\n<br>\r\n<br>\r\nHe leads you to the stocks area where you seea female Anthro Dolphin and and a male anthro Husky in stocks waiting to be tickled<br>\r\n<br>\r\nthe Dolphin looks happy to see you and the Husky looks nervous<br>\r\n<br>\r\n<br>\r\n\"Who do you choose?\" asks the Wolf<br>\r\n<br>\r\n </span></div></div>",
            "created":1175490000,
            "id":394916,
            "title":"Choose a tickle victim"
        },
        "113222":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "to suck his toes",
                "to use a toothbrush on his feet"
            ],
            "content":"<div class=\"\"><div> <span>You approach the Husky who looks less then pleased you chose him.<br>\r\n<br>\r\n<br>\r\n\"Oh please not me!\" He whines  \"Why don't you do it to<br>\r\nBonney over there she likes it!\"<br>\r\n<br>\r\nThe Bottlenose dolphin Bonney just giggles and says \"You know you like it to Bruce!\"<br>\r\n<br>\r\n<br>\r\n\"You carefully remove Bruce the husky\"s shoes than his socks you tickle his paws and he howls hystericly<br>\r\n<br>\r\nyou then decide</span></div></div>",
            "created":1175490000,
            "id":394918,
            "title":"You luv Doggies!"
        },
        "114":{
            "author_id":"readasaur",
            "author_name":"Readasaur",
            "choices":[
                "Male",
                "Female",
                "Naked, and hotter than hell. "
            ],
            "content":"<div class=\"\"><div> <span>You approach the display of kinky underwear, some of which is just glorified string. <br>\r\n\"Hey...\" A voice surprises you into turning around. \"I was having a look around, but I just can't make up my mind if I don't have a second opinion. Would you mind helping me out? I want to model some of these for you, and you tell me which ones you like. Just to be fair, I'll do the same for you. Interested?\" <br>\r\nThe speaker is... </span></div></div>",
            "created":1303621200,
            "id":1093726,
            "title":"Thongs and undergarments."
        },
        "1141":{
            "author_id":"readasaur",
            "author_name":"Readasaur",
            "choices":[
                "Human.",
                "Anthro. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Definitely a guy. <br>\r\nAnd his species was... </span></div></span></div>",
            "created":1303621200,
            "id":1093727,
            "title":"Male"
        },
        "11412":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He was a brawny Arabian Stallion pure white, with bright blue eyes.<br>\r\n<br>\r\n\"Well?\" He said<br>\r\n<br>\r\n\"Uh...Yeah sure.\" You say</span></div></span></div>",
            "created":1342242000,
            "id":1378790,
            "title":"A Horse is Horse"
        },
        "1142":{
            "author_id":"readasaur",
            "author_name":"Readasaur",
            "choices":[
                "Anthro.",
                "Human."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A damn fine woman! <br>\r\nShe was a... </span></div></span></div>",
            "created":1303621200,
            "id":1093728,
            "title":"Female"
        },
        "11421":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>She is a pretty nice skunk, she doesn't even smell that bad as far as skunks go!<br>\r\n<br>\r\nShe is black and white with long white head fur that she wears long and loose.<br>\r\n<br>\r\nShe has big blue eyes that seem to draw you in<br>\r\n<br>\r\n\"Well...\" She whispers \"Are you ready?\"</span></div></div>",
            "created":1342242000,
            "id":1378791,
            "title":"A Striped Skunk"
        },
        "12":{
            "author_id":"talonsaurn",
            "author_name":"Talon",
            "choices":[
                "Just walk right through, you don't like any of this stuff",
                "go to the spice/flavoring rack",
                "as one of the other shoppers for help",
                "pick up a jug of water",
                "Pick up a Skillet"
            ],
            "content":"<div class=\"\"><div> <span>You take the most well worn path wich leads to a store called \"For all that ails your tender stomach\"<br>\r\n<br>\r\nYou look around the shop, it's vaguely like a cooking shop crossed with a natural food store. Though there are countless things that are far less wholesome looking around with tiny price tags you can't read </span></div></div>",
            "created":1054184400,
            "id":159628,
            "title":"A cookery Shop?"
        },
        "121":{
            "author_id":"fenristhewolf",
            "author_name":"Fenris",
            "choices":[
                "Try a potion to allow one to be eatten alive.",
                "Try a potion to make you smaller."
            ],
            "content":"<div class=\"\"><div> <span>You approach a beefy yet attractive Charr standing in front of a rack of potions.  You've heard of Charr before these large burly monsterous felines with horns hail from a land called Tyria (Guild Wars Universe) and they are known as strong warriors and great craftsmen.<br>\r\n<br>\r\nThe Charr has a coloration similar to a white tiger and greets you.  \"Welcome, we have a potion for anything want to be big or small cuddle your lover inside you or snuggle inside them without fear of harm for an evening of passion.\"</span></div></div>",
            "created":1356498000,
            "id":1494715,
            "title":"Talk to the Charr in front of the potion rack"
        },
        "1211":{
            "author_id":"fenristhewolf",
            "author_name":"Fenris",
            "choices":[
                "Sure, *climb into his lap*",
                "Sure, *bend over and prepare to suck him off*",
                "Eh, cash only get on with the demo."
            ],
            "content":"<div class=\"\"><div> <span>You explain you want to try the potion to allow one to be eatten alive safely.  The Charr grins looking you over.  \"Mmm good choice I can show you how it works for a small fee how about it?<br>\r\n<br>\r\nYou agree and the Charr leads you back to a comfy bedroom with some wine.  He slowly disrobes grinning at you and you see the bulge under his loincloth.  \"So are you ready to pay the fee?\"</span></div></div>",
            "created":1356498000,
            "id":1494716,
            "title":"Try a potion to allow one to be eatten alive."
        },
        "12111":{
            "author_id":"fenristhewolf",
            "author_name":"Fenris",
            "choices":[
                "Grip his horns and kiss him.",
                "Go down on the cat's cock."
            ],
            "content":"<div class=\"\"><div> <span>*You climb into his lap and he rubs those big warm paws over you taking your clothes off and then his.  He hands you the potion and you drink it down.  As you finish it he hugs you and starts to grind his feline shaft against your groin and licks your face softly.  The big charr purrs loudly rubbing his belly against you as he gets more turned on.*</span></div></div>",
            "created":1356498000,
            "id":1494718,
            "title":"Sure, *climb into his lap*"
        },
        "121111":{
            "author_id":"fenristhewolf",
            "author_name":"Fenris",
            "choices":[
                "Let him take you.",
                "Stroke the big kitty's belly."
            ],
            "content":"<div class=\"\"><div> <span>*You grip his horns and kiss him.  The charr purrs loudly and fondles your back and rump as he kisses deeper licking all over your face and you feel him roll back as his large feline cock presses between your butt cheeks and he thrusts into you as he pulls you over opening wider licking your whole face.*</span></div></div>",
            "created":1356498000,
            "id":1494720,
            "title":"Grip his horns and kiss him."
        },
        "1211111":{
            "author_id":"fenristhewolf",
            "author_name":"Fenris",
            "choices":[
                "He gets his rocks off then eats you.",
                "He takes you then decides to take you inside a different way."
            ],
            "content":"<div class=\"\"><div> <span>*You happily accept and gently push back letting the burly charr take you and boy does he.  You feel him twist a bit as he screws his way into you and you yelp as his shaft seems to swell inside you but you realize you seem to be getting smaller.  The charr grins and explains the potion is working as intended but before you can protest he shoves your head into his mouth those warm jaws easily wrapping around your head while the big cat bucks his way deeper into your rear.*</span></div></div>",
            "created":1356498000,
            "id":1494724,
            "title":"Let him take you."
        },
        "12111111":{
            "author_id":"fenristhewolf",
            "author_name":"Fenris",
            "choices":[
                "He slurps you down without another thought.",
                "He uses his tongue to have some fun first."
            ],
            "content":"<div class=\"\"><div> <span>*The Charr keeps up his pace and your rear begins to ache as he grinds back and forth inside you and it gets tighter as he swallows around your head licking all over your chin and neck.  He moans and rams into you spurting his warm seed into your rear pumping you full as he rubs those big paws all over your body holding you as he gets his rocks off.  The big cat murrs licking at your chest as your view is cut off in the warm tight dark of his throat.*</span></div></div>",
            "created":1356584400,
            "id":1495589,
            "title":"He gets his rocks off then eats you."
        },
        "121111112":{
            "author_id":"fenristhewolf",
            "author_name":"Fenris",
            "choices":[
                "He gulps the rest of you down.",
                "He spits you back out."
            ],
            "content":"<div class=\"\"><div> <span>*As the charr consumes you he thrusts a few more times spurting his load into you before pulling out with a moan.  Those big warm paws fondle your shrunken form as he stuffs you into his muzzle, that warm tongue licking all over your belly slathering it up as he puts his paws on your rump shoving and you sink down into his gullet bulging it out.  Finally he gets to your rear and that warm tongue explores your groin and licks between your butt cheeks enjoying the taste before swallowing your legs slowly.*</span></div></div>",
            "created":1356584400,
            "id":1495593,
            "title":"He uses his tongue to have some fun first."
        },
        "1211111121":{
            "author_id":"fenristhewolf",
            "author_name":"Fenris",
            "choices":[
                "He lets you back out.",
                "He decides to make a meal out of you."
            ],
            "content":"<div class=\"\"><div> <span>*The charr gulps down the rest of your legs licking lustily at your feet before swallowing them down.  You bulge out the big cat's gut and his white tiger striped coat stretches to accomodate your very visible bulge.  It's warm and wet inside and you feel him pawing at his belly enjoying the sensation.*</span></div></div>",
            "created":1356584400,
            "id":1495595,
            "title":"He gulps the rest of you down."
        },
        "12111111212":{
            "author_id":"fenristhewolf",
            "author_name":"Fenris",
            "choices":[
                "You can't escape you're charr-chow.",
                "You try and escape."
            ],
            "content":"<div class=\"\"><div> <span>*As you stew in his warm gut you feel the charr's belly churn around you as it heats up and the digestive juices pour in.  You start to struggle as you feel it burn and ache and the big cat laughs rubbing your bulges as he explains,* See you would have been fine if I'd given you the real potion instead of a shrinking one.  Mmm well enjoy your stay. *He rubs his gut feeling you struggle getting him horny again.*</span></div></div>",
            "created":1356584400,
            "id":1495597,
            "title":"He decides to make a meal out of you."
        },
        "122":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "You exit the shop; you have assorted \"duties\" for your furs"
            ],
            "content":"<div class=\"\"><div> <span>You go to the spice rack, and see at least twenty furs in jars with air holes. \"I'll take that one,\" you say to the store clerk.<br>\r\n<br>\r\n\"Certainly, sir. Will that be all?\"<br>\r\n<br>\r\n\"Yes, I believe so.\" You flash the trembling furs an evil grin!<br>\r\n<br>\r\n</span></div></div>",
            "created":1300078800,
            "id":1070427,
            "title":"go to the spice/flavoring rack"
        },
        "124":{
            "author_name":"zxcv",
            "choices":[
                "you start to feel very dizzy",
                "nothing happens...... yet"
            ],
            "content":"<div class=\"\"><div> <span>The reason why you came here was to get water because you were so thirsty and there were no places in the area except for this one. You walk to the till, which is accompanied by a rather chubby female lioness. She rings it in and in the till you think you saw something that said \"shrinks water\" The lioness giggles as you leave the till with your water. \"shrinks is a wierd company name for water.\" you thought. You then drink it. Glug Glug Glug</span></div></div>",
            "created":1162443600,
            "id":356657,
            "title":"Your a thirsty human"
        },
        "1241":{
            "author_name":"zxcv",
            "choices":[
                "She's hungry and eats you!",
                "She decides to put you in a cage for sale."
            ],
            "content":"<div class=\"\"><div> <span>Whoa! This water must be drugged! You start feeling very dizzy and go back to the till to get your money back! \"There is something in this water, give me my money back!\" You exclaim to the lioness...... WHA! you let out a gasp. She was towering over you! About 100ft tall! She has huge breasts, especially from your view. You run, but then a huge paw picks you up. She then raises you to her huge face.....</span></div></div>",
            "created":1162443600,
            "id":356663,
            "title":"I want my money back!"
        },
        "12411":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "next victim"
            ],
            "content":"<div class=\"\"><div> <span>As she holds you in front of her face, she says \"hmm... what should a big girl like me do with a insignificant bug like you? well, I guess I should do what every macro does with a useless being, eat him!!\" The lioness bears her teeth.<br>\r\n<br>\r\n\"NO!! PLEAASE NO!! I BEG OF YOU!!!\"<br>\r\n<br>\r\nAs she exhales her breath on you from her open mouth full of pointed teeth. You see a mangled corpse among her incisors, and scream.<br>\r\n<br>\r\n\"Now, now,\" says your queen, \"It's the food chain! We all have to go sometime! You're just going to further my life by giving up yours.\" With that, she drops you into her maw. <br>\r\n<br>\r\n\"Enjoy my digestive juices!! Hope you suffer!! </span></div></div>",
            "created":1249189200,
            "id":737650,
            "title":"She's hungry and eats you!"
        },
        "125":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "Hit A Random Person On The Head With It",
                "Buy It And Find A Fur To Fry In It"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yup, this is definetly one fine skillet. But what should you do with it?</span></div></span></div>",
            "created":1123650000,
            "id":266581,
            "title":"Checking Out The Skillet"
        },
        "1251":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Giraffe Girl",
                "Tigress",
                "Hippo Woman"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look at the pot in your feminine human hands, and without a thought you swing it at the head of the closest person who happened to be a </span></div></span></div>",
            "created":1434171600,
            "id":1992133,
            "title":"Hit A Random Person On The Head With It"
        },
        "13":{
            "author_id":"hiccup",
            "author_name":"charcoal",
            "choices":[
                "You Always Wanted A Human As A Slave",
                "You Always Wanted An Anthro As A Slave",
                "You Always Wanted A Strange Creature As A Slave",
                "You Always Wanted To Be An Anthro's Slave... Wait A Minute?!",
                "You Always Wanted To Be A Human's Slave... Wait A Minute?!"
            ],
            "content":"<div class=\"\"><div> <span>At first you think that it is some sort of large sized men's clothing store, but when you enter it you see a wide variety of small and large people, anthros, and creature locked up in cages. You see that on each cage there is a price tag. Apparently this is some sort of slave shop.</span></div></div>",
            "created":1123650000,
            "id":266595,
            "title":"For Those Small And Large"
        },
        "131":{
            "author_id":"jekzii-san",
            "author_name":"Draconic Knight",
            "choices":[
                "Anthro",
                "Human"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You always wanted to have a human slave. It would be lots of fun. Especially since you are...</span></div></span></div>",
            "created":1165640400,
            "id":364460,
            "title":"Human Slaves"
        },
        "1311":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Cat",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yup! you sure are Anthro last your remembered you were<br>\r\n<br>\r\na...</span></div></span></div>",
            "created":1175490000,
            "id":394940,
            "title":"I'm a cat?"
        },
        "13112":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Fox",
                "Mouse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you know yourself to be a...</span></div></span></div>",
            "created":1175490000,
            "id":394941,
            "title":"Last two picks"
        },
        "131122":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>OK now that you have figured out what you are what kind of human slave do you want?</span></div></span></div>",
            "created":1175490000,
            "id":394942,
            "title":"Man or Woman"
        },
        "1311221":{
            "author_id":"jdh20",
            "author_name":"rabbitfoot",
            "choices":[
                "take him back to your hotel room",
                "take him into  the woods for a hard ass fucking"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Since you are a gay mouse you take the male, you pay the person and take the male humans hand and smile at her, the male blushes and only thinks of what you will do with him, you....</span></div></span></div>",
            "created":1280638800,
            "id":928072,
            "title":"Male"
        },
        "132":{
            "choices":[
                "Human",
                "Anthro"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You always wanted an anthro as a slave, espically since you were a/an</span></div></span></div>",
            "created":1189400400,
            "id":443538,
            "title":"Anthro slaves"
        },
        "1321":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So are you male or female?</span></div></span></div>",
            "created":1189400400,
            "id":443539,
            "title":"Human gender?"
        },
        "13211":{
            "author_id":"selphane",
            "author_name":"Selphane",
            "choices":[
                "... male.",
                "... female."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You'd always wanted to own an anthro as a pet, especially one that was...</span></div></span></div>",
            "created":1286254800,
            "id":969753,
            "title":"A male human seeking a ____ anthro"
        },
        "132112":{
            "author_id":"renamonplayer",
            "author_name":"eevee",
            "choices":[
                "Cat",
                "Dog"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One that was a female...</span></div></span></div>",
            "created":1434430800,
            "id":1993595,
            "title":"... female."
        },
        "1321122":{
            "author_id":"renamonplayer",
            "author_name":"eevee",
            "choices":[
                "wolf",
                "next "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of dog?</span></div></span></div>",
            "created":1459832400,
            "id":2128145,
            "title":"Dog"
        },
        "13211222":{
            "author_id":"sizewatcher",
            "author_name":"SizeWatcher",
            "choices":[
                "A husky",
                "A German shepherd",
                "Other doggie :D"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A husky or a German shepherd? I s your choice for female anthro?</span></div></span></div>",
            "created":1592499420,
            "id":2853229,
            "title":"next "
        },
        "132112223":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Hellhound",
                "Boxer",
                "Rottweiler "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these types? </span></div></span></div>",
            "created":1592620920,
            "id":2853798,
            "title":"Other doggie :D"
        },
        "13212":{
            "choices":[
                "Muscle Section",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>So! You're a female human. Walking around the shop in the male section you see alot of Anthro creatures in large and small cages some where muscled as hell with massive members just screaming for attention, they were cute and handsome or just plain erotic.<br>\r\n<br>\r\nYou pick an anthro from the...</span></div></div>",
            "created":1189400400,
            "id":443541,
            "title":"Take your pick"
        },
        "132121":{
            "choices":[
                "Canine",
                "Something else?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok so you like your slave big and strong what race would u like?</span></div></span></div>",
            "created":1189400400,
            "id":443542,
            "title":"more pickings"
        },
        "1321211":{
            "choices":[
                "YES!",
                "hmm...nah"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Would you like a strong handsome wolfie? =D</span></div></span></div>",
            "created":1189400400,
            "id":443543,
            "title":"wolf?"
        },
        "13212111":{
            "choices":[
                "go back to your room",
                "go to the poolside"
            ],
            "content":"<div class=\"\"><div> <span>After scanning the room for a few more seconds, the anthro cheetah behind the counter following your purse around as you walked you finally settle on this large cage which held this massive, vicious looking anthro wolf, according to the tag which held all the details he was about 8 foot tall and carried about 300 pounds of muscle, was very obedient, virle and had a full 5 star rating, the only bad thing on the tag was the price, but that didnt bother you, you pluck off the tag and went to the counter and paid with your credit card<br>\r\n<br>\r\nThe cheetah shopkeeper smiled and went over to the cage and opened it and the wolf crept out and stood straight, he was about 2 and a half feet taller than you, he had these gorgeous green eyes and a killer smile, not to mention his killer body and the fact he was only wearing a set of lycra bicycle shorts, his 11 inch soft member pressing against the material. his thick muscled arms ended in savage claws that clicked when he moved them and his fluffy tail was well groomed.<br>\r\n<br>\r\nyou were excited already, it had always been your dream to have a slave of your own, and one with a body like this was to die for.<br>\r\n<br>\r\nthe shopkeeper had attatched a collar around him by now, according to him it would stay on till the end of the day, you could rent the slave for several more days if you wanted as well.<br>\r\n<br>\r\nunable to contain your excitement, you jump into his manly arms clinging onto the leash and order him to..</span></div></div>",
            "created":1189400400,
            "id":443545,
            "title":"Wolfie slave ^^"
        },
        "132121111":{
            "choices":[
                "give him a blowjob",
                "tease him some more!"
            ],
            "content":"<div class=\"\"><div> <span>You had your cheek on one of his rock hard pecs the entire journey back to your room, several other customers had cast looks of jealous or curiosity at you as your slave carried you back in his tight lycra shorts.<br>\r\n<br>\r\nYou didnt help by licking his nips and rolling your tongue around them, by the time you got to the lift there was a 2 feet 3 inch beast sicking out of his shorts, he was almost moaning as you gently pleasured his chest by rubbing and licking it.<br>\r\n<br>\r\nNow you were in the lift traveling to the 14th floor slowly, alot of time here and you two were the only ones in it.<br>\r\n<br>\r\nOohhh dirty thoughts eh, well what do you do in the lift</span></div></div>",
            "created":1189400400,
            "id":443546,
            "title":"On the way there.."
        },
        "1321211112":{
            "choices":[
                "QUICK! TO THE ROOM BEFORE SOMEONE FINDS US!",
                "nah.. lets take it nice and slow"
            ],
            "content":"<div class=\"\"><div> <span>Seeing the lift being big enough, you command your slave to lie down, and at once you jump onto his rock hard abs, only to find that they REALLY were rock hard, he didnt even flinch and you felt as if u hoped onto a clump of large pebbles, well that didnt work, turning your attention to his trobbing member, you slowly begin to tear away the untra thin fabric, slowly, very slowly, now his monster was standing at perfect attention,<br>\r\n<br>\r\nyou cuped his heavy furry balls first, rubbing them and knocking them together before you went for his chest, oh his wonderful man chest, rubbing them and licking them, he had his arms around you now and he was sitting against the wall, huging you closer and moaning as you pleasured his beastly body, by the 7th floor there was already a puddle of precum on the floor and the wolfs entire cock and balls was soaking in his pre, you had long ago reached your climax enjoying yourself on his body, but he was now moaning in pure pleasure and lust, his sad eyes pleading you to make him erupt so as to let his monster and engines rest, <br>\r\n<br>\r\n<br>\r\nDING! 14th floor, came the automated lift voice, the life door opened, causing some of the precum to flow out onto the carpet. There wasent anyone else outside</span></div></div>",
            "created":1189400400,
            "id":443547,
            "title":"ding!"
        },
        "13212111121":{
            "choices":[
                "Dominate you",
                "Be dominated by you"
            ],
            "content":"<div class=\"\"><div> <span>of course, you still had your clothes on, you were perfectly safe, but you had torn away your slaves undergarments, no choice here<br>\r\n<br>\r\n<br>\r\nQUICK! TO ROOM 1451! NOW! ON THE DOUBLE STAT QUICKLY MOVE LETS GO HURRY<br>\r\n<br>\r\nless than 4 seconds later you were in your room on your bed on top of your wolf slave<br>\r\n<br>\r\ndamned his legs ARE strong.<br>\r\n<br>\r\nwell your all alone now<br>\r\n<br>\r\nso you order him to</span></div></div>",
            "created":1189400400,
            "id":443548,
            "title":"In bed"
        },
        "132121111211":{
            "choices":[
                "Lets you be on top to avoid crushing you",
                "oh what the heck the beds soft, he wants to be on top"
            ],
            "content":"<div class=\"\"><div> <span>You leaned close to him, his green eyes in anticipation<br>\r\n<br>\r\n<br>\r\n\"Dominate me big boy\" You wisper with an evil grin,<br>\r\n<br>\r\nhis eyes widened in shock for a moment but they snaped back really quick and he sat up and seizes you with his muscles letting loose an animalistic growl as he tore off your clothes with one claw before ramming you with his beast, <br>\r\n<br>\r\nyou scream in pleasure as the cock breaks into your sex while he pressed you against his awesome chest and stomach muscles before falling onto the bed<br>\r\n<br>\r\nhe....</span></div></div>",
            "created":1189400400,
            "id":443552,
            "title":"up? down?"
        },
        "1321211112112":{
            "choices":[
                "all fours",
                "crushing!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>does he go on all fours or presses his awesome godly body onto yours?</span></div></span></div>",
            "created":1189400400,
            "id":443553,
            "title":"squeeze? or not?"
        },
        "13212111121121":{
            "choices":[
                "Yes im happy now, time to sleepzzzzzzzz",
                "NO IM NOT SATISFIED YOU DIDNT CUM HARD ENOUGH DO IT AGAIN!!!!!!!!!!!!!"
            ],
            "content":"<div class=\"\"><div> <span>He had stuff his monster into your sex and when male wolves penetrate people, their cocks swell to amazing sizes so you were practically stuck to him. He puts you against the pillows on his knees and spreads your legs up before leaning over you with his hands on the pillows next to your head. <br>\r\n<br>\r\nDespite the awesome pleasure he was putting you through you could see that his muscles had tensed up as he flexed and trusted into you, eventually he stiffened and growled before finally letting out a roar of pure delight as he exploded into you, the explosion lasted for a full 5 minutes and by that time his cum had blasted out of your and all over himself and the bed, you screamed as you reached your climax.<br>\r\n<br>\r\nEventually he hugs you and holds you close to his muscles, his massive cock stll hard and stuck inside you and he lies on his side and covers both of you with a blanket.<br>\r\n<br>\r\nHe cuddled closer to you and wispered, \"Satisfied? Mistress? I can keep on going if you want, I can go on for much longer if you want\" he ends with a cheeky grin as you grab his head to pull him closer to kiss him with.<br>\r\n<br>\r\nWell i guess if he isnt tired...</span></div></div>",
            "created":1189400400,
            "id":443554,
            "title":"He cums so much and he can still continue"
        },
        "132121111211212":{
            "choices":[
                "You're dead tired, make him spend the night with you",
                "Punish him for making a mess! >:)"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm, oh you sexy virile beast\" You say, \"Give it to mumma, i can take it\"<br>\r\n<br>\r\nHis eyes lit up, \"As you wish\" he mutters and covers you both completely with the blanket.<br>\r\n<br>\r\nAlmost at once he starts grunting and growling before he finally snarled and did as much of a full body flex as he could while on his knees and having you stuck on his cock, you could see his grapefruit sized balls working hard as he grabed you and started moving you manually up and down, you were screaming in pain as the monster started swelling even more, but in all that pain, you knew you wanted it, all that strength in one body, and that body was at your command until the end of the day.<br>\r\n<br>\r\nHe also seemed to enjoy the way your boobs rubbed against his chest and the way you licked his chest as you went up and down, eventually he grunts some more and pushes you straight down until your virgina touched the base of his cock, you groan.<br>\r\n<br>\r\nHe moans, and then, he came<br>\r\n<br>\r\nHe let lose about 25 squirts, each one just slightly smaller than the previous one, he managed to soak the entire bed his time since your sex was full, finally, you see him relax and he falls over onto his back<br>\r\n<br>\r\nSTILL stuck to his monster you were fliped over onto his belly too, but that didnt matter much, you were able to taste some of his spunk that had sprayed onto his awesome apple sized abs. <br>\r\n<br>\r\nAnd suddenly, as if he suddenly got his energy back he sat up and with the blanket wraped around you both, he pulled you closer and the two of you kisses, you letting him taste some of his own cream. It was about 10 oclock at night now.<br>\r\n<br>\r\n\"Ehmmm, i hope that satisfied you Mistress\" <br>\r\n<br>\r\nThat most certainly did!<br>\r\n<br>\r\nNow what</span></div></div>",
            "created":1189400400,
            "id":443555,
            "title":"ONE MORE TIME WOOT!"
        },
        "1321211112112122":{
            "choices":[
                "Tie him up and whip him",
                "Chain him up and whip him =P"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, he did make a large puddle of cum in the center of the bed, he was naughty today. Well no one can be naughty under you without going unpunished now can they.<br>\r\n<br>\r\nLucky for you you had packed a few things on your way here.</span></div></span></div>",
            "created":1189486800,
            "id":443735,
            "title":"Punishing the lil wulfie"
        },
        "132121111212":{
            "choices":[
                "In the tub",
                "Lets do it here on the bed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Damend your violent arent ye, i like that &gt;:)<br>\r\n<br>\r\n<br>\r\nright so where do you want to pleasure him in?</span></div></span></div>",
            "created":1189400400,
            "id":443549,
            "title":"Where to?"
        },
        "1321211112121":{
            "choices":[
                "sex him",
                "torture him"
            ],
            "content":"<div class=\"\"><div> <span>It took a few moments to get his massive body into the tub in the position you wanted him in but when you finally got him in you marveled at this glorious form, his arms and legs were handing out of the tub but his butt was sitting in it, his massive dong still standing up right and had already started willing the tub with pre, his trobbing baseball sized balls throbbing hard. as he breathed you could see the way his chest muscles expanded and contracted, that very sight turned you on<br>\r\n<br>\r\ntaking off your clothes you turn on the tap and jump in with him<br>\r\n<br>\r\n<br>\r\nnow you</span></div></div>",
            "created":1189400400,
            "id":443550,
            "title":"tub sex!"
        },
        "1321211112122":{
            "choices":[
                "Someone barges in",
                "Nope false alarm"
            ],
            "content":"<div class=\"\"><div> <span>Well he isnt gonna fight back, as hard as you could you lung down on his massive beast as your hands seized the sides of his pecs and you ran your thumbs around them, <br>\r\n<br>\r\n\"Flex!\" you command, and at once he obeyed, putting his arms behind his head ,while you fought to fit his entire member into your sex without getting too distracted, and pumped his arms and chest real hard, the veins poped out and at once his whole body tensed up and<br>\r\n<br>\r\n<br>\r\n<br>\r\noohh yea ya ahh OOOOOHHHH! YEA!! FUCK AHHHHUGGNN AAAHHH!!!!!! his roars drowned out your moan of pleasure as you orgasmed as well, his dick pumping out so much cream that alot of it was now firing out of your sex and onto his balls and the matress after abotu 5 minutes of his intense orgasming he collaspes back onto the bed with you on top of him, the both of you gasping for breath.<br>\r\n<br>\r\nyou turn to look at him and smile, exhausted, he slowly doses off to sleep, but you were wide awake, still marveling at the awesome sex you just had, so awesome that you still had your clothes on albite the hole in your jeans when you jumped onto his beast.<br>\r\n<br>\r\nSuddenly, you here footsteps, someone must have heard him roaring with pleasure,</span></div></div>",
            "created":1189400400,
            "id":443551,
            "title":"Cumblasting"
        },
        "13212112":{
            "author_id":"renamonplayer",
            "author_name":"eevee",
            "choices":[
                "yes",
                "next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about a cute female doberman?</span></div></span></div>",
            "created":1459832400,
            "id":2128140,
            "title":"hmm...nah"
        },
        "1321212":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Reptiles? Like a dragon or dinosaur?</span></div></span></div>",
            "created":1243400400,
            "id":698267,
            "title":"Something else?"
        },
        "13212121":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "I'll take one",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So...how you feel about dragons</span></div></span></div>",
            "created":1243400400,
            "id":698268,
            "title":"Dragon"
        },
        "132122":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Giraffe",
                "You Keep Looking"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide you don't want a carnivorous slave, you want a gentle creature,<br>\r\n<br>\r\nYou may find what you're looking for here...You stop and see a </span></div></span></div>",
            "created":1342242000,
            "id":1378793,
            "title":"Herbivore Section for Strict Vegetarians"
        },
        "1322":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Right are you Male? or Female?</span></div></span></div>",
            "created":1189486800,
            "id":443736,
            "title":"M or F?"
        },
        "13221":{
            "choices":[
                "Ok",
                "Nope something else please"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a Canine?</span></div></span></div>",
            "created":1189486800,
            "id":443737,
            "title":"Canine"
        },
        "132211":{
            "choices":[
                "Yes please ^^",
                "Hmm nah something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How bout a Wolfie?</span></div></span></div>",
            "created":1189486800,
            "id":443738,
            "title":"Wolf?"
        },
        "1322111":{
            "choices":[
                "Massive",
                "Small"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok are you huge buff and rippled or a small thin wolf?</span></div></span></div>",
            "created":1189486800,
            "id":443739,
            "title":"Macho or meek"
        },
        "13221111":{
            "choices":[
                "Male Anthro Slave",
                "Female Anthro Slave"
            ],
            "content":"<div class=\"\"><div> <span>You stood at 8 feet tall and 300 pounds of solid muscle, you were into competitive bodybuilding and had the reputation of being one of the biggest wolves around in the heavyweight category, <br>\r\n<br>\r\nnow in this slave shop you, dressed in nothing but a pair of swimming trunks from your swim just now before you discovered this shop, you cast your eyes around<br>\r\n<br>\r\neventually you found something you liked, the foot long beast in your trunks gaining weight as you looked at a</span></div></div>",
            "created":1189486800,
            "id":443740,
            "title":"Ur a big bad wolfie"
        },
        "132211111":{
            "choices":[
                "Ripped",
                "Weak"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Right you pick a male Wolf<br>\r\n<br>\r\nis he tall and muscular like you or is he small and weak?</span></div></span></div>",
            "created":1189486800,
            "id":443741,
            "title":"How do YOU like your slave?"
        },
        "13221112":{
            "choices":[
                "Male anthro slave",
                "Female anthro slave"
            ],
            "content":"<div class=\"\"><div> <span>Ok your small and kinda weak for a wolf, not very tall like most wolves who towered over most creatures and not as buff as them either, you had spent most of your childhood studying to get a good job and you did, so well paid you could afford to come into this hotel. You stood only about 5 feet tall and failed every gym class you ever took.<br>\r\n<br>\r\nso right you were admiring the slaves in the room and you decide on a</span></div></div>",
            "created":1189486800,
            "id":443749,
            "title":"Small wolf"
        },
        "132211121":{
            "choices":[
                "yes!",
                "no! something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want a massive muscled wolf slave or something else?</span></div></span></div>",
            "created":1189486800,
            "id":443753,
            "title":"Ripped wolf slave?"
        },
        "1322111211":{
            "choices":[
                "Take him up to your room",
                "Take him to another shop?"
            ],
            "content":"<div class=\"\"><div> <span>Right, after strolling around and looking at the male slaves and the tags that came with the cages you select the biggest, meanest looking, most ripped wolf you could fine, his fur was a greyish black he was only 22 years old, just 2 years older than you.<br>\r\n<br>\r\nYou bring the tag to the shopkeeper who frees the wolf and attatchs a leash on him, that meant that he was yours till the end of your stay, and whatever happened to him was up to you as long as you could return him in good condition.<br>\r\n<br>\r\nNow, you had an 8 foot tall wolf slave who was ripped as hell on a leash next to you, he was dressed in nothing but a pair of swimming trunks which did nothing to hide the massive 11 inch weapon in his pants, it was SOFT. You could see the way his chest muscles expanded and flexed when he breathed and his glories 8 pack almost shone in the light, so chisled and yet so strong and powerful, ther were scars on his body like the arms and chest that added to that manly look you always wanted in a slave, his arms were ripped as hell and they ended in clawed hands, same for his legs.<br>\r\n<br>\r\nWell, hes yours to play with till the end of your stay, what to you do?</span></div></div>",
            "created":1189486800,
            "id":443760,
            "title":"Paid and ready to go!"
        },
        "13221112111":{
            "choices":[
                "Feed me slave!",
                "Room service"
            ],
            "content":"<div class=\"\"><div> <span>It was somewhat late now about 8 pm when you and your slave returned to your room, he was gay you knew that form the tag, and he did indeed love little people people or twinks he could have fun with, but he kept his head as he knew he was the slave in this situation, but that didnt stop him from being excited though, his trunks now stood out with a 2 and a half long foot tent, his wine bottle thick dick already dribbling precum into the fabric.<br>\r\n<br>\r\nyou were looking out the window when he crept up to you, making you jump when he huged you suddenly. It didnt help the fact something so huge could sneak up so quitely to you without even making the leash quiver.<br>\r\n<br>\r\n\"Are you.. hungry? Master... have you eaten yet?\" he said in a deep, masculine, sexy tone, really softly. He had one of his hands on your stomach by now, itching to get into your pants which had a little bulge in them by now as you rubed against his chest and arms. Something hard large and damp was already pressing against the back of yours pants.</span></div></div>",
            "created":1189486800,
            "id":443762,
            "title":"Im hungry"
        },
        "132211121112":{
            "choices":[
                "fall asleep",
                "he wants more fun"
            ],
            "content":"<div class=\"\"><div> <span>Room service! At once you break away from your slave despite his \"Damned failed\" expression which you did not see and order something up.<br>\r\n<br>\r\nBut this time, you wanted to have some fun as you stoped yourself from starving to death, he was your slave until the end of your stay wasent he? He was sitting on the bed now, following you around with those adorable eyes, as you got the food from the door in a bowl you hoped onto your wolfie slave much to his surprise and delight, you were sitting on the base of his trunk so that his beast was sticking out in front of you it was so long that it would touch your chin if you pulled it closer, you spent a long time rubbing your back on his abs <br>\r\n<br>\r\nhe was making cooing noises by now that slowly turned to groans and moans as he slowly approached his climax.<br>\r\n<br>\r\n\"Make yourself at home\" you say out loud, you yourself in estacy <br>\r\n<br>\r\nAt once his eyes lit up and he growled in satisfaction, putting you lying down next to him he tore off your clothes with his claws, before ripping apart his own trunks before trusting his massive beast into your tight tail hole, <br>\r\n<br>\r\nignoring your screams of pain and pleasure he keeps on trusting and snarling as his dick begins to thicken and eventually you orgasm after having your dick pleasured by being inbetween his rock hard abs and your belly going up and down up and down<br>\r\n<br>\r\nand finally, you can feel his awesome dick tense up as the moment arrived<br>\r\n<br>\r\nwhen he came, he CAME<br>\r\n<br>\r\nbucket and buckets of cum fired into your ass so hard that soon it was full and alot of it came blasting out the sides, the only reason you were not fired out like a cannon was because your slave had held you down <br>\r\n<br>\r\nafter he was done roaring with pleasure, the both of you were sweating and he kissed you and huged you as you both fell onto the pillows.</span></div></div>",
            "created":1189486800,
            "id":443764,
            "title":"cum cum cum!"
        },
        "1322112":{
            "author_id":"templori",
            "author_name":"TheFallenTitan",
            "choices":[
                "Yes!",
                "Nah..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about a fox?</span></div></span></div>",
            "created":1268456400,
            "id":850301,
            "title":"Fox?"
        },
        "13221121":{
            "author_id":"templori",
            "author_name":"TheFallenTitan",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Only two things left to choose.<br>\r\n<br>\r\nWhat gender fox do you want, a foxboy or a vixen?</span></div></span></div>",
            "created":1271566800,
            "id":870000,
            "title":"Fox's gender?"
        },
        "132211211":{
            "author_id":"templori",
            "author_name":"TheFallenTitan",
            "choices":[
                "Normal size",
                "Macro/micro"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How big is your slave/pet going to be?</span></div></span></div>",
            "created":1271566800,
            "id":870001,
            "title":"Foxboy's size?"
        },
        "1322112112":{
            "author_id":"templori",
            "author_name":"TheFallenTitan",
            "choices":[
                "Macro",
                "Micro"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Macro or micro?<br>\r\n<br>\r\nFinal choice, folks, and then we can start this wild ride.</span></div></span></div>",
            "created":1271566800,
            "id":870006,
            "title":"Macro or micro slave?"
        },
        "132211212":{
            "author_id":"templori",
            "author_name":"TheFallenTitan",
            "choices":[
                "Normal size",
                "Macro/micro"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How big is your slave/pet going to be?</span></div></span></div>",
            "created":1271566800,
            "id":870002,
            "title":"Vixen's size?"
        },
        "1322112122":{
            "author_id":"templori",
            "author_name":"TheFallenTitan",
            "choices":[
                "Macro",
                "Micro"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Macro or micro?<br>\r\n<br>\r\nFinal choice, folks, and then we can start this crazy thing.</span></div></span></div>",
            "created":1271566800,
            "id":870005,
            "title":"Macro or micro slave?"
        },
        "132212":{
            "author_id":"l4dguy",
            "author_name":"ellis333",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a reptil of some sort?</span></div></span></div>",
            "created":1341464400,
            "id":1372544,
            "title":"Nope something else please"
        },
        "1322121":{
            "author_id":"l4dguy",
            "author_name":"ellis333",
            "choices":[
                "Yay",
                "Nay"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A Dragon, mabey?</span></div></span></div>",
            "created":1341464400,
            "id":1372545,
            "title":"Dragonic?"
        },
        "133":{
            "author_id":"cooling999",
            "author_name":"cooling999",
            "choices":[
                "Dragon",
                "Phenoix",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Hmm... I guess having a strange creature as my slave can suffice my needs,\" you thought to yourself.<br>\r\n<br>\r\nYou walk down the row to choose a...</span></div></span></div>",
            "created":1332997200,
            "id":1305557,
            "title":"You Always Wanted A Strange Creature As A Slave"
        },
        "1331":{
            "author_id":"cooling999",
            "author_name":"cooling999",
            "choices":[
                "Male/Male",
                "Male/female",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you male or a female and is the dragon a male or a female?</span></div></span></div>",
            "created":1332997200,
            "id":1305558,
            "title":"Gender combinations..."
        },
        "13312":{
            "author_id":"kyuremfan24",
            "author_name":"kyuremfan24",
            "choices":[
                "normal (standing on 4 legs)",
                "anthro (standing on 2 legs)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you are a male human and wanted a dragon as a slave but that dragon has to be female and...</span></div></span></div>",
            "created":1439528400,
            "id":2021025,
            "title":"Male/female"
        },
        "133122":{
            "author_id":"kyuremfan24",
            "author_name":"kyuremfan24",
            "choices":[
                "maid clothes",
                "a one piece swimsuit"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you are a male human and wanted a dragon as a slave but that dragon has to be female and being a anthro, but she can't be naked (for now) so what clothes will she get?</span></div></span></div>",
            "created":1439528400,
            "id":2021026,
            "title":"anthro (standing on 2 legs)"
        },
        "13313":{
            "author_id":"cooling999",
            "author_name":"cooling999",
            "choices":[
                "Female/Male",
                "Female/Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Last two choices.</span></div></span></div>",
            "created":1332997200,
            "id":1305561,
            "title":"More choices"
        },
        "1333":{
            "author_id":"kyuremfan24",
            "author_name":"kyuremfan24",
            "choices":[
                "centaur",
                "lamia",
                "(other)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Hmm... I guess having a strange creature as my slave can suffice my needs,\" you thought to yourself.<br>\r\n<br>\r\n You walk down the row to choose a...</span></div></span></div>",
            "created":1439528400,
            "id":2021028,
            "title":"Other"
        },
        "134":{
            "choices":[
                "Anthro, it's not too noticable",
                "Human, it's very well seen"
            ],
            "content":"<div class=\"\"><div> <span>'Hm, I always did want to be an anthro's slave...wait a sec, what did I just think?!', you think to your self as you look at the \"For Furrys\" section. Backing away, you accidentally bump into a counter that you didn't see before. A young male cheetah is behind it, looking you over before saying, \"Hm, you look like you're worth a pretty penny.\", bringing a blush over your face. And since your a...</span></div></div>",
            "created":1149051600,
            "id":321839,
            "title":"Wait a sec, did you think right?"
        },
        "1341":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Skunk",
                "Raccoon",
                "Rabbit"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>OK You're an Anthro and You're blushing, I'm going to make the species list short so we aren't going through endless options<br>\r\n<br>\r\nYou are an anthro...</span></div></span></div>",
            "created":1342242000,
            "id":1378795,
            "title":"Anthro, it's not too noticable"
        },
        "13411":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "A Siberian Tiger",
                "A Gorilla"
            ],
            "content":"<div class=\"\"><div> <span>You aren't blushing too deeply under your black fur, but the cheetah has sharp eyes and can see it nonetheless.<br>\r\n<br>\r\n\"I think you really do want this Little Skunk.\" The Cheetah says <br>\r\n<br>\r\nBefore you can protest you are measured weighed asked what your likes and dislikes are and you are put in a small cage after you've been stripped to your underwear.<br>\r\n<br>\r\nYou sigh in defeat and watch as bigger and hungrier Anthros walk by, someone stops and notices you</span></div></div>",
            "created":1342242000,
            "id":1378800,
            "title":"Skunk"
        },
        "1342":{
            "choices":[
                "A muscular dragon chooses you as soon as you're put up for sale",
                "A few of your human office \"buddies\" find you"
            ],
            "content":"<div class=\"\"><div> <span>Your a human, so your blush is as readable as a kiddy book. \"No, you don't understand, I don't want this\", backing away from the counter. The cheetah on the other hand, who has a sly smile on his face, says, \"If you don't want it, then why are you here and with an erection I might add?\", stumping you. Truth be told, you didn't leave when saw what the store was and you certainly didn't slow when you saw the \"For Furrys\" section. \"But...\", you hopelessly say as the cheetah pulls you back with a paw and attaches a collar to your neck, sealing the deal and your fate. Taking you to a scale, he takes you weight, then he takes you height, then takes your name, age, like and dislikes down, all in five minutes and without resistance. You don't resist because once the collar is on, it doesn't come off until the end of the day (it says so on a sign on the wall). Getting you to stand in a tall cage, the cheetah says, \"You'll be surprised at how many people like yourself sell out. Oh and we aren't liable as to what your master does to you. Have a nice time\", before the cage shrinks down so you have to kneel like the others.</span></div></div>",
            "created":1149051600,
            "id":321849,
            "title":"Slave?"
        },
        "13421":{
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><div> <span>As soon as your cage is wheeled into place, a tall, muscular, seven foot six, blue anthro dragon in a swam green bathing suit walks in and starts looking at the slaves. Strangely enough, he seems to be looking only at slaves your own gender, which is...</span></div></div>",
            "created":1149138000,
            "id":321956,
            "title":"A hunk of a dragon walks in"
        },
        "134211":{
            "choices":[
                "He takes you to the pool and does more than swim",
                "He goes back to his room, where he does more than work"
            ],
            "content":"<div class=\"\"><div> <span>'He's only looking at the male slaves', you think to yourself with a shudder. Your being a male doesn't help things. His gaze travels over many other males, most of which are more muscular, more handsome or cuter than you are, and yet they all are skipped over. <br>\r\n<br>\r\nHis search only stops when he spots your cage being tagged. Or maybe it was the sight of you, seeing as his trunks seem to be getting a bit more of a bulge in them. This is making you blush for some unknown reason. <br>\r\n<br>\r\nWalking over to your cage, he takes the tag off of it and only glances at the price before flipping the tag over and reading your likes and dislikes. Looking down at you and smiling slightly, he walks over to the counter and hands the cheetah behind it the tag.<br>\r\n<br>\r\nTaking a wallet out from his trunks, the dragon takes out a credit card and pays for you, getting a leash and a recite. The door to your cage seems to vanish as he gets there. Crawling out to him, he clips the leash to your collar and says, in a deep voice, \"Alright, lets get going. I have a lot to do and I'm going to make sure that I get my money's worth out of you. Oh and you can get up you know, I'm not one of those stereo type masters\", making you blush even more as you get to your feet. Walking toward the entrance, the sign from earlier catches your eye, making you gulp at what it says at the bottom; <br>\r\n<br>\r\nOnce the collar is on, it stays on till the end of the day (if you're lucky).</span></div></div>",
            "created":1149138000,
            "id":321966,
            "title":"Bought"
        },
        "1342112":{
            "choices":[
                "feed it all to me!",
                "eat it all!"
            ],
            "content":"<div class=\"\"><div> <span>the dragon guides you to his penthouse room. as he grabs for his key card he says \"by the ways my name is tim, i'm a nice guy, but if you don't do as i say...\" he breaths out some fire \"your toast.\" you gulp as you enter the room and is taken back in surprise. there is food every where mainly meat but still all kinds of food! tim then says...</span></div></div>",
            "created":1274072400,
            "id":884686,
            "title":"thats a lot of food..."
        },
        "134212":{
            "choices":[
                "...My room.\"",
                "...The Bath House.\""
            ],
            "content":"<div class=\"\"><div> <span>  You notice how he only stops in front of the other girls cages, carefully eying their bodies. &lt;i&gt;He must be looking for a sex slave,&lt;/i&gt; you think to your self as he walks up to your cage. He continues his little routine until he reaches your cage. A smile comes across his face as when he looks at your breast which are tight against the fabric of the small bikini top they had you change into.You blush as he begins looking at your lower regions. His smile widens, he even licks his lips as he fantasizes about the treasures hidden inside your tight, silk shorts. He looks your tag over, and for a split second you almost regret what you had told the cheetah before...&lt;i&gt;almost.&lt;/i&gt; You have to admit, something about this is making you feel hot, really hot.<br>\r\n<br>\r\n  He proceeds to tear the tag off of your cage and walk over to the counter. \"I'll take the little human,\" and, upon glancing back at you, \"She is &lt;i&gt;just&lt;/i&gt; what I'm looking for.\" \"An excellent choice,\" the Cheetah says as he  walks over and opens the door to the cage. He attaches a leash to your collar and says \"Told you you'd go fast. Just remember, you are his until the end of the day, longer if he wishes to pay for the extra time, and you must do everything he says.\" The cheetah hands your leash your new master, \"Here you go, try not to damage her if you can.\" \"Heh. I'll see. Come slave, we're going to...</span></div></div>",
            "created":1254114000,
            "id":767216,
            "title":"Female"
        },
        "13422":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "Eva, the woman who owns your company, and a huge part of the company",
                "Eva, and the Minotaur thing holding her leash"
            ],
            "content":"<div class=\"\"><div> <span>Privately exited to be living a fantasy and for all else genuinely concerned what that ill timed erection just got you into you sit on your knees inside the cage. The cheetah is still handling some of the notes he made moments ago. He was rapidly typing something into the computer and lustfully eying you up and down. A little apprehension panged in the back of your mind that you didn’t specify that you don’t want to be owned by a male anything. He finished typing with a punctuated keystrike and his hand bounced off the keyboard like a someone passionately conducting an orchestra. “There we go! Your notes are in the system and are about to go on sale! Are you exited?” <br>\r\n<br>\r\nYour penis sure was, nervously your fingers played with the lion headed padlock trapping you in the magic cage, your common sense was pounding on the edges of your mind trying to reign yourself in. “Yea…I can’t believe I’m doing this. I don’t jump into this kind of thing. I’m afraid my second brain talked louder than my first, ya know? Do people do this, show up here and get put in a cage for strangers to buy?” He leaned against the counter and casually crossed his arms, apparently he wasn’t in any hurry and was happy to talk to you. “You’d be surprised, a lot of people come here to cut loose and do things they normally don’t. Humans and furs usually don’t mix a lot in this day and age. I think both kinds enjoy trading places in a ‘what happens at the resort is resort business’ mentality. An example your kind will keep an animal dog on a leash, well some of the fur dogs like that fantasy, and the inverse for you humans being treated like a pet by the fur equivalent of yours. It’s all very common. A completely surreal escape from your reality, some find the fantasy captivating.” Given the large collection of men and women in cages for sale and the vacancies where cages clearly are normally placed, his answer matched what you hoped you’d hear. Frequently in your teenage years you fantasized about many of the girls you went high school with would walk you down the street on a leash and lead you to their bedrooms, it never happened, over time the unfulfilled fantasy even twisted to include being turned into a dog just to be lead around helplessly by your collar behind a towering beauty. Your fantasy of over a decade might be happening and your excitement was obvious. He stood over your cage grinning, “Alrighty! It’s almost time to become someone’s property! Ready for your fantasy?” Nervously you nod and force the word “Yes” out of your mouth. “Good, all you have to do is take off your clothes and you’ll be put out in the shop.” Robotically you wiggle out of your shirt before you realize what you are doing. “Wait what? You never said I had to be naked.” He stood expectantly over you with his hand out, “I thought it was obvious. Would you want to buy anything sight unseen? Look around at the other humans for sale. Big, small, original size, shrunken, attractive, ugly, every one is naked because they are property now. Camon don’t back down now. I don’t want you to already have a negative mark on your record.” Sheepishly you wiggle your pants off. “Record?” The cheetah accepts your shirt and pants while taking your socks off of you without you noticing, “Everyone here has a record, behavior and expectations are important for our clients, we want to get people and property matched perfectly.” Your thumbs slide inside the waist band of your boxers and you seriously think about what you are going to do. Your fantasy was so close but you’ve never been naked in front of anyone excluding a few women, and it was always in a private setting. Never in a cage for people to buy. Suddenly the raging erection you had was not overriding your brain. “I’m uh…not so sure about this.” The cheetah was used to this and calmly reaches in and helps you slide your final piece of clothing off. Your body seems to obey him instead of you and he takes your clothes out of your reach, now there is absolutely nothing you can do to cover yourself. For the first time in your life you are naked in front of someone who are you are not about to have sex with. He drops your boxers as he turns around for a moment to retrieve a wheeled device to move your cage. You reach for them quickly but they are an inch out of reach and the cage is far too heavy to move. Quickly you realize your erection is in full effect and you cover yourself, there is absolutely nothing you can do anymore.<br>\r\n<br>\r\nHe smiles deeply at you, naked and completely helpless and a little envious of your gumption to jump into an adventure. As the cage is wheeled through the shop, unsure what you say you look at him. There are indeed people of all sizes and shapes in wildly different cages on the way to the front. He keeps walking toward the front past the shelves and close to the opening of the store. Smoothly he stops your cage and throws your clothes in the trash! “Hey wait a moment! My phone was in there and my wallet!” You spin around in the cage as he leaves you where you are for a moment and unlocks a door to the back side of the display case that boarders the street., “You aren’t going to be needing them, don’t worry.” He returns and wheels your cage into a vacant spot in the display case, you are stunned and your mouth hangs open, he speaks before you can clumsily put anything together and points to your collar, “Now that is all you need.” The wheeled device moving your cage slides out from under it and out of the alcove. The cheetah waves at you and closes the door replacing your view of the shop with a tropical beach mural that has a giant cat woman with a shrunken human couple on leashes sunning on the beach. A loud clunking, followed by jingling and then awfully loud silence inform you that he’s locked the door and gone back to the counter. He was gone and you were here, collared, in a cage on a display, on sale, for real. You can’t reach the mural to pound on it for him to come get you and let you out, it’s inches too far, so are the walls on either side of you and the glass is also too far. “Hey wait! Come back!” the display case was all hard surfaces and the sound echoed back into your ears. It got someone’s attention and a shadow looms over you. A sultry cat girl leers at you. You make eye contact with her and it fully sinks into you that she is looking at you on sale. She could come in and buy you, your fantasy could come true finally. Your cock notices this too and pulses. Her eyes dart down to it then back to yours with a disapproving expressing and she leaves. <br>\r\n<br>\r\nHours pass in the display case, to your left is a tall large cage with about a dozen six inch tall women, to your right is a body builder type guy who is probably ten years older than you. There is another row of cages above yours but there is a solid floor between you and them. Many creatures look at you and frown at your unrelenting erection then leave. At one point you can make out the shop in the reflection of another shop across the street. Just in time to see the street cleaners come by and empty the trash can your clothes were in. The only device you had to communicate with is now gone, and so was your money. Evening rolls around and you haven’t gotten a second glance form anyone and you are and in spite of your anxiety about something with another cock buying you, you get a little worried that nobody will buy you. At least if nobody does you’ll be getting out of here at the end of the day and you can get back to your room, you’ll just have to walk naked across half the resort. Around what looked to be mid afternoon, an elephant couple come in and leave with three cages of people. People were just bought somewhere close to you. That could be you and there is nothing you can do about it. Carried away by a stranger for who knows what. As the sun goes down you see the cheetah leave the shop from the front and lock up. Should he be letting you out? He walks by the glass without paying you an iota of attention. Even with your yelling and reaching for the glass he was oblivious. Isn’t the collar supposed to come off at the end of the day? That’s what you understood, now the shop is empty and you are still liked in this cage and on display. Maybe a day is 24 hours from the time you get the collar locked on you? Well someone will be back tomorrow, until then there is literally nothing else you can do. There is still too much light for you to try to sleep in the cage. <br>\r\n<br>\r\nFinally another shadow looms over you, a big one. What would this be? A walking octopus, another dragon, something else you’ve never seen before? You froze, Eva stood outside. </span></div></div>",
            "created":1574053200,
            "id":2748592,
            "title":"A few of your human office \"buddies\" fi..."
        },
        "134221":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "A crash wakes you up in the middle of the night",
                "Sun bouncing from the shops across the street wake you up before the shop opens"
            ],
            "content":"<div class=\"\"><div> <span>She was The owner of your company, over six feet tall, athletic, immaculate and unattainable. Her body was as statuesque as her attitude was predatory in business. You would fantasize about her if not for her utterly terrifying demeanor. Tonight she decorated herself with an outfit that Elvira would wear to tame lions in the 20s, short whip and crop included. Once your eyes met hers there was something entirely different, she wasn’t chiseled marble, instead she seemed to be a baffled and amused young lady of all things. It was a disarmed and enchanting look. A razor smirk broke the illusion and the marble composure returned. You feel something else, the rest of the shadow she cast over you was not actually hers, but a small entourage of people from work. Rachel, Brandon, Arianna, Terry, BJ, and probably more are clustered around her. They are slowly one by one realizing their workmate is naked in front of them and for sale. You can’t hear them but your mind fills in the sound of pictures being taken when you see phones pointed at you. This was absolutely not part of your fantasy and for the first time today your erection seems to relax. Panic takes over and you try to resist but your body seems to have forgotten the cage is locked and you turn around and throw yourself at the door. Embarrassed you can’t turn around and handle this so you sit there for a moment on your knees leaning your head against the bars. A gentle thud comes from the glass and you look over your shoulder. Eva is the only one standing outside the glass with a look of curiosity and genuine concern. A long manicured finger spins around motioning you to turn. Reluctantly you do. Not wanting to flash your boss you try to cover what’s left of your erection. She holds up a finger and wiggling it side to side tells you not to. Apprehensively you follow her instruction. It’s clear to her that your erection had gone away some, she stares at it then back up to your eyes with the same smirk. <br>\r\n<br>\r\nShe looks around for a moment and unbuttons her shirt a few exposing enough cleavage from her considerable assets to topple another company’s negotiations. What is she doing? One of her hands points to you and the other makes an exaggerated jerking motion. She wants you, to play with yourself, right here? You might want to be walked around on a leash and other things but playing with yourself like this was not on your mental map of how this would go. The finger pointing to you pressed against the glass again and you shake your head no. The jerking hand slows and her expression turns to annoyance. Slowly her pointing hand begins to pop buttons lower on her shirt, then stops, and finally points back to you. Followed by further exaggerated jerking motions. Your sense of decency might say no but your cock had reasserted itself. The pointing hand now points to your penis and gives you a thumbs up. What the hell, your hands grab your cock and slowly start to massage it. You haven’t been able to get it to relax all day, maybe this will help power it down for a bit. Her hand instructed you to the pace she wanted. The other hand finished unbuttoning her shirt and was now playing with her breasts. She instructed you to your absolute limit. Now when she leaves you can finish and maybe sleep. You were about to stop when she gave a stop motion to you. Perplexed you do but you desperately want to finish. She reaches behind her back and unclasps her bra letting it fall, a pair of the most perfect breasts you’ve ever seen float in defiance of gravity in front of you. Punctuated by a pair of nipple rings. Her hands squeeze and open and without another moment’s hesitation, you explode. Euphoria spasms through your body and you see stars for a moment. You are horrified with what you just did and how easily she coaxed you into it. Simultaneous to your eruption she rocked backward in pure laughter completely indifferent to anyone seeing her with her shirt down and breasts out. She righted herself, leaned against the glass resting her suddenly even larger breasts and forehead against it. As your expression shifts to realizing you just epically humiliated yourself for the amusement of your boss and she beings to restore her bra. Making a point to give them a large giggle and your cock twitches in near sync. She laughs outside while completing the repairs to her attire. You can’t move to cover yourself even if you wanted to right now. She produces her phone and snaps a candid photo of you. She walks away while kissing her fingers and pressing them to the glass. <br>\r\n<br>\r\nWhat the hell did you get yourself into?<br>\r\n</span></div></div>",
            "created":1574053200,
            "id":2748593,
            "title":"Eva, the woman who owns your company, and a hug..."
        },
        "134222":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "Tomorrow morning things are instantly worse",
                "Tomorrow morning nothing has changed"
            ],
            "content":"<div class=\"\"><div> <span>She was The owner of your company, over six feet tall, athletic, immaculate and unattainable. Her body was as statuesque as her attitude was predatory in business. You would fantasize about her if not for her utterly terrifying demeanor. Tonight she was decorated with just a skimpy nearly see through purple toga. Having someone you know was NOT part of the plan, part of the reason you chose this resort is that it is a place humans usually do not travel this far to and you wouldn’t see anybody you know. Sure enough here was one of the people you didn’t want to find you like this. Exposing yourself and fantasies wasn’t something you’ve ever desired. She stood rigid outside, clearly staring at you. After a moment of staring back at her never before seen almost exposed figure, it dawns on you that she’s not rigid from seeing her employee up for sale. She’s rigid because her hands are bound behind her back. Her feet are in heels that couldn’t be comfortable, little padlocks around her ankles presumably kept her from taking them off. She also had a ball gag pressed into her lips and a metal that looked so ornate it could be lace around her neck. A long golden chain ran from her collar to a lead being held by the creature with her. She was subjugated too, maybe she has the same kink? <br>\r\n<br>\r\nWhile you mull this over she bucks at the leash and the minotaurish thing leans over and removes her gag. Hearing what she is saying is impossible but they take turns looking at you for a moment then she is regagged and drug away. Could that really be your boss? It sure looked like her but she never seemed to be the one to be put on a leash? Maybe she needs rescuing? She didn’t seem to be in too much distress. Is she going to use you knowing she’s here against you? Over the next half hour you exhaust yourself with questions and fall asleep in their midst.<br>\r\n<br>\r\nBlinding light tears you away from sleep. Your shoulders move to roll you over from the offense. BANG! You hit your head on something unforgiving, you recoil and BANG! You hit it again. Sight doesn’t help for a moment, everything is washed out while your eyes dilate. You are in a cage! People can see you! Where are your clothes?!? What the hell? Oh right, nothing is wrong. You haven’t been kidnapped, you signed up for this, you are chasing your fantasy. It’s ok, you are supposed to be here. After a moment of hanging on to the bars like the sides of a roller coaster, composure is returned and a modicum of excitement reinvigorates your opinion about being rudely wakened.  Is the shop open? Anything beyond the artwork inside the display case is an unknown and there isn’t enough light reflecting off the shops across the way to make anything out. Oh well, nothing left to do but wait and see what happens. Nobody bought you yesterday, possibly because you spent the majority of the day erect in excitement about the situation. Maybe today you shouldn’t advertise being so eager. It must still be early morning, the sun is scantly above the horizon and everything else seems to be closed, there are few people outside. Maybe you can get some more sleep? Leaning back against the bars you put your hands between your legs to try to cover yourself and attempt to sleep for a little longer.<br>\r\n<br>\r\nClunking pulls you from sleep. Remembering where you are and why you are here spares you the scare from last time. It’s late morning, the street is crowded again, you can even see another human outside, his hand is tightly held by an upright wolf and is being pulled down the street like a disobedient toddler. The clunking is coming from your right, the display case door for the alcove is open, and a large clawed hand quickly snatches the body builder guy out of sight. The case is shut again and silence returns. About twenty minutes later the vacancy is filled by a shrunken couple, a young man and young woman, maybe just twenty, they are shrunken to maybe two feet tall. Standing upright in their cage they waste no time making out while clearly indifferent to anything watching. Their collars are connected with another lead joining the middle of theirs. A shade of jealousy floats around in your thoughts for a moment before deciding just to wish them well on their journey.<br>\r\n<br>\r\nThrough the day you watch dozens, maybe even a hundred humans carried from the shop in cages or otherwise enthralled by something that was not human. Maybe not being bought was a good thing? You did jump into this in the moment. The people buying humans were not exactly the girls you fantasized about in high school. You have to be getting to the point in the afternoon where the 24 hour mark was coming around. Well if it happens it happens. If not there is a lavish bungalow with your name on it, hot shower and king size bed. Clunking shatters your train of thought? Was it your turn to be purchased? Anticipation, terror and joy bounce around your mind. The couples alcove opens and they have a horrified look as the wheeled device that placed them into their alcove retrieves them. Still not your turn. Half an hour later they are returned. He with a golden lion head where his penis should be and she with a similar one between her legs. They looked distraught as they tried to become intimate but obstructed with their restraints. Are they seriously locked in chastity belts? Like in medieval times? The penis between your legs twitches like it’s flaunting it’s freedom. Hopefully it doesn’t befall the same fate.<br>\r\n<br>\r\nSun sets again and returning to your bungalow is what you are wanting after spending a whole day in a cage you can’t lay down or stand up in. It was a fun experiment for sure, not being bought was a bit of a kick to the balls of your ego. With little else to do you watch the front of the store in the reflections and you see the door close and assume you will be let out soon. About twenty minutes later A female cheetah opens the door and exits the shop locking it behind her. It was now closed and you were still on display!  You were not released at the end of the 24 hour period! With anxiety you spring forward with every intention on pounding on the glass to demand what’s going on. As she walks by you can’t touch the glass or get her attention. Yelling didn’t help either. The couple seems to notice for a moment then returns to sitting on opposite sides of their cage. Just when were you getting out of here? Your cock had come back to life with being trapped here with no clear way to get out. Your mind was racing too wondering if you made a terrible mistake.  Could they have lied to you? <br>\r\n<br>\r\nAn hour into the internal raging debate someone stops outside the glass again. There is Eva, staring at you again. Still on a leash, she must have been sold too. Was she tricked, did she do this to herself willingly, is she enjoying a different arrangement? Her outfit was different this time, she was barefoot, wearing a small red loincloth and her hands were bound to her chest in just the correct position to cover her breasts. She wasn’t gagged this time and was clearly involved in a conversation with the bovine beast next to her. She was speaking when he turned and drug her off while she pulled back on the leash. She shot you an apologetic glance and was then lead off into the night. <br>\r\n<br>\r\nYou don’t see many humans from in here, the ones you do are at the mercy of a fur. There has not been a single free human pass by for a day and a half. As consciousness fades, you get a very bad feeling about this. <br>\r\n</span></div></div>",
            "created":1574232840,
            "id":2749064,
            "title":"Eva, and the Minotaur thing holding her leash"
        },
        "1342221":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "The cheetah returns and explains this is a huge mix up",
                "Your resolve to not be eaten and you try anything to get attention"
            ],
            "content":"<div class=\"\"><div> <span>Sleep was particularly heavy and being wheeled through the store shakes you awake. Maybe it’s time to finally get out of here. The cage is being wheeled back to where you first climbed into it, excellent. Only not, unexpectedly it twists violently and slams your cage into an empty alcove. The cage’s contents bounce around wildly. Once you right yourself the…fox girl…is already wheeling the cart away. You open your mouth to try to get her attention and you are shocked with debilitating pain from the collar and collapse against the bars. These collars weren’t like a dog’s bark collar were they? No it couldn’t be, you hadn’t actually started to shout. Maybe you should speak softly to try to not trip it. Nope, the test words you utter or at least try to utter to yourself give you the same jolt. Why can’t you talk now? How can you flag down someone that works here if you can’t talk? If you can’t talk how can you get this straightened out? Maybe this was a que to get released? Somehow you didn’t think so. Maybe if you wave wildly she’ll stop and talk to you? It’s worth a shot. <br>\r\n<br>\r\nThis location received far less traffic than before. Only a small koala boy noticed you and didn’t stick around long. Didn’t the cheetah say you should sell? Are you doing something wrong? Virtually none of the customers see you down here, there appears to be three shelves per unit and you are on the bottom one. The humans here were clearly much more accustomed to their cages and desperate to please potential buyers. Time was difficult to tell from here but you guessed it was around 11 when a long lull hit. <br>\r\n<br>\r\nThe fox girl came back, clearly annoyed about being here all together. Definite teenage behavior for any sentient species. She had a clip board and headphones in. “Cleaning time little humans!” Anxiety moved through everyone on the isle. She had a large cart behind her, already on it was a woman about your size still in her cage looking very distraught but apparently unable to speak like you. Infront of her cage was a very large clear glass box with a lid on the top about a foot around, and there was a small trash can in front of that zip tied to the handle bars. She loudly slurped her tea and scanned her clip board. “Ok sooooo who’s been here the longest? We have an order for the smaller humans who have been here for like ever. Jane here has been 8 months. Who’s next?” 8 months? Has she been in that cage 8 months or just part of the shop? Your cock raged at the helpless ness of your situation if you could be trapped here for a long time, does it hate you? The fox reaches for a guy who looks uncomfortably like you, “Terrance, you have been here for about six months, lets get rid of you!” Indifferently she unlocks his cage, puts the cage on top Jane’s cage and drops him into the glass box. “Kim, five months for you, in the box you go.” She repeated the process. She selected people smaller and smaller, starting at a foot and going down. After about a dozen shrunken people were in the box she pulled another miniature human from the shelf, “Oof, you’ve been here a long time miss….Summers? Like two years in that thing. I bet you are eager to get out even if it’s to go in the box. Lets get you outta there.” She twisted the key in the lock but it wouldn’t budge. The woman inside was clearly conflicted about this, the fox was not. “Oh well, I tried.” She dropped the cage with the six inch tall woman into the trash and picked up the next one. This was NOT the fun fetish experiment you came here for! Maybe that cheetah can help you, if you find him again and can get his attention. Maybe not? Maybe he said just what you wanted to hear and you signed your life away? People were in the cages for not just a couple days like he said, that last girl was two years! You have to get out of here. The fox girl threw another caged human into the trash and continued until the box was about half full of captives scrambling to not be crushed on the bottom. The fox pulled one last cage from the shelf, the man inside was perhaps four inches tall. “Wait a minute, your not supposed to be here, it says you were sent to souvenirs a while back.” She opened the cage and was about to toss him into the container when she paused and threw him up into the air. Her mouth pointed upward and opened, he fell into it and was swallowed whole! Was this something you missed when you read the brochure and reviews of this place? You did NOT sign up to be eaten!<br>\r\n<br>\r\nShe closed and locked the container and wheeled the cart toward the front. From the back of the container the logo for “Bethany’s ‘Bitty BBQ, the finest at the resort” was clearly visible. Panic hits realizing these people are being sent to a restaurant to probably be eaten, then your limbs go numb. Is this what happens if you don’t get out of here? Do you become food? Is this entire resort just a trap?<br>\r\n</span></div></div>",
            "created":1574236260,
            "id":2749068,
            "title":"Tomorrow morning things are instantly worse"
        },
        "1342222":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "Eva obediently drags you to his room",
                "Eva explains what your lives will be like as his property"
            ],
            "content":"<div class=\"\"><div> <span>Nothing is different when you wake up, excluding banging your head. This is the second time you’ve woken up naked and in a cage in front of strangers. This is the third day of your vacation. This is the thrill of a lifetime but you are starting to want out, if nothing else to stand and stretch. The shop isn’t open yet it seems. Great, locked inside something else that’s locked. Even your cock seems to be a little bored of sitting around naked. Your mind starts to wonder how much money you’ve spent to be locked in the display case, and how much a new phone would be, and the money that was in your pants that were trashed. Maybe you can talk to the resort about getting compensated for some of this. Not that you aren’t happy about chasing a fantasy, just the price tag is getting up there for sitting in a small cage that’s not terribly comfortable. <br>\r\n<br>\r\nFinally you think it’s open and after an hour or two you get desperate enough to yell for attention. “Hey! I want to get out now!” The sound is trapped in here with you. Maybe not all of it, you cover your ears and try again. “Please let me out! This isn’t what I was looking for! Can you let me go?” Again nothing. This time at the top of your lungs, “Help me! I don’t want to be in here anymore! My 24 hours are up and I want to leave!” From here you have no way to know if anyone heard that. Hours pass and nothing. Where is that cheetah? He is going to get a piece of your mind when you can talk to him. Being bored and passed over in here is not what you wanted. At least the women walking by the store seem to be particularly attractive, even if not of the human variety.<br>\r\n<br>\r\nCLUNK!<br>\r\n<br>\r\nWas that unlocking sound coming from your part of the display? The cat woman behind you lurched, YES IT WAS! You were getting out of here! Finally! A fox girl wheeled your cage out of the alcove and moved it toward the back where you were first caged. “THANK YOU! I’m happy you heard me, I have been yelling all morning.” She stopped and raised an eyebrow at you, “I didn’t hear you, we soundproof the display case, some of you humans get cold feet and it’s just easier if we can’t hear you whining about it.” Arching your neck to meet her expression you hold the bars on the top of the cage to keep from straining it, “You didn’t hear me? So are you letting me go finally? I thought I was only supposed to be in there one day.” She became busy behind the counter but responded to you, “Newp, didn’t hear you, and I’m not letting you go. But why did you think you’d be in there for just one day?” Without her eyes to meet you sit back down, “Because the sign on the wall says the collar comes off at the end of the day.” She laughed for a sec, “Your collar can’t come off until the end of your first day, that’s what it’s supposed to say. Why do you think your collar time has anything to do with being for sale?” You start to realize you never did get any set information from the cheetah, and it’s uncomfortable now “Isn’t the collar like a symbol for being, ya know, caged up and helpless?” She turned amused at you, “Um…no. Your collar ensures we can sell you for at least one day to someone. You stay here no matter what until we sell you.” Anxiously you sit up and turn to her, “So if nobody buys me?” She grinned back at you “Then you never get out of that cage.” A lot of anxiety sets in and she notices. “Relax little human, I am having fun with you. That’s not something you have to worry about! Someone’s buying you!” <br>\r\n<br>\r\nYour world spins in your head mixed with excitement, fear, anticipation, apprehension and a thousand other reactions to the news. What kind of goddess might be dragging you away like you fantasized about in the past? You don’t dare hope a human woman, maybe something like a cat girl or fox woman, you’ve seen plenty of those in your anime phase and they could push your buttons. Maybe these 3 days of your two weeks was worth it! “Take a look little guy.” Her foot shoves you around the side of the counter and standing before and above you is the minotaur you’ve seen with your boss on a leash, and there in front of your cage, is also your boss. Somehow that sheet of glass in the display case did her a disservice, she’s radiant. She is still leashed to the minotaur, her hands and legs are free, she’s wearing a more covering loin cloth than she did last night and she has a band of the same material covering her breasts, it looks like she added some ill matching straps to it by herself. Something was off and it wasn’t the contrast of the Eva he knew from the office and the Eva here on something’s leash. She towers over you at the office, here she’s not quite eye level with you and you are on your knees. She’s shrunk! She’s MAYBE two feet tall, if that, maybe a foot and a half.<br>\r\n<br>\r\nThe minotaur steps beside you and addresses the fox behind the counter, “I want to buy this one for a week. And make it match the size of the woman.” Wait match the size of the woman? You didn’t ok shrinking. That’s not on the approved list of topics you told the cheetah. The fox taps a few buttons on the computer and pulls you back behind the counter in front of a greenish panel. There is a red square on the floor with an X on it. “HEY Wait, I didn’t ok shrinking. That’s not what I’m into at all!” She kicks your cage discretely, “Shut up, he owns you now, it’s up to him.” You shake the cage I protest, “I didn’t ok being shrunk! Don’t do it!” She swipes his credit card and rings up your sale. Instantly you feel pleasantly electrified and everything excluding the cage gets taller. You guess you are about a foot and a half tall. Feeling small physically and power wise too. “Make me tall again!” Again she kicks your cage but it’s far more effective at shutting you up. She slides you out from behind the counter to his feet. “Here you go sir! One shrunken 26 year old male human. Are there any other accessories I can help you with today?” Bluntly he replies “no” to her and she returns his card to his outstretched hand, he also receives a complementary leash for your collar and the key to the cage. “Please remember you have a week to renew your ownership agreement. Have a wonderful day sir. Bye bye little human!”<br>\r\n<br>\r\nEva looks at you eagerly and puts a finger over her lips telling you to be quiet. This was most unexpected. You are ready to be removed from the cage, leashed and walked naked through the resort. Your fantasy is not quite the same as this but you are gonna embrace it. The minotaur takes a knee and unlocks your cage, then threads her leash through the padlock and relocks it. You both look back up at him puzzled, she looks particularly surprised. “Drag him back to my room. When you to get there I’ll take off your leash and let you out of the cage. Take the time to tell him what I expect of my little human property.” The midnight fur monster stands up and leaves without waiting for an acknowledgement. The fox leans on the counter watching him leave, “Ooohh, he seems fun. Have a good time you two!” Eva angrily shakes her hands before shaking her shoulders and exhaling. Silently she grabs the bars of your cage and beings dragging it out of the shop. <br>\r\n</span></div></div>",
            "created":1574246940,
            "id":2749090,
            "title":"Tomorrow morning nothing has changed"
        },
        "13422221":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "Mr Bowman comes to collect",
                "A young lady finally steals you away without the leopard noticing"
            ],
            "content":"<div class=\"\"><div> <span>You can’t wait to start figuring out why she’s here and being to talk while she drags you. Instantly she puts her finger in front of her mouth again. “Be quiet!” She wasn’t angry, just desperate to keep you silent. “He didn’t say you could talk, just me. He’s VERY strict. We’ll probably be able to talk later on, just for now be absolutely quiet.” You nod a little alarmed hearing the tone in her voice. She’s always in authority, here she’s a peer asking for your cooperation. The cage bars are too narrow for you to help her drag you, she doesn’t seem to have much trouble. She has always been athletic, her suits at the office completely disguised just how athletic she was. The muscles under her skin became obvious when pulling you, and when she relaxed they smoothed back out. Her beauty was sublime. This situation was surreal, you were naked, in a cage, not even two feet tall being drug around by a woman of otherworldly beauty all but naked, with no intimate pretext, all while now apparently being the property of something that was not human. All her effort was focused on dragging you to your new owner. People walked by the both of you or stepped over you with little notice. Thus was the opinion of shrunken humans at the resort. Your cock appreciated being belittled like this, even in spite of you trying to hide it from Eva, there was no way you thought you could get away with it if she saw it. She never spoke to you with the exception of where to rock the cage’s weight. <br>\r\n<br>\r\nAfter four hours of straining the both of you arrive at an especially nice high rise building. Once on flat granite she slides you with little effort. There is a sign written in ornate gold lettering right beneath the name of the building, The Velt, it reads “All humans on premises must checked in at the front desk to be tagged and picked up. Humans must be caged in all public areas. Unattended humans will be sent to the pound at their owner’s expense. Trespassing humans will be sent to the zoo.” This place seems very strict and unfriendly to humans. Actually, it seems more like a prison. A doorman kindly picked both Eva and your cage up and carried the both of you to the front desk. Behind it sat a leopard woman who raised an eyebrow and analyzed the both of you disapprovingly. Both of you were dirty from the drag here, she was exhausted and sweaty, somehow it only made her more attractive. You didn’t come up to Eva’s waist, Eva didn’t come up to the leopard’s knee. “Eew. And who are you here to see?” Eva got on her knees subserviently, “I’m Eva, I’m the property of Mr. Bowman in 1714.” The towering feline leaned over, “Yes I remember you, I’m always disappointed when you come back. I Hope you appreciate my following the rules and not just throwing you to the zoo. Who is this other wretch?” Eva looks up and yanks on the leash, “He’s Mr. Bowman’s latest acquisition.” The feline sits back up for a moment then leans back down, “cage boy, stick out your right leg.” Automatically you try but can’t, the gaps are too small. She slides a hard loop of plastic into the cage and instructs you to snap it shut around your ankle. It’s a one way snap and clearly it’s not coming off. It has the logo of the Velt on it and a serial number. “Very well boy, and now you.” She grabs Eva while pinning her arms to her sides then lifts Eva onto the counter. The leash isn’t long enough and it yanks hard on her neck, the cage even moves. She recovers quickly, while still clearly hurt. She nearly shouts and growls instead trying to keep her temper in check. “So sorry little brat, here you go” This time she simply grabs Eva’s right leg and holds her upside down to apply her plastic band. While upside down the feline pauses, “What’s this? You know you aren’t worthy of clothes right? When will you learn your lesson? How many times is this I’ve caught you wearing something like you are people?” A finger produces a single claw and in one motion it slides up her leg to her shoulder cutting away Eva’s clothes. Eva is dropped the last few inches to the floor and rights herself just in time to see what was her outfit tossed into the trash can. “Animals don’t wear clothes, you try my patience each time I see you in them.” The leopard enjoys tormenting Eva and continues by telling her she has sixty seconds to get locked into the cages at the front desk or be sent to the pound. She hurriedly drags you about twelve feet to one and somehow jams both you and the cage into one. Trying to respect her you close your eyes so you don’t take advantage of the situation. The leopard walks over and shuts the cage solidly with her foot. Then leaves both of you in perfect view of anyone approaching the front desk. <br>\r\n<br>\r\nThe second group to walk to the front desk arrives after your imprisonment at it’s base. It’s a family of elitist looking Jaguars. The shortest one doesn’t see the cage and knocks it hard with her foot. Both you and Eva crash against the sides leaving you momentarily stunned. She looks down and sees the pair of you and her eyes open wide, “Sweet nibblits, this place has complementary humans!” She lifts you high to take a good look at you, once you are convinced you are no longer seeing double, you notice she is stunning, her fur like blue midnight and eyes like the moon. She’s dressed like a teenager and showing off as much as her parents will allow her. The luna themed eyes dart all over both of you hungrily. Another young jaguar woman looks over her shoulder at you. “I’m guessing the male is an adult and that’s his adolescent mate. You can tell because her mammary glands are so small.” The one holding you turns to the one talking, “They are small but she’s in a more dominant position because he’s in a cage and she’s outside of one.” The first one to talk, the one with glasses furthers her point, “He’s subjugated her into doing all the work outside the safety of his cage, he’s clearly the dominant one in this pair.” If only they knew how utterly she was the dominant one in this “pair”. Secondly you wonder what they meant small mammary glans, her breasts were larger than most, not the biggest you’ve seen, but clearly desirable by many. The father figure turns and sees his oldest daughter putting your cage on the luggage cart. “Excuse me, those aren’t our humans. If you want some we can buy you some. Later today.” She stomps her foot and protests, “I want these! Besides these are a pair of humans.” The mother gently lifts your cage from the cart and places it back on the floor, “Now now, we just got here, you can’t collect the first humans you find. Besides these two are filthy.” Behind the counter the leopard lady notices what’s happening. “I beg your pardon family Geera, those humans are the property of a Mr. Bowman who is staying here. If you want I can pass along a message to him about your interest in acquiring those humans.” The girls instantly tell her to, their parents downplay it without trying to squelch their children’s excitement. “If he wants to give them away please have him contact us. We don’t want to inconvenience him.” The family leaves and the leopard’s face hangs over the counter above your cage, “I will be rid of you yet.” <br>\r\n</span></div></div>",
            "created":1574265480,
            "id":2749187,
            "title":"Eva obediently drags you to his room"
        },
        "134222211":{
            "author_id":"distantmark",
            "author_name":"distantmark",
            "choices":[
                "upon arrival you are introduced to your life for this week",
                "there is a surprise for you after you enter his room"
            ],
            "content":"<div class=\"\"><div> <span>More hours of your third day pass and as much as your penis will not stop loving this, you are becoming eager to get out. This is becoming a little too belittling.  Four more instances like the first one happen where giants pick up your cage and shake you about while asking if they can keep you. Eva says nothing and you decide it’s best to follow her example. Finally this minotaur Mr. Bowman comes down and retrieves your cage. He looks you over and sees the beginning of the bruise forming around Eva’s neck where the collar yanked on her harshly. “How did this happen? Are you ok?” Eva spends no time deciding to throw the leopard under the bus. He snorts and calmly reaches over the counter to the leopard. Grabbing her by her collar of her uniform he drags her halfway across the counter, “You have the audacity to injure my property, to injure me? I demand an apology, this, very, second.” This made a scene that brought the entire lobby to a standstill. “Sir! I don’t know what you are talking about!” Panicked she tries to free herself from his grasp but with absolutely no progress toward that goal. “My little female human. You injured her. She’s been my property for over a decade, she’s never lied to me, if I were to ask around, do you believe anybody will back up your claim?” She resigns to being caught in a lie, “No”. Your cage is slammed down in front of her face, “You will apologize.” Disgust runs rampant across the leopard’s face, “You are serious?” His fist tightens her collar to the point where she has trouble talking. “FINE FINE. I’m sorry! I’m sorry I hurt your little human. I was out of line.” His fist relaxed, “Good, now to her.” She was shocked, and clearly reluctant, “Are you kidding? It’s just a snack sizdd human.” His fist shook her entire body calmly, “OK ok, I’m sorry.” His nose released a snort, “Like you mean it.” Swallowing her pride she tried again, “Eva, I’m sorry I stepped out of line and hurt you. It was uncalled for.” He released her and walked back to the elevator. The manager approached him following the disturbance. “I’m very sorry about this sir, do you mind telling me what happened.” The elevator opened and the grabs the suited hippo by the collar and pulls him into the elevator. Once the doors close he holds Eva up in his face. “Eva here is one of my favorite human females in my collection, she’s a rare beauty in the human world, now she’s mine. That being said, she drug this boy in his cage across the resort by her leash and suffered no blemish for it. Upon arrival at the front desk your little kitty behind the counter yanks on her leash and injures her. Can you see he bruise on her neck?” The hippo nervously nods. Mr. Bowman releases the manager, “I expect to not see that woman behind any customer relations positions for the duration of my stay or any following stay, is that understood?” He nods in agreement, even if humans are non entities here, keeping their inhuman patrons happy is the only way to stay in business. Mr. Bowman hits the button for the next floor and throws the manager out of the elevator before it continues to the 17th floor. What kind of clout did this minotaur have here? The elevator eventually stops and the silence continues as he carries you two in your combined cage to your destination. This hotel looked to be for the rich and powerful of the fur world, and a very bad place to be for a shrunken human. Your focus now turns to simply surviving this week without being abducted, eaten or killed. Your cock was absolutely thrilled about all of this, the rest of you was in genuine concern about survival.</span></div></div>",
            "created":1574266080,
            "id":2749191,
            "title":"Mr Bowman comes to collect"
        },
        "14":{
            "author_id":"cooling999",
            "author_name":"cooling999",
            "choices":[
                "Mythological Collection",
                "Reptile Collection",
                "Bird Collection",
                "Dinosaur Collection",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You head over to a shop called \"The Smelly and Interesting Body\" and what you notice there was not what you had expected:  Old, shedded off parts of bodies anywhere ranging from shedded off cock sheths to whole body skin suits.  However, you notice there are a bunch of both people and furs here.  You just shrugged and you looked around the area.  As you were walking you saw five sections.  You decided to head to the...</span></div></div>",
            "created":1332997200,
            "id":1305577,
            "title":"Shop to pick up \"Smelly and intersting body..."
        },
        "141":{
            "author_id":"kyuremfan24",
            "author_name":"kyuremfan24",
            "choices":[
                "take a look at those 'pants'",
                "take a look at those tubes",
                "look further"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you walk into the mythological collection and you first see a group of 'pant' wich will change you into a uuper half human &amp; bottom half animal but you also see a bunch of tubes with changing gels<br>\r\nand then you decide to...</span></div></span></div>",
            "created":1439528400,
            "id":2021023,
            "title":"Mythological Collection"
        },
        "15":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Leave and don't buy anything",
                "ask some other shopers for help",
                "pick up a large rabbit skin",
                "pick up a zebra skin",
                "pick up a Rhino skin"
            ],
            "content":"<div class=\"\"><div> <span>The shop appears to be a place wear you change your species!<br>\r\n<br>\r\nOn the wall are several skins, wolf skins, bear skins, big cat skins any kind of skin imagenable!<br>\r\n<br>\r\nThere seem to be changeing rooms where buyers put on their skins for example a one lady does inside a human and comes out a Tiger!<br>\r\n<br>\r\n<br>\r\nWhat do you do </span></div></div>",
            "created":1175490000,
            "id":394981,
            "title":"Change yourself!"
        }
    },
    "info":{
        "author_id":"talonsaurn",
        "author_name":"Talon",
        "brief_description":"A strange resort designed to cater to the exotic tastes of some furs.",
        "created":1054216920,
        "description":"<td align=\"left\" class=\"norm\">Exploring, you might get a chance to patoronize or be patronized by the lions other customers, All customers are furry, though the \"reader\" can take on a human roll if they are being a victim or leave it ambigious if the victimizer. Some of the various places that are set up for entertainment follow too. A mix of Hotel, ammusment, and bathouse, almost anything is possible<br>\r\n<br>\r\nBondage<br>\r\nSizeplaying with macro/micro<br>\r\nThe consumption of sentients<br>\r\nBad smells<br>\r\nTransformation </td>",
        "id":697118,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1592620920,
        "modified":1592620920,
        "pretty_title":"The Resort"
    }
}