{
    "chapters":{
        "1":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "3 inches",
                "1 inch",
                "1/2 an inch",
                "1/8 of an inch",
                "5 mm"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How small are you Hank?</span></div></span></div>",
            "created":1359867600,
            "id":1523606,
            "title":"Beggining"
        },
        "11":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "Hide",
                "Stay, Clifford will remember you",
                "Run"
            ],
            "content":"<div class=\"\"><div> <span>You are Hank, you live with your family in a two story suburban home. You lead an average life, doing good in school, and  having a couple friends. You wake up and look around, you grumble unintelligibly before you realise your room is giant! Or rather, you are tiny, you crawl out of your sheets and stand up, you're rather glad that you didn't change before you went to sleep, because at this size none of your clothes would fit you. You hear some noise, your mother is coooking down stairs, you can hear pots clanking, you can hear feet passing by. You climb over to the edge of your bed and make your way down your sheets that hang limply to the ground.<br>\r\n<br>\r\nYou make it to the ground when you hear the clack of claws on a wood floor. Your Bloodhound Clifford is coming for your room. You see the dog push his way through the door and sniff around. Clifford is a big red Bloodhound and has bad smelling fur. You see slobber drip from his giant mouth, hitting the floor with a thud. He looks at you and starts approaching. You...</span></div></div>",
            "created":1359867600,
            "id":1523654,
            "title":"Big Boy"
        },
        "111":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "Try and sneak out",
                "Wait until Clifford leaves",
                "Stay put"
            ],
            "content":"<div class=\"\"><div> <span>You know tha you wouldn't be able to out run the dog and you certainly know only a fool would approach a giant predator. You look around and look for somewhere to hide you backup and realise you might be able to hide under your bed. You back up a little farther. Clifford starts growling and getting lower. He approaches the bed and tries to fit his head in. You are glad your bed is so low to the ground now that you have to hide from a giant dog. Clifford is now snapping at you from outside.<br>\r\n<br>\r\n\"Well... I'm trapped under my bed with a giant dog out there.\" You say as you look about.<br>\r\n<br>\r\nNow you...</span></div></div>",
            "created":1359867600,
            "id":1523747,
            "title":"Hide and Seek"
        },
        "1111":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "You fall",
                "Clifford brings you outside",
                "Spit out"
            ],
            "content":"<div class=\"\"><div> <span>The jaws eventually quit snapping and you see Clifford lay down, facing the other direction. You take this as your chance, you tip toe your way to the edge of the bed then break for your bathroom. If you make it, you could be able to escape from Clifford. As you're almost to the door, you turn to see Clifford coming down on you. You quickly get through the door, and push it closed, on Cliffords muzzle. The dog is now snarling and trying to push past the door, you keep pushing, but the dog bursts through.<br>\r\n<br>\r\nYou are flung to the ground as the furious Clifford stands snarling above you. You try and scramble backwards but its no use. To your horror, Clifford picks you up in his giant maw and turns his head up to swallow you. You hold onto his nose and barely avoid falling to your doom. Next...</span></div></div>",
            "created":1359954000,
            "id":1524154,
            "title":"Try and sneak out"
        },
        "11111":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "content":"<div class=\"\"><div> <span>You try and hold on but your fingers are slipping. You grip with all your might and... fall. You fall down and hi the dogs tongue, you try and find a hand hold but you slip down to the back of the throat too fast. You are being covered in slobber and it smells fowl in the dogs mouth. You slip into the esophagus and are slowly pushed down the throat to your doom.<br>\r\n<br>\r\nIf someone had been watching they would've seen a large lump work its way down Cliffords neck as he swallowed his owner. The dog then moved on, another small one taken care of.</span></div></div>",
            "created":1362851640,
            "id":1546792,
            "title":"You fall"
        },
        "1112":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "Head to the Living room",
                "Head to the Kitchen",
                "Head to the Door"
            ],
            "content":"<div class=\"\"><div> <span>You wait for the jaws to stop snapping for you, and even longer for the dog to actually leave. As you look out you see nobody was there. Its time to leave your room. As you reach the door you peak out, nothing. You quickly dart to the stairs, and find nobody on it. As you make your way down the stairs you are a smidgen too hastey and forgot to notice Clifford, sleeping at the base of the stairs. You try to stop yourself and as you spin your arms in a wild attempt to save your life, you see the dogs teeth bared, ready to snatch you up in an instant as a tiny snack, and see his body pulsing rhythmically to his breathing. As you fall forward you land on Cliffords side, praying for your life.<br>\r\n<br>\r\nHe stays asleep. You crawl off and finish down the stairs. As you reach the bottom, you...</span></div></div>",
            "created":1363046160,
            "id":1548254,
            "title":"Wait until Clifford leaves"
        },
        "112":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "content":"<div class=\"\"><div> <span>You stand there as Clifford approaches you, his large paws landing with a thud. You see the giant dog stop infront of you, and then he lunges for you with his emmense jaws. You dodge to the side, barely evading being chomped by the dog. You start to run, but the dogs tongue snatches you up into his mouth. Your legs dangle out helplessly along with your arms as Clifford tastes you. You are covered in Saliva as the tongue works over you. You feel the head titlt back and you atart sliding down the throat. You slip past and down the esophagus and fall into the acid in his stomach. You die shortly after due to burning alive.</span></div></div>",
            "created":1360126800,
            "id":1525707,
            "title":"Stay, Clifford will remember you"
        },
        "113":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "You are picked",
                "You try to escape"
            ],
            "content":"<div class=\"\"><div> <span>You break off in a dead sprint to escape Clifford. You have barely made progress when the big dog clamps down on your body. Your legs dangle from his mouth as he licks your body all over and lightly chews you. You're definitely moving, and you don't know where. You feel the movement stop and you are dropped into someones hand. Its your younger brother Justin, he is known for feeding Cliffords destructive habits. You are placed on a shelf in a small container. You look around and see something terrifying. You see a few of your friends shrunken on this shelf too, Justin reaches up and takes your friend Ben, a taller guy, not very athletic but really bright.<br>\r\n<br>\r\nBen is brought to Clifford and placed on his nose. You know too well from Toy Story what is about to happen. You watch as Clifford sits there for a minute with Ben laying atop his nose, motionless. Suddenly, Clifford jerks his nose up and catches Ben in his mouth. Clifford shakes his head side to side quickly, and viciously. Clifford stops, and bends his head down, Ben falls forward, but Clifford quickly bends his head back quickly and swallows Ben.<br>\r\n<br>\r\n\"Good dog.\" Justin says as he reaches forward and pets Clifford. Clifford jumps forward on him and licks his face. You are thoroughly terrified of this dog now.<br>\r\n<br>\r\nNext...</span></div></div>",
            "created":1359867600,
            "id":1523838,
            "title":"Run"
        },
        "1131":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "Stay here",
                "Escape",
                "Help your friends"
            ],
            "content":"<div class=\"\"><div> <span>You are shocked at the cruelty of your brother and at how long this has been going on for. You suddenly see his hand coming in to grab you, and before you can resist, you are in the air. You look at Clifford, hungrily staring at you. You look at Justin, he has a devious smile. You are lifted up to the top of a dresser, you look down to see Clifford waiting at the bottom for you to fall. You feel Justin inch you towards the edge. You feel a last push as you fall, you land waist deep in the dogs maw, then he starts tearing you up. You feel his teeth pushing into you as he swings his head around. You hold on for dear life, praying you don't die. Clifford chews on you more before falling to sleep. You are thoroughly covered in slobber, and the dogs tongue under you offers comfort. You...</span></div></div>",
            "created":1359954000,
            "id":1524635,
            "title":"You are picked"
        },
        "11312":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "Finds you",
                "Doesn't "
            ],
            "content":"<div class=\"\"><div> <span>You decide that you need to get out of here. You pull yourself out of Cliffords large mouth, and onto the floor. You drip with slobber, and start to slowly stand up. You look at your friends, you know Justin wouldn't bother with tricks, you'd just be fed straight to Clifford, or worse if you tried to help. You make your way towards the door, Justin is sound asleep, Clifford is behind you, escape doesn't seem too hard. As you get to the door you look back once again to see Clifford is awake. You supress a scream so that you might just be able to escape. You break of running down the hall. You hear Clifford coming out of the room, and you know your life might aswell be over. You look for somewhere to hide and find it, the closet. You dive into the closet and crawl behind a few boxes. Clifford comes in seconds later and he's angry. Spit drips to the floor, he's snarling, you ball up and hope he doesn't find you.</span></div></div>",
            "created":1360126800,
            "id":1525684,
            "title":"Escape"
        },
        "113122":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "Stay",
                "Run"
            ],
            "content":"<div class=\"\"><div> <span>You wait for what feels like hours as the dog searches for you, but he eventually leaves. As you come out of your hiding spot you make your way towards the door. As you walk you slip in some of Cliffords saliva. You pick yourself up and continue on, though you now smell like the dog. As you hop down the stairs you see your cat is coming up. You...</span></div></div>",
            "created":1363268460,
            "id":1549953,
            "title":"Doesn't "
        },
        "11313":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "Picks you",
                "Picks Beth"
            ],
            "content":"<div class=\"\"><div> <span>You crawl your way out of the dogs mouth and onto the floor. Justin is asleep and you decide you must help your friends. You get to the dresser they are perched on and climb. You climb for an hour and reach the top. As you release your friends you are greeted with jubalee as you tell your friends to run. As you make itto the ground you all start creeping out the door. You and your friend Beth are in the back herding everyone when suddenly hands wrap around you. You see Justin holding you up to his face, Clifford walks lazily out the door to follow his prey.<br>\r\n<br>\r\n\"You dare defy me? Well, we'll see what Jill will have to say about this.\" He says as he brings you to Jills room. He hastily ties you up in tape and leaves you for Jill. Jill is awoken by the ruckus and comes to examine what is at her door.<br>\r\n<br>\r\n\"Thank you Justin.\" She whispers as she lifts you two to the window and you can see what is happening outside. Slifford caught up to your friends and is eating them alive. A few escape in the madness, and an oppurtunistic bird nabs one. You watch as your dog swallows your friends.<br>\r\n<br>\r\nJill turns you back around and you see something you never expected to be so terrifying, a dildo. Jill reaches over and...</span></div></div>",
            "created":1362805200,
            "id":1546731,
            "title":"Help your friends"
        },
        "113132":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "Applies directly to vag",
                "Used elsewhere"
            ],
            "content":"<div class=\"\"><div> <span>You watch as Jill is picked and brought over to the dildo. She is screaming as she is taped to the sex toy, and it is set on the ground, you watch as your sister descends upon the giant toy, and as she descends beth screams more. You remember Jill making a comment earlier and think, this could have been going on without you knowing for a while now. Beth suddenly goes silent as you see her head engulfed in Jills vag. Jill goes down farther, and then grips the end of her toy and stands up. She starts pumping it up and down and you see Beth still attempting to struggle against her giant horny captor.<br>\r\n<br>\r\nJill finishes and removes the sex toy. Beth is gasping for air as she is laid on the ground covered in fluids. Jill starts reaching for you and you are now thoroughly afraid, with what she did to Beth you hop that she doesn't use you, her brother in the same way. She...</span></div></div>",
            "created":1362852060,
            "id":1546797,
            "title":"Picks Beth"
        },
        "1132":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "Make it",
                "Don't make it"
            ],
            "content":"<div class=\"\"><div> <span>You look around, you see another one of your friends chosen, then another. You watch, then see Justin place one in his pants. You are fearful now, then see the next friend placed on Cliffords sheath.<br>\r\n<br>\r\n\"Rub it.\" Justin commands.<br>\r\n<br>\r\nYou didn't hear the choice but you saw the effects. Your friend is picked up and brought to Cliffords mouth. You see your friend struggle, and then you see your brother hang your friend above Cliffords maw. You watch as your friend falls into the hole and watch as a lump develops in Cliffords throught. You've had enough, you climb out of the glass jar and start making your way down the shelf. You see your brother open his pants and look in to check on his toy, your friend. You watch as Clifford prowls below, looking for anything else to eat.<br>\r\n<br>\r\nYou manage to get down and are now on ground level, you try and avoid Clifford as you watch him make his way around the room. You have made it to the door, when Justin notices your absence. You break into a dead sprint making your way out of the room. You enter the hall and make for the stairs when you hear Justin issue a command. You hear Clifford come gallompfing out of the room as you make it down the steps. You turn the corner to the back door. You see your father has it opened, and you intend to make it out too. You get close and run hard and you...</span></div></div>",
            "created":1359867600,
            "id":1523903,
            "title":"You try to escape"
        },
        "11322":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "Fed to Clifford",
                "Torture time"
            ],
            "content":"<div class=\"\"><div> <span>The door closes right before you can make it to safety, and now you are faced with a menacing Bloodhound. Clifford descends upon you viciously. You are taken up in his maw and shaken vigorously. You are dazed when you realise you are being brought back to Justin. You are deposited before your brother, he passes harsh judgement.<br>\r\n<br>\r\n\"Your fate isn't looking good. You'll probably be fed to Clifford or tortured by either of us.\" He says as you drip clean of dog saliva. He holds you up between his pointer finger and thumb. \"Whats it gunna be?\"</span></div></div>",
            "created":1359867600,
            "id":1523910,
            "title":"Don't make it"
        },
        "113221":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "content":"<div class=\"\"><div> <span>\"Clifford, come.\" Justin commands. You watch as Clifford walks over to Justin and obediently sticks his tongue out, mouth open. You struggle as you try to free yourself from his grip. You feel Cliffords terrible breath beating against you as you are placed under his tongue. Your legs are spread and the tongue lays atop your chest and your head sticks out of Cliffords mouth. The warm, sticky ttongue on your body feels good, but then, Clifford turns his head up. You fall down off his tongue and into his throat. You try to pull yourself out but you get pulled deeper, and deeper, until you land in his stomach acids ajd die.</span></div></div>",
            "created":1360213200,
            "id":1526592,
            "title":"Fed to Clifford"
        },
        "113222":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "Pushed in",
                "Sacrificed"
            ],
            "content":"<div class=\"\"><div> <span>\"Well then...\" Justin says as he opens his pants and drops you in. You find your friend gone, which leaves only a few possibilities. You see Justins penis lift and he get an idea. He grabs you up and brings you high, you look around in terror as you see his raging boner lifting higher. Your worst fears are confirmed as you descend slowly to the awaiting penis, you scream and kick, but suddenly, your feet are stuck, you scream in terror as you are pushed farther down, the hand is removed and you try to push your way out. This is to no avail. You look to Clifford and Justin, suddenly the hand comes down to you. You are...</span></div></div>",
            "created":1359867600,
            "id":1523921,
            "title":"Torture time"
        },
        "1132222":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "Outside",
                "To his corner"
            ],
            "content":"<div class=\"\"><div> <span>Justin lifts you from his package and strips you of your clothes. Then, a female friend of yours, Beth is brought over too, she is stripped and hung by her hands on a string a couple feet above the ground. You are placed on a similar string and watch in horror as Clifford approaches. Beth screams as the giant dog jumps up on a box and brings his pink, slippery tongue around her. He then gets her firmly in his mouth then places her on his sheath. She falls blindly onto it and sticks from the saliva. As she screams and struggles the dog is aroused and she is stuck further due to cum. You watch as the dog comes closer to you and grabs you up, but he abuses you. You are chewed on and shaken. You are cut from the dogs teeth. You are brought with Clifford...</span></div></div>",
            "created":1359867600,
            "id":1523924,
            "title":"Sacrificed"
        },
        "14":{
            "author_id":"segsy",
            "author_name":"Flakker",
            "choices":[
                "Justin",
                "Jill",
                "Mom",
                "The cat"
            ],
            "content":"<div class=\"\"><div> <span>You wake up suddenly. You don't know why, but you feel different, you look around and realise that its probably because you have shrunken down to about 1/8 of an inch tall. You climp over to your night stand and slide down an old guitar propped on it and make it to the ground. You hear footsteps approaching and in comes...</span></div></div>",
            "created":1359867600,
            "id":1523898,
            "title":"1/8 of an inch"
        },
        "144":{
            "author_id":"ben999999",
            "author_name":"benub",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>It's just Lily, your female tabby cat. She uses to wander in your bedroom to tell you good morning in the cat way and receives some petting. But now, she looks like a living mountain at your size, and you're far to be able to pet anybody. You're totally paralyzed in fear as she nears quietly the spot where you are standing.<br>\r\nDoes she notice you ?</span></div></div>",
            "created":1375657200,
            "id":1640269,
            "title":"The cat"
        },
        "1441":{
            "choices":[
                "The cat gets free, and your torment continues.",
                "Your sister walks into the room, hearing the commotion.",
                "You decide to try and leave the room before the cat can get free."
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\"><b>MEOW!!!</b></font><br>\r\n<br>\r\nYou cover your ears in pain.  The colossal shriek of sound emanating from your cat hurt your eardrums quite a bit.  Standing right in front of you was a giant tabby cat staring at you, its eyes filled with lust.  <br>\r\n<br>\r\nYou raise your hands at it, watching it stare it you carefully, unmoving and patiently watching you.  <br>\r\n<br>\r\n<font class=\"size15\" style=\"\">\"Now now, Lily! Good girl, stay right there!  Good!  You just. . . \"</font><br>\r\n<br>\r\nThe cat began to slowly move closer to you, you flinching at the sight of it.  You move backwards, your face starting to sweat at the sight.  At the current moment, you were standing on the bed, carefully backing away.  With your movement and you not paying attention, you trip on the blanket you were standing on!  <br>\r\n<br>\r\nWith a carefully planned attack, now was the time your cat decided to strike.  With a bellowing hiss, Lily lunged at you, jumping right behind you on your pillow as she watched down below.  Filled with fear, you get yourself up quickly and move in the opposite direction away from the giant menace!  The cat moves its paw at you, but does not pursue you.  It just watches you again.<br>\r\n<br>\r\n<font class=\"size15\" style=\"\">\"No, no, no!!  Bad Lily!!  Don't do that!!  Stay, stay stay!!\"</font> you say at the titan sized cat.  You realize that this is just some messed up game for Lily.  You have seen her play with her \"food\" before.  The difference between her \"food\" and you, is you would outsmart her.  <br>\r\n<br>\r\nYou hoped anyway.<br>\r\n<br>\r\nYour mind was off in the distance as the cat realized you were not looking at her.  With a carefully swipe, she pushed you backwards towards the end of the bed.  The mattress managed to absorb the blow, but you were definitely winded by it.  Shaking, you got up quick. . . . your eyes growing wide at the scene in front of you!  <br>\r\n<br>\r\nYour hundred feet high cat was rushing right at you!!  You screamed as the paw came at you again. . . again hitting you into the air.  Flying away, you realized that Lily had knocked you off the bed!!  Rushing to take action, in order to let yourself stay alive, you grabbed onto the nearby blanket besides you.  Your hands grasped hard onto the blanket in a hazed attempt.  It slows your descent a bit, but you still hit the carpeted floor.  <br>\r\n<br>\r\nLily saw you fall and immediately came back at you.  Only the cat found itself stuck under the blanket as it leaped off of the bed.  The enormous blanket created a shadow above you.  You rushed towards the nearest shelter, which was your grey sandals nearby the bed.  You could get underneath it, losing your cat in the process.  <br>\r\n<br>\r\n<b><font class=\"size4\" style=\"\">\"MROWW!!!\"</font></b> Lily stated in disgust.  She was stuck underneath the blanket.  Now you just had to decide what your next move would be . . . <br>\r\n<br>\r\n</span></div></div>",
            "created":1375662780,
            "id":1640305,
            "title":"Cat Trap!"
        },
        "1442":{
            "author_id":"ben999999",
            "author_name":"benub",
            "choices":[
                "You run to one of her hindleg and begin to climb",
                "You try to catch her attention directly",
                "She sits on you accidentally"
            ],
            "content":"<div class=\"\"><div> <span>Lily doesn’t seem to even notice your existence. She passes coolly above you, her discreet stamping making like a huge earthquake at your level. Unable to stand because of the tremor, you sat and contemplate in awe the spectacle. Her body seems to be miles away above you, and you can now observe in more details her anatomy (at least for the underside): her gracious chin and long neck, her firm chest, her supple belly, her ticklish abdomen with tiny undeveloped nipples…. Suddenly, she stops as she’s sniffing your sheets and deduces you’re not here from the smell (but how could she doubt that it is because you’ve become too small to impregnate it significantly anymore?). Now, you stand between the cat’s hind legs, right under her massive butt. You raise your eyes, following her leg, and then you catch it: her privates, placed just below her tail and framed by her fur like a painting. Her tight pucker similar to a rosette while her pussy lips stretch like a delicate curtain for her vulva, with maybe a slight glistening caused by few juices leaking out (she was probably approaching heat).<br>\r\n<br>\r\nYou don’t know why but this eyesight is enough to put you in trance. Retrospectively, you can’t deny that Lily is not just a common pet for you. At your eyes, she was more than cute, but kind of lovely. You can remember, in childhood, having a crush on her: hours of playing and cuddling with her, as well as comforting her when she experimented her first heat, because you flatly refused she was butchered for spaying. You even remember that you tried to relieve her frustration by rubbing her vagina with your fingers, or even once a Q-tip. There weren’t any sexual aspect in that, but just a feeling of caring toward her, and she returned it well with plenty of tenderness and thankfulness.<br>\r\n<br>\r\nBut now, it is you who need caring, being so vulnerable at your size and Lily is probably the one you trust the more. Despite it is just a pet, maybe you can make yourself understand and manage to get help with her. At least, she would be a convenient vehicle to speed up your trips.<br>\r\nSo what happens ?<br>\r\n</span></div></div>",
            "created":1375739040,
            "id":1640923,
            "title":"natural wonders"
        },
        "14423":{
            "author_id":"ben999999",
            "author_name":"benub",
            "choices":[
                "unbirth",
                "anal vore"
            ],
            "content":"<div class=\"\"><div> <span>As you prepare to move toward her leg, you notice a shadow forming over you. As you raise your head once again, you’re struck by a new spectacle, not as charming than the previous one: her body is falling on you. You finally realize that she’s sitting right in the place where you are, but at your level, it’s just like if the sky was falling on your head. You try to run in order to escape, but it’s useless: you’re smaller than the smallest specie of ant, and don’t even move as fast. You could try as well to flee a comet. As you smell the musk of her butt approaching, you decide to stop and face your fate proudly. At least, you’re happy to die under the butt of your favourite pet than stomped or vored tritely anywhere else. You see her giant privates coming to crush you, then hear a loud <b>boom</b> as everything turned black and you faint.</span></div></div>",
            "created":1375739700,
            "id":1640930,
            "title":"She sits on you accidentally"
        },
        "144231":{
            "author_id":"ben999999",
            "author_name":"benub",
            "choices":[
                "North",
                "South"
            ],
            "content":"<div class=\"\"><div> <span>A few hours later, you eventually wake up, still a little dizzy from the huge shock you received. After a little time of recovering, you try to gaze at your surroundings. It’s quite dark there, so you can’t say there’s a lot to see. You’d tell in a first time that it looks like a narrow cave, rather a tunnel. But there’s something bizarre: the ground and the walls are surprisingly smooth, soft… fleshy. There are strange veins pulsating all around you. You can also see liquid trickling around you, and it’s not water, but something thicker. Because you’re thirsty, you take some on your hand and bring it to your mouth, but it tastes really strong and salty; not really thirst-quenching. But the thing that struck you the more is the smell: the atmosphere is really damp and this musky smell incredibly strong, making you almost choke. It’s at this instant the truth hit you as you recognize the smell: you are inside Lily’s body. You must have been literally moon-thrown during the impact, and by chance, you had landed in one of her orifice. And all evidences indicate that it must be in her vagina: you’re inside your pussy’s pussy. You laugh nervously at this stupid private joke while you’re overwhelmed by emotions, curled up against one side of the fleshy tunnel. <br>\r\n<br>\r\nYou try to evaluate the situation: the good news is that now you’re hidden in your cat’s inward, you’re protected from any danger of the outside, even Lily herself. The only exception is the case that a tomcat mounts her, but you trust your family to keep Lily away from any pretender. The bad news is that it is Lily’s body itself which could be your tomb if you weren’t careful enough. You know enough on sex to fear the devastating effect of the vaginal contractions on your little body, if she ever orgasms. You’re convinced that, being a female, your pet doesn’t need to masturbate, but you have been sometimes suspicious when you noticed how she insists to clean her privates, and licks… voraciously down here.<br>\r\nWhatever, you decide it’s not careful to stay in the middle of her genitals. But you can’t tell in which direction is the exit, because Lily is laying on her side, and the ground looks horizontal. <br>\r\n<br>\r\nYou have to make a choice.<br>\r\n</span></div></div>",
            "created":1375744200,
            "id":1640966,
            "title":"in the pussy of the monster"
        },
        "1442311":{
            "author_id":"ben999999",
            "author_name":"benub",
            "choices":[
                "explore her deepest places",
                "stay in her vagina"
            ],
            "content":"<div class=\"\"><div> <span>Since you don’t have any clue on your position in the vagina, you decide to go straight ahead in the direction you’re facing. You manage to get up, and begin to walk carefully. But the progression is far to be easy: the fleshy ground isn’t steady, but quite rubbery and elastic. Your feet sink in the smooth ground at each step, and it makes you stumble often. The air is most, and you have trouble to breath. Moreover, the walls twitch around you from time to time all along your progression, because you lean on them to keep your balance and catch your breath. It’s hard to believe, but it seems that even at your microscopic size, your ridiculously tiny touch can arouse Lily unconsciously. When you feel that the twitches dangerously increase in frequency, you make a break and wait for her to quiet down. In these moments, you indulge in contemplating your surroundings. You plaster an ear on the wall and listen at all the organic noise: her slow heartbeat, her breathing, her digestion gurgle. You guess she must be asleep for now, as every cat does three fourths of the time. You’re just stunned by this entire biological world, as you’re stroking gently the wall in daze. But you feel the wall react with quiver, and it brings you back to reality. It’s so awkward to think you’re inside a cat’s genitals that you tend to forget it regularly, and are always surprised to feel the flesh moving around you. You blush just at the idea of your parents knowing where you are now. When you remember how they went in a blind rage once they discovered your special trick to relieve Lily’s heat, you can’t imagine what it would be now with your full body inside her. But from now on, you can’t be sure to see them again to receive your punishment. At this thought, you feel a bit of dreariness, and prefer to focus on the trip.<br>\r\n<br>\r\nAfter hours of a laborious progression, you eventually come to a dead end. The path terminates into a conical shaped protrusion, with a small hole in the middle. You guess it must be the cervix, what means you followed the wrong direction. The positive point is that you know in which direction is the opening of the vagina. But, from now, you feel an extreme weariness feeling. You need several hours to cross the distance from the starting point, where you woke up, and the cervix, so the trip to the vulva could be easily twice longer from here. And even if you managed to get over there without a hitch, what would you do after? Do you really think that you have a slightly chance to catch someone’s attention at the half size of an ant? Do you even imagine that you may survive long enough outside to do it? You burst in tear as you consider the poverty of your situation. You have to be realistic: your cat’s genital is your better shelter from now on, and unless you find out a remedy to your shrinking state, your only chance of survive is to stay here. You crawl in a fornix, next to the cervix, and curl up as you deplore your fate. You think that the worst is probably to be alone in front of this ordeal. At this moment, you wished you had at least Lily to keep company, to pet her and cuddle with her and forget for a time this hell. But you are precisely inside her, and because of the size difference, she’s oblivious to your lone existence. You transfer you affection on the wall next to you, as you lay inside the orifice; petting, rubbing and scratching absentminded, imagining you’re doing it with her at your normal size. At this moment, you feel the whole cave shuddering and quivering, what makes you stop in surprise: it seems that your touch startles her. You repeat your motions to test her reaction and once again, you note that her whole genital shakes, except in your little hiding place, where you feel nothing more than a little twitch. You guess you must be in a particularly sensitive place of her genitals, but fortunately out of reach for the contractions it provokes, so that you don’t have to fear her arousing. As you keep rubbing, you can feel her heartbeat rises, her breath speeds up until it transforms into a very deep purr of contentment. You’re so happy to hear it as it reverberates inside her body… you just miss it so long. So, you decide to give her lots of pleasure as you launch into a furious massage of her fornix interior with your entire body.<br>\r\n<br>\r\nAfter she sat, Lily had waited a bit for your return; but noting you didn’t came back, she had hopped on your bed, and taken a sleep. Strangely, she had made a pleasant dream with a tom cat mounting her. But though the mating is usually painful, this cat was really gentle and caring, and his penis felt deliciously enjoyable in her inwards. She could have felt it give her kind of little tickle down in her privates, and she found it really pleasurable. After a moment of release, she had begun to feel an itch in a special place deep in her genitals. The sensation was so strong that it broke her slumber, and she woke up abruptly. She straights up her head and looks at her surrounding in a daze, looking for the thing which may have caused it. Then, it repeats once again and her whole body shakes, out of her will. She leans on her rump to examine more attentively, but she doesn’t see anything abnormal: it seems the source of the itching is inside her. She can now feel it prolonging in a nice friction, like if someone was petting her from inside, except it was a thousand times better, and more of that, it was arousing her like hell. She let her overwhelmed by the marvelous feeling as she closed her eyes and lay down her head, indulging in a very deep purr of satisfaction. As if it was responding to her pleasure, she feels now the little itch beginning rougher and more active inside her. Now, the sensation is getting more orgasmic as she feels her vagina twitching and pussy juices flowing out of her. She grunts, she yowls, she snarls while the itch keep stimulating her, the orgasms succeeding one another until she got in a cycle of constant cumming. She thinks that she’s going mad of pleasure if it goes on, as she’s rolling around, drooling copiously and eyes rolling in every direction.<br>\r\n<br>\r\nInside the cat, you’re yet not disappointed by the spectacle. The atmosphere is becoming damper than ever, while the vaginal contractions increase to an ecstatic frequency. Even your little shelter become to shake but you don’t mind. Maybe it is because of all the emotions you felt today but your only desire now is to indulge in your sexual instinct, no matter if your mate is a giant female cat that you’re fucking from the inside. You quickly strip naked and hump against the wall like if it was a partner, using your four members to rub it and your tongue to lick it. You even give her a nibble from time to time. You can hear all the noises of pleasure that the cat is mewling in reaction, and you’re tossed all around as she’s rolling everywhere, but it just arouses you all the more. Then, you quickly feel that you’re on the verge of cumming, as you hump harder. You realize that your first time is going to be with a cat (despite you must be the first to penetrate one entirely without damage) but you don’t mind. It is with your trustful pet, your Lily, the cat that you loved for so many years; and you don’t give a damn to what people may think. You’re (literally) in privacy and all you know is that it feels wonderful. You give a final great hump as you cum while you can feel your whole surrounding spasms as Lily must be having her own final orgasm. But this time, you also feel the fornix wall crushing, in the following of the vaginas. You’re totally breath-taken as the muscles trapped you, and soon, you prepare to finally die there. It’s would be an original and remarkable way to leave this world, after all. But hopefully, the walls release their grasp just before you suffocate. You just lay there, totally dazed as you catch your breath. You can guess from her fast heartbeat and her hyperventilating that Lily had just had the moment of her life, too. You give a last rub on the wall to please her, at which she answer by a pityfull mew, begging of release. You understand she had enough, and so, eventually, you get up, and return in the cervix area to contemplate her afterglow. Damn, the place was totally soaked in pussy juices and the wall totally red and swollen (as far you could see), still twitching a bit from the previous sensations. You couldn’t help to feel proud in front of your work: at your tiny size, you did better than any normal tomcat could ever do on her. As you’re gazing around you, you suddenly notice that the cervix has greatly loosened. The hole is now large enough for you to squeeze through, and the juices still leaking through it must lubricate the path anyway. You’re really tempted to explore deeper in Lily’s privacy, but you’re not sure it is a good idea to go further away from the entrance of the genitals.<br>\r\n</span></div></div>",
            "created":1375913340,
            "id":1642336,
            "title":"The trip of your life"
        },
        "14423111":{
            "author_id":"ben999999",
            "author_name":"benub",
            "choices":[
                "you become Lily's kitten (rebirth)",
                "you wake up the same (endo)"
            ],
            "content":"<div class=\"\"><div> <span>In a first time, you’re hesitating, because you fear it may be dangerous up there, and you were already very lucky to have survived to the previous crush. And then, you are like “Oh, the heck with it”. You’ve been shrunk to this microscopic size, and it would be a shame to not use this ability till the end. And it’s not like if your cat didn’t appreciate it, until now. Moreover, the little accident of earlier has shown you that the vagina was not a safe place: even if you took care to not arouse her any more, you can’t be sure that she wouldn’t orgasm again, either by self-pleasuring or mating with a tomcat, so it is obvious you have to escape from this organ by the shortest way. But, beyond any logic or emotion, it’s the instinct that is leading you at the moment. You don’t know why, but you feel that you have to travel in this place, like if there were a secret hidden here, and you had to find it out. You wonder if it is what spermatozoids feel like as you are standing here in front of the cervix, motionless, totally mesmerized by the mysterious dark, gaping hole. Then, you snap out of it as you notice that the opening begins to shrink, and feel that the afterglow is fading overall. If you want to enter the womb, you have to take the decision before the cervix close again. So you stop tergiversating… you just dive.<br>\r\nAs you’re crawling, you can feel how much the tunnel is very tight and narrow: the organ is clearly intended to only let in sperm, and not bugs like you, even of your size. Your progression is really slow and laborious, and still, you’re fortunate the cervical mucus lubricates the path, because otherwise, you could not make any progress. At the same time, you can hear Lily pushing some plaintive meow, and you guess that your presence must be uncomfortable, for her as for you. You don’t wish to do her wrong, so you try to hurry in your breaststroke throughout her folds, but they seem endless. Now, you have more and more difficulty to breath, and you’re beginning to fear that you foolishly throw yourself to the doom you just escaped (must be the irony of the destiny), when you finally emerge at the other side with a plop, and fall in the womb. Once again, you take a rest to catch your breath, and gaze at your new surroundings.<br>\r\nThe place is slightly darker, but not as much that you would have supposed. You guess there must be some light penetrating her flesh. Besides, though the atmosphere is really damp and heavy, you don’t have too much difficulty to breath. You can also observe that it is really roomier than in the vagina: in the distance, you see that the cavity split in two smaller tunnels. You know enough on cats to say it is the entrances to her uterine horn, which means that you are in the body of the uterus, for now. The ground and walls look like in the previous cave, but a little flatter, steadier, softer and especially more peaceful. In short, when you thought of your cat’s inwards as a living shelter, it looked more like that. But it’s not surprising, since you are now in the organ intended to the gestation of the kitten; it is designed to be extremely comfy and enjoyable. However, the think which strike you the most is the prevailing sounds: if you were already astonished by the atmosphere in the vagina earlier, it was nothing compared to what you were hearing right now. The heartbeat, the breath and the gurgling from the intestines; enhanced by her soft purr, mixed now in an amazing biological concert, sweet and heady; so that your only wish for now is to remain sat here, and let you taken away by the feeling. Now, you understand those who have a syndrome of “return to the womb”, if they have kept a subconscious memory of their stay in utero.<br>\r\nAfter all the strong emotions of your trip, combined to the comfy surrounding of your shelter, you begin to feel deliciously nappy. So, you decide to lay down right here, at the bottom of the womb. You rub the soft floor, as if to hug Lily, and let you fall in a deep sleep.<br>\r\n</span></div></div>",
            "created":1378847160,
            "id":1660853,
            "title":"explore her deepest places"
        },
        "144231112":{
            "author_id":"ben999999",
            "author_name":"benub",
            "choices":[
                "You get in a regular ovary (rebirth)",
                "This place is not exactly what you expected (fantasy endo)"
            ],
            "content":"<div class=\"\"><div> <span>You awake still the same, but not exactly at the place where you lulled to sleep. You are now nearer to the center of the uterus.  It seems that the cat has been moving while you were asleep, and the swinging must have made you slide deeper in the reproductive system. Besides, you can still feel the subtle motion of the cavity, and guess that Lily must be moving somewhere, doing her feline routine with you in her. The light in the womb is finer than ever, from what you deduce that it must be the night, and she’s doing her nocturnal activity. You are amazed to think that you didn’t awake from all of this shifting, and still now, you feel dizzy because of the rocking motion. You could probably fall asleep again easily if you wished, but you decide to fight against your somnolence: you hadn’t come here to fall in a comatose state, after all. You have better things to do, like explore. But, moreover, it is necessity that motivates you, too.  It’s been a while since you have eaten your last meal (to be honest, you didn’t even have the time to take your breakfast since you had awoken shrunk, in your bed); and you begin to feel seriously hungry and thirsty. And it’s not the pussy juices you had randomly swallowed which could satisfy you. Gazing at the fleshy ground, you wonder if you could feed on it. But you don’t want to hurt your precious pet, and the flesh looks too firm anyway. So, driven as much by curiosity than necessity, you get up and hit the road again.<br>\r\nIt’s so dark now that you have some difficulty to position. But you catch a glimpse of the two narrow tunnels which form the uterine horns, right in front of you. Since the cervix is sealed for now, they are the only option.<br>\r\nSo, you choose one path at random, and enter it.<br>\r\nAs you progress, you have a déjà vu feeling: the tunnel is turning more rippled, and is getting narrower and narrower. But, you can also feel that it is rising slightly upward. And, contrary to the vagina’s, the uterine walls don’t twitch and remain perfectly still (except the natural organic movement you’re used to). In comparison with the previous cave, the uterine horn is more like a health walk. But you shouldn't take this trip lightly: if you memories on cat's anatomy are exact, this part of the reproductive system is the longest, so that your walk may take several hours.<br>\r\n<br>\r\nFrom Lily's point of view, the story had not been so pleasant. After her huge orgasm, she had laid motionless on her side, totally numb because of the afterglow. The intense pleasure had pushed her in a trance. But, as the sensation was fading, and she had become to recover, she had felt another itch, this time on her cervix. It seemed that something living, like a tiny bug, probably the same which made her cum, tried to enter in her womb, but its touch had felt unpleasant on this body part, so sensitive for the moment. She had grunted and mewled in protestation against this intrusion, while pawing at her rump, but in vain. After a laborious and painful progression, the bug had finished to pass in her womb. Since this organ is less sensitive, she couldn’t have felt anymore its presence. As she had leaned on her abdomen, she didn’t have seen the slightly clue of its presence inside her like a twitching bulge or ripple. So, since there weren’t any more to do, she had decided to forget this strange insect, hoping it wasn’t some kind of parasite (but he wouldn’t be the only one in there) and go back to her routine.<br>\r\nThe day had passed as usual, but she hadn’t found her master. Besides, it seemed that the whole house was disturbed because of his disappearance. She had been feeling some sadness, but didn’t focus on it, confident in her master’s resourcefulness. <br>\r\nThis night, she was making her usual patrol, hunting rodents and intruders on her territory, until she began to feel a strange sensation in her abdomen. Once again, it was this tickling feeling, but deeper in her body. She decided to stop walking to better focus on the sensation. She sat, eyes closed, and tried to visualize. As minutes passed, the sensation became clearer: it was not an internal itch from her own body, but a foreign being tickling her from inside. It couldn’t be…the bug of this morning? How could it be still alive inside there? Lily was furious at this thought, not decided to let this ridiculous insect use her body like a playground. But the thing which worries her more is that the bug is coming toward a very sensitive place. She had never been conscious of its existence, but now that this thing was approaching it, there were a bunch of nervous warning signals preventing her against the danger. Mewling and hissing in anger, Lily begins to paw, push and scratch at her lower abdomen, trying to shoo away the intruder. <br>\r\n<br>\r\nInside her, you were continuing your trip. As you expect, the path is really longer than previously, and notably sloping; so that it begins to look more like a mountain hiking. You have to rest from time to time, leaned against the wall. You are still marveled by your biological world, but you’re also worrying, because, in addition to the hunger and thirst, the air is becoming damper and thinner. The oxygen which entered the womb during the orgasm is running out, and you fear to suffocate any sooner if you don’t find a solution quickly (at less, it should be quicker than starving). But you have not lots of options: it’s too late to retrace your steps, you are too embedded in the uterine horn to reach the cervix in time (and you are not sure it would open). Your only hope is to carry on toward the ovary, and find out… whatever you are seeking for. Once again, it’s your lone instinct which leads you, and anyway, you prefer to die attempting to do something than just stay there, waiting for your death. But as you get ready to set off again, you feel a sudden inclination of the ground. Lily must have sat down, and now the tunnel looks more like a chasm. But, thanks to your small mass, gravity isn’t as strong as you would suppose it is at your normal size. However, when you try to climb along the wall; you hear a strong hiss and angry meow from Lily. You wonder if she’s fighting with another cat until you feel the tunnel shake because of an external poke, followed by many others. It seems that Lily is kneading her flank, right above the place where you are. Is it possible that she has something against you? You are paralyzed by fear as you can hear now her scratching, and even biting just a few inches above, growling all the more to express her furiousness and frustration. You see that tunnel bend a little from the stroke, but hopefully, the layers of flesh are too thick, since it is intended to protect the fetus, and thus you are totally out of reach …unless she attempts a chirurgical operation by herself, but it’s unlikely, you think while sweating abundantly . Then, it seems that she changes of strategy: you’re shaken in every way as she rolls around and kicks out, trying vainly to dislodge you. However, it makes you slide to a great speed, so that you feel like in the worst roller coaster in your life. You’re so disoriented that you can’t say if it makes you go forward or backward, until you fall in a more constrictive area of the uterine horn, what you guess to be the oviduct. You’re almost at your destination. You manage to wedge there, waiting for Lily to calm down, and trying to comfort her by stroking the walls once again, saying more to yourself than to her: “it’s me Lily, your master; you’ve no reason to fear me”. Despite of that, the cat remains restless, particularly as she feels your presence so near to her sensitive place, but she quickly understand that her jerk has no effect on the embarrassment inside her body since the bug doesn't seem to move away. Exhausted, she lays on her side to recover. Inside, you think it’s now or never to finish your trip. You crawl laboriously in the very narrow duct, trying hard to do it the fastest possible. You have almost no more oxygen, and it would be exasperating to die so near to the end. Eventually, after interminable minutes of struggling, you finish to come to the entrance to the ovary. For the few light there are, you can see the pink wall, crossed by a long scar caused by the regular ovulations after many heat periods. After a last little moment of hesitation, you think you have no more to lose than your life as you feel that you begin to suffocate.  The cat makes a last pitiful meow of protestation when you put your hands on the opening. “Excuse me Lily if I went too far, but I’ve not the choice” you mutter to yourself, and you dive through to reach the final part of the reproductive system..</span></div></div>",
            "created":1379719560,
            "id":1666316,
            "title":"Trip toward the ovary"
        },
        "1442311122":{
            "author_id":"ben999999",
            "author_name":"benub",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>This time, the travel is faster and you quickly fall on the floor of the new area. The first thing you notice is the difference of atmosphere: though it remains a little damp, the air is fresher here, and you take long puff of breath with relief. After a little moment of recovering, you sit up straight and gaze once again at your last new surroundings. It is totally different from what you expected, compared to what you've seen before. Firstly, the place is absolutely not dark as the others, but illuminated by a kind of pink subdued light, coming apparently from the glowing walls. Besides, you're eased to be able to see distinctly again. You notice it has probably the size of an average bedroom, with walls looking like they are covered in fleshy drapery. On the whole, it gives you an impression of coziness and luxury. The texture of the ground is different too: it's not exactly fleshy, but feels more like velvet. It's really softer and more comfortable than what you experimented previously, and for an instant, you just enjoy to rub against the velvety floor. But, it is until you catch a strange new scent, suddenly: smelling around, you sweep the room until your eyes fell on a mysterious rise in the middle. Tantalized by the smell, you climb cautiously to the top and discover with surprise a strange fleshy bowl. You crouch down to take a better glimpse. Concretely, it looks like a toilet bowl, but since I think it doesn't sound really romantic, let rather call it a (strangely WC shaped) little well. The edge looks fatter than the inside (a bit like a seat), and there's even a kind of lump on top, at the opposite side from your point of view. You're really stunned to find something like that in a living being. You wonder if it may be the ovarian follicle, but the shape has nothing to do with the drawings in books of anatomy. Honestly, the whole place does absolutely not look like the regular ovary, as described in biology. You're beginning to wonder if all of that is not a dream: maybe you passed out during the trip inside the uterine horn, maybe you never woke up from the sleep in the uterus, maybe even this whole shrunken story is not real. Then you snap out of these  doldrums when you hear a kind of lapping in the bowl. You didn't notice, but there's a few water bathing the bottom of the hole. At this instant, you recall your state of dehydration,  and this confirms that you're still alive. It is the occasion to quench your so urging thirst, so you don't cogitate anymore, and just throw your hands and head in the hole. Maybe it is the thirst which deceive you, but this liquid tastes really wonderfully sweet. In contrary to the pussy juices, those aren't salty or repulsive, but perfectly thirst-slaking. It's like if this well had been placed here on purpose to water any guest in the ovary. <br>\r\n<br>\r\nWhile you are drinking abundantly, you brush the edge and the insides of the bowl inadvertently. It makes the bowl suddenly quiver violently, whereas you hear a strong growl reverberates along the place. You withdraw quickly, fearing that you did something wrong to Lily. In front of you, the edges of the bowl are frenetically twitching, while you hear a low rumble from the cat, above you. It seems that she didn't appreciate your touch on there, but you are too thirsty to abandon the only source of water in the area. You try to tame her, and near the spot again, but this time by crawling cautiously, attentive to her reaction. You raise your hand toward the edge, and begin to stroke it gently and carefully. Firstly, Lily growl at your touch, but as you're stroking the organ, the rumble decrease and soften, until it turns into a very deep purr. It seems that finally, she enjoys the fondle. You decide to settle down comfortably in a recess next to the bowl, in order to better explore it. In the same time, you feel that the body of the cat is swinging, what means that she's moving somewhere, probably to get comfy herself. You wait for her politely, and quickly, the swinging halt and you hear a rustling like if she was nestling. Then, everything goes quiet, except for the biological sounds like the heartbeat. Strangely, you think it is like the calm before a storm, or the silence before a concert, and you feel nervous, wondering if it is a good idea. Suddenly, you hear Lily pushing a soft meow, as if to cheer you on. Apparently, she wants you to do it, so you cross your fingers, and resume the fondle. At the instant your hand touch the edge, you hear again this deep purr, and it only increases when you stroke rhythmically the rim. You rub as well the edge than the inside, acting like if you were petting some strange animal. It's all the more convincing that you feel the flesh twitch and ripple under your fingers. Meanwhile, you can hear that Lily appreciates your work, since she interrupts her purr by some soft rumble from time to time. Oddly, these noises recall you her behavior at the age you tried to relieve her heat with the Q-tip. So, it would mean that this organ is not only really sensitive, but also erogenous. It has probably something to do with the estrus phenomenon, finally. Now that she's totally relaxed and trustful, you decide to take advantage of it to quench definitively your thirst. You lean on the edges that you continue to fondle, and gulp long flow of the delicious water. Despite the well doesn't contain lots of water, you feel a stream renewing the amount as you swallow. It seems there is a supply of liquid inexhaustible down there, and you are pleased to think that you don't risk to die of thirst. However, it doesn't resolve the problem of food, but you don't want to think to more than one problem at the same time. For now, you just enjoy the taste of water. Sometimes, you lick accidentally the flesh in the inside, and the whole bowl twitch in reaction. She seems really ticklish down here, so you tease her playfully with your tongue. She react by pushing little mews for each contact of the tongue with the flesh. You continue to drink and rub her alternately for half an hour, until your thirst is totally satisfied. Then, as you withdraw your head from the hole, you find yourself face to \"face\" with an enormous lump. It must be the bump you saw earlier, at the top of the edge, but is has incredibly swollen, reaching almost the size of an erected dick. It is probably your touch on the rest of the bowl which aroused it, and now it is aiming toward your face, as if begging for your attention. You remain discreet for a moment: if this thing has a shape of a dick, does it work in the same way? Finally, you dare to put your hand on it, just to watch. At the instant you touch it, you feel the whole chamber you're in shudder, and hear a gasp from Lily. You withdraw your hand, and everything goes back to normal. But Lily push plaintive demanding meow; it seems that she doesn't want you to stop. So you touch again, and begin to rub this particularly sensitive lump of flesh. Now, you hear the cat pushing a very long meow of delight, and then beginning to pant. She really likes it, and it's a pleasure for you to pleasure her. You wonder if there aren't any sexual aspect in all of that, but then you don't mind : after all, it's not like if you haven't already had a kind of sexual interaction before, so you just let you taken by the atmosphere. Suddenly, you notice there's some white liquid leaking from a hole at the top of the lump. No, couldn't it be sperm? Because you feel seriously hungry, you can't resist to the desire to take some on your hand and bring it to your mouth. However, it doesn't taste like sperm (you're not gay, but you know your own taste), but something very sweet, like a kind of condensed milk. You can't believe it, but it seems you have found the solution for the food. You hesitates for a while, wondering if it's safe, but since you are so hungry, the treat so tasty, and now that you've already gulped lots of liter from the liquid below, you suppose it is too late to concern about it. So, you decide to sate: you engulf the lump, and greedily suck at it.<br>\r\n</span></div></div>",
            "created":1380757080,
            "id":1673331,
            "title":"The chamber of secret... pleasure?"
        },
        "14423111221":{
            "author_id":"ben999999",
            "author_name":"benub",
            "choices":[
                "Happy end",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>From outside, Lily was having a great time. Firstly, when she had felt the bug enter the inner sanctuary, she had been terribly worry: she knew that she was now totally vulnerable against the tickle from the insect inside. As she felt it nearing the sensitive spot, she had feared that it could terribly hurt her from inside. She had tighten her muscles in a vain preparation against this inner threat, and growled the instant it touched her, but then, as it  gently rubbed the flesh, she had begun to feel really pleasant sensations. It's like if this bug fondled the right spot in all her body, the one which deserved attentions. For all these years, she had passed through many heat periods, suffering from the sexual hysteria and letting bunch of tomcats mount her in attempt to relieve her, without success, according her an only temporary release for the time it lasts. But this time, it seems that it is a single strange bug, small enough to travel inside her, which was relieving the need directly at the source. When the bug let her a moment to recover, she had quickly moved to find some burrow nearby and curled in a ball to get comfortable for enjoying the feelings. After that, it had resumed with greater intensity. The touch was more complete on the spot, and particularly arousing. It felt like if the bug was generating a bliss at the heart of her being, which radiated throughout each cells of her body, in successive wave. She panted and purred in satisfaction, closing her eyes, licking her chops and clawing softly at the ground. She even mewed because of some touch more tickling and arousing than the others. But it turned still better when she felt the bug touch a very sensitive part of the already sensitive spot. After she meowed to urge it to continue, she had begun to feel a very powerful  sensation building in her being as the bug resumed the stroking. Instinctively, she uncurls to assume a lordosis position. However, her vagina was perfectly dry: it was more like an inner orgasm. Then, the bug makes suddenly a strange touch, totally different from the other, and far better. And there, the orgasm erupts. She opens her eyes wide as the nervous signals run along her spine toward her brain. She couldn't believe such sensations could exist in her body. It feels like the instant a tomcat make her ovulate by scratching her vagina with the spines of his dick, except that this time, she doesn't feel the pain in her privates, only the inner pleasure down there. And it is particularly longer: it seems the orgasm is endless. As she cums and she cums, she feels that she's losing control of her body. She twists, roll around, beat on the walls of the burrow, while she hisses and yowls, drooling copiously, and her eyes rolling in their sockets. It last like that for about a quarter of time, the orgasm seemingly only growing in intensity, until, in a great mind explosion, she yowls lengthily and passes out.<br>\r\n<br>\r\nIn the chamber, things were going hot as hell during this time. At the instant you encompass the lump in your mouth, and begin to suckle; you feel that the flow of goo increases. You find its taste so delicious that you can't take off your mouth from it. It's probably the sweeter and savoury treat you ever ate, and it perfectly sates your hunger. It's not surprising that meanwhile; you don't pay attention to the ecstatic meow from outside, but you startle when the whole chamber around you begins to shake. For the first time, it seems that the whole place reacts to your fondle. Then you hear how loud she vocalizes her pleasure, and you wonder if she can keep it up still for long. You prepare to leave the lump reluctantly, for her good. But suddenly, you feel the edges of the bowl clench on you. You were laying in the hole of the bowl to better park for the suckling, and now, you were trapped, totally unable to move, your mouth stuck to the lump. The goo was still flowing abundantly, so you keep on drinking the tasty liquid, not so despite yourself. Besides, you were naked since you stripped off previously in the fornix, so the bowl is clamping on your dick, erected for long because of all of this arousing events, and all of that is not to displease you. However, the thing which concerns you is the chamber's behavior. The walls are now turning purple and glowing brighter, frenetically twitching more than ever, while the yowls sound louder and louder. The sensation must be very stronger than usual for her, probably not natural. After all, nothing is supposed to touch her body down there, so you think it would be safer to shorten this \"intercourse\". If this lump works effectively like a dick, as the shape suggests, you could hurry the orgasm by suckling on it. So you bob your head up and down along the flesh in preparation, and then, you hold your breath, and swallow it to the hilt. It's difficult to not gag and cough, but you force yourself to fight it. The flow of cream run directly in your throat, and it gives you some difficulty to breath. Meanwhile, your suckle must be having an effect, because the yowl grows even stronger, until it reaches an ecstatic level. The twitching of the chamber increases, until it sort of fibrillates, the light from the wall brighter than ever. The edges of the bowl grasp firmly on your dick, what makes you immediately cum.  It last a few seconds. You hope your strategy is the good one, because you're running out of air, and for the fourth time, you're beginning to suffocate. However, the lack of air combined with your own orgasm, makes you euphoric, so once again, you think this death could be very enjoyable. Finally, in a great jolt, everything abruptly ceases. The bowl releases you, and you withdraw quickly your head from the lump to catch your breath. The place get darker since the glow return to a normal luminosity, whereas Lily doesn't make any noise. The whole place is so peaceful in comparison with earlier that, for an instant, you fear that she was dead. But you can still hear the breath and heartbeat at a low rate, so you guess she just passed out. All these sensations must have roughly tested her, you think with a smile.<br>\r\n<br>\r\nThis whole event is probably the strangest experience you ever lived. But it's not so bad for a microscopic person. You sit and consider the situation : you are inside your cat's ovary, which reveals itself as an unnaturally cozy and welcoming organ. In this place, you're protected against any danger from outside, even the body itself (except for the previous little accident). No cat's dick will ever reach this place, as well as its sperm since you know it can't go beyond the oviduct, so you're sure to be totally safe. The only exception is the case your cat was spayed, but you're convinced your family will never do it, if only they respect your will. You're warm, and moreover, this strange bowl in the middle provide both water and food, whereas your touch gives her very pleasant sensation. In a way, it works like a symbiosis : she provides you food and shelter, and you pay it with these surreally great stimulations. But more than anything, you just feel perfectly well inside your cat, nestled in the soft curves of the fleshy walls. It seems that you share her sensations: you feel that the body is totally relaxed and satisfied, and it spreads to you, beyond your own afterglow or state of satiety. You're just happy to be here, to please and satisfy her. You're not sure that you want to return to the boredom of your life's routine. But for now, you've been a little tired by all these emotions, and your whole surrounding just invite you to share her state of relaxation. You lay next the bowl, and hug it as to say good night. She answers with a soft meow of delight in her slumber, and you drift yourself to sleep, </span></div></div>",
            "created":1381593420,
            "id":1677916,
            "title":"Continue"
        },
        "144231112211":{
            "author_id":"ben999999",
            "author_name":"benub",
            "content":"<div class=\"\"><div> <span>The following morning, when she wakes up, Lily is still a little dizzy from the previous night, but totally bucked up from the delicious sleep she had in the burrow. Now, she doesn't feel anything, and she wonders for a while if all of that wasn't just a dream. The sensations were so surreal that it was difficult to imagine she really felt it. So, she goes back to the house, in order to get the food she didn't hunt the previous night. But as she walks; she feels something stir inside her, deep down in a secret spot of her body, and then she recalls everything that happened: the mysterious bug and the whole endless pleasure it provoked by tickling her down there. She is so glad that it was real that she's overwhelmed with happiness at the moment. She purrs and wriggles her butt leisurely as she continues her little walk.<br>\r\nYou too had the feeling that this whole adventure may have been a dream when you awoke. Seriously, your shrunk situation, your trip inside your cat and this unnatural ovarian chamber; it only could have happened in your imagination. But the surroundings call you back to reality quickly. Despite the velvet of the walls could evoke a strange spherical and comfortable room, the sound of the heartbeat, the breath and the digestion does not let any doubt on your location. Next to you stands the mysterious bowl, still in the same shape that you remember. You rub the edge as to say \"good morning\" to Lily, and the bowl immediately twitches in reaction; while the cat meows softly as to answer you, and begins to make a big throbbing purr. This lone sound is enough to make you happy, especially as the acoustic of the chamber and the fact that you hear it from inside her body, right behind her diaphragm, makes the sound reverberate and vibrate all along your body. It's just so lovely. You have a coated tongue, so you take some drink from the water in the bowl (which has still the flavor of your sperm because of the night before, but you don't mind),  tickling the cat in the same time, and once again, your touch arouse the strange lump on the top. But after the experience of the previous night, you decide to be careful, and save it for later. So instead, you decide to play with the rest of the bowl, petting and rubbing the whole surface. You seem totally fascinated by this thing, and only wish to please it. You explore each centimeter of the edge, as well as the insides of the bowl. You stroke every inch of the twitching flesh, testing its reaction to spot every nerve ending. You even put your hand in the hole at the bottom of the bowl, and wiggle your finger in the fleshy pipe, what makes the whole organ jump. In the same time, Lily purrs, rumbles and meows at your touch. It feels like bliss was spreading from the special spot throughout her body. For a moment, she just sat there, closing her eyes, and meowing until a little orgasm erupts inside her, making her yowl briefly. Then, she resumes her walk, your touching easier to deal with her sexual needs filled. However, you understand she had enough, and let her in peace. You spend the rest of the time lazing around, and petting the walls. You don't need more than to stay here, and enjoy your role of sexual reliever inside your beloved pet. Quickly, you build up some habit: you drink an average of five time a day, and each time take the opportunity to pleasure her madly. Most of the time, you do it when she is sleeping, so the effects of the fondle are not so flagrant, but you guess from the snarling you hear that you must give her wet dreams. You even manage to synchronize with her feeding time, so that she has the double pleasure to fill her stomach and have her needs relieved in the same time. Sometimes, you are also in a playful mood: usually, you prefer to avoid fondling her when she's walking, probably hunting or watching her territory, but one day, you do it just to tease her. You feel that she struggles to fight the sensations, because the bowl doesn't twitch as usual, but you insist by stroking more firmly, like if it is a sexual contest, and sooner or later, she gives up and let her overwhelmed by the pleasure. But she growls after and poke at her middle, as if to reproach this discourteous distraction. You may also be evil some time, stopping the stroking in the middle of her orgasm, or teasing her by brushing the flesh with the tips of your fingers, but without touching. You laugh as you hear the furious meow from the cat, quickly replaced by pitiful demanding ones, whereas the bowl twitches helplessly below your hands. But you can't resist for long to the poor kitty mews, and you throw yourself on the bowl, so that she cums strongly at the instant. Besides, you manage to communicate: sometimes, when she's in need and you are asleep, Lily wakes you by meowing and pawing at her abdomen, and conversely, if you insist too long on a rubbing session, she mews roughly and poke to make you understand she had enough. Of, course, being inside her, you could ignore her warnings and fondle the bowl as long as you want, since she can't do anything against you; but you love this pet, and don't want to torment her.<br>\r\n<br>\r\nEverything could be perfect, but though you doesn't make lot of exercise, the hunger ends up to return. Apparently, the water is good but not enough to feed you: you need this famous nutritional white goo. So, one evening, as she's asleep, you decide to touch the lump again. Firstly, you fondle as usual the bowl, as if to prepare her, and then, after the lump erects, you put your hand on it. Lily immediately growls in her sleep, and doesn't need more than two or three rub to wake up. She mews inquisitively, and quickly find out that it is the bug which is touching the more sensitive spot of  her organ of pleasure. She paws at her abdomen to make the bug stop, undecided on the attitude to adopt when she considers her reserved memory of the event. But now, she is used to receive pleasure from this part of her body, and supposes it could be a really pleasant feeling this time. so she makes a caring mew as to cheer the bug, and huddle up in her basket, totally curled in a bowl, to assume an appropriate position in the expectation of the ride.<br>\r\nInside, you were worry when you felt the poking on her belly, because it means that she didn't want you to rub here, so you thought sadly that you would have to force her if you want to stay alive. But the joy returns when she meows her approval, so that you can resume the fondling with her consent. You rub, stroke and lick the lump, and it doesn't take long before the goo flows again; and you suckle it hungrily. For the cat, the sensations are really different when you touch there than the rest of the bowl. When the fondle is just pleasant in the bowl, it is literally orgasmic on the lump. It's like if, for each contact between you and the flesh, she cums lightly, and it only increases as you take the lump in your mouth. She's in bliss, she's in heaven, she can do nothing more than shudder as the pleasure spread in her body. She wished it never ended. And all of that thanks to this little bug. She leans on her abdomen, burrow her muzzle in her fur, and meow to the bug on a grateful tone. You're pleased by this sound, and thus, since she apparently likes it, you decide to turn the suckling in a more sexual way. So, you bob your head up and down on the lump, like if you were doing a blowjob, and begin to fuck with the bowl, while rubbing the flesh everywhere. At this touch, Lily opens her eyes wide: she thought it couldn't be better, and though, the sensations are now a thousand stronger. She growls frenetically, while her abdomen spasms, then hold her flanks with her front paws and bites her own flesh, as she's cumming, and cumming, and cumming. You're doing her so good : no other feeling of pleasure could stand the comparison. Finally, after a never-ending cycle of successive cum, she yowls powerfully while hit by the grand finale of her climax, and then gets totally relaxed, laying on her side half unconscious. In the same time, you give a last great thrust to cum inside the bowl, and then take a rest, nonchalantly leaning on it. But Lily is now too sensitive in there, so she mews to make you move out. You reluctantly agree, but know perfectly that, sooner or later, she would ask you to go back in this.<br>\r\nSo, once again, you take another habit : each night, or rather each end of the afternoon, when Lily settles for her nap in the basket, she mews on a seductive tone to you, and you know for sure what she wants. Each time, her orgasm remains spectacular, and it seems that she can't get used to this wonderful feeling. It is sometimes so strong that, at the peak of her climax, she experiments a kind of out-of-body experience, probably taking a quick trip to the seventh heaven. And from your point of view, these sessions are all the more pleasant that contrary to the bowl fondling, you can cum in the bowl, and so share her pleasure. And, thanks to the nutritional goo, you feel healthier and more energic, in contrary to the starving state in the previous days, so you are able to rub the bowl vigorouslier than ever.<br>\r\n<br>\r\nThe days pass in this routine, better the one than another. Sometimes, you can miss your old life, when you feel temporary bored to stay in the ovary. You sit in front of the opening at the back of the chamber, pondering the decision. Not only there are very few chances that you make it out safe til the vulva, but you think that you might crave this place any sooner. And conversely, now that Lily is used (almost addicted) to your touch, how will she do without you. You like this symbiotic life, safe from any danger in the sweet confines of your cat, and when you ponder the advantages and inconveniences, you think that you don't wish any other one. With a smile, you return to lay next the bowl and rub it, while Lily shudders and settles in the expectation of another pleasure session...</span></div></div>",
            "created":1382793300,
            "id":1684397,
            "title":"Happy end"
        }
    },
    "info":{
        "author_id":"segsy",
        "author_name":"Flakker",
        "brief_description":"An interactive about your life after being shrunk.",
        "created":1359934320,
        "description":"<td align=\"left\" class=\"norm\">Your name is Hank, you are 15 years old and live with your sister Jill (18) brother Justin (13) mom and dad (both 51) dog (Bloodhound) and cat. You have a two story suburban home, and lead an average life.<br>\r\n<br>\r\nAnything is allowed here, whatever you may like, just use good grammar when adding and try not to be too brief. Have fun and lets write a story.</td>",
        "id":1917179,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1382793300,
        "modified":1382793300,
        "pretty_title":"A Shorter Approach"
    }
}