{
    "chapters":{
        "1":{
            "author_id":"levidrago",
            "author_name":"leviathan dragonflyer",
            "choices":[
                "Chapter 1: The Proud Prince",
                "Chapter 2: Enter Dragon Here",
                "Chapter 3: Enter Dragon Here",
                "Chapter 4: Enter Dragon Here",
                "Chapter 5: Enter Dragon Here"
            ],
            "content":"<div class=\"\"><div> <span>Hello every mortal reading my guidebook into the insane world of dragons. I'm not going to lie and say this book is for you. You're most likely going to find some of, if not all our lives disturbing. But don't worry. As the new heir to the dragon throne, I promise I'll keep relations better between us. So, you've probably heard that we are all rich, cunning, devious giants who can and will devour you at any chance we get. And you'd be absolutely right, but that doesn't mean you should fear us. As you'll see, while a few of us may have, 'questionable' methods of eating you little cuties. Me and the rest prefer the willing.<br>\r\n<br>\r\nI can hear you now shouting. \"A willing prey? How is that possible.\" And I'll certainly show you how I get mine to change their minds without hurting them. And if I get just one of you to personally want to climb inside me just to try it out without even using one of these techniques. I'll consider this book a massive success, you know money doesn't affect me anyway. I own all the gold, diamonds and jewelry after all. Now, for those who want to skip to another dragon. I have their contributions here as well</span></div></div>",
            "created":1418501520,
            "id":1901963,
            "title":"Introductions"
        },
        "13":{
            "author_id":"lb20622",
            "author_name":"LorenzoTheGuy",
            "choices":[
                "Appendix I, Activities",
                "Appendix II, Diet",
                "Appendix III, Region",
                "Appendix IV, Variants",
                "Flip to a Different Section"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.8;\"><font class=\"size35\" style=\"\">We dragons use our mouths for many things, particularly devouring prey like yourself, but we also use it to speak in our native tongue. I won't go into it, simply because your puny brain wouldn't be able to understand any part of it. I only bring this up because this chapter focuses on what we other dragons call \"Massials.\" Massials are, quite frankly, enormous dragons. The smallest one found was as big as a hamlet, which it promptly ate. Typically, Massials are typically 5280 feet tall and weigh several hundred tons. The colors of the Massials vary from dragon to dragon. Apart from that, they have common characteristics with each other. You'll see appendixes about aspects of the Massial's life.</font></span></span></div></div>",
            "created":1576392720,
            "id":2759776,
            "title":"Chapter 3: \"Large and Still Large\""
        },
        "15":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Straight story.",
                "Not so straight.",
                "Chapter 6: Enter Dragon Here",
                "Chapter 7: Enter Dragon Here",
                "Chapter 8: Enter Dragon Here"
            ],
            "content":"<div class=\"\"><div> <span>Interesting idea... however no one added to it. What I can say is that to make it a bit better would be to have each dragon as a story... perhaps not as intended however one could say that the happenings between the dragon and... whoever is the prey possibly humans... are being recorded in another voice... while said stories are happening before the Prince. Or with the Prince. Just putting my two cents in... <br>\r\n<br>\r\nSo here is what I have this chapter/story based on. A dragon kind called a shield dragon more for its large head that is like a shield with scales as the emblem. Said dragon is interested in keeping one human safe. And said human can be a toy, lover, or the dragons rider. <br>\r\n<br>\r\nSo before things get started the question of straight or not. And last is additional chapter space</span></div></div>",
            "created":1556788440,
            "id":2653697,
            "title":"Chapter 5: Enter Dragon Here"
        },
        "151":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Male human, female dragon",
                "Female human, male dragon"
            ],
            "content":"<div class=\"\"><div> <span>Just so it isn't fudged up I will write this chapter, and the other one for clarification. <br>\r\n-Just be warned in either chapter the oddity of vore is in the chapters. one way or another. Or at least can be in the chapters. <br>\r\n<br>\r\nSo what this is, is the human prey and Dragon's sex. Next will be the names </span></div></div>",
            "created":1556788560,
            "id":2653698,
            "title":"Straight story."
        },
        "1511":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Jack and Matherra",
                "Hack and Sillia",
                "Eric and Tundara - more options"
            ],
            "content":"<div class=\"\"><div> <span>So now to let there be more room than for my fat mouth and typing skills I will have multiples to pick from<br>\r\n-Note the last one is for more names as well as a choice thus turning the first option into is this who you want to be. But that is saying more come around since more chapters have been added.</span></div></div>",
            "created":1556788740,
            "id":2653700,
            "title":"Male human, female dragon"
        },
        "15113":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Yes (Play as Eric, or as Tundara)",
                "Male rider and female dragon",
                "Male rider and Female dragon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this who you want to follow, or is it someone else? Sorry not much else to put but conformation and more options.  </span></div></span></div>",
            "created":1556788800,
            "id":2653701,
            "title":"Eric and Tundara - more options"
        },
        "151131":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "You are Eric",
                "You are Tundara",
                "Options are Options"
            ],
            "content":"<div class=\"\"><div> <span>So the last before getting started... Seeing events from the dragon's point of view?  Or the human's? This is more for the players to get into who they are playing. So playing as either or is an option just that the chapter would be written much differently than played. So lets us be off on the adventure?<br>\r\n<br>\r\nAnd yes Adventure as just capture and vore, is boring after a few repititions meaning that something more has to happen meaning that I do intend for The human in question and dragon in question to come together as Dragon and rider. <br>\r\n<br>\r\nIF not then pick the bottom option lets more happen.<br>\r\n</span></div></div>",
            "created":1556788980,
            "id":2653702,
            "title":"Yes (Play as Eric, or as Tundara)"
        },
        "1511311":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Go have some fun.",
                "Get to know one another more",
                "She wants to vore you first. "
            ],
            "content":"<div class=\"\"><div> <span>(So no more questions as I am going to just say that they are in the court of the Dragon Prince and all that is around. Saying that dragons and humans have similar standings... I am just going off that. Meaning that Tundara and Eric are a few of the summoned dragons and humans... Perhaps to get books and in this way they can write their experiences with one another. And the prince being systematic made sure to summon one of each breed of dragon along with one of each sex along with a crowd of humans.)<br>\r\n<br>\r\nSo from the crowd you got to see the dragons all around along with the large dragon Prince looking upon them all... And going on with what he wanted.... Which sounded big... Making dragons and humans work together... and get convinced about vore... and being willing about it... At least he gave everyone choices... So as things turned out you got to be the first to pick who he was fated with...<br>\r\n<br>\r\nLooking along the dragons, even the prince himself... You settled with with a lightening blue dragon... had a large shield like look on her head. And yes you could see the difference... the more menacing one was the female... not to mention bigger... AS odd as that was... It was probably the breed as other breeds had dantier females. <br>\r\n<br>\r\nYou would approach her and look up to her and she would look at you and cock her head. 'You with me?' Unfortunately not all dragons could talk aloud some of them had to be close range to mentally speak to someone... and with that came their thoughts not being so refined and their language really suffering more due to lack of being able to speak with someone... be that dragon or human... So after that question you nodded and smiled. \"Well I did come up to you and so... yes.\" You say as she would nod and the Prince would summon you over as he picked another to go select the dragon they would be stuck with for a time... wither they agreed to be... or not was up to them. Sort of like an open contract till they both signed on they could part at any time. <br>\r\n<br>\r\nYou recieved a leather bound diary and the Prince commanded you to write about what happened each day... from trust... to what activities you partook in... be it mudane, Need to survive, sex, or vore... Which the last two sort of mixed together.<br>\r\n<br>\r\nAfter leaving the hall you and your dragon looked at one another and would...</span></div></div>",
            "created":1556789520,
            "id":2653706,
            "title":"You are Eric"
        },
        "152":{
            "author_id":"mmpluc",
            "author_name":"MMPluc",
            "choices":[
                "Male human, Male dragon",
                "Female human, Female dragon"
            ],
            "content":"<div class=\"\"><div> <span>Just so it isn't fudged up I will write this chapter, and the other one for clarification.<br>\r\n-Just be warned in either chapter the oddity of vore is in the chapters. one way or another. Or at least can be in the chapters.<br>\r\n<br>\r\nSo what this is, is the human prey and Dragon's sex. Next will be the names </span></div></div>",
            "created":1556788560,
            "id":2653699,
            "title":"Not so straight."
        }
    },
    "info":{
        "author_id":"levidrago",
        "author_name":"leviathan dragonflyer",
        "brief_description":"This is a story about various dragons and their desire for food and fun. Warning, scat.",
        "created":1418499720,
        "description":"<td align=\"left\" class=\"norm\">Dragons are mysterious creatures. They live for hundreds of years. Are 10 times the size of the tallest of other creatures. And always seem to be guarding some mythical treasures. But why are these creatures so intriguing. Well, as Ha'L the prince of dragons I am very much willing to tell.<br>\r\n<br>\r\nNotes for those little squeamish morsels. The subjects we talk about here are, naughty. Very naughty. While I would love to say we're innocent I think both of you know we are far too guilty. Of the crimes we have committed are those of vore. The swallowing, digestion, and excretion of humans, smaller furs, and the occasional sheep. Another is our little marriage ceremonies those knights think will end just because they have pointy shiny sticks.<br>\r\n<br>\r\nRules for those mighty beasts who wish to add their input:<br>\r\nEpic Dragon Lingo -<br>\r\n1. Each dragon gets their own section within my book to add their stories and detail their favorite activities, so if you wanna add input make sure you start with new dragon. And each time add a reference to the page where your dragon ends<br>\r\n<br>\r\n2. Make sure you introduce yourself properly, I wouldn't want anyone to get the comfort in thinking we're unintelligent, slobbery, monsters just because Fred thinks saying two words is a joke. Don't be Fred. Speaking of which I ate Fred, you'll see what happens to him soon.<br>\r\n<br>\r\n3. Go into as much detail as you like, your days won't be always have the same cycle I'm sure. So additional information on your other choices are always fine. You can also show a few romances you had before they ended with you digesting your snack as I will show.<br>\r\n<br>\r\nLame ass mortal werds -<br>\r\n1. After you introduce your dragon make sure someone else can, don't edit mine or another dragon you didn't originally add.<br>\r\n<br>\r\n2. I want these to be like a story based encyclopedia with one branching story for each dragon. I'll also give a formula to follow from mine.<br>\r\n<br>\r\n3. For branching paths, think of the first few branches like activities and then go into the standard interactive formula of adding branches for different things you want to try. I'll also show an example for this as well.<br>\r\n<br>\r\n4. For your dragon it is YOUR dragon, this means you can add any fetishes you want and exclude any you don't. Regardless of me liking them or not. This is however why I want one writer per character as well.</td>",
        "id":2021927,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1576392720,
        "modified":1576392720,
        "pretty_title":"The Dragon Prince's Guide For Nondragons"
    }
}