{
    "chapters":{
        "1":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "Male",
                "Female",
                "more than one character"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>pick a gender</span></div></span></div>",
            "created":1377579600,
            "id":1652514,
            "title":"Lets get started."
        },
        "11":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "Mario",
                "Luigi",
                "Toad",
                "Bowser",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>pick a character</span></div></span></div>",
            "created":1377579600,
            "id":1652516,
            "title":"Male"
        },
        "111":{
            "author_id":"crowbar",
            "author_name":"Lomax",
            "choices":[
                "The plans! They were going to be late!",
                "She could hear a sound in the distance, it sounded like bowsers army!",
                "She was ready for round two!"
            ],
            "content":"<div class=\"\"><div> <span>The sun peaked over the window sill, illuminating Mario's quaint and cozy bedroom with early morning light. Outside was the sound of birds chirping and Yoshis playing. <br>\r\n<br>\r\nIn the small wooden hut nestled in the woods, with the large \"Mario\" sign hanging over the door, it's two occupants were slowly waking. Mario, the short Italian plumber with blue eyes and chocolate colored hair, and Peach, the lovely princess of the Mushroom Kingdom. They were sharing a bed, cuddled up to each other nice and close, dressed in only their underwear. Luigi had traveled to Sarasaland to visit Daisy, so they had the whole place to themselves.<br>\r\n<br>\r\n\"...heh - <b>hahahahah</b>, s-stop tickling me princess!\" Mario suddenly protested, the calm ambiance broken by a sudden giggle fit. Peach smiled mischievously, under the covers her delicate hands carefully played with and prodded Mario's most sensitive areas, namely his cute tum. With both hands she explored Mario's body, pinching at his small love handles and rubbing at his chest and soft belly with her palm. <br>\r\n<br>\r\n\"I see someone's woken up in a good mood today, eh?\" Mario pointed out, a slight smugness creeping into his voice. Mario was always happy to be the center of attention, especially if it was from beautiful ladies. \"Mmmm, Mario I'm in a great mood. Just you and me, no Toads, no Bowser, no responsibility... and after <i>last night</i>... how could anybody wake up in a bad mood.\" Peach responded, and Mario let out a chuckle, which turned into a gasp as the princess' fingers got a little more frisky and her pinky finger hooked into his red underwear, giving it a snap. <br>\r\n<br>\r\nPeach leaned in, giving Mario a tender kiss on the cheek, then collapsing on top of him and pushing Mario back into the mattress. \"A-ah, Princess? Didn't we have other plans this morning? Mama Mia!\" Mario hesitantly reminded his lover, though he made no move to escape her embrace. The lucky man was a good deal shorter than the Princess, so presently with her on top of him like this he had his large nose wedged betwixt her amble bosom. Peach paid no heed to Mario's words and went back to caressing his pudgy frame, tracing a finger up his treasure trail and into his belly button, giving it a curious poke to see how deep her finger would go. Her other hand grabbed a handful of Mario's soft little tush, afterwards giving it a satisfying slap. <br>\r\n<br>\r\nMario blushed, always slightly embarrassed about being teased over his weight. It didn't help that he was almost sure he was a bit more paunchy than usual, the lull in kidnapping activity meant he'd gotten less exercise lately. Plus, being around Peach so often was taking a toll on his figure, it seemed like she always had a fresh baked cake or pie ready for him to consume. She'd invite him over for massive dinners at the castle and make him take home far too much leftovers. She was practically always fostering food onto him, and Mario couldn't understand why she didn't realize it was making her squeeze... more squishy. <br>\r\n<br>\r\nIt didn't even stop in bed, lately Peach had developed a nasty habit of bringing food into their love making. It was rather awkward the first time she had him cuffed to the bed posts and suddenly produced a large cake from seemingly thin air. But there was no arguing with her in bed, she was incredibly dominant, so he ate every slice that the princess hand fed him. She said it was food-play, to spice up their love life, and granted it made for some of the most amazing sex the couple had ever had, but it was still weird to feel bloated after lovemaking.<br>\r\n<br>\r\nAt least whenever Mario worried to himself about his weight, he knew he could easily work off these excess pounds the next time he went on an adventure. And at least Peach still seemed attracted to his body, in fact it almost seemed like she was more amorous than usual, what a weird coincidence.  <br>\r\n<br>\r\nBy now Peach had discarded her frilly brassiere and was gently fondling herself, if Peach had gained any weight over the last few months it had gone straight to her breasts which were large and curvacious and bounced slightly anytime she did something active. <br>\r\n<br>\r\nMario groaned, feeling his member stir in his now too tight briefs. For a short guy Mario was packing, like <b>really</b> packing. His over-sized salami and meatballs looked practically out of place on his tubby body, not that Peach was complaining. <br>\r\n<br>\r\nWith a little difficulty he shimmied out of his underwear and grabbed a-hold of the princess' hips, his turgid member springing up skyward, the smell of arousal was in the air as the two drank each other in with their eyes. <br>\r\n<br>\r\nSuddenly, Peach reached over to the dresser-draws beside the bed. Mario was confused for a moment, until he saw what she was retrieving, a box of donuts. Had she hidden them there the entire time? Was this her plan all along?! Mario had no time to think it over because already Peach was pulling out a large pastry with pink frosting and sprinkles, waving it enticingly at the plumber. <br>\r\n<br>\r\nMario loved food, but sweet stuff wasn't exactly his favorite food group, he liked savory, meaty, salty and fatty things most. It looked like there was at least a dozen full sized donuts in the container, one of every flavor. The prospect of eating all that before breakfast wasn't very enticing, but from past experience he knew by the end of this he'd have finished the whole box. The princess would reward him for every bit he consumed, so without complaint he opened his mouth for her to put it in.<br>\r\n<br>\r\n\"Ahh, good boy, my little hero is learning.\" Peach complimented, and without hesitation shoved the sugar laden treat into Mario's maw, a bit too forceful for Mario's liking as he struggled to swallow it down, getting icing on his cheeks and a few sprinkles in his carefully maintained mustache. But before he could complain Peach was already reaching for another, chocolate this time, and Mario just had time to catch his breath. <br>\r\n<br>\r\nThis continued for a while, mixed in-between with heated moments of hip grinding, neck kissing, belly rubbing and lip licking. The room was hot and muggy by the time the ordeal was over, the two laying next to each other both thoroughly spent. They were both red faced and breathing heavily, though Mario was a bit worse for wear, having to also contend with his distended stuffed stomach, which rose like a small taut dome over his midsection. He had to have consumed enough calories in that session to add a few more pounds to his already overweight gut, but thoughts like that were the furthest thing from his mind as he just laid right there with his partner, fully contented. <br>\r\n<br>\r\nThey stayed there for about half an hour until Peach suddenly sat up in bed, something on her mind. <br>\r\n<br>\r\n</span></div></div>",
            "created":1405486800,
            "id":1828619,
            "title":"Good sleep"
        },
        "1111":{
            "author_id":"normanwhite",
            "author_name":"Norman",
            "choices":[
                "Sweets!",
                "More salad",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Sweetie,\" Peach's sugary voice pierced the silence.<br>\r\n\"Yes?\" Asked Mario as he struggled to sit up with the new pounds covering him.<br>\r\n\"I actually need to be somewhere soon, so I've got to go.\" Peach's voice sounded weird, almost as if a laugh was embedded deep within the words. Mario looked her directly in the face and noticed that her eyes seemed to reflect that laugh back at him. It hit Mario what it was about. She was going to bring back even more food. Mario did like the electric feeling that the food brought to their sex, but for him enough was enough. He just couldn't handle it anymore. <br>\r\n\"No.\" Mario said firmly, but almost regretted it afterwards when he saw the look of hurt on Peach's face. However, he was committed at this point and he couldn't stop now. \"Peach,\" Mario began somewhat timidly, voice wobbling sightly, but gaining strength as he began to speak more. \"It needs to stop. I know that you know what I'm talking about, and I'm just going to day that I'm tired of it. This is starting to get unhealthy and we need to stop.\" Mario finished speaking and saw the hurt in her eyes, but knew he had done the right thing. Little did Mario notice, was the burning fire of revenge behind Peach's eyes. She was going to get her tubby plumber one way or another. <br>\r\n\"I'm sorry Mario,\" her ice blue eyes softening \"I shouldn't of acted this way towards you. I think maybe it would be best if we took a short break from each other. Not breaking up, but a short time to ourselves.\" Peach then got out of the bed and started dressing again, her beautiful pink dress sparking in the early morning sun that shone brightly through a small chink in the window blinds. <br>\r\nMario salivated slightly at his girl friend's form, but he knew that the break was for the best. Mario got dressed too, his now even more round belly protruding far enough to where he couldn't button his overalls. Mario didn't care and gently showed Peach to the door and said a polite goodbye. As Peach left, she couldn't help but let out a small smirk at her plans for Mario. She was going to get her rotund boyfriend that she wanted.<br>\r\nXxX<br>\r\nAbout a half a month had passed since the start of the break and Mario wasted no time getting his body back to its previous state and replaced his boxers with elastic ones, so to measure his progress in a way. It wasn't long before he had achieved getting his body back and he rejoiced. Luigi was still gone with Daisy and the stay was prolonged due to a ghost incident that it only took one man to handle (but that's a story for another time).<br>\r\nMario woke up to the doorbell. Something told him it was Peach, and his suspicions were confirmed when he opened the front door to her standing there, holding what seemed like a small Tupperware container filled with a mysterious green substance. \"Hey, I'd like you to know again that I'm sorry, so here is some salad to help you with the weight loss. Peach almost shoved the container into Mario's hands and left hastily with a \"I need to take care of something!\" shouted over her shoulder. Mario stared at the container in his hands and opened it up and examined it. It was indeed salad without a trace of sweets in sight. Mario looked up, happy, and marched into the kitchen and brought out a fork and started to eat. It was delicious! Mario continued to eat the salad, not noticing Peach peering into the window undetected, excited to see the fruits of her labour.<br>\r\n<br>\r\nPeach had done it! She created the perfect trap for Mario by combing her cooking and science knowledge. Sure it took longer than she wanted to in order to create it, but she felt satisfied. She had created the perfect salad; her kind of salad! After fusing a p-balloon and super mushroom together, she created a salad that would cause massive weight gain in the person who eats it. Peach couldn't wait to see what happens when Mario eats it and couldn't restrain herself from peaking in on her boyfriend finishing the salad.<br>\r\n<br>\r\nMario finished what he had considered the best salad he had ever tasted. If this was Peach's new trend of bringing health food that tasted good into bed, he could get behind that. Mario looked down at his now flatter stomach, patting it and happy that Peach was respecting his wishes. Mario continued sitting on the stool in his kitchen, savoring the nice after taste of the salad, when Mario got a weird feeling in his gut. It felt as if he was slowly getting fuller, even though he had already finished the salad. Mario looked down at his gut, finding it looking normal to his relief, and he got up, just as a tingling sensation began in his stomach. Mario's hand was still on his belly when he felt the most curious sensation as if his gut was getting bigger. Mario shrugged this off and walked off to the TV to see what was on. The tingling sensation suddenly got stronger, making Mario stop in his tracks and looked down. To his horror he noticed his gut was in fact larger! Mario stared at this new growth and noticed it was still growing. Mario stared at his now swelling belly, at a loss of what to do, unsure of if it was even real. A sudden pop inside Mario's body shifted him back into reality. He had spaced long enough to give his gut time to grow even larger, to where it popped out a good one solid foot in front of him, setting off his balance somewhat, while his gut continued to grow larger. Mario gave his belly a tentative poke, finding the growth soft and squishy like fat. Mario had to do something fast and he started walking, his swelling belly making it hard to move as it got even bigger. Two loud pings interrupted Mario's walk as he found his belly had gotten so big that his overalls couldn't take the pressure. Mario slowly made his way to his room, his gut now drooping over his upper legs and hanging out of his red shirt. Mario quickly sat on his bed, not sure what good that would do, and looked at his ever expanding tummy. He was scared and unsure why this was happening to him. The tingling feeling got stronger once more and his belly growth got faster, Mario feeling fuller and fuller as his gut continued to bloat up like a balloon. A ripping noise rang out through the tiny house as Mario's shirt hit it's capacity limit and started to rip as his belly pushed it out further. His gut protruded a good 5 feet in front of him, touching the floor and hiding his legs effectively from view, when all of a sudden, the tingling stopped and his gut seemed to have stop swelling. Mario stared down at his mysterious massive belly in terror, unsure of what to do, when suddenly the tingling feeling began in his upper torso and arms. Mario watched on in horror as his chest started to puff up with fat to try and aspire to be like his ridiculously large belly. Mario tried to feel the chest area when he noticed that he could barely move his arms at all. Mario looked to his sides and saw his arms slowly inflating from the fat to where they were stuck sticking out to the sides. Upon closer inspection, Mario realized that his arms were being absorbed into his now bloated and almost spherical body. The tingling feeling then began on Mario's face and he saw his cheeks puff out and felt it harder to move his head. Then the tingling feeling began in Mario's legs as they started to slowly puff up. It wasn't long before a loud rip was heard and what remained of his overalls fell off. Mario tried to get up so he could find a mirror, but as he plopped down to the floor, his legs never touched the ground. His legs had been absorbed too! Mario's nether regions had inflated enough to where only they touched the floor, leaving Mario to awkwardly crotch waddle over to the nearby full body mirror to look at himself, fat jiggling profusely as he went. Mario was almost completely spherical and his elastic underwear and shoes and socks and gloves being all that covered him. Suddenly his entire body tingled more and underwent one final growth. Mario watched as his viewpoint got slightly higher due to his nether regions expanding more. Mario watched on in a strange fascination as his body first absorbed his feet, popping his shoes and socks off and tiny little stubs of toes sticking out of his spherical body, being the only thing that remained of his feet. Next went his hands, slipping off his gloves as his hands and palms were absorbed, leaving only nubs sticking out as fingers, much like his toes. Mario expanded slightly more, his fingers toes and head making indents in his body as they refused to be completely absorbed. All at once, the tingling stopped, leaving the now impossibly fat Mario, sitting there (as if that's the proper expression), unsure of what to do with all that just happened to him. All of a sudden, Peach came in, clearly impressed and happy with how Mario looked and she was carrying......</span></div></div>",
            "created":1490590800,
            "id":2295393,
            "title":"The plans! They were going to be late!"
        },
        "112":{
            "author_id":"averageguy85",
            "author_name":"Idontknowwhattoputhere",
            "choices":[
                "Weight Gain",
                "Inflation",
                "Muscle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Luigi gain?</span></div></span></div>",
            "created":1400994000,
            "id":1802138,
            "title":"Luigi"
        },
        "1121":{
            "author_id":"kuro.shiro",
            "author_name":"KuroShiro",
            "choices":[
                "Food",
                "Magic",
                "Pregnancy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Weight gain by what?</span></div></span></div>",
            "created":1428814800,
            "id":1962839,
            "title":"Weight Gain"
        },
        "11213":{
            "author_id":"kuro.shiro",
            "author_name":"KuroShiro",
            "choices":[
                "No, he's aware.",
                "Yes, he has no idea."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, I suppose that counts as weight gain if he was unaware...</span></div></span></div>",
            "created":1428814800,
            "id":1962841,
            "title":"Pregnancy"
        },
        "112131":{
            "author_id":"kuro.shiro",
            "author_name":"KuroShiro",
            "choices":[
                "Run!!!",
                "Cautiously see why the boo is crying."
            ],
            "content":"<div class=\"\"><div> <span>          Luigi shivered. The full moon cast long shadows across the hall, deepening the darkness around the next corner. Really, all he wanted to do was find a guest room and get some sleep. His brother had been making so much noise with the Princess in the next room, he was forced to find a quieter corner of the castle. What were they doing in there that was so loud? Mario had mentioned something about cake before blushing as brightly as the cap on his head. He decided he didn't really want to know anyway if Mario was so embarrassed about it.<br>\r\n<br>\r\n          A faint ethereal cry froze Luigi mid-step. Something was hiding around the corner. Or maybe it was nothing. He listened closely, steadying his quickening breaths. No, the sound seemed less like a cackle and more like a sob. Straining his neck, he tiptoed nearly to the corner and just barely caught sight of a small, trembling boo. He broke out in a cold sweat. Nope, he wash not dealing with any boos tonight! He turned to run, but another tearful whimper tugged at his heart.<br>\r\n<br>\r\n<b>Should he:</b></span></div></div>",
            "created":1428814800,
            "id":1962844,
            "title":"No, he's aware."
        },
        "1121312":{
            "author_id":"kuro.shiro",
            "author_name":"KuroShiro",
            "choices":[
                "Nope. Nope. So much nope.",
                "Try to help her."
            ],
            "content":"<div class=\"\"><div> <span>          Closing his eyes, he shoved the old fear to the back of his mind. He'd dealt with much scarier things than this before and maybe this boo really was in pain. Setting his face in what he hoped was a determined expression, the stepped around the corner.<br>\r\n<br>\r\n          It glowed gently blue, barely illuminating the corner it huddled in. Smokey tears trickled down its face, dissipating before they reached the ground, and its tiny arms covered its black eyes. A loud sob wracked it's small form, startling Luigi enough to yelp and stumble a few steps back. The boo noticed and looked up. Frozen in terror, unable to anything but to return its gaze.<br>\r\n<br>\r\n\"A-are you my mom?\" It asked in a girl's voice. Luigi slowly shook his head.<br>\r\n<br>\r\n\"Oh...\" She looked down, on the verge of tears. \" It's just... I've been searching for my mom for as long as I can remember.\" Ghostly tears began to leak out of her eyes once more.<br>\r\n<br>\r\n\"Uh, I-Its-a okay.\" He couldn't stand to see the poor thing cry. \"Maybe I can help?\"<br>\r\n<br>\r\n\"I don't know where I am! I was shopping with Mommy and then I was here!\" Covering her eyes she shook back and forth vigorously. \"I just wanna go home!\"<br>\r\n<br>\r\nLuigi was filled with a sinking realization. This wasn't just a boo - it was a dead child. Approaching her, he knelt as close as he dared without getting hurt.<br>\r\n<br>\r\nHe bit his lip, trying to think of the best way to tell her. \"Well, I t-think you might be-a looking in the wrong castle. If you keep-a floating up, maybe you will a-find her in heaven?\"<br>\r\n<br>\r\n\"Heaven?\" she stopped shaking and met Luigi's gaze with wide eyes. \"I'm dead?\"<br>\r\n<br>\r\n\"Yes.\"<br>\r\n<br>\r\nHere mouth twisted, looking conflicted before crying, \"No! I can't be dead! Please don't let me be dead!\" She rushed up and through him, knocking him onto the floor.<br>\r\n<br>\r\n\"Noooooooo!\" She wailed, flying in all directions. Luigi tried to catch his breath.<br>\r\n<br>\r\n\"P-please-\" he wheezed. She shot down, nearly touching face to face.<br>\r\n<br>\r\n\"I don't want to die,\" her hysteria had quickly condensed to angry resolve. \"You can't let me die!\" She settled on his belly, and he cringed at the jolt of pain.<br>\r\n<br>\r\n\"Please, I want to be reborn.\"<br>\r\n</span></div></div>",
            "created":1428814800,
            "id":1962861,
            "title":"Cautiously see why the boo is crying."
        },
        "114":{
            "choices":[
                "Weight gain",
                "Muscle gain",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In what way will the Koopa King expand his horizons?</span></div></span></div>",
            "created":1400821200,
            "id":1801229,
            "title":"Bowser"
        },
        "1141":{
            "choices":[
                "being lazy",
                "sumo",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Bowser pack on the pounds?</span></div></span></div>",
            "created":1403845200,
            "id":1818445,
            "title":"Weight gain"
        },
        "11411":{
            "choices":[
                "As time passes,he becomes even more lazyer.",
                "Bowser decides to use his lazynis to his advantige."
            ],
            "content":"<div class=\"\"><div> <span>It was around eleven o' clock in the morning when bowser awoke by the sound of his whaling alarm.Grabbing the machine,he gave it a maighty thrust,sending it flying trough the air and smashing into peaches.<br>\r\n<br>\r\nHe yawned and heaved his body out of his king sized bed.Streaching,he bended his spine forward,letting his more then prominent gut stick proudly in the air.<br>\r\n<br>\r\nHe scratched his belly a few times and yawning again.Walking to a red rope that hung from the sealing,he gave it a hard pull.The rope made a bell ring inside a large room where all the hot water was made.<br>\r\n<br>\r\nExiting his royal chamber,he was greeted by his servent koopas,who offerd him many treats.Gobbaling most of them up,he made his way to the bathing room.<br>\r\n<br>\r\nClimbing into the bath,that could be large enough to be considerd a swimming pool,bowser sank into the water with a pleasurable sigh.<br>\r\n<br>\r\nHis servents' went to work immediatly,scrabbing and washing thier king,all while he enjoyed being stuffed by large amount of food.<br>\r\n<br>\r\n\"This is the *urp* life\",he said.</span></div></div>",
            "created":1443243600,
            "id":2040075,
            "title":"Bowser,the king of glutony."
        },
        "11412":{
            "choices":[
                "Bowser signs up for sumo",
                "Bowser goes to bed."
            ],
            "content":"<div class=\"\"><div> <span>It was another day at Bowser's castle. Once again he was defeated by the Mario Bros. To make matters worse Peach nearly destroyed half of his castle thanks to her expertise in sabotage. This fact infuriated the Koopa King. It's bad enough to be beaten by the Mario Bros. but to get sabotaged by your kidnapee is far more humiliating. Now Bowser was trying to think of a way to get revenge on Mario and his friends but how would he do so.<br>\r\n<br>\r\n\"Curse that Princess Peach! That's the 300th time this month that she sabotaged me!\" roared the koopa king.<br>\r\n<br>\r\n\"It could of been a lot worse. Remember the time she beat you up to rescue Mario or the time she and the Mario Bros. ruined your theme park in the Sprixie Kingdom?\" said one of Bowser's guards.<br>\r\n<br>\r\n\"Don't remind me. My ex-wife laughed at the thought saying I am pathetic villain. Just because she wins villain of the year doesn't mean I'm not just as evil as she is.\" said Bowser.<br>\r\n<br>\r\n\"At this rate you'll practically be begging her for mercy. Hasn't she married you eight times already? She isn't the nicest Koopa I know. She's real scary and gorgeous too. I hate to be on her bad side.\" said a Boo.<br>\r\n<br>\r\n\"Just leave me alone! If you make one more mention of her you'll be seeing my wrath!\" roared Bowser.<br>\r\n<br>\r\nBowser's minions run away. Bowser uses this new found quite time to watch some TV. The channel that Bowser turned to was the sumo wrestling channel. Little did his minions know is that he secretly liked the sport despite insisting that he wants to lose weight. Yet most of Bowser's minions knew when it came to weight loss that Bowser was a complete hypocrite. Bowser liked the fact that People larger than himself get paid for eating all they want and that they were strong too. Then an idea formed in Bowser's head. Why not become a sumo wrestler.<br>\r\n<br>\r\nBowser pondered the idea and thought it was good. It also made sense since he needed to pay for repairs and pay his overdue child support that he owes his ex. Yet shouldn't she be paying him for Jr. It didn't matter for Bowser was determined to defeat the Mario Bros. and friends and sue his ex-wife for his children back, except Jr. Unbeknownst to Bowser his ex was making plans to force him into another marriage. But to do that she needed the right bait and what better bait than the Mario Bros. The Koopa Queen then smirks evilly as she watches Bowser through her crystal ball. Later...</span></div></div>",
            "created":1403845200,
            "id":1818456,
            "title":"sumo"
        },
        "114121":{
            "choices":[
                "When Bowser arrives the founder of the school rejects him at first",
                "Bowser us given a  tour of the academy "
            ],
            "content":"<div class=\"\"><div> <span>The next day Bowser decided to search for the best sumo training academy in the world. After doing some research online Bowser finally found the perfect sumo training academy. It was called Dragomire's Elite Sumo Academy. Students who train there often gain a thousand or so pounds and reach the rank of Yokozuna relatively fast if they are one of the top graduating rikishi. However, little did Bowser know was that his ex wife was pulling the strings.<br>\r\n<br>\r\n\"So he's going to that to pay me off. When will he learn that for most of the loans he uses to pay for new merchandise that I get paid either way. When your a gorgeous evil genius like me you tend to invest in both your friends and enemies assets in order to usurp them.\"<br>\r\n<br>\r\n\"You are most clever mistress.  I  have to go. I am expecting a new student at my training academy.\" A large red dragon said as he bowed before the Koopa Queen.<br>\r\n<br>\r\n\"Go Dragomire and make sure to show Bowser a tough time.\"</span></div></div>",
            "created":1443243600,
            "id":2040124,
            "title":"Bowser's Thousand Pound Journey"
        },
        "11413":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about being forcefed?</span></div></span></div>",
            "created":1443243600,
            "id":2040108,
            "title":"Force Feeding?"
        },
        "114131":{
            "choices":[
                "The Boos suddenly attack Bowser.",
                "Something else happens."
            ],
            "content":"<div class=\"\"><div> <span>As the king, Bowser would have never thought of the day when his own subjects would betray him in the most peculiar way ever imagined.<br>\r\n<br>\r\nIt all happened on a normal day. Bowser was taking a shower after a long day of working out. He was, on this very specific day, very happy, for he finally had worked off his fat gut and replaced it with a developing sixpack.<br>\r\n<br>\r\nBut little did he know that this happiness was only short lived. His mischievous ghosts were plotting to fatten up there leader, just for the sake of fun.<br>\r\n<br>\r\nWhen Bowser left the bathroom he walked down the hallway to his throne-room. But ones he entered, he was greeted by a table filled with foods of all sorts. Ghosts were hovering in the air, waiting patiently for their leader.<br>\r\n<br>\r\n\"What the hell is this?\" he exclaimed.<br>\r\n<br>\r\n\"A feast in your honor, my king,\" one of the ghosts said.<br>\r\n<br>\r\n\"I didn't order for this,\" Bowser said. Normally he would have been delighted because of this, but that was back in the days when he was a koopa with big gut and chubby body.<br>\r\n<br>\r\nNow he was well-built and cared, surprisingly, about healthy eating. All of the food that were stacked on the table were all calorie-inducing meals. It disgusted him.<br>\r\n<br>\r\n\"Take it away!\" he demanded.<br>\r\n<br>\r\nBut he was in for a surprise</span></div></div>",
            "created":1476766800,
            "id":2224980,
            "title":"Yes"
        },
        "114132":{
            "choices":[
                "Hypnotized gorging Bowser works",
                "No, different method to fatten the Koopa King"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why not add a hypnotic twist? Wouldn't that be neat?</span></div></span></div>",
            "created":1448427600,
            "id":2066667,
            "title":"Hypnotism?"
        },
        "1141321":{
            "choices":[
                "Bowser goes on a hypnotic rampage as he tries to eat any food he sees",
                "Bowser snaps out of the trance when the bell rings a second time "
            ],
            "content":"<div class=\"\"><div> <span>It was supposed to be a night where the King of the Koopas was to telax, instead he's knocked out by some toxin and strapped to a table. Before him stands a looming figured wearing a black cloak. He was in a lab of some kind.<br>\r\n<br>\r\n\"Let me go! I'll burn you to smithereens if you keep me here any longer!\" Bowser roared.<br>\r\n<br>\r\nThe figure laughs evilly at Bowser.<br>\r\n<br>\r\n\"That won't be necessary Bowser. I have BIG plans for you. Once this is over you won't remember a thing.\"<br>\r\n<br>\r\nBowser  tries to fire a fireball by the figure raises a gloved hand and forces his mouth shut with magic.<br>\r\n<br>\r\n\"I don't think so . Look at the screen above you.\"<br>\r\n<br>\r\nA monitor with a hypnotic pattern emerges from the ceiling. Bowser tries to close his eyes, but the figure forces them open.<br>\r\n<br>\r\n\"Bowser, every time you hear the ringing of a bell you will gorge yourself with food. Upon hearing the second ring you will lose all memory of gorging. Remember to  gorge on the first bell and to stop on the second. Now Begone!\"<br>\r\n<br>\r\nThe figure waves their hand and Bowser is teleported back to his castle with no memory of the brainwashing. The next morning Bowser wakes up finding himself laying on his stomach.<br>\r\n<br>\r\n\"That was a weird dream. Guess I might get...\"<br>\r\n<br>\r\nBowser is cut off as he hears the ringing of a bell. Bowser's reddish-brown eyes dilate as the hypnotism takes hold.</span></div></div>",
            "created":1448686800,
            "id":2067744,
            "title":"Hypnotized gorging Bowser works"
        },
        "1142":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "he wish for it",
                "he use a spell",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How did he gain some muscle?</span></div></span></div>",
            "created":1497502800,
            "id":2336737,
            "title":"Muscle gain"
        },
        "1143":{
            "author_id":"omaly",
            "author_name":"Omaly",
            "choices":[
                "Bowser gets pregnant",
                "Bowser gets inflated",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Bowser going to increase the size of his army, or maybe Peach sets a sets a trap to inflate him?</span></div></span></div>",
            "created":1400994000,
            "id":1802044,
            "title":"What about these?"
        },
        "11431":{
            "author_id":"dorn-rune",
            "author_name":"Rune",
            "choices":[
                "Bowser should go see what's wrong with himself",
                "Bowser should rest for a bit"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bowser went to Peaches castle to do the same thing like everyday, but Peach had Mario and Luigi set up at trap. When Bowser set the trap off. Not only the trap teleported him home, but he felt bloated.</span></div></span></div>",
            "created":1603457040,
            "id":2927421,
            "title":"Bowser gets pregnant"
        },
        "11432":{
            "author_id":"touhouforevah",
            "author_name":"NPKMNN",
            "choices":[
                "His butt was inflated!!!",
                "His Backside was inflated!!!"
            ],
            "content":"<div class=\"\"><div> <span>During a peaceful day in the Mushroom Kingdom, Peach, in her castle, was making a special cake for a certain someone, which she had been working on for years and months, as the note said, faded away...;<br>\r\n<br>\r\n_ea_ B_w__r, <br>\r\nTh_s c__e i_ fo_ __u, pl__se en__y i_!<br>\r\n                         Y___'s tr__y, Pri___ss To__sto_l,<br>\r\n                        Pe_ch.<br>\r\n<br>\r\n\"Are you sure this will-a work???\" Said Luigi, in a panicky tone of voice.<br>\r\n<br>\r\n\"Of course!!! It's so Bowser never annoys us!!! And so that he will never kidnap me again!!!\" Peach said in a defiant tone.<br>\r\n<br>\r\nA couple seconds later, Peach, Mario, Luigi, and a Toad all head down to Bowser's castle.<br>\r\n<br>\r\n\"Oh Bowser!!! I've got cake for you!!! Bet you don't want it to go rotten!!!\" Peach said in a lovely, soothing voice.<br>\r\n<br>\r\n\"Cake??? Please gimme it!!!\" Bowser said bursting through the door.<br>\r\n<br>\r\nBowser immediately ate the whole cake, while Peach was waiting for the effect to kick in.<br>\r\n<br>\r\n\"See you later Bowser!!!\" Peach said to Bowser as she was leaving.<br>\r\n<br>\r\n\"Same to you, princess!\" Bowser said to Peach.<br>\r\n<br>\r\nSometime later, Bowser felt, weird, his butt felt like it was floating, and when he turned around, he found out...</span></div></div>",
            "created":1436158800,
            "id":2004097,
            "title":"Bowser gets it, bad-time..."
        },
        "11433":{
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps some penis enlargment potion.</span></div></span></div>",
            "created":1443589200,
            "id":2041685,
            "title":"Bowser gets a huge dick."
        },
        "114332":{
            "author_id":"mjnfm",
            "author_name":"mjnfm",
            "choices":[
                "Giant Bowser, yes!!",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Bowser growing to unimaginable heights?</span></div></span></div>",
            "created":1493010000,
            "id":2310127,
            "title":"no"
        },
        "1143321":{
            "author_id":"mjnfm",
            "author_name":"mjnfm",
            "choices":[
                "Bowser eats a mushroom.",
                "Bowser quietly leaves 2 mushrooms in front of them"
            ],
            "content":"<div class=\"\"><div> <span>It was a slow day in the Mushroom Kingdom and Bowser was frustrated with how frequently he was defeated by the pesky brothers Mario and Luigi. Bowser decided to call in Kamek to help him.<br>\r\n<br>\r\n\"I'm sick of Mario and Luigi beating me at everything I do!\" Bowser yelled.<br>\r\n<br>\r\n\"Well there is this one thing I've been working on that...\" Kamek started, holding a bag of black mushrooms.<br>\r\n<br>\r\n\"GIVE THEM TO ME!!\" Bowser roared, as he snatched the bag from Kamek and darted out of his castle.<br>\r\n<br>\r\n\"WAIT!! THOSE ARE UNTESTED PROTOTYPES!!!\" Kamek tried to chase after Bowser, but his attempts were in vain.<br>\r\n<br>\r\n<br>\r\nBowser finds Mario and Luigi sleeping outside of Peach's castle, against the front wall. What does he do?</span></div></div>",
            "created":1493010000,
            "id":2310142,
            "title":"Bowser's Biggest Plan"
        },
        "115":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "Bowser Jr",
                "Ludwig Von Koopa",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about...</span></div></span></div>",
            "created":1377579600,
            "id":1652519,
            "title":"other"
        },
        "1151":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "weight gain",
                "inflation",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so how will he grow?</span></div></span></div>",
            "created":1400994000,
            "id":1802101,
            "title":"Bowser Jr"
        },
        "11511":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "Jr stuffs himself silly",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So what happens?</span></div></span></div>",
            "created":1448427600,
            "id":2066675,
            "title":"weight gain"
        },
        "115111":{
            "author_id":"sorab4p",
            "author_name":"SoraB4P",
            "choices":[
                "Of COURSE it was! Jr kept on eating.",
                "Jr was starting to have second thoughts about this..."
            ],
            "content":"<div class=\"\"><div> <span><i>Hiccup! Burp! Slosh!</i><br>\r\n<br>\r\nIf you entered the Koopa Cake restaurant on that faithful day, you would definitely hear those sounds. There he was, the young reptilian, eating his cares away. Cakes, burgers, fries, he ate it all. He ate it all on a dare. He dared Pom-Pom that he could eat everything on the menu at the Koopa Cake, and there Pom-Pom was, counting each food item her friend consumed on a silver score counter, each press of the button added one more item to the count.<br>\r\n<br>\r\n\"36!\" Pom-Pom exclaimed.<br>\r\n<br>\r\nJr ate calmly and collectively, he got a bit of mess on him, but he was still pretty carefree. In between meals, he burped, but that was all he was allowed to do during the contest. Jr smashed in the last burger, chewing it slowly as Pom-Pom counted 39.<br>\r\n<br>\r\n\"Hah! You owe me that-\" Jr was about to gloat, however, he was interrupted when a cake, bigger than him, was placed on the table, \"...water...bed...uh...what is this?\"<br>\r\n<br>\r\n\"Take a look!\" Pom-Pom giggled, sitting back as Jr glared at the plate.<br>\r\n<br>\r\nInscribed on the plate was the following: <span class=\"cred\">T</span><span class=\"cmaroon\">H</span><span class=\"clred\">E</span> <span class=\"cppink\">A</span><span class=\"chotpink\">M</span><span class=\"cpink\">A</span><span class=\"cpred\">Z</span><span class=\"cborange\">I</span>{c:orang e}N</span><span class=\"cdorange\">G</span> <span class=\"cbrown\">B</span><span class=\"ctan\">E</span><span class=\"cbyellow\">L</span><span class=\"cyellow\">L</span><span class=\"clkhaki\">Y</span> <span class=\"ckhaki\">B</span><span class=\"cpgreen\">U</span><span class=\"cbgreen\">S</span><span class=\"clgreen\">T</span><span class=\"cgreen\">E</span>{c:hunt er}R <span class=\"cpteal\">C</span><span class=\"clteal\">A</span><span class=\"cteal\">K</span><span class=\"cpblue\">E</span> <span class=\"clblue\">S</span><span class=\"cblue\">U</span><span class=\"cnavy\">R</span><span class=\"cindigo\">P</span><span class=\"clilac\">I</span><span class=\"cviolet\">S </span><span class=\"cgrape\">E</span><span class=\"cplum\">!</span><span class=\"cmagenta\">!</span><span class=\"crose\">!</span><br>\r\n<br>\r\nJr gulped, looking at the monster, there was no way he could eat this! Jr looked over to the waitress, a plump koopa girl.<br>\r\n<br>\r\n\"If you want to win the challenge, it starts whenever you eat. You have to eat the cake in 40 minutes.\" She states, gleeful of Jr's presence.<br>\r\n<br>\r\nThe cake, larger than Jr, was oozing with ice cream, fudge, and candy. Jr panted a bit, grabbing his fork and looking at this monster. Was all of this really worth a water bed?</div></div>",
            "created":1448514000,
            "id":2066884,
            "title":"The Blubbery King-to-Be"
        },
        "115112":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>maybe someone force feeds Jr.</span></div></span></div>",
            "created":1448427600,
            "id":2066676,
            "title":"something else"
        },
        "1151121":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Peach",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who did that?</span></div></span></div>",
            "created":1515992400,
            "id":2441175,
            "title":"yes"
        },
        "1151122":{
            "author_id":"liamthemystic",
            "author_name":"Phoenix",
            "choices":[
                "Yeah",
                "or Neigh"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He's already spoiled rotten, let's just let live out a life of Gluttony, and Sloth. Were he gets everything he wants without moving a muscle.</span></div></span></div>",
            "created":1542171600,
            "id":2577943,
            "title":"no"
        },
        "11511221":{
            "author_id":"liamthemystic",
            "author_name":"Phoenix",
            "choices":[
                "The Former",
                "The Latter"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, but how do we start this, does Bowser just allow it to take place, or does Jr. does something to his father, to make him listen.</span></div></span></div>",
            "created":1542171600,
            "id":2577949,
            "title":"Yeah"
        },
        "115112212":{
            "author_id":"liamthemystic",
            "author_name":"Phoenix",
            "choices":[
                "Not eating my vegetables.",
                "Stealing food from the kitchen."
            ],
            "content":"<div class=\"\"><div> <span>Jr. has always been a spoiled child, he was always the king's favorite, but that didn't mean they always see eye to eye. This particular story starts in Jr.'s room, as customary with most young children he was not the neatest person, shown by the toys, and trash lying on the floor, and the graffiti on the walls. Jr. as just grounded, <br>\r\n the reason to be explained soon. What I can tell you now, is that he is forbidden to leave his room. Now let us see how this story plays out. \"I can't believe this, how dare father ground me!\" Jr. said obviously aggravated. \"W-well sir, I'm sure your father d-didn't mean to yell at you, h-he was just frustrated,\" Liam said, trying to calm him down. Liam here is a goomba who is Jr.'s personal servant and as such takes orders only from the prince, such as having to live in the Prince's room to always have him there, being forbidden from cleaning the room by Jr. who likes it to be messy, and forced to endure Jr.'s more gross tendencies. \"Well, that may be true, but to get angry over something as simple as...</span></div></div>",
            "created":1548133200,
            "id":2605864,
            "title":"The Latter"
        },
        "1151122121":{
            "author_id":"liamthemystic",
            "author_name":"Phoenix",
            "choices":[
                "Skip to when he comes back",
                "Show him retrieving the ball."
            ],
            "content":"<div class=\"\"><div> <span>\"So what, I shouldn't have to eat them if I had my way I would only eat delicious desserts and fatty meats. Oh, if only I could make him listen to me\" he said. \"W-well sire, there is a way to do that, b-but it requires stealing something, from K-Kamek,\" Liam said. \"Oh, really what exactly is this item?\" Jr. asked. \"W-well Kamek has recently made a crystal ball, that can take over the mind of someone bound to it, i-it only w-works on one person, a-and only the person who uses it can control the person bound to it,\" Liam explained. \"So what you're saying is that if I get this crystal father will have to listen to me, and me alone!\" Jr. said excitedly. \"Y-yes, it disappears after use so nothing can break the s-spell,\" Liam explained. \"Okay then, go fetch it for me, since I can't leave but you can,\" Jr. ordered. \"Y-yes, sir,\" Liam said as he ran out fearfully.</span></div></div>",
            "created":1548133200,
            "id":2606140,
            "title":"Not eating my vegetables."
        },
        "11513":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "he becomes taller",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will he grow?</span></div></span></div>",
            "created":1496638800,
            "id":2331778,
            "title":"other"
        },
        "115131":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "9 feet",
                "taller"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How tall did he get?</span></div></span></div>",
            "created":1496811600,
            "id":2332368,
            "title":"he becomes taller"
        },
        "115132":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did browser jr's penis and balls grow big?</span></div></span></div>",
            "created":1496725200,
            "id":2332337,
            "title":"something else"
        },
        "1151322":{
            "author_id":"cakelord",
            "author_name":"Cakelord ",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do his muscles grow?</span></div></span></div>",
            "created":1517720400,
            "id":2449147,
            "title":"no"
        },
        "1153":{
            "author_id":"debea",
            "author_name":"debra",
            "choices":[
                "Yoshi",
                "Donkey Kong",
                "More Free Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about...</span></div></span></div>",
            "created":1443416400,
            "id":2040873,
            "title":"more choices"
        },
        "11531":{
            "author_id":"debea",
            "author_name":"debra",
            "choices":[
                "Weight Gain",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How shall our small green dinosaur grow?</span></div></span></div>",
            "created":1444971600,
            "id":2047981,
            "title":"Yoshi"
        },
        "115311":{
            "author_id":"debea",
            "author_name":"debra",
            "choices":[
                "Being lazy",
                "Other (Free Choice)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Yoshi pack on the pounds?</span></div></span></div>",
            "created":1445230800,
            "id":2049293,
            "title":"Weight Gain"
        },
        "1153111":{
            "author_id":"choas33",
            "author_name":"Chaos",
            "choices":[
                "He was eating out ",
                "Was lazing at his house playing video games and eating junk food "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It been six months since Bowser last kidnapping of Peach he was obese and was doing </span></div></span></div>",
            "created":1592024400,
            "id":2850937,
            "title":"Being lazy"
        },
        "1153112":{
            "author_id":"debea",
            "author_name":"debra",
            "choices":[
                "Sumo",
                "Other (Free Choice)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How else, then?</span></div></span></div>",
            "created":1445230800,
            "id":2049294,
            "title":"Other (Free Choice)"
        },
        "11531122":{
            "author_id":"debea",
            "author_name":"debra",
            "choices":[
                "He gets forcefed by someone.",
                "Other (Free Choice)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How else, then?</span></div></span></div>",
            "created":1448254800,
            "id":2065766,
            "title":"Other (Free Choice)"
        },
        "115311222":{
            "author_id":"choas33",
            "author_name":"Chaos",
            "choices":[
                "Yoshi is overweight and trying to lose weight contain paw growth and clothes rip",
                "He finds a mushroom that make him (huge contain paw growth and clothes ripping)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok here two more choices </span></div></span></div>",
            "created":1604131380,
            "id":2932072,
            "title":"Other (Free Choice)"
        },
        "115312":{
            "author_id":"debea",
            "author_name":"debra",
            "choices":[
                "Inflation",
                "More free ideas, please"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How else, then?</span></div></span></div>",
            "created":1444971600,
            "id":2047983,
            "title":"More Choices"
        },
        "1153122":{
            "author_id":"debea",
            "author_name":"debra",
            "choices":[
                "Yoshi Gets Pregnant",
                "More free ideas, please"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Yoshi going to have his Yoshi babies?</span></div></span></div>",
            "created":1448254800,
            "id":2065764,
            "title":"More free ideas, please"
        },
        "11531222":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "Yes , good or evil?",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about yoshi wants to use the power up mushrooms and grow bigger to become a new hero or a better villain than bowser?</span></div></span></div>",
            "created":1568178000,
            "id":2716583,
            "title":"More free ideas, please"
        },
        "115312221":{
            "author_id":"tyfb",
            "author_name":"GiantYoshiFan",
            "choices":[
                "Super Mushrooms/Mega Mushrooms",
                "Stronger versions of the Super Mushrooms/Mega Mushrooms"
            ],
            "content":"<div class=\"\"><div> <span>It was a sunny, peaceful  day in the Mushroom Kingdom and Yoshi was just minding his own business walking though the forest area of the Mushroom Kingdom, just looking for some fruit for storage for the next few days, placing them inside a sack he has with him. Yoshi’s main plan was to get mainly apples or berries he found in the forest, he had a knack for telling how fresh or ripe any fruit he came across, like most Yoshis do. Yoshi made his way through his forest while humming a Happy Yoshi tune to himself. <br>\r\n<br>\r\nThough unknown to him, in another part of the forest, Kamek was there with some Mushrooms, though not to use them, but to put a curse on them, as he became aware of Yoshi coming through the forest on occasion to get some more fruit to eat, both he and Bowser had hatched a plan together. <br>\r\n<br>\r\nAs whenever they attacked the Mushroom Kingdom, Yoshi was the thorn in their side, as he’s the one who helps Mario or Luigi the most to fight off any of Bowers Minions or help them get to Bowser, as well as the one who give the Bros any Power-ups they would require with some assistance with some toads as well for watching his back/keeping the power-ups safe.<br>\r\n<br>\r\nAfter their recent defeat, in which they nearly won but lost due to Yoshis quick thinking and getting the Life-up Mushroom to the bros when they were down and with help of a toad, giving them both the Invincibility star and super leaf while Yoshi dealt with the ground enemies then Kamek. After the battle was won, Mario and Luigi were both thanking Yoshi for giving it all and being of great help for them during the battle against Bowser, as Bowser, Kamek and any others retreated away back to Bowser’s Castle, Kamek happened to hear that Yoshi would have considered using a Super Mushroom or even a Mega Mushroom to send them packing if he was too late to give them the items needed to restore their health and needed to retreat to the castle temperamentally, with both bros saying that maybe the next time or another time Bowser attempts to attack the kingdom or steal peach, he can use one if he desires, with Yoshi saying he would love to do anytime personally but rather do it if is a last resort but acknowledged the offer as hes been helpful a lot for the Mushroom Kingdom and how he is given a choice to have one when they got extras anytime or whenever he feels like it due to his extreme helpfulness in being there when Bowser attacks the kingdom.<br>\r\n<br>\r\nLater on that day, Kamek told Bowser about How Yoshi seems to have an interest in using the Power-up mushrooms the Mario Bros are known to use from time to time, Bowser responded questioning what that even means to them, with Kamek replying how he could put a curse on the mushrooms that could potentially make him evil and work for them instead of helping the Mario Bros. In which Bowser considered it to be a great idea.<br>\r\n<br>\r\nKamek as well as some of Bowser’s minions spent the next few days looking for some Power-up Mushrooms around the Mushroom Kingdom without being caught to lower any suspicions on their plan or even cause any at all. Once they had a good amount of the mushrooms they picked for Yoshi to go for, they planned at night to plant them hidden in the forest in an area where Yoshi would travel during his walk for his fruit, with Kamek returning early in the morning to place the curse onto them once they have been placed ready for their plan. Once the Mushrooms were ready, Kamek then placed the curse onto the Mushrooms one at a time, eventually getting to the last one done. <br>\r\n<br>\r\nAs soon as he finished the last one, Kamek snickered to himself, thinking their plan would be full proof and also put an end to the Mushroom Kingdom and have Bowser take over the Kingdom and eventually the world. It wasn’t long until Kamek heard in the distance what sounded like Yoshi humming to himself, in which Kamek knew he had to get out of there before he showed up. Kamek jumped onto his broomstick and flew away back to Bowser’s castle before Yoshi could reach the area he was in.<br>\r\n<br>\r\nYoshi continued on his way until he reached the area where Kamek was with the mushrooms, as Yoshi was looking around the area ready to take a short break from all the walking he has been doing, something caught his attention behind a bush. “Hmm..What that over there?”, said Yoshi as he made his way to what he saw, when he got close enough he gasped at what he saw with his own eyes left in a big pile together a load off…<br>\r\n</span></div></div>",
            "created":1569992400,
            "id":2727100,
            "title":"Yes , good or evil?"
        },
        "1153122211":{
            "author_id":"tyfb",
            "author_name":"GiantYoshiFan",
            "choices":[
                "Super Mushrooms",
                "Mega Mushrooms"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So did he find a pile of Super Mushrooms or Mega Mushrooms behind the bush?</span></div></span></div>",
            "created":1569992400,
            "id":2727103,
            "title":"Super Mushrooms/Mega Mushrooms"
        },
        "11531222111":{
            "author_id":"tyfb",
            "author_name":"GiantYoshiFan",
            "choices":[
                "The Curse had no effect on Yoshi (Hero)",
                "The Curse had an effect on Yoshi (Evil)"
            ],
            "content":"<div class=\"\"><div> <span>What Yoshi saw in front of him were Super Mushrooms, which surprised him since he never sees any at all whenever he goes through the forest. There were quite a lot of them in a pile, in which it took Yoshi by surprise, he was taken aback by the fact he found some just lying there in a forest, waiting for someone to get. All Yoshi knew was that the Power-up Mushrooms they have for whenever Bowser attacks the Kingdom are found outside the forest around the Mushroom kingdom or kept in a garden around the castle grounds. However despite this, Yoshi felt suspicious about this, something felt fishy about him finding Super Mushrooms in the forest, especially the area where he goes by for his fruit picking.<br>\r\n<br>\r\n“Something doesn’t quite add up here” Yoshi said, scratching the back of his head, “How come I never see these in the area at all despite all the time I come here for fruit collecting. This doesn’t make any sense at all”. Yoshi spent some time looking at the pile of the Mushrooms still pondering how he never saw them or even anyone else who would go for a walk in the forest from time to time. Yoshi grabbed one and looked at it thoroughly, Yoshi then sniffed the mushroom to see if there’s anything off about them, in which there wasn’t, afterwards he squeezed it to see if he could see if sense what kind of energy it gave off.<br>\r\n<br>\r\nUpon giving it a squeeze, he felt the exact kind of energy coming from the mushroom that would of a normal super mushroom. He knew this as there were a few times he needed to carry two of them to the Mario Bros he gripped them tight and felt the power of them on him, however they didn’t affect him in anyway but the feeling from it did make him like it, in which has made him willing to want to have one.<br>\r\n<br>\r\n“Seems these are the real deal” Yoshi said as he placed the Super Mushroom down, “But there’s still something that doesn’t seem right about these being here” Yoshi said, still pondering on whether he should eat one still. He had to think it over if he should risk it and eat one to see if they were Super Mushrooms or not. He Looked at the pile again and saw that there a lot, he considered if he should take them all so in the event Bowser found them he would take them or even use them, which he or even his friends didn’t even want to happen at all. <br>\r\n<br>\r\nYoshi decided to take them all, though it would take more than one trip as his sack wouldn’t be able to carry them all, he did have some extra ones back at his home. He grabbed a few, doing his checks like he did for the first one and stuffed them in his sack; he made a mental note on how many were left. Afterwards he clutched the end of the sack tight as he could and bolted back home with them, despite his physique, Yoshi was one fast runner so he could get home &amp; back quickly. As Yoshi returned back to his home, he opened up his storage and placed the Mushrooms inside there, as well as the fruits he had collected before hand, thankfully he had enough fruit for a few days, in which he assumes Bowser won’t attack for a while after his last attack. Yoshi grabbed another sack with him and made his way back to where they were. He hurried back to where they were to see if they were still there, in which to his luck, they were there still, all intact and didn’t look any different when he looked at them. He once again checked them again one by one and placed them into the sacks. He continued with this until he had collected them all, it took him a little over three hours to do this, even with any short breaks to catch his breath.<br>\r\n<br>\r\nWhen Yoshi returned home, he placed the last set of mushrooms into storage with some of them outside, in the event he decides to eat one or a few. Yoshi sat down on the ground looking at the mushrooms that he left out, pondering if he should eat them or not, on one hand, if they were super mushrooms, that would be good and he had an easy supply of them for whenever he wants, but on the other hand if they were tainted or anything bad, it would be horrible for him, even if he did quickly regurgitate it out of his body. If it did end up being that, he knew that if it did end up being something Bowser or even Kamek did, they would pay hard, he would make them wish they never considered doing it, even he did have his limits for when Bowser and co attacked them or even harmed any fellow Yoshi for no reason.<br>\r\n<br>\r\nAfter much thinking, Yoshi decided to risk it and eat one, he noticed there were super mushrooms nearby his house so if it did end up being a poison mushroom, he could spit it out instantly and eat the super mushroom to counteract it. Yoshi walked towards one of the mushrooms, he picked one up and looked at it. <br>\r\n<br>\r\nYoshi took a deep breath and kept reinsuring himself that nothing bad would happen, he moved it towards his mouth and had his tongue go around the mushroom and pull it into his mouth. The first test went well, it didn’t make him sick, all he knew about poison mushrooms from what he has been told is that they tasted disgusting and were pretty bad for a Yoshi especially. “Everything go alright so far” Yoshi thought to himself as he swallowed the mushroom whole. Yoshi didn’t feel anything happen to him, but did make his way towards the super mushroom that was located near his house, but then it happened…<br>\r\n<br>\r\nYoshi started growing in size.<br>\r\n<br>\r\nYoshi was stunned at what is happening to him as he felt his whole body start to slowly increase in size slowly feeling such thrill as he grew bigger. In a short time he grew by 3ft in size, with more in size to grow from it. As Yoshi continued to grow in size he looked at the other mushrooms he left out and was thinking what would happen if he had another one right now or soon. Yoshi’s growth continued at a slow pace as it slowly came to a stop at a size of around 20ft tall. He felt that the Mushroom must have a stronger effect on him or even other Yoshi’s as opposed to the Mario Bros., but it didn’t matter, Yoshi found a stash of Mushrooms and has them for himself. Yoshi sat down and looked around the area of his house, admiring his new size, he believes he could get use to this; he actually liked the idea of being large, only downside being he would need to eat more. Yoshi pondered to himself if he should eat another mushroom, would it stack on top of his size as of now, or nothing at all, given that the later happens with the Mario Bros, he wondered this since the mushroom seemed to have a stronger effect on him, if it did stack, his main priority would be make sure he gets somewhere safe and doesn’t destroy anything during his growth.<br>\r\n<br>\r\nYoshi got up and grabbed another mushroom from the pile and then crammed it into his mouth. After swallowing it, he waited for a bit, only for the growth to happen again, in which Yoshi became ecstatic with it. Yoshis height expanded and got bigger, which lead to Yoshi just loving the sense of him growing even bigger. Yoshi’s body was expanding faster than it was last time, which lead to Yoshi just anticipating on how much more hes going to grow in size. Yoshi was starting to get taller than some of the trees around his house which made Yoshi wonder how much more hes going to grow by. He considered if he isn’t going to return to normal size, he would probably will eat another one or two and leave the rest for whenever and become a new hero of the Mushroom kingdom or even the world or maybe beyond, so Mario and co. can rest easy and he can put an end to Bowsers constant attacks. Even if this was the case, he would still be who he is known for, a friendly, happy dino rather than be a egotistical showoff hero thinking hes better than everyone. Eventually Yoshi stopped growing and reached the size of 50ft tall, Yoshi would easily tower over Bowser at this size now, not only that, if he did a sneak attack and kidnapped peach, he could take the Mario Bros. to Bowsers castle quickly. <br>\r\n<br>\r\nYoshi didn’t hesitate on eating another Mushroom, he didn’t know why he ever had some before, all those wasted years of never having one or any at all. Yoshi grabbed another Mushroom and chucked it into his mouth ready for another growth session; he sat back down upon swallowing it and got ready to feel his whole body expand once again. He tilted his head back and felt the power of the mushroom going though his body as he started to grow once again, all Yoshi did during this was just make a joyful Yoshi noise to himself, which sounded much deeper due to his size. His height edged towards 65ft tall without any signs of it stopping anytime soon. Yoshi’s size continued to increase as he looked around the area, he could see quite a fair bit into the distance. Yoshi’s size was still expanding as he started to daydream about him being a beloved hero who still had time for his own activities. Yoshi slowly reached the size of 90ft tall, as the effect was starting to slow down, he felt contempt with how big he is for now, with his height ending up just going over 100ft tall.<br>\r\n<br>\r\nYoshi decided to leave the other Mushrooms later in the event he decides to get bigger, or they wear off eventually for him. Yoshi got up and proceeded to stretch his body feeling how big he has became now. Afterwards he decided to take a small walk around the area in the forest, as he made his way back to the forest, he stopped for a moment, as he started to feel something going on inside him, which started to worry him. Unknown to him, the curse started to take an effect on him. The curse that Kamek put on the mushrooms…<br>\r\n</span></div></div>",
            "created":1569992400,
            "id":2727108,
            "title":"Super Mushrooms"
        },
        "115312221112":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "Capture the princess and to bowser castle",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does yoshi do first as the new evil is taking effect?</span></div></span></div>",
            "created":1590728400,
            "id":2842695,
            "title":"The Curse had an effect on Yoshi (Evil)"
        },
        "11532":{
            "author_id":"angara-turian",
            "author_name":"Angara-Turian",
            "choices":[
                "Expand Dong",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's start with the easy one.</span></div></span></div>",
            "created":1542258000,
            "id":2578166,
            "title":"Donkey Kong"
        },
        "12":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "Princess Peach",
                "Princess Daisy",
                "Princess Rosalina",
                "Wendy O. Koopa",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>pick a character</span></div></span></div>",
            "created":1377579600,
            "id":1652526,
            "title":"Female"
        },
        "121":{
            "author_id":"mr-lac",
            "author_name":"Mr Lac",
            "choices":[
                "Weight Gain",
                "Breast Expansion",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So how will the fair princess of the mushroom kingdom expand?</span></div></span></div>",
            "created":1399438800,
            "id":1792988,
            "title":"Princess Peach"
        },
        "1211":{
            "author_id":"mr-lac",
            "author_name":"Mr Lac",
            "choices":[
                "Food Addiction",
                "Force-Feeding",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What causes the Princess to suddenly bulk up?</span></div></span></div>",
            "created":1399438800,
            "id":1792991,
            "title":"Weight Gain"
        },
        "12112":{
            "author_id":"razershark",
            "author_name":"Black",
            "choices":[
                "One of the villains",
                "One of the good guys"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She's force fed by...</span></div></span></div>",
            "created":1423803600,
            "id":1933416,
            "title":"Force-Feeding"
        },
        "121121":{
            "author_id":"johnman",
            "author_name":"Writerstrike",
            "choices":[
                "The Boos lay down a carb-filled second course",
                "The kitchen door closes by itself..."
            ],
            "content":"<div class=\"\"><div> <span>The shadows of the castle corridor sunk behind the objects that casted them. A guided source of light traveled down the dark hallway. Tired footsteps followed suit of the light. Repeating one after another until the turn at the end of the corridor to repeat the process anew. A quick yawn floated from Princess Peach's mouth as she continued down the hallway. <br>\r\n<br>\r\nPaintings of Peach, Toadsworth, Mario, and Luigi all illuminated and darkened when she walked through. Dressed in her rarely seen peachy pink nightgown, Peach’s pursuit for a late night snack was an uncommon event for the royalty, yet tonight was an exception. Before she had a chance to enjoy a slice of cake right after dinner, Toadsworth interrupted with an impromptu need for her to complete a few royal duties. That Toadsworth. Always such a worry. <br>\r\n<br>\r\nPrincess Peach rounding the corner and stopped in the kitchen door frame. <br>\r\n<br>\r\nBathed in the moonlight, Peach witness a cilantro herb levitating in the air and landing on a warm, well done steak. She slowly set down the lantern to see two Boos become visible from the surrounding darkness. One gasped and the other stopped in its non-existent tracks. Peach too stood motionless. Quite possibly bewildered by the sight of two ghosts prepared a dinner. <br>\r\n<br>\r\n\"Don't bring the lantern any closer! Please! We're peaceful!\", Peach stopped her advance and looked closer at the spiritual pair. From the looks of it, they didn’t seem to mean any harm.  \"Just who are you anyways? And why are you in my castle?\" Peach asked. The Boos exchanged panicked looks as to indicate which one should start speaking. The one holding the herb cleared his throat. \"We enjoy cooking plenty. Day in and Day out its all we really do. Also, it helps set us apart from the other Boos. We don’t like scaring people.\"<br>\r\n<br>\r\nPrincess Peach rubbed her smooth chin, “Why the kitchen here? I’m sure there are plenty of kitchens in town.” One Boo shook its head, “We would go elsewhere, but none of the kitchens in the kingdom are as good as this one. This kitchen comes really close to the old one.”<br>\r\n<br>\r\n“What happened to the old one?”<br>\r\n<br>\r\n“It got destroyed along with Bowser’s castle in his last attempt to capture you.”<br>\r\n<br>\r\nPeach folded her arms and tapped her foot, “Are you trying to say Bowser had a better kitchen than mine? Do you really expect me to believe you? I’ve seen it before and wasn’t impressed.” Peach began to raise the lantern again until one of the Boos threw their arms up. <br>\r\n<br>\r\n\"Please. If you’d have a seat! We'll prove to you that we can cook well.\"<br>\r\n<br>\r\nDespite the cautionary part of her knocking on her common sense, the aroma of whatever delicious morsels they cooked has been tickling her nose for the past few minutes. Peach set the lantern down, took a seat, and grabbed the fork. In front of her presented beautifully on a plate is a 36oz, a line of three bread rolls covered in butter, a large mound of mash potatoes, and a side plate of seven eclairs. <br>\r\n<br>\r\nA few moments passed by with Peach doing nothing, but looking at the meal before her, she turned to the Boos who urged her to chow down. “This sure is a lot of food. It would be rude to not finish it all.” She stabbed into the steak and cut herself a sizable piece and popped it into her mouth. Her taste buds picked up the marinated, smoky flavor of the meat. It was chewy, but not too far as to not be savory as well. As soon as she swallowed she went for another cut.<br>\r\n<br>\r\nThe 36oz steak diminished slowly, but surely with sensible slices taken from it every few seconds. Periodically, she left the steak alone to eat a roll and take apart the mound of mashed potatoes. All of which complimented each other in taste and texture. Only a short amount of time passed before the only thing left on the plate were the juices from the steak. Peach reclined while she lazily bit on the last eclair. The filling drooped onto her lip which she lethargically licked off. <br>\r\n<br>\r\nPeach patted her stomach in satisfaction. The meal was as delicious as it was filling, \"Simply impressive! You may stay here as long as you like!\" The Boos smiled, delighted, flashing their big white fangs, “Thank you so much, Princess! We love that you liked our meal so much.”<br>\r\n<br>\r\nWith a satisfying meal in her stomach, Princess Peach prepared to get herself to bed as soon as possible. Before she could leave the table…<br>\r\n</span></div></div>",
            "created":1493787600,
            "id":2314482,
            "title":"Late Night Snack"
        },
        "12113":{
            "author_id":"mr-lac",
            "author_name":"Mr Lac",
            "choices":[
                "Magic",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could cause it?</span></div></span></div>",
            "created":1399438800,
            "id":1792992,
            "title":"Other"
        },
        "121132":{
            "author_id":"mr-lac",
            "author_name":"Mr Lac",
            "choices":[
                "Transformation",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Seriously, what else could happen?</span></div></span></div>",
            "created":1399438800,
            "id":1792993,
            "title":"Other M? *Shot*"
        },
        "1211322":{
            "author_id":"mr-lac",
            "author_name":"Mr Lac",
            "choices":[
                "Yes.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps it's Bowser's doing?</span></div></span></div>",
            "created":1520139600,
            "id":2460415,
            "title":"Other other other"
        },
        "12113221":{
            "author_id":"mr-lac",
            "author_name":"Mr Lac",
            "choices":[
                "\"Whip up some kind of spell!\"",
                "\"Send her a 'delicious' gift...\"",
                "Restart this storyline"
            ],
            "content":"<div class=\"\"><div> <span><i>Originally written by guydehade<br>\r\nEdited by Mr-Lac</i><br>\r\n<br>\r\n<div align=\"justify\">Bowser laid back with a groan on his throne, scheming away at another greater plan to win over the Mushroom Kingdom and its lovely ruler. Head resting in his clawed hand, he grumbled as he remembered the two reasons his plans always seem to fail, the red annoying plumber fouling up his works and his green stache brother.<br>\r\n<br>\r\nMario and Luigi.<br>\r\n<br>\r\n\"Those pesky plumbers!\", he snarled. \"They make me... AARRRGGHHH!\" Fire escaping out from his mouth, causing some of his underlings to get nervous and frightened while standing nearby from with great frustration.<br>\r\n<br>\r\n\"Every time I try to grab Peach, they get in my way! What do they even get for it? Cake? Pecks on the cheek? She's got that sort of refined charm going on, but... Argh! If only there was some way to get them to stop being so... Persistent...\"<br>\r\n<br>\r\nWhile the Koopa King continued to mull thoughts over in his head, Kammy, his high-ranking member of the Koopa Troop and right-hand woman, entered the throne room while floating in with her broomstick; crackling away at something...<br>\r\n<br>\r\n\"What's got you into a laughing fit?\" Bowser asked, his thoughts interrupted by Kammy's sudden laughing appearance.<br>\r\n<br>\r\n\"I think I have the perfect solution!\" Kammy replied back slyly.<br>\r\n<br>\r\n\"Perfect solution to what?\"<br>\r\n<br>\r\n\"To what you've been blabbering about for the last hour, honestly, the entire castle could hear your groans of despair!\" She snapped. \"I'll make the princess so grotesque to those plumbers, they'll be RELIEVED when you show up to take her away!\"<br>\r\n<br>\r\n\"Really? You think that would work?\" Bowser said, intrigued by this crazy idea. \"I've always thought she'd be cuter if she was a bit heavier anyway, and loosened up some... But... \"<br>\r\n<br>\r\nScratching his chin with her clawed fingers, \"How do you suppose we do that...?\"<br>\r\n<br>\r\n\"Nyeah heh heh heh! We have to be sneaky about it. Can't have them figuring we're behind it, or they'll try fixing her first... How should I go about this...?\"</div></span></div></div>",
            "created":1520139600,
            "id":2460416,
            "title":"Bowser's Scheming Story"
        },
        "12113222":{
            "author_id":"tarponpet",
            "author_name":"Tarp",
            "choices":[
                "Yeah!",
                "Nah!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pregnancy cravings?</span></div></span></div>",
            "created":1601188260,
            "id":2910819,
            "title":"Something else."
        },
        "1212":{
            "author_id":"deepspaghetti",
            "author_name":"deep spaghetti",
            "choices":[
                "Food that all goes straight to her bust.",
                "A magic spell to grow her breasts. (potentially in specific circumstances)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do Peach’s breasts grow?</span></div></span></div>",
            "created":1569992400,
            "id":2727065,
            "title":"Breast Expansion, But Through What Means?"
        },
        "12121":{
            "author_id":"deepspaghetti",
            "author_name":"deep spaghetti",
            "choices":[
                "Royal Banquets",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she acquire the food?</span></div></span></div>",
            "created":1569992400,
            "id":2727066,
            "title":"Food that all goes straight to her bust."
        },
        "121211":{
            "author_id":"bellylover895",
            "author_name":"Bellylover895",
            "choices":[
                "Peach goes to a private area to eat and see why her bra is so tight ",
                "Stay there and keep eating "
            ],
            "content":"<div class=\"\"><div> <span>Peach was going to go to a royal banquet she was invited to by Daisy peach was happy to come so as Peach got ready for the banquet she was trying to find the right clothes for the occasion. She finds her pink dress and puts it on. Peach then got in her car and drove to Daisy’s castle. Upon Peach’s arrival the royal banquet Peach was starved she hadn't had anything to eat so she was hungry, and when Peach saw the banquet her belly growled Peach grabbed a plate of Chicken and Mashed potatoes and two more plates of ham and mushrooms and 7 kebabs as Peach ate the food her boobs began to grow from her usual C cup to a E cup after eating half of the food she grabbed her belly also starting to show some bulge Daisy was all ready on her 3rd helping it was really just Daisy and Peach. Rosalina couldn’t make it due to being on the outher side of the galaxy. Peach finished her whole meal and went back for seconds her boobs now to a FF cup. What happens next</span></div></div>",
            "created":1591333200,
            "id":2846543,
            "title":"Royal Banquets"
        },
        "121212":{
            "author_id":"deepspaghetti",
            "author_name":"deep spaghetti",
            "choices":[
                "Yeah.",
                "Nah."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Force Feeding?</span></div></span></div>",
            "created":1569992400,
            "id":2727072,
            "title":"Something Else"
        },
        "1212121":{
            "author_id":"deepspaghetti",
            "author_name":"deep spaghetti",
            "choices":[
                "Mischievous Boo chefs, Bowser’s inside story style.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One last question, who force feeds her?</span></div></span></div>",
            "created":1569992400,
            "id":2727074,
            "title":"Yeah!"
        },
        "12121211":{
            "author_id":"deepspaghetti",
            "author_name":"deep spaghetti",
            "choices":[
                "The food continues to go directly to her breasts.",
                "The food begins to go to her backside as well."
            ],
            "content":"<div class=\"\"><div> <span>      Princess Toadstool had always been revered by her people, not only for her expertise in running the Mushroom Kingdom, but also her very princess-like figure. Nobody, not even the princess herself, knew how she maintained such a svelte hourglass shape, with an almost miniature waist, large yet perky DD cup breasts and a proportionate rear end to accompany them. Although, again, nobody had the foggiest clue of how she kept such a perfect body, Peach figured that whatever she was doing was working, and right now the objective was a midnight snack.<br>\r\n<br>\r\n     As the princess made her way through her castle’s halls, the high ceilings of which causing each step of her pink slippers to reverberate distantly yet quietly down the dark walkway, illuminated only by a faint full moon shrouded by storm clouds and the candlelight surrounding the pajama-clad princess. The quiet pitter patter of the rain on the grand windows nearly lulled the princess back to sleep as she made her way to her royal kitchen.<br>\r\n<br>\r\n      The princess was well acquainted with this kitchen, not due to any sort of cooking experience, no that’s what servants are for, but more specifically she was well acquainted with the gargantuan walk-in freezer that may as well have been called a sub-zero warehouse. Her midnight snacking was practically a nightly tradition at this point and this massive repository of almost cryogenically preserved food was the perfect place to grab a bite of virtually anything her royal heart desires, that is so long as she was willing to wait for it to thaw.<br>\r\n<br>\r\n     Peach selected a quaint vine of grapes from the fruit section of the well organized food library, running on some kind of culinary equivalent of the Dewey Decimal System. This selection however was not a carefully calculated one, rather a somewhat hasty decision. There was a certain chill in the air of the kitchen, and not just that of the absurdly low temperatures emanating from the still open freezer door, no this was an almost ghastly chill. The kitchen was further inward than the hall she traveled through to get to it, and as such the sprawling tiled floor covered in cooking station after cooking station, designed for maximum efficiency to get out as much food as needed for large-scale banquets, may as well have not been there at all, as the whole room was consumed by darkness, save for the pale moonlit doorway Peach entered through and the dim orange light of her candle.<br>\r\n<br>\r\n     As the sleepy Princess watched and waited for the candle-warmed bundle of ice cubes she hoped would be grapes after some thorough melting, she heard what sounded like the clanging of metal across the absurdly long room, coming from the dark abyss barely staved off by her candle. Too frightened to even turn and look, she focused on the almost unchanged over-frozen grapes.<br>\r\n<br>\r\n     A few moments passed in shocked silence as Peach braced for assassination, or something equally terrible. Before long she heard more clattering, and movement in the freezer. The princess could only imagine what horrific creature was making so many sounds. Regaining the ability to move out of sheerly fight or flight responses, Peach made a break for the exit to the kitchen, candle in hand. Just as she reached the square of light casted through the doorway by the moon, the door slammed itself shut. Peach was stuck, stuck with whatever horrible being wanted to keep her there. With nothing left to lose, the princess opened her eyes and turned around, only to find her suspicions had been incorrect. The kitchen was not occupied by an eldritch horror, rather it was buzzing with at least 200 Boos, having a joyous romp with the pots and pans.<br>\r\n<br>\r\n     A relieved yet still slightly traumatized Peach managed to stop quivering in the corner and watched the Boos toss various meats and spices to one another, boil water using nothing but ectoplasmic energy, and generally make a chaotic mess of things, while still somehow looking organized in the chaos. In truth, the Boos’ choice to make themselves visible filled the room with a pleasant blue glow, illuminating almost every square inch, albeit a bit dimly.<br>\r\n<br>\r\n     After about a minute of watching the parade of specters, things seemed to turn south. First one Boo spotted the princess, and of course they told their friend, and so on until at least 50 of them all came together into a much more threatening and much larger version of themselves, cornering the princess while the rest continued cooking. The Big Boo spoke in a surprisingly smooth accent, “Ahh, mistress Toadstool! How pleasant that you’re already here! We were worried we may have had to awaken you ourselves, and at such a late hour.” The large spirit knew that it meant no harm... at least not yet, but as if by nature, it’s voice had a hint of an ominous tone. The princess was at a loss for words, however the Boo carried on as if she had responded with the exact words it had expected. “Well, it’s not proper for the receiver of such a glorious feast as the one we are preparing to have to sit and watch the cooks! Please, let my companion escort you to the dining hall. Entertainment awaits!” Peach’s brief confusion was immediately answered by the hypothetical “companion” creating itself simply by splitting from the larger ghost.<br>\r\n<br>\r\n     The Boo was only half as big as the previous yet still far larger than anything Peach could hope to fight, so still somewhat shocked, the princess somewhat absentmindedly allowed the spectral escort to lead her to the dining hall, as if the princess was in the Boos’ castle now.<br>\r\n<br>\r\n     Once Peach entered the dining hall, the thought popped into her head that maybe she <i>was</i> in the Boos’ castle. As she was seated, her own castle looked unfamiliar. Her usually bright chandelier was lit by a couple of dim Peepas stuffed into the lanterns, which illuminated the room surprisingly well. The dinnerware was all hovering around the room with a glowing aura and the “entertainment” that was promised was a bunch of haunted instruments shooting through the air playing some sort of off-key concerto. Despite the ghastly nature of it all, Peach actually found it quite pleasant.<br>\r\n<br>\r\n     After a couple of distorted songs, a chorus of screechy voices erupted from the kitchen, “Dinner is served!” Just after those three fateful words, hoards of Boos came flying through the back wall dozens at a time, each one carrying at least 5, most of them holding upwards of 7, platters chock full of all sorts of delightful meals. Suddenly Peach remembered what got her swept up in this in the first place, a midnight snack. It had been delayed so much that she was ready to scarf down just about anything, and an expertly cooked smorgasbord was more than enough to fill that criteria.<br>\r\n<br>\r\n     Once every last platter had been delivered to the gargantuan table, meant for over 100 people, the whole thing was covered 10 layers high with food. All at once, the Boos howled, “Eat up!” similarly to their previous ghastly choir. Immediately, Peach grabbed whatever was at eye level, in this case, a massive roasted turkey. She shoveled meal after meal into her face, without concern for her figure, little did she know that she would be quite happy with the distribution of all those calories anyways. As she ate, each bite seemed to plump her breasts, and strangely not the rest of her body, more and more. <br>\r\n<br>\r\n     By the time Peach had finished the turkey she initially grabbed, her DD cup breasts had already grown to F cups, and her cleavage began spilling over the top of the baggy shirt she wore to bed, and all the while she remained oblivious, as she had already started on her next course.This time a hefty plate of steak and potatoes, she ate ravenously, with it again, drastically increasing her cup size. In less than a minute Peach finished the dish, her F cups now looking like GG cups, her shirt hardly covering her still very thin waist, hardly draping over her belly button, and despite being completely natural her huge breasts were absurdly perky.<br>\r\n<br>\r\n     After 2 meals Peach had had enough, and just as she was about to get out of her chair and thank the Boos for their meal, 2 of them grabbed her by the arms and pulled her back into the chair. “Where do you think you’re going?” “ We didn’t make all of this just so you could eat 2 of them!” “Come on, we’ll just feed you!” Each of the Boos chimed in to the conversation, and although Peach couldn’t make out any one particular statement, the general consensus was clear. She was eating this buffet.</span></div></div>",
            "created":1570165200,
            "id":2728169,
            "title":"Mischievous Boo chefs, Bowser’s inside story ..."
        },
        "12121212":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "Browser",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else force feeds princess Peach?</span></div></span></div>",
            "created":1570078800,
            "id":2727687,
            "title":"Something else."
        },
        "121212122":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Wendy O Koopie",
                "Browser Jr",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Anyone else force feeds princess Peach?</span></div></span></div>",
            "created":1570251600,
            "id":2728369,
            "title":"Someone else"
        },
        "1212121223":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "princess daisy ",
                "princess roseilina ",
                "mario ",
                "luigi ",
                "someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>does any of these people feed her </span></div></span></div>",
            "created":1600146000,
            "id":2903237,
            "title":"Someone else"
        },
        "1212122":{
            "author_id":"bellylover895",
            "author_name":"Bellylover895",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Peach start eating to improve her figure?</span></div></span></div>",
            "created":1598158800,
            "id":2890379,
            "title":"Nah."
        },
        "12121221":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Sure",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, and (For alternate timelines) Does she gain weight when Bowser and peach Get Married. If not (for saving timelines) then choose other.</span></div></span></div>",
            "created":1600146000,
            "id":2903358,
            "title":"Yes"
        },
        "12123":{
            "author_id":"bellylover895",
            "author_name":"Bellylover895",
            "choices":[
                "Cursed Bra",
                "Outher?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok then what else</span></div></span></div>",
            "created":1589778000,
            "id":2837587,
            "title":"Other"
        },
        "121232":{
            "author_id":"bellylover895",
            "author_name":"Bellylover895",
            "choices":[
                "Inflation ",
                "Powerup"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else.</span></div></span></div>",
            "created":1589864400,
            "id":2838062,
            "title":"Outher?"
        },
        "1213":{
            "author_id":"scotishjoker1",
            "author_name":"Joker",
            "choices":[
                "Pregnant expansion ",
                "Shrinking "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other choices ?</span></div></span></div>",
            "created":1404018000,
            "id":1820012,
            "title":"Other choices"
        },
        "12131":{
            "author_id":"n.m.e",
            "author_name":"N.M.E",
            "choices":[
                "sex",
                "magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will it happen?</span></div></span></div>",
            "created":1444971600,
            "id":2048054,
            "title":"Pregnant expansion "
        },
        "121311":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "mario",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>By who may I ask?</span></div></span></div>",
            "created":1498194000,
            "id":2341315,
            "title":"sex"
        },
        "1213112":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "bowster jr",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else is there?</span></div></span></div>",
            "created":1498366800,
            "id":2342146,
            "title":"someone else"
        },
        "12131122":{
            "author_id":"crazysonic00",
            "author_name":"Maria love",
            "choices":[
                "Bowser",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Than who? The king of kooper himself or someone else? </span></div></span></div>",
            "created":1570251600,
            "id":2728314,
            "title":"someone else"
        },
        "121312":{
            "author_id":"tarponpet",
            "author_name":"Tarp",
            "choices":[
                "Powerup",
                "Curse",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Powerup or curse?</span></div></span></div>",
            "created":1601187300,
            "id":2910814,
            "title":"magic"
        },
        "12132":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Someone use a shrink spell",
                "She ate a shrinking mushroom",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How did she shrink?</span></div></span></div>",
            "created":1548133200,
            "id":2605879,
            "title":"Shrinking "
        },
        "121321":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "Browser jr",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who use a shrinking spell?</span></div></span></div>",
            "created":1548133200,
            "id":2606239,
            "title":"Someone use a shrink spell"
        },
        "1213212":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Browser",
                "Wendy o kooper",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else use shrinking spell?</span></div></span></div>",
            "created":1548219600,
            "id":2606519,
            "title":"Someone else"
        },
        "121322":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "Kemek ",
                "Other ways she gets the mushrooms"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How did peach get the shrinking mushroom?</span></div></span></div>",
            "created":1590728400,
            "id":2842696,
            "title":"She ate a shrinking mushroom"
        },
        "1213222":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did Bowser Jr give it to her?</span></div></span></div>",
            "created":1590814800,
            "id":2843254,
            "title":"Other ways she gets the mushrooms"
        },
        "122":{
            "author_id":"urkywerky",
            "author_name":"UrkyWerky",
            "choices":[
                "Her chest is looking flat.",
                "Her middle's far too slim.",
                "Her trunk needs some junk."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><b>The ruler of Sarasaland and party girl!</b><br>\r\n<br>\r\nNow, <i>where</i> is she set to grow (first)?</span></div></span></div>",
            "created":1450155600,
            "id":2075034,
            "title":"Princess Daisy"
        },
        "1223":{
            "author_id":"endermanslayer",
            "author_name":"Kailey ",
            "choices":[
                "Daisy keeps expanding ",
                "Something else",
                "No perfect now find someone "
            ],
            "content":"<div class=\"\"><div> <span>One day in Sarasaland Daisy was sitting on her throne while Mario and Luigi were on a adventure so she decided to look for something fun to do no one was at the castle Daisy found a box in her closet that had three p balloons in it so she decided to mess with them however as she was playing volleyball with one in her throne room it went out of her sight so she turned around looked up and around trying to find it when something hit her in the ass she turned and saw the p balloon popped her ass started to grow it was noticeable due to her wearing a dress but she could feel her panties getting tighter her dress now showed to round spheres where her ass was it kept going her dress now a mini skirt from how big Daisy’s ass was growing it was starting to stop right when her panties were kinda showing her ass was 6 times bigger than normal she started grabbing her ass seeing how big it got she didn’t want it to end Daisy grabbed the second one and pushed it to her ass making it expand again she took of her dress leaving her in a bra and panties as it grew to the size of her body ripping her panties off as it ended with her ass as big as a water bed she didn’t know if she wanted to keep going (you’re choice)</span></div></div>",
            "created":1582520400,
            "id":2792319,
            "title":"Her trunk needs some junk."
        },
        "123":{
            "author_id":"omaly",
            "author_name":"Omaly",
            "choices":[
                "Pregnancy",
                "Breast Expansion",
                "Something different?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How shall she grow?</span></div></span></div>",
            "created":1426654800,
            "id":1949858,
            "title":"Princess Rosalina"
        },
        "1232":{
            "choices":[
                "Watermelons",
                "Basketballs",
                "Beach balls"
            ],
            "content":"<div class=\"\"><div> <span>Rosalina was browsing the observatories library, looking for something new to read, she searched and searched for something new until she found a rather unfamiliar book. She pulled it from the shelf and attempted to read the cover, however the book seemed very old and worn out, as all she could make out was \"body\". Rosalina stared at the book, trying to remember where it came from, she took the book to her bedroom, to look for the answer in a more comfortable environment.<br>\r\n<br>\r\n\"Here we are,\" Rosalina said to herself \"nice and cozy, now to see what lies within this book.\" She opened time cover to find an encyclopedia of spells. Rosalina was amazed by the what each spell did, \"Oh my stars,\" she began, \"All of this is for body augmentation!\" She flipped back to the front of the book where the glossary was and read them, \"belly inflation, butt inflation, feet growth, increased farts, breast expansion. My God, this is both horrible and intriguing!\" She had her eyes fixated on one section of the book, \"breast expansion, pages 45-55\" Rosalina looked down on her chest, and back at the page, she quickly decided to flip to the page and casted the spell. Shortly after, her breasts began to swell. Rosalina set the book down and felt her chest, they where beginning to reach the size of-</span></div></div>",
            "created":1544418000,
            "id":2587740,
            "title":"Breast Expansion"
        },
        "12322":{
            "author_id":"endermanslayer",
            "author_name":"Kailey ",
            "choices":[
                "Keep going ",
                "Find something else to expand "
            ],
            "content":"<div class=\"\"><div> <span>Rosalina’s boobs started to stretch the top of her dress out and starting to show more cleavage as her soccer ball size tits kept growing to get to basketball size she let out a giggle and groped them as they continued to expand her nipples started to show through her dress as they finally finished growing Rosalina stood up and looked in the mirror she loved what she saw her boobs were a lot bigger she jumped and they were really bouncy but she glanced at the book what would she do</span></div></div>",
            "created":1580706000,
            "id":2782021,
            "title":"Basketballs"
        },
        "123221":{
            "author_id":"endermanslayer",
            "author_name":"Kailey ",
            "choices":[
                "The size of a truck",
                "The size of a house"
            ],
            "content":"<div class=\"\"><div> <span>Rosalina grabbed the book and said the spell once again and they started growing again she took off her dress so it didn’t rip and she was only in her beautiful turquoise bra and panties her bra was starting to dig into her sensitive boobs Rosalina looked for a bigger bra to fit her now tire size breasts her bra finally gave way Rosalina found a star bikini that showed a lot of cleavage but only covered her nipples this was a magical bikini top that could not break same for the bikini bottom that she didn’t put on Rosalina’s boobs were the size of 3 beachballs Rosalina let out a small orgasm her boobs finally stopped at the size of 4 tires Rosalina sat down and started bouncing her boobs she let out a small orgasm again she read the spell again and started expanding to what</span></div></div>",
            "created":1580706000,
            "id":2782044,
            "title":"Keep going "
        },
        "123222":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Her butt",
                "Her belly",
                "Her height",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Rosalina expand?</span></div></span></div>",
            "created":1580706000,
            "id":2782080,
            "title":"Find something else to expand "
        },
        "1232221":{
            "author_id":"endermanslayer",
            "author_name":"Kailey ",
            "choices":[
                "Keep going",
                "Rosalina expands her boobs and ass"
            ],
            "content":"<div class=\"\"><div> <span>Rosalina intrigued by the affect wanted to make her ass just ass big as her tits and flipped to the page that had ass expansion and cast the spell on herself and her ass started to grow getting bigger every minute you could see the outlines of her ass through Rosalina’s dress her panties starting to get a little tighter Rosalina was starting to hold back the orgasms that were trying to escape Rosalina from the pleasure only two small ones escaped her she kept growing her ass was big two basketballs side by sid like her boobs her dress was starting to reveal most of her legs Rosalina grabbed her ass and pinched it and even twerked and loved what she saw and started to wonder how big she can get </span></div></div>",
            "created":1580706000,
            "id":2782212,
            "title":"Her butt"
        },
        "1232224":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did Rosealina expand her house?</span></div></span></div>",
            "created":1580706000,
            "id":2782234,
            "title":"Something else"
        },
        "1233":{
            "author_id":"razershark",
            "author_name":"Black",
            "choices":[
                "Weight Gain",
                "Inflation",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe one of these?</span></div></span></div>",
            "created":1426654800,
            "id":1949896,
            "title":"Something different?"
        },
        "12332":{
            "author_id":"gamerjohn1991",
            "author_name":"John",
            "choices":[
                "Gas",
                "Liquid"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will she puff up?</span></div></span></div>",
            "created":1470286800,
            "id":2190866,
            "title":"Inflation"
        },
        "123321":{
            "author_id":"gamerjohn1991",
            "author_name":"John",
            "choices":[
                "Something like air, helium, etc.",
                "Her own internal gasses"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of gas?</span></div></span></div>",
            "created":1470286800,
            "id":2190867,
            "title":"Gas"
        },
        "1233212":{
            "author_id":"gamerjohn1991",
            "author_name":"John",
            "choices":[
                "Rosalina's belly starts inflating",
                "Rosalina lets out a five-second fart before bloating"
            ],
            "content":"<div class=\"\"><div> <span>Rosalind entered the Kitchen Dome of the Comet Observatory one day, looking for something to eat. She then noticed a Star Bit that flickered like a candle's flame as she said, \"Hmm, that's new...\"<br>\r\n<br>\r\nNot wanting to shy away from this star-shaped snack, she popped it into her mouth, chewed it up, and then swallowed it. She then smacked her lips as she said, \"Mmm... Tastes like Mexican food...\"<br>\r\n<br>\r\nSoon, Rosalina felt a sharp pain in her belly as she said, \"Ooh, that Star Bit packs quite a punch... My belly hurts...\"<br>\r\n<br>\r\nAll of a sudden...</span></div></div>",
            "created":1470286800,
            "id":2190868,
            "title":"Rosalina the Gas(sy) Giant"
        },
        "12333":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "Growth",
                "Ofher"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices</span></div></span></div>",
            "created":1571288400,
            "id":2734180,
            "title":"Other"
        },
        "123332":{
            "author_id":"bellylover895",
            "author_name":"Bellylover895",
            "choices":[
                "Hourglass expansion, ass expansion ",
                "Outher"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How else does she expand </span></div></span></div>",
            "created":1591333200,
            "id":2846400,
            "title":"Ofher"
        },
        "1233321":{
            "author_id":"bellylover895",
            "author_name":"Bellylover895",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will she expand by being force fed starbits</span></div></span></div>",
            "created":1591419600,
            "id":2846786,
            "title":"Hourglass expansion, ass expansion "
        },
        "12333212":{
            "author_id":"bellylover895",
            "author_name":"Bellylover895",
            "choices":[
                "Yse",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will she expand by her star bikini?</span></div></span></div>",
            "created":1591419600,
            "id":2846788,
            "title":"No"
        },
        "124":{
            "author_id":"hydranoid2009",
            "author_name":"hydranoid2009",
            "choices":[
                "Giantess",
                "Weight gain",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How shall the Koopa Princess grow?</span></div></span></div>",
            "created":1428037200,
            "id":1958307,
            "title":"Wendy O. Koopa"
        },
        "1241":{
            "author_id":"urkywerky",
            "author_name":"UrkyWerky",
            "choices":[
                "...sapping up some of his size.",
                "...absorbing him into herself.",
                "...making him totally obedient."
            ],
            "content":"<div class=\"\"><div> <span>Within the library of the Koopa castle, Ludwig and Wendy browsed through some books of magic spells, Ludwig the one with wand in hand. In time, Ludwig found the perfect book.<br>\r\n<br>\r\n\"Ah, here we go. E-Hey!\"<br>\r\n<br>\r\nWendy snagged the book away and flipped through its pages. \"Alright, let's see what kinda stuff I could use!\"<br>\r\n<br>\r\nLudwig crossed his arms. \"You know, we're trying to make all us Koopalings more powerful.\"<br>\r\n<br>\r\n\"Oh hush.\" Wendy spots a certain writing. \"Hello, what's this? 'Grand Giga-sizing: make all that you touch become a part of your greatness!' Hmm. 'a part of your greatness'? What's that mean?\"<br>\r\n<br>\r\n\"Well, t means they'll follow your every whim, of course!\"<br>\r\n<br>\r\n\"Ooh! That sounds wonderful! Let's see...'After reciting the following incantation, tap your wand on your head.' \" She returns the book to Ludwig. \"Ooh, test it on me!\"<br>\r\n<br>\r\n\"Alright, but you do me next.\" Luwig spun his wand above his head. \" 'Socks to bags, string to bow, For all you touch, then more you'll grow.' \"<br>\r\n<br>\r\nLudwig shoots the wand at Wendy and...nothing. At least, it seemed like nothing.<br>\r\n<br>\r\n\"I don't feel any different.\"<br>\r\n<br>\r\n\"Well, you need to touch someone. Wait, I didn't mean-\"<br>\r\n<br>\r\nLudwig had noticed Wendy's mischievous smirk. She poked Ludwig's cheek, thus...</span></div></div>",
            "created":1457240400,
            "id":2113853,
            "title":"Wendy the Grandsizer"
        },
        "12412":{
            "author_id":"urkywerky",
            "author_name":"UrkyWerky",
            "choices":[
                "...the Koopa Troopa forces.",
                "...her cohorts, the Koopalings."
            ],
            "content":"<div class=\"\"><div> <span>Upon contact, Ludwig vanished completely, leaving Wendy confused.<br>\r\n<br>\r\n\"Ludwig? Where did you go?\"<br>\r\n<br>\r\nShe couldn't fathom where that blue-haired egghead went, so she left the library in a huff. Outside the entrance, two Troopas stood guard, noticing their pink-bowed higher-up leaving. She looked with authority at one.<br>\r\n<br>\r\n\"You two didn't see where Ludwig went, did you?\"<br>\r\n<br>\r\n\"Uh, no. We didn't see him leave.\"<br>\r\n<br>\r\n\"Oh, of course you didn't!\" Wendy's angry hand swung down onto the guard's head, followed by his disappearance. The other guard witnessed this, as well as Wendy's increased bigness, making him shake in his armour. Wendy, however, was left confused.<br>\r\n<br>\r\n\"Why is everyone disappearing all of a sudden!\" She looks to the now-lone guard's shaking. \"What are you scared of!...Hey...weren't you taller?\"<br>\r\n<br>\r\nJust then, Wendy noticed something felt off, like she was rounder or something. She looked down at herself, seeing a round orange ball where her body was. Wendy, seeing her belly poke out further than normal, was filled with shock. Within seconds of wondering how it could've happened, she remembered the spell that Ludwig cast, realizing what it actually meant to 'become part of your greatness'.<br>\r\n<br>\r\n\"HOHOHOHOHOHOHOHO! This is the greatest thing that's ever happened to me!\" Wendy was filled with giddiness--twirling in in place, clasping her hands. Her giggles rang through the halls with a great echo.<br>\r\n<br>\r\nUpon an ubrupt stop she stopped her laughing dance, and looked to the remaining guard with dark intent. The guard became the hardest shaker that ever existed, with buckets of sweat pouring down his face. Wendy approached him while extending her finger to him, making him lean away to shake and sweat harder than ever. Her claw grazed his beak, absorbing him into the very point. The guard struggled to escape but his entirety was soon sucked through her claw, into the young lady's already increased bulk.<br>\r\n<br>\r\nAs her body took in the mass, Wendy hugged her belly with pride and giggled a bit more.<br>\r\n<br>\r\n<i>Well, look at me, </i> she thought. <i>I'm already becoming quite the queen. But while three small upsizes may be enough for some, I'm Wendy O. Koopa! I deserve a greater size!</i><br>\r\n<br>\r\nWendy strutted down the empty hallway, aiming to add some greatness by visiting...</span></div></div>",
            "created":1457240400,
            "id":2113886,
            "title":"...absorbing him into herself."
        },
        "1242":{
            "choices":[
                "A large platter of cookies",
                "A delicious pie",
                "A mouth watering cake"
            ],
            "content":"<div class=\"\"><div> <span>Wendy was sitting on her bed, practicing spells on her beloved wand that Bowser had given her. She had a large book in one hand and her wand in the other. She was flipping through practicing different spells she thought were interesting.<br>\r\n<br>\r\n\"There just isn't anything cool,\" Wendy said aloud \"I've been looking for hours now, and I can't find a single spell to make me prettier!\". Wendy closed the book and put it back on her desk, which had a large mirror with multiple make up supplies. She tidied her bow and went towards the castle's kitchen, as she was feeling a little hungry after reading. <br>\r\n<br>\r\n\"SHY GUY!\" Wendy shouted, \"y- yes?\" Shy guy stuttered \"make me something delicious to snack on.\" Wendy demanded \"w-what do you want in particular?\" Shy guy asked \"cookies? Pie? Cake?\" <br>\r\n<br>\r\n<br>\r\n-What will Wendy choose?-</span></div></div>",
            "created":1544331600,
            "id":2587708,
            "title":"Chapter 1"
        },
        "12423":{
            "choices":[
                "Eat the cake, it shouldn't go to waste!",
                "Don't eat it, it would be better to save it for later."
            ],
            "content":"<div class=\"\"><div> <span>\"The most delicious cake you can make!\" Wendy commanded, \"O-okay, this will only take a few minutes.\" Shy guy replied. Wendy sat down on a nearby chair and waited, *GROWL* \"sheesh, the cake had better be here soon, I'm starving!\" Wendy thought to herself, she patted her stomach and continued to wait. \"Here it is! J-just like you asked madame!\" Shy guy announced, he presented Wendy with a lovely double layered red velvet cake with chocolate icing. \"Red velvet? That's my favorite!\" Wendy complemented, \"Oh, T-thanks!\" Shy guy replied, blushing under his mask. Wendy took the cake and went back to her quarters.<br>\r\n<br>\r\n\"Now, time to dig in!\" Wendy said to herself, she grabbed a fork and began chowing down to the cake, it's beautiful flavor leaving her with a smile. She had finished the top layer when she began to feel a little full, \"jeez, I only ate a single layer and I feel stuffed!\" She said, patting her stomach, \"I better not eat too much, I need to watch my figure.\" Wendy reminded herself, \"but,\" she began \"it would be a waste to leave the rest unattended.\". Wendy pondered on whether or not to eat the rest of the cake, she decided she would...</span></div></div>",
            "created":1544331600,
            "id":2587715,
            "title":"A mouth watering cake"
        },
        "124231":{
            "author_id":"potatoking",
            "author_name":"Potato King",
            "choices":[
                "\"Oh no- I overdid it! I knew I shouldn't have eaten it all!\"",
                "\"Eh, it's not that much- my figure's gonna be fine.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Tch- well I can't just <i>not</i> eat it.\" Wendy reasoned, licking her plush pink lips as she eyed the bottom deck of the cake, which was even larger than the layer she'd already eaten- so that it'd be able to support it. Even knowing that finishing a whole double decker cake by herself was excessive, she couldn't hold back from the temptation for long.<br>\r\n<br>\r\n\"Ohhh, heck, why not treat myself a little?\" She reasoned, grinning as she took the fork up again. \"Besides, I'm a princess! I deserve to indulge a little now and then.\" She decided, as she began to dig in- any worry thrown to the wayside as she let herself enjoy the taste of the rich, moist, sweet cake. <br>\r\n<br>\r\nBy the time Wendy finished, tossing her fork onto a now empty plate and leaning back in her chair with a satisfied sigh, she was nursing quite a potbelly. Wendy had never exactly been in great shape, her tendency to indulge in hedonism causing her to develop a somewhat plump figure. Even still, this was more than she ever ate in one sitting.<br>\r\n<br>\r\nAs she lounged casually, she idly rested both her hands on her gut. Her eyes wandered down to the cake filled orb, bloated and rotund enough to sit on her thighs a little bit.<br>\r\n<br>\r\nAs she took in her own potbelly, she thought to herself...</span></div></div>",
            "created":1591592400,
            "id":2848391,
            "title":"Eat the cake, it shouldn't go to waste!"
        },
        "1242312":{
            "author_id":"potatoking",
            "author_name":"Potato King",
            "choices":[
                "The same Shy Guy as before, who could make her all kinds of desserts!",
                "A Boo hovering around, who could make her some nice, savory, hearty meals!"
            ],
            "content":"<div class=\"\"><div> <span> Wendy smiled down at her potbelly, rubbing it gently with both hands. \"hah- I knew I had no reason to be worried!\" she said, standing up from her chair- Her rounded stomach sloshing a little bit as she stood up, since it no longer was able to rest on her lap. She went over to her full length mirror and admired herself- trying out a few poses as she flaunted her pudgy body. \"I look as perfect as ever!\" she declared, winking and blowing a kiss to her reflection.<br>\r\n<br>\r\n The spoiled koopaling was so steeped in her own vanity, that she refused to acknowledge the bloated belly she now sported. She'd been in denial about her weight for a while now without even realizing it, from her plump chest to her thick thighs and doughy oversized rump, the effects of her indulgence had made her quite chubby over time. That combined with how few calories she burned, since she absolutely despised exercise.<br>\r\n<br>\r\n Still, eating an entire double decker cake by herself in one sitting was new for her. Far more than a box of chocolates or a few cookies here and there. If anything was going to make her realize that she was getting fat, it would've been this. But- no. She still viewed her figure as ideal.<br>\r\n<br>\r\n \"I shouldn't be afraid to treat myself more,\" she mused, licking her plump lips, \"that cake was really delicious- and I almost didn't let myself have all of it! It didn't even mess up my figure!\" she said, suddenly not feeling so full anymore. \"In fact...\" she started to say, grinning, \"I think I'll treat myself again right now!\" And with that, Wendy headed back to the kitchen- to order herself another snack or two!<br>\r\n<br>\r\nWhen Wendy arrived back at the kitchen, the first worker she spotted was...</span></div></div>",
            "created":1591678800,
            "id":2848707,
            "title":"\"Eh, it's not that bad.\""
        },
        "12423122":{
            "author_id":"potatoking",
            "author_name":"Potato King",
            "choices":[
                "Wendy can only finish about half of it",
                "Wendy manages to eat everything- and wants more still!"
            ],
            "content":"<div class=\"\"><div> <span>As Wendy stepped into the kitchen, a semi-transparent pale colored orb shaped ghost caught her attention right away.<br>\r\n<br>\r\n\"Hey, you boo!\" She yelled. The boo yelped, covering its eyes- peeking out from under its hand to see the koopa princess there, with a potbelly so big and round it looked like it could fit another boo inside it.<br>\r\n<br>\r\n\"Oh- It's you! How can I help you, Princess?\" The Boo asked, lowering its arms.<br>\r\n<br>\r\n\"I'm hungry, and I'm in the mood for something really tasty!\" Wendy declared, smiling as she gave her belly a firm pat. \"What are you good at making?\" She asked.<br>\r\n<br>\r\nThe boo thought for a moment. \"Hmm...well, I can make a pretty good pizza. Also, I've been told I do fried chicken well- same with burgers and fries, a nice diner style meal! Oh, and hot dogs- if any of that sounds appealing to you?\" It asked.<br>\r\n<br>\r\nWendy grinned, clapping her hands. \"That's perfect! I'd like some of all of that right away!\" She decided, \"bring it all up to my room as soon as you're done cooking it, along with a milkshake and some soda to wash it down!\" She said, licking her plump lips in anticipation, before turning her back on the surprised boo, allowing it to see her oversized doughy butt.<br>\r\n<br>\r\n\"O-ok! I'll do that!\" The boo called out, before getting to work.<br>\r\n<br>\r\nOnly about a half hour later, Wendy was back up in her room, when she heard a knock on her door. <br>\r\n<br>\r\n\"Come in!\" She called, and in hovered the boo- holding a large platter with a whole entire pizza, a nice big burger with three thick patties, a basket of fries and another basket of fried chicken, two hot dogs with different toppings, and a pitcher of chocolate milkshake along with a liter of soda.<br>\r\n<br>\r\n\"Here- here it is, princess Wendy! Everything you asked for.\" The boo said.<br>\r\n<br>\r\nWendy was surprised- it was a lot of food! She didn't imagine it being such a big amount, but actually seeing it all in front of her made it set in just how big the meal was. She was doubtful whether she could eat it all, but...her mouth was watering, and she <i>did</i> want to indulge in her greed...</span></div></div>",
            "created":1592024400,
            "id":2850528,
            "title":"A Boo hovering around"
        },
        "1243":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "breast expansion",
                "muscle growth",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else happen? </span></div></span></div>",
            "created":1496638800,
            "id":2331263,
            "title":"more"
        },
        "125":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "Pom Pom",
                "Clawdia",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about one of these?</span></div></span></div>",
            "created":1377579600,
            "id":1652527,
            "title":"other"
        },
        "1251":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "She becomes a giantess",
                "Her breast grows ",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What's going to happen to Pom Pim?</span></div></span></div>",
            "created":1512882000,
            "id":2426396,
            "title":"Pom Pom"
        },
        "12513":{
            "author_id":"tarponpet",
            "author_name":"Tarp",
            "choices":[
                "Yes!",
                "Nah other belly growth.",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She gets pregnant?</span></div></span></div>",
            "created":1601188320,
            "id":2910820,
            "title":"Something else"
        },
        "1253":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "Mona",
                "Ashley",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about...</span></div></span></div>",
            "created":1377579600,
            "id":1652528,
            "title":"other"
        },
        "12531":{
            "author_id":"bellylover895",
            "author_name":"Bellylover895",
            "choices":[
                "Hourglass/Breasts/Ass",
                "Outher"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How will Mona grow </span></div></span></div>",
            "created":1589778000,
            "id":2837590,
            "title":"Mona"
        },
        "12532":{
            "author_id":"inflationking",
            "author_name":"The man with the plan",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the witch in training is about to get big. But how does she grow? Perhaps she gains weight?</span></div></span></div>",
            "created":1449810000,
            "id":2073165,
            "title":"Ashley"
        },
        "125322":{
            "author_id":"bellylover895",
            "author_name":"Bellylover895",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok then Breast expansion </span></div></span></div>",
            "created":1589778000,
            "id":2837588,
            "title":"no"
        },
        "1253222":{
            "author_id":"tarponpet",
            "author_name":"Tarp",
            "choices":[
                "Yeah!",
                "No no!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pregnancy?</span></div></span></div>",
            "created":1603061940,
            "id":2924203,
            "title":"No"
        },
        "12533":{
            "author_id":"jasbeedl3",
            "author_name":"joseph ",
            "choices":[
                "Penny crygor",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or maybe her</span></div></span></div>",
            "created":1448427600,
            "id":2066599,
            "title":"other"
        },
        "125332":{
            "author_id":"doyle111",
            "author_name":"doylelord",
            "choices":[
                "Bowsette",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Bowsette?</span></div></span></div>",
            "created":1543986000,
            "id":2586174,
            "title":"Other"
        },
        "1253321":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "Grow, shrink, vore",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will happen to bowsette?</span></div></span></div>",
            "created":1598245200,
            "id":2890414,
            "title":"Bowsette"
        },
        "1253322":{
            "author_id":"kirbfan101",
            "author_name":"Pen0",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Vivian?</span></div></span></div>",
            "created":1590901200,
            "id":2843643,
            "title":"Other"
        },
        "12533221":{
            "author_id":"kirbfan101",
            "author_name":"Pen0",
            "choices":[
                "Weight Gain",
                "Inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, how will she expand?</span></div></span></div>",
            "created":1591333200,
            "id":2846461,
            "title":"Yes"
        },
        "12533222":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Yes",
                "No continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why not try Madame Flurrie?</span></div></span></div>",
            "created":1599541200,
            "id":2899409,
            "title":"Other"
        },
        "125332221":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Inflation",
                "Weight gain."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, let's see what we got here.</span></div></span></div>",
            "created":1600059600,
            "id":2903118,
            "title":"Yes"
        },
        "1253322211":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Air inflation",
                "Water inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This should be easy</span></div></span></div>",
            "created":1600059600,
            "id":2903119,
            "title":"Inflation"
        },
        "12533222111":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Story 1",
                "Story 2"
            ],
            "content":"<div class=\"\"><div> <span>Well, she is a wind spirit, but we should choose how she inflates herself, hm... Oh I got it, I present you two stories. Story 1 is when Madame Flurrie is bored and decides to have fun with her gale force ability. Or story 2, where Madame Flurrie is asleep and someone quietly breaks into her house and inflates her. Choose wisely</span></div></div>",
            "created":1600059600,
            "id":2903122,
            "title":"Air inflation"
        },
        "125332221112":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Friend",
                "Foe"
            ],
            "content":"<div class=\"\"><div> <span>Madame Flurrie grew tired after working with Mario through defeating the shadow Queen and aiding him on his quest. She decided to take a nap and lay on her bed. Later, someone broke into her home and inserted a hose into her mouth. But could he or she be Friend or Foe.</span></div></div>",
            "created":1600059600,
            "id":2903160,
            "title":"An unexpected visit"
        },
        "1253322211121":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Koops",
                "Goombella"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It turns out the intruder is a friend of sorts. He or She must be attracted to big girls. The Intruder is revealed as...</span></div></span></div>",
            "created":1600059600,
            "id":2903166,
            "title":"Friend"
        },
        "12533222111212":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "She opened a window so they could float higher",
                "Madame Flurrie wakes up"
            ],
            "content":"<div class=\"\"><div> <span>Goombella always liked bigger girls, and thought that Madame Flurrie would help. She soon climbed onto of the air pump she brought and started jumping up and down, pumping Madame Flurrie if she were inflating. Goombella tried not to make noise that would wake her up, luckily for her, Madame Flurrie was a very heavy sleeper. As Goombella kept pumping her up, her body started to swell, it started from her belly which became wider that her normal sized breasts, her breasts became the size of beachballs, Her Butt grew becoming a bit more plumper and more swollen, her arms and tail started to get swollen, even her face cheeks inflated. Madame Flurrie was starting to become a Giant Blimp for Goombella to play with. Madame Flurrie soon started to rise up from the ground as her body swelled. Goombella was aroused seeing her float and climbed onto her inflated belly, but before she did...</span></div></div>",
            "created":1600146000,
            "id":2903347,
            "title":"Goombella"
        },
        "1253322212":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Sure",
                "No I like this."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you sure, we could try Expansion</span></div></span></div>",
            "created":1600146000,
            "id":2903349,
            "title":"Weight gain."
        },
        "12533222122":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Story 1",
                "Story 2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok. But don't say I didn't warn you. She does have some weight put on.</span></div></span></div>",
            "created":1600146000,
            "id":2903355,
            "title":"No I like this."
        },
        "125332222":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Olivia from Paper Mario the Origami King.</span></div></span></div>",
            "created":1600059600,
            "id":2903120,
            "title":"No continue"
        },
        "1253322221":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Inflation",
                "Weight gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Interesting, now where can you start.</span></div></span></div>",
            "created":1600059600,
            "id":2903128,
            "title":"Good choice"
        },
        "12533222211":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Air inflation",
                "Water inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, we should start with something simple, how do you want to inflate her</span></div></span></div>",
            "created":1600059600,
            "id":2903129,
            "title":"Inflation"
        },
        "125332222112":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Water Elemental",
                "Normal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Good choice, choose how it will go (She does have a water Elemental form).</span></div></span></div>",
            "created":1600059600,
            "id":2903130,
            "title":"Water inflation"
        },
        "1253322221121":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Story 1",
                "Story 2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How wise of you, which story do you want to start with.</span></div></span></div>",
            "created":1600059600,
            "id":2903131,
            "title":"Water Elemental"
        },
        "12533222212":{
            "author_id":"tarponpet",
            "author_name":"Tarp",
            "choices":[
                "Pregnancy please!",
                "No just weight gain.",
                "Maybe unbirth?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But wait how about pregnancy?</span></div></span></div>",
            "created":1601185500,
            "id":2910794,
            "title":"Weight gain"
        },
        "1253322222":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Try the Queen Bee from Mario galaxy.</span></div></span></div>",
            "created":1600146000,
            "id":2903366,
            "title":"No"
        },
        "12533222221":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Inflation ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, pick how she expands</span></div></span></div>",
            "created":1600232400,
            "id":2904520,
            "title":"Yes"
        },
        "125332222211":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Air inflation",
                "Honey inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, pick how she expands</span></div></span></div>",
            "created":1600232400,
            "id":2904522,
            "title":"Inflation "
        },
        "125332222212":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Yes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Weight gain</span></div></span></div>",
            "created":1600232400,
            "id":2904524,
            "title":"Other"
        },
        "1253322222122":{
            "author_id":"tarponpet",
            "author_name":"Tarp",
            "choices":[
                "Yes",
                "Unbirth?",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about pregnancy?</span></div></span></div>",
            "created":1601182800,
            "id":2910792,
            "title":"Other"
        },
        "12533222222":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "I dont think anyone mentioned her",
                "They definitely mentioned her (I think)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did anyone mention Queen Bean from superstar saga, If they did, then maybe not include this if copyright</span></div></span></div>",
            "created":1601855760,
            "id":2915090,
            "title":"No"
        },
        "125332222221":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Thin",
                "Fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok then, just confused, Now how does she expand, actually let's decide before we start, do you prefer her as thin or fat.</span></div></span></div>",
            "created":1601856000,
            "id":2915094,
            "title":"I dont think anyone mentioned her"
        },
        "1253322222211":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Weight gain ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, now let's start, how does she expand</span></div></span></div>",
            "created":1601856060,
            "id":2915095,
            "title":"Thin"
        },
        "12533222222111":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Eating ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, how does she gain weight.</span></div></span></div>",
            "created":1601879040,
            "id":2915235,
            "title":"Weight gain "
        },
        "125332222221111":{
            "author_id":"nekocat321",
            "author_name":"Matthew G. Montealegre",
            "choices":[
                "Story 1",
                "Story 2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now choose a story, story 1 is when there is a banquet ready for queen Bean. Story 2 is when Queen Bean becomes their favorite customer at starbean cafe</span></div></span></div>",
            "created":1601879700,
            "id":2915239,
            "title":"Eating "
        },
        "12533222222112":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Breast",
                "Butt",
                "Hourglass",
                "Height",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of expansion did Queen Bean get?</span></div></span></div>",
            "created":1601858460,
            "id":2915112,
            "title":"Other"
        },
        "125332222222":{
            "author_id":"tarponpet",
            "author_name":"Tarp",
            "choices":[
                "Yes!",
                "Another female toad!",
                "Someone else!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well now she's been mentioned what about Toadette?</span></div></span></div>",
            "created":1603062060,
            "id":2924208,
            "title":"They definitely mentioned her (I think)"
        },
        "13":{
            "author_id":"unknownguy",
            "author_name":"happy dude",
            "choices":[
                "king boo",
                "wart",
                "other",
                "your choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about king boo and his army? Or wart, if anyone remembers him...</span></div></span></div>",
            "created":1426222800,
            "id":1947829,
            "title":"more than one character"
        },
        "131":{
            "author_id":"unknownguy",
            "author_name":"happy dude",
            "choices":[
                "ghostly possession",
                "the betrayal",
                "your choice"
            ],
            "content":"<div class=\"\"><div> <span>King boo is sitting, or rather floating atop the throne of his ghostly mansion. \"I'm sick and tired of those mario bros, those mushrooms, and his other friends who keep disturbing us!!! I've had enough!!!\" Out of the shadows, comes a lone boo, \" your majesty, why not enlist bowser for help? He could be of some assistance to you.\" \"That fool!!! I've already asked him more than enough and even he can't take the fat freak on his own. Even if he had all of those powers, which he put to waste.\"  King boo continues to cackle and complain with himself, while the other boos decide what to do to please their lord. \"Perhaps we should come up with a plan?\" One says. \"I say we just use plain force. Screw all you guys, i mean come on, you're afraid to  look him in the eye.\" \"Well you don't how it feels like man.\" All of the boos continue to argue amongst each other and cause a ruckus until, luigi happens to wander into the mansion; tracking down the ghosts. \"Oh no, it's chef boyardee's boy!!! Attack!!!\" \"Oh boy not this again...\" sighs luigi. Having dealt aith boos a relentless amount of times, he just stares at them. In an immediate response, all the boos stop in their tracks and are paralyzed at the sight of being looked upon. \"Ok, time to do this.\" Shouts luigi, he pulls from his back, the poltergeist 3000 and sucks up all of the frozen boos. \"A job well done\" luigi chuckles to himself. Having done a days work, he triumphantly walks out of the mansion, ready to get his pay. Just then boo comes up with a plan and decides to check up on his loyal subjects, until, he notices that all of them are missing, except for  three sole survivng boos. \"Wwwhhhhaaatttt!!! Where did all of the boos go\" roars the phantom king. \"My king, all of ther others have been taken by luigi, except we three.\" The three speak in unison. \"And why is it that you weren't taken hmmm...\" \"oh great king, we are the only three boos who are not frozen in fear when we are gazed upon.\" At that exact moment, king boo has come up with a brilliant plan, and has an evil smirk on his face... \"my men, call for the king of koopas to appear... indeeed, i may need his assistance...</span></div></div>",
            "created":1426222800,
            "id":1947833,
            "title":"king boo"
        },
        "1311":{
            "author_id":"unknownguy",
            "author_name":"happy dude",
            "choices":[
                "Peach!?!?!?!?! O_o",
                "the three princesses begin ro resist",
                "bowser begins to resist"
            ],
            "content":"<div class=\"\"><div> <span>Having called bowser for a temporary alliance, king boo has invited bowser to come to his ghostly domain. \"Ugh, what did you call me here for boo?!?\" \"That's king boo, you overgrown turtle!\" \"Oh, so you wanna start a fight huh, i can give you one.\" \"Nevermind that, what i need now is your assistance with the two plumbers.\" \"Sure thing, i'd expect that a ghost like you whos afraid of looked at needs my help of course.\" The giant koopa says as he laughs to himself. \"Well then, it was a good thing you agreed to come here forbour meeting...\" says king boo as he charges at bowser and tackles him. After a little struggle, the koopa king succumed to boo, and is taken over by king boo. \"Time to put the plan into action\" bowser/boo or \"boowser\" says in his new body. He leaves the mansion and prepares to take his plans into action...<br>\r\n<br>\r\nMean while...<br>\r\nthe three boos are each sent to an individual kingdom, each of them following his king's orders. Boo one is sent to go after princess daisy in her kingdom. After a couple of days of wandering, the ghost manages to find daisy's castle amd enters right through the wall, finding daisy walking down the royal halls of her kingdom. Using his special ability and invisibility, boo one slowly floats towards daisy until she notices boo one. She screams, and only hears boo one say \"boo!\" Before she is possessed by him. He enters her body and feels what its is like to be alive again. Boo one chuckles in his new body and decides to quickly admire it in the mirror at the end of the hall. He feels brown hair, slender body, voice, and other features that daisy had. Still having ghost powers, except for possession when possessing a body, he floats out of the castle and returns to the mansion.<br>\r\n Boo two<br>\r\nboo two is sent to the waffle kingdom, where princess eclair resides. Upong finding, he possesses her by rushing into her body. He too admires the delicate features, brown silky hair, and the rest of his new body. In his head, he thunks he could get used to this, he mischeviously laughs to himself. <br>\r\nBoo three<br>\r\nAnd finally, the last boo is sent to the lunar observatory, where rosalina is. Boo three steadily and stealthily stalks down his princess. However, ine of the lumas notice that a boo is there and warns rosalina. Rosalina is in shock and starts remembering what mario said about boos, and stares it in the eyes. However it doesn't work and proves to be futile. Rosoalina doesn't get a chance to scream or struggle, as she is now possessed by an eager boo. Happy that he got this princess, he looks at his body at all angles, from a mirror, and begins to get used to it. Now that all of the three princesses were possessed, it was time for phase two...</span></div></div>",
            "created":1426222800,
            "id":1947849,
            "title":"ghostly possession"
        },
        "133":{
            "choices":[
                "Mario Bros.",
                "Bowser Sr. & Jr.",
                "Next pair"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about some duos like the Mario Brothers or Bowser and his son?</span></div></span></div>",
            "created":1458277200,
            "id":2119508,
            "title":"other"
        },
        "134":{
            "choices":[
                "Entire Mushroom Kingdom",
                "Entire Koopa Kingdom",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the entire Mushroom Kingdom or the entire Koopa Kingdom?</span></div></span></div>",
            "created":1458277200,
            "id":2119507,
            "title":"your choice"
        },
        "1343":{
            "author_id":"padrebackup",
            "author_name":"padrebackup",
            "choices":[
                "Yes, multiple women of the castle.",
                "No, something else. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if a few of the women from within Princess Peach's castle started to expand? </span></div></span></div>",
            "created":1493442000,
            "id":2312551,
            "title":"The Girls of Peach's Castle?"
        },
        "13431":{
            "author_id":"padrebackup",
            "author_name":"padrebackup",
            "choices":[
                "Pregnancy",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What makes them expand? </span></div></span></div>",
            "created":1493442000,
            "id":2312554,
            "title":"Multiple women of the castle. How do they expand?"
        },
        "134311":{
            "author_id":"padrebackup",
            "author_name":"padrebackup",
            "choices":[
                "Magic of some sort.",
                "Natural means (sex). "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What makes the girls pregnant? </span></div></span></div>",
            "created":1493442000,
            "id":2312555,
            "title":"How do the girls get pregnant?"
        },
        "1343111":{
            "author_id":"padrebackup",
            "author_name":"padrebackup",
            "choices":[
                "Rosalina caves in and all 3 girls eat 3 mushrooms.",
                "Rosalina doesn't want to eat the mushrooms but Peach and Daisy force feed her 10"
            ],
            "content":"<div class=\"\"><div> <span>Peach, Daisy and Rosalina were hanging out in Peach's room at the castle. Since it was getting late everyone was getting ready to go to bed and had changed into their pajamas, t-shirts and comfy pants. Just as the girls were going to say goodnight and head back to their own rooms Toadette bursts into the room holding a large sac slung across her shoulder. Before she could even speak, the other girls noticed something different about the toad. Where she once had a generally petite frame, she now had 2 massive DD tits on her chest and a bulging stomach just poking out from under her shirt. \"Oh my, what happened to you Toadette? You seem... bigger.\" Peach asked, concerned about her friend. \"Oh, these\" Toadette pushed her shoulders together to accentuate her new found bust. \"These came from these new mushrooms I was given by a magikoopa at the market today. They're supposed to be a mix of a 1-up and a super mushroom but after I ate one all I found is that it makes your boobs grow a ton. I figured you girls might want to try 'em out\". \"Thanks 'n all but I don't think Peach was just talking about your titties. Your gut's also looking pretty fat\" Daisy said as she poked Toadette's swollen middle, finding it abnormally hard. Toadette brushed this off \"The magikoopa just said that was a side effect of the mushrooms. Eventually the stomach goes down but the boobs stay forever. It's really not that bad, it does feel a little tingly though and I occasionally feel like I'm going to throw up but it's short term pain for long term gain\" Toadette jiggled her boobs again as she took another pink mushroom out of the bag and ate it. \"Alright, can't be that bad.\" Said Daisy, \"Let's give it a shot!\". \"Oh... ok.\" Peach responded hesitantly. \"I'm really not so sure about this.\" Rosalina spoke for the first time since Toadette came in. \"Magikoopas normally work with Bowser and aren't to be trusted.\" \"Don't be such a drag.\" replied Daisy, \"You of all people could use a boost in the boobs department anyway\" Daisy squeezed Rosalina's tiny breasts making her blush. \"WE'RE DOING THIS!\" Daisy exclaimed. </span></div></div>",
            "created":1493442000,
            "id":2312603,
            "title":"Magical Pregnancy"
        },
        "13431111":{
            "author_id":"tarponpet",
            "author_name":"Tarp",
            "choices":[
                "They start to feel tingly in their chest... but Toadette is having extra growth",
                "They all experience growth suddenly!",
                "Reader's choice."
            ],
            "content":"<div class=\"\"><div> <span>Rosalina lets out a defeated sigh, \"I suppose I'll try ONE, just ONE!\" Daisy punched the air in excitement. They all took one mushroom from Toadette, who was still enjoying looking at her own well endowed chest, still thinking nothing of her extra \"chub\". The three all take one bite....</span></div></div>",
            "created":1601187960,
            "id":2910818,
            "title":"Rosalina caves in and all 3 girls eat 3 mushrooms."
        },
        "134312":{
            "author_id":"deepspaghetti",
            "author_name":"deep spaghetti",
            "choices":[
                "Breast Expansion",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices:</span></div></span></div>",
            "created":1571202000,
            "id":2733978,
            "title":"Other"
        },
        "1343122":{
            "author_id":"deepspaghetti",
            "author_name":"deep spaghetti",
            "choices":[
                "Ass/Hourglass Expansion",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more choices:</span></div></span></div>",
            "created":1571202000,
            "id":2733981,
            "title":"Other"
        },
        "13431221":{
            "author_id":"deepspaghetti",
            "author_name":"deep spaghetti",
            "choices":[
                "Just Butt",
                "Hourglass (Breasts and Butt)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just butt expansion or butt and breasts?</span></div></span></div>",
            "created":1571202000,
            "id":2733983,
            "title":"Ass/Hourglass Expansion"
        }
    },
    "info":{
        "author_id":"inflationking",
        "author_name":"The man with the plan",
        "brief_description":"Characters from the Mario world expanding in many ways",
        "created":1377634860,
        "description":"<td align=\"left\" class=\"norm\">just a fun story with few rules<br>\r\n<br>\r\n1. No permanently killing off characters (although making them \"lose a life\" is allowed)<br>\r\n2. Popping is allowed, but be mindful of the first rule<br>\r\n3. always leave choices.<br>\r\n4. have fun<br>\r\n5. Sex is allowed, but PLEASE try not to over do it.</td>",
        "id":1949523,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604131380,
        "modified":1604131380,
        "pretty_title":"Mario expansion interactive"
    }
}