{
    "chapters":{
        "1":{
            "author_id":"elrunion136124",
            "author_name":"El Runion",
            "choices":[
                "Mojo Jojo and The Anubis Head",
                "Professer Utoniums Expiriment",
                "Princess Morbucks and Her New Laser",
                "Him Evil Powers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> To start, How do they change?</span></div></span></div>",
            "created":1307595600,
            "id":1122700,
            "title":"Options"
        },
        "12":{
            "choices":[
                "Yes, that's a great idea!",
                "Nah, not really. Moving on, please."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>BUT WAIT! Instead of the girls turning into dogs, how about some of the characters go through age regression?</span></div></span></div>",
            "created":1360806060,
            "id":1531572,
            "title":"Professer Utoniums Expiriment"
        },
        "121":{
            "choices":[
                "Blossom/Bubbles/Buttercup",
                "Villains of Townsville",
                "Citizens of Townsville"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay then, what character shall regress and/or progress?</span></div></span></div>",
            "created":1360806120,
            "id":1531575,
            "title":"Yes, that's a great idea!"
        },
        "1211":{
            "choices":[
                "Blossom! (Duh, she's the best!)",
                "Bubbles (She would be cuter younger or older)",
                "Buttercup (She'd probably bash your face in if you picked her.)"
            ],
            "content":"<div class=\"\"><div> <span>Okay, so which one? Blossom, the self-proclaimed, prim, red-headed leader of the group, Bubbles, the cute, sensitive, and effervescent member of the group, or Buttercup, the hot-headed tough member of the group who isn't afraid of 'nothin!'?<br>\r\n</span></div></div>",
            "created":1360806300,
            "id":1531576,
            "title":"Blossom/Bubbles/Buttercup"
        },
        "12112":{
            "choices":[
                "Baby (0-2)",
                "Tween/Teenager/Adult/Elder"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But how old/young will she get?</span></div></span></div>",
            "created":1360806360,
            "id":1531578,
            "title":"Bubbles (She would be cuter younger or older)"
        },
        "121121":{
            "choices":[
                "Bubbles has to 'go potty'",
                "Bubbles tries to talk to her sisters (at least Buttercup)"
            ],
            "content":"<div class=\"\"><div> <span>Bubbles Utonium woozily awoke to the soft chirps of birds and the morning sun's beams of rays hitting her eyelids. Her eyes slowly fluttered opened, but Bubbles knew something was different. 'Bars? What are bars doing in my bed?' Bubbles thought. Indeed, large, blue wooden bars surrounded Bubbles and her bed.<br>\r\n<br>\r\nBubbles quickly sat up in bed and heard a strange noise. It sounded like plastic…Like, a crinkling noise of some sort. Bubbles looked down and found herself clad in a baby blue sleeper. Looking farther down below her lower abdomen, an odd bulkiness around her waist made Bubbles awfully curious. Bubbles also noticed that everything around her was much, much, MUCH more bigger than they were the previous night. Bubbles gazed around the room and was utterly shocked at what she was seeing.<br>\r\n<br>\r\nThe room was now painted a pale blue shade, and where Bubbles' dresser was stood a changing table, complete with diapers, wipes, powder, and baby clothes. Bubbles' mouth was agape and she was unaware of the dribble that was oozing out of her mouth.<br>\r\n<br>\r\n\"W-what happened to my ROOM?!\" Bubbles cried. However, only an incoherent mishmash of baby gibberish emerged from her mouth and Bubbles clamped her hands over her mouth.<br>\r\n<br>\r\n'I can't speak?' Bubbles thought. Bubbles felt hot tears quickly well up in her eyes and she couldn't help but wail piercingly. She continued to weep uncontrollably before she heard her bedroom door creak open. Someone was in her room!<br>\r\n<br>\r\nIn stepped Blossom, Bubbles' older pink-eyed, carrot-red-haired sister. She ran over to baby Bubbles and gingerly scooped her into her arms.<br>\r\n<br>\r\n\"Hush now, Bubby,\" Blossom cooed to her now baby sister. Bubbles looked up at Blossom quizzingly, tears still flowing from her eyes and down her plump, pink little cheeks.<br>\r\n<br>\r\nBubbles whimpered. 'How did this all happen?' Something then caught Bubbles' attention. She fixed her eyes on Blossom for a second time and noticed something…different…about her. Blossom looked much, much older than she previously was. Her hair had grown alot longer, she had grown very much taller, and her posture seemed rather dignified. Bubbles also noted that Blossom's giant red bow had shrunk to a tiny flower hairclip, which greatly surprised Bubbles.<br>\r\n<br>\r\n\"Heh, that's the Bubbles I know,\" Blossom smiled softly at her baby sister and kissed her forehead warmly. Bubbles couldn't help but smiled, though she was still questioning about what had happened while she slept last night.<br>\r\n<br>\r\n\"Are you hungry, Bubbly?\" Blossom gracefully asked Bubbles. Bubbles nodded, a slight frown growing on her lips. Blossom frowned back,<br>\r\n<br>\r\n\"Bubbles, why are your frowning? What happened to my cheerful and happy little sister?\" Blossom asked. A wide smirk quickly stretched across Blossom's face and she lightly tickled baby Bubbles' sides. Bubbles giggled wildly and clasped onto Blossom's claret-red tanktop.<br>\r\n<br>\r\n\"Come on, Bubbles. Let's go get some breakfast.\" Blossom and baby Bubbles then headed downstairs into the kitchen, where Bubbles saw some rather familiar faces.<br>\r\n<br>\r\nOne of them was an old man with salt-and-pepper hair and an aging face. Several lines and wrinkles adorned his face, yet he had a glad smiled on his face. The man, now known as the Professor, or in Blossom's case, 'Dad', even had a beard and goatee, which made his current age more and more apparent.<br>\r\n<br>\r\nAnother was a smaller little toddler with bright lime-green eyes and ebony-black hair that was very much ruffled and fuzzy, as if the little tyke's hair hadn't been brushed in ages. The young tot, around two or three years of age, wobbled around the room, touching and getting into things that the Professor warned that she shouldn't, even though she did anyway. It suddenly hit Bubbles like a ton of bricks: This toddler was Buttercup!<br>\r\n<br>\r\n\"Now Buttercup,\" The Professor ran his fingers through his hair and massaged his temples. \"Please settle down, darling.\" The Professor lifted Buttercup into the air and kissed her cheek before he set her down in a nearby highchair.<br>\r\n<br>\r\n\"Dad, I think Bubbles is hungry, so would you like me to feed her for you?\" Blossom asked the Prof. with pleading eyes.<br>\r\n<br>\r\n\"Well, I'm not sure, Blossom…\" Professor Utonium sighed, an unsettled expression plastered on his face.<br>\r\n<br>\r\n\"Aw, but Professor, I'm fifteen!\" 'FIFTEEN?!' Bubbles thought.<br>\r\n<br>\r\n\"Oh…alright. But please be careful, Blossom. Bubbles is very delicate and fragile.\" The Professor eventually gave in as he shoved a spoonful of eggplant purée into Buttercup's open mouth. Blossom then immediately zipped over to the fridge and grabbed a full bottle out of it, then proceeded to warm it up with her heat vision. Blossom soon returned with the bottle, which Bubbles at first refused. She couldn't, she wasn't really a baby! Regardless how she fought, Blossom was a lot stronger, and she grabbed her, cradling her on her back and putting the rubber amber nipple to her mouth. Against all will, Bubbles let it through and began to suckle, the warm liquid calming her down immensely.<br>\r\n<br>\r\n\"There, doesn't that make you feel better? You were getting very fussy, Bubby. Yes you were, yes you were.\" Blossom cooed at her baby sister. This somewhat made Bubbles calm down and relax. Bubbles felt so content and tranquil, it stunned her. She wondered how this happen, when it happened, and how things would return normal again….if they did.<br>\r\n<br>\r\nWhat happens next?<br>\r\n</span></div></div>",
            "created":1360806480,
            "id":1531581,
            "title":"Baby (0-2)"
        },
        "1212":{
            "choices":[
                "Sure, that'll work. ",
                "No. Moving on..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about the Rowdyruff boys? I bet they'd make cute babies/adults. :D</span></div></span></div>",
            "created":1360806540,
            "id":1531583,
            "title":"Villains of Townsville"
        },
        "12121":{
            "choices":[
                "Brick ",
                "Boomer/Butch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, so which lucky 'ruff with regress/progress?</span></div></span></div>",
            "created":1360806660,
            "id":1531587,
            "title":"Sure, that'll work. "
        },
        "121211":{
            "choices":[
                "Baby (0-2)",
                "Tween/Teenager/Adult/Elder"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you've chosen Brick. Good choice. But how young/old will he age?</span></div></span></div>",
            "created":1360806720,
            "id":1531589,
            "title":"Brick "
        },
        "1212111":{
            "choices":[
                "He just wakes up that way.",
                "Boomer wants revenge for being treated like a baby for so long...?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Aww!! So cute!! Great choice!<br>\r\nBut how does he regress? He doesn't just become younger all of a sudden...</span></div></span></div>",
            "created":1360806780,
            "id":1531591,
            "title":"Baby (0-2)"
        },
        "121212":{
            "choices":[
                "No, I want to choose either Boomer or Butch.",
                "Of course! Why didn't you put it as a choice earlier?!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Wait, how about all three boys regress at the same time instead?</span></div></span></div>",
            "created":1360807260,
            "id":1531597,
            "title":"Boomer/Butch"
        },
        "1212122":{
            "choices":[
                "Kay.",
                "No. Once again, moving on..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright then. <br>\r\nHow about the PPGs find them?</span></div></span></div>",
            "created":1360807320,
            "id":1531598,
            "title":"YES! Why didn't ya put it as a choice sooner?!"
        },
        "12121221":{
            "choices":[
                "Spring/Summer",
                "Winter/Fall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But what background? Is it a nice, warm Sping/Summer day, or is it a bitter cold Winter/crisp Autumn?</span></div></span></div>",
            "created":1360807440,
            "id":1531600,
            "title":"The 'Puffs take the 'Ruffs under their wing."
        },
        "121212212":{
            "choices":[
                "Winter. (Makes the story more dramatic)",
                "Autumn. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Winter, or Fall?</span></div></span></div>",
            "created":1360807500,
            "id":1531601,
            "title":"Winter/Fall"
        },
        "1212122121":{
            "choices":[
                "Bubbles sees something over at City Hall.",
                "They continue their journey to the Library."
            ],
            "content":"<div class=\"\"><div> <span>The kids across the street were building snowman, their parents watching them from inside, drinking warm mugs of hot chocolate. Some people were decorating their houses with colorful lights for Christmas, stringing every corner of their house with the little bulbs. One woman, who was bundled up in the warmest of outfits, lazily walked out of her house to fetch the mail, giving the delivery guy a small smile and a wave before she slipped back in the comfort of her house. Blossom's vision concentrated back on the window. Little snow flurries fell and gradually melted, drops of water gliding down the glass and creating tiny puddles on the sill. She saw her reflection in the window, and she traced the path of her auburn hair. Blossom's rose-pink orbs were wide and alert, keeping a keen eye on the suburbs of Townsville.<br>\r\n<br>\r\nThere was a knock at her door and the pink clad girl turned to see her effervescent sister bounce in her room, her golden ringlets bobbing with every step she took, \"You ready to go?\" She grinned, her powder blue eyes lighting up.<br>\r\n<br>\r\nThey were going to the library to find some information on Albert Einstein for a school research project. When their history teacher first announced it, Bubbles and Blossom immediately looked at one another. They nodded and silently agreed to be partners. Buttercup was lounging in her chair, tilting it on its two back legs. She was looking at the clock, waiting for the bell to ring to announce the start of Christmas break. The green 'puff inwardly shrugged. Mitch and her will do it the night before they come back. But Blossom and Bubbles think differently from their reckless sister. They were doing it the first night of break.<br>\r\n<br>\r\n\"Yeah, just let me grab my bag...\" Blossom scrambled around her room for her bag, which was under her desk. \"Alrighty,\" Blossom smiled. They descended down the stairs and into the living room, where a plate of cookies sat on the table. Bubbles picked one up and nibbled on it. \"Buttercup?\" Blossom waved at her sister to try to get her attention.<br>\r\n<br>\r\nButtercup was on the couch, bobbing her head and down to the beat of the music thrumming loudly in her ears. She paused it and glanced over, her ebony bangs brushing in her apple green eyes, \"Yeah?\" She asked, obviously annoyed.<br>\r\n<br>\r\n\"'We're going to the library. Are you sure you don't want to get a head start on the project?\" Blossom asked.<br>\r\n<br>\r\nButtercup snorted, \"No. What kind of idiots waste their time doing that?\"<br>\r\n<br>\r\n\"The idiots that are passing their classes, unlike you,\" Bubbles frowned. Buttercup ignored her and resumed with humming along to the music. \"Come on, Blossom,\" Bubbles dragged her leader out the front door.<br>\r\n<br>\r\nThey flew in silence, admiring the beauty of Townsville in the winter. It was dark out, the stars twinkling above them, and the snowflakes gently fell around them and to the think blanket of snow below. Bubbles broke the silence, \"So, when we get home do you want to watch a movie?\"<br>\r\n<br>\r\nBlossom sighed, \"Bubbles, we watched a movie every night this week.\"<br>\r\n<br>\r\n\"This'll be the last night, I promise!\" Bubbles pleaded.<br>\r\n<br>\r\n\"What movie?\" Blossom sighed once more.<br>\r\n<br>\r\n\"Dr. Seuss' How The Grinch Stole Christmas,\" Bubbles said. \"I've been waiting for this one all year! Please, Blossom? Pretty please with a cherry on top?\" Bubbles clasped her gloved hands together.<br>\r\n<br>\r\nBlossom gently smiled, \"Fine,\" she gave in to her sister's puppy dog eyes. Blossom adjusted her pink earmuffs and rubbed at her pinkened nose with her mittens.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1360807560,
            "id":1531602,
            "title":"Winter. (Makes the story more dramatic)"
        },
        "12121221211":{
            "choices":[
                "They take the boys home, and Buttercup flips. ",
                "They make a quick pit stop at a baby store."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey,\" Bubbles curiously stated. \"What's that?\" She halted in mid-air and zipped down outside City Hall. Blossom shortly followed after the baby blue streak. Bubbles was skipping up the steps. She heard her sister gasp and squeal, peering over into a cardboard box. Blossom stood a few steps behind her.<br>\r\n<br>\r\nBubbles kneeled and scooped up a tiny form. She turned around and Blossom's eyes widened. \"A...a baby?\" Bubbles smiled gently down at the baby. He was sleeping soundly, his wispy golden hair blowing lightly in the chilly breeze. The baby had only a diaper on its body. He kept twitching in his sleep, making little cooing noises and snuggling even closer to Bubbles' chest.<br>\r\n<br>\r\n\"Aw!\" Bubbles looked back down in the box, \"They're so adorable! Who would do such a thing to these boys?\" Bubbles nuzzled the baby.<br>\r\n<br>\r\n\"Boys?\" Blossom peaked in the box.<br>\r\n<br>\r\nInside the cardboard box were two babies. One baby had reddened cheeks, a button nose, and pale itty bitty lips. Fiery long, red hair splayed across the messily folded blanket and the red baseball cap beneath him. His eyes were glued shut. The poor thing was only clad in a diaper and socks, and Blossom immediately wanted to cradle him to her chest. His fingers start to wiggle and his eyes fluttered open. Two orbs of haunting carmine.<br>\r\n<br>\r\nBrick...?<br>\r\n<br>\r\nBrick frowned, obviously not happy that the person who found him was his counterpart.<br>\r\n<br>\r\nThe baby boy beside Brick had messy obsidian hair and jade green eyes, without a doubt, it was Butch. He was babbling away about something and poking his bare chest with a pudgy finger. When he saw Blossom, he giggled and reached his arms out. She hesitated before picking him up. Butch shivered when he reached up and tugged at her bow, causing all of her hair to fall across her shoulders.<br>\r\n<br>\r\n\"Oh boy. You are going to be quite the handful,\" Blossom muttered. A sudden cry startled her, and she looked back at the box. Brick was holding out his arms, his ruby eyes wide and his teeth chattering. She shifted Butch to her left side and scooped Brick up in her arms. They both buried their faces in the crook of her neck, trying to warm themselves up.<br>\r\n<br>\r\n\"We need to get these babies-\" Bubbles was brushing hair out of Boomer's eyes when she saw Blossom cradling Butch and Brick. She glanced between Boomer, Brick, Butch, and then her eyes met Blossom's. \"Home,\" she finished quietly. \"The... the Rowdyruff Boys are babies?\"<br>\r\n<br>\r\n\"I'm afraid so,\" Blossom cringed.<br>\r\n<br>\r\nBubbles gasped, \"So this is...Boomer?\"<br>\r\n<br>\r\nBlossom nodded.<br>\r\n<br>\r\n\"B-b-but how?\" Bubbles stammered.<br>\r\n<br>\r\n\"I'm not sure...\" Blossom trailed off.<br>\r\n<br>\r\nBubbles got straight to the point, \"Blossom...we can't leave them out here like this,\" she gestured to the snow around them.<br>\r\n<br>\r\n\"I know, I know, Bubbles,\" Blossom shook her bangs out of her face. She could hear the chatters of teeth below her chin, where two one-year-olds clung to her for dear life. \"What do you suggest we do?\"<br>\r\n<br>\r\nBubbles mischievously smiled, \"As if it wasn't obvious enough.\"<br>\r\n<br>\r\nBlossom slowly catched on to what Bubbles was trying to get across, \"No. No! We are not taking them home, Bubbles.\"<br>\r\n<br>\r\n\"But Blossom-\" Bubbles whined.<br>\r\n<br>\r\n\"Bubbles, Christmas is in less than a week! What do you think the Professor would do if we bring three babies into the house?\"<br>\r\n<br>\r\n\"Well-\" Bubbles began, again. She snuggled Boomer closer, wrapping her arms around his bare back to make an effort to warm him up.<br>\r\n<br>\r\n\"Do you remember the time we brought Mittens home? He flipped when he saw a cat on his couch! What do you think he would do if he saw three babies?!\"<br>\r\n<br>\r\nBubbles watched as Butch and Brick shifted. With her superhearing, she could hear them moan softly. Boomer cooed into her hair, and she covered his icy ears with her gloves. The blue clad girl cringed when she saw Blossom's glower, \"But the Professor warmed up to Mittens, right?\" She spoke softly.<br>\r\n<br>\r\nBlossom realized she was frightening her younger sister. \"Bubbles, I'm sorry but I'm not sure if...\" The pink 'puff trailed off as she looked into Bubbles' pleading eyes. She glanced down, meeting Brick and Butch's puppy dog eyes. If Boomer was awake, he would have eyes bigger than saucers. He's Bubbles' counterpart, after all.<br>\r\n<br>\r\nBlossom heavily sighed, \"Fine. But your counterpart, your problem.\"<br>\r\n<br>\r\n\"Yes! Thank you, thank you, thank you, Blossom! I'd hug you now but...\" Bubbles lifted Boomer the slightest bit. \"My hands are kind of full,\" she grinned.<br>\r\n<br>\r\n\"Buttercup's going to be thrilled,\" Blossom groaned, shortly followed by Bubbles'. Butch snickered from her arms.<br>\r\n<br>\r\n\"Yeah, she'll be a real peach to deal with,\" Bubbles mumbled. \"Well, I'm going home. See you there, Bloss!\"<br>\r\n<br>\r\nBlossom shrugged and watched Bubbles zip off in a flash of snowflake blue. She hovered and looked down at Brick, \"I suppose you want your hat?\"<br>\r\n<br>\r\nHe nodded, and after scooping up the hat and tucking it in her bag, she flew off, mentally preparing herself for what lies ahead.<br>\r\n</span></div></div>",
            "created":1360807620,
            "id":1531604,
            "title":"Bubbles sees something over at City Hall."
        }
    },
    "info":{
        "author_id":"elrunion136124",
        "author_name":"El Runion",
        "brief_description":"Powerpups tf",
        "created":1307654220,
        "description":"<td align=\"left\" class=\"norm\">The story of how the girs become dogs the second time.<br>\r\n<br>\r\nRules:<br>\r\nNo death.<br>\r\nNo sex.<br>\r\nNo lesbian/gay</td>",
        "id":1783734,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1360807620,
        "modified":1360807620,
        "pretty_title":"Powerups 2.0"
    }
}