{
    "chapters":{
        "1":{
            "author_id":"trytothink",
            "author_name":"Nathaniel Hammel",
            "choices":[
                "The lamppost went out",
                "She tried to find help",
                "She tried to find her way home, but found herself more lost",
                "her wings were not just tired, but ripped",
                "She was hungry "
            ],
            "content":"<div class=\"\"><div> <span>Elith sat crying under a warm lamppost on a cold and chilly night in the city Magnous.  There were few out that evening, and no attention came to the lost little girl who was all by her self.  Her wings hurt from flying too fast, and now she didn't know where she was, or how to get back home.  Why did she run away.  She was only upset at the scolding she received earlier in the day.  Her mother had found out that Elith had skipped magic school, and when Elith said she'd fallen asleep, her Mother had hit her for the first time.  Elith had lied ... and her mother new it, she knew that Elith had been down at the swamp with a boy. <br>\r\n<br>\r\nNow Elith felt bad for running away, she meant to apologize to her mother, but was too stunned to realize she had stormed from the house, and now sat crying far away from her home.</span></div></div>",
            "created":1182229200,
            "id":418178,
            "title":"Elith Ran Away"
        },
        "11":{
            "choices":[
                "Elith: \"Good evening, sir. Would you please give me directions?\"",
                "Elith quickly runs inside the tavern.",
                "Elith sees a brighter light at a distance, and makes a run for it."
            ],
            "content":"<div class=\"\"><div> <span>The lamp post began to flicker, as if it desperately attempted to stay lit. After a few seconds, a perfect darkness fell everywhere around Elith. She quickly stood up and looked around if she could see a source of light in the streets of Magnous. Suddenly, she became aware of a soft rhythmic noise, which she quickly identified as sneaking footsteps. She quickly looked around, now in panic. The footsteps gradually became louder. Elith just decided she would run in the opposite direction of the noise as fast as she could when her eyes finally caught sight of a small light in the distance. <br>\r\n<br>\r\nSuddenly, the footsteps stopped. Elith clearly heard heavy breathing behind her. For a split second she stood frozen in terror, and then she shrieked and ran in the direction of the light as fast as she could. There was no sound of pursuit. Slowing her pace as she reached the light, she found it was a lantern. It light up a sign that said \"Magnous Tavern: Open 24 Hours a Day, Seven Days a Week!\" Elith looked back to see the silhouette of a very tall man looking at her about ten yards away.<br>\r\n<br>\r\n</span></div></div>",
            "created":1251349200,
            "id":751221,
            "title":"The Lamp Post Went Out"
        },
        "111":{
            "choices":[
                "Elith runs for the tavern.",
                "Elith stands and confronts the footsteps."
            ],
            "content":"<div class=\"\"><div> <span>The silhouette didn't move in the slightest. \"Sir?\" Elith tried again. She raised an eyebrow. Why would a stranger be standing there like that? She carefully moved closer to the tall shape, who still didn't move an inch. \"S-sir?\" She asked, this time mustering up the courage to poke the silent type. \"... It's a statue!\" Elith realized. She chuckled, and then broke out in laughter. \"Founder of Magnous\", she could just barely read at the statue's foot. She stood there for a while when a sound made her fall silent again- footsteps. <br>\r\n<br>\r\nShe turned back to the tavern. The footsteps were now no more than a few yards, but if the ran for the tavern she would make it.</span></div></div>",
            "created":1251349200,
            "id":751234,
            "title":"Elith Asks Directions"
        },
        "1111":{
            "author_id":"ahunt",
            "author_name":"ahunt",
            "choices":[
                "Elith fights back.",
                "Elith gives into her captor."
            ],
            "content":"<div class=\"\"><div> <span>Taking in a deep breath, Elith turns for the Tavern.  She scrambles towards the place as quickly as possible.  Her feet seem to drag under her and the limp wings drape over her tiny frame.  She can still hear the persistent footsteps behind her.  They begin to move quicker with ever stride she takes.  She takes another breath and takes off!<br>\r\n<br>\r\nFinally!  She comes to the door heaving! She grabs for the brass nob desperately! Pulls.  Nothing!  The footsteps are closing in on her.  She can feel her heart beating faster and faster.  \"Please open!\" She yells, hoping that someone inside might here.  So much for being open 24/7.  \"Please!\"  Her screams echo.<br>\r\n<br>\r\nAs Elith opens her mouth to attempt to scream out again, a gloved hand covers her lips firmly!</span></div></div>",
            "created":1318291740,
            "id":1204311,
            "title":"Elith runs for the tavern."
        },
        "11111":{
            "author_id":"ahunt",
            "author_name":"ahunt",
            "choices":[
                "Elith's captor looks for her",
                "Elith waits till morning in the brush"
            ],
            "content":"<div class=\"\"><div> <span>With the last bit of energy, Elith bites down on the hand and takes off running into the wooded area behind the tavern.  She hides amongst the brush and waits.  Her breathing and heaving must be heard a mile away.  \"I have to calm myself,\" she convinces herself.  If she stays quiet maybe the monster won't hear her.  Maybe whatever it is that tried to grab her will leave.<br>\r\n<br>\r\nIn her head she sings the verse her mother would sing to her after a nightmare.  \"Breath...little fairy.  Don't cry little fairy.  Tomorrow the sun shall shine again.<br>\r\nBreath...little fairy.  Don't cry little fairy.  Tomorrow you'll fly again.\"   </span></div></div>",
            "created":1318292460,
            "id":1204316,
            "title":"Elith fights back."
        },
        "111111":{
            "author_id":"ahunt",
            "author_name":"ahunt",
            "choices":[
                "Elith is captured",
                "Elith responds"
            ],
            "content":"<div class=\"\"><div> <span>Elith continues to console herself despite hearing the footsteps from around the brush.  She notices how heavy they sound.  Whoever is after her, has to be big.  Her body begins to quiver with fear.  The steps are in the near distance.  They are persistent in finding her.  \"Why me?\" Elith wonders. <br>\r\n<br>\r\n She thinks of ways of escaping, but her choices are limited.  If she tries to run, the noise will lead the monster to her.  Her wings are to tired and would not be able to lift her.  The fatigue becomes more and more of a problem as the night closes in all around.  \"I should have stayed home.  And, I should have listened to the instructors.  Maybe, I would know of a magic spell to get me out of here.\"  Elith's mind torments her with what should have or could have been.<br>\r\n<br>\r\nThe fear continues to be the same.  Someone is after Elith.  They have purposely followed her.  Magnous has never been a safe town.  There are always things trying to capture fairies.  Of all the creatures, fairies get targeted the most.  They are small and fragile.  Elith knows that her wings would be a grand prize for a hunter!  She has heard many horror stories about young Forrest Fairies being kidnapped by hunters.  <br>\r\n<br>\r\nThe crunching of the leaves don't ease the patter of Elith's now fragile heart. She knows that something is trying to find her.  She sits quietly.  <br>\r\n<br>\r\n\"I can hear you breathing,\" a rough voice breaks the silence of the night!<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1318354620,
            "id":1204625,
            "title":"Elith's captor looks for her"
        },
        "1111111":{
            "choices":[
                "Elith wakes up not knowing where she is",
                "Elith dreams"
            ],
            "content":"<div class=\"\"><div> <span>Elith begins to hold her breath. \"The hunter is just trying to trick me. He can't really hear my breath, he is just trying to get me to respond\" Elith releases the air she was holding in. Her thought had relaxed her.<br>\r\n<br>\r\n\"But the thing is, young fairy, I am not trying to trick you.\" The voice says. <br>\r\n<br>\r\nElith looks behind her and sees an unshaven man right behind her. Her fear turns to adrenaline, and Elith scrambles out of the bush. Although she has minor scratches, at least she has some chance of escape. Suddenly Elith trips on a fallen branch, and faints.<br>\r\n<br>\r\n\"Now I've got you\" the man says.</span></div></div>",
            "created":1326741360,
            "id":1259801,
            "title":"Elith is captured"
        },
        "11111111":{
            "author_id":"flamebreather",
            "author_name":"~Dragon~",
            "choices":[
                "Elith tries escaping again",
                "A scene with \"Your Majesty\""
            ],
            "content":"<div class=\"\"><div> <span>\"Where am I?\" Elith rubbed her eyes open, hearing her voice echo around her.  She sat up and took stock of her surroundings.  \"Ouch!\" She sniffed. \"Ewww! It smells like rotten eggs in here.\"<br>\r\n\"Glad to see you awake.\" a voice sounded out.  <br>\r\n\"who are you?\"<br>\r\n\"Oh you'll find out soon enough.\"<br>\r\nElith felt herself being lifted up. \"Shhhh.\"<br>\r\n\"This is a fairy kidnapping!  It should be illegal!\" Elith struggled against her captor.  <br>\r\n\"Your wings are torn and you can't fly anymore.  We're here to fix you up.\"<br>\r\nElith jabbed her captor's ribcage.  \"Let. ME. GO!\" she grunted.<br>\r\n\"Nice try, little fairy.\" the owner of the voice muttered.  \"You're not getting away THAT easily.\" He gripped her tighter and began to sprint.<br>\r\n\"Let! Me! GO!\" Elith yelled.<br>\r\n\"You're not going anywhere.\" He used Elith's body as a shield as he crashed into a set of doors at full speed. <br>\r\n\"OW! Watch it!\" Elith snapped, <br>\r\n\"Your Majesty.\" He knelt down on a red rug.  \"The fairy.\"</span></div></div>",
            "created":1489212660,
            "id":2287839,
            "title":"Elith wakes up not knowing where she is"
        },
        "1112":{
            "choices":[
                "The man takes Elith to the tavern and asks her why she is out all by herself.",
                "The man walks away with a huff.",
                "The man kidnaps Elith."
            ],
            "content":"<div class=\"\"><div> <span>A pair of two red-brown boots stopped in front of her. They were tall boots, with laces tightly bound to the punctures in the leather, all the way up to the person's knees.<br>\r\nTrembling, Elith backed up a few steps, and hugged her arms as if cold. She stared at the man, her mouth hanging wide open.<br>\r\nThe man bent down to look at her, and lower his lantern. Elith was bathed in light and warmth from the candle.<br>\r\n\"Well?\" the man said, his beard brushing the top of the lantern. \"What are you squawking at?\"<br>\r\nElith thought it would be rude to say nothing. \"C-could you please take me to the tavern, sir?\" <br>\r\n<i>Stupid thing to say,</i> she thought, scratching her pointy ear uncomfortably.</span></div></div>",
            "created":1262149200,
            "id":813140,
            "title":"Elith stands and confronts the footsteps."
        },
        "112":{
            "author_id":"runesayer",
            "author_name":"Runesayer",
            "choices":[
                "The voice of Shadduth..",
                "Protective, the hand became an arm which pulled her closer..",
                "Elith turns and \"Father\"?!..and faints dead-away.."
            ],
            "content":"<div class=\"\"><div> <span>Her decision made quickly, Elith slips in through the tavern door.  It was the smell that nearly gagged her, what it was made by, she could not tell.  But, what was better, facing the unknown, stealthy figure on the path outside, or dealing with this overwhelming stink?! <br>\r\n<br>\r\nElith was so, so tired. \"Since when do I jump at shadows?\", she wondered to herself.  \"And do I really care if it smells so badly in here?\"  She sensed, more than saw, someone entering the doorway just behind her.  She felt the grip of a strong hand and heard a deep, softly spoken voice say, \"So, little one, how very far you have strayed this eve'.   </span></div></div>",
            "created":1252904400,
            "id":760671,
            "title":"Elith quickly runs inside the tavern."
        },
        "12":{
            "author_id":"sensei",
            "author_name":"K T Ong",
            "choices":[
                "Elith decided to talk to the stranger.",
                "Elith hid in a shadow nearby, and the stranger went further and further away...",
                "Elith decided to do something to see how the stranger would react."
            ],
            "content":"<div class=\"\"><div> <span>She looked around. There were a few humans walking around in the distance. Would she approach one of them for help? She felt really too shy to approach any of them, yet it was difficult to see what other options she had. Her crystal wand had run out of magical power, so she could not conjure up even just a few berries to eat. Oh, what was she to do?<br>\r\n<br>\r\nThen Elith caught sight of an approaching stranger, who apparently did not notice her. Dressed in nothing from the waist up, the extraordinarily handsome, bearded and athletically built human had beautiful sapphire eyes and long, frost-white hair that draped down to his shoulders. It was hard to tell how old he was, but he was certainly no younger than thirty. He held a long staff in one hand, which seemed to be made of wood and had unusual writings carved into it all over. Somehow Elith felt a soft, reassuring warmth emanating from this man. It wasn't just the benign expression on the face, but something more. Perhaps something magical.</span></div></div>",
            "created":1251176400,
            "id":750103,
            "title":"The mysterious stranger"
        },
        "121":{
            "author_id":"moonmoth",
            "author_name":"MoonMoth",
            "choices":[
                " Elith tags after the stranger.",
                "Elith looks for a shop where she can buy food.",
                "Giving in to despair, Elith sits beside the path and bawls."
            ],
            "content":"<div class=\"\"><div> <span>Elith summoned what courage she could and stepped into the path as the handsome stranger passed.<br>\r\n<br>\r\n“Excuse me, Sir,” she said deferentially. <br>\r\n<br>\r\nThe man stopped and quickly raised his staff, holding it in both hands, close to his body, the left end below knee level and the other end, the one adorned with carved runes, at his shoulder. He blinked once, then his eyes focused on the bedraggled fairy in front of him. He appeared to realize she presented no threat and abandoned his defensive posture. He lowered the staff and Elith noticed the muscles in his arms and chest relax. At a future time, she would look back on this moment and realize it was the first time she ever appreciated a man as a man. Jerzy, the boy she had skipped school with, sure didn’t make her insides flutter this way!<br>\r\n<br>\r\nThe bearded man looked her up and down. Elith felt blood rush to her face and averted her eyes. “Yes?” He spoke softly, but his baritone voice seemed to carry on the night air. <br>\r\n<br>\r\n<i>Preacher</i>, thought Elith. <i>Trained to project his voice, to fill an entire amphitheater with his words</i>. But no … All the priests and preachers she knew were fat, useless slobs. “Sir …” For some reason, the words didn’t want to come. “Sir, I am lost. I don’t know anyone. Can you help me?”<br>\r\n<br>\r\nThe man’s expression softened, but not so much it could be called a smile. He looked at her, blinked again. “I cannot.” <i>A perfect bass voice for a perfect man</i>. “I must hurry on my way.” He extracted a coin from a drawstring purse attached to his belt. “Take this. It’s not much, but you can buy a meal, at least.”<br>\r\n<br>\r\nHe handed Elith a ten-pula coin and strode off without a backward glance.<br>\r\n</span></div></div>",
            "created":1251262800,
            "id":750467,
            "title":"Elith decided to talk to the stranger."
        },
        "1211":{
            "author_id":"sensei",
            "author_name":"K T Ong",
            "choices":[
                "Elith decides to follow Rufus.",
                "Elith politely refuses but asks for some alternative form of help."
            ],
            "content":"<div class=\"\"><div> <span>Elith was now almost desparate (though she could not be sure whether she was also attracted to the man). \"Pardon my extreme rudeness, sir...\" said Elith sheepishly.<br>\r\n<br>\r\nThe stranger stopped.<br>\r\n<br>\r\n\"But could you really offer no more help?\"<br>\r\n<br>\r\nThe stranger turned around and looked at Elith for a moment, tha same soft expression on his face.<br>\r\n<br>\r\n\"Look,\" he replied with the same rich baritone, \"why don't you come with me? I am rushing to meet my mentor. He's a VERY knowledgeable wizard. If there's anyone who can help you, it's got to be him.\"<br>\r\n<br>\r\nElith was silently relieved that this man did not brush her away in anger. \"Oh, you're a wizard's apprentice, then?\"<br>\r\n<br>\r\nThe stranger's face broke into a smile. \"Yes,\" he replied, \"but I'm also his adopted son. His name is MAGNUS. We live in a small keep in the forest just outside this city's walls. His knowledge of magic is amazing -- he managed to raise a tiger and a wolf into a semi-human state so they could now think, talk and walk upright like you and me, though they're still not fully human. The two beast-men -- my mentor prefers to call them 'Reasoners' -- now live with us in the keep. By the way, my name is RUFUS.\"<br>\r\n<br>\r\n\"But... you look more like a warrior to me, sir.\"<br>\r\n<br>\r\nRufus grinned broadly. \"My mentor didn't want me to take magic for granted, so he made me rearrange by hand all the giant tomes in our library every four days. It's hard work -- those spell books were really thick and heavy -- but I appreciate that he meant it to be for my benefit. And you can see that all the hard labor has paid off. Then there are also the two beast-men, who love to wrestle with me!\"<br>\r\n<br>\r\n\"So that's how you grew so strong,\" observed Elith, still admiring the apprentice's athletic figure.<br>\r\n<br>\r\n\"Yes,\" nodded Rufus. \"Well? Will you come with me? You must decide fast -- I haven't much time.\"<br>\r\n<br>\r\nShould she follow him? Certainly he looked the decent sort...</span></div></div>",
            "created":1251349200,
            "id":751076,
            "title":" Elith tags after the stranger."
        },
        "12111":{
            "author_id":"moonmoth",
            "author_name":"MoonMoth",
            "choices":[
                "Elith looks for a safe place in the forest to sleep.",
                "Elith decides to wait till Rufus pays attention to her again."
            ],
            "content":"<div class=\"\"><div> <span>Rufus strode off in the direction he had been heading when Elith stopped him, his muscular legs covering large amounts of ground in a small number of steps. She had to half-walk, half-run to keep up with him. They were getting out of the downtown area, into a mostly residential district. Foot traffic began to thin out, and street lamps were farther apart.<br>\r\n<br>\r\n“Rufus <i>Puff</i>,” asked Elith, “how far <i>Huff</i> outside the city walls <i>Puff</i> is your keep?”<br>\r\n<br>\r\n“A bit less than two millaria* to the north.”<br>\r\n<br>\r\n<i>To the north</i>? Elith was lost, sure, but wasn’t north … She stopped and checked the sky, wishing she had paid better attention when her instructors had explained how to navigate by the stars. <br>\r\n<br>\r\nRufus maintained his pace, getting farther and farther away, apparently not noticing Elith no longer ran by his side. With trepidation, she unfurled her wings and flew to within a few feet of him. Trepidation because she knew better than to fly in close proximity to structures, trees, or even people. Her diaphanous wings were so delicate, so fragile that the slightest bump or contact might shred them. <br>\r\n<br>\r\nCatching up to Rufus, she huffed, “Aren’t we going east?” <br>\r\n<br>\r\n“Yes.”<br>\r\n<br>\r\n“We’re not going to your keep, to see if Magnus can help me?”<br>\r\n<br>\r\n“Magnus and Lupus, the human wolf I mentioned, have been gone for several days searching for spikenard. I expected them home today, but Father sent word to meet him at the home of some friends near the Riparian River.” <br>\r\n<br>\r\nThankfully, Rufus chose that moment to stop. Elith was already exhausted when she encountered him and by now could barely keep up. “Let’s take a break,” he suggested. He didn’t have to ask Elith twice; she collapsed on the grass, after, of course, tucking her wings flat against her back.<br>\r\n<br>\r\n“We can’t tarry long,” said Rufus. “I don’t know what Father wants, but he would not send for me unless it was urgent.”<br>\r\n<br>\r\n<i>He’ll not be delayed on my account</i>. Feigning vigor she didn’t feel, Elith jumped to her feet. “I’m rested. Let’s go.”<br>\r\n<br>\r\n“Huh? Sure you’re ready?” asked Rufus.<br>\r\n<br>\r\n“Sure,” lied Elith. “Don’t you know fairies recover from exhaustion faster than humans? Why, we hardly need sleep at all.” If anything, the opposite was true. Fairies, especially female fairies, can fly only if they force themselves to remain thin nearly to the point of being emaciated. Save for the sinewy muscles in her back and shoulders that powered her wings, Elith carried virtually no muscle or fat on her frame, and thus lacked the endurance of even average humans.<br>\r\n<br>\r\n“Well, then.” Rufus gave her a nod of satisfaction and started off at the same pace. Elith stayed by his side, trying to ignore the ache in her legs and side. They were nearing the city gates now, and the forest beyond, so flying was out of the question. They had gone half a millarium or so into the forest when she heard the roar of the mighty Riparian River. The same river ran near her village. <i>Girl, if you had the brains of a rock, you woulda followed the river home</i>. Too late now; she couldn’t possibly manage a flight of any length as tired as she was.<br>\r\n<br>\r\nRufus noticed she lagged behind and called, “Almost there.”<br>\r\n<br>\r\nThey came to a clearing at the edge of the forest overlooking the river. A trim little cottage sat nestled against a slight rise. Several people stood outside the cottage, some with torches. A voice yelled, “Here comes Rufus.”<br>\r\n<br>\r\nPeople turned toward the man and the fairy, but nobody seemed to notice Elith. “Rufus,” said a man, “It’s Lorene. She’s dead. Murdered.”<br>\r\n<br>\r\nRufus’ face grew dark. He stared at the man for several seconds, almost as if he expected him to say he was kidding. With a growl deep in his throat, Rufus strode into the cottage.<br>\r\n<br>\r\n<i>A friend of Rufus was killed! He won’t have any time for me now. I can’t intrude on his grief. Maybe I better find a place to sleep till morning then fly home</i>. She took a deep breath. <i>But then I won’t see Rufus anymore</i>. <br>\r\n<br>\r\n*<font class=\"size1\" style=\"\"> A millarium is approximately nine-tenths of a mile, or about a kilometer-and-a-half</font>.<br>\r\n<br>\r\n</span></div></div>",
            "created":1251867600,
            "id":754249,
            "title":"Out Of The City - Into The Forest"
        },
        "121112":{
            "author_id":"sensei",
            "author_name":"K T Ong",
            "choices":[
                "Elith asks: Are you Magnus the mage, sir?",
                "Your take. :)"
            ],
            "content":"<div class=\"\"><div> <span>\"Lorene! <b>Lorene!</b>\" yelled Rufus, kneeling at the side of the girl's body. \"Oh, who could have done this?...\" Tears ran down Rufus' eyes profusely as he wept with grief, caressing the girl's head. The other men just stood nearby silently. Elith watched from several paces away, and she realized: <i>big men cry, too.</i><br>\r\n<br>\r\nWhat was she to do, now? She couldn't expect him to pay her much attention anymore. Then it occured to her: maybe she could help.<br>\r\n<br>\r\nDigging into her pocket, she took out a sachet of fairy dust. There was too little of it in this single sachet for it to be of use to her -- she needed at least two sachets to conjure up a meal and four to cast a spell that would bring her home -- so she thought she might as well try it on Rufus' dead friend to see if it could be of any help. Who knows, maybe it might exert a different effect on humans.<br>\r\n<br>\r\nElith went up real close to Rufus and the body, ignoring the other men as they muttered among themselves upon seeing her. \"Rufus, maybe I can help,\" said Elith.<br>\r\n<br>\r\n\"What?\" gasped Rufus.<br>\r\n<br>\r\n\"I'm actually not sure,\" explained Elith, \"but let's put it this way, you've nothing to lose.\"<br>\r\n<br>\r\nElith opened the sachet and emptied its contents over the body. Countless constellations of colorful twinkles spread all over it. The twinkling display lasted a while, and then...<br>\r\n<br>\r\nThe body began to move. The chest and belly went up and down as breathing resumed. At length the eyes fluttered, then opened.<br>\r\n<br>\r\n\"Ohhhh... What happened?\" muttered the girl.<br>\r\n<br>\r\n\"Lorene! <b>You're alive!</b>\" cried Rufus.<br>\r\n<br>\r\nJust then two figures approached. One was a tall, thin old man with a long white beard, dressed in robes with runes embroidered on them; the other was a half-wolf, half-man creature. \"Could someone tell me what's going on?\" asked the old man.</span></div></div>",
            "created":1251954000,
            "id":754887,
            "title":"Elith decides to wait till Rufus pays attention..."
        },
        "1211122":{
            "author_id":"moonmoth",
            "author_name":"MoonMoth",
            "choices":[
                "Elith agrees to accompany Rufus and Lorene.",
                "Elith declines the invitation."
            ],
            "content":"<div class=\"\"><div> <span>Rufus turned to the old man, his beaming face filled with awe and joy. “Father, this is Elith. She brought Lorene back to life.”<br>\r\n<br>\r\n“Shut up, you fool!” hissed the man. To the wolf-creature, he said, “Go outside and disperse the crowd. Tell them Rufus and I want to grieve in solitude.”<br>\r\n<br>\r\n<i>Who would believe that lycanthropic face could express surprise or dismay</i>? The wolf-creature managed it. “But ...”<br>\r\n<br>\r\n“Just do as I say,” ordered the man. He took a step toward the now-resuscitated  girl on the bed, shielding her from view of the rubberneckers peering in from outside. “And close that door on your way out.”<br>\r\n<br>\r\nWhen he had left, the man turned to Elith. “I'm Magnus. And you've really made a hash of things.”<br>\r\n<br>\r\nElith looked at Rufus. He looked back at her, his face reflecting the same confusion she felt. “Sir,” said the fairy, “I don't understand. I've brought this lady back to life.” Why would anyone be mad at her for reviving … “ A terrible thought flooded her brain. “You!” She pointed at Magnus, at the same time backing away from him. “You're the one. You killed Lorene.”<br>\r\n<br>\r\nLorene was trying to sit up. She gave up and propped herself on an elbow. “No, no, he didn't.” Rufus sat on the bed and helped her to a sitting position.<br>\r\n<br>\r\n“No, I didn't kill her,” snapped Magnus. <br>\r\n<br>\r\n“Father,” said Rufus, “Lorene is my cousin and your Goddaughter. Aren't you overjoyed to see her alive?”<br>\r\n<br>\r\n“Yes, I'm deliriously happy to see the color in her cheeks.” In a softer voice, he said to Lorene, “You'll have a pounding headache, my dear, but it'll go away in an hour or so.” He turned to Elith and his voice grew hard again. “My joy doesn't alter the fact that we have a <i>major</i> problem and -” He leveled an accusing finger at Elith “- It's <i>your</i> doing.”<br>\r\n<br>\r\nPoor Elith had no idea why this mage had turned his wrath on her. She'd performed a miracle. Hadn't she??<br>\r\n<br>\r\nMagnus lowered his finger and sighed. “You didn't know. Doesn't matter now. It's done and we have to deal with it.”<br>\r\n<br>\r\n<i>Deal with what</i>? She looked at Rufus and saw understanding begin to gleam in his face. <i>Wish I understood</i>.<br>\r\n<br>\r\nMagnus pointed to a chair and Elith obediently sat. The wizard pulled another chair close to her. “Do you think you're the first one to use fairy dust to revive a human? We – I mean, we senior wizards and the elite of the Fairy Parliament – Have known for hundreds of years the dust could return a recently deceased human to life. We've all taken a vow to keep that knowledge secret. The world must never learn what your pixie dust can do.”<br>\r\n<br>\r\nElith's head was swimming in a hundred different directions. “I … But why???”<br>\r\n<br>\r\n“I believe I understand,” said Rufus from the bed, where he still sat next to Lorene. “If humans knew what fairy dust could do, they'd never leave the fairies alone.”<br>\r\n<br>\r\n“Exactly,” agreed Magnus. “People would stop at nothing to get their hands on the stuff. They would rob, kill, torture, enslave, and do even worse to fairies. And after they obtained the precious powder, they'd try to take it from each other.”<br>\r\n<br>\r\nElith swallowed the lump rising in her throat. Magnus is right. The ingredients and process that went into fairy dust were a closely guarded secret. Fairy Parliament leaders doled it out, but there was never enough to fill the need. <i>No fairy would ever have a moment's peace or safety if word got out</i>. War would erupt between humans and fairies. A war the humans would surely win. If nothing else, their violent, selfish natures gave them a tremendous advantage over idyllic, peaceful fairies. <i>And then the humans will wage war against each other</i>.<br>\r\n<br>\r\nJust then the wolf-creature entered the hut. “All the mourners have gone home,” he told Magnus.” He seemed to notice Elith for the first time. “Well, hell-o-o-o, Sweetie. I'm Lupus.” <br>\r\n<br>\r\nOh, he was a wolf all right. His eyes roved up and down her slender body. She could <i>feel</i> him peel off her green, figure-hugging dress in his mind. She turned away uncomfortably. <i>Has to be tight and short. Who could fly with yards of material billowing around her</i>?? <br>\r\n<br>\r\n“Stow it, Lupus,” ordered Magnus sharply. “We've got more important things to discuss than your animal urges.” Lupus gave Elith one last leer, then tore his eyes away.<br>\r\n<br>\r\nMagnus moved his chair near the bed and took Lorene's hand. “My dear, I am so sorry, but you cannot stay here. No one must ever know of your resurrection. We'll hold a funeral and bury a dummy in your place.”<br>\r\n<br>\r\nLorene sat up. She looked around the room, at the solemn faces of Magnus, Rufus, Lupus, and Elith. <i>Did she scowl at me? Maybe she'd rather be dead</i>! “What am I to do?” asked Lorene.<br>\r\n<br>\r\n“You must go away,” said Magnus. “Now. Tonight.” He turned his attention to Rufus. “Take her to the farthermost  civilized place you can find. Far enough that no one from Magnous will ever run into her.”<br>\r\n<br>\r\nRufus nodded; he clearly did not consider balking or even questioning his Father. He did appear a bit uncertain about something though. He addressed his next words to Elith. “This may be a long, arduous journey. I'll have to keep Lorene out of sight and deal with whatever danger presents itself. I could use some help. Will you go with me?”<br>\r\n<br>\r\nElith stood transfixed in shock. <i>Go with him</i>? She had to get home, to her family, to school, to her life. <i>But it</i> is <i>my fault he has to undertake this trek</i>.<br>\r\n</span></div></div>",
            "created":1252558800,
            "id":758387,
            "title":"Unforeseen Consequences"
        },
        "12111222":{
            "author_id":"sensei",
            "author_name":"K T Ong",
            "choices":[
                "Your take. :)",
                "Your take. :)"
            ],
            "content":"<div class=\"\"><div> <span>\"I'd love to offer my help,\" answered Elith, \"but in my current condition I'd be more hindrance than help. All my magic is exhausted, and I've used up the last sachet of fairy dust I had to resurrect this lady.\"<br>\r\n<br>\r\n\"She's right, Rufus,\" said Magnus. \"I can sense that her power level is very low at present. No, I don't think it would be a good idea for her to follow you.\"<br>\r\n<br>\r\n\"Actually,\" interrupted Lupus, \"must Rufus and Lorene go? And so quickly? There are several very large underground caves deep beneath us here in this forest, which are totally unknown to the people of Magnous and the entrance to which is well-hidden in a small grove about half a day's walk from here. We discovered those caves a couple years back when quarrying for magical crystals. Don't you remember? Rufus and Lorene could hide in these caves for at least a few days or weeks while we consider other possible solutions.\"<br>\r\n<br>\r\nElith studied the werewolf quietly. <i>Incredible how intelligent a lycan can be,</i> she thought. <i>And discounting the monstrous features, this creature could actually be as good-looking as Rufus.</i> <br>\r\n<br>\r\n\"But of course!\" exclaimed the old wizard. \"How could I have forgotten that! Ah, the years must be taking their toll on my memory. For once you've shown to my satisfaction that my experiments on you haven't been in vain, Lupus! Yes, that's a good idea. All right, then, Rufus, you and Lorene will go hide in the caves. Lupus, you'll bring them to the entrance. I'll cast an invisibility spell on you all which should last long enough for all of you to reach the grove.<br>\r\n<br>\r\n\"But first,\" continued the mage, turning to Elith, \"I have yet to know why you followed Rufus here, fairy child. You could not have anticipated what would happen here, could you?\"<br>\r\n<br>\r\n\"I was lost,\" explained Elith. \"I couldn't find my way home. But I happened to meet this kind sir and I appealed to him for help, and he told me to follow him here as he's on his way to meet you and you'd be able to help me.\"<br>\r\n<br>\r\n\"I see,\" nodded Magnus. \"Well, I should be able to cast a spell to inform the Fairy Parliament of your presence here, so they may come and bring you home. The only trouble is that...\"</span></div></div>",
            "created":1255064400,
            "id":772790,
            "title":"Elith declines the invitation."
        },
        "121112221":{
            "author_id":"moonmoth",
            "author_name":"MoonMoth",
            "choices":[
                "Elith wakes refreshed and flies home. (The End??)",
                "Something prevents Elith from getting the rest she needs."
            ],
            "content":"<div class=\"\"><div> <span>“The only trouble is that contacting fairy council now, in the middle of the night, will alarm them,” said Magnus. “We don't want to call attention to this incident, and have people – Or fairies – Getting curious about what happened here tonight.”<br>\r\n<br>\r\n“What <i>did</i> happen here tonight?” asked Rufus. “Lorene, who assaulted you? And why?”<br>\r\n<br>\r\n“The Flaxem Brothers.”  <br>\r\n<br>\r\nLupus growled, a deep, vicious snarl that startled Elith. She spun around in momentary panic, but he was looking at Magnus.<br>\r\n<br>\r\n“Braxton and Burris,” Lupus appeared to be quaking with rage. “Master, I told you we should have dealt with them six months ago.” Another guttural growl. “Now they've crossed the line.”<br>\r\n<br>\r\n“I don't think they meant to hurt me,” said Lorene. “I had just returned home and hadn't lit a lamp yet. They came in – I didn't hear them because of the river - and started going through my things. I yelled, `Hey!' and ran toward them. Burris had one of my brass candlesticks in his hand and swung without thinking.” She rubbed the side of her face, at the temple and below the ear. “That's all I remember.”<br>\r\n<br>\r\n“Yeah, I bet he swung without thinking,” said Lupus, his voice a bit closer to normal. “He's never thought in his whole life.”<br>\r\n<br>\r\n“Father, we have to <i>do</i> something,” said Rufus earnestly. “Braxton and Burris have been bad news since they could walk. The next person they kill will <i>stay</i> dead.”<br>\r\n<br>\r\nElith watched this exchange in silence. <i>None of this is getting me home</i>. Rufus stood up and started pacing the floor, his fists clenching and unclenching, which had the effect of emphasizing the muscles in his arms. <i>Maybe staying here wouldn't be so bad</i>. But her parents … <i>They'll be frantic. I have to get a message to them, whether Magnus likes it or not</i>.<br>\r\n<br>\r\n“We <i>will</i> do something,” Magnus assured Rufus and Lupus. “But our priority is getting Lorene out of sight.” He looked at Elith. With a sigh, he said, “And, I suppose, getting you home.”<br>\r\n<br>\r\n“Sir, can you simply send a message to my village?” asked Elith. “I can fly home once I get a few hours sleep.”<br>\r\n<br>\r\nRufus came to an abrupt halt in his pacing. “Hey, I thought you said you don't need sleep.”<br>\r\n<br>\r\n“Uh ...” Elith felt her face flush red. “I … We … Don't need <i>much</i> sleep.” <br>\r\n<br>\r\nMagnus narrowed his eyes; he obviously knew better. Thankfully, he didn't pursue the matter, saying only, “A detailed message requires a lot of energy. Any wizard, or even a sensitive layman, in the area will know we communicated with the Fairy Parliament, and might wonder why.”<br>\r\n<br>\r\n<i>Nothing for it, then. I'll have to let them take me home</i>.<br>\r\n<br>\r\n“However,” continued Magnus, “sending <i>emotions</i> uses only a niggardly* pinch of magic. We can tell the Fairy Parliament, `All is well,' and hope they realize we're talking about you.”<br>\r\n<br>\r\n“Oh yes, please.” Elith felt herself smile for the first time since she realized she was lost. <i>Daddy's probably got every fairy in the village searching</i>. “They'll know it's me.” <br>\r\n<br>\r\n“See to it, Rufus,” Magnus said.<br>\r\n<br>\r\nRufus told Elith to stand next to him. “Sometimes the magic seems to reach out and copy the essence of anyone nearby. If that happens, it'll confirm you're safe.” He held his hands in front of his face and whispered something too low for Elith to hear. He raised, lowered, and extended his hands in a complex pattern. Elith felt … She felt something she didn't have words to describe. <i>Warm?? Not exactly. Mellow?? Sort of, but pumped up at the same time</i>.** The feeling fled, but Elith fancied she could sense an afterglow. <br>\r\n<br>\r\nRufus smiled somewhat sheepishly. “Senior Wizards, like Magnus, can communicate magically without all the gestures and theatrics.” <i>Is he apologizing to me</i>?<br>\r\n<br>\r\nLorene, apparently fully recovered, began packing clothes. “Slow down, my dear,” ordered Magnus. “Remember, everyone thinks you died tonight. Take one change of clothes and whatever money you have.”<br>\r\n<br>\r\n“My jewelry?” she asked. “Braxton and Burris didn't find it all.”<br>\r\n<br>\r\nMagnus frowned but before he could say anything, Lupus spoke up, “If any any one notices her valuables are gone, they'll assume the murderer took them.”<br>\r\n<br>\r\n“Good point,” agreed Magnus. “She may need to sell anything of value, if she is to start a new life somewhere else.” <br>\r\n<br>\r\nLorene finished packing, looking very sad. <i>She's leaving her life behind</i>.<br>\r\n<br>\r\n“Go now, quickly,” said Magnus to Lupus, Rufus, and Lorene. “Invisibility spell or not, it's best to get Lorene hidden before daybreak.”<br>\r\n<br>\r\nElith succeeded, barely, in holding back the tears welling in her eyes. She took Rufus' hand. “Thank you! If not for you, I'd still be sitting by the side of the road feeling sorry for myself.”<br>\r\n<br>\r\n“It's we who should be thanking you,” said Rufus. “You've returned our dear friend to us.”<br>\r\n<br>\r\n“Aye,” agreed Lupus. He almost allowed his eyes to crawl over Elith's body again, but seemed to catch himself and looked only at her face. “If you ever need anything – Anything at all – We'll be there for you.”<br>\r\n<br>\r\nAfter they left, Magnus yawned and slumped into a chair. “You may as well spend the night here.” <i>What if the Flaxem Brothers come back</i>? As if reading her mind, the wizard went on, “Don't worry; I'm staying too.” Sarcastically, he added, “Unlike fairies, old wizards need a full night's sleep.” <br>\r\n<br>\r\n* <font class=\"size1\" style=\"\">I refuse to let political correctness inhibit me from using an appropriately descriptive word</font>.<br>\r\n<br>\r\n** <font class=\"size1\" style=\"\">Perhaps Elith was searching for the word rapture</font>.<br>\r\n</span></div></div>",
            "created":1255842000,
            "id":777519,
            "title":"Sending A Message Home"
        },
        "1211122211":{
            "author_id":"sensei",
            "author_name":"K T Ong",
            "choices":[
                "Your take. :)",
                "Your take. :)"
            ],
            "content":"<div class=\"\"><div> <span>Rufus' embrace was tender; Elith loved every moment of it. Then she awoke. Oh, it was only a dream. A very pleasant dream.<br>\r\n<br>\r\nMagnus the mage was nearby and had changed to a new set of robes.\"I see you have awakened, fairy child,\" he remarked, smiling. \"Your kin have located you via our spells and opened a way home for you! Look!\"<br>\r\n<br>\r\nElith turned in the direction indicated by the mage and saw a magical portal in mid-air. Her home was right at the other side!<br>\r\n<br>\r\n\"I'm so glad I can finally return!\" cried an overjoyed Elith. \"Thank you so much, kind sir!\" Then she remembered something and looked around. \"Uhhhh, I don't suppose Rufus and Lorene are around? And... and the wolf man?\"<br>\r\n<br>\r\n\"You know by now that they've gone elsewhere, and why,\" replied Magnus. \"But never fear, I'm sure you can meet them again someday!\"<br>\r\n<br>\r\nElith smiled and nodded, then turned towards the portal. But just as she was about to step through it, she stopped.<br>\r\n<br>\r\n\"Yes, fairy child? What is it?\"<br>\r\n<br>\r\n\"Uhhhh... How would you like to come with me to our fairy village for a visit, kind sir?\" asked Elith. \"I'm sure my parents would love to have some tea with you!\"</span></div></div>",
            "created":1266469200,
            "id":838313,
            "title":"Time to go home!"
        },
        "13":{
            "author_id":"dotthetwo",
            "author_name":"dtothetwo",
            "choices":[
                "elith wakes up in a cage",
                "elith wakes up in a bed",
                "elith wakes up at home",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Elith decided she needed to find her way home, crying wasn't gonna do her any good, so she flew up as high as she could hoping to see her forest home beyond the huge sprawling city.<br>\r\n<br>\r\nThe tall grey buildings seemed to taunt her as they blocked her view of the surrounding landscape. Elith struggled against the cold wind that buffeted her young body. Flying higher and higher, climbing, climbing....Then a dark shape came screaming at her from the nightime sky! A monstrous bat!<br>\r\n<br>\r\nIn the forest bats could be eluded by flying into the hollows of a tree and Elith hoped with all her heart that the same rules would apply for buildings! She darted towards the nearest building looking for a way inside the seemingly impenetrable facade of stone.<br>\r\n<br>\r\nThe bat cut off her escape snapping viciously at her wings as it passed. Elith screamed with terror and sprinted blindly in the opposite direction. An open window and the beckoning wave of a human woman! salvation from the winged horror!<br>\r\n<br>\r\nElith flew into the warm air of the human dwelling and collapsed with exhaustion and terror onto a huge soft surface, the room spun wildly around her and then she swooned and knew no more.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1250485200,
            "id":745755,
            "title":"A monstrous bat"
        },
        "131":{
            "author_id":"dotthetwo",
            "author_name":"dtothetwo",
            "choices":[
                "The witch returns",
                "A house brownie rescues Elith",
                "Elith tries to escape"
            ],
            "content":"<div class=\"\"><div> <span>Elith opened her eyes and slowly the world came into focus... she was lying naked on a cold steel floor... with bars surrounding her... she was in a cage! elith jumped to her feet and ran to the bars looking outside she could see that her cage was on a dresser in a bedroom.<br>\r\n<br>\r\nThe room was red walled with black furnishings she saw a monstrous bed flanked by two end-tables, the window she had flown throught last night seeking salvations, a book-shelf stacked with thick volumes and two doors; one probably a closet and the other a possible escape route... the heavy window was closed now....<br>\r\n<br>\r\nA monstrous shriek from behind elith startled her and she spun to see another cage next to hers in this one was the monstrous bat from last night! A trap! She had been tricked and that meant that the human woman who had 'saved' her last night was really... a witch!<br>\r\n<br>\r\nElith threw herself back onto the cold steel of her prison and began weeping. How could she possible escape?</span></div></div>",
            "created":1250485200,
            "id":745759,
            "title":"Caged! Trapped! Tricked!"
        },
        "1311":{
            "author_id":"dotthetwo",
            "author_name":"dtothetwo",
            "choices":[
                "'But i could never do any of those things!'",
                "'I will become your slave for a year and a day... mistress...'",
                "'I will show you the location of the secret fairy city'"
            ],
            "content":"<div class=\"\"><div> <span>Elith was despondent the rest of the day she just stared at the monstrous bat so close to her and cried despairing. Why had she run away from her home? Why hadn't she just gone to school this morning and then none of this would have happened? How could it be that she had such a wonderful day with her love in the beautiful bog this morning and now was imprisoned by a witch awaiting what would surely be a horrible fate?<br>\r\n<br>\r\nHer fearful musings were interrupted finally by the bedroom door opening and the witch's return. She was short (by human standards) with long black hair and a rather large nose, she was dressed in black; slacks and a tight sweater that showed off her gorgeous figure.<br>\r\n<br>\r\n'Oh so my little prisoner is awake is she?' the witch said out loud in a smoky voice<br>\r\n<br>\r\n'Welcome to my humble home fairy. My name is Francine and I will be your doom! ha ha ha!' the witch seemed to take glee in the helplessness of her tiny captive <br>\r\n<br>\r\n'Please mighty sorceress release me! I beg of you! I am only a lost little girl who misses her mother so!' Elith cried trying to be brave despite her terror at her enormous jailer<br>\r\n<br>\r\n'And what would you do to earn your freedom pray-tell little one?' the witch mocked elith with a grin of sadistic satisfaction<br>\r\n<br>\r\n'Would you teach me the secret magicks of the fae? would you become my slave and familiar for a year and a day? Would you reveal to me the location of the hidden fairy city? what is it that you would do to earn your precious freedom?' <br>\r\n<br>\r\nthe witch seemed excited at each new prospect and now it was Elith's turn to speak but fear made her mouth suddenly dry... could she really do any of those horrible things? even if it meant being free again?</span></div></div>",
            "created":1250485200,
            "id":745768,
            "title":"The Witch"
        },
        "13111":{
            "author_id":"dotthetwo",
            "author_name":"dtothetwo",
            "choices":[
                "Francine cuts off Elith's wings",
                "Elith is rescued by house brownies"
            ],
            "content":"<div class=\"\"><div> <span>'Then my little pet, you will surely die!' Francine snarled sadisticly down on her tiny prisoner<br>\r\n<br>\r\n'But yours shall be a slow death... and a lingering one' her smile widened as she revelled in the prospect of the tortures she could inflict on such a tiny captive... the humiliations...<br>\r\n<br>\r\n'But first... your wings! ha ha ha ha ha!' the witch turned from the room and left elith in panic<br>\r\n<br>\r\nA fairies wings were the source of their magicks and without them she would be as no more than a common brownie! The though scared elith to her marrow... but the only alternative was to betray her people and this she could not do... she could not bear!<br>\r\n<br>\r\nThe witch returned and clenched in her hand was a pair of monstrous shears. They were made of blackened iron, stained with blood and inscribed with runes of powerful and dark magic.<br>\r\n<br>\r\nThe witch reached out with her other hand for the cage door and elith wished she had more magicks at her disposal, if only she had gone to school more often... a powerful fairy might have stood a chance against a witch at least a chance of escape... but no such prospect existed for ellis... only blind terror the urge to flee without the ability...<br>\r\n<br>\r\nThe cage door opened easily at the witch's touch and elith found herself in the human's grasp she pounded her tiny fists futily against the witch's enormous grip to no avail. The shears drew slowly nearer to her wings, Francine savouring the terror of her diminutive victim's plight. The shears opened Eliths wings were now within their sweep and then....<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1250485200,
            "id":745774,
            "title":"A fairy no more?"
        },
        "131111":{
            "author_id":"dotthetwo",
            "author_name":"dtothetwo",
            "choices":[
                "Francine returns",
                "Elith is rescued by a house brownie"
            ],
            "content":"<div class=\"\"><div> <span>snip<br>\r\n<br>\r\nwith that tiny sound eliths life changed forever. she saw her wings go fluttering down to the carpeted floor of francines bedroom. then she felt the warm wetness of her own blood running down her back. elith felt a horrible numbness in her soul she felt her lowly magics slip from her body fading like a good dream in the moirning light only to be replaced by the horrible reality of the nightmare she now found herself in<br>\r\n<br>\r\nelith felt no pain as francine casually tossed her back to the cold steel of her prison. she was limp and motionless. aware of francine collecting her wings and skippy gayly from the room with them but not watching the perverted display of glee at her mutilation.<br>\r\n<br>\r\nfor a few hours elith was left alone to suffer in misery to brood on her past life and realize that all that lay ahead of her was misery and pain and then hopefully the cold release of deaths embrace.</span></div></div>",
            "created":1250485200,
            "id":745780,
            "title":"Snip"
        },
        "1311112":{
            "author_id":"dotthetwo",
            "author_name":"dtothetwo",
            "choices":[
                "Elith chooses to live",
                "Elith waits for death"
            ],
            "content":"<div class=\"\"><div> <span>'wake up fairy' ellis was aware of a soft male voice coming from outside the cage<br>\r\n<br>\r\n'oh please won't you wake up' the voice seemed to be growing panicky<br>\r\n<br>\r\n'i've come to rescue you from the witch. won't you please wake up.' rescue? what was the point? she was already a cripple now. death would make her suffering end. rescue could only prolong it.<br>\r\n<br>\r\n'i can't open the lock alone'<br>\r\n<br>\r\n'i need you to get up'<br>\r\n<br>\r\n'i need to help you now' his voice seemed so desperate... so hurt...</span></div></div>",
            "created":1250485200,
            "id":745790,
            "title":"To be or not to be?"
        },
        "13111121":{
            "author_id":"dotthetwo",
            "author_name":"dtothetwo",
            "choices":[
                "Chase scene",
                "Fight scene"
            ],
            "content":"<div class=\"\"><div> <span>Ellis stood.<br>\r\n<br>\r\nOutside the cage she saw a house brownie fiddling with the lock. He was dressed in a long brown tunic, brown boots and clipped to his belt was a pin and a large button. ellis found his appearance ridiculous for a moment and giggled at him standing there. but then she realized that her nice yellow dress had been taken from her and she now stood before this man naked and caked in her own blood.<br>\r\n<br>\r\n'Oh thank goodness!' the young brownie said as Ellis stood his eyes lit up as he saw her standing<br>\r\n<br>\r\n'Help me here would you? just pull on this here, i can't seem to get it by myself.' He was pulling desperately on a safety pin that seemed to be wedged into the tiny lock sealing the cage shut.<br>\r\n<br>\r\nEllis walked over and took the pin in both hands she pulled hard. harder! as hard as she could!<br>\r\n<br>\r\nclick<br>\r\n<br>\r\nEllis fell backwards onto her butt and the cage door slowly swung open. Freedom! Ellis's heart lighted up at the though!<br>\r\n<br>\r\nThen a horrible screeching from behind her! the bat! it was awake!</span></div></div>",
            "created":1250485200,
            "id":745795,
            "title":"A new friend"
        },
        "131111211":{
            "author_id":"dotthetwo",
            "author_name":"dtothetwo",
            "choices":[
                "Francine captures them both",
                "They escape"
            ],
            "content":"<div class=\"\"><div> <span>'Run!' the young brownie cried<br>\r\n<br>\r\nHe grabbed ellis's hand and pulled her to her feet then turned and sprinted towards the edge of the dresser. Ells could hear the horrible sound of the bats wings flapping directly behind her<br>\r\n<br>\r\nThe brownie jumped and ellis jumped with him as ellis fell she felt a claw scrape her shoulder painfully, that was a close one! Ellis stopped in mid-air as the Brownie clung to a line of thred anchored to the top of the dresser by another safety pin.<br>\r\n<br>\r\nShe wrapped her legs around the thread and slid down to the floor. followed closely by her rescuer.<br>\r\n<br>\r\n'Filthy thing that bat. I'm Calvin.' The Brownie said with a half grin as he extended his hand. He was rather good-looking... though not traditionally handsome... messy dirty blond hair and light blue eyes....<br>\r\n<br>\r\n'Ellis' she said taking his rough hand in hers.<br>\r\n<br>\r\nHe opened his mouth to speak again but then his eyes widened in terror<br>\r\n<br>\r\n'Francine!'</span></div></div>",
            "created":1250485200,
            "id":745797,
            "title":"Chase scene"
        },
        "1311112111":{
            "author_id":"dotthetwo",
            "author_name":"dtothetwo",
            "choices":[
                "francine punishes them",
                "calvin has reinforcements"
            ],
            "content":"<div class=\"\"><div> <span>the door to the room burst open and in sprung the huge witch! she seemed impossibly nimble for a being of her size to tiny ellis who was unused to dealing with humans or even elves for that matter<br>\r\n<br>\r\nfrancine was now wearing only a tight black-silken slip and as she sprung into the room one giant bare foot stomped down onto calvin before he could turn to flee<br>\r\n<br>\r\nEllis cried out in panic afraid that her rescuer had been crushed to death, reduced to nothing more than a bloody footprint under the enormous sole of her evil jailer. but his legs continued kicking, he was alive!<br>\r\n<br>\r\nthe smile quickly disappeared from ellis' face as a dainty, gut gigantic, hand closed around her waist<br>\r\n<br>\r\nshe had been captured! again!<br>\r\n<br>\r\n</span></div></div>",
            "created":1270434660,
            "id":862219,
            "title":"Francine captures them both"
        },
        "13111121111":{
            "author_id":"dotthetwo",
            "author_name":"dtothetwo",
            "choices":[
                "francine sits on ellis",
                "ellis and calvin are rescued"
            ],
            "content":"<div class=\"\"><div> <span>'you silly bitch!' francine yells into her tiny captives face as she stands up to her full imposing height<br>\r\n<br>\r\n'let her go you witch!' calvin yells from underneath her giant pedicured sole still struggling futily to push her awesome weight from atop himself<br>\r\n<br>\r\n'shut up scum! you're exactly where you belong now!' francine snarls at her tiny captive<br>\r\n<br>\r\n'under my perfect...' she grinds her massive sole down across calvins tiny body forcing the air from his small lungs<br>\r\n<br>\r\n'pedicured...' she twists her foot again smiling at the power she has over the pathetic would-be hero<br>\r\n<br>\r\n'toes! hahaha!' calvin slumps and seems to pass out with the final application of immense pressure of the evil enchantress<br>\r\n<br>\r\n'now what to do with you my sweet?' francine muses as she turns her attention back to the diminutive wingless fairy still held firmly in her strong grasp</span></div></div>",
            "created":1270435020,
            "id":862221,
            "title":"francine punishes them"
        },
        "131111211111":{
            "author_id":"dotthetwo",
            "author_name":"dtothetwo",
            "choices":[
                "trapped under francines ass",
                "rescued"
            ],
            "content":"<div class=\"\"><div> <span>'oh i know just the perfect place for you' she says with a sinister smile<br>\r\n<br>\r\n'the perfect place for you to appreciate just how powerful i am' francine begins walking slowly towards her huge bed, leaving calvins lifeless body on the floor behind her<br>\r\n<br>\r\n'and the perfect place for you to learn just who the boss is around here!' with that she throws ellis down on her bed and turns around arching her back she displays her tight firm butt to the tiny girl<br>\r\n<br>\r\n'under my perfect ass! hahaha'<br>\r\n<br>\r\nellis stared up at the giant shapely butt overtop of her in disbelief, how had things come to this? how could things change so quickly in the course of just a few days? seemingly hours!<br>\r\n<br>\r\nshe had gone from a happy, if somewhat unfocused fairy to the plaything of a sadistic sorceress about to be smothered under her ass just for her own evil amusement<br>\r\n<br>\r\n'here it comes little fairy' frincine teased swaying her hips and grinning wickedly<br>\r\n<br>\r\n'you'd better get ready! hahaha' she slowly began lowering her ass onto the helpless form of her tiny captive<br>\r\n<br>\r\n'ready to die!' she said standing back up suddenly and then dropping all of her weight down with frightening speed<br>\r\n<br>\r\nellis finds herself...<br>\r\n<br>\r\n <br>\r\n<br>\r\n</span></div></div>",
            "created":1270435440,
            "id":862227,
            "title":"francine sits on ellis"
        },
        "1311112112":{
            "author_id":"sensei",
            "author_name":"K T Ong",
            "choices":[
                "Elith and Calvin turn down the offer.",
                "Elith and Calvin accept the offer."
            ],
            "content":"<div class=\"\"><div> <span>The witch shrieked with rage upon seeing the two outside of the cage. Calvin was wondering what to do when he eyed the legs of the dresser nearby. Mustering all the strength a Brownie could, he grabbed the legs and pulled. The dresser tipped over, crashing into the witch.<br>\r\n<br>\r\n\"Now! Hurry!\" cried Calvin as he grabbed Elith by the hand and they ran through the still open door, down the stairs, through an open window and out into the streets. They ran as fast as they could, rounding several corners. After what seemed an eternity, they paused for a moment to catch their breath. Apparently the witch had lost them, for they heard no pursuing footsteps.<br>\r\n<br>\r\n\"Looks like the bitch lost us. We can relax a little now, Elith,\" said Calvin, still panting.<br>\r\n<br>\r\n\"But my wings...\" sobbed Elith.<br>\r\n<br>\r\nThen they noticed an approaching stranger, a handsome, bearded and athletically built human. Wearing nothing from the waist up, he held a long wooden staff in one hand. He had long, white hair, and could be anywhere between thirty and fifty. Somehow there was something warm and reassuring about this person -- something like the kind of feeling one had when one was in the cold and approached a great, warm fire. Was he perhaps a mage? A priest? A healer? Elith wondered if evil men could use magic to disguise themselves as good people, and if this man was a case in point. Then again, it was difficult to see how this man could in fact be evil, for he seemed so... benign...<br>\r\n<br>\r\nThen the man stopped. He had seen them!<br>\r\n<br>\r\nThe man noticed the bloodstains on Elith's body. \"Greetings. I'm RUFUS. You look like you're injured. May I help?\"</span></div></div>",
            "created":1251262800,
            "id":750489,
            "title":"They escape"
        },
        "13111121122":{
            "choices":[
                "Go with him willingly.",
                "Question him further."
            ],
            "content":"<div class=\"\"><div> <span>The way that he spoke to you made you trust him. His demeanor, his apperance, everything about him radiated good. \"Yes, Rufus, thank you for noticing such small creatures such as us. As you have noticed, the evil witch has taken my wings from me. Can you help us?\"<br>\r\n<br>\r\n\"Yes, my little one, I can. Though I cannot tell you who, or what, I am, I promise that I am your friend. Come let me take you home, to heal and help you home.\"<br>\r\n<br>\r\nYou were stunned. How did he know you were trying to get home. He was obviously powerful, no matter what he was. Now, you could either go with him willingly, or question him further. </span></div></div>",
            "created":1265864400,
            "id":834735,
            "title":"Elith and Calvin Accept the Offer."
        },
        "131111211222":{
            "author_id":"sensei",
            "author_name":"K T Ong",
            "choices":[
                "FIGHT!",
                "Your take. :)"
            ],
            "content":"<div class=\"\"><div> <span>\"Uhhhh...\" muttered Calvin, \"we don't mean to be rude, kind sir, but... But we really have no way of knowing who you might actually be. For all we know, you could be a wolf in sheep's clothing...\"<br>\r\n<br>\r\nThe stranger smiled. \"I fully understand your misgivings,\" he nodded, the voice rich and mellow as honey. \"Look, if you do not trust me, perhaps I can instead --\"<br>\r\n<br>\r\nAt that moment a shrieking noise came from behind Elith and Calvin, who quickly recognized the sound. <i>It was Francine!</i><br>\r\n<br>\r\n\"Ah! I've found you at last!\" cried the witch. \"<i>Now you shall all return with me!</i>\"<br>\r\n<br>\r\n\"Sorry, madam,\" said the stranger to Francine in a firm though still civil voice as he stepped forward, the benign smile gone from his face. \"I do think you've gone a bit far in abusing these poor creatures. It would be greatly appreciated if you would be so kind as to leave these two alone. They have suffered enough at your hands.\"<br>\r\n<br>\r\n\"Rufus,\" hissed the witch, \"I'm warning you. Stay out of my affairs. Frankly, I'm getting sick of all your do-gooding.\"<br>\r\n<br>\r\n\"I merely wish to see the innocent being left unhurt,\" replied the stranger.<br>\r\n<br>\r\n\"<i>This is it, Rufus!</i>\" screamed the witch, face contorted with rage as she raised her hands, scarlet lightning crackling between them. \"<i>Now you shall taste the wrath of an <span class=\"cred\">Initiate of the Dark Sisterhood</span>!</i>\"<br>\r\n<br>\r\n\"A pleasure,\" said the stranger almost nonchalently as he rubbed a hand across the full length of his staff and a bright golden aura surrounded him, the staff now glowing like a rod of light. Calvin and Elith gazed on in speechless wonder.<br>\r\n<br>\r\n\"Get behind me, little ones!\" he instructed Calvin and Elith.</span></div></div>",
            "created":1266382800,
            "id":838219,
            "title":"Confrontation"
        },
        "1311112112221":{
            "choices":[
                "Leave with him.",
                "Ask what happened to the witch."
            ],
            "content":"<div class=\"\"><div> <span>The aura surrounding him got larger as he continued to rub his staff. You could see the determination and strength in his old muscles, and you could tell that he was a force to be reconned with. The witch, on the other hand, was beginning to get frightened. You could tell that these two had met each other in a fight before, and Rufus had most definately won. <br>\r\n<br>\r\nThe witch attempted to strike a magic blow at Rufus, but it was deflected with ease. Now absolutely petrified, the witch stumbled backward, and begged for Rufus' forgiveness. She promised never to do any creatures harm again, but Rufus knew better than to believe her. All he did was point his staff parallel to the ground at her, and the witch was gone. <br>\r\n<br>\r\nHe turned to you and said, \"No one has to worry about the witch hurting anyone any longer.\" <br>\r\n<br>\r\nAwed by his power, you now believe that he was truly good, and you could go along with him without any fear. You were lucky to meet a man such as this one.</span></div></div>",
            "created":1266642000,
            "id":839663,
            "title":"FIGHT!"
        },
        "13111121122212":{
            "author_id":"sensei",
            "author_name":"K T Ong",
            "choices":[
                "Your take. :)",
                "Your take. :)"
            ],
            "content":"<div class=\"\"><div> <span>Elith took a while to recover from her astonishment. \"Uhhhh... What have you done to the witch? Did you kill her? Just thought I'd like to know.\"<br>\r\n<br>\r\nSomehow Rufus seemed weaker, seemed to stagger a little, though the aura of goodness still radiated from him. Did the battle weaken him?<br>\r\n<br>\r\n\"I did not kill her,\" he answered. \"I merely threw her into the <i><span class=\"cblue\">Aleph</span></i>, a very special place which is very difficult to leave once you enter it and where casting spells is far more difficult than here in our world. She should be trapped there indefinitely, I believe. But I had to use virtually all the magical power I had to banish her. She wasn't entirely an easy foe...\"<br>\r\n<br>\r\nRufus gasped a little, like a man who had been running a long distance.<br>\r\n<br>\r\n\"You all right, sir?\" asked Calvin.<br>\r\n<br>\r\n\"I'm weak now,\" replied the stranger, \"but I should be fine again after a good night's rest. So, then, will you two come with me to my residence? You clearly need help, and I'd love some company, too.\"<br>\r\n<br>\r\nCalvin and Elith looked at each other. Calvin nodded.<br>\r\n<br>\r\n\"Okay, we will,\" said Calvin and Elith happily.<br>\r\n<br>\r\n\"Good! Come with me --\"<br>\r\n<br>\r\nSuddenly Rufus stumbled and presently went onto his knees, breathing hard. Cold sweat was all over his face and body, and he was trembling a little.<br>\r\n<br>\r\n\"<i>Are you all right, sir?</i>\" asked Elith.</span></div></div>",
            "created":1266814800,
            "id":840786,
            "title":"What happened to the witch"
        },
        "131111211222121":{
            "choices":[
                "Wake up in the middle of the night.",
                "Sleep through until morning."
            ],
            "content":"<div class=\"\"><div> <span>You run over to him, and saw that he is unconsious. You wonder what to do, and in a panic, you run over the nearest building and run inside, going to ask for help.<br>\r\n<br>\r\nYou encounter a friendly shop person, who owns the store you entered. A kind, chubby man, he was very concerned when he saw your friend laying on the ground. He offered you a spot in his humble abode, a small flat above his store. Over the past hour, you have learned that strangers can be helpful, so you accept his help. <br>\r\n<br>\r\nMaking sure the old man was comfortable, you close your eyes and hope for a better day tomorrow than you had today.</span></div></div>",
            "created":1266814800,
            "id":840917,
            "title":"The Kind Shopowner"
        },
        "13112":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "Francine takes Elith into her bedroom",
                "Francine wants to play \"Cat & mouse\" with her (Francine changes into a cat) "
            ],
            "content":"<div class=\"\"><div> <span>Francine grinned wickedly as Elith voiced her choice of how to earn her freedom in  small, trembling voice. <br>\r\n<br>\r\n\"I don't know the secret magicks of the fae, and I don't know my way to the hidden fairy city from here. So all I can do to earn my freedom is I will become your slave for a year and a day... mistress...\"<br>\r\n<br>\r\n'Then my little pet, you are mine eternally!' Francine laughed at her tiny prisoner<br>\r\n<br>\r\n\"But...I agreed to belong to you for a year and a day!\" Elith shouted.<br>\r\n <br>\r\nFrancine's smile widened as she revelled in the prospect of the tortures she could inflict on such a tiny captive... the humiliations...<br>\r\n<br>\r\nI never said to what year and day you were to be mine, little one! But first... your wings! ha ha ha ha ha!\" the witch turned from the room and left Elith in panic<br>\r\n<br>\r\nA fairy's wings were the source of their magicks and without them she would be as no more than a common brownie! The though scared Elith to her marrow. Would the witch cut them off? But the only alternative was to betray her people and this she could not do... she could not bear!<br>\r\n<br>\r\nElith jumped as the door opened and Francine walked back in, the fairy's reaction ammusing the witch, who reached out for the cage door and Elith wished she had more magicks at her disposal, if only she had gone to school more often... a powerful fairy might have stood a chance against a witch at least a chance of escape... but no such prospect existed for Elith... only blind terror the urge to flee without the ability...<br>\r\n<br>\r\nThe cage door opened easily at the witch's touch and Elith found herself in the human's grasp she pounded her tiny fists futily against the witch's enormous grip to no avail.<br>\r\n<br>\r\nElith waited for the pain as her wings were cut off, however it never came. She opened her eyed as her new misress turning her over in her hand and saw the witch bring her other hand over the young fairy's back and muttered a spell. Elith watched as glowing neon green ruins came from Francine's fingertips and float down and land on her back, going down the langth of Elith's spine from between her shoulders to her waist.<br>\r\n<br>\r\nElith screamed as her back rippled like water and her wings sunk into her back until they were compleatly gone.<br>\r\n<br>\r\n\"There. Now you're still a fairy, but if you want your wings back, I have to undo my spell and that means you're mine!\" Francine smirked.<br>\r\n<br>\r\nElith's heart sank. This wasn't as bad as her wings being removed...it was worse. A wingless fairy that was still a fairy. Now Elith HAD to belong to Francine for as long as the witch wanted to keep her.<br>\r\n<br>\r\n\"So little one, ready for your first experince as my property?\" Francine laughed.<br>\r\n<br>\r\n</span></div></div>",
            "created":1270465260,
            "id":862451,
            "title":"Elith enslaved"
        },
        "1312":{
            "author_id":"teasha",
            "author_name":"r3b3l",
            "choices":[
                "the witch returns ",
                "back in the woods",
                "back home"
            ],
            "content":"<div class=\"\"><div> <span>\"shhh she'll hear you!\"<br>\r\n<br>\r\nElith blinked in surprise at the squeaky voice. Her body tense she waited as the tiny patter of footsteps grew louder. The shadow stretched across the floor. She cowered further in the cage in response. Then, suddenly she was laughing.<br>\r\n<br>\r\nThe creature was barely three feet tall and covered in thick ur rom its head to its feet. Its glare silenced her and she watched anxiously as he looked around. <br>\r\n<br>\r\nScampering quickly across the floor, it jingled with each step. She was elated to see a ring of keys held tightly in its grip. Holding her breath, she watched as it tried several keys, inally inding the one that fit. With an audible snick, the lock turned and the door opened. <br>\r\n</span></div></div>",
            "created":1261544400,
            "id":810234,
            "title":"A house brownie rescues Elith"
        },
        "1313":{
            "author_id":"therandom",
            "author_name":"The Random",
            "choices":[
                "“No Way!”",
                "“Will my wings grow back?”",
                "“I may know some secret magic…”"
            ],
            "content":"<div class=\"\"><div> <span>Elith looked desperately around for a way to escape. Her eyes came to the little door on the cage. She ran to it only to see a lock. “Okay, maybe I can get rid of it…” Elith muttered as she tried to call upon her magic, but nothing happened. The witch she’d been captured by was too smart to let anything to chance. “Oh come on!” Elith shouted frantically grabbing two bars of the door and rattling it.<br>\r\n<br>\r\nThe bat shrieked loudly, as though screaming in annoyance or to warn someone.<br>\r\n<br>\r\n“Vladdy, stop that. You’ll wake our guest.” A fair female voice said sternly yet quietly as one of the doors opened. Obviously this was the witch, but she didn’t look like one. She stood taller than most women with long red hair and brilliant green eyes, and was quite beautiful. “Oh, I see she’s already awake. Hello little fairy. Sorry about Vlad, he likes to make noise a lot.” The witch said brightly at a normal volume.<br>\r\n<br>\r\nElith backed away from the cage wall, “K-keep away from me witch!” she cried.<br>\r\n<br>\r\n“Aw there’s no need for that. I may be a witch but that doesn’t mean I’m evil.” The witched, named Sarah, said calmly. Though she was upset this little fairy thought she was not a good person, Sarah found the little fairy quite cute. She unlocked the cage door and grabbed Elith, not roughly but still in a firm grip to keep the little fairy from escaping, “Well little fairy, I need some help. I either need some fairy wings for my youth potion, or I need to learn some secret fairy magic so I can up-show my cousin Esmeralda. What do you say?”<br>\r\n<br>\r\nElith replies…<br>\r\n</span></div></div>",
            "created":1278003120,
            "id":909758,
            "title":"Elith tries to escape"
        },
        "14":{
            "author_id":"spencer-gorman",
            "author_name":"Draconicon",
            "choices":[
                "take the paved path",
                "take the unpaved path",
                "wait for a better idea"
            ],
            "content":"<div class=\"\"><div> <span>Elith eventually realized that she would have to find her way home, without help, all alone. A few minutes thought made her realized that the best method for trying to get home would be by air. Although her wings pained her greatly, she stood, jumped off of her feet...<br>\r\n<br>\r\nand crashed to the ground, screaming in pain. Not only were her wings sore from the flight, they had torn at some point as well. There was no possible way of getting home by flight now.<br>\r\n<br>\r\nShe looked around and eventually saw two paths, one paved, the other not. does she</span></div></div>",
            "created":1191214800,
            "id":449358,
            "title":"A Way Home"
        },
        "141":{
            "choices":[
                "Sleep in the cave",
                "Sleep in the tree",
                "Keep walkig"
            ],
            "content":"<div class=\"\"><div> <span>Elith followed the paved path for a long while. She got very tired, but knew she had to keep going. Elith passed many houses and buildings. Soon, the buildings thinned and she was alone on the long, lonely path. The path took Elith out of town and into the wild. Elith was very tired, and thought she had to find a place to rest soon. She sees a cave up ahead. It looks big, and somewhat scary. Going a little further, she sees a big tree to climb. Where should she sleep? </span></div></div>",
            "created":1253854800,
            "id":765764,
            "title":"take the paved path"
        },
        "142":{
            "author_id":"sandy1219",
            "author_name":"Sandy~HopeWhisperer",
            "choices":[
                "Owl latches on to Elith and flies off with her screaming.",
                "The owl falls to the ground fatally wounded by a silver pointed arrow.",
                "With a thud a beast with a face half human, half tiger shields Elith from the ow"
            ],
            "content":"<div class=\"\"><div> <span>Elith liked the feel of the soft earth on her bare feet. Maybe walking wouldn't be so bad after all. Her wings ached and the rest from flying would be good for them. Now if she only knew her way around on the ground like she did in the sky.<br>\r\n<br>\r\nFunny how different things looked from this viewpoint. The trees seemed so much bigger and there were all kinds of animals and insects scurrying around she never noticed from her usual lofty view.<br>\r\n<br>\r\nAn owl had spied Elith and knew her wings were torn. A perfect target, a scrumptious, tasty meal awaiting. The owl swooped down talons outstretched.</span></div></div>",
            "created":1227934800,
            "id":613274,
            "title":"take the unpaved path"
        },
        "1422":{
            "choices":[
                "Elith wakes up in an unkown house",
                "Elith is woken by someone calling her name",
                "Elith wakes up in her bed"
            ],
            "content":"<div class=\"\"><div> <span>Elith stared horrified at the big and scary owl that was coming towards her. She screamed and ran into the woods, out of the unpaved path. She looked back in the middle of her escape and saw the owl chasing after her. It was so close, so close, she could almost feel the soft wind at her back created by the aggressive movement of the great wings. If that wasn't enough, there was that creepy stare burning the back of her head. The owl closed and stretched its talons, making a soft clicking noise.<br>\r\n<br>\r\nElith looked back once more but it was a big mistake as she tripped with a rock and fall down, hitting her head. She stood up shaking, and fell down once again to her knees. She could feel the numbness spreading to her body, and as her eyes started to see black, she saw something shiny passing right through the owl's chest. It was a silver arrow. <br>\r\n<br>\r\nShe cursed the fact that she would faint and hit the ground again before blackness took over.</span></div></div>",
            "created":1266901080,
            "id":841158,
            "title":"The owl falls to the ground fatally wounded by ..."
        },
        "1423":{
            "author_id":"trytothink",
            "author_name":"Nathaniel Hammel",
            "choices":[
                "She awoke to the Reasoner ...",
                "The Reasoner took Elith to his home",
                "The story of the Reasoner"
            ],
            "content":"<div class=\"\"><div> <span>The owl was big and it scared Elith.  You could hear its hiss through the trees.  With the sun going down in the distance, it was hard to see the owls attack.  SWOOOOSH, wings feathered against her tiny shoulder and Elith was knocked over, landing hard, almost face first, thus causing her ripped wind to tear a little more than it was.<br>\r\n  <br>\r\n  \"AHHHH!\" She screeched, and the owl echoed something that sounded like a laugh, as he swooped for her again.  Elith, arms frantically moving, hands and fingers trying desperately to grab at anything stable, but no, too late.  The Owl hit hard against her tiny form again, again, and again.  Elith's lungs were heaving almost breathless, her mind stopped thinking, and she couldn't scream.  She realized that the giant owl was playing with her, taunting her, and was doing a good job of keeping her from going anywhere.<br>\r\n<br>\r\nTears blotted her face; she could hear the owl leaping from tree to tree around her hiss-laughing in a teasing manner.<br>\r\n<br>\r\n\"You should have never come here dear\" The owl said from the shadows!  <br>\r\n<br>\r\nElith managed to move her head which hurt much.  She tried to see the owl, but had no success.  The owl could see her.  Owls are known to see better in the dark then day, and that was his advantage.  As Elith was trying to get up for an escape, the owl would not let her.  He flew out of the corner of Elith's eye.  Sharp claws dug through the garment of her shirt and dug in her back.  Elith felt herself being pulled from the ground.<br>\r\n<br>\r\n\"Nooooooooo!\" Elith screamed.  She wasn't going to let this beast take her so easy. A hidden dagger at her belt was now in her hand and she swiped it upwards stabbing the wing of the owl.  The minute knife was no use braking upon impact, but it was enough to make him let go with a hiss of pain. To Elith, was more agony then she realized, because she fell at least 6 feet. Lucky for her she landed upon soft wet ground.  The owl was mad, angered at the pain he felt, and before Elith had any other chance at defense, attacked again with blinding speed.  Elith only had time to close her eyes.  Even though time was going by like it does all the time, to her, was now slow, for her life was about to end.  She could see the owl in her mind coming toward her.  Anytime now it would all be over, and so she feel to her knees to wait the end.<br>\r\n<br>\r\nA crack of bushes, and an unknown growl from behind Elith was made.  The growl was so load and intimidating that Elith from fear, sprawled to the ground without opining here eyes.  She was too afraid to.  'Did the owl miss her?  What was that mean sound?'<br>\r\n<br>\r\n'Hisssssssssssssssss!'<br>\r\n<br>\r\nGeeeeerrrraahhhh!\"  Bushes were being torn apart.  The owl and the interrupter of Elith's death continued to wreck the air and the habitat around.  The yelps and growls from both intruders where terrifying to Elith, and she refused to look.  Then only silence lit the night.<br>\r\n<br>\r\n\"Are you all right?\" A menacing voice brawled from above Elith's tiny form, huddled knees to chest. \"You are ok now young one.\"<br>\r\n<br>\r\nElith opened her eyes, and the beast was revealed.<br>\r\n<br>\r\n\"Are you ok?\" the beast repeated.<br>\r\n<br>\r\n\"umskiiw\" was all she could muster as she shied away scared of the massive beast that had the body of a human and a head of something she never had seen before.<br>\r\n<br>\r\n\"W-w-what are you?\"  She managed to ask, tears still running down her cheeks.<br>\r\n<br>\r\n\"I am” he paused” I am a Reasoner.  I am half human, half tiger.<br>\r\n<br>\r\nElith tried to get up but pain bolted though her body and she passed out. As she slipped into unconsciousness, she could feel the image of the beast-man's strong pawed hands lift her up, and that was it.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1239598800,
            "id":675070,
            "title":"The Beast-Man"
        },
        "14233":{
            "author_id":"sensei",
            "author_name":"K T Ong",
            "choices":[
                "Elith awakens.",
                "The two Reasoners place the unconscious Elith in a bed and treat her wounds."
            ],
            "content":"<div class=\"\"><div> <span>Tigra was called a Reasoner because he was originally just a tiger but acquired the gift of human reasoning and intelligence after being experimented on by a mage. The mage was an old man named Magnus who studied alchemy and aspired to raise the soul-substance of all living things into a state of perfection, and Tigra was one of his very first successful experiments, albeit a partial success, because he was able to permanently raise the tiger's being into a semi-human state by feeding him waters of golden magic. (Another of Magnus' successful experiments, also a Reasoner, was a friendly werewolf named Fenric, who was originally just a wolf.) Tigra looked upon Magnus as his own father (and Fenric as a brother), and Magnus in turn treated them as his sons, teaching them the ways of humanity.<br>\r\n<br>\r\nPresently Tigra arrived at a keep in the forest and knocked at the door. It opened and another beast-man greeted the Reasoner.<br>\r\n<br>\r\n\"Hey, Tigra!\" said the other beast-man. \"What took you so long today?\" Then he noticed the fairy in his arms. \"And who's that?\"<br>\r\n<br>\r\n\"I'll explain later, Fenric,\" answered Tigra. \"I think she needs healing, Is father back yet?\" </span></div></div>",
            "created":1251262800,
            "id":750559,
            "title":"The story of the Reasoner"
        },
        "143":{
            "author_id":"trytothink",
            "author_name":"Nathaniel Hammel",
            "choices":[
                "Why was her spot so special?",
                "Elith doesn't show for dinner",
                "Elith fell asleep thinking someone was watching her"
            ],
            "content":"<div class=\"\"><div> <span>Moving down one or the other path is what most will think to do, either because no-one thinks to think things through, or, it is better to get somewhere then no-where. <br>\r\n<br>\r\nWell . . . Elith did neither.  Her choice was to wait (not to think things through) but to give time.  'Maybe someone would find her'. She thought.  ‘My Mom and Dad would no what to do when I don’t show for dinner’.  So; therefore, she found a nice cleared out spot.  Not a spot as brown as the rest of everything, but this space was kind of colorful, more greens and even blues..  Elith didn't know that this spot was going to be something special.  </span></div></div>",
            "created":1250485200,
            "id":745429,
            "title":"Elith thought better"
        },
        "1431":{
            "author_id":"eeiko",
            "author_name":"Eeiko",
            "choices":[
                "Go to sleep",
                "Search for a place to stay",
                "Call out to the voice that was humming"
            ],
            "content":"<div class=\"\"><div> <span>Elith started playing with the blue and green grass when the ground beneath her began to glow. It felt warm and she was so startled she jumped up. She heard a faint humming and fireflies floated from the ground. Then she realized that her whole body felt very good so she layed down in the grass. Shortly after the humming stopped and the ground stopped glowing. There were no more fireflies anywhere. “Hey…I don’t feel as tired anymore.” Elith looked at her wings, but to her disappointment they were still torn. Well, at least her bruises were gone. <br>\r\n</span></div></div>",
            "created":1315078860,
            "id":1180329,
            "title":"Why was her spot so special?"
        },
        "14313":{
            "author_id":"eeiko",
            "author_name":"Eeiko",
            "choices":[
                "Leave the patch",
                "Sleep"
            ],
            "content":"<div class=\"\"><div> <span>Remembering the voice she heard Elith decided to find out who or what it was. “Hello?” she called out. “Is there anyone here? A spirit maybe?” Just as she finished her sentence the ground started to light up and she heard trill laughter. “Mmm, child.” Elith looked all around her, but she didn’t see anything but a few fireflies. “I am a piece of the earth spirit. Long ago, people used to worship me, but they have forgotten me and this is the only patch of my land that remains. It won’t be long until this little spot is gone. But what about you? What is a young fairy doing out all by herself?” Elith found the spirit’s vibrating voice to be very calming. “I’m sorry,” Elith said slowly. \"It’s a long story.” “I have plenty of time,” the spirit replied. And so Elith told the earth spirit her story. “I see,” the spirit said. “Well, the only help I can offer you is a lightning bug. It is a small piece of me that will protect you.” A small firefly landed on Elith’s shoulder. “Thank you,” Elith said. “Thank you for your company,” the spirit said. \"If you are ever in trouble remember the name Naiel.\" Elith felt very refreshed, but she didn't want to leave the comfort of patch. She didn't think she would get help waiting here, so she figured she could either sleep here until morning, or venture out now.</span></div></div>",
            "created":1315177680,
            "id":1181116,
            "title":"Call out to the voice that was humming"
        },
        "143131":{
            "author_id":"eeiko",
            "author_name":"Eeiko",
            "choices":[
                "Pick the left path",
                "Pick the right path"
            ],
            "content":"<div class=\"\"><div> <span>Elith decided there was no use in waiting for morning. She felt fine, besides her torn wing. She stood, telling herself to be strong and headed into the forest. With each step she was getting angrier and angrier. Why had no one come looking for her? She knew she had disobeyed her mother, but that was not a good enough reason to leave her deserted on the streets. I will go see Zach again, Elith thought defiantly. She stopped before a fork in the road and debated about which path to walk. The one on the left was the longer path and the one on the right was the quicker one. Elith had always taken the left path because the other was rumored to be dangerous. She didn’t really believe the rumors, but had never felt a particular need to travel the right path. After all, if it’s not broke don’t fix it, was her motto. </span></div></div>",
            "created":1315182540,
            "id":1181202,
            "title":"Leave the patch"
        },
        "1431311":{
            "author_id":"eeiko",
            "author_name":"Eeiko",
            "choices":[
                "Left",
                "Right"
            ],
            "content":"<div class=\"\"><div> <span>Elith began walking down the familiar left path. The dirt was smooth and hard beneath her bare feet and the path open and clearly worn. Elith looked about nervously. She had never been out so late. Since the population of the humans many of the forests natural creatures had migrated away. It was rare to see other supposedly \"mythical\" creatures. <br>\r\n<br>\r\nElith stopped dead in her tracks. She had heard something like a stomp. She frantically swiped at her hair, but stopped when she realized it was only the firefly. Elith strained to listen the night which seemed suspended in time.<br>\r\n<br>\r\nGRAAAAAH! Elith screamed and jetted down the path, feet smacking the ground hard, trying to stay far ahead of whatever was in the forest. Elith stopped as the trail ended abruptly. She could hear the creature crashing wildly after her and she only had a split second to choose, left or right?</span></div></div>",
            "created":1315282140,
            "id":1181977,
            "title":"Pick the left path"
        },
        "1433":{
            "author_id":"goodkitty",
            "author_name":"pinktink",
            "choices":[
                "elith is kidnapped",
                "elith awakes to a strange face",
                "elith has a strange dream"
            ],
            "content":"<div class=\"\"><div> <span>Elith yawned and decided to close her eyes for just a second, only to regain her strength she told herself. as she drifted into unconsciousness she could feel eyes on her, watching her every move. she would have moved but she was just so tired. it was impossible to fight against her weariness and she fell asleep with the hair on the back of her neck raised and her torn wings shivering painfully.</span></div></div>",
            "created":1266469200,
            "id":838898,
            "title":"Elith fell asleep thinking someone was watching..."
        },
        "15":{
            "author_id":"genius0312",
            "author_name":"cerial",
            "choices":[
                "Fly and look around on the cold windy night",
                "Walk along the ground and trust youe sense of direction",
                "Stay next to the lamppost till the secure daylight could lead her"
            ],
            "content":"<div class=\"\"><div> <span>Elith's belly let out a little grumble before she responded bringing her hand down to it. Slowly she wiped her moistened cheeks and then got to her feet. Elith pulled a few crushed berries from a small pouch on her side and then savored the taste as they hit her tongue. A small sniffle came from Elith feeling the cold skim across her light dress. The wind blew her dress across Elith's slender body, causing it to shimmer in the twilight of the setting sun. Elith stretched out her wings feeling the tight mussels ache. A small groan escaped Elith's lips before she stretched the wings again knowing that a moonlit night held no comforts for a lone fairy. At this Elith disputed whether flying would be the best course. There were danger's that came out at night that her mother had told her about, that Elith had only seen in her night mares. Having a feeling of the sudden realization of being lost and the sun setting ,the images of the beast ran through Elith's head, letting a small chill run down her spine. Elith could easily get a better idea of where to go by flying and looking around before just proceeding in a random direction on the ground. Maybe it would be better if she simply stayed where she was till morning. Elith thought about it for a second then decided to... </span></div></div>",
            "created":1250485200,
            "id":745547,
            "title":"A sudden realization of being lost"
        },
        "152":{
            "author_id":"s.within",
            "author_name":"SomewhereWithin",
            "choices":[
                "Elith turned around to see the fairy who had been following her",
                "Elith forgot about her exhaustion and flew quickly to outer part of Magnous",
                "Elith ran away while screaming"
            ],
            "content":"<div class=\"\"><div> <span>After a second thought, Elith finally decided that she didn't want to waste time and just walked the ground. Her wings could use some time to relief themselves from pain and exhaustion anyway. And surely those beasts and monsters only showed up in forests and dark places like that, right? Surely not in towns like these, Elith assured herself.  <br>\r\n<br>\r\nAnd so, she wiped the dry trail of tear from her cheek and started walking, following the brightest street out of many paths. <br>\r\n<br>\r\nFor the first time since she ran away blindly, Elith looked around. Sure, she had noticed that not many fairies came out this time. Magnous wasn't that big, and fairy-kids had gone home in the afternoon, while the fairy-dads had just come back from their workplace. Or fairy-mothers, who plainly just got ready for preparing the dinner for the family. <br>\r\n<br>\r\nAt the thought, Elith cringed. The berries had felt sour in her mouth, and she wanted to eat decent meal. She had to apologize, pride or no pride came in the way. <br>\r\n<br>\r\nBut suddenly, she had goosebumps. As she stepped, something, some-fairy behind her also stepped. When she stopped, it also stopped. Now, the stories of folk tales filled her mind with unwanted fear. She felt her fairy-blood drained from her face as she decided what to do...</span></div></div>",
            "created":1253854800,
            "id":765816,
            "title":"As Elith walked"
        },
        "1521":{
            "author_id":"s.within",
            "author_name":"SomewhereWithin",
            "choices":[
                "She recognised the voice",
                "She had never heard the voice before"
            ],
            "content":"<div class=\"\"><div> <span>Elith snapped around, not giving any chance for her stalker to disappear from her sight. She could feel the shadow tensed, and the shadow's wings fluttered in nervous. <br>\r\n<br>\r\nThe shadow of a fairy. Elith didn't know whether to sigh in relief or to be scared even more. Fairies weren't used to walk. They flew. Well, at the time, Elith was a different case, so... what was the other fairy doing? <br>\r\n<br>\r\nElith tried to step in between them, and seeing that her stalker didn't walk away, she reached the shadow even closer. <br>\r\n<br>\r\n\"Who... who's there!?\" she asked, half-yelled. \"Show yourself, or I'll scream!\" <br>\r\n<br>\r\n\"Elith, I've been looking for you!\" <br>\r\n<br>\r\nElith realised that...</span></div></div>",
            "created":1253854800,
            "id":765819,
            "title":"Curiosity kills the fairy... or save her?"
        },
        "153":{
            "author_id":"trytothink",
            "author_name":"Nathaniel Hammel",
            "choices":[
                "What happened next? ",
                "A shadow brushed Elith's back",
                "Somehow, Elith slowly became familiar with the voice."
            ],
            "content":"<div class=\"\"><div> <span>Elith was about to leave the security of the lamppost, which was warm, when out of nowhere a scream came bolting through her ears. \"YOU MUST STAAAAYYY.\"   ‘Where'd that voice come from?’ Elith made a 360 look surprised.  \"It would be the most stupid thing you'll ever do DO!\" The voice came again. Like the first time, 360, but now the turn was scared.  Elith crouched under the green bench.<br>\r\n<br>\r\n</span></div></div>",
            "created":1250485200,
            "id":745857,
            "title":"The Lamppost Elith "
        }
    },
    "info":{
        "author_id":"trytothink",
        "author_name":"Nathaniel Hammel",
        "brief_description":"This is a Fantasy Story",
        "created":1182284520,
        "description":"<td align=\"left\" class=\"norm\">\"NO FIRST PERSON POINT OF VIEW\"<br>\r\n<br>\r\nTHIS IS A FANTASY STORY, KEEP IT THAT WAY.<br>\r\n<br>\r\nBE DESCRIPTIVE ... WORD PLAY IS A MUST!<br>\r\n<br>\r\nHAVE FUN WITH IT</td>",
        "id":1279261,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1489212660,
        "modified":1489212660,
        "pretty_title":"The Lost Fairy"
    }
}