{
    "chapters":{
        "1":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Andy wishes to be 18 years old",
                "Andy wishes to be a grown man",
                "Andy wants to be 6 years old for a few minutes",
                "Random Age Change! The talisman ages Andy at random!",
                "Andy wishes he were a baby again"
            ],
            "content":"<div class=\"\"><div> <span>Ageless Andrew<br>\r\n<br>\r\nIntroduction<br>\r\n<br>\r\nAndrew Denny came to the old, abandoned house with his mother, June. June has a job cleaning houses, while she tries to raise Andy as a single mom who just recently got divorced.<br>\r\n<br>\r\nAndy is only 12 years old, and he has an abundance of curiosity, fantasy and imagination. He is outgoing and talkative, and he loves to try new things.<br>\r\n<br>\r\nToday, June Denny had taken Andy with her, so that she wouldn’t have to get a baby sitter for him. She had an old house to clean, and she had already gotten some money for the job. <br>\r\n<br>\r\nThe owner of the house was an elderly man who had recently passed away. The man had no children and his wife had died many years earlier. June had to clean the old house, and she had taken Andy with her.<br>\r\n<br>\r\nAndy was bored to tears, while he sat in the chair in the living room. He could only watch while his mother mopped the floor and dusted the big, wooden table. She had yet to wash all the windows and clean the bathrooms.<br>\r\n<br>\r\nAndy became restless and began to wander around.<br>\r\n<br>\r\n“Mom… Can I go over to the neighbors, next door? I want to see who else lives here!” Andy asked his mom, as he wandered around the big house. He opened a closet door and noted stacks of books, papers and boxes all over.<br>\r\n<br>\r\n“No, Andy… You’re too young to go out all by yourself, and you know that!” June replied.<br>\r\n<br>\r\nAndy spotted some model cars and figures in the closet. He also saw some small toys, which had probably belonged to some little girl, who had lived there many years earlier.<br>\r\n<br>\r\n“Can I go to that bedroom at the end of the hall, mommy? I think there are some little toys in there… I want to check them out…” he chuckled.<br>\r\n<br>\r\n“No, Andy… Leave them alone. Besides, you’re too old to play with little toys!”<br>\r\n<br>\r\n“I’m too old for this, too young for that…” Andy sighed, as he walked over to the large, wooden desk. He curiously opened the large, desk drawer and saw that it was filled with small items and knick-knacks.<br>\r\n<br>\r\nIn the desk he found a small box, about 1 inch square on all sides. The box was old and dusty. When he removed the lid, he found a bright, blue amulet, which was a stone shaped like a diamond. On it was engraved the word “Ageless”.<br>\r\n<br>\r\n“A talisman!” he cheered. “I’m taking that with me!” he said, as placed the talisman in the box, and then he hid the box in his pocket.<br>\r\n<br>\r\n“Don’t touch anything! Andy!” June shouted. “There’s nothing here for you to play with! You’re too young to be messing with these things!”<br>\r\n<br>\r\n“I’m always too young for everything…. Ugh!” Andy groaned, as he walked back to the kitchen where June was just finishing up. “Are you almost done? Can we go now?”<br>\r\n<br>\r\n“Yes, I’m finished…”<br>\r\n<br>\r\nJune finally walked out and locked the front door. Then, she took Andy by the hand, as they walked back to the car.<br>\r\n<br>\r\nAndy was very happy to get out of there, but he was even more excited that he had taken a souvenir with him.<br>\r\n<br>\r\nAs soon as Andy got home, he got some fishing wire. He ran the wire through the amulet, and then he tied it around his neck, so it could not be removed. He figured that, since it was an amulet, it would bring him good luck!<br>\r\n<br>\r\nWhat happens when he wears the amulet?</span></div></div>",
            "created":1164171600,
            "id":509650,
            "title":"Andy finds the talisman"
        },
        "11":{
            "author_id":"yashimoto",
            "author_name":"ponchi",
            "choices":[
                "run over to dad's house",
                "go shopping"
            ],
            "content":"<div class=\"\"><div> <span>“Let’s get home, Andy…” June said to him. “Then, I can make us some dinner…”<br>\r\n<br>\r\n“What do we have to eat, mom?” the boy asked, as he sat next to her in the car.<br>\r\n<br>\r\n“I’ll make you a nice hot bowl of split pea soup with some fresh French garlic bread!” June smiled. “That’s going to taste so good!”<br>\r\n<br>\r\n“Soup?” Andy asked disappointedly. “I thought you were going to make some drumsticks tonight?”<br>\r\n<br>\r\n“Yes, but I had a change of plans, and I’m going out tonight!” June replied.<br>\r\n<br>\r\n“Don’t tell me you’re going out with Jonathan again?” Andy replied annoyingly. “He is such a loser…”<br>\r\n<br>\r\n“Now, now, Andy… You must be respectful of my friends, especially the ones I date! I’m a single woman now, and now and then I’ll enjoy going out with a fine single man!” she responded. “So, be nice to him, okay?”<br>\r\n<br>\r\n“He just seems so weird… And he walks funny! I can’t believe you’re dating a garbage man!”<br>\r\n<br>\r\nJonathan happened to work for the Waste Management Company, and he drove a garbage truck every morning for work.<br>\r\n<br>\r\n“Jonathan works hard and earns his money just like the rest of us, Andy!” June explained. “We’re all poor, and we all need to work hard so that we can pay the bills! My job is to clean houses, and his job is to drive around in a garbage truck! That is very honorable work, Andy, so don’t bad mouth the work he does!”<br>\r\n<br>\r\n“Yeah, but… Why are you dating a garbage man? That just sounds so dirty…”<br>\r\n<br>\r\n“He only drives the garbage truck, so stop complaining about him, okay?” June replied in a stern tone of voice. “If you don’t do your best in school, then you might end up working as a garbage collector, too…”<br>\r\n<br>\r\n“Yeah, well I’m going to be something cool when I grow up!” Andy retorted. “I’m not going to drive around town in a big, dirty and smelly garbage truck!<br>\r\n<br>\r\nThey had just arrived home, and they had opened the door to the car so that they could get out. June was carrying the cleaning supplies, and Andy was carrying the big, plastic bucket.<br>\r\n<br>\r\n“Can I go over to dad’s house tonight?” Any wondered. “Dad is going to some bar or something…”<br>\r\n<br>\r\n“No Andy, you’re too young for that!” she responded convincingly. “I will not allow your father to take you to a bar! You’re only twelve years old and you’re much too young to go to a place like that!”<br>\r\n<br>\r\n“I’m always too young for everything…” he grumbled, as he walked in the front door of the house.<br>\r\n<br>\r\nAs soon as they were in the house, June started to shower and dress up to go out, while Andy just sat on the couch and watched some TV.<br>\r\n<br>\r\nAfter about twenty minutes, June walked out of her bedroom and sat down at the couch next to Andy.<br>\r\n<br>\r\n“I’m going to fix you some dinner and then I want you to just stay in your room tonight, okay?” she instructed him.<br>\r\n<br>\r\n“Is anybody coming over to baby-sit me tonight?”<br>\r\n<br>\r\n“No, nobody was available, so I need for you to be a good boy and to stay home and wait for me to come back home from my date with Jonathan!” she ordered.<br>\r\n<br>\r\nAfter a few moments, June had heated up a can of soup, and she had poured the hot soup in a bowl. Andy sat down at the kitchen table, and he was eating the soup, when the doorbell rang.<br>\r\n<br>\r\n“That’s Jonathan… Be a good boy, alright?” she said, as she walked over to where he was sitting and bent down, kissing him on the cheek. “Don’t let anybody come over, and don’t talk on the phone all night! Be a good boy, and wash the dishes for me, okay?”<br>\r\n<br>\r\n“Sure, mom…”<br>\r\nThen Andy watches tv and flicks through channels.  He sees hot teenagers on beaches. <br>\r\n\"Gosh i wish i was like them.\"<br>\r\n\"Oh wait i remember i have an amulet that changes my age\"<br>\r\nAndy uses it on himself.<br>\r\n\"OH i don't feel so good\"<br>\r\nSuddenly Andy feels like he's stretched out.  As his legs are growing, they are also expanding making his pants really tight.  He then finds a layer of hair on his legs.  Then cock hurts.  It feels like it's getting stretched.  Then his torso grows.  He finds that his flat stomach is turning into an 8 pack.  Then his pecs are growing.  Then his arms.  Luckly his shirt didn't rip.  Andy falls unconcious.<br>\r\n\"wow what happened.''<br>\r\nAndy looks in the mirror.  A hot teenager was looking at him.<br>\r\nandy then poses.  Andy found his pants turned into tights.<br>\r\nNow embarrassed.  He is wearing his dad's old boxers that he left at his mom's house.<br>\r\n\"wow i can now pick up the ladies with this body.\" in a hot sexy masculine voice.<br>\r\n\"but i need some clothes     </span></div></div>",
            "created":1179378000,
            "id":408772,
            "title":"hot stuff"
        },
        "111":{
            "author_id":"pengiunbard",
            "author_name":"pento",
            "choices":[
                "\"I guess it couldn't hurt\"",
                "\"No,   You're going home\""
            ],
            "content":"<div class=\"\"><div> <span>\" I bet Dad will have something that will fit me!\"<br>\r\n<br>\r\nAndy's dad only lives a couple blocks away in another apartment building.  He has to go bare foot because he can't find any shoes that fit him now.  So in his dad's boxers and his now tight t-shirt Andy set out for his father's place.  <br>\r\n<br>\r\nA couple people gave Andy some interesting looks but other than that he made it over to his dad's place in no time.  He buzzed up to his dad's apartment.  \"Oh crap my voice.  I wish my voice was 12 years old\"  Andy's adams apple started to become less prominent before his father's voice came out of the box.<br>\r\n<br>\r\n\"Hello?\" said his father.<br>\r\n<br>\r\n\"It's me Dad.  Can I come up?\"  Andy asked, his voice sounding ridiculous coming from his current body.<br>\r\n<br>\r\n\"Sure thing sport\".  The door buzzed to let Andy know he could come in.  He pulled it open.  It was a heavy door but Andy found it was a lot easier to open now.  He headed up to his dad's floor and knocked on the door.  Andy's dad opened the door and stopped.  \"Uh hello?  Do I know you?\"<br>\r\n<br>\r\n\"Dad it's me, Andy!\" he says hoping his dad will believe him.<br>\r\n<br>\r\n\"Um, what happened to you....You sound like my son but you look a bit older than him.\" he says a bit unsure.<br>\r\n<br>\r\n\"I know, I know.  I found this amulet and it lets me change my age so I became a teenager, but I put my voice back to normal so you'd believe it's me.\" Andy said almost begging.<br>\r\n<br>\r\n\"I do sport.  It's ok.  Come on in.\"  Andy's dad let his son come in and closed the door behind him.  \"So why did you come over?\"<br>\r\n<br>\r\n\"Well I don't have any clothes that fit me.  I found an old pair of your boxers but other than that...\"<br>\r\n<br>\r\n\"Does your Mother know you're here?\" he asked in a typical father tone.<br>\r\n<br>\r\n\"No she's out with someone...can you help me?\" Andy asked his father.  <br>\r\n<br>\r\n\"Ok I can give you some stuff to wear but you should get home.  You know your Mom doesn't like you coming over here without her knowledge.  I'll walk you back home before I go to the bar.\"<br>\r\n<br>\r\n\"You're going to a bar? Can I come too Dad? PLEASE?\"<br>\r\n<br>\r\n\"Sport, even though you look like a teen you're still not old enough to come along\" he said going to get some clothes for his son.<br>\r\n<br>\r\n\"But I can make myself older!  I can make myself old enough to go to the bar, please?\" he whined, following his dad into his bedroom.<br>\r\n<br>\r\n\"Well...\"</span></div></div>",
            "created":1191387600,
            "id":449918,
            "title":"To his Dad's"
        },
        "1111":{
            "author_id":"pengiunbard",
            "author_name":"pento",
            "choices":[
                "Age 32",
                "Age 42"
            ],
            "content":"<div class=\"\"><div> <span>\"Well...I guess it couldn't hurt.  I don't really want you home by yourself anyways.  I'll give your mother a call to let her know you're staying with me today.\" Andy's Dad picked up the cordless phone and left the room to leave a message.<br>\r\n<br>\r\nAndy started looking through the clothes in his Dad's closet.  There was a mix of button up dress shirts, t-shirts, dress pants, kahkis, jeans, lots of things.<br>\r\n<br>\r\n\"OK I left her a message so she won't worry.\" Andy's Dad came back into the room to see his son looking through the closet.  \"See anything you like?\" He grinned as Andy turned around, looking like he'd been caught in the middle of doing something wrong.<br>\r\n<br>\r\n\"I don't know.  I don't know what to wear\", Andy replied.<br>\r\n<br>\r\n\"Well how about you make yourself older first.  Then we'll know how big you are and you can wear whatever fits.\"<br>\r\n<br>\r\n\"How old should i get?\" Andy asked his father.<br>\r\n<br>\r\n\"Hmmmm...well you have to be old enough to not get ID'd.  I think age...</span></div></div>",
            "created":1191387600,
            "id":450164,
            "title":"Just this once"
        },
        "112":{
            "author_id":"nixon5",
            "author_name":"nixon5",
            "choices":[
                "go to the mall",
                "go to the pool"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nOk, with my dad's old boxershorts I'm not totally naked but there are no more male clothes. Therefore I've to find some new clothes to use the advantages of my new teenage body.<br>\r\n<br>\r\nBut before it's possible to go to the mall you've surley no alternative than to reverse your age progression. <br>\r\n<br>\r\nTherefore yu pull of your dad's former boxershorts. You're a totally naked teenage boy. You enjoy your new powers.<br>\r\n<br>\r\n<i>Ok, I wish to be 12 years old again!</i><br>\r\n<br>\r\nThe warm feeling over your whole body begins immediately. There's a tingle in every extension of your body. Then the transformation begins:<br>\r\n<br>\r\n- your feet shrink <br>\r\n<br>\r\n- your legs become shorter and shorter<br>\r\n<br>\r\n- your arms and your hands are shrinking<br>\r\n<br>\r\n- your biceps, your pecs and your abs disappear and are replaced by a boy's childisch body before puberty<br>\r\n<br>\r\n- your dick shrinks to its normal size<br>\r\n<br>\r\n- finally your face becomes younger<br>\r\n<br>\r\n<i>Wow, I need some clothes, In comparison to my teenage looking, I'm very disappointed to be young again.</i><br>\r\n<br>\r\nSo there are two possibilities: Either you'll go to the mall shopping for your teenage body or you'll go with your best friend Matt to the pool and look for some trunks or speedos there...<br>\r\n<br>\r\n</span></div></div>",
            "created":1343831520,
            "id":1395229,
            "title":"go shopping"
        },
        "12":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Andy is a 36 year-old man with a beard and blond hair",
                "Andy is a 36 year-old man with big muscles",
                "Andy becomes a 36 year-old basketball player",
                "Andy becomes a 36 year-old football player",
                "Andy ages to 36 years old"
            ],
            "content":"<div class=\"\"><div> <span>“Let’s get home, Andy…” June said to him. “Then, I can make us some dinner…”<br>\r\n<br>\r\n“What do we have to eat, mom?” the boy asked, as he sat next to her in the car.<br>\r\n<br>\r\n“I’ll make you a nice hot bowl of split pea soup with some fresh French garlic bread!” June smiled. “That’s going to taste so good!”<br>\r\n<br>\r\n“Soup?” Andy asked disappointedly. “I thought you were going to make some drumsticks tonight?”<br>\r\n<br>\r\n“Yes, but I had a change of plans, and I’m going out tonight!” June replied.<br>\r\n<br>\r\n“Don’t tell me you’re going out with Jonathan again?” Andy replied annoyingly. “He is such a loser…”<br>\r\n<br>\r\n“Now, now, Andy… You must be respectful of my friends, especially the ones I date! I’m a single woman now, and now and then I’ll enjoy going out with a fine single man!” she responded. “So, be nice to him, okay?”<br>\r\n<br>\r\n“He just seems so weird… And he walks funny! I can’t believe you’re dating a garbage man!”<br>\r\n<br>\r\nJonathan happened to work for the Waste Management Company, and he drove a garbage truck every morning for work.<br>\r\n<br>\r\n“Jonathan works hard and earns his money just like the rest of us, Andy!” June explained. “We’re all poor, and we all need to work hard so that we can pay the bills! My job is to clean houses, and his job is to drive around in a garbage truck! That is very honorable work, Andy, so don’t bad mouth the work he does!”<br>\r\n<br>\r\n“Yeah, but… Why are you dating a garbage man? That just sounds so dirty…”<br>\r\n<br>\r\n“He only drives the garbage truck, so stop complaining about him, okay?” June replied in a stern tone of voice. “If you don’t do your best in school, then you might end up working as a garbage collector, too…”<br>\r\n<br>\r\n“Yeah, well I’m going to be something cool when I grow up!” Andy retorted. “I’m not going to drive around town in a big, dirty and smelly garbage truck!<br>\r\n<br>\r\nThey had just arrived home, and they had opened the door to the car so that they could get out. June was carrying the cleaning supplies, and Andy was carrying the big, plastic bucket.<br>\r\n<br>\r\n“Can I go over to dad’s house tonight?” Any wondered. “Dad is going to some bar or something…”<br>\r\n<br>\r\n“No Andy, you’re too young for that!” she responded convincingly. “I will not allow your father to take you to a bar! You’re only twelve years old and you’re much too young to go to a place like that!”<br>\r\n<br>\r\n“I’m always too young for everything…” he grumbled, as he walked in the front door of the house.<br>\r\n<br>\r\nAs soon as they were in the house, June started to shower and dress up to go out, while Andy just sat on the couch and watched some TV.<br>\r\n<br>\r\nAfter about twenty minutes, June walked out of her bedroom and sat down at the couch next to Andy. <br>\r\n<br>\r\n“I’m going to fix you some dinner and then I want you to just stay in your room tonight, okay?” she instructed him.<br>\r\n<br>\r\n“Is anybody coming over to baby-sit me tonight?”<br>\r\n<br>\r\n“No, nobody was available, so I need for you to be a good boy and to stay home and wait for me to come back home from my date with Jonathan!” she ordered. <br>\r\n<br>\r\nAfter a few moments, June had heated up a can of soup, and she had poured the hot soup in a bowl. Andy sat down at the kitchen table, and he was eating the soup, when the doorbell rang.<br>\r\n<br>\r\n“That’s Jonathan… Be a good boy, alright?” she said, as she walked over to where he was sitting and bent down, kissing him on the cheek. “Don’t let anybody come over, and don’t talk on the phone all night! Be a good boy, and wash the dishes for me, okay?”<br>\r\n<br>\r\n“Sure, mom…”<br>\r\n<br>\r\nJune then grabbed her bag and left, as she quietly walked out the front door, where Jonathan was patiently waiting for her to come out and get into his old, rusty sedan.<br>\r\n<br>\r\n“Have fun, mom…”<br>\r\n<br>\r\nAfter a few moments, the car had left the driveway, and Andy was all alone in the house.<br>\r\n<br>\r\n“Let me check out the loot for today…” he said, as he walked back into his room and removed the small, square box from his pocket in his jeans. He then opened the box and carefully removed the small gem from the box. All he needed was something to hang it from, so he could hang it around his neck.<br>\r\n<br>\r\n“So… This thing makes me ‘Ageless’, huh?” he chuckled. “Yeah, right…”<br>\r\n<br>\r\nAndy grabbed some fishing wire, he cut a piece of the thin, transparent wire, and he made a knot in it. He ran the gem through the end of the wire, so that it hung nice and study. Nothing was going to pull the amulet from around his neck.<br>\r\n<br>\r\n“This is my good luck charm… Boy do I need a little more luck, these days…” he whispered to himself. <br>\r\n<br>\r\nHe had just placed the amulet around his neck, when he spotted a small sheet of paper that was taped to the inside of the top of the small, wooden box that the amulet was stored in.<br>\r\n<br>\r\n“Ooh… What is this?” he wondered, as he unfolded the small sheet of paper, which was about the size of a paper that had fallen out of a fortune cookie in a Chinese restaurant.<br>\r\n<br>\r\n“Wish to be any age, and it will happen. Wish for any part of you to age, and it will happen. This amulet works as long as you’re wearing it while you make your wish. Remove it to return to your real age, which you had before you changed” the paper read.<br>\r\n<br>\r\n“What?” Andy gasped, as he read the small text for the second time. “You’ve got to be kidding me!”<br>\r\n<br>\r\nWhat would he wish for first?<br>\r\n<br>\r\n“Ummm… I’m twelve years old now…” he pondered out loud. <br>\r\n<br>\r\nHe did a quick calculation in his head.<br>\r\n<br>\r\n“Let’s see… Twelve times two is twenty-four… Twelve times three is thirty-six… That sounds good…” <br>\r\n<br>\r\nThen he stood before his mirror in his bedroom.<br>\r\n<br>\r\n“I wish I were thirty-six years old!” he blurted out.<br>\r\n<br>\r\nSuddenly, his body was overcome by a warm feeling…<br>\r\n<br>\r\n</span></div></div>",
            "created":1164258000,
            "id":361073,
            "title":"Andy wishes to become a grownup for a few minutes"
        },
        "121":{
            "author_id":"cutlerfan",
            "author_name":"cutlerfan",
            "choices":[
                "Go to his Dad's and show him .",
                "Find some clothes and go out.",
                "Change back to make sure he can be 12 again."
            ],
            "content":"<div class=\"\"><div> <span>Andy blinked for a second and realized he had grown. The bedroom looked much smaller. He looked in the mirror and saw a handsome and very adult man looking at him. he had hair on his face! It was a beard...a red beard. He was surprised but quickly decided he looked hot! He realized that he had grown larger in other ways as he looked down. His clothes were shredded and a big floppy penis was sticking out with lemon sized balls.<br>\r\nWhat had he done?</span></div></div>",
            "created":1258088400,
            "id":791197,
            "title":"Andy is a 36 year-old man with a beard and blon..."
        },
        "1211":{
            "author_id":"cutlerfan",
            "author_name":"cutlerfan",
            "choices":[
                "Use the amulet to try and become a twelve year old again.",
                "Try to make a part of you younger as practice.",
                "See what else the amulet can do."
            ],
            "content":"<div class=\"\"><div> <span>Andy was worried. He was so big now? What should he do? He remembered some of his dad's old clothes in a box in the storage room so he headed there. He tossed boxes and bags around until he found it deep in the back. He manage to squeeze into some pants and a shirt but only just as he was bigger now than his dad was.  He raced over to his Dad's apartment and knocked on the door. \"Who is it?\" His father called out. \"Uh it's Andy dad\" He said trying to sound like a kid again. \"Hey sport you sound like you've got a sore throat there pal. Maybe I should...\" his dad stopped talking when he opened the door. He gaped at the man in front of him. \"Where's my son...Where's Andy?\" Andy smiled \"It's me dad it's really me!\"  Andy's dad looked astonished then said quietly \"Annnndddyy?\" \"Uh I need to talk to you right now dad\" and he pushed his way in. Later after Andy had told his dad what had happened. Andy asked his dad what he should do. \"What do I do now dad?\" he said almost sobbing. \"Well son, I think you should...\"</span></div></div>",
            "created":1258174800,
            "id":791483,
            "title":"Go to his Dad's and show him ."
        },
        "122":{
            "author_id":"batlagoon",
            "author_name":"Dutch91",
            "choices":[
                "Andy tries to explain.",
                "June asks who this \"strange man\" is.",
                "Actually, neither speak. Something else happens first."
            ],
            "content":"<div class=\"\"><div> <span>Andy felt his body burning up. As the feeling calmed down, his body adjusted accordingly. He felt almost at peace as his muscles grew to bodybuilder proportions; and he took on the appearance of a buff, handsome 36 year old...though he could go for a shave.<br>\r\n<br>\r\nAndy stretched his massive biceps for a brief bit, looking at his body in awe. He couldn't believe the amulet actually worked! And that he would be this good-looking when he was older!<br>\r\n<br>\r\nAndy then pondered over what he could do as this 36 year old version of himself. Surely he could go to a bar, even though his Mom thought he couldn't. But that was when he was 12. Or he could continue working on chores...<br>\r\n<br>\r\nOr maybe...maybe he could try the amulet again. Who knows what kind of fun he could have?<br>\r\n<br>\r\nHowever, before he could do anything, June came back. It turned out that she forgot her purse, and so she went back inside her home. Though, when she went in, she was face-to-face with a 36 year old Andrew!<br>\r\n<br>\r\nBoth wondering what to do, one spoke up. Who was it?</span></div></div>",
            "created":1265259600,
            "id":830363,
            "title":"Andy is a 36 year-old man with big muscles"
        },
        "1221":{
            "author_id":"batlagoon",
            "author_name":"Dutch91",
            "choices":[
                "\"Can you tell me where the amulet came from?\"",
                "\"Can you teach me to use the amulet?\"",
                "\"Maybe we can find a way so that both of us can benefit from it?\""
            ],
            "content":"<div class=\"\"><div> <span>June seemed absolutely shocked at the fact that some \"random\" person was in her house. She was about to dial 9-1-1, Andy realized he had to do something. \"Mom, stop!\"<br>\r\n<br>\r\n\"Mom?\"<br>\r\n<br>\r\n\"It's me, Andy. See this amulet? It made me older somehow! This is me when I'm 36 years old!\"<br>\r\n<br>\r\n\"I can't believe it...\"<br>\r\n<br>\r\n\"I know, it is kind of random...but it's the truth.\"<br>\r\n<br>\r\n\"No, I know. I'm glad you'll grow to be such a good-looking man, but...how could you have found my amulet?\"<br>\r\n<br>\r\n\"Your amulet?!?\"<br>\r\n<br>\r\n\"Yes, I've used that amulet to live for several hundred years. But now that someone of my own family has found it other than me, I'm afraid it is now attached to you.\"<br>\r\n<br>\r\n\"Attached?\"<br>\r\n<br>\r\n\"It will remain with you for an undetermined amount of time. Perhaps forever. It fell off of me recently, apparently it no longer wants me. I fear abusing it's power may leave me to age rapidly soon enough...\"<br>\r\n<br>\r\nAndy felt sad for his Mom at this point...but decided to ask another question:</span></div></div>",
            "created":1265259600,
            "id":830658,
            "title":"Andy tries to explain."
        },
        "12212":{
            "author_id":"batlagoon",
            "author_name":"Dutch91",
            "choices":[
                "\"Because it will become harder for you to remain one age.\"",
                "\"Because it may make you stay one age for a while.\""
            ],
            "content":"<div class=\"\"><div> <span>Andy then asked, \"Can you teach me how to use the amulet?\"<br>\r\n<br>\r\n\"...Of course. All you have to is believe.\"<br>\r\n<br>\r\n\"Believe?\"<br>\r\n<br>\r\n\"Believe what age you want, and that age you will become.\"<br>\r\n<br>\r\n\"That sounds...easy.\"<br>\r\n<br>\r\n\"Then do it.\"<br>\r\n<br>\r\nAndy then thought of himself as a 70 year old man. Wrinkles appeared on his body, most prominent on his forehead. He then turned into a 7 year old, shrinking to a small height and his clothes morphing along with them. He smirked as he returned to 12 years old.<br>\r\n<br>\r\nJune then said, \"Andy, you can't abuse your power like that.\"<br>\r\n<br>\r\n\"Why not?\"</span></div></div>",
            "created":1265518800,
            "id":831924,
            "title":"\"Can you teach me to use the amulet?\""
        },
        "122121":{
            "author_id":"batlagoon",
            "author_name":"Dutch91",
            "choices":[
                "Go clubbing at \"legal age\"",
                "Go back to kindergarten"
            ],
            "content":"<div class=\"\"><div> <span>Andy pondered over the words his mother said, \"Because it will become harder for you to remain one age.\"<br>\r\n<br>\r\nWere they really true? She wouldn't lie to him, right? His Mom did seem kind of nervous...just a bit, saying it...<br>\r\n<br>\r\n\"Are you lying, Mom?\"<br>\r\n<br>\r\n\"...No, what makes you think that?\"<br>\r\n<br>\r\n\"Mom... I want to use the amulet.\"<br>\r\n<br>\r\n\"Fine, but don't say I didn't warn you. The temptation to change ages can be so much to handle.\"<br>\r\n<br>\r\n\"And changing ages can be very fun, right?\"<br>\r\n<br>\r\nJune smiled a bit at that last statement.<br>\r\n<br>\r\nAndy then fooled around with his age, as he left the room.<br>\r\n<br>\r\nHe had two plans to have some fun with the amulet. Either he could go clubbing and make himself \"legal age\" for that...or he could go back to kindergarten briefly, for fun. He didn't really know why he had these plans, he just did. They could be fun. Andy decided to:</span></div></div>",
            "created":1265518800,
            "id":832315,
            "title":"\"Because it will become harder for you to r..."
        },
        "1221211":{
            "author_id":"macroboy",
            "author_name":"Mighty Macroboy",
            "choices":[
                "Let's go clubbing tonight.",
                "Andy wears the singlet and decides to stay at home lifting weights."
            ],
            "content":"<div class=\"\"><div> <span>Andy went to his mother's bedroom and opened the biggest closet.<br>\r\n<br>\r\n\"It must be here...\" he thought as he started to search through a pile of clothes.<br>\r\n<br>\r\n\"Yes! I found it!\" he said loud as he took a big box under the clothes. His mother was about to leave but she heard him before he opened the door, she went upstairs.<br>\r\n<br>\r\nIt was a box with some of his father's clothes. They seemed to be clean and he could wear them if he turned into a 36 years-old. His father was very muscular, and also a very bulky man. Those clothes could fit him perfectly.<br>\r\n<br>\r\nHe took off all his kiddish clothes quickly and walked to the mirror. He was totally naked when his mother entered her bedroom.<br>\r\n<br>\r\n\"What did you find?\" June wondered.<br>\r\n<br>\r\nBut before he could answer, he already wished to be a 36 years-old man again. In front of June's eyes, his son started to grow huge. In less than five seconds his beloved kid turned into a huge adult man.<br>\r\n<br>\r\n\"Mom, can I go clubbing tonight?\" Andrew said while flexing his biceps at the mirror.<br>\r\n<br>\r\n\"I guess I have no choice. You are an adult now, enjoy it. But remember that tomorrow you must go to school.\"<br>\r\n<br>\r\n\"Aw... I don't wanna go to school. I'm not a kid anymore.\" he said rubbing his huge bulging pecs. \"Look at me, mom! I'm an adult, I don't need school!\" he said, he turned to his mother and pointed to his new cock.<br>\r\n<br>\r\n\"Oh my god... You look exactly like your father...\" she said when he discovered his well endowed son. There was a silence. \"Anyway... Andy...\" she walked to his son. \"You have an adult body, but you still have a kid's mind. I'm not going to allow you to skip school.\"<br>\r\n<br>\r\n\"But mom...\" the big Andrew was about to cry.<br>\r\n<br>\r\n\"That doesn't mean you can't go to school as an adult.\"<br>\r\n<br>\r\n\"What!?\" Andrew wondered.<br>\r\n<br>\r\n\"Let me explain. The amulet has more magical powers. No one knows that you are Andy, of course. But if you tell them who are you, automatically they will believe you. They will notice that you are not a kid anymore, but they will recognize you. And also, they won't never wonder how did you change.\"<br>\r\n<br>\r\n\"Really?\"<br>\r\n<br>\r\n\"Yes. Just tell them that you are Andy and all your friends and teachers will recognize you. And you will be able to continue your life, even as an adult.\"<br>\r\n<br>\r\n\"Cool! Thank you mom! I can't wait to show my muscles to my friends!\"<br>\r\n<br>\r\n\"And now, please, get dressed. You can't go naked like that.\"<br>\r\n<br>\r\n\"Okay mom!\"<br>\r\n<br>\r\nHe took his father's briefs. They were tight, but very comfortable.<br>\r\nIn the clothes box he also found a wrestling singlet. His father wasn't a wrestler, but he loved to wear that singlet to show off his muscles. Next to the clothes box, there was a big box with some weights that his father used to lift.</span></div></div>",
            "created":1288155600,
            "id":982172,
            "title":"Go clubbing at \"legal age\""
        },
        "12212112":{
            "author_id":"worshipper",
            "author_name":"worshipurmuscles",
            "choices":[
                "Hit the club & show the ladies what a real man looks like.",
                "Head to the gym to compare himself with other lifters."
            ],
            "content":"<div class=\"\"><div> <span>Let's get these babies pumped, Andy thinks to himself, slips on the singlet &amp; starts lifting. Oh, it felt good to be a real man and curling 20 pounds. However, it was not enough to get a pump, so he quickly moved on to 40 pound curls. Again, not enough. Once he got up to 80 pounds, he felt it. Andy could also start to see his already big arms getting bigger &amp; harder. Heck, if his dad had curled 80, he would curl 100, so he managed to get the weights up to 100. Bit of a strain, but not much, so he worked up to 150 pounds in each hand. Wow, that was tough but worth it. His muscles needed to be challenged. Andy then tried on the shirt but found it to be tight in a good way around the arms and his shoulders. Time to show off.</span></div></div>",
            "created":1318568400,
            "id":1206230,
            "title":"Andy wears the singlet and decides to stay at h..."
        },
        "125":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Andy wishes to grow older",
                "Andy wants to become younger"
            ],
            "content":"<div class=\"\"><div> <span>Andy suddenly got a strange feeling from within his stomach. He felt like he had eaten something that was now doing a number on his stomach.<br>\r\n<br>\r\n“Uhhh… I don’t feel so good…” he groaned, as he stood before the mirror. “I wonder if it was the amulet or the soup…”<br>\r\n<br>\r\nThen, he felt his body getting warmer and warmer. It was as if he was suddenly beginning to show signs of running a slight fever. His head and throat felt warm, and his muscles and joints began to feel sore as well.<br>\r\n<br>\r\n“This is not good… I feel like I’m becoming sick…” he thought to himself.<br>\r\n<br>\r\nFor the moment, the warm feeling seemed to maintain its level of heat. Then, he felt a cold shiver traveling up his spine, like his body was trying to tell him something.<br>\r\n<br>\r\n“Uuuuhhhhh…” he groaned, as he tried to remain standing before the mirror. His head started to spin a little, as he was overcome by a slight dizzy spell. He had to close his eyes tight and open them again, just because it seemed as if his eyes had become dry and started to burn.<br>\r\n<br>\r\nThen, things began to happen rather quickly. His feet suddenly froze in place, preventing him from moving his legs. He felt his entire body stiffening up, and he was completely unable to move anymore.<br>\r\n<br>\r\nNext, his feet slowly expanded sideways and in the length. His feet grew by five inches, and they almost doubled in width. His legs began to change as well, just as his feet had completed their growth.<br>\r\n<br>\r\nHis legs seemed to grow thicker, at first. His short, skinny legs began to widen as well as deepen. He could only gasp in disbelief, as he looked down and sow his own body change before his eyes.<br>\r\n<br>\r\n“Holy smoke… I must be dreaming…”<br>\r\n<br>\r\nHis legs grew almost three times as thick as before. The tingling feeling was incredible intense, as he felt his bone structure change. He had to slightly adjust his stance, as his legs grew closer and closer together, until his thighs were rubbing against each other.<br>\r\n<br>\r\nNext, his very wide legs now began to grow again! When Andy looked down, he realized that his legs started to grow longer as well! He was becoming taller, growing several inches in just a few seconds. He saw the floor pulling farther and farther away from his face, as he looked down. His legs were growing longer! <br>\r\n<br>\r\nHis calves grew bigger, to the point where they were almost three times bigger than before. His quads grew bigger and wider, as well as longer. In just a few moments time, Andy had grown from being just under five feet tall, to over six feet tall! And this happened just in a few moments!<br>\r\n<br>\r\nThen, his legs grew a thin coat of hair! Poor Andy was almost going to burst out of his underwear, because of it. He desperately pulled his underwear through his longer legs. They barely fit through the long legs and the huge feet, he now had attached to the bottom of his legs.<br>\r\n<br>\r\nWhile he was struggling to get his underwear off, his torso started to widen. A thin layer of hair started forming over his stomach as well, while his upper body continued to grow in all directions. His shoulders grew further apart as well, and more hair started to cover his armpits and his arms.<br>\r\n<br>\r\nThen, he realized that he was about to burst out of his t-shirt! As his upper body continued to grow wider and taller, his shirt was becoming tighter and tighter until it was just unbearable!<br>\r\n<br>\r\nRIP!<br>\r\n<br>\r\nHis t-shirt had ripped in half, due to the increased size of his body! He had literally burst out of his t-shirt. He quickly tore the ripped shirt off with his hands, leaving him now completely naked!<br>\r\n<br>\r\n“Oh man…” he gasped when he saw his reflection in the mirror.<br>\r\n<br>\r\nHis arms were growing longer and thicker, as well as his hands. His fingers grew longer, and his hands nearly doubled in size. His arms grew several inches longer, and muscle started forming everywhere. His triceps bulged from the back of his arms, and his delts popped up over the back of his neck and shoulders. Mighty biceps slowly formed over the top of his arms, and a thin later of hair began to cover his arms all the way up to his wrists.<br>\r\n<br>\r\nNext, his pectorals increased in size. While they ballooned in all directions, Andy could only groan lightly when he felt the weight increase in his chest and arms. A thick layer of black hair formed from his stomach to his neck. <br>\r\n<br>\r\nFinally, after his upper body had finished growing, his neck grew wider and longer and immediately his head began to change. The smooth skin was now replaced by a fine layer of hair, which began to cover under his chin and along the side of his face. A mustache formed over the skin above the lips, and it reached all the way around his mouth. Hair grew on the sides of his face as well, covering the skin just below the ears.<br>\r\n<br>\r\nNext, his hair grew thicker and longer. His head grew in size as well, as his facial expression began to change. His eyes grew wider, and his eyebrows became thicker and darker. His nose increased, as well as his ears. Finally, he had aged on the inside as well, except for the fact that he still had the mind of a twelve year-old boy.<br>\r\n<br>\r\n“Oh my God, that was…” he gasped, when he heard himself speak. His voice was a deep, baritone voice, like that of a grown man. In fact, when he stared at his reflection, he really was a grown man!<br>\r\n<br>\r\nLastly, he began to feel a tickle in his groin. Now that he had already removed his underwear, shorts and t-shirt, he could see what else was changing on his body. When he looked carefully in the mirror, he realized that his cock was growing wider as well as longer, and his testicles had increased from the size of grapes to the size of small tennis balls!<br>\r\n<br>\r\nAndy walked a little closer to the mirror. The person, who was staring back at him in the mirror, was no longer a twelve year-old kid. It was now a thirty-six year-old man!<br>\r\n<br>\r\n“I’m a grownup now… I did it! It really works!” the fully grown Andy cheered, as he stared at his new body in the mirror.<br>\r\n<br>\r\n“I’m a man! I really am a MAN!”<br>\r\n<br>\r\nThe entire transformation had maybe lasted just a minute, but it was just enough to convince him, that the amulet really worked. He wished to become a thirty-six year-old man, and that’s exactly what he was!<br>\r\n<br>\r\n“Wow… I’m as big as dad!” he laughed, as he grabbed his cock while staring at the mirror. “No, I think I’m a little bigger than dad, now!”<br>\r\n<br>\r\nHe was delighted with the fact, that he was actually a few years older than his own father. He was convinced that he was now bigger, stronger and taller than him as well!<br>\r\n<br>\r\nWhat was Andy going to do next?<br>\r\n</span></div></div>",
            "created":1164344400,
            "id":361244,
            "title":"The One-Minute Man"
        },
        "1251":{
            "choices":[
                "Aged 5 years, becoming 41",
                "Aged 10 years, becoming 46",
                "Aged 14 years, becoming 50"
            ],
            "content":"<div class=\"\"><div> <span>Andrew examined his entire body, muscle by muscle, thoroughly enjoying his new physique. Being older felt so darn good! The thirty six year old man with a twelve year old's mind absent mindedly pumped his slowly gorging manhood.<br>\r\n<br>\r\nYes, he thought as he brought himself to erection. It never occurred to him that he might need to get a towel or some kind to clean up after himself, as he was rather new to his sexuality. He pictured an incredibly hot babe gyrating on him, almost drooling at the image.<br>\r\n<br>\r\nHis hand increased the speed, gripping his manhood tighter, and he grinned wildly, his muscles tensing and showing sweat as he pumped.<br>\r\n<br>\r\n\"Yeah babe...ohh, yeah babe...ride me like a stallion.\" His cock was pulsing, he was getting close to climax.<br>\r\n<br>\r\nPictures streaming through his head, he outright screamed of pleasure when he came, hot white liquid splattering across the floor.<br>\r\n<br>\r\nSuddenly embarrassed by himself, he ran into the bathroom, still naked, to get a towel. He flexed his biceps and chest, bouncing his pecs a few times in the mirror.<br>\r\n<br>\r\nHe snapped himself out of it, and cleaned up his mess in the other room. Looking down at his body, he began to wonder what he might look like even older, and if rubbing his penis felt even better then. Well, mom was out, he decided with a cocky smirk, time to find out!<br>\r\n<br>\r\nConcentrating on aging, he...</span></div></div>",
            "created":1365289680,
            "id":1566623,
            "title":"Andy wishes to grow older"
        },
        "12511":{
            "choices":[
                "Go for a shirtless jog",
                "What the heck, age some more"
            ],
            "content":"<div class=\"\"><div> <span>Andrew grinned, thinking of growing older by five years. That should be just enough to experiment with his body, and see just how well he would be aging. Insofar, he liked the body he had quite a lot.<br>\r\n<br>\r\nDespite being in his thirties, his body was incredibly muscular and fit, and there were few signs of aging on his frame, or even on his face.<br>\r\n<br>\r\nThe feeling accompanying the change came back, even more intense this time, but also now a very erotic feeling.<br>\r\n<br>\r\nStanding almost ramrod straight, Andrew shut his eyes as he felt himself stretching, changing and aging further. He whispered in a heady, deep tone, \"Ohh, Yes...I will have to do this more, after this...\"<br>\r\n<br>\r\nWhen he opened his eyes, he was very much entranced with the new Andrew.<br>\r\n<br>\r\nWhile some tiny spots of gray could be seen in his hair, he was still an incredibly muscular man, and if anything, the five years gave him a certain presence. While there was some slight fat around the edges, he was still incredible looking.<br>\r\n<br>\r\nHe gripped his manhood in one hand, ohh, yes, it felt better.<br>\r\n<br>\r\nWith the other hand, he brushed through his scruffy beard, and grinned. What to do with such a body...</span></div></div>",
            "created":1373267220,
            "id":1624685,
            "title":"Aged 5 years, becoming 41"
        },
        "1252":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Andy ages other parts of his body",
                "Andy regresses other parts of his body"
            ],
            "content":"<div class=\"\"><div> <span>A wide grin appeared on the adult’s face. Here he was, only twelve years old, but he was in the body of a fully-grown man, who was in his mid-thirties. He could now get a drivers’ license and drive. He could walk in any bar or liquor store, and buy a drink. He could vote in the elections and he could get a job. This was so cool!<br>\r\n<br>\r\n“Wow… It’s awesome being big and older!” he chuckled as he continued to stare at his reflection.<br>\r\n<br>\r\nThen… Reality hit him. He was still a twelve year-old kid. Rather, he was supposed to be twelve years old. But, now he had this awesome amulet around his neck, which allowed him to change his age and make himself older in the process.<br>\r\n<br>\r\n“Darn, I gotta change back, before mom gets back…” he said to himself, feeling a bit disappointed.<br>\r\n<br>\r\nHe decided to remain the way he was for just a minute longer. He made a fist and flexed his left arm, admiring the bulging bicep which popped up on his arm. Wow… He felt so powerful and strong!<br>\r\n<br>\r\nThen, he did the same to the right arm, grinning of delight when he saw the huge muscle, which he never had before.<br>\r\n<br>\r\n“Gosh… I would have to wait over twenty years, before I could enjoy having a body like this…” he thought, as he turned sideways and examined his large, adult, naked body. “Instead, I can become an adult right now, even though I’m just twelve! This just rocks!”<br>\r\n<br>\r\nHe flexed his calves and then he tightened his arms, flexing his bulging pectorals. He was in heaven!<br>\r\n<br>\r\n“So, this is what it’s like to be a grownup…” he said in a soft voice. Every time he spoke, he thought he was hearing the voice of someone else. He couldn’t believe that it was coming from his own voice!<br>\r\n<br>\r\nThen, he looked down and gently placed his long fingers around his big, meaty cock. He stared at it in complete disbelief. His cock used to be such a thin, short little thing… It was like a little tube sticking out, barely wider than a stick of gum. Now, he was walking around with this enormous cock, which was almost two inches wide, and which was almost between 9 and 10 inches in length.<br>\r\n<br>\r\n“Wow… I’m gonna miss having this dick, after I regress back to my real age…” he said sadly. “I wonder…”<br>\r\n<br>\r\nHe turned around and grabbed the small piece of paper, which was on the table in his bedroom. He remembered that it said that he could also age any part of his body.<br>\r\n<br>\r\n“Hmmm…. I’d better regress back to being a kid again…” he pondered. “Better to be safe than sorry… I don’t want for mom to get back, and to find a full-grown grownup standing in her twelve year old son’s bedroom… She’ll freak out!”<br>\r\n<br>\r\nThen, he stood straight in front of the mirror, and uttered the words for his next age-changing wish.<br>\r\n<br>\r\n“I want to be twelve years old again…”<br>\r\n<br>\r\nSuddenly, that same tingling feeling, which he had felt before, started to spread over his body. It began in his stomach, just like last time, and now it spread to the rest of his body.<br>\r\n<br>\r\nThen, the actually transformation actually started to take place, where the adult began to regress as he grew younger. He aged in reverse, while his body slowly shrunk back to the days of being a pre-teen boy.<br>\r\n<br>\r\nHis skin changed and became smooth once again, as the fine coat of air began to disappear from his long, muscular legs. His legs became smooth and thin, shortening in the process. And just stared, as the mirror before him grew bigger and bigger, while his body slowly dwindled back to that of a kid.<br>\r\n<br>\r\nHis feet shrunk back, with his toes shortening first, followed by the actually feet reducing in width and in length. Then, his legs regressed back, as he flew threw puberty in reverse. <br>\r\n<br>\r\nNext, his torso shrunk back down, almost reducing to half the size it had been, for just a few moments. His long, muscular arms dwindled down until they were now the same, short, skinny arms he always had known up till now.<br>\r\n<br>\r\nNext, his shoulders began to shrink as his pectorals shrunk in size as well. The great, adult muscles were almost all but gone, and the scrawny kid was left standing completely naked in the middle of his bedroom, while he was just staring at his reflection in the growing mirror. The whole world seemed to be growing around him, as he continued to regress back over twenty years of his life.<br>\r\n<br>\r\nFinally, his head shrunk down and his neck became shorter. All the hair, that had grown on his chin, on his face, including his mustache, had faded away. Within just a few moments, the face had transformed back into the young, innocent look of that of a little boy. His ears had shortened as well as his eyes had grown smaller. His nose was smaller and his mouth was no longer so wide. His skin became smooth again, and he was left with the same, short hair, that he has always worn on the top of his head.<br>\r\n<br>\r\n“Well, I guess it worked…” the boy smiled, as he noted the high pitch in his squeaky voice that he has been used to hearing all his life. <br>\r\n<br>\r\nHe then looked down and examined his little, ten year-old body. He saw his little feet, his skinny, short legs, and then… He noticed his little, twelve year-old cock. It seemed so tiny, so short, so thin… He almost hated it.<br>\r\n<br>\r\n“Darn… I hate the thought of having to wait twenty years, before I can have an adult cock again…” he sighed. “If only, I could have a forty year-old cock right now, that would be so cool…”<br>\r\n<br>\r\nSuddenly, he felt that same war, odd, and tingling sensation inside of him. This time, the tingling started from his stomach and then moved towards the groin area.<br>\r\n<br>\r\nThe base of his cock suddenly started to widen, while the whole thing widened half an inch on either side. Then, thin, blue veins started formed on the top and on the side of his wide, short cock. Next, the short, 4 inch cock, started growing longer and longer, reaching 5 inches… 6 inches… 7 inches… 8 inches… 9 inches… finally stopping just a little beyond the length of nine inches in all!<br>\r\n<br>\r\n“Wow! It really works!” he cheered, as he looked down. He was still twelve years old, but he was now walking around with an enormous, nine-inch-long, adult cock!<br>\r\n<br>\r\n“That’s so cool… I’m the only twelve year-old kid in the world, who’s walking around with a forty year-old cock!”<br>\r\n<br>\r\nHe decided to keep his large cock for awhile, and to hide it as long as he could. He slipped back into his own underwear, but the thing was just too tight, and it felt very uncomfortable. Then, he just took it off again, and slipped into his swimming trunks instead. These were not as tight as his Speedos, so he still had plenty of room in the front.<br>\r\n<br>\r\n“Oh well, I’ll just wear the swimming trunks instead and I’ll tell mom that I might go for a swim in the morning!” he mused. It was such a perfect plan!<br>\r\n<br>\r\nThen, he quietly raised up the covers from his made-up bed. He gently slid each of his legs under the covers, grinning at the sight of his huge bulge in his swimming trunks. He gently reached down with his right hand and felt the bulge in his trunks. It felt great.<br>\r\n<br>\r\n“I’m gonna have so much fun with my ‘Ageless’ amulet…” he grinned to himself in silence. He could now make himself just about any age he wanted to, and still keep his mind the same he was now. He pondered for a moment, what he would try to do the following day. Then, he dozed off into a deep sleep, just moments before his mom was about to walk in the door.</span></div></div>",
            "created":1164430800,
            "id":361384,
            "title":"Regression to the future"
        },
        "12521":{
            "choices":[
                "Matt arrives and they try the amulet together",
                "Andy turns into an adult again before Matt arrives"
            ],
            "content":"<div class=\"\"><div> <span>Next day, Andy woke up excited. What was going to do with his new power?<br>\r\nHe searched his mom but he didn't find her. Then, he saw a note on a table:<br>\r\n<br>\r\n\"Andy, I must work all the day, you'll be alone until tonight. You are old enough to stay alone, aren't you?  --Mom\"<br>\r\n<br>\r\n\"Perfect!\" he whispered smiling.<br>\r\n<br>\r\nYes, Andy was old enough and he confirmed it looking at his huge bulge in his swimming trunks. He gently touched it with his hands. It felt great...<br>\r\n<br>\r\n\"I'd like to become an adult right now, but...\"<br>\r\n<br>\r\nHe didn't have clothes that fit him. And also people wouldn't recognize him and he wanted to show his body to someone. Then he thought...<br>\r\n<br>\r\n\"If this amulet aged my cock, then it can age my muscles while maintaining my age.\" he said excited.<br>\r\n<br>\r\nThen his body started to feel warmer again. He was starting to get used to it.<br>\r\n<br>\r\nAll his muscles started to become bigger and bigger. This time, however, he wasn't becoming taller.<br>\r\n<br>\r\nHis biceps seemed bowling balls now. And his chest and pecs were becoming wider. He quickly felt a weight increase in all his body, specially his arms.<br>\r\n<br>\r\n\"Awesome! I'm a new, big and stronger Andy! And people will still recognize me!\" he said excited. \"I am... I am Super Andy!\" he said while looking at his muscular body. He really seemed a super hero boy.<br>\r\n<br>\r\nFortunately this time all his clothes were still intact. He only felt them very tight. He started to touch all his body, it felt great specially his biceps. And his bulge was still there.<br>\r\n<br>\r\nHe started to do poses staring at the mirror, showing his muscular body and his bulge.<br>\r\n<br>\r\n\"I'm even stronger than Matt!\"<br>\r\n<br>\r\nMatt was his best friend. They shared a lot of qualities, but Matt always had been stronger than him.<br>\r\n<br>\r\nWhat a idea! He ran to the phone. He was going to call Matt.<br>\r\n<br>\r\n\"Matt! Come to my house! I have to show you something incredible!\" he said.<br>\r\n<br>\r\n\"What's it?\" Matt asked.</span></div></div>",
            "created":1166072400,
            "id":365596,
            "title":"Super Andy!"
        },
        "125211":{
            "choices":[
                "They decide to take off the talisman",
                "They decide to stay with the merged body but become a kid"
            ],
            "content":"<div class=\"\"><div> <span>Andy was very excited. He was going to show his new body to his best friend. He was staring at the mirror again when the doorbell rang.<br>\r\n<br>\r\n\"It's open!\" he shouted.<br>\r\n<br>\r\nMatt entered Andy's house.<br>\r\n<br>\r\n\"Hello? Andy? Where are you?\" Matt asked.<br>\r\n<br>\r\nSuddenly, a muscular boy appeared wearing only swimming trunks.<br>\r\n<br>\r\n\"Don't call me Andy... I'm Super Andy!\" Andy said smiling.<br>\r\n<br>\r\nMatt couldn't believe what was seeing. Yes, it really was his best friend Andy. But it wasn't his body. Since they were babies, Matt always was a bit taller and stronger than his friend. Andy was still shorter than him, but now he was wider because of his muscles. They had grown a lot! Then he saw another thing even more incredible: his bulge.<br>\r\n<br>\r\n\"Whoah! Is... Is that package yours? It's huge for our age!\" he said. Andy couldn't do anything but laugh.<br>\r\n<br>\r\n\"Please, tell me what happened here.\" Matt said.<br>\r\n<br>\r\nThen they went together to the sofa. Andy told him all the story about the talisman.<br>\r\n<br>\r\n\"...and now I'm here with you, with my super muscular body and a 40 years old cock.\" he concluded.<br>\r\n<br>\r\n\"Awesome!\" was the only word that Matt could say.<br>\r\n<br>\r\n\"You are my best friend, I only want to share this with  you. No one must know that this talisman has these magical powers.\" said Andy.<br>\r\n<br>\r\n\"Of course, I won't tell anyone about this.\" said Matt. Andy smiled. Then, there was a silence...<br>\r\n<br>\r\n\"Andy... Can... Can I use it? I'd like to know how it feels being an adult...\" said Matt nervous.<br>\r\n<br>\r\n\"Of course! We will become grown ups together. I hope that as adults you won't be taller than me anymore!\" Andy said and both laughed. Matt was excited.<br>\r\n<br>\r\n\"Wait a moment. You should get naked or you will rip all your clothes.\" said Andy. Matt quickly understood and started to throw off his clothes.<br>\r\n<br>\r\n\"I think these swimming trunks won't fit me anymore...\" and Andy also started to get naked. Matt was already naked. When Andy threw off his swimming trunks, Matt saw his cock.<br>\r\n<br>\r\n\"Man! It's really big! I can't wait for having one like that!\" said Matt. Andy did some poses smiling and laughing.<br>\r\n<br>\r\n\"Then, don't lose more time! Take the talisman and make your wish real.\" Andy took the talisman and gave it to his best friend.<br>\r\n<br>\r\nThen something happened! Andy's muscles started to get smaller until they became the same muscles he had some minutes ago. His cock also quickly was reduced to his original state. They understood what was happening.<br>\r\n<br>\r\n\"So, the talisman effects only remain when you are wearing it.\" said Matt. \"Hey boy, you aren't Super Andy anymore! I'm stronger than you again! Haha!\" Both laughed.<br>\r\n<br>\r\n\"This is a problem then. Only one of us can be an adult.\" said Andy sadly. Then Matt got an idea.<br>\r\n<br>\r\n\"And what if... we use the talisman together?\" said Matt. They smiled to each other one and quickly introduced their necks and heads in the talisman.<br>\r\n<br>\r\n\"Are you ready?\" said Andy excited.<br>\r\n<br>\r\n\"We want to be adults!\" the boys shouted.<br>\r\n<br>\r\nMatt closed his eyes smiling, and Andy knew that their bodies were going to start getting warmer. But didn't feel any change.<br>\r\n<br>\r\n\"Aw... This doesn't work... We will have to test it separat...\" and before Matt could finish his phrase a white flash light appeared!<br>\r\n<br>\r\nAfter some seconds...<br>\r\n<br>\r\n\"Whoah! I feel very weird...\" a naked man appeared. \"Andy? Andy? Where are you?\" asked the man.<br>\r\n<br>\r\nThat man was Matt. When he noticed he was a grown up he looked at his new body. He was a very muscular man too, and finally had the same cock his best friend had some minutes ago. It was a very good feeling.<br>\r\n<br>\r\n\"Ugh... Matt, I'm here.\" a voice sounded.<br>\r\n<br>\r\n\"Where?\" asked Matt. He didn't know where that voice came from.<br>\r\n<br>\r\n\"I think I'm inside your body...\" said Andy.<br>\r\n<br>\r\nMatt's body started to run without knowing how to the nearest mirror.<br>\r\n<br>\r\n\"We... Are... One?\" they said together staring at the mirror. They were sharing the same body. The reflection of the mirror showed a person that seeemed to be an adult version of Andy, but also an adult version of Matt. It was confusing and funny at the same time! They started to rub their biceps, pecs, calves... It felt great.<br>\r\n<br>\r\n\"Cool! This rocks!\" they said smiling.<br>\r\n<br>\r\n\"How do you feel Matt? Do you like being an adult?\" said Andy while they were doing poses showing their muscles to theirselves.<br>\r\n<br>\r\n\"Yes!\" he exclaimed. \"Look at our muscles! They are giant! And what about our dick? It's enormous!\" he said as they grabbed their cock.<br>\r\n<br>\r\n\"What can we do, Matt? Now we share the same body. We should take advantage of it!\" said Andy.</span></div></div>",
            "created":1166158800,
            "id":365890,
            "title":"One + One = One"
        },
        "1252112":{
            "choices":[
                "Andy's mother was there (Epilogue)"
            ],
            "content":"<div class=\"\"><div> <span>\"We can't go outside with this body, we don't have any adult clothes!\" said Andy.<br>\r\n<br>\r\n\"But we have kid clothes!\" said Matt.<br>\r\n<br>\r\n\"Are... Are you sure? You wanted to be an adult, don't you?\" asked Andy.<br>\r\n<br>\r\n\"Yes! But I discovered that being in the same body that you is even better. I love this feeling of being two in one. I don't mind being a kid.\" said Matt.<br>\r\n<br>\r\n\"Then we can wish it now... We want to be twelve years old again!\" they said together.<br>\r\n<br>\r\nThis time they felt the heat on their bodies. Their body started to age in reverse. They decided to close their eyes and open them when the changes finished.<br>\r\n<br>\r\n...<br>\r\n<br>\r\n\"I think it's over, Matt.\" said Andy.<br>\r\n<br>\r\nThen, they opened their eyes.<br>\r\n<br>\r\nMirror reflected something they never expected: a muscular 12 years old boy!<br>\r\n<br>\r\n\"What happened to us!?\" said Matt overwhelmed.<br>\r\n<br>\r\n\"Think on it! This body is a mix of our bodies, isn't it? So all our muscles are mixed too! We are like Super Andy, but this time we didn't wished to age our muscles because these ARE our real muscles! Cool!\" said Andy excited.<br>\r\n<br>\r\nThis is the first time Matt felt that small but strong body. They were staring at the mirror. First they saw Andy's face, but then it seemed to be Matt's face. It was a mix. All his body was inflated. They were like a pre-teen bodybuilder. Matt loved it when he rubbed his pectorals and biceps. Finally, Matt saw their cock. Andy wasn't surprised when Matt grabbed it with their right hand.<br>\r\n<br>\r\n\"Well... It's smaller than Super Andy's cock. But it is still the biggest pre-teen cock!\" said Matt smiling.<br>\r\n<br>\r\n\"I can't wait for test this body. Let's dress us!\" said Andy.<br>\r\n<br>\r\nThey got Andy's swimming trunks, because Matt's underwear could be too tight for that package. They looked at their bulge, it was very cool. Then they took Matt's trousers and Andy's t-shirt. They decided that mixing their clothes could be funny. When they were ready they returned to the mirror again.<br>\r\n<br>\r\nNow it reflected the same young bodybuilder but dressed. The t-shirt was very tight for their muscles and their bulge was still noticeable. They made a fist and flexed their right arm, admiring the bulging bicep which popped up on their arm.<br>\r\n<br>\r\n\"Well... Let's go! Maybe our mates are playing soccer at the park.\" Andy said.<br>\r\n<br>\r\n\"And what about us? We should have a name. Let me think... What about... We are Matt and Andrew... Mattrew?\" said Matt.<br>\r\n<br>\r\n\"Yes! I love it!\" said the new Mattrew. Then they ran outside.<br>\r\n<br>\r\nThat body was perfect for running. They were faster than ever. People looked to that athletic boy. They arrived to the park very fast.<br>\r\n<br>\r\n\"Look! It's Matt!\" said one of the kids when they saw Mattrew body appearing.<br>\r\n<br>\r\n\"Matt? Impossible! He is strong, but not that wider!\" said another kid. \"It's seems Andy for me... Look at his face.\"<br>\r\n<br>\r\n\"Hi guys! Can I play with you?\" said Mattrew.<br>\r\n<br>\r\n\"Who are you?\" asked a girl. She was confused because when she looked at him he saw at the same time Andy and Matt. That boy was very handsome with that muscles and his... bulge.<br>\r\n<br>\r\n\"My name's Mattrew. I am Andy and Matt merged into one.\" said Matt.<br>\r\n<br>\r\n\"What are you doing, Matt?\" said Matt in their mind. \"No one must know our secret!\"<br>\r\n<br>\r\nFortunately, at that moment the talisman made a small white light glow.<br>\r\n<br>\r\n\"Whoah! Incredible! You guys look very great merged!\" said one of the kids.<br>\r\n<br>\r\nThe talisman made the boys believe on Mattrew, but they couldn't ask how they did it. That way Matt and Andy were safe but people could recognize Mattrew as a merged version of them. Mattrew couldn't do anything but smile.<br>\r\n<br>\r\n\"You should never have trouble getting a date!\" said another kid looking at Mattrew's huge bulge.<br>\r\n<br>\r\n\"Well... We don't know, we merged our bodies today.\" said Mattrew laughing. \"Hey! I wanna play soccer!\"<br>\r\n<br>\r\nThey played soccer for some hours until moon appeared in the sky. He was the best player, everyone wanted to be in the same team that Mattrew. Matt and Andy were very happy.<br>\r\n<br>\r\n\"It was very funny playing with you but now we have to go...\" said Mattrew.<br>\r\n<br>\r\n\"Ok. We will see you tomorrow, Mattrew?\" asked one of the boys.<br>\r\n<br>\r\n\"Maybe... Goodbye!\" and Mattrew quickly disappeared running.<br>\r\n<br>\r\n\"Shit! I forgot that mom will return in some minutes!\" said Andy when they were running fastly. \"We should get back to our real bodies. Let's back home quickly!\"<br>\r\n<br>\r\nWhen they arrived Andy's home...</span></div></div>",
            "created":1166245200,
            "id":366062,
            "title":"Call me Mattrew!"
        },
        "125212":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Andy grows again",
                "Matt and Andy go somewhere"
            ],
            "content":"<div class=\"\"><div> <span>“I’m gonna pull a surprise on Matt” Andy thought to himself, as he continued to stare at his huge muscles in the mirror. “This is just too good to be true!”<br>\r\n<br>\r\nThen he stood still and stared at his reflection in the mirror.<br>\r\n<br>\r\n“Now make all of me age until I am thirty years old!”<br>\r\n<br>\r\nSuddenly, his body started to grow taller as he started to age. His face became longer and a slight stubble began to form on his chin and on his face around his mouth. He grew a mustache as while his hair on his head grew longer as well.<br>\r\n<br>\r\nAs Andy continued to grow taller, his arms and legs grew thicker and longer at the same time. His face aged and he became older, losing his youthful looks at the same time. His chest pushed out even further while his shoulders grew wider. Within moments, the short but muscular boy had transformed into a thirty-year-old man!<br>\r\n<br>\r\n“Yes, I’m a man now…” he said. He was startled when he heard his baritone voice. <br>\r\n<br>\r\nDING DONG!<br>\r\n<br>\r\n“There’s Matt!” the man said, as he turned around and ran down the stairs. He laughed when he realized how easy it was to run down, now that he had his long, stronger legs.<br>\r\n<br>\r\nAs soon as he got to the door, he opened the door. Luckily, he was wearing spandex shorts but no shirt.<br>\r\n<br>\r\n“Hi…” Matt said, as he stared at the adult.<br>\r\n<br>\r\n“Hello…” Andy replied. He decided to play along for a moment.<br>\r\n<br>\r\n“I’m sorry… I must be at the wrong place… I’m looking for a guy named Andy…”<br>\r\n<br>\r\n“You’re at the right place. Please come in, young man…”<br>\r\n<br>\r\n“Uhh… Are you his relative?” Matt wondered as he walked in the door. “I thought Andy’s father looked different…”<br>\r\n<br>\r\n“Yes, I’m related…”<br>\r\n<br>\r\n“So… Is Andy home?” Matt asked him.<br>\r\n<br>\r\n“Yes! In fact, he is right here!” the strange man replied.<br>\r\n<br>\r\nMatt just tilted his head as he stared at the man with a confused look on his face.<br>\r\n<br>\r\n“Where?”<br>\r\n<br>\r\n“I’m Andy!” the grownup man replied with a smile on his face.<br>\r\n<br>\r\n“Excuse me… But, Andy is a kid! You’re a grownup!” Matt pointed out.<br>\r\n<br>\r\n“Okay then… Watch this!” the large man chuckled.<br>\r\n<br>\r\nSuddenly, the adult started to shrink down until he was just a few inches shorter than Matt. His muscles shrunk down at the same time, while his arms and legs became shorter and thinner. He lost all the air on his face, and he gained the youthful look on his face again.<br>\r\n<br>\r\n“Oh my God…” Matt gasped as he watched the transformation as it occurred right before his own eyes.<br>\r\n<br>\r\nWithin moments, the tall, muscular grownup had transformed into the twelve year-old boy, who Matt had always known as his best friend in school.<br>\r\n<br>\r\n“Andy!!! How… What… How did you do that?” Matt gasped out loud.<br>\r\n<br>\r\n“It’s a long story… Basically, I can change my age!” Andy explained to his friend. “Thanks to my magic talisman!”<br>\r\n<br>\r\n“This is weird…” Matt whispered as he stared at his friend in disbelief.<br>\r\n<br>\r\nWhat was Andy going to do next?</span></div></div>",
            "created":1166245200,
            "id":366122,
            "title":"A surprise for Matt"
        },
        "13":{
            "choices":[
                "Andy regresses to a 6 years old boy"
            ],
            "content":"<div class=\"\"><div> <span>\"I’m going out tonight, Andy.\" June said to him.<br>\r\n<br>\r\n\"What!? Don’t tell me you’re going out with Jonathan again?” Andy replied annoyingly.<br>\r\n<br>\r\n\"Yes, and please respect him. Dad has rebuilt his life again, and I'm trying to do the same.\" she said.<br>\r\n<br>\r\nHe didn't hate Jonathan at all. In fact, Andy thought he was the perfect person for his mother. But since she met him for the first time, she were spending a lot of time with him. And Andy didn't like that, because he had to stay home alone.<br>\r\n<br>\r\n\"And what about me?\" Andy asked.<br>\r\n<br>\r\n\"Well... You're old enough to stay at home alone, aren't you?\" She said smiling. \"I have prepared your favorite dinner, it's in the kitchen. Sorry I have to go, dear.\" She said, and kissed him. \"Be a good boy!\"<br>\r\n<br>\r\nAndy didn't say anything. June ran to the door and left home. He heard the sound of the keys.<br>\r\n<br>\r\n\"Old enough... Old enough...\" he thought. \"When I was younger, dad and you were always taking care of me. And now I have to stay home every Saturday night while you have fun.\"<br>\r\n<br>\r\nAndy sighed. He started to look around the house. It was in silence.<br>\r\n<br>\r\n\"Home alone... Again...\" he said angry.<br>\r\n<br>\r\n\"Let me check out the loot for today…\" he said, as he walked back into his room and removed the small, square box from his pocket in his jeans. He then opened the box and carefully removed the small gem from the box. All he needed was something to hang it from, so he could hang it around his neck.<br>\r\n<br>\r\n\"So… This thing makes me 'Ageless', huh?\" he chuckled. \"Yeah, right…\"<br>\r\n<br>\r\nAndy grabbed some fishing wire, he cut a piece of the thin, transparent wire, and he made a knot in it. He ran the gem through the end of the wire, so that it hung nice and study. Nothing was going to pull the amulet from around his neck.<br>\r\n<br>\r\n\"This is gonna be my good luck charm.\" he whispered to himself.<br>\r\n<br>\r\nHe returned to the kitchen with tears in his eyes.<br>\r\n<br>\r\n\"If only... If only I were 6 again, then Mom would have to stay here with me.\" he said.<br>\r\n<br>\r\nSuddenly, his body was overcome by a warm feeling...<br>\r\n<br>\r\n\"Ugh... I don't feel any good.\" he thought to himself.<br>\r\n<br>\r\nAnd then he started to feel some changes on his body.</span></div></div>",
            "created":1165726800,
            "id":364708,
            "title":"Home Alone"
        },
        "131":{
            "choices":[
                "Andy wishes to be a grown man in order to reach high places",
                "Andy returns to his normal age, for now..."
            ],
            "content":"<div class=\"\"><div> <span>Then, he felt his body getting warmer and warmer. It was as if he was suddenly beginning to show signs of running a slight fever. His head and throat felt warm, and his muscles and joints began to feel sore as well.<br>\r\n<br>\r\nHe started to feel tickles on all his body when he noticed that his hands were getting smaller. But not only his hands! All his body was shrinking. He felt how his muscles and his extremities were getting smaller and everything around him was getting bigger. Andy couldn't believe what was happening to his body, but he was enjoying it!<br>\r\n<br>\r\nWhen the transformation stopped Andy couldn't do anything but look at his body. He was a little boy again, he was 6 years old as he wished.<br>\r\n<br>\r\n\"The amulet did this, I know!\" He said happily. Suddenly he noticed his new voice, a childish voice.<br>\r\n<br>\r\nHe ran cautiously to the nearest mirror, his clothes didn't fit him and he could fall. His body was so small and cute! His skin was very soft. He smiled.<br>\r\n<br>\r\n\"I have a new power... And it's very cool!\"<br>\r\n<br>\r\n\"I wanna play.\" he thought. \"I wonder if I can enjoy my old toys again.\"<br>\r\n<br>\r\nHe didn't mind about the oversized clothes and returned to his room, then opened his now-giant closet.<br>\r\n<br>\r\n\"Whoah! It's so big!\"<br>\r\n<br>\r\nAndy's old toys were at the top of his closet. But with his little body he couldn't reach it.</span></div></div>",
            "created":1165813200,
            "id":364992,
            "title":"A little boy again!"
        },
        "1311":{
            "choices":[
                "Andy returns to his 6 years old body",
                "Andy decides to stay as an adult"
            ],
            "content":"<div class=\"\"><div> <span>\"I need an adult. I can't reach my toys!\" he thought.<br>\r\n<br>\r\nThen, he stopped for some seconds.<br>\r\n<br>\r\n\"Why not?\" he wondered. \"I can become an adult with this thing!\" he said smiling.<br>\r\n<br>\r\n\"I wish I were a grown man.\" he said taking the amulet with his small hands.<br>\r\n<br>\r\nSuddenly, he started to feel weird again. This time, however, he knew that he was going to change so he was prepared.<br>\r\n<br>\r\nAll his body was starting to get warmer, until the heat filled all his body. Then the changes started...<br>\r\n<br>\r\nAll his muscles started to grow very fast. They were inflating like balloons. Andy's clothes weren't oversized anymore, in fact they were starting to get too tight for his new body.<br>\r\n<br>\r\nHis torso got wider, and also his legs. Meanwhile, Andy was starting to see the room smaller... He was becoming taller!<br>\r\n<br>\r\nRIP!<br>\r\n<br>\r\nHis clothes ripped. He knew that they were going to be useless from now on so he decided to tore all his clothes with his new big hands, leaving himself now completely naked!<br>\r\n<br>\r\n\"Mom is gonna get upset.\" he said. Then he quickly put his hands on his mouth.<br>\r\n<br>\r\n\"Whoah! Is... Is this my voice?\" he asked to himself, enjoying the sound of his new adult voice.<br>\r\n<br>\r\nFinally the changes stopped, and the warm in Andy's body started to go away.<br>\r\n<br>\r\nAndy was now seated at the floor. He started to look at his new body. He was huge! He was very muscular and quickly felt a new strength in his giant biceps.<br>\r\n<br>\r\nNow that he was naked he could see a new coat of hair in places that he never had. And his cock... His cock was bigger too.<br>\r\n<br>\r\nHe ran to the mirror again, he wanted to see his full body. He noticed that his face changed too, it was an adult face. When he was staring at the mirror he smiled and started to do poses showing his muscles.<br>\r\n<br>\r\n\"I am an adult, a grown up, a MAN! This is very cool! Look... Look at my muscles! I'm a strong giant! Now I can reach any place or lift anything!\" he cheered.<br>\r\n<br>\r\nHe returned to his room. When he saw the box containing his toys he took it without any effort. It was very light! Then he left it on the floor.<br>\r\n<br>\r\n\"Haha! It was too easy!\" he said.<br>\r\n<br>\r\nHe was still completely naked, but he didn't mind. In fact, he was enjoying it.<br>\r\n<br>\r\n\"This is AWESOME!\" he said looking again at his body.</span></div></div>",
            "created":1165899600,
            "id":365181,
            "title":"Andy gets bigger!"
        },
        "13111":{
            "choices":[
                "His mom comes home",
                "He got bored of being 6"
            ],
            "content":"<div class=\"\"><div> <span>After getting his old toys down due to him wishing he was a grownup. Of course at the moment he was way too old to play with these. So he wished to become 6 once again.<br>\r\n<br>\r\nLike last the time he wished to be 6, his body's aging went in reverse. All the features he had gotten when he wished to be older started to go away. His voice started to crack as his re entered teenhood. After a minute he was back to being 12 but of course it didnt stop since Andrew wanted to be 6. After a little bit, he was 6 again and naked.<br>\r\n<br>\r\nLuckily for him so of old clothes were in those boxes and he found some clothes that he wore when he was 6. Andrew started playing with the toys and a hour later..</span></div></div>",
            "created":1181970000,
            "id":417160,
            "title":"Back to being 6"
        },
        "131112":{
            "author_id":"starwars13",
            "author_name":"Lord Hugo Prosperio",
            "choices":[
                "Up (to 25)",
                "Down (to 3)"
            ],
            "content":"<div class=\"\"><div> <span>\"I Don't want to be six anymore!\" said Andy with his childish voice. <br>\r\n<br>\r\nHe neatly stored his toys back in their box and then thought about the age he'd like to be. <br>\r\n<br>\r\n\"Do I wanna go Up, or...go Down?\" He asked aloud. </span></div></div>",
            "created":1189486800,
            "id":443920,
            "title":"Up or Down?"
        },
        "1311122":{
            "author_id":"starwars13",
            "author_name":"Lord Hugo Prosperio",
            "choices":[
                "Change Ages Again",
                "Explore"
            ],
            "content":"<div class=\"\"><div> <span>\"I Wish I were three years old!\" you say with a giggle as the amulet glows and you start to shrink in age again. Your limbs shrink and gain back baby fat as you head towards toddler years. You feel your legs shrinking closer to you, as well as your arms. <br>\r\n<br>\r\n\"I Wuv dis feeling!\" you say as your regression finishes. <br>\r\n<br>\r\nYou look around and everything is huge, and you are amazed by all you see. <br>\r\n<br>\r\nDo you decide to...</span></div></div>",
            "created":1191560400,
            "id":450632,
            "title":"Down to Three"
        },
        "13111221":{
            "choices":[
                "A baby",
                "Other age"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Andy thinks for a moment and comes to a decision. \"I know! I wish I was...\"</span></div></span></div>",
            "created":1256446800,
            "id":781569,
            "title":"Change Ages Again"
        },
        "13111222":{
            "author_id":"milatyme",
            "author_name":"Milatyme",
            "choices":[
                "Become older",
                "Stay 3"
            ],
            "content":"<div class=\"\"><div> <span>As Andy began to explore he noticed some thing splashing on his feet. He quickly looked down to see what it could be. When he looked down he saw he was peeing. He then turned around to see if he made a trail and he did. \"Mommy won't wike whis.\" He was lucky that he remembered there were some old pull-ups in the attic, but he would have to become older to get them and then he won't need them anymore. </span></div></div>",
            "created":1278133200,
            "id":910845,
            "title":"Explore"
        },
        "131112221":{
            "author_id":"lewok99",
            "author_name":"Lewok",
            "choices":[
                "Diapers",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Andy decided he better get the diapers since making a mess would probably get him in trouble.<br>\r\n\"I wish I was 18.\" he said as he began to grow again. When he finished growing he headed up into the attic to look for the diapers. He go up there and started looking around. He found many interesting things: Christmas decorations, old clothes, a few antiques but one thing in particular caught his eye it was.....</span></div></div>",
            "created":1318741200,
            "id":1207889,
            "title":"Become older"
        },
        "1311122211":{
            "author_id":"lewok99",
            "author_name":"Lewok",
            "choices":[
                "Baby diapers. Duh",
                "Adult diapers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He found the diapers he was looking for, but what size were thy?</span></div></span></div>",
            "created":1318824420,
            "id":1207890,
            "title":"Diapers"
        },
        "13111222112":{
            "author_id":"lewok99",
            "author_name":"Lewok",
            "choices":[
                "Anyhow ignores it and uses the diapers",
                "Anthony has fun with the information"
            ],
            "content":"<div class=\"\"><div> <span>After wearying through the attic for a few minutes, Andrew managed to find two different packs of diapers, but when he looked at them he noticed they weren't regular diapers.<br>\r\n\"adult diapers?\" Andrew said to himself. \"why would they make adult diapers?\" he got an even closer look a d realized something else. <br>\r\n\"wait, these are girls diapers, and those ones are for guys.\" out of curiosity Andrew opened up the pack of boys diapers and tried one on. <br>\r\n\"these fit perfectly. Why would mom have these?\" and then it dawned on him.<br>\r\n\"I bet these diapers would fit dad, And those girl ones could fit mom.\" after coming to this realization he noticed that hidden behind some boxes were many large versions of baby items. There was a giant crib, a changing station, some suffer animals, And even a bunch of pacifiers. <br>\r\n\"this is really wierd, mom and dad were like big babies or something.\"<br>\r\nWhat next</span></div></div>",
            "created":1318824960,
            "id":1207896,
            "title":"Adult diapers"
        },
        "131112221121":{
            "author_id":"lewok99",
            "author_name":"Lewok",
            "choices":[
                "Adult diapers",
                "Regular diapers"
            ],
            "content":"<div class=\"\"><div> <span>Right now Andrew couldn't care less about what wierd stuff his parents used to do,  but he was furious about the adult diapers. <br>\r\n\"I guess I could always stay an adult and wear these diapers.\" he thought to himself. <br>\r\n\"or I could just go find some regular diapers.\"</span></div></div>",
            "created":1318827420,
            "id":1207924,
            "title":"Anyhow ignores it and uses the diapers"
        },
        "1311122211211":{
            "author_id":"propofthedead",
            "author_name":"propofthedead",
            "choices":[
                "the diaper tints yellow (success )",
                "you feel small but the diapers also feel the same way"
            ],
            "content":"<div class=\"\"><div> <span>Andrew sighed and decided there wasn't much he could do now. Not to mention the adult diapers are made to scale of baby diapers prints included. With that in mind he beought them down with him and got a thought in his head, \"maybe i can just regress the muscles that I use to pee or poop so that I need the diapers.\" Excited at the prospect of it he felt that he needed to pee soon anyway he might as well test it now<br>\r\n<br>\r\n\"I can't  hold my pee or poop like adult, I can only wet and mess myself like a baby,\" he said to himself and starts to feel tingly</span></div></div>",
            "created":1434260520,
            "id":1992270,
            "title":"Adult diapers"
        },
        "131112221122":{
            "author_id":"lewok99",
            "author_name":"Lewok",
            "choices":[
                "Yes she begins to feel weak",
                "Not it only works on Andrew "
            ],
            "content":"<div class=\"\"><div> <span>Andrew got a wicked little idea in his head. A prank that would he Would get back at his mom  with for leaving him home alone so much. He quickly started working on his plan. He brought all of the adult baby stuff down from the attic and set I up in the spare room. He then brought down the package of diapers for his mom and then hid them in the closet. Once everything was in place he went to his room, changed back to 12, and put on some new clothes. He waited for about 2 hours in his room unil his mother got home. He ran into the living room and waited for his mom to come in. <br>\r\n\"ok John I'll see you tomorrow night.\" Andrews mother said as John began to pull out of the driveway. Andrew ran up to his mother and gave her a big hug which she returned. \"well hello Andrew, I guess you missed me.\" she chuckled.<br>\r\n\"you could say that.\" Andrew said cryptically. While still in a hug, Andrew put his plan into action.'he grabbed the gem around his neck put it up against his mother and said \"I wish my moths had the muscles of a baby.\" <br>\r\nDid it work?  </span></div></div>",
            "created":1318825560,
            "id":1207908,
            "title":"Anthony has fun with the information"
        },
        "1311122211221":{
            "author_id":"lewok99",
            "author_name":"Lewok",
            "choices":[
                "She needed a plan",
                "She loved it"
            ],
            "content":"<div class=\"\"><div> <span>The gem began to glow and Andrews mother began to feel weak. She released Andrew from the hug and started stumbling across the room. <br>\r\n\"my body feels so weak.\" she said as she slipped onto the floor landing on her bottom. \"Andrew call the hospital I can't get up!!\" she said in a panic. Andrew just stood there. \"Andrew? What are you waiting for? Call an ambulance!!\" <br>\r\n\"dont worry mom everything is gonna be ok.\" Andrew says as he begins to grow back to his adult self. <br>\r\n\"Andrew?!! Whats going on?! Why are you growing?\" she said more and more panicked. <br>\r\n\"its ok mom I just think you need a break from going out for a while.\" Andrews moths was so confused. Confused and scared and feeling sick to her stomach. In her panic she didn't even realize that she had begun to wet herself. <br>\r\n\"now now mom, you shouldnt be wearing big girl clothes unless your gonna keep your undies dry.\" his mouse then looked down and realized what she had down. That had put her over the edge and she began to cry.<br>\r\n\"there there, let's get you all cleaned up.\" Andrew then grabbed the diapers from the closet and picked his bawling mother up and carried yen into the spare room. Andrews mother (who, in order to save time, will now be named Laura.) was speechless by the sight of the room, and the partial realization that her son found her old fetish items. \"now to get you changed.\" Andre said as he laid Laura on the changing table. He began undressing her until she was left with nothing on her except her bright red face. He then lifted up her legs with ease and began to put the diaper on her. Due to her lack of muscle strength Laura could only lay back as her son diapered her. Once it was finished andrew picked her up sat down on a rocking chair and laid her backside up over his knee. \"now mom I'm sorry but if your gonna wet your panties your gonna get a spanking.\" he said as he began swing at his mothers diapered behind. It didn't take long for her to start crying again and after a few smacks she was begging for mercy. Andrew finished spanking his mother and laid her down in the crib. He stuck a pacifier in her mouth turned off the light and left the room. With all the excitement Laura was physically and mentally exhausted. She passed out almost as soon as the lights went off.<br>\r\nShe woke up the next morning with a cold feeling between her legs, as she remembered the events of last night. Once she processed the information she realized</span></div></div>",
            "created":1318826760,
            "id":1207919,
            "title":"Yes she begins to feel weak"
        },
        "131112222":{
            "author_id":"credil",
            "author_name":"Credil",
            "choices":[
                "to stay 3 and try to convince his Mother over the phone from his made up story.",
                "to hit the sack, until his Mother finds him."
            ],
            "content":"<div class=\"\"><div> <span>Andy decided that he would just try to convince his Mother, that he mysteriously physically regressed to a 3 year old, and if he got some diapers from the attic would just raise unwanted questions and if his mother believes that story she couldn't blame him for making a mess anyway. <br>\r\n<br>\r\nThen he decided ...<br>\r\n<br>\r\n</span></div></div>",
            "created":1351213500,
            "id":1453683,
            "title":"Stay 3"
        },
        "13112":{
            "author_id":"bull_brick",
            "author_name":"Horns",
            "choices":[
                "\"Model Stars\"",
                "\"Candice at the Hospital\""
            ],
            "content":"<div class=\"\"><div> <span>Andrew stops to think for a moment<br>\r\n<br>\r\n\"If I want to stay as a grown-up I have to think of a way to get it past mom.\"<br>\r\n<br>\r\nSuddenly he decides to mull it over later and enjoy the advantages of being an adult. For two hours Andrew enjoys being an adult by playing with his cock, admiring his muscles in the mirror and looking at his christmas presents witch were previously inacessable on the top shelf in the closet.<br>\r\n<br>\r\nAfter two hours Andrew gets very bored with all of the things he was doing. As he is putting back his christmas presents he sees a box full of video tapes. He finds to interesting ones called \"Model Stars\" and \"Candice at the Hospital\"<br>\r\n<br>\r\nHe decides on.......</span></div></div>",
            "created":1171947600,
            "id":383435,
            "title":"Two hours of Fun"
        },
        "14":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Andy becomes an adult-baby-kid-teen... in random order!",
                "Andy randomly changes age... every hour!",
                "Andy alternates between teen, kid and adult... constantly!",
                "Andy goes from baby to adult and back, with stops inbetween",
                "Other age changing options for Andy (reserved - do not use - I will delete)"
            ],
            "content":"<div class=\"\"><div> <span>As soon as Andy got into the house, he ran into the bathroom and closed the door.<br>\r\n<br>\r\n\"Let's see what I can do with the talisman...\" he said.<br>\r\n<br>\r\nHe wished to become younger. The talisman glowed and Andy observed in the mirror how his body regressed from 12 years old to a little 5 year-old boy. His face became a little more round and his arms and legs gained some more baby fat while he dwindled down to just over 3 feet tall. He was so short now! He could barely glance over the bathroom counter!<br>\r\n<br>\r\nNext, he wished to be an adult! The talisman glowed for the second time, and he felt his arms, his legs, his hands and his feet growing at the same time! Luckily, he was only wearing his jock strap! Andy's body shot up by three feet, doubling in height! He grew from being a 5 year-old boy to being a 27 year-old man, standing about 6 feet tall! Hair sprouted everywhere as Andy's body bulged on all sides and his muscles inflated. He now had long legs and arms, and his feet were much bigger as well as his hands. <br>\r\n<br>\r\nFinally, he wished to be a teenager! He dwindled back down to about 5 foot 6 inches tall and 13 years old, losing 6 inches in height. He gained some more youth in his face and his arms and legs were a bit thinner than when he was 27. He also lost all the facial hair, and his chest and armpits were smooth again.<br>\r\n<br>\r\n\"Wow... This is great!\"<br>\r\n<br>\r\nSuddenly, the talisman glowed on its own! Did Andy use it too much?<br>\r\n<br>\r\nThe talisman began to glow and glow a bright blue color! Then, it vibrated like crazy! Andy became nervous as he almost started looking for scissors, wondering if he should take the talisman off?<br>\r\n<br>\r\nThen, something amazing happened! The talisman suddenly became absorbed into Andy's chest, along with the fishing wire, which disappeared! <br>\r\n<br>\r\n\"Hey! Where did it go?\" Andy wondered, just as his entire body started to glow a bright blue light, just like the talisman did before it disappeared! It was as if his entire body had merged with the talisman!<br>\r\n<br>\r\n\"Oh no! What's going on?\" he gasped out loud.<br>\r\n<br>\r\nSuddenly, Andy regressed in age, without him ever wishing it! His body dwindled in size as he became younger! Within moments, he had become a young, little, 1 year-old baby!<br>\r\n<br>\r\nHe lay on the ground for a minute until he glowed again, and he started aging! This time, Andrew became 10 years old!<br>\r\n<br>\r\n\"Oh no! I'm becoming older and younger... at random! My... My entire body has joined with the talisman!\" he gasped.<br>\r\n</span></div></div>",
            "created":1343865300,
            "id":1395663,
            "title":"Random Age Change! The talisman ages Andy at ra..."
        },
        "144":{
            "author_id":"nixon5",
            "author_name":"nixon5",
            "choices":[
                "Wait for Josh",
                "Next transformation is starting"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n<i>Let's check my actual situation: I found this magic talisman and I've done something wrong. It became a part of my body and I'm transforming into different ages. But I don't know how much time I've to spend in a special age. Actually I'm 10 years old but I don't know when and I don't know my next transformation.</i><br>\r\n<br>\r\nSuddenly your cellphone rings. It's your best friend Josh.<br>\r\n<br>\r\n\"Hey Andy, what's up?\"<br>\r\n<br>\r\n\"Nothing special. It's very boring.\" You're really shocked about your high pitched voice. <br>\r\n<br>\r\n\"Everything ok, Andy? Your voice sounds weird?\"<br>\r\n<br>\r\n\"Yeah I know. Do you have time to come to my house. I've to tell you something very important.\"<br>\r\n<br>\r\n\"Sure, I'll be there in 10 minutes.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1345196280,
            "id":1406466,
            "title":"Andy goes from baby to adult and back, with sto..."
        },
        "1441":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Andy grows a few years older",
                "Andy regresses into a little toddler "
            ],
            "content":"<div class=\"\"><div> <span>While Andy waits for Josh to arrive, he experiences another change!<br>\r\n<br>\r\nSuddenly, he ages to age 10 again, growing to his real age, size and height. When Josh arrives and walks in the door, he sees Andy like he's always been.<br>\r\n<br>\r\n\"Is this a joke? You look normal!\" he says. <br>\r\n<br>\r\n\"Give me a few minutes and you'll see what happens...\" Andy explains to his friend.<br>\r\n<br>\r\nJosh sat down on the chair as Andy sat next to him on the couch in the living room. Ten minutes had passed, when suddenly...<br>\r\n</span></div></div>",
            "created":1346319360,
            "id":1416759,
            "title":"Wait for Josh"
        },
        "14411":{
            "author_id":"nixon5",
            "author_name":"nixon5",
            "choices":[
                "Andrew transforms to 16",
                "Andrew transforms to 21"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n\"Josh you're my best friend. Therefore I'll tell you the truth: I've found an amulet. This amulet grants every wish for age progression or regression but I made a mistake. Actually the amulet is a part of my body and I'll change my age.\"<br>\r\n<br>\r\n\"That's weird, dude! But actually you're looking normal.\" <br>\r\n<br>\r\n\"Yeah but I was already an adult, a baby, a child, when we were on the phone togehter I was 10 years old.\"<br>\r\n<br>\r\n\"And what's next?\"<br>\r\n<br>\r\n\"I don't know, We'll see.\"<br>\r\n<br>\r\n\"Ok Andy but I don't want to wait hour after hour here. Let's go to the pool.\"<br>\r\n<br>\r\n\"Just a second, Josh. I feel strange...\"</span></div></div>",
            "created":1346345160,
            "id":1416870,
            "title":"Andy grows a few years older"
        },
        "15":{
            "choices":[
                "He plays baby",
                "He calls his friend James and asks him to come over",
                "He goes to a friend's house"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Andy wishes he was a talking and walking baby and it happened: He was a baby but he could talk and walk. What now...?</span></div></span></div>",
            "created":1180846800,
            "id":412983,
            "title":"walking,talking baby"
        },
        "152":{
            "author_id":"rex_torres",
            "author_name":"scriptboy",
            "choices":[
                "Andrew makes himself age 12 again",
                "Andrew remains a baby for a few minutes longer",
                "Andrew makes himself progress to age 16 next"
            ],
            "content":"<div class=\"\"><div> <span>Andrew wished he were a toddler and something happened! There was a flash of light and an odd tingling sensation all through his body. Next thing he knew, he was shrinking! No, he was regressing! He was rapidly becoming younger, just like he had wished. He quickly walked over to the mirror in his bedroom so he could see the changes and he just stood there, amazed, as his body transformed before his very eyes. <br>\r\n<br>\r\nAndrew saw his body shrink and regress. His arms and legs rapidly dwindled in size and length, making him rapidly become shorter. He suddenly regained his baby fat around his arms and legs and his head became a little rounder. His feet, his hands, his legs and his arms were suddenly toddler-sized! His fingers were tiny again! When he looked around the room, he noticed his BIG everything was again. Even his clothes were too big. His shirt was like a poncho and his shirt and underwear dropped to the floor. He was completely naked as he crawled across the floor because… he was a baby again!<br>\r\n<br>\r\n“Ohhh… Cool!” he mumbled using his cute toddler-voice. “Oh, wait! I can still talk! Nice!” <br>\r\n<br>\r\nHe crawled over to his bed where he managed to climb back on using his chair. It took more work, but he managed to climb on the chair and from there, he got back on the bed. <br>\r\n<br>\r\n“Whew… Everything is so high and big now…” he sighed, crawling across the bed to the where his pillow was. He grabbed his cell phone and used his tiny fingers to dial the number for James, one of his friends. <br>\r\n<br>\r\n“Hey… James? This is Andy! Yes… I know my voice sounds different! Yes! It’s really me! No joke! Yeah, come over to my house! I gotta show you something really, really cool! Yes! Come right up to my room when you get here! Okay! Bye!” he said before he ended the call on his iPhone. <br>\r\n<br>\r\nOnly a few minutes passed before there was a knock on the bedroom door. Andy just took a deep breath when the bedroom door opened and James walked in. James was also 12 years old, just like Andy was before. <br>\r\n<br>\r\nSo, what happens next?<br>\r\n<br>\r\n</span></div></div>",
            "created":1492565880,
            "id":2307239,
            "title":"He calls his friend James and asks him to come ..."
        }
    },
    "info":{
        "author_id":"rex_torres",
        "author_name":"scriptboy",
        "brief_description":"Andy is a 12 year-old boy who can make himself older or younger by using a talisman.",
        "created":1164257580,
        "description":"<td align=\"left\" class=\"norm\">Andy is a 12 year-old kid who finds an amulet. Whenever he wishes to become older or younger, the amulet will cause him to progress or regress to that age!<br>\r\n<br>\r\nAndy ties some study fishing wire around his neck and he runs the amulet through it before tying the knot. The amulet is always hanging around Andy's neck and can never be removed. Andy discovers he can now become any age he wants!<br>\r\n<br>\r\nAndy can also ask for any part of his body to age or regress as well!<br>\r\n<br>\r\nHave fun! <br>\r\n<br>\r\nPlease, no vore or cursing or killing allowed. And, no 1-liners. I will delete those!<br>\r\n<br>\r\nSex scenes are only allowed between characters who are described in the chapters as being 18 years old or older.<br>\r\n</td>",
        "id":1182065,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1492565880,
        "modified":1492565880,
        "pretty_title":"Ageless Andrew"
    }
}