{
    "chapters":{
        "1":{
            "author_id":"wolfcommander",
            "author_name":"Wolfwriter",
            "choices":[
                "Wait! What is going on and how did we get here?",
                "Go find a doctor",
                "Go to the police",
                "Stay as Joe; infiltrate his group again",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"My God,\" says Jeremy in a hushed whisper. \"If I could do that ...\" He trails off, and his lips begin to quiver. \"If I could do that I'd turn myself into a bra and hide in one of Elise Murtaugh's dresser drawers.\"<br>\r\n<br>\r\nYou punch him, not so hard that it will make him mad, but enough so that he knows that you're unhappy. Unfortunately, it just seems to roll off him.<br>\r\n<br>\r\n\"Stop joking around,\" says Quincy. \"This is serious.\" There's a worried tone in his voice, and he is quite pale; you're relieved that he seems as vexed as you. He peers at you closely. \"I think we should get you to a doctor.\"<br>\r\n<br>\r\nHis words are like a slap in the face. \"I'm not going to tell anyone about this,\" you retort. You glare at Jeremy. \"I'm kinda sorry I told you guys about it.\"<br>\r\n<br>\r\n\"But you don't know if this is, like, a stable condition or something,\" Quincy protests. \"What if you start melting?\"<br>\r\n<br>\r\n\"Then I'll go see a doctor.\"<br>\r\n<br>\r\n\"Can I touch them again?\" Jeremy asks. You swing around to gape at him, and he points at your globe-like breasts. \"They are ... magnificent!\" There is an ache in his voice.<br>\r\n<br>\r\n\"Pervert!\" You slap him, and much to your dismay find yourself haughtily tilting your chin, just like—<br>\r\n<br>\r\nYou catch sight of your reflection in Quincy's bedroom mirror, and bemusedly note that the expression is perfect. Maybe it shouldn't be a surprise: It is Elisabeth Winninger's face and body you're wearing, and you are giving Jeremy the exact same look she gave Karl Anderson the time he asked her, in the middle of biology class, if he could give her a \"pussyectomy\" and keep the excised body parts to masturbate with.<br>\r\n<br>\r\nYou sigh heavily through your nose, and close your eyes and concentrate. You're glad that your nerves go dead when you do this; it would probably hurt like fuck if you could feel it as your face and body and clothes shifted form. You start to turn back into yourself, but then wryly change your mind at the last minute, and shift into the form that got you into your present predicament. \"If you wanna touch my breasts now, go ahead,\" you say in Joe Purdell's dull, nasty, nasally voice. \"You can suck my cock while you're at it.\" Jeremy winces and gives you a dirty look. <br>\r\n<br>\r\nFor his part, Quincy shudders. \"Why would you ever turn yourself into him?\"<br>\r\n<br>\r\n\"Just to fuck around with him and the rest of that bunch,\" you shrug. \"How was I supposed to know they were gonna try robbing a liquor store the night I decided to punk 'em?\"<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1234996920,
            "id":649081,
            "title":"Just boring old me....or am I different?"
        },
        "11":{
            "author_id":"wolfcommander",
            "author_name":"Wolfwriter",
            "content":"<div class=\"\"><div> <span>Maybe it was bound to turn out this way. Probably it was all Joe Purdell's fault. At any rate, the whole business seems to have started that afternoon on the school bus, with him slapping you on the back of the head.<br>\r\n<br>\r\n\"Ow! Quit it, asshole,\" you'd shouted. But he'd just smirked when you'd turned around to glare at him. As well he might. He's a corn-fed, beef-stuffed, farm-bred behemoth: six-feet-and-four-inches of fat and muscle, most of it between his ears. Ugly, too, but he's strong and he's on the football team, so the girls flutter around him. <br>\r\n<br>\r\nHis friend Kenny sniggered. \"Whyncha kick his ass?\" he'd said.<br>\r\n<br>\r\n\"Not worth the trouble,\" Joe had sneered.<br>\r\n<br>\r\n\"I wasn't talking to you, dipshit,\" Kenny had retorted. He'd held your eye, and jerked his head toward Joe. \"Why don't you kick his ass, Barron?\"<br>\r\n<br>\r\nYou'd stared back evenly. \"I would, but I don't want to make him look bad in front of his boyfriends.\"<br>\r\n<br>\r\nKenny's eyes froze. \"What was that, smartmouth?\"<br>\r\n<br>\r\nFrom another seat Ivan Budnik guffawed. \"You heard him. He called you a homo, bro. What are you gonna do about it?\"<br>\r\n<br>\r\nIt was too late to back down, so you'd decided you might as well escalate matters. \"I called you a homo too, Budnik. Boyfriendzzzz. 'Cept you're so ugly, Igor, I doubt even a queen like Purdell could get it up long enough to give you a good fuck.\"<br>\r\n<br>\r\nWhen it was all over, you'd reflected that Budnik might have kept his temper if only you hadn't used that nickname he hates so much. As it was, only your very quick reflexes saved your face from being smashed open by the meaty fist Budnik threw your way without warning. <br>\r\n<br>\r\nThen there had been a lot of cursing and shouting, and screaming from the girls when the driver slammed the bus to a stop and came charging down the aisle. By that time you were on the floor near the back, and quietly used the emergency exit to slip off the bus. It was only half a kilometer across some open fields to your house, and you'd actually felt pretty good as you trudged along. There might be hell to pay tomorrow, but you'd be on your feet then instead of trapped in a bus seat, and your martial arts training could probably see you through the worst of it.<br>\r\n<br>\r\nIt was an unseasonably warm day for early March, but it had been unseasonably warm all week long. The weather was so nice you'd soon stopped keeping an eye out for cow shit and just let your mind drift lazily along. You knew these fields well—they belonged to the nearby agricultural college, but no one had ever stopped you from crossing them—and your curiosity was mildly piqued to see some new machinery near a spot your path would take you. It appeared to be a couple of trucks with some pumps on the back, clanking quietly away. You'd watched them with some slight curiosity as you approached, but they seemed to have been quietly abandoned, to work without supervision, and you'd soon lost interest.<br>\r\n<br>\r\nYou weren't sure why Budnik and his friends seemed to have it in for you. It's not like you were a real rival for any of them, in any arena. On the one hand, you were tall enough and strong enough and athletic enough that you couldn't be classified with weak prey like the guys who played chess every afternoon in the library. At the same time, you weren't tall enough for the basketball team or fast enough for the soccer team or big enough for the football team, so you weren't a rival on the field. You had had a few girlfriends in your time, but they had girls of their own, so you doubted there was any romantic jealousy. <br>\r\n<br>\r\n\"No, I think it is sexual jealousy,\" your friend Quincy had said one day when you'd broached the subject with him. (He was receptive to complaints about Budnik and his crowd; \"Queenie,\" they liked to call him.) \"You're pretty good looking, and with your shirt off ...\" He'd suddenly stopped short, and turned very red. \"Anyway, I bet there's a lot of girls they like who've talked about how cute you are,\" he'd said in a hurry.<br>\r\n<br>\r\nYou'd ignored his discomfiture, and just glanced at yourself in the bedroom mirror: short, messy brown hair; sky blue eyes; well-defined lips and chin. Yeah, you were good looking. As for the \"shirtless\" remark ... Yes, you were nicely toned, though not absurdly buffed. Actually, you'd often wondered what you'd look like if you did some serious weight training, just as you'd wondered what you'd look like with a goatee, or with longer, shoulder-length hair. But it hardly seemed worth worrying about. It would take a long time to get results like those, and if you didn't like them you'd either be stuck with them or have to get rid of them and return to scratch. Not for the first time, you'd reflected on the sad fact that you can't \"hack\" and alter your physical appearance like you can in some of your games—<br>\r\n<br>\r\nThe thought of your games waiting for you at home had cheered you up, and pulled your thoughts away from Budnik and on the fight on the bus. Yeah, maybe you'd start up a new game of Call of Duty 5. You were tired of your old character, and you'd started thinking about how to design a new one. You'd snickered at the thought that maybe for the new game you'd play a girl, and then actually gotten excited by the thought. Yeah, a new character would be good ... it would be fun designing a new one ... you might not even get to the game itself before supper ... you wished the choices in the game were a little more fine-grained, so that you could tweak things exactly as you wished. Your heart was pumping away with excitement and anticipation as you went, and your feet felt very light on the ground—<br>\r\n<br>\r\nAnd then suddenly there was no ground for your feet to lightly touch.<br>\r\n<br>\r\n* * * * *<br>\r\n<br>\r\nWherever you were, it was cold and black and thick, and even your thoughts seemed slow and smothered. Muzzily, you'd wondered where you'd got to, and how you'd got there; and it was only after you'd realized that you couldn't feel air and hadn't felt air for quite a long time that you'd begun to panic. You'd tried taking a breath, but nothing had happened, and the horrible thought \"I'm going to suffocate\" formed in your head. It had been followed by the even more horrible thought \"I've already suffocated, and now I'm dead,\" and for some time you could only stare into inky blackness with a feeling of stark horror<br>\r\n<br>\r\nBut the strange thing is, a person can contemplate the \"fact\" of his or her own death for only so long before getting bored. You have such a short attention span that it actually wasn't long before you'd muttered \"Fuck this\" and decided to try finding a way out of whatever you'd gotten yourself into. It was hard work, but you'd fought your way through what felt like sludge, and then felt yourself breaking through what felt like a surface, and with a sense of vast relief you'd pulled yourself onto long, bristly grass. <br>\r\n<br>\r\nThe sun was much closer to the horizon—it was very late afternoon by this point—and in the slanting light you'd seen you were about fifty yards from the trucks you'd glimpsed earlier. You looked around, and saw that you must have fallen into some kind of pit of quicksand. But the stuff was black, like tar, and thick, and when you'd reached out to touch it, you'd seen that your own hands and arms—and everything else, it looked like—was completely coated in the stuff. With a silent groan, you'd heaved yourself to your feet and set off again for your house.<br>\r\n<br>\r\n\"What the hell happened to you?\" Helen had said as you'd walked up to the front door. Your sister had been in the front yard, digging in the flower beds, and stared at you in shock. <br>\r\n<br>\r\n\"I don't want to talk about it,\" you'd grumbled.<br>\r\n<br>\r\n\"Mom'll kill you if you track that shit inside the house.\"<br>\r\n<br>\r\n\"Mom'll kill you if she hears you cussing like a whore,\" you'd retorted. Helen was two years older than you, but still lived at home, and your mother insisted on certain standards.<br>\r\n<br>\r\n\"Well, stay there and I'll get the garden hose,\" she replied. Mutely, you'd stopped and stood patiently, like a whipped dog, as she unreeled the hose and fiddled with the nozzle and turned the faucet on. A jet of water shot into your mouth, and you'd forgotten your early caution and blistered the early evening air with several Anglo-Saxon obscenities; Helen had ignored you and just kept spraying you with water. Then she'd lowered the nozzle and frowned. \"It's not coming off.\"<br>\r\n<br>\r\n\"Then I'll just scrub it off in the shower,\" you'd said, and brushed past her.<br>\r\n<br>\r\n\"You'll clog the drain,\" she'd said, and reached out to grab you. \"Ouch! Shit!\" she'd exclaimed, and pulled her hand back.<br>\r\n<br>\r\n\"What's wrong?\"<br>\r\n<br>\r\n\"That stuff!\" She peered at you. \"Doesn't it hurt?\" You shrugged and shook your head. \"Well, it stings and burns when I touch it!\"<br>\r\n<br>\r\n\"So don't touch it. Just leave me the fuck alone.\" And with that, you'd passed into the house.<br>\r\n<br>\r\nIn fact, the stuff didn't come off in the shower, no matter how you pulled and scrubbed at it. But it did change color and texture. It started off black and sludgy, but then turned an off-white color, and eventually took on a fleshy tone; it also thickened and hardened, becoming rubbery, before softening and taking on fleshy feeling. Beneath this \"skin\" you could feel something like bones and tendons and even a tracery of veins. You were puzzled, and even a little alarmed by this, and wondered if the stuff had seeped like poison through your skin. But that alarm was as nothing when you'd glanced down and seen your masculine pectorals suddenly begin to droop and form into globe-like breasts.<br>\r\n<br>\r\nYou'd gasped and grabbed them, out of a sudden and maybe not irrational fear that they were about to fall off, and were startled by how soft and sensitive they were. Gently you'd cradled them, and gently you'd felt the nipples harden as you'd delicately touched them. You'd stood like that in a daze for some time, until your own stroking and the hot running water set off a vibration lower down. It didn't feel like an erection, though, which is what you would have expected to happen. So it was with a sense of dread that you'd slowly let your right hand slide down a soft stomach to a patch of tightly curled pubic hair—and to the slit between your legs. <br>\r\n<br>\r\nAt that point you'd carefully shut off the water and pulled back the shower curtain and stepped from the tub and looked in the mirror. It was Helen's face that stared back at you.<br>\r\n<br>\r\nYou'd swallowed and made sure the door was locked, and then you'd pulled down a towel and very carefully dried yourself off. There was no doubt that you were now your sister's twin. It wasn't just the large breasts and the pussy and the hips. It was the mole on your left forearm and the light blue eyes and the long brown hair (still damp and tousled). You'd lightly touched your new lips and your throat and murmured \"Oh my God,\" and recognized her voice coming out of your mouth. <br>\r\n<br>\r\nThere were voices coming from downstairs by this point, and footsteps on the stairs, and Davey, your eight-year-old brother, bawled out that it was time for supper. You'd grunted something in what you'd hoped was a deep, masculine voice, and when he was gone you'd snuck into Helen's bedroom. You wanted clothes, and since you now had her body it seemed only logical that you should grab some of her things. You were digging quietly through her closet, trying to figure out if you should take a frock or a skirt and blouse or shorts and a t-shirt, when with a gasp you'd felt something ripple over your torso. You'd looked down, and found that you were now wearing one of her blue dresses. <br>\r\n<br>\r\nA check in the mirror confirmed it wasn't your imagination. And a glance told you that that very dress was still hanging in her closet. You'd looked back in the mirror and concentrated with a frown, and watched as the dress turned red. You concentrated again: the dress seemed to split and to flow, turning into a halter top and a pair of cutoffs. <br>\r\n<br>\r\nYour nostrils had flared as you gazed excitedly at yourself. This. Was. Cool.<br>\r\n<br>\r\nAnd you'd felt even better after you'd returned to your own room and found that, with a little more concentration, you could turn yourself back into Max Barron.<br>\r\n<br>\r\n* * * * *<br>\r\n<br>\r\nAnd now that you have a better of idea of what is going on, perhaps you should hit the \"back\" button on your browser, and pick one of the other choices.<br>\r\n</span></div></div>",
            "created":1234997880,
            "id":649395,
            "title":"Wait! What is going on and how did we get here?"
        },
        "111":{
            "author_id":"wolfcommander",
            "author_name":"Wolfwriter",
            "choices":[
                "Call a hot boy and experiment",
                "Call a hot girl and chat",
                "Go walk around the neighborhood"
            ],
            "content":"<div class=\"\"><div> <span>Now that you have become a sexy girl, you want to try life as a girl. So you wonder if the shapeshifting powers that allowed you to turn into this girl would also allow you to change your clothes, since your loose male t-shirt starts to look like a nightgown with your 36EE breasts pushing it up. And your shorts are way too loose in the crotch area now, so that’ll have to change too. Plus, your formerly fitting shoes are now too large to fit your feet properly. So you start visualizing a makeover, starting at the feet. <br>\r\nWithin seconds you feel a pleasant tingling on your feet. You watch and see a layer of black forming on your feet, slowly enveloping your feet and travelling upwards. It has only just covered your feet (turning into socks) when the feeling starts again at the bottom of your foot. When you take a look you notice that soles are forming on your feet, slowly spreading out. As soon as the socks have reached up to your knee, you notice that the soles start to spread onto your feet, but the parts that flow onto your feet are black in color, and turn into leather while enveloping your foot. As soon as your feet are enveloped, you notice that the black leather liquid flows up your leg, stopping just a centimeter short of your knee. Before they harden, the heels grow into two stiletto high heels, pushing your heels up until your foot is angled about 65° downwards. They then harden, turning into smooth, skintight black leather boots. Those were just the boots that you imagined when thinking about the perfect outfit, so you wonder what will happen next. <br>\r\nFrom underneath the boot shafts comes a bluish fluid, that wraps itself around your leg, and you watch it crawl upwards where it forms itself into a comfortable pair of jeans. When you take a look underneath the jeans, you notice the last bits of a white liquid shaping itself in the shape of some underpants. As they harden, you find that they feel just like regular underpants, just silkier. You decide you like that feeling.<br>\r\nAs you still admire your new body and clothes, a new blob of white emerges from the underpants and moves towards your chest. As it crawls onto your breasts, you feel a very pleasant tingle you’ve never felt before, and it makes you gasp for breath. It then shapes itself into two cups, with bands between them to hold them in place. You notice right away that it’s a bra, as you saw all three of your teenage sisters wearing them (although your youngest sister Christine secretly tries them on when she thinks no-one’s looking) and the oldest of your two little brothers sometimes steals one and wears it on his head whenever he turns into “Captain Doo doo” (don’t ask). As soon as the blob/bra is in place, it hardens and then softens into a silky bra, which pushes your breasts up and holds them in place. From the bra then flows a new blob that forms itself into a tight-fitting tank top. With a final tingle the change is complete, and you look like a complete knockout. With one last after-tingle, an iPhone appears in your pocket. You check it and see that several of the hottest and most popular boys and girls in school are in your phone book. “Yes!”, you think, “I’ve been waiting for this for my entire life!”<br>\r\nWhat do you do now?<br>\r\n1.\tCall a hot boy and experiment<br>\r\n2.\tCall a hot girl and chat<br>\r\n3.\tGo walk around the neighborhood<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1234997940,
            "id":649096,
            "title":"Change clothes so you look stunning"
        },
        "112":{
            "author_id":"wolfcommander",
            "author_name":"Wolfwriter",
            "content":"<div class=\"\"><div> <span>You decide to try and see if you can alter small things about your body, like the color of your eyes, or the length of your body. You focus hard, and you find that it's getting a little easier every time you try it. Your middle finger on each hand is suddenly turning dark brown, coupled with the rest of your body being white it looks really weird. You look in the mirror and give yourself really thick eyebrows, a huge nose and giant ears. After a couple of huge laughs, you undo the changes to your borrowed face, and you have your hands turn dark brown as well, starting at the fingertips. You have the changing wave crawl up your arms, and you suddenly have a white body with dark brown arms, hands and fingers. Then you turn your lower arm bright orange, and your upper arm pitch black. You add a set of arms beneath your current set of arms, and you try to </span></div></div>",
            "created":1239482880,
            "id":674627,
            "title":"Experiment with partial shapeshifting"
        },
        "15":{
            "author_id":"samirdaoud",
            "author_name":"Fast",
            "choices":[
                "At the tournament ",
                "Someone finds you three"
            ],
            "content":"<div class=\"\"><div> <span>“You know, it feels good in his form, with his muscles and all” you say in his voice, flexing your muscles in the mirror. <br>\r\n“Are you really sure about not visiting the doctor?” Quincy says in a worried voice “I am just worried about your condition”. <br>\r\n“Jesus Christ Quincy, can you just enjoy the moment once?”  <br>\r\nYou know how much Quincy is worried for you, but at the same time his constant worrying becomes annoying. You turn yourself into Elizabeth’s form, since you read once that people would usually listen to a person who doesn’t remind them of someone who they dislike. <br>\r\n“Listen Quincy, how many times have you met someone who can do something like this? I know that you are worried, but I am not telling anyone about this. Let us all just have fun this weekend with my new powers” you reply in Elizabeth’s voice. “Start by touching my boobs” you say uncovering your breasts and holding your boobs out for him. <br>\r\n“All right” he says. He reaches his hands out and gently touch your breasts which feels weird for you. “This does feel good” Quincy states. <br>\r\n“All right, that’s enough. what shall we do now?”  You ask the group. <br>\r\n“Wanna go to the pond in the woods?“ says Jeremy “we would have more privacy there”. <br>\r\nThere is a pond in the woods next door which you three frequent too, you have a small tent there and sometimes you three go and hang out there and to escape from the neighborhood. You and the gang also practice Kung fu there in privacy outside of the lessons, helping and improving each other  <br>\r\n“But my bike broke, remember” says Quincy “that is why we are here and not at one of your houses”. <br>\r\n“Max was able to turn himself into a shirt earlier, right?! So why not try to turn into a bike for Quincy”. Replies Jeremy. <br>\r\n“Well, I don’t know” you respond while turning back into your original form. “A bike is large, and I don’t know if I will be able to transform myself into one”. <br>\r\n“There is only one way to try” says Jeremy, so you agree, hell, it might even be fun to be a bike, you think. The three of you go down to the garage. “Luckily your parents are not home yet” you say to Quincy. You then concentrate on turning into a bike. First, the body of the bike, then the wheels, then the steering and pedals. You can hear the both of them shouting in amazement at what you are doing. After about five minutes of adjusting and transforming yourself, you finish. You then realize that you have 4 viewpoints you can switch between (front, back, left and right) and you can feel everything that touches the bike except for the wheels (that might be painful) and you could control the steering, drive yourself and the kickstand. <br>\r\n“Holy shit!” Cries Quincy with his hands covering his mouth. He also just realized that you have turned into the bike model that Quincy has wanted forever. “What do you think guys” you say, which apparently the voice come out of you from the front. “This is amazing Max” says Jeremy. Quincy, still in shock from seeing your accomplishment, slides his hand on the steering up front (you can feel that). You then startle him saying “let me adjust the height of the chair to fit you”. <br>\r\nQuincy rides on your seat, and you are surprised at how you don’t feel his weight. After waiting for Jeremy to get on his bike, Quincy starts going. Even though Quincy is pedaling, you are increasing your own speed, enjoying the fresh breeze hitting your (bike) body, and racing Jeremy. <br>\r\nYou reach the part of the trail that is near the pond, where Quincy got off letting you to turn human again. Jeremy then catches up, struggling to catch his breath. “What was that? I wasn’t able to catch up with you guys” he says laughing. You then transform yourself back, but midway decide to transform into a girl based on Elizabeth’s body, but has a different hairstyle and blond hair and blue eyes instead of black and a multitude of minor changes in case anyone sees you out here. Good thing the dirt falls off me when I transform you think to yourself. You three then head to the pond.<br>\r\n“Thanks a lot back there” says Quincy. <br>\r\n“Anytime, it was fun being a bike. Does that justify not going to a doctor?” You say in a bitchy girl voice. <br>\r\nHe and Jeremy chuckle. <br>\r\n“How did it feel to be a bike?” Asks Jeremy. <br>\r\nYou describe to them how it felt and what you were able to do as a bike. Jeremy then says “you remember that there is Kung fu tournament tomorrow guys, right?”  <br>\r\nShit, you totally forgot about it, you were supposed to train with Quincy today, but your powers screwed up your schedule today. The three of you decide to start training one against the other now. First came Jeremy and Quincy, which Quincy one point over Jeremy. Then came your turn. You forgot that you were in a girl form, so you then transform yourself into a tall jock version of your original body, just for fun (and to flex your powers), and you take off your shirt to show your pecks and six pack. You bow in front of Quincy and stand in the default position. “Did you really have to do this” says Quincy “you will kill me with one blow” he continues. “You look more like these anime jock guys” comments Jeremy chucking. “You feel so powerful being this muscular” you say in a deep voice that fits your body, Jeremy and Quincy both come and start checking the ‘authenticity’ of your muscles “Even though jocks are usually intimidating, I don’t know why I don’t feel that intimidated by you” Quincy says, you grin “don’t worry, I will go easy on the kicks and punches”. You all continue battening and training for the tournament getting ready for the next day, until it becomes dark. </span></div></div>",
            "created":1590938280,
            "id":2843668,
            "title":"Training!"
        },
        "152":{
            "author_id":"sd123",
            "author_name":"SD",
            "choices":[
                "Kung-fu tournament ",
                "Training with the doctor and soldier "
            ],
            "content":"<div class=\"\"><div> <span>“Hey! You there!” The three of you suddenly hear. <br>\r\n<br>\r\nYou, still in your buffed form, turn around to find your father standing between the bushes in his military uniform, with another soldier behind him named Jack who sometimes visits your house and got to know each other, in addition to who seems to be a scientist. He stands there, analyzing you. <br>\r\n“Sir, what are you doing out here with a bunch of kids?” he says. <br>\r\nYou don’t have any idea what to do, and you can’t shape shift into anything because he can clearly see you. <br>\r\nYour dad starts analyzing Jeremy and Quincy, and then comes to the realization and says astonished: “this can’t be...! Max? Is that you?”.<br>\r\n“Yes dad” you said. <br>\r\nYour dad starts panicking, he knows the implications of sending you to the military base in order to analyze you and study you. Even though he might seem tough, he loves you and doesn’t want the government to know about you. <br>\r\n“Did you come into contact with some black substance around here? And it wouldn’t come off?” He asked. <br>\r\nYou admit and tell him what happened, and how it was by mistake and it didn’t come off. You also told him that the only people to know about this are your friends and nobody else. <br>\r\nYour dad sits there thinking deeply about what to do. He tells you to return to normal and that everyone here will to the scientist’s house. You return to normal, knowing that your dad has it under control, and go to the boundary of the woods to a military Jeep, where you all climb in to go to the house. <br>\r\n<br>\r\n“Listen son, the substance you fell into was caused by a leak in a vehicle that was transporting a substance that causes your condition to our base for testing. The puddle was cleaned up, but we were enclosing the parameter to find anyone who came near it. I was surprised that it is you who ended up getting the power”. Your father said after sitting down in the house, which apparently only the scientist lived in alone. “Will I have experiments done in me dad?” You said in a sheepish voice. “We decided to keep your condition a secret, although Mr. Joubran here wants to do some tests and examine how it works”. <br>\r\nYour friends fell silent listening to what was happening. Jack was standing next to your dad, and the scientist was drinking coffee on the couch next to your father. <br>\r\n“Your powers are a blessing, or a curse. Depending on how you look at it, because you will have to keep it a secret from everyone else, even your mother” your father continues “do you understand son?”. You reply with a yes. “I know that I can’t stop you from using your ability, but try to keep it within the confines of your friends and us. As for you two, you boys shut your mouth or I will cut your throats open personally” he threatens your friends. <br>\r\n“But how do his abilities work?” Quincy asks “is it a stable condition?”.<br>\r\n“This condition is supposed to be stable, since your friend changes the whole structure of his body, at a molecular level, enabling him to change material and change his body entirely from his imagination and to change to the people he sees in front of him” the doctor replies. “Max, would you mind change into Quincy to show him?” He asks you “just concentrate on him and you will turn automatically”. You hesitate at first, not wanting to show him that you have already changed yourself before. “If you concentrate well you can even change your clothes to match his, because they have a bit of the material on them by touching your body”. <br>\r\nYou stand up, and concentrate well on turning into Quincy. He has thick black hair, a slightly more tanned body, he is a bit shorter but a tad bit more muscular than you and is wearing a t-shirt and some short jeans. Suddenly, you regain your senses and realize that you have turned into Quincy in 5 seconds. Even the parts of the body that are not visible turn into, what you guess, the same as his. “You feel great” you tell Quincy, giving him a fist bump. The gang then starts analyzing and contrasting the both of you, trying to spot any difference, with the doctor proving them how precise it is by not being able to find a difference. “Do you feel weird or anything?” The doctor asks you “are you accustomed to the new form yet?”.<br>\r\n“My new form is comfortable, but I still need to get accustomed more to it, especially in terms of height and weight (Quincy is lighter than you, which gives him an advantage in Kung Fu)” you respond. “The more forms you try, the faster you become accustomed to every new body” the doctor tells you. <br>\r\nYour father then says that it has become late, and that you should probably come back tomorrow or the day after to the doctor, and that if you need any help he can always help you...<br>\r\nYou realize that it has become around 3am and you are tired from all the shapeshifting and Kung Fu (the doctor said something about becoming tired from using the powers too much). You didn’t feel like, nor had the energy to turn back into your normal form. Your father finds you asleep when you arrive home, luckily your mother is asleep and will leave early  tomorrow. <br>\r\nYour father, not wanting to wake you up, carries you to bed and tucks you in. He cries, because this reminds him of when you were still a young child who he used to tuck you in. <br>\r\n<br>\r\n*******<br>\r\n<br>\r\nThe next morning, you wake up to the sound of the alarm feeling weird, and not realizing that you were still in Quincy’s form until you got startled by your reflection in the mirror. You turn back into your original body and head down to get breakfast. <br>\r\nYour mom has already left, and you find your dad sitting on the table eating cereal. <br>\r\n<br>\r\n“Hey dad”. <br>\r\n“Hey son, found you asleep yesterday as your friend” he replied. <br>\r\nYou laugh “yeah, startled myself in the mirror in the bathroom this morning” you tell him. <br>\r\n“Big day today” says your dad “today you have: “</span></div></div>",
            "created":1591042560,
            "id":2844253,
            "title":"Someone finds you three"
        },
        "1521":{
            "author_id":"sd123",
            "author_name":"SD",
            "choices":[
                "Cinema",
                "Reader’s choice"
            ],
            "content":"<div class=\"\"><div> <span>“..You have the tournament today, then the doctor wants to show you something cool”. <br>\r\nAfter breakfast and getting ready, your dad takes you to the tournament. You find your friends there Jeremy and Quincy. You decide to add a bit of muscle to your body before fighting in order to seem more intimidating. <br>\r\n<br>\r\nIn the end, you won  fourth place, after Jeremy and before Quincy who is second. <br>\r\nAfter the tournament:<br>\r\n“Hey, wanna go celebrate guys?” Says Jeremy. <br>\r\n“Yeah, I don’t have anything to do, and we can mess around with your abilities” says Quincy. <br>\r\n“Sorry guys, I can’t, the doctor wants to show me something and probably do a couple tests. He says it is quick”. You reply. <br>\r\n“All right, we can go to the doctor then continue onward to the mall or something” says Jeremy. <br>\r\n<br>\r\nYou then go to the doctors house, where your dad told you to go after the tournament. He is within walking distance of the sports center. When you arrive, the doctor gives you a pair of clothes to ware. <br>\r\n“These clothes will make it much easier to change them with just thinking alone, and they will also blend in or disappear when you turn into an object”. <br>\r\nYou put them on, then realize that you are now able to easily change your clothes. <br>\r\n“Thanks doctor” you say. <br>\r\n“Your welcome, take good care of these, it was hard to smuggle them out of the base” he says “I also have a favor that you might like” he adds. “What is it?” You ask. He gives you a picture of a girl that seems your age, with large C cup breasts and a nice cute athletic  body. “I chose this girl, she seems like a body you would enjoy. I need you to turn into her for the rest of the day, while your mother is traveling, and wear this watch that gives me your vitals and other info” he says. You start shifting and changing your body to match the girl in the photo. You also change your clothes to a tank top and some comfortable pants. Your body seems comfortable and athletic, and she has a nice ass and breasts. “How do I look?” You say to Jeremy as you wear your watch. He stands there staring at you “you look beautiful” he says. You blush. “You also have all her chemical make up and hormones, that is why you can feel as if you are totally a girl with her body. This means that your hormones also change, so beware.” He says. <br>\r\nYou exit the house with your friends, still trying to get used to your new body. You then go to a corner and try to adjust your bra that appeared with the tank top. “Can I touch them, please” your horny friend Jeremy starts saying. You slap him in the face for the second time you turn into a girl “pervert! This is my body, leave it” which leads Quincy laughing. <br>\r\n<br>\r\nThe three of you decide to have a backstory: “ you are Jeremy’s cousin from another state named Julia”. <br>\r\nYou then decide to go to...</span></div></div>",
            "created":1591114320,
            "id":2844741,
            "title":"Kung-fu tournament "
        },
        "15212":{
            "author_id":"sd123",
            "author_name":"SD",
            "choices":[
                "The doctor calls and asks you to turn into someone/something else",
                "You decide to do something else"
            ],
            "content":"<div class=\"\"><div> <span>The pool.<br>\r\nThe three of you decide to go to the pool. It was a nice, hot, sunny day, and it has been a while since you all went swimming. Your house has a pool, so you invite them to your house. Besides, you wanted to know how it feels to war a bikini, and try out your new female form. <br>\r\n“You know you are making me real horny right now” Jeremy says while you are trying to put your boobs in a comfortable position. You are not used to the extra weight on your chest and having things that giggle with every move. In addition to your slimmer, little bit shorter and more compact form, with a different chemical structure. You accidentally touch your nipple “uh... this felt good” you moan in your new, feminine voice, while walking down to the neighborhood where the three of you live. <br>\r\n“So how do having these.. boobs feel?” Asks Quincy. <br>\r\n“I am still getting used to them, but up till now, they feel weird and good. But very different. I don’t know how to describe it” you say, holding your dangling two globes in your hand. <br>\r\n“You know that you are one of the first people to truly be able to switch between sexes at will” Quincy says. <br>\r\n“And to turn to any object and animal, and fitness level at will” you add. <br>\r\n“With a sexy bod like that, you will be one of the most popular students at school” adds Jeremy “everyone will wanna talk and go out with you. I’m jealous of your powers man!”. <br>\r\n“Good thing I’m here to share the fun with you” you respond. You then lay your arms on the shoulders of your two friends, walking in the middle. “Does that mean that I can touch them?” Jeremy whispers. “Later..” You nod. <br>\r\n<br>\r\n“Ahh.. that feels good” you say, while he is massaging your two soft globes in his hands, while you are sitting with no top on on the bed in your room. “Luckily ....my....my.. dad isn’t ......here” you say while moaning. He is sending bolts of pleasure throughout your body. He then gives one globe to Quincy to try. <br>\r\n“Please stop.. PLEASE... dude” you cry out. After they stop, ages later, you get up and you put your shirt back on. Then, you make it transform into a bikini top, and your pants the bottom. You friends have passed by their homes on the way to pick up their swimsuits. After that, you finally go down to the pool in order to cool off. You race, play volleyball and then relax with some drinks. <br>\r\n</span></div></div>",
            "created":1591289940,
            "id":2845798,
            "title":"Pool Time"
        }
    },
    "info":{
        "author_id":"wolfcommander",
        "author_name":"Wolfwriter",
        "brief_description":"A story about a boy who's suddenly given the power to shapeshift.",
        "created":1234964100,
        "description":"<td align=\"left\" class=\"norm\">You are Max Barron, an average 16-year old with a not so average desire: the ability to change shape. You have been unhappy with the fact that you can't change your body. Not that you're ugly, not at all. You've got short, messy brown hair, and your eyes are sky blue. You're an average Joe, with a length of 1.80 meters you are pretty tall, and you weigh 75 Kg. Combined with your toned body from years of Kung Fu, that makes you a healthy boy. The one thing you hate though, is that you aren't free to experiment, to live life as someone else, to see how a goatee would look on your chin without letting the hair grow for months. You pretty much hate the fact that you can't hack life. Or can you?<br>\r\n<br>\r\nFamily:<br>\r\n<br>\r\n-Davy: your 8-year old brother. He's cute, and gets along with you very well. Although sometimes he annoys you by sneaking into your room and changing your signature to something girly, you love him.<br>\r\n<br>\r\n-Kara: your 12-year old sister. She's already quite handsome, and likes to experiment with clothing a lot. She just left the Birckenstock phase, and is now experimenting with kneehigh, skintight leather boots with a basic heel. So far she seems to like it, though there's no telling what she'll like next month.<br>\r\n<br>\r\nHelen: your 18-year old sister. She likes you most of the time, but isn't always easy to live with. Likes to dress sexy, with a lot of (mini)skirts, high heeled boots and tops.<br>\r\n<br>\r\nJill: Your mother, she's 40 years old and a real optimist, always seeing the silver lining on the dark stormclouds. She's a work-at-home interior designer and housewife.<br>\r\n<br>\r\nMatt: your father, he's 45 years old. He works in the Marine Corps Base Quantico (information found here: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://en.wikipedia.org/wiki/Marine_Corps_Base_Quantico\" target=\"_blank\">http://en.wikipedia.org/wiki/Marine_Corps_Base_Quantico</a>) as a trainer for the young, soon-to-be Marine officers, after being in the field himself for over 20 years.<br>\r\n<br>\r\nOther people:<br>\r\n<br>\r\n-Elisabeth Winninger: a popular 16-year old girl, with long, brown hair and large,  C-cup breasts. She's slim and hot, and she knows it. <br>\r\n<br>\r\n-Joe Purdell: one of the school bullies. He's a corn-fed, beef-stuffed, farm-bred behemoth: six-feet-and-four-inches of fat and muscle, most of it between his ears. Ugly, too, but he's strong and he's on the football team, so the girls flutter around him. <br>\r\n<br>\r\n-Karl Anderson: a creepy, nerdy boy. <br>\r\n<br>\r\n-Quincy Brown: An unusually silent boy at first, he changed much after you befriended him in your freshman year. He used to be very meek, a true 'turn-the-other-cheek'-person until you and Jeremy managed to convince him to join your Kung Fu group. He quickly became an adept at it, and now rivals you and Jeremy in skill despite you both having been on the group for almost six times longer than him. Like Jeremy, he's a true friend that would go through fire for you.<br>\r\n<br>\r\n-Jeremy Timber: your other best friend. Jeremy was the one who got you into Kung Fu, and you're still grateful for that. A little bit perverted and very crazy, he's a very likable person, quick to make friends everywhere.<br>\r\n<br>\r\nNOTICE:<br>\r\n<br>\r\nI want everybody to write good chapters, ten sentences at the very, very least. If you write chapters like \"You turn into Elisabeth Winninger. You feel good. What do you do now?\" I will delete the chapter.<br>\r\n<br>\r\nFeel free to add characters as the story progresses, but NO new powers. Try to go easy on adding new family members as well, the parents are no baby-making machines.<br>\r\n<br>\r\nHave fun!</td>",
        "id":1530035,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1591289940,
        "modified":1591289940,
        "pretty_title":"Shapeshifter-An unusual story"
    }
}