{
    "chapters":{
        "1":{
            "author_id":"rmz450",
            "author_name":"dude",
            "choices":[
                "giantess",
                "shrink people",
                "think of over things to shrink",
                "Has shrunken city",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>The alarm clock went off at 9:00 like it always does.Amanda woke up stretching and then letting out a smelly fart she knew today was going to be a good day. No work or anything just hang out watch tv and eat. getting up from bed she wore a tank top and a g-string when she slept and no socks she hated socks. she walked into the kitchen to make some breakfast burritos. finshing up the 5 burritos she made she sat on the couch wondering what to do. should she become a giantess and cause havok on a city or shrink hundreds of people and torture them with her body?</span></div></div>",
            "created":1231218000,
            "id":630006,
            "title":"waking up"
        },
        "11":{
            "author_id":"rmz450",
            "author_name":"dude",
            "choices":[
                "what she has on now a tank top and g-string and barefeet",
                "tank top tight jeans and sandals",
                "nothing naked",
                "a shirt and a mini skirt with high heels",
                "a thong bikini"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she wanted to grow and destory people and cities many people made fun of her because of her weight well she would have her revenge. but what to wear?</span></div></span></div>",
            "created":1231218000,
            "id":630065,
            "title":"giantess"
        },
        "111":{
            "author_id":"shefatbelly",
            "author_name":"cola",
            "choices":[
                "Turn the wife into a giantess  and let her eat her husband? ",
                "Crush the husband under one of Ginny's red high heels then grow the wife? ",
                "Grow the hindi wife the push the husband up her giant butthole?"
            ],
            "content":"<div class=\"\"><div> <span>She decides to wear what she has on for now her g string shows off her huge butt cheeks and her tanktop shows of her enomus breast and her bare feet just turn her on. To grow she reachs into her side table draw and pulls out a bottle she got from her best friend Becky she had said it who help her get what she wanted. The bottle contains a  light blue liquad<br>\r\nUncorking the bottle she begans to drink it all and soon she fells it starting to work her legs grow long with thick giant muscles and then her bare feet break thru the walls of her room, her arms also grow thick bulging muscles and break thru the other to walls of her bedroom, her butt stechs along with her hips cause her bed to brake and then the floor as the floor gives way she falls into the living room were her breast began to swelling to giantic size her nipples making a loud(POP POP) they are soon followed by her stomach swelling into a giantic ball of black smooth flesh and a loud (POP) as her belly button pops out.<br>\r\nAs she hits the living room floor her legs kick out the walls of the house her mother and father coming face to face with the tight green lace g-string her parnets are both nude and in the very middle of having sex on the living room crouch as her parent stare at her green g-string a massive bulg begens to form it grow bigger and bigger until a black cock head appears over the waistband of her g-string and two hulking balls pop out the sides .<br>\r\nHer mother is the first to react and yells\" Martha what has happened your giantic \". She smiles at her mother a picks her up off her dads large black cock then places her naked mother between her giantic black breast then said \" The same as you when my friend Becky gets here she gave me the stuff that turned me\". Deciding she had no use for her father she picked him up and dropped him in her mouth then swollowed him down into her new giantic belly. She knew her mother didn't like him and was having affairs all  over town with men and women for she had seen her mother riding a massive strapon her english teacher Ms. Hancock  kept in her special box she had rode it herself.<br>\r\nWith her father digesing in her belly she studed up causing the weaked house to fall down around her bare feet. As she stode two more giantess stomped up one was her bestfriend  Becky the other was her girlfriend Becky's mother Ginny she had many nights sleeping over at Becky's in bed with Ginny she loved ride Ginny enomus cock and letting her blow her loads in her black pussy. Looking at her white skin girlfriend she saw that she wore black tigh high stocking, a black g-string and red high heels  only as for Becky she was total naked and showing ever one her giantic eighty eight foot cock that stode tall almost passed her head.<br>\r\nStroling up to Ginny she pulled her girlfriend close and began to share a deep passioned kiss with her while strokeing her lovers giantic cock thru her g-string the site of her daughter stroke Ginny's monster cock was turning her on and she wanted to join these giantess. As Martha broke her and Ginny's passioned kiss she called out \"Honey I'm so turned on how can I get massive to and join you \".<br>\r\nMartha smiled at her mother and pulling her from between her giantic black tits she said\" All you have to do is suck on Becky's giantic cock making sure you swollow her cum all down she's always had a think for you\".<br>\r\nJane looked at Becky her white skin glowed in the sun it was so pale something she liked alot and she was strokeing that monster between her legs and looking at her so she called out \" Becky get your sexy white ass over here and let me suck that monster of yours\". Becky sqelled before running over as she ran houses fell as Becky's bare feet slapped the ground in four huge steps. Becky then took Jane from Martha and held her to the tip of her giantic cock then moaned \" Suck my cock you sexy black mother I want to hump your pussy when you get giantic\". Jane smiled and told a small long lick before gulping more and more cum down like a straved woman. As she ate Becky's cum Martha took Ginny by the hand and lead her to a neborghers pool were she began to strip off Ginny's black lace g-string and stockings along with her red high heels. once done Ginny began to strip her grabbing the hem of her white tank top then sliding it up and over her head freeing her mammoth black tits before she kneeled and placing her fingers in the waistband of her green lace g-string she pulled it down her thick muscler legs letting her mammoth cock string free and her heavy black balls to bounce before tosing the cloths over her shouder onto the roof of the neborgers house as couple exit there house.<br>\r\n As the husband shouts at them they turn and see the busty hindi wife standing next to him and they decide to?     </span></div></div>",
            "created":1410550920,
            "id":1856007,
            "title":"what she has on now a tank top and g-string and..."
        },
        "113":{
            "author_id":"shikamaru",
            "author_name":"Mr.Ninja",
            "choices":[
                "The playground to play with the people.",
                "Where she worked at for some more food.",
                "A school to get some slaves"
            ],
            "content":"<div class=\"\"><div> <span>She figured that since everyone called her things such as pig.That she'll eat them all,and her clothes would just become to small after she ate them all.So she took her shirt off,letting her bra holding her double D breasts just pop out.She then took her jeans off showing her huge ass and her pink panties.She unhooked her bra and letted her breasts just pop out.She then took her panties off and thew them against the wall.<br>\r\n<br>\r\nShe then started to grow.She went to 10 feet.Then 20.By now the floor was almost ready to fall apart.Once she reached 30 the floor fell apart and she fell to the floor below.She then grew to 50 feet tall.She was as wide and tall as her house.She still was growing.Once she got to 55 the house snapped.All the people were running away or just looking at the giant nude lady.She grew to 150 ft.<br>\r\n<br>\r\n<br>\r\nShe looked down at the people around the house.\"All that growing made me hungry,this little piggy could use a snack.\"Once she said that all the people started running.She bent forward and opened her mouth getting about 5 of the people into her mouth.She started to chew them over and over again and again.She was still hungry.She got up and picked up a school bus full of little elemantary kids.She tore the back of the bus opened and shoved her tongue into the bus.She pulled her tongue back in holding everyone inside of the bus into her mouth.She swallowed them whole.<br>\r\n<br>\r\n<br>\r\nShe simply thew the bus behind her and went on.She saw the mall so she went over to it,and tore part of the roof off.She steped in and surrounded the people near her between her legs.She started to grab the people and throw them in her mouth.She bent down and started sucking the people into her mouth.She grabbed as many as she could and just started stuffing them into her mouth.Once she ate all the people in the mall she grew a few pounds.To her it was 10 pounds.<br>\r\n<br>\r\nShe looked around to see what to attack next.Where'd she go?</span></div></div>",
            "created":1232600400,
            "id":636831,
            "title":"nothing naked"
        },
        "1132":{
            "author_id":"curttehmurt",
            "author_name":"Banjoenelbano",
            "choices":[
                "A Grocery Store",
                "An Office Building"
            ],
            "content":"<div class=\"\"><div> <span>Amanda's hunger was insatiable, so she decided to go to her place of employment for more food.<br>\r\n<br>\r\nShe stomped through the city streets unwittingly crushing people and automobiles, her flabby hips damaging or knocking over buildings.<br>\r\n<br>\r\nAs she trekked onward to her destination Amanda starting getting sweaty from the hot summer sun. Drops of sweat dripped off her folds and made her glisten in the mid day sun. On the ground below, anyone who wasn't getting stepped on with dodging the fat girl's gallons of sweat.<br>\r\n<br>\r\nFinally she reached her destination...</span></div></div>",
            "created":1280725200,
            "id":928930,
            "title":"Where she worked at for some more food."
        },
        "11322":{
            "author_id":"curttehmurt",
            "author_name":"Banjoenelbano",
            "choices":[
                "Amanda eats Linda",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"An Office Building?\" you may wonder \"There's no food there\" you may think. But you forget that buildings are filled with tasty people.<br>\r\n<br>\r\nAmanda plops down in front of the building crushing some people on the sidewalk and the car parked in front, her legs spread with the office between them, her soft apron belly blocking the main entrance/exit.<br>\r\n<br>\r\nShe peers into the windows on the floor she normal worked on. She sees her fellow employees running around in a panic, inciting a maniacal laugh from Amanda, causing her fat to wiggle like the small ocean she was.<br>\r\n<br>\r\nJust as Amanda was about to chow down on the panicked little people she noticed something, in the break room! That bitch Linda that always steals her lunch! Enraged Amanda smashes her hand effortlessly through the building wall and grabs Linda.<br>\r\n<br>\r\nAmanda pulls her out and brings her to her face.</span></div></div>",
            "created":1280965500,
            "id":930093,
            "title":"An Office Building"
        },
        "113221":{
            "author_id":"curttehmurt",
            "author_name":"Banjoenelbano",
            "choices":[
                "Remembered she was still hungry and eats more fellow employees",
                "Has to take a dump"
            ],
            "content":"<div class=\"\"><div> <span>\"You Bitch!\" Amanda bellows, her voice deafening to the tiny Linda<br>\r\n<br>\r\nLinda cowers in fear of her giant captor, but then she gets a good look at the Amanda's house sized face and realizes who she is<br>\r\n<br>\r\n\"Amanda?\" Linda asks perplexed, not knowing about Amanda's size powers \"How did you get so big?\"<br>\r\n<br>\r\n\"No help from you Lunch stealer\" Amanda said accusingly<br>\r\n<br>\r\n\"Lunch Stealer?\" Linda asked, the truth was Linda had never touched Amanda's lunch, Amanda is just such a compulsive eater she never remembers eating her own lunch.<br>\r\n<br>\r\n\"Yeah, and since you stole my lunch I think it's only fitting you become mine!\"<br>\r\n<br>\r\nAmanda dangles the bewildered Linda over her waiting maw<br>\r\n<br>\r\nShe releases the tiny woman, who screams as she falls and continues to scream as she is swallowed alive.<br>\r\n<br>\r\nAmanda savored the taste and feeling of the accused lunch thief wiggling down her esophagus, but then suddenly she...</span></div></div>",
            "created":1281239400,
            "id":932228,
            "title":"Amanda eats Linda"
        },
        "1132212":{
            "author_id":"curttehmurt",
            "author_name":"Banjoenelbano",
            "choices":[
                "Cop a squat over the dazed crowd",
                "Use a building as a toilet"
            ],
            "content":"<div class=\"\"><div> <span>While the majority of people in the city were desperately trying to flee to avoid getting eaten or stepped on, were was a fairly large number of people who had become morbidly fascinated with the living natural disaster that currently rested in their city. A large crowd of these stupidly brave people formed behind the titaness and went unnoticed as she feasted on some other unlucky individuals in the office building she was straddling.<br>\r\n<br>\r\nHowever before she could drop another victim into her waiting maw, a low rumble was heard and a gurgling.<br>\r\n<br>\r\n\"Uh-oh!\" said Amanda's booming voice<br>\r\n<br>\r\n\"BRRRRRRRRRRRRAPPPPPPPPPPP\" a thunderous fart blew from her canyon like ass crack, throwing the bystanders through the air. The noise shattering windows of nearby buildings<br>\r\n<br>\r\nAfter the foul breeze had cleared, those in the crowd who had survived were dumbstruck. The gas had effected their minds, all they could do is stand there dazed as the giantess got to her feet.<br>\r\n<br>\r\n\"Ho boy, I've gotta take a dump\" said Amanda, feeling no need to be lady like given her stature and dominion of those bellow her \"But where?\" she thought aloud </span></div></div>",
            "created":1281492960,
            "id":933904,
            "title":"Has to take a dump"
        },
        "11322121":{
            "choices":[
                "Takes massive solid dump.",
                "Spews soupy diareah into the streets."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She finds a crow a little ways away from her and grins. She walks toward them, smiling slyly. Then she puts one leg on either side of the crowd and...</span></div></span></div>",
            "created":1293429240,
            "id":1023237,
            "title":"Cop a squat over the dazed crowd"
        },
        "113221211":{
            "author_id":"marfer",
            "author_name":"Shamrock",
            "choices":[
                "Amanda continues to eat, fart and shit in the city after a gassy nap",
                "Amanda goes to the ocean to wash her shitty ass after a gassy nap"
            ],
            "content":"<div class=\"\"><div> <span>Amanda squats down over the crowd, feeling the need to take a huge shit, her belly continually rumbling. She felt great pressure that needed to be let go. Down below, people screamed as Amanda's monolithic ass and slightly sagging belly fat eclipsed the sun. Her giant brown asshole hovered above the crowd like a great saucer. Amanda smiled to herself and rubbed her belly, God did she need to take a shit! An ominous rumbling is heard as the crowd below her is paralyzed with fear. Amanda grimaced slightly as she let nature take over. Her asshole contracts once, then twice, then the world below her explodes into a hurricane of humid stink and deafening noise! FRRRRRRRRRRRRROOOOOMMMMPPPPHHHHFFFF--FOOOORT!! People, cars, and debris are thrown all around as Amandas mighty fart thunders out of her gigantic sphincter. The fart can be heard from miles around, and the stink slowly spread around a 10 mile radius (the smell never left for days). <br>\r\n<br>\r\nAs the dust settles, Amanda readjusts slightly and starts to give a solid push. Her gigantic anus begins to yawn open impossibly wide, even for her size, and an incredible mass of shit starts to slide out. At the front of the turd, limbs splayed out in death is Linda's skeleton. The crowd below can do nothing as the gigantic log slams into the ground, killing them instantly. The turd has roughly the consistency of peanut butter, but it is still coming out solidly and in log form. A nearby news helicopter captures the scene. <br>\r\n<br>\r\nWhat it see's is incredible... a hefty bbw of a woman squatting over the ground, expelling what seemed like a never ending turd. The shit just kept coming and coming, burying the people under more and more material, coiling around and crushing nearby buildings. The bbw was biting her bottom lip and clenching her fists, bearing down on the massive turd. A look of relief washes over the bbw's face, but then she grimaced once again, gave a huge unlady-like grunt, and her never ending turd finally ended, leaving her asshole gaping open for awhile. <br>\r\n<br>\r\nAmanda was relieved, and a little tired of squatting. She noticed a news helicopter buzzing near by and swatted at it, destroying it easily,but this caused her to lose her balance. She falls down,  her giant ass flattening her massive shit pile, and crushing the already dead crowd beneath her even more. Amanda laughed, finally feeling a bit of relief. \"Whoo boy was that a good shit!\" She said, waving a meaty hand in front of her face to try and fan away her stink. She was sitting in her shit pile, legs splayed out in front of her, her apron of a belly flowing out in between her legs. Amanda ground her ass around in the shit a bit, grinding anything below her into oblivion. But it still wasnt over, Amanda leaned forward, her shitty cheeks and asshole appeared out of the shit pile, and she let out one more tremendous fart! BLLOOOOORRRTTT!flipflpfrrrtt...PLLOOOORRRTTT!..Blub-BRAAAATTTT! Feeling relief, Amanda started feeling a bit sleepy. She yawned and stretched, and laid down sideways, crushing dozens of people beneath her massive tits and belly. She then scratched her gigantic ass a bit and then fell asleep.<br>\r\n</span></div></div>",
            "created":1299214920,
            "id":1064378,
            "title":"Takes massive solid dump."
        },
        "1132212111":{
            "author_id":"lilowl1",
            "author_name":"lilowl1",
            "choices":[
                "Finally wash her shitty ass and move on"
            ],
            "content":"<div class=\"\"><div> <span>Stretching out and yawning loudly, Amanda finally woke from her gassy nap. \"Man,shitting on that crowd actually made me kind of horny. I want to poop more!\" Rising to her feet, Amanda continued to eat and grow, her belly and ass sagging closer to the ground.Amanda grinned evilly as she felt the familiar rumble in her gut from before. \"Alright, time for the shit storm!\" Amanda squatted down,grunted loudly, and began to shit, her car sized turds coiling around and demolishing everything. Amanda moaned and started to touch herself. \"This whole city is my toilet, and everyone is going to become my poop!\" </span></div></div>",
            "created":1375990200,
            "id":1642785,
            "title":"Amanda continues to eat, fart and shit in the c..."
        },
        "11322121111":{
            "author_id":"lilowl1",
            "author_name":"lilowl1",
            "content":"<div class=\"\"><div> <span>Amanda finally decided to wash up and headed to the ocean to clean her shitty ass. satisfied with her bath, Amanda moved on to another city and continued to fill her massive belly,which was skimming the ground along with her breasts. spotting a laxative factory, Amanda grinned and wandered over to it. This was going to be the mother of all shits. she downed the factory in one gulp and clutched her rumbling belly,moaning in anticipation. finally, Amanda let loose and flooded the streets with diarrhea, getting hornier by the minute. she was getting off on the fact that everyone was drowning in her massive dump. when it finally came to an end, Amanda went back in the ocean, washed up and wandered again to another city.</span></div></div>",
            "created":1380651600,
            "id":1672806,
            "title":"Finally wash her shitty ass and move on"
        },
        "12":{
            "author_id":"rmz450",
            "author_name":"dude",
            "choices":[
                "a couple of buses filled with people",
                "go to the mall and decide which victims"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>shrink people ok what senerio?</span></div></span></div>",
            "created":1231218000,
            "id":630008,
            "title":"shrink people"
        },
        "121":{
            "author_id":"rmz450",
            "author_name":"dude",
            "choices":[
                "tank top to show off her huge boobs and tight jeans to show off her huge ass ",
                "tank top to show off her huge boobs and a mini skirt and flip flops",
                "tight shirt and tight skirt with a strappy high heel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok before she goes anywhere what to wear?</span></div></span></div>",
            "created":1231218000,
            "id":630012,
            "title":"a couple of buses filled with people"
        },
        "1211":{
            "author_id":"topmilenko",
            "author_name":"TopMilenko",
            "choices":[
                "To shrink it anyway",
                "Leave it alone and wait for another",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Amanda threw open the closet and picked out some practical \"hunting\" clothes.<br>\r\n<br>\r\nShowing off her big curves always made her feel better about going to get some toys to play with.<br>\r\n<br>\r\nAfter dressing, she walked the short distance to a bus stop. The irony of the situation was, she was playing a little game with the authorities.<br>\r\n<br>\r\nIt was fun to shrink busses, and even funner to watch the news knowing they were totally stumped about what was happening to them!<br>\r\n<br>\r\nShe rode a random bus to the end of it's line and found this bus wasn't going to have many people on it when she got off.<br>\r\n<br>\r\nAmanda decides...</span></div></div>",
            "created":1304380320,
            "id":1098792,
            "title":"tank top to show off her huge boobs and tight j..."
        },
        "12112":{
            "author_id":"topmilenko",
            "author_name":"TopMilenko",
            "choices":[
                "Make her first catch of the day",
                "Give them a break and wait for the next"
            ],
            "content":"<div class=\"\"><div> <span>Sitting her ass down on the busstop bench, she browsed through one of those free house brochures to wait fifteen minutes for the next bus.<br>\r\n<br>\r\nAfter a short wait, a gang of college guys with hockey sticks gang around the bus stop.<br>\r\n<br>\r\nMost pay her no attention, but a few point to Amanda's big hooters annd comment between themselves.<br>\r\n<br>\r\nShe acts like she doesn't notice flipping her hair around to primp a bit.<br>\r\n<br>\r\nWhen the bus comes, they all pile aboard and she decides to...</span></div></div>",
            "created":1304381700,
            "id":1098807,
            "title":"Leave it alone and wait for another"
        },
        "121122":{
            "author_id":"topmilenko",
            "author_name":"TopMilenko",
            "choices":[
                "Go ahead and shrink it",
                "Let this one go too"
            ],
            "content":"<div class=\"\"><div> <span>She waves and blows a kiss to the shy guys. The preppy guys tease them that a \"fat\" girl likes them.<br>\r\n<br>\r\n\"Lucky you,\" Amanda thinks to herself. She was looking forward to an athletic lunch! The next group that arrives is the female version of college girls in tennis skirts and a few business men with weird accents.<br>\r\n<br>\r\nAmanda doesn't see where these weird groups are coming from, but she gets insulted by the tennis girls.<br>\r\n<br>\r\n\"I'd DIE if I looked like that!\" One of them pointed at Amanda.<br>\r\n<br>\r\n\"Oh, that does it sister!\" Amanda fumed to herself.<br>\r\n<br>\r\nAnd then one of the European business men approaches her with blushing cheeks.<br>\r\n<br>\r\n\"What is your bust?\" He asked with a thick accent.<br>\r\n<br>\r\n\"You... You bust cup? What is it?\" He asks shyly and sweating.<br>\r\n<br>\r\n\"Fourty double E!\" Amanda announces loud enough that the skinny tennis girls can hear.<br>\r\n<br>\r\nThe bus arrives and everyone piles on, Amanda can... </span></div></div>",
            "created":1304383920,
            "id":1098836,
            "title":"Give them a break and wait for the next"
        },
        "1211222":{
            "author_id":"topmilenko",
            "author_name":"TopMilenko",
            "choices":[
                "Switch locations",
                "Go find where all these people are coming from"
            ],
            "content":"<div class=\"\"><div> <span>Amanda gritted her teeth, but she didn't want to punish those sweet european guys for what those tennis girls said.<br>\r\n<br>\r\n\"But as a parting gift,\" Amanda narrowed her eyes and used her powers on that prissy bitch on the bus.<br>\r\n<br>\r\nSuddenly she heard a scream and roaring laughter. \"My ass! What happened to my ass?!\" The girl cried as the bus pulled away.<br>\r\n<br>\r\n\"Bitch,\" Amanda blew on her finger as if were a smoking gun. She had put at least a hundred pounds on that girl's ass if not more!<br>\r\n<br>\r\nThe next bus was coming and there was no one to get on but her. This bus was somewhat deserted as the one she rode in on.<br>\r\n<br>\r\nMaybe it was time to...</span></div></div>",
            "created":1304384820,
            "id":1098843,
            "title":"Let this one go too"
        },
        "12112222":{
            "author_id":"topmilenko",
            "author_name":"TopMilenko",
            "choices":[
                "Let it go too",
                "Shrink the bus after it leaves"
            ],
            "content":"<div class=\"\"><div> <span>She hadn't been to this place in the city, so she didn't know only a block away was a big resort hotel complete with tennis and it's own hockey rink.<br>\r\n<br>\r\n\"Oh! This is where the Baymont is,\" she had only heard of it on the radio.<br>\r\n<br>\r\nThe parking deck was slap full of cars, and college kids were using the city busses to ferry back and fourth to the university.<br>\r\n<br>\r\n\"Oh, wow,\" Amanda licked her lips as she saw a wrestling team get onto a courtesy shuttle bus. That looked like a good target, having a bunch of strong men wrestling in her panties.<br>\r\n<br>\r\nThere were other people around though, so she'd have to have a plan. Amanda decides to...</span></div></div>",
            "created":1304385300,
            "id":1098845,
            "title":"Go find where all these people are coming from"
        },
        "122":{
            "author_id":"teniko",
            "author_name":"teniko",
            "choices":[
                "Shrink the wolf whisteler and his friends.",
                "Shrink the one none will look for ",
                "Different person"
            ],
            "content":"<div class=\"\"><div> <span>Amanda's eyes danced around the mall, selecting her prey. <br>\r\n\"15 dollars mam\" The taxi driver told her, a hairy first shot out of the window, showing his open palm. Amanda smiled and payed the taxi driver, a wolf whistle came up from behind. <br>\r\n\"Hey baby! Shake it!\" A man pointed to her miniskirt, his friends egged him on. Her once lively eyes became dead as she looked at the man, she despised people like this. She paused in mid step. <br>\r\n\"He has too many friends. People will look.\" she muttered, stomping to wards an old bench. She slumped down and looked towards a missing kid advert. \"He was a orphan... \" she frowned. A boy walked over to her. <br>\r\n\"Have you seen him? He's my only friend at the orphanage...\" A cruel smile played on her lips as she thought of a excuse to get the boy alone to shrink him. A wolf whistle echoed around the mall. a brunette woman tried to pull her skirt lower. Amanda clenched a fist. </span></div></div>",
            "created":1231390800,
            "id":630949,
            "title":"Victim "
        },
        "1222":{
            "author_id":"shikamaru",
            "author_name":"Mr.Ninja",
            "choices":[
                "eat",
                "boob crush",
                "step on"
            ],
            "content":"<div class=\"\"><div> <span>\"Why yes I have.I think I saw him in the parking lot.Here I'll help you look for him.\"She said getting off the bench,and grabbing the boy's hand.She then walked with him over into the parking lot.\"Now I believe I saw him in the back of the parking lot.\"She told the orphan boy.Once they got to the back she looked around and made sure they weren't any people around,or camera's around.Once she saw it was clear she shrunk him.<br>\r\n<br>\r\nShe looked down and saw the orphan boy about two inches long.He looked up at the girl with the blinding sun right behind her.He then started to cry.Then she picked him up.\"Well your my first victim of the day.So I'll let you choose you death.Should I eat you,or crush you in my boobs,or step on you?\"That made the boy cry even more,but he knew he had to choose so he choose....</span></div></div>",
            "created":1231736400,
            "id":632713,
            "title":"Tiny orphan"
        },
        "12222":{
            "author_id":"shikamaru",
            "author_name":"Mr.Ninja",
            "choices":[
                "The candy store",
                "Victoria's Secret store"
            ],
            "content":"<div class=\"\"><div> <span>\"Very well.\"Amanda said as she started to unbutton her shirt.She unbuttoned it intill her massive boobs just popped out.She was wearing a very tight pink bra.She slowly lifted him towards her boobs.She then started to push him between her boobs with her index finger.Once only his head was out she grabbed her boobs and at first pulled them apart from each other but then slammed them against each other.She started to move her boobs all around.She then pulled them apart and saw only blood between her boobs.<br>\r\n<br>\r\n<br>\r\nShe then rebuttoned her shirt back up and started to walk back to the mall like nothing happen.Once she got back to the mall where did she go.</span></div></div>",
            "created":1231736400,
            "id":632719,
            "title":"boob crush"
        },
        "1223":{
            "choices":[
                "She eats him",
                "She puts him in her undies",
                "She drops you in the toilet"
            ],
            "content":"<div class=\"\"><div> <span>She then saw a guy she went to middle school with, name Gus. She then knew she wanted him.<br>\r\n\"Hey Gus, its amanda.\" She said<br>\r\n\"Oh hey,\" Said Gus<br>\r\n\"Follow me, I wanna show you something...\" Said Amanda<br>\r\nThey then went into the girls bathroom as Amanda shrunk him.<br>\r\n\"What is this?\" Asked Gus, \"Why are you doing this to me?\"<br>\r\n\"No reason really, you are one of the sweetest people I know, and I really wanted to shrink you.\" Said Amanda as she picked him up, \"Now what?\"<br>\r\n</span></div></div>",
            "created":1274850000,
            "id":889695,
            "title":"Friend"
        },
        "12232":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which side, though?</span></div></span></div>",
            "created":1531280280,
            "id":2518141,
            "title":"She puts him in her undies"
        },
        "13":{
            "author_id":"rmz450",
            "author_name":"dude",
            "choices":[
                "shrink a city ",
                "shrink her noisy neighbors",
                "grab the shoe box with 500,000 shrunken people"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"what could i shrink?\" she thought and one idea was to shrink an entire city or second her noisy neighbors.</span></div></span></div>",
            "created":1231218000,
            "id":632933,
            "title":"think of other things to shrink"
        },
        "132":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Make them crawl Inside you",
                "Make them Fuck",
                "Use them To Bathe"
            ],
            "content":"<div class=\"\"><div> <span>As Amanda sat in her wooden chair next to her kitchen table, she pondered who to shrink with her powers. Her answer was soon found as the loud nagging of the middle aged couple who lived next door. She heard them bicker like this every day and decided that she would silence them forever with a snap of her fingers.<br>\r\n<br>\r\n She got her fat ass off the seat and walked out into the hallway before knocking on the apartment next door. Amanda watched as the blonde milf in her forties opened the door and her angry husband stand behind her. They are wearing their pajamas as Amanda snapped and they both dwindled to eight inches on the floor.<br>\r\n<br>\r\n Amanda picked up her new toys and shut the door to the apartment before returning to her own room and placing them on her bed. She then picked up the screaming woman and tore her clothes off before doing the same to her horrified husband. She held the couple one in each hand and giggled at their fear. <br>\r\n<br>\r\n You decide to </span></div></div>",
            "created":1483158480,
            "id":2256875,
            "title":"Noisy Neighbors"
        }
    },
    "info":{
        "author_id":"rmz450",
        "author_name":"dude",
        "brief_description":"amanda is a very large woman and can grow to 200ft or can shrink people down to 1in",
        "created":1231291080,
        "description":"<td align=\"left\" class=\"norm\">yes on toilet, poop, feet, ass, crush, vore, death, farting, giant male and female.<br>\r\n<br>\r\nno on incest or killing main character.<br>\r\n<br>\r\nno short sentences and chapters keep them descriptive and easy to read and understand.<br>\r\n<br>\r\ncharacters are amanda who is 6 feet tall about 350 pounds she is the main one.<br>\r\n<br>\r\nthats it if you want to add a character feel free to; male or female<br>\r\n<br>\r\nplease please please add to this interactive!</td>",
        "id":1512846,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1531280280,
        "modified":1531280280,
        "pretty_title":"bbw giantess woman"
    }
}