{
    "chapters":{
        "1":{
            "author_id":"dxfan2478",
            "author_name":"dxfan2478",
            "choices":[
                "Tommy 13 (size 8 feet)",
                "Katie 13(size 7 feet)",
                "Jimmy 13 (size 10 feet)",
                "Amy 13 (size 5 feet)"
            ],
            "content":"<div class=\"\"><div> <span>you are 13 year old boy named Steve who has foot fetish for boys and girls feet. you are sitting in class and you are completely distracted with looking at the other students feet to pay attention to what is going in class. you see that four students are playing with their shoes under their desks. the four students consists of 2 boys and 2 girls. you are resisting the urge to take their shoes off and smell their feet. but you know that you will blow your cover if you do. so you decide one of them to hang out with you at your house after school. You ask............... </span></div></div>",
            "created":1240635600,
            "id":681253,
            "title":"What to do?"
        },
        "11":{
            "choices":[
                "You win!",
                "Tommy wins!",
                "Its a tie!"
            ],
            "content":"<div class=\"\"><div> <span>You ask Tommy, a shy boy who your on friendly terms with. He says ok and you start to think of ways to get at his feet. When you get home you see a note from your parents telling you that they have gone away for the night. You think that this is perfect as now you know you won't be distubed when Tommy comes over. You hear the doorbell ring and answer it. It's Tommy.<br>\r\n\"Hey Tommy, come on in, take your shoes off though, my mum doesn't like shoes o in the house.\" you say to him.<br>\r\n\"Thanks, sure thing!\" Tommy replies, slipping off his shoes. You look down at his socked feet and ideas start to race through your head.<br>\r\n\"Um, is there something wrong with my feet?\" Tommy asks you shyly.<br>\r\nYou look back up to his face and feel yourself going red. \"Oh, sorry just thinking about something, that's all. You wanna play some video games?\" you ask.<br>\r\ntommy nods and you take him up to your room.<br>\r\n\"Make yourself comfortable\" you tell him as you put tekken on. Tommy sits down on your bed and you sit next to him.<br>\r\n\"Hey, how about we make this interesting?\" you ask him.<br>\r\nTommy looks at you confused. \"What do you mean?\" he asks you.<br>\r\n\"Well, if I win, you have to do whatever i want you to and if you win I have to do what you want\" you say.<br>\r\ntommy thinks about it and nods his head. \"Okay, your on!\" he says grinning. You both begin to play and after a hard fought battle... </span></div></div>",
            "created":1257224400,
            "id":785958,
            "title":"Tommy 13 (size 8 feet)"
        },
        "111":{
            "author_id":"nanashi99",
            "author_name":"nanashi99",
            "choices":[
                "Let me play with your feet",
                "Let me tickle your feet",
                "Stick your feet in my face"
            ],
            "content":"<div class=\"\"><div> <span>With the final combo landed, you're character stands victorious. The screen blares out \"YOU WIN\", and you turn to Kevin, and just to rub it in, start rocking back and forth like you're dancing saying \"aw yeah, who's the man, I'm the man\".<br>\r\n\"Dude shut up, you're so lame\" Kevin laughs and pushes you over.<br>\r\n\"Hey you can't do that to your new master, \" you say. \"Remember the deal was, whoever one, the loser had to do whatever they wanted,\" you remind him.<br>\r\nKevin rolls his eyes, and lets out an \"ugh\". \"Fine he says, what do I have to do, your chores or something?\"<br>\r\nYou smile evilly, \"Oh no young Kevin,\" you say,  \"the fate I have in store for you is much worse,\" which would be great, if it were true, but you don't have a clue what you want him to do for you.<br>\r\n\"Whatever dude,\" Kevin says. You look down at the floor trying to think up something suitably fun to do to him, and see Kevin's socked feet. He's unconsciously wiggling his toes. Oh. Oh YES.<br>\r\n\"OK first thing is, take of your socks,\" you say.<br>\r\n\"My socks?\"<br>\r\n\"Yeah, just do it, that's the deal after all,\" you remind him.<br>\r\nKevin complies, and you watch him slip off his socks to reveal his large, slightly tanned feet, with broad soles, and well defined toes. Oh you could have fun with those.<br>\r\n\"All right, \" you say, \"Now you're going to...\"</span></div></div>",
            "created":1390280820,
            "id":1730856,
            "title":"You win!"
        },
        "112":{
            "choices":[
                "Starts to smell your socked feet",
                "Asks if he can take off your socks and smell your bare feet"
            ],
            "content":"<div class=\"\"><div> <span>You watch in shock as Tommy completely beats you without you even touching him! Tommy giggles a little as he see's the look on your face.<br>\r\n\"I've been practicing a lot\" he says.<br>\r\nYou nod at him. \"Well dude, you won fair and square. What do you wanna do?\" you ask.<br>\r\nTommy gulps nervously and starts to turn red. \"Um, well, I was wondering if...\" he trails off.<br>\r\n\"What is it Tommy, You can ask for anything\" you say, wondering what's making him so nervous.<br>\r\n\"Um, well, I was wondering if I could, um, smell your feet?\" he says, looking away from you. You sit there stunned. Here you were trying to get at Tommy's feet when he wanted to get at yours.<br>\r\nYou grab his shoulder and he looks at you. \"Hey, you beat me fairly, so I have to give you what you want! Go ahead dude!\" you say.<br>\r\n\"You really don't mind?\" Tommy asks, sitting down in the floor in front of you.<br>\r\n\"Of course I don't! Infact, I think we both might enjoy this!\"<br>\r\nTommy takes your foot into his hands and stares at it like it's the most amazing thing he's ever seen. Tommy...</span></div></div>",
            "created":1257224400,
            "id":785964,
            "title":"Tommy's suprising request"
        },
        "1121":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "Smell your bare feet?\"",
                "\"Lick your bare feet?\"",
                "Worship your bare feet?\""
            ],
            "content":"<div class=\"\"><div> <span>You watched as he took your foot and started to sniff it, hard, taking in all the sweat and smell from your socks.<br>\r\n\"You must really love my feet Tommy?\" You say with a smile as he smells your feet.<br>\r\n\"I love them, they smell so good\".<br>\r\nHe started to lick you socks, you didn't mind, he seemed to be loving it<br>\r\nHe smelt your socked feet for a good hour, in between a few licks he was enjoying it as much as you were.<br>\r\n\"Hey, can I try something with you?\" Tommy asked from between your smelly feet.<br>\r\n\"Sure\".<br>\r\nHe smiled and said \"Can I please............</span></div></div>",
            "created":1343192400,
            "id":1388701,
            "title":"Starts to smell your socked feet"
        },
        "1122":{
            "choices":[
                "Kiss and lick my feet Tommy",
                "Take your socks off and rub our feet against each others  ",
                "Take off your socks and let me sniff your barefeet Tommy"
            ],
            "content":"<div class=\"\"><div> <span>\"Can i take off your socks and smell your bare feet?\" Tommy asks you. \"Of course,\" you reply secretly thrilled that Tommy had a boys foot fetish like you. He slowly peeled off your socks and took your left foot and held it up to his nose and inhaled. \"Mmh that smells gorgeous!\" Tommy sighed joyfully as though the smell of your feet was everything he imagined. \"Thank you,\" you blushed flattered that Tommy like your feet. He grabbed your other foot and both your bare feet up to his nose and smelled them. He them took your feet and rubbed them all over his face, which you liked the feeling of. After half hour Tommy said how lovely your feet were to touch with his hands and smell and suggested you can choose what to do regarding feet next. You decide to ...</span></div></div>",
            "created":1279515600,
            "id":920853,
            "title":"Asks if he can take off your socks and smell yo..."
        },
        "11222":{
            "author_id":"cannedgoods",
            "author_name":"CannedGoods",
            "choices":[
                "Want him to stay for the sleepover",
                "Go to Tommy's house"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Tommy,\"<br>\r\n\"Yeah?\" He responds, still sniffing your bare feet.<br>\r\n\"Could you take your socks off?\"<br>\r\n\"Of course, man,\" He begins to peel off his socks.<br>\r\nA sharp stench fills the room as Tommy finishes removing his footwear.<br>\r\n\"Mmmm...\" You think in your head.<br>\r\nYou and Tommy, now both barefoot, throw your socks in a pile near the TV. <br>\r\n\"Woah, that smells.\" You playfully brush Tommy's foot with your toes.<br>\r\nHe giggles, then places his sole on yours. Soles touching, you and Tommy start rubbing each others feet.It feels great. Tommy wiggles his toes on your toes, exchanging toejam.<br>\r\nTommy brings his other foot near your left foot, and begins playing with that too. You compare feet, and you notice you're both nearly the same size.<br>\r\n<br>\r\nYou and Tommy pause for a while, staring at each other's naked soles. Tommy's once-clean feet <br>\r\nare now covered in house dirt, which used to belong to yours. Both pairs smell like a rubbish dump; the combined stenches create a feet-y aura.<br>\r\n<br>\r\nSitting down with legs out, soles showing, Tommy smiles.<br>\r\n\"Wow. And I thought I was the only person on Earth who liked feet,\" He sighs, still looking at your feet. You both laugh, and then reconnect soles.<br>\r\nYour toes intertwine, creating a ticklish sensation.<br>\r\n<br>\r\nYou and Tommy continue rubbing bare feet for an hour or so, until Tommy notices the time.<br>\r\n\"Hey, it's getting late, wanna sleepover my house?\" He offers. <br>\r\n\"My parents wouldn't mind either your place or mine,\" Tommy continues. <br>\r\n<br>\r\nYou...<br>\r\n<br>\r\n</span></div></div>",
            "created":1320382800,
            "id":1217801,
            "title":"Take your socks off and rub our feet against ea..."
        },
        "112221":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "Yes, bearly",
                "No, he passes out from the smell"
            ],
            "content":"<div class=\"\"><div> <span>You both looked at each other and smiled and you said \"I want you to stay here tonight\".<br>\r\nTommy smiled and went off to get his things from his house, while he was gone, you decided to get to know his feet better.<br>\r\nYou went over to his discarded socks and wrapped them around your face, taking in the full power of his feet.<br>\r\n<br>\r\nIn a few minutes Tommy had returned with a bag packed for the night,he had pjs, toothbrush, a feather and some duct tape.<br>\r\nHe smiled and said \"What should we do now?\" <br>\r\nYou replied \"How about we have a little game of truth of dare?\"<br>\r\nTommy thought for a minute and agreed, you both sat on the floor, around your shoes.<br>\r\n\"Right, Tommy , truth or dare?\"<br>\r\nTommy replied \"Dare\".<br>\r\nYou smiled and got the duct tape and said \"Your dare is to be tied up and have to smell my shoe for five minutes\".<br>\r\nHe wriggles with excitement was you duct taped is hands and feet together and grab you're reeking shoe and taped it to his face, sole up.<br>\r\n\"You're five minutes, start now\".<br>\r\nDoes he survive?</span></div></div>",
            "created":1341118800,
            "id":1370247,
            "title":"Want him to stay for the sleepover"
        },
        "12":{
            "choices":[
                "Lost and she makes you smell her feet [Which you enjoy]",
                "Lost and she makesyou give her a foot massage",
                "Won and get to tickle her feet ",
                "Won and tell her to let you kiss and lick her feet",
                "Won and made her kiss you on the lips"
            ],
            "content":"<div class=\"\"><div> <span>Katie usually wore flip-flops, And today was no different. You peered under her desk to see her beautiful bare feet and cute toes. She was curling her toes and flexing her feet as she did the dmb, pointless assignment your teacher gave out. You were on friendly terms with Katie, actually close friends, but never until now did you notice just how cute she was, from her head to her toes... literally! So you passed her a note asking if she wanted to hang out after school. She looked at you and nodded with a warm smile.<br>\r\n<br>\r\nAfter school, she walked with you to your house. .As you came in the door, you took off your sneakers and told Katie no shoes on in the house. (This was just a lie to get her bare-foot again) You watched as her flip-flops came off, and tried as hard as you could not to drool. Then you lead her to your room and started up the game. You decided  your Playstaion 2 would be fun, since she already knew how to play it.. After a while, you offered to make wagers on the games that you competed in. She smirked at you and said \"You're on!\" <br>\r\n<br>\r\nShe played a good game, and in the end you...<br>\r\n   <br>\r\n</span></div></div>",
            "created":1242968400,
            "id":695481,
            "title":"Your Friend, Katie"
        },
        "121":{
            "author_id":"spongebobrpg",
            "author_name":"The Billie Jean",
            "choices":[
                "Lick her soles",
                "Suck her toes",
                "Something other in mind..."
            ],
            "content":"<div class=\"\"><div> <span>\"Yes! I won!\" Katie proudly said with a smile on her face. She looked at you and said, \"Well, I'd better get you something good to do.\" Katie thought about it for quite a while, before finally saying, \"Okay, you have to smell my feet.\" You got excited, but not TOO excited that she a actually noticed.<br>\r\n<br>\r\nKatie placed her feet on your lap and wiggled her toes as if you were tickling her. \"Go ahead, smell 'em.\" she said with a sly look on her face. You took hold of her left foot and brought the toes up to your nose. You took a deep whiff and sighed with pleasure. Katie's feet smelt stinky, but in a good way. \"Don't just do one foot!\" Katie shouted, as she hovered her right foot in your face.<br>\r\n<br>\r\nYou dug your nose into her right foot toes and took multiple sniffs. \"How do they smell?\" she asked, backing her foot away from you. You reply by telling Katie that her feet smell like candy. Katie blushes at this, but not in any embarrassed way. \"Then I wonder how they taste...\" she said as she looked at you with a naughty expression on her face.<br>\r\n<br>\r\nWhat does Katie force you to do?</span></div></div>",
            "created":1427704380,
            "id":1956163,
            "title":"Smells like Candy"
        },
        "123":{
            "choices":[
                "Tie her up and tickle harder",
                "Change plans- smell her feet",
                "Do her a favor and rub her feet"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, I won so I want to tickle you.\" You told Katie. She put the Wii controller down and sighed. \"Well, you won. A deal is a deal.\" She says. You kneel in front of her. (She was sitting in a chair) \"Are you ticklish?\" You asked, getting into the moment. Katie nodded. \"Yes, I'm horribly. Especially on my feet!\" You wasted no more time. Grabbing one foot in one hand, you held it firmly. It was really soft and just a little damp and smelly. With your other hand, you drag your index finger from her heel up to her arches, making her giggle and laugh while thrashing about. You did it again, only this time went up to her toes and started to tickle between them. \"Hahahahhaha That- hahahaha tickles so mu- haha -uch!\" Katie squeals. She was rolling around and even though you held her foot in your other hand, it was still hard to keep it still. Seeing this, you decided to...</span></div></div>",
            "created":1248930000,
            "id":735147,
            "title":"Won and get to tickle her feet "
        },
        "1231":{
            "choices":[
                "Since she's tied up, lick her feet since she can't stop you",
                "See what her fet smel like",
                "Ask if she wants to tickle you"
            ],
            "content":"<div class=\"\"><div> <span>You stop tickling Katie and stand up. She was panting and trying to catch her breath. She's clearly very ticklish and seemed to like being tickled. \"You're squirming around too much. I'm gonna have to tie your feet up so they ain't so hard to hold onto.\" You explain as you grab some rope from your closet. \"Wait! I don't wanna be tied up. Just bare with me please?\" Katie begs. You got the rope and sat at her ankles. \"Sorry Katie. But this will make it more fun.\" you sy as you begin tying her feet together. You tied them tight, but not enough to discomfort her too much.<br>\r\nNow you start to drag two fingers up her soles, making her laugh again. She had such a cute laugh... Then you started to spider your fingers across both her feet, making her balistic with laughing. You increased the intensity, tickling harder and faster. But now this was starting to bore you. What do you do?</span></div></div>",
            "created":1249016400,
            "id":735636,
            "title":"Tie Katie up and tickle harder"
        },
        "12311":{
            "author_id":"yoshiissick",
            "author_name":"Zygansky",
            "choices":[
                "up and down",
                "left and right"
            ],
            "content":"<div class=\"\"><div> <span>Slowing down the tickling to teasing you looked up into her face. Her hair was tangled from the violent shaking of her head. Katie still smiled, breathing heavily and giggling from the soft touches on her tender soles. \"Enough. No more.\" she managed to say. Finally you stopped completely but held her left foot firmly in your hand.<br>\r\n<br>\r\n\"Untie me now.\" Katie demanded, but you smiled and replied \"No, sweetie. Your feet are asking for more. Hey, little foot. Wiggle if you want more attention.\" And you scribbled my finger hard on her sole. \"Oooooohmy\" she squealed and violently shook her foot. \"That is great\" you said to the foot, ignoring what Katie said. You held my nose close to the foot and sniffed. It was more sweaty now after the tickling.<br>\r\n<br>\r\nThe cute tied up thirteen year old girl peeked anxiously down from her sitting position on her chair. It was a mix of being amused and being uncertain why you were focusing on her feet. \"Do you want to be tickled more?\" you asked the foot? It moved from left to right and back. Finally it understood me. You kissed the instep. Katie squealed and pulled at her foot. \"What are you doing? This is weird, and it really tickles.\" Ignoring her you continued your talk with her foot. \"My my you are smelly. Do you want to be cleaned?\"<br>\r\n<br>\r\nKatie had to decide quickly. She was careful of her appearance, and having smelly feet was an insult to any cute girl sitting in a room with a boy of her age. What would he do with her foot, clean or dirty? She wiggled her toes and moved her foot<br>\r\n<br>\r\n- up and down - yes<br>\r\n- left and right - no</span></div></div>",
            "created":1469368200,
            "id":2185453,
            "title":"Since she's tied up, lick her feet since sh..."
        },
        "13":{
            "author_id":"dxfan2478",
            "author_name":"dxfan2478",
            "choices":[
                "Tickle Jimmy's feet.",
                "Ask Jimmy to use you as a footrest by putting his feet on your shoulders.",
                "Smell Jimmy's feet.",
                "Take Jimmy's socks off.",
                "Rub Jimmy's feet."
            ],
            "content":"<div class=\"\"><div> <span>so you decide to ask Jimmy to hang out with you after school. Jimmy says\"sure, let's hang out at my house okay\". you say \"sounds great\". so you and Jimmy get to Jimmy's house and go into his room to watch tv. you are sitting on the floor at the foot of Jimmy's bed. Jimmy is sitting on his bed with his feet on the floor next to where you are sitting on the floor. Jimmy kicks off his shoes and you are now distracted by his feet. While Jimmy is watching tv, you are watching his feet. you cannot control yourself any longer. so you decide to.......    </span></div></div>",
            "created":1240635600,
            "id":681628,
            "title":"Jimmy 13 (size 10 feet)"
        },
        "131":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "\"Can you do it with my socks off?\"",
                "\"My turn\".",
                "\"Can you rub my feet?\""
            ],
            "content":"<div class=\"\"><div> <span>You could no longer contain yourself, you reached up and touched Jimmy's right foot, it felt warm.<br>\r\n\"What are you doing dude?\" He asked as he looked down at you at his feet.<br>\r\nYou said nothing and just started tickling his right foot, you could hear him giggling.<br>\r\n\"Please stop\". You heard through the fits of laughter<br>\r\nYou continued to tickle him, he laughed and started to sweat as he was helpless to stop you.<br>\r\nJimmy's feet were so nice on your hands that you tickled him even more<br>\r\nHe laughed and laughed until you stopped, he was covered in sweat and almost peed his pants.<br>\r\nYou laughed at him as he said, through his laughter.......</span></div></div>",
            "created":1344056400,
            "id":1397301,
            "title":"Tickle Jimmy's feet."
        },
        "1311":{
            "author_id":"nanashi99",
            "author_name":"nanashi99",
            "choices":[
                "tickle Jimmy's bare feet with your fingers",
                "Tickle Jimmy's bare feet with a haribrush",
                "Tickle Jimmy's bare feet with your tongue"
            ],
            "content":"<div class=\"\"><div> <span>Jimmy's request catches you off guard and you stopped tickling for a second, \"seriously?\" you ask. Given how ticklish he is, the last thing you would think he's want is to be tickled barefoot.<br>\r\nHe looks at the floor and you see that his face is red, and not just from ticklish laughter. \"Um, yeah, I think it would be fun\" he says , looking at the floor embarrassed.<br>\r\nA thought dawns on you, \"Jimmy...do you like having your feet tickled?\"<br>\r\nHe turns even redder, \"...yeah, kinda,\" he says it so quietly it's almost a whisper. There's a quiver in his voice.<br>\r\nYou can't believe it. This is incredible. Not only is he super ticklish, he likes having his feet tickled!. Briefly you wonder if he likes doing other things involving feet too, before seeing how he's still staring at the floor mortified.<br>\r\n\"Hey,\" you scoot over to him on your knees. \"It's cool dude, I'm not going to tell anyone or anything,\" you assure him. \"In fact,\" may as well go for it, \"I think it's cool you like tickling feet. Cause I like tickling them!\" You wait for his response.<br>\r\nJimmy looks at you finally, like he's afraid you might be making fun of him, \"Really?\"<br>\r\nYou smirk, \"oh yeah, I'll show you how much I like it,\".<br>\r\nYou lunge back over toward his feet and grab them in an arm look. Jimmy lets out a little \"eep\", but there's a playfulness to it, that makes you think, he's starting to have fun again too.<br>\r\nOnce you have his feet secured in your left arm, you grab the toes of both of his socks in your right and rip them off. Jimmy's feet are pale and soft. His arch is well defined and his soles smooth to the touch. Jimmy's feet are longer than they are broad, but definitely cute, and obviously very ticklish. You wonder if he'll be able to take being tickled barefoot. You hope so. If he likes it, this might become a regular thing. The thought makes you smile.<br>\r\nTime to get to it. \"Are you ready?\" you ask. Jimmy nods. \"Okay, here we got!\"</span></div></div>",
            "created":1390277820,
            "id":1730828,
            "title":"\"Can you do it with my socks off?\""
        },
        "13111":{
            "author_id":"nanashi99",
            "author_name":"nanashi99",
            "choices":[
                "Go and find some tools to tickle Jimmy's feet with ",
                "Tickle Jimmy's feet with your fingers and tongue"
            ],
            "content":"<div class=\"\"><div> <span>Glancing down you see Jimmy's bare soles exposed for the first time.His feet are long but not overlarge, and the soles smooth, with high arches that end in flexible, rounded toes. His toes scrunch and flex reflexively when exposed to the slight breeze blowing through the room. Even that tiny bit of airflow seems to tickle him somewhat.<br>\r\nThis is going to be soooooooooo much fun.<br>\r\nYou let him wait in suspense for a moment while you savor the feeling of having his bare, ticklish feet exposed and at your mercy. Slowly then, very very slowly you take your right index finger and drag up his right sole from toe to heel. <br>\r\nJimmy giggles. <br>\r\nYou repeat the process on his left sole. More giggles.<br>\r\nOK enough warm up.<br>\r\nYou begin skittering your fingers across both of his soles and around the edges of his feet, brushing your fingernails lightly against the skin. <br>\r\nJimmy goes ballistic. He begins laughing deeply and struggles to pull his feet away. But he isn't going to get away. <br>\r\nOh no, you're just beginning.</span></div></div>",
            "created":1393659180,
            "id":1753634,
            "title":"tickle Jimmy's bare feet with your fingers"
        },
        "132":{
            "author_id":"dxfan2478",
            "author_name":"dxfan2478",
            "choices":[
                "Timmy 12 (Jimmy's younger brother)",
                "Tammy 14 (Jimmy's older sister)",
                "Jimmy's mom"
            ],
            "content":"<div class=\"\"><div> <span>You say to Jimmy \"Hey Jimmy\" and Jimmy responds by saying \"What is it, Steve?\". you say \"Why don't you rest your feet on my shoulders so you can feel relaxed while you are watching tv\". Jimmy says to you \"Are you sure you won't mind my stinky feet on your shoulders\". You say \"If you want to do it you can\". Jimmy says to you \"As long as you are okay with it, i will put my stinky feet on your shoulders\". Jimmy then says to you \" Why don't you move to in front of me so I can put my feet on your shoulders\". You say to Jimmy \"Okay, Jimmy\". you move and sit in front of Jimmy. Jimmy waits until you are comfortable and then puts his feet on your shoulders. Then Jimmy says to you \" You are right, Steve. this is relaxing\" and he wiggles his toes in relaxation. You say \"I told you so, Jim\". Just then you and Jimmy hear a knock at Jimmy's door. Who could it be?.............     </span></div></div>",
            "created":1240722000,
            "id":681712,
            "title":"Ask Jimmy to use you as a footrest by putting h..."
        },
        "1321":{
            "author_id":"dxfan2478",
            "author_name":"dxfan2478",
            "choices":[
                "Smell their feet",
                "Tickle their feet",
                "Take their socks offf"
            ],
            "content":"<div class=\"\"><div> <span>Jimmy calls out \"Who is it\". \"It is me Timmy\" answered Jimmy's younger brother Timmy. Jimmy answers \"Come on in, Timmy\". Timmy opens the door and sees his brothers feet on your shoulders. Timmy asks \"Why do you have your feet on his shoulders, Jimmy\". Jimmy answers \"My new friend Steve here said it would make me more relaxed while we were watching tv\". Timmy asks \"Is it okay for me put my feet on Steve's shoulders\". Jimmy answers \" As long as Steve is okay with it\". You say \" It is fine with me, both of you can have your feet on my shoulders\". Timmy says \"Cool, Jimmy can you move over please so i can put my feet up on Steve's shoulders?\". Jimmy says \"No prob, bro\". Jimmy crosses his legs and puts both of his socked feet on your right shoulder. Timmy also crosses his legs and puts both of his socked feet on your left shoulder. Timmy and Jimmy both their socked feet on your shoulders and both of them have their feet close to your face. You start to smell the aroma of their socked feet and try not to bury your face into their feet.What do you now?............. </span></div></div>",
            "created":1240722000,
            "id":681737,
            "title":"Timmy 12 (Jimmy's younger brother)"
        },
        "13211":{
            "author_id":"dxfan2478",
            "author_name":"dxfan2478",
            "choices":[
                "Jimmy's feet",
                "Timmy's feet"
            ],
            "content":"<div class=\"\"><div> <span>you can't help yourself any longer, so you start to smell Jimmy's socked feet first then his younger brother Timmy's socked feet. The two brothers look at you and Jimmy says to you \"Umm Steve, did you just smell my and my brother's feet?\" you say to Jimmy \" Yes, Jimmy i did. do you mind if smell your feet?\" Jimmy says \"No, I don't mind you smelling my feet but Timmy might mind you smell his feet\". Timmy speaks up and says \"I don't mind if you smell my feet,Steve\". Jimmy says to you \" Well, Steve why don't you keep smelling mine and Timmy's socked feet\". You say to Jimmy \" Well, i think you should chose to smell either yours or Timmy's feet first. who do you want to chose first? </span></div></div>",
            "created":1254891600,
            "id":771540,
            "title":"Smell their feet"
        },
        "13212":{
            "choices":[
                "Tie them up",
                "take off their socks"
            ],
            "content":"<div class=\"\"><div> <span>Just as the two boys are getting very relaxed you make a quick darting movement and soon you have all four socked feet under your left arm. They both shout \"hey!\" in surprise and try to struggle, but you are stronger than both of them combined and you start using all the fingers on your right hand to assault the two pairs of extremely ticklish socked feet. Both of them continue to laugh loudly as you consider what to do next:</span></div></div>",
            "created":1255410000,
            "id":774963,
            "title":"Tickle their feet"
        },
        "132121":{
            "choices":[
                "take their socks off",
                "gloat"
            ],
            "content":"<div class=\"\"><div> <span>You stop tickling them for a short time but keep their feet under your arm. you quickly reach into your schoolbag and pull out a set of ankle, hand, toe and thumb cuffs, a ball gag and a blindfold. (your dad is in the police so has a liscence to buy this stuff for you, and he had a boy foot fetish as well around your age.) You very quickly cuff jimmy's ankles together and as he complains you let go of his brothers feet and he helps you get the rest of the stuff on to his older brother. Then when he is not looking you pull out a second set and cuff him as well. Both boys are now at your mercy as you:</span></div></div>",
            "created":1255410000,
            "id":774969,
            "title":"Tie them up"
        },
        "1321211":{
            "choices":[
                "their older brother (Tommy) walks in on you",
                "you decide to have some real fun"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As the boys struggle in vain, you take their socks off and admire their bare feet for a time before:</span></div></span></div>",
            "created":1255410000,
            "id":774970,
            "title":"take their socks off"
        },
        "13212111":{
            "author_id":"markuswelcher",
            "author_name":"Markus ",
            "choices":[
                "Help his brothers and tickle your feet",
                "Help you and tickle his brothers feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does Tommy do?</span></div></span></div>",
            "created":1496008140,
            "id":2326807,
            "title":"their older brother (Tommy) walks in on you"
        },
        "13212112":{
            "choices":[
                "Tie them up even more",
                "keep it this way for a bit longer"
            ],
            "content":"<div class=\"\"><div> <span>You drop to your knees, undoing your jeans and letting them slide off. you are now in your boxers, and even at this age you can already feel that tingling feeling. You pull their bare feet over and as their struggling feet move between your legs they start to rub your crotch in ways you really enjoy. now you decide it is time to: </span></div></div>",
            "created":1255410000,
            "id":774971,
            "title":"you decide to have some real fun"
        },
        "132121121":{
            "choices":[
                "free them",
                "leave them tied up and go away"
            ],
            "content":"<div class=\"\"><div> <span>It is a bit difficult, but eventually you have one boy tied to the top of the bed with some extra rope and one tied underneath. the rest of their bodies can now hardly move, so you slide up to the boys again. Now as Jimmy's bare feet rub your crotch, Timmy's feet are at the perfect height for you to suck on. This is bliss for you, but after a whole hour has passed you think it is maybe time to:</span></div></div>",
            "created":1255410000,
            "id":774972,
            "title":"Tie them up even more"
        },
        "13213":{
            "choices":[
                "you refuse and becom angry",
                "you tell him it is an houner and start kissing his feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the young boy tell you to kiss his feet by telling you \"can you kiss my feet slave\" and Jimmy put his feet on your head</span></div></span></div>",
            "created":1250398800,
            "id":745098,
            "title":"Take their socks offf"
        },
        "132132":{
            "choices":[
                "suck his feet deepthroat.",
                "lie down and trample your entire body."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You turn your head to his left foot and start kissing it. After a minute or two you continue with his right one. His older brother just stands watching the show of his younger brother getting worshiped. Then the young boy ask you to...</span></div></span></div>",
            "created":1254200400,
            "id":767784,
            "title":"you tell him it is an honor and start kissing ..."
        },
        "1321321":{
            "choices":[
                "suck your feet in return.",
                "allow you to trample him anywhere you wanted."
            ],
            "content":"<div class=\"\"><div> <span>Timmy stands up and sits in front of you. He moved his feet close to your face. He rubbed it a couple of times and told you to open your mouth. You were very happy to suck the toes and feet of Jimmy's brother Timmy. Who would have thought that this young kid could have a foot fetish like you. Your thoughts were interrupted by Timmy who had put his left foot at your mouth. He wanted you to start sucking it and soon after the right one too. You started to suck  his feet and loved it. The feet of his brother were still on your shoulders and you could feet the smell of his feet. Timmy pushed very deep inside your mouth and he managed to place his feet deep - his heels were in your mouth. For a boy at the age of 12 he had small feet. You noticed that because you were able to suck his foot that deep. But nonetheless you loved the feel of his small toes wiggling inside you mouth and the taste was marvelous. After 20~30 minutes sucking, Timmy decided to...</span></div></div>",
            "created":1254200400,
            "id":767807,
            "title":"suck his feet deepthroat."
        },
        "13213211":{
            "choices":[
                "Jimmy's female cousin Tanya (15 years old)",
                "Jimmy's other brother Jack (11 years old)"
            ],
            "content":"<div class=\"\"><div> <span>\"Can I suck your feet now Steve?\" Timmy asks.<br>\r\n\"Of course\" You say. You take off your socks and Timmy comes to the head off them and leans down starts sucking and kissing your feet and toes. You enjoy what Timmy does and are estatic at how amazing he is and how it feels. He does this for half and hour as Jimmy also put his foot on your face which you sniff deeply. Timmy then takes your feet and rubs it all over his face whilst Jimmy sticks his big toe in your mouth, you begin to suck it. Then somebody walks in.</span></div></div>",
            "created":1271048400,
            "id":867046,
            "title":"suck your feet in return."
        },
        "132132112":{
            "choices":[
                "Let's trample our feet on Jimmy",
                "Rub Jack's feet and lick them"
            ],
            "content":"<div class=\"\"><div> <span>Jimmy's youngest brother Jack who was 11 walked in on the scene. He stares in amazement at what he was seeing, Timmy with your feet on his face and his eldest brother with his big toes in your mouth. You look up as Jimmy takes his big toes out of your mouth and Timmy puts your feet on the floor and faces Jack also. \"Do you all like feet or something?\" Jack asks still shocked at what is seeing but also he realizes there is a slight intrigue within his voice and the others including you don't fail to notice. \"We do\" You say. \"In fact\" You look at Jack's feet and see that he is barefoot. You instantly love the look of his feet and want to have his feet in your face like Jimmy's. \"We know you like feet as well, little bro\" Jimmy suddenly says.<br>\r\n\"Yeah\" Timmy echoes. \"We've seen you looking at our feet often when you think we're not looking but we've noticed\"<br>\r\nJack turns red at this realization that his brothers have known all along. He thought he had kept it hidden so well but looking into the faces of his older brothers and you. He realizes they're not embarrassed and you ask. \"Do you want to join us?\" Jack nods eagerly and you and the others smile. He comes in you ask him to put his feet on your face. He does whilst Timmy picks up your feet, he takes the right and Jimmy takes the left and they begin kissing and licking them all over. You loved that you are being treated. The feel of Jack feet on your face is heaven to you. Then after a while Timmy suggests.      </span></div></div>",
            "created":1271134800,
            "id":867361,
            "title":"Jimmy's youngest brother Jack (11 years old)"
        },
        "1321321122":{
            "choices":[
                "Timmy with Jack and Steve with Jimmy ",
                "Steve and Timmy and Jack with Jimmy"
            ],
            "content":"<div class=\"\"><div> <span>\"Lets give Jack a turn now\" Timmy says. \"Lets rub and lick his feet\"<br>\r\nJack takes his feet off your face. \"Well\" You ask. \"Would you like all three of us to worship your feet Jack?\" He face lights up and he can't believe any of this was happening. He had wanted to find other people who had his fetish for so long. And the whole time his two older brothers and there friend had it! Jack nods with delight. Jimmy instructs him to get on the floor and stretch his legs out. \"Would you like someones feet on your face as well little bro?\" Timmy asks.<br>\r\n\"I would\" He says.<br>\r\n\"Who do you want?\" <br>\r\nJack points to you and you say your happy to return the favor. You walk over to him and place both feet on his face. Timmy begins rubbing his right foot and Jimmy licks the left. Jack begins to moan with pleasure at the treatment he was receiving. His brothers tongues were so soft and he loved your feet on his face. They smelt so nice to him that it send pleasure through his stomach. Soon you stick your left foot deep in his throat and he begins to suck and loves the taste. After an hour of this everyone stops and Jack says how much he enjoyed it all, \"I loved your feet on my face Steve and sucking them\" You thank him.<br>\r\n\"And you two\" He says to his brothers. \"Your worshiped my feet so well. I had no idea it would be this enjoyable!\"<br>\r\n\"That's because you have gorgeous feet little bro\" Timmy says sincerely.<br>\r\n\"Tell you what\" Jimmy suggests.\"Seeming as how we've made decisions about what to in relation to worshipping each others feet so far. You can choose with what we do with it next\"<br>\r\n\"Are you sure\" Jack asks. You and Timmy concur.<br>\r\n\"Okay thanks\"Jack gives it some thought and then suggests the group split into pairs and worship each others feet. You and the others agree, but who goes with who?   </span></div></div>",
            "created":1271134800,
            "id":867659,
            "title":"Rub Jack's feet and lick them"
        },
        "13213212":{
            "content":"<div class=\"\"><div> <span>\"Alright this is enough. Now I want you to trample me all over.\"<br>\r\nYou look at Jimmy who didn't say anything. His brother took off his shirt and lied on the floor next to you.<br>\r\n\"Don't worry I can take your weight, just take your socks off and trample me.\"<br>\r\nYou stood up, took off both your socks and stepped on his hands at first. Then you stepped on his stomach and chest. He really liked it - that was how he looked. You placed your left foot at his face and left all the weight to fall on Timmy's chest. After a couple of minutes trampling the fellow you sat down and he stood up. He asked for a final lick at his feet and then told you that you can leave. You did that and went for the door. Jimmy told you on your way out that his bro would like you to come more often to their house to play. You were very happy to hear that and said that if you can you would.</span></div></div>",
            "created":1254805200,
            "id":771049,
            "title":"allow you to trample him anywhere you wanted."
        },
        "1321322":{
            "choices":[
                "jimmy walks over and puts his barefoot on your face ",
                "jimmy steps on your stomach too and tramples you with his little brother"
            ],
            "content":"<div class=\"\"><div> <span>timmy laughs and says heck ya, you lay on the floor and then i will trample on your entire body. jimmy then says, wait he is my friend i should get to trample also. Steve says look you can both trample me. timmy you can go first then jimmy can trample me. timmy steps onto his legs and jimmy just stands there lookin sort of bored. timmy walks up onto his pelvis and then onto his stomach. steve makes an ugh sound when timmy steps there. you are very excited as you are having this little kid walking all over you. jimmy looks like he wants to be involved in this...how will get involved?</span></div></div>",
            "created":1264136400,
            "id":824110,
            "title":"lie down and trample your entire body."
        },
        "13213221":{
            "choices":[
                "timmy stands back up on you and make u lick his feet more",
                "jimmy says now let us lick your feet"
            ],
            "content":"<div class=\"\"><div> <span>jimmy walks over and gets a chair and sets it down by your head. You begin to wonder exactly what his plans are. timmy is having a blast walking and stomping his 8 yo feet on your stomach and chest. timmy then stops and says im tired i need to take a rest. timmy sits on your stomach and proceeds to put his feet in your face and says there you go you little footslave lick and kiss my feet while i rest. you do so and become more and more excited about getting to taste this kids smelly feet. his older brother jimmy has sat in his chair and began to rub his feet in your face and then laughs and you lick his feet too. suddenly...</span></div></div>",
            "created":1264136400,
            "id":824111,
            "title":"jimmy walks over and puts his barefoot on your ..."
        },
        "1322":{
            "author_id":"dxfan2478",
            "author_name":"dxfan2478",
            "choices":[
                "smell their feet",
                "tickle their feet ",
                "take off Jimmy's socks"
            ],
            "content":"<div class=\"\"><div> <span>Jimmy asks \"Who is it?\". <br>\r\n\"It's me Tammy, Can i come in?\". <br>\r\nJimmy says \"Sure. Come on in, Sis\". Tammy walks into Jimmy's room. She is already barefoot as she likes being barefoot. She sees her younger brother's feet on your shoulders. <br>\r\nTammy asks \"Jimmy, why do you have your stinky feet on his shoulders\". <br>\r\n\"He told me it would be relaxing\". replied Jimmy <br>\r\n\"Would your friend mind if I could relax by putting my feet on his shoulders?\"replied Tammy. <br>\r\nJimmy replied \"As long as Steve does not mind\". <br>\r\nYou reply \"I don't mind at all. Go right ahead, Tammy\". She tells Jimmy to move over so she can put her feet on your shoulders. now you have Tammy's feet on one shoulder and Jimmy's feet on the other shoulder. what do you now?</span></div></div>",
            "created":1243141200,
            "id":696266,
            "title":"Tammy 14 (Jimmy's older sister)"
        },
        "13221":{
            "choices":[
                "You massage her feet",
                "You lick her feet"
            ],
            "content":"<div class=\"\"><div> <span>Now youhave Tammy and jimmy's feet on your shoulders.<br>\r\nSo, you cannot remain without sniffing one of their feet. <br>\r\n<br>\r\nJimmy says, \"I need to go to the bathroom!\"<br>\r\nSo he gets up and leaves the room, leaving you and the hottest girl in the whole school alone with her feet on your shoulders!!!<br>\r\nYou propose that when someone smells your feet, it feels even more relaxing! So you begin to sniff her feet for a very long time!<br>\r\nYou can smell her beautiful sweaty, stinky feet. It is awesome<br>\r\nThen...<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1293944400,
            "id":1027501,
            "title":"smell their feet"
        },
        "132212":{
            "author_id":"dxfan2478",
            "author_name":"dxfan2478",
            "choices":[
                "\"Yes Jimmy but this time can you take your socks off?\"",
                "\"No Jimmy. Let's try me being on my back and you two can put your feet on me\""
            ],
            "content":"<div class=\"\"><div> <span>With her feet sitting on your shoulders, you decide to be bold and lick her feet. Tammy notices your tongue on her feet and looks at you.<br>\r\n\"Hey Steve, Did you just lick my feet?\" asks Tammy with a puzzling look on her face. You now feel ashamed a bit but respond to her question.<br>\r\n\"Yes, Tammy. I did lick your feet. I'm so sorry.\" You now feel ashamed a bit. Tammy smiles at you.<br>\r\n\"Don't be sorry, Steve. It's quite alright. You got a thing for feet don't ya, Steve?\" asked Tammy.<br>\r\n\"Yea. I do have a thing for feet, Tammy. I'm so sorry.\" <br>\r\n\"Steve, Don't be sorry. It's alright. I had a feeling you did even before you licked my feet. Can I ask you some more questions, Steve?\" asked Tammy.<br>\r\n\"Of course, Tammy. You don't think I'm weird for liking feet?\" you ask Tammy.<br>\r\n\"It may look weird to others but I don't mind it. So for my first question. Do you like my feet, Steve?\"<br>\r\n\"Yes, Tammy. I think you have some very nice feet.\" you reply.<br>\r\n\"Aww well thanks, Steve. Do you like my little brother Jimmy's feet too?\" asks Tammy.<br>\r\n\"Yes I do like his feet too but worry he will think I'm weird if I admit it.\" you reply. Before Tammy could ask another question, Jimmy returns from the bathroom. <br>\r\n\"Did I miss anything?\" asked Jimmy. Tammy looks at you. You look at her.<br>\r\n\"Actually, Jim. I found out that your friend here likes feet but didn't want admit it to you because he was too afraid you would think he was weird.\"<br>\r\n\"Oh he did? I don't find that weird at all. So you like feet huh, Steve?\"<br>\r\n\"Yes Jimmy. I do. It's why I offered to be your footrest and then Tammy's of course. You seriously don't find it weird that I like feet, Jimmy?\"<br>\r\n\"I don't find it weird at all, Steve. It's actually kinda cool to be honest. Do you want me to rejoin Tammy and put my feet on your shoulders now?\"<br>\r\nYou think for a minute and say.......</span></div></div>",
            "created":1387774800,
            "id":1712217,
            "title":"You lick her feet"
        },
        "13223":{
            "choices":[
                "massage Jimmy's feet with Tammy putting her feet on her brother face.  ",
                "Kiss Tammy's feet and have Tammy kiss Jimmy's"
            ],
            "content":"<div class=\"\"><div> <span>You can't believe that you have both Jimmy's socked and his older sister Tammy's bare feet on your shoulders. They smell heavenly to you but you really wanted to get to Jimmy's bare feet so you ask him if you can take off his socks and he says yes. Once they're are now both barefoot. You decide to...  </span></div></div>",
            "created":1273899600,
            "id":883704,
            "title":"take off their socks"
        },
        "133":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "A sly grin",
                "A video camera, recording",
                "A shocked look"
            ],
            "content":"<div class=\"\"><div> <span>The tension was becoming too much for you to handle, slowly you got yourself into a good position by laying down on the bed with your feet at the head of the bed and your face at the end. Jimmy thought nothing of it as you moved your head closer and took in a few light whiffs of his feet, they smelt fantastic, they had been in those socks and sneakers all day and their scent was amazing. <br>\r\n<br>\r\nYou managed to pluck up the courage and put your nose right next to his feet and sniffed them really hard to get in as much of the smell as you could. You rubbed your nose against his socked feet and loved every second of the whole experience and never wanted it to end. You were in such bliss you had not even noticed, or cared about looked at Jimmy, when you looked up at Jimmy's face you saw.......</span></div></div>",
            "created":1394750340,
            "id":1759900,
            "title":"Smell Jimmy's feet."
        },
        "1332":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "Taking my socks off with your teeth\".",
                "Rubbing my feet\".",
                "Showing me your feet\"."
            ],
            "content":"<div class=\"\"><div> <span>You looked up to see how Jimmy was taking having his feet sniffed by you, but to your shock he had a video camera in his hand, and the little red light was on, he was recording this. He grinned behind the camera \"Oh that's so cute, this is so going online right now\"., You were shocked that to you got on your knees \"Please don't put that online, it will ruin my reputation at school, everywhere\". Jimmy rubbed his chin and then grinned.<br>\r\n<br>\r\n\"Alright i won't post this online, but you have to come over here everyday after school and be my foot slave\". You were shocked but very excited about that and nodded bowing your head \"Yes Master i will\". Jimmy grinned as he recorded all this on the tape and turned the recorder off and smiled down at you. \"Alright slave you can begin by......</span></div></div>",
            "created":1394751000,
            "id":1759905,
            "title":"A video camera, recording"
        },
        "13322":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Jimmy said to you \"Alright slave you can begin by rubbing my feet\". You couldn't have been happier in this very moment when he asked you to rub his feet for him. You bowed your head in respect \"Yes Master, as you command\". You grabbed a hold of his socked feet and began to rub your thumbs into the balls of his feet, they felt very strong and tight as you rubbed them and as you rubbed they got much easier to rub. Your thumbs got right into the balls of his feet, he was moaning with the pleasure of it all above you and you moved down his foot to the arch.<br>\r\n<br>\r\nWhen you got to the arch you used your fingers and rubbed them into the skin and muscle as you could, they was not much to rub here, but you obeyed your Master did it. Rubbing his arch, you heard Master Jimmy moaning again, he was clearly enjoying this as much, if not more so than you were.<br>\r\n<br>\r\nYou moved down to the heels, the hard skin felt rough under your fingers and thumbs as you rubbed them. They were very hard and when you rubbed the heels, Jimmy loved it high above you on the bed as you rubbed, you kept on going as you had been hoping you could please your Master.<br>\r\n<br>\r\nDo you please him?</span></div></div>",
            "created":1394752320,
            "id":1759912,
            "title":"Rubbing my feet\"."
        },
        "133222":{
            "author_id":"ironlake29",
            "author_name":"Yann",
            "choices":[
                "You try to grab his phone ",
                "you continue to be his slave until he is tired "
            ],
            "content":"<div class=\"\"><div> <span>\" Steve, wretched slave !  it's not enough you continue to RUB my feets or otherwise I will punish you. I think the punishment I can give you.... mmh \" <br>\r\n<br>\r\n\" sorry Master Jimmy, What can I do to make amends? <br>\r\n<br>\r\n\" I have some idea first after having rub my feets you're going to kiss 46 times every toes, understand slave ? \"<br>\r\n<br>\r\n \"your wish is the command master jimmy \"<br>\r\n<br>\r\nmade you pretend to be his pet to grab her phone to delete photos and videos because you are over when it does not look.             <br>\r\n</span></div></div>",
            "created":1469270760,
            "id":2184933,
            "title":"No"
        },
        "134":{
            "author_id":"nanashi99",
            "author_name":"nanashi99",
            "choices":[
                "You say/joke, \"maybe you can use me as a foot rest\"",
                "You say. \"your feet look like they could use a massage\""
            ],
            "content":"<div class=\"\"><div> <span>You just can't control yourself any longer. So you decide to find out what Jimmy's feet really look like. You want to see them bare.You want to see if they are as perfect as you think they are. You want to see if he'll mind if you do. You really, <i>really </i> want to do that. But how do you get his socks off?<br>\r\nSurreptitiously, you glance at his socked feet trying not to turn your head. They're big, but not oversized. Jimmy isn't one of those kids whose feet grow before the rest of him. Rather he's one of the lucky few that adolescence is so far treating kindly. His feet match the rest of him; they fit him. At least what you can see of them so. Stupid socks!<br>\r\nIt's time to act, you have to get those socks off somehow. You take another peek. He's wearing white ankle socks with grey toes. Serviceable, normal socks. Nothing stripey, or loud, or flashy. It's a little disappointing. If he were wearing those kinds of socks, maybe it would mean that he really wanted people to look at his feet, even if he didn't know it. But these are just socks. Normal kid socks. Not <i>kid who likes feet{}</i> socks,or <i>kid who likes to show off</i> socks. Normal.<br>\r\nDammit.<br>\r\nWait. You look one more time. The socks are dirty on the bottoms. He probably wears them a lot. Does that mean he never goes barefoot? Maybe he thinks it's weird!. Why would he think that?: Wait. No. Calm down. You can deal with this. It's probably nothing like that. the sock on his right foot has a hole near the toe, you can jut about see his real foot.<br>\r\nThe tease!<br>\r\nYou can' t take it anymore. You'll just have to wing it.\"Dude, can you like take off your socks or something, they're kinda nasty.\" There, he'll think you're jsut complaining; never suspect a thing. <br>\r\nJimmy laughs, \"That's your problem bro. You're the one who has to deal with them.,\" He says it like a challenge, and moves his feet closer to you. Oh. Fuck. He's practically handing his feet to you because he thinks it's just a game. You can work with this.<br>\r\n\"Fine then,\" you say in the same tone of voice, hoping yours doesn't crack, \"I will!\". You grab both his feet in your left elbow and reach to take off his socks with your hand.<br>\r\n\"Dude what are you doing?\" Jimmy is incredulous, not concerned.<br>\r\n\"Dealing with it, duh,\" you say, sticking your tongue out at him fr good measure.<br>\r\nSlowly you peel off his right sock starting at the heel to expose his soft pink sole. Yeah, his feet are perfect all right. Long and thin, with strongly defined arches and perfectly ordered toes. His sole is magnificent. Quickly now you rip off the left sock too. the foot mirrors it's twin in every way. Both are perfect. You wonder what you could do to them. Are they ticklish? Could you offer him a massage.? You examine the feet more closely. Even the tops are perfect. No blemishes. Not even a single hair on them. <br>\r\nOh shit, have you been staring at them too long? You look at Jimmy. He's watching you kind of amused, and kind of confused too. 4<br>\r\nFinally he says, \"fine you got my socks off, what now?\"<br>\r\nGood question.</span></div></div>",
            "created":1388466000,
            "id":1718087,
            "title":"Take Jimmy's socks off."
        },
        "1341":{
            "author_id":"ironlake29",
            "author_name":"Yann",
            "choices":[
                "Now Can I Clean your feets with à water trey and à tow and you continue to play ",
                "I Begin à Foot Massage While 30 minutes if you want Jimmy ",
                "I Will Clean your Shoes and Sniff your Socks after If you Want of course Jimmy "
            ],
            "content":"<div class=\"\"><div> <span>Jimmy looks at you with a smile and told you<br>\r\n\"OK you lie on the ground in front of me, below the office and I will do some parts of Team Fortress 2 , for 1 to 2 hours\".<br>\r\nIt was really good, he puts his feet on Steve's face like a king and plays for more than 2 hours. and after that Jimmy asked:<br>\r\n\"then you loved it Steve? Now that you want to do ? \"</span></div></div>",
            "created":1478526660,
            "id":2233946,
            "title":"You say/joke, \"maybe you can use me as a fo..."
        },
        "135":{
            "choices":[
                "Take his Socks off",
                "Caress his ankles"
            ],
            "content":"<div class=\"\"><div> <span>You slowly shift closer to Jimmy and his feet. You gently take hold of one of his left foot and gently brush your fingers over his socked soles. Jimmy is confused and asks you what you are doing but you don't respond. He looks over at you with uncertainty, and you take hold of his other foot and give it a reassuring stroke. You then start to rub your fingers over his left foot, he breathes deeply because he is not used to the action. You keep rubbing his feet, changing the amount of pressure that you apply in response to one of his sharp breaths. Jimmy asks you to stop because he isn't sure about this, but you turn around and place your finger on his lips and told him it would be fun. He was clearly frightened now. \"this is going to be fun\" you think as you let your fetish overcome you and...</span></div></div>",
            "created":1263445200,
            "id":820315,
            "title":"Rub Jimmy's feet."
        },
        "1351":{
            "choices":[
                "Kiss his feet"
            ],
            "content":"<div class=\"\"><div> <span>...You move your hand to the edge of his socks and slip one finger inside, then another, then slowly start to pull down, exposing his achilles heel and his soft beautiful ankles. They were a soft, pretty milky color, and you nearly overcome to the aroma. Jimmy shifts uncomfortably and moves to get up, but you push him down and try to reassure him again. You then proceed to strip his socks off and once again start rubbing his soft pink soles. You slip your fingers between his toes and...</span></div></div>",
            "created":1263445200,
            "id":820318,
            "title":"Take his Socks off"
        },
        "13511":{
            "choices":[
                "Take off his pants to reveal his Boxers and Legs",
                "Gloat"
            ],
            "content":"<div class=\"\"><div> <span>You press your lips against his small toes, And Jimmy protests, this time you reach into your backpack and pull out a ballgag and some cuffs. He struggles but you manage to get the gag and cuffs on after a few minutes. Aren't you glad his parents aren't home. You...</span></div></div>",
            "created":1263445200,
            "id":820320,
            "title":"Kiss his feet"
        },
        "135111":{
            "choices":[
                "Suck His toes",
                "Lick his soles"
            ],
            "content":"<div class=\"\"><div> <span>..You slowly raise your hand and unbuckle his belt, sliding his pants down to reveal his legs, which had a soft creamy texture. Jimmy squirmed and you giggle as your fingers slowly creep at the edges of his boxers. You pull them back, as you were simply teasing the poor boy, He settles down, his eyes shimmering with fear and tears. You kiss his cheek to tell him that everything will be fine. You reach down and start massaging his creamy white legs again. Running your fingers from his knees to his ankles, and Jimmy seems to recline in comfort. You decide to try something new and run your toung up and down his legs, from ankle to knee. At first he squirmed but Jimmy seemed to really enjoy this, so you move to his feet...</span></div></div>",
            "created":1263445200,
            "id":820327,
            "title":"Take off his pants to reveal his Boxers and Legs"
        },
        "1351111":{
            "author_id":"jgp149",
            "author_name":"Jack Grey",
            "choices":[
                "\"Can you lick my soles?\"",
                "\"Can I have your feet?\""
            ],
            "content":"<div class=\"\"><div> <span>You looked into Jimmy's eyes and saw that he was loving the feeling of you licking his legs. So you decided to do his feet next. You licked all the way down to his ankles and started to suck on his toes, you got his biggest toe and put it in your mouth, tasting his feet and all the sweat and toe jam that had built up over the weeks since he last washed his feet. He was enjoying it as well, so you moved down his foot, sucking on all his toes and moved onto the other foot. Having sucked all his toes, each was nicer than the last, you decided to do something else, but what, you wanted to ask Jimmy. You walked up to him and removed the gag and said \"Hey Jimmy, what do you want me to do next?\" He laughed and said............</span></div></div>",
            "created":1344488400,
            "id":1401502,
            "title":"Suck His toes"
        },
        "13511111":{
            "author_id":"pcd2000",
            "author_name":"DalekPotter3",
            "choices":[
                "Keep licking his feet",
                "Text another friend and invite them over"
            ],
            "content":"<div class=\"\"><div> <span>\"Lick my soles\" Jimmy said with a smile of interest. You bring your mouth down to the bottom of his foot and slide your tongue across the entire length of his soft sole. Jimmy's foot is still warm and sweaty from the sock. You flick your tongue along his arch, causing your friend to laugh. You experimentally nibble on the ball of his foot and a moan emits from his mouth. You look up to Jimmy while gently biting his toes and see Jimmy watching you with a smirk, curious to see what you do next. You decide to</span></div></div>",
            "created":1471927860,
            "id":2200093,
            "title":"\"Can you lick my soles?\""
        },
        "14":{
            "author_id":"ant101",
            "author_name":"Weaver Of Dreams",
            "choices":[
                "Amy wins!",
                "You win!",
                "It's a tie!"
            ],
            "content":"<div class=\"\"><div> <span>You decide to ask Amy, a shy girl with long jet black hair and brown eyes. Your on friendly terms with Amy, having talked to each other at neighbourhood gatherings and such. Amy says yes when you ask her and you start to think of different ways you can get at her feet.<br>\r\nAfter school the two of you meet up outside of the school gates and you propose that you race to your house.<br>\r\n\"Haha, alright but whoever loses has to do anything the winner wants!\" says Amy.<br>\r\nOf course you agree as this could be the best chance to get to her feet and on the plus side the race should make her feet nice and sweaty!<br>\r\nYou both take off sprinting as fast as you can towards your house which is two blocks away. As you both run you smile at each other and exchange friendly banter. When you see your house you both put on an extra burst of speed and...</span></div></div>",
            "created":1249016400,
            "id":735582,
            "title":"Amy 13 (size 5 feet)"
        },
        "141":{
            "choices":[
                "Rub her sore, tired feet",
                "Kiss her feet to make them feel better",
                "Smell her feet (She's joking though)"
            ],
            "content":"<div class=\"\"><div> <span>Amy beat you by about a yard, though you didn't mind loosing to her. You led her into your house and to your room, nobody was home except your sister who was a year younger than you. You and Amy got in your room and sat down to catch your breath. \"Great race!\" You said to her between pants. Amy smirked at you. \"Yeah, says the looser!\" she laughed. You knew she was just teasing you like you two sometimes did. Amy was about to say something else when you spoke up. \"So... You won. And I guess I gotta do whatever you say. So what's it gonna be?\" <br>\r\nAmy rubbed her chin and then told you to take her shoes off for her since she was too tired to. You happily did so, pulling her size 5 sneakers off to leave her in her red socks. Her feet were hot and sweaty from the race, as you could smell her feet and feel the dampness when you took her shoes off. \"Now, it's time for my reward. I want you to...\" Amy wanted you to do what, now?</span></div></div>",
            "created":1251090000,
            "id":749766,
            "title":"Amy Wants You To Do... What?"
        },
        "1411":{
            "author_id":"dxfan2478",
            "author_name":"dxfan2478",
            "choices":[
                "You kiss Amy's feet ",
                "You smell Amy's feet",
                "You rub Amy's bare feet"
            ],
            "content":"<div class=\"\"><div> <span>Amy wants you to rub her sore and tired feet. you say to Amy \"okay whatever you say,Amy\". you take her socked feet in your hands and start to rub her socked feet. Amy says to you \" That's it, rub my tired feet\". as she says that, she starts to moan a bit. after about 10 minutes of rubbing her socked feet, Amy says to you \" You can take my socks off now\". you say to her \"Can I take a break please, Amy?\" Amy says to you \" You can take a break once............. </span></div></div>",
            "created":1261285200,
            "id":808139,
            "title":"Rub her sore, tired feet"
        },
        "14111":{
            "author_id":"katfoyk",
            "author_name":"Katfoyk",
            "choices":[
                "... lick the soles of my feet.\"",
                "... suck on my pretty toes.\""
            ],
            "content":"<div class=\"\"><div> <span>\"You can take a break once you kiss my feet\" says Amy.<br>\r\n<br>\r\n\"Excuse me?\" says Steve.<br>\r\n<br>\r\n\"I told you to kiss my feet\" says Amy, as she plants her right foot onto the coffee table. The race has left her foot with a blushed red colour and a light sheen of sweat allover. She places her hands on her hips, holds her head high, and looks down at Steve with smug, self-satisfied grin. As Steve began lowering himself towards her, Amy interjected.<br>\r\n<br>\r\n\"Actually, I want you to stand up first\" says Amy. Steve hesitantly rises from his chair and looks at her nervously. Amy's smile widens as Steve desperately tries to uncover what she has in store for him. She hooks him by the elbow and maneuvers him away from the chair and the coffee table. Now the pair stood facing each other in the middle of the room with no furniture obstructing them.<br>\r\n<br>\r\n\"Now, kneel before me\" say Amy.<br>\r\n<br>\r\n\"I'm sorry?\" says Steve.<br>\r\n<br>\r\n\"You promised to obey my every command if I won the bet. Now, get down on your knees and bow before your queen.\"<br>\r\n<br>\r\n\"My que-\" Before Steve could finish, Amy slapped him across the face.<br>\r\n<br>\r\n\"You will not speak unless spoken to, slave. Now grovel at my feet like you were told\" say Amy. Without hesitation, Steve falls to his knees, plants his hands close to Amy's feet and bows his head. Amy sniggers and scrunches her toes in excitement. <br>\r\n<br>\r\n\"From now on, you will refer to me as 'Your Majesty' understand?\" Amy proclaimed.<br>\r\n<br>\r\n\"Yes, Your Majesty\" says Steve.<br>\r\n<br>\r\n\"Good, now you finally get the opportunity to kiss my royal feet. Well? Hurry up and start kissing.\" As he lowered his face to floor, Steve caught a faint whiff of vinegar coming from Amy's feet. He pursed his lips and kissed the flesh just above Amy's toes. She squealed with excitement.<br>\r\n<br>\r\n\"Do they smell? I don't care. Say thank you, slave.\"<br>\r\n<br>\r\n\"Thank you, Your Majesty.\" <br>\r\n<br>\r\nAmy wandered over to chair and sat down. As she crossed her legs, she beckoned Steve to crawl over to her, to which he obliged.\"<br>\r\n<br>\r\n\"Now, my slave, you will ...\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1503483540,
            "id":2373371,
            "title":"You kiss Amy's feet "
        },
        "1412":{
            "author_id":"spongebobrpg",
            "author_name":"The Billie Jean",
            "choices":[
                "STOP",
                "Lick her soles",
                "Footjob"
            ],
            "content":"<div class=\"\"><div> <span>Amy removed her socks, revealing her sweaty feet, which blushed a pinkish color. \"Kiss my feet.\"<br>\r\n<br>\r\nYou couldn't help but kneel in front of Amy's feet and kiss the size 5 beauties. The smell was tropical like, with sweat and fruit mixed together. 5 minutes later of kissing feet, you opened your mouth and placed her right big toe inside. Your tongue wrapped around the sweaty, cute, toe, as you tasted Amy's salty feet. She blushed at this and moaned at the sight of her toes getting wet. She then ordered you to..</span></div></div>",
            "created":1414191180,
            "id":1877011,
            "title":"Kiss her feet to make them feel better"
        },
        "14123":{
            "author_id":"mrmx",
            "author_name":"Mrwcik",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Footjob.  </span></div></span></div>",
            "created":1574199660,
            "id":2748880,
            "title":"Footjob"
        },
        "1413":{
            "choices":[
                "I don't really know. Let me sniff them again",
                "They smell great!",
                "They reek"
            ],
            "content":"<div class=\"\"><div> <span>\"What? You want me to what?\" You steamer in surprise. As much as you really, <i>really</i> wanted to smell her feet, you were shocked she said so. I said smell my feet!\" Amy repeated. You lowered your head to her socked feet and took a sniff. They smelt great! Strong and almost sweet. You couldn't resist and took another sniff.<br>\r\n\"Oh my God! I was just kidding, Steve! I didn't think you'd actually do it.\" Amy said with a mix of amusement and slight disgust. You puled away blushing.<br>\r\n\"Sorry, I thought you were serious.\" You say. Amy shook her head as she looked at you.<br>\r\n\"Well, how do they smell then?\" Amy asked with a giggle.<br>\r\n<br>\r\n<br>\r\nWhat do you say?</span></div></div>",
            "created":1256792400,
            "id":783343,
            "title":"Amy's Smelly Feet"
        },
        "14132":{
            "choices":[
                "Tickle her socked feet",
                "Take her socks off and tickle her bare feet"
            ],
            "content":"<div class=\"\"><div> <span>\"They smell really nice Amy!\" you say to her. Amy blushes a little and giggles at your words.<br>\r\n\"Really? I thought they'd smell awful after our race!\" she says.<br>\r\nYou shake your head. \"Not at all, I kinda like the smell.\" you say.<br>\r\nAmy giggles again. \"Well, if you want to, you can smell them again!\" she says, wiggling her socked toes at you.<br>\r\n\"You really don't mond?\" you ask her, not quite believing your ears.<br>\r\nAmy smiles at you. \"Of course not, though it is a bit wierd.\" she says. Without wasting any more time you plant your nose against her socked sole and take a deep sniff. The smell is so intoxicating and you let out a low moan at the smell. Amy starts to giggle even more as she watches you smell her foot. You move to her toes and poke it in between her toes and smell. The smell is so strong here so you take your time, trying to get as much of the smell as you can.<br>\r\n\"Heehee, hey that tickles!\" Amy giggles as she feels your breath in between her toes. You stop smelling her foot and look up at her grinning.<br>\r\n\"Oh, so your ticklish huh?\" you ask her wth an evil smile on your face. You...</span></div></div>",
            "created":1256965200,
            "id":784371,
            "title":"Tell Amy her feet smell great!"
        },
        "14133":{
            "choices":[
                "I hate your feet! Please stop!",
                "Please keep doing this"
            ],
            "content":"<div class=\"\"><div> <span>\"Your feet reek!\" you say. \"What did you say?!\" She asks angrily. You repeat it again and then she gets really steamed. \"If they reek, then you won't mind if i do this!\" She shoves her feet in your face and then tapes her feet to your face. You start to moan but she tells you to start sniffing. \"I'm sorry if i got you angry, Amy.\" You say. She says that it's too late for an apology as she wiggles her toes under you nose. Finally, you say</span></div></div>",
            "created":1296622800,
            "id":1046458,
            "title":"Stinky Feet"
        }
    },
    "info":{
        "author_id":"dxfan2478",
        "author_name":"dxfan2478",
        "brief_description":"this is part 2 of the story about a boy who has a foot fetish for both boy and girl feet.",
        "created":1240207680,
        "description":"<td align=\"left\" class=\"norm\">authors can add  boy feet and girl feet related storylines please. <br>\r\n<br>\r\nno sexual content<br>\r\n<br>\r\nhave fun </td>",
        "id":1551673,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1574199660,
        "modified":1574199660,
        "pretty_title":"Some Foot Fun 2"
    }
}