{
    "chapters":{
        "1":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Nick-15",
                "Joe-18",
                "Kevin-20",
                "Multiple"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Jonas Brother is gonna get tickled?</span></div></span></div>",
            "created":1211864400,
            "id":536604,
            "title":"Which Brother?"
        },
        "11":{
            "author_id":"cynthia_p",
            "author_name":"e",
            "choices":[
                "kevin star to tickle nick",
                "kevin star to tickle nick"
            ],
            "content":"<div class=\"\"><div> <span>nick jonas was lied in his bed reading when somebady enter to his room very slow<br>\r\n-what do you want?-asked nick,there's no aswer,he see there`s nobady-joe i know you here get out.<br>\r\nnobady answer<br>\r\n-oh yeah it's really creepe-said nick sarcastily<br>\r\nthen somebady show,that was kevin<br>\r\n-oh it that you?I think was joe...whatever what do you want?-asked nick.<br>\r\n-hummmm..nothing-sai kevin sitting next to him<br>\r\n-so what are you here?-ask  nick<br>\r\n-i wanna do this!-said him tickle nick's sides<br>\r\nHAHAHAHAHAHHAHAHAHAHAHA STOHOHOHOHOHOHOHOHOP HAHAHAHAHAHAHAHAHAHAHA-nick laugh then he fell to his bed until Kevin tickle him-OK OK STOHOHOHOHOHOP KEVIN PLEHEHEHEHEHEHEHEHEHEHEHES HAHAHAHHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHA AHAHAHAHAHAAHAHAHA.<br>\r\nyou catch him?-joe asked enter to nick's room-oh this wanna be so fun</span></div></div>",
            "created":1213074000,
            "id":542635,
            "title":"all start"
        },
        "111":{
            "author_id":"cynthia_p",
            "author_name":"e",
            "choices":[
                "joe and kevin tickled nick",
                "they stop tickle nick"
            ],
            "content":"<div class=\"\"><div> <span>then joe enter ro nick's room where kevin was tickled nick's sides and he scream and laugh.<br>\r\n-oh this wanna be so fun-joe said.<br>\r\njoe sit next to nick and star to tickle him in the stomach<br>\r\n-NOOOO!HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAAHAHAHAHAHA<br>\r\nPLEASE STOHOHOHOHOP HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nCOME OOOOOOOOOOONHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA STOHOHOP<br>\r\nHAHAHAHAHAHAHAHAHA-laugh nick<br>\r\n-awww,it's this lilte baby ticklish?-tanted joe still tickled him<br>\r\n-YEHEHEHEHEHES I'M! HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA NOW PLEHEHEHEHEHEHEHEHEHES STOHOHOP<br>\r\nHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\n-nop-kevin said keep tickling his baby brother<br>\r\n-yeah-joe said-you look so cute,like a litle ticklish baby.</span></div></div>",
            "created":1213160400,
            "id":542992,
            "title":"joe and kevin tickled nick"
        },
        "1111":{
            "author_id":"tickler",
            "author_name":"tickle",
            "choices":[
                "joe tickles nick's belly",
                "kevin and joe tickle nick's belly and armpits",
                "kevin and joe tickle nick's feet"
            ],
            "content":"<div class=\"\"><div> <span>the joe and and kevin tie up nick to his bed spread eagle.  nick tries to get out but he can not, he knows he is in for it.  joe takes of nick's shirt.  kevin's wiggling fingers just a few inches away from nick's armpits.  nicks beg him to have mercy, but kevin begins to tickle his armpits<br>\r\nHAHAHAHAHAHAHAHAHSTOOOOOOOOOOOOOOOPHAHAHAHAHAHAHNOTHAHA MYHAHAHAARMHAHAHAHAPITSAHAHAHAAHAHA.  kevin gives nick a break.</span></div></div>",
            "created":1215579600,
            "id":553984,
            "title":"joe and kevin tickled nick"
        },
        "11112":{
            "choices":[
                "Kevin tickles both Joe and Nick",
                "Kevin thinks this is to cruel and let's them go"
            ],
            "content":"<div class=\"\"><div> <span>   Joe grabed Nick's hands and Kevin stradled Nick's waist. \" No guys! Please stop this now! This isn't working anyway! \" Nick tried to sound tough. <br>\r\n    \" So this won't tickle?\" Kevin said as he lightly crawled his fingers down Nick's arms. The more Nick giggled, he started back at the top and went farther.<br>\r\n    \" HAHAHAHHAHAHHAHAKEVVVVVVVVVVVYYYYYSTOOOOPPPPPPPPPPLLLLEEEAAASSSEEE!\" Joe started to tickle Nick's belly softly.<br>\r\n    \" Awww is little Nicky ticklish? Is my little baby brother ticklish here?\" Joe was smiling, enjoying being the older brother.<br>\r\n     \"YEEEEEEEEEEEESSSSSSSSSHHHHHHAAAAAAAAHHAHAHAHAHAHHAPPPPPLEEEASSEEEE SSSTOPPPPPHHHHHAAAAAAAHHAHAHAHHA\"<br>\r\n      \" Ok, let's give him a break.\" Kevin said withdrawing his hands. Joe ran his fingers through Nick's messy,sweaty hair and gave him a brotherly kiss on the forehead. He knew how it was to be the yourger brother and to suffer one of Kevin's tickle torures, but of course Joe didn't have TWO older brothers to torure him.<br>\r\n      \" Ok,,,,, where to start next? Oh I know!\" Kevin said grinning. He lowered his fingers onto Nick's armpits. Joe then reached over and tickled Nick's ribs.<br>\r\n      \"NOOOOOOOOOONNNOTTTTTHHHAAAATHEREPLLEEASENOOTTTHEREHAHAHAHAHAAHAHAHAHPLEASLE JOEPLEASEKEVIN!\" Poor Nick was laughing so hard that his ears were ringing.<br>\r\n       After 5 minutes, Kevin and Joe stopped. \" Ok man, I think he's had enough.\"<br>\r\n       \"Oh really,\" Kevin gave Joe a evil brother grin that meant only one thing. Before he could run, Kevin grabbed Joe and sat on both him and Nick. Then he tied Joe's hands to the bedpost.\" Now I have two vitams to torure!\"<br>\r\n       Joe and Nick shared a look.They both knew they were in for it.</span></div></div>",
            "created":1243141200,
            "id":696726,
            "title":"kevin and joe tickle nick's belly and armpits"
        },
        "111121":{
            "choices":[
                "kevin lets them go",
                "kevin keeps tickling them"
            ],
            "content":"<div class=\"\"><div> <span>kevin looked at nick and joe and gave them a devilish look. he then proceeded to tickle joe on his tummy. <br>\r\njoe- noooooohahahahahahahah kevin pleheheheheehehease!<br>\r\nkevin- hahaha never!<br>\r\nkevin then tickled both nick and joe hearing them both laugh was misic to his ears!<br>\r\nnick-HAHAHAHAHAHAHAHAHAHA NOOOOOO IVE HAHAHAHA HAD ENOUGH KEVVVY PLEHAHAHAHAHEASE STOHAHAHAHAHAHAHAP<br>\r\njoe- KEVIN HAHAHAHAHAHAHAHAHAHAHA STOHAHAHAHAHAP NOHAHAHAHAHAHAHW<br>\r\nkevin- fine i will give you a break so enjoy it while you can <br>\r\n</span></div></div>",
            "created":1258302120,
            "id":791985,
            "title":"Kevin tickles both Joe and Nick"
        },
        "11113":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "continued to tickle his feet",
                "decided to tickle some where else"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, now that you're all rested up, it's time to tickle your feet!\" Kevin said.<br>\r\n\"Yeah!\" Joe agreed.<br>\r\n\"NO! Please, any where but my feet! PLEASE!\" Nick begged.<br>\r\n\"Sorry, but it's two against one,\" Joe said.<br>\r\nKevin and Joe the started unlacing Nicks shoes, slowly slipping them off his feet, while Nick begged and pleaded for them to let his go. As soon as his shoes were off, Joe and Kevin immediately proceeded to tickle all over Nick's socked soles.<br>\r\n\"NOOOOOOOO! HAHAHAHAHAHAHAHAHAHAHAHA PLEEEEEEEASE! STAHAHAP! I CAN'T STAND IT! AAAAAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA WAIT! WAIT! NO! NO! DON'T TAKE MY SOCKS OFF! PLEEEASE! I'M BEGGING YOU I'LL DO ANYTHING! NOOOHOHOHO AAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHA,\" Nick screamed, as NIck and Joe tickled his feet, took off his socks and tickled his bare feet. \"NOOOOOOOOOO AAAAAAAAAA AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA PLEEEEEEEEEEEASE! I'M GONNA DIE! AAAAAHAHAHAHAHAHAHA! STAHAHAP! STAAAAAAHAHAHAHAHAHAHAP! I CAN'T TAKE IT! I'M TOO TICKLISH! AHAHAHA AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHAHA.........HAHAHAHAHAHAHA...............HAHAHAHAHA.............,\" ; Nick yelled, starting to faint.<br>\r\nSeeing this, Joe and Kevin let up on there little brother a little and then, when he was done resting...</span></div></div>",
            "created":1219208400,
            "id":572396,
            "title":"kevin and joe tickle nick's feet"
        },
        "111131":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Nick is embarrassed and rushes to the bathroom to clean up",
                "Nick gets revenge on Joe and Kevin later",
                "Joe apologizes to Nick and offers his own bare feet for Nick to tickle"
            ],
            "content":"<div class=\"\"><div> <span>Both Joe and Kevin hold down Nick's bare feet and tantalize his bare toes with their tongue. Nick squirms to try and get away, but can't break free. Joe takes Nick's right big toe into his mouth and Kevin takes the left big toe into his mouth which causes Nick to go ballistic. As they suck on his big toes, Nick splays his other toes and begins to groan. Joe and Kevin notice that Nick's shorts are growing and expanding. They continue to tantalize each of their brother's toes until Nick climaxes and erupts. He collapses and his brothers let go of his bare feet. They notice a wet spot in his shorts and begin to laugh at him.</span></div></div>",
            "created":1534518360,
            "id":2534847,
            "title":"continued to tickle his feet"
        },
        "1111311":{
            "author_id":"futureboy",
            "author_name":"Futureboy",
            "choices":[
                "Joe wakes up later and sees that his feet are bare",
                "Nick dresses and comes in and tickles Joe's bare feet again",
                "Nick and Joe attack Kevin in his bedroom, stripping him naked"
            ],
            "content":"<div class=\"\"><div> <span>Nick emerges a few moments later wearing only a towel around his waist and using another one to dry his hair. His tan, hairy, six pack ab chest is still slightly wet as well as his bare feet. He returns to his bedroom and puts on a new pair of boxers.<br>\r\nHe walks out into the living room and discovers his younger brother Joe asleep on the couch. He sneaks up on his brother and begins to lightly tickle his socked feet hanging over the arm of the sofa. Joe's feet twitch and Joe's body squirms a little saying slurringly \"Stop tickling my feet Rosie, my feet are ticklish!\" <br>\r\nNick continues his light tickle-fest as he begins to tickle Joe's bare legs. He then slowly begins to peel Joe's right sock off his foot. As the sock comes off exposing Joe's lightly tan, semi-hairy bare foot with trimmed toes, Nick tickles Joe's bare soles and toes, then nibbles on Joe's big toe before engulfing it into his mouth. Joe's other toes splay as Nick peels off Joe's other sock from his foot revealing another bare foot. Nick does the same on Joe's left bare soles and toes causing Joe to splay all of his toes.<br>\r\nJoe murmurs \"Oh Rosie, I love it when you suck and nibble on my toes.\" Nick smiles and tries not to laugh. After kissing his brother's toes one more time, Nick begins to put Joe's socks back on his feet. Joe's bare feet pull away as he murmurs \"I want to stay barefoot Rosie, keep my socks off please.\" Nick pulls off Joe's right sock and taps his brother's bare feet than leaves.</span></div></div>",
            "created":1535322240,
            "id":2539311,
            "title":"Nick is embarrassed and rushes to the bathroom ..."
        },
        "111132":{
            "choices":[
                "they finaly stop!",
                "they tickle him just alittle more"
            ],
            "content":"<div class=\"\"><div> <span>\"I think we should tickle him somwhere else now\" siad kevin<br>\r\n\" haha yeah!\" agreed joe<br>\r\n\"NOO! guys please stop, Im gonna die!\"<br>\r\n\"haha your not gonna die!\" said kevin, but you so fun to tickle!\"<br>\r\n\" yeah just alittle more!\" siad joe<br>\r\n\" oh I know, we havent given him a rasberry yet!\" joe said<br>\r\ngood idea siad kevin!<br>\r\nthen joe went behind nick and grabed his arms, andkevin sat on his legs, nick was laying down and could not do anything!<br>\r\n\" guys plaese dont, i cant take it any longer!<br>\r\ntoo bad! said kevin<br>\r\nthen he leaned down pressed his lips on nick belly, took a deep breath and blew! a great rasberry it was!<br>\r\n\" AHHHHHHHHHHH NOOO! AHAHAHHAHAHAHHA STOAAAHAHHAP! PLAEAHAHAHHAHAHHAE!\" nick screamedkevin then gave nick another!<br>\r\n\"NOHAHAHAHAHAHAHHAH PLAHAHAHAHHAHAHAHES STOAHAHAHHAHAHHAP! AHAHAHHAHAHAHAHAHAHHAHAHHA I CAHAHAHANT TAHAHAHKE IT ANY LONGER AHHAHAHAHAHAHHAHAHAH!<br>\r\n</span></div></div>",
            "created":1222578000,
            "id":588321,
            "title":"decided to tickle some where else"
        },
        "1111322":{
            "choices":[
                "he gets revenge with kevin",
                "he gets revenge with joe"
            ],
            "content":"<div class=\"\"><div> <span>\"haha okay we've had our fun, now lets let him go\" kevin siad, but winked at joe<br>\r\n\"hhaa okay suree\" said joe<br>\r\n\"I hate you guys\" nick mumbled<br>\r\nkevin and joe get off nick, and start to walk m awway, nick gets up too, and turns his back to them, then joe and kevin both turn around and run at nick and tackle him on his bed! he was now lying on his stomah!<br>\r\n\" just kidding! were not done yet!\" kevin said<br>\r\nthen kevin started to tickle nick armpits and joe got his sides!<br>\r\n\" AHHHH HAHAHAHAHHAHAHAHAHHAHAHAHHAHAHAHHHHHHHHHHH! YOU GUYHAHAHAHAHAHAHAHHS! HAHAHAHAHAHAHHAAHAHAHAHHAHA NO MORE! PLEAAHAHAHAHHAHAHAHAHHAHAHHASE! I CANT AHAHHAHAHAH TAKE HAHAHAHA ITHAHAHAHAHAHAHHAHAHAH!\" nick was completly hysterical<br>\r\n\" hahaha ww poor little nick\" joe said<br>\r\n\" aww does this tickle wickle wittle nicky! aww does it, does it is the wittle baby ticklish? joe siad in a baby voice<br>\r\n' HAHAHAHASHAHAHHAHAH YESS! HAHAHHAHAHAHHAHAHH IT AHHAHA TICKAHAHAHHAHAHAHHALES! I HAHAHAHAHAHAHAHAHAHAHA CANT TAKAHAHAHHAHAHE IT ANY LONGER AAAAAAAAAAHHAHAHAHAHAHHAHAHAHAHAHHAHAHA!\" nick screamed, his face turning red<br>\r\nNick was struggling and squirming like mad, but kevi n and joe held him down.<br>\r\n\" ahahha okay kevin, I think we made our point\" joe laughed<br>\r\n\" YOUHAHAHAHAHAHHAA THINK AHAHAHAHHAAH!\" NICK YELLED<br>\r\n\" Oh ahhaa okay\" kevin siad\"<br>\r\nthey both get off nick and walk out his room, while syaing,\" you know were gonna tickle you more\"<br>\r\nnick sat up very angry, and needed revenge</span></div></div>",
            "created":1222578000,
            "id":588328,
            "title":"they tickle him just alittle more"
        },
        "11113222":{
            "author_id":"skate2",
            "author_name":"pbj",
            "choices":[
                "tickles joe",
                "ties kevin"
            ],
            "content":"<div class=\"\"><div> <span>they finally stop tickling nick, and nick gets up. while the boys walk out the room. nick mumbles quietly........i've got to get revenge but who? he finally decides to get revenge on joe. joe was asleep, kevin wasn't there and nick was in the clear. you know how really in a deep sleep and your sister or in this case your brother whispers in your ear something that will make your dreams nightmares .this happened to joe &amp; he fell on the floor. nick had a rope and tied joe's hands onto his back.</span></div></div>",
            "created":1235797200,
            "id":653789,
            "title":"he gets revenge on joe"
        },
        "111132221":{
            "author_id":"skate2",
            "author_name":"pbj",
            "choices":[
                "tickles joes feet",
                "tickles joes ribs"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>joe wakes up thinking he is free but.....HE'S NOT. <br>\r\nJOE:what hapened<br>\r\nNICK:your worst nightmare(holding appliances)<br>\r\nNICK:say hello to electrical toothbrush feather&amp;hairbrush</span></div></span></div>",
            "created":1237093200,
            "id":661320,
            "title":"tickles joe"
        },
        "1112":{
            "author_id":"cynthia_p",
            "author_name":"e",
            "choices":[
                "nick's revange with joe",
                "joe torture the ticklish nick"
            ],
            "content":"<div class=\"\"><div> <span>-COME OHOHOHOHON GUYS HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHA<br>\r\nLET ME GO HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA PLEASHEHEHEHEHEHEHEHEHEHEHEHE<br>\r\n-hummmmmmm...should we stop?-joe said<br>\r\n-but he look so cute laughting like that-kevin said keep tickled nick<br>\r\n-yeah-joe said now tickled nick's armpits.<br>\r\n-PLEASE,HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAH A,<br>\r\nSTOHOHOHOHOHOHOHOHOHOHOHOHOHOHP-laugh nick in hysteria<br>\r\n-ok I think you had enough-kevin said<br>\r\n-yeah I think that too-joe added<br>\r\n-THEN HAHAHAHAHAHAHAHA WHY YOU HAHAHAHAHAHAHAHAHAHAHAHAHAHAHHHA DONT STOHOHOHOP?<br>\r\n-oh we has too?-kevin said as he still tickle nick<br>\r\n-YEHEHEEHEEEEEHEHEHEHEHEHES-laugh an hysterical nick<br>\r\n-well you had to said that before-joe said as they stoped tickle nick,who start to catch his breath.<br>\r\n-see ya bro-kevin said out of nick's room<br>\r\n-you know-joe said-I dont wanna stop tickle you.<br>\r\n-no please dont tickle me again-nick begged,stay away from joe<br>\r\n-oh,don't worry-joe said rufled nick's hair-you had enough for now,maybe after-he said and out of nick's room<br>\r\n-I dont let him tickle me again,I had to do something-nick though<br>\r\n</span></div></div>",
            "created":1213160400,
            "id":542999,
            "title":"still tickle nick"
        },
        "11121":{
            "author_id":"cynthia_p",
            "author_name":"e",
            "choices":[
                "nick keep tickle joe",
                "kevin come and start to tickle nick and joe tied in the beds"
            ],
            "content":"<div class=\"\"><div> <span>they are the five at the afternoon,paul,denise,frankie and kevin are in they gradnma's house,so joe and nick are alone in home,nick was watching television then he decided go upstairs to see what was joe doing<br>\r\n-joe?-he ask enter to joe's and kevin's room-joe?-he said,his big brother was lying in his bed sleeping mouth up,then nick think that it's the perfect time for his revange,he slowly catch some rope of joe's closet and very carefull to not awake joe he tied his hands to the beds posts when his hands was tied he go to his feets and tied the right one to a bed post,when joe wake up.<br>\r\n-hum?-joe said when he see that he was tying-what are you doing?!<br>\r\n-revange-nick said calmy when he finish to tied joe's right feet.<br>\r\n-what? no! you can't-joe said kicking the air whit his free leg-LET ME GO<br>\r\nthen nick had a great idea<br>\r\n-AU!-he yelled took his nose in his hands,and act like he was crying.<br>\r\n-oh nicky I so sorry-joe said stoped kicking,then nick quickly take his leg and start to tied it at the bed post<br>\r\n-HEY you're a cheater-joe said trying to get his free but nick was tying him very well<br>\r\n-yes I'm-nick said when he finished tied joe's leg-now...<br>\r\n</span></div></div>",
            "created":1213160400,
            "id":543005,
            "title":"nick's revange with joe start"
        },
        "111211":{
            "author_id":"cynthia_p",
            "author_name":"e",
            "choices":[
                "nick start to tickle joe's feet",
                "nick let joe go"
            ],
            "content":"<div class=\"\"><div> <span>-i'll start tickle you-nick said<br>\r\n-oh come on nick we just had some fun-joe tried to explain<br>\r\n-well I don't now,I mean you tickle me so now I gonna tickle you-he said sitting nex to joe and pull up his shirt .exposed joe's belly,ribs and flanks<br>\r\n-well...where I should start-nick said when put his finger close to joe's ribs<br>\r\n-no please nick don't HAHAHAHAHAHAHAHAHAHAHA STOP HAHAHAHAHAHAHAHA-joe laugh when nick start to run his fingers for joe's ribs<br>\r\n-oh it's that tickle you?-nick asked until he poke his big brother belly<br>\r\n-YEHEHEHES IT THAT HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHA<br>\r\nHAHAHAHHAHAHAHAHAHAHAHAHAHAHA PLEASE HAHAHAHAHAHAHAHAHHAHA<br>\r\nHAHAHAHHAA STOHOHOHOHOHOHOP-joe laugh<br>\r\n-that will be a negative bro-nick said keep tickle joe<br>\r\n-HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA COOOOOOOOME ON HAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHA DON'T HAHAHAHAHAHHAHAHAHAHAHA-<br>\r\njoe laugh in hysteria.<br>\r\n-wow hysterical now? well it's just the begin-he said now tickle joe's sides,that make joe really laugh.<br>\r\n-NOOOOOOOO! HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHA NOT THERE HAHAHAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHA PLEAHAHAHAHAHASE<br>\r\n-joe you tickle so much for too many years so I really take adventaje that you tied and you can't run away-nick said-so I gonna still tickle you until I said that you had enough and now I don't think that you had enough-nick said</span></div></div>",
            "created":1213160400,
            "id":543015,
            "title":"nick keep tickle joe"
        },
        "1112111":{
            "author_id":"cynthia_p",
            "author_name":"e",
            "choices":[
                "nick take a turkey feather",
                "nick take a theetbrosh"
            ],
            "content":"<div class=\"\"><div> <span>-HAHAHHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHA-joe laugh until nick tickle his sides and scribbiling his hips-PLEASE STOOOOOOOOP HAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHA.<br>\r\n-ok I think you had enough-nick said stopped tickle joe's sides and hips<br>\r\njoe then catch his breath<br>\r\n-so you let me go?-he asked<br>\r\n-no-nick said simply,walking toward joe's feet<br>\r\n-b...but you said I has enough-joe said<br>\r\n-yeah,I mean you had enough in your sides AND hips-nick said-I never toll anything about you're ticklish feet don't I?<br>\r\n-WHAT?!-joe screan-no,please no my feet,nick don't please stop-joe begged until nick put off his shoes.<br>\r\n-oh you don't want that I do that!-nick said start dancing his fingers from joe's sole<br>\r\n-HAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHA<br>\r\nNOOOOOOOOOOOOO PLEASE HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nSTOHOHOHOHOHOHOP HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHA-joe<br>\r\nlaugh squirm all his body in the ticklish reaction.<br>\r\n-what a litle ticklish boy-nick said tickled the sensitive area down joe's fingers<br>\r\n-HAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHA STOHOHOHOHOHOHOOHOHOHOP PLEASE HAHAHHAHAHAHAHAHAHHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA.<br>\r\n-you know joe,I had an idea to  pute you on the edge</span></div></div>",
            "created":1213160400,
            "id":543021,
            "title":"nick start to tickle joe's feet"
        },
        "11121112":{
            "author_id":"cynthia_p",
            "author_name":"e",
            "choices":[
                "NICK LET JOE GO",
                "nick keep tickling joe"
            ],
            "content":"<div class=\"\"><div> <span>-what could be worse-joe said when nick go to catch something in his room joe was trying to untying him but it's was no use<br>\r\nwhen nick come back he has a theetbrosh in his hands and a huge grin in his face.<br>\r\n-oh no please don't use that-joe said<br>\r\n-oh I gonna use it joey,and you can't donothing to stop me-nick said<br>\r\n-no please don't-joe gigling whit anticipation until nick pulled his theetbrosh near to his sensitive sole<br>\r\n-oh yeah,revenge it's suit-nick said put the theetbrosh in joe's sole and run it up and down,this make joe really laugh<br>\r\n-HAHAHAHAHAHAHAHAHAHAHAHAHAHA NOOOOOOOOOOOOOOOOOOOO HAHHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHA PLEASE,HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nSTOOOOOOOOP-joe laugh squir his entire body<br>\r\n-wow-nick said queep tickling joe's sole whit his theetbrosh-and I think that was I the most ticklish<br>\r\n-YOU AHAHAHAHAHARE! HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA PLEASE HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA NICKYYYYYYYYYYYYYY HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nSTOHOHOHOHOHOP HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA COME OOOOOON HAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHA-joe laugh in hysteria-LET ME GOHOHOHOHOHOHO HAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHA<br>\r\n</span></div></div>",
            "created":1213246800,
            "id":543449,
            "title":"nick take a theetbrosh"
        },
        "111211122":{
            "author_id":"tickler",
            "author_name":"tickle",
            "choices":[
                "nick stops tickling joe",
                "nick takes the feather and tickles the head of Joe's manhood"
            ],
            "content":"<div class=\"\"><div> <span>now that nick has tickled joe's secound most ticklish spot, nick begins to move toward joe's fly.  nick begins to unbutto Joe's pants, then he unzips his zipper, and reveals his boxers.  Joe said NOOOOOOOOOO PLEASE NOT THERE YOU KNOW HOW TICKLISH THAT IS!! <br>\r\nI  know nick said said as he began to pull his boxers down, slowly revealing Joe's Manhood.  <br>\r\nNick then Takes a feather and begins to tickle his brothers very senstive sack. NOOOOOO HAHAHAHAHAHAHAHAHA PLEASE AHAHAHAHAHAHA STOP!!!!!!!!!!!!!!!!!!!!!!!!!!! </span></div></div>",
            "created":1222232400,
            "id":586753,
            "title":"nick keep tickling joe"
        },
        "1112111222":{
            "author_id":"manhood",
            "author_name":"tickling",
            "choices":[
                "Gooch",
                "Butt"
            ],
            "content":"<div class=\"\"><div> <span>Nick stops tickling Joe's sack<br>\r\n \"thank you now please let me go\" joe says <br>\r\nI'm not done yet Joey<br>\r\n<br>\r\nIt's time to tickle the head of your manhood<br>\r\nNOOOOOOOOOOOOOOO YOU KNOW THAT IS MORE TICKLISH THEN MY SACK!!!<br>\r\nNICK TAKES THE FEATHER AND TICKLES THE HEAD OF JOE'S OVERSIZED MANHOOD <br>\r\n\"AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA NICKAHAHAHAHAHAHAHAHAHA PLZ AHAHAHAHAHAHAHAHAH STOP AHAHAHAHAHAHAHAHAHAHAHA \"<br>\r\nNICK THEN STROKES JOE'S PISS SLIT AHAHAHAHAHAHAHAHAHAHAHA NOT MY SLIT AHAHAHAHAHAHAHAHAHAHAHAHAHAH NICK IM TO TICKLISH IN MY PISS SLIT STOPPP HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH?<br>\r\nNICKS STOPS AND HEAD FOR JOE'S  </span></div></div>",
            "created":1234587600,
            "id":646996,
            "title":"nick takes the feather and tickles the head of ..."
        },
        "11122":{
            "choices":[
                "Joe tickles nick",
                "Nick gets away"
            ],
            "content":"<div class=\"\"><div> <span>though you would think nick would of had enough, joe wasnt done yet, but kevin was. Joe loved hearing nick laugh so hard, it made him seem like he was cooler. so he diceided to go after poor nick again. <br>\r\nNick was sitting on the couch when joe came in<br>\r\n\"Hey nick whats up?\" joe said<br>\r\n\"Nothing, board\" nick said<br>\r\n\"hmm, so you know i dont think me and kevin tickled you enough yesterday\" joe giggled<br>\r\nat the sound of that nick quickly got up and ran, but joe was right behind him. they ran around the kitchen table 10 times, and right as nick started running up the stairs, jor grabbed him by his sides, and lifted him over his shoulder.<br>\r\n\"NO MAN STOP! come on, I've had enough!\" Nick screamed, while he squirmed franticly<br>\r\n\"aha i dont think so\" joe said Joe carried nick up to his room, and closed the door, then he threw nick on his big bed.</span></div></div>",
            "created":1247979600,
            "id":728258,
            "title":"joe torture the ticklish nick"
        },
        "111221":{
            "choices":[
                "THE END",
                "more?"
            ],
            "content":"<div class=\"\"><div> <span>\"haha, i have you now!\" joe yelled, he was really happyy.<br>\r\n\"man please, dont, i cant take it\" nick begged<br>\r\nBut joe had already jumped on top of nick and tied his arms together, then he tied his arms to the fram of his bed, nick was in trouble.<br>\r\n\"hmm, where to start, oh i know here!\" joe said, and started tickling nicks second most ticklish spot, his armpits, and because nick was only wearing a tank top, and the rest of the family was at lunch, nick was in trouble.<br>\r\n\" AHAHAHAHAHAHAHAHAHAHAHAHAHHAH NOHAHAHAHAHAHAHAHH NOAHAHAT THERE! AHAHAHAHAHAHHAHAHAH PLEAHAHAHAHHAHAHHSE I CAHAHAHAHAAHANT AHAHAHAHAHAHAHAHHAHAHAHAHAHAHHAH TAHAHAHAHHAKE IT!\" nick yelled, and screamed, he squiremd and struggled, but it was no use, he couldnt take this much longer, especilyy if joe tickled his tummyy, his most ticklish spot.<br>\r\n\" oh nick, im just getting started\" joe said and he continuted to tickle nick, he was already pretty histerical, and his face was red, but joe didnt care.<br>\r\n\"AHHHHHAHAHAHAHAHAH NOAHAHAHAHAHAHH! PLEAHAHAHAHAHHSE LET ME GOAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHHAH!\" Nick cried, he was stuggling so hard, but couldnt break free, nick never laughed this hard, its hard to imagin nick laughing hystericaly, because he dosent do it often, but when he does, its great.<br>\r\n\"Okay, well how about he go to you..... TUMMY NEXT!\" Joe yelled<br>\r\nthis sent shivers up nicks spine, his stomach was so ticklish, he wouldnt be able to stand it<br>\r\n\"no man p-please, i cant\" nick studderd<br>\r\n\"well I can!\" joe cried, and lifted up nick tank top exposing his tummy ribs sides and hips<br>\r\njoe just placed his fingers on nicks tummy and began giggling.<br>\r\n\"heheheh noaha man hehehe pleahahase\" nick begged, trying hard to control his laughter<br>\r\nJoe began tickling nicks tummy, scribbling his fingers all around, his sides ribs, the whole thing, nick lost it<br>\r\n\"AHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHHH NOHAHAHAHAHAHAHAHAAHHHA NOAAHAHAT MY STOAHAHAHAHAHHMCAHAH AHAHAHAHAHAHAHAHAHAHAHAHHAHAHHA I CAHAHAHAHNT TAHAHAHAHAKE IT!\" Nick was completly histerical<br>\r\n\"aww does this tickle the little baby nick?\" joe said in a baby vocie<br>\r\n\"AHAHAHAHAHAHAHAHAHAHA YEAHAHAHAHAHAHAHAHS AHAHAHHAHAHAHAHAHAHAHAHHA JOE AHAHAHHAHAHAHAHHAHAHAHAHAHHAHAHAHHA IM GOAHAHAHAHAHAHNA DIE AHAHAHAHHAHAHAHAHAHAHAHHAHAHAAH!\" Nick screamed, he really couldnt take this much longer, it felt like his tummy was on fire, he couldnt breath, ahh this was pure torture<br>\r\n\"okay nick, just one rashberry!\" joe knew this was nicks weakness<br>\r\n\"NOAHAHAHAHAHAHAHAHAHAHAHAHH PLEAHAHAHAHAH AHAHAHAHAHAHAHAHAH YOU CAHAHAHAHAN-<br>\r\nbut nick was cut off, when joe pressed his big lips aginst nick staking tummy, and blew, a great big rashberryy, ahd another one, and another, like 4 in a row, this was absalute torture for nick\"<br>\r\n\"AHHHHHH AHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHHAHAHAHAHA JOHAHAHAHAHAH PLAHAHAHAHAHAHAE, AHAHAHAHHAHAHAHAHHAHAH THIS IS AHAHAHAHHAHAH MOREAHAHHAH THAN ONE!</span></div></div>",
            "created":1248057060,
            "id":728263,
            "title":"Joe tickles nick"
        },
        "1112212":{
            "choices":[
                "nick gets joe",
                "nick attemps to get joe, but joe gets nick instead"
            ],
            "content":"<div class=\"\"><div> <span>This was just unbearible, he so wished he could just faint, he couldnt breath, and his stomach was on fire, he just wished so much he could escape, he tried to hard to get away, but he couldnt, he felt tears coming to his eyes, his mouth hurt from laughing so much. His muscles hurt from squirming so much. He couldnt stand it any longer, he just wanted it to stop, he hated joe for torturing him like this. this was just really bad for him.<br>\r\n\"AHAHAHAHAHAHAHAHAHAHAHAHAHHAH JOAHAHAHAHAHAHAHHAE NO MORAAHAHAHAHAHAHAHAHHAE AHHHHAHAHAHAHAHAHAHHHAH! Nick screamed<br>\r\njorfinaly moved his lips away and sat up, he felt sorta bad, when he saw a tear run down nicks cheek, he had never seen nick cry form being tickled before, it was kinda really hilarous, he started laughing so hard<br>\r\n\"ahahahahahh dude your crying! ahahahahah\" joe yelled<br>\r\nnick was rather embarrsed, but he was so out of breath, he was shaking, and breathing hard, \"p-please, let me go\" nick mummbled<br>\r\n\"ahahah yeah sure\" jow said, he untied nick and ran downstairs laughing pretty hard<br>\r\noh my god, i have to hurt him, for doing this to me, nick thought, still shaking</span></div></div>",
            "created":1248059100,
            "id":728298,
            "title":"more?"
        },
        "11122122":{
            "choices":[
                "joe tickle tortures nick",
                "joe lets nick go"
            ],
            "content":"<div class=\"\"><div> <span>nick had to get joe back, and yeah he would, but he had to wait for the right moment, and that was when joe was asleep on his bead and the rest of the family was out.<br>\r\nwhen he saw joe was asleep, he pounced on top of him. quickly starting to tickle his sides.<br>\r\njoe slowly started to wake up, and his giggling turned to full out laughter<br>\r\n\" AHAHAHAHAH OHAHAHAH NICK, IM AHAHAHAHAH GOAHAHAHAHHANA KILL YOUAHAHAHAHAH!\" joe screamed he couldnt help thining, god nick ur dumb, you didnt tie me up.<br>\r\njoe was laughing pretty hard, but his most ticklish spot was his feet, and nick hadnt and wouldnt get their<br>\r\nbut joe didnt know his sides were quite so ticklish, because this tickled really bad.<br>\r\n\"AHAHAHAHAHAHAH OHAHAHAHAHA NICK AHAHAHAH YOUAHAHAHHAHAR DEAD AHAHAHAH!\" Joe screamed<br>\r\nand just like that joe flipped nick over, and joe quicly sat on top of him, pinning him down. Nick was in trouble<br>\r\n\"Nice try buddy\" joe smiled<br>\r\n\"oh no, joe please, im really sorry!\" nick yelled, starting to panic<br>\r\n\" aha your so dead nick, im going tickle the heck out of you!\"<br>\r\nnick gave a loud angry scream</span></div></div>",
            "created":1248060540,
            "id":728322,
            "title":"nick attemps to get joe, but joe gets nick instead"
        },
        "111221221":{
            "author_id":"ezramaru",
            "author_name":"Ezra Marubayashi",
            "choices":[
                "Joe lets Nick go",
                "Kevin surprises them"
            ],
            "content":"<div class=\"\"><div> <span>\"Just to show you that I'm a good big brother, I'll teach you what you should have done\",said Joe. He took Nick's shirt off as his younger sibling was wriggling underneath.<br>\r\n\"I told you you should off tied me up\", he said as he bound his bother's arms together and then to the headboard.<br>\r\n\"Please, Joe. I'm so sorry. Just let me go!\"<br>\r\nBut Joe was too busy tying each leg separately to the bed. When he finished, he asked in a mocking tone \"Now, what did we learn today?\"<br>\r\n\"That older brothers are douchebags!\"<br>\r\nOblivious to that answer, he continued asking \"What are you tied up for?\", as he approached to his brother's upper body, wiggling his fingers.<br>\r\n\"To be deffenseless. Please,Joe, DON'T!\"<br>\r\n\"And why did I take your shirt off?\". Joe's fingers were an inch away Nick's undrarms.<br>\r\n\"So that my armpits and belly are exposed. Please, I'll do whatever you want! I'll clean your room and do the dishes for a weeeek!\"<br>\r\nBut the pleads fell into deaf ears. Joe started his tickling and his brother's laughter filled the room.<br>\r\n\"AHAHAHAHAHA,NOOOOOOOOO\"<br>\r\n\"OK, If you can stop me, I won't tickle you anymore\", said Joe before he started a vicious attack on Nick's bellybutton.<br>\r\n\"I CAAAAN'T. I'M AHAHAALL TIED UUUUP AHAHAHA\"<br>\r\n\"See, the system works!\" and Joe stared switching between Nick's sides and pits.<br>\r\n</span></div></div>",
            "created":1549381740,
            "id":2613319,
            "title":"joe tickle tortures nick"
        },
        "111221222":{
            "choices":[
                "nick gets revenge",
                "kevin tickles them both"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay listen up, dont you ever try that again, im really tired, so i wanna go back to sleep, but if you ever do thst again, i swear i will tickle you stomach till you cry so hard, you wont be able to breath, then i will give you 20 rashberries after that, then I will tickle you the next day until you cry like a little baby, and i swear i will not care at all, and no one will be able to help you.\" joe snapped<br>\r\n\"okay yeah i promis\" nick said quickly, he had a feeling joe meant wat he said<br>\r\n\"then after that I will get kevin to help me tickle your little tummy for a few hours, and then were gonna get some feathers and toothbrushes and other tools to help us work your tummy, ,but were both, at the same time, gonna give you so many rashberries on your poor tummy\" joe snapped<br>\r\n\"okayy im really sorry, i swear.\" nick said shaking, the thought of that was just so unbearible, and yeah he couldnt take it. that would be the ultimate torture<br>\r\n\"good now get out\" joe said, and pushed nick off<br>\r\nnick quickly ran away, but somthing insisde of him told him he had to get revenge<br>\r\n</span></div></div>",
            "created":1248061860,
            "id":728346,
            "title":"joe lets nick go"
        },
        "12":{
            "choices":[
                "The sand castle competition",
                "Surf Shack",
                "Skip 'em both and just enjoy the sun on the beach"
            ],
            "content":"<div class=\"\"><div> <span>Joe rubbed the sleep out of his eyes and sat up in bed, stretching his arms over his head. The summer sun peaked through his blinds, slightly illuminating his otherwise dark room. He was glad he had decided to take this solo trip to the beach; it was nice to wake up naturally, rather than by jumped on by his youngest brother. Not to say that he didn't miss his family-even so, sometimes you just need a break, you know?<br>\r\n<br>\r\nHe pushed the covers to one side of the bed and placed his feet on the hardwood floor, yawning and scratching his head. He walked to the window and pushed it open, the warm air took him off guard and he took a step back. The beach looked amazing, the waves were just right for surfing and the sand couldn't have looked more inviting. Today was going to be a great day! There was a sand castle competition on the beach today and Joe was really looking forward to participating. He had recently cut his hair (quite drastically-it resembled his style when he first started out with brothers) and so he didn't expect too many people to recognize him, especially without his brothers around. He just wanted to be able to have fun without crowds of people surrounding him. However, he also really wanted to try his hand at surfing. He needed to decide which to do first...<br>\r\n<br>\r\nHe grabbed a towel, his bag, pulled a shirt over his head and slipped his feet into his flip-flops and ran out the back door onto the smooth sand.<br>\r\n<br>\r\nWhere should Joe head first?</span></div></div>",
            "created":1240981200,
            "id":683606,
            "title":"The beach"
        },
        "123":{
            "author_id":"xaviergrey",
            "author_name":"Xavier grey",
            "choices":[
                "Nick sneaks behind him and drags him into a small palm forest",
                "Kevin finds him and does the same.",
                "They both do it."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Joe threw his towel out on the sand away from the crowd as not to be spotted by fans. He could no longer hear anyone ( an vice versa). <br>\r\nWhat happens next?</span></div></span></div>",
            "created":1275604560,
            "id":893920,
            "title":"Skip 'em both and just enjoy the sun on the..."
        },
        "13":{
            "choices":[
                "Joe and Nick tickle Kevin's socked-feet."
            ],
            "content":"<div class=\"\"><div> <span>The three Jonas brothers were alone in their house for their entire four-day weekend. What to do with all of that time?<br>\r\n<br>\r\nJoe: Hey, Nick. Kevin's asleep in his room. Now's are chance!<br>\r\nNick: Whoa, you're right! Let's get him good, bro!<br>\r\n<br>\r\nThe younger Jonas brothers got some rope from the upstairs closet, quietly tiptoed into Kevin's room, and tied his wrists and ankles to both bedposts. Nick tapped Kevin on the head, waking him up.<br>\r\n<br>\r\nKevin: (Sleepily) Huh? What's...hey, what the heck's goin' on?!<br>\r\nNick: Oh, Joe and I are just getting revenge for the last few years...<br>\r\nJoe: (Slyly) Don't worry, though. You'll be in stiches from enjoying it so much.<br>\r\nKevin: What does that mean? Wait...oh, no. No! Guys please don't!<br>\r\nJoe: Too late, bro. It's time for (wiggling fingers) tickle torture!</span></div></div>",
            "created":1225688400,
            "id":603299,
            "title":"Captured Kevin"
        },
        "131":{
            "choices":[
                "Joe and Nick tickle Kevin's bare feet.",
                "Joe and Nick take pity on Kevin and stop."
            ],
            "content":"<div class=\"\"><div> <span>Joe: Nick, get the shoes.<br>\r\nKevin: No! Come on guys, please! I'll do anything!<br>\r\nNick: Aw...but your feet are so cute when they're tickled.<br>\r\n<br>\r\nNick takes off Kevin's sneakers.<br>\r\n<br>\r\nJoe: Besides, if you went to sleep with sneakers on you probably expected this.<br>\r\nKevin: (Sweetly) Nicky? Can you do your big brother a favor?<br>\r\nNick: Nope. (tickles Kevin's heel)<br>\r\nKevin: AAAAHAAHAHAHAHAHAHAAA! STOP-STOP-STOHAAAAAP!!!!<br>\r\n<br>\r\nJoe and Nick blink in wonder.<br>\r\n<br>\r\nNick: Jeez, Kev. I didn't know you were that ticklish. (Grins at Joe) Want to join me?<br>\r\nJoe: (Mock politeness) Why, gladly, my little brother.<br>\r\n<br>\r\nThe two simultaneously tickle all over Kevin's feet.<br>\r\n<br>\r\nKevin: NOOOOOOOOOOOOOOOOO!!! STOOOOPP IT! AHHAAHHHAAAHAAAHAHAHAHAHAHAHAHAHAAAAAHAHAHAHAHAHAAAAHAHAHA!</span></div></div>",
            "created":1225688400,
            "id":603302,
            "title":"Joe and Nick tickle Kevin's socked-feet."
        },
        "1311":{
            "choices":[
                "Big Rob.",
                "Their parents.",
                "Frankie; the coolest Jonas."
            ],
            "content":"<div class=\"\"><div> <span>Kevin was in hysterics while his two baby brothers were tickling his immoble feet. It was horrible. And slightly humilitating, even though no one was there to witness it other than the three of them. He was the older brother, he should be able to do this to them, not vice versa.<br>\r\n<br>\r\nAnd why, he thought, why my feet? At least its not my sides. If they knew how much more ticklish I was on my sides, I'd have died already.<br>\r\n<br>\r\nHe threw his head back with more laughter, \"Hahahahaha, plehehehease noho mohohore!\"<br>\r\n<br>\r\n\"But Kev,\" Joe whined, \"You've tickled us before. This is revenge for all the years of torment you give out.\"<br>\r\n<br>\r\n\"Definatly, remeber that time you put shaving cream in my shoes? That wasn't cool,\" Nick added, giving his older brother a quick tickle on the ball of his foot.<br>\r\n<br>\r\nJoe moved up to Kevins knees and began squeezing them with one hand and tickling on the underside. He jerkeda round trying to avoid the ticklish sensations exploding in his mind. Then, IT happened. Nick was moving up Kevins body to tickle his armpits when he grazed Kevins side causing him to jolt dramatically. Through the tears forming in his eyes from laughing so hard, he saw a smirk makes its way across Nicks face. He whispered something to a knee-tickling Joe, who nodded eagerly, and amped up his fingers, increasing Kevins laughter. Nick then promptly left the room, and returned a few minutes later with a couple of things in his arms. <br>\r\n<br>\r\nMoments later, Kevin felt his shirt being lifted up. No, he thought, not there, anywhere but there.<br>\r\n<br>\r\nJoe let up on his knees, and gave him a break to catch his breath.<br>\r\n<br>\r\nBut not for long. On one of his sides, he felt Joe tickle him with a hairbrush on his left side and Nick tickling him with an electric toothbrush on his right. So a hairbrush, toothbrush, and two hands were tickling him to the edge of insanity and back. He was bucking and thrashing about as much as his bonds would allow him. He was going through a new form of hell and as soon as he got out, Nick and Joe were as good as dead. They knew it too, thats why they were milking it as much as they could while he was tied up. Sweat running down his face and his abs. His hair started matting against his forehead. Poor kid. Then there was a knock at the door.<br>\r\n<br>\r\n\"Whats going on?\" inquired...</span></div></div>",
            "created":1227330000,
            "id":610647,
            "title":"Joe and Nick tickle Kevin's bare feet."
        },
        "13113":{
            "choices":[
                "kevin tickles nicks tummy",
                "kevin tickles joes feet"
            ],
            "content":"<div class=\"\"><div> <span> frankie walked right in and when he saw this he smiled and laughed and said, well im gonna leave you three alone now.<br>\r\n\"no frankie help me!\" kevin begged<br>\r\n\"sorry, bro, u tickled me too remember\" and just like that he ran upstairs<br>\r\n\" you guys p-please, i cant take this any longer\" kevin begged, he really couldnt<br>\r\n\"aha sorry, thats too bad, its still revenge time\" nick said<br>\r\n<br>\r\nand just like that, they were back, tickling his sides like their was no tomarrow. except this time they didnt use the tools,just their hands, which tickled twice as much. kevin couldnt believe nick and joe would torture him like his. his stomach felt like it was on fire, as their fingers scribbled all around. he felt a few tears run down his face. he thought he was going to die. his mouth hurt from laughing, and his body hurt from squirming so much, but it didnt matter to joe and nick.<br>\r\n<br>\r\nwhen nick and joe saw kevin crying like this they stopped.<br>\r\n\" you guys just wait, nick im gonna tickle ur stomach so much, you\"ll cry like a baby, and joe im gonna get ur feet\" he said, he knew both of his brothers most ticklish spots.<br>\r\n\"come on man, this is what u get\" nick siad, trying to sounds tough, even though he was scared, he rememberd the last time kevin tickled nick stomach, he almost died. he wouldnt be able to take it again<br>\r\n\"yeah dude calm down\" joe said, scared too.<br>\r\n\"untie me\" kevin demamded<br>\r\nwhen they did, and ran away, kevin immedeitly started planning, on the worst torture possible to them, poor nicks tummy torture, and joes feet<br>\r\n</span></div></div>",
            "created":1248140940,
            "id":729082,
            "title":"Frankie; the coolest Jonas."
        },
        "131131":{
            "choices":[
                "kevin tickles nicks tummy",
                "kevin tickles nicks tummy"
            ],
            "content":"<div class=\"\"><div> <span>nick and kevin were home alone on night, because everyone else was at dinner, this was about a month after joe and nick tickled kevin, and nick had forgotten all about it. but he would pay tonight.<br>\r\n<br>\r\nnick was watching tv and kevin walked in and sat next to him.<br>\r\n\"hey nick, guess wat time it is?' kevin said<br>\r\n\"what\" nick said<br>\r\n\"revenge time\" kevin yelled<br>\r\nthen all of a suddon nick rememberd, and he quickly got up and ran, scared for his like, but kevin cought him and picked him up put him over mhis shoulder, heading upstaries. nick screamed and kicked but kevin held on, then he threw nick on his bed.<br>\r\n\"nno man pplease!\" nick yelled<br>\r\n\" ohh too late, im gonna tickle your poor tummy till u cry, just like i promished, you wont be able to stand it like i couldnt, you really will cry nick, you thought last time was bad, while just wait, this is gonna be hell for you!\" kevin yelled<br>\r\nthen he jumped on nick, and grabbed his arms with one hand and held them over his head. then tied them each to a bead post. nick yelled and squiremd but it was no use.<br>\r\n\" please not my stomach, ill die!\" nick screamed. terrifed<br>\r\n\"exactly\" kevin said, and lifted up nicks shirt, exposing his soft bellyy<br>\r\nall he had to do was place his fingers on nicks tummy and he exploded with giggles<br>\r\n\"heheheh ohahahh mn pleahahahae dont hehehe aha!\" nick said<br>\r\nnicks tummy was really in for nick, nicks poor tummy was so ticklish, he might just die, aha jk, but really, he was in<br>\r\n so much trouble, it would be torutre, and he would cry, his poor little ticklish tummyy, was really in for it, and ncik couldnt do anything, he was scared, and just having kevin touch his tummy made him giggle, he knew his little tummy was in for it, and screamed</span></div></div>",
            "created":1248141660,
            "id":729085,
            "title":"kevin tickles nicks tummy"
        },
        "1311311":{
            "author_id":"cjrstars",
            "author_name":"cjrstars",
            "choices":[
                "Baby oil",
                "Feather"
            ],
            "content":"<div class=\"\"><div> <span>Nick was going to have a long night. Kevin took one finger and traced all around Kevins belly. The one finger erupted squeals of loud laughter. \"This is only one finger, bro. Imagen 5 on your belly then 10 fingers dancing across your belly and dipping into here.\" When he said 'here' Kevin dipped his finger into Nick's belly button, tickling the ticklish thing with a grin. Kevin howled in laughter<br>\r\n\"Nick stop. I am sooooohaaaaarrrrrhhaaay. Pleeeeaaaaase stop!!!! Haahahahaho! NO NOT THERE! GET IT OUT!\" Nick laughed and yelled. Thank god no one else was here. \"We got all night Nick to play\" Nick whimpered. \"Please I am sorry!\" \"I know you are.\" He the reached down for....</span></div></div>",
            "created":1263365940,
            "id":819563,
            "title":"Nicks tummy trouble"
        },
        "13113111":{
            "choices":[
                "Joe gives in and help him torture Nick some more...",
                "Joe won't help Kevin tickle torture Nick anymore and is tied down and tickled"
            ],
            "content":"<div class=\"\"><div> <span>Kevin poured baby oil all over Nick's sensitive belly, making ssure to glop it in his navel.<br>\r\n\"Please Kevin, I'll do anything. ANYTHING.\" Nick begged. He was close to tears just thinking of all the torture he was about to expirience.<br>\r\n\"Too bad, Nick. You should've thought about this before you tickled my sides. You should've throught about how I'd get back at your belly!\"<br>\r\n\"Please.\" Nick whispered, a single tear rolling down his cheek. He was scared. He was too ticklish and knew he would faint eventually. He didn't even want to seem weak.<br>\r\n\"Wow, you really are scared, aren't you?\" Kevin asked.<br>\r\nWith thaat, Kevin digged into Nick's belly not missing one inch. He corkscrewed his thumb in Nick's overly-sensitive navel. Nick's back arched and he yelled for mercy.<br>\r\n\"PLEASEEEEEEE!!!!!!!!KEVIN!!!!!!HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA!! !!!! I'M BEGGING YOU!!!!!!!!\" Nick began to sob. Not only was the crying coming from the torture but he was scared. What if Joe decided to help?!<br>\r\nJust then, Joe walked in.<br>\r\nKevin stopped tickling and waited for Joe to do something.<br>\r\n\"Dude, let him go! He's our little brother!\" Joe said. \"You can't seriously keep up this kind of torture! He's crying his eyes out!\"<br>\r\n\"Joe I suggest you help me, or just leave, or I'll make the torment on your feet even WORSE.\"<br>\r\nJoe back away slowly.<br>\r\n\"NO!!!! Joe, please!!!! Help me!!!!\" Nick screamed.<br>\r\n\"I'm sorry Nick!\" Joe said, retreating from the room as fast as possible.<br>\r\nKevin then continued his torture.<br>\r\nHe dug two fingers into Nick's belly button, making him shriek with laughter. He dug down deep, fingering his knot.<br>\r\n\"NOOOOO NOT THE KNOT!!!!!\" Nick screamed. This was his most ticklish spot, the center of his navel.<br>\r\nKevin drew his face to his younger brother's quivering stomach. He licked Nick's belly button making his torture even worse.<br>\r\nAfter two hours of torturing Nick's belly button and stomach, Kevin untied his now unconscious brother.<br>\r\nTears stained Nick's cheeks as he caught his breath unconscious. His shirt was still lifted up and his belly button was red and raw from all the torture. <br>\r\nThen Joe came in and saw his brother.. Kevin walked back in, locking the door behind him.<br>\r\nOkay Joe...you can either help me by waking him up and tickling him some more. Or I can just tickle you now until you look like him.\" Kevin nodded at Nick. His hair was matted to his face.<br>\r\nJoe gulped...<br>\r\n<br>\r\n</span></div></div>",
            "created":1312251900,
            "id":1159654,
            "title":"Baby oil"
        },
        "1312":{
            "content":"<div class=\"\"><div> <span>Joe and Nick stop tickling Kevin and untie him.<br>\r\n<br>\r\nJoe: Wow, Kevin. I just found out my older brother's the most ticklish guy on Earth. Sweet!<br>\r\nKevin: (glares harshly and stalks off)<br>\r\nNick: (shouts after him) Hey, come on, Kev! We weren't trying to make you mad or anything. We just (grinning playfully) took advantage of the situation.<br>\r\nKevin: (face softens a bit) Yeah, whatever. (Smiles slyly) Just watch your backs, dudes. Something tells me you'll be having even more \"fun\" then I did today! (Walks away)<br>\r\n<br>\r\nThe two brothers stand in silence.<br>\r\n<br>\r\nJoe: Looks like we better hide the toothbrushes for the weekend.<br>\r\nNick: Along with the hairbrushes, feathers, chopsticks, pens, forks...<br>\r\nJoe: Okay, hold up! Did you just say...chopsticks?<br>\r\nNick: (shrugs) Anything pointy or soft and thin can tickle you.<br>\r\nJoe: I doubt Kev would tickle us with the things we EAT with. Anyway, we better get a battle plan!</span></div></div>",
            "created":1225688400,
            "id":603304,
            "title":"Kevin's Quiet Threat"
        },
        "14":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Nick and Joe",
                "Nick and Kevin",
                "Joe and Kevin",
                "All of Them!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, you want more than one?</span></div></span></div>",
            "created":1211864400,
            "id":536605,
            "title":"Multiple Guys"
        },
        "141":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "got him ready to be tickled",
                "decided it was too cruel and let him go",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>One Sunday night during a huge concert, the Jonas brothers were playing anchor after anchor and were currently on the 4 anchor. During that song, they were dancing and jumping around as usual and Nick dropped his guitar, seconds after he had, Joe ran up behind him and tripped right over the guitar, making the whole audience laugh. Once the concert was over, the Jonas brothers went back to their bus to drive them back home.<br>\r\n\"Nick! You have to be more careful! Everyone was laughing at me, just because I tripped on YOUR guitar!\" Joe exclaimed.<br>\r\n\"I know. I'm really sorry,\" Nick said.<br>\r\n\"You know, Kevin, I think we need to punish Nick,\" Joe suggested.<br>\r\n\"Yeah, I think so,\" Kevin agreed, as the bus stopped at their house.<br>\r\n\"No, come on guys no,\" Nick said, running off the bus and into his house.<br>\r\nKevin and Joe ran into the house a grabbed Nick, pulling him into their room, grabbing some rope and tying him to his bed, his hands and feet to the bed posts.<br>\r\nThey then...</span></div></div>",
            "created":1211864400,
            "id":536681,
            "title":"Nick and Joe"
        },
        "1411":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "kept tickling Nick",
                "decided to let him go, he'd had enough"
            ],
            "content":"<div class=\"\"><div> <span>After they had finished tying him up, the moved toward Nick's feet, taking off his shoes.<br>\r\n\"NO! Please not my feet! They're my most ticklish spot!\" Nick begged.<br>\r\n\"We know,\" Joe said.<br>\r\n\"We just wanted to get right to the point,\" Kevin said.<br>\r\nThey pulled off his shoes, discarding them on the floor. They tickled his feet, for a few minuets, making Nick squirm and laugh.<br>\r\n\"AAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHA NOOOOOOOO! PLEEEEEEASE AAHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHA COOOOME OOOOON STAAAHAHAHAHAHAP!\"<br>\r\nNick begged, through his laughter.<br>\r\n\"Wow! Hysterical already and we haven't taken off your socks yet,\" Joe said.<br>\r\n\"NO! Come on guys, please I'm too ticklish,\" Nick said, as he made a futile attempt to hold on to his socks with his toes, but they tickled his sole and he reflexively fanned his toes out, allowing them to take off his socks.<br>\r\nOnce the socks were discarded on the floor, Joe took the right foot and Kevin took the left and they tickled and tickled his feet, even pulling up his toes to tickle the sensitive area underneath them. All of this really pushed Nick over the edge, making him dive into a frantic fit of laughter.<br>\r\n\"NOOOOOOOOOOOOO! AAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAPLEEEEEEEEEEEASE STAAAHAHAHAHAHAHAHAHAHAHAHAP! COOOME OON! AAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA I'M TOOO TICKLISH! AAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA! PLEEEEEAASE NOOOOOOOO! HAHAHAHAHA NOT THE TOES! AAAHAHAHAHA!\" Nick screamed hysterically, howling with laughter.<br>\r\nJoe and Kevin then...</span></div></div>",
            "created":1211864400,
            "id":536769,
            "title":"Nick's Punishment"
        },
        "14111":{
            "author_id":"tickler",
            "author_name":"tickle",
            "choices":[
                "let him go ",
                "tickle the head of his manhood"
            ],
            "content":"<div class=\"\"><div> <span>joe began to unbuckle nick's belt and unzip his zipper.  then nick becoame very nervous as joe began to reveal his sexy manhood. nick said nooooooooooooo please my sack is mor more ticklish then my feet.<br>\r\n\"we know\" joe and kevin said.<br>\r\nthewy began to tickle nick's sack.<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAH NOT MY BALL SACKKKKKKKKKKKKKK AHAHAHAHAHAHAHAHA PLEASEHAHAHAHAHAHAHAHAHAHAHAHA.<br>\r\nAFTER TEN MINS of tiklign his sack they  </span></div></div>",
            "created":1224651600,
            "id":598613,
            "title":"kept tickling Nick"
        },
        "141112":{
            "author_id":"tickler",
            "author_name":"tickle",
            "content":"<div class=\"\"><div> <span>kevin draws a feather and starts to haed for nicks sexy, oversized , and TICKLISH HEAD.<br>\r\nnick say noooooooooo please not my head<br>\r\nit too late joe says,<br>\r\njoe and kevin begin to tickle begin to tickle his head<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA NOOOOOOO PLEASE STOPHAHAHAHAH,<br>\r\nKEVIN TAKES HIS FEATHER AND TICKLES THE PISS SLIT, HAHAHAHAHAHAHA NO THE SLITHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH <br>\r\n<br>\r\nAFTER TEN MINUTES OF TICKLIGN THEY LET HIME GO  </span></div></div>",
            "created":1226379600,
            "id":606786,
            "title":"tickle the head of his manhood"
        },
        "14112":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "The Day After The Concert"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After Nick calmed down, they untied him and went to go get some food. They talked and got ready for their next concert</span></div></span></div>",
            "created":1211864400,
            "id":536773,
            "title":"The Next Day"
        },
        "141121":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "This is perfect revenge",
                "I hope he'll be okay"
            ],
            "content":"<div class=\"\"><div> <span>That Day, Frankie Jonas (The youngest of the Jonas Brothers) was going to a baseball game and Kevin and their parents went, too. So, only Nick and Joe were left at home, to do chores.<br>\r\n\"Okay, I'll take the first half of the list and you can take the second,\" Nick said.<br>\r\n\"Okay, sounds like a plan,\" Joe agreed.<br>\r\n\"After Joe and Nick had finished a couple of their chores, Joe went to try to stop a leak in the master bathroom sink. Nick was starting to wash the windows, he heard a yell from the master bathroom, he ran in and went to the bathroom, finding Joe stuck under the sink. Most of his body was free, just his hands were caught in the pipes, stretching out his arms and leaving them taught.<br>\r\n\"Hey, are you really stuck?\" Nick asked.<br>\r\n\"Yeah, I can't move at all,\" Joe confirmed.<br>\r\n\"Oh, don't worry I'll help you,\" Nick said. He thought...<br>\r\n</span></div></div>",
            "created":1211864400,
            "id":536781,
            "title":"The Day After The Concert"
        },
        "1411211":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "Joe's most ticklish spot are his arm-pits",
                "Joe's most ticklish spot are his feet"
            ],
            "content":"<div class=\"\"><div> <span>Nick ran into his room and grabbed a couple of ropes and tied Joe's legs to the towel rack.<br>\r\n\"Hey what are you doing!?\" Joe asked, surprised.<br>\r\n\"I'm just getting a little revenge, that's all,\" Nick replied, calmly.<br>\r\n\"Revenge, what fo... oh, that, come Nick you know we were just having some fun,\" Joe, tried to explain.<br>\r\n\"Sorry Bro, but it looks like some of your 'sensitive areas' are exposed and I intend to take full advantage of that,\" Nick said, pulling up Joe's t-shirt exposing his abs, flanks, ribs and tender pits.<br>\r\n\"Nice abs, are they ticklish?\" Nick teased, tickling his older brothers abs, and squeezing his ribs and hips.<br>\r\n\"Ye-hehe-s they are! Ahahaha! Come On Nick haha Pleease DON'T AHAHAAHA!\" Joe pleaded.<br>\r\n\"Sorry, but you tickled me so now I gotta tickle you,\" Nick replied, scribbling his fingers all over Joe's flanks, making him really laugh.<br>\r\n\"AAAAHAHAHAHAHAHAHAHA NOOOOO! NOOOOT THERE! AHAHAHAHAHAHA! PLEEEEASE! HAHAHAHA I'M TICKLISH TOOO YA KNOW! AHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA!\" Joe screamed, laughing hysterically.<br>\r\n\"Aww, is the wittle baby tickwish,\" Nick taunted, adding to Joe's torture.<br>\r\n\"YEHEHEHEHES! I AAAAM! NOOOOW PLEEEEEASE STAAAHAHAHAHAHAHAP!\" Joe begged.<br>\r\n\"Sorry Joe, but you tickled me on my worst spot and now I'm gonna tickle you on yours,\" Nick said.<br>\r\n</span></div></div>",
            "created":1211864400,
            "id":536796,
            "title":"Nick's Revenge"
        },
        "14112111":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "choices":[
                "AN ELECTRIC TOOTHBRUSH!",
                "SOMETHING ELSE!"
            ],
            "content":"<div class=\"\"><div> <span>\"NOOOO! NOOOOT MY PITS! I'LL DIE AHAHAHHAHAHAHAHAHAHAHAHAH!\" Joe pleaded as nick tickled his way up from his flanks, up to his pits. Once he got to Joe's pits, he slowly placed them into Joe's hairy pits. Even just placing his fingers in Joe's pits made him squirm and giggle.<br>\r\n\"Hahaha Pleeease hehe dohohon't pleeeease haha!\" Joe begged, one last time.<br>\r\nUnfortunately for him, Nick had already mad up his mind, he spidered his fingers all in Joe's pits, scribbling along the sides and base of each pit. Being Joe's worst spot, he burst out into laughter, flailing his arms around and howling with laughter.<br>\r\n\"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA NOOOOOOOOOOOOOO! PLEEEEEEEEEEASE I'M TOOOO TICKLISH! AAAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA! COME ON NICK! HAHAHAHAHAHAHAHAHA I'M SORRY JUST HAHAHAHAHAHA <br>\r\n STAAAAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAP!\"<br>\r\nJoe, shrieked, frantic with laughter.<br>\r\n\"Joe, you have tickled me so many times over the years, I have one more idea and it's gonna REALLY drive you over the edge!\" Nick exclaimed, leaving to get something.<br>\r\n\"I'm already hysterical, what could be worse?\" Joe wondered, struggling, but it was no use.<br>\r\nThen Nick came back with... </span></div></div>",
            "created":1211864400,
            "id":536879,
            "title":"Joe's most ticklish spot are his arm-pits"
        },
        "141121111":{
            "author_id":"tklwizard",
            "author_name":"wizkid",
            "content":"<div class=\"\"><div> <span>Nick sat down again, this time with an electric toothbrush.<br>\r\n\"No! Please, don't use that!\" Joe pleaded.<br>\r\n\"I'm going to Joe and their is nothing you can do about it!\" Nick taunted.<br>\r\nHe turned on the toothbrush and started to slowly lower it to Joe's armpit.<br>\r\n\"Hehe hahaha nooo! Pleeease don't hahaha!\" Joe said, giggling with anticipation.<br>\r\nNick dug the toothbrush into Joe's armpit, scrubbing it with the vibrating toothbrush, switching from armpit to armpit.<br>\r\n\"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA HAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA NOOOOOOOOOO! PLEEEEEEEEEASE! I CAAAAAN'T TAKE IT! HAHAHAHAHAHA I'M REEEEASLLY SORRY! I PROMISE NOT TO TICKLE YOU ANYMORE! AAAAAA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA!\" Joe  screamed, laughing with insanity.<br>\r\n\"Okay, I think you've had enough,\" Nick said.<br>\r\nNick untied Joe and pulled him out<br>\r\n\"You know I'm gonna tickle you again,\" Joe said.<br>\r\n\"Yeah, I know and I'm gonna tickle you, too,\" Nick replied.<br>\r\n\"Oh, Crap!\" they said together, \"We only have 1 hour to the rest of the chores!\"<br>\r\nThey rushed out of the bathroom and went to finish the chores.</span></div></div>",
            "created":1211950800,
            "id":536992,
            "title":"The Dreaded Toothbrush"
        },
        "141121112":{
            "author_id":"tickler",
            "author_name":"tickle",
            "choices":[
                "feet ",
                "knees"
            ],
            "content":"<div class=\"\"><div> <span>nick came back with a drill that had 3 feathers on it.<br>\r\n\"nick your not going to tickle my pits with that are you?\"<br>\r\nyes i am <br>\r\n\"no please i'll wet wet my pants or die\"<br>\r\nwell you should have thought about that before you tickled be<br>\r\nnick begins to use the \"widow maker\" on joe's pits<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH THIS SUCKS HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH I'M HAHAHAHAHAHAHAHA GOING TO HAHAHA WET HAHAHAHAHAHAHAH MY HAHAHAHAHAH PANTS HAHAHAHAHAHAH ANY SECOND HAHAHAHAHAH\"<br>\r\nAFTER 5 SECONDS NICK SEES A LARGE WET SPOT AS BIG AS JOE'S SPOT<br>\r\nnow nick will move to joe's <br>\r\n </span></div></div>",
            "created":1215579600,
            "id":554048,
            "title":"SOMETHING ELSE!"
        },
        "1411211122":{
            "author_id":"tickler",
            "author_name":"tickle",
            "content":"<div class=\"\"><div> <span>nick changes his mind instead of tickling joe's knees, he starts unbuckling joe's belt, and then unzips his zipper.<br>\r\njoe says no plz don't tickle my manhood.<br>\r\n<br>\r\ndon't beg nick said \"joe did you know that the bigger the sack, and head the more ticklish you are on your man hood.<br>\r\nit just so happened joe's sack, and head were the biggest, out of nick, and kevin.<br>\r\n<br>\r\njoe said nooooooooooooo really please don't tickle me now.<br>\r\n<br>\r\ntoo late nick pulls down joe's boxers to revelhis  very very sexy, oversized, and ticklish manhood<br>\r\n<br>\r\nnick takes the \"widow maker\" and begins to tickle joe's manhood<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA PLZZZZZZ STOOOOOOP HAHAHAHAHAHAHAHAHAHAHAHAHA I CAHAHAHA'T HAHAHAHAHAHTAKEHAHAHAHAHAH ITHAHAHAHAHAHAHAHAHAHAH<br>\r\nAFTER ABOUT AN HOUR OF TICKLING JOE'S MANHOOD NICK LET HIM OUT, AND THEY FINISHED THEIR CHORES </span></div></div>",
            "created":1226466000,
            "id":607118,
            "title":"knees"
        },
        "14112112":{
            "author_id":"tickler",
            "author_name":"tickle",
            "choices":[
                "his fingers ",
                "a feather"
            ],
            "content":"<div class=\"\"><div> <span>nick please im begging you don't tickle my feet.<br>\r\nsorry bro revenge is a witch.<br>\r\nnick begins to unlace joe's shoes and then removes them.<br>\r\nnick is now taking of joe's socks, but joe clenches his toes to keep them on<br>\r\nnick then tickled his feet and his toes open<br>\r\nnicks begins to tickle joe's feet with....... </span></div></div>",
            "created":1215579600,
            "id":554009,
            "title":"Joe's most ticklish spot are his feet"
        },
        "141121122":{
            "choices":[
                "Nick continues tickling Joe",
                "Nick lets Joe go"
            ],
            "content":"<div class=\"\"><div> <span>Nick pulls out a feather to tickled Joe's feet with.<br>\r\n<br>\r\nJoe: (nervously laughs) Come on, Nick. Feathers only work on TV and stuff.<br>\r\nNick: Good. You have nothing to worry about, then.<br>\r\n<br>\r\nNick slowly drags the feather across Joe's soles.<br>\r\n<br>\r\nJoe: AHAAHHHHAHAHAAHHHHAAAA!!! STAAHAAAAAHAAHHAAAP!!! I! CAN'T! TAKE! IT! NOOOOOOOOOOOOOOOOOHAHAHAHAHAHAAAAHAHAH!!! CUT IT OUUUUT! PLEEEEEEEEEEEAAASE, NIIIICK!<br>\r\nNick: (taunting) \"Come on, Joe. Feathers only work on TV and stuff.\" Unless you're saying that I'm not good at this...(slides feather through Joe's long, sensitive toes)<br>\r\nJoe: (writhing and wriggling hysterically) OOOKAAAAYY! YOU ROCK AT THIIIIIS! YOU'RE AWESO-HAAHAAHAAAAAAAAAHAAHA! JUST STAHAHAHAP! PLEEEEEAAASSSE! I'M GONNNA PUUUUKE!<br>\r\nNick: Hmmmm...</span></div></div>",
            "created":1225688400,
            "id":603306,
            "title":"The Dreaded Feather"
        },
        "1411211221":{
            "choices":[
                "Joe prepares to get revenge"
            ],
            "content":"<div class=\"\"><div> <span>Nick: You know, Joe? I'm so glad that the place you got stuck in was the bathroom.<br>\r\nJoe: (Nervously) Why?<br>\r\nNick: Oh, you'll see...<br>\r\n<br>\r\nNick takes lotion from the cabinet and thoroughly rubs both of Joe's feet with it.<br>\r\n<br>\r\nNick: Feels good, huh?<br>\r\nJoe: (Extremely relaxed) Uh, huh. This is so-<br>\r\n<br>\r\nNick takes Joe's electric toothbrush from the counter, turns it on, and scrubs Joe's big toe with it.<br>\r\n<br>\r\nJoe: AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHAHAHAHAHAAAAHAHAHAHAHAHAHAAAAH!!! HAAAAAACOMEON!!! STOP ITTTTT NIIIICK!!! ICAN'TTAKEITTT!!! NOOOOOOOOOOOOOOOOOOOOOOOOOO! NOT MY BIG TOOOOOOOE! NOTTHETOE-NOTTHETOE-NOTTHETOE-HO-HO-HOOOOOO! AAAAAAAAAAAAAAAAAAAAAAAAAHHH!!! (screams like a crazed idiot)<br>\r\nNick: Told you I'd get your most ticklish spot!<br>\r\n<br>\r\nSuddenly, from his sweating and thrashing around, Joe's arms slip out from the pipes!</span></div></div>",
            "created":1225688400,
            "id":603537,
            "title":"Nick continues tickling Joe"
        },
        "14112112211":{
            "choices":[
                "Nick and Joe get busted",
                "Nick's plan works"
            ],
            "content":"<div class=\"\"><div> <span>Joe's face is covered in sweat, tears, and uncontrollable rage!<br>\r\n<br>\r\nNick: (starting to get nervous) ...I went a little over the line, didn't I?<br>\r\nJoe: (laughs quietly) Just a little? JUST A LITTLE?! YOU BETTER RUN YOU -<br>\r\n<br>\r\nThey here Kevin, Frankie, and their parents pulling in.<br>\r\n<br>\r\nJoe: Oh, man! We didn't finish our chores! We're so -<br>\r\nNick: Wait! (looking at how sweaty Joe is) I've got an idea! Get in your bed quickly.<br>\r\nMrs. Jonas: (coming up the stairs) We're back early, boys! Poor Frankie's game got rained out. Hey...why isn't the bathroom done yet?<br>\r\nNick: Well you see...</span></div></div>",
            "created":1225688400,
            "id":603542,
            "title":"Uh, oh!"
        },
        "141121122112":{
            "content":"<div class=\"\"><div> <span>Nick: Well you see...maybe five minutes after you guys left, Joe nearly fainted!<br>\r\nMrs. Jonas: (getting that \"suspicious mother\" look) Nicholas Jerry Jonas, are you lying?<br>\r\nJoe: (walks out of his room sleepily - his being barefoot implies he was asleep) Oh, hey Mom. 'Sup?<br>\r\nMrs. Jonas: (still skeptical) Nick tells me that you almost fainted. Is that true.<br>\r\nJoe: Wha...oh. Nah, I'm just really (convincing yawn) sleepy.<br>\r\nMrs. Jonas (now with the \"worried mother\" look) See? I told you not to stay up so late. I'm just glad you didn't fall down the stairs!<br>\r\nJoe and Nick: (silence)<br>\r\nMrs. J: Gasp! Did you?!<br>\r\nJoe: Uhh...<br>\r\nMrs. J: Oh, Joseph! (hugs him) You know what? I want you in that be right now! Get more sleep, young man!<br>\r\nJoe: (pretends to pout a little) Yes, Mom.<br>\r\nMrs. J: (turns to Kevin) Sweetie, I told you to stay home with them. Now look what happened! As the oldest...<br>\r\nKevin: Sigh. I need to be responsible. Sorry, Mom.<br>\r\n<br>\r\nTheir mother walks downstairs. Once out of her range hearing, Kevin glares at his two brothers.<br>\r\n<br>\r\nKevin: (high-level sarcasm) Wow, guys, thanks a lot! Now Mom's blaming me for something that didn't even happen.<br>\r\nNick: (innocently gasps) Big brother! How could you accuse us of lying to sweet, sweet, Mother?<br>\r\nKevin: Keep tellin' yourself that. This isn't over, (mock politeness) sweet, sweet, brothers.</span></div></div>",
            "created":1225688400,
            "id":603552,
            "title":"Nick's plan works"
        },
        "142":{
            "choices":[
                "nick got tried and he went to lay down.",
                "nick went to watch t.v.",
                "nick starting"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>one day nick and kevin and also joe they were making dinner for their mom</span></div></span></div>",
            "created":1265424000,
            "id":831286,
            "title":"Nick and Kevin"
        },
        "143":{
            "choices":[
                "tickle",
                "tickle",
                "tckle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>joe and keven</span></div></span></div>",
            "created":1241845200,
            "id":688576,
            "title":"Joe and Kevin"
        },
        "144":{
            "author_id":"cynthia_p",
            "author_name":"e",
            "choices":[
                "Kevin",
                "Joe",
                "Nick"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The Jonas Brothers were kinapped and now they are in a tickle ward, they don't know why, but they are in three separated rooms, tied to metal tables, and each one has a personal tickle doctor.<br>\r\n<br>\r\nWhich should start first?</span></div></span></div>",
            "created":1247720400,
            "id":726377,
            "title":"All of Them!"
        },
        "1443":{
            "author_id":"cynthia_p",
            "author_name":"e",
            "choices":[
                "nick's feet",
                "nick's knees",
                "nick's neck"
            ],
            "content":"<div class=\"\"><div> <span>Dr. Overs walked down the hallway to the fourth room on the left. Slowly he opened the door, peering in he saw a curly haired boy, maybe about 16/17 lying on his stomach, on a table, his arms raised above his head, and his ankles, spread eagle, tied,keeping ahold of two bare feet so they wouldn't run off.<br>\r\n<br>\r\n\"Nicholas Jonas\" the doctor said, smiling as he looked at his clipboard.Nick stopped struggling when he heard his name. He slowly twisted his head around and looked at his tormentor. Nick looked scared, and nervous. Dr. Overs  grunted and went over to him.<br>\r\n<br>\r\n\"How are you today, you are in the tickle ward, why you're here I cannot say, but I am your tickle doctor, Dr. Overs\" Overs explained.<br>\r\n<br>\r\n\"Y-you're going to tickle me?\" Nick asked, a look of confusion showing on his features. Dr. Overs nodded and smiled, closing his eyes. Nick sweardropped. He hated being tickled. All his life he'd either been tickled by his Mom, Dad, even his brothers still held him down and tickled him, whenever they can.<br>\r\n<br>\r\n\"So how ticklish are you Nick?\" Overs asked, leaning down looking Nick directly in the face. Nick backed away, untrusting .He tried to lie.<br>\r\n<br>\r\n\"I'm not ticklish\" he said, seriously, glaring at the doctor. Dr. Overs laughed and shook his head.<br>\r\n<br>\r\n\"Of course you aren't\" he said, he began to walk away, and at first Nick thought it actually worked...that is until he felt something stroking his underarm. Nick tried to wiggle away, but the fingers of Dr. Overs followed his every movement.<br>\r\n<br>\r\n\"Not ticklish, huh?\" Overs asked, laughing. A few giggles escaped from Nick's mouth, and he hoped Williams didn't notice. He noticed alright.<br>\r\n<br>\r\n\"Are you going to laugh for me, or just do that little giggle of yours?\" Overs asked, he sped up the stroking of Nick's underarms, and Nick gradually started laughing.<br>\r\n<br>\r\n\"St-stahap plehease HAHAHAHAHAHAHAHAHAHAHAHA STOP!\" Nick cried, trying to pull his arms down,as Dr. Overs started to speed up faster and faster.<br>\r\n<br>\r\n\"You're a liar\" Dr. Overs said, chuckling \"You know what I do to liars?\" Nick slowly opened one eye (it's hard to keep your eyes open when being tickled) and looked at Overs. Overs smiled down at him and stopped his underarm tickling, giving Nick time to breathe.<br>\r\n<br>\r\nDr. Overs went over to the desk at the side of the bed and went rumaging through one of the drawrers. Nick watched him with a nervous expression. Finally after a few seconds, Overs found what he was looking for, and he brought it out for Nick to see. It was one of those mechanical toothbrushes. Nick only had a feeling of where he was going to get it next, and he wasn't going to like it.<br>\r\n<br>\r\n\"I won't use this on you yet, but be assured I will use it\" Dr. Overs  said, putting the toothbrush on the desk. But he wasn't giving Nick a break. Next he went to.......</span></div></div>",
            "created":1247720400,
            "id":726381,
            "title":"Nick"
        },
        "14431":{
            "author_id":"dragonnite",
            "author_name":"The Abysmal Chasm",
            "choices":[
                "someone enters",
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Next he went to Nick's feet, held in place by a thick rope around his ankles.<br>\r\n    \"Let's see just how ticklish you are.\" Dr. Overs began, \"Starting with you're piggies.\" Overs grabbed Nick's big toe between his thumb and pointer finger. \"This little piggy whent to market.\" Overs said as he wiggled the toe enticeing a strained giggle from the captive Jonas Brother. \"This little piggy stayed home.\" Dr. Overs continued, repeating what he did with the first toe on the second one, and so on. \"This little piggy ate roast beef.\" Nick began to grunt, as he held back hiis laughter. \"This little piggy had none.\" Nick struggled, he knew what would happen next, then ehat felt like a shot of lightning jumped through Nick's body, \"and this little piggy, he cried wee, wee, wee all the way home.\" Overs moved his agile fingers to the balls of Nicks feet without giving Nick a moment's breath.<br>\r\n    \"N-n-no, st-stop!\" Nick managed to spout, befor an onslaught of laughter filled the room again. \"P-please, Ahhh HA, No more! Phhth.\" To nicks suprize Dr. Overs did as he had asked, he stoppedwith the foot, but what Nick didn't notice was Overs reaching for the bag he had brought in. Overs rummaged through the bag for a second befor pulling out exactly what he wanted. A white, almost angelic feather. The sides very downy and soft. <br>\r\n    \"Now we really get to see how ticklish you are.\" Then . . .</span></div></div>",
            "created":1312590660,
            "id":1162233,
            "title":"little piggies"
        }
    },
    "info":{
        "author_id":"tklwizard",
        "author_name":"wizkid",
        "brief_description":"A story where the Jonas Brothers get tickled.",
        "created":1211910060,
        "description":"<td align=\"left\" class=\"norm\">This Story contains the tickling of the three Jonas brothers in the band. These are real people sponsored by Hollywood and Columbia records, they have a tv show, on disney channel called Living the Dream.<br>\r\n<br>\r\nPlease add on as much as you like, while still abiding by the following rules:<br>\r\n- Please keep it PG<br>\r\n- No nudity<br>\r\n- No Sex<br>\r\n- No killing<br>\r\n<br>\r\nThank You and enjoy</td>",
        "id":1431144,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1549381740,
        "modified":1549381740,
        "pretty_title":"Jonas Brothers Tickling"
    }
}