{
    "chapters":{
        "1":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Revenge",
                "Body Swap",
                "Mystery",
                "Romance",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are the first types of stories.</span></div></span></div>",
            "created":1209358800,
            "id":525239,
            "title":"Chosing the type of story"
        },
        "11":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Brain Plan",
                "New Image",
                "The Photographer",
                "Skin Deep",
                "Other..."
            ],
            "content":"<div class=\"\"><div> <span>Choice 1: You are a 16 year old girl who is a brain wiz but not very attractive and have always wanted to be popular.<br>\r\n<br>\r\nChoice 2: You are a 12 year old boy who has a twin sister and you look almost alike excpet for the opposite sex features and the fact that her body is shaped differently.<br>\r\n<br>\r\nChoice 3: You are a 55 year old man with a deceased daughter and a suicide wife that recently killed herself after your daughter was killed in a car accident.<br>\r\n<br>\r\nChoice 4: You are a 80 year old woman who has no real life because she is an illegal alien to the United States, but you have the ability to grant anyone a single wish in exchange for something. <br>\r\n<br>\r\nChoice 5: Other...</span></div></div>",
            "created":1211691600,
            "id":638417,
            "title":"Revenge"
        },
        "111":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Look Inside",
                "Close the canister and put it back on the shelf"
            ],
            "content":"<div class=\"\"><div> <span>You are a young 16 year old girl with hair down to your shoulders and skin that is not very good because of acne. You are sitting at home studying for a major test tomorrow when you hear soemthing break in the basement. You cautiously walk downstairs, into the basement, and look around for someone but no one is there. As you are about to return back up stairs, something rolls up to the back of your right foot. You hesitantly turn around and find a small canister. Looking around you see a shelf that was on the wall broken and asume that the canister must have come from the shelf. You pick it up and head towards the shelf. You stop at the shelf and put the canister on a small box while you fix the shelf. You finish and grab the canister with your right hand. As you are about to put the canister on the shelf it suddenly opens...<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1211691600,
            "id":535825,
            "title":"The Basement"
        },
        "1111":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Bed Room to continue studying...",
                "Sit on the couch and watch tv as you take a break...",
                "Restroom to use the toilet..."
            ],
            "content":"<div class=\"\"><div> <span>you look inside of the canister and see a small medallion and tilt the canister until the medallion slide into your hand. You feel the medallions embroidary and stare at it as if you were in a trance then put the cansiter back on the shelf as you slide the medallion into your pocket before headign back upstairs. You decide to make a snack and head towards the kitchen. Looking through the cabinet you remember that you ate the last of the bread, but you really want to eat a sandwich. You look in the cabinet to find soemthing else to eat, but are shocked to see a loaf of bread in the cabinet and assuem that your mother must have gone to the store. Next after you make your sandwich you head to the...</span></div></div>",
            "created":1225861200,
            "id":604214,
            "title":"Look Inside"
        },
        "113":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Leave to take pcitures",
                "Stay and examien the camera some more"
            ],
            "content":"<div class=\"\"><div> <span>You are 55 years old and a successful photographer but you have lost your family thanks to a tragic accident. For a few weeks you remain in your home alone and asolated from the world until a strange package arrives one day with a mysterious message. You get out of bed and head towards your front door to see who it is. A man wearing a UPS uniform is holding a package and a letter of you. you sign the document and head back insid wondering who the package is from. You look at the address and see that it came from your house 20 years ago. You think to yourself that the date must be a typo and the package must have been from your wife. You open the package to find a strange looking camera that is disfigured. You exmine it and find that it can not be opened but it does have power. A small green light with a strange looking symbol on the bottom of the camera is lit up. You touch it and see a flash of light. You find that the green light is a button to set off the flash. A strange looking blank back begins to shift to show the image taken. You think the camera is digital and put it away for a few minutes before heading outside to take some new pictures. Looking in the box you find s note that says, \"You can save them.\" You think to yourself what is this thing talking about...</span></div></div>",
            "created":1211691600,
            "id":535830,
            "title":"The Photographer"
        },
        "12":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "The Sphere",
                "The Mysterious Man",
                "The Shooting Star",
                "The Assassin",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>#1 You find a sphere that can grant wishes<br>\r\n<br>\r\n#2 You encounter a mysterious hooded person who offers you a single wish<br>\r\n<br>\r\n#3 A shooting star passes ove head and you get your wish granted<br>\r\n<br>\r\n#4 You are an assassin and you have to use different disguises to take out your targets.</span></div></div>",
            "created":1209358800,
            "id":525241,
            "title":"Body Swap"
        },
        "123":{
            "author_id":"bfine2626",
            "author_name":"Bfine2626",
            "choices":[
                "Something about school ",
                "Something about yourself",
                "Something"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you wish for?</span></div></span></div>",
            "created":1462299720,
            "id":2142699,
            "title":"The Shooting Star"
        },
        "1231":{
            "author_id":"bfine2626",
            "author_name":"Bfine2626",
            "choices":[
                "Teacher",
                "Staff",
                "Student"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who do you swap with</span></div></span></div>",
            "created":1462320480,
            "id":2142833,
            "title":"Something about school "
        },
        "12311":{
            "author_id":"bfine2626",
            "author_name":"Bfine2626",
            "choices":[
                "Art",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wished to know how life was like as a high school teacher . Who do you swap with?</span></div></span></div>",
            "created":1462320660,
            "id":2142836,
            "title":"Teacher"
        },
        "123111":{
            "author_id":"bfine2626",
            "author_name":"Bfine2626",
            "choices":[
                "Readers choice",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>You were at home. It was late at night. Your life was pretty dull right now, no parties or nothing. You were looking out of you bedroom window when a shooting star passed by. You thought a second about a wish and then thought of a different way to get away from your dull life as a 16 year old geek. \"I wish I could get a true experience at being a high school art teacher.\" You thought to yourself. You suddenly saw a weird bright light envelope you along with a weird tingling sensation. You blacked out.<br>\r\n<br>\r\nYou slowly arose from a slumber. You groggly opened your eyes, and noticed a new enviorment that surrounded you. You were now in what looked like a big art classroom. There was boxes od art supplies on every table. You were sitting behind what looked like a teachers desk. Long brown strands of hair fell in front of your eyes. You were shocked when you looked down at your body. You see two DD cup boobs, swollen and milk filled lactating boobs. Those melons were laying on top of a gigantic pregnant belly. You look in the small mirror net to you and see<br>\r\n[URL=http://s1175.photobucket.com/user/bfine2525/media/Pregnant/20160122_113 843_zpstltlxqyj.jpg.html][IMG]<a rel=\"nofollow\" href=\"http://i1175.photobucket.com/albums/r625/bfine2525/Pregnant/20160122_113843_zpstltlxqyj.jpg\" target=\"_blank\">http://i1175.photobucket.com/albums/r625...</a>[/IMG][/URL]<br>\r\n<br>\r\nWhat happens next</span></div></div>",
            "created":1462321380,
            "id":2142839,
            "title":"Art"
        },
        "124":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Male",
                "Female",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What sex Assassin are you?</span></div></span></div>",
            "created":1209358800,
            "id":525247,
            "title":"The Assassin"
        },
        "1241":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Rookie",
                "Moderate",
                "World Class"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of Assassin are you?</span></div></span></div>",
            "created":1209358800,
            "id":525249,
            "title":"Male"
        },
        "12411":{
            "author_id":"elliot",
            "author_name":"Elliot",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>You are a former Delta Force operator who has been recruited by the Central Intelligence Agency.You are tall with short blonde hair and blue eyes.Your first assignment for the CIA is the termination of a fat Colombian Drug Lord called Raol Diaz.The company has kidnapped Diaz's girlfriend a former Miss Colombia named Maria Herrera. Dr.Straus used a device to transfer your mind into Herrera's body.The plan is when Diaz comes to her apartment in Bogota you will take him out.Diaz trusts Maria.His bodyguards don't come in the room while they are having sex.</span></div></div>",
            "created":1222578000,
            "id":642456,
            "title":"Rookie"
        },
        "124111":{
            "author_id":"elliot",
            "author_name":"Elliot",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>It is weird going from a 6'2\" man to a 5'6\"woman.You visit Maria in her cell.You are dressed in a small pair of black cargo pants,a matching turtleneck and are wearing boots on your small feet.Your long dark hair is in a ponytail.You wear no makeup or jewlery.'You have a Beretta in a shoulder holster.She seems to be pleased to be in your body.\"I thought switching bodies was something of science fiction and fantasy.\"Maria says to you in Spanish.You understand the language and speak it fluently.\"I did to.Maria, I have to ask you questions about your relationship with Raol Diaz.Cooperate and you will get your body back sooner.\"you say still getting used to a high pitched voice.\"What makes you think I want that.I am a big strong American man now.\"she says.You look at her in shock.She laughs.You ask her some questions.You are cautious expecting her to try to overpower you with your body.She doesn't.She tells you that she would have asked for a cigarette but no longer feels the craving for one.She would like a steak instead.You realize her addiction to nicotine is what has been making you jittery.</span></div></div>",
            "created":1222578000,
            "id":588360,
            "title":"continue"
        },
        "1241111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>“I am right back!” you tell her and think that you now need a smoking break. Since smoking is forbidden all inside rooms, you have to step out to the garden of the CIA building here in Washington.<br>\r\nIt is a nice warm day and you think, since you don’t have any cigarettes with you anyway, to have a walk to the little shop on the other side of the road….<br>\r\n</span></div></div>",
            "created":1294220040,
            "id":1029435,
            "title":"continue"
        },
        "12413":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Mist",
                "White Tiger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is your name?</span></div></span></div>",
            "created":1209358800,
            "id":525250,
            "title":"World Class"
        },
        "1242":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Yellow Jacket",
                "The Myst",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What type of Assassin are you?</span></div></span></div>",
            "created":1209358800,
            "id":525254,
            "title":"Female"
        },
        "1243":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "A genetically altered human",
                "An alien",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What are you?</span></div></span></div>",
            "created":1209418320,
            "id":652562,
            "title":"Other"
        },
        "12431":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Male ",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What sex are you?</span></div></span></div>",
            "created":1235608380,
            "id":652563,
            "title":"A genetically altered human"
        },
        "124311":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Animal genes",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is altered about you?</span></div></span></div>",
            "created":1235608440,
            "id":652564,
            "title":"Male "
        },
        "124312":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Animal genes",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What is altered about you?</span></div></span></div>",
            "created":1235608500,
            "id":652565,
            "title":"Female"
        },
        "12433":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "yes",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are you a shapeshifter?</span></div></span></div>",
            "created":1462349940,
            "id":2143001,
            "title":"other"
        },
        "15":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Dark Ages",
                "The Hand",
                "The Kingdom",
                "Illusions",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A list of stories to choose from...</span></div></span></div>",
            "created":1225602000,
            "id":603032,
            "title":"List of Stories to choose from"
        },
        "151":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Dark Ages I: Darkness Spreads",
                "Dark Ages II: The New World",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The entire Dark Ages series...</span></div></span></div>",
            "created":1225602000,
            "id":603034,
            "title":"Dark Ages"
        },
        "1511":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Prologue",
                "Chapter I"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The Prologue<br>\r\n<br>\r\n<br>\r\nThe Shadows Universe</span></div></span></div>",
            "created":1226034000,
            "id":605079,
            "title":"Dark Ages I: Darkness Spreads"
        },
        "15111":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "content":"<div class=\"\"><div> <span>In the beggining, Two universal powers existed, Light and Dark. From these two powers life and worlds were created. Light and dark used their power together to create five essential powers, Earth, Fire, Water, Wind, and Phase, called the Hand. Each of these powers were given to a unique race of creature that would depend on the power for survival and if they would lose their power they would surely die. Each of these unique races were declaired a Lord, a power warrior and ruler whose power is almost divine, and a planet for them to rule. For countless centuries the lords lived in a long lasting peace under the two laws given to them by their creators, no Lord shall declare war against another lord and no lord shall kill another lord. This peace was disturbed by Darks lust for evil and started a war with the world of Water which slowly spread to the other worlds. For 21 years, this war waged on with no end until the lords discovered who started the war and decided to end it by making a pact with one another to stop Dark. The lords challenged the Lord of Darkness to a fianl battle against his massive and increadible army on a deserted waistland on his world. The battle lasted 50 days until the Lord of Fire, Lord Incenerate defeated the Lord of Darkness in a fair battle. As Lord Incenerate attempted to take the final strike to end the war, a bright lighted person who was not the Lord of Light, spared the Lord of Darkenss life by casting evey lord back to their respective worlds in the blink of an eye. The Lord of Darkness was spared, but it came at a price. He was stripped of his title lord and powers were sealed to only be used in a life or death situation that is not natural.</span></div></div>",
            "created":1226034000,
            "id":605094,
            "title":"Prologue"
        },
        "15112":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Light",
                "Dark"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which are you?</span></div></span></div>",
            "created":1242341100,
            "id":691187,
            "title":"Chapter I"
        },
        "151122":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "The Boys point of view",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Consumed in a blazing inferno of black flames I yell releasing a burst of energy. My cry of angony dispates and I open my eyes to find myself standing in a crater. Listening to the burning of the near by trees, I look upon this world with no knowledge of who I am. Looking at my right hand I find myself wearing a dark suit of armor with a long dark bladed sword that is strangly light. I feel heat from the sword coursing through my arm to the rest of my body. Glancing down, I notice a young boy standing at the edge of the crater staring at me with a sinister look of hatred in his eyes. The sounds of burning timbers moves from my mind as I look into this boys soul seeing a rage far greater than my own, but yet I suddenly move towards him. My face begins to smile and I swing my sword at the boy knowing he is out of my reach. My arm moves the blade so fast the air itself becomes a blade and cuts into the boys chest. The young boy falls back screaming in pain. I find myself uttering only a single phrase, \"In the name of the King!\" The boys blood quickly surrounds him as he lays helpless on the ground. I hover over him wielding the blade of my lightly weighted sword with bare finger tips over the young boys chest. The boys face is filled with fear, but yet he is prepared to die. I move my hand away and spare his life. Suddenly my body takes the sword and severs the boys head from his body in a single rapid motion. My body did not respond to my commands.</span></div></div>",
            "created":1242341820,
            "id":691195,
            "title":"Dark"
        },
        "1513":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Dark Ages III: The Altered Future",
                "Dark Ages IV: The Shadows Return",
                "More..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The entire Dark Ages series...</span></div></span></div>",
            "created":1225602000,
            "id":603036,
            "title":"more"
        },
        "15133":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Dark Ages V: The Underworld",
                "more..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Dark Ages V: The underworld<br>\r\n<br>\r\nKen has saved the world from destruction but he must now save the underworld from its destruction. He must face all that he has slayed in his quest for an answer to who the Lord of Shadows is...</span></div></span></div>",
            "created":1225602000,
            "id":603037,
            "title":"More..."
        },
        "151332":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Dark Ages VI: The Tournament of Fate",
                "more..."
            ],
            "content":"<div class=\"\"><div> <span>Dark Ages VI: The Tournament of Fate<br>\r\n<br>\r\n<br>\r\nall but six of the thirteen have been defeated and Ken along with four others must defeat the remaining few before it is too late. The warriors have been transported to another world that calls for the strongest people in the universe once every ten thousand years to fight for the title best of the best and the winned shall recieve any one thign their heart desires.</span></div></div>",
            "created":1225602000,
            "id":603038,
            "title":"more..."
        },
        "1513321":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "The Warriors of Hope",
                "Chaos Legacy"
            ],
            "content":"<div class=\"\"><div> <span>Passing through the spiraling vortex of the Forgotten, linking the world of the living with the world of the dead, the remaining Warriors of Hope return to their home land only to find pain and misery as their lands wildly burn with flames darker than the nights sky. The screams of survivors being slaughtered are carred throughout the land on the back of the wind slowly moving over the land. Ken's eyes begin to water as he sees his home land completely devistated and he does not flench as a grave chilling wind climbs up the back of his spine. Burning flesh and ash enter his nostrals giving him an almost nausia feeling that wound make even the strongest stomach give in. The Bandages around his left hand, slowly engulfed by a black flame, disapear with the wind. The water in his eyes begin to evaporate as his body temperature begins to rise. The ground beneath his feet shivers and begins to decend into the earth. The chilling wind becomes warm and begins to spiral around him. Sin places his hand on Ken's left shoulder and everything suddenly comes to a hault. Ken's temperature slowly returns to normal and he turns to face Sin with a look of anger and pain in his red,but they slowly return to their natural sky blue as he begins to smile.</span></div></div>",
            "created":1233637200,
            "id":642383,
            "title":"Chapter I Prologue"
        },
        "1513322":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Dark Ages VII: The Hands of Fate",
                "more..."
            ],
            "content":"<div class=\"\"><div> <span>Dark Ages: The Hands of Fate<br>\r\n<br>\r\nKen has fought his way valiantly through the tower of the fallen and has earned his title as best of the best but what he wants he can not have because Gladiator does nto have that power, but he gives Ken the location of an island that can only be found by those who know where it is and tells him that the hands of fate control a person destiny and it can be altered their but to alter a persons destiny will cause a strain on the the stream of time...</span></div></div>",
            "created":1225602000,
            "id":603039,
            "title":"more..."
        },
        "153":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "The Kingdom: Legend of The One",
                "The Kingdom: Twilight",
                "More..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A series of events all revovling around a central idea...</span></div></span></div>",
            "created":1225861200,
            "id":604203,
            "title":"The Kingdom"
        },
        "1531":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "Full Prologue",
                "Chapter 1"
            ],
            "content":"<div class=\"\"><div> <span>In the early years of mans existance, multiple powers were entrusted to a single man, worthy of nobility. His heart was pure and his abilities were divine. With his heart too trusting, he divided his powers between five men who quickly learned of the full potential of their power, but could not stops it addictivness and started a war. This war eventually consumed the planet until the powers were lost, or so they thought...</span></div></div>",
            "created":1233711540,
            "id":642462,
            "title":"The Kingdom: Legend of The One Prologue"
        },
        "1533":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "The Kingdom: The Trinity",
                "The Kingdom: Elementals",
                "More..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>continued...</span></div></span></div>",
            "created":1225861200,
            "id":604204,
            "title":"More..."
        },
        "15333":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "The Kingdom: The Hand",
                "More..."
            ],
            "content":"<div class=\"\"><div> <span>The Kingdom: The Hand<br>\r\n<br>\r\n<br>\r\nThe story of a yougn man that saves another young man that is secretly the son of a major crime boss and is given a free ride through life by doing this. The young mans father is brutally beaten and killed as the young man graduates high school and follows his fathers footsteps to become a detective so he can find his fathers killer...</span></div></div>",
            "created":1225861200,
            "id":604206,
            "title":"More..."
        },
        "153332":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "The Kingdom: Hour of The Beast",
                "More..."
            ],
            "content":"<div class=\"\"><div> <span>the Kingdom: Hour of The Beast<br>\r\n<br>\r\nA group of sadist are trying to resurrect the devil in humna form, but it will bring about the ending of the world if this is allowed. The Hand is behind this entire event and a faithless man must find his faith in the fainal days of mankind...</span></div></div>",
            "created":1225861200,
            "id":604207,
            "title":"More..."
        },
        "1533322":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "The Kingdom: The Seven",
                "More..."
            ],
            "content":"<div class=\"\"><div> <span>The Kingdom: The Seven<br>\r\n<br>\r\nWhen Lucifer was cast from heaven he saw a new vision of a new world to be created in his own vision but he created it as a parrallel world to the earth and he linked the two togther with a single door. On the other side of this door is countless demons and creatures that are far beyond a single person imagination that know no mercy. 7 angelic warriors were chosen to prevent this door from opening but they were too late, the door was opened and the countless creatures spread darkness throughout the world until the warriors came together and cast all but one of them back into the door. The power of this demon was Lucifer himself and he could not be stopped so a single angelic warrior sacrificed himself to seal the door. he crossed the doorway and the other six warriors closed the door, but the seventh and final key was needed to remove the door from the earth...</span></div></div>",
            "created":1225861200,
            "id":604208,
            "title":"More..."
        },
        "15333222":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "The Kingdom: Eighth Gate: A Last Resort"
            ],
            "content":"<div class=\"\"><div> <span>The Kingdom: <br>\r\nEighth Gate: A Last Resort<br>\r\n<br>\r\nThe door has been removed from the earht but Lucifer planned for this occur so he created his personaly key that is hidden on earth, with this key the door can be recreated and opend without the other keys...</span></div></div>",
            "created":1225861200,
            "id":604210,
            "title":"More..."
        },
        "155":{
            "author_id":"nemnon",
            "author_name":"ICE",
            "choices":[
                "The Wish",
                "Second Chance",
                "Deception"
            ],
            "content":"<div class=\"\"><div> <span>The Wish: you come across a genie that grants you a single wish for freeing him...<br>\r\n<br>\r\nSecond Chance: You think your life is terrible and want a better one. On the night of your 14th birthday, an angel appears and gives you somthing to help you decide on what life would be better for you...<br>\r\n<br>\r\nDeception: A comet passes the planet and a group of high school kids obtain magical powers that they use for their selfish lusts...</span></div></div>",
            "created":1242765840,
            "id":693812,
            "title":"More"
        },
        "1552":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "boy",
                "girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok cool are you a 14 year old...</span></div></span></div>",
            "created":1385036700,
            "id":1697261,
            "title":"Second Chance"
        }
    },
    "info":{
        "author_id":"nemnon",
        "author_name":"ICE",
        "brief_description":"Multpile stories about different twists that will never be seen coming.",
        "created":1209417120,
        "description":"<td align=\"left\" class=\"norm\">I have only these simple rules.<br>\r\n<br>\r\nDo not kill anyone without having a major unexspected twist occuring first.<br>\r\n<br>\r\nDo not have anyone do anything gay unless they swap bodies with the opposite sex.<br>\r\nExample (Boy swaps with girl. He can have sex with a guy)<br>\r\n<br>\r\nEverything else you can do and feel free to express yourselves how ever you feel. Nothing will deleted unless it is very insulting.</td>",
        "id":1419611,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1462349940,
        "modified":1462349940,
        "pretty_title":"Twists"
    }
}