{
    "chapters":{
        "1":{
            "author_id":"pokemonfreek23",
            "author_name":"pkmnguy",
            "choices":[
                "gts",
                "shrink"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First Things First is this a gts story or shrinking story</span></div></span></div>",
            "created":1256619600,
            "id":782285,
            "title":"start"
        },
        "11":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Alexis",
                "Blair",
                "Jasmine",
                "Mindy",
                "Other ladies"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which girl will be the 'huge' star in Duel Academy?</span></div></span></div>",
            "created":1482469200,
            "id":2253611,
            "title":"gts"
        },
        "111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Hungry",
                "Destructive",
                "Horny"
            ],
            "content":"<div class=\"\"><div> <span>One day in Duel Academy, Alexis was doing some studying for an exam tomorrow. That's when a card came out of no where on the bench outside and Alexis picks it up to see it. It began to glow and she feels herself getting bigger. She continues to grow until she's 200 feet tall. Luckily for her, her uniform grew with her otherwise it would be too embarrassing and awkward for the blonde duelist. Alexis looks down on the students that are running away from her and feels the amount of power she possessed now. She smirked as she wants to enjoy the opportunity to have some fun time.<br>\r\n<br>\r\n\"This is gonna be very, very amusing.\" Alexis thought slyly.<br>\r\n<br>\r\nShe wondered on what to do first as she feels</span></div></div>",
            "created":1482469200,
            "id":2253646,
            "title":"Goddess Alexis's time is now!"
        },
        "1111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Step on him",
                "Stuff him in her panties",
                "Squish him in her breasts"
            ],
            "content":"<div class=\"\"><div> <span>Alexis actually feels a bit starving right now. So, she go to the male Ra dorms and she picked one up. She dropped him in her mouth and begins eating him. Alexis swallowed him and she can feel him moving around in her stomach. She picked up five more and ate them too.<br>\r\n<br>\r\n\"Hmm. Let's try the Obelisk boys dorms. They might be pretty tasty.\" Alexis thought with hunger.<br>\r\n<br>\r\nShe goes to the boys Obelisk Blue dorm rooms and she picked up one of them at a time. She has six of them in her hand and she dropped them in her mouth. She savored the taste of the boys before swallowing them whole. Alexis rubbed her stomach as she feels the tiny boys hitting the walls before about to be digested.<br>\r\n<br>\r\n\"They sure were delicious. Now I don't feel hungry anymore. Let's see what else I can do.\" Alexis thought.<br>\r\n<br>\r\nAlexis reaches into the dorm room building and grabbed another boy. She then decided to</span></div></div>",
            "created":1482469200,
            "id":2253656,
            "title":"Hungry"
        },
        "11112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Atticus",
                "Chazz"
            ],
            "content":"<div class=\"\"><div> <span>Alexis lifts up her blue uniform skirt and she pulled out her blue stripped panties before dropping the Obelisk boy inside. She closed her panties with a loud snap and she was feeling excited and pleased by the actions that he's doing by her vagina.<br>\r\n<br>\r\n\"That feels so good! You're really doing such a great job down there. You know what? I'm gonna look around and get some more people to put in my panties.\" Alexis said sexually.<br>\r\n<br>\r\nAlexis then goes to the Obelisk girls dorms and she reaches to grab about 4 of the girls. She opens her panties and dropped the girls inside before closing her panties shut. Alexis moaned as her sexual desires just increased by the movements of her captives.<br>\r\n<br>\r\n\"That's even Better! Still not enough, though. I'm gonna need more.\" Alexis thought.<br>\r\n<br>\r\nShe goes to the Slifer dorms and she grabs about 7 of the students in there. Alexis drops them in her panties and feels like it's good enough.<br>\r\n<br>\r\n\"That should do it. Now, how about I mess around with</span></div></div>",
            "created":1482469200,
            "id":2253783,
            "title":"Helping the Queen's needs"
        },
        "1112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Destroys more buildings",
                "Plays with the people",
                "Grows more"
            ],
            "content":"<div class=\"\"><div> <span>Alexis goes around and starts smashing and stomping on dorms. She even turns around and sits on the boy's dorm. She looks around to see her destructive handy work and likes it.<br>\r\n<br>\r\n\"That was quite fun. Now what do I do?\" Alexis thought.<br>\r\n<br>\r\nThen suddenly, the card she found starts glowing again and Alexis was then transported to a city far off from the academy. She looks around and sees the citizens running from her once they saw her.<br>\r\n<br>\r\n\"Maybe, I should enjoy myself here.\" Alexis thought with a smirk.<br>\r\n<br>\r\nShe then</span></div></div>",
            "created":1490072400,
            "id":2293153,
            "title":"Destructive"
        },
        "11122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Boot",
                "Bra"
            ],
            "content":"<div class=\"\"><div> <span>Alexis decided to play around with these people before her as she bends down and grabs a few in her hand before bringing them to her face.<br>\r\n<br>\r\n\"I want to have some fun with you guys and I know just what to do with you all.\" Alexis said.<br>\r\n<br>\r\nShe needs then puts the people in her</span></div></div>",
            "created":1490072400,
            "id":2293159,
            "title":"Plays with the people"
        },
        "111221":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "does something else",
                "grew even bigger"
            ],
            "content":"<div class=\"\"><div> <span>Alexis takes off one of her boots and drops the people inside. She then puts them on and giggles as she feels them underneath the sole of her foot. She then takes off her other boot and puts more people in it before putting it back on. She was having fun and</span></div></div>",
            "created":1508130000,
            "id":2402349,
            "title":"Boot"
        },
        "1112211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "crushing things",
                "picking people up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alexis decided to think of another way to have fun. So, she gets up and she starts</span></div></span></div>",
            "created":1508821200,
            "id":2405852,
            "title":"does something else"
        },
        "11122112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "cleavage",
                "panties"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alexis picks up more people in her hand and wondered on what she'll do with them. That's when she decided to drop them in her</span></div></span></div>",
            "created":1508821200,
            "id":2405853,
            "title":"picking people up"
        },
        "111221122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "front",
                "back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>front or back?</span></div></span></div>",
            "created":1512536400,
            "id":2424668,
            "title":"panties"
        },
        "1112211221":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "put more in there",
                "eat people. She's hungry"
            ],
            "content":"<div class=\"\"><div> <span>Alexis smiles in a arousing way as she lifts up her blue uniform skirt to reveal her wearing her blue-stripped panties and pulls on the front side of the elastic. She then dropped everyone in her hand inside her panties before she let go of the elastic, trapping them right next to her vagina. Alexis then felt them thrashing around against her pussy and was feeling so exotic. She then.decided to</span></div></div>",
            "created":1512536400,
            "id":2424678,
            "title":"front"
        },
        "11122112211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Goes to find something to eat",
                "Puts things in her ass",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Alexis moves around town and she finds a huge group of people beneath her. She bends down and grabbed the little people in her hand and she smiled as she pulls out her panties before she dropped everybody inside. She let her panties snap back into place and she giggled as she felt them squirming more against her pussy.<br>\r\n<br>\r\n“I love putting you little tiny people down in my panties. I think there’s room for a few more.” Alexis said.<br>\r\n<br>\r\nShe then grabbed a bunch more people and stickes them into her panties until it’s completely full. She smiled proudly as she looked down at the bulges of the people in her panties before she gently patted on it.<br>\r\n<br>\r\n“I’ve gotten like half of this city’s citizens in my underwear. You people will do just fine in there. I’m gonna keep you in there until you have no more uses to me.” Alexis said as she now</span></div></div>",
            "created":1525496400,
            "id":2488610,
            "title":"put more in there"
        },
        "111222":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Get more people to play with",
                "Grows much bigger"
            ],
            "content":"<div class=\"\"><div> <span>Alexis unbuttoned her top and pulls on one of her bra cups before she drops the people in it. She places her bra back on and she feels them hitting against her nipple that's giving her a turn on.<br>\r\n<br>\r\n\"You people feel so good in my bra. I'm gonna get more for my other bra cup.\" Alexis suggested.<br>\r\n<br>\r\nAlexis reaches in to grab more people to put them in her other bra cup and enjoys the feeling of the people moving around in her bra. She puts her top back on and</span></div></div>",
            "created":1490072400,
            "id":2293164,
            "title":"Bra"
        },
        "1112221":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "In her mouth",
                "In her panties"
            ],
            "content":"<div class=\"\"><div> <span>Her fun with these people that's way smaller than her is not over as she goes to grab more people to bring them to her huge face.<br>\r\n<br>\r\n\"Let's see how much fun I can get from you guys.\" Alexis said.<br>\r\n<br>\r\nShe then drops the people</span></div></div>",
            "created":1490072400,
            "id":2293168,
            "title":"Get more people to play with"
        },
        "11122212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Gets more sex toys",
                "Eats them"
            ],
            "content":"<div class=\"\"><div> <span>Alexis lifts up her skirt and pulls on the waistband of her panties before she drops the people inside next to her vagina. She let go of her panties and she starts to moan in pleasure as she feels the people squirming against her vagina.<br>\r\n<br>\r\n\"Oh yes! That feels so good! Keep squirming for me!\" Alexis moans.<br>\r\n<br>\r\nShe looks down at the people below her and she</span></div></div>",
            "created":1490158800,
            "id":2293294,
            "title":"In her panties"
        },
        "111222122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "1000 feet tall",
                "5000 feet tall"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm starting to get a little hungry. Perhaps, you guys can fill me up a bit.\" Alexis said with hunger.<br>\r\n<br>\r\nShe reaches out and grabbed more people before she tosses them into her mouth. She uses her tongue to play with them before she tilted her head back and swallowed the people whole. Alexis giggled as she feels the people moving and hitting against her stomach before she starts eating more until she was full.<br>\r\n<br>\r\n\"You guys were so tasty. Looks like this place is quite empty. Oh well.\" Alexis said.<br>\r\n<br>\r\nShe gets up and smashes the city down until she destroyed everything. Alexis then starts growing again until she's</span></div></div>",
            "created":1490158800,
            "id":2293307,
            "title":"Eats them"
        },
        "1112221221":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Foot slaves",
                "Sex toys"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alexis stops growing when she's now 1000 feet tall. She then goes to another city and starts playing with the new set of people. She grabbed a couple and brings them to her face.<br>\r\n<br>\r\n\"You people are so cute. Now, I have some new</span></div></span></div>",
            "created":1490158800,
            "id":2293311,
            "title":"1000 feet tall"
        },
        "11122212211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "eat something",
                "break stuff"
            ],
            "content":"<div class=\"\"><div> <span>Alexis takes off one of her boots and places the people inside. She then puts it back on so that she can feel their movements against her toes.<br>\r\n<br>\r\n\"Hope you like my sweaty toes, everyone. Make sure you all massage them for me.\" Alexis ordered.<br>\r\n<br>\r\nShe then goes to</span></div></div>",
            "created":1494133200,
            "id":2315896,
            "title":"Foot slaves"
        },
        "111222122112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "begins to eat",
                "the army arrives"
            ],
            "content":"<div class=\"\"><div> <span>Alexis wanders around the city and she feels like breaking things around her. She starts off by stepping hard on some cars and enjoys the sound of crushed metal underneath her boots. She then go towards some buildings and pressed her breasts together to squished them flat. She finishes things off by turning around to have her ass facing a building underneath her and lifts up her skirt to show off her sexy butt in her panties before she sits on the building and completely crushed it down. Alexis looks down and sees a woman that survived the impact before she picked her up and brings her to her huge face.<br>\r\n<br>\r\n\"Well, little lady, as a reward for surving the crush, you get to join with others in my underwear.\" Alexis said with a little bit of lust.<br>\r\n<br>\r\nAlexis pulls on the elastic of her panties and drops the woman inside with everyone else next to her vagina. She closes her panties and pats on her crotch before she gets back up and</span></div></div>",
            "created":1495170000,
            "id":2322274,
            "title":"break stuff"
        },
        "1112221221122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "grows more",
                "has to fart"
            ],
            "content":"<div class=\"\"><div> <span>Alexis felt something hitting her from behind and she turns to see the military coming in on her and firing at her. Though, the shots she's getting isn't really making much of a mark on her and she just looked on to their weak attacks on her.<br>\r\n<br>\r\n\"Is this really the best you guys got?\" Alexis asked in a less interest tone.<br>\r\n<br>\r\nThe guns, tanks and planes were all trying hard to take her down, but it doesn't seem to be working and they halted their attack.<br>\r\n<br>\r\n\"My turn.\"<br>\r\n<br>\r\nIt was all Alexis said before she took her foot and kicked the tanks and soldiers sky high. She even knocked down tge planes and watched them crash and burn. She looks back down at the remaining soldiers below her before she turns around and just sits right on top of them. Alexis grinds her butt before she gets up and looks at her handy work. She sees some of the soldiers that are still alive and she grabs them to bring them up to her.<br>\r\n<br>\r\n\"Looks like you boys lost this battle. Now, let's play a game. I'm gonna eat you guys because I'm getting a bit hungry now. However, whoever's the last man I didn't eat will get a special prize.\" Alexis said.<br>\r\n<br>\r\nShe picks one soldier at a time and she begins to put them in her mouth one by one. She savored the taste of each soldier she puts in her mouth before she swallows him whole and goes on to the next. She now sees the last remaining soldier that's on her palm who has no idea what she'll do to him.<br>\r\n<br>\r\n\"Congratulations, little man! You're the last one standing. Time for you to receive your prize.\" Alexis said.<br>\r\n<br>\r\nShe lifts up the back of her skirt and pulls on her panties from behind her. She turns around and drops the soldier in between her buttcheeks. She let go of her panties and just enjoy the movement that the soldier is doing in her ass.<br>\r\n<br>\r\n\"Aren't you a lucky boy. All nice and cozy in my sexy butt. Well, you're gonna be in there for a while. So, enjoy my butt as long as you want to.\" Alexis said patting her butt.<br>\r\n<br>\r\nThe fun Alexis is having is so good to her that she might not want to stop at all. Now, she</span></div></div>",
            "created":1495170000,
            "id":2322370,
            "title":"Alexis vs the army"
        },
        "11122212211221":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "rub my feet. They're sore",
                "find me some food. I'm hungry"
            ],
            "content":"<div class=\"\"><div> <span>Alexis decides to use her power to grow even more. She continues to grow until she's about 2500 feet tall. She sees that everything around her is ant-sized and goes to have more fun.<br>\r\n<br>\r\n\"This is so amazing. I feel like a true goddess at this height.\" Alexis said.<br>\r\n<br>\r\nShe feels a little tired and just sit down for a bit while everyone else watches her.<br>\r\n<br>\r\n\"Alright, my servents. I want you to</span></div></div>",
            "created":1496034000,
            "id":2327652,
            "title":"grows more"
        },
        "111222122112211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "liked it and drops them in her boots",
                "doesn't liked it and stomps them flat"
            ],
            "content":"<div class=\"\"><div> <span>Alexis takes off her boots and set her huge feet in front of the people.<br>\r\n<br>\r\n\"Better start rubbing my feet, slaves.\" Alexis said.<br>\r\n<br>\r\nThey don't want to make her angry as they start to rub on the soles and toes of Alexis's feet. She lays back and just let them rub on her feet. Later, Alexis</span></div></div>",
            "created":1496034000,
            "id":2327658,
            "title":"Goddess Alexis's Feet Massage"
        },
        "1112221221122111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "feels horny",
                "starts crushing things with her butt"
            ],
            "content":"<div class=\"\"><div> <span>\"You all did very good. I think I should keep you guys and I know just the place.\" Alexis said.<br>\r\n<br>\r\nShe grabbed a bunch of people and grabbed her boot before dropping them all in it. She grabbed the other boot and put other people in it too before she puts them both on. She can feel them moving in her boots and enjoys the feeling of them squirming on her feet.<br>\r\n<br>\r\n\"There you go. Make yourselves at home with feet because you might be in there for a long time.\" Alexis said.<br>\r\n<br>\r\nWith that done, Alexis then</span></div></div>",
            "created":1496034000,
            "id":2327662,
            "title":"liked it and drops them in her boots"
        },
        "11122212211221111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "stuffs more people in her panties",
                "starts filling up her bra with more people"
            ],
            "content":"<div class=\"\"><div> <span>Alexis starts to get a sexual feeling inside of her and goes around for something to take care of that for her.<br>\r\n<br>\r\n\"It's time to help your goddess with her \"personal desires\". Let's see who the lucky ones are.\" Alexis said.<br>\r\n<br>\r\nShe looks around and grabbed a lot of people in her humongous hand to bring to them to her face.<br>\r\n<br>\r\n\"Looks like you guys are the winners here. Time to please your goddess now.\" Alexis said.<br>\r\n<br>\r\nAlexis lifts up her skirt and pulls out on the front end of her panties before she drops them in with the rest of the people she had collected in there against her pussy. She let go of her panties with a snap and giggles in delight of them moving in her panties.<br>\r\n<br>\r\n\"Oooh. Oh yes. That feels so good. You people are squirming so much in there. Just the way I like it.\" Alexis said patting on her crotch.<br>\r\n<br>\r\nWith that done, Alexis</span></div></div>",
            "created":1496120400,
            "id":2327973,
            "title":"feels horny"
        },
        "111222122112211111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "grows even bigger",
                "finds some people to be her slaves"
            ],
            "content":"<div class=\"\"><div> <span>\"I don't think you guys are enough to please me. I'm gonna need more.\" Alexis said.<br>\r\n<br>\r\nAlexis goes to a nearby building and finds a bunch of people she could use. She ripped the roof right off and tosses it away before she reached into the building and grabbed a man in her hand.<br>\r\n<br>\r\n\"Hmm. You're not really good looking enough. Oh well. You'll be good for something.\" Alexis said.<br>\r\n<br>\r\nShe opened her mouth and tossed the man inside before closing her mouth and shallows the man down her throat and into her stomach. She then reached back into the building and grabs another man and a woman in her hand.<br>\r\n<br>\r\n\"Oh yeah. You two will do just fine.\" Alexis said with a smile.<br>\r\n<br>\r\nShe lifts up her skirt and pulls on her panties again before dropping the two people inside with the others and closing her panties shut. She feels them moving around against her vagina and Alexis starts moaning with pleasure.<br>\r\n<br>\r\n\"Wow! Your struggling is making me feel so good. Oh yes. Right there.\" Alexis moaned.<br>\r\n<br>\r\nShe then decided to shake things up a bit as she goes to another tall building and grinds her crotch on the windows. All of the amusing pleasure she's getting has her cross her legs and crushing the building with her thighs.<br>\r\n<br>\r\n\"I'm not ready to cum just yet. I still want more.\" Alexis said.<br>\r\n<br>\r\nShe then sees a park full of people and she picked up a lot of them in her hand before she pulls on her panties, once again, and shoves them in with everyone else against her now wet pussy. Alexis let the waistband go with a snap and she moans again as the people squirming in her underwear has her need of pleasure to rise up more.<br>\r\n<br>\r\n\"Oooooohhhhhhh yyyyyyyyeeeeeeeeeeeeeesssssss! Squirm faster! I'm getting ready to cum very soon!\" Alexis moaned as she rubs her crotch through her panties.<br>\r\n<br>\r\nA few minutes later, Alexis orgasmed and her panties got very wet along with the people inside of it. She took a few moments to regain her breathing and adjust herself while she uses her hand rub on her panty-covered wet vagina.<br>\r\n<br>\r\n\"That was so amazing. Who knew that having people squirm around in your underwear can give you such a turn on? Whatever the case, I think I just found your new calling in your lives. Sexually pleasing your goddess. Now, I'm gonna go do something else that's fun. I'll let you guys know if I want you to please my pussy. Who knows? Maybe I'll find some more people to join you in my panties. Until then, good luck in your new home.\" Alexis said patting on her wet pushy.<br>\r\n<br>\r\nAlexis then moves on to another town as she</span></div></div>",
            "created":1499835600,
            "id":2352290,
            "title":"The sexual fun continues"
        },
        "1112221221122111112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "giving me a full body massage",
                "get me some food and drinks"
            ],
            "content":"<div class=\"\"><div> <span>\"Phew! That sex really had me going. I'm getting pretty tired. Maybe I should get some slaves to serve me while I rest.\" Alexis thought.<br>\r\n<br>\r\nShe goes and finds the perfect spot to rest and gathers up a few people to take with her. Alexis sets them down before giving them instructions.<br>\r\n<br>\r\n\"Okay, everyone. From this day forward, you're all my slaves. You have to do what I say and if you don't, well, let's just say that the punishment won't be very merciful. Now then, let's start by</span></div></div>",
            "created":1499922000,
            "id":2352505,
            "title":"finds some people to be her slaves"
        },
        "11122212211221111121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "giving them some kisses",
                "carrying them in her cleavage"
            ],
            "content":"<div class=\"\"><div> <span>Not wanting to piss the giant blonde dueling student off, everyone climbed on her body as Alexis was laying on her stomach. They begin to rub on every part of her body, except her still wet vagina.<br>\r\n<br>\r\n\"Sorry, but not there. That's for the very good slaves to go to.\" Alexis said.<br>\r\n<br>\r\nAlexis sighed in relaxation as she enjoys the rubbing on her body by everyone on her. She decided to reward them for a good job by</span></div></div>",
            "created":1499922000,
            "id":2352531,
            "title":"giving me a full body massage"
        },
        "111222122112211111212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "give her a meal",
                "worship her"
            ],
            "content":"<div class=\"\"><div> <span>Alexis then, gently, grabbed some people and opens her top to put then in her cleavage. Once she did that, Alexis gives her breasts some gentle jiggles to have her slave enjoy the softness of her boobs.<br>\r\n<br>\r\n\"Do you guys like that? Hope you are.\" Alexis said softly.<br>\r\n<br>\r\nShe then buttoned up her top to have the people trap in her cleavage.<br>\r\n<br>\r\n\"There you go. Now, you're all nice and safe in my breasts. Bet that's where you wanted to be in, anyways.\" Alexis teased.<br>\r\n<br>\r\nShe turns her attention to her other slaves and orders them to</span></div></div>",
            "created":1499922000,
            "id":2352537,
            "title":"carrying them in her cleavage"
        },
        "1112221221122111112121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Get more food",
                "Foot massage"
            ],
            "content":"<div class=\"\"><div> <span>\"Boy. I'm getting hungry right now. See if you guys can find me a nice meal. Okay? Don't want to to disappoint your goddess.\" Alexis said.<br>\r\n<br>\r\nWith little to no choice, everyone went to the stores that are still around and the picked up some food that Alexis will enjoy. They bringed them all over to her and Alexis likes the food they offered to her. She picks the food up and she tosses them in her mouth. She chews and chews until she swallowed the meal down her throat and into her stomach.<br>\r\n<br>\r\n\"That was tasty. What should I have you guys do now?\"</span></div></div>",
            "created":1505970000,
            "id":2388932,
            "title":"A buffet fit for a queen"
        },
        "11122212211221111121211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "ate all of the food",
                "eats the food, but saved some for everyone else"
            ],
            "content":"<div class=\"\"><div> <span>*Grumble*<br>\r\n<br>\r\n\"Hmm. Guess I'm still hungry. Is there another place I can go to to get some more food?\" Alexis wondered.<br>\r\n<br>\r\n\"There's a food market down South.\" A citizen said.<br>\r\n<br>\r\n\"Thank you. I'll be going now.\" Alexis said before getting up and head straight to the food market.<br>\r\n<br>\r\nAlexis makes it there and sees the food that looks very tasty to her. She then</span></div></div>",
            "created":1508130000,
            "id":2402338,
            "title":"Get more food"
        },
        "11122212211221111121212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "bra by her nipples",
                "panties by her vagina"
            ],
            "content":"<div class=\"\"><div> <span>Alexis takes off her boots to reveal her feet and sits down to set her feet up towards the people.<br>\r\n<br>\r\n\"I could really used a foot massage. Go on and rub them for me.\" Alexis ordered.<br>\r\n<br>\r\nEveryone goes up to her big feet and they rub down on the soles while other climbed up and rub in between her toes. Alexis was feeling so relaxed while she sits back and digest her food. After a while of rubbing, her feet were massaged so well and she tolds everyone to stop. She was getting that horny feeling again and she orders to get inside her</span></div></div>",
            "created":1505970000,
            "id":2388936,
            "title":"Foot massage"
        },
        "11122212211221112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "eat some food markets",
                "drink water out of a clean lake"
            ],
            "content":"<div class=\"\"><div> <span>Alexis decides to makes this more fun for her as she turns around and show off her blue-stripped panty-clad butt towards the people beneath her, who are hypnotized by amusement to even consider to run away.<br>\r\n<br>\r\n\"You guys like my sexy butt in these panties? Well, how about a closer look?\" Alexis suggested as she wiggles her butt in a teasing manner.<br>\r\n<br>\r\nShe then lowers herself down and plants her butt on the ground and crushed the people beneath her. She may have also squashed the soldiers that are in the back of her panties, but she doesn't care. Alexis grinds her butt on the ground and gets up to see her handy work done.<br>\r\n<br>\r\n\"That was fun. Let's see what else I can sit on.\" Alexis thought to herself.<br>\r\n<br>\r\nAlexis goes to a house and sits right on top of it. Luckily, there wasn't anyone home or else they would be dead. She then goes to a tall building next and decides to give the people inside a show. She had her butt facing the building and she grinds on the windows as if she was twerking before pressing on the roof and completely demolished the whole building with her butt. She then sat on a few cars before being done with the butt-crushing and goes on to</span></div></div>",
            "created":1499835600,
            "id":2352269,
            "title":"The Queen's Butt-Crushing Time"
        },
        "11123":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "1000 feet",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How bigger did Alexis get?</span></div></span></div>",
            "created":1508130000,
            "id":2402350,
            "title":"Grows more"
        },
        "111232":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "5000 feet",
                "even bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How much more bigger</span></div></span></div>",
            "created":1508130000,
            "id":2402351,
            "title":"More"
        },
        "1112321":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "slaves",
                "toys"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alexis starts growing again until she's about 5000 feet tall. She feels so powerful like this and she decided to get some</span></div></span></div>",
            "created":1508130000,
            "id":2402354,
            "title":"5000 feet"
        },
        "11123211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "in her boots",
                "in her panties"
            ],
            "content":"<div class=\"\"><div> <span>Alexis looks down at the people that are running from her beneath her and she bends down to grab them in her hand before they could run far from her. Alexis then brings them all up to her face.<br>\r\n<br>\r\n\"Guess what, everyone? You're all my slaves now and I'm gonna put you all somewhere where slaves like you belong.\" Alexis said.<br>\r\n<br>\r\nShe then dropped everyone.</span></div></div>",
            "created":1508130000,
            "id":2402367,
            "title":"slaves"
        },
        "111232112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Back",
                "Front"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which end?</span></div></span></div>",
            "created":1508821200,
            "id":2405844,
            "title":"in her panties"
        },
        "1112321122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "stuff more things in her panties",
                "do something else"
            ],
            "content":"<div class=\"\"><div> <span>Alexis lifts up her skirt and streches out her light blue panties before she drops everyone inside against her vagina. She let go of the elastic and she smiles with delight as she feels them squirming around against her crotch. She also noticed that she's getting a big turn on by what she just did and she likes it.<br>\r\n<br>\r\n\"You guys are really getting me excited down there. I think I've discovered my favorite thing to do. Stuffing little people like you in my underwear right by my crotch. I should do more of this. In the meantime, you all stay in there.\" Alexis said while patting on her vagina through the outside of her panties.<br>\r\n<br>\r\nAlexis then goes off to</span></div></div>",
            "created":1508821200,
            "id":2405865,
            "title":"Alexis's favorite fetish"
        },
        "11123211221":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "starts growing again (reserved)",
                "switches to another activity"
            ],
            "content":"<div class=\"\"><div> <span>Alexis finds more people below and she picks them all up in her hand before she streaches out her panties and drops them inside with the others. Alexis closes her panties shut and giggled while feeling the people she's collected so far squirming against her vagina.<br>\r\n<br>\r\n\"Oh yes! I love putting little people in my panties. This is so exotic.\" Alexis said with excitement before she</span></div></div>",
            "created":1509339600,
            "id":2408801,
            "title":"stuff more things in her panties"
        },
        "111232112211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Alexis's panty-stuffing fun continues (reserved)",
                "Alexis decided to have some other kind of fun"
            ],
            "content":"<div class=\"\"><div> <span>Alexis begins to grow again until she's about 5000 feet tall. Alexis looks on and enjoys the new view she's seeing from above. That's when she grew horny at the idea she just got now.<br>\r\n<br>\r\n\"I'm bigger now. That means there's plenty more room in my underwear for you little people.\" Alexis said with an arousing smile on her face.<br>\r\n<br>\r\nAlexis then grabs another crowd in her hand and she drops them into her panties with everyone else. Alexis gets more and more turned on with every person she placed inside her light blue underwear. Not to mention, the squirming they're making against her vagina. She just moans and moans quite a lot and wished to keep up with her fun.</span></div></div>",
            "created":1509339600,
            "id":2408853,
            "title":"starts growing again (reserved)"
        },
        "1112321122111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "wants to cum",
                "fills up her bra next"
            ],
            "content":"<div class=\"\"><div> <span>Alexis grabs more people in her hand and she stretches out her panties again to place them inside before she let go of the elastic. Alexis smiles with delight as she feels her vagina being touched by the people in her panties.<br>\r\n<br>\r\n\"Oh yes! I want more! I need to be pleased!\" Alexis moaned a bit.<br>\r\n<br>\r\nAlexis reaches in and manages to grab one last large group of people before she brings them all to her.<br>\r\n<br>\r\n\"From here on out, you're all my servants for sex and this will be your new home.\" Alexis said while stretching out her panties, once again.<br>\r\n<br>\r\nShe tilted her hand and drops everyone inside before letting the elastic go. Alexis sees a big bulge in her panties and she can guess that means that her underwear is nice and full.<br>\r\n<br>\r\n\"My panties is full of you guys down there. Enjoy your new lives.\" Alexis said before patting on her panties.<br>\r\n<br>\r\nAlexis then</span></div></div>",
            "created":1509339600,
            "id":2409022,
            "title":"Alexis's panty-stuffing fun continues"
        },
        "11123211221111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "foot slaves",
                "ass slaves"
            ],
            "content":"<div class=\"\"><div> <span>Alexis wants to get some sexual release as she orders the people she has collected in her panties to make her cum. She sees the bulge in her light blue underwear moving around and she giggles and moans at the movements everyone is making against het vagina. After a while, Alexis finally cums and her juices exploded from her pussy. The jucies have most of the people drown in it while others survived, but feeling sticky. She then removes those who died from her panties and ate them all while she keeps those who are still alive inside. She loves how her juices taste with the people she devoured and wishes to do more of that later.<br>\r\n<br>\r\n\"Delicious. You guys were amazing. I hope we can do that again. Maybe, I'll make the bulge in my underwear even bigger. For now, let's see what else I've got in-store for you all.\" Alexis said while patting on her panties before she heads out.<br>\r\n<br>\r\nShe makes to another city nearby and she wants to make them her</span></div></div>",
            "created":1509339600,
            "id":2409104,
            "title":"wants to cum"
        },
        "111232112211112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "farted on them",
                "crushed them"
            ],
            "content":"<div class=\"\"><div> <span>Alexis hikes up her skirt and sits down without killing anyone below her.<br>\r\n<br>\r\n\"My butt could really used some service from you guys. Come on. You know you want to.\" Alexis said showing off her butt in a teasing manner.<br>\r\n<br>\r\nWith no other option, everyone climbs up what's like a mountain to them and they all started to worship her ass. Alexis likss this sort of treatment as she savors their servitude to her. She then</span></div></div>",
            "created":1509339600,
            "id":2409110,
            "title":"ass slaves"
        },
        "1112321122111121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "starts to feel horny again",
                "starts growing again"
            ],
            "content":"<div class=\"\"><div> <span>Alexis felt gas building up and she unleashed a gigantic fart that blown the people and the entire city away like a nuclear explosion. She gets up and looks on at what she just did.<br>\r\n<br>\r\n\"Whew! I'll tell you all one thing, I don't think everyone wants to come here anytime soon. Oh well. Your lost.\" Alexis said before she</span></div></div>",
            "created":1509339600,
            "id":2409111,
            "title":"farted on them"
        },
        "11123211221111211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "there's plenty of people",
                "there's not enough people"
            ],
            "content":"<div class=\"\"><div> <span>Alexis felt herself getting that arousing feeling inside her again. She doesn't want to waste any time as she heads on out towards the next city. She sees the people beneath her and she grabbed a bunch in her hand.<br>\r\n<br>\r\n\"Guess what, ladies and gentlemen? It's time for you all to be part of your new lives. Being my new little sex servants.\" Alexis said with an exotic look on her face.<br>\r\n<br>\r\nOnce again, she lifts up her skirt and streched out her panties before dropping everyone inside against her vagina. She released the waistband and she giggled at their movements.<br>\r\n<br>\r\n\"I'm such a horny giantess, aren't I? Me stuffing you little people inside my panties where you people belong and will more of you are going to be in. That's because it's your new home. Now then, let's see if I cam get more.\" Alexis said as she sees that</span></div></div>",
            "created":1509858000,
            "id":2411338,
            "title":"starts to feel horny again"
        },
        "1112321122112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "crush everything",
                "eat the people"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alexis decided to stop it for now and tries something else to amuse herself with. She then goes on to</span></div></span></div>",
            "created":1509339600,
            "id":2408857,
            "title":"Alexis decided to have some other kind of fun"
        },
        "11123211221121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "enslave them",
                "fart on them"
            ],
            "content":"<div class=\"\"><div> <span>Alexis can't wait to squish and crush everything she desires. She starts off by lifting up her boot-covered foot and stomps on a building like a broken toy. She continues to stomp and flattened on anything she could think of with no hesitation. That's when she changed things up a bit. Alexis turns around and hikes up her skirt show her plump, round, juicy, and sexy butt in those panties. She then lowers herself down and sits on anything that her butt can crush like an asteroid. Alexis smiles as she hears the crushing sound of the buildings and other stuff underneath her weight. She then starts bouncing her butt up and down in a twerking way and it causes her surroundings to shake as if a huge earthquake was hitting the area. She was done and she gets up to see the damage she has done. Everything she sees was flatten more than a pancake. Alexis then leaves the area and goes to another city that is just nearby from where she is now. Alexis just wonders what she'll do to them as well.</span></div></div>",
            "created":1509339600,
            "id":2409017,
            "title":"crush everything"
        },
        "111232112212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "tired",
                "hungry"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alexis decided to try another activity for her amusement. So, she goes into the city and starts crushing cars with her feet and destroy buildings with her breasts and her butt. It was so much fun for her as she's now feeling</span></div></span></div>",
            "created":1510635600,
            "id":2415180,
            "title":"switches to another activity"
        },
        "113":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "100 feet",
                "250 feet",
                "500 feet"
            ],
            "content":"<div class=\"\"><div> <span>One day, Jasmine was just finishing up her dueling exam and was gonna head back to her dorm. She then finds a strange card on the ground. Jasmine picks it up and she was feeling a bit different. Jasmine starts growing in size. She continues to grow until she's</span></div></div>",
            "created":1509426000,
            "id":2409146,
            "title":"Jasmine"
        },
        "1133":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "puts them in her cleavage",
                "shoves them in her panties",
                "drops them in her boots"
            ],
            "content":"<div class=\"\"><div> <span>Jasmine grew to about 500 feet tall. Not to mention, finds herself teleported to a random city. The people below her looked so small to her and she likes it. Jasmine gathered up as much as she could in her hand and brings them to her.<br>\r\n<br>\r\n\"You're all so cute. Like little toys.\" Jasmine said.<br>\r\n<br>\r\nWith that said, Jasmine</span></div></div>",
            "created":1509426000,
            "id":2409151,
            "title":"500 feet"
        },
        "11331":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "crush more things with her cleavage",
                "stuff up her bra"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jasmine unbuttons her uniforn top and drops the people inside her cleavage. She giggles as she feels them wiggling around in between her cleavage. She then squeezed her breasts together and crushes everyone. She then goes on to</span></div></span></div>",
            "created":1509426000,
            "id":2409474,
            "title":"puts them in her cleavage"
        },
        "113312":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "panties",
                "boots"
            ],
            "content":"<div class=\"\"><div> <span>Jasmine grabbed more people and she puts them inside her bra cups. She giggled st the feeling of the people moving around in her bra against her nipple. She puts more and more people in each of her bra cups until her bra is completely full.<br>\r\n<br>\r\n\"You guys feel good inside my bra. I wonder where else I can keep you guys in.\" Jasmine said.<br>\r\n<br>\r\nJasmine thinks about putting other people in her</span></div></div>",
            "created":1509426000,
            "id":2409477,
            "title":"stuff up her bra"
        },
        "1133121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Back",
                "Front"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a side</span></div></span></div>",
            "created":1513227600,
            "id":2428129,
            "title":"panties"
        },
        "11331212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "get more people into her panties",
                "tries another way of fun"
            ],
            "content":"<div class=\"\"><div> <span>Jasmine bends down to pick up more people in her hand before she lifts up her skirt and streches out the front of her red panties to show everyone what she has in mind for them.<br>\r\n<br>\r\n\"You see that, everyone? That's where you all are gonna go into and you're gonna squirm next to my pussy to give me lots of pleasure. So, get to it.\" Jasmine said.<br>\r\n<br>\r\nShe lowers the people in her hand down to her waist and she dropped everyone inside her panties. She let go of the elastic and she was feeling exotic as she feels them squirming against her vagina like she wanted.<br>\r\n<br>\r\n\"That feels so good. You guys keep on doing that.\" Jasmine said as she goes to</span></div></div>",
            "created":1514178000,
            "id":2432531,
            "title":"Front"
        },
        "11332":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "vagina",
                "butt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jasmine hikes up her uniform skirt and streches out the elastic of her white panties right next to her</span></div></span></div>",
            "created":1509426000,
            "id":2409152,
            "title":"shoves them in her panties"
        },
        "113321":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "wants to grow bigger",
                "begins crushing things"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jasmine pulls out the waistband and drops the people inside her panties where her vagina is. Jasmine let go of the elastic and she was enjoying the movements the people are making against her crotch. That's when she</span></div></span></div>",
            "created":1509426000,
            "id":2409153,
            "title":"vagina"
        },
        "1133211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "1,000 feet tall",
                "5,000 feet tall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jasmine begins to grow even bigger. She grew and grew until she's about</span></div></span></div>",
            "created":1509426000,
            "id":2409154,
            "title":"wants to grow bigger"
        },
        "11332112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "eat you people",
                "crush these little buildings"
            ],
            "content":"<div class=\"\"><div> <span>Jasmine has her height reached to about 5000 feet tall. She was amazed at her new view while was astonished on how small the skyscrapers looked to her.<br>\r\n<br>\r\n\"Wow! These buildings look so tiny compared to me. That doesn't mean that I can't still have fun. I think I'll just....\"</span></div></div>",
            "created":1509426000,
            "id":2409476,
            "title":"5,000 feet tall"
        },
        "113321122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Eat them",
                "Enslave them"
            ],
            "content":"<div class=\"\"><div> <span>Jasmine then takes her boot and begins stomping on the buildings that can get crushed. She kept on crushing the buildings under her foot until there's nothing left. She then goes to another city that's nearby and wonders what she'll do with these people.</span></div></div>",
            "created":1517634000,
            "id":2448806,
            "title":"crush these little buildings"
        },
        "1133212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "wants to eat",
                "felt horny"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jasmine moves on to cause some destruction as she steps, sits, and lays on anything she sees and crushes them flat. She finished crushing and</span></div></span></div>",
            "created":1509771600,
            "id":2411217,
            "title":"begins crushing things"
        },
        "11332122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "eat anything",
                "get a foot massage"
            ],
            "content":"<div class=\"\"><div> <span>Jasmine was in a need of pleasure right now. So, she finds another group of people and grabs them before they could run away.<br>\r\n<br>\r\n\"Don't worry, guys. I'm not gonna hurt you. I just want to put you all in a very special place.\" Jasmine said with a lustful grin on her face.<br>\r\n<br>\r\nShe then pulls out on the elastic of her panties and drops everyone inside with the others against her crotch before letting go of the waistband. Jasmine was feeling a bit turned on as she feels the people she's gathered in her panties moving around against her crotch.<br>\r\n<br>\r\n\"That feels so good. I'm gonna go stuff more of you in my panties.\" Jasmine said before moving on.<br>\r\n<br>\r\nJasmine finds another group of people and just puts them in her panties with everyone else. She kept on doing so until her panties is completely full. She sits down at a private area and just enjoys her captives squirming next to her vagina.<br>\r\n<br>\r\n\"You guys can squirm all you want to, you all are not getting out. You people are all just sex toys to me. Because, that's what you people are. Little sex servents who's gonna be staying inside your mistress's underwear for the rest of your lives.\" Jasmine said before she felt herself getting ready for her climax.<br>\r\n<br>\r\nShe released her juices and she patted on her panties before she slowly gets back up on her feet. She then moves on to</span></div></div>",
            "created":1509771600,
            "id":2411233,
            "title":"pleasurable gathering"
        },
        "113322":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "messes with the people next to her butt",
                "sits on the people next to her butt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jasmine brings everyone in her hand behind her and drops them all inside her panties by her ass. She then let go of the elastic and enjoys the squirming they're doing next to her butt. She then</span></div></span></div>",
            "created":1509771600,
            "id":2411216,
            "title":"butt"
        },
        "115":{
            "author_id":"aleshie",
            "author_name":"Rodeaux",
            "choices":[
                "Yes, Serenity!",
                "no thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about an alternate timeline where Serenity is enrolled in Duel Academy?</span></div></span></div>",
            "created":1544677200,
            "id":2588923,
            "title":"Other ladies"
        },
        "12":{
            "author_id":"pokemonfreek23",
            "author_name":"pkmnguy",
            "choices":[
                "season 1",
                "season 2",
                "season 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what year/season</span></div></span></div>",
            "created":1256619600,
            "id":782286,
            "title":"shrink"
        },
        "121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Jaden",
                "Syrus",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shrinks?</span></div></span></div>",
            "created":1482469200,
            "id":2253596,
            "title":"season 1"
        },
        "1211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Alexis",
                "Jasmine",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>It was another day in the freshman year of Duel Academy for one Jaden Yuki. He was getting ready to face someone when he found a glowing rock on the ground. He picked it up and he was then shrunken down to about underneath 1 inch tall.<br>\r\n<br>\r\n\"Hey! What gives?\" Jaden thought.<br>\r\n<br>\r\nThen big booming sounds starts making and it gets louder and louder towards him. Jaden turns around to see</span></div></div>",
            "created":1482469200,
            "id":2253602,
            "title":"Jaden"
        },
        "12111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Back of her panties",
                "Front of her panties"
            ],
            "content":"<div class=\"\"><div> <span>Jaden looks up to see Alexis now over his tiny body. He sees her boot coming down on him and he jumped out of the way. He then sees her stopping as she looks around. Alexis looks down and spotted Jaden on the ground. She picked him up and brought him to her face.<br>\r\n<br>\r\n\"Jaden? What happened to you?\" Alexis wondered.<br>\r\n<br>\r\n\"I found this glowing rock thing on the ground and it suddenly shrunk me! Think you can lend me a hand?\" Jaden asked.<br>\r\n<br>\r\nAlexis sees the rock and picked it to examine it.<br>\r\n<br>\r\n\"So, you're saying that this rock can shrink people?\" Alexis asked.<br>\r\n<br>\r\nJaden nodded as her answer. Alexis looks at the rock again before having a weird smirk on her face.<br>\r\n<br>\r\n\"Why are you smirking like that?\" Jaden said a little uncomfortable about her expression.<br>\r\n<br>\r\n\"Oh! You're about to find out.\" Alexis said mischievously.<br>\r\n<br>\r\n\"Uh oh!\" Jaden thought in fear.<br>\r\n<br>\r\nAlexis doesn't have any pockets in her school uniform. So, she stuffed the rock in her breasts. Now she needs a place to put Jaden in. She lifts up her skirt and pulled on the</span></div></div>",
            "created":1482469200,
            "id":2253608,
            "title":"Jaden meets his Queen"
        },
        "121112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Take Jaden out of her panties",
                "Keep Jaden in her panties"
            ],
            "content":"<div class=\"\"><div> <span>Alexis pulled on her blue panties before letting Jaden fall into it and landed by her pussy. Alexis let her panties go with a snap and patted on her crotch before heading back to her dorm. She makes it back to her room and she lays on her bed with her legs widened so she can feel Jaden move around in her panties.<br>\r\n<br>\r\n\"Keep on squirming Jaden! It's really pleasing me!\" Alexis said with pleasure.<br>\r\n<br>\r\nJaden continues with his movements until Alexis cummed. She decided to</span></div></div>",
            "created":1482642000,
            "id":2254150,
            "title":"Front of her panties"
        },
        "1211122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Boy's Dorm (Slifer, Obelisk, Ra)",
                "Girl's Dorm (Slifer, Obelisk, Ra)"
            ],
            "content":"<div class=\"\"><div> <span>\"I love having you in my underwear, Jaden. So, I'm just gonna keep you in there for as long as I want to while I find more small slaves like you to have for myself to enjoy.\" Alexis said.<br>\r\n<br>\r\nShe gets up to pull out the glowing rock out of her breasts and thinks about who to use it on next.<br>\r\n<br>\r\n\"There'll be some people that I want to have in my bra. So, carrying this thing in there is gonna be an issue. Good thing I have a good alternative place for it.\" Alexis thought.<br>\r\n<br>\r\nAlexis grabs a pouch and straps around her waist. She placed the rock in it and goes out to find more shrunken victims. She eventually goes to the</span></div></div>",
            "created":1490072400,
            "id":2293151,
            "title":"Keep Jaden in her panties"
        },
        "1213":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Chazz",
                "You",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else do you choose?</span></div></span></div>",
            "created":1514350800,
            "id":2433298,
            "title":"More options"
        },
        "12132":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Alexis Rhodes",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You're a Slifer Red student in Duel Academy just finishing up a duel. Once it was finished, a card was glowing and you passed out. When you wake up, you looked around to see that you're in someone else's dorm room. You also noticed that everything's bigger than you. That means that you'd shrunk to about an inch tall. You then see the door opening and in comes</span></div></div>",
            "created":1514350800,
            "id":2433301,
            "title":"You"
        },
        "121321":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Yes she does",
                "No she doesn't"
            ],
            "content":"<div class=\"\"><div> <span>You see that it was the top female student of the academy, Alexis Rhodes, that's coming into the room. You always have a crush on her and she look more beautiful than ever from your new point of view. You then see Alexis coming towards you. Does she see you?</span></div></div>",
            "created":1514350800,
            "id":2433302,
            "title":"Alexis Rhodes"
        },
        "1213211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "breasts",
                "vagina or ass"
            ],
            "content":"<div class=\"\"><div> <span>Alexis sees you and she picks you up from her bed. You noticed that she has a smirk on her face when she saw you.<br>\r\n<br>\r\n\"Hey there, you. Hope you're ready for some fun.\" Alexis said.<br>\r\n<br>\r\nYou were surprised as you figured out what she has in-store for you. You don't seemed to mind, though, as you looked ready yourself. You then see Alexis lowering you towards her</span></div></div>",
            "created":1514350800,
            "id":2433305,
            "title":"Yes she does"
        },
        "12132111":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "Mouth.",
                "Breasts/Hair/Ears."
            ],
            "content":"<div class=\"\"><div> <span>Well, there are four options for to choose from for Alexis' upper body.<br>\r\n<br>\r\na) Mouth (vore, and PLEASE make it a DECENT chapter! As in, well writen and of good lenght!).<br>\r\n<br>\r\nb) Breasts<br>\r\n<br>\r\nc) Hair<br>\r\n<br>\r\nd) Ears</span></div></div>",
            "created":1514350800,
            "id":2433319,
            "title":"Upper body"
        },
        "121321112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Breasts",
                "Hair",
                "Ears"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other options</span></div></span></div>",
            "created":1541048400,
            "id":2571472,
            "title":"Breasts/Hair/Ears."
        },
        "12132112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "vagina",
                "ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which is it?</span></div></span></div>",
            "created":1514350800,
            "id":2433306,
            "title":"vagina or ass"
        },
        "121321121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "lick around the outside",
                "crawl on inside"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alexis lifts up her skirt and pulls on the front of her panties before she dropped you inside right next to her vagina. Once you're there, she let her panties go back into place and you got aroused by her womanly scent. It was then that you</span></div></span></div>",
            "created":1518238800,
            "id":2451455,
            "title":"vagina"
        },
        "1213211211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Kept licking her crotch",
                "Hump her crotch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You started licking on Alexis’s vagina and she was moaning with pleasure when she felt your tongue on her.<br>\r\n<br>\r\n“So good. Keep it up, little man.” Alexis moaned.<br>\r\n<br>\r\nAll of the licking has you grow hard as you....</span></div></span></div>",
            "created":1565586000,
            "id":2701114,
            "title":"lick around the outside"
        },
        "12132112111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "She stuffs you in her cleavage",
                "She plays a game with you",
                "Time Skip"
            ],
            "content":"<div class=\"\"><div> <span>You kept licking her crotch and Alexis was getting more and more wet down here. Eventually, she let loose and you were hit by her juices. Alexis then takes you back out and giggled at you before cleaning you up.<br>\r\n<br>\r\n“You and I are going to have tons of fun for a long time.” Alexis said as you feel the same way.<br>\r\n<br>\r\nWhat happens now</span></div></div>",
            "created":1566795600,
            "id":2708255,
            "title":"Kept licking her crotch"
        },
        "12132112112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "You came first",
                "Alexis came first",
                "Neither of you cane"
            ],
            "content":"<div class=\"\"><div> <span>You halted your licking before you switched to humping Alexis’s vagina.<br>\r\n<br>\r\n“You’re humping me now? This feels just as good. Go on and hump me.” Alexis said relishing this in.<br>\r\n<br>\r\nYou kept on humping her crotch until you feel like taking up a notch as you take your cock out and use it to really make this so much fun.<br>\r\n<br>\r\n“I can feel your little manhood going inside me. It’s so hot to feel a tiny man screwing me from inside of my panties. Do more.” Alexis said as she’s ready for release.</span></div></div>",
            "created":1568955600,
            "id":2721039,
            "title":"Hump her crotch"
        },
        "121321121121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Made Alexis came",
                "Didn’t make Alexis came"
            ],
            "content":"<div class=\"\"><div> <span>You let go first as your jizz sprayed on the inside of Alexis’s pussy. After you cum, you stopped and took the time to relax yourself. As you were doing that, Alexis shifted her hips to get your attention.<br>\r\n<br>\r\n“Hey. Don’t you stop just yet. I know you just came, but what about me? Don’t you leave me hanging.” Alexis said still feeling horny.<br>\r\n<br>\r\nYou obeyed her as you rub on her pussy lips. She was now moaning more than before as you continued to pick up the pace.<br>\r\n<br>\r\n“You better make me cum soon or else.” Alexis said.<br>\r\n<br>\r\nAt this time, you...</span></div></div>",
            "created":1573248660,
            "id":2744002,
            "title":"You came first"
        },
        "1213211211212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Eats you",
                "Sits on you",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You were too exhausted to continue as you stopped right there. You were then taken back out of Alexis’s panties and she brings you to her face who is not pleased right now.<br>\r\n<br>\r\n“You had one chance to make me cum and you blew it. Now it’s time for your punishment.” Alexis said as she....</span></div></div>",
            "created":1573248840,
            "id":2744003,
            "title":"Didn’t make Alexis came"
        },
        "12132112112122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Farted on you",
                "Mushes her butt cheeks on you",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Alexis then brings you down to her bed and just plants her ass right on top of you. You can feel her ass that is still covered by her light blue panties being pressed down on you as she shifts her butt around to grind on you.<br>\r\n<br>\r\n“This is what you get for not finishing the job. But I have a feeling you like this quite a bit. Don’t you?” Alexis said still squishing you with her ass.<br>\r\n<br>\r\nIt was then that Alexis...</span></div></div>",
            "created":1573249080,
            "id":2744005,
            "title":"Sits on you"
        },
        "12132112112123":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Press her feet on you",
                "Stuffs you back into her panties and keeps you there",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else does she do to you?</span></div></span></div>",
            "created":1578918180,
            "id":2773051,
            "title":"Something else"
        },
        "1213211212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Made it to Alexis’s cervix",
                "Stopped and tried to make Alexis cum right there"
            ],
            "content":"<div class=\"\"><div> <span>You pushed the lower lips to open them and you start crawling on inside Alexis. She felt you going inside her and loves it.<br>\r\n<br>\r\n“That’s right, little man. Get inside me. It’s just so amazing.” Alexis said.<br>\r\n<br>\r\nAs you go further inside her crotch, you....</span></div></div>",
            "created":1568955600,
            "id":2721046,
            "title":"crawl on inside"
        },
        "12132112122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Alexis wants to go for round two",
                "Alexis takes you out for another idea",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You stopped midway and started licking Alexis’s vagina through the walls around you. Alexis was so turned on by what you’re doing as she was moaning. Eventually, she came and you got sent back into her panties. Alexis took the time to relax as she felt you inside her panties.<br>\r\n<br>\r\n“That was an amazing sex, little man. I haven’t felt this good in a while. Perhaps you make a better sex toy than I thought.” Alexis said as she wiggles her hips in seductive fashion. “Would you like that, little man? Would you like to be treated as my sex toy to pleasure me? I bet you’d enjoy that so much.”<br>\r\n<br>\r\nWhat now?</span></div></div>",
            "created":1570251600,
            "id":2728293,
            "title":"Stopped and tried to make Alexis cum right there"
        },
        "121321121221":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "When you wake up"
            ],
            "content":"<div class=\"\"><div> <span>“You know what? I’m actually in the mood for another go. How about you?” Alexis wondered with lust.<br>\r\n<br>\r\nYou give her crotch a few licks to prove that you’re in as well.<br>\r\n<br>\r\n“Good choice, sex toy. Get to it.” Alexis said as she spreads her legs to give you room.<br>\r\n<br>\r\nYou started to lick all around her pussy and Alexis was getting wet again. Eventually, you went back inside her and her pleasure went to the roof. As you were squirming around to get her turned on more, you went to licking on the inner walls of her vagina like last time. All of this has you going too as you take your cock and you rubbed it against her vagina walls. You continued this cycle until you let your jizz spray all around inside Alexis. She can feel your warm and sticky cum sprayed within her vagina and she was astonished with joy. After which, she came too and you got sent back into her panties. She lays back down on her bed with a smile as she rubs on her wet panties with you in there.<br>\r\n<br>\r\n“I felt you cumming inside me. Never thought you would do that. But it was really good.” Alexis said as she was loving every moment with you. “I want to take you back out, but I’m so exhausted to move a single muscle. Besides, you must be very comfortable down there to even want to come out.” Alexis said as she continues to rub her crotch with you there. “Yeah. You must be feeling like you’re in paradise while being covered in my wet sticky cum. You’re going to enjoy spending your life as my sex toy. For now, I’m going to let you rest. You earned it.” Alexis said before she went to sleep and you followed.</span></div></div>",
            "created":1572757200,
            "id":2741700,
            "title":"Alexis wants to go for round two"
        },
        "1213211212211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Play a game together",
                "Invite my friends here",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You then woke up and you see that you’re no longer in Alexis’s panties. In fact, she was nowhere in sight. That changed when you see her coming from the bathroom now wearing bright blue bra and panties. She must’ve taken a shower for she smells clean. The half-naked obelisk queen walks over to you and looks at you with a smirk on her face.<br>\r\n<br>\r\n“Hey there, sex toy. Had a good nap?” Alexis wondered and you nodded. “Good. Because I was thinking that we should...”</span></div></div>",
            "created":1572757200,
            "id":2741704,
            "title":"When you wake up"
        },
        "12132112122112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Jasmine gets you first",
                "Mindy gets you first",
                "All the girls shared you at the same time"
            ],
            "content":"<div class=\"\"><div> <span>“I was thinking of inviting my friends here. Hope you wouldn’t mind.” Alexis said as you agreed.<br>\r\n<br>\r\nShe then called her friends here and you two wait. Finally, they arrived and you see two more girls. One with red hair and another with black.<br>\r\n<br>\r\n“Okay, Alexis. Why did you bring us here for?” The red haired girl asked.<br>\r\n<br>\r\n“This.” Alexis said as she shows you to them.<br>\r\n<br>\r\nThey were amazed to see a small person here in their friend’s hands, literally. They looked so beautiful as Alexis as you waved to them.<br>\r\n<br>\r\n“Who’s this, Alexis?” The black haired girl wondered.<br>\r\n<br>\r\n“And why is he so tiny?” The red haired girl asked.<br>\r\n<br>\r\n“He’s just a special someone to me. As for why he’s small, I’m not sure.” Alexis explains.<br>\r\n<br>\r\n“Is this what you brought us here for?” The red haired girl guessed.<br>\r\n<br>\r\n“Yes. Oh yeah! I almost forgot. Little guy, this is Jasmine and Mindy. They’re my friends.” Alexis introduce them to you.<br>\r\n<br>\r\n“Uh, Alexis? You realized you’re in your underwear, right?” Mindy pointed out.<br>\r\n<br>\r\n“I do. It’s just that, well, we...” Alexis blushed a little.<br>\r\n<br>\r\n“You didn’t!” Jasmine gasped.<br>\r\n<br>\r\n“Yeah. It was really great.” Alexis said as you smiled sheepishly.<br>\r\n<br>\r\n“He seems to be very lucky.” Mindy said as she looks at you.<br>\r\n<br>\r\n“He sure is. He even agreed to be my sex toy.” Alexis said.<br>\r\n<br>\r\n“Did he now?” Jasmine asked.<br>\r\n<br>\r\n“Yep. So, I called you over to see if you want to try him out.” Alexis suggested.<br>\r\n<br>\r\n“Well, he does look adorable.” Mindy said.<br>\r\n<br>\r\n“And if he’s as good as you claimed him to be, I don’t see why not.” Jasmine said.<br>\r\n<br>\r\nThe other two girls then stripped out of their uniforms until Jasmine is in her bright red bra and panties while Mindy is in her white ones. That just made you feel very excited as....</span></div></div>",
            "created":1572783840,
            "id":2741714,
            "title":"Invite my friends here"
        },
        "121321121221123":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Boobs",
                "Butts",
                "Feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“How about we share him together?” Mindy suggested.<br>\r\n<br>\r\n“Sounds good to me.” Jasmine said as Alexis nodded.<br>\r\n<br>\r\nIt was then that you see the girls come in closer and they started to press their ____ against you.</span></div></span></div>",
            "created":1588922820,
            "id":2832099,
            "title":"All the girls shared you at the same time"
        },
        "1213211212211232":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Do more butt play",
                "Try something else in mind",
                "They were interrupted"
            ],
            "content":"<div class=\"\"><div> <span>You see the girls turning around and started backing up until they’re pressing their butts on you. Then they started to gyrate their bottoms on each other just to press on to you.<br>\r\n<br>\r\n“I bet he’s enjoying himself.” Mindy said loving how this feels.<br>\r\n<br>\r\n“He’s most likely is. He just can’t help it if a sexy girl does this to him.” Alexis said.<br>\r\n<br>\r\n“Then he’ll explode with excitement with the three of us doing this.” Jasmine said making the others laugh.<br>\r\n<br>\r\nThe continued on pressing their asses all over you and you felt really horny because of this.<br>\r\n<br>\r\nAfter which, the girls decided too...</span></div></div>",
            "created":1588923120,
            "id":2832103,
            "title":"Butt play"
        },
        "12132112122112321":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Alexis (Ass)",
                "Mindy (Breasts)",
                "Jasmine (Pussy)"
            ],
            "content":"<div class=\"\"><div> <span>The girls selected to do more booty play as you were brought down to the bed before the girls started to do some butt crushing.<br>\r\n<br>\r\nMindy wants to try you first as she brings herself down and started bouncing on you for the thrill of it.<br>\r\n<br>\r\n“Wow! He’s so comfy. He definitely should make a good cushion.” Mindy said enjoying how you feel underneath her.<br>\r\n<br>\r\n“I think he should be too.” Alexis said as the girls laugh.<br>\r\n<br>\r\nMindy then gets up and Alexis was next when she she starts sitting on you. You felt like you can handle the weight that these girls are pressing on you and get really turned on. You just lay there as Alexis continues to sit her big ass on you.<br>\r\n<br>\r\n“How are you doing down there, little man? Having so much fun with our butts pressing on your little body. You’re so lucky.” Alexis said wiggling her hips to grind her butt against you.<br>\r\n<br>\r\nWhen gets up, Alexis sees that you’re liking that one a lot. Guess you like her ass the most. Jasmine then steps in to take her turn and plants herself down on top of you. This was getting really exciting for you as you’re all riled up sexually with these girls’ butts on you like this.<br>\r\n<br>\r\n“You’re right, girls. He is comfy. We should do this more often.” Jasmine said smiling so much.<br>\r\n<br>\r\n“We are because he’s our toy now. We can use him however we want him to do and he’ll enjoy it.” Alexis said and the girls laughed.<br>\r\n<br>\r\nAfter a while, Jasmine gets up and you see the three girls looking at you with smiles. Alexis then picks you up and brings you closer to their faces.<br>\r\n<br>\r\n“Did you have fun?” Alexis asked and you nodded. “Good. Because, for being such a good little toy, one of us is going to put you inside our underwear. So which one of us do you want?” Alexis wondered as she brings you behind her. “I know you like my ass more. If you choose me, you get to play around with my butt cheeks as much as you wanted.“<br>\r\n<br>\r\n“Oh yeah? What about me?” Mindy wondered as Alexis brings you over and you see her bringing her big tits down to your face. “Select me and you can hangout with my two other girls. I’ll even let you lick my nipple.”<br>\r\n<br>\r\n“Don’t you forget about me.” Jasmine next as you see her hand coming down to the crotch of her panties and just pats on it. “Maybe you’ll like it if I would just toss you down in here and let you play around with my pussy to your heart’s content. Definitely a satisfying way to have your day.”<br>\r\n<br>\r\nSo which one do you prefor?</span></div></div>",
            "created":1588924680,
            "id":2832113,
            "title":"Do more butt play"
        },
        "121321121221123211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Brings you to another part of her",
                "Shoves you up her asshole",
                "Keeps you like this for later",
                "Has the other girls have a shot with you",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You selected Alexis’s ass and the blonde duelists was delighted to give you this opportunity. She brings you behind her and pulls on the back of her panties before letting you go inside. You landed on her left butt cheek and Alexis let her panties snap back on her so that your completely smushed on her ass. Her booty was good and smooth as you grind yourself against it while Alexis was amazed by what you’re doing.<br>\r\n<br>\r\n“Seems he likes where he’s at right now.” Alexis said showing her friends her ass which has a bulging form of you sticking out of her panties.<br>\r\n<br>\r\n“Can’t blame him. You did say he likes your ass better.” Jasmine said smiling on.<br>\r\n<br>\r\n“You sure did.” Mindy said before she got down on her knees and her face was so close to Alexis’s ass. “After all, you do have a really delicious looking butt.”<br>\r\n<br>\r\n“That’s so true.” Jasmine said before doing the same.<br>\r\n<br>\r\nThe girls then planted kisses on Alexis’s panty-covered butt and the blonde was getting excited. You can feel the lips pressing on behind you and you were feeling excited yourself.<br>\r\n<br>\r\n“Oh yes. Keep worshipping that ass, girls. That goes for you too, little guy.” Alexis said.<br>\r\n<br>\r\nYou do just that and the girls join in with you. After a while, Alexis...</span></div></div>",
            "created":1590107400,
            "id":2839299,
            "title":"Alexis (Ass)"
        },
        "121321121221123213":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Shove you inside her pussy",
                "Put you in another part of your body",
                "The other girls wants a turn now",
                "They were interrupted",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You told them you selected Jasmine’s pussy and the red-haired girl smiled with glee.<br>\r\n<br>\r\n“Okay then. Ready, Jasmine?” Alexis asked.<br>\r\n<br>\r\n“As I’ll ever be.” Jasmine said pulling on her panties for you to enter.<br>\r\n<br>\r\nAlexis brings you to the opening and drops you inside where you’re right near Jasmine’s amazing pussy. You can smell the feminine scent so strongly in here as she was getting a bit excited about doing this. Jasmine then closes her panties back on to her waist and you got slammed against her folds. You can hear the girls giggling as they can see the bulging lining of you poking out of the red silky panties.<br>\r\n<br>\r\n“Look at him. He looks so cute inside your underwear, Jasmine. How does he feel?” Mindy wondered.<br>\r\n<br>\r\n“Pretty good. I bet he- OOOHHH!” Jasmine gasped as she feels you starting to rub on her pussy, much to her liking. “Looks like he doesn’t want to waist any time.” Jasmine said smiling so sexually.<br>\r\n<br>\r\n“Then perhaps we can step up a bit.” Alexis said as she got on her knees until her face is near Jasmine’s panty-covered crotch where she sees you moving in there.<br>\r\n<br>\r\nAlexis then leans in and starts pressing her lips on Jasmine’s crotch and you. That made her moan a little as she relishes the feeling of her friend kissing her pussy and you playing around against it.<br>\r\n<br>\r\n“You like this, Jasmine? Having a tiny man inside your panties just to play with your pussy while I kiss it out here? You must be getting very horny from this.” Alexis said seductively as she kept those kisses going.<br>\r\n<br>\r\nYou were indeed having a blast with touching Jasmine’s pussy as you feel Alexis pressing her face against it from the outside of the panties. If there was a chance that you would get an opportunity like this, then you’ve hit the jackpot.<br>\r\n<br>\r\n“Hey! Let me in on this.” Mindy said feeling left out.<br>\r\n<br>\r\nAlexis moves aside and Mindy got down as well before she starts kissing Jasmine’s pussy as well, only her kisses are longer.<br>\r\n<br>\r\n“The little cutie must be really having fun down here. To be able to get all of that pussy he can get his hands on. This must be the best time of his life and I can’t blame him.” Mindy said as she changes to licking Jasmine’s pussy.<br>\r\n<br>\r\nWhile she does that, Jasmine decided to...</span></div></div>",
            "created":1588956300,
            "id":2832291,
            "title":"Jasmine (Pussy)"
        },
        "1213211212211232131":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Wants to try something else with you",
                "Keeps you with her",
                "Gives you to Alexis or Mindy",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>“Hold on for a second, girls.” Jasmine said before reaching into her panties for you.<br>\r\n<br>\r\nShe grabbed you and shoves you right into her pussy. You felt the inner walls pulling you in as Jasmine was moaning like crazy now.<br>\r\n<br>\r\n“He’s... actually moving inside me!” Jasmine moans with ecstasy.<br>\r\n<br>\r\n“Now this is more interesting.” Alexis said and Mindy agreed.<br>\r\n<br>\r\nThe girls then started kissing Jasmine all over her body while you continued on messing around within her pussy. You licked around the walls and you can her the redhead getting more turned on while the other were making it better back outside.<br>\r\n<br>\r\nEventually, you were splashed by Jasmine’s cum and landed back into her panties.<br>\r\n<br>\r\nJasmine then...</span></div></div>",
            "created":1590108360,
            "id":2839309,
            "title":"Shove you inside her pussy"
        },
        "121321122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Her butt",
                "Her feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe we can try lower?</span></div></span></div>",
            "created":1514437200,
            "id":2433783,
            "title":"ass or feet?"
        },
        "1213211221":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "crack",
                "buttcheek"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alexis lifts up her skirt behind her and pulls on the back of her panties before she dropped you inside by her ass. When she let her panties go, you got slammed right into her</span></div></span></div>",
            "created":1518238800,
            "id":2451451,
            "title":"Her butt"
        },
        "12132112211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Went inside her anus",
                "Lick around her anus"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You got slammed right into Alexis’s butt crack and you’re looking straight at her butthole. To be honest, it’s not really that bad as you were getting hard at the scent of her ass. From here, you....</span></div></span></div>",
            "created":1566536400,
            "id":2706620,
            "title":"crack"
        },
        "121321122112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "You started humping her butthole",
                "Alexis farts on you"
            ],
            "content":"<div class=\"\"><div> <span>You began licking Alexis’s butthole and it made her jump with pleasure as she started to get aroused by your actions in her butt.<br>\r\n<br>\r\n“Keep licking down there, little guy. You like being next to my sexy butt.” Alexis said as she shakes her hips around.<br>\r\n<br>\r\nYou grew harder as you kept on licking her hole.<br>\r\n<br>\r\nEventually,...</span></div></div>",
            "created":1566968400,
            "id":2709460,
            "title":"Lick around her anus"
        },
        "12132112212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Kiss her butt cheek",
                "Hump her butt cheek",
                "Alexis sat on you before you could do anything"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You went straight into Alexis’s butt cheek while her panties kept you in place. Her cheek feel nice and smooth when touching her skin. Soon enough, you....</span></div></span></div>",
            "created":1566536400,
            "id":2706623,
            "title":"buttcheek"
        },
        "121321122121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Alexis takes you back outside",
                "Alexis keeps you in there"
            ],
            "content":"<div class=\"\"><div> <span>You then started kissing Alexis’s butt cheek as she was liking it.<br>\r\n<br>\r\n“That’s very good. You keep doing that, little man.” Alexis said smiling.<br>\r\n<br>\r\nShe was really into this as you continued kissing her enormous butt cheek. All of this was making you horny as your little “friend” was getting harder. You might like this new life of yours as you kept kissing every inch of her wonderful butt.<br>\r\n<br>\r\n“Oh yes. You’re enjoying this as much as I am. Aren’t you, little guy? You know you love my butt.” Alexis said smiling.<br>\r\n<br>\r\nYou continue kissing her ass until...</span></div></div>",
            "created":1566968400,
            "id":2709472,
            "title":"Kiss her butt cheek"
        },
        "1213211221212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Gym",
                "Lunch",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Alexis decided to keep you by her ass for now as it was time for class. As she walks, you went for a ride as her cheeks jiggle with each step. She went into the classroom and sits down at her seat. Doing that got you crushed underneath her. You were still alive but you can’t move now. You’ll just have to bare with it until class is over. Still it’s good to feel her butt all over you.<br>\r\n<br>\r\nSoon enough, class was over and done with as it was time for...</span></div></div>",
            "created":1596460680,
            "id":2880113,
            "title":"Alexis keeps you in there"
        },
        "12132112212122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Go to her next class",
                "Skip to when school is finished"
            ],
            "content":"<div class=\"\"><div> <span>It was time for lunch as Alexis grabs her meal from the cafeteria. She sits down by the desk with her friends while she smothers you again. Alexis just keep getting these dirty thoughts about you and thinks about what to do with you next. She even saved some snacks for you in case you get hungry yourself.<br>\r\n<br>\r\nShe finished her food and lunch period was done.</span></div></div>",
            "created":1596460920,
            "id":2880114,
            "title":"Lunch"
        },
        "121321122121222":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Play a game",
                "Give you a little show",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Alexis was finally finished with her classes and she heads back to her dorm. Once she’s there, she takes you out of her panties to see you.<br>\r\n<br>\r\n“Enjoyed your ride in my butt, little guy?” Alexis asked and you nodded. “Good. You’ll be getting more of that soon. Here. I’ve got you something to eat.”<br>\r\n<br>\r\nYou go and eat the snacks she got for you. This has turned out to be okay. You get to be with this amazing blonde girl that you got down with even if this size thing isn’t what you’d expected.<br>\r\n<br>\r\nAfter eating, Alexis decided to...</span></div></div>",
            "created":1596461160,
            "id":2880115,
            "title":"Skip to when school is finished"
        },
        "1213211221212222":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Brings you to her",
                "Wants you to climb her",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>“Stay right there, little guy. I’ve got something special for you.” Alexis said smirking.<br>\r\n<br>\r\nShe gets up and starts taking off her uniform. Your eyes widened as you see her in her bra and panties. She looks down right hot to you. That doesn’t stop as she takes her underwear off too before you see her fully naked.<br>\r\n<br>\r\n“You like what you see?” Alexis asked striking a pose.<br>\r\n<br>\r\nYou liked it a lot and she giggled. That’s when she...</span></div></div>",
            "created":1596461400,
            "id":2880117,
            "title":"Give you a little show"
        },
        "1213212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "squirm your way out",
                "perving around"
            ],
            "content":"<div class=\"\"><div> <span>You see that Alexis doesn’t see you on her bed and she turns around so you can see her ass that’s covered by her bright blue panties right underneath her skirt. She then starts lowering herself down and there wasn’t any time to escape as her butt is now on top of you. You feel smothered by her butt as Alexis was just sitting there going over her studies. It was then that you started to</span></div></div>",
            "created":1534827600,
            "id":2536684,
            "title":"No she doesn't"
        },
        "12132122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "reached to her anus",
                "stayed on her buttcheek",
                "made it to her vagina"
            ],
            "content":"<div class=\"\"><div> <span>There’s no denying that Alexis has a sexy looking ass. So, with no use in fighting against it, you let your pervy thoughts get to you and you begin rubbing on her ass. She doesn’t seemed to be reacting to your touch. That means that you won’t have to worry about her noticing what you’re doing for now. You then managed to get out from underneath her and decided to take it up a notch by going into her panties. You continue to crawl in Alexis’s underwear until you</span></div></div>",
            "created":1534827600,
            "id":2536689,
            "title":"perving around"
        },
        "121321223":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "went into her vagina",
                "finished things up out here"
            ],
            "content":"<div class=\"\"><div> <span>You crawled inside Alexis’s panties until you ended up against her vagina. You can see that there’s hardly a single shred of pubic hairs as you start messing around with her crotch. She still can’t seemed to noticed you, even if you’re touching her vagina with your hands and cock. Oh well. That means more uninterrupted fun time for you.<br>\r\n<br>\r\nYou have always wanted to give her the best experience ever and you now can while you’re in her panties. Soon enough, you</span></div></div>",
            "created":1541221200,
            "id":2572279,
            "title":"made it to her vagina"
        },
        "121322":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Jasmine",
                "Mindy",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else is it?</span></div></span></div>",
            "created":1561179600,
            "id":2677065,
            "title":"Other"
        },
        "1213221":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "She sees you",
                "She doesn’t see you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You looked to see the red-headed Jasmine coming into the room. She looks amazingly beautiful from your stand point as you see Jasmine coming in towards you.</span></div></span></div>",
            "created":1561179600,
            "id":2677066,
            "title":"Jasmine"
        },
        "12132211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Furious",
                "Intrigued"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was she furious or intrigued to see you</span></div></span></div>",
            "created":1561179600,
            "id":2677067,
            "title":"She sees you"
        },
        "121322112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Treats you like a slave",
                "Uses you to pleasure herself",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“What’s this? A nice little man standing in my room?” Jasmine said with a smirk on her face as she grabbed you. “You and I are going to have some fun, little guy.” She said as she...</span></div></span></div>",
            "created":1561179600,
            "id":2677068,
            "title":"Intrigued"
        },
        "1213221122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Shoves you all the way inside",
                "Brings you out and shoves you in her ass next",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jasmine pulls her panties down so that her pussy and ass is showing. With that done, she proceeds to shove you inside her pussy and back out before you go in again. She does this cycle back and forth as she’s using you as a dildo. This makes Jasmine moan and sigh with pleasure as she continues to use you until she....</span></div></div>",
            "created":1564030800,
            "id":2692027,
            "title":"Uses you to pleasure herself"
        },
        "12132211221":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "At her cervix",
                "Pushed back out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jasmine then shoves your entire body inside her vagina and let’s you move around yourself. You admit to yourself that, even though it’s cramped in here, this has you all horny as you got hard. Soon enough, Jasmine cums and you were...</span></div></span></div>",
            "created":1564030800,
            "id":2692028,
            "title":"Shoves you all the way inside"
        },
        "121322112212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Wants to do more with you",
                "Saves you for later"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After Jasmine had her orgasm, you were pushed back outside and she was looking at you with a satisfied smile on her face.<br>\r\n<br>\r\n“I think you’re going to be a great sex toy, little man.” Jasmine said as she...</span></div></span></div>",
            "created":1564030800,
            "id":2692034,
            "title":"Pushed back out"
        },
        "1213221122121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Cleavage",
                "Butt",
                "Mouth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jasmine takes the rest of her clothes off until she’s completely naked and puts you in her....</span></div></span></div>",
            "created":1568696400,
            "id":2719746,
            "title":"Wants to do more with you"
        },
        "1213221122122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Jasmine",
                "Jasmine with Alexis and Mindy",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Jasmine decided to save you for later use as she drops you into her panty drawer before grabbing a fresh clean pair of panties. She then closes the drawer to where only some light is shown. You then lay down on one of the panties and waited for the day to go by.<br>\r\n<br>\r\nAfter a while, the drawer was opened and you looked up to see...</span></div></div>",
            "created":1571202000,
            "id":2733723,
            "title":"Saves you for later"
        },
        "12132211221222":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Boobplay",
                "Buttplay",
                "Footplay"
            ],
            "content":"<div class=\"\"><div> <span>You were then taken back out as you see Jasmine. She wasn’t alone as she brought her friends, Alexis and Mindy, with her to show you to them.<br>\r\n<br>\r\n“You’re right, Jasmine. He is an adorable little guy.” Mindy said looking at you with a smile.<br>\r\n<br>\r\n“Agreed. So, are we doing this or what?” Alexis wondered you Jasmine.<br>\r\n<br>\r\n“We definitely are.” Jasmine said.<br>\r\n<br>\r\nIt was decided that the girls wants to try some ______ with you.</span></div></div>",
            "created":1571202000,
            "id":2733729,
            "title":"Jasmine with Alexis and Mindy"
        },
        "12133":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Mindy",
                "Jasmine",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else is it going to be?</span></div></span></div>",
            "created":1519621200,
            "id":2457833,
            "title":"Other"
        },
        "121331":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Alexis",
                "Jasmine",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mindy wakes up one day and finds herself shrunk to about an inch tall. She was freaking out about this before she spotted a sleeping</span></div></span></div>",
            "created":1519621200,
            "id":2457834,
            "title":"Mindy"
        },
        "1213311":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Wake Alexis up",
                "Explore Alexis’s body",
                "Alexis wakes up first"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mindy sees her friend, Alexis, sleeping on her bed in her school uniform. Mindy then begins to climb up her bed and she thinks about what to do now.</span></div></span></div>",
            "created":1519621200,
            "id":2457836,
            "title":"Alexis"
        },
        "12133112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Upper body",
                "Lower body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mindy then started climbing over Alexis’s body while the blonde duelist is sleeping. Mindy makes it to the top and she wondered where she’ll go from here.</span></div></span></div>",
            "created":1530766800,
            "id":2515200,
            "title":"Explore Alexis’s body"
        },
        "121331121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Breasts",
                "Feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mindy walks up Alexis’s body until she reaches her</span></div></span></div>",
            "created":1551243600,
            "id":2624054,
            "title":"Upper body"
        },
        "1213311212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Face"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I messed that up</span></div></span></div>",
            "created":1551243600,
            "id":2624055,
            "title":"Messed up"
        },
        "121331122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "vagina/ass",
                "feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mindy starts walking down Alexis’s body until she reaches her</span></div></span></div>",
            "created":1551243600,
            "id":2624053,
            "title":"Lower body"
        },
        "1213311221":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "pussy",
                "ass"
            ],
            "content":"<div class=\"\"><div> <span>Mindy stops by Alexis’s thighs and takes a peek under her skirt. She sees that the obelisk queen is wearing a nice pair of regular white panties and is intrigued by what she’s about to do now. Mindy climbed underneath the fabric until she reaches Alexis’s</span></div></div>",
            "created":1551243600,
            "id":2624056,
            "title":"vagina/ass"
        },
        "12133112211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "waking up when she felt Mindy",
                "moaning in her sleep"
            ],
            "content":"<div class=\"\"><div> <span>Mindy crawls underneath Alexis’s panties until she makes it to her well-shaved pussy. Mindy was getting a nice exotic feeling going on inside her as she admires the beauty that is her blonde friend’s vagina. She then starts kissing Alexis’s vagina and it felt really good to her.<br>\r\n<br>\r\nMeanwhile, Alexis was</span></div></div>",
            "created":1551243600,
            "id":2624057,
            "title":"pussy"
        },
        "121331122111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "back in her panties",
                "into her bra",
                "right in her boot"
            ],
            "content":"<div class=\"\"><div> <span>Alexis wakes up from her sleep when she feels something tingling by where her vagina is. She stretched out her panties and was in awe when she sees Mindy, tiny and naked, ravishing on her vagina. She then picked Mindy out and brings her to her face.<br>\r\n<br>\r\n“Mindy? Why are you so small? And what were you doing in my underwear?” Alexis wondered.<br>\r\n<br>\r\nMindy was too embarrassed to explain herself. However, she sees a strange smile on Alexis’s face before she could say anything at all.<br>\r\n<br>\r\n“I see. You must have one of those dirty fantasies that you want to try out. Well, good news for you is that I’m willing to let you have that opportunity. It felt pretty good before and I have a feeling that you can do better.” Alexis said before puts Mindy</span></div></div>",
            "created":1551243600,
            "id":2624063,
            "title":"waking up when she felt Mindy"
        },
        "12133113":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "bra",
                "panties",
                "boot"
            ],
            "content":"<div class=\"\"><div> <span>Before Mindy could do anything, Alexis was already waking up and she sees her friend so tiny on her bed. She grabs Mindy and brings her to her face.<br>\r\n<br>\r\n“Mindy?! Why are you so small?” Alexis asked.<br>\r\n<br>\r\n“I don’t know. I woke up like this.” Mindy explained.<br>\r\n<br>\r\n“What were you doing on my bed?” Alexis asked.<br>\r\n<br>\r\nMindy was going to say something, but she blushed because she feels too embarrassed to say anything at all. Alexis looks closely and was smirking at her little friend.<br>\r\n<br>\r\n“Were you going to explore my body?” Alexis asked with a grin on her face.<br>\r\n<br>\r\n“No! Of course not, Alexis. I would never do that.” Mindy said.<br>\r\n<br>\r\n“That’s okay, Mindy. I find it pretty sexy of you to do so.” Alexis said.<br>\r\n<br>\r\n“You do?” Mindy asked.<br>\r\n<br>\r\n“Yes. In fact, I’m suddenly in the mood for some excitement right now. So, you can choose to go wherever you want to go.” Alexis suggested.<br>\r\n<br>\r\nMindy thinks long and hard and chooses to go into Alexis’s</span></div></div>",
            "created":1519621200,
            "id":2457838,
            "title":"Alexis wakes up first"
        },
        "121331132":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“Can I go inside your panties, Alexis?” Mindy asked while blushing so red.<br>\r\n<br>\r\n“Yes. Just choose which side you want.” Alexis suggested.</span></div></span></div>",
            "created":1519621200,
            "id":2457839,
            "title":"panties"
        },
        "1213311321":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "shoves Mindy into her vagina",
                "keeps Mindy in her panties",
                "takes Mindy out of her panties"
            ],
            "content":"<div class=\"\"><div> <span>Mindy selected the front and Alexis pulls on her panties before she let her tiny friend go inside before closing them shut. Mindy got honey to see her big friend’s vagina and she starts licking on her crotch. Alexis felt what Mindy’s doing and she starts moaning with pleasure.<br>\r\n<br>\r\n“Oh yes, Mindy. Lick my vagina. Oohhh! So good.” Alexis moaned.<br>\r\n<br>\r\nMindy kept on licking Alexis’s vagina and she soon see her juices coming out of her. Alexis looks too sweet her panties wet and so likely is Mindy. Alexis then</span></div></div>",
            "created":1522990800,
            "id":2475821,
            "title":"Front"
        },
        "12133113211":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "makes it to Alexis’s womb",
                "was washed back out"
            ],
            "content":"<div class=\"\"><div> <span>Alexis then got so horny that she decided to shove Mindy inside her vagina. She did so as she pushed Mindy from the outside of her panties and felt her little friend going inside her.<br>\r\n<br>\r\n“That’s it. Get inside my pussy. You’ll be more pleasurable that way.” Alexis said as she no longer see the linings of her friend inside her panties. Meaning, that she’s now inside of her vagina.<br>\r\n<br>\r\nMindy was feeling excited herself as she likes how Alexis’s vagina looks and smells like. She then goes crawling more inside her and she can hear Alexis moaning with every movement she makes. Alexis was enjoying the pleasure as she takes off her panties to see her now exposed wet pussy before she starts rubbing herself.<br>\r\n<br>\r\n“Oh yes, Mindy. Squirm more inside me. It’s so good when you do that.” Alexis moaned as she rubbed herself more.<br>\r\n<br>\r\nMindy then starts licking on the walls to make Alexis more horny. Soon enough, she</span></div></div>",
            "created":1530766800,
            "id":2515205,
            "title":"shoves Mindy into her vagina"
        },
        "121331132111":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "That’s what happens",
                "Mindy gets stuck"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is that what happens or does Mindy remains stuck in the walls?</span></div></span></div>",
            "created":1544677200,
            "id":2588837,
            "title":"makes it to Alexis’s womb?"
        },
        "12133113212":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "went into Alexis’s vagina",
                "starts kissing Alexis’s vagina"
            ],
            "content":"<div class=\"\"><div> <span>“That was great, Mindy. I guess I’ll let you stay in there for a while just for that amazing moment.” Alexis said as she looked the wet spot of her blue-striped panties that hides her little friend right underneath the fabric.<br>\r\n<br>\r\nMindy actually likes that idea as the smell of Alexis’s womanly scent was taking over her mind. She then started to move around feeling horny again against Alexis’s vagina and the obelisk blue queen was smiling in delight of feeling and seeing the bulging figure thrashing around right next to her crotch to no end.<br>\r\n<br>\r\n“You’re such a lucky naughty girl, aren’t you? You get to play with my crotch from the inside of my own underwear for as long as you want to. Just make sure you give me some orgasms while you’re down there.” Alexis said as she patted on her crotch from the outside of her panties.<br>\r\n<br>\r\nMindy then</span></div></div>",
            "created":1530248400,
            "id":2513366,
            "title":"keeps Mindy in her panties"
        },
        "1213311322":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "sit on her",
                "fart on her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mindy chooses the back and Alexis obliged by putting Mindy inside her white and blue striped panties right next to her butt. Mindy enjoys the scent coming from her blond friend’s ass until she noticed that Alexis is going to</span></div></span></div>",
            "created":1522731600,
            "id":2474472,
            "title":"Back"
        },
        "12133113222":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "falls asleep",
                "squirms to Alexis’s asshole",
                "humps Alexis’s buttcheeks"
            ],
            "content":"<div class=\"\"><div> <span>Alexis starts grunting and unleashed a big fart. Mindy felt that fart like it was an explosion and she then sniffed up the stench that hit her nostrils. It didn’t bother her in the slightest. In fact, she was rather horny as she smells the gas of her fellow obelisk blue member.<br>\r\n<br>\r\n“Oh, Alexis. Your farts smells so good. Fart on me more. I want more.” Mindy thought dirty.<br>\r\n<br>\r\nAlexis continues to fart and Mindy sniffs it all up with passion before Mindy</span></div></div>",
            "created":1522818000,
            "id":2474887,
            "title":"fart on her"
        },
        "121331132223":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "allow Mindy to stay in her panties",
                "make Mindy worship her butt",
                "take Mindy back outside"
            ],
            "content":"<div class=\"\"><div> <span>Mindy was so horny by the potent smell of Alexis’s farts that she started humping and grinding herself on her friend’s ass. Alexis feels Mindy humping on her butt and it feels really good to her.<br>\r\n<br>\r\n(“I guess she’s having a lot of fun down there.”). Alexis thought with dirty thoughts in her mind.<br>\r\n<br>\r\nAlexis keeps passing gas on the tiny female obelisk blue member that’s trapped inside her panties and Mindy was going none stop with her grinding on Alexis’s ass. Soon, Mindy came on Alexis’s ass, which she felt, and the blonde duelist decided to</span></div></div>",
            "created":1530248400,
            "id":2513114,
            "title":"humps Alexis’s buttcheeks"
        },
        "1213311322231":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "stay be Alexis’s ass",
                "go mess with Alexis’s vagina"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“You cummed pretty good, didn’t you, Mindy? You know what? I think I’ll let you hangout in my panties for however long you want to. Enjoy yourself.” Alexis said.<br>\r\n<br>\r\nMindy, while still feeling, sexually, hot, decided to</span></div></span></div>",
            "created":1553576400,
            "id":2634978,
            "title":"allow Mindy to stay in her panties"
        },
        "12133113222311":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Let Mindy continue",
                "Takes Mindy back out",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Mindy decided to remain next to Alexis’s ass for now. She felt her friend’s butt on her small body and Mindy couldn’t help but feel very turned on. After all, she always think of Alexis as the sexist girl she had ever been with. The truth is that Mindy’s a lesbian and she never told anyone because she’s afraid of how they might react. But, she doesn’t seemed to be too concerned about that as she can guess that Alexis would be okay with that after what’s been happening. Mindy then starts kissing on Alexis’s ass and starts to get wet again.<br>\r\n<br>\r\n“<i>Oh! I think I’m in love with Alexis’s butt. It’s so wrong, yet it’s so amazingly good, to kiss such a wonderful butt. Look at me. I’m getting really wet doing this. But I want this. I want to kiss and worship Alexis’s big butt so much.</i>” Mindy thought as the ass worship continues.<br>\r\n<br>\r\nAlexis was laying on her bed while she feels Mindy worshipping her ass. She can tell that her tiny friend is really taking a liking into this as she lets Mindy continue what she’s going.<br>\r\n<br>\r\n“<i>She seems to like it next to my sexy big butt. Perhaps I can make her in my butt girl is she’s up for it.”</i> Alexis thought as she...</span></div></div>",
            "created":1564117200,
            "id":2692529,
            "title":"stay be Alexis’s ass"
        },
        "1213311322232":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Pleased enough. Give Mindy some free time",
                "A little bit pleased. Alexis helps Mindy do better",
                "Not so pleased. Alexis squishes Mindy between her ass"
            ],
            "content":"<div class=\"\"><div> <span>Alexis pulls on her panties to see her little horny friend next to her ass.<br>\r\n<br>\r\n“You seemed to be enjoying yourself down there. Aren’t you, Mindy? Since you like my butt so much, maybe you can worship this big booty of mine. Better get started.” Alexis said before she let her panties snap shut.<br>\r\n<br>\r\nMindy does what Alexis wants her to do as she begins kissing the obelisk queen’s ass like there was no tomorrow. Alexis feels Mindy’s kisses on her butt and was sighing with delight as she lays down on her bed with her butt sticking out while she allows Mindy to continue her sexual assignment.<br>\r\n<br>\r\n“That’s it. Worship the queen’s royal behind. You know that you want to pleasure your queen so much.” Alexis said, softly and seductively, as relished in Mindy’s service.<br>\r\n<br>\r\nMindy continues to kiss every spot on each of Alexis’s butt cheeks for about 20 minutes and Alexis feels</span></div></div>",
            "created":1543467600,
            "id":2583275,
            "title":"make Mindy worship her butt"
        },
        "1213312":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "really wants to get big again",
                "likes what Jasmine’s doing to her"
            ],
            "content":"<div class=\"\"><div> <span>Mindy sees her red-haired friend, Jasmine, asleep on her bed and goes over to see if she can wake her up. She climbs up her bed and makes it to the top before she goes towards Jasmine’s face. Mindy then starts poking on her face and sees Jasmine waking up before she spots her.<br>\r\n<br>\r\n“Mindy? What happened to you? Why are you so small?” Jasmine asked as she picks her up.<br>\r\n<br>\r\n“I’m not sure. This sorta just happened. Think you can help me out here?” Mindy asked nicely.<br>\r\n<br>\r\n“And miss out on the fun? I don’t think so.” Jasmine said with a smirk on her face.<br>\r\n<br>\r\nShe then starts kissing Mindy all over just to get herself feeling warm inside. As for Mindy, she</span></div></div>",
            "created":1553662800,
            "id":2635730,
            "title":"Jasmine"
        },
        "12133122":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "bra",
                "panties"
            ],
            "content":"<div class=\"\"><div> <span>As Jasmine was kissing Mindy, the small student was feeling warm on the inside and it got warmer with each kiss Jasmine gives her. She’s starting to think that she might like this treatment as Jasmine finished kissing her.<br>\r\n<br>\r\n“How’s that, Mindy?” Jasmine asked seductively.<br>\r\n<br>\r\n“It was pretty good.” Mindy said while blushing.<br>\r\n<br>\r\n“Well then, you’re going to like this next.” Jasmine said as she starts licking Mindy.<br>\r\n<br>\r\nMindy now feels horny with her friend’s tongue licking on her body like this and she can’t get enough of this. Jasmine then starts licking on Mindy’s vagina and it’s making her moan with pleasure. Soon enough, Mindy came and her sex juice leaked on Jasmine’s tongue, who then swallowed it all down.<br>\r\n<br>\r\n“You taste delicious. Are you enjoying yourself, Mindy?” Jasmine asked.<br>\r\n<br>\r\n“I am. This feels so wonderful.” Mindy said while panting from her cumming.<br>\r\n<br>\r\n“Good to hear. Now, I’m going to enjoy this next part because I’m going to stuff you in my...”</span></div></div>",
            "created":1553662800,
            "id":2635741,
            "title":"likes what Jasmine’s doing to her"
        },
        "121331222":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "Front",
                "Back"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“I’m going to stuff you in my panties. The question is, should I put you in the front or the back?” Jasmine wondered.</span></div></span></div>",
            "created":1553662800,
            "id":2635743,
            "title":"panties"
        },
        "1213312221":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "keeps Mindy in her panties for now",
                "brings Mindy back out",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>With a look of lust, Jasmine lifted up her skirt to reveal her wearing nice sky blue panties before she starts stretching out the front and dropping Mindy inside. Mindy looks at, what appears to be, Jasmine’s vagina with very little pubic hair on her and finds it to be very attractive while being this close to it. Mindy looks up to see Jasmine looking at her with a very exotic smile on her face for she looks the position she sees her tiny friend is in.<br>\r\n<br>\r\n“You like what you see down there, Mindy?” Jasmine asked seductively while looking at her friend who is inside her panties.<br>\r\n<br>\r\n“I do, Jasmine. It’s very amazing to see it up close like this.” Mindy said while feeling horny about the thought of being this close to Jasmine’s vagina.<br>\r\n<br>\r\n“In that case, go on and have your fun, Mindy. I’m just going to lay back and enjoy this.” Jasmine said before snapping her panties shut and laying on her bed to let Mindy please her so.<br>\r\n<br>\r\nMindy starts out by rubbing herself on Jasmine’s vagina and it starts to make her big friend feel turned on a little. Mindy then using her tongue on the vagina lips while Jasmine was getting more and more aroused from Mindy’s performance.<br>\r\n<br>\r\n“Oh yes. That’s it, Mindy. Keep playing with my pussy. This feels so amazing.” Jasmine moaned.<br>\r\n<br>\r\nJasmine was having a blast while Mindy keeps up the good work. Speaking of blast, Jasmine would finally have her orgasm while her juices sprayed on Mindy.<br>\r\n<br>\r\nWhen that was finished, Jasmine...</span></div></div>",
            "created":1558933200,
            "id":2664663,
            "title":"Front"
        },
        "123":{
            "author_id":"pokemonfreek23",
            "author_name":"pkmnguy",
            "choices":[
                "Jaden",
                "Syrus",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which guy shrinks</span></div></span></div>",
            "created":1256706000,
            "id":782895,
            "title":"season 3"
        },
        "1233":{
            "author_id":"pokemonfreek23",
            "author_name":"pkmnguy",
            "choices":[
                "Hassleberry",
                "Jim",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices</span></div></span></div>",
            "created":1256706000,
            "id":782896,
            "title":"Other choices"
        },
        "12332":{
            "author_id":"pokemonfreek23",
            "author_name":"pkmnguy",
            "choices":[
                "at slifer red dorm blairs room",
                "at obelisk blue girls dorm alexis's room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jim And shirley were walking in the woods when suddenly a stranger apeared in front of them he gave them ssome kind of orb then he dissapeared<br>\r\nthe orb exploded when they woke up they were....</span></div></span></div>",
            "created":1256706000,
            "id":782898,
            "title":"Bad day for croc man"
        },
        "123321":{
            "author_id":"pokemonfreek23",
            "author_name":"pkmnguy",
            "choices":[
                "blair",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>they were shrunk and on some kind of bed when suddenly the door opened and ________ came in.</span></div></span></div>",
            "created":1256706000,
            "id":782900,
            "title":"holy wtf!"
        },
        "1233211":{
            "author_id":"pokemonfreek23",
            "author_name":"pkmnguy",
            "choices":[
                "yeah sure",
                "nah take me to miss fontaine"
            ],
            "content":"<div class=\"\"><div> <span>it was blair and when she saw jim she nearly screamed but she resisted the urge she asked how they got here and how they got this way<br>\r\nthey told her the story and she felt sorry for them she asked them would they like to stay with her until they found a cure.</span></div></div>",
            "created":1256706000,
            "id":782903,
            "title":"the slifer red cutie"
        },
        "12332111":{
            "author_id":"pokemonfreek23",
            "author_name":"pkmnguy",
            "choices":[
                "sure why not",
                "no thank you"
            ],
            "content":"<div class=\"\"><div> <span>sure jim said as long as you take good care of us then she picked them up and gve them a big hug later she said ummmmm i have a secret ive always sorta had a crush on you jim jim replied well thats ok i guess so what blair? i wanna d it with you is that ok .</span></div></div>",
            "created":1256706000,
            "id":782905,
            "title":"yeah sure"
        },
        "123321111":{
            "author_id":"pokemonfreek23",
            "author_name":"pkmnguy",
            "content":"<div class=\"\"><div> <span>blair took off her uniform and underwear in a kind of strip shiw fashion and jim just stared then blair picked him up ripped off his clothes and put him in her pussy and she started moaning with pleasure jim was battering her cunt and really making her happy she started to get really horny and she pushed him in too far and he got crushed 2 death<br>\r\nOops she said just then shirley jumped at her and she ate her</span></div></div>",
            "created":1258347600,
            "id":792416,
            "title":"What a way to die"
        },
        "12333":{
            "author_id":"pokemonfreek23",
            "author_name":"pkmnguy",
            "choices":[
                "Axel",
                "Adrian"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>okay last 1</span></div></span></div>",
            "created":1256706000,
            "id":782897,
            "title":"Other"
        },
        "123332":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "Adrian.",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Adrian shrinks or someone else?</span></div></span></div>",
            "created":1381640400,
            "id":1678510,
            "title":"Adrian or?"
        },
        "1233322":{
            "author_id":"maexam",
            "author_name":"Leon_Midnight",
            "choices":[
                "Professor Viper/Other.",
                "YOU!!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shrinks?</span></div></span></div>",
            "created":1381640400,
            "id":1678511,
            "title":"Someone else."
        }
    },
    "info":{
        "author_id":"pokemonfreek23",
        "author_name":"pkmnguy",
        "brief_description":"this will be very fun go nuts",
        "created":1256653560,
        "description":"<td align=\"left\" class=\"norm\">go nuts no rules do whatever u feel like</td>",
        "id":1612408,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1596461400,
        "modified":1596461400,
        "pretty_title":"yugioh gx duel academy gts story"
    }
}