{
    "chapters":{
        "1":{
            "author_id":"permberton",
            "author_name":"permberton",
            "choices":[
                "Man",
                "Woman"
            ],
            "content":"<div class=\"\"><div> <span>You sit down to open your email, and notice a advertisement for a website called lifeshop.com. Curious, you click the link, and are surprised to be greeted by an image of a man and woman smiling for the camera. You had imagined that this site would have been for the typical self-help, personal improvement type items: diet food, gym accessories, inspirational books and the like, however, this site was clearly advertising a service.<br>\r\n<br>\r\n\"Tired of being you?\" the headline asked. \"why not try talking a walk in someone else's shoes.\"<br>\r\n<br>\r\nThe site seemed to be promising to allow you to trade places with someone else, and as you read further, you realized that was precisely what it claimed. The site seemed to offer you a full range of options to swap: you could swap careers, you could swap bodies, you could swap memories or intellect, and you could even swap families. There was even a custom swap option for if you wanted to swap something more detailed and individualized. <br>\r\n<br>\r\nYou scanned through some of the profiles and noticed that many people were offering small items, like a skill or hobby, such as knitting or playing an instrument. Some people were offering careers. For instance, one woman said she was settling down and wanted to become a mother, so she was swapping her current career for cash. Some people were selling physical attributes, like the woman who was over six feet tall who was looking to trade some of her height for better skin or hair. Still others were making more complete swaps, looking to swap their entire bodies, or even their entire lives.<br>\r\n<br>\r\nYou were unsure how any of this was possible, but the site assured you that the proponents of the site had developed a proprietary reality altering machine which could effectuate any swap, for a small fee, between any two consenting individuals. The site further stated that the service was being offered at such a low price because the system was still in its beta phase, and they were performing research both on the system, and on the effects on consumers.<br>\r\n<br>\r\nYou couldn't help but be intrigued by the promise of the site. Of course there were things about yourself that you would love to change, however, you weren't sure how much you trusted the system, or how much you were willing to swap. Nevertheless, you figured that it couldn't hurt to create a profile and just browse around.<br>\r\n<br>\r\nFirst, the system asked you to identify whether you were a man or a woman.</span></div></div>",
            "created":1524855960,
            "id":2484939,
            "title":"Who are you now?"
        },
        "11":{
            "author_id":"manguy",
            "author_name":"Guyman",
            "choices":[
                "Isaac Schmidt, 25, White, 5'11, 160 lbs., Blonde",
                "Andrew Walsh, 19, White, 6'1, 208 lbs., Red",
                "Jeffery Zhao, 21, Asian, 5'6, 123 lbs, Black.",
                "Max Marquez, Hispanic, 5'9, 160 lbs. Brown",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Next, the system asked you a series of questions to identify your appearance, traits, and overall life status. First, it asked your name, and then it focused on your physical characteristics, such as age, race, height, weight, and hair color. Which description best describes you?<br>\r\n</span></div></div>",
            "created":1540478580,
            "id":2568445,
            "title":"Man"
        },
        "12":{
            "author_id":"permberton",
            "author_name":"permberton",
            "choices":[
                "Tara Green, 23, White, 5'6, 130 lbs., Strawberry-Blonde, 34B-27-34",
                "Cari Raymond, 18, White, 5'0, 95 lbs., Brown, 30AA-23-28",
                "Valeria Vazquez, 29, Hispanic, 5'8\", 140 lbs., Brown/Black, 36B-28-35",
                "Lei Chao, 26, Asian, 5'6\", 115 lbs., Black, 32B-22-25",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Next, the system asked you a series of questions to identify your appearance, traits, and overall life status. First, it asked your name, and then it focused on your physical characteristics, such as age, race, height, weight, hair color, and measurements. Which description best describes you?</span></div></div>",
            "created":1524859440,
            "id":2484949,
            "title":"Woman"
        },
        "122":{
            "author_id":"permberton",
            "author_name":"permberton",
            "choices":[
                "Yes, there were a ton of interesting profiles",
                "Yes, there was one interesting profile",
                "No, I decided to move on to more narrow swaps"
            ],
            "content":"<div class=\"\"><div> <span>After inputting your physical attributes, the system began asking questions about your current life status. That was rather simple and boring. You were a recently-turned 18 year old high school senior, getting ready to go to college. You were neither popular nor unpopular, and you were smart enough to get into a decent state school, but certainly no genius. You were cute, but in a more childish way than you would prefer. Honestly, you blended into your school perfectly, and sometimes you felt as though if you just stopped showing up, no one would notice.<br>\r\n<br>\r\nAfter collecting the more in depth biographical data, the system prompted you to upload a photo. You opted to use the one you had recently submitted to your college to get your student ID. It was just a selfie of you, with some nice makeup on (trying to appear more mature), and a generally expressionless face. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2vUTrIc\" target=\"_blank\">https://bit.ly/2vUTrIc</a><br>\r\n<br>\r\nYou felt as though this picture perfectly summed you up: expressionless and generic. Not hard to look at but imminently forgettable. After uploading the picture, the system then asked you to describe what you were looking to swap. You hadn't really thought about that. Honestly, the whole thing was just a curiosity for you. Given that it was so difficult to pick and choose what you wanted to improve or trade, you just started by looking at people who were looking to perform a \"complete, non-identity\" swap, where everything except your name and family was swapped. Despite your dissatisfaction with yourself, you did love your family, and didn't want to lose them. Under a CNI swap, reality would merely alter to accommodate the swap. Sometimes this meant your family got younger or older to adjust, other times, usually in the event of significant age swaps, your parents could become your siblings, and your siblings could become your nieces and nephews, or vice versa.<br>\r\n<br>\r\nYou could filter your results by almost anything: age, gender, race, hair color, occupation, etc. The only real filters you had were that you wanted to remain a girl, and you were interested in being more unique or interesting. You weren't yet sure what that would entail, but then again, that's what browsing was for. Over the next few hours, you found yourself getting lost in the seemingly countless profiles of others in the system. Ultimately, however, did anything you found interest you?</span></div></div>",
            "created":1524866520,
            "id":2484970,
            "title":"Cari Raymond, 18, White, 5'0, 95 lbs., Brow..."
        },
        "125":{
            "author_id":"permberton",
            "author_name":"permberton",
            "choices":[
                "Sasha Sirotkin, 20, 5'7\", 125 lbs., Dark Brown/Black, 32C-22-32",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What description best describes you?</span></div></span></div>",
            "created":1529710500,
            "id":2510876,
            "title":"Other"
        },
        "1251":{
            "author_id":"permberton",
            "author_name":"permberton",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><div> <span>You were a young college girl named Sasha, who was logging onto lifeshop.com because she felt as though her life was falling apart after her boyfriend of over a year, Colin, had suddenly and abruptly left her. Being dumped so unexpectedly had hurt, however, the days and weeks that followed really threw you for a loop. You spoke to as many people as you could, trying to figure out why Colin had left you, and much to your chagrin, you discovered that he had left you for another woman. And not just any woman, but Becky McAllister, a woman who you had never considered to be in your league.<br>\r\n<br>\r\nYou never thought of yourself as being overly vain, but you knew that you were quite attractive, and on the upper end of the spectrum as far as girls at your school went. It wasn't as though you didn't have options aside from Colin, as men frequently approached you in all variety of settings, trying to work an angle and see if they had a chance. Your powers of attraction stemmed in equal part from your natural beauty, courtesy of your parents' slavic heritage, as well as your persistent efforts at beauty and fitness. You were taut and thin, with decent-sized boobs that were firm and pert, if not overly large. You had alabaster skin, and striking dark hair that gave you a unique and memorable appearance.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2K8VCut\" target=\"_blank\">https://bit.ly/2K8VCut</a><br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2K5I4Eg\" target=\"_blank\">https://bit.ly/2K5I4Eg</a><br>\r\n<br>\r\nBecky, on the other hand, had rather plain features, and looked like most any other boring, white girl. Also, it was clear that Becky had not seen the inside of a gym in quite some time, which seemed to feed the only competitive advantage she may have had over you, as the one thing that Becky had in spades was curves. She was rather short, but for a small girl, she was built like a mountain road, with massive tits, and a plump, burgeoning ass. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2twp86j\" target=\"_blank\">https://bit.ly/2twp86j</a><br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2MfZTNd\" target=\"_blank\">https://bit.ly/2MfZTNd</a><br>\r\n<br>\r\nYou had always thought that the fact that she was out of shape and doughy would mean that she could never hope to be a threat to you, but apparently you were wrong. And the stories were confirmed, as you noticed Becky and Colin strolling around campus, hand in hand, clearly enamored with one another. You watched as Colin stealthily caught glimpses down Becky's top, or allowed his hand to slide down her back a bit too far when they hugged goodbye. <br>\r\n<br>\r\nWhich brings us back to why you were on the computer, browsing lifeshop.com. A friend of yours who was studying abroad had told you about the site, which apparently allowed people to barter away aspects of their life, ranging from the physical, to the mental, and everything in between. If you wanted to trade hair with someone, you could. If you wanted to trade jobs, you could. You could even trade intangibles, like sexual orientation or intelligence. The world was essentially your oyster, and history would rewrite itself such that it was as if what you chose to swap had always been that way. <br>\r\n<br>\r\nThe breakup, and Colin's subsequent relationship with Becky had taken quite the toll on your self confidence. What were you doing slaving and toiling away at the gym in an effort to keep your body in tip-top condition, if some big-titted, Freshman 15 gaining, twat could just stroll up and pry away your man? Maybe the grass was greener on the other side, or at least that's what you were thinking. At a minimum, you at least wanted to chat with someone more like Becky to see if it was all it was cracked up to be.<br>\r\n<br>\r\nWhen you opened the site, you narrowed your filter to the \"weight\" section, and specifically to \"curves.\" You then filtered for people looking to give rather than receive, and started browsing. Most of the women you saw were, however, were merely fat and unattractive. These weren't the type of people you wanted to swap with. If you were going to go curvy, you wanted someone who projected a certain air of confidence, in addition to being a bit jiggly. Suddenly, you stopped on a profile that really reached out and grabbed you. It was a woman named Aryanna Davis, who had a beautiful face, framed by bright, vivacious red hair, that cascaded over a pair of mountainous tits that would have made even Becky jealous.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2toN10g\" target=\"_blank\">https://bit.ly/2toN10g</a><br>\r\n<br>\r\nMuch to your joy and delight, Aryanna was online, so you shot her a message, asking if she were up for a chat.<br>\r\n<br>\r\n\"Of course,\" she quickly replied. \"What's on your mind?\"<br>\r\n<br>\r\nYou quickly dove into an explanation of how your boyfriend had left you for a curvier girl, which made you wonder whether or not it might be something that you would enjoy, and you asked whether or not she enjoyed her physique, and also why she was looking to give it up.<br>\r\n<br>\r\n\"First of all,\" Aryanna replied, \"I love my curves. I always have. I have never had a problem attracting a man, not that it should matter, and I love the way I look. I would have never joined this site except that I don't really have a choice. I have a medical condition that requires me to lose weight, and unfortunately, my build and physique just won't allow me to lose as much as I need to. So I'm looking for someone with a slighter build with whom I can swap. Ideally it would be someone who doesn't easily gain weight, as the heavier I am the worse my condition becomes.\"<br>\r\n<br>\r\nYou asked whether or not the condition would be transmitted through a swap, and Aryanna assured you that it would not.<br>\r\n<br>\r\n\"I would never do that to someone else. All that I am looking to swap is my weight, curvature, build, and general physique. My underlying condition remains with me, but it will be dramatically improved once I'm smaller.\"<br>\r\n<br>\r\nAryanna then asks whether or not you could send a picture of your physique, and offers to send one of hers first. Still unsure, you agree only because you haven't yet agreed to anything. You quickly receive a photo through your direct message, and you wait as it opens.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2MRUnkX\" target=\"_blank\">https://bit.ly/2MRUnkX</a><br>\r\n<br>\r\nInitially you're shocked, as it is clear that Aryanna's first picture was not just a creative angle. Her tits really are that huge, and you are shocked at how much her body tapers inward before flaring back out into broad, luscious hips. Every inch of her figure is covered in a soft layer, however, she doesn't appear to be fat or rotund. <br>\r\n<br>\r\n\"How big are your boobs, if you don't mind me asking?\"<br>\r\n<br>\r\n\"Why would I? It's what we're here for,\" she replied. \"I'm a 36HH, all natural. It's a lot to lug around, but believe me, they make an impression, and I will be truly sad to see them go.\"<br>\r\n<br>\r\nNow it was your turn. You quickly pull your shirt off and snap a pic in your bra and sweatpants in the dorm bathroom.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2Kdmdd8\" target=\"_blank\">https://bit.ly/2Kdmdd8</a><br>\r\n<br>\r\nAryanna takes a moment, obviously to look over your picture, and you find that you're waiting with bated breath. After a minute, she responds, \"Well, I think you're perfect for me, and I'd definitely swap if you were down.\"<br>\r\n<br>\r\nThe real question is, were you?</span></div></div>",
            "created":1529714400,
            "id":2510889,
            "title":"Sasha Sirotkin, 20, 5'7\", 125 lbs., Dar..."
        },
        "12511":{
            "author_id":"permberton",
            "author_name":"permberton",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><div> <span>\"GREAT!\" Aryanna replies in all caps, \"I've been waiting for a while to find someone who was interested and who matched what I need, so this is so exciting!\"<br>\r\n<br>\r\nShe then explained that she would propose the swap, and you would accept, however, both of you would need to log in the following morning and re-accept to initiate the swap. This was to prevent any people drunkenly swapping themselves and waking up to regret it. Additionally, the site allowed a 30 minute period after the swap during which you could back out. This gave you a lot of comfort, as you knew that there were still multiple ways for you to pull the plug on this whole thing.<br>\r\n<br>\r\nThe following morning you awoke to a message from Aryanna. \"Let me know when you're up and ready. I already re-accepted.\"<br>\r\n<br>\r\n\"I'm up,\" you stated, as you logged into the prompt to re-accept.<br>\r\n<br>\r\n\"So you're sure this will alter history, right? People won't think I suddenly gained a bunch of weight?\"<br>\r\n<br>\r\n\"Absolutely. Once we're done, you can check out all your old pictures, and they'll be of the new you.\"<br>\r\n<br>\r\nKnowing that you could still go back, you overrode your initial hesitations and hit the button to re-accept. This prompted a timer to pop up on your screen, counting down 30 seconds until the swap. As Aryanna had suggested, you were sitting on the bed in just a bra and panties. Even though the site would cause your clothes to adjust to the new you, it would take longer if you were wearing more. You ran your hands through your hair nervously as you waited.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2lrJJVF\" target=\"_blank\">https://bit.ly/2lrJJVF</a><br>\r\n<br>\r\nFinally, the timer hit zero, and almost immediately, you felt a warm rush come over you, followed by a tingling sensation over your entire body. The first thing you noticed was that your clothes were adjusting. The waistband of your panties relaxed and eased away from your narrow hips. Had you been standing, it likely would have fallen down. Next, the cups on your bra ballooned outward, leaving a chasm of space between your firm tits and the silky garment. You reached behind yourself and checked the tag, which read \"36HH,\" just as Aryanna had promised.<br>\r\n<br>\r\nAll of a sudden, you became nervous. You couldn't believe what you had agreed to do, but like a trip on an airplane, you were riding this thing until it came down, one way or another. A sharp pain began to shoot through you, as you felt your skeleton and build realigning. Your pelvis grew wider, your center of gravity lowered, and most every aspect of your internal makeup broadened. Looking in the mirror, you couldn't help but notice how odd you looked, with the frame of a larger girl, but none of the flesh to fill it out. You arms and legs looked like nothing more than skin and bones, and your tiny stomach was stretched thin as it was being asked to cover a decidedly larger area. <br>\r\n<br>\r\nThis strain, however, was short lived, as almost like a hose filling a water balloon, you could feel soft flesh flooding your body. Everywhere you looked, things began to fill in. Your hips again made contact with your panties, as the sides began digging into a much more substantial you. You watched as the gap between your thighs narrowed until it disappeared, and then you watched as your thighs pressed tighter and tighter together as they swelled.<br>\r\n<br>\r\nThe years of work in the gym slowly vanished, as your washboard stomach disappeared, only to be replaced by a soft layer of baby fat which never turned into a roll, or a potbelly, but which pushed the waistband of your panties outward and caused it to distend ever so slightly. You poked your now soft tummy, and were amazed at how plush it felt as it recoiled from your finger, only to push back outward once you pulled your hand away.<br>\r\n<br>\r\nNext, you felt the pressure building in your chest, as your boobs quickly surged forth. Your previous handfuls were rapidly approaching the outer limits of a bra you had previously not known to exist in such a massive size, and you noticed that the perkiness you had become used to was fading, and in its place was a heavy pendulousness which you could feel begin to put additional strain on your back. You could tell that Aryanna was right about this load being a difficult one to carry, and you weren't even done yet. You gasped as your new tits pressed up against the confines of your bra, and even began pushing over the top. You felt the underwire hoisting your boobs up begin cutting into your soft, jiggly flesh, and just before things started to hurt unbearably, your tits wobbled into place and stopped their advance.<br>\r\n<br>\r\nFor a few more minutes, you felt every aspect of you fluff up just a bit. You ass cheeks swole from their previous tight bubble shape into something more akin to a pair of basketballs. The cheeks on your face also filled in, as you became far less angular, and more smooth and rounded. Even your lips fleshed out, become plump and eminently kissable. <br>\r\n<br>\r\nFinally, the tingling subsided, and you strode over to the mirror to catch a glimpse of the new you. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2KjM6rA\" target=\"_blank\">https://bit.ly/2KjM6rA</a><br>\r\n<br>\r\nYou saw a face which was equally familiar and foreign, as it looked similar to you, but nothing like you at all. You stared in awe at the figure which had previously been Aryanna's, and which had left you so dumbstruck the night before. Now the mammoth tits were yours, as was the lush figure beneath it. You turned around to inspect the back side of this new you, and you were equally taken aback. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2MdLPDY\" target=\"_blank\">https://bit.ly/2MdLPDY</a><br>\r\n<br>\r\nThere was no doubt that the girl staring back at you was thick, and maybe even a little chubby. But you couldn't help but notice a subliminal sexuality that oozed from this visage. You noticed it in the hypnotic sway of her walk, or the pendulous wobble of her immense tits, or even in the smoky gaze of someone who appeared more woman than girl.<br>\r\n<br>\r\nThe real question, however, was whether or not you liked it?</span></div></div>",
            "created":1529716320,
            "id":2510896,
            "title":"Yes."
        },
        "125111":{
            "author_id":"permberton",
            "author_name":"permberton",
            "choices":[
                "His focused was already transfixed elsewhere.",
                "His head turned on a swivel, following you as you walked past."
            ],
            "content":"<div class=\"\"><div> <span>You were mesmerized by your own reflection. The soft, touchable skin and thick, luscious curves drew your eyes up and down your body. You still looked loosely like yourself, but a much different version of the person you once recognized. Gone was the light, bouncy girl who flitted about, replaced by the slower, sultrier woman who now sashayed around your apartment and strutted in front of your mirror. <br>\r\n<br>\r\nYou hurried into your bathroom to get a glimpse of yourself in better light. As you walked, you could feel the roll of your hips, and the heavy jiggle of parts of your body which had never jiggled before. Your ass quivered and bounced with each step, and your tits strained the confines of your newly enlarged bra. Even the soft pooch that pushed the waistband of your thong outwards shuffled a bit as you walked confidently into the bathroom.<br>\r\n<br>\r\nThe change in light did nothing to change the vision before you. You marveled at your pale skin and plush features. You were awestruck at the way your waist cinched in beneath burgeoning boobs before flaring out again with equally wide, sturdy hips. You lifted the strap of your thong away from your side and noticed how it dug into your soft flesh. You greedily hefted one of your tits in your hand and chuckled as you hadn't a chance of holding the entirety of it, and instead just watched it overwhelm your small hands, spilling out of all sides. <br>\r\n<br>\r\nAfter another moment of revelry, you strode back to the computer to see a message from Aryanna. <br>\r\n<br>\r\n\"HEY!! Let me see how you look!?!? How'd it go??\" she asked.<br>\r\n<br>\r\n\"Sorry, I was just taking it all in,\" you replied. \"I never knew how it felt to be curvy.\"<br>\r\n<br>\r\n\"A real trip, no? I actually think I'll miss it, but c'est la vie, life comes first, and those tits were going to kill me, literally. I'm glad you can put them to good use.\"<br>\r\n<br>\r\nYou uploaded a picture from your impromptu bathroom photo shoot and sent it over to Aryanna.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2Kak26b\" target=\"_blank\">https://bit.ly/2Kak26b</a><br>\r\n<br>\r\n\"Dayyyyyum, girl. You carry that body better than I did!\"<br>\r\n<br>\r\nYou blushed at her compliment, and responded \"now let me see you!\"<br>\r\n<br>\r\n\"Oh, sorry, forgot,\" she replied as she shot over a quick picture.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2vnZlxY\" target=\"_blank\">https://bit.ly/2vnZlxY</a><br>\r\n<br>\r\n\"It's weird. I feel like half of me is missing, and it essentially is. There C cups feel like nothing, lol. I suppose it will just take some getting used to. I do feel a lot lighter on my feet, which is certainly new.\"<br>\r\n<br>\r\nThe two of you chatted for a while, giving each other tips and pointers on how to adjust to the new versions of yourselves. Finally, however, you said that you had to go, as there were other things on your mind. You each promised to stay in touch, and could feel a genuine friendship forming.<br>\r\n<br>\r\nAfter finishing your chat, you smirked as you got ready for class, as this next class was with Colin, and you wanted to see how he would react to the new you. You were running a bit late, so you just grabbed one of your favorite outfits, a pair of blue jeans and a stretchy cheetah-print tank top. Back when you were skinny, this was one of your go-to outfits for class. However, while the sizes had changed to accommodate the new, larger you, the look was quite different. <br>\r\n<br>\r\nPreviously, the top had come up nearly to your neck, settling into a nice scoop-shape that allowed you to wear a cute necklace to finish the look. Now, however, both of your best accessories were permanently affixed to your chest, and the previously modest scoop had been dragged down to reveal a deep chasm of cleavage. There was no hiding the size of your massive mammaries, and they seemed to bounce and wobble of their own volition as you turned from side to side to catch a glimpse. You decided to skip the necklace, as a pair of tits like yours were far superior to any glimpse of gold.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://bit.ly/2NYIycJ\" target=\"_blank\">https://bit.ly/2NYIycJ</a><br>\r\n<br>\r\nSatisfied, you smirked to yourself and bounded off to class, turning heads and inviting stares wherever you went. Once you arrived, you noticed Colin sitting in his usual seat, at the front and closest to the door. You ignored him, idly brushing past as your prodigious hips made contact with his desk. How did Colin react?</span></div></div>",
            "created":1532996040,
            "id":2527080,
            "title":"Yes."
        }
    },
    "info":{
        "author_id":"permberton",
        "author_name":"permberton",
        "brief_description":"If you're unhappy with your own life, why not consider shopping for someone else's?",
        "created":1524853620,
        "description":"<td align=\"left\" class=\"norm\">Imagine that a company developed the technology to allow people to swap lives. This could be as simple as a career swap, or as involved as a complete swap, where body, career, memories, intellect, family, etc. are all swapped. I generally do most of my writing in second person, but if you want to use first or third, be my guest.<br>\r\n<br>\r\nGenerally, I am open as far as direction is concerned, I just ask that all posts be thoughtful and include more than just a series of new options. I reserve all rights to modify or remove content at my discretion for any reason, although I will likely give you an explanation as to why I removed something.<br>\r\n<br>\r\nPlease nothing grotesque here. No depictions of anything illegal. You know what I'm talking about, so please don't go there.</td>",
        "id":2156600,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1540478580,
        "modified":1540478580,
        "pretty_title":"Life Shopping"
    }
}