{
    "chapters":{
        "1":{
            "author_id":"secret000",
            "author_name":"secret",
            "choices":[
                "You are having some fun with your boyfriend...",
                "You secretly have your way with your crush (John) while he is asleep...",
                "A prank on you, a guy cums in your drink at school and you don't know...",
                "You are getting naughty with your brother (15), Alex...",
                "More options..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To start with, how do you discover your ability?</span></div></span></div>",
            "created":1235365200,
            "id":651654,
            "title":"To begin..."
        },
        "11":{
            "choices":[
                "Continue sucking James",
                "Go all the way and have sex for the first time",
                "Suddenly he starts cumming",
                "He gets a little rough and tries anal on her"
            ],
            "content":"<div class=\"\"><div> <span>It's a rainy day and Kelsey and her boyfriend James are stuck inside.<br>\r\n<br>\r\nKelsey takes this as a good opportunity to play around a little bit. <br>\r\n\"Come on James, let's go up to my room\"<br>\r\n\"Sure\"<br>\r\n<br>\r\nWhen they get up there they start making out. One thing leads to another and soon she's got his penis in her mouth. This is the first time she's ever given a blowjob so she's a little nervous. But that all goes away, she's a natural. At this point she is considering weather to go all the way.</span></div></div>",
            "created":1281589200,
            "id":934703,
            "title":"She is having some fun with her boyfriend..."
        },
        "113":{
            "author_id":"kibocard45",
            "author_name":"WrittenPaper7",
            "choices":[
                "Her body began to boil(changing)",
                "Go Downstairs",
                "Finish herself"
            ],
            "content":"<div class=\"\"><div> <span>She feel the warm cum that James release in Kelsey mouth. He jerked his lower body with little thrusts.<br>\r\n<br>\r\nTo Kelsey it was less than a minute, and to James it's like he ran a marathon. As she suck her boyfriend off he also was getting flaccid. Doing her best to get him erect in his soft state; bobbing, licking, and playing with his testicles, but all he did a was cum again in his flaccid state.<br>\r\n<br>\r\nKelsey is unsatisfied with her boyfriend first load came too fast. His second load same as the first, but a bit watery. Than James on the verge of passing out, leaving Kelsey all heated.<br>\r\n</span></div></div>",
            "created":1589093760,
            "id":2833343,
            "title":"Suddenly he starts cumming"
        },
        "1131":{
            "author_id":"kibocard45",
            "author_name":"WrittenPaper7",
            "choices":[
                "Kelsey returned to normal",
                "Explore her new form",
                "Parents are home"
            ],
            "content":"<div class=\"\"><div> <span>Kelsey felt her body heating up, that she thinks it's arousal, but than felt her chest and genitalia began to burn. Even her head was getting fuzzy, as so her hearing begins to ring.<br>\r\n<br>\r\nPanting heavily as falling to her knees, and arms against her burning chest. Kelsey drop her head to the floor to get her baring, but feels her body full of pens and needles. As the burning subsides, and struggling to stand, getting herself back...<br>\r\nfeel tend, as different. She takes a deep breath and places a hand on her. Her hand lay flat on her breast, her toned chest.<br>\r\n<br>\r\nSilent crowded the room as the rain sing itself outside. Rushing to the light switch she did brightens the room. Seeing her now light tone skin, unlike her pale skin she shot her gaze to her full mirror to see a nude James looking back, but turn to see him pass out on your bed.<br>\r\n<br>\r\n\"Oh god,\" is all you could say to your shock.<br>\r\n<br>\r\nYou look like him, you sound like him the similarity are crazy, but the only difference you see are your genitalia. Your penis compared with his is bigger, because you're pass the navel. Even the scrotum; as yours are more rounded then his.<br>\r\n<br>\r\nThis is crazy, Kelsey mind is blown that she somehow copied James body that she yearns for. She or he. Kelsey sat on her computer chair; confused, lost, worried, and the erection isn't helping. Sitting here won't help something has to be done.</span></div></div>",
            "created":1589099340,
            "id":2833355,
            "title":"Her body began to boil(changing)"
        },
        "12":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "You 'scratch' it... and change into John!",
                "You meet back with Sara, and change while talking to her! Yikes!",
                "On the way home nothing odd happens and you try to figure out this weird feeling",
                "John was faking sleep and comes downstairs to confront you in front of Sara",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>\"So, it was totally cool.\" Sara says, you trying desperately to pay attention. \"He, like, kept ahead of all of them, the look on their faces as he pulled ahead! God they were so pissed! No-one can run like Luke!\"<br>\r\n<br>\r\nSara was a... friend... sort of. It was complicated. Yes, you liked her, but she was way too talkative and way to into sports for your taste... well, into a sports player in particular. As she kept on about Luke's exploits in her fawning way you couldn't help but glance up at the real reason you were here. A few minutes ago John, Sara's brother, had gone upstairs. Even now you knew he was crawling into bed. Yes, it was a little unfair to put down Sara going on about Luke when all you can think of was John... OK, no, he wasn't all you thought of. Frankly the guy was a bit of a dick.. but he was SOOO cute!<br>\r\n<br>\r\n\"Oh, the laundry!\" Sara gasps and jumps up. \"Mom will kill me if I don't get it in the drier! Give me a few minutes, will you?\"<br>\r\n<br>\r\nYou sigh with relief as Sara leaves the room. Will doing laundry be enough time? You can't help but try. You only want a look... yeah right!<br>\r\n<br>\r\nCreeping upstairs you try  several doors before stumbling on John's... and your jaw drops in shock. John was in bed alright... nude... on top of the covers!<br>\r\n<br>\r\n\"Holy...\" You put your hands over your mouth as you stare at him. Yup, still a dick, but WHAT a dick! You giggle at the joke but... oh hell could you? Really? The thought of... doing him without him knowing is intoxicating. Reaching under your skirt you slide your knickers down and put them in your purse then creep over to his bed. He is breathing deep but not snoring. It's so unfair that a body like this is given to a jerk like John... but you don't need to engage his mind, just his body! Your mind glazes over the fact that he might wake up, doesn't even enter into it.<br>\r\n<br>\r\nCarefully you climb onto the bed and straddle him, gently taking hold of his twitching rod with fingertips. Hot! Literally! Slowly you crouch down and feel his hardness press against your swollen lips and moan faintly as they part around the intrusion. Thankfully you've already dealt with your virginity yourself. A little over eagerness with the vibrator and a lot of sheet cleaning to clean up the blood a few years ago put an end to that. So, there was no obstruction as he filled you magnificently. The heat, the throbbing fullness as it slid in made you throw your head back and moan as your bum finally landed on his lap gently.<br>\r\n<br>\r\n\"Fuuuuuck!\" you groan softly, then begin the age old motion, lifting and lowering onto his sleeping body.<br>\r\n<br>\r\nYou can't believe you're doing this! But the feelings, oh god the feelings! Heat washes over you, your breath ragged as you pump on him. Your finger finds the familiar bump of your swollen clit and circles it tightly, enhancing the sensations. It doesn't take long and you shove a fist into your mouth as you come, stifling your scream and... you feel the spasm below too as John comes! Oh god!<br>\r\n<br>\r\nYou freeze, the heat ebbing, still wonderful, as you dread him waking up... but an idle snort and snore shows he's still asleep.<br>\r\n<br>\r\nIncredible! Slowly, not daring to risk a second (though you REALLY want to!) you pull off him and... feel rather odd. Something is different. Wrong. It feels like something is tugging inside you.<br>\r\n<br>\r\nGrabbing your purse you leave the room, not even bothering to put your panties back on as that tugging sensation calls to you. It's like an itch you need to scratch.</span></div></div>",
            "created":1336712400,
            "id":1334436,
            "title":"Let sleeping Johns lie."
        },
        "121":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "You manage to 'scratch the itch' again and turn back into you.",
                "You have no idea how to turn back. What now?",
                "John wakes up before you can decide what to do!"
            ],
            "content":"<div class=\"\"><div> <span>Leaning on the door jam outside the room you shiver, that odd sensation seeming to crawl up and down your spine. Pulling your shoulder blades back seems to help a bit, but it's really odd. It's like there is a... liquid, or something inside and when you twitch muscles near it it flows away to make something else itch. Stretching and twisting you finally feel something connect. Like a... a bloom? It's just...<br>\r\n<br>\r\nSuddenly your bones creak, you ache all over and... stretch? Not with your arms or back, but streeeeetch! You can feel the bones in your spine shifting!<br>\r\n<br>\r\n\"Eeaaarggh!\" you grunt as your clothes are suddenly tighter and looser at the same time. Your skirt is waaay too tight, but your blouse is loose, but also not long enough any more? That flowing feeling is making your skin feel funky everywhere. It's like pins and needles and... you wave your hand and it feels, wrong somehow. For a moment you could swear your hand is lower on your forearm than it should be... then something snaps inside you... and it's right again.. wait, is it? Blinking you try to make it out. Your vision is a little blurry, but isn't your hand bigger now? Wider fingers, bigger hand over all.<br>\r\n<br>\r\nYou shiver again and...<br>\r\n<br>\r\n\"What the fuck?\" You whisper to yourself, barely managing to avoid shouting it.<br>\r\n<br>\r\nYou felt your skirt stroke against you between your legs but... it didn't feel right! Glancing down you see... Oh god! To hell with what you're feeling between your legs, your breasts have gone!<br>\r\n<br>\r\nYou panic and dart back into John's room and the mirror on the door... and get one hell of a shock.<br>\r\n<br>\r\nYou ARE John! OK, John dressed in your clothes (and almost splitting your skirt's waist band!), but definitely John: Broad shouldered, toned abs (way too much weight lifting in your opinion), well muscled legs and... you reach between your legs. Yup... that was what you had felt earlier.<br>\r\n<br>\r\n\"Oh hell!\" you mutter feeling it start to swell. No wonder boys can never keep their hands to themselves if they get aroused at the drop of a hat like this!<br>\r\n<br>\r\n\"Kelsey?\" Comes Sara's voice from downstairs. Uh oh! You waited too long. Sara is done with the laundry!</span></div></div>",
            "created":1336712400,
            "id":1334677,
            "title":"Kelsey becomes John"
        },
        "1211":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Try to change into John and back, to see if it wasn't all in your head.",
                "Just pretend you're sick and go home. You're just wierded out by all this.",
                "Think it through. What did you do different before changing?"
            ],
            "content":"<div class=\"\"><div> <span>What was that sensation again? Frantically you stretch like you did before... but that hadn't really been it, had it? You think you did something by accident WHILE you were stretching that made you... turn into John? How? Why? Aw hell, you don't have time to think about that, you just HAVE to change back before someone sees you!<br>\r\n<br>\r\nSuddenly, you find it, a pinching sensation feeling like  it's all down your back and.... you squirm, this time expecting it, and feel your body shift back to what you are more familiar with. You've read somewhere that the body has some kind of subconscious 'mental map' of where all the bits are. That's how you  can move your hand somewhere you can't see and know where it is.. While you're changing this mental map must be all screwed up. Your limbs feel wrong, too short, too long, head too high, too low, it's tricky to avoid falling over... then after maybe twenty seconds things stabilize and you feel like you again... completely. That feeling of bones rearranging is really creepy!<br>\r\n<br>\r\nPanting you straighten your skirt, which thankfully didn't tear, and dash downstairs to Sara.<br>\r\n<br>\r\n\"Hey, Sara... um, where is your bathroom?\" you grunt, managing to get this in before Sara asks any awkward questions and visibly cross your legs.<br>\r\n<br>\r\nSara grins.<br>\r\n<br>\r\n\"Oh, back upstairs. You didn't see it on the right? We do keep the door shut.\" You make  an 'Oooooh' face and nod thanks and dash back upstairs again, finding the door (that you already knew where it was really) and go in, shutting it and collapsing in relief on the toilet.<br>\r\n<br>\r\n\"What the hell is happening to me?\" you whisper to yourself, staring at yourself in the mirror.</span></div></div>",
            "created":1336712400,
            "id":1334690,
            "title":"... and back again."
        },
        "12113":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Head home and try to work out the details, practice a little in private.",
                "You want to play with this. Maybe copy someone else?"
            ],
            "content":"<div class=\"\"><div> <span>\"I mean, really, how is this happening? Why is it...\"<br>\r\n<br>\r\nThat's when it hits you.<br>\r\n<br>\r\nThis the first time you had actual sex with  something that didn't require batteries!<br>\r\n<br>\r\n\"Sex makes me change into people?\" You blink. \"No, I didn't change at first... it... copied him? Made me able to change into him?\" You lean back, trying to work through this. \"Oh god this is confusing!\"<br>\r\n<br>\r\nYou are about to try changing again just to see if you can... then grin and purposefully slip off your skirt and panties, THEN change. They are way too tight for John! This time it doesn't pinch as much, but you still nearly fall over.<br>\r\n<br>\r\n\"Um, hi John.\" you say quietly, waving at your male reflection in the mirror. \"Fancy meeting you here! He he he.\" You realize that laugh sounded kind of strained and close your eyes and take deep breath... and open them again... wait, is John that thin?<br>\r\n<br>\r\nStanding up and patting yourself (and purposefully trying to avoid looking between your legs for the moment!) you realize that you have the muscled physique of John but... are thinner. You step on the scales and realize you still weigh the same as before, 135lbs, what you always thought was heavy for you, even if you were a tall girl. But for a muscled guy like John, it's thin.<br>\r\n<br>\r\n\"Damn! That means I can't turn into a sexy girl without going on a diet first? Oh that sucks! Hmm, maybe It's just something I need to practice?\" Though you do seem to remember one of your physics teachers mentioning something about 'conservation of energy and matter' or something.<br>\r\n<br>\r\nMaybe you just can't change your weight at all... or... maybe if you eat a lot, then change into someone heavier it would stay? Maybe starving yourself for a short time and then changing into someone smaller would make you loose weight?<br>\r\n<br>\r\n\"Heck, worth a shot... though if it was sex that made me 'copy' John, how could I copy a girl?\" You blink as you realize you are already considering how to use this power. With a half minute long shudder you shift back to your body. It's getting easier but still  takes just as long. Seems it has to take a hair over twenty seconds no matter what.</span></div></div>",
            "created":1336712400,
            "id":1334698,
            "title":"Realization."
        },
        "121131":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "You consider having sex as John, with a girl.",
                "Would sex girl on girl work? You've never really thought about that before."
            ],
            "content":"<div class=\"\"><div> <span>You quickly apologize to Sara and leave, being thankful that John didn't wake back and come downstairs. You aren't sure you could have coped with seeing him right now!<br>\r\n<br>\r\nGetting home you say your 'hi!'s to your mom and slip upstairs while she is making dinner. With a slump you sit on your bed and wonder what to do.<br>\r\n<br>\r\n\"Well, maybe first the weight thing?\" you mutter to yourself and drag out your scales.<br>\r\n<br>\r\nLocking your door (you do NOT want Alex to butt in on this!) you strip and stand on the scales.<br>\r\n<br>\r\n134lbs<br>\r\n<br>\r\nYou sigh as you look at your slightly pudgy body. OK, some of your, um, body mass is you your chest and you know appeals to guys, but a lot of it is elsewhere unfortunately. Yes, you like snacks, but you don't really snack that much. Somehow you just seem to not loose weight well. You've seen girls eat more than you eat in a day during school lunch and still look skinny compared to you. It wasn't fair! Well, maybe you could get to loose some weight? But that would take a while you think.<br>\r\n<br>\r\nFirst things first. You pull out three packs of cookies, a little under three pounds in weight, and get stuck in. Ten minutes later you sit very happily on your bed with a full belly. After a little rest (and licking of lips) you get up and get on the scales.<br>\r\n<br>\r\nJust under 137lbs, as expected.<br>\r\n<br>\r\nYou groan from your fairly full tummy and then close your eyes. Leaning against the wall to maintain balance during the change you switch to John. Twenty seconds later, Kelsey is gone and John is back. Holding your hands up (or rather John's hands up) you gaze at the change.<br>\r\n<br>\r\n\"This is so cool!\" you say, marveling just at talking with John's voice... then realize you don't feel full any more.<br>\r\n<br>\r\nYou peer down towards the scales and see... Oh... that! Hard to miss it (pun intended) as erect as it is and... it's now yours... you guess.<br>\r\n<br>\r\n\"I suppose... it couldn't hurt... right?\"<br>\r\n<br>\r\nYou gently take the throbbing shaft in your hand and gently squeeze. Grinning from ear to ear you play with it for a few minutes but resist (just) making a mess right now... though you do really want to try that! It does feel good.<br>\r\n<br>\r\nPeering down again you finally see what you wanted to see before. Your weight.<br>\r\n<br>\r\nStill a little under 137lbs.<br>\r\n<br>\r\n\"It works!\" you say, then ponder and concentrate. Again you shift and after a long shudder and bone popping change Kelsey is back, and still not stuffed, and still 137 lbs! \"It REALLY works!\"<br>\r\n<br>\r\nNow, all you have to do is starve yourself till you can't take it any more and change to John and back. You shouldn't feel hungry then and can starve some more and change. That way you should slowly loose weight... plus you're pretty sure you can gain weight fast if you have to, say to imitate a larger person. Blinking you wonder. How low could you go? Could you imitate a child? Oh, no. No sex so you couldn't copy them, right? Not just that they would unable to HAVE sex, you wouldn't be able to bring yourself to do that anyway, so that pretty much sets a lower limit. An upper limit? Um, probably not really. As big as a person could go... and as big as a person that you could bring yourself to have sex with.<br>\r\n<br>\r\nLooking at yourself in the mirror you realize you do look just a hair pudgier, but your bust hasn't grown. Looks like the weight goes where it would normally go on you when you 'absorb' it, or what ever. If you want bigger breasts you're going to have to find someone with larger assets for you to copy... wait, how would you go about copying a girl?</span></div></div>",
            "created":1336798800,
            "id":1335462,
            "title":"Getting the details right."
        },
        "1211311":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Lindsey. You kind of like the way her hips sway.",
                "Sam, you could do with a bit of upper body 'strength'."
            ],
            "content":"<div class=\"\"><div> <span>Glancing down at your naked body you... twenty seconds later you stare at John's naked body and wonder:<br>\r\n<br>\r\n\"If me having sex with him did this, then if I had sex with a girl using this body would I get her body?\"<br>\r\n<br>\r\nThere is one problem with that thought. John doesn't have a girlfriend. Well, it's sort of a problem. He's hot, and quite a few girls (including one Kelsey Mattersley) seriously want to date him, but he's always blown them off... sometimes with a serious attitude! There was talk around about him being gay, but you've seen the inside of his locker. With those pinups that is very doubtful! But he's turned down quite a few hot chicks since you've been keeping an eye on him, so they might be a tad surprised if he suddenly agrees now. But you realize that will be his problem, not yours! And, hot as he is, he IS a dick and he probably deserves whatever comes of this.<br>\r\n<br>\r\nWith a chuckle, and some bone popping, you change back, not even wavering now, though it still feels weird.<br>\r\n<br>\r\nFirst things first. Clothes. You have nothing that would fit John, even a skinny John. You're going to have to go shopping... Oh darn! You grin at the prospect.<br>\r\n<br>\r\nSecond. There are at least three girls (other than you) currently trying to get into John's pants. Who to pick?<br>\r\n<br>\r\nSandy is the nicest, and really you don't want to do that to her. OK, it'd be more fun with her as she'd be more honest and caring, but afterwards she'd think she'd nabbed John... and John, the real John, would disagree. You couldn't do that to her.<br>\r\n<br>\r\nLindsey is a runner. A friend of Sara who is seriously into sports, sprinting specifically, and she and John have become friends. He's put his foot down publicly when Lindsey tried to take it further. She'd gone beet red that time, but didn't stop seeing John. She's a bit hyper, doesn't have any interests outside of sports, and you really don't like her at all. She does have rather a hot bod though. Little hippy, but very nice. Lots of guys stare at her ASSets as she leaves the room.<br>\r\n<br>\r\nSam is one of the school bitches. A group of four wander round being queens of creation, deigning to notice others only if they meet their rarefied heights of perfection. Real scum. Sam is one of the hanger-ons of the four, not really a 'major player' in the bitch field, but she does try REAL hard to make the grade! She'd probably get a B- in Bitchiness. She's sexy, though not as sexy as the 'Big Bitches', but has a truly magnificent chest. Easily DD.<br>\r\n<br>\r\nAs you dress casually and head out to the store for John clothes (managing to avoid your mom on the way out) you consider. Sandy is out, for the moment. You like her too much to do that to her, though that would be fun. She's a nice girl. That leaves Lindsey or Sam. Tricky to pick. John hasn't gone for either... or anyone else for that matter.<br>\r\n<br>\r\nYou leave the store with boxers, T-shirt and slacks (fun trying them on in the changing rooms. Glad you remembered to change back to Kelsey before leaving!) and stop at a shoe store too. When you were done you sit in the park and make your decision.</span></div></div>",
            "created":1340667780,
            "id":1367009,
            "title":"John-Kelsey could go on a date?"
        },
        "12113111":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Kelsey does some in depth 'practicing'.",
                "Someone surprises him in mid-'practice'"
            ],
            "content":"<div class=\"\"><div> <span>Yes, guys have been known to stare at Lindsey as she left the room... and you have stared once or twice yourself. Now you can imagine yourself, as John, throwing her over the end of a bed, her rump up in the air before you and you... getting stuck in.<br>\r\n<br>\r\nSome passers-by look at you oddly with you giggling by yourself on the park bench, but you don't care. The image in your mind is just too wonderful. Lindsey it is! However, you probably should practice first. Not the shape changing, the... masturbation thing. You could go home again, but it's quite a walk and you are rather impatient now. Especially with that image of Lindsey still rattling around in your head. The swimming pool is nearby and you could go into the changing rooms. Should be empty now, and if they catch you jacking off as John... well, it just puts John down, not you!<br>\r\n<br>\r\nYou gather your shopping bags and head off to the pool, finding the changing rooms and, after a pause to decide, go to the girl's changing rooms. Going in and leaving you'll be Kelsey after all. You don't want any of this coming back on you, so if someone sees you going into the girl's changing rooms... so what? OK, if they catch 'John' in there it could be trouble, but more for him, not you. Well, assuming you manage to sneak away.<br>\r\n<br>\r\nIt's quiet here this late, which is a little unusual. Most nights quite a few kids hang out here, even if not for swimming. There is a real nice view over the valley and it's free (always a plus). Plus the guys come around to see girl's wearing bikinis, and the girls come to see guys wearing tight tight trunks. Win all around usually. But the last few weeks most have been going to the park. Mainly after that newspaper article that posted the pic of Patty and Mike getting caught with their pants down by the lake!<br>\r\n<br>\r\nYou giggle, and check to be sure it's REALLY empty, then strip, put all the clothes (John's new stuff and Kelsey's) in your bag, and 'change'. With a shiver a naked 'John' sits down on the bench and stares at his groin with a silly grin on his face.</span></div></div>",
            "created":1340669580,
            "id":1367021,
            "title":"Rear View Lindsey."
        },
        "121131112":{
            "choices":[
                "A pair of younger girls 12 or 13",
                "Two girls from the bitch club and one is Lindsey"
            ],
            "content":"<div class=\"\"><div> <span>You sit on the bench staring down at John's large and very hard cock. You are a little surprised that it is still hard, but then maybe your body makes it hard when you shift into John form in preparation for sex. Or maybe guys can make it hard whenever they want, you are not really sure as you have zero experience in that department, being a girl and all. You reach down and grasp the hard cock, oh that feels good, slowly you start stroking it. OK now you understand why guys like that so much.<br>\r\n<br>\r\nYour contemplation and experimentation are interrupted by the sound of several girls giggling and laughing as they walk into the changing room. Their laughter stops as soon as they enter the room and see you sitting on the bench naked staring down and playing with your fully erect cock. you look up and see.</span></div></div>",
            "created":1342367160,
            "id":1379108,
            "title":"Someone surprises him in mid-'practice'"
        },
        "1211311122":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "\"You go Laura, I'm staying. John needs company.\"",
                "\"You're that scared of a bit of nakedness Laura?\" She persuades Laura to stay."
            ],
            "content":"<div class=\"\"><div> <span>No matter how much you felt being caught would just be 'John's' problem... right here, right now, you feel awful! Embarrassed as hell to be honest.<br>\r\n<br>\r\nYou stare at the two girls and try desperately to regain composure, constantly telling yourself that whatever you do it doesn't matter. Nothing will come back on you. It's still hard (no pun intended, but it really is... VERY hard!) to let go of the feeling that you should care what they think. With some effort you manage a mostly calm voice.<br>\r\n<br>\r\n\"Hey Lindsey. So, how's tricks?\" you say, still holding your rigid shaft, still naked on the bench.<br>\r\n<br>\r\n\"John?\" She says, quizzically, obviously not believing what she's seeing. You wouldn't in her shoes either!<br>\r\n<br>\r\n\"Er, yeah? Who else?\" You say, and to their amazement start to stroke again. Hey, it feels good so why not? Is this thing going to your head? Um, maybe.<br>\r\n<br>\r\nThe other girl almost chokes. You don't know her that well, a new addition to the bitch club to replace Anabel who changed schools last semester. You think her name is Laura. She looks pretty cute, more busty than the hippy Lindsey, and a good deal shorter, but still a looker. It's pretty much a pre-requisite for the bitch club!<br>\r\n<br>\r\n\"Lindsey? You know this douche bag?\"<br>\r\n<br>\r\nLindsey's face clenches in anger.<br>\r\n<br>\r\n\"This is John Laura!\" she says, forcing herself to speak calmly by the look of it, though her gaze is drifting to your crotch a lot. Calm is not the main thing on her mind! Anger at Laura, lust over you... er, John... whatever... she's pretty emotional right now, and fighting it. Or at least trying not to show it!<br>\r\n<br>\r\n\"OK, so it's John. Let's GO Lindsey!\"</span></div></div>",
            "created":1343444880,
            "id":1391332,
            "title":"Exposed!"
        },
        "12113111221":{
            "author_id":"stickemup",
            "author_name":"stickem",
            "choices":[
                "Someone else walks in",
                "Immediately turn in to copy of lindsey"
            ],
            "content":"<div class=\"\"><div> <span>\"Like , whatever\" responds Laura before leaving the way she came. \"Now don't be rude. Let your company have a seat\"  says Lindsey as she walks nearer. You  release your shaft putting your hands on the bench in preparation to move but Lindsey steps up in the way. \"May I?\" she asks. Nervous, you nod in acceptance just to appease her. A bit to your surprise down from her skirt slides Lindsey's panties, which she playfully slides off and tosses them on your shoulder. At this you feel the precum start to appear. But before you have a chance to clean it Lindsey is on top of it. Sliding down slowly you can't take it and blow your load in her.  </span></div></div>",
            "created":1388227680,
            "id":1715861,
            "title":"\"You go Laura, I'm staying. John needs ..."
        },
        "121131112212":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "You can't get it. She turns and sees... herself. \"What?\"",
                "You manage a VERY quick change. THAT HURTS. But Lindsey sees John, not herself."
            ],
            "content":"<div class=\"\"><div> <span>Lindsey's rump is kind of covered by her skirt so you don't get to see as much as you'd like as she faces away from you and sits.... dooooown. Hoooly cow! The... sensations the... silky smooth squeezing. It's like a liquid massage! It's too much and...<br>\r\n<br>\r\n*SQUIRT*<br>\r\n<br>\r\n\"John?\" Comes the incredibly disappointed voice from Lindsey, still facing away from you... and a damned good thing too, as as you are still jerking and shuddering through the sensations the itch comes, but you are still tensing from cumming... and immediately change!<br>\r\n<br>\r\n'Oh shit!' you think, as your bones shift, twitch and move. This time it's faster, but it HURTS! You grit your teeth as Lindsey sighs melodramatically, presumably thinking you shifting is just more of your cumming. Shoulders pull together, hips shift apart, your shirt fills a little tightly (She isn't Sam, but... yeah, bigger than you), and your shaft shrinks and draws out her with a wet plop before vanishing completely.<br>\r\n<br>\r\n\"I see... done are you?\" Lindey says in an icy voice.<br>\r\n<br>\r\nYou desperately search for that itch again. Gotta change back, gotta change back! You can see her wanting to turn to look at you.</span></div></div>",
            "created":1452892860,
            "id":2089690,
            "title":"Immediately turn in to copy of lindsey"
        },
        "1211311122122":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Could go back to Sam?",
                "Sandy? She's nice, maybe... you could trust her? Tell her the truth?"
            ],
            "content":"<div class=\"\"><div> <span>You are practically sweating, and you can feel bones <i>grate</i> together! But thankfully Lindsey waits a few seconds before turning around, and it's John she sees. A sweating John gritting his teeth, but John nonetheless.<br>\r\n<br>\r\n\"You know, from your reputation I'd expected a good deal...\" she pauses, and you realize you have an erection again. \"... more?\" She raises an eyebrow, then smiles, reaches down and re-positions it, and sits once more, sliding it home into her still wet and steaming hot channel. She stares at you over her shoulder. \"No rushing this time!\"<br>\r\n<br>\r\nStill feeling the burning sensation in all your joints you manage to smile back and wait until she turns to front again before grimacing in pain. Slowly, while Lindsey begins to thrust down on you, the pain lessens, but what did that do to you? Is it safe to change that fast? You sure as hell don't <i>want</i> to do that again! But... this... ooooooh boy! No wonder guys are always so horny!<br>\r\n<br>\r\nWet flesh ripples over you down there, muscles clenching and gripping, liquid squelches heard as she pumps harder and faster. It's hard, but somehow you manage to hold off. Pretty obviously she'd be real pissed if you came too soon a second time. No wonder guys can't hold back. Good god this is torture! Oh sweet torture! Yes!<br>\r\n<br>\r\nFinally you feel her shudder, throw her head back (almost smacking you in the mouth!) and utter a grunt as she comes, shuddering. As she does her sex clamps down hard, the added pressure sending you over the edge too, pumping into her depths.<br>\r\n<br>\r\nNow both of you are sweaty and exhausted, but Lindsey merely smiles, glancing over her shoulder and winks at you, then stands up (only a tiny bit shakily) and straightens her skirt.<br>\r\n<br>\r\n\"I'm going to take a shower John. It's so nice to finally... know you.\" and she smirks and heads off to the showers.<br>\r\n<br>\r\nWow. You got her. In both senses of the word! Once she's gone you stand up, strip off the remains of your clothes, and glance around to make sure no-one sees you. Once you're sure your alone you change, slowly, back to Lindsey.<br>\r\n<br>\r\nGrating bones, pain... ungh, maybe you shouldn't do this so soon after changing fast? It doesn't hurt as much as before, but probably not healthy. Seeing her chest is nice, but her real 'Assets' are obvious as you turn around, glancing at them in the mirror. Ooh, nice butt! Nice big butt. You experimentally squeeze them, feeling the flesh. Heh, very nice. OK, so that's John, Lindsey and Kelsey of course. Who else could you add to your repertoire?</span></div></div>",
            "created":1452893940,
            "id":2089697,
            "title":"Fast changes are rough!"
        },
        "12113111221222":{
            "author_id":"bickuribox",
            "author_name":"bickuribox",
            "choices":[
                "Tell her about your power and ask if you can get her form for yourself",
                "Chicken out and lie to her instead"
            ],
            "content":"<div class=\"\"><div> <span>You choose on going to show and hopefully even add Sandy to your list of available forms to morph into, with that set in your mind you decide to get to work on it.<br>\r\nWith Lindsey in the shower you can now just slip away from her without her even noticing, and if she’s mad about it, well, you figure John will be taking the brunt of that since you frankly don't care about Lindsey now that you have her form.<br>\r\n<br>\r\nYou start morphing back into your original Kelsey form, since you're already a girl it isn't that much of a difference like it is with John. Though it doesn't make you feel the best when you go from Lindsey’s sexy form to your painfully average body. \"Well... time to get to work.\" you mumble to yourself after inspecting your vanilla tier body like it's almost a totally new form you have since you've been spending so much time as John and you went from Lindsey to your normal self.<br>\r\n<br>\r\nGetting dressed in your normal Kelsey clothes you pick up the clothes you bought  when you were in Johns form and stuff them in your bag. Quickly peering out of the stall door to make sure Lindsey is nowhere to be seen, you quickly make a hasty exit from the pool to then head back to your home to drop off the John clothes and refresh yourself.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nRedressing your normal self into some casual clothes that you know won't burst or get ripped if you decided to morph into John or Lindsey randomly. You sent off a text to Sandy asking if she's ok to hangout for a while before you went into the shower to refresh yourself, then have some fun playing with Lindsey’s assets in the mirror when you were done in the shower for a short while, you get a text back.<br>\r\n<br>\r\n\"Sure thing Kelsey, just come round before it gets late :)\". And with that you leave your place after telling your mom where you'll be heading to, Sandys house is only a 10 minute walk from your own, which you don't mind as it gives you time to think out how you'll explain your power to Sandy and how you'll manage to convince her to sleep with you as John so you can gain her form.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nWhen you arrive at her house you're greeted by her mother at the front door, after some quick small talk she tells you Sandy is upstairs in her room doing some homework. You're familiar with her house since you've been pretty good friends with her for a while now, that's why you feel kind of bad roping her into this. But you know there's a good chance she'll be accepting of your new found power. The real question is will she be open to giving you her body to your list of morphing choices.<br>\r\n<br>\r\nOpening her door you see her lounging on her bed with her mac book open scrolling through something (probably Tumblr knowing Sandy). \"Heh..Good to see you hard at work there Sandy\" you say while pulling a playful smirk at her. <br>\r\n<br>\r\n\"Heyyyyyyy\" she says to you while still on her Mac book. \"Sit down and chill with me Kels.\" <br>\r\n<br>\r\nWith that you take off your boots, take off your leather jacket and lay down on Sandy’s bed. Her room is a pretty standard run of the mill teenage Indie girl type of room, she’s put more effort into her room than you your room that's for sure. <br>\r\n<br>\r\n\"So, what's up Kels?\" she asks you.<br>\r\n<br>\r\n\"Well, there's something I kinda wanted to tell you about, but I don't quite know how you'll take it...\" you tell her anxiously.<br>\r\n<br>\r\n\"Whaaaaat? Come onnnn Kelsey we're friends. You can tell me anything, I promise I'll be cool with it ok haha.\" she tells you happily with a smile.<br>\r\n<br>\r\n\"Well...basically...\"<br>\r\n</span></div></div>",
            "created":1452993000,
            "id":2090239,
            "title":"Sandy? She's nice, maybe... you could trust..."
        },
        "121131112212221":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "\"That's just freaky wrong! How can you live like that girl? Eewwww!\"",
                "\"So... can I take a peek?\" She says, pointing between your legs and grinning."
            ],
            "content":"<div class=\"\"><div> <span>You pause. How the heck to say this?<br>\r\n<br>\r\n\"Um, Sandy?\" You begin, sitting up from the bed and look over at her seriously. \"I've kinda... discovered an ability.\"<br>\r\n<br>\r\nShe stops playing with her mac book and rolls over on her side, looking up at you.<br>\r\n<br>\r\n\"OK.\" She said, raising an eyebrow. \"This seems waaaay serious. Some on, loosen up girl. You can tell me.\"<br>\r\n<br>\r\nNow she just looked eager. Yeah, she probably thought you were going to talk about a guy you were dating or something. Actually... sort of it was about that. Kinda. You take a deep breath and just go with it.<br>\r\n<br>\r\n\"I was over at Sara's... you know, John's sister? Well... I got to thinking... and kinda wanted to see him... and sorta... snuckupintohisroomwhenhewasnaked.\" You said, rushing through the last bit. And this wasn't even the weird part!<br>\r\n<br>\r\n\"EEEee!!\" Sara said, grinning. \"Oh girl, you are naughty! Oh let me guess, he's uber hung, right?\"<br>\r\n<br>\r\nYou blink, biting your lip.<br>\r\n<br>\r\n\"I.... could.... er.... show you?\" You say, in a kind of weak squeak.<br>\r\n<br>\r\nSandy smiles, then kind of realizes what you just said and frowns.<br>\r\n<br>\r\n\"Um... you took pictures?\" Her tone implies she suspects it isn't that at all.<br>\r\n<br>\r\n\"I... this....\" You take a deep breath. \"Look, I know this is funky, but... hang on a sec.\"<br>\r\n<br>\r\nYou roll off the bed, straighten up and take a deep breath, smoothing your baggy clothes out, then turn back to the bed.<br>\r\n<br>\r\n\"Don't freak out, OK?\" You say, then slowly (Much slower than before! Don't want to feel that again!) you... change.<br>\r\n<br>\r\nSandy winces as your muscles twitch and arms seem to jerk.<br>\r\n<br>\r\n\"Hey Kels, that looks like it hurts! Ouch girl! Come on, don't... what.... \" Her eyes get real wide as your shoulder widen slowly, chest deflates and hips shrink back in. She stares intently as your face shifts and moves, wincing occasionally but unable to tear her eyes away as you reform into John.<br>\r\n<br>\r\nGiven how carefully you are doing this it takes about five minutes to fully change, and even then pinches a little. You probably should do it slower for a while. That fast change seems to have left a mark. Maybe you should leave changing for a bit, just to let things settle down?<br>\r\n<br>\r\n\"Ho.... Le... Shit.\" Sandy says, gaping at John standing before her. \"Did you sneak some drugs in on me?\"<br>\r\n<br>\r\n\"Um, no.\" You manage weakly, nervously staring at your feet. It feels odd having a friend stare at you like that. OK, not as weird as it was to have Lindsey and her friends stare at you NAKED, but at least you knew there wouldn't be repercussions then. Well. Probably not anyway. \"I... kinda....had sex with John... and afterwards...\" You sort of vaguely waved down at your body.<br>\r\n<br>\r\n\"Are you telling me, you change into people you fuck?\" She says, incredulously.<br>\r\n<br>\r\nYou wince. Sandy rarely swears, so her using the F word casually like that really shows how freaked out she is, despite her not screaming or yelling or anything... yet.<br>\r\n<br>\r\n\"I... yyyyyeah. Kinda.\"</span></div></div>",
            "created":1453045080,
            "id":2090452,
            "title":"Fessing up."
        },
        "1211311122122212":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "\"Yup, let me get my panties off girl. Give me a minute!\"",
                "\"Just stay reeeeeal still.\" And she swallows it to the root!"
            ],
            "content":"<div class=\"\"><div> <span>You stare at her. She still looks a little... fragile, but her grin is wide, and she is staring between your legs. You can't help it and feel yourself getting hard down there. Your trousers are baggy, but not that baggy, and you see her eyes widen further as she sees the bulge.<br>\r\n<br>\r\n\"Please?\" She adds, her face getting more animated. \"Pretty please? Pretty please with peanut butter on?\"<br>\r\n<br>\r\nPeanut butter? Oh Sandy can be weird sometimes.<br>\r\n<br>\r\n\"I.. OK, just... you know... don't go all nuts.\"<br>\r\n<br>\r\nSandy giggles.<br>\r\n<br>\r\n\"You sound exactly like him. So cool!\"<br>\r\n<br>\r\nYou Shake your head, try to ignore her eagerness and slowly pull your pants down... with no underwear beneath (it would have been way tight as you changed, you know from experience, so you hadn't worn any) and Sandy gulps as she sees 'it' spring free.<br>\r\n<br>\r\n\"OK, he's definitely well hung.\" She says, licking suddenly dry lips.<br>\r\n<br>\r\nThen cold hands are suddenly gripping you down there!<br>\r\n<br>\r\n\"SANDY!\" You gasp, feeling it twitch as she fondles you. \"Oh god! Stop it. Ungh! God, I'm gonna blow if you keep that up!\"<br>\r\n<br>\r\nHer hands stop their sweet motion, but don't leave you down there. She's leaning over the edge of the bed, and you realize you are staring down the top of her blouse into her cleavage! OK, she's... not wearing a bra! You can feel yourself blushing and getting even harder down there.<br>\r\n<br>\r\n\"Um, I wouldn't mind if you did.\" Sandy replied. \"In fact I'd like that. But we'd kinda need to avoid a mess.\" She says, grinning even wider if that's possible.<br>\r\n<br>\r\n\"You don't mean...?\" You say in a squeak, staring down at your eager friend.</span></div></div>",
            "created":1453046040,
            "id":2090455,
            "title":"Sandy likes it."
        },
        "12113111221222122":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "Sandy wants to see if you can grab a girl lesbo style, or if it has to be hetero",
                "There is a girl in her gym class she 'likes.' Could you take her form?"
            ],
            "content":"<div class=\"\"><div> <span>\"Just stay REEEEAL still!\" Sandy says, smiling at you, then leans over and opens her mouth.<br>\r\n<br>\r\nOh she isn't?... She is!<br>\r\n<br>\r\nYou grunt, eyes shut as her lips enfold over the end of your shaft, the heat of her mouth very welcoming. One hand leaves your shaft, the other just holding the base, while it slides around and cups your rump, squeezing playfully as her lips sink gently over your throbbing hardness.<br>\r\n<br>\r\n\"Oh god Sandy! Jeeeeeze!\" You gasp, grunting and attempt to stay still as she asked, but it's hard.<br>\r\n<br>\r\nYou can feel her tongue twisting underneath, then slurping around you as her lips ooze down further, then, it feels a little tighter as... it pops into her throat. You gasp and look down, in time to see her let go with her hand and her lips slip down right to the base.<br>\r\n<br>\r\n\"Let me guess. You've done this before?\" You say with a weak smile.<br>\r\n<br>\r\nShe raises an eyebrow then reaches under the bed with one hand, while her tongue plays with you in her mouth. Damn that feels good! You open your eyes and see her holding up a large dildo, easily eight inches long. Oh, she's 'practiced' huh? Well, you've played with toys yourself, but not orally!<br>\r\n<br>\r\nHer mouth squeezes as she puts the dildo on the bed while focusing on you, now both hands holding your buttocks firmly. She pulls back and begins to thrust, sucking deeply, the tip plopping into her throat each time. How does she not choke? It's incredible, but like with Lindsey you don't last long, shuddering all too soon, and feel her grab your butt hard, jamming you against her lips tightly, her gulping hard.<br>\r\n<br>\r\n\"Oooh geeearrrd!\" You grunt, bucking against her face as she swallows.<br>\r\n<br>\r\nJerk jerk, spurt spurt, gulp gulp. Even if it was just 'practice' till now she's good at this, and soon you are leaning on her shoulders, panting as she sucks on a rapidly dwindling shaft.<br>\r\n<br>\r\n\"Whoah! That was... incredi.... Oooooh!\"<br>\r\n<br>\r\nIt caught you unawares, and you start to shift. Sandy blinks, pulls back letting your floppy tool slip from her lips, and steps back to watch, fascinated.<br>\r\n<br>\r\n\"Wow.... that's... me!\" She says a few minutes later. Thankfully you did manage to slow it down at least.<br>\r\n<br>\r\nYou gasp as she lifts your shirt up and peers intently at your... her own tits.<br>\r\n<br>\r\n\"You even have my mole!\" She said, giggling as she poked a little spot on the left side of your left breast.<br>\r\n<br>\r\n\"Yeah. Like I said. I can turn into anyone I've... um... Well, you know.\"<br>\r\n<br>\r\n\"That's incredible! Take those clothes off right now!\" She says, sitting back up on the bed and throwing her blouse off herself. Whoah!<br>\r\n<br>\r\nYou gulp and comply, removing the remains of your clothing and soon both of you are staring at each other, identical in form, facing one another.<br>\r\n<br>\r\n\"It's amazing!\" She said, reaching out and cupping your breast. \"Just perfect duplicate!\" She looks up at you. \"What's it feel like to change?\"<br>\r\n<br>\r\n\"Um, if I do it too fast, painful. That's why I took a few minutes. First time wasn't too bad, but just recently I wasn't paying attention and it went REAL quick, like in seconds. That HURT! I mean, seriously! Don't want to do that again. Even changing slightly slower after that hurt a bit. I kinda wondered if it permanently damaged me or something, but it seems to be easing off a little. Might take a while.\" All the time you were gabbling she was staring at you, smiling. \"What?\"<br>\r\n<br>\r\n\"Oh, just thinking. Was it just John you were with?\" You blushed again. \"Hah! Thought so! Another boy?\"<br>\r\n<br>\r\n\"Actually another girl. Lindsey.\"<br>\r\n<br>\r\n\"The sprinter? One of the minor bitch club? Oh god!\" She said. Slapping her hands over her mouth. \"How on Earth... oh, you didn't sneak into her room at night did you?\" She added with a giggle.<br>\r\n<br>\r\n\"NO! God no Sandy.\" You said, then realized what you did was almost as bad. \"I... er... they caught me as John in the changing room. Her and another of the bitch club. I forget who. The other girl ran off, she... well...\"<br>\r\n<br>\r\nSandy bit her lip, attempting to avoid laughing.<br>\r\n<br>\r\n\"Oh god, she thought she was getting John? Oh, is he going to be surprised! Hah!\" She shook her head smiling. \"Oh Kels, this is just soooo cool!\"<br>\r\n<br>\r\nAnd suddenly you were gripped in a warm, naked hug.<br>\r\n<br>\r\n\"Heh, yeah. Real cool.\"</span></div></div>",
            "created":1453055220,
            "id":2090493,
            "title":"Quick drink."
        },
        "121131112212221221":{
            "author_id":"bickuribox",
            "author_name":"bickuribox",
            "choices":[
                "Off to Veronicas place",
                "Turn back and get yourself an easy new body to morph into"
            ],
            "content":"<div class=\"\"><div> <span>\"I have been thinking about that idea too if I'm being honest with you Sandy\" you tell her, now that you know you can gain female forms using a male form. \"But.... I'm not exactly comfortable going girl on girl with my body Sandy.\"<br>\r\n<br>\r\n\"Then just use my body, you've already absorbed the DNA and have my form for yourself. So just use my body to try it. Besides everyone knows I’m Bi anyway so it won't come to a shock with whoever you're sleeping with.\" she assures you.<br>\r\n<br>\r\n You knew she'd say that and give you permission to use her body, but you just felt the need to complain to set her up to say that to you. Besides it's not exactly like you can be using your normal body for it, even though you're not the most popular (but not unpopular by any means) you don't want to ruin the image you have crafted for yourself by going lesbo. It's not like you'd be doing it in front of the whole school, but it is a girl you'll be sleeping with.... and, well women do talk so you're sure everyone would know in no time. And with Lindsey’s body? You couldn't do that to her, as much as you dislike her it'd probably cause more of an obstacle for you since loads of the well-known lesbians at school aren't fond of her to begin with, you don't see yourself trying to make amends and persuade them into sex as Lindsey anytime soon. That leaves the only choice of Sandys body, and to be honest.... you kind of like her body, she has an average height for a women (same as yourself), she has short blond hair in a indie type cut, her breasts are slightly bigger than your own, her ass is as well and to top it all off she weighs less than you. \"I think I can get use to this body...\" you think to yourself as you give your close friends body an eye over, since it's pretty much looking into a mirror as you're both naked and identical in looks.<br>\r\n<br>\r\n\"So is that a yes?\" She asks you as you didn't realize all of this thinking actually turned into a strange lapse in chat as you were actually staring at her lost in thought for a good 10 seconds. <br>\r\n<br>\r\n\"Errr, yeah, yeah sure Sandy I'd be down for that.\" you reply. <br>\r\n<br>\r\n\"Ok cool. Just don't ruin my reputation, don't act too odd in my body even though I am normally a little odd hehe\" she giggles while you smirk \"But yeah..... OH! And I know exactly who you can sleep with too, we can probably have it set up for tonight too, that is if you don't mind having a little lesbian sleep over that is?\" she tells you.<br>\r\n<br>\r\n\"Sure, who is it?\" you reply in her own voice. Which you think about and think about how strange it must sound if Sandys mom over hears you both talking, it'd make Sandy seem insane. While you're thinking about Sandy’s mother you think about how you wouldn't mind having her body available to morph into, she's quite the looker. Or as the boys would say, a MILF. That being said you are curious to try and get an adults body in general just so you can have any privileges included in the age difference. Since all the forms you have at the minute are just teenage ones all 17-18 aged.<br>\r\n<br>\r\n\"Veronica.\" she informs you.<br>\r\n<br>\r\n\"As in, that Veronica?\" you ask not too sure if she's talking about the same Veronica you're thinking of.<br>\r\n<br>\r\n\"Yes that one. I actually met her in school and we got on because she’s like totally into Tumblr just like me. But as of recent she's been totally trying to move on me you know.\" she says “I could just call her now asking if she wants me to come round to her place to 'chill' and stay the night. That'll give you plenty of opportunity to try it out.\" she finishes while beginning to put back on her clothes while you stand still naked in her form.<br>\r\n<br>\r\nShe's carefully forgot to mention that Veronica is known as a 'Feminazi loudmouth' in school since she’s really really taken feminism and all social justice into her character and identity. She's really chubby going on fat, you're kind of chubby yourself but Veronica is ..... well, chubbier. Because of this she's gotten pretty big tits and a fat ass, which aren't bad assets to have. She has short bright red hair, a boyish haircut, thick rimmed glasses and dresses pretty similar to Sandy all things considered.<br>\r\n<br>\r\n\"Sounds peachy.\" you say with a plain face.<br>\r\n<br>\r\n\"It'll be piss easy Kels! Especially with my hot bod, it'll be fine. I'll get in touch with her now and get you dressed into something good!\" she says enthusiastically.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nWhen you're dressed and looking very Sandy like she tells you to be sure to let her mom know where she'll be for the night before you go out. Luckily she has a mini fridge in her room and snacks to last her the night until you come back to her place as well as her own bathroom. She'll just have to be quite, not have her room light on and make sure her mom is either asleep or down stairs when she goes to the bathroom. Luckily for her all she needs is her MacBook for light &amp; entertainment and she'll be fine in this situation.<br>\r\n<br>\r\n\"Ok Kels, guess I'll see you tomorrow morning, text me if anything happens ok?\" she tells you.<br>\r\n<br>\r\n\"Yeah, yeah I got this Sandy. Just got to make sure I don't end up showing her my power. I'd rather keep this to just you and me. And by the way Sandy, for reals, let's just keep this between us ok?\" you request from her.<br>\r\n<br>\r\n\"Oh courrrrse of course Kels, you worry too much. Anyway, speak to you later.\" she tells you as you walk out of her room, seeing the lights go off and walking down the stairs as Sandy off to find her mother. Or should you say your mother for now. <br>\r\n<br>\r\n\"Mooooom! Moooom, I'm staying at a friend’s house for the night!\" you say in Sandys pitched soft voice. You eventually find her mother passed out on the sofa in lounge wear like you saw her when she greeted you at the door. You did notice she'd gone through a few glasses of wine when she spoke to you since she seemed a little tipsy, but from the looks of it she's went through a whole bottle of red wine to herself and it's clearly done it's job.<br>\r\n<br>\r\nWalking up to her you mumble with a grin \"Must have had a rough day, or a really slow day...\" you poke her to see if she's conscious or out cold. She's gone, well.... in terms of consciousness. \"Huh.... guess there wasn't a need for a good bye after all eh, mum.\" you chuckle to yourself as you walk towards the door.<br>\r\n</span></div></div>",
            "created":1453085580,
            "id":2090671,
            "title":"Sandy wants to see if you can grab a girl lesbo..."
        },
        "12113112":{
            "author_id":"gimlet",
            "author_name":"Gimlet",
            "choices":[
                "It goes to plan, and soon 'John' has Sam thoroughly plastered and secluded.",
                "'John' meets Sam, but she's being careful with her drink. How to do this?",
                "A girl you don't know latches onto 'John' and won't let up. But she is cute..."
            ],
            "content":"<div class=\"\"><div> <span>Yeah. You've always felt a little... underwhelmed, with your assets. Glancing down at your chest with a sigh you picture Sam in Gym class, her bouncing gait. It's odd thinking like that, but you would like to have her body... Yeah. Literally.<br>\r\n<br>\r\nFrowning you try to picture yourself as John with Sam. It's weird, but probably be fun, and the benefits! You smile thinking of walking around with her body. Hmm, though that will be awkward. Right now being John could be tricky. What if you bump into one of John's friends? Though of course Sam is his friend and... yeah.<br>\r\n<br>\r\nLooking up you frown as you glance at a poster crudely hand written and stapled on a telephone pole. A party at a dorm nearby, and it looks like those guys organizing it are in Phi Sigma Pi .... oh that is the kind of thing Sam would definitely go to! Get in with the big guys from THAT frat? She'll be there!<br>\r\n<br>\r\nA grin spreads across your face as you begin to get a plan together. A little vague right now but it's getting there. First thing is to be sure Sam sees one of these posters. That should be easy at least.<br>\r\n<br>\r\n***<br>\r\n<br>\r\nThe next few days are tense for you, but you manage to sneak the poster you tore down from the pole onto the table she eats at just before lunch. A strong grin is on your face as you see her sit down for lunch and pick up the poster. Oh, she'll be there!<br>\r\n<br>\r\nAfter that you make sure you can attend, and that John isn't attending (don't want to run into him there with you looking like John!), then do a little shopping.<br>\r\n<br>\r\nRoofies. That was your plan. Get her drunk, then roofies, then get her body... literally! However things don't go as planned and you can't find anyone who sells the damned things! Just to be on the safe side all attempts to find such a dealer are done with John's body (Sorry John!) So it won't come back to you at least. Heh, serve the jerk right if he's caught for buying drugs some time. However it's not what you're aiming for and you STILL can't get any roofies!<br>\r\n<br>\r\nWell, the next best thing is just to get her drunk. Really drunk! Getting some vodka you plan the evening out, ways to get her away from her clique (If she's there so will they, for sure) so you can get her somewhere intimate alone.<br>\r\n<br>\r\nFour days later the night of the party arrives and so do you. The building is a little dilapidated but it's obviously been fixed up a little. With Phi Sigma Pi they'd have the clout to get some fixing up at least. At least she'd managed to get an invite, as they seemed pretty strict at the door. Couple of jocks were there collecting invites from everyone.<br>\r\n<br>\r\nSmiling at them politely (You're there as Kelsey of course right now) you hand in your invite and get waved in. Inside things are a little hectic, but looks fun. The pool is a nice touch certainly.<br>\r\n<br>\r\nNow to find a bathroom and switch to John, then get Samantha alone! Oh, this is gonna be fun!</span></div></div>",
            "created":1419177240,
            "id":1905507,
            "title":"Samantha."
        }
    },
    "info":{
        "author_id":"secret000",
        "author_name":"secret",
        "brief_description":"You are a girl with the power to shape shift at will, but you have to absorb their DNA.",
        "created":1235346060,
        "description":"<td align=\"left\" class=\"norm\">You are a 17 year old high school girl named Kelsey who discovers an interesting power. You have the power to shape shift at will. However, there is one MAJOR restriction. You have to absorb the person's DNA once to be able to change into them. You realize that the only effective form of absorbing DNA is CUM (or semen, whatever you want to call it). You can absorb it through any of the normal orifices: swallowing, pussy, or ass (with all, it must be inside them). Luckily, as far as your pussy goes, when you choose to absorb the DNA, it won't get you pregnant.<br>\r\n<br>\r\nYou only has to absorb each person's DNA once, then you can change into them whenever you want.<br>\r\n<br>\r\nLater on you realize you can transform into any girl you have cum in (mouth [swallow], ass, or pussy) while in the form of a guy.<br>\r\n<br>\r\nNo guy on guy (even if one of the guys is Kelsey). I reserve the right to edit anything too crazy. Other than that, have fun with it!</td>",
        "id":1531815,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1589099340,
        "modified":1589099340,
        "pretty_title":"Morphing Girl (100 GP for good add)"
    }
}