{
    "chapters":{
        "1":{
            "author_id":"jigfeather",
            "author_name":"Jigfeather",
            "choices":[
                "I want to stay a human",
                "I want to transform into a Digimon",
                "I want to transform into a Pokemon",
                "I want to transform into a Furry",
                "I want to transform into a Scaley"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>???: Thank you for testing the TDM3K for us.<br>\r\n<br>\r\nThe dream begins. What are you going to transform into?</span></div></span></div>",
            "created":1324582860,
            "id":1244474,
            "title":"Interview"
        },
        "11":{
            "author_id":"armaggedon185",
            "author_name":"The X",
            "choices":[
                "Tied spread-eagle to a bed.",
                "Entangled in living vines.",
                "Snared in an squid's tentacles.",
                "Surrounded by billions of bugs.",
                "Captured by tickle-monsters."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Slowly the dream reality forms around you according to what you asked for. Taking a quick look around, you see that you are in the exact situation you asked for. You're...</span></div></span></div>",
            "created":1324866840,
            "id":1246389,
            "title":"Situation"
        },
        "111":{
            "author_id":"arachnid98",
            "author_name":"Arachnid",
            "choices":[
                "A human man",
                "A human woman",
                "A furry man"
            ],
            "content":"<div class=\"\"><div> <span>When you come to, you find that you're in a large, comfortable-looking bedroom, on top of the covers of a plush queen-size bed. You attempt to sit up, but as you might imagine, you're unable to lift much more than your head.<br>\r\n<br>\r\nSoft, thick ropes are tied around your ankles and wrists, with the other ends bound to the bedposts. Some quick, cursory \"struggles\" make it clear that the ropes, while not so restricting as to be painful or uncomfortable, are not going to yield, no matter how you squirm. The idea is both terrifying and exhilarating all at once.<br>\r\n<br>\r\nSuddenly, the door across the room opens, and you lift you head in order to catch a glimpse of the one who walks through...<br>\r\n<br>\r\nBut who is your captor?</span></div></div>",
            "created":1449458220,
            "id":2071334,
            "title":"Tied spread-eagle to a bed."
        },
        "1113":{
            "author_id":"the45appana",
            "author_name":"obb",
            "choices":[
                "Fluffy tail",
                "Claws",
                "Licking"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A red fox walks in with fluffy fur and a huge fluffy tail. He walks up to you, his tail swaying behind him. \"Good you're awake,\" he says wiggling his claws, \"Now, how to tickle you?\"</span></div></span></div>",
            "created":1594191660,
            "id":2863950,
            "title":"A furry man"
        },
        "11131":{
            "author_id":"theappana",
            "author_name":"Bob",
            "choices":[
                "Feather duster",
                "Licking"
            ],
            "content":"<div class=\"\"><div> <span>He fluffs his big soft tail on your belly. The fluffy fur brushing against every inch. You laugh loud and hard. He then wiggles the tail in your armpit. You can't stand his tail its too soft. \"Cootchie cootchie coo!\" The fox coo's as his silk soft fur tickles you crazy. You laugh histerically you can't take any more of this torture. He stops quickly swiping his tail under your neck before it returns behind him wagging playfully. \"Now\" he spoke, \"what should we tickle you with next?</span></div></div>",
            "created":1596808920,
            "id":2881824,
            "title":"Fluffy tail"
        },
        "114":{
            "author_id":"armaggedon185",
            "author_name":"The X",
            "choices":[
                "The ant swarm closes in on your body.",
                "Some spiders start falling from the roof.",
                "Moths flutter in and ecperiment with you."
            ],
            "content":"<div class=\"\"><div> <span>You find yourself in some sort of cave in only your underwear, with dirt beneath you instead of stone. A string of lanterns lights up the space adequately, at least enough for you to see the sea of ants that you're in. Instinctively you try to bring your limbs in and protect yourself, but they are tied fastly to nearby stalagmites, pulling you into a spread-eagle position that leaves you completely exposed.<br>\r\n<br>\r\nThe enormous cluster of bugs, noticing your vulnerability, swarm in until they are nearly touching you. Just before they launch they attack however, they stop and mill about not centimeters from your body. Amidst the chaos you see a group of ants venture forth from their fellos towards your taught armpit. The exploration squad climbs into your hollos, their tiny legs sending electric messages to your brain. Instantly you burst out in giggles, unable to shake the ants or the ticklish feelings.<br>\r\n<br>\r\nAfter a while the party of ants travels down your ribs, you struggling and giggling all the way, until they reach your stretched belly. Now more than ever you try to wiggle around, but unluckily (or not) the TDM3K has tied you up too tightly. Giggles become short bursts of laughter as the few dozen ants take their time to explore every inch of your sensitive tummy. One falls into your navel and you laugh ridiculously as it tries to climb its way out. Eventually the bugs seem satisefied, as they leave the ticklish land they came to investigate, no doubt to bring more of their friends back for another round.</span></div></div>",
            "created":1324873500,
            "id":1246419,
            "title":"Nest"
        },
        "1143":{
            "author_id":"drgalaxy",
            "author_name":"TKLfeather",
            "choices":[
                "Spiders drop from above",
                "The swarm of ants return",
                "Centipedes and millipedes emerge from the darkness to find you bound and g"
            ],
            "content":"<div class=\"\"><div> <span>After lying in the cave ground for a while you start feeling cold and spooked. Suddenly, you hear a buzzing sound of wings as a group of moths fly into the cave they circle around you as if under some spell. You count 10 in total as they start to defend on you. 5 of them land on you body and starts using their spiny legs to stroke your abdomen, the other five a4e busy with your toes and soles. Two rub their legs through your toes and your scream out in luaghter. The five on your belly have started to explore all round your ticklish body, from your belly button to your pits. You try to shake them of but again, the ropes are to tight. After what feels like an hour they stop and fly away again. </span></div></div>",
            "created":1506503040,
            "id":2392509,
            "title":"Moths flutter in and ecperiment with you."
        },
        "115":{
            "author_id":"quetzalcoatl",
            "author_name":"jdstephens",
            "choices":[
                "The...Thing....Decides to finally step it up a notch.",
                "Something-humanoid, at least-comes in.",
                "Your idea here!"
            ],
            "content":"<div class=\"\"><div> <span>          You gulp reflexively and wave your legs in the empty air below you, despite knowing you can't be injured in an artificial dream, no matter how great the expanse of nothingness is. Actually, you're inside a dim, spherical chamber, whose light source can't be seen from your position, and the walls of which are covered in some kind of rubbery material. It's the multi-armed behemoth holding you aloft by the arms that really causes you to start.<br>\r\n<br>\r\n          Twisting around in your dangling hold, you can see a mass of tentacles leading up to a thick, tree trunk like body-or, at least, one shaped like the stump of an elderly tree. It has no eyes or other discernible features; just a round, green blob of flesh that serves as a conduit for the dozen or so thick appendages now holding you. And it isn|t the room's only other occupant.  Another, similarily featurless blob lurks beneathe you, but it is fluid and amorphorous rather than trapped in a single form, if a bit smaller than it's counterpart.<br>\r\n<br>\r\n          As if satisfied that they've given you enough of a moment to collect yourself, the monster shifts, wrapping a thick limb around your legs, but supporting them and taking the strain off your arms rather than simply trying to pull you out farther. A long, surprisingly slender tentacle that tapers to a dozen different tendrils comes to hover in front of you. You suck in your breath as they begin to gently probe at your stretched out, helpless body, lightly flicking at your ribs, scratching away at your underarms, poking around on the soles of your feet... Never really, truly tickling,  always leaving just enough of a pause every now and then to measure your reactions to different tactics and response to various areas. The strength of the tentacles holding your arms up and legs down is brought home to you in these few moments, not budging or slipping in the slighest despite your jittery, instinctive struggles. After a few minutes, the examnination is done, and the tentacles withdraw to hover directly in front of you. <br>\r\n<br>\r\n          Soundlessly, one extends from the gently bobbing mass and approaches your belly. You start grinning and squirming before it even touches you, and the tip begins to <i>slowly</i> trace an oval-shaped pattern around your belly. It drags lighly over your ribs, and then slithers down your abdomen and around your waist, before heading back up again. Never pressing to hard, never going to fast. Just slowly inching its way around, applying a constant, teasng pressure, more distracting than outright torturous. As it keeps up, you begin to feel almsot as if you <i>want it </i>to become more intense. Just so that this relentless, slight feeling working around your torso stops, and you have more things to focus on and really laugh about. This thoguth goes away though, as you realize the circle is rapidly getting smaller around the epicenter of your belly button. You hold your breath as it nears completion of the final circuit,  both dreading and waiting for the explosion of tickling sensations as it glides along the last few inches of sensitive skin... ...And veers away. You give your arms a hopeless tug and giggle overloudly as it begins ot circle all over again, looping around your taunt, now extremely sensetized belly. <br>\r\n<br>\r\n          </span></div></div>",
            "created":1352789700,
            "id":1466811,
            "title":"Slow."
        },
        "12":{
            "author_id":"jigfeather",
            "author_name":"Jigfeather",
            "choices":[
                "A Veemon",
                "A Guilmon",
                "An Agumon",
                "A Growlmon",
                "A Renamon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Digimon are you going to become?</span></div></span></div>",
            "created":1324582980,
            "id":1244475,
            "title":"Digimon Transformation"
        },
        "122":{
            "author_id":"jigfeather",
            "author_name":"Jigfeather",
            "choices":[
                "...they are restrained.",
                "...they are holding a feather.",
                "...they are regular Guilmon hands."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are a Guilmon. You look at your hands, and...</span></div></span></div>",
            "created":1324583100,
            "id":1244477,
            "title":"Guilmon Transformation"
        },
        "1221":{
            "author_id":"jigfeather",
            "author_name":"Jigfeather",
            "choices":[
                "...in stocks and exposed.",
                "...strapped to a table.",
                "...not restrained."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look at your feet. They are...</span></div></span></div>",
            "created":1324583340,
            "id":1244478,
            "title":"Restrained hands"
        },
        "12211":{
            "author_id":"jigfeather",
            "author_name":"Jigfeather",
            "choices":[
                "My feet or my belly",
                "My chest or my armpits"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A voice comes on, sounding echoey and godlike, but you realize it's just the scientists outside of the machine.<br>\r\n<br>\r\nScientist 1: Where would you like to be tickled first?</span></div></span></div>",
            "created":1324583520,
            "id":1244480,
            "title":"Vulnerable feet!"
        },
        "122112":{
            "author_id":"jigfeather",
            "author_name":"Jigfeather",
            "choices":[
                "My chest",
                "My armpits"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, which one?</span></div></span></div>",
            "created":1324583640,
            "id":1244484,
            "title":"Chest or feet?"
        },
        "13":{
            "author_id":"jigfeather",
            "author_name":"Jigfeather",
            "choices":[
                "Pikachu",
                "Machoke",
                "Lucario",
                "Charmeleon",
                "Eevee"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Suddenly, you envision a list of all 718 Pokemon. There are five that catch your interest. The cute Pikachu, the strong Machoke, the focused Lucario, the feisty Charmeleon, and the adorable Eevee. You choose</span></div></span></div>",
            "created":1324590060,
            "id":1244578,
            "title":"The list"
        },
        "14":{
            "author_id":"humanguy222",
            "author_name":"humanguy222",
            "choices":[
                "Wolf",
                "Cat",
                "Rabbit",
                "Fox",
                "Raccoon "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of furry?</span></div></span></div>",
            "created":1386293880,
            "id":1703832,
            "title":"I want to transform into a Furry"
        }
    },
    "info":{
        "author_id":"jigfeather",
        "author_name":"Jigfeather",
        "brief_description":"You can tickle or be tickled in your very own TDM3K.",
        "created":1324582560,
        "description":"<td align=\"left\" class=\"norm\">You are hired to test out a new invention called the TickleDreamMachine3000, or TDM3K for short. You can even transform in your very own self-controlled dream!<br>\r\n<br>\r\nI made this 18+ to let you guys have some less-restricted fun. There are just a few rules;<br>\r\n- No highly-detailed sexual content<br>\r\n- Human or anthro nudity kept at a minimum<br>\r\n- Have fun! :D<br>\r\n<br>\r\nThere will be one storyline started out for you, but this time, it will not end abruptly. You may even continue from there, if you wish.</td>",
        "id":1835014,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1596808920,
        "modified":1596808920,
        "pretty_title":"Feathery Dream"
    }
}