{
    "chapters":{
        "1":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Balto",
                "Jenna",
                "Aleu",
                "Kodi",
                "Steele"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a character to start a story.</span></div></span></div>",
            "created":1390107600,
            "id":1729850,
            "title":"The Characters"
        },
        "11":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Balto becomes lazy and packs on the pounds.",
                "Jenna feeds Balto for a bigger boyfriend.",
                "Balto and Steele have an eating contest.",
                "Balto finds a meat locker and starts eating away.",
                "Free Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which story do you want to choose for Balto to gain weight?</span></div></span></div>",
            "created":1390107600,
            "id":1729856,
            "title":"Balto"
        },
        "111":{
            "author_id":"slipknot1",
            "author_name":"Animequeen",
            "choices":[
                "the next morning",
                "2 weeks later",
                "2 months later"
            ],
            "content":"<div class=\"\"><div> <span>as balto was named the hero of the town and accepted into a loving family, he quickly got use to the lazy household dog lifestyle. <br>\r\nconstant warm, abunadant food and loving pets. as he grew more accustom to this lifestyle he slowly began to gain more weight. one night after his normal dinner, he noticed the leftovers at the table and walked over before he looked up into the children's eyes. they giggled and said \"momma, pappa, i think balto is still hungry\" the adults looked down at the wolf hybrid and laughed \"getting a growing appetite are we boy?\" father asked, he barked in response causing the children to laugh. while their mother looked skeptical she then gave into his adorning puppy eyes and smiled \"alright boy, but just for tonight\" <br>\r\nbalto barked again in victory as the massive load of leftovers greeted his chocolate eyes. without hesitation he began to chow down, savouring each rich and greasy flavour. <br>\r\n<br>\r\nas he finally finished the load, he sat back and rubbed his bloated gut. he'd never been this full before and whined slightly as the pleasure and pain overwhelmed him. <br>\r\nhis family looked at him and father leant down and started to rub his boy's full tummy, this helped relieve balto's discomfort as he licked the man's face before slowly walking to lay by the fire. <br>\r\nmother looked over at the bloated dog and said to her family \"we need to how much we feed Balto, he's not use to such large amounts of food\"<br>\r\nthe children looked at her and whined \"but look mommy, he's so happy. he was so thin...\" she did in fact look at the dog to see a smile on his lips as he lay asleep. <br>\r\n<br>\r\nshe looked back and said \"we can treat him... sometimes. ok\"<br>\r\nthey cheered and all went to bed. </span></div></div>",
            "created":1513659600,
            "id":2430334,
            "title":"Balto becomes lazy and packs on the pounds."
        },
        "113":{
            "choices":[
                "How about an eating contest?",
                "Maybe join in him eating meat?",
                "Or maybe feed Steele and watch the Husky get big."
            ],
            "content":"<div class=\"\"><div> <span>Balto was out in about in Nome just enjoying his day, after since he saved the children in the town he was always respected as a hero. But what happened to Steele he wondered, sure Steele may have been a bully to the Wolfdog but Balto had some concerns for him as he was not the mammal that wanted pay back to his tormentors as he believed on treat everyone as you want to be treated as he adopted that belief system from Boris. <br>\r\n<br>\r\nIt wasn't until Balto heard some someone chewing on something in the butcher's meat locker and Balto being the curious wolf dog went in to investigate. What he saw shocked him as it was Steele by himself chewing on the meat. <br>\r\n<br>\r\n\"Steele, what are you doing?\" Balto asked as he found the husky dog that bullied him his entire life eating meat.<br>\r\n<br>\r\n\"Oh, if it isn't the wolfdog wonder who is going to report me for just wanting a snack in peace, how does it feel being a hero huh?\" Steele said disgruntled to Balto.<br>\r\n<br>\r\n\"Um no, I am not going to tell anyone, I was just wondering what happened to you?\" Balto said as he noticed that Steele looked a bit chubby in the underbelly while entering in.<br>\r\n<br>\r\n\"Well what does it look like to you!\" Steele shouted out loud when the door closed shut as nobody noticed outside as it was just the two of them alone. \"Eating this meat is the only comfort I can have after you took my place in the serum run, everydog in town hates me for lying and I guess I deserve it after all what I did to you, even my own team looks down upon me no wonder why.\" Steele anguishly said as tears started to come down from his eyes, as Balto now understood, true Steele did deserve what he did to him but he knew that wasn't going to solve anything as Balto thought of something in his head that could cheer up Steele. </span></div></div>",
            "created":1565371500,
            "id":2699492,
            "title":"Balto and Steele have an eating contest."
        },
        "1131":{
            "choices":[
                "My version of how this goes down ",
                "Your version of how this goes down "
            ],
            "content":"<div class=\"\"><div> <span>\"So please just let me eat in peace.\" Steele said as he was going back to eating until Balto interjected. <br>\r\n<br>\r\n\"How about this Steele, up for an eating contest?\" Balto said as it got Steele's attention. \"A what? You mean you want to eat this meat with me?\" \"Yeah, I guess you can say that. Maybe until our bellies our big and full?\" And with that Steele started to wag his tail. \"Okay it's a deal than.\" said Steele.</span></div></div>",
            "created":1565372280,
            "id":2699497,
            "title":"How about an eating contest?"
        },
        "11311":{
            "choices":[
                "Jenna?",
                "Kaltag, Nikki and Star?"
            ],
            "content":"<div class=\"\"><div> <span>\"So, what should be the rules than?\" Steele said curiously. \"I don't, maybe if we just get into a pile of meat and eat every single meat till it's gone and last one is the winner?\" \"I wonder, do wolves have a big appetite?\" Steele said \"Oh you'll see.\" Balto said as they position themselves at the huge stack pile of meat.<br>\r\n<br>\r\n\"Alright... GO!\" Balto shouted as they both dug in the pile of meat devouring every single piece of meat there was, lucky for Steele as he had the upper hand as his belly was just starting to get big and for Balto his belly was starting to become a bit chubby. <br>\r\n<br>\r\n\"Heh, look at you only look like you just ate a full day's meal and your not big enough compared to me!\" Steele taunted <br>\r\n<br>\r\nThe challenge was on and Balto wasn't going to let Steele win so easy but he felt his belly was so full so he mustard his inner wolf in him to wolfdown the meat instead of chewing it. <br>\r\n<br>\r\n10 minutes later their bellies started to touch the ground, and Balto has overcame his discomfort in his in his belly as it now started to feel so good.<br>\r\n<br>\r\n\"You know Balto, this is pretty fun idea to see who can have the biggest belly.\" Said Steele as Balto repliedback \"Yeah I know, so I guess we're friends now?\" \"Maybe if we reach to a tie?\" So they continued on with each juicy meat they consume and digested into fat. <br>\r\n<br>\r\nAbout an hour in their bellies were bigger than a dog standing on two feet, their once muscular legs were now replaced with flab along with their big behinds and chests formed two big pillow like moobs. <br>\r\n<br>\r\nBalto was in a sitting position with his paws pressuring into his fat belly as it felt good to be this big as he held in his maw the last piece of steak. <br>\r\n<br>\r\n\"Hey Wolfy! Give me that slice of meat, I'm still hungry.\" Steele said as he waddled behind Balto but couldn't move with the big lard of a white belly limited him from getting closer to the equally lard wolfdog.<br>\r\n<br>\r\n\"What's wrong big guy, are you already beached, you glutton?\" Balto said with a smile as he chuckled with the meat still in his maw. Steele jumped up with his hind legs but with his belly still on the ground as Steele than rolled down in the front direction where Steele's head landed behind Balto's butt with a thump.<br>\r\n<br>\r\nBalto than sucked up the last meat in defiance. \"Looks like I win Steele.\" Balto said as he turned his head towards Steele. <br>\r\n<br>\r\nThe Husky left up from the Wolfdog's behind.<br>\r\n<br>\r\n\"Really? It look like a tie to me as we are both equally fatasses.\" Steele exclaimed proving a point. \"Okay Steele, it's a tie.\" He said as Balto moved a bit to where Steele was sitting. Both of their fat bellies making sloshing and gurgling noises.<br>\r\n<br>\r\n\"You look pretty good with a fat look on ya wolfdog.\" \"I could say the same for you too Steele.\" They both complemented their bellies as both of them started getting an attractive to eachother. Balto and Steele enjoyed looking at eachother's bellies with their noises going on until they heard some paw steps coming to the entrance and it was...<br>\r\n<br>\r\nAuthor's note here's what Balto and Steele look like with idea of them both fat. <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/31432577/\" target=\"_blank\">http://www.furaffinity.net/view/31432577...</a> So far this is where let you decide what happens to Balto and Steele, will they form so fatty love relationship, what will Jenna think of this? What will Steele's old gang do? The choice is up to you.</span></div></div>",
            "created":1565386500,
            "id":2699568,
            "title":"My version of how this goes down "
        },
        "113111":{
            "author_id":"masterfatbalto",
            "author_name":"Balto must be fat",
            "choices":[
                "Inflate Jenna with air.",
                "Drink water from a huge water storage tank for Jenna. "
            ],
            "content":"<div class=\"\"><div> <span>Jenna enter in the butcher's meat locker to see Balto and Steele with their bellies taking up most of the space as gurgling noises came from them.<br>\r\n<br>\r\n<span class=\"cbrown\">\"Jenna? W-what are you doing here?\"</span> Balto said surprised as he might've been embarrassed at the state his mate will notice. <br>\r\n<br>\r\n<span class=\"cred\">\"I could say the same for you, how did you two got so huge?\"</span> Jenna stated seeing the huge fat bellies the husky and wolfdog had taken as she moved closer to the lard wolfdog. <br>\r\n<br>\r\n<span class=\"cbrown\">\"Uh, well...\"</span> Balto said as he turn his direction to Steele as he too must've been embarrassed as him and than looked down at Jenna. <span class=\"cbrown\">\"I thought I could just cheer Steele up a bit with an eating contest and...oh!\"</span> Balto said as he felt his belly moaned and gurgling loudly with a sharp pain inside his stomach feeling like something was about to burst but than moved up his softecas which let out a big.....<br>\r\n<br>\r\n<span class=\"cbrown\">*Burrrup!*</span> which shook the entire building like an Earthquake and it too shook Steele 's belly as well and like a chain reaction, the sharp pain in stomach, movement in throat, than the loud belch.<br>\r\n<br>\r\nJenna laughed at the the belching lead off by Balto and Steele even though it scared her bit since she thought something serious had gone wrong with her mate. <br>\r\n<br>\r\n<span class=\"cred\">\"You two actually have a handsome look with that belly on you guys.\"</span> Jenna said as she jumped her two front paws up to Balto's belly which made the lard wolfdog blush at the complement from his mate as it sounded like Jenna didn't mind having a chubby hubby and Balto loved the pressure from Jenna's paws on his belly. Jenna looked at her mate's belly and noticed something about it.<br>\r\n<br>\r\n\"Wow, Balto you have a deep belly button.\" Jenna said as she puted her snout in Balto's navel which left Balto an odd sensation wanting something shaved in his navel now while Steele felt jealous of Balto still having a mate who still loves you even if you were chucky.  <span class=\"cred\">\"You know what, I want to have a belly like you guys now.\"</span> Jenna said as she got down from her mate's belly. To which Balto replied. <br>\r\n<br>\r\n<span class=\"cbrown\">\"But we don't have anymore meat here, we don't know where there would be any large chunk to eat off of.\"</span> Balto said as it was a known fact that he and Steele have already eaten the meat in the locker already. <span class=\"cblack\">\"Actually I think I have an idea that could satisfy Jenna.\"</span> Steele proposed.<br>\r\n<br>\r\n<span class=\"cred\">\"Really? What is it?\"</span> Jenna said with excitement. </span></div></div>",
            "created":1577182680,
            "id":2763996,
            "title":"Jenna?"
        },
        "1131112":{
            "author_id":"masterfatbalto",
            "author_name":"Balto must be fat",
            "choices":[
                "Water will do.",
                "Milk dog"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about two options of inflating Jenna with a liquid.  <br>\r\n<br>\r\nWater or Milk? (Milk can contain fat for Jenna to gain weight)</span></div></span></div>",
            "created":1577302020,
            "id":2764417,
            "title":"Drink water from a huge water storage tank for ..."
        },
        "113112":{
            "author_id":"fatbalto",
            "author_name":"Balto must be fat",
            "choices":[
                "\"Hmmm, yeah we will.\"",
                "Still unsure."
            ],
            "content":"<div class=\"\"><div> <span>The door opened came out Steele's old gang, Kaltag, Nikki and Star, they were surprised to see their once team leader and the town's hero with huge bellies from all of the meat the Husky and wolfdog had eaten from, as some means escaped from their bellies. <br>\r\n<br>\r\n\"Balto? Steele?\" The three dogs said in unison, clearly transfixed on the lardness of both fat canines<br>\r\n<br>\r\n\"<span class=\"cbrown\">Oh uh..... hi guys, didn't know you were coming *uhmp* here.</span>\" Balto said as he was feeling something bubbly in his throat and a bit embarrassed of being seen by the dog sled team he worked with. Along with Steele feeling very much more embarrassed now with his old crew seeing him now being morbidly obese. <br>\r\n<br>\r\n\"<span class=\"ctan\">Gah, how much meat did you guys eat? That's gotta be a lot if what I am seeing here.</span>\" Kaltag said as he turns his right side with Nikki. \"<span class=\"cdorange\">Yeah, that's a lot fat to store for a dog er wolf like ya Balto.</span>\" said Nikki as agreed with Kaltag \"<span class=\"clgrey\">Yeah, you could eat a whole horse with that gut! Hehehe....heh.....</span>\" said Star as was trying to brighten the mood only to get a glare from Kaltag as he was not amused from it.<br>\r\n<br>\r\n\"<span class=\"cdorange\">And Steele, we could say the same for ya, why did ya guys eat the whole butcher's meat locker</span>?\" Nikki said as it looked like he was judging Steele until Balto interjected. <br>\r\n<br>\r\n\"<span class=\"cbrown\">Guys, it was my hic idea, I only wanted to make Steele happy as he was sad from what he did *hic* in the... oooh!</span>\" Balto said as he felt his belly moaned and gurgling loudly with a sharp pain inside his stomach feeling like something was about to burst but then moved up his softecas which let out a big.....<br>\r\n<br>\r\n<span class=\"cbrown\">*Burrrup!*</span> which shook the entire building like an Earthquake and it too shook Steele's belly as well and like a chain reaction for Steele, the sharp pain in the stomach, movement in the throat, than the loud belch from Steele.<br>\r\n<br>\r\nThe belching startled the three dogs as if something worse has happened to Balto and Steele but relieved as they laughed a bit.<br>\r\n<br>\r\n\"<span class=\"ctan\">So you mean to tell us that you wanted to make Steele feel better?</span>\" Kaltag said from what he heard from Balto to which Steele replied. \"<span class=\"cblack\">Look guys, I am sorry I let my own ego get the best of me in the serum run, I have learned my mistakes and had accepted my humility here.</span>\" Steele stated as it was clear that he understood that his actions would have led all of the town's people's children dead if he just accepted Balto's help. \"<span class=\"cblack\">So, will you guys accept me *hic* back?</span>\" Steele said as he tried to overcome his shyness from his old teammates.</span></div></div>",
            "created":1598116980,
            "id":2889544,
            "title":"Kaltag, Nikki and Star?"
        },
        "1131121":{
            "author_id":"fatbalto",
            "author_name":"Balto must be fat",
            "choices":[
                "\"No I can't take much more food.\" (Force feed Balto)",
                "\"Alright I am up to the challenge (Balto willingly takes the challenge)"
            ],
            "content":"<div class=\"\"><div> <span>\"<span class=\"ctan\">Hmm, yeah sure I think we can, Nikki, Star?</span>\" Said Kaltag as he turned his direction to his friends. \"<span class=\"cdorange\">If Steele here can swallow his pride from the fastest dog to being a fat one couldn't hurt to being friends den.</span>\" \"<span class=\"clgrey\">Yeah, we accept your apology, Steele.</span>\"  Nikki and Star said as Steele now felt better-being part of the gang while Balto is glad he helped Steele feel better again and accepted back into his old gang.<br>\r\n<br>\r\n\"<span class=\"cbrown\">So *hmph* what do you guys want to do?</span>\" Balto asked a question to Kaltag and the gang. \"<span class=\"ctan\">Well, we were hoping to grab a bite of meat from the butcher's meat locker but you and Steele pretty much ate everything that's now in your guts</span>\" Kaltag pointed as there was literally nothing here left in the meat locker but the bellies of digesting fat of Balto and Steele as Kaltag's paw pokes into Balto's tummy as it rippled and sloshed that made Balto blush a bit at the compliment. \"<span class=\"ctan\">However, I think there can be another way for us to have some fun eating something.</span>\" Kaltag said as he continued \"<span class=\"cbrown\">*uhhmpf* like with what?</span>\" Balto said with little burps coming from his throat. <br>\r\n<br>\r\n\"<span class=\"ctan\">I heard there's a yogurt ice cream machine at the candy store we could eat, do you and Steele think ya could join us?</span>\" said Kaltag as the three dogs were about to head out to said place Kaltag mentioned.<br>\r\n<br>\r\n\"<span class=\"cbrown\">Well uh... *hic* I am not so sure if I could eat any more,</span>\" Balto said as he put his paw around his belly feeling how full and big it was from all of the eating to which Steele said. \"<span class=\"cblack\">Oh come on Balto, I thought I heard *blech* wolves had a huge metabolism from eating a lot</span>.\" As he patted Balto's belly as it felt like a basketball giving a sly smile to Balto. \"<span class=\"cbrown\">Steele I don't know how much a dog can handle eating a lot of food without getting sick,</span>\" Balto said with a concerned look to Steele. <br>\r\n<br>\r\n\"<span class=\"cblack\">Well I feel fine with this gut filled with meat,*hic* a matter of fact I say I love being this fat that I can store warmth for all of winter, but it was your idea of making it a food challenge so I have to give credit to where it's due to not sound my old prideful self Balto.</span>\" Steele's statement had a point of why he and Steele had gotten fat from eating so much meat after all Balto was always known for taking risks but a part of him was still concerned about how much a dog or wolf would handle gaining weight. He has to make a decision, does he want to prove to his friends that he can take on anything that throws at him, or should he be concerned for the safety of himself after all he has a family with Jenna on the way and warned his friends?</span></div></div>",
            "created":1601829180,
            "id":2914953,
            "title":"\"Hmmm, yeah we will.\""
        },
        "115":{
            "author_id":"rana-mcneil",
            "author_name":"Thunder",
            "choices":[
                "He sees Jenna inflated, and wants to inflate too. (Air Inflation)",
                "He makes a bet with Jenna that he could drink a lot. (Water Inflation)",
                "He gets caught and is used for a experiment. (Inflagas Inflation)"
            ],
            "content":"<div class=\"\"><div> <span>Any more ideas how Balto get's rounder?<br>\r\n<br>\r\n<br>\r\n<br>\r\nNote: Inflagas is a gas that inflates everyone who inhales it.<br>\r\nAnd if someone gets directly inflated with it, the gas transforms into pure air by a rate of one to five. So one liter of inflagas makes five liters of air.</span></div></div>",
            "created":1458363600,
            "id":2119791,
            "title":"Free Choice"
        },
        "1152":{
            "author_id":"rana-mcneil",
            "author_name":"Thunder",
            "choices":[
                "Sit down next to Balto and start to fill herself up with water like him.",
                "Tell Balto that he should get bigger.",
                "Force Balto to get bigger."
            ],
            "content":"<div class=\"\"><div> <span>Balto and Jenna had been talking about this for over a week now. Jenna didnt really believe that a dog could drink more than 5 liters of water or some other liquid but Balto thould that it was possible.<br>\r\n\"Come on Jen, it IS possible to drink a lot water.\" Balto said as the two walked throught the streets of Nome. \"Even for you.\"<br>\r\n\"I still dont think that i or you could hold so much.\" Jenna answered. \"I mean, how should so much water fit into a body like mine?\"<br>\r\n\"In you belly of course.\" Balto smiled. \"The more you drink, the bigger your belly will get.\"<br>\r\n\"And after 5 liters it will pop.\" Jenna grinned. \"Like a balloon.\"<br>\r\n\"Jen, we tried to find a solution for this theme for over a week now.\" Balto said. \"So if you still dont think that it is possible to drink more than 5 liters, then i will show you that i can do it.\"<br>\r\nJenna stopped.<br>\r\n\"You what?\" She asked. \"You will what?\"<br>\r\n\"I will show you how much water i can drink.\" Balto explained. \"So you will have a visible, and touchable prove that it is possible.\"<br>\r\nJenna smiled.<br>\r\n\"Okay, if you want to show me, then lets do this.\" She said. \"Lets go to Rosies house and then you can try to surprise me.\"<br>\r\nAfter a short walk the two dogs reaced Rosies house and walked into the backyard.<br>\r\nBalto went to the wall of the shack, sat down and leaned his back against the wall.<br>\r\n\"Could you be so kind and give me the hose Jenna dear?\" He smiled.<br>\r\nJenna grabbed the gardenhose with her mouth and reached it to Balto.<br>\r\n\"Do you really want to do this?\" She asked him.<br>\r\n\"Of course i will.\" He answered. \"Unless you belive me.\"<br>\r\n\"I still dont think...\" Jenna began.<br>\r\n\"Okay, if you insist...\" Balto said putting the nozzle into his mouth.<br>\r\nHe pushed the valve on the nozzle and started to drink forcing large gulps of water down his throat.<br>\r\nJenna looked at the valve of the gardenhose next to her where the water meter started to count.<br>\r\nAfter a few seconds it already showed 2 liters.<br>\r\nJenna looked to Balto who was still drinking with a big smile on is face, then she looked down at his belly.<br>\r\nAnd Baltos belly started to swell!<br>\r\nJenna couldnt believe it!<br>\r\n\"Could it be?\" She thought. \"Can he really drink so much water?\"<br>\r\nBalto continued to drink and the water meter counted higher and higher.<br>\r\nIt reaced 3 liters, then 4 and finally 5 while Baltos belly got round like a basketball.<br>\r\nJenna looked at the water meter and her eyes widened as it reaced 6 liters.<br>\r\n\"Okay Balto, i believe you.\" She said. \"You can really drink more than 5 liters.\" She looked at his belly. \"And you got a cute little belly.\" She grinned.<br>\r\nBalto grinned and continued to drink.<br>\r\n\"Don't you want to stop now?\" Jenna asked.<br>\r\nBalto shook his head.<br>\r\n\"You want to drink more?\" She asked surprised.<br>\r\nBalto nodded.<br>\r\n\"And how much?\" Jenna asked.<br>\r\nBalto shrugged and continued to drink his belly getting bigger and bigger.<br>\r\nJenna sat down next to Balto and put a paw on his growing belly.<br>\r\n\"You get pretty round dont you?\" She asked smiling.<br>\r\nBalto grinned and put his paw on hers.<br>\r\nNow Jenna got the idea.<br>\r\n\"You only did this beause you wanted to pump your belly full of water in front of me right?\" She asked.<br>\r\nBalto nodded and pushed his paw on hers so that both paws pushed deep into his belly.<br>\r\n\"Should i turn the water up so that your belly can get bigger?\" She asked him.<br>\r\nHe nodded quickly.<br>\r\nJenna grinned.<br>\r\n\"Okay, then i will pump you up.\" She said and turned the valve of the hose on full blast. \"Like a balloon.\"<br>\r\nBalto moaned and his belly started to grow rapidly getting bigger with every second.<br>\r\nHe put both paws on his belly and enjoyed his swelling body.<br>\r\nJenna looked at Baltos swelling belly wondering if she could get as big as him if she whould do this.<br>\r\nAs Baltos belly reaced the size of a huge beachball he pushed the valve on the nozzle again and took the hose out of his mouth.<br>\r\n\"You see Jen.\" He said and belched. \"I CAN drink a lot of water.\"<br>\r\nJenna smiled.<br>\r\n\"Oh yes, you can.\" She said. \"Nearly 100 liters.\"<br>\r\n\"Really?\" Balto asked and laughed. \"Thats more as i ever had since i started this.\"<br>\r\nJenna looked at him.<br>\r\n\"You do this more often?\" She asked surprised.<br>\r\n\"Sure.\" Balto answered.<br>\r\nThen he grinned.<br>\r\n\"Wanna try it?\" He asked suddenly holding the nozzle up.<br>\r\nJenna was surprised and looked at the nozzle, then at Baltos huge water bloated belly, then she imagined her own belly at this size.<br>\r\n<br>\r\nWhat should she do now?</span></div></div>",
            "created":1459400400,
            "id":2125808,
            "title":"He makes a bet with Jenna that he could drink a..."
        },
        "12":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Jenna becomes a big eater and gains some extra pounds.",
                "Balto feeds Jenna wanting a bigger girlfriend.",
                "It's always cold, so Jenna adds on fhe pounds for warmth.",
                "Jenna finds an airtank.",
                "Free Choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay. What kind of story do you want for Jenna?</span></div></span></div>",
            "created":1437627600,
            "id":2011459,
            "title":"Jenna"
        },
        "124":{
            "author_id":"rana-mcneil",
            "author_name":"Thunder",
            "choices":[
                "She inflates her belly in public.",
                "She brings Rosie to inflate her belly.",
                "She finds another way to inflate."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jenna finally wants to inflate her belly! She heard that this is the newest thing of becoming hot and sexy.<br>\r\n<br>\r\nBut now she needs to decide how. How will she inflate her belly?</span></div></span></div>",
            "created":1604751660,
            "id":2936111,
            "title":"Jenna finds an airtank."
        },
        "125":{
            "author_id":"lklionessfeed",
            "author_name":"lionessfeeder",
            "choices":[
                "Inflation with airship blimp inflation tanks",
                "Weight gain with two giant unused vats of whale fat",
                "Jenna feeds and fattens or inflates Stella"
            ],
            "content":"<div class=\"\"><div> <span>Jenna decides to find and have a partner to team up with to have fun, Jenna finds the beautiful female pale purple goose Stella, Jenna figures Stella would want to be and get more beautiful for Boris.<br>\r\n<br>\r\nWhich will they do?<br>\r\n<br>\r\nInflation or weight gain, or will Jenna decide to feed and fatten the female goose Stella or inflate Stella?<br>\r\n<br>\r\nInflation: Jenna and Stella find a airship hanger for inflating blimps.<br>\r\n<br>\r\nWeight gain: Jenna and Stella find a football field sized whaling warehouse with free and unused whale fat to feed on in giant vats with long hoses.<br>\r\n<br>\r\nInflation or weight gain: Jenna decides to feed and fatten or inflate Stella.</span></div></div>",
            "created":1488603600,
            "id":2284941,
            "title":"Jenna teams up with Stella the female goose"
        },
        "1251":{
            "author_id":"rana-mcneil",
            "author_name":"Thunder",
            "choices":[
                "both inflate with air? (standart air inflation)",
                "both inflate with helium? (standart helium inflation)",
                "both inflate with the air compressor? (high-pressure air inflation)"
            ],
            "content":"<div class=\"\"><div> <span>Jenna and Stella had now talked for weeks about that dream they shared.<br>\r\n<br>\r\nThey always wanted to inflate their bellies to incredible big sizes.<br>\r\n<br>\r\nBut they couldnt find a way to do it right so that they both get inflated fast and big.<br>\r\nLuckily for them a company that produced huge airships moved into the city to test their airships in the cold weather of alaska.<br>\r\nAnd for those airships they need a lot of air and helium to fill them up. So Jenna and Stella finally found a way to inflate.<br>\r\n<br>\r\nA few weeks after the company arrived Jenna and Stella had a plan how they can inflate their bellies.<br>\r\nJenna sat on a hill looking over the area where the airship company had her huge warehouses waiting for Stella who made a little observation flight to check out the area.<br>\r\nFinally Stella landed next to Jenna.<br>\r\n\"Hey Stella.\" Jenna greeted the goose. \"Is everything like we planned?\"<br>\r\n\"Better.\" Stella answered. \"They have so many tanks with air that we could inflate for days, no weeks.\"<br>\r\n\"Perfect.\" Jenna smiled. \"Is there something we need to care about? Someting like guards or something?\"<br>\r\n\"I saw some guarddogs on the main gate, but those are no problem for our plan.\" Stella answered. \"So should we start?\"<br>\r\n\"Yes, lets go.\" Jenna grinned.<br>\r\nThey started to walk towards the fence around the area.<br>\r\nStella had no problems to get over the fence, but Jenna had more trouble.<br>\r\nBut then Jenna spottet a small three who had fallen on the fence and that she could use as a ramp to get on the other side.<br>\r\n<br>\r\nAfter they had crossed the fence they had no more problems and entered a gigantic hangar who was big enought to contain 4 Airships with 260 meters lengt at the same time.<br>\r\n\"Whoa, this place is huge!\" Jenna gasped.<br>\r\n\"Not as huge as we will be soon.\" Stella grinned.<br>\r\n\"Haha, yes youre right.\" Jenna agreed. \"So lets get big!\"<br>\r\n<br>\r\nThe two walked over to some Hoses laying on the floor.<br>\r\n\"So, which hose should we use?\" Stella asked.<br>\r\n\"Hmm, lets see...\" Jenna said. \"We have air, helium and i see a huge air compressor over there.\"<br>\r\n<br>\r\nShould they...</span></div></div>",
            "created":1490763600,
            "id":2296553,
            "title":"Inflation with airship blimp inflation tanks"
        },
        "1252":{
            "choices":[
                "Stella fattens to the size of a large city",
                "Stella fattens to the size of the earth"
            ],
            "content":"<div class=\"\"><div> <span>\"Over here Stella\" said Jenna \"This is the place I told you about. Inside there should be two giant vats that can somehow create a never ending stream of whale fat from nothing.\" Stella was ecstatic that she was about to get what she always dreamed of, to feed and fatten endlessly. Stella went in and sat in a wide open area of the factory as Jenna grabbed the two hoses and brought them to Stella. She stuck both hoses into Stella's mouth. Sensors in the hose sensed that it was time to activate the vats which began to send a constant stream of whale fat into her mouth. As she started gluttonously gulping down the fat, a huge smile came upon her face. Her whole body began pulsing out at a constant rate. Even after just a few seconds her cheeks were already the size of large beach balls. She already had a few dozen chins pour out in front of her. Her belly fattened and sprawled out in front of her, already the size of a small boulder. Her breasts had also fattened quite a bit and layed on the ground on both sides of her. Both rump cheeks were the size of a large boulder. Stella moaned in pleasure, delighting at the site of her massive belly growing bigger, fatter, while rolls appeared all over her. She was like a balloon being filled with fat. Stella was grabbing and playing with every roll she could reach while she still could. \"Mmmmm, so big, so fat, so sexy. Crank up the flow to max Jenna, and blimp me to the extreme. Ooohhh, fill every single bit of me with tons upon tons of soft warm sexy flubber. Make me burst out of this factory. Make me EXPLODE with fat rolls, Make me an ocean of blubbery beautiful fat. DO IT, DO IT TO ME NOW, JUST KEEP MAKING ME FATTER AND FATTER AND FATTER. Feed me, FEED ME, FEEEEEEEEEEEED MEEE. Please make me an unrecognizable billowing blob of fat, blubber, and flab.\" Fortuitously for both of them, the hose and vat can also sense her lustful desire to be even fatter, and tripled the flow by itself. Jenna climbed up on her to get a view of her fattening face. Though when she gets there all she could see is a beak slightly poking out of countless jiggling rolls of fat that was wrapped around the hose. \"Mmmm someone is a greedy glutenous piggy, aren't they. One that can't stop themselves from fattening uncontrollably.\" teased Jenna. \"OH YES, OH YES, I'm a big fat piggy goose blob, so please make this fat blob even bigger, even blobbier, even FATTER. And please also play with all my bulging, thickening, rolls of fat.\" cried Stella. Jenna was more than happy to comply, as she began jumping up and down on her fat blob body. Making her a giant undulating ocean of fat, as waves of fat rolls crash into each other over and over again all over her body. Stella couldn't describe it, the feeling of every inch of her body swelling with more and more fat. But it felt amazing, she began to relax and sink into her own rolls of fat as she watched and felt herself fatten more and more.<br>\r\n<br>\r\nIt wasn't long until she filled the factory. Every nook and cranny filled with her fat. Her rolls started bursting through all the doors and windows. It wouldn't be long before her waves of fat smashed down the walls. Stella was squealing with joy as she felt the walls start to give. \"Come on, COME ON, just a little more until I can fatten unconstrained. Then the whole WORLD can see this massive goose blob grow bigger and bigger.\" Suddenly she exploded out of the warehouse, her blob body billowing out and hitting the ground, making her jiggle, quake and shake like no one has ever seen before. </span></div></div>",
            "created":1490677200,
            "id":2295901,
            "title":"Weight gain with two giant unused vats of whale..."
        },
        "12521":{
            "choices":[
                "The formula starts making her lust and desire to fatten even more intense",
                "Stella gains the mass of the Earth in fat every second"
            ],
            "content":"<div class=\"\"><div> <span>Stella was loudly moaning in pleasure as she continued fattening out in all directions. At this point, her neck rolls numbered in the thousands, with more blubber rolls forming every second. The neck rolls have completely swallowed up her head by several feet. Her hands and feet had also sunken deeps into her fat rolls by several feet. Her blob body had just started slamming into the surrounding buildings. The feeling made Stella scream, \"Oh god, I'm helpless to stop myself from getting fatter, it just feels too good. I'm a prisoner in my own blob body, unable to move or wiggle any part of me, and I LOVE it. Oh, but I need to be even more massive. I need to be even FATTER, and I need the whole world to see.\" Jenna said \"This really is all you want to do isn't it. To have your rolls of fat pool out in every direction and smother anything in the way of your blob body.\" Stella's blob rolls have already covered half the city, truly showcasing her deep desire to grow and fatten out of control. \"Of course this is all i want to do, and why should I do anything i don't want to. And all I want is to get FATTER. To have more and more fat pour out of me in a never ending tidal wave of flabby blob rolls.\" Stella answered. From afar Stella looked somewhat like a giant volcano that was erupting with lava. Except instead out lava flowing down her body and pooling on the ground all around her, it was her own thickening blubber rolls. Stella noticed a helicopter flying overhead, observing her. She knew it was filming her for the world to see, which turned her on even more. She starts moaning again, making sure the people in the helicopter could hear her, \"Oooooh that it, make me FATTER, make my rolls cover the Earth. Feed me into a planet sized blob, just make me grow fatter beyond all comprehension. Please make me grow faster and faster. If only there was a super weight gain formula that I could also guzzle and gulp down.\"<br>\r\n<br>\r\nStella got just what she wanted as several new helicopters appeared, all carrying a giant vat with the words Mega-Gain on it. When they were over Stella they releases it, dropping it into several of her chin rolls. The force of the drop makes her blob body and fat rolls jiggle and slap together even more. Jenna made herself useful and grab the new hose, putting it into her eagerly awaiting maw. The formula quickly made its way into her mouth and down into her stomach. She surged out in an even faster constant rate. This made her totally and completely give herself to the fat.  She couldn't focus on anything but the feeling of getting fatter and fatter. She just kept expanding, her goose blob body was like an ocean during an extreme hurricane. Wave after wave of fat crashed against each other harder than ever, making slapping noises that can be heard all around the world.</span></div></div>",
            "created":1490677200,
            "id":2296386,
            "title":"Stella fattens to the size of a large city"
        },
        "12522":{
            "author_id":"lklionessfeed",
            "author_name":"lionessfeeder",
            "choices":[
                "Jenna and Jared help feed Stella fatter",
                "A giant universal sized vat of whale fat awaits for Stella"
            ],
            "content":"<div class=\"\"><div> <span>The factory building's whaling company manager arrives, just in time to see the pale purple goose blobs' flab and blubbery rolls and body explode and erupt out from the factory building. Which was the size of a football field. Jared, a young human male of 18 years of age, and surprisingly enough the manager of the local whaling company, walked on closer to the wobbling and jiggling mass of goose fat.<br>\r\n<br>\r\nJared could tell that the pale purple goose was feeding from the two giant vats of unlimited supply of whale fat, judging by the two hoses going up to the top most middle area and down into the towering pile of rolls that must likely to have been the neck of the goose. So without wasting any time, Jared, climbs up the rolls of flabby fat until he gets up to where Jenna is. Fortunately, he was born with the rare ability to understand animal language. He noted the red husky playing with the blob goose's fat in various ways. He settled himself down at the entrance to the vertical tunnel of ringing and jiggling neck rolls with the two hoses going down there. \"Well, my my my, your such a hungry and gluttonous and beautiful goose. Hello, my name's Jared. I kinda owned the factory building you broke out of. Don't worry, I have more along Alaska's shores. With more giant vats of whale fat.\"<br>\r\n<br>\r\nDespite himself, he couldn't help but sit down, slightly sinking into Stella's flabby and easily jiggled blubbery fat. He started to rub and caress over her fat, not minding what Jenna would think about him. He always wanted a hungry and gluttonous female to be with and feed her fatter and endlessly fatter.<br>\r\n<br>\r\nWith Stella's gluttonous hungry feeding on the limitless supply of whale fat, she billowed, pulsated, jiggled, wobbled fatter and fatter, spreading out in a widening radius as well as bulging upwards, rolls stacking and piling up as she mounded higher, pooling and oozing outwards as she spread out further and farther. Within an hour, Stella was still on earth but she had fattened huge, no, massively enormous that Stella herself was the fat blob size of the planet earth.</span></div></div>",
            "created":1490763600,
            "id":2296517,
            "title":"Stella fattens to the size of the earth"
        },
        "1253":{
            "author_id":"lklionessfeed",
            "author_name":"lionessfeeder",
            "choices":[
                "Feed and fatten Stella",
                "Inflate Stella",
                "Get Boris the goose to feed and fatten Stella"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Feed and fatten the beautiful pale purple female goose Stella...<br>\r\n<br>\r\nOr inflate the beautiful pale purple female goose Stella...</span></div></span></div>",
            "created":1490763600,
            "id":2296531,
            "title":"Jenna feeds and fattens or inflates Stella"
        },
        "12533":{
            "author_id":"andrewisback",
            "author_name":"AndrewTheWolf2021",
            "choices":[
                "Bring me a steak. All of them.",
                "More..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><span class=\"clgrey\">Boris:</span> \"What do you need help with?\"<br>\r\n<br>\r\nJenna said...</span></div></span></div>",
            "created":1518066000,
            "id":2450885,
            "title":"Get Boris the goose to feed and fatten Stella"
        },
        "125332":{
            "author_id":"lklionessfeed",
            "author_name":"lionessfeeder",
            "choices":[
                "Jenna and Boris use the hoses to feed and fatten Stella the whale fat",
                "The human manager interrupts to feed and fatten Stella while he caresses her"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's take Stella to the new whaling company to feed her.\" Said Jenna.<br>\r\n<br>\r\n\"Okay, I'll go get her and meet you there.\" Boris said, turning to fly-hop and run towards the bay area where Balto's home boat rested. Once there, Boris told Stella about the whaling company and with a shock to Boris, she instantly got interested.<br>\r\n<br>\r\n\"A whaling company, you say? So what are we waiting for? Let's go. I'm VERY hungry. And instead of fish, I'd like to have some whale fat. Something I did before coming up to Nome down in the States. I had fed on so much whale fat that I had got so beautiful and gorgeously fat that I was at a whole ten tons of flab, blubber and rolls of goose fat.\" Stella explained, while rubbing and caressing over her goose body in various places, making moaning sounds. \"Now I hope to get even far fatter. Much more bigger and fatter beautiful and gorgeous goose blob of fat than I did before. Maybe big and fat enough to be as to cover up all of Alaska, or even all of North America under my goose fat.\"<br>\r\n<br>\r\nWithout another word, they went off together to where the whaling company was to meet up with Jenna.<br>\r\n<br>\r\nUpon arrival, they managed to get in without alarming the area since they had waited for the human workers to leave. By some luck, there was a hanger door left open since it was into the spring season. But they didn't know that the human manager was still there and was secretly watching them from behind a darkened room.<br>\r\n<br>\r\nInside the main hanger room, there was thousands of giant vats as big as two story houses lining up against both walls with all of their hoses from each side connected to one single hose, making two usable hoses laying out on the floor. This whaling company was, actually as big as ten football fields.<br>\r\n<br>\r\n[What will Jenna, Boris and Stella do?]<br>\r\n<br>\r\n[Go ahead and use both large hoses to feed Stella the whale fat?]<br>\r\n<br>\r\n[The lone human manager shows himself, interrupts and proceeds to help feed and fatten Stella the whale fat with both hoses at the same time, while he not only watches Stella glutton herself on the whale fat but also climb up on her to caress her goose fat.]</span></div></div>",
            "created":1518238800,
            "id":2451204,
            "title":"Take Stella to the whaling company to feed her"
        },
        "13":{
            "author_id":"ackwriter",
            "author_name":"Raptor",
            "choices":[
                "Balto",
                "Jenna",
                "Kodi",
                "Niju",
                "One or more of them"
            ],
            "content":"<div class=\"\"><div> <span>Aleu woke up one morning to find out she had a big problem...a very big one.<br>\r\n<br>\r\nThe day before, she had been brought back home to Nome to once more live with her family, and, amazingly enough, now former wolf enemy Niju was living with them, as well.<br>\r\n<br>\r\nYou see, Niju had, yesterday morning, been feeling agonized at his decisions, thanks to what his awful past had made him into and, after running through the woods for some time, gone into a cavern which just happened to have a special geode in it, as he would discover once he was deep in there, said geode being between quite a few stalactites and stalagmites.<br>\r\n<br>\r\nIt's status of being special, as the glowing mysticism would give off, was that it could literally do anything and everything that anyone and everyone who happened across it wanted, and what little good was left in Niju spurred him to put this to the best use it could be put to.<br>\r\n<br>\r\nSo, looking directly at it, he had its mystic properties make it so that everything was forever set right with the world, past, present and future, and that everyone would know he did it and why he decided to.<br>\r\n<br>\r\nThough it worked, there were two side effects...Niju was teleported to Nome and so was Aleu(though Nava was perfectly able to become the pack's leader once more), and, thanks to how Niju had done this on a day when nighttime would just happen to have a full moon, there was an even worse side effect that no one would know about until it happened.<br>\r\n<br>\r\nAnd that was how anyone who slept under where the full moon's beams were on that night would have a full moon kind of weight gain of the vastest sort.<br>\r\n<br>\r\nDespite him and everyone else knowing all else about what Niju had done, neither he nor any one of them, Aleu or otherwise, was aware of the second side effect and neither he nor them counted on it, either.<br>\r\n<br>\r\nThey easily came to see, despite not knowing it before, what the first side effect had to be, and everyone, including Aleu and Niju, easily adjusted to having her old life back and having his new life now started, respectively.<br>\r\n<br>\r\nNiju told everyone how sorry he was for all he'd done, but Balto pointed out it wasn't necessary and that everyone knew he'd done this largely out of repentance, along with all else everyone knew about what he'd done(of course Niju was welcomed to his new life as a friend and non-bloodline member of Balto's family, which he was most grateful for along with loving all the forgiveness and lauding he received).<br>\r\n<br>\r\nSo, moving on to the fact that each canine had a different sleeping spot on that night and Aleu was sleeping under that full moon, its beams made her glow white, and, when she woke up the next morning...<br>\r\n<br>\r\n\"WHAT THE?! HOW DID I GET THIS WAY?!! I JUST HAPPENED TO FALL ASLEEP UNDER THE MOON!!!!\" Aleu exclaimed, confused, shocked and terrified.<br>\r\n<br>\r\nYou see, despite how her forepaws and forelegs, hindpaws, central back and lower hind legs, neck, tail and face looked more or less the same as before, it was a whole different story with the rest of her, as she had layers and ripples of fat aplenty on her sides of her back and belly alike, and speaking of her belly, it was easily larger than the world's biggest exercise ball, almost obscuring her face.<br>\r\n<br>\r\nThere was no denying it. Aleu was morbidly obese, and blatantly so. Even her navel, despite being the same otherwise, had gotten longer, deeper and taller.<br>\r\n<br>\r\nShe didn't know what she was going to do or what she was going to tell anyone, and it went from bad to worse when she heard footsteps, and then a giant gasp of alarm, turning to see that it came from the throat of...</span></div></div>",
            "created":1516078800,
            "id":2441569,
            "title":"Aleu"
        },
        "135":{
            "choices":[
                "Blue pill (Continue this story)",
                "Red pill (See another story for Aleu)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sorry to intrude here, I'll give you this opition, but after this won't be turning back.<br>\r\n<br>\r\nYou take the the blue pill and see how Aleu goes in this story or you take the red bill and see another story for Aleu.</span></div></span></div>",
            "created":1560402000,
            "id":2672762,
            "title":"One or more of them"
        },
        "1351":{
            "author_id":"ackwriter",
            "author_name":"Raptor",
            "choices":[
                "They each took turns with the explaination",
                "Balto explained it all while Niju and Jenna tried to think of a cure for Aleu",
                "Jenna explained everything and the other four gave ideas on what might help"
            ],
            "content":"<div class=\"\"><div> <span>The one who had gasped upon seeing Aleu in her new state was none other than her brother, Kodi, who then exclaimed: \"HOLY COW! WHOA! WHAT HAPPENED TO YOU, SIS? YOU WERE JUST THE SAME LAST NIGHT, AND ALL YOU DID WAS FALL ASLEEP LIKE THE REST OF US!\"<br>\r\n<br>\r\nAleu then replied: \"DO YOU THINK I'M NOT ASKING MYSELF THAT SAME QUESTION? Wait, Kodi...maybe this is just some kind of messed-up dream. How about we see if it is? You know, poking? Pinching? Other things like that?\"<br>\r\n<br>\r\nKodi, calming down like she just had, said: \"Yeah...that might be a good idea. This could be some sort of messed-up dream...let's see.\"<br>\r\n<br>\r\nSo he walked over and pinched Aleu's belly hard, pulling the giant pawful of blubber he got back just as hard and letting it snap back against her massive belly, causing Aleu to go: \"OOOOOWWWW!!!! AAAAAAAAAA!!!! OOOOOOOO!!!! KODI, THAT HURTS!\"<br>\r\n<br>\r\n\"Oh, sorry!\" Kodi said. \"Nuts! Maybe if I poke you in your belly button and run my claw up that and another part of that region of your belly, instead...\"<br>\r\n<br>\r\nAleu nodded and Kodi poked her belly button, causing Aleu to go: \"EEEHHHEEEHEE.\" because, while it didn't hurt, it did feel weird and sort of tickled, and when Kodi rubbed his foreclaw up the region of that part of her belly below her navel and through it and finally above it, it felt even odder and tickled even more, so Aleu said: \"AHHEEHEEHEETEEHEEHEE...\"<br>\r\n<br>\r\n\"Drat.\" Aleu said, but Kodi then said: \"Sorry...but wait...I'm also sorry about how this is going to feel, but it's the last possibility of this just being a dream that we've got. Fair warning...it's really going to hurt, but it's either that or giving up on trying to see if you're just dreaming along with me.\"<br>\r\n<br>\r\n\"Gotcha.\" Aleu said, and so it was that Kodi bit her belly as hard as he could and grabbed two fistfuls of fat to go with the mouthful of blubber he now had and he pulled it all this way and that, then, knowing how painful this was for Aleu, he swiftly switched to pushing her belly around and in and out, also this way and that, in addition to licking it and then jumping on and hugging it, making it so that he was no longer hurting her, but was now tickling, hugging and rubbing her, which of course felt much nicer.<br>\r\n<br>\r\nThe sounds Aleu made were: \"AAAAAAAAAIIIIIIIIIEEEEEEEEEEEEAHAHAHAHAHAHAHATEEHEEHEEHEEHAHAHAHAHAAAAAAHHH HHHHHHHHHHHMMMMMMMMMMMMMMM...\"<br>\r\n<br>\r\nAfter she was no longer lost in the bliss from the soothing relief of what ways of Kodi's touching her belly were hugging and rubbing, she felt his nose touch her belly, his tail sweep across it, his forepaws beat on it as though it were a drum and all four of his feet climbing on up it with some gripping in order to get to the top of it, and when Aleu saw Kodi's face looking at her own following how she briefly laughed from how much it tickled, she then heard him sigh and shake his head along with seeing a disheartened look on his face, which she then echoed on all counts.<br>\r\n<br>\r\n\"Well, so much for the idea of it just being a messed-up dream.\" Kodi said to her.<br>\r\n<br>\r\n\"Yup.\" Aleu replied. \"No question or doubt about it now...this is definitely reality. But seriously, how did I get so fat? I was just the way I had been before prior to falling asleep last night. And I wake up being this much a big, fat load of blubber? Huh?\"<br>\r\n<br>\r\nSuddenly, though, footsteps were heard by them both, and it would turn out that Balto, Jenna and Niju had recently found out about the effects of the full moon thing and what would happen if someone had slept under it the night that preceded this morning, right after they reacted accordingly to what had happened to Aleu and saw Kodi atop her huge sphere of a belly.<br>\r\n<br>\r\nNow, the way that they explained everything after their shocked reaction was...</span></div></div>",
            "created":1560402000,
            "id":2672785,
            "title":"Blue pill (Continue this story)"
        },
        "1352":{
            "choices":[
                "MEAT! Er I mean she decides to take little bite of meat as she felt a bit hungry",
                "She runs back to her pack to let them know of all the meat you can eat."
            ],
            "content":"<div class=\"\"><div> <span>Aleu was out in the wilderness of the far east of Russia, hunting for some prey as it was her duty as pack leader of her wolves, it may not have been easy at first when joining them but luckily she received help from one of the wolves that had taken a liking to her as he was known as Taku a brown wolf that taught her the tricks of how wolves hunt froming a bond with each other becoming mates, even though Aleu was only part wolf, she still misses her family and friends in Nome especially her father most of all but at least she has found her place in the world.<br>\r\n<br>\r\nAs the wolf-dog was exploring the wilderness as she had ordered Taku take charge of the wolf pack due to how they had came the land known as Russia´s far east, Aleu volunteers herself of scouting out the whereabouts of this strange land along with having some alone time for herself even though it might have been a risked with only traveling by herself. It was only two days ago one of the wolves had spotted some flying object up in the sky that looked like some large bird and produced loud noises as it flown pass them and had disappeared over the mountains, that was Aleu´s mission to investigate where this strange bird was flying and after only a two days of heading towards the direction she had found the site of where it went.<br>\r\n<br>\r\nThis strange giant bird was of not of nature but rather made of metal as it laid down on its right side of the wing where the left one was sticking up and the plane had some strange markings or in this case human words that was completely foreign to her along with a red star on its left side, there was some strange scent that came from the giant metallic bird as Aleu approached to the side door of the metallic bird and what she saw was....</span></div></div>",
            "created":1560402000,
            "id":2672763,
            "title":"Red pill (See another story for Aleu)"
        },
        "13521":{
            "author_id":"masterfatbalto",
            "author_name":"Balto must be fat",
            "choices":[
                "Nah, continue eating, there's plenty of meat to go around.",
                "Take it easy, think this through if you want to keep your beautiful thin form."
            ],
            "content":"<div class=\"\"><div> <span>Aleu was so surprised of seeing so much meat in one place, she was famished from all the traveling she decided to eat the meat in the plane.<br>\r\n<br>\r\n\"Wow, what kind of meat is this?\" Said Aleu as she saw what looked like a huge bag full of beef jerky as she sniffed the bag as it gave her a scent of a sweet roasted beef, her muzzle dipped in the open bag and came out with a piece of jerky in her maw and chewed it down her gullet, the taste of it was like nothing she had tasted any other meat her and her wolf pack had tasted when eating meat of their prey from hunting. <br>\r\n<br>\r\nThe flavor of that beef jerky had left her transfixed on eating the beef jerky she wanted more of it, more she wanted as she ripped the bag of beef jerky open and began taken huge chunks of the beef jerky biting it down and wolfing it down into her stomach, she repeated this 5 times and her stomach was starting to bulge out a bit. <br>\r\n<br>\r\nWhen she was half way through the bag, Aleu noticed her belly felt full and saw her underbelly as it looked like she was 3 months pregnant as it was almost the size of soccerball\"Am I gaing weight?\" Aleu said to herself as she settled her hind on the floor of the plane and put her right front paw putting pressure on it as it felt tight and Aleu started to have a tummy ache.<br>\r\n<br>\r\n\"Oh, I don't feel so good. *Burps* maybe I should take a break, didn't realize that I might lose my thinly frame if I continue eating.\" Aleu said as she thinks to herself if she should stop now and get her wolf pack here, or should she continue eating the meat aboard this plane? </span></div></div>",
            "created":1575213060,
            "id":2754191,
            "title":"MEAT! Er I mean she decides to take little bite..."
        },
        "135212":{
            "author_id":"masterfatbalto",
            "author_name":"Balto must be fat",
            "choices":[
                "Talk to Taku "
            ],
            "content":"<div class=\"\"><div> <span>Aleu thought to herself that if she continues to eat too much, she'll get fat, what will the other wolves think of her and most of all her father and brother Kodi. Will the wolves think of her as weak leader for eating all of the meat and would her father and brother be ashamed of her for getting fat? <br>\r\n<br>\r\nBut than she remembers a dream she had a few nights ago, in her dream as the wolf pack was traveling through this new land, the wolves were having a hard time trying to hunt down prey as many of the caribou were suddenly disappearing and as the wolf pack couldn't eat the caribou, they started to get weak and starved to death as if there was no prey to eat in this new land and most of all winter was coming. <br>\r\n<br>\r\nShe and her mate Taku were laying down in the floor of the cave. \"Aleu, what happened to the caribou?\" Her mate said as he was weak. \"Taku hang in there, I'll find us something.\" Aleu tried to get up but her legs were malnourished and weak as she couldn't get up. \"We haven't eaten anything in months Aleu, we couldn't even support our pups. Is this the end for us?\" Taku replied as he was slowly drifting away. \"Taku no! You can't give up yet, I can still-\" Aleu was cut off as she realized he was gone as what was left were a wolf's skull and bones. \"NOOO!\" Aleu woke up right next to her mate as it was only a bad dream which woke him up as well.<br>\r\n<br>\r\nAleu now remembers what that dream meant, they haven't been able to find any caribou in a while and this meat would be their last chance of survival to get through the winter even if every wolf should be fat, this plane is filled with meat that can feed her entire wolf pack throughout this and she would prove it if she had to put on some weight.  <br>\r\n<br>\r\nAleu went outside of the crashed plane and let out a howl as a way of communicating to her wolf pack from a far distance, 5 seconds later she heard their howl to her confirming they would come to her, the she wolfdog went back into the wreckage where a ton of meat was still there.<br>\r\n<br>\r\nAleu continues eating the rest of the beef jerky from the bag and than moves on to smoked sausages while still having a tummy ache but Aleu mustered on as she continued eating doing her best to ignore the discomfort. As she continued eating the meat the more weight she gained  as her once thin legs started to look a bit flabby and her rump getting big as well and her soccer ball sized stomach was now the size of a beach ball as Aleu leaned back to examine her belly and she still believed she has enough room for her belly as it no longer felt discomfort and it was apparently true that wolves can expand their bellies and Aleu started to like her new fat look. <br>\r\n<br>\r\nAs Aleu was about to continue eating but than heard pawsteps coming as it turned out to be her wolf pack. \"Aleu, we are here now, what have you found for us?\" Taku announced outside along with the other wolves. <br>\r\n<br>\r\nAleu thought to herself if she would be embarrassed by rest of wolves as they would possibly think of her being selfish if she has eaten all of the meat but she should explain her plan that could help or even benefit her wolf pack. So she courageously came out of the door of the plane but with a bit of struggle as her belly was so big for the door itself \"Hing! Come on!\" She said as she pushed herself out but with enough luck she did. <br>\r\n<br>\r\nAs Aleu came outside of the wreckage plane within the wolf pack's sight, they were puzzled by Aleu as their female Alpha was fat. Nuk, the big wolf of the pack chuckled a bit at Aleu's new look which caught her attention. \"What is it Nuk?\"Aleu said to the big wolf, to which he repliemd back. \"Sorry, sorry Aleu, I thought it looked like you were pregnant with a huge litter of puppies.\" Nuk said with his accent as he tried to control his laughter. \"Well, than maybe you could feel them if I have to sit on you Nuk while I explain to everyone what we are going to do.\" Aleu said to the big wolf as he said \"I apologize ma'am.\" As he was no longer chuckling. <br>\r\n<br>\r\n\"Alright,\" Aleu announced to the rest of the wolf pack, \"What I have found here is some human craft that has crashed down here is indeed filled with meat, and we all know we haven't been able to find the caribou in the few days we have explored this territory and another fact that we are in the season of winter, every wolf here should store up fat to stay warm for the winter as you can see me here.\" All the wolves than talked to one another about this plan Aleu has for them and worried if they lose their physical fitness they need to hunt but some were starting to see her plan could definitely work for them in the end if they need to store up fat. <br>\r\n<br>\r\n\"I know it's weird but I remember the vision I had 2 weeks ago where we were starving to death and that we would even result in eating our own, this is our best chance of survival, consider this a blessing from the spirit brothers and sisters.\" The entire wolf pack concluded in a agreement to Aleu's statement and as ordered three wolves went inside to the wreckage plane and take out the rest of the meat Aleu had not eaten yet.<br>\r\n<br>\r\n\"Aleu, can we have a chat in private?\" Taku said as Aleu came toward him with her fat belly jiggled. </span></div></div>",
            "created":1575543360,
            "id":2755694,
            "title":"Take it easy, think this through if you want to..."
        },
        "1352121":{
            "author_id":"masterfatbalto",
            "author_name":"Balto must be fat",
            "choices":[
                "Aleu digs into the meat as does Taku",
                "Aleu decides to force feed her mate so that they are equally fat."
            ],
            "content":"<div class=\"\"><div> <span>Aleu waddled to her mate as every wolf was focused on having their share of the meat. Taku gaze at the big belly Aleu had on her as it jiggled. \"Taku, is there something wrong?\" Aleu said to him as he looked directly into her blue eyes. \"Oh, well it's something.... I.... umm, I am going to say this and I never have told any wolf about this as it's a secret but...\" Gesture his paw up to Aleu wanting to directly whisper in her ear. \"I have had this fascination with bellies ever since I was a pup.\" \"What?\" Aleu  replied as she was curious of Taku's meaning. \"When ever I saw a female wolf baring Cubs or any other animal, I always wondered how big a belly can get, and you made me more attracted to you with your new weight.\" Taku confessed. <br>\r\n<br>\r\n\"I mean, I still love you no matter what as I have come to know you, and as your mate.\" Taku said as he was in approval for Aleu gaining weight. Aleu smiled at Taku and licked his muzzle. \"So do you want to be fat like me hun?\" Aleu said as Taku nodded. <br>\r\n<br>\r\n\"Good than, as Alphas of this wolf pack, we will be the ones who have the biggest bellies.\" Aleu said she take Taku to one of the piles of meat as every wolf was eating them like it was a fest.</span></div></div>",
            "created":1575716820,
            "id":2756536,
            "title":"Talk to Taku "
        },
        "14":{
            "choices":[
                "\"Okay, I submit.\" (Joins her)",
                " \"Mm-No I just can't!\" \"Alright, it's going to be that way than?\"(Force him)"
            ],
            "content":"<div class=\"\"><div> <span>Kodi was out in about in the small town known as Nome where he considered it home since he was a little pup along with his family and sled team mates, he was just minding his own business just enjoying his day as it was a beautiful winter afternoon and wondering where Dusty was up too, just as he stumbled upon a shed, Kodi smelled something foreign in the air that came from the shed right next to him, being the curious wolf-husky that he got form his father he went in and what he saw shocked him.<br>\r\n<br>\r\nWhat he saw was his team mate Dusty in the shed eating on the meat that was stored in there and Dusty looked different from usual, for instance her slim legs were now flabby as well as her thin frame was replaced with a tummy sticking out as she chewed on the meat before swallowing it down.<br>\r\n<br>\r\nKodi was surprised to see his friend and the dog he had a crush on was eating the thick meat juicy meat.<br>\r\n\"Du-Dusty! What are you doing?\" Kodi utter those words to his friend as he was worried.<br>\r\n<br>\r\n\"Oh Kodi! There you are!\" Dusty turned her direction to him. \"Come in! Try some of this meat out!\" she said as she wobbled her way to him.<br>\r\n<br>\r\n\"But Dusty, isn't that meat from the butcher? We could get caught!\" Kodi said looking at the weight Dusty had gained.<br>\r\n<br>\r\n\"Oh, come on Kodi, why would there be so much meat in here that could feed the town for years? Plus, if they have so much meat in here, would it go bad if it just stays in for the entire season?\" Dusty raised a good point as there was lots of meat that had an expiration date March in the current year but still was hesitant in joining with her.<br>\r\n<br>\r\n\"But, we have to be in shape if we are in need to pull the sled and besides don't we have kibble the humans give us for our meals?\" Kodi countered the reasoning Dusty presented to him.<br>\r\n<br>\r\n\"Yeah, but I heard kibble doesn't give the protein a working dog needs from what I heard.\" Dusty said to Kodi in which he replied back. \"And who told you that?\" \"Dipsy.\" \"What?! Dispy doesn't do much as she's just Mr. Conner's pet and we are sled dogs!\" Kodi pointed out the fact that taking advice from a dog like Dipsy won't do much.<br>\r\n<br>\r\n\"Well, your part wolf from your dad's side and since dogs and wolves are related, it's much more natural for them to eat meat than what the humans provide?\" Dusty also brought up that fact that made Kodi second thinking his stance but was a bit hesitant.<br>\r\n<br>\r\n\"Well, uh...\" Kodi tried to muster up his thoughts till Dusty brought up another fact. \"And I heard that storing up fat will also keep you warm form the whether we're having today right?\" and just like that a blizzard was forming outside of the shed where Kodi started to shiver a bit as the breeze came in quick that the door in the outside closed on it self shut leaving only the two of them alone inside of the meat locker.<br>\r\n<br>\r\n\"So, what will it be than Kodiak?\" Dusty said into his ear as his stomach also growled at him for missing out on his meal in the afternoon as well.</span></div></div>",
            "created":1560402000,
            "id":2672757,
            "title":"Kodi"
        },
        "142":{
            "choices":[
                "How does this go?",
                "Dusty knocks out Kodi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I will give you the reader two options on this storyline here.<br>\r\n<br>\r\nOne, you can make up on what happens here for Kodi as Dusty force feeds him while show you my interpretation in the second, good deal?</span></div></span></div>",
            "created":1560402000,
            "id":2672861,
            "title":" \"Mm-No I just can't!\" \"Alright..."
        },
        "1422":{
            "choices":[
                "What happens next? You decide."
            ],
            "content":"<div class=\"\"><div> <span>\"Mm-No I just can't!\" Kodi said as he know that he won't be able to run faster in a condition of being fat. \"Alright, it's going to be that way than?\" Dusty said as she now takes action.<br>\r\n<br>\r\n\"What? You ca-\" Kodi is cut out when Dusty whacks him in the head with a thick meat leg so hard that he stumbles to the ground. \"Sorry Kodiak, but you leave me with no choice.\" She said to him as Kodi's vision blurs out into darkness losing consciousness.<br>\r\n<br>\r\n<br>\r\nIt might have been an hour since he was knocked out but Kodi finds himself in a sitting position on the floor of the meat locker shed with his legs tied up (hind legs on the floor and his fore legs tied to planks of wood in like a make shift chair) only with his sled dog harness on him that's tied to a pillar wood stand where his back lay against making sure he can't escape along with his thin white under belly exposed.<br>\r\n<br>\r\nKodi was trying to remember what had happen as if it were a strange dream he had but to his dismay this was realty. \"Ah finally your awake.\" Kodi turned to his left direction to see Dusty walking or should we say wobbling to him as Dusty now looked more fat as the sliver creamy under belly of hers jiggled a bit in comparison to when Kodi saw her she only looked like she was pregnant with pups (If only Kodi wished that were the case than it would be understandable for her to eat a lot).<br>\r\n<br>\r\n\"DUSTY! CUT THIS OUT NOW!\" Kodi shouted at her to which she said. \"Come on Kodi, think of this as date?\" she said as her nose was against Kodi's close enough for a nose boop.<br>\r\n<br>\r\n\"A date? Since when does a date involved one of the two lovers forcing the other to EAT!?\" \"Don't be like that, I am generously feeding you, look your bones are visible on your chest.\" Dusty putted up a paw to him so that he can feel how his skin was so close to the rib cage of his chest.<br>\r\n<br>\r\n\"No! I am not that hungry!\" He protested but his stomach still growled at him for denying his hunger.<br>\r\n<br>\r\n\"Looks like you stomach disagrees with you, here we can go with two options,\" Dusty said as Kodi listens to her suggestion. \"I can just hand you food for you to consume as your belly gets bigger, but if you don't comply, I am going to have force you with this device here.\" Dusty walked over to reveal a machine with a hose attached to it.<br>\r\n<br>\r\n\"Uh...uh, Wh-what is that?!\" Kodi muttered in fear of what he saw before him. \"That,\" Dusty turned her head towards it. \"its a food capacitor, what it does is it grinds the meat into bits of mush where it's easy to sallow down.\" she than looks back at the helpless wolf-husky, Kodi had no choice but to comply.<br>\r\n<br>\r\n\"Okay! Okay okay... Ju-just don't overdue it Dusty.\" Kodi muttered those words in defeat as Dusty's tail was wagging from her big behind. \"Once you get this big like I am, you will feel so much pleasure.\" as she goes get a meat leg from a plie nearby, she comes to Kodi with only the leg of the bone as Kodi than chews on it and swallows it down and took another bite after that repeating that again and again.<br>\r\n<br>\r\nAfter about 20 minutes of Kodi eating the scraps of meat where he just finished his sixth try, his stomach was starting to bulge out a bit with a naval belly button showing itself as Dusty saw it. \"Hey look you got a cute belly button on your tummy!\" Dusty pointed with her paw to show Kodi. \"Dusty, I think I am about full here, I don't think I can take much more.\" Kodi groans as he felt like he ate 5 bowls of kibble. \"So it's the food capacitor than?\" When Dusty mentioned the food capacitor he immediately took back what he said and Dusty gladly went back to get another scrap of meat and Kodi took another bite out of it.<br>\r\n<br>\r\nAs Kodi was now on his 13th try of eating a spare rib, Kodi's belly was at a size of a beach ball as it was full of food, Kodi felt overwhelm as this was too much for a meal a dog could eat in a day. \"Dusty, I th-thi-think I can't... eat much..more...please stop for a mome-\" Kodi fell to a food coma sleep, Dusty still wanting Kodi to be fat like herself respected his wish as he need more time to digest the food in him which just leaves Dusty the perfect opportunity to strap the food capacitor to his maw and muzzle and after that went back on packing on pounds as well.<br>\r\n<br>\r\nAfter an hour, Kodi woke up from his food coma slumber as he flet his body was different as his chest felt like flab moobs along with his legs now felt flabby than a dog's or a wolf's athletic muscle along with his rump felt bigger and heavy as well, all of the digesting has put him in this condition and his belly now flet big but still at the size of a beach ball and his sled dog harness was still on him and he notice his maw was strapped to a hose to the food capacitor!<br>\r\n<br>\r\n\"Hmm! Dufmh!\" Kodi tried to speak but couldn't make the words proper instead. \"Don't worry now Kodi, your belly has just digested all that food you ate so you have more room for more.\" Dusty said as she was right next to the food capacitor and Dusty was also different as well as now her silver belly is bigger as it touched the ground and was twines the size than Kodi's, Dusty than activates the food capacitor as meat was grinding into mush and moved it's way to the hose leading to Kodi's maw.<br>\r\n<br>\r\n\"HUMMPH-\" Kodi tried to yell for help but was no use as there was nothing he can do as the mush meat went in his mouth and forced down his gullet with more and more came in. Dusty move a bit as she can with her belly just dragging on the floor, only her pudgy hind legs could move as her belly kept her fore legs up from the ground, wobbling her way to Kodi as he tried to get this strap off of him.<br>\r\n<br>\r\n\"Kodi, you can't fight it, just let it in it will be alright.\" Dusty told him in a soothing tone as Kodi had tears in his eyes when he looked at her as he again felt his belly swollen up again.<br>\r\n<br>\r\n\"Lets just see how big your belly can get till that harness on you bursts off.\" Kodi's belly began to moan and groan at how full of mush meat was in there it was 3 times the size of a beach ball of a white creamy belly and the sled dog harness getting tighter and tighter on Kodi's belly till.<br>\r\n<br>\r\n*PING*<br>\r\n<br>\r\nThe metal pin of the sled dog harness bursts off of Kodi's belly like a bullet straight into the food capacitor that shut it down, Kodi took a sign of relief as there was no more mush meat going down in his gullet as Dusty took the strap off of him which fell on to Kodi's belly that was now at the same size of Dusty's sending ripples of fat on the wolf husky belly before sliding down to the floor, Now the ropes tide to Kodi's legs were also free as he could move a bit again but he couldn't move at all as he was heavy.<br>\r\n<br>\r\n\"Dusty, why?\" said now that it looks like it has been done with him not just being fat but morbidly obese. \"Because I wanted to show you my love and affection to you Kodi.\" Kodi was some what confused form the answer and was going to say something back until he felt like something coming out from his maw.<br>\r\n<br>\r\n*BELCH* Kodi burped a rupptly which made Dusty giggle at him and Kodi looked at her just seeing how her giggles also sent ripples on her belly, just seeing that made Kodi blushed as he realized just how beautiful she looked being fat. Both of their bellies made nosises together as if singing in harmony. \"So how does it feel?\" Dusty said to him as she rubs her paw on Kodi belly which just felt so good. \"Well uh.\" Kodi said as he couldn't come up with words but he was starting to get the hang of it as his big belly just felt so soft like a dog bed along with it being so warm as the blizzard was still going on outside. \"You like it don't you?\" Dusty said to him in his ear to which Kodi said, \"You know maybe this aint so bad.\" \"See? I know you would come around.\" Dusty said before a belch came from her. \"Oh, sorry about that, all this eating has sort of made me sleepy.\" \"Yeah I think so to-HIC!\" Kodi said as feeling the same way.<br>\r\n<br>\r\n<br>\r\n\"Love you Kodi.\" Dusty said as she laid her head down on Kodi's belly, \"Love you too.\" Kodi said as he laid his on top of her head as they both fall into deep sleep in sitting positions with their big bellies side by side with their navels visible making gurgling and groaning noises together.</span></div></div>",
            "created":1560574800,
            "id":2673738,
            "title":"Dusty knocks out Kodi"
        },
        "14221":{
            "choices":[
                "Continue here."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To get an idea how Big Kodi and Dusty bellies are here's this link of Balto and Steele. <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/31432577/\" target=\"_blank\">http://www.furaffinity.net/view/31432577...</a></span></div></span></div>",
            "created":1560701340,
            "id":2674241,
            "title":"What happens next? You decide."
        },
        "15":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "After everyone hating him, Steele goes to food for comfort.",
                "Steele gets inflated.",
                "Steele gets lazy and has become fat because of it.",
                "Steele gain weight to be a better dog than Balto.",
                "Free Choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which story will it be for Steele?</span></div></span></div>",
            "created":1390107600,
            "id":1729857,
            "title":"Steele"
        },
        "152":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Air.",
                "Water.",
                "Lard."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of way should Steele be inflated.</span></div></span></div>",
            "created":1498366800,
            "id":2342790,
            "title":"Steele gets inflated."
        },
        "1522":{
            "choices":[
                "Shipwreck",
                "Water Factory (Only Good Water)",
                "Somewhere Else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where can he find water?</span></div></span></div>",
            "created":1514869200,
            "id":2435816,
            "title":"Water."
        },
        "15222":{
            "author_id":"vlad228228",
            "author_name":"vladislav4ik",
            "choices":[
                "good",
                "not good"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the good wathe for a good girl</span></div></span></div>",
            "created":1603539180,
            "id":2927931,
            "title":"Water Factory (Only Good Water)"
        },
        "152221":{
            "author_id":"vlad228228",
            "author_name":"vladislav4ik",
            "choices":[
                "good",
                "wery good (more)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>wow! this really good</span></div></span></div>",
            "created":1603539300,
            "id":2927932,
            "title":"good"
        },
        "15223":{
            "choices":[
                "Water Company (Similar as the Factory)",
                "A new city, or a town. (Only in USA.)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So if somewhere else, then what could it be?</span></div></span></div>",
            "created":1514869200,
            "id":2435821,
            "title":"Somewhere Else."
        },
        "153":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Steele takes another look at himself and tries to lose weight.",
                "Steele still becomes lazy and eat even more.",
                "Steele gets a visitor."
            ],
            "content":"<div class=\"\"><div> <span>It was another day, Steele was in his home sleeping. But even since, the whole sled-rescue thing, he hasn't be like much. He has also not have really done anything. This has made him lazy and tend to overeat. By overeat, I MEAN overeat. It's because of the laziness, Steele has gotten quite fat.<br>\r\n<br>\r\nHere's his current weight:<br>\r\n<a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/3331768/\" target=\"_blank\">http://www.furaffinity.net/view/3331768/...</a><br>\r\n<br>\r\nSteele was eating a few sausages laying down. He also had a few t-bone steaks in front of him. After finishing the sausage links, he was about to go for the steaks. But before that, he took a bit of a look at himself. He noticed that his belly has gotten quite bigger.<br>\r\n<br>\r\n\"Huh? Am I getting fat?\" Steele asked himself. \"Can't be. I'm not fat. Just a little more fluffy.\" In denial of his weight gain, he still decides to eat the steaks. He does not yet realize how much the laziness and extra fat gonna affect him.</span></div></div>",
            "created":1390107600,
            "id":1730019,
            "title":"Fat and lazy Steele."
        },
        "1532":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Steele had trouble getting up.",
                "Steele was full and sleepy.",
                "Steele thinks he should start losing weight."
            ],
            "content":"<div class=\"\"><div> <span>The only thing that Steele wanted to do other than sleep, was to eat. So eat he did. He had a few more of those T-bone steaks. The steaks were tender and well cooked. Chewing and shallowing each one. After he was done withem, Steele decide to take a nap. Waking up only to get some snacks if he got hungry again.<br>\r\n<br>\r\nDuring the next few days, Steele was napping less, but was eating much more. He continued to eat extra kibble and extra meat. After a while, his belly began to bloat up more as it touched the ground. He still didn't seem to care. He continue to eat more until.....</span></div></div>",
            "created":1390107600,
            "id":1730118,
            "title":"Steele still becomes lazy and eat even more."
        },
        "15321":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "He decided to head to a meat cellar.",
                "He starts chowing down on some dog food."
            ],
            "content":"<div class=\"\"><div> <span>Here's a little reference on Steele's current size:<br>\r\n<a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/7532479/\" target=\"_blank\">http://www.furaffinity.net/view/7532479/...</a><br>\r\n<br>\r\nThe next day, Steele woke up from another long period of sleeping. He try to get up, but he had a bit of a problem. Steele finally realizing that his belly was touching the ground and he was getting pretty round.<br>\r\n<br>\r\n\"Oh my.\" Steele said looking at herself. \"I have gotten so big. Guess I have been eating a lot lately.\" It took a while, but Steele was finally able to stand up. He didn't really mind the extra poundage. In fact, he could see himself getting use to it.<br>\r\n<br>\r\n\"This weight isn't all too bad.\" Steele said. \"If fact, it makes me feel strong.\"<br>\r\n<br>\r\nWith that said, his stomach started growling loudly. He was hungry. </span></div></div>",
            "created":1399870800,
            "id":1795576,
            "title":"Harder to get up."
        },
        "153212":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Steele realizes how big he's gotten and other dog notice.",
                "Steele wants to eat more."
            ],
            "content":"<div class=\"\"><div> <span>Steele's food bowl was empty for a while now. He was still pretty hunger. So with the amount of energy he had, he got up and with into the kitchen. Looking in the cabinets, he found a LARGE bag of dog food. Enough to feed a dog for a month. Steele looked somewhat, displeased.<br>\r\n<br>\r\n\"Hmm....this is good.......for a light snack.\" Steele said.<br>\r\n<br>\r\nSteele spend awhile and found a few more dog food bags just as big. He was now able to find about 10 bags.<br>\r\n<br>\r\n\"Now that's more like it.\" Steele said pleased. <br>\r\n<br>\r\nSteele began to open one of the bags and starting eating. His belly had no bounds to the amount it can have. As he finish the first bag, he went off to the next bag. His belly also continue to grow more with each bag. He continue to eat bag after bag of dog food. After a while, he had finished the 10th bag of dog food and was full. But in the end, after all of that, Steele was now even fatter than before. He was now very large and with a pretty big and round belly.<br>\r\n<br>\r\n\"*yawn* That was good. But now I'm tired.\" Steele said.<br>\r\n<br>\r\nWith that said, Steele laided down on his back and went to see again. Seems like sleeping was the only thing that Steele did as much as eating.</span></div></div>",
            "created":1413349200,
            "id":1872071,
            "title":"He starts chowing down on some dog food."
        },
        "1532121":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Go to a meat cellar.",
                "Get some more dog food."
            ],
            "content":"<div class=\"\"><div> <span>Here's is want Steele's current size is now. <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/8494939/\" target=\"_blank\">http://www.furaffinity.net/view/8494939/...</a>  The picture is from HectorTheWolf of FA. Now on with the chapter.<br>\r\n<br>\r\nThe next day, Steele got up after sleeping so long. About 12 hours of sleep, which is a crazy amount of time to sleep, even for a dog. Steele still had a problem getting up a little bit, but not as much the first time. He woke up very hunger so he ate a couple 100 links of saugage for his breakfast. When he was done, he actually began to realize how much bigger he was now. He was currently about the size of a medium small bear.<br>\r\n<br>\r\n\"Ok! Maybe I have gotten a LOT bigger than I used to be.\" Steele said to himself. \"It's not THAT bad being this big, right?\"<br>\r\n<br>\r\nEven with all the weight, Steele decide to go out. It toke awhile, but he was finally able to get the hang of walking with the extra weight. As he walk, he got the notice of all the sled dogs. Some of the dogs were shocked with such a massive dog, others kinda chuckled at his weight.<br>\r\n<br>\r\n\"Hey, isn't that Steele?\" A male husky said.<br>\r\n\"Woah! He really let himself go.\" Said another husky dog.<br>\r\n\"Hmm.....everyone's staring.......\" Steele thought. As he did, a young husky pup came by Steele. He put his paws on Steele's belly and had a curious look on his face.<br>\r\n\"Mommy, why is this dog so fat?\" The pup said.<br>\r\n\"H....Hey!\" Steele said. The pups mother came by.<br>\r\n\"Now Now! It's not polite to ask questions like that.\" The mother said. She then took her pup and the two were on their way.<br>\r\n<br>\r\nSteele now had a concern look on his face.<br>\r\n<br>\r\n\"Am I really THAT fat?\" Steele said to himself.<br>\r\n<br>\r\nSteele went back home after his walk. Even with some of the dogs comments about his weight, he was still ok with it. Also, his stomach was begin to growl like a beast. He was starving like before and want food.</span></div></div>",
            "created":1413522000,
            "id":1873420,
            "title":"Steele realizes how big he's gotten."
        },
        "15321211":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Learn some control.",
                "Forget that. Just keep eating."
            ],
            "content":"<div class=\"\"><div> <span>Steele was starving more than ever. But he knew if he ate more food, he would most likely end up bigger than he already is now. But that didn't bother him at all. In fact, he felt that he was all for it. He already got the hang of walking in his big size, so he felt that he could handle it.<br>\r\n<br>\r\n\"I know just the place to fill my belly.\" Steele said.<br>\r\n<br>\r\nSteele heads to the back of his house and find a door leading to a cellar. He goes into the cellar, but has some problems fitting pass the door.<br>\r\n<br>\r\n\"Gah! Come on!\" Steele said annoyed. Later, he was able to get out. He was relieved that beening struck was over. He took a look and was now in awe. The cellar was filled with ceiling-to-floor with meats. There were links, t-bones, steaks, beef shacks, pork belly, even whole calf. All smoked and cured with deliousness.<br>\r\n<br>\r\n\"Look at all the meat. I don't know where to start.\" Steele said smiling.<br>\r\n<br>\r\nA second after saying that he rushed to a box of steaks. Taking a big bite of one to savor the tastes. Then goes to to quickly eating the rest of the steaks in the box. Once he was done with that, he went for the sausages. He suck them up like he was eating spatghetti. Than Steele starts to eat even more boxes of steaks. Doing so cause his belly to expand more, but he continue eating like it was nothing. He was now craving pork. He reached out for one of the smoked pig and devoured it. He would continue to more eating, til he realized that he has eating about half the food in the cellar. That and the fact that his belly has gotten so big, his legs are now not touching the ground. That and his was close to twice the size he was before.<br>\r\n<br>\r\n\"Uh oh! My legs aren't touching the ground.\" Steele said. \"But there is still more to eat, and I'm still hungry.\"<br>\r\n<br>\r\nSteele felt that he was in a dilemma. If he ate anymore, he was not gonna be moving for a while.</span></div></div>",
            "created":1413781200,
            "id":1874945,
            "title":"To The Meat Cellar."
        },
        "153212112":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Steele decides to go for dessert.",
                "Steele takes a nap for a couple of hours."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm already big and still hungry. A few more pounds won't matter.\" Steele said.<br>\r\n<br>\r\nWith that said, Steele continued with his feast of beef, pork and other meats. He also increase a bit of his eating speed as he started round 2. Going for more of the smoked sausages, slurping them all up. They going for the boxes of t-bone, ribeye, and silorn steaks. Steele ate and ate. He got bigger and bigger with every pasting minutes. After 2 hours, nothing was left in the cellar but the bones of already eaten meat and a massive husky, who was close to waiting a ton now. Steele was now HUGE. He was at least 2 to 3 times the size he was before he started eating. His legs, no longer could reach the ground, his face around his neck was puffy and lastly, he belly was round and bloated close to the size of half the room.<br>\r\n<br>\r\n\"BUUUUURRRRRRPPPPPP!!!!!!!!\" Steele bleched. \"So full.\"<br>\r\n<br>\r\nAfter all the eating......</span></div></div>",
            "created":1414818000,
            "id":1880169,
            "title":"Forget that. Just keep eating."
        },
        "1532121121":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "So much sweets galore.",
                "More sweets than he expected."
            ],
            "content":"<div class=\"\"><div> <span>Even thought he said he was full, Steele felt that he still had a small (but really a big) hole in his stomach that was not satified. He was now craving something sweet. Steele knows that the town bakery wasn't to far, so he got up and try to get out the storage door. It took a LOT of effort for him just to move, let alone get the door. He was able to get out, but not without wreaking the the doorway a bit. But he didn't really care about that. The only thing he cared about was his stomach.<br>\r\n<br>\r\nIt was pretty late. Nighttime in fact. Everyone in town was asleep. So this made things easier for Steele. After some long wobbling, Steele finally made it to the bakery. Actually, it was more of a bakery in the front and a factory in the back. The bakery front had all the things like pastries and few loaves of day old bread, while the factory back would most likely have cakes, pies and more sweets galore that the front doesn't show, and in bunches. With that in mind, Steele decided to try to get in the back. The factory backdoor had a lock on it.<br>\r\n<br>\r\n\"Hmmm, this lock could be troublesome.\" Steele said to himself. Steele grab a rock near by and banged it at the lock. A took a few times but the lock finally broke. \"Haha!\"<br>\r\n<br>\r\nWith that said, Steele open the doors. Steele turn on the lights and found......</span></div></div>",
            "created":1419397200,
            "id":1907003,
            "title":"Steele decides to go for dessert."
        },
        "15321211212":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "A few extra treats.",
                "A large container of milk."
            ],
            "content":"<div class=\"\"><div> <span>Steele's eye were amazed with all of delicious pastries out. There were hundreds of pie, sweet rolls, and some big cakes. All the sweets made Steele a bit excited.<br>\r\n<br>\r\n\"Well, well. Looks like they made a lot here.\" Steele said. \"It's too bad most of this will be gone before morning.\" Steele than gave out a devilish smirk as he started his feast for sweets. He began by eating some of the sweet cinnamon rolls with white icing. They were quite delicious to him. Enough to eat 12 dozen of them. Next, he went to the cakes, which were mostly vanilla and topped with berries. Forget taking a slice, he just ate the whole cake. He would take no time devouring each and every cake, and getting frosting all over his face. The more he ate, the wider his belly gotten. After a while, he finish nearly most of the baked goods. The last things that were left was the pies. Which happened to be Steele's favorite dessert. Steele than gazed at the pies and took one.<br>\r\n<br>\r\n\"Ah! Look at them all. Blueberry. Cherry. Lemon. Apple.\" Steele said licking his lips. See all the pies were made for a event the next day. Unfortunely, none of the pies would made it. The only place was to filled Steele's big belly. Hundreds and hundreds of pies, one by one, gone. All of them eaten by one greedy husky. There were nothing left but the empty pie tins. That and a ginorous pie-filled husky, who was now over 3000lbs. Steele now had a really fat face with puffy cheeks and a belly that was just MASSIVE. Steele currently just layed on his belly and rubbing it a bit.<br>\r\n<br>\r\n\"This is the life.\" Steele said to himself. It seem like Steele has had his fill. As he continues to rubbing his belly, he looks around the factory and sees.......</span></div></div>",
            "created":1419656400,
            "id":1908083,
            "title":"More sweets than he expected."
        },
        "153212112122":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Steele tries to leave before the bakery owners come in.",
                "The bakery owners find the massive husky."
            ],
            "content":"<div class=\"\"><div> <span>Steele happens to see a large tanker containing milk. This was the milk that they used for some of the baking products. After eating all of the pies, he was really thirsty. So milk would defienty help. Steele waddle over to the tanker and grabbed the hose and put it in his mouth. There was a button that he need to push to activate it. Due to his size, he couldn't push the button with his paws. So he had to use his belly. It worked and the milk started to flow to the tube and into Steele's mouth. Steele was loving it.<br>\r\n<br>\r\nPicture on what Steele is currently like: <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/15294996/\" target=\"_blank\">http://www.furaffinity.net/view/15294996...</a><br>\r\n<br>\r\nThe milk continue to flow and started to expand Steele massive belly even more. Swelling up every little bit second after second. When the tanker was down to half, Steele felt full, but was determine to drink the whole thing. When he finally finished, his belly twice the size he was. All the drinking made his stomach gurgle and rumble.<br>\r\n<br>\r\n\"Urk! I think I went too far.\" Steele said finally realizing all he was eaten and drinken. <br>\r\n<br>\r\nHe was too big and too tired to move. So, he just got his back and rest. He look up at his titanic stomach which happen to gurgle even more.<br>\r\n<br>\r\n\"I just need to rest for a bit.\" Steele said to himself before taking a nap.<br>\r\n<br>\r\nThe nap was meant to be only for a few minutes, but it turned out to be a few hours. The next morning.......</span></div></div>",
            "created":1419656400,
            "id":1908200,
            "title":"A large container of milk."
        },
        "1532121121221":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "A few other BIG huskies come to find Steele to talk to him.",
                "Steele becomes the talk of the town because of his weight."
            ],
            "content":"<div class=\"\"><div> <span>Steele woke up feeling a bit woozy. After eating all the pies, cakes, and drinking all that milk, of course he would feeling a bit uneasy. His stomach swoosh and churned more and more. Then he realized that was still pretty much morning now and if his stays in the bakery any longer, than the owner's will come back and they may not be too happy to find out a massively bloated husky ate all their bake goods.<br>\r\n<br>\r\n\"I better get out of here.\" Steele said getting from his back. The problem was, his legs no longer touched the ground. \"Ah jeez!\" Steele was gonna be in big trouble if he didn't get out of there. So, he had to do the one thing to move. Rolling. His round belly made it a doable thing. <br>\r\n<br>\r\nSo, he started by wobbling back and forth several time. Than when his momentum was right, he began to rolling his way out. He made his way to the door, only to once again, get stuck. He was a two ton husky. What did you expect. Steele was not happy. He had to use all his strength to get out. It took breaking some of the doorway in, but he was out. Steele was relieved, but only for a few seconds. He then continue to rolled the rest of ther way home. At last, Steele finally made it back to his den and his fireplace. Laying down on his belly. Steele realizes that he was titanic compared to what he was before. It made him feel powerful.<br>\r\n<br>\r\n\"I could get use to this.\" Steele said.</span></div></div>",
            "created":1419742800,
            "id":1908568,
            "title":"Time to go, Steele."
        },
        "15321211212212":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Steele get more hungry than before.",
                "Steele gets a run-in with Balto."
            ],
            "content":"<div class=\"\"><div> <span>Steele spend a few hours sleeping in. After all that he has eaten, he needed the rest. Currently, the husky had the belly the size of two mammoths. It was filled with mostly meat, bake goods and milk. All the content he ate was still digesting. His belly churned and churned.<br>\r\n<br>\r\n\"I can't believe I ate so much.\" Steele said. \"I must have the stomach of a team of sled dogs now.\" (A team is about 8 dogs). \"Actually for all I know, it may as well be 3 or 4 teams looking at this belly.\" Steele said patting his belly like a drum.<br>\r\n<br>\r\nSteele was done resting and he felt well. So he try to get up from being in his back. He was able to, but his legs were not touching the ground anytime soon. Steele decided that if he was gonna be this big, he had to get use to it.<br>\r\n<br>\r\n\"I have to get the hang of this extra weight.\" Steele said.<br>\r\n<br>\r\nWith that said, he decided to head out and wal....waddle around town. Like last time, the dogs were in shock and awe with this husky's size. <br>\r\n<br>\r\n\"Woah! Is.....is that Steele?\" A male husky said.<br>\r\n\"He's even bigger than before.\" Said another husky.<br>\r\n\"The husky must be the size of a cabin.\" Said a female husky.<br>\r\n\"Heh. I'm becoming the talk of the town.\" Steele said to himself.<br>\r\n<br>\r\nAs Steele try to waddle more down, he happen to feel some small poking at his belly. Turns out, it was the same husky pup from before.<br>\r\n<br>\r\n\"Mommy look. This dog is even bigger now. How he get so fat?\" Said the pup. Steele felt embaressed.<br>\r\n\"Haha! His belly is like the size of a whale.\"<br>\r\n\"Now now. It's not polite to say that.\" Said the pup's mom.<br>\r\n<br>\r\nThe mother than took her pup and they went on their way. As Steele watch them go, he heard the words, the size of a whale. He knew he wasn't there yet. But at his rate, he was gonna be soon. The next day.........</span></div></div>",
            "created":1422075600,
            "id":1922579,
            "title":"Talk of the Town"
        },
        "153212112122121":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "A large fire roasted pig.",
                "Large roasted pieces of buffalo."
            ],
            "content":"<div class=\"\"><div> <span>A large and loud grumble cam for Steele's stomach. Not eating much yesterday, plus all his food digested, plus a massive empty stomach equals a massive hungry hungry husky.<br>\r\n<br>\r\n\"Well, guess I'm hungry again.\" Steele said. \"Now, what to do?\"<br>\r\n<br>\r\nThe bakery was still recovering after his dessert raid from last time. There was probably not much food left in the meat cellar after last time. So, the place to go was the town's butcher shop. Steele legs still didn't touch the ground due to his belly, so he had to wander around like last time. The shop was close today, so no one was in today. With made it easier for Steele to sneak in. As he was on his way, his nose smell something. Something smoky and savory.<br>\r\n<br>\r\n\"What is that delectable smell?\" Steele said. Curious, he decided to follow the smell.<br>\r\n<br>\r\nFollowing the smell outside of town. Following up to a point, he from the smell and to his surprised it was........</span></div></div>",
            "created":1424062800,
            "id":1935158,
            "title":"Steele get more hungry than before."
        },
        "1532121121221211":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Butcher Shop. Plenty of Meats",
                "Dog Food Factory. Defiently a lot to eat."
            ],
            "content":"<div class=\"\"><div> <span>The pig was well roasted and pefectly cooked. Steele mouth watered looking at it.<br>\r\n<br>\r\n\"Smells good.\" Steele said. \"Ok little piggy, GET IN MY BELLY!\"<br>\r\n<br>\r\nSteele put out the fire with the snow and quickly devoured the pig. Leaving nothing but the bones. Of course, Steele was still hungry. Now wanting to stay in case the people came back, he waddle his way out. While he was heading back to town he got to thinking.<br>\r\n<br>\r\n\"Ugh! I'm still as hungry as ever. Guess this belly of mine won't be so easy to fill anymore.\" Steele said. \"Now what should I do about it?\"<br>\r\n<br>\r\nThere was the butcher shop he could go to or find someplace. Then he had one other place in mind to go to. Steele remember that there is a dog food factory. It wasn't filet magnoirn, but it wasn't half bad food. So what he he going to go to.</span></div></div>",
            "created":1424062800,
            "id":1935262,
            "title":"A large fire roasted pig."
        },
        "15321211212212112":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Steele began to bloat beginning to fill the factory.",
                "Steele is full and stops."
            ],
            "content":"<div class=\"\"><div> <span>After some waddling, Steele made his way to the Factory. It was closed, but that didn't stop him from getting in. He broke the large double door in with his gut. Steele made his way in, but the factory was dark. <br>\r\n<br>\r\n\"Bah! Need...lights.\" Steele said. He found a switch in the wall and hit it. The lights turn on and some machines turn on too. The kebble was being made by the truckload. \"Woah! It may just be dog food, but I have all of this to myself.\" Steele said.<br>\r\n<br>\r\nSteele headed over to a funnel that dispenses the dog keeble to bags. Only that he laid on his back and put his mouth under the funnel. A couple of kebble dropped in this his mouth and he was chewed it up. He enjoyed it and wanted more. \"Delicious! But I'm gonna need to eat a LOT more.\"<br>\r\n<br>\r\nSteele crank the machine up and he continue to eat more and more kebble. His already massive belly continue to get larger with every second passing. He became so large that his legs were getting covered by his pudge. So there was no real way for him to move. So he just decide to say and eat as much as he can. More and more kebble when into his mouth and he ate more and more. </span></div></div>",
            "created":1424235600,
            "id":1936621,
            "title":"Dog Food Factory. Defiently a lot to eat."
        },
        "153212112122121121":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "The next morning, the workers come back.",
                "The next morning, still no workers."
            ],
            "content":"<div class=\"\"><div> <span>Steele's vorcious appetite didn't seem to get please. He continue to eat more of the dog food. Soon his belly swell up so big it's like he had eaten two whales. His stomach was groaning from eating so much.<br>\r\n<br>\r\n\"Seems like I'm getting full.\" Steele said noticing the pleads of his stomach. \"Bah! I not gonna let this stomach stop me. I shall continue to eat. So you better be ready stomach.\"<br>\r\n<br>\r\nSteele felt that since he was already so big, might as well see how big he could get. So he flip the switch to make the machine move even faster. He belly grow more and more. As he got fatter, so did his face's cheeks and neck. His collar popped out due to his fat. He was ok with it because he felt his neck was choking a bit. After a few hours, the machine ran of of ingredients to make the kebble. So, no more kebble to eat. But even so, Steele's belly now was the size of a two story house. He filled up most of the working dock for the factory. Overstuffed beyond all reason because of the food.<br>\r\n<br>\r\n\"Ha. Haha! Never would I thought I could get a stomach this huge.\" Steele said admiring his belly. \"I feel strong with all the weight. But now I'm tired.\"<br>\r\n<br>\r\nOnce again after all the munching, Steele decides to rest again. He was too massive to more and there was no way he could fit pass the door. So he had no choice but to stay.</span></div></div>",
            "created":1424408400,
            "id":1937340,
            "title":"Steele began to bloat beginning to fill the fac..."
        },
        "1532121121221211212":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Whale fat.",
                "Gravy."
            ],
            "content":"<div class=\"\"><div> <span>As Steele woke up, it was morning. His belly was still quite massive and it seem that he had fully digest his last meal. So now he had a whole empty stomach to fill once again. But first, he had to get out.<br>\r\n<br>\r\nHe was a bit surprised that no workers have showed up during his gorge. But this was lucky. Now.... how to get out when his belly alone was close to the size of the interior? He looked around to see if there was something he could use. He then saw a huge tanker filled with....</span></div></div>",
            "created":1500613200,
            "id":2357327,
            "title":"The next morning, still no workers."
        },
        "15321211212212112121":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "The tanker was empty.",
                "The tanker still had more."
            ],
            "content":"<div class=\"\"><div> <span>The tanker was filled with whale fat. Guess the factory uses it as a filler with the dog food. This gave Steele an idea. If he gulp down some of the whale fat, he belly might get so big that it bursts open the factory. Making Steele be able to be free. This also meant he would get bigger as a bonus. So he didn't complain.<br>\r\n<br>\r\n\"Now... I just need to get the...\" Steele said looking for the hose connected to the tanker. He was able to find it. \".... there!\" <br>\r\n<br>\r\nSteele then quickly put the hose into his mouth. His paws couldn't reach the buttons, so he swung his belly at it hoping it would start up. Lucky for him, it did. The whale fat went through the hose and made it's way to Steele's mouth. The fat pretty much tasted like lard. Steele seem to like it. It took a while for Steele's belly to expand, but as it did, it didn't seem to stop. Steele was now filling up the rest of the factory. The walls began to crack by the pressure of Steele's belly. Eventually, the factory was now in ruins.<br>\r\n<br>\r\nSteele was free now, yet his belly still continued to grow. It seem that Steele didn't want to stop yet.<br>\r\n<br>\r\n\"Since there still plenty in the tank, might as well see how much bigger I can get.\" Steele thought. \"Hope you're ready, belly.\"<br>\r\n<br>\r\nSteele really wanted to get fatter. So he kept gulping from the tank. It must have been really condensed. Cause Steele was already swelling to twice the size of the factory and still growing bigger.<br>\r\n<br>\r\nAfter a while....</span></div></div>",
            "created":1500613200,
            "id":2357478,
            "title":"Whale fat."
        },
        "153212112122121121212":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Was as big as a mountain.",
                "Was as big as all of Alaska.",
                "Realized that the tanker didn't seem to emptied at all."
            ],
            "content":"<div class=\"\"><div> <span>It seem like the tanker wasn't empty yet. Even with Steele's belly being larger than any building in town. Steele didn't seem to care. He happily watched as his mountainous belly grew larger and larger.<br>\r\n<br>\r\n\"I wonder how big I get? As big as a mountain? As big as Alaska? OR even farther?\" Steele thought. \"It fills me with excitement. Come on. Give me more.\"<br>\r\n<br>\r\nSteele started forcefully sucking on the hose so he could get more whale fat out. Steele was now slowly growing into a mountain of pure flab. As he went on he....</span></div></div>",
            "created":1500699600,
            "id":2357783,
            "title":"The tanker still had more."
        },
        "1532121121221211212123":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "He began outgrowing the planet.",
                "The tanker finally emptied."
            ],
            "content":"<div class=\"\"><div> <span>The tanker didn't seem to empty no matter how much Steele gulped down. The mountainous husky soon became bigger than a mountain and started to cover up the town. The people, other dogs, and other animals were trapped with the husky evergrowing flab.<br>\r\n<br>\r\nSteele soon outgrew the whole state of Alaska. But even so, he was growing fatter still. Yet, Steele was enjoying yet. <br>\r\n<br>\r\n\"If this tanker ain't empty, then I want more. I'll be the biggest dog in the world.... cause I will be BIGGER than the world.\" Steele thought.<br>\r\n<br>\r\nThe greedy and gluttonous husky continued chugging the tanker of whale fat like no tomorrow. Bloating up higher and higher that he could be visible from space. Then he started to reach space itself. A behemoth husky with an growing appetite grew more and until....</span></div></div>",
            "created":1578708240,
            "id":2772098,
            "title":"Realized that the tanker didn't seem to emp..."
        },
        "15321211212212112121232":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Steele starts eating Planet Earth.",
                "A planet sized superhero or super heroine intervenes.",
                "You decide."
            ],
            "content":"<div class=\"\"><div> <span>As the very tanker of whale fat Steele gulped down was finally empty, the now planet sized husky with all of his strength threw the empty tanker away as Steele thought to himself.<br>\r\n<br>\r\nWhile Steele wasn't bigger than the Earth, he was still quite sizable. His stomach churned and sloshed so loudly that even in the depths of space it could be heard. Even with what Steele stuffed into it, the gluttonous husky still wanted more.<br>\r\n<br>\r\n\"I'm still hungry. But what can a planet sized husky have to eat?\" Steele thought.<br>\r\n<br>\r\nThen an idea came to mind as Steele realized he can eat an entire planet and that there was no one out there that could stop him or so he thought.<br>\r\n<br>\r\n\"I've always wondered what an Earth cupcake would taste like? Yummy!\" Steele thought as he was getting ready to eat Planet Earth itself.<br>\r\n<br>\r\nSteele starts eating Planet Earth: Steele starts eating all of Planet Earth as the planet's citizens and animals are sadly doomed.<br>\r\n<br>\r\nA planet sized superhero or super heroine intervenes: As Steele's about to eat an entire planet, a planet sized superhero or super heroine arrives on the scene as he or she's about to engage Steele in an all out battle for the ages, for the planet's supposedly doomed citizens and animals can only hope that their planet's savior will be victorious and defeat Steele or it may very well be the end of Planet Earth itself!<br>\r\n<br>\r\n</span></div></div>",
            "created":1587604680,
            "id":2822895,
            "title":"The tanker finally emptied."
        },
        "153212112122121121212322":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Universe Dog vs Steele Part 1.",
                "Other.",
                "Open Choice Chapter."
            ],
            "content":"<div class=\"\"><div> <span>Right as Steele was about to eat planet Earth the ground started rumbling, as planet sized footsteps could be heard throughout the depths of outer space as a planet sized superhero arrived on the scene as Steele looked right at the planet sized superhero who was going to take on Steele himself as those animals that were trapped underneath Steele's flab managed to escape as they caught a glimpse of their savior as a satellite with a worldwide feed passed by as the scene itself appeared on TV screens around the world.<br>\r\n<br>\r\n\"Who are you and do you mind I'm about to have an Earth cupcake?\" Steele said as he addressed his soon to be opponent as he clearly wanted to eat his Earth cupcake without anyone interrupting him.<br>\r\n<br>\r\n\"Allow me to introduce myself you evil fiend for I am Universe Dog and in the name of truth justice and the American way I will right wrongs and triumph over evil, and that means you Steele as I'm going to prevent you from eating this planet that I'll be defending from the likes of you.\" Universe Dog heroically said as he wasn't going to let Steele eat an entire planet and get away with it.<br>\r\n<br>\r\nAt that moment the two stared each other down as our hero knew the fate of planet Earth was in his paws as he was the only one who could defeat Steele and save the day as well.<br>\r\n<br>\r\nUniverse Dog vs Steele Part 1: The battle for planet Earth begins as Universe Dog takes on Steele in an all out effort to save planet Earth itself.</span></div></div>",
            "created":1590767880,
            "id":2842812,
            "title":"A planet sized superhero or super heroine inter..."
        },
        "1532122":{
            "author_id":"slipknot1",
            "author_name":"Animequeen",
            "choices":[
                "he woke up immobile",
                "when he woke up, other dogs were with him."
            ],
            "content":"<div class=\"\"><div> <span>as he woke, his stomach roar with hunger and his whole body shook with lard. <br>\r\nhe was so fat now, <br>\r\nhe gave a slight growl and the family's new assistant raced in<br>\r\nthey had hired her to look after steele's every desire when they couldnt.<br>\r\n<br>\r\nshe walked over to the overweight husky and rubbed his belly.<br>\r\nrelaxing into the girl's touch as he shook with fat.<br>\r\nshe gave a gentle smile and said \"you hungry boy\"<br>\r\n<br>\r\nhis tail wagged against his fattened body as food was mentioned.<br>\r\nshe helped him to his now stubby legs as she prepared food for him<br>\r\n<br>\r\nwhen she returned, steele dug straight into the greasy fries, steaks and whole leg hams<br>\r\n<br>\r\nas he ate his stomach swelled out more <br>\r\n<br>\r\nan hour into his feast and he was down to the last steak.<br>\r\n<br>\r\nas he swallowed the last of his collar snapped and the dog became more fat.<br>\r\n<br>\r\nhe's legs somehow still visable as he rested his paws on what they could reach of his hefty gut.<br>\r\n<br>\r\nshe looked at the stuffed husky and began to rub all his fat in circles, lulling him onto his back as the pleasure set in.<br>\r\n<br>\r\nas she felt his fat through her fingers she began to wonder why the family had let the sled dog get this big.<br>\r\nbut the more she felt him under her she realized he didnt know he was this big, no animal would get this big knowninlgy.<br>\r\n<br>\r\nbut only helped him to sleep...<br>\r\n</span></div></div>",
            "created":1513659600,
            "id":2430345,
            "title":"Steele wants to eat more."
        },
        "1533":{
            "author_id":"supereggman17",
            "author_name":"Reader Jay",
            "choices":[
                "Dixie",
                "Jenna",
                "An Unknownly obese female husky "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The boiler room door opened and in came.....</span></div></span></div>",
            "created":1412830800,
            "id":1869071,
            "title":"Steele gets a visitor."
        },
        "15331":{
            "choices":[
                "Sylvie Included.",
                "Nope. Just one."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>With, or without Sylvie?</span></div></span></div>",
            "created":1514523600,
            "id":2434096,
            "title":"Dixie"
        },
        "15333":{
            "author_id":"granty619",
            "author_name":"Granty3041",
            "choices":[
                "Ok, you can stay",
                "No, get out"
            ],
            "content":"<div class=\"\"><div> <span>When Steele turned toward he was in shock at what he saw. Right at the door was a female husky like him but had some differences. For example, she did not have the dark spots around her eyes like Steele another was that she had two earrings on each ring. But the most amazing difference is her size. Compared to her Steele was nothing in weight she was just huge. Her legs were thick, she also had a large neck so big and fat Steele was surprised that her red,spike collar was able to hold on. And the greatest fattest part of her body was her belly. With a body so big and round it was amazing that her legs could touch the ground.<br>\r\n<br>\r\nFor a better discription click the link(but with out the breast): <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/8512041/\" target=\"_blank\">http://www.furaffinity.net/view/8512041/...</a><br>\r\n<br>\r\nShe looks at him smiles and says \"well this must be the great Steele.......your much fatter than I imagine\". Then he stops looking into her pretty light green eyes and states \"really? I am the fat one maybe you should look into a mirror\". She then ignores the insult and then says \"the names Metal and since I have no where to go do you mind if I stay here for abit. <br>\r\n<br>\r\nSteele did not know what to do he wanted to kick her out but she had nowhere to go and dispite her large body he saw that she was beautiful. And then he made his choice he look her in the eyes and says.........</span></div></div>",
            "created":1419656400,
            "id":1908237,
            "title":"Metal the fat husky "
        },
        "153331":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "The next day, Metal help Steele get bigger.",
                "A week later, Steele and Metal are huger than before."
            ],
            "content":"<div class=\"\"><div> <span>\"I suppose you can stay if you really want to.\" Steele said to her.<br>\r\n\"Great!\" Metal said smiling.<br>\r\n<br>\r\nMetal then sat down next to Steele to talk to him some more. Steele still felt a little weird about her. For one thing, she was bigger than he was. He wonder what did she eat to get so big. Even with her size, Steele found her quite beautiful and easy on the eyes. Metal happen to notice the staring.<br>\r\n<br>\r\n\"What?\" Metal asked.<br>\r\n\"Uhhh...why are you so....\" Steele said uncomfortable.<br>\r\n\"Fat?\" Metal said.<br>\r\n\"Ye..yeah.\" Steele said.<br>\r\n\"Well, if you must know, I tend to have a big hunger.\" Metal admitted. \"See my owner didn't like the fact that I eat so much. Recently, I just ate whole month's worth of dog food. For a team of 8.\"<br>\r\n\"That much?\" Steele said shocked.<br>\r\n\"Yeah!\" Metal said. \"So my owner wasn't too happy about it. So, I left him for a while until he could cool off.\"<br>\r\n\"Oh that makes sense.\" Steele said.<br>\r\n<br>\r\nMetal then layed down on her back exposing her large belly.<br>\r\n<br>\r\n\"Hey. Can you do me a favor?\" Metal asked.<br>\r\n\"What?\" Steele asked confused.<br>\r\n\"Rub my belly.\" Metal asked him.<br>\r\n\"Wha....what?\" Steele said with a red face.<br>\r\n\"Are you nervous to bellyrub a girl like me?\" Metal said giggling.<br>\r\n<br>\r\nSteele didn't like to be mock so he did it. Steele started rubbing her belly and Metal started to be soothe by it.<br>\r\n<br>\r\n\"Ahhh...that feels so much better.\" Metal said.<br>\r\n\"I'm surprised someone as big as you can even move with all the weight.<br>\r\n\"I'm get use to it.\" Metal said. <br>\r\n\"Still, it's a little much.\" Steele said.<br>\r\n\"I can say the same for you.\" Metal said. \"I'm surprised I bigger than you.\"<br>\r\n\"Well, for now a least.\" Steele thought.<br>\r\n<br>\r\nSteele then stopped rubbing Metal's belly.<br>\r\n<br>\r\n\"Hmm...if you don't mind, I think we should get to know each other a bit more.\" Metal said.<br>\r\n\"What do you mean by that?\" Steele said confused.<br>\r\n\"Heehee...\" Metal just giggled.</span></div></div>",
            "created":1433739600,
            "id":1989561,
            "title":"Ok, you can stay."
        },
        "1533311":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Started eating with the help of Metal.",
                "Try to eat as much as Metal."
            ],
            "content":"<div class=\"\"><div> <span>It was the next day. Metal was still with Steele during the time. Steele felt a little weird around her. But in a good way. Anyway, yesterday Metal spend the night with Steele to talk to him more. Also about wanting him to be a little bigger than he was now. So the two of them walk to town to go to the town's deli. Which was close today. Where Metal really wanted to go was the back cellar of the deli where they stored most of the meat.<br>\r\n<br>\r\n\"Okay. Let's see if we can get the door open.\" Metal said to Steele.<br>\r\n\"I'm pretty sure it's lock.\" Steele while turning the knob.<br>\r\n\"Leave it to me and this big old belly of mine.\" Metal said.<br>\r\n<br>\r\nMetal stepped and ran with great force and use her belly to knock the down open.<br>\r\n<br>\r\n\"Doors open.\" Metal said smiling. \"Now let's get in.\"<br>\r\n\"Jeez! What a strong belly she has.\" Steele said to himself.<br>\r\n<br>\r\nThe two fat husky step into the door way. Metal got stuck for a bit, but was able to get out.<br>\r\n<br>\r\n\"Stupid doorways. They seem to get smaller and smaller for me.\" Metal said. \"Hehe! At the rate I'm going, I can say goodbye to indoor.\"<br>\r\n<br>\r\nThe walked around until they sawed all the delicious and smoked meats. They were both in awe.<br>\r\n<br>\r\n\"We hit the motherload.\" Steele said. \"Look at all this meat.\"<br>\r\n\"I hope your stomach is ready for a feast.\" Metal said. \"We don't want to let this go to waste.\"<br>\r\n<br>\r\nSteele was hungry enough, so he......</span></div></div>",
            "created":1433826000,
            "id":1990054,
            "title":"A bigger Steele"
        },
        "15333111":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "Back to Steele's place.",
                "Somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>It has been a good half hour that Steele and Metal have been in the cellar. Steele is currently feeling pretty stuffed after eating so much ribs, sausages, and brisket. Metal on the other hand seems like she was still okay.<br>\r\n<br>\r\nSteele Currently: <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/6774410/\" target=\"_blank\">http://www.furaffinity.net/view/6774410/...</a><br>\r\n<br>\r\n\"Urrrpp!!!! Getting full.\" Steele said laying on the ground.<br>\r\n\"Come on Steele.\" Metal said. \"I thought someone like you could handle this. We barely started.\"<br>\r\n\"We can't all have a pit for a stomach.\" Steele said.<br>\r\n\"Very well.\" Metal said. \"Guess I can stop eating....to help you eat more.\"<br>\r\n\"What?\" Steele said shocked.<br>\r\n<br>\r\nMetal then put a ham into Steele's mouth.<br>\r\n<br>\r\n\"Mmmpthhh!\" Steele said with the piece of meat in his mouth.<br>\r\n\"Now now. Don't talk.\" Metal said.\"This is only the beginning. Let's just stuff you up.\"<br>\r\n<br>\r\nMetal continue to feed more of the meat to Steele. She just continue to feed him more and more stuff. Sausages, ribs, more and more smoked meat. His belly started to bloat up more and more. Metal was liking what she was seeing.<br>\r\n<br>\r\n\"Looks like that belly as finally getting some growth.\" Metal said. \"Let's add more to it.\"<br>\r\n<br>\r\nMetal continue to feed more and more of Steele. After a hour, most the cellar was about empty and was all in Steele belly now.<br>\r\n<br>\r\n\"Okay. No more.\" Steele said.<br>\r\n\"Well it's just about the everything anyway.\" Metal said. \"Looks like you're as big as I am now.\"<br>\r\n\"Can...we go now?\" Steele asked.<br>\r\n\"Alright.\" Metal said.<br>\r\n<br>\r\nMetal decided to take Steele....</span></div></div>",
            "created":1433826000,
            "id":1990067,
            "title":"Started eating with the help of Metal."
        },
        "153331111":{
            "author_id":"dannyboy101",
            "author_name":"RizingBlade",
            "choices":[
                "The next day......",
                "One week later...."
            ],
            "content":"<div class=\"\"><div> <span>Metal took Steele back to his place. She had to roll him all the way home since Steele was too big and full to walk on his own. After making it to his fireplace, Steele just layed down on his back, exposing his massive belly. It stilled gurgled and groaned as it was still digesting all the rood he ate. Steele felt discomfort.<br>\r\n<br>\r\n\"Urk....that has to be the most I have eaten in my life.\" Steele said rubbing his belly.<br>\r\n\"That explains your discomfort.\" Metal said. \"Guess your stomach can't haw the big stuff yet.\"<br>\r\n\"Like you could?\" Steele asked.<br>\r\n\"Yes. I could.\" Metal said. \"I'm still hungry actually.\"<br>\r\n\"Figures that you would be.\" Steele said.<br>\r\n\"Well it's like you said. I have a pit for a stomach.\" Metal said. \"But all my eating and biggest is how I'm to eat more and handle walking at this huge size. That and practice.\"<br>\r\n\"Wait? How...long have you been....big?\" Steele asked.<br>\r\n\"Heehee! Does it really matter?\" Metall said. \"Just know I don't really have plans on being skinny anymore. I also plan to get even bigger than I am now.\"<br>\r\n\"Really?\" Steele said surprised to here that.<br>\r\n\"Yes. Don't know how much bigger. Between the size of this room or size of a cabin.\" Metal said.<br>\r\n\"That big huh?\" Steele said.<br>\r\n\"Don't you want to get bigger?\" Metal asked.<br>\r\n\"Maybe....\" Steele said.<br>\r\n<br>\r\nSteele then got up as best as he could.<br>\r\n<br>\r\n\"Well...I guess I better get back to my owner should have cool down by now. So I will see ya around.\" Metal said.<br>\r\n\"Umm....sure.\" Steele said.<br>\r\n<br>\r\nWith that said, Metal left. Steele started to think about things while looking at his belly.<br>\r\n<br>\r\n\"Should I get bigger too?\" Steele thought.</span></div></div>",
            "created":1437627600,
            "id":2011587,
            "title":"Back to Steele's place."
        },
        "154":{
            "author_id":"andrewisback",
            "author_name":"AndrewTheWolf2021",
            "choices":[
                "He would help someone.",
                "He would inflate himself with water, or others.",
                "He would find some sausages & his favorite food in a market without troubles."
            ],
            "content":"<div class=\"\"><div> <span>Steele is all alone while sleeping because he lost his skills &amp; movement to be a better sled dog. He has nothing, but his own bed. Steele fell asleep, until midnight, he had a dream.<br>\r\n<br>\r\nSteele was now a ordinary husky in California, &amp; wants to look around, but he realize he was fat. He was nervous, because he's was going to be bullied by someone. But he notice about the other dog putting on some autograph, saying \"FREE AUTOGRAPH.\" Everyone else came to see him, &amp; wants some autograph too. Steele was happy to be a star. He would call himself as a movie, &amp; be a movie star too. Steele had a second dream.<br>\r\n<br>\r\nSteele was on-stage for a national burger eating contest. It's against Balto, Kodi, &amp; Aleu. He would be nervous about his death, but he has a special DNA inside his body. the bell rang &amp; Steele is on a move! Steele could eat burgers as fast as he can than Balto does. Aleu is on a lead. 10 minues, later, Aleu can't eat more burger &amp; she would give up, and (well I can't say this one. ***ke.) Kodi was so full, he wants to give up. It is now against Balto &amp; Steele. Will he win? Steele has a final dream before sunrise.<br>\r\n<br>\r\nSteele past away in December 30, 2015. He was at heaven. He was scared of what he had done. But some strange voice said, \"Welcome, Steele.\" \"Who said that?\" Steele asked. \"Are you going to punish me?\" The voice said \"No Steele, I would like you to enter the open gate. Once you enter, you will stay in your favorite place forever. I have a surprise for you.\" Steele was still scared, but to do what it said. Steele enter the gate. Inside was nothing. Until it said, \"Steele, this is your new home.\" Steele was shocked. It's a pile of steak, meat, turkey leg, chicken wings, sausages, &amp; pool of hot dogs where his old friend Metal asking for a date. Steele would love to meet her. All they can is eat, &amp; play. \"If you eat all of these foods, I'll let you know when you want more.\" Steele said, \"Okay, thank you!\" Metal said, \"So, you wanna go watch stars &amp; eats some chicken?\" \"Sure!\" Steele said. They're in love each other, &amp; they want to marry. \"So, uhh... Metal.\" Steele said, while his cheeks starting to glow reddish. \"Yeah?\" \"Well, I was wondering though. I lost my girlfriend, &amp; I have no hope for my old life. I think I'm going to be fatherless, but...\" Why would you be that?\" \"I have no proof for saying that.\" \"Are you sure?\" \"Yeah, sorry. Well, by the way...\" Steele remembered he had a rose to bring with him. \"Will you marry me?\" \"Uhh..........\" Steele woke up! He had an perfect dream, but he can't remember what had happen. Why ever, ha had an idea gaining himself fat. He would gain weight. Steele needs to think of his own plan. Then, he will become a better dog.</span></div></div>",
            "created":1515992400,
            "id":2441383,
            "title":"Chapter 1: Steele's Fatty Dream"
        },
        "155":{
            "author_id":"ackwriter",
            "author_name":"Raptor",
            "choices":[
                "Jenna",
                "Balto",
                "Dixie"
            ],
            "content":"<div class=\"\"><div> <span>Steele was a hated outcast who'd lost all of his popularity, fans and the like after he tried to act like a survivor of the medicine sled delivery and lied about all of the other dogs having died and the medicine having been lost, with the truth thankfully being found out subsequently. <br>\r\n<br>\r\nBut after that, it went from bad to worse for him, for just as he tried to go for the door that had been closed on him, he saw a female winter spirit appear in front of him.<br>\r\n<br>\r\nSaid winter spirit, who had magical powers, said: \"Steele, I am appalled by you and your actions, as well as what kind of monster that shows you are. And, though you certainly deserved to lose your glory, fans, popularity and reputation, there is one last thing you must lose, as well, before you've fully gotten your just desserts.\"<br>\r\n<br>\r\n\"What?\" Steele asked. \"I've just been shut the door on and everyone hates me now, not to mention that Jenna loves Balto and hates me more than ever, even though neither of them like to hate! How much worse can it get for me, anyway?\"<br>\r\n<br>\r\n\"It's very simple.\" replied the winter spirit. \"You see, I am magical, and, though you will not be seeing me again after this, the spell I'm about to cast will take away the final thing you've got going for you. Namely, your fit form. I am going to fatten you massively and make you unable to walk on four feet, and only your hind ones, instead, which, ironically is so, on the one hand, you'll be able to move, but on the other hand, everyone will always be able to see how fat you are.\"<br>\r\n<br>\r\nSteele opened his eyes widely, and before he could do or say a thing, the winter spirit cast her spell and he was on his hind feet with his forelegs having become like arms and forepaws being almost like hands in a split second, with both a great many layers of fat showing on the back of his body and, far more blatantly, an enormous, super fat and jaw droppingly tremendous belly. <br>\r\n<br>\r\nIn fact, I am going to give you a link to a picture on Deviantart to show you how fat he was made, though it is worth pointing out that said picture was drawn not by me, but by HectorTheWolf, and, though the character with fat Steele, Metal, is a creation of HectorTheWolf's and with Steele, I want you to look only at Steele in that picture so you can know how corpulent he just became. <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://img00.deviantart.net/2aea/i/2009/334/d/a/steele_and_metal_by_hectorthewolf.jpg\" target=\"_blank\">http://img00.deviantart.net/2aea/i/2009/...</a><br>\r\n<br>\r\nAnyway, having seen how unbelievably obese he now was, Steele was going: \"N...N...No...this can't be...it didn't just happen...\" <br>\r\n<br>\r\n\"Oh, yes it did.\" said the winter spirit. \"And, before I disappear, I would like to let it be known that you will now fall asleep, and when you wake up, it will be after everyone else does, and the door in front of you will fly open as my magic teleports you in front of all of the other dogs, those polar bears and that goose, though none of the humans, but the ones who you are being shown to will be together thanks to that same magic.\"<br>\r\n<br>\r\n\"P...please. Don't do this. Change me back to normal. I beg you. I've been punished enough.\"<br>\r\n<br>\r\n\"No, you haven't.\" stated the winter spirit. \"But this is permanent, and everyone will see and know it, also thanks to my magical powers, tomorrow, so you will have been punished enough by then, by tomorrow morning. Farewell, you selfish, disgusting, rotten waste of life.\"<br>\r\n<br>\r\nShe vanished and Steele fell asleep, and everything went exactly as she made it happen even though Steele would, as she made clear herself before, never see her again. <br>\r\n<br>\r\nAnd, when everyone was near where it turned out Steele was, as they'd find out, Steele showed up right in front of them exactly in the way the winter spirit had described, and everyone was aghast at how humongously fat he was, unable to speak for quite some time, much like Steele was. <br>\r\n<br>\r\nHowever, the silence was eventually broken, as the ability to speak again and thus respond to this sudden and jarring sight came back to one of the dogs, who commented on what had just been shown to them immediately.<br>\r\n<br>\r\nThat dog was...</span></div></div>",
            "created":1488603600,
            "id":2285036,
            "title":"Magically fattened as punishment for misdeeds"
        },
        "1552":{
            "choices":[
                "Balto apologize him.",
                "He would do something with him."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So Steele was mad at him, just because he was to kill him. Well, he's actually retired. \"Hey Steele,\" he said, giving him a smirk smile. \"Why are you smiling at me?\"<br>\r\nWell...</span></div></span></div>",
            "created":1514869200,
            "id":2435813,
            "title":"Balto"
        },
        "1553":{
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>With Sylvie?</span></div></span></div>",
            "created":1514869200,
            "id":2435808,
            "title":"Dixie"
        },
        "15532":{
            "author_id":"ackwriter",
            "author_name":"Raptor",
            "choices":[
                "Take turns doing what they wanted to Steele's belly, navel and love handle sides",
                "Have it so that she, Balto and Jenna tortured Steele's belly, navel and all"
            ],
            "content":"<div class=\"\"><div> <span>Dixie, breaking the silence, said: \"OH, MY GOD! STEELE, I TOLD YOU BEFORE THAT YOU WERE POSITIVELY DISPOSABLE, WHICH YOU ARE AND ALWAYS WILL BE, BUT NOW YOU'RE DREADFULLY FAT, TOO! LOOK AT THAT ENORMOUS BELLY! AND THOSE BLUBBER LADEN SIDES AND LOVE HANDLES, TOO! BUT HEY, THERE'S MORE OF YOU TO HATE NOW! HOW DID YOU GET THAT WAY, ANYWAY? NOT THAT IT MATTERS, SINCE YOU DESERVE TO BE SO, SO, SO, SO, SO, SO FAT, BUT DO YOU WANT TO TELL US, AND NOT LIE, FOR A CHANGE? WOW, I CAN'T SPEAK ANYMORE THANKS TO HOW HARD I'M LAUGHING JUST NOW! HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HA!!!!!!!!!!!!!!!!!!!!!\"<br>\r\n<br>\r\nEveryone else burst into uproarious laughter, and Steele bellowed: \"STOP LAUGHING AT ME!!!!! I HATE BEING FAT, BUT I'LL BE THIS BALL OF BLUBBER FOR THE REST OF MY LIFE! A WINTER SPIRIT APPEARED AND MADE ME THIS WAY THROUGH MAGIC! YOU MAY THINK THIS IS A LIE, BUT IT'S TRUE! IF YOU DON'T BELIEVE ME, IF IT WASN'T THAT WINTER SPIRIT THAT FATTENED ME LIKE THIS, THEN BINGO THERE CAN KNOCK ME DOWN AND LEAVE ME HELPLESS TO ANYONE AND EVERYONE WHO WANTS TO MAKE FUN OF ME AND/OR DO WHATEVER THEY WANT TO MY BELLY AND LOVE HANDLES WHILE I'M NOTHING BUT A LAUGHINGSTOCK AND A JOKE WHO'S UNABLE TO GET UP!!!!!\"<br>\r\n<br>\r\nBalto then said: \"Well, then, since winter spirits don't exist, it's knocking down time, Steele!\" and ran over to trip Steele and knock him over on his back, leaving him helpless, unable to get up and vulnerable to anyone and everyone who would do anything and everything that they chose to do to him.<br>\r\n<br>\r\n\"NOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!!!!!!!!!!!!\" Steele cried, and Jenna then said: \"Yes. Now, then, what do you think one or more or even all of us should do? Anyone?\"<br>\r\n<br>\r\nJenna was answered by Dixie when she said that they should...</span></div></div>",
            "created":1515992400,
            "id":2441246,
            "title":"Postively disposable and dreadfully fat"
        }
    },
    "info":{
        "author_id":"dannyboy101",
        "author_name":"RizingBlade",
        "brief_description":"An interactice story on Balto, Steele and the other dog and wolf characters in the movie.",
        "created":1390139640,
        "description":"<td align=\"left\" class=\"norm\">Balto and the others are gaining weight and are becoming a bit on the big side. You will get to write chapters for one of these five characters. Balto, Jenna, Aleu (Balto and Jenna's daughter), Kodi (Balto and Jenna's son), and Steele.<br>\r\n<br>\r\nStory Rules:<br>\r\n<br>\r\nThe main character in the story must be the gainer. <br>\r\nOther in one story can gain too.<br>\r\nThe chapters need to be decently long and not too short.<br>\r\nKeep it clean. Nothing digusting or sex stuff.<br>\r\nNo Vores.<br>\r\nCharacters and gain as much weight as you want. I'm not picky.<br>\r\n<br>\r\nOther than that, have fun.</td>",
        "id":1972676,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604751660,
        "modified":1604751660,
        "pretty_title":"Balto characters Weight Gain & Inflation"
    }
}