{
    "chapters":{
        "1":{
            "author_id":"coolzebra",
            "author_name":"Dreamsage",
            "choices":[
                "Possession",
                "Mind Control",
                "Growth/ Shrink",
                "Morph"
            ],
            "content":"<div class=\"\"><div> <span>You wake up to a strange feeling, but you think that it must have been something you ate last night. When you get out of the bed, you notice a little letter along with a little stone. Confused you grab the stone and it started to glow white until a while light blinded the room. After the light ceased to exist your eyes widen. \"What the hell was that?!\" You thought. Remembering the letter, you grab and began to read it.<br>\r\n<br>\r\n\"Dear Nick, The rock that came with the letter is  not an ordinary rock but a magical rock. Once its used, it will be absorbed by you. Now don't worry, it won't do anything bad. But thanks to the rock, You have the ability of.......\"</span></div></div>",
            "created":1533421680,
            "id":2529061,
            "title":"The Beggining of the fun"
        },
        "11":{
            "author_id":"afinger83",
            "author_name":"Angie Marie Buxman",
            "choices":[
                "Be spontanious. Pack your bags and get ready for an adventure.",
                "Tell her she's out of her mind.",
                "Ask who she is and what's going on.",
                "Run",
                "Pinch yourself. You must be dreaming."
            ],
            "content":"<div class=\"\"><div> <span>You start to deny this could be real and think it must be some trick and crumble the letter. \"Who is J.L. anyway? I bet one of my buddies messing with me\" you think to yourself. Suddenly you hear a loud noise in the garage. \"Those damn raccoons\" you say to yourself as you head toward the garage. You open the garage door and there's a tall woman with auburn hair, she's breathtakingly beautiful with some kind of green aura glowing around her. <br>\r\n<br>\r\nThe woman looks over at you \" Hello Nick, we don't have much time, you must come with me and take whatever you absolutely need because you will not be able to come back.\"</span></div></div>",
            "created":1533456960,
            "id":2529290,
            "title":"A stranger in the garage"
        },
        "114":{
            "author_id":"themixedgamer",
            "author_name":"TheMixedGamer",
            "choices":[
                "Your Mother",
                "Your Sister",
                "Your Pregnant Sister "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You turn around to sprint when the stranger shouts that you can posse people so you turn around to go posse</span></div></span></div>",
            "created":1603993500,
            "id":2931296,
            "title":"Run"
        },
        "1141":{
            "author_id":"themixedgamer",
            "author_name":"TheMixedGamer",
            "choices":[
                "Bad Timing She's About To Making Love To Your Dad",
                "Bad Timing She's Out With Friends",
                "Good Timing She's Watching A Movie"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You focus on your mother as you feel you be sucked into her body but it was</span></div></span></div>",
            "created":1603993740,
            "id":2931299,
            "title":"Your Mother"
        },
        "12":{
            "author_id":"coolzebra",
            "author_name":"Dreamsage",
            "choices":[
                "Your mother",
                "Your older sister",
                "Your younger sister"
            ],
            "content":"<div class=\"\"><div> <span>\"You have the ability to control the minds of other people that you want. Once they are controlled, they will have no recollection of what they did once you stop controlling them. Enjoy!\". Nick laughs and rips the letter into pieces. \"There is no way I can do that\"he said before stopping to think. He opens the door of his room and goes outside. \"Maybe I can test and see if it's true.......but who do I want to control?\" He thought</span></div></div>",
            "created":1533494520,
            "id":2529489,
            "title":"Mind Control"
        },
        "13":{
            "author_id":"coolzebra",
            "author_name":"Dreamsage",
            "choices":[
                "Shrinks to 1 inch",
                "grow 2 more feets",
                "His muscles grow",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>You have to change size from the size of a small ant to 6 feet tall. I know that you will have fun with this ability. Enjoy\"<br>\r\n<br>\r\nNick was curious when he finished. \"If I can do that, maybe I can get a girlfriend with this ability\"he thought. So he decides to test it out and gets out of the bed. He starts to feel the changes and notices that his body is changing size.......</span></div></div>",
            "created":1533512820,
            "id":2529561,
            "title":"Growth/ Shrink"
        },
        "131":{
            "author_id":"coolzebra",
            "author_name":"Dreamsage",
            "choices":[
                "Older sister's room",
                "Younger sister's room",
                "Living room"
            ],
            "content":"<div class=\"\"><div> <span>Nick started to realize that the room was getting bigger.....before realizing that he was shrinking, and quickly. He began to panic before calming down. \"Maybe I will stop soon\"He thought.  After a while, he stops to shrink. He thinks that he is about 1 inch tall. \"Maybe I can get some help\" He thought before running to the door. \"But wait.....Maybe I can follow my family without them noticing\"he said smirking. \"But I have to hide the rock though. I can't afford for anybody to find it\" He thought. After what seemed like hours to Nick, he hid the rock in his bottom drawer and went out of his room. He heard noise coming from the living room. But he wanted to check out one of his sister's room. He decided to go to........</span></div></div>",
            "created":1533588240,
            "id":2529945,
            "title":"Shrinks to 1 inch"
        },
        "14":{
            "author_id":"meduf",
            "author_name":"MeDuf 🤿",
            "choices":[
                "Something happens... what? ",
                "Nothing happens... why?"
            ],
            "content":"<div class=\"\"><div> <span>\"Like I said, don't worry morphing will be great fun. Flipping from wolf to eagle is a blast. The options are limitless. <br>\r\n<br>\r\n\"So, I bet you are wondering why you? Why not? I have been watching you and I think you will be a great asset to our organization. This stone is your test. We will be watching.\" <br>\r\n<br>\r\nNick laid back on the bed and stared at the ceiling. He squinted and shook his head. He held the letter before him, grabbed it with both hands and read it again. <br>\r\n<br>\r\nHe sat up, grabbed his phone and called Abby. <br>\r\n<br>\r\n\"Hey, I know you are at work, but some really weird shit is going on.\" Nick leaned over close to the rock and moved away, <br>\r\n<br>\r\n\"Nick, spill it. What weird shit,\" said Abby. \"Bobby! Stop or you're going in time out.\"<br>\r\n<br>\r\n\"Some rock and a letter about morphing.\"<br>\r\n<br>\r\n\"Nick, it is a scam email. Just delete it. I gotta go.\" <br>\r\n<br>\r\n\"No, no, Abby. It is a real letter on my nightstand.\"  Nick pointed at the rock as he spoke. <br>\r\n<br>\r\n\"Did you go out drinking with the Billy and Shawn last night? Bobby, Stop it. Now! Listen, I will call you on my way home.\" Abby disconnected the call. <br>\r\n<br>\r\nNick looked at the rock. <br>\r\n<br>\r\n\"What the hell.\" He grabbed the rock. </span></div></div>",
            "created":1533444000,
            "id":2529227,
            "title":"The Letter"
        },
        "141":{
            "author_id":"coolzebra",
            "author_name":"Dreamsage",
            "choices":[
                "A Cat",
                "Fox cub"
            ],
            "content":"<div class=\"\"><div> <span> All of a sudden Nick felt his whole body starting to change, he started to panic. \"What the hell is happening?!\"he said as he collapsed out of his bed and unto the floor, his body shaking and convulsing. He gave one more scream of pain before fainting. A few hours later, he wakes up and looks at his paws. \"Wait......PAWS?!\" he thought and goes to a mirror and sees a.......</span></div></div>",
            "created":1533444480,
            "id":2529229,
            "title":"You Morph into an Animal!"
        }
    },
    "info":{
        "author_id":"coolzebra",
        "author_name":"Dreamsage",
        "brief_description":"A 17 year old boy was given a magic stone that gives him powers(possession, etc.)",
        "created":1533406800,
        "description":"<td align=\"left\" class=\"norm\">Nick(you) gets a stone that gives him powers. Little does he know of the fun he is about to have.<br>\r\n<br>\r\nTypes of power that he has:<br>\r\n<br>\r\n<b>Possession: Has the ability to turn his body into a spirit and possess the body of another person.<br>\r\n<br>\r\nShrink/growth: Has the ability to change size<br>\r\n<br>\r\nMind control: Has the ability to control another person's mind.<br>\r\n<br>\r\nMorph: Has the ability to morph Into another person, an object or body part.</b><br>\r\n<br>\r\nYou can add chapters if you follow the rules:<br>\r\n<br>\r\n1- No gay or lesbian sex.<br>\r\n2- Sex is allowed<br>\r\n3- Nick cannot die in the story<br>\r\n4- Don't make fart chapters......thats gross<br>\r\n5- Use your imagination freely<br>\r\n6- Try and have good grammar.<br>\r\n</td>",
        "id":2165298,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603993740,
        "modified":1603993740,
        "pretty_title":"The Magic Stone (Pls add)"
    }
}