{
    "chapters":{
        "1":{
            "author_id":"tsuku91",
            "author_name":"tsuku91",
            "choices":[
                "Sasha",
                "Morgan",
                "Shayla",
                "Markeyta",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>Sasha: is from Russia and is 5 foot 5 with long brown. she weight 130 with c cup chest and a tone belly. she likes to party and drink. she is 21<br>\r\n<br>\r\nMorgan: is from India and is 5 foot 6 with long black hair. she has a tattoo around her belly button. she weights 155 with DD cup chest and a chubby belly. she likes to watch tv, party/drink and be lazy. she is 21<br>\r\n<br>\r\nShayla: is a American Indian and is 5 foot 2 with shoulder length dirty blond hair. she weight 120 with a B cups chest and a small belly. she like to drink and eat. she also generally very lazy. she is 18<br>\r\n<br>\r\nMarkeyta: is from England and is 5 foot 4 with very long light brown hair. she weight 130 with C cup chest and a slightly chubby belly. she likes to read and be lazy while eating. she is 19</span></div></div>",
            "created":1346151420,
            "id":1415449,
            "title":"The Girls"
        },
        "12":{
            "author_id":"tsuku91",
            "author_name":"tsuku91",
            "choices":[
                "natural",
                "Magical",
                "Force",
                "Pregnancy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how will she gain weight?</span></div></span></div>",
            "created":1346151480,
            "id":1415451,
            "title":"Morgan"
        },
        "122":{
            "author_id":"tsuku91",
            "author_name":"tsuku91",
            "choices":[
                "11 years later",
                "???"
            ],
            "content":"<div class=\"\"><div> <span>back when morgan was 11 and lived with both of her parent. what she did not know was that they were both cultist practicing spells and magic. one day they found a spell that said for the person this spell is place upon. they would be protected and know no life without love. when they read this they started to get prepared to do it on morgan. they really wanted her to find love and already at the age of 11 she was very much a partyer. that night they chained morgan to the table and started the spell. morgan waking up started to fight the chains, but a 4 foot 7, 70 pound girl could not do much. quickly they finished the spell..... and nothing happened. shuddenly her father started  to deslove into a black mist that race to morgan. forcing itself in her mouth. when it was all over a dark mark showed on her exposed belly ( look at this pic <a rel=\"nofollow\" href=\"http://cdn.walyou.com/wp-content/uploads//2012/01/Star-Belly-Button-Tattoo.jpg.html\" target=\"_blank\">http://cdn.walyou.com/wp-content/uploads...</a> ) the tattoo was showed that the spell on now on her. morgan not know she would now become lazier, have a greater hunger for food, and if gained weight she would not be able to lose it again plus if she dates the wrong man over the first month she would gain 30 more pounds.</span></div></div>",
            "created":1346152620,
            "id":1415471,
            "title":"Magical"
        },
        "1221":{
            "author_id":"tsuku91",
            "author_name":"tsuku91",
            "choices":[
                "to the bar",
                "next day",
                "???"
            ],
            "content":"<div class=\"\"><div> <span>the once small 4 foot 8, 70 pound girl was no more. now she was a beautiful adult at 5 foot 6 and 155 pounds. waking up hungry was not uncommon for her what she had not relished was if it was not for her to previous boyfriends she would be 90 pounds and thin. the added weight made her belly chubby and jiggly, hips wide and her thighs round; but she did not care much. getting up and and walking over to the full body mirror she saw herself. she was just wearing her under, which were getting to be on the tight side for her. her face was now softer and rounder, going down to her ample DD chest and her belly with the tattoo on it. the tattoo look like it was still brand new, except there was no redness. it had also stretched perfectly over her belly looking she had gotten only days ago. turning to the side she saw her chubby belly sticking out. sucking it in you could still tell she had some chub. god i with i could be thin. flashed though her mind. only for a moment though.<br>\r\nreaching down to the floor she grab some shorts, putting them on gave her a muffin top and were tight around her thighs. then finding a old shirt from when she was 11, putting it on was hard, she had to smash her chest against herself and quickly pull it down. the shirt only covered half way from her chest to her belly button, showing her chubby belly and tattoo off nicely.walking out of her room and into the kitchen she found two breafest burrito and took them to her room to eat and watch tv.<br>\r\nshe continued to eat like this though the whole day, never really leaving bed. until her friend called that night and told to get dress because they were going to the bar. getting up she striped off the shorts and shirt and put on a tight black dress. she liked this dress, it was tight in the middle but it made her look thinner and showed off her great rack.</span></div></div>",
            "created":1346166180,
            "id":1415532,
            "title":"11 years later"
        },
        "15":{
            "author_id":"catalina056",
            "author_name":"sammi056",
            "choices":[
                "Dustin and Kat, I want them stat!!!!",
                "naw, naw.  not my type"
            ],
            "content":"<div class=\"\"><div> <span>Dustin and Kat: Dustin is 13 years old, has sandy brown hair and hazel eyes. He has light freckles and dimples when he smiles. He has a slight muffin top and a squishy, round jelly belly. Dustin random, funny, and has a BIG appetite. And, he'll eat anything. Anything fried or unhealthy, that is.<br>\r\n<br>\r\nKat is a girl that just moved to Maryland from Alabama. Back there, her family fried everything. She is also 13 years old, has emerald green eyes and the brightest red hair you'd ever see. She has a slight gap between her teeth and a prominent southern accent. She's pudgy just like Dustin and a secret ingredient in all the greasy, gluttonous food she prepares for her \"muffin top\",Dustin...<br>\r\n<br>\r\n</span></div></div>",
            "created":1358049060,
            "id":1507441,
            "title":"This puppy love pair is eager to be fed..."
        },
        "151":{
            "author_id":"catalina056",
            "author_name":"sammi056",
            "choices":[
                "Kat is going around handing out cookies. Sammi and Dustin are still dating.",
                "Dustin gets put out of Sammi's house and meets Kat there.",
                "Sammi introduces Dustin to Kat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>choose when and where we start in the story. Simple as that!</span></div></span></div>",
            "created":1359501660,
            "id":1519783,
            "title":"Where do we start???"
        },
        "1512":{
            "author_id":"catalina056",
            "author_name":"sammi056",
            "choices":[
                "you bet your pants I do!",
                "Ummmm not really"
            ],
            "content":"<div class=\"\"><div> <span>Sammi was furious with Dustin. <br>\r\n<br>\r\n\"You <b>ATE</b> all the <b>SNACKS</b> aGAIN?!?!?!?!?\", she yelled, with her pals Lulu and Ollie by her side.<br>\r\n\"that's it. I am done. go... burn off your food, you maniac.\" She pointed towards the door, and dustin trudged out. He was walking alone when he bumped into a girl that was 51 inches tall and 106 pounds.Dustin was 51 inches and 96 pounds.<br>\r\nSorry i bumped into you, he said. \"im dustin, by the way\"<br>\r\n\"It's alllllll good\", she drawled in a prominent southen accent. \"my name i Katalina, but you can call me kat.\"<br>\r\n\"cool. Youre hair is red just like Kat's on Victorious!\"<br>\r\n\"Yep and we have the same name. hey, do you like food?\"<br>\r\nDustin said....</span></div></div>",
            "created":1359503820,
            "id":1519806,
            "title":"Dustin gets put out of Sammi's house and me..."
        },
        "15121":{
            "author_id":"catalina056",
            "author_name":"sammi056",
            "choices":[
                "a lot of food he a growing  boy!",
                "a little bit"
            ],
            "content":"<div class=\"\"><div> <span>\"i love t food And I love to eat!!\" he blurted out. \"That's great!\", Kat gushed. \"Wanna  go back to my house and hang out?\"<br>\r\nSure says  Dustin. They walk in and Dustin was amazed to see all the food! He glanced over at the food, then back at Kat. Can we eat this sturf?<br>\r\n<br>\r\nDuhhh  <br>\r\nsilly she said andbit into a piece  of fried chicken. Juice dribbled down her chin , and she scarfed it down thevery quickly. Dustin ended up eating......</span></div></div>",
            "created":1362814740,
            "id":1546642,
            "title":"you bet your pants I do!"
        },
        "152":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "Nicole",
                "Becky",
                "free"
            ],
            "content":"<div class=\"\"><div> <span>Nicole is a 13 year old girl with long blonde hair typically fashioned in a pony tail. She is slim weighing 90 pounds with a height of 5ft 2. She is the daughter of health nuts who always encouraged her to exercise and eat healthy. With daily participation in exercises with her fitness instructor mother, Nicole was the culmination of teenage girl health. However all this is about to change...<br>\r\n<br>\r\nBecky is a 14 year old girl with silky brown hair. She fiercely hates sports but people always pressured her into joining teams. Now Becky has devised a plan to stop the harassment, she would get so fat no one would think of asking her to play. </span></div></div>",
            "created":1482937440,
            "id":2255420,
            "title":"naw, naw.  not my type"
        },
        "1521":{
            "author_id":"islandhope",
            "author_name":"crushstar",
            "choices":[
                "lost her parents in a car accident",
                "her metabolism changed",
                "free"
            ],
            "content":"<div class=\"\"><div> <span>Nicole was born into a health obsessed family, eating food deemed acceptable by her parents' scrutinizing eyes. While her friends could eat junk food, Nicole was forced to consume veggies and fruits. Nicole's parents regularly dragged Nicole along for jogs or exercise sessions. Nicole's mother was particularly demanding of her daughter, insisting that she be the health ideal of females, even going as far as taking routine measurements and inspecting Nicole for flab by feeling her body. And to her mother's delight Nicole lived up to her expectations, attaining the ideal figure. <br>\r\n<br>\r\nHowever one day Nicole...    </span></div></div>",
            "created":1482938220,
            "id":2255425,
            "title":"Nicole"
        }
    },
    "info":{
        "author_id":"tsuku91",
        "author_name":"tsuku91",
        "brief_description":"girls that gain weight and keep gainging",
        "created":1346150460,
        "description":"<td align=\"left\" class=\"norm\">girls for some reason or another gain weight and like it and keep going.<br>\r\n<br>\r\nAll right here are the rules:<br>\r\nadds that are at least a paragraph, no one sentence stuff<br>\r\nNot allowed:<br>\r\nMagic<br>\r\nRay-Guns<br>\r\nSex<br>\r\nVore<br>\r\nMajor weight gain (1,000 pounds in one meal type of thing)<br>\r\n<br>\r\nAllowed:<br>\r\nLesbian<br>\r\nFeeding, Force-feeding</td>",
        "id":1887775,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1482938220,
        "modified":1482938220,
        "pretty_title":"girls weight gain"
    }
}