{
    "chapters":{
        "1":{
            "author_id":"trainer134",
            "author_name":"tajero",
            "choices":[
                "My little pony comes to earth",
                "Earth comes to My little pony",
                "My little pony comes to some place else",
                "Some place else comes to My little pony",
                "You decide"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First things first <br>\r\nOptions. (please don't make them overly excessive. other stories will have other options)<br>\r\n<br>\r\nWhere is the story going to go?</span></div></span></div>",
            "created":1339990020,
            "id":1361870,
            "title":"Choices"
        },
        "11":{
            "author_id":"nosaneity",
            "author_name":"Queen Chrysalis",
            "choices":[
                "Twilight Teleport",
                "Twilight"
            ],
            "content":"<div class=\"\"><div> <span>Twilight Sparkle Use Very Long Term Teleport Spell <br>\r\n<br>\r\nor Twilight somehow build space machine that go ACROSS THE UNIVERSE <br>\r\n<br>\r\n<br>\r\nor Futtershy have Strange anmails that you teleport you any where<br>\r\n<br>\r\nor Pinkie pie ate so much sugur that she Broke though the 4th wall Entitely </span></div></div>",
            "created":1367088480,
            "id":1579556,
            "title":"My little pony comes earth but how "
        },
        "111":{
            "author_id":"trainer134",
            "author_name":"tajero",
            "choices":[
                "Twilight planned this",
                "A portal was found",
                "You decide"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Continue<br>\r\nTwilight and her machine<br>\r\nTwilight makes a machine and decides to test it.<br>\r\nIt was an accident or discovery<br>\r\n<br>\r\nWhich one?<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1367116200,
            "id":1579832,
            "title":"Twilight Teleport"
        },
        "1111":{
            "author_id":"hurttoto",
            "author_name":"^HURTTOTO^",
            "choices":[
                "Invasion failure",
                "Invasion failure and no more ponys",
                "Invasion success (kinda)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"yes yes NOW FOR THE INVASION AND DEATH Celestia promised that was the best way to bring peace to all.</span></div></span></div>",
            "created":1491198180,
            "id":2298935,
            "title":"Twilight planned this"
        },
        "112":{
            "author_id":"trainer134",
            "author_name":"tajero",
            "choices":[
                "In Equestria there was a portal",
                "A new discovery was made on earth",
                "You decide"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Continue<br>\r\nOther options<br>\r\nStart in their world: Something happens to make them come to earth.<br>\r\nStart in our world: Something happens and they just appeared on earth.</span></div></span></div>",
            "created":1367116020,
            "id":1579828,
            "title":"Twilight"
        },
        "12":{
            "author_id":"venhur96",
            "author_name":"VenHur",
            "choices":[
                "Archaeologists uncovered a dimensional mirror.",
                "Something unbelievable happened during a BronyCon panel.",
                "Humans somehow evolved from equines rather than primates.",
                "Someone found one of the ponies in an alleyway.",
                "Other scenarios."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First off, how does the human population knows about the magical land of Equestria?</span></div></span></div>",
            "created":1376771760,
            "id":1647511,
            "title":"Equestria Girls...In Reverse!"
        },
        "121":{
            "author_id":"trainer134",
            "author_name":"tajero",
            "choices":[
                "Continue",
                "A pony is sighted",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Continue<br>\r\nEarth's new discovery.<br>\r\n It was a typical day on earth. Humans everywhere were doing there own thing. There were bronies, anti-bronies, regular people and people of all sorts going around on the planet known as Earth. However now something strange was about to happen.<br>\r\n What started as a secret became a ground breaking experience, there was a new world being discovered. The news recently reported how archaeologists discovered a portal or warp hole that took them to an alternate universe.<br>\r\n There were always speculations of such, but now it was real. As we dig deeper, past the debates and arguments, we meet a guy named Randy. Randy was your typical \"brony\" if you will, but he lived by the location where the portal was found. <br>\r\n <br>\r\nWhat happens next? </span></div></div>",
            "created":1376797020,
            "id":1647650,
            "title":"Archaeologists uncovered a dimensional mirror."
        },
        "1211":{
            "author_id":"venhur96",
            "author_name":"VenHur",
            "choices":[
                "Randy and his friends made it to a crowd of people for the President's ovation.",
                "He gets stopped by a group of anti-Brony thugs.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Randy, just the typical average unpopular nerd who didn't the girl, had a few friends, and plays video games all the time. You know, typical hobbies.<br>\r\nAll that changes years ago, the Brony community skyrockets into a worldwide sensation, Randy would become a Brony himself and get to know even more people he never knew until now. Now there's speculations about an alternate universe, right down a few blocks even.<br>\r\nCurious and possibly a little excited, he heads out to the portal's location. Little did he know, was that it was only the start of a grand adventure.<br>\r\n<br>\r\nWhat happens now?</span></div></div>",
            "created":1377053520,
            "id":1649151,
            "title":"Meet Randy"
        },
        "12112":{
            "author_id":"trainer134",
            "author_name":"tajero",
            "choices":[
                "Continue",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Continue<br>\r\nRandy and the antis<br>\r\n Randy was just walking down the street like usual. He had a \"20% cooler\" shirt on featuring one of his favorite ponies, Rainbow dash. He also had some black matching jeans on and was carrying a small defense weapon.<br>\r\n Crimes on the street were common where he lived. Only an idiot would walk alone on the street without some kind of protection. Randy was not one though, he knew how to get around and most guys respected him.<br>\r\n Today was different though. He managed to get lost and was found by a group of five anti bronies. <br>\r\n<br>\r\nWhat happens next?  </span></div></div>",
            "created":1377057180,
            "id":1649168,
            "title":"He gets stopped by a group of anti-Brony thugs."
        },
        "121121":{
            "author_id":"trainer134",
            "author_name":"tajero",
            "choices":[
                "Continue",
                "Tim tells Randy about the news"
            ],
            "content":"<div class=\"\"><div> <span>Continue<br>\r\nRandy and the antis<br>\r\n Randy knew that it wasn't a good idea to be out in his neighborhood alone. He knew that it was an even dumber idea to be out unarmed. Regardless he caught himself in the worst situation possible. Alone and unarmed he knew that if anyone found him, it would be over.However he wasn't the type to scare easily.<br>\r\n However his current situation was what mattered now. He managed to find trouble. There were five anti bronies. One was looked like a stereo typical anti, he was strong and had an anti-brony brother hood shirt. His name was Tim. On top of that he spoke down to Randy as he threw him on the ground.<br>\r\n He said,\"Well well well,what do we have here?\"<br>\r\n Randy looked at him. He had four other friends. Dressed just like Tim, but he wasn't worried about them. The reason being was that Randy was trained in martial arts and beat them up in a fight. Tim wasn't there but he knew that they told him about it. He knew that there wasn't going to be an easy escape.<br>\r\n Randy responded, \"You know me.\" He stood up and looked Tim straight in the eye.<br>\r\n Tim saw Randy's 20% cooler shirt and was infuriated but he knew who he was up against. He normally would have just straight up attacked a guy but held back against Randy because of what his friends told him. He responded, \"Well let's be quick then.\"<br>\r\nRandy responded, \"Well what do you want?\"<br>\r\n<br>\r\nWhat happens next?  <br>\r\n</span></div></div>",
            "created":1400105880,
            "id":1796429,
            "title":"Continue"
        },
        "15":{
            "author_id":"hurttoto",
            "author_name":"^HURTTOTO^",
            "choices":[
                "they take over",
                "they die",
                "they dump the plan",
                "another world",
                "SomeRandomShit"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Twilight: We must turn all the humans into ponys;!!!!!</span></div></span></div>",
            "created":1480915020,
            "id":2245954,
            "title":"You decide"
        },
        "155":{
            "author_id":"hurttoto",
            "author_name":"^HURTTOTO^",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hi I'm biiillllllllllllllllllllllllllllllllll llllllllllllaaassaaaaaaaaaggggggggggggggggggggggggg...........<br>\r\n<br>\r\n<br>\r\n.<br>\r\n.<br>\r\n. ERROR message 666 \"your dead!?%##&amp;&amp;%(('vgb</span></div></span></div>",
            "created":1480915140,
            "id":2245955,
            "title":"SomeRandomShit"
        }
    },
    "info":{
        "author_id":"trainer134",
        "author_name":"tajero",
        "brief_description":"This has been done before but this is a different take upon the idea. ",
        "created":1339907460,
        "description":"<td align=\"left\" class=\"norm\">Well the idea has been done before but not in great detail. This isn't supposed to be about \"you\" meeting a pony but a story about how humans and talking ponies may react with each other. <br>\r\nHere are the rules.<br>\r\n<br>\r\n1.)No death. (violence is allowed but keep it moderate)<br>\r\n2.) No sex. <br>\r\n3.) No cursing/sexual imagery/references (talk) or offensive jokes.<br>\r\n4.) Fan characters are welcome but don't let them be the main focus of the story.<br>\r\n5.) Crossovers are welcome. (other worlds are allowed)<br>\r\n6.) Have fun<br>\r\n<br>\r\nIf any rules are broken the whole story will be deleted so please don't ruin the story for everyone. I will try to be as lenient as possible. As far as that goes there is nothing else to say so have at it.   </td>",
        "id":1874161,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1491198180,
        "modified":1491198180,
        "pretty_title":"My little pony in the real world"
    }
}