{
    "chapters":{
        "1":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "Prue",
                "Piper",
                "Phoebe",
                "Paige"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First off, choose which one of the Halliwell sisters you want to tickle...</span></div></span></div>",
            "created":1294030800,
            "id":1028355,
            "title":"The Charmed Ones"
        },
        "11":{
            "choices":[
                "Piper",
                "Phoebe",
                "Paige"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Chose which sister this lovly lady will be tickled by</span></div></span></div>",
            "created":1295902020,
            "id":1041265,
            "title":"Prue"
        },
        "111":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "Sit down next to Piper",
                "Sneak forward and squeeze Piper's sides",
                "Continue upstairs"
            ],
            "content":"<div class=\"\"><div> <span>It was past 9 o'clock at night when Prue arrived back home from her date. The evening had been wonderful, first she'd gone to his place and then they had both set out to the restaurant. The food and the service was excellent, romantic music had been playing and after the dessert Prue's date had taken a black box out of his jacket pocket and presented her with a beautiful and seemingly very expensive necklace. The two had shared a brief but passionate kiss before he dropped Prue off back at her place and now here she was. <br>\r\n<br>\r\nStill sporting her evening wear, which consisted of a black sparkling dress, a short jacket which she'd worn while outside, high-heeled black shoes and of course the necklace itself, Prue shut the Halliwells' front door behind her after having kissed goodnight and walked in from the starry night. She was still smiling in sheer delight at how perfectly the evening had played out. Still excited as if there was more to come, even though she knew there wasn't, Prue decided she'd take off her jacket upstairs when she took up the rest of her things. She proceeded towards the staircase.<br>\r\n<br>\r\nThe TV was on in the living room. As Prue began to pass behind the sofa, she saw Piper sat still, gazing bordly at the evening news. Judging by her lowered eyelids and the fact that she didn't seem to have noticed Prue come in, she was half asleep. Prue's younger sibling, the second oldest of the family, was wearing a dark red buttoned shirt, black trousers and her bare feet were propped up on one of the sofa's arms. Her ticklish toes wiggled absent-mindedly as she continued to struggle keeping herself awake.<br>\r\n<br>\r\nWhat does Prue do next?</span></div></div>",
            "created":1299187020,
            "id":1064157,
            "title":"Piper"
        },
        "1112":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "\"Do your worst\"",
                "Prue cracks under the pressure"
            ],
            "content":"<div class=\"\"><div> <span>Prue suddenly had a very appealing idea. Creeping slowly towards the sofa, being very careful not to let Piper catch sight of her out of the corner of her eye and trying not to make too much noise with her high heels, the eldest of the attractive witches raised her arms and began to make mischievous spidering motions with her fingers. <br>\r\n<br>\r\nCloser and closer Prue made her way to the back of the sofa until she was right behind, close enough to lean over the top and touch Piper. As she always would in this situation, Prue began to hesitate slightly, knowing the consequences that might follow if she teased her sister. But of course the urge was too great and Prue knew very well that she loved being tickled herself, almost as much as she loved to tickle others. <br>\r\n<br>\r\nDecisively, Prue plunged forward and stuck her fingers into Piper's tender sides.<br>\r\n<br>\r\n\"Tickle, tickle, tickle\" she squeeked happily, coinciding with the moment her fingers made contact with her sister's ticklish body.<br>\r\n<br>\r\n\"YYEEEEEEEEEEEK\" squealed Piper, bucking upwards as if she'd recieved an intense electric shock.<br>\r\n<br>\r\nFor a few seconds they stayed that way, Prue clamping down and tickling her sister, tormenting Piper who wriggled around on the sofa and yet couldn't muster the composure to defend herself against Prue's attack.<br>\r\n<br>\r\nEventually, Prue withdrew her hands and plopped herself down next to Piper. \"How's it going?\"<br>\r\n<br>\r\n\"Hey, honey, how was your date\" asked Piper, grinning curiously.<br>\r\n<br>\r\n\"It was <i>fantastic</i>\" said Prue quietly, putting extra emphasis on the final word. \"I wish I could express it but you'd have had to be there to know what a great guy he is. One of the best nights of my life!\"<br>\r\n<br>\r\n\"Well great, Prue\" said Piper, cheered up instantly to see what a wonderful evening Prue had spent. \"Tell me all about it, I want to know every detail\"<br>\r\n<br>\r\nWith that, Prue began to recount the events of the evening. When she got to the gift and showed Piper the necklace he had given her, Piper gasped out loud, instantly struck with loving envy and jealousy.<br>\r\n<br>\r\n\"You are sooo lucky, you know that? Why is it you always get the best guys and the best presents to take home? That thing must have cost over 2000 dollars!\"<br>\r\n<br>\r\n\"I dunno, just good-looking I guess\" said Prue cheekily.<br>\r\n<br>\r\n\"Ohh you\" said Piper pretending to be shocked and slapping Prue lightly on the leg. \"So tell me sis, when do you think you'll see him again? Did he kiss you by the way?\"<br>\r\n<br>\r\nAs she asked these questions, Piper reached down and grapped both of Prue's ankles, pulling them up and placing them across her knees so that Prue was now sitting across the sofa, with her head on one end and her feet now right under Piper's sadistic gaze.<br>\r\n<br>\r\n\"Well uuuummmmmm\" said Prue, knowing what was about to happen and unwilling to answer Piper's last question, partly out of embarrassement and partly because she wanted to give her sister all the more reason to tease the response out of her.<br>\r\n<br>\r\n\"Don't want to tell huh?\" inquired Piper, taking off both of Prue's shoes, exposing her own deathly ticklish bare feet. \"You know you want to, it's in your best interests, believe me and I have ways of making you talk\".<br>\r\n<br>\r\nPrue bit her lip in anticipation.<br>\r\n<br>\r\n\"Last chance sis\" warned Piper, wiggling her fingers menacingly closer to Prue's feet.</span></div></div>",
            "created":1299190860,
            "id":1064212,
            "title":"Sneak forward and squeeze Piper's sides"
        },
        "11121":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "Piper starts on Prue's belly",
                "Phoebe came down, woken up by all the noise"
            ],
            "content":"<div class=\"\"><div> <span>\"Oohhh, you'll regret saying those words, missy\" Piper purred with unmistakable satisfaction. It was obvious she had hoped for nothing less.<br>\r\n<br>\r\nPrue could hardly restrain herself any longer, already her feet were beginning to twitch with extreme anticipation. Her face was etched into a frightened grin despite her attempts to stay cool, which it had to be said was asking a considerable amount in her predicament.<br>\r\n<br>\r\n\"Don't worry, one way or another I'll know by the end of the night\" concluded Piper as her fingers finally dug into one of Prue's silky soles.<br>\r\n<br>\r\nSure enough, Prue bucked up and down on her end of the sofa and her arms began to flail wildly in the air, it was all she could do to resist the temptation of sending her hands to the aid of her helpless bare feet. Piper used one of her own hands to grip Prue's ankle while the other one scratched and scribbled its way all across the sole. <br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAOHHMYGOHHOHODHEHEHAHAHAHAHAHAHAHAHA\"<br>\r\n<br>\r\nNot bothering to hold back, Prue erupted into hysterics. Her free foot wriggled frantically, trying to pry away Piper's hands and cover up the other one but having little success. She could only scrunch her toes as Piper's hold remained firm.<br>\r\n<br>\r\n\"AHAHAHAHAHAHAHAHAHAPIPERPLEEHEEHEEHEESESTAHAHAHAPHAHAHAHAHAHAHAHAHA\" ;<br>\r\n<br>\r\n\"Coochie coochie coo, is big sista Prue ticklish, does that tickle huh, huh? Does that tickle?\" Piper squeaked deliberately to play with her older sister's nerves. She knew that it made it all the more difficult for Prue to collect herself if she treated her like a baby in her helpless state.<br>\r\n<br>\r\n\"YEHHHEHEHEHEHESSHEHEHEHAHAHAHAHAHAHAHAHA\"<br>\r\n<br>\r\nAs Prue kicked her other foot, Piper decided that it was time to change. Too quickly for Prue to react, Piper grabbed the other ankle and began to make slow, shadow-tickling motions inches from the equally sensitive and adorable sole.<br>\r\n<br>\r\n\"This little piggy went to the market\" whispered Piper, holding one of Prue's toes after the other, \"this little piggy stayed home, this little piggy had roast beef and this little piggy had none and this little piggy went weeweewee all the way home\"<br>\r\n<br>\r\nAt the final verse, her hand skittered in identical fashion as it had over the previous foot. Prue began to beat her fists on any part of the sofa within reach. She had no idea how much more she could take.<br>\r\n<br>\r\n\"Had enough?\" asked Piper, finally pausing, \"Ready to tell me what I want to know?\"<br>\r\n<br>\r\n\"Done already?\" sneered back Prue, \"Is that really the best you've got?\"<br>\r\n<br>\r\nPiper let out a sigh of resignation.<br>\r\n<br>\r\n\"All right, if that's the way you want it! Get ready to die now sis\"<br>\r\n<br>\r\n...</span></div></div>",
            "created":1300237260,
            "id":1070942,
            "title":"\"Do your worst\""
        },
        "12":{
            "choices":[
                "Prue",
                "Phoebe",
                "Paige"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who gets to tickle this lovely lady</span></div></span></div>",
            "created":1297377360,
            "id":1051453,
            "title":"Piper"
        },
        "123":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>It was noon and Paige was sat on her bed reading a book. Life in the Halliwell house had become exceedingly boring within the last few months. Paige had often found herself wondering whether the sisters had possibly vanquished every demon in existence for things to have grown so peaceful. She kept reminding herself that this was surely not the case, that there still remained at least a couple of demons out there in the world. However, she had little doubt that the sisters had at least defeated the most powerful among them and therefore amassed such a fearsome reputation in the underworld that no surviving demon dared disturb them any more. <br>\r\n<br>\r\nPaige used to wish that evil would stop harrassing them but now that it had she realized that fighting demons had been the key source of animation in her life. Without it she had difficulty finding any way to stimulate her senses. No matter what she did throughout the day, she could not escape the crushing sense of boredom. Now that Paige came to think about it, there was nothing that could beat a regular attempt on your life, sometimes daily, in terms of passion and excitement. She hadn't been able to appreciate it while it was there and now she was stuck in a tight spot. What could Paige and her sisters possibly do to bring a sense of meaning back into their lives?<br>\r\n<br>\r\nAs if to answer her question, the door of Paige's room opened and Piper strolled in. She looked more cheerful than she had in weeks, for Paige was convinced that the absence of action and excitement had affected her sisters just as much as it had her, if not more so. After all, they had been doing this much longer than she had.<br>\r\n<br>\r\n\"Hey Paige, I was wondering if you'd do me a favour. I need you to get me some ingredients for a potion I'm making\".<br>\r\n<br>\r\n\"A potion? What for?\" asked Paige, perplexed. It had been a while since the Halliwells had needed to do anything of the sort.<br>\r\n<br>\r\n\"You'll find out when you get me the ingredients\" said Piper and for some reason a sly smile had crept over her features. \"I'd ask Leo to do it but he's away doing Elder stuff and anyway, I'd rather <i>you</i> do this than Leo...\"<br>\r\n<br>\r\n\"Uh, okay. What do you need?\"<br>\r\n<br>\r\n\"A bottle of lotion, five feathers, chloroform, a human fingernail (don't ask me how you get that) and a feather duster. I can handle the rest myself.\"<br>\r\n<br>\r\nPaige was more mystified than ever. She'd never had to find such a bizarre set of ingredients before. What could Piper possibly have in mind? Nevertheless, she thought it best not to ask too many questions for now, her sister evidently had some sort of surprise in mind.<br>\r\n<br>\r\n\"Okay, fine. I'll be back soon.\"<br>\r\n<br>\r\n\"Don't take too long\" sang Piper in what was definitely a more excited and cheerful tone than usual. With that, Paige orbed away.<br>\r\n<br>\r\nShe returned about an hour later, having successfully found every ingredient on Piper's list. The fingernail had confused her at first but eventually she had decided to clip one of her own. After all, Piper hadn't said whose fingernail it had to be.<br>\r\n<br>\r\nAs she orbed into the kitchen Piper was busy standing over a boiling pot, giving it a slight stir.<br>\r\n<br>\r\n\"Great, now we're almost set\" Piper exclaimed happily as Paige appeared. Paige couldn't help noticing that her older sister had removed her shoes since earlier, her feet were now bare. It looked as if Piper had applied a fresh coat of bright red nail-polish in the time she'd been away. She had very pretty feet, well taken care of and as smooth as a baby's, you had to admit.<br>\r\n<br>\r\nOne by one, Piper dropped the ingredients into the pot while continuing her stirring. She retained one of the feathers and the feather duster but the rest was added to the potion, which began to glow purple. As Paige wondered what it was for, she suddenly noticed coils of rope and several rolls of duct tape lying on the table. This was getting stranger by the minute.<br>\r\n<br>\r\nPiper took a glass from the cupboard and filled it with the purple potion. The mixture swirled mysteriously.<br>\r\n<br>\r\n\"I'll go first\" she said and gulped it down before Paige had a chance to respond. The second Piper had finished the glass's contents, she put it down, clutched her stomach and gave way to an excited shiver and a giggle.<br>\r\n<br>\r\n\"What the hell is that stuff?\" enquired Paige.<br>\r\n<br>\r\nPiper turned to her, her grin now more excited than ever but instead of answering her question, she uttered two words: \"Tickle me\".</span></div></div>",
            "created":1331236740,
            "id":1291091,
            "title":"Paige"
        },
        "1231":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "Use the feather on Piper's belly",
                "Tie Piper to a chair",
                "Tie Piper to the bed and tickle her feet"
            ],
            "content":"<div class=\"\"><div> <span>\"What?\" said Paige, stunned.<br>\r\n<br>\r\n\"I said tickle me.\" repeated Piper. \"Tickle me now, anywhere.\"<br>\r\n<br>\r\n\"But I can't!\" stammered Paige. \"You know as well as I do that you're not ticklish, you've never been ticklish!\"<br>\r\n<br>\r\n\"Don't worry about that.\" A note of impatience was now beginning to creep into Piper's voice, although her smile was now bordering on insane. \"Do it or I'll tickle you.\" She raised her hands and wiggled her fingers menacingly to emphasize her threat. Unlike her older sister, Paige was extremely ticklish and even though she enjoyed being tickled, the thought of her sisters torturing her to no end often scared her, therefore she so no reason to argue any further.<br>\r\n<br>\r\nHesitantly, Paige reached for Piper's belly and gave it a quick, testing pinch. Her reaction was beyond what Paige would have thought possible from Piper of all people. The second Paige's fingers made contact with her, Piper flinched, trying to cover her belly with both hands while simultaneously bursting into a fit of giggles.<br>\r\n<br>\r\n\"What the...!\" exclaimed Paige. Without thinking, she reached forward again, this time giving Piper a soft poke rather than a pinch. The process repeated itself, this time Piper took a step back as she giggled and tried to protect her newly sensitive tummy.<br>\r\n<br>\r\n\"Was that a- a tickle potion?\" asked Paige, hardly daring to believe it.<br>\r\n<br>\r\n\"Of course...it was.\" Piper panted. \"It heightens the sensitivity of the entire body, making anyone more ticklish than they were before. And the chloroform serves to neutralise one's powers, so that person can't even defend themselves.\"<br>\r\n<br>\r\n\"Cool!\" whispered Paige as she lifted up the bottom of Piper's shirt and flicked a finger across the latter's bare bellybutton. Piper shrieked.<br>\r\n<br>\r\n\"Haha- I thought it wouldn't be fair if only one of us was ticklish, so I decided to even the odds... not that you can't have some potion too.\"<br>\r\n<br>\r\n\"What a great idea!\" admitted Paige. \"How long does it last?\"<br>\r\n<br>\r\n\"About an hour every glass you take but I made plenty of it, I figured seeing as we don't have much to do nowadays that it'd be fun... and I always wondered what it's like to be tickled.\"<br>\r\n<br>\r\n\"Allow me to show you.\" said Paige...</span></div></div>",
            "created":1331239080,
            "id":1291102,
            "title":"Continue"
        },
        "13":{
            "choices":[
                "Prue",
                "Piper",
                "Paige"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these lovely ticklers</span></div></span></div>",
            "created":1297377420,
            "id":1051454,
            "title":"Phoebe"
        },
        "14":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "Prue",
                "Piper",
                "Phoebe"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which lucky sister gets the chance to tickle torture Paige today?</span></div></span></div>",
            "created":1294030800,
            "id":1028357,
            "title":"Paige"
        },
        "143":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "Sneak  up from behind and tickle Paige",
                "Invite Paige to get tickled"
            ],
            "content":"<div class=\"\"><div> <span>It was a bright Saturday morning and the Charmed Ones could hardly have been more bored. They had always thought they would love the chance to enjoy a demon-free atmosphere for a change, without a new enemy blasting into their house on a daily basis but now that that chance had come things had gone strangely dull in the Halliwell house. There just wasn't anything to do around there any more. That was, at least, until that fateful summer day.<br>\r\n<br>\r\nPhoebe was sat at the kitchen table that morning aimlessly flicking through a book of spell accessories when Paige walked in. She hadn't gotten out of her night clothes yet and was still wearing the short gray t-shirt she slept in which gave a clear view of her bellybutton. She was also wearing shorts and was barefoot, her red toenail polish gleaming in the morning sun.<br>\r\n<br>\r\n\"Morning Pheebs\" she said as she walked past and started making tea.<br>\r\n<br>\r\nThe two sisters chatted cheerfully as they both finished their breakfast. Afterwards Paige sat up straight and gazed groggily at Phoebe.<br>\r\n<br>\r\n\"What's happening today\" she asked.<br>\r\n<br>\r\n\"Well Piper's at work and Leo had to pay a visit to the Elders\" muttered Phoebe. \"As if we had enough to do around here\"<br>\r\n<br>\r\n\"I know, some days I almost wish a demon would burst through that door and attack us\" said Paige regretfully. \"Oh well, I guess we're just gonna have to think of something to do with our day\"<br>\r\n<br>\r\nAs Paige said this she got up and walked over to the window. \"I wonder\"<br>\r\n<br>\r\nBut Phoebe had hardly heard. She had just caught sight of Paige's cute feet and navel. She looked across the table and sure enough there was a long white feather, one of many objects she had taken out of the closet that morning. A malicious grin formed on Phoebe's lips as a plan came together in her mind.<br>\r\n<br>\r\nWhat does Phoebe do?</span></div></div>",
            "created":1294030800,
            "id":1028379,
            "title":"Phoebe"
        },
        "1431":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "Phoebe tickles Paige's armpits",
                "Phoebe tickles Paige's feet"
            ],
            "content":"<div class=\"\"><div> <span>Phoebe got up from her seat and silently crept closer to Paige. The latter seemed to be lost in thought as she gazed out through the window, not even catching sight of Phoebe's movements out of the corner of her eye. Smiling, Phoebe moved closer until she was presented with easy access to Paige's sides. <br>\r\n<br>\r\nNot waiting longer than necessary, Phoebe reached out and dug her fingers into Paige's sides, wiggling them into the smooth bare skin just beneath the line of Paige's shirt. Immediately, Paige jumped and began trying to twist away but Phoebe was too quick for her, she kept a firm hold and stepped to the side, keeping behind Paige's back, making it difficult for her sister to defend herself. All the while the kitchen was filled with Paige's giggles.<br>\r\n<br>\r\n\"Hehehehehehehehehehehehe stahahap hahahahahahahahahahahahahahahahaha nohohohohahahahahahahaha\"<br>\r\n<br>\r\nPaige's efforts to escape began to grow frantic as Phoebe continued to tickle her sides. Once or twice she came very close indeed, meaning Phoebe had to almost cling on to stay beyond her reach.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHA NO PHEEHEEHEEHEEHEEBS HAHAHAHAHAHAHAHAHA PLEEHEEHEEHEEHEESE\"<br>\r\n<br>\r\nThe two witches wrestled their way into the living room and eventually collapsed onto the sofa. Unfortunately for Paige, Phoebe landed on top, thus maintaining her advantage. Using her knees to hold her sister down, Phoebe began to glide and wiggle her fingers across Paige's exposed tummy, paying particular attention to the area around the bellybutton. She knew this was one of Paige's most sensitive spots. Paige's arms were still free but due to her hysterics she barely had the strength to lift them as she bucked and squirmed under Phoebe's nails.<br>\r\n<br>\r\n\"PLEEHEEHEEHEESE PHOEBEEEEEEE HAHAHAHAHAHAHAHAHAHAHAHAHA STAHAHAP HAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\"</span></div></div>",
            "created":1294117200,
            "id":1028960,
            "title":"Sneak  up from behind and tickle Paige"
        },
        "14311":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "Piper walked in",
                "Phoebe decided to let Paige tickle her"
            ],
            "content":"<div class=\"\"><div> <span>Without warning, Phoebe dug her nails into both of Paige's soft armpits, having suddenly noticed that through the haze of ticklish laughter she had left them completely unguarded. She knew that to keep extracting fresh waves of delighted torment from her sister she must vary her attack, tickling the same area did tend to eventually become a boring, predictable chore.<br>\r\n<br>\r\nAnd she was not disappointed, Paige began to thrash wildly, instantly tucking her arms in as tightly as she could but it was no use, on the contrary she now prevented Phoebe's fingers from leaving as they continued to scribble away.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHA STAHAHAHAHAHAP HEHEHEHAHAHAHAHAHAHAHAHA\"<br>\r\n<br>\r\nPaige's expression was wrinkled in an insane grin as she begged and pleaded, trying in vain to hold back the screams that rippled through her body. This only served to motivate Phoebe, who was grinning in delighted amusement as she redoubled her efforts. Paige's flattened armpits were making it difficult for Phoebe to even move her fingers.<br>\r\n<br>\r\n\"AHAHAHAHAHAHAHAHAHAHA IMAHAHAGOHOHONNAGETYOUFORTHISSSHAHAHAHAHAHAHAHAHAHAHA\"<br>\r\n<br>\r\nTears of mirth were running down Paige's cheeks when...</span></div></div>",
            "created":1295527740,
            "id":1038697,
            "title":"Phoebe tickles Paige's armpits"
        },
        "14312":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "Phoebe continues",
                "Phoebe gets the feather and some rope"
            ],
            "content":"<div class=\"\"><div> <span>Phoebe contemplated her next action. Although Paige's armpits were excessively ticklish, she knew that it would be hard to work on them effectively if Paige wasn't tied up. With this in mind, Phoebe decided it was time to torture Paige's beautiful bare feet. <br>\r\nShe climbed off Paige and made her way over to the side of the sofa where her sisters feet were resting on the arm. Seeing this, Paige made no attempt to escape. Maybe she was too tired to run from the brutal tickling her tummy and sides had already recieved but Phoebe strongly suspected that it was because Paige was beginning to enjoy this herself. Indeed, none of the sisters would admit it but they all loved to tickle and be tickled to their limits. Sure enough, Paige grinned cheerfully down at Phoebe as the latter bore down on her soles.<br>\r\n<br>\r\nPhoebe started slower this time, running her nails up and down Paige's sensitive bare feet. This light scratching didn't cause Paige to struggle as she had done previously but she began to shift about in excitement and anticipation, the occasional giggle parting her lips.<br>\r\n<br>\r\n\"Tickle, tickle, tickle\" crooned Phoebe to highten Paige's unease. \"Does that tickle? Tickle, tickle, I'm going to get your ticklish tootsies\"<br>\r\n<br>\r\nSoon Paige felt her sisters nails being dragged more enthusiastically over her bare arches. Phoebe knew that her feet were her worst weakness and was beginning to pick up the pace. It was almost unbearable already and Paige couldn't control her laughter, yet she did her best to keep her feet in position, allowing Phoebe the easiest access possible.<br>\r\n<br>\r\n\"Hehehehehehehehahahahahahahahahahahahaha ohohohohohmyyyyygohohohohohohodhahahahahahahahahahahaha\"<br>\r\n<br>\r\nPaige's toes, with the nails painted red, were beginning to wiggle vigorously and it was becoming harder with every second of torture for her to stay still. Soon Phoebe was having to block her feet with one arm and let loose with her free hand. Her fingers scribbled their way across every accessible region of Paige's bare soles, even trying to kick her feet would not shake Phoebe off now.  Paige's laughter was bordering on mirthful screams and she was covering her face desperately with both her hands.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHA NAHAHAHAHAHAHAHAHAHAHAHAHAHA PLEEHEEHEEHEESESTAHAHAP AHAHAHAHAHAHAHAHAHAHAHAHAHA\"</span></div></div>",
            "created":1294173360,
            "id":1029008,
            "title":"Phoebe tickles Paige's feet"
        },
        "143121":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "The tickle war rages on",
                "Double submission"
            ],
            "content":"<div class=\"\"><div> <span>After having tickled Paige's feet for at least a full five minutes, Phoebe decided it was time to take things up another notch. She got up and climbed back onto the sofa. She then knelt down so that Paige's legs now supported her entire weight, restricting any possibility of movement.<br>\r\nPhoebe proceeded to stroke her victim's smooth legs, getting down around the ankles and tickling the tops of Paige's wriggling bare feet. Phoebe had her back turned to Paige's upper body, although she could still quite clearly hear Paige's renewed giggles.<br>\r\n<br>\r\n\"Hehehehehehehehehehehahahahahahahahahahahahahaha\"<br>\r\n<br>\r\nPhoebe grinned at the effects of her torment. She could feel the legs beneath her straining to lift her off, trying with all their might to escape the sensation that engulfed them but she held firm and continued to let her fingers run true in response.<br>\r\n<br>\r\n\"Hahahahahahahahahahahahapleeheeheeheesestahahahaphahahahahahahahaha\" ;<br>\r\n<br>\r\nThen, without warning, Phoebe felt a familiar tingling creeping along her own soles. The surprise made her feet jerk sharply and she let out an involuntary laugh. Turning around, she saw Paige grinning back at her sadistically. She had removed Phoebe's slippers, the latter being too distracted to notice and now one of Paige's hands now trailed lazily over Phoebe's exposed sole, a light touch but still enough to send shivers through her entire body.<br>\r\n<br>\r\nNow both sisters tickled with equal intent, each trying to force the other into submission first.</span></div></div>",
            "created":1294183080,
            "id":1029112,
            "title":"Getting even"
        },
        "1431212":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "Both women fall asleep",
                "Phoebe has an idea"
            ],
            "content":"<div class=\"\"><div> <span>The two witches tickled away. For somebody who had been tickled considerably in advance, Paige didn't hesitate and seemed to lack a surprisingly small amount of energy when presented with the opportunity to give Phoebe a taste of her own medicine. Her red fingernails skittered across Phoebe's cute soles and being in no position to move without freeing Paige's legs, Phoebe couldn't help but laugh hysterically. She was, if possible, even more ticklish than her sister.<br>\r\n<br>\r\n\"AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\"<br>\r\n<br>\r\nPhoebe herself kept up her assault, now reaching over and focusing her attention back on Paige's soft white soles but she was losing energy fast at the hands or rather the fingers of Paige's revival. <br>\r\n<br>\r\nKnowing that she couldn't take much more, Phoebe dived backwards and began to squeeze Paige's belly in a final attempt to regain the upper hand. Although Phoebe was on the brink of defeat, this new tactic worked excellently and soon Paige was thrashing about, only just managing to keep tickling Phoebe.<br>\r\n<br>\r\n\"WAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA, NAHAHAHAHAHAHAHAHASSSSSSSSTAHAHAHAHAP\"<br>\r\n<br>\r\nEventually, neither witch could take any more and after both shouting \"No more\", both flopped to the floor gasping for breathe, completely worn out. Both girls still let out the occasional giggle of amusement at their predicament. Paige gazed at Phoebe and the two smiled warmly at each other, taking a well deserved break.</span></div></div>",
            "created":1294184760,
            "id":1029138,
            "title":"It's a draw"
        },
        "143122":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "Paige ties up Phoebe",
                "Phoebe ties up Paige"
            ],
            "content":"<div class=\"\"><div> <span>In a sudden fresh wave of energy, the intensity of Paige's struggling returned. Phoebe was so surprised that she barely had time to react as she was thrown off balance and tumbled backwards to the floor as a result. Stunned, she got to her knees and gazed up at her sister, who was now grinning at her slyly.<br>\r\n<br>\r\n\"What's the matter sis, too much for ya to handle?\"<br>\r\n<br>\r\n\"You just wait!\" yelled Phoebe, springing to her feet and running into the kitchen.<br>\r\n<br>\r\nShe immediately grabbed the feather from the table and made to head back into the living room when suddenly she paused. She knew it would be hard to keep Paige under control as their last bout had demonstrated, the two were about the same size and weight after all. Despite her fatigue, Paige was capable of struggling excessively, almost beyond belief when her sensitive spots were tickled, as Phoebe knew she would be if Paige tickled her. It would be impractical to resume the attack without a means to restrain her sister.<br>\r\n<br>\r\nPhoebe turned and headed outside. When she came back, her arms were laden with bundles of firm, white rope she had retrieved from the shed. She had known they'd come in handy sometime.<br>\r\n<br>\r\nPaige's eyes widened when she caught sight of her sibling with her new supplies, yet she made no attempt to escape while she had the chance.<br>\r\n<br>\r\n\"Excellent\" said Paige, smiling hopefully, \"How thoughtful of you to bring me what I need to tie you up with.....\"</span></div></div>",
            "created":1295223240,
            "id":1036664,
            "title":"Phoebe gets the feather and some rope"
        },
        "1431222":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "Paige chooses the feet",
                "Paige chooses the belly"
            ],
            "content":"<div class=\"\"><div> <span>\"I don't think so\" said Phoebe, declining her sister's offer to turn the tables, \"I need to finish what I started. You threw me off and now you have to pay!\"<br>\r\n<br>\r\n\"Nuh-uh\" protested Paige in a mock baby's tone, \"You're the one who started this whole thing, I was just defending myself. If anything, you're the one who has to pay and I deserve to pay you back every second of what you dished out\"<br>\r\n<br>\r\nAs she finished her statement, Paige wiggled her fingers menacingly in Phoebe's direction, a gesture that couldn't have been more clear regarding her intent. Even verbally, she was unwilling to submit so easily. Her stubborn and determined nature only made Phoebe want to tickle her harder. Finally, she decided a compromise might be in order.<br>\r\n<br>\r\n\"You may have a point, sis. You know how fair I am. But something else you should know is that I'm not done with you yet. Actually, I was just getting started\"<br>\r\n<br>\r\nPaige's eyes widened in shock at the bluntness of Phoebe's suggestions but she carried on listening nonetheless.<br>\r\n<br>\r\n\"So here's the deal\" said Phoebe matter-of-factly, \"Make it easier on yourself and take your punishment and I promise I'll let you have your way with me later, I won't put up a fight. You can have your revenge but right now, you're mine. What do you have to say about that?\"<br>\r\n<br>\r\n\"No way\" cried Paige in alarm, though a tense and teasing grin had returned to her features.<br>\r\n<br>\r\nPhoebe sighed. Looked as if Paige had chosen to do things the hard way.<br>\r\n<br>\r\n\"Now sis, I don't remember mentioning you had a choice\" she added sadistically. With that, she dashed around the sofa and grabbed both of Paige's wrists. Once again she acted so swiftly and without warning that Paige barely had the time to react. Using one arm to keep both of Paige's arms secure, Phoebe began to uncoil the rope. Her younger sibling strained slightly and tried to break Phoebe's grip but she was too strong. Besides, Paige could have orbed away at any time if she wanted to but her submissive side was at last beginning to subdue her, part of her had been begging for this to happen all along.<br>\r\n<br>\r\nWrapping the soft rope around Paige's wrists and knotting it off tightly, Phoebe pulled her into an upright position so that her bare feet now dangled inches from the floor from the front of the sofa. Pulling a cushioned stool over towards them, Phoebe propped her sister's feet on top of it and repeated the same binding process with her ankles. During this time Paige had broken into a quiet fit of giggles. Once her ankles had been firmly tied to the stool, Phoebe took another length of ropeand connected it to the knot around Paige's wrists. She then ran the rest of it down the back of the sofa and secured it to the support bar underneath. Now Paige couldn't budge from her sitting position.<br>\r\n<br>\r\n\"Well, what do you think?\" asked Phoebe, standing back to admire her work.<br>\r\n<br>\r\nPaige stuck her tongue out. \"Meanie!\"<br>\r\n<br>\r\n\"I'll let you pick the spot first\" offered Phoebe. \"So Paige, which part of your body do you want me to tickle senseless first?\"</span></div></div>",
            "created":1300328160,
            "id":1071447,
            "title":"Phoebe ties up Paige"
        },
        "14312222":{
            "author_id":"journeyman19",
            "author_name":"journeyman",
            "choices":[
                "She casts a tickling spell",
                "She calls Piper"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, seeing as it's not as if I have a choice and you've already tickled my feet so much, why not give my belly a shot?\" said Paige after a moment's hesitation.<br>\r\n<br>\r\n\"Ok, belly it is\" Phoebe answered gleefully as she flexed and wiggled her fingers in Paige's direction. \"Get ready to die Paige, I know you just can't take it around the bellybutton!\"<br>\r\n<br>\r\nShe was right. Paige's tummy was notorious within the Halliwell house for being hyper-ticklish, especially on the area surrounding her bellybutton and even inside the bellybutton itself. Despite being sensitive all over, Paige felt as if she had just signed her own death warrant. She could hardly expect Phoebe to go easy on her, especially on such a boring day. Her only hope was that Piper or Leo would interrupt but what guarantee was there that she would be rescued even then? For all she knew they might play along with Phoebe and then Paige would have to worry about being tickled in more than one area at a time. She grimaced at the thought.<br>\r\n<br>\r\n\"Why so grumpy Paige?\" queried Phoebe. \"You know you're going to love this almost as much as I will.\"<br>\r\n<br>\r\nWith that she began to tease Paige's navel with long sharp nails. Back and forth they glided, causing the younger sister to squirm and giggle, her restraint ebbing away with every scratch.<br>\r\n<br>\r\n\"Heheheheheheheheeheeheeheehahahahahahaha\"<br>\r\n<br>\r\nThe seconds passed and it didn't take long before Paige was practically throwing her weight against her bonds. The tingling on her belly was becoming unbearable but for all her efforts she couldn't shake it off. She threw her head back, her mouth agape with laughter.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHEHEHEHAHAHAHAHAHAPHEEEBEEESTAHAHAHAPHAHAHAHAHAHAHA\"<br>\r\n<br>\r\nPhoebe decided to take things to the next level and snaked her index finger directly into Paige's bellybutton, causing Paige to shriek and toss around on the sofa but the rope binding her hands and feet held firm.<br>\r\n<br>\r\n\"NOHOHOPHEEEBSHAHANOHOHOTTHEREHAHAHAHAHAHAHAAHHHHAHAHAHAHA\"<br>\r\n<br>\r\nFinally, Phoebe paused, allowing Paige to slump back, exhausted and panting.<br>\r\n<br>\r\n\"Ya know, this is actually getting a little tiring\" announced Phoebe.<br>\r\n<br>\r\n\"Oh, ya think?\" Paige breathed sarcastically.<br>\r\n<br>\r\n\"Not for you, dummy\" said Phoebe to Paige's indignation, \"For me too. Tickling you is quite hard work considering you never seem to give up laughing.\"<br>\r\n<br>\r\n\"Maybe then you should call it a day and go and take a nap...right after you untie me\" suggested Paige hopefully. Not only would she finally be free, if she could catch Phoebe off guard she might even be able to exact some well-deserved revenge.<br>\r\n<br>\r\n\"Nah\" responded Phoebe immediately. \"I've got an idea ten times better than that\".</span></div></div>",
            "created":1310755980,
            "id":1148368,
            "title":"Paige chooses the belly"
        }
    },
    "info":{
        "author_id":"journeyman19",
        "author_name":"journeyman",
        "brief_description":"Imagine if the Halliwell sisters fell foul of one another's torturous fingers one day!",
        "created":1294088100,
        "description":"<td align=\"left\" class=\"norm\">Alright guys, this is my first story of the site. It takes place primarily between the four series protagonists (in this story Prue never died), who let's fantasize one day wake up in the strange mood to tickle each other. Just a set of basic ground rules to bear in mind:<br>\r\n<br>\r\n-No sex or sexual activities<br>\r\n-(Tying and sometimes gagging is allowed but keep it simple (ie tied to bed, chair etc), no \"spread eagle\" ties etc)<br>\r\n-No killing, mutilation or injury/illness of any kind<br>\r\n-Stay on topic in general please<br>\r\n-To take place largely between the four sisters, though more minor characters may occasionally be used<br>\r\n-Men may be briefly tickled but only by women, no M/M material please<br>\r\n-Try keeping it consensual, occasional force is allowed between characters<br>\r\n-Please try to be creative and original<br>\r\n<br>\r\nSorry about that, enjoy</td>",
        "id":1738073,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1435089840,
        "modified":1435089840,
        "pretty_title":"Charmed Ones Tickled"
    }
}