{
    "chapters":{
        "1":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "DC Universe",
                "Marvel Universe"
            ],
            "content":"<div class=\"\"><div> <span>          \"7, 0, 3, 1, 6, 8, 54.\" If these are your numbers, congratulations! Please confirm via our website to book your flight and hotel.\" You couldn't believe it. Your heart felt like it was going to explode. You had practically worshipped these heroines growing up, and now you got to meet them. More than that. You got to sleep in the same hotel as them. Talk with them. Have breakfast with them. Get to know them. This was your dream come true. An entire week with the beautiful, strong, and completely bad-ass women from the...</span></div></div>",
            "created":1463461200,
            "id":2149495,
            "title":"Choose Your Universe"
        },
        "11":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "You wake up shrunken"
            ],
            "content":"<div class=\"\"><div> <span>          ... and completely bad-ass girls from the DC universe. Wonder Woman. Super-girl. Power Girl. And so many others. You read online that over 100 heroines would be at the convention. 100! You didn't even know that many heroines existed! You had a feeling the week that followed would be the absolute best of your life.<br>\r\n<br>\r\n<br>\r\n<div align=\"center\">***</div><br>\r\n<br>\r\n          Three days later, your taxi had just arrived in front of the hotel. A beautiful building, fit to host such beautiful women. You grabbed your suitcase from the trunk and proceeded inside. The heroines would not arrive until a few hours after you, you had been informed. A private escort lead you to your room, which was even larger and more elegant than you had hoped. You tipped the man, and looked around the room, taking in your surroundings.<br>\r\n          A king sized mattress with silk sheets dominated the center of the room. A nightside with a beautiful lamp was directly to the left of the bed, and on the right side of the room was your own private mini-bar. You proceed to the bar, and find a small, exotic bottle sitting on it.<br>\r\n          \"Complementary.\" Read the note placed in front of the bottle. Deciding alcohol would be a good idea to ease your nerves (you do not want to make an ass of yourself in front of the heroines), you open the bottle and take a decent sized swig. It tastes rich, warm; it tastes the way a good alcohol should. And something more. Your head becomes groggy, and you laugh giddily before your vision fades to black.</span></div></div>",
            "created":1463461200,
            "id":2149502,
            "title":"DC Universe"
        },
        "111":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "There is a knock on the door ",
                "You go out and look for help"
            ],
            "content":"<div class=\"\"><div> <span>          You're drunk. That's the first thing that crosses your mind when you come to. No, you're hallucinating. Despite the fact that you feel completely sober, you must be. You <i>must</i> be. The bar, the bed, the nightstand, everything... everything was huge. Absolutely, terrifyingly, huge. You were sitting on the carpeted floor, no bigger than an inch and a half tall, if you were being generous. You <b>must</b> be hallucinating.<br>\r\n          You close your eyes and shake your head, hoping to snap out of whatever dream state you were in. It doesn't help. Just as you're about to start panicking, an intercom turns on, and a recorded voice speaks.<br>\r\n<br>\r\n          <i>\"(your name here), you are not dreaming. This is not a trick. Please remain calm. You have been selected for a highly classified experiment. The bottle you drank from is called 'Micro-Brew,' and it has reduced the size of your body. Please do not panic, the effects will wear off at the end of the week. We are conducting an experiment to see how the heroines will react to your condition. You will be compensated for any discomfort you may experience. Thank-you for your cooperation, and have a 'super' week.</i><br>\r\n<br>\r\n<b>WHAT. THE. FUCK.</b><br>\r\n          You didn't care what the voice on the intercom said, you were panicking. A fucking experiment!? The government had lied to you! Taken advantage of you! You couldn't believe any of this. The only positive side was that the heroines weren't a lie. The heroines. Of course. Maybe somebody could help you!<br>\r\n<br>\r\n</span></div></div>",
            "created":1463461200,
            "id":2149509,
            "title":"You wake up shrunken"
        },
        "1111":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Super-Girl",
                "Wonder Woman",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>          Before you can make up your mind, you hear the telltale sound of knuckles on the door. Unsure of whether this is another part of their experiment, you hesitate to say anything. Obviously, you can't open the door, but you could shout for them to come in. Assuming whoever it was had a hotel key.<br>\r\n          Deciding that your best bet is to allow the guest inside and seek their help, you cal out feebly, \"Come in...\"<br>\r\n<br>\r\n          Who is at the door?</span></div></div>",
            "created":1463461200,
            "id":2149512,
            "title":"There is a knock on the door "
        },
        "11112":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "You call out to her",
                "You're too nervous to speak"
            ],
            "content":"<div class=\"\"><div> <span>          You hold your breath as the door swings open. You hope with all your heart that it is a heroine who is about to enter, not just a hotel employee. That said, you are terrified by the idea of meeting a heroine, especially given your current state-of-being. It would be like staring into the sun.<br>\r\n          You were wrong. It would not be like staring into the sun. It would be so much more than that. Standing in the doorway was Diana Prince. It was Wonder Woman. The Amazon Demi-God Princess. The original heroine. She had the body of a warrior and the face of a princess. Amazon from the neck-down, princess above that. Demi-God all over. <br>\r\n          There wasn't an inch of her powerful frame that wasn't accented by toned muscle. Her tanned skin was like marble. Her thighs looked like they could snap a person clean in half, which you had no doubt was true. You could make out the muscle definition of her midsection even through her breastplate. Her waist looked like it had been carved from marble, with the artist making a point to portray her hips as twice the size of her waist. It seemed her breasts contained the only shred of fat on her body, in which regard they did not fall short. The well rounded orbs protruded from her chest in a magnificent, gravity-defying show of cleavage. Despite their size, they appeared perky- no doubt because of the stupendously powerful layer of pectoral muscle hidden somewhere beneath her glorious mounds.<br>\r\n          Not to mention her face. Goddamn, her face. You had seen all the pictures, videos, drawings, and every other form of media under the sun of the woman. You had seen it all, but none if it captured her true beauty. Her face was beyond perfect. It radiated beauty so intensely that you could almost see it coming off of her. The kind of beauty that seemed like she should make the space around her look perfect, just by being near it. Her features were feminine, but cutting.<br>\r\n          You were star struck. Your lightheadedness returned, but not because of the potion anymore. Wonder Woman. <i>Wonder Woman.</i> <b><i>Wonder Woman</i></b> had knocked on your door. It was only your first night here, and you were already meeting the Amazon warrior. Fuck the government and their \"experiment,\" you still got to meet Wonder Woman. That's all that mattered.</span></div></div>",
            "created":1463769540,
            "id":2151146,
            "title":"Wonder Woman"
        },
        "11113":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Power Girl ",
                "Cat Woman",
                "Somebody else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>          Is it Power Girl, Cat Woman, or somebody else?</span></div></span></div>",
            "created":1463461200,
            "id":2149513,
            "title":"Other- Power Girl or Cat Woman"
        },
        "111131":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Explaining your predicament to Power Girl"
            ],
            "content":"<div class=\"\"><div> <span><i>attached is a picture of Power Girl</i><br>\r\n<a rel=\"nofollow\" href=\"https://images3.alphacoders.com/173/173897.jpg\" target=\"_blank\">https://images3.alphacoders.com/173/1738...</a><br>\r\n<br>\r\n          You hear a feminine laugh. \"Damn, you're lucky I have super hearing, cause your voice is <i>soo</i> quiet!\" The mystery woman teases.<br>\r\n          You hear a cracking noise, and see the doorknob twist, despite the fact that it was locked. Your heart leaps. Whoever was out there was strong enough to break the lock just by turning the handle! It's a heroine! The door opens, and your heart jumps into your head.<br>\r\n<br>\r\n          Power Girl.<br>\r\n<br>\r\n          <i>THE</i> Power Girl.<br>\r\n<br>\r\n          She's standing there, smiling her radiant smile. She's in costume. Her entire body seems to radiate magnificence. Her perfect breasts stretch out of her skin tight white suit, forming miles of cleavage. One toned arm holds the knob to your door. Her legs go on for miles, the massive muscles of her quadriceps look like they were chiseled by the Gods. Kara Zor-L. Karen Starr. <i>Power Girl.</i> It was really her.<br>\r\n          \"Whoops,\" she smiles shyly. \"Think I broke it.\" She holds up the doorknob for you to see. You couldn't care less that she broke your door.<br>\r\n          \"Wait a second, where are you?\" She asks, confused. \"I hear your heartbeat, but I don't see you anywhere...\" You were so preoccupied by her magnificent, prominent beauty that you had completely forgotten you were an inch tall. Fuck.<br>\r\n          You step out from behind the bed with your hands clasped shyly behind your back. \"Umm, down here...\"</span></div></div>",
            "created":1463461200,
            "id":2149517,
            "title":"Power Girl "
        },
        "1111311":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Power Girl wants to help you ",
                "Power Girl takes advantage of you"
            ],
            "content":"<div class=\"\"><div> <span>          Power Girl's piercing blue eyes go wide as she sees your tiny body, and a massive grin forms on her face.<br>\r\n          \"Awesome!\" She exclaims. \"I didn't know we were getting a superhuman guest! <i>Awesome!</i> What are you?\" She plops her toned backside down onto the bed, which creaks under her weight. She crosses her beautiful legs and looks at you expectantly, still grinning. You are hesitant to explain what's happened to you and ruin her grandiose vision of you, but you know you must.<br>\r\n<br>\r\n<div align=\"center\">***</div><br>\r\n<br>\r\n          \"Woah.\" This is the first thing Power Girl says after you explain the potion and the intercom and the experiment to her. \"Woah.\" She repeats. \"They really couldn't think of any better name for the elixir than a beer pun?\" She laughs. You were expecting her to lose it, but you realized now that you should have known better. Power Girl was the real deal. A shrinking potion was probably child's play next to the things she had seen.<br>\r\n           \"Do you mind if I... You know...\" She says, making a lifting motion with her hand. You are confused at first, but realize she is asking if she can pick you up.<br>\r\n          \"Ah.\" You say. \"Be my guest.\" Karen's surprisingly elegant hand wraps around your body, gently. She lifts you to her face, and you are stunned by her beauty.<br>\r\n          \"I have to say,\" Power Girl sounds thoughtful, \"This is pretty damn interesting.\" You were hoping to meet Power Girl during your stay here, but you never expected to end up sitting in the palm of her hand. Life is like a box of chocolates.</span></div></div>",
            "created":1463461200,
            "id":2149529,
            "title":"Explaining your predicament to Power Girl"
        },
        "11113112":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "She puts you in her mouth",
                "She sits on you",
                "She forces you to be her slave"
            ],
            "content":"<div class=\"\"><div> <span>          \"I wonder...\" Power Girl looks deep in thought. \"You said the intercom voice said they were testing us, right? Testing how heroines would react to you?\" She runs her tongue across her bottom lip in thought.<br>\r\n          \"Well yeah. Sure. That's what it said. I don't understand what they mean by that, though.\" You are curious to know what Power Girl is thinking.<br>\r\n          \"I think I just might...\" She trails off. \"And I bet...\" Suddenly, her hand closes violently around you. You gasp in shock as her strong grip constricts around your entire body, then relaxes just as quickly. Okay? \"Wow. I knew it! This is really something!\" What the hell was she talking about?<br>\r\n          \"Umm, Power Gir- err, Karen, what exactly did you know?\" You are completely in the dark.<br>\r\n          \"Do you have any idea how hard I just squeezed you?\" She asks. \"Hard enough to crush steal. You should be dead. Whatever you drank... it greatly enhanced your physical durability. No doubt a failsafe, you know, just in case.\" You should have been furious with her, but you were too amazed to feel anything other than curiosity. Were you a superhero now? Would you stay like this?<br>\r\n          \"In case? Uh, in case of what?\" You stammer.<br>\r\n          \"Like you said, they're testing how we react.\" Power Girl's grin was returning. \"What if, say, what if somebody, a heroine, that is... What if a heroine wanted to do bad things to you? What if she couldn't help herself? You would have been killed instantly. Most of us have some sort of super strength, you know.\" You noticed her hand was slowly closing around your body again, almost subconsciously, and you started getting nervous.<br>\r\n          \"Jesus Christ.\" You say. \"Yeah. Yeah, I hadn't even thought of that. Thank God you're the one that found me.\" Power Girl looks miles away, but is staring right at you.<br>\r\n          \"Huh?\" She says. By this point her hand has closed around your midsection. \"Oh, yeah. Thank God.\" Her blue eyes are focused on you. They look almost... Hungry? Your nerves are increasing every second that passes.<br>\r\n          \"Umm, Power Girl...\"<br>\r\n<br>\r\n<br>\r\nWhat does she do with you?</span></div></div>",
            "created":1463461200,
            "id":2149539,
            "title":"Power Girl takes advantage of you"
        },
        "111131122":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "She wants you deeper",
                "She continues butt-crushing you ",
                "She farts on you"
            ],
            "content":"<div class=\"\"><div> <span>          \"Yeah, thank God.\" She smiles. She looked almost... nervous?<br>\r\n          \"Right.\" You say awkwardly. \"So can you help me?\" As you spoke, her titan's grip softened. Finally. Her hand moved you gently to the bed, where she placed you beside her massive, chiseled thigh. The thing was like a mountain to you.<br>\r\n          \"Umm, yeah. About that...\" Power Girl trailed off again. Why was she acting so damn odd? She stood up and faced you. The giantess leaned over the bed, placing a hand on either side of your body. Her giant breasts and beautiful face loomed directly over you, casting an ominous shadow. You could have been imagining it, but you almost felt an heir of dominance exuding from her.<br>\r\n          \"I know you can't change my size back,\" You start. \"But could you, you know, watch over me? Just for the rest of the week.\" Her sharp blue eyes are eyeing you hungrily as she responds.<br>\r\n          \"Sure, yeah. I could do that.\" She almost sounds like she's in a trance. Her heart is pounding so loud that you can hear it. Hell, you can almost feel it in the air.<br>\r\n          \"Great! So, uhh...\" As you speak, Power Girl removes her hands from the bed and stands up, but then does something unexpected. She turns around. She doesn't walk away or say anything, she just stands there. This is the first time you've gotten a look at Power Girl's backside, and it makes you forget everything that's going on. It's majestic. It's more than majestic. It's God-like. The twin spheres are perfectly rounded and smooth, and her white suit disappears between the massive cheeks, sucked deep into the confines of her posterior. The way her ass sticks out simply <i>demands</i> attention. Your trance is only broken when her powerful hands grip the bed around you, and she slowly begins lowering her perfect ass towards your body.<br>\r\n          \"Wha-\" You stammer as you start to backpedal, trip, and land sitting on the bed. \"What are you, Power Girl...\" You start shuffling backwards like a crab. Her backside is so massive compared to your body, however, that it feels like no matter how much you retreat, you're still directly under the thing.<br>\r\n          \"I'm sorry.\" Power Girl's voice almost breaks with anticipation. She spoke with the nervous excitement you would expect from a virgin. \"I... I really am. I just can't resist.\" Her posterior draws closer to you, blocking out more and more of the light from the room as it becomes all you can see.<br>\r\n          \"Karen, wait!\" She doesn't wait. <br>\r\n          You hear a soft, constrained moan from the kryptonian as you're pushed up against her ass crack. The soft bed allows her butt to sink into it, covering you in complete blackness and extreme heat. You feel like you're in a flesh prison. Your arms are pinned at your sides and your face is pressed into her crack as she begins softly rubbing her backside on top of you.<br>\r\n          \"I...\" She gasps. \"I'm sorry...\" Despite her apologies, her gyrating only picks up speed, forcing you further into the maw of her asscheeks.</span></div></div>",
            "created":1463461200,
            "id":2149619,
            "title":"She sits on you"
        },
        "1111311221":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "You do as she says",
                "You refuse"
            ],
            "content":"<div class=\"\"><div> <span>          \"I'm sorry.\" She half moans, half whispers, as your body is engulfed by her backside. \"But I don't think... I... I'm not satisfied. I want <i>more</i>.\" The more she speaks, the more you understand what's going on. Power Girl <i>is</i> sorry. You don't believe she's lying to you. Clearly, this is a fetish of hers. A fetish that she surely never thought would be possible, and dismissed. That is, until now. Power Girl was a good person, but she couldn't resist this opportunity. Just your luck. The heroine that knocked on your door, the heroine you counted on to save you, just happened to be the one heroine with the most improbable, specific fetish you could imagine. And now that she had committed to using your body to live out that fetish, she wasn't going to stop.<br>\r\n          \"I ...<i>need</i>... more.\" She lifted her posterior off of your body, and you gasped for clean, cool air. Your body was covered in sweat, but you weren't hurt. You watched Power Girl bring her hands around to her backside as she drew a shaky breath.<br>\r\n<br>\r\n<i>riiiiiiiiiip</i>. <br>\r\n          Her hands tore the fabric of her suit with ease, revealing her now entirely naked ass in all of its glory. You knew better than to get caught up in its spell a second time, however. You were just standing up to run when Power Girl slammed her naked backside into you. She didn't have the self control to do it slowly like the did before. You were pinned between her cheeks a second time, only this time there was nothing separating you from her light pink, puckered anus. <br>\r\n          Honestly, it tasted good. You hated to admit it, and you wish you wouldn't have found out. Yet, as her rosebud pressed firmly against the entire top-half of your body, the taste of her orifice found its way into your mouth, and it tasted like roses. It tasted sweet. It tasted <i>good.</i> A small blessing, considering the fact that Power Girl was now rubbing it against your body as it puckered. It was like her anus was kissing you. Shaky moans escaped her as it dominated your body, covering you in its rose-scented musk.<br>\r\n          \"I...\" Power Girl gasps. \"Oh my God.\" You can feel her body seizing up in ecstasy as her pucker massages your body. \"Please,\" She moans. \"Climb in. <i>Please.</i>\" </span></div></div>",
            "created":1463461200,
            "id":2149632,
            "title":"She wants you deeper"
        },
        "11113112211":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Power Girl loses control",
                "You finish climbing in on your own"
            ],
            "content":"<div class=\"\"><div> <span>          \"<i>PLEASE.</i>\" She emphasizes the word like it's the single most important request anybody has ever made. Was this a part of her fetish? Did it involve a tiny human <i>willingly</i> entering her ass? You would admit that her hole tasted good, but you didn't want to be inside of it? How could you? It would be tight, dark, claustrophobic, and <i>hot.</i> It would be hot. It would be something you would never forget. You didn't want to, but you were <i>willing</i> to, and that was enough for Power Girl.<br>\r\n          She moaned so intensely that it sounded like she was on the verge of tears as you pressed your face into her anus. The moist flesh opened up, accepting your head with a quiver.Pushing your arms against the bed for traction, you forced your body upward, feeling her anus slide over your shoulders.<br>\r\n          \"Oh my... <i>fuck.</i> <b><i>THANK YOU.</i></b>\" Her voice was fragile, but intense. She spoke through gasps and moans, and she sounded so turned on that it almost made you enjoy what you were doing. Almost.<br>\r\n          Her anus pulsed around you as your upper body entered her, sucking on your body like a lollipop. You could feel her blood pumping hard around you. She gasped a shaky gasp as you slowly slid into her, up to your waist.<br>\r\n          \"Don't... Stop...\" She pleads. Your arms are pinned against your sides, being sucked on by her orifice. You have to use your legs to continue pushing. You gasp in unison with the heroine as your waist slips inside of her, and you feel her strong anal ring squeezing against your crotch. You hesitate, enjoying the pressure. Power Girl notices, and you assume it turns her on even more, because you can feel her blood start pumping even harder than before.<br>\r\n          There you were, halfway inside of Power Girl's ass, being chewed on by her anus. She struggled to control her volume as she gasped and moaned. Her hands gripped the bed so hard that the mattress began to tear.</span></div></div>",
            "created":1463461200,
            "id":2149640,
            "title":"Into Power Girl's anus"
        },
        "111131122111":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Another heroine enters the hallway- Bingo!",
                "She sends you deeper into her ass"
            ],
            "content":"<div class=\"\"><div> <span>          Power Girl's body rose into the air. You had almost forgotten she could do that. Her sphincter squeezed your waist even tighter than before. You weren't sure if this was from the effort of flight or to be sure it didn't lose its meal. As she moaned, her body slammed, ass first, into the ceiling, leaving a hole the shape of her backside in it. She was losing control.<br>\r\n          Her anus sucked on you like a vacuum as she slammed her ass into everything she could, destroying the room with her posterior. She was no longer monitoring her volume level as she flew around the room like a woman possessed.<br>\r\n<b>THUD. THUD. THUD.</b> Her ass was becoming a tool of destruction. Luckily for you, it was big enough that her cheeks would collide with the surfaces long before your legs would, preventing you from being rocketed into her colon. <br>\r\n          Power Girl went crashing backside first through the wall and into the hallway. She hesitated, flexing her anus around your body turned chew-toy and panting. She needed something solid. Something strong. She needed something that she could grind her ass against without destroying.</span></div></div>",
            "created":1463461200,
            "id":2149659,
            "title":"Power Girl loses control"
        },
        "1111311221111":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Super-girl",
                "Starfire ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>          You were still waist deep in Power Girl's unholiest of holes, and she had lost her mind. The only thing she was thinking about was your body- your small, delicate body, at the mercy of her anus. That was all that mattered to her. She started down the hallway, still in the air, smashing everything with powerful bucks from her backside. <br>\r\n          She was causing an extreme amount of noise and destruction, it was only a matter of time before somebody came to investigate. And, sure enough, as Power Girl neared the end of the hallway, somebody turned the corner.</span></div></div>",
            "created":1463461200,
            "id":2149665,
            "title":"Another heroine enters the hallway- Bingo!"
        },
        "11113112211112":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "WHAM!",
                "Starfire snaps out of it and reacts"
            ],
            "content":"<div class=\"\"><div> <span><i>picture of Starfire</i>:<br>\r\n<a rel=\"nofollow\" href=\"http://img02.deviantart.net/6122/i/2015/057/3/4/starfire_by_didi_esmeralda-d8jlw1s.jpg\" target=\"_blank\">http://img02.deviantart.net/6122/i/2015/...</a><br>\r\n<br>\r\n          Starfire sprinted down the hallway. What the hell was going on? She heard banging noises and... moans? That couldn't be right. It just couldn't. She rounded the corner and couldn't believe what she saw. Power Girl. Or rather, her ass. The woman was suspended in mid-air, and her suit had been torn, revealing her massive posterior. To make things even weirder, the kryptonian was slamming her ass against the walls. Was that was was causing the banging noises.<br>\r\n          \"Uhh... Karen?\" As soon as Power Girl heard her name, her flushed face looked onto Starfire, and an eerie smile come over her. Immediately, she was shooting through the air towards Starfire. Starfire took a reflexive step backwards. Was Power Girl attacking her? She prepared to defend herself, then paused when Power Girl did the only thing that could make all of this stranger.<br>\r\n          The kryptonian twisted her body as she flew, bending at the waist and rotating. Starfire watched in shock as the woman's naked backside rocketed towards her. The monument of an ass was approaching quickly, her cheeks being pulled apart by G-force. Starfire froze up when she saw the flailing pair of legs, your legs, protruding from her anal orifice. Not from fear, but from utter confusion.</span></div></div>",
            "created":1463461200,
            "id":2149674,
            "title":"Starfire "
        },
        "111131122111121":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Power Girl orders Starfire to push you into her ass with your tongue",
                "Power Girl humps Starfire's head to a pulp"
            ],
            "content":"<div class=\"\"><div> <span>          The last thing Starfire saw were those flailing legs sticking out of her anus, kicking wildly. Power Girl's ass slammed directly into her face with monumental force. Starfire was lifted from the ground and driven backwards by the Kryptonian's posterior, which had momentum to spare. Face buried in Power Girl's ass, Starfire felt her body smash through the wall behind her.<br>\r\n          The pair went barreling out of the building, with Power Girl's hands already gripping the back of Starfire's head. Power Girl's unrivaled strong arms forced Starfire's face into her naked crack. Starfire tried to scream as she felt your legs kicking her lips, which were pressed directly against the Kryptonian's anus. She flailed and struggled to escape with all her might, but her strength came nowhere near that of Power Girl's, who only gasped as she felt the vibration of Starfire's scream ripple throughout her backside. <br>\r\n          Finally, the pair smashed into the cement, still locked face-to-ass. Starfire went dizzy as she felt the back of her head crash into the concrete, and her struggling slowed significantly. She was at the mercy of Power Girl now. Who was she kidding, she was from the start. Power Girl was already twerking her ass madly against Starfire's face, thrilled to have found something strong enough to withstand her lust.<br>\r\n          Power Girl moaned as she grinded your legs against Starfire's face, bucking up and down and feeling you slowly slip deeper. She screamed in ecstasy as her eyes began to glow red, filling up with heat. \"<i><b>YES!</b></i>\" She moaned as she dominated both you and her fellow heroine, all with her glorious backside.</span></div></div>",
            "created":1463461200,
            "id":2149688,
            "title":"WHAM!"
        },
        "1111311221111211":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "She has no choice but to obey",
                "She refuses"
            ],
            "content":"<div class=\"\"><div> <span>          Power Girl knows what she wants, but she almost can't bring herself to ask. Not to ask. To give the command. She <i>needs</i> you in her ass, all the way. And she needs Starfire's tongue to get you there. Still, to ask, she had to stop gyrating her ass on the lesser being's face, and she had to stop moaning long enough to form a coherent sentence. She almost wasn't strong enough. Almost.<br>\r\n          Starfire breathed a sigh of relief directly into Power Girl's anus as she felt the onslaught slow to a stop. Little did she know, the worst was yet to come. <br>\r\n          \"Push.\" She barely recognized Power Girl's voice. She sounded so dominant, so maniacal, so... flustered. \"<i>NOW!</i>\"<br>\r\n          Starfire had a terrible feeling that she knew what Power Girl meant, but she couldn't bring herself to do it. Whoever these legs belonged to, they didn't deserve this. Nobody deserved this, anymore than Starfire deserved what was happening to her.<br>\r\n          \"Stick out... your tongue... and push.\" Power Girl commanded. \"Push him in.\" Starfire hardened her resolve. Power Girl had gone <i>completely</i> out of her mind. She would have no part in this.<br>\r\n          \"<i>PUSH HIM IN OR I'LL TEAR YOUR FUCKING LEGS OFF</i>!\" Power Girl's voice almost sounded to horny for her to take the threat seriously.</span></div></div>",
            "created":1463461200,
            "id":2149698,
            "title":"Power Girl orders Starfire to push you into her..."
        },
        "11113112211112111":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Starfires starts enjoying it",
                "She withdraws her tongue",
                "Back to your POV"
            ],
            "content":"<div class=\"\"><div> <span>          Starfire's eyes filled with tears as she came to accept the fact that their really wasn't a decision here. If she refused, Power Girl would kill her, find somebody else to be her buttslave, and kill them if they refused. Parting her lips and squeezing her eyes shut, Starfire began to stick out her tongue.<br>\r\n          A deep, shaky, high-pitched moan escaped from Power Girl as she felt the moisture from Starfire's tongue on her anus. Even better, she felt your pathetic body slipping deeper into her ass. She grabbed Starfire's arms and pulled, nearly ripping them out of their sockets as she started a slow, rhythmic swirl of her hips on Starfire's face.<br>\r\n          Starfire felt your legs kicking her tongue, begging for freedom from this nightmare. But you had no more of a chance to escape Power Girl's lust than Starfire herself did, and she knew that. Trying not to think about it, she prodded her tongue outward, feeling Power Girl's anus slurp up your legs. <br>\r\n          She gave a final, hard push with her tongue, eager to end this as quick as possible. Too hard. Power Girl gasped, breathless, as she felt your body shoot into her colon. But that was only half of it. She also felt Starfire's moist tongue slip past her sphincter, which tightened with renewed vigor around the newcomer. Starfire had underestimated how easily your body would make the final descent into the Kryptonian's posterior, and so she had lodged her own tongue into it as well. Starfire made the same realization you had made at the start of your journey into Power Girl's anus- it tasted like roses.<br>\r\n          This was wrong, terribly, disgustingly, inhumanely wrong. A person, a living person, was trapped inside of Power Girl's bowels, probably struggling in a slimy tunnel. But it tasted good. Power Girl's anus, which had Starfire's tongue in a vice grip, tasted amazing.</span></div></div>",
            "created":1463461200,
            "id":2149703,
            "title":"She has no choice but to obey"
        },
        "11113112212":{
            "author_id":"notontime",
            "author_name":"NotOnTime",
            "choices":[
                "You give in and lick her bowels",
                "Power Girl forces you to do what she wants"
            ],
            "content":"<div class=\"\"><div> <span>You were locked into a steamy kiss with Power Girls anus. Using both arms you pushed back, prying yourself away so you could talk. Threads of wet anal mucus pulled from your head, dripping from her orifice to yours. The smell of roses was plastered to your face.<br>\r\n<br>\r\n\"Listen...\" you really hoped she could hear you. \"You're a great girl and all, but I'm sorry. I'm not really comfortable with-WOAH!\"<br>\r\n<br>\r\nPower Girl's ass lifted up. You thought for a second your words got through to her, but then her strong hand came down and snatched you up from the bed. The giantess got on knees, holding you in front of her massive, round, bent-over backside. Her free hand took hold of one of her milky-white ass cheeks and pulled it aside. You had a full view of her anus, it was puckering in and out, as if preparing to swallow something whole. You quickly realized what was happening and started to kick and squirm in her hand, but her unrelenting grip held you tight.<br>\r\n<br>\r\n\"NO! KAREN! STOP! I DON'T WANT TO DO THIS!\" you yelled.<br>\r\n<br>\r\n\"I'm really sorry...\" she said, as if she didn't have a choice. \"I need this. My body... I can't hold back!\"<br>\r\n<br>\r\nShe inched you closer to her ass. Between her huge thighs you could see a pool of juices forming. Hey pussy was gushing out juices like it had sprung a leak. Your eyes were fixated on her pinks lips and the river of fluids that was spilling from it. The giant womanhood was throbbing, its wet lips quivered from an overdose of lust. Suddenly Power Girl's hand pushed you back between her sweaty ass cheeks, reminding you of your destination.<br>\r\n<br>\r\nRight as you made contact with her hole, you heard her let out a moan. The outer rim of muscle of her anus opened wide to your touch, as if it was welcoming you inside. You shuddered with fear, you had a clear view of her inner pink wrinkles, they were clenching and relaxing with anticipation. Your head entered first, filling up the space in her widened hole and pressing your face into the hot flesh within. The woman's hot sphincter was very accepting of your intrusion and gave a happy clench that squeezed your skull. Another splattering of juices burst from her pussy, and you heard her voice tremble with ecstasy.<br>\r\n<br>\r\n\"I'm sorry! I'm so so sorry! I need you <i>all the way</i> inside me. Oh <i><b>God</b></i>.\" she moaned.<br>\r\n<br>\r\nNot wanted to waste any more time, her hand began to push you into her ass. Your face was engulfed in tense hot muscles, but the force behind you was so great that you slipped right through. Your shoulders, waist, and then legs were all gobbled up by her asshole, the rubbery ring hungrily swallowed your body like mouth. Wet anal juices slathered your skin, in conjunction with the warm massaging walls. Power Girl's ass took delight in smothering your shrunken form, marking you with her thick rosy scent.<br>\r\n<br>\r\nIt was terribly hot inside her, like you had walked into a gooey sauna. Organic groans and squelches echoed through her anal chamber, so loud that they could be heard even with your ears clogged with mucus. Even if it didn't taste bad, the whole experience was disgusting and you wanted out. You tried to pull yourself backwards, crawl in reverse through her hugging walls. Your movements only made her horny butt squeeze harder, pressing you down into her sticky crevices. Still you held on, and continued to go back the way you came.<br>\r\n<br>\r\nA blinding light filled your tunnel as Power Girl suddenly stuffed two of her fingers inside her ass. In a second all your progress was lost and you were pushed even deeper than when you started. The giant digits slammed you into her anal walls, and then started to fuck her rectum. SLAM! SLAM! SLAM! Each thrust sent powerful shockwaves through her ass, causing the muscles within to tighten with pleasure.<br>\r\n<br>\r\n\"Do you have any idea what it's like for a girl like me?\" You heard her pant erotically as she spoke. \"I can't stick anything up there without it being <i>crushed</i>! Oh God! But you... You feel <i>amazing</i>!\"<br>\r\n<br>\r\nYou started to understand why she <i>really</i> tested her grip on you before. For Power Girl, anything that she tried to fuck would get destroyed instantly. Even if she tried to shove a rod of steel up her pussy or ass, it would become flat as paper with a single squeeze. She didn't have many options besides using other superheroes and you imagined most of them probably had an aversion to anal play. But then you came along... unable to be crushed, tiny, and organic. You were the perfect size to squirm around inside her butt, and you didn't have a single superpower to stop her. She must had been thinking about it from the moment she saw you, \"finally a tiny man, the exact size to wriggle around inside my ass!\" After all this time, to be so backed up with sexual urges, and to meet a person that matched her exact needs...<br>\r\n<br>\r\nA powerful blow struck your back from behind, interrupting your thoughts. Power Girl's fingers landed on top of you, holding your against her flesh. They wriggled around, pinching your sides and they examining your shape. Then, without any regard for your safety, the two digits started to rub back and forth, grinding your body into her anal walls. The lumpy hot meat steamrolled you without mercy. Hot grime filled your mouth and forced itself down your throat. You were having trouble sympathizing with her now, she was treating you like a toy! Her loud moans grew as she rubbed you against her bowels. The undulating tunnel squeezed down on her fingers and you, hugging you both with a feverish embrace.<br>\r\n<br>\r\nThis went on for several exhausting minutes, being used as a scrubber for the giant woman's poop chute. Her fingers were relentless, cramming your helpless body up and down, wiping you across every inch of her turd hole, from the walls to the ceiling. Finally they stopped, leaving you gasping for air, and practically drowning in slime. Her fingers didn't leave though, they stayed parked on top of you. Outside you heard her voice.<br>\r\n<br>\r\n\"That felt sooo good. I'm sorry, but you have no idea how long I've waited for this... Now, lick me with your tongue. I need to feel your tiny tongue lapping up my sweet juices!\"<br>\r\n<br>\r\nYou couldn't believe what you were hearing. After all that torture she wants you to lick the inside of her ass? Was she crazy?! This must be another part of her fetish, another secret kink that she would never have had the chance to explore otherwise. At this point though you had already well exceeded your limits of tolerance. You couldn't take another second of being used as her anal sex toy! Even if this was the one and only chance she had in her life, it wasn't fair to you! You writhed under her powerful fingers, trying to pull yourself back up. The massive tree trunks of flesh pushed back down, pinning you against the gruesome floor. You felt the pad of her giant index finger creep up your neck, prodding the back of your head. If you weren't going to lick her ass, she was going to make you.</span></div></div>",
            "created":1519608960,
            "id":2457721,
            "title":"Refuse to Climb Inside"
        },
        "111133":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Good red skirted Mary ",
                "Bad girl black dress Mary ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mary Marvel maybe?</span></div></span></div>",
            "created":1463461200,
            "id":2149722,
            "title":"Somebody else"
        },
        "1111333":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Harley Quinn",
                "Poison Ivy",
                "More Villains"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>          Maybe a villain has somehow infiltrated the hotel?</span></div></span></div>",
            "created":1463782380,
            "id":2151222,
            "title":"Other"
        },
        "11113331":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "She puts you in her mouth",
                "She sits on you ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>          You hear laughter. Absolutely deranged, joyful laughter. Laughter that sounds like only one person in the world is capable of- but somebody that it couldn't belong to. This was a \"heroines only\" event, not even Harley Quinn is insane enough to break into a hotel full of people who could kick her ass into next week. Right?<br>\r\n          Wrong. The door swung open (you assumed the lock had been picked) and there she was, in all her disheveled glory, looking as bat-shit crazy as ever. <i>What the hell is she doing here?</i> You wonder. Hoping she hasn't seen you, you cower behind the bed. Maybe if she doesn't notice anybody in the room she'll just leave. You consider calling out for help, but decide that Harley would get to you before anybody else got to her. As you considered your options, you felt a shadow grow over your body.<br>\r\n          \"Well I'll be damned, Mista J wasn't lying!\" Her voice boomed like an announcer at a football game. \"Look at ya, you're teeny! Itty bitty! You're no bigger than my little finger!\" Fear gripped you. She had clearly spotted you, but it got worse. What was The Joker not lying about? Were the two of them behind this?<br>\r\n          \"But, I...\" You stammer as the giantess sits down on the bed above you. \"The government... the experiment...\" This elicits a joyful hoot from the villainess.<br>\r\n          \"The government! Oh sweet-cheeks, you're too much! You really are! Government my round ass!\" She laughs. \"They had nothin' to do with this! Jack shit! <i>I</i> made that recordin' to be sure you didn't run away before we got a chance to play together!\"<br>\r\n          This was bad. This was very bad. You tried not to panic as you spoke. \"But... why would you want to-\" <br>\r\n          \"Oh, you and I are gonna have so much fun together!\" She interrupted with a voice akin to that of a child on Christmas. Her giant hand swiped you up, despite your attempt to run away. She brought you up to her face, her ruby red lips parting to reveal her smiling maw. Her eyes glimmered with malice as she asked, \"What should we do first?\"</span></div></div>",
            "created":1463783280,
            "id":2151234,
            "title":"Harley Quinn"
        },
        "111133312":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Crushed under Harley's butt",
                "A heroine comes to your rescue"
            ],
            "content":"<div class=\"\"><div> <span>          \"Wait!\" She said so quickly after her question that it almost sounded like she interrupted herself. \"Don't answer that, don't answer that. I got it!\" She laughed again as she skipped across the room. Her arms bounced at her sides as she did so, jarring you to the point of nausea. You couldn't see where she was headed, but you prayed she would get there soon; you didn't know how much more of this roller coaster you could handle.<br>\r\n          After what seemed like ages, she came to a stop, raising you up to her face once again. You try looking around to take in your surroundings, but her hand around you blocks off your vision of anything below the upper part of the walls. You were sure you would find out soon enough anyway.<br>\r\n          \"I got a present for ya, little guy.\" She smiled shyly. You knew better than to ever believe somebody as psychotic as Harley would truly feel shy, no doubt she was feigning the emotion for dramatic effect. \"A pretty big present. At least that's what Mista J always says. You can decide for yourself.\"<br>\r\n          Your stomach rises to your mouth as you feel her hand release you. You try to scream as you begin free falling, but no sound comes out.<br>\r\n<br>\r\n<i><b><div align=\"center\">thud.</div></b></i><br>\r\n<br>\r\n          Your body collides with a cushioned surface, but that doesn't keep it from hurting. You feel the air shoot out of your lungs, and you gasp as you struggle to inhale. Catching your breath, you sit up and examine your body. Nothing seems to be broken, you simply had the wind knocked out of you.<br>\r\n          \"Oh jeezus, sorry about that!\" Harley exclaims. \"I forgot a foot or two would feel like twenty to ya. You forgive me, right babe?\" She laughs. Somehow you don't believe she actually forgot. <br>\r\n          You look at the ground beneath you before surveying the space around you. After a moment of confusion, you realize you are sitting on the middle of a cushioned love-seat. Why the hell not? Harley has done stranger things. Or so you thought, until you looked back at her.<br>\r\n          The jester was facing away from you, shimmying out of her skin-tight spandex. Her buttocks, now clad only in a skimpy red thong, jiggled as they were released from their prison. She sighed, stretched, and spanked her right asscheek, hard. A ripple traveled through her ample ass, and you couldn't help but feel aroused.<br>\r\n          \"Tah-dah! Hope ya like it.\" She wiggles her hips. \"Oh! Almost forgot. Ya agree with Mista J? Pretty big, right?\" Your arousal quickly turned to confusion, which quickly turned to fear. If her ass was her present for you, then that meant..</span></div></div>",
            "created":1463783460,
            "id":2151235,
            "title":"She sits on you "
        },
        "1111333121":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Harley's reward- she lets you go ",
                "Harley's \"reward\"- anal vore"
            ],
            "content":"<div class=\"\"><div> <span>          The last thing you saw as Harley squatted to sit was that giant, pale ass, swallowing the thong between it's cheeks. You could feel the heat radiating off of it, and you just barely had time to raise your hands in defense. Like that would actually help. Her asscheeks smashed down on either side of your body, and you felt your body press up against the fabric of her thong. Hot, spongy flesh surrounded your tiny body- you were directly under her ass crack. You supposed this beat the alternative of being crushed to a pulp by one of her cheeks, but not by much.<br>\r\n          \"Hahaha!\" Harley laughed obnoxiously. \"Great positioning on my part! What can I say, this ain't my first rodeo!\" You were confused for a moment, thinking she meant she had sat on tiny people before. You realized, however, that she was making an anal sex joke. Classic Harley Quinn.<br>\r\n          The jester shook her ass around, gyrating from side to side and causing your already uncomfortable placement to become even worse. Her asscheeks pushed, squeezed, rubbed, and chafed against your body, which only seemed to encourage her more.<br>\r\n          \"Mmmm, this feels pretty good!\" She laughs. \"We should do this more often!\" Her perky voice pisses you off, and you thrash wildly in an attempt to escape. You punch and kick at the ass flesh around you, which absorbs your blows like a sponge would water. Harley notices, but is not affected the way you were hoping for.<br>\r\n          \"Oh fuck! You know how to show a girl a good time, don't ya?\" She sensually grinds her ass into the chair, in turn grinding you farther into her ass crack. \"Keep that up, and I might just have a reward for ya!\"<br>\r\n          Desperate to escape from the evil jester's ass, you squirm wildly, and hear her gasp. You push your body in every direction you can. You push against her asscheeks, against the thong blocking you from her anus, and everything else in reach. You can feel Harley's ass heating up from arousal, and this does nothing to ease your discomfort. This goes on for what feels like ages, until finally Harley speaks.</span></div></div>",
            "created":1463783700,
            "id":2151237,
            "title":"Crushed under Harley's butt"
        },
        "11113331212":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "She wants you deeper",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>          \"Wooooowee!\" Harley gasps. \"A girl could get used to that!\" She is still bucking her ass as she speaks.<br>\r\n          \"Please Harley, just let me out.\" You beg.<br>\r\n          \"Sweetie, maybe you can't feel how deep you are into my ass crack right now, but I sure can. You're gonna have to speak up a bit.\" She giggles.<br>\r\n          \"LET ME OUT!\" You scream.<br>\r\n          Harley abruptly stops gyrating her hips. \"Hmm...\" She sounds deep in thought. \"Nah. I'll let you in though.\" She bursts into laughter as you pray that you're misunderstanding her joke. You feel her giant ass lift off of you as she stands up, and you sigh enough relief as you feel the cool air wash over your body. In a sinister repeat of before, Harley is shimmying out of her thong. She pauses when the band is half way down her cheeks, and sensually pulls it against her ass as she moves her hips in a wide circle. <br>\r\n          \"Like what you see babe? Ah, why even ask. You like it. Not as much as it's gonna like you though.\" She laughs again, pleased by her joke.<br>\r\n          \"Harley, what are you talking about?\" Fear grips you. \"What do you mean 'it's gonna like me'?\" She steps out of her thong and turns to face you before answering.<br>\r\n          \"Jeezus, so impatient. Take some time to appreciate the experience, would ya?\" Her giant hand snatches your body up. You don't even bother trying to run this time. You're at her mercy, and you know it.<br>\r\n          \"For God's sake you crazy bitch, just answer my question!\" As soon as you say the words you regret them for fear that they'll anger her. Harley seems completely un-phased, however. Figures.<br>\r\n          \"Hmm... Nah.\" She says in a fashion identical to before. \"I'll show ya though!\" Before you can say anything, her hand turns into a rollercoaster as she swings you around to her backside. She bends over low, arching her back and wiggling her hips. You see her pale cheeks spread to reveal a pink, puckered anus. She readjusts her grip on your body so that she is holding you at the waist with the tip of two fingers. Not good. Her hand starts moving you closer to her anus.<br>\r\n          \"Harley, stop! STOP! PLEASE!\" You beg the jester to release you.<br>\r\n          \"Sorry, babe. But you got a date with my butthole!\" She laughs once again at her own crude humor. As your face makes contact with her anus, you scream in disgust. She stops pushing, and flexes her anus. You feel it massaging your scalp as the muscles work like a pulsating maw, waiting to devour you.<br>\r\n          \"Harley, plea-\" Your words are cut short as she shoves you violently forward. You feel her hole open up and slurp in your head and shoulders. The ring of muscles contracts around your chest, making it difficult to breath. Your head has entered a slimy, hot tube, and you can hear her elevated heartbeat reverberating around you.<br>\r\n          \"Jeezus, shut up already!\" Harley gasps. \"Can't ya see I'm tryin to enjoy myself?\" She gasps as she pushes on your feet, forcing you into her anus up to your waist. You scream, and the sound echoes down her colon and is thrown back at you. You can feel her anal muscles working, pulling you in further. Her asshole slides over your waist, and you shudder involuntarily as it passes over your groin. Harley half laughs, half moans.<br>\r\n          \"I felt that. Glad to see we're both enjoyin' ourselves.\" She gasps as her anus puckers, taking you in up to your knees. 'Look at that.\" Harley laughs. \"Just a little bit to go and you're all mine. I love it. Welcome home, babe\" You feel her finger press against your feet, sliding you further into her colon. The slimy walls pulse as your feet enter her ass, along with her finger. Quickly, Harley pulls her finger pack, and her anus quickly seals behind it.<br>\r\n         \"Holy wow!\" Harley explains in her idiosyncratic, psychotic way. \"You feel like a million bucks in there!\" She wiggles her ass from side to side and gives it a slap. You hear the sound, but are not jarred from the impact, as her anal walls are holding you firmly in place.</span></div></div>",
            "created":1463783820,
            "id":2151238,
            "title":"Harley's \"reward\"- anal vore"
        },
        "111133313":{
            "author_id":"thehobbit101",
            "author_name":"Bilbo Baggins",
            "choices":[
                "pleasure me\" (she puts you in her vagina)",
                "be my insole\" (she puts you in her shoe)"
            ],
            "content":"<div class=\"\"><div> <span>You continue to look at the giantess jester as she thinks of ways to have \"fun\" with you, whatever it might be you're probably not going to like it. After a minute or two Harley thinks of an idea and once again looks at you with a smile. \"I know what to do with you\" says Harley, \"you can....</span></div></div>",
            "created":1471693320,
            "id":2198561,
            "title":"Other ideas"
        },
        "11113333":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Giganta ",
                "Cheetah",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Giganta or maybe Wonder Woman's arch-enemy Cheetah?</span></div></span></div>",
            "created":1463782680,
            "id":2151223,
            "title":"More Villains"
        },
        "12":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "You wake up shrunken"
            ],
            "content":"<div class=\"\"><div> <span>          ... and completely bad-ass girls from the Marvel universe. Ms Marvel. Spider-Woman. She-Hulk. And so many others. You read online that over 100 heroines would be at the convention. 100! You didn't even know that many heroines existed! You had a feeling the week that followed would be the absolute best of your life.<br>\r\n<br>\r\n<br>\r\n<div align=\"center\">***</div><br>\r\n<br>\r\n<br>\r\n          Three days later, your taxi had just arrived in front of the hotel. A beautiful building, fit to host such beautiful women. You grabbed your suitcase from the trunk and proceeded inside. The heroines would not arrive until a few hours after you, you had been informed. A private escort lead you to your room, which was even larger and more elegant than you had hoped. You tipped the man, and looked around the room, taking in your surroundings.<br>\r\n          A king sized mattress with silk sheets dominated the center of the room. A nightside with a beautiful lamp was directly to the left of the bed, and on the right side of the room was your own private mini-bar. You proceed to the bar, and find a small, exotic bottle sitting on it.<br>\r\n          \"Complementary.\" Read the note placed in front of the bottle. Deciding alcohol would be a good idea to ease your nerves (you do not want to make an ass of yourself in front of the heroines), you open the bottle and take a decent sized swig. It tastes rich, warm; it tastes the way a good alcohol should. And something more. Your head becomes groggy, and you laugh giddily before your vision fades to black.</span></div></div>",
            "created":1463461200,
            "id":2149504,
            "title":"Marvel Universe"
        },
        "121":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "There is a knock at the door ",
                "You go out and look for help"
            ],
            "content":"<div class=\"\"><div> <span>          You're drunk. That's the first thing that crosses your mind when you come to. No, you're hallucinating. Despite the fact that you feel completely sober, you must be. You must be. The bar, the bed, the nightstand, everything... everything was huge. Absolutely, terrifyingly, huge. You were sitting on the carpeted floor, no bigger than an inch and a half tall, if you were being generous. You must be hallucinating.<br>\r\n          You close your eyes and shake your head, hoping to snap out of whatever dream state you were in. It doesn't help. Just as you're about to start panicking, an intercom turns on, and a recorded voice speaks.<br>\r\n<br>\r\n          \"(your name here), you are not dreaming. This is not a trick. Please remain calm. You have been selected for a highly classified experiment. The bottle you drank from is called 'Micro-Brew,' and it has reduced the size of your body. Please do not panic, the effects will wear off at the end of the week. We are conducting an experiment to see how the heroines will react to your condition. You will be compensated for any discomfort you may experience. Thank-you for your cooperation, and have a 'super' week.<br>\r\n<br>\r\n<b>WHAT. THE. FUCK.</b><br>\r\n          You didn't care what the voice on the intercom said, you were panicking. A fucking experiment!? The government had lied to you! Taken advantage of you! You couldn't believe any of this. The only positive side was that the heroines weren't a lie. The heroines. Of course. Maybe somebody could help you!</span></div></div>",
            "created":1463461200,
            "id":2149510,
            "title":"You wake up shrunken"
        },
        "1211":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "She-Hulk",
                "Tigra",
                "Sue Storm"
            ],
            "content":"<div class=\"\"><div> <span>          You stand up and pace, considering your options. Going out into the hallway could be dangerous. What if somebody stepped on you? Granted, it was unlikely that a super-heroine would be daft enough to miss you, but it was at least a possibility. On the other hand, staying put could mean waiting hours for somebody to find you. After all, how often do heroines just come knocking on somebody's door?<br>\r\n          Ironically, the knock came almost simultaneously with the thought. Who is at the door?</span></div></div>",
            "created":1463711100,
            "id":2150793,
            "title":"There is a knock at the door "
        },
        "12111":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Yell and scream to get the green lady's attention ",
                "Start climbing those monstrous thighs boy!"
            ],
            "content":"<div class=\"\"><div> <span>There at the door standing nearly a thousand feet tall from your P.O.V. anyway was the sexy lean green machine herself the She-Hulk with her bulging muscular body and purple outfit normally this would be the time to scream and jump up and down as next to the Amazing Amazon herself the Incredible Hulk's female counterpart and cousin was your second favorite superheroine but at your tiny state you doubted you could reached her pinkie toe she was busy looking around in awe and bewilderment \"Er hello is anyone here? I was told by a mysterious person that there was to be some type of contest with a shrunken person or something of that nature....grrrrrrrr no answer well in that case I guess She-Hulk will have to smash up the whole room until someone shows themselves!\" At the word 'smashing' you knew you were in deep trouble even at your shrunken state there was the slim chance that you might wind up seriously crushed,squashed or worse along with the rest of the room possibly the whole building so you started to </span></div></div>",
            "created":1463712000,
            "id":2150799,
            "title":"She-Hulk"
        },
        "121111":{
            "author_id":"minecrafter",
            "author_name":"Newcomer",
            "choices":[
                "Vagina",
                "Asshole"
            ],
            "content":"<div class=\"\"><div> <span>You jumped up and down, waving your arms and yelling at the top of your head to try and get the jade giantess's attention. You almost thought it didn't work, as the green titaness stepped into the room, but she quickly walked over to you, gently picking you up and placing you on the palm of her hand. She sat on your bed, bringing you to her face and looking you over with a grin on her face.<br>\r\n<br>\r\n\"Thought that'd draw you out. I saw you skulking down there; didn't know you'd be a super, like me. You're obviously not the Wasp, and I'm pretty sure you're not Pym or Scott. Just who are you, little man?\" she asked, poking your body and nearly knocking you on your back, \"oops,\" she said, apologetically, before going back to examining you.<br>\r\n<br>\r\nYou quickly explained what had happened; that you weren't a superhero (or villain), and that you had drunk a bottle of alcohol that caused you to shrink down to your diminutive size. She listened with rapt attention to your story, nodding along.<br>\r\n<br>\r\n\"I see. That's very strange, little guy. Luckily, I know an expert on shrinky dinky stuff like this. It'd be a synch for him to fix you up, if this doesn't wear off.\" <br>\r\n<br>\r\nAt that, you breathe a sigh of relief. You wouldn't be ground under someone's sole, or sat on until you were a smear on some heroine's ass; instead, you were in the company of She-Hulk, one of the strongest- and hottest- heroes there is.<br>\r\n<br>\r\n\"Now... it'd be a shame to waste this. Want to have some fun while you're small enough to... 'spelunk?'\" She-Hulk asked, grinning at you. You blushed, stammering, while she merely reclined onto your bed, dropping you onto her abs. \"C'mon, I've always wanted to know what it's like to get it on with a shrunken guy, and I KNOW you want a piece of this. Why not take advantage of the moment, and have some fun?\"<br>\r\n<br>\r\nA compelling argument. It was true; you DID want to sleep with She-Hulk. But you'd prefer to be at a size that wasn't so... diminutive. Still, beggars can't be choosers, and you vigorously nod your head at the giant. She chuckles at this, sending you sprawling as the landscape under you moves, and she grabs you before you go over the side. \"How about we get warmed up with a little oral action?\" she asks, bringing you to her lips. You gulp, nervously, realizing that she could easily swallow you whole, or chew you to bits. But you trusted her not to do that, and you tentatively stepped forward, touching her soft, green lips with your hands, before pressing your entire body into them. She chuckles, eyeing you mischievously, before opening her mouth and quickly scooping you inside of her hot, stuffy mouth. It was like a sauna in there; the air thick with moisture as you slid around on her tongue, the strong organ moving you around her mouth as you were drenched head to toe in her saliva. Eventually, she opened her mouth, letting cold air fill her mouth as you lay panting on her tongue. She hummed thoughtfully, before standing up, closing you off from the outside world once more. Small movements sent you sliding on her tongue, but she no longer played with you; evidently, she was doing something that required her attention. Suddenly, her mouth opened once more; this time, instead of your room, her mouth opened up to reveal that she was looking down at her hot, naked, green body! You slid out of her mouth, falling between her breasts; she squeezed the two massive orbs together as you fell between them, giving you an almost massage like sensation as the two orbs of fat compressed your body. Finally, she released them, allowing you to continue your descent down her body, passing over her abs and stomach, before you came to rest at her crotch. \"Mmm,\" she said, moaning, \"I'll let you decide what happens next.\"<br>\r\n<br>\r\nYou briefly wonder what she means by this, when the giantess spreads her legs, sitting at an angle; giving you a view of both her tight, amazing looking pussy, and her wrinkled asshole. Both holes were tempting, but for now you'd have to pick one to get familiar with.</span></div></div>",
            "created":1471676820,
            "id":2198503,
            "title":"Yell and scream to get the green lady's att..."
        },
        "12113":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Sue doesn't hear you and you're flattened under her butt cheeks ",
                "She hears you "
            ],
            "content":"<div class=\"\"><div> <span>          Before you make your decision, the door opens. What you see in the doorway makes you furrow your brow. You saw the wall behind the doorway. The door had been opened, but nobody was standing there. Your eyes went wide as the idea crossed your mind. <i>Could the door have been opened by an invisible heroine?</i> <br>\r\n          Your answer came just as you finished climbing the love-seat in the corner, hoping to make yourself visible to whoever was in the room. The woman materialized from the feet up. Long, shapely legs clad in skin-tight deep blue. Wide hips, sticking out to one side for the effect of a dramatic entrance. A tiny waist, leading to perky C-cup breasts which stretched the \"4\" on the fabric covering them. Ruby red lips, big blue eyes, and long blonde hair. Sue Storm! You almost couldn't believe your eyes.<br>\r\n          \"Umm...\" She scanned the room, confused. \"I'm the only person who can turn invisible in this room... right?\" Sue joked as her beautiful eyes glanced around the hotel room. \"I, uh...\" Sue started before trailing off, clearly feeling strange about speaking to what could be nobody. The guy at the front desk said this is the room of the guy who won the trip to come meet us. 315, yeah? He said you would be here...\" Sue walked over to the mini-bar as she spoke, and you held your breath as you watched her sexy backside stretch the fabric of her suit as she bent over to retrieve the card you dropped when you shrunk.  <br>\r\n          She tapped her foot in confusion as she read the card, which felt to you like an earthquake. You were on the chair, wanting to call out to her, but wanting to continue admiring her flawless body more. You chose the latter.<br>\r\n          \"Okay, thats' weird.\" Invisible Woman announced to nobody in particular. She set the card on the bar, and started walking towards you. Had she seen you? Obviously not, because she turned around, making your heart skip a beat as you had the chance to admire her ass a second time. What an ass. You watched in unforgivingly stretch the fabric as she squatted a second time. Her backside really was enormous. So enormous, in fact, that it made you fail to put together the rather obvious and rather dangerous situation you were in until it was too late. Sue was sitting down on the chair. <br>\r\n          \"Hey!\" You had finally found your voice. \"Mrs. Storm, Wait!\" </span></div></div>",
            "created":1463714940,
            "id":2150815,
            "title":"Sue Storm"
        },
        "1212":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Spider-Girl",
                "Ms Marvel",
                "More heroines"
            ],
            "content":"<div class=\"\"><div> <span>          Taking your fate into your own hands, you start across the floor, heading for the door. You've decided you'll go out and find somebody, anybody, who can help you. Maybe Ms Marvel? You didn't overly care who, you just wanted to find someone you could feel safe with, and who better for that than a crime fighting superhuman do-gooder?<br>\r\n          You are able to slip underneath the crack of your door, fortunately. There's no way in hell you could have made it to the doorknob. The setting sun coming in through the beautiful window across from you tells you that you were unconscious for a few hours- at least some of the heroines should be here by now. Another blessing. You turn to your right, further down the hallway, and start walking. You decide you'll slip under the first door you pass, and see if anyone is in. Hopefully your luck continues.<br>\r\n<br>\r\nWhose room do you enter?</span></div></div>",
            "created":1463461200,
            "id":2149543,
            "title":"You go out and look for help"
        },
        "12121":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Get Spider-Girl's Attention",
                "Stay Hidden"
            ],
            "content":"<div class=\"\"><div> <span>          You enter the room, and look around. nobody seems to be in yet. Fuck. Just as you are prepared to leave, you hear laughter in the hallway that seems to be heading your way. You realize in a panic that you are standing in the worst possible spot should the door open, and you quickly scamped over to the nightstand. You can't explain why, but you hide underneath it. Maybe you would just feel better if whoever was approaching <i>didn't</i> see a tiny intruder in their room as soon as they came in. <br>\r\n          The door swings open just as you slide to a halt behind the leg of the nightstand. You peak around the corner, and see the impossibly beautiful May Parker coming through the door frame, still laughing from whatever she was discussing with her friends. She finished pulling her mask off just as she came into the room, and ruffled her short, dark-brown hair as she let out a sigh of relief. <br>\r\n          Throwing her mask onto the bed, she began stretching. Her body was the most beautiful one you had ever seen. Her long legs were toned with lean muscle, and connected to round hips, wide but incredibly fit. Her waist was barely over half the circumference of her shapely hips. Her perky breasts were a perfect size- round and protruding without being disproportional. Her figure alone was a super power. You held your breath as she reached to touch her toes, and you watched her perfect backside push against the back of her suit. It was impossibly round, made up of firm muscle and a thin layer of fat. It was the most perfect ass you had ever seen. <br>\r\n          You nearly gasped out loud as you saw her hand reach around to the zipper on the back of her suit. Slowly, her back became visible. The flesh was like marble, smooth and chiseled. She peeled her skin tight suit off of her hips, and had to shimmy her body to get it around her massive posterior. The spongy flesh of her ass jiggled as she squirmed out of the fabric, revealing a tiny red thong that disappeared between her beautiful cheeks. She bent over to guide her feet out of the bottom of her suit, and you couldn't help but gasp. The sight of her massive booty bent over in a thong was just too much.<br>\r\n          Suddenly, Spider-Girl whipped around, her perfect breasts bouncing in her bra. Apparently, she had heard you. Damn her Spider-senses. Terrified, you shrunk back underneath the nightstand, as you heard the now alert Spider-Girl stalking towards you.<br>\r\n          \"Who's there?\" She said as she approached your hiding place. You considered your options- you could answer her and risk the awkward scenario that would follow when she found out you were watching her strip. After all, you came here looking for help, none of this was really your fault. Or, you could stay hidden, and wait for her to become preoccupied and then make your escape to seek help from another heroine. You know, one you didn't just watch get naked.</span></div></div>",
            "created":1463461200,
            "id":2149547,
            "title":"Spider-Girl"
        },
        "121212":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "She catches you",
                "You sneak out"
            ],
            "content":"<div class=\"\"><div> <span>          You decided to stay hidden, as you didn't know how Spider-Girl would be able to help you anyway. You needed to find a scientist, not a vigilante. Eventually, May Parker lowered her guard, and plopped her shapely rear down onto the bed. Her long, slender legs hung down just in front of the nightstand, still enticingly bare, and dominating your vision. You noticed her toenails had been painted a light shade of pink, which struck you as odd for some reason. You had trouble picturing somebody as bad-ass as May taking the time to do something like paint her toenails.<br>\r\n          You watched, entranced, as she swung her legs onto the bed and sighed. \"Damn, what a day!\" She said out loud. This also struck you as odd. You figured she would have simply been traveling to the hotel all day. Had she been fighting crime? Being a super-heroine really was a full-time job, you supposed.<br>\r\n          And fighting crime she must have been, because she was snoring a light, cute snore in minutes. Part of you wanted to climb into bed with her, but you knew better. You knew <i>much</i> better. Anyway, now was the perfect time to make your escape. Holding your breath, you began to slink out from behind the nightstand, heading for the door.</span></div></div>",
            "created":1463461200,
            "id":2149553,
            "title":"Stay Hidden"
        },
        "1212121":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "She believes you",
                "She doesn't believe you"
            ],
            "content":"<div class=\"\"><div> <span>          As you crept, you risked a glance up to her giant, beautiful face. Her ruby red lips were parted slightly as she slept. This really was a beautiful woman, considering how dangerous she is. Your eyes drifted down from her face to her breasts, which were being pressed together from her sideways sleeping position. The twin mounds were stretching out of her bra, forming the most perfect cleavage you had ever seen. Part of you wanted to climb up and dive in, but you knew that would be an awful idea. How light of a sleeper can someone with Spider-Senses be? Still eyeing her marvelous cleavage, you took a step forward, continuing your escape. Your heart skipped a beat as you felt your foot catch on a fiber of the carpet, pitching your body forward.<br>\r\n          Just before you hit the ground, a giant hand clasps around your body, squeezing you. Spider-Girl sits up as she brings you in front of her face, intensely eyeing your tiny body.<br>\r\n          \"Well well, I knew I wasn't hearing things.\" Apparently, Spider-Girl had been pretending to sleep while she waited for the perpetrator to attempt an escape. You really should have known better. \"You've got some serious explaining to do. You can start with telling me why you watched me strip.\" Her eyes narrow as her grip around you tightens, making it difficult to breath. <br>\r\n          \"I... you gasp... I can explain! I'm the guy who won the trip to stay here, and it was all a trick! I need your help!\" You say before explaining the rest of your predicament (being extra careful with the wording when you got to the part about watching her undress).</span></div></div>",
            "created":1463461200,
            "id":2149555,
            "title":"She catches you"
        },
        "12121212":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "She sits on you ",
                "She eats you ",
                "She crushes you under her foot"
            ],
            "content":"<div class=\"\"><div> <span>          Spider-Girl looks thoughtful for a moment, then bursts into laughter. \"Let me get this straight.\" She says. \"The fucking <i>government</i> left out poison for you to drink, you woke up tiny and confused, and came here for my help?\" Her grip around your midsection tightens.<br>\r\n          \"I... Yes! I'm telling you, thats exact-\" She interrupted you before you could finish your sentence.<br>\r\n          \"And I'm supposed to believe that you watched me undress, waited for me to sleep, and tried to sneak out, yet you're just a victim? My Spider-Senses are telling me that you're a goddamn liar.\"<br>\r\n          \"May, wait! Please, I Promise!\" You try to plead with the angry giantess.<br>\r\n          \"Wait for what? You to think of a new lie? Fuck that. You know what I think? I think you're some kind of super villain who got a hold of Pym Particles, and you're using them to be a pervert. And you know what girls like me do to super villains? We make them <i>pay</i>.\" Her eyes light up in a terrifying way as she finishes her sentence. She looks more hungry than angry.<br>\r\n          \"What to do, what to do?\" Spider-Girl wonders aloud as she holds onto your tiny body.</span></div></div>",
            "created":1463461200,
            "id":2149591,
            "title":"She doesn't believe you"
        },
        "121212121":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Pushes you past her thong",
                "Farts on you ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>          \"Oh, I know! How obvious!\" She says excitedly as she throws you onto the bed. Before you knew it, she was standing menacingly over you, still wearing just a bra and thong. \"No doubt you were staring at my ass when I stretched, you little perv. How about a closer look?\" Spider-Girl suddenly turned around, and you saw her massive backside looming over you, devouring the thong that stretched over it.<br>\r\n          \"May, Wai-\" Before you could finish speaking, she plopped her ass down on you at lightning speed. You were suddenly surrounded by darkness and soft flesh, the smell was unbearable. You were fairly sure she had positioned her ass perfectly so that you ended up directly between her cheeks, as you could feel them squeezing you on either side. This was both a blessing and a curse, as either one of her massive cheeks would have probably crushed you to death, but the smell was much worse here.<br>\r\n          Spider-Girl laughed as she felt you squirming in her ass-crack. She grinded her booty into the bed, sending you further into her crack. <br>\r\n          \"There! Isn't this exactly what you wanted?\" She said menacingly.<br>\r\n          \"MMM!!\" You couldn't form any actual words, as her ass flesh was smothering your face. Apparently she took that as a yes, because she didn't move a muscle. Instead, she wiggled her ass around, sending you further into her crack all the while. Your body was pressed against her thong- the only thing separating you from her anus. Just a few minutes ago, you had been admiring the way her asscheeks swallowed her thong. Now, you were just as deep in them as the thong. <br>\r\n          \"Ahhh, just where I wanted you!\" Spider-Girl said as she felt you press against her thong. \"But you know, funny thing about me- whenever I get what I want, I only end up wanting more.\" She laughed. You were terrified by her tone, what the hell did she mean by that?<br>\r\n<br>\r\nYou were about to find out as Spider-Girl...</span></div></div>",
            "created":1463461200,
            "id":2149594,
            "title":"She sits on you "
        },
        "1212121211":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Pushes you all the way in",
                "Farts on you"
            ],
            "content":"<div class=\"\"><div> <span>          Spider-Girl laughed promiscuously as she felt you squirming between her spongy ass halves, trying to no avail to escape your prison. \"Hmmmm..\" May ran her hands across her hips as she thought. \"I'm not sure this is cutting it, you need to be punished more if you're gonna learn your lesson about being a pervert.\"<br>\r\n          You thrashed with more vigor than ever in the heroine's asscrack. You weren't sure what she meant by \"punished more,\" but the last thing you wanted was to find out. What could really be worse than this? Suddenly, Spider-Girl leaned forward, and you gasped for precious air. Her backside still had your lower body pinned, but for the first time you could see and breath properly.<br>\r\n          \"May, please! I swear I've learned my lesson.\" You try to plead with her, but she only laughs again.<br>\r\n          \"Maybe you have perv. But you know what? I think this is fun as hell. Fighting crime all day can be so stressful, it's nice to have something like this to unwind after a long day.\" The titaness said as she wiggled her ass on your lower body. Now that you could breath, it actually felt quit nice. You began admiring the way she rolled her marble-like flesh on your body. <br>\r\n          You watch her hand slide down the side of her curvy body, coming to a rest on her giant ass cheek. Her nimble fingers gripped the skimpy thong, and slowly pulled the band out of her asscheeks. Involuntarily, you became incredibly turned on as you watched the thong slipping out of her endless crack. She stretched the thong far enough that you could now see her naked backside, rolling seductively on your legs and waist.<br>\r\n          \"Woah there, you're not supposed to be enjoying yourself.\" Spider-Girl said as she felt your erection growing. \"Let's see if I can fix that.\" <br>\r\n          Before you could speak, you felt fabric press against the back of your head. You realized with terror that May had hooked her thong around the back of your body, all she had to do was let go of it and the stretchy fabric would pull you into her ass with it, only this time you would be on the inside of her thong.<br>\r\n          \"May, wait... What are you...\" WHAM! Your sentence was cut short as your body flew forward, disappearing deep into her crack as the thong snapped back into position. The thong was extremely tight around her giant ass, and held you pinned to the inside of her crack so tightly that you could barely even squirm. You were surrounded by heat, and could feel sweat from her ass moisturizing your body.<br>\r\n          \"Mmmm, much better.\" Spider-Girl teased as she began gyrating her hips against the bed, rubbing you against her crack. She grabbed the thong straps that rested on the top of her ass cheeks, and pulled aggressively. You felt the thong push harder against your body, sliding your forward as far as you could go. <br>\r\n          Despite attempting to resist, your body slams into Spider-Girl's anus. It is bigger than your entire body- big enough to swallow you whole. It puckers as she uses the thong to grind you against it, threatening to take you in. You try to find anything to grab on to, but a combination of her slippery sweat and the pressure exerted from her thong make it impossible to latch on to anything. Spider-Girl moans as she feels your body being dominated by her ass- she knows how helpless you are.<br>\r\n          \"I'll bet your not enjoying yourself anymore, huh?\" She says coyly. \"I like this punishment much better.\" As she speaks, you feel her puckered hole flair out and grab on to your leg, hungrily pulling it inside of her. She gasps as you try to scream, but all that comes out is a muffled \"MMPPPHH!\" Her anus pulls more of your leg into it, and all you can do is watch in horror as you knee slides into her orifice. You were in hell.<br>\r\n          Spider-Girl grabbed her shapely breasts and gave them a squeeze, adding to the pleasure of feeling your helpless body being eaten by her backside. You wanted to use your arms to try and pry your leg out, but you were terrified that her anus would only swallow those as well. <br>\r\n          Suddenly, Spider-Girl...</span></div></div>",
            "created":1463461200,
            "id":2149597,
            "title":"Pushes you past her thong"
        },
        "12121212111":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "3...2...1",
                "Somebody comes to your rescue"
            ],
            "content":"<div class=\"\"><div> <span>          Spider-Girl's sphincter was slowly but surely taking in more and more of your leg as you struggled for freedom. Her ass sweat made it impossible to gain any sort of traction and her spongy cheeks held your body firmly in place, but that didn't stop you from trying.<br>\r\n          \"May, for the love of god, please let me go!\" You managed to yell between mouthfuls of ass flesh. Before she answered, she giggled, wiggling her rear from side to side. You heard a loud smack, and her cheeks jiggled violently, nearly causing you to fall face first into her asshole. You gathered that she had smacked her ass at your request. Not exactly a promising response.<br>\r\n          \"I've got a better idea.\" Spider-Girl said playfully. \"How about I see how deep into my ass you can get before I can't hear your screams anymore?\" Her voice sounded so erotic that she almost made it sound appealing. almost.<br>\r\n          \"What the fuck?!\" You yell. \"Anything but that! I'm begging you!\"<br>\r\n          \"hmm... alright.\" Your spirits sore as you begin to think that you've changed her mind. \"How about we see how far I have to shove you in my ass before I can't even feel you anymore?\" She laughed as your heart sank. \"Either way, you're going up my backside. It would be downright cruel to deny it it's meal after you've already gotten your leg sucked up!\" Clearly, Spider-Girl was loving this. How could she be so cruel? Despite your pleas, she responded only with playful, lusty jests.<br>\r\n          You felt her finger press on the middle of your back, slowly easing you towards her puckered hole. No matter how much you struggled, she was too strong for you. You nearly vomit as you feel your face collide with her slimy hole, and she moans erotically.<br>\r\n          \"Just where I wanted you. God this feels amazing.\" She grinded her finger up and down, rubbing your body against her hole. The stimulation from your body caused her anus to pucker even more. All she had to do was push and you would be lost forever.<br>\r\n          \"MMMM\" Spider-Girl moaned. \"I think we need to savor this moment with a count down. Will you do the honors, or should I?\"<br>\r\n          \"GOH TEH 'ELL!\" You were trying to yell \"go to hell,\" but the constant pressure from the flesh of her sphincter distorted your words.<br>\r\n          \"Somebody's grumpy!\" She mocked you. \"Not to worry, you'll have a lot of time to think about your attitude when you're deep in my ass.\" Her voice is laced with lust. \"Now without further ado! 10...9...\" She sounds like a child on Christmas as she speaks, barely able to control her excitement. \"8...7... Better take a deep breath! 6...5...\"</span></div></div>",
            "created":1463461200,
            "id":2149601,
            "title":"Pushes you all the way in"
        },
        "121212121111":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "She's satisfied",
                "She uses a dildo to push you deeper"
            ],
            "content":"<div class=\"\"><div> <span>          \"3...2...\" Spider-Girl's voice was a strained gasp at this point. She was almost too turned on to finish counting. She paused after 2, breathing heavily as she savored the moment. You were pinned against her puckered sphincter, and a mere second away from disappearing entirely from the outside world. Just before you could try to talk her out of it again, she continued.<br>\r\n          \"ONE!\" Spider-Girl was barely able to moan out the last letter, as the second it left her mouth, her finger shot forward. Fast enough that you barely even felt your body get crushed against her hole before it opened wide, swallowing your body and the length of her finger in an instant. You shot down a slimy tunnel, being driven further and further into her rectum by her finger.<br>\r\n          \"Oh my god... YES!\" Spider-Girl moaned as she felt her anus swallow your body along with her finger. She could feel her sphincter pinching the bottom of her finger, trying to take in more. Furthermore, she could feel your body squirming desperately at the tip of her finger, deep in her ass. \"Keep squirming!\" She commanded as she rocked her hips.<br>\r\n          Millimeter by millimeter she withdrew her finger, and you watched in horror as your last connection to the outside world slipped out of her anus, the voracious hole sealing instantly behind it. You scream in horror as you feel the walls of her anus contracting on your body.<br>\r\n          \"Hey! I heard that!\" Spider-Girl laughed. \"Guess that means you need to go deeper!\" No sooner had she finished speaking than she flexed her powerful anal muscles. You feel the walls tighten around your body, pulling you ever deeper into her intestines. You can feel her heartbeat in the slimy walls around you, and it gets quicker and quicker the further you go. Spider-Girl is in heaven, you are in hell. She gyrates her ass as it pulls you past the point of no return into its depths.<br>\r\n          \"Keep squirming!\" She gasps. \"You're going to keep going deeper until I can't feel it anymore! God, this feels amazing.\" Her voice rumbles throughout your environment- you are hearing it internally. Despite knowing there's no way you can overpower her anus and escape back out the tunnel, your instincts won't allow you to stop struggling. However, the more you struggle, the faster her heartbeat gets, and the faster you slide deeper into her. You must be getting close to a full foot from her anus at this point.<br>\r\n          Spider-Girl moans as she feels you sliding further and further into her rectum. She knows she couldn't get you out even if she tried at this point, and the thought turned her on even more.</span></div></div>",
            "created":1463461200,
            "id":2149604,
            "title":"3...2...1"
        },
        "12122":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "Carol Danvers",
                "Kamala Khan"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it Carol Danvers: <a rel=\"nofollow\" href=\"https://i.annihil.us/u/prod/marvel//universe3zx/images/b/ba/MsMarvel%28Danvers%29_Head.jpg\" target=\"_blank\">https://i.annihil.us/u/prod/marvel//univ...</a> or Kamala Khan? (<a rel=\"nofollow\" href=\"https://thirtyeightminutes.files.wordpress.com/2014/07/marvel.jpg\" target=\"_blank\">https://thirtyeightminutes.files.wordpre...</a>) </span></div></span></div>",
            "created":1463634000,
            "id":2150746,
            "title":"Ms Marvel"
        },
        "121221":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "She noticed you come in",
                "She doesn't notice you"
            ],
            "content":"<div class=\"\"><div> <span>          The first door you come to has a \"do not disturb\" sign hung from the brass door-knob. This gives you pause, you don't want to openly defy the wishes of whomever this room belongs you. However, you really didn't have much of a choice. Being out in the open like this made you feel exceedingly exposed, and you were still in dire need of help. Besides, helping people is what heroines <i>did.</i> Even when it wasn't convenient for them.<br>\r\n          You slip under the door like you did your own, and see a room that looks similar to yours- complete with the nightstand and mini-bar. No \"Micro-Brew,\" however. Figures. There was something, however, this room had that your's did not. That \"something\" was the breathtakingly beautiful Carol Danvers. Ms Marvel. She was sitting at her desk, slaving over something. Wasn't she always. Her prominent brow was furrowed as she chewed her bottom lip, studying what seemed to be an astrological chart of some variety.<br>\r\n          She was in costume. This didn't surprise you. Ultimately, the heroines were here on your behalf, and dressing in civilian clothes would have been detrimental to the experience. Her long, blonde hair hung over her shoulders and breasts. Her breasts. Perfect spheres that dominated her chest, clad in skin tight black Whatever the Hell her suit was made out of. Your eyes followed traced the angular outline of her slender, toned waist down to her thigh. Smooth, marble-like flesh rippled with muscle, flexing and relaxing rhythmically as she focused- apparently a quirk of hers. The woman's ski-high boots ended just above the knee in a beautiful golden stripe.<br>\r\n          Her toned shoulders were reflecting the sunlight coming in through the window, making them glow. Her frame was broad, but elegant. Prominent, yet feminine. </span></div></div>",
            "created":1463714100,
            "id":2150812,
            "title":"Carol Danvers"
        },
        "1212212":{
            "author_id":"spartantag",
            "author_name":"Spartantag",
            "choices":[
                "She steps on you ",
                "You dodge her foot"
            ],
            "content":"<div class=\"\"><div> <span>          If she had registered your presence at all, she wasn't phased by it. More than likely, she was too focused to notice your entrance. You consider calling out to her, but can't find your voice. Instead, you take a slow step towards her, gaining confidence and walking faster when you don't fall through the floor. Your approach to the massive beauty takes ages, you're too small for your legs to cover any significant ground.<br>\r\n          You were halfway to her when it happened. A sudden, exasperated sigh escaped from the woman as she violently swiped the chart from her desk. Her chair shot backwards as her powerful leg muscles tensed to stand up. She really was a tall woman, even compared to a person of normal size. Her hips swayed as she walked despite her stormy demeanor. The upper portion of her long legs rubbed together as she stepped. God, she was sexy. <br>\r\n          So sexy that it too you too long to realize she was headed for the door. She was headed for <i>you,</i> and she still hadn't seen you. This was bad. This was very bad. If she stepped on you, you would almost certainly be killed- her foot was like a semi-truck compared to your body. Worst of all, you had no time to run. Sure, you could try, but you just wouldn't reach the door before her. Not with those strides she was taking. <br>\r\n          With your heart racing, you watched the beautiful legs grow closer and closer, preparing to dodge her feet should need arise. The pristine woman was nearly to you, and you held your breath to aid in focusing. You were so filled with adrenaline that calling out to her never even occurred to you.</span></div></div>",
            "created":1463715060,
            "id":2150816,
            "title":"She doesn't notice you"
        },
        "12123":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Someone from the Avengers ",
                "Someone from the X-Men",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But who to choose from there are so many Marvel heroines! </span></div></span></div>",
            "created":1463461200,
            "id":2149724,
            "title":"More heroines"
        },
        "121232":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Jean Grey of course!",
                "Nah Rogue's even better!",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Since there are so many X-Gals I'll start with the basic ones everyone's familiar with first of all will it be the stunning,beautiful telepath\telekinetic yet  deadly cosmic red hair Jean Grey aka Phoenix or the southern sweet belle with the deadly memory/power absorbing touch Rogue or more?</span></div></div>",
            "created":1463461200,
            "id":2149751,
            "title":"Someone from the X-Men"
        }
    },
    "info":{
        "author_id":"spartantag",
        "author_name":"Spartantag",
        "brief_description":"The title says it all.",
        "created":1463511420,
        "description":"<td align=\"left\" class=\"norm\">Anything goes here, except for bad chapters. Everybody is encouraged to contribute, but please, do so thoughtfully.<br>\r\n<br>\r\n<b>ENCOURAGED:</b><br>\r\nAnal Vore<br>\r\nButt-Crushing<br>\r\nVore<br>\r\nStaying in character<br>\r\n<br>\r\n<b>DISCOURAGED:</b><br>\r\nOne sentence chapters</td>",
        "id":2084579,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1519608960,
        "modified":1519608960,
        "pretty_title":"Shrinking With Comic-Book Girls"
    }
}