{
    "chapters":{
        "1":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you male or female?</span></div></span></div>",
            "created":1379307600,
            "id":1664250,
            "title":"A New Adventure Begins"
        },
        "11":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Beginning of Summer",
                "Mid-Summer",
                "End of Summer",
                "Halloween",
                "Christmas"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Kevin Gale. You are 6' 1\" tall, with short, sandy-blonde hair, and hazel eyes. Your typical outfit is blue jeans, red sneakers, and some kind of video game t-shirt. You were raised by your father, until he died, leaving you with your step-mother and two step-sisters. You have finished your grade 11 year at your local high school, and have decided to start making good use of your talents on the opposite sex this coming school year. When exactly do you start?</span></div></div>",
            "created":1379307600,
            "id":1664259,
            "title":"Male"
        },
        "111":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Individual",
                "Group",
                "The Leader of a Large Group"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Summer has just begun, and so has your fun. Why wait for school to start when you can start having fun now. What range do you target?</span></div></span></div>",
            "created":1387688400,
            "id":1712029,
            "title":"Beginning of Summer"
        },
        "1111":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Sakura Yamamoto",
                "lifeguard",
                "childhood friend and bimbo, Betty Bust"
            ],
            "content":"<div class=\"\"><div> <span>You decided to start with a single target. You wondered who to do. There was your crush since middle school, Sakura Yamamoto. She had red hair dyed pink, lovely C-cup breasts, a nice heart-shaped ass, and dazzling blue eyes. Then there was the lifeguard, a hot 28-year-old brunette with EE-cups, matching ass, and green eyes. Lastly was your childhood friend, Betty Bust. With blond hair, blue eyes, D-cups, matching heart-shaped ass, she was smoking hot. Though she wasn't the brightest star in the sky. She was quite forgetful, ditzy, and giggled a lot. Basically your stereotypical bimbo.<br>\r\n<br>\r\nNow, who to start with?</span></div></div>",
            "created":1395982800,
            "id":1769538,
            "title":"Individual"
        },
        "112":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Disney World",
                "San Diego Comic Con",
                "Somewhere Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It's the middle of summer and you're going on vacation with your family. It's the perfect time to really test your powers. But where are you going?</span></div></span></div>",
            "created":1408424400,
            "id":1843984,
            "title":"Mid-Summer"
        },
        "1121":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Hypnotize random strangers",
                "Hypnotize certain targets",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So you're going to Disney World with your family. You get settled into your room at the resort, and lay on your bed, contemplating your plan for the next day.<br>\r\n<br>\r\nWhat's the plan?</span></div></span></div>",
            "created":1417207440,
            "id":1894929,
            "title":"Disney World"
        },
        "11212":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Disney Princesses",
                "Other People"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to target specific people ahead of time. But who? You think about it, and the first thing that comes to mind is...</span></div></span></div>",
            "created":1417207680,
            "id":1894930,
            "title":"Hypnotize certain targets"
        },
        "112121":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Author's Choice (reserved)",
                "Reader's Choice (open)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide that there's no better target than the Disney Princesses. So you read up about them, and where they will be, and get ready for the trip to the Magic Kingdom tomorrow. <br>\r\n<br>\r\nYour first target:</span></div></span></div>",
            "created":1417207980,
            "id":1894935,
            "title":"Disney Princesses"
        },
        "1121211":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Wait for her break",
                "Target another princess in the meantime"
            ],
            "content":"<div class=\"\"><div> <span>The next day at the Magic Kingdom, you managed to navigate through the crowds of people and track down Elsa. Waiting for a good moment, you swiftly entranced her with a tap to the neck.<br>\r\n<br>\r\n\"Read this, then forget about it until you go on break. Obey it when you remember.\" you commanded, slipping a piece of paper with instructions into her hand<br>\r\n<br>\r\nAs soon as she had a firm grip on the paper, you woke her up and walked away. The whole exchange took seconds and no one noticed anything had happened. You watched from a distance as she unfolded the paper, read it intently, then re-folded it and hid it in her bra. Once it was safely tucked away, she carried on as though nothing had happened.<br>\r\n<br>\r\nWhat next?</span></div></div>",
            "created":1417209240,
            "id":1894948,
            "title":"The Snow Queen, Elsa"
        },
        "11212111":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You decided to remain patient, and focus on Elsa for now. You wandered around for a little while, and just before noon, your phone went off.<br>\r\n<br>\r\n<u>My name is Elsa, and I need to speak with you</u><br>\r\n<br>\r\nYou typed up a reply.<br>\r\n<br>\r\n<i>Where should we meet?</i><br>\r\n<br>\r\nA minute passed, and you received a reply.<br>\r\n<br>\r\n<u>The bridge on Tom Sawyer Island</u><br>\r\n<br>\r\nYou replied that you'd be there soon, and quickly started to make your way there. It didn't take long, but Elsa was already there when you arrived. There was nobody around, otherwise they might have wondered what she was doing here.<br>\r\n<br>\r\n\"Hello, Elsa.\" you greeted upon approaching her<br>\r\n<br>\r\nShe turned to face you.<br>\r\n<br>\r\n\"Are you the one who has come to help me?\" she asked<br>\r\n<br>\r\nYou nodded, and she let out a sigh of relief.<br>\r\n<br>\r\n\"Thank goodness.\" she said<br>\r\n<br>\r\nYou walked up to her and, with a tap to the neck, entranced her.</span></div></div>",
            "created":1417212300,
            "id":1894967,
            "title":"Wait for her break"
        },
        "113":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Choose One",
                "Choose Several",
                "Choose Lots"
            ],
            "content":"<div class=\"\"><div> <span>Summer was over and now your plans can begin to unfold. It is the first day of school, and everyone is extra happy and social, including you. How do you start to spread your control?<br>\r\n<br>\r\n-Specific Target<br>\r\n<br>\r\n-Group Target<br>\r\n<br>\r\n-Faculty Member (Mass Group Target)</span></div></div>",
            "created":1380171600,
            "id":1670277,
            "title":"End of Summer"
        },
        "1133":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Teacher",
                "Guidance Counsellor",
                "Principal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What level of faculty do you target first?<br>\r\n<br>\r\n-Teacher (Low Level)<br>\r\n<br>\r\n-Guidance Counsellor (Medium Level)<br>\r\n<br>\r\n-Principal (High Level)</span></div></span></div>",
            "created":1380344400,
            "id":1671328,
            "title":"Choose Lots"
        },
        "11331":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you target Ms. Knowles, the Drama Teacher?</span></div></span></div>",
            "created":1380690000,
            "id":1673225,
            "title":"Teacher"
        },
        "113311":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Class Starts",
                "Something Else First"
            ],
            "content":"<div class=\"\"><div> <span>Ms. Tanya Knowles was the gorgeous senior drama teacher. She was 5' 6\", with long and wavy blonde hair, and blue eyes. You managed to find her in the parking lot before school. You offered to help carry her things in, then when you were alone in the classroom, you tapped a nerve on her neck and commanded her to \"sleep\". Her head slumped, and her eyes closed as she submitted to your command. <br>\r\n<br>\r\n\"When you awaken, you will find yourself bound to my will. You will be completely submissive to me, and wish to aid me with anything and everything I want. You will be attracted to me, but will feel attraction for no other man. You will be loyal to me. When you awaken, you will conspire with me to build for me a harem of hypnotized beauties. Starting with the members of this class.\"<br>\r\n<br>\r\nYou snapped your fingers, and her eyes opened.<br>\r\n<br>\r\n\"Are you ready?\" you asked<br>\r\n<br>\r\n\"Anything for you.\" she replied</span></div></div>",
            "created":1380690000,
            "id":1673247,
            "title":"Yes"
        },
        "113312":{
            "author_id":"matumama157",
            "author_name":"Chris",
            "choices":[
                "Hell Yes!",
                "Maybe another?"
            ],
            "content":"<div class=\"\"><div> <span>The room next to her contained Ms. Baker, The science teacher, her appearance was a beautiful face, 100cm G breasts and a badonkadonk to match with it, her leggings encased her legs and ass like a skin tight suit, and her top was a tank top showing all the cleavage and a white lab coat over that will you have her under your spell? </span></div></div>",
            "created":1439773320,
            "id":2021780,
            "title":"No"
        },
        "1133121":{
            "author_id":"matumama157",
            "author_name":"Chris",
            "choices":[
                "Have some fun in the back room",
                "First period starts"
            ],
            "content":"<div class=\"\"><div> <span>You make your way inside her lab room and spot her at the front desk setting up her whiteboard for the first class of the morning, luckily she didn't hear or notice you that gave you a perfect opportunity to sneak up behind and pinch one of her nerves. Causing her to slouch her head down with this you recite these words \"You are now under my control, while you are under my control you are to do anything that I say and not refuse and that MEANS ANYTHING, now once i snap my fingers you will come back and begin your slave.exe\". With that you snap your fingers and instantly she sprung back to life and faced you. \"Hello Kevin, would you like to have...some fun?\" she said while beginning to remove her lab coat. </span></div></div>",
            "created":1439773680,
            "id":2021782,
            "title":"Hell Yes!"
        },
        "11331211":{
            "author_id":"wp.2004",
            "author_name":"William",
            "choices":[
                "Invite her to join in ",
                "Hypnotize her "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You sneak into the back room with her and start having some fun, after a while you hear a knock on the door, they open the door and come in. It was your crush, she is standing there with a bright red face. What do you do ?</span></div></span></div>",
            "created":1513386600,
            "id":2428620,
            "title":"Have some fun in the back room"
        },
        "113312112":{
            "author_id":"wp.2004",
            "author_name":"William",
            "choices":[
                "Join in ",
                "Strip"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You hypnotize her, What are you going to make her do ? </span></div></span></div>",
            "created":1513386720,
            "id":2428622,
            "title":"Hypnotize her "
        },
        "11333":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Skip to Staff Meeting",
                "After Leaving Her Office"
            ],
            "content":"<div class=\"\"><div> <span>You decided to start at the top, and work your way down until you ran the school. So you started with the Principal, Ms. Rose Sinclair. She was a beautiful blonde in her late 30's, who was an avid feminist. As such, she dressed quite conservatively despite her gorgeous body. She also had seen fit to make her entire staff women, who just happened to be also quite attractive. Due to the estrogen rich environment, many local families had decided to send their sons to other schools in the district. But since your parents were never around to drive you to the more distant schools, you were left as one of very few boys at what could almost be considered an unofficial all-girls school. This just happened to work perfectly for your plans.<br>\r\n<br>\r\nYou first had to get access to her. So you hypnotized her secretary first. Young Natalia Kent was something of an easy target. She was 22 years old and had a thin frame, but she also wasn't the sharpest tool in the shed and had a predictable morning schedule. Then it was a simple matter of having her put a sleeping pill in the Principal's coffee. Once she was out like a light, you went into her office and played an entrancing mp3 from your phone. You had designed it yourself for use on sleeping inductees. You let it play until she finally started to wake up, then turned it off. She sat up in her office chair, and looked right at you.<br>\r\n<br>\r\n\"Mr. Gale, what are you doing in my office?\" she asked<br>\r\n<br>\r\nYou smiled, and snapped your fingers below the desk. Instantly, her eyes closed and her head slumped. She was asleep, but this time it was a trance sleep.<br>\r\n<br>\r\n\"Miss Sinclair… Rose, until today, you have been my principal. But from now on, you will be whatever I want you to be. You will find that you would do anything to please me. You are so very proud of being mine. But for now, you have to hide it. Nobody can know you belong to me until I tell you it's safe. Do you understand?\" you asked<br>\r\n<br>\r\n\"Yes sir.\" she replied<br>\r\n<br>\r\n\"Good. Now, when I snap my fingers, you will awaken as my devoted accomplice, and we will begin our plan.\" you said, and snapped your fingers<br>\r\n<br>\r\n\"Well sir, shall we begin?\" she asked<br>\r\n<br>\r\n\"Yes. The first order of business is the other faculty members. I'll need you to call a staff meeting.\" you said<br>\r\n<br>\r\n\"I think that can be arranged.\" she said</span></div></div>",
            "created":1385614800,
            "id":1700255,
            "title":"Principal"
        },
        "113331":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Find a Student to Convert",
                "Time for Class to Start"
            ],
            "content":"<div class=\"\"><div> <span>You reviewed the list of those who would be attending the staff meeting while Rose made all other necessary preparations.<br>\r\n<br>\r\nPrincipal: Rose Sinclair<br>\r\nSecretary: Natalia Kent<br>\r\nVice-Principal: Gwen Davis<br>\r\nGuidance Counsellor: Ellen King<br>\r\nGym Teacher: Lucy Drew<br>\r\nComputers Teacher: Felicity Burnett<br>\r\nMath Teacher: Alexa Avery<br>\r\nScience Teacher: Willow Swan<br>\r\nDance Teacher: Gabrielle Flowers<br>\r\nDrama Teacher: Regina Evans<br>\r\nMusic Teacher: Mary Blanchard<br>\r\nArt Teacher: Camille Rousseau<br>\r\nHistory Teacher: Daphne Hartfeld<br>\r\nEnglish Teacher: Ashley Masters<br>\r\nFrench Teacher: Fleur Dumatin<br>\r\nHome Ec. Teacher: Clara Sullivan<br>\r\nNurse: Elena Wyatt<br>\r\nJanitor: Jackie Stevens<br>\r\n<br>\r\nNatalia called each of the teachers, one by one, to come for the staff meeting. As they arrived, you would hypnotize them. Then Rose would lead them into the board room and seat them at the table. With the arrival and entrancement of the Janitor, 20 year old Jackie Stevens, the group was complete. You entered the board room and faced the entranced faculty members.<br>\r\n<br>\r\n\"Good morning, everyone. Today begins phase 1 of my plan to claim this school as my own. You will find yourselves to be overenthusiastic and excited about the idea of me dominating each and every one of you. Nothing matters more to you than pleasing me. You patiently wait for the day when you will be able to be open about your affection. But for now, you will settle for doing as I command.\" you commanded<br>\r\n<br>\r\n\"Yes sir.\" they replied<br>\r\n<br>\r\n\"Now, when I snap my fingers, you will all awaken; ready to heed my every word.\" you said, and snapped your fingers<br>\r\n<br>\r\nThey awoke, and quickly fixated on you with eager expressions on their faces.<br>\r\n<br>\r\n\"Now then, I would like to talk to you about morale. We need to rekindle some school spirit. That's why I have assigned each of you with an extra-curricular club to manage:<br>\r\n<br>\r\nPrincipal: Rose Sinclair<br>\r\nSecretary: Natalia Kent<br>\r\nVice-Principal: Gwen Davis<br>\r\nGuidance Counsellor: Ellen King -&gt; Psychology Club<br>\r\nGym Teacher: Lucy Drew -&gt; Athletics Club<br>\r\nComputers Teacher: Felicity Burnett -&gt; Computers Club<br>\r\nMath Teacher: Alexa Avery -&gt; Statistics Club<br>\r\nScience Teacher: Willow Swan -&gt; Animal Club<br>\r\nDance Teacher: Gabrielle Flowers -&gt; Dance Club<br>\r\nDrama Teacher: Regina Evans -&gt; Acting Club<br>\r\nMusic Teacher: Mary Blanchard -&gt; Vocal Club<br>\r\nArt Teacher: Camille Rousseau -&gt; Costume Club<br>\r\nHistory Teacher: Daphne Hartfeld -&gt; Era Club<br>\r\nEnglish Teacher: Ashley Masters -&gt; Fiction Club<br>\r\nFrench Teacher: Fleur Dumatin -&gt; French Maid Club<br>\r\nHome Ec. Teacher: Clara Sullivan -&gt; Housewife Club<br>\r\nNurse: Elena Wyatt -&gt; Healers Club<br>\r\nJanitor: Jackie Stevens -&gt; Remedial Club<br>\r\n<br>\r\nI will provide information to each of you regarding your clubs. But until phase 2, it will be business as usual.\" you instructed<br>\r\n<br>\r\nThe faculty all nodded in agreement. You dismissed them, and it was time to re-join your fellow students.</span></div></div>",
            "created":1385701200,
            "id":1700287,
            "title":"Skip to Staff Meeting"
        },
        "1133311":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Option #1",
                "Option #2"
            ],
            "content":"<div class=\"\"><div> <span>You left the office, and in a stroke of luck, spotted Trinity Asher sitting all alone. She was one of the most beautiful and popular girls at your school. She was even hosting a party tonight. Making sure nobody was looking, you covertly tapped her neck. She became entranced immediately.<br>\r\n<br>\r\n\"Trinity, as you look into my eyes, you fall deeper in love with me. You know that we are soul mates. You are the Queen to my King, the Empress to my Emperor, and the Lady to my Lord. I will claim many women, but you will be the goddess to rule them at my side.\" you said<br>\r\n<br>\r\nYou snapped your fingers, and she became just that.<br>\r\n<br>\r\n\"Hello, my darling.\" you said<br>\r\n<br>\r\nShe cuddled up to you warmly.<br>\r\n<br>\r\n\"My love.\" she replied<br>\r\n<br>\r\n\"We must make new preparations for your party tonight. After all, what is a Queen without subjects?\" you said<br>\r\n<br>\r\n\"I couldn't agree more.\"</span></div></div>",
            "created":1385701200,
            "id":1700304,
            "title":"Find a Student to Convert"
        },
        "114":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "At School",
                "At the Costume Store",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You have waited patiently, but now it is time to begin. Where do you begin to lay the groundwork for Halloween?</span></div></span></div>",
            "created":1379653200,
            "id":1666253,
            "title":"Halloween"
        },
        "1141":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Before School",
                "During School",
                "After School"
            ],
            "content":"<div class=\"\"><div> <span>What time do you begin?<br>\r\n<br>\r\n-Before class; students are just beginning to arrive on campus<br>\r\n<br>\r\n-Lunch break; there's a Halloween costume event going on<br>\r\n<br>\r\n-After school; students are preparing to head home for the night</span></div></div>",
            "created":1460334120,
            "id":2130984,
            "title":"At School"
        },
        "1142":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Alone",
                "With Someone Else",
                "With a Group"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are working at the costume shop, when an attractive girl walks in. But is she alone?</span></div></span></div>",
            "created":1382504400,
            "id":1683280,
            "title":"At the Costume Store"
        },
        "11421":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Shopping",
                "Stealing (reserved)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There doesn't seem to be anyone with her. What is she doing?</span></div></span></div>",
            "created":1403067600,
            "id":1814216,
            "title":"Alone"
        },
        "11422":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Family",
                "Friend"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is she with family or a friend?</span></div></span></div>",
            "created":1385528400,
            "id":1699750,
            "title":"With Someone Else"
        },
        "114221":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Seeing Double",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it her twin sister?</span></div></span></div>",
            "created":1385528400,
            "id":1699751,
            "title":"Family"
        },
        "1142211":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Option #1",
                "Option #2"
            ],
            "content":"<div class=\"\"><div> <span>You thought you were lucky when you saw her walk in. But then you saw an identical girl wearing different clothes come in after her. You decided it was worth the risk, and approached them.<br>\r\n<br>\r\n\"Excuse me, but would you lovely ladies like to try your chance at winning your costumes for free?\" you ask them<br>\r\n<br>\r\n\"What's the catch?\" they asked in unison<br>\r\n<br>\r\n\"It's actually very simple. You see, I'm an amateur hypnotist. I need willing participants so I can hone my skills.\" you said<br>\r\n<br>\r\n\"So all we have to do is not be hypnotized?\" asked the first twin<br>\r\n<br>\r\n\"That's right.\" you replied<br>\r\n<br>\r\nThey looked at each other, then back at you.<br>\r\n<br>\r\n\"Deal.\" they replied<br>\r\n<br>\r\nYou nodded, and lead them to the changing rooms in the back.<br>\r\n<br>\r\n\"I need some quiet for this to work.\" you explained<br>\r\n<br>\r\nActually, what you needed was privacy, but there was no need to tell them that.<br>\r\n<br>\r\n\"Close your eyes, and softly count backwards from 10.\" you told them<br>\r\n<br>\r\nThey did so. You stepped behind them, and tapped them on the neck as they finished counting down. They were entranced instantly.</span></div></div>",
            "created":1385528400,
            "id":1699779,
            "title":"Seeing Double"
        },
        "11422111":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Make out with each other",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you order them to do?</span></div></span></div>",
            "created":1564067220,
            "id":2692121,
            "title":"Option #1"
        },
        "114221112":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Meet you at your place tonight and have a threesome with you",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What do you order them to do?</span></div></span></div>",
            "created":1564067340,
            "id":2692122,
            "title":"Something else"
        },
        "11423":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Family",
                "Friends"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of group?</span></div></span></div>",
            "created":1382504400,
            "id":1683282,
            "title":"With a Group"
        },
        "114232":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You walked up to the girl, who was now browsing the costumes along with her group of attractive female friends.<br>\r\n<br>\r\n\"Do you need any help finding anything?\" you ask<br>\r\n<br>\r\nThe girl nearest you turned to reply.<br>\r\n<br>\r\n\"No, all the costumes here are great. I just don't know how we'll buy the ones we want.\" she said<br>\r\n<br>\r\n\"Well I'm not supposed to do this, but since I need some help, I'll make an exception.\" you said<br>\r\n<br>\r\n\"An exception for what?\" she asked<br>\r\n<br>\r\n\"Well you see, I'm an aspiring hypnotist. I need practice to hone my skills, so let me try hypnotizing you and your friends. If I can't, I'll give you all a big discount on whatever costumes you want.\" you said<br>\r\n<br>\r\n\"Seriously?\"<br>\r\n<br>\r\nYou nodded, and she quickly talked to each of her friends. They all came over and agreed to be your practice subjects. You led them to the back area where the more risqué costumes were, explaining that you needed quiet. You had them all close their eyes, and with a tap to each of their necks, you commanded them to sleep.<br>\r\n</span></div></div>",
            "created":1382504400,
            "id":1683296,
            "title":"Friends"
        },
        "1143":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Your House (Set Up A Base Of Operations)",
                "Their Houses (Go To The Homes Of Local Hotties)",
                "More Options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices...<br>\r\n<br>\r\n-Your House (Set Up A Base Of Operations)<br>\r\n<br>\r\n-Their Houses (Go To The Homes Of Local Hotties)<br>\r\n<br>\r\n-More Options</span></div></span></div>",
            "created":1381986000,
            "id":1680506,
            "title":"Other"
        },
        "11432":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Big Family",
                "Small Family"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What size of group?<br>\r\n<br>\r\n-Big Family<br>\r\n<br>\r\n-Small Family</span></div></span></div>",
            "created":1381986000,
            "id":1680507,
            "title":"Their Houses (Go To The Homes Of Local Hotties)"
        },
        "114321":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Stay",
                "Leave"
            ],
            "content":"<div class=\"\"><div> <span>You decide to target a nest of hotties, the Hartfeld family. The mother, Elesa (37), eldest daughter Danielle (19), twin girls Blaire and Blake (18), and youngest daughter Celeste (16). Elesa was a gorgeous with her long orange hair and brown eyes, while all of her daughters were blonde-haired brown-eyed beauties. Elesa was especially impressive considering she had had 4 kids and still looked like a centrefold model. The father had been some old money rich kid that had knocked up Elesa right after high school. He stuck around for a while, but after 4 kids an no male heirs, he jumped ship. Luckily for the girls he left them with enough money to live off of for a long time. You're in the same grade as Blake and Blaire, but you've never had any classes with them. They only know you as a passing acquaintance, but that won't be the case for long.<br>\r\n<br>\r\nIt was the start of the weekend before Halloween, and you had lots of work to do. You walked up to the Hartfelds' doorstep and rang the bell. It was Danielle who answered.<br>\r\n<br>\r\n\"Can I help you?\" she asked<br>\r\n<br>\r\n\"I'm here to see Blake and Blaire.\" you replied<br>\r\n<br>\r\n\"Alright, I'll go get them.\" she said<br>\r\n<br>\r\nShe turned away, and you tapped the side of her neck and commanded her to SLEEP.<br>\r\n<br>\r\n\"I'll get them myself.\" you replied<br>\r\n<br>\r\nYou carried Danielle's limp form to the couch and closed the front door. You could hear the sounds from the TV down the hall. You found Blake and Blaire on the couch together with their backs to the door. It was just as easy to induct both of them into a trance simultaneously. Next you found Elesa in the laundry room folding clothes. She was easy prey as you silently crept up behind her and tapped her neck. Celeste was upstairs in her room, working on homework while soft music played quietly in the background. With a simple tap to the neck, she was entranced and the collection was complete. You returned downstairs with Celeste and moved all 5 young women into the same room.<br>\r\n<br>\r\n\"Upon waking up you will find yourselves wishing to be Pokemon. The only problem is that you don't know how. But don't worry, because I am here to teach you how.\" You addressed the group \"You will remain in this state of transition until I tell you that you are ready to be Pokemon. Once you are ready to be Pokemon, I will have more instructions for you.\" You snapped your fingers, and they stirred awake.<br>\r\n<br>\r\nThey sat up and when they looked at you, they got very excited.<br>\r\n<br>\r\n\"Are you ladies ready to begin your lessons?\" you asked<br>\r\n<br>\r\n\"Yes sir.\" they replied in unison<br>\r\n<br>\r\n\"Do you know which Pokemon you each want to be?\" you ask<br>\r\n<br>\r\nThey all thought hard for a few moments, before shaking their heads.<br>\r\n<br>\r\n\"Don't worry, because I have selected one for each of you.\" you said<br>\r\n<br>\r\nYou took out your tablet and loaded a slideshow of pictures.<br>\r\n<br>\r\n\"Elesa, you will be Raichu. Danielle, you will be Pikachu. Blaire and Blake, you will be Plusle and Minun. Celeste, you will be Pichu.\" you declared, showing each girl their respective pictures.<br>\r\n<br>\r\n\"What's first, sir?\" asked Celeste<br>\r\n<br>\r\n\"Let's see your rooms.\" you said<br>\r\n<br>\r\nThey led you upstairs and you surveyed each room.<br>\r\n<br>\r\n\"How do they look?\" asked Elesa<br>\r\n<br>\r\n\"Not bad, but we won't be settling for just that. Let's find you each something to wear, and we'll go shopping.\" you said<br>\r\n<br>\r\nYou went through each of their wardrobes and picked out clothes for them. They disappeared into the bathroom, and returned clothed in their new outfits. Elesa wore an orange knee-length dress and black knee high boots with a 3\" heel. Danielle wore a low-cut, tight yellow shirt, with a yellow short skirt and ballet flats. Blaire and Blake wore yellow semi-low-cut t-shirts just see-through enough to see the colour of their bras, ribbons in their hair, black TNA pants, and sneakers. The only difference between the two, was that Blaire's ribbons, bra, and sneakers were red, while Blaire's were blue. Finally, Celeste wore a yellow dress that fell just past her knees, a black silk scarf around her neck, and yellow sneakers.<br>\r\n<br>\r\nYou had Elesa drive everyone to Customize Your Character. It was a huge clothing shop on the outskirts of town that had everything from clothes to shoes to accessories to costumes, and a huge selection of each. You bought each of them several new outfits that fit the motif of their Pokemon identities. They were eager to wear their new outfits right out of the store, but you told them to wait until later. You also purchased for them a collection of regular and costume makeup, and a wealth of materials to re-decorate their rooms.<br>\r\n<br>\r\nUpon arriving home, you took detailed measurements of each girl, before sending them on to re-decorate their rooms. While they did that, you went online and input the girls' measurements for a set of highly customized latex bodysuits. So much detail was involved, that by the time you had finished the specifications and ordered them, The girls were almost done re-decorating.<br>\r\n<br>\r\nOne might wonder where the money came to afford all this came from. Well, last year you hacked an escort service's database for a list of clients, and hypnotized several of them to wire you the money they would have spent on the escort, and watch hotel porn instead. So now you had a small fortune to fund this master plan.<br>\r\n<br>\r\nYou climbed the stairs and found the girls putting the finishing touches on their rooms. Once they were finished, they all crowded around you.<br>\r\n<br>\r\n\"Well done, girls. Now it's time to take a look at your new outfits. You each have 7 casual outfits, 3 home outfits, and 1 costume. The casual outfits are for wearing outside during the day, and are interchangeable. The costume is for wearing to school on Halloween. The home outfits are not interchangeable though. One is for use when you wake up, one is for use when you come home, and the last is for sleeping in.\" You told them<br>\r\n<br>\r\n\"Um, sir? I'm looking at the clothes we got, and including the costume we only have 10 outfits.\" said Celeste<br>\r\n<br>\r\n\"Excellent observation. That is because your sleeping outfit doesn't actually consist of any clothing. Every night when you go to bed, you will strip naked and use the body paint I got for you to paint yourself to match your Pokemon.\" you replied<br>\r\n<br>\r\n\"I see.\" replied Celeste<br>\r\n<br>\r\n\"Now that that's done, let's get you all changed into one of your casual outfits.\" <br>\r\n<br>\r\nElesa donned a pair of orange leggings, a white camisole, an open orange leather jacket, and dark brown 6\" pumps and leather gloves. She put on mascara, yellow nail polish, orange blush, black eyeliner and yellow lipstick to accentuate the look. Danielle dressed herself in black 5\" pumps, yellow leggings, a short, loose yellow dress, a wide brown belt around her waist, and a yellow bracelet on each wrist. She improved the look with mascara, red nail polish, red blush, black eyeliner, and red lipstick. Blaire adorned red 4\" pumps, yellow leggings, a red mini-skirt, a form fitting yellow blouse, and red ribbons in her hair. She had put on mascara, red blush, red nail polish, red lipstick, and red eyeliner. Blake adorned blue 4\" pumps, yellow leggings, a blue mini-skirt, a form fitting yellow blouse, and blue ribbons in her hair. She had put on mascara, blue blush, blue nail polish, blue lipstick, and blue eyeliner. Last but not least, Celeste wore pink 2\" pumps, a yellow sundress, a black choker necklace, and black ribbons in her hair. She had also put on pink lipstick, mascara, pink blush, black eyeliner, and pink nail polish.<br>\r\n<br>\r\n\"You all look exquisite. It's time for me to go for now. I'll be back tomorrow to continue your training. Until then, until then, I want you to practice talking like a Pokemon. That means you can only talk using the syllables of your Pokemon name.\" you said<br>\r\n<br>\r\nYou turned to leave, but a hand latched onto your wrist. You turned to see Danielle on her knees with a pleading look in her eyes.<br>\r\n<br>\r\n\"Please don't go yet. Just stay a little while longer.\" she begged<br>\r\n<br>\r\nDo you Stay or Leave?</span></div></div>",
            "created":1381986000,
            "id":1680630,
            "title":"Big Family"
        },
        "1143212":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Home (Prepare Base of Operations)",
                "Find New Targets"
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry, but I have things I have to do.\" you said<br>\r\n<br>\r\nDanielle looked down sadly. You gently lifted her chin so her eyes met yours.<br>\r\n<br>\r\n\"Don't worry. Before you know it, it'll be tomorrow and I'll be back.\" you reassured her<br>\r\n<br>\r\nA smile returned to her face. You helped her to her feet and opened the front door.<br>\r\n<br>\r\n\"Don't forget to practice and follow your routine. I'll be back soon.\" you said, and left the Hartfeld residence behind<br>\r\n<br>\r\nWhere to next?</span></div></div>",
            "created":1382072400,
            "id":1681047,
            "title":"Leave"
        },
        "11433":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps you make arrangements at you work. (Somewhere besides the costume store)</span></div></span></div>",
            "created":1400907600,
            "id":1801383,
            "title":"More Options"
        },
        "114331":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "That's the one!",
                "No, that's not it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it the local dog kennel?</span></div></span></div>",
            "created":1400907600,
            "id":1801386,
            "title":"Yes"
        },
        "1143311":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "In the kennel",
                "Going door to door"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where do you lay the groundwork?</span></div></span></div>",
            "created":1400907600,
            "id":1801387,
            "title":"That's the one!"
        },
        "115":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "School",
                "Christmas Pageant",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It's the season of giving, and you're in the mood to give the girls at your high school what's coming to them. How will you do it?</span></div></span></div>",
            "created":1393909200,
            "id":1755515,
            "title":"Christmas"
        },
        "1152":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Yes, Play with your #1 Servant",
                "No, Go hypnotize girls to audition who normally wouldn't",
                "No, Time-skip to auditions"
            ],
            "content":"<div class=\"\"><div> <span>You decide that the Christmas Pageant will be the stage upon which you will claim victory. The first step was to hypnotize the drama teacher, who was in charge of the event. You found Miss Tanya Knowles, the 24 year old drama teacher in her classroom. Stepping up behind her, you entranced her with a quick tap to the neck.<br>\r\n<br>\r\n\"From now on, you will be my loyal and faithful servant. You will aspire to be everything I want you to be. The first part of that will be helping me hijack the Christmas Pageant. You will then be helping me use it to make a collection of hot little playthings just like you. When I snap my fingers, you will return to being Miss Knowles. Miss Knowles will retain her personality and hold no memories of what she has been helping me with, but even in this state she will be subconsciously enabling this endeavour. But when I call you Tanya, you will become Tanya again; actively helping me and worshipping me and doing anything I tell you. When I call you Miss Knowles, you will become Miss Knowles again.\" you commanded<br>\r\n<br>\r\nYou snapped your fingers, and the trance ended.<br>\r\n<br>\r\n\"Hello Tanya.\" you said<br>\r\n<br>\r\nShe smiled mischievously.<br>\r\n<br>\r\n\"Hello Master. What did you have in mind for the Christmas Pageant?\" she asked<br>\r\n<br>\r\n\"I was thinking of making it the ultimate Christmas-themed cosplay competition, with a dash of reality TV drama leading up to it.\" you said<br>\r\n<br>\r\n\"Sounds exciting.\" she replied<br>\r\n<br>\r\n\"So once we have all of our competitors, you and I will help the girls begin to ready themselves for the competition. They will be assigned a character each, and be tasked with essentially becoming that character. But in the mean-time leading up to the contest, you will tell them about someone who can swing the contest in their favour: Me. You see, I will be in disguise while helping out with the setup. So you will direct them towards my real identity and tell them that I am looking for a sexy cosplay girlfriend, and that if they can fill that role, it will stack the deck in their favour. So there will be something of a secret Bachelor-like reality game going on.\" you explained<br>\r\n<br>\r\n\"When should I set the auditions for?\" she asked<br>\r\n<br>\r\n\"Set them up for the end of the week. Also add that part of the contest will have the option of support roles, which means that they should bring any and all female relatives between the ages of 14 and 40 to audition for support roles.\" you instructed<br>\r\n<br>\r\n\"Got it. Anything else. Master?\" she asked</span></div></div>",
            "created":1393909200,
            "id":1755574,
            "title":"Christmas Pageant"
        },
        "11522":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "At School",
                "Elsewhere"
            ],
            "content":"<div class=\"\"><div> <span>\"No, that's all for tonight. Goodnight, Miss Knowles.\" you said<br>\r\n<br>\r\n\"Goodnight, Mr. Gale.\" she replied<br>\r\n<br>\r\nYou left, and began to think about viable contestants that normally wouldn't audition. Where do you begin your search?</span></div></div>",
            "created":1393909200,
            "id":1755576,
            "title":"No, Go hypnotize girls to audition who normally..."
        },
        "12":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Beginning of Summer",
                "Mid-Summer",
                "End of Summer",
                "Halloween",
                "Christmas"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Alice Gale. You are 5' 7\" tall, with long, blonde hair, and green eyes. Your typical outfit is blue jeans, red sneakers, and some kind of video game t-shirt, with little to no make up. But only in public. Secretly, in addition to being a talented hypnotist, you were also a talented disguise artist. You were raised by your father, until he died, leaving you with your step-mother and two step-sisters. You have finished your grade 11 year at your local high school, and have decided to start making good use of your talents on the other girls this coming school year. When exactly do you start?</span></div></div>",
            "created":1390366800,
            "id":1731666,
            "title":"Female"
        },
        "121":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Home",
                "The Mall",
                "Elsewhere"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It's the beginning of summer and it's time to begin laying the groundwork for your final year. Where do you begin?</span></div></span></div>",
            "created":1391230800,
            "id":1736827,
            "title":"Beginning of Summer"
        },
        "1213":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Fan Convention",
                "Disney World",
                "Somewhere Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where else would you go?</span></div></span></div>",
            "created":1411567740,
            "id":1861204,
            "title":"Elsewhere"
        },
        "12132":{
            "author_id":"ichimaru12",
            "author_name":"Thatguywhoisme",
            "choices":[
                "A Disney Princess Costumed Employee",
                "Your friend Liz",
                "Wander around the park"
            ],
            "content":"<div class=\"\"><div> <span>Ahh, Disney World, the land of magic and excitement! And for a young woman such as yourself, a grande place to start using your powers. You had been planning this trip for quite some time with your friend, Liz, who had no idea of your skills. She was 5'5\" with a great figure and brown hair, though she dressed too conservatively for your tastes. She tended to be quiet around people she doesn't know. The two of you emerged from the plane into the hot sun, exhausted from the flight but excited for the wonders that the park would hold. <br>\r\n<br>\r\nBefore long, you and her arrive. Though the rides do look like fun, you have one obvious thought on your mind. Who should you practice your powers on?</span></div></div>",
            "created":1439870040,
            "id":2022210,
            "title":"Disney World"
        },
        "124":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "At School",
                "At the Costume Store",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decided there was no better time to start than Halloween. Everyone was pretending to be someone else, and openly wearing sexy outfits to boot. To the right people, it was better than Christmas. Where to begin operations?</span></div></span></div>",
            "created":1390366800,
            "id":1731669,
            "title":"Halloween"
        },
        "1241":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Before Halloween",
                "Before class, on Halloween",
                "At the school's Halloween dance"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You start at the school, but when?</span></div></span></div>",
            "created":1391662800,
            "id":1740311,
            "title":"At School"
        },
        "1242":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Alone",
                "With Someone",
                "With a Group"
            ],
            "content":"<div class=\"\"><div> <span>Preparing for your Halloween plans, there was no better position than working at the only costume shop in town. You would wait for prospective targets to enter, and hypnotize them. You smiled as you spotted an ideal target enter the store. She was quite attractive, and had a similar physique to you. But was she alone?</span></div></div>",
            "created":1390366800,
            "id":1731672,
            "title":"At the Costume Store"
        },
        "12421":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "She lost. Continue as planned",
                "You like her. Let her believe she won"
            ],
            "content":"<div class=\"\"><div> <span>You observed her for a few minutes, and she didn't seem to interact with anyone. You decided to approach.<br>\r\n<br>\r\n\"Can I help you find anything?\" you asked<br>\r\n<br>\r\n\"I'm not sure. I have a Halloween party to go to, but I don't know what to dress up as.\" she said<br>\r\n<br>\r\n\"Well if it helps, I think you'd look good in anything.\" you replied<br>\r\n<br>\r\n\"Thanks.\" she replied, blushing a little<br>\r\n<br>\r\n\"Tell you what, I have a challenge for you. If you win, you can pick any costume you want, on the house.\" you said<br>\r\n<br>\r\n\"What's the catch?\" she asked<br>\r\n<br>\r\n\"If you lose, you have to grant me one small favour.\" you said<br>\r\n<br>\r\n\"Hmmm I don't know…\" she said<br>\r\n<br>\r\n\"If it helps, you can refuse the favour if you think I'm asking too much.\" you said<br>\r\n<br>\r\n\"Okay, let's do it. What's the challenge?\" she asked<br>\r\n<br>\r\n\"I'm going to try to hypnotize you. If I fail, you win, and if I succeed, you lose.\" you said<br>\r\n<br>\r\nShe cocked her head to the side curiously.<br>\r\n<br>\r\n\"But hypnosis doesn't really exist.\" she said thoughtfully<br>\r\n<br>\r\nYou smiled.<br>\r\n<br>\r\n\"Then I guess that costume is as good as yours.\" you said<br>\r\n<br>\r\nShe smiled back.<br>\r\n<br>\r\n\"So where do we do this?\" she asked<br>\r\n<br>\r\nYou lead her to the quiet back section of the store.<br>\r\n<br>\r\n\"Just close your eyes and relax. Take deep breaths.\" you instructed<br>\r\n<br>\r\nShe complied, and you stepped behind her.<br>\r\n<br>\r\n\"Now softly count backwards from 10.\" you said<br>\r\n<br>\r\nShe did, and as soon as she reached 0, you tapped her neck, and she became entranced. Your talent is impeccable, but there's something special about this girl. How do you decide to progress from here?</span></div></div>",
            "created":1390366800,
            "id":1731683,
            "title":"Alone"
        },
        "124211":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Turn her into a character",
                "Turn her into you"
            ],
            "content":"<div class=\"\"><div> <span>You took a moment to really take in her physical attributes. She was 5'7\", with a lean form, C-cup breasts and long hair just like you. But her hair was brown, her eyes were blue, and she had actually decided to wear make up today. She stood 5'10\" tall, thanks to the 3\" heels on her boots. She was wearing tna pants with a green shirt and brown vest. You may have liked her, but you had a plan that needed following.<br>\r\n<br>\r\n\"Tell me everything about yourself.\" you commanded<br>\r\n<br>\r\nShe started to tell you her life story, from memory, to likes and dislikes, to cute quirks of her personality. You led her into a changing room, and have her strip naked. You put in blue contacts and brown hair dye, before putting on the girl's clothes in place of your own. You looked in the mirror and found that you looked just like her. But what to do with the original?</span></div></div>",
            "created":1390885200,
            "id":1734390,
            "title":"She lost. Continue as planned"
        },
        "1242111":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Generic",
                "Specific"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you make her a generic character or a specific one?<br>\r\n<br>\r\n-Generic (i.e. Japanese Schoolgirl)<br>\r\n<br>\r\n-Specific (i.e. Princess Peach)</span></div></span></div>",
            "created":1391230800,
            "id":1736819,
            "title":"Turn her into a character"
        },
        "1242112":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Accept and Enter",
                "Decline and Leave"
            ],
            "content":"<div class=\"\"><div> <span>You decided that while you played her, she should fill your role. So you cleaned off her make up, and touched her up to cover any minor differences, dyed her hair blonde and put green contacts in her eyes. Then you dressed her in your clothes and imprinted her with all the important roles in your life she would have to fill. Finally finished, you woke her up.<br>\r\n<br>\r\n\"Alright, let's see if my hypnosis worked. Cat mode!\" she commanded<br>\r\n<br>\r\nWhen nothing happened, she hung her head.<br>\r\n<br>\r\n\"A deal's a deal. Which costume would you like?\" she asked<br>\r\n<br>\r\nYou selected a Dark Alice costume from the video game Alice: Madness returns.<br>\r\n<br>\r\n\"What a coincidence you chose an Alice costume. My name is Alice.\" she said, while she packed up the costume<br>\r\n<br>\r\n\"My name's Dorothy.\" you told her<br>\r\n<br>\r\nThe hypnosis seemed to be perfect. She showed no recognition at the mention of her old identity.<br>\r\n<br>\r\n\"Well, my shift is over in a few minutes, so it'll be time to go home.\" said 'Alice'<br>\r\n<br>\r\n\"Why don't I give you a ride home.\" you offered<br>\r\n<br>\r\n\"Ummm…\"<br>\r\n<br>\r\n\"Please, I insist.\" you replied firmly<br>\r\n<br>\r\n\"I guess I can't refuse.\" she said<br>\r\n<br>\r\nYou waited for her in the parking lot, and when she arrived, you both climbed into the car. You 'followed' her directions to 'her' house, and when you parked in the driveway, 'her' step-mother stepped out to greet you.<br>\r\n<br>\r\n\"Alice, I see you have a new friend. Why don't you invite her in.\" she said<br>\r\n<br>\r\n\"I don't know.\" said 'Alice'<br>\r\n<br>\r\n\"Young lady, you should be a more inviting hostess.\" she said more firmly<br>\r\n<br>\r\n\"Yes of course. Won't you please join us for a visit.\" asked 'Alice'</span></div></div>",
            "created":1391403600,
            "id":1738056,
            "title":"Turn her into you"
        },
        "124212":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Dorothy Succeeds",
                "Dorothy Fails"
            ],
            "content":"<div class=\"\"><div> <span>You took a moment to really take in her physical attributes. She was 5'7\", with a lean form, C-cup breasts and long hair just like you. But her hair was brown, her eyes were blue, and she had actually decided to wear make up today. She stood 5'10\" tall, thanks to the 3\" heels on her boots. She was wearing tna pants with a green shirt and brown vest. She looked so beautiful there that you moved in so close you could feel her warm breath on your face. You regained your senses before you touched, but there was no denying the way this girl was affecting you.<br>\r\n<br>\r\nYou took a step back and shook your head to clear it. But you still didn't want to destroy this connection you felt to her, so you opted to keep the suggestions light.<br>\r\n<br>\r\n\"From now on, you will do any request I make of you, as long as it begins with 'Would you kindly'. You will also find yourself interested in cosplaying as a potential hobby. Finally, you will find joy in playing dress up, which means that you'll have to come back here every now and then to get a new costume. But don't worry, I'm always happy to help a pretty girl in need.\" you said, blushing at the last part<br>\r\n<br>\r\nYou snapped your fingers, and her eyes opened.<br>\r\n<br>\r\n\"Am I hypnotized?\" she asked<br>\r\n<br>\r\n\"Let's see. Strut!\" you commanded<br>\r\n<br>\r\nNothing happened. You hung your head in mock disappointment.<br>\r\n<br>\r\n\"You aren't walking like a supermodel on a runway, so I guess it didn't work. I just need more practice.\" you said<br>\r\n<br>\r\n\"How about this; you may not have hypnotized me, but maybe I can still grant that small request of yours.\" she offered<br>\r\n<br>\r\n\"Well I was going to ask you to…\" you mumbled the last part<br>\r\n<br>\r\n\"You were going to ask me to what?\" she asked<br>\r\n<br>\r\nYou blushed fiercely.<br>\r\n<br>\r\n\"To give me your number.\" you said<br>\r\n<br>\r\nIt was her turn to blush.<br>\r\n<br>\r\n\"Oh um… I don't know what to say.\" she said<br>\r\n<br>\r\n\"I'm sorry. I shouldn't have asked.\" you said, looking down<br>\r\n<br>\r\n\"Wait.\" she said quickly, grabbing your arm<br>\r\n<br>\r\nYou looked into her eyes and they were wide with anticipation.<br>\r\n<br>\r\n\"I can do one better. Why don't we get a pair costume, and you can be my date.\" she said<br>\r\n<br>\r\n\"Yes. Awesome. I mean, I would love to.\" you said<br>\r\n<br>\r\n\"I do have one condition though.\" she said<br>\r\n<br>\r\n\"What is it?\" you asked<br>\r\n<br>\r\n\"I pick the costumes.\" she said with a big smile<br>\r\n<br>\r\nYou nodded, happily.<br>\r\n<br>\r\nShe was about to lead you into a rack of costumes, when she stopped and looked back at you.<br>\r\n<br>\r\n\"Dorothy.\" she said<br>\r\n<br>\r\nYou gave her a questioning look.<br>\r\n<br>\r\n\"It's my name. Dorothy.\" she said<br>\r\n<br>\r\n\"I'm Alice.\" you said<br>\r\n<br>\r\nDorothy had a thoughtful moment.<br>\r\n<br>\r\n\"I know exactly what our costumes are going to be.\" she said<br>\r\n<br>\r\nShe took your hand and lead you through the store. Eventually you stopped in one particular part of the store. Dorothy grabbed two costumes off the rack. The one that she handed you was a blue and white dress with shoes and accessories.<br>\r\n<br>\r\n\"I'm going to be Dorothy from the Wizard of Oz, and you're going to be Alice from Alice in Wonderland.\" Dorothy explained excitedly<br>\r\n<br>\r\nYou scurried over to the changing rooms. Once you were safely within the confines of the changing room, you took a deep breath and leaned against the wall. You couldn't believe how this had happened. Dorothy's appearance into your life scrambled all the planning you had been doing for months. But you didn't care. Dorothy had asked you to be her date. No hypnosis required.<br>\r\n<br>\r\nYou stripped out of your shoes, socks, jeans and t-shirt, and gazed upon the costume hanging from the hook. In a burst of either insanity or courage, you removed your bra and panties as well, before grabbing the costume. You unzipped the dress, and stepped into it. You revelled in the feeling of the fabric against your skin as the dress slid up your form and settled into place. You reached around your back and managed to reach the zipper. With the dress on properly, the hem fell to mid thigh, and the cleavage cradled your breasts nicely. You turned back to the package to see what articles remained. There was a pair of black heels, white stockings, a black ribbon, and a hair and make up kit. You put on the stockings first, then the heels. The shoes were styled similarly to the classic Alice shoes, but had a 6\" heel. You were a little wobbly at first, but these shoes weren't too much higher than your favourite pair of 4\" heels at home. Once you were confident about your balance, you sat down on the bench and turned your attention to the hair and makeup kit. It was nothing too flashy. Just something to make your hair flowing smooth, some tasteful eye make up, pink blush, and a nice pink lipstick. For one final touch, you tied the black ribbon into your hair. You almost didn't recognize yourself in the mirror. You had dressed up countless times before, but this time would be in public. And in front of a girl you really wanted to impress.<br>\r\n<br>\r\n\"Alice, can you help me with my zipper?\" came Dorothy's voice from the next changing room<br>\r\n<br>\r\nYou opened the door to your changing room, and entered Dorothy's. Upon entering, you stopped. You could only see her back, but what a hot back it was. Suppressing the desire to get her out of the costume instead of into it, you stepped closer and slowly zipped up Dorothy's dress. When she turned, you both froze. You were in awe of her beauty, as she was in yours. She was wearing a blue and white dress with a tight checkered pattern and white frills, and a hem that may have been a couple inches shorter than yours. She stood level to you, wearing ruby slippers with a 6\" heel, and thin white socks that reached just past her ankles. Her hair was wound into a pair of braids that fell down the front of her shoulders. There was a blue ribbon tied into each of her braids, and one tied in a pretty bow atop her head. She was wearing a little more eye make up than you, but she had very little blush, and her lips were painted firetruck red.<br>\r\n<br>\r\n\"You look… amazing.\" you said<br>\r\n<br>\r\n\"So do you. I can't even describe how utterly gorgeous you are.\" said Dorothy<br>\r\n<br>\r\n\"When does this party start?\" you asked<br>\r\n<br>\r\n\"Around 7. Why?\" she asked<br>\r\n<br>\r\n\"Because we've gone to all this trouble of putting these costumes on. It seems like a waste to take them off now, only to put them back on in a few hours.\" you said<br>\r\n<br>\r\n\"And what kind of mischief did you have in mind until the party?\" asked Dorothy<br>\r\n<br>\r\n\"I was thinking we can play a sort of game.\" you said<br>\r\n<br>\r\n\"What kind of game?\" asked Dorothy<br>\r\n<br>\r\n\"We go around town, and set challenges for each other. When a challenge is set, you have to announce what happens to you if the challenger if she succeeds, and what happens to the challenger if she fails. The only way to forfeit is to take off your costume.\" you declared<br>\r\n<br>\r\n\"What's the prize for most wins?\" asked Dorothy<br>\r\n<br>\r\n\"Dominance. The winner gets to call the shots for the rest of the night, starting when the party begins.\" you said<br>\r\n<br>\r\n\"So what kind of challenges will these be?\" she asked<br>\r\n<br>\r\n\"Ranging from embarrassing to pleasurable.\" you said<br>\r\n<br>\r\n\"Are there any ground rules?\" she asked<br>\r\n<br>\r\n\"Yeah. Nothing illegal, and no boys.\" you said<br>\r\n<br>\r\n\"Good.\" said Dorothy<br>\r\n<br>\r\nThe pair of you left the changing room and you paid the bill for the costumes. You both locked all of your previous clothes in your locker in the break room.<br>\r\n<br>\r\n\"So when do we start?\" asked Dorothy<br>\r\n<br>\r\n\"As soon as one of us issues a challenge.\" you replied<br>\r\n<br>\r\n\"Okay, why don't you go first.\" said Dorothy<br>\r\n<br>\r\nYou thought for a moment, before deciding on a good starting challenge.<br>\r\n<br>\r\n\"Do the splits. If you can't, then you have to pose as a Dorothy mannequin in the store for 10 minutes. If you succeed, I have to pose as an Alice mannequin for just as long.\" you said<br>\r\n<br>\r\n\"Okay.\" agreed Dorothy</span></div></div>",
            "created":1390453200,
            "id":1731753,
            "title":"You like her. Let her believe she won"
        },
        "1242121":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "You Win",
                "You Lose"
            ],
            "content":"<div class=\"\"><div> <span>The brunette girl took a few minutes to stretch before attempting her first challenge. First she knelt down, then extended one leg forward. She used her hands to balance as her crotch descended towards the floor. The more her legs spread, the higher the hem of the dress went. The scene before you made your nipples go hard. Especially when you noticed that Dorothy had also chosen to abandon her bra and panties. Dorothy strained harder, and with one final move, she pushed herself the rest of the way down. She had won the first challenge.<br>\r\n<br>\r\n\"I did it!\" she cheered triumphantly<br>\r\n<br>\r\n\"Congratulations. Not many girls can do that without practice.\" you said<br>\r\n<br>\r\n\"Thanks.\" she replied<br>\r\n<br>\r\nYou helped her up, but upon regaining her feet, she stumbled into you. You caught her in a close embrace, and enjoyed it for just a couple extra seconds before you helped her steady herself.<br>\r\n<br>\r\n\"I guess it's mannequin time for me.\" you said<br>\r\n<br>\r\n\"Actually, I have an idea for a double-or-nothing challenge. If you succeed, you get out of being a temporary mannequin. But if you fail, you have to be my personal, life-size Alice doll for my very own tea party. You'd have to hold still how I position you, and only move when I move you, for 30 minutes.\" said Dorothy daringly<br>\r\n<br>\r\n\"What's the challenge?\" you asked<br>\r\n<br>\r\n\"The challenge is for you to successfully hypnotize someone to put on an Alice costume and pose as a mannequin instead of you.\" she said<br>\r\n<br>\r\n\"Deal.\" you replied<br>\r\n<br>\r\nYou spent the next 5 minutes searching the shop for a pretty blonde girl to serve as an Alice mannequin instead of you. Finally you spotted someone that fit the profile. The only problem was that she was in a group of five girls. Fortunately, you noticed they were all ogling costumes that were clearly beyond their price range. A plan began to form in your head.<br>\r\n<br>\r\n\"Can I help you with anything?\" you asked the girls upon approach<br>\r\n<br>\r\n\"No, we're just window shopping.\" said the blonde<br>\r\n<br>\r\n\"You seem pretty intent on these costumes. What if I told you that you could earn a one-night rental each; on the house.\" you said<br>\r\n<br>\r\nThe girls looked at each other in disbelief.<br>\r\n<br>\r\n\"You'd really do that?\" asked the blonde's redheaded friend<br>\r\n<br>\r\n\"Sure, as long as you promise to return them tomorrow undamaged. You just have to do something for me first.\" you said<br>\r\n<br>\r\n\"What is it?\" asked one of the brunettes in the group<br>\r\n<br>\r\n\"Well we were supposed to do some live mannequin displays today, but the models we had lined up cancelled last minute. But I figure you girls can pass for models for a little while, right?\" you said<br>\r\n<br>\r\nThey all did another incredulous double take. The blonde girl was the first to compose herself.<br>\r\n<br>\r\n\"I think we can manage it.\" she said<br>\r\n<br>\r\n\"Excellent.\" you said<br>\r\n<br>\r\nYou collected each girl's choice costume, filed the paperwork, and put the costumes in an empty locker. You arranged 4 additional displays for a new model in addition to the Alice in Wonderland display. You gave the blonde an Alice costume, the first brunette received a Dorothy costume, the second brunette got a shrine maiden costume, the redhead was paired with the Ariel costume, and the last girl, who's hair was black, was given a Wonderwoman costume. You sent them all into the change rooms. Fortunately it seemed they were well prepared to dress up, because none of them had any problems with their costumes. <br>\r\n<br>\r\n\"I'm ready to go.\" said the blonde, upon exiting her change room<br>\r\n<br>\r\n\"Okay, but first I'm just going to perform a little calming hypnosis to help you keep still.\" you said<br>\r\n<br>\r\nShe nodded, and per your instruction counted back from ten with her eyes closed. You tapped her neck, and she was entranced.<br>\r\n<br>\r\n\"When I say the word Mannequin, you will freeze in place, perfectly still. You will feel the pass of time, and still be able to see, but you won't be able to move your eyes. You won't get bored or restless, you will only feel proud of your ability to keep still. You will be released from this state when you hear the word Halloween said in my voice.\" you instructed<br>\r\n<br>\r\nYou repeated this process on the other four girls once they finished changing. You put their normal clothing in the locker with the rented costumes, and put the key in the pocket of the blonde's Alice dress. You helped them with their poses, and whispered Mannequin in their ears. Finally, you recorded a message and set it to play on the PA system at 5:30. Finished with the task, you returned to Dorothy.<br>\r\n<br>\r\n\"That was pretty incredible. So I guess your hypnosis really does work on some people.\" commented Dorothy<br>\r\n<br>\r\n\"Yeah. So are you ready for your next challenge?\" you asked<br>\r\n<br>\r\n\"Yeah, what is it?\" asked Dorothy<br>\r\n<br>\r\nYou plucked two sets of cat ears and two bell collars out of a bin.<br>\r\n<br>\r\n\"We both put on these ears, collars, and blindfolds, and use hearing to be the first to snatch the other's ears. The winner chooses a new location to drive to, and the loser gets to spend the trip in a travel cage.\" you explained<br>\r\n<br>\r\n\"Let's get started then.\"</span></div></div>",
            "created":1390453200,
            "id":1731779,
            "title":"Dorothy Succeeds"
        },
        "12421211":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>You both stood facing each other in one of the back supply rooms. You had added the ears, collars, and blindfolds to your costumes, and were ready to begin.<br>\r\n<br>\r\n\"On the count of three. One, two, three!\" you announced<br>\r\n<br>\r\nWith the challenge underway, you heard the heels clicking on the floor as Dorothy ran in for a quick victory. You responded with a deft sidestep, and with a sweep of your arm, you felt her cat ears be knocked from her head. You removed your blindfold, and Dorothy did the same. She turned to you with a carefree smile.<br>\r\n<br>\r\n\"I guess you're my Mistress for now, nya.\" she declared<br>\r\n<br>\r\n\"It seems like it.\" you replied<br>\r\n<br>\r\nYou removed your cat ears and collar, and put Dorothy's back on her head. The two of you exited into the parking lot.<br>\r\n<br>\r\n\"I have a pet carrier in my trunk, nya.\" announced Dorothy</span></div></div>",
            "created":1391403600,
            "id":1738159,
            "title":"You Win"
        },
        "12422":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Family",
                "Friend"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is she with family or a friend?</span></div></span></div>",
            "created":1390366800,
            "id":1731673,
            "title":"With Someone"
        },
        "124221":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Seeing Double",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it her twin sister?</span></div></span></div>",
            "created":1390366800,
            "id":1731674,
            "title":"Family"
        },
        "1242211":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Option #1",
                "Option #2"
            ],
            "content":"<div class=\"\"><div> <span>You thought you were lucky when you saw her walk in. But then you saw an identical girl wearing different clothes come in after her. You decided it was worth the risk, and approached them.<br>\r\n<br>\r\n\"Excuse me, but would you lovely ladies like to try your chance at winning your costumes for free?\" you ask them<br>\r\n<br>\r\n\"What's the catch?\" they asked in unison<br>\r\n<br>\r\n\"It's actually very simple. You see, I'm an amateur hypnotist. I need willing participants so I can hone my skills.\" you said<br>\r\n<br>\r\n\"So all we have to do is not be hypnotized?\" asked the first twin<br>\r\n<br>\r\n\"That's right.\" you replied<br>\r\n<br>\r\nThey looked at each other, then back at you.<br>\r\n<br>\r\n\"Deal.\" they replied<br>\r\n<br>\r\nYou nodded, and lead them to the changing rooms in the back.<br>\r\n<br>\r\n\"I need some quiet for this to work.\" you explained<br>\r\n<br>\r\nActually, what you needed was privacy, but there was no need to tell them that.<br>\r\n<br>\r\n\"Close your eyes, and softly count backwards from 10.\" you told them<br>\r\n<br>\r\nThey did so. You stepped behind them, and tapped them on the neck as they finished counting down. They were entranced instantly.</span></div></div>",
            "created":1390366800,
            "id":1731676,
            "title":"Seeing Double"
        },
        "1243":{
            "author_id":"kitsune53",
            "author_name":"sharpshooter",
            "choices":[
                "Your House (Set Up A Base Of Operations)",
                "Their Houses (Go To The Homes Of Local Girls)",
                "More Options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices...<br>\r\n<br>\r\n-Your House (Set Up A Base Of Operations)<br>\r\n<br>\r\n-Their Houses (Go To The Homes Of Local Girls)<br>\r\n<br>\r\n-More Options</span></div></span></div>",
            "created":1390366800,
            "id":1731670,
            "title":"Other"
        },
        "12433":{
            "author_id":"shely",
            "author_name":"turtleguru",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about going to the mall?</span></div></span></div>",
            "created":1455429840,
            "id":2103861,
            "title":"More Options"
        }
    },
    "info":{
        "author_id":"kitsune53",
        "author_name":"sharpshooter",
        "brief_description":"You have a gift for seeing into and manipulating the human mind. Do you use it for good?",
        "created":1379376120,
        "description":"<td align=\"left\" class=\"norm\">You have always been gifted. Since you were a small child you were able to see into peoples' hearts and minds and read them like open books. When you were 12, you discovered the power of post-hypnotic suggestion. You have spent the years since perfecting this skill, and now, age 17, you're ready to take it into the field for your last year of high school.<br>\r\n<br>\r\nNotes:<br>\r\n-Main character likes girls<br>\r\n-Cannot hypnotize self<br>\r\n</td>",
        "id":1953297,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1564067340,
        "modified":1564067340,
        "pretty_title":"The New Mentalist"
    }
}