{
    "chapters":{
        "1":{
            "author_id":"wr1ter98",
            "author_name":"writer98",
            "choices":[
                "“Ready for the first day of college?”",
                "“This is my first day as a park ranger. Think you could help me out?”",
                "“I’m from the US. How about you?”",
                "Reader’s Choice",
                "Reader’s Choice"
            ],
            "content":"<div class=\"\"><div> <span>Jack opened his eyes, taking in the scenery around him. Having come from New York, he’d never seen so much nature in one place. He was awestruck at the lush, rolling hills and the white, puffy clouds; the closest thing he’d ever seen was Central Park, but even that didn’t compare. Finally, he took a deep breath, turned to the person next to him, and introduced himself.<br>\r\n<br>\r\n“Hi, I’m Jack...”</span></div></div>",
            "created":1524777720,
            "id":2484701,
            "title":"A new beginning "
        },
        "11":{
            "author_id":"wr1ter98",
            "author_name":"writer98",
            "choices":[
                "Kara",
                "Janice",
                "Brooklyn",
                "Amelia Jackson",
                "Reader’s Choice"
            ],
            "content":"<div class=\"\"><div> <span>Having wandered around the campus for a few hours, Jack cast his eyes over the seemingly endless landscape. He had been exploring the area for several hours, and had several more to kill before then big start-of-year assembly. He’d said hi to a few people, but hadn’t had a conversation lasting more than 5 minutes. Seeing a pretty young woman reading on a bench, he decided to go up and introduce himself. <br>\r\n<br>\r\n“Hi, I’m Jack. What's your name?”<br>\r\n<br>\r\n<br>\r\n<br>\r\nThe woman is:<br>\r\n<br>\r\n<br>\r\nKara<br>\r\nFreshman<br>\r\nBlack hair, average size and looks<br>\r\nFriendly and nervous <br>\r\nMajoring in biology (studying to be a doctor)<br>\r\n<br>\r\n<br>\r\nJanice<br>\r\nSophomore <br>\r\nLong, blonde hair, curvy body<br>\r\nFlirty<br>\r\nMajoring in accounting <br>\r\n<br>\r\n<br>\r\nBrooklyn<br>\r\nJunior <br>\r\nLong brown hair, smaller breasts, great ass<br>\r\nSarcastic, enjoys making sexual comments, die-hard feminist<br>\r\nMajoring in drawing (is an incredible artist)<br>\r\n<br>\r\n<br>\r\nAmelia Jackson<br>\r\nTeacher <br>\r\nShort brown hair, stylish cut, busty, very pretty face<br>\r\nStrict but fair, has a sense of humor <br>\r\nEnglish teacher<br>\r\nJust broke up with her boyfriend<br>\r\nIn her late 20s</span></div></div>",
            "created":1527640740,
            "id":2500527,
            "title":"“Ready for the first day of college?”"
        },
        "113":{
            "author_id":"wr1ter98",
            "author_name":"writer98",
            "choices":[
                "The next morning...",
                "Meeting Izzy",
                "Reader’s Choice"
            ],
            "content":"<div class=\"\"><div> <span>She was sitting on the wall of a large planter with a tree in the middle. She didn’t look up, not breaking her concentration from her sketchpad.<br>\r\n<br>\r\n“Uh, I’m Jack. Hi,” he tried again.<br>\r\n<br>\r\n“Not interested.”<br>\r\n<br>\r\n“Sorry, you just looked like an interesting person.”<br>\r\n<br>\r\nShe sighed. “Look, buddy, I don’t... where are you?”<br>\r\n<br>\r\n“Down here,” Jack said, not for the first or the last time. She followed the sound of his voice, eventually finding his tiny form. Jack gave a slight wave.<br>\r\n<br>\r\nHe could see her eyes glaze as she went through The Process: trying to figure out if she was hallucinating, wondering if she was dreaming, searching for something to say, etc. He’d seen that look as much as his own reflection.<br>\r\n<br>\r\n“You’re not hallucinating. There really is a three-inch man at your feet. I’m Jack.”<br>\r\n<br>\r\n“Uh, Brooklyn,” she said, reaching down with her pinky. You shook it. “Is this your first day, Jack?”<br>\r\n<br>\r\n“Yep. I’m still trying to figure this place out.”<br>\r\n<br>\r\nBrooklyn gave a slight laugh. “Same, and this is my third year. You need any help?”<br>\r\n<br>\r\n“I was hoping to find a ride to orientation. Would you be willing to be that ride?”<br>\r\n<br>\r\n“Sure.” She smirked. “You’re welcome to ride me.”<br>\r\n<br>\r\nShe lowered her hand, and Jack climbed on. She set him down next to her on the wall and picked up her artwork.<br>\r\n<br>\r\n“I’ll be ready to go in like five minutes, just let me finish this real quick and then we can go.”<br>\r\n<br>\r\n“That’s fine, no rush.”<br>\r\n<br>\r\nWhile Brooklyn finished, Jack took the opportunity to get a good look at her. She had long brown hair which almost reached her waist, framing her face and intense brown eyes. She had (comparatively) small breasts (though they were still huge to you) and a magnificent ass. She was wearing jeans and a brown leather jacket over a black Metallica shirt. She wore little to no makeup —Jack couldn’t tell which— but she didn’t need it. Blushing, Jack realized his little trooper had made an appearance. He was suddenly glad she was focused on her art and not him.<br>\r\n<br>\r\n“Ok, I’m ready,” Brooklyn said, closing her sketchpad. “It might be dangerous to carry you in my hand, so how about my jacket pocket?” <br>\r\n<br>\r\n“Sure, anywhere’s fine. I’m pretty much indestructible. Believe, me, after 18 years, I know.”<br>\r\n<br>\r\nShe laughed, slipping him into a jacket pocket near her waist. It was shared by a large eraser almost half his height.<br>\r\n<br>\r\n“Ready?” She called.<br>\r\n<br>\r\nJack poked his head out. “Ready.”<br>\r\n<br>\r\nThey headed over to the auditorium, where orientation was being held. On the way they talked about various college classes, with Brooklyn recommending some and not others. Jack listened, but he also made an effort to make his erection go down. He didn’t want to be caught with an erection in the pocket of a girl he barely knew, and he definitely wasn’t going to rub one out. After a few minutes of thinking about his turn-offs, it went away, to his relief. <br>\r\n<br>\r\nFinally, they arrived at the auditorium. The receptionist was a little old lady who looked like she’d been there since the university’s founding. <br>\r\n<br>\r\n“Name?” the old lady asked I’m a deadpan voice.<br>\r\n<br>\r\n“Uh, I’m Brooklyn Calvert, bringing Jack...”<br>\r\n<br>\r\n“Baker,” Jack chimed in, “Jack Baker.”<br>\r\n<br>\r\n“Ok. Enjoy the orientation.” The old lady looked like she couldn’t care less about whether or not he enjoyed the orientation.<br>\r\n<br>\r\nThe orientation itself was pretty dull. Much of it was about the importance of community and respect and a bunch of other stuff no one cared about. It didn’t help that in the blistering August hear, it was pushing triple digit heat. Jacks mind wandered, but he snapped back to reality when he looked up at Brooklyn working on another piece and realized she wasn’t wearing a bra.<br>\r\n<br>\r\n<i>No big deal, </i>he told himself. <i>It’s a bra. Not like she’s naked.</i><br>\r\nBlushing, he turned back to the presenter and tried to focus, failing miserably. <br>\r\n<br>\r\nAfter what seemed like an eternity, the presentation was over. All the new freshmen filed out with the same lack of enthusiasm that they’d entered with. <br>\r\n<br>\r\n“So,” said Brooklyn, putting her sketchpad back in her bag and turning to face Jack, “What’s next?” <br>\r\n<br>\r\n“Well, most of the freshmen are getting roommates now, but the university didn’t assign me a place to stay. I guess they figured I’d find one on my own.”<br>\r\n<br>\r\n“Well, I have an apartment that I share with a roommate. If you’d like to stay with us you’re welcome to. You don’t look like you take up a lot of space, and I know Izzy’d love to split the rent three ways instead of two.” Brooklyn gave you an indecipherable look.<br>\r\n<br>\r\n“Uh, sure, that won’t be a problem. We’ll just need to swing by the administrative building to grab my stuff.”<br>\r\n<br>\r\n“No problem,” she said, smiling. <br>\r\n<br>\r\nAn hour later you were settling into your new apartment. It was a studio apartment, with Brooklyn and her roommate’s spaces separated by bookshelves. It looked like what he’d expected of an artist’s space: lots of art hanging, both Brooklyn’s and other artists. It was kind of messy, with dirty laundry on the floor and unwashed dishes in the sink. <br>\r\n<br>\r\n“Sorry for the mess,” Brooklyn apologized, “We didn’t know there’d be anyone else here.”<br>\r\n<br>\r\n“No worries. I’ve seen worse,” Jack assured her.<br>\r\n<br>\r\nBrooklyn looked around. “I don’t think we have a space for you just yet, but I’m sure we can carve out something. Are you hungry?”<br>\r\n<br>\r\nJacks stomach rumbled loud enough to be heard across the ocean. “A bit.”<br>\r\n<br>\r\n“I’ll get something started. Hey, Izzy!” Brooklyn called, “I’m making dinner! Want anything?” There was no response. “She must be in the zone. She gets like that when she’s working on her art.”<br>\r\n<br>\r\nBrooklyn picked Jack up and carried you to the kitchen counter, where she set you down. She walked to the mini fridge and bent over to look inside, giving you another look at her gorgeous ass. <br>\r\n<br>\r\n“She’s an artist too?” Jack asked.<br>\r\n<br>\r\n“Mmhmm. That’s how we met. We took a ceramics class together, which we both <i>hated</i>. We kind of bonded through our mutual suffering.”<br>\r\n<br>\r\n“Cool,” Jack said, since he had no idea how to respond to that.<br>\r\n<br>\r\nTen minutes later Jack and Brooklyn sat down at the table (which was just an old wooden crate) with a plate of eggs. Jack walked over to the plate and took a bite, making a face. They were over cooked to the point of being inedible, and there was enough salt in them to recreate the Dead Sea. <br>\r\n<br>\r\n“Yeah, they’re not the best, are they. I’m not a great cook, but believe me,” Brooklyn said, taking a bite and mirroring Jack’s disgust, “Izzy’s worse.”<br>\r\n<br>\r\nAfter dinner Jack and Brooklyn watched Netflix on Brooklyn’s iPad, since the tv had been broken in an indecent involving oranges, a candlestick, and a fuckton of butter. Jack decided not to ask.<br>\r\n<br>\r\nAt one point Jack looked up at Brooklyn, who was again drawing. Half an hour later she fell asleep, and her sketchpad fell next to him, showing a picture of Jack on her lap. He smiled, finally falling asleep.</span></div></div>",
            "created":1528904340,
            "id":2506614,
            "title":"Making friends and influencing art"
        },
        "1132":{
            "author_id":"wr1ter98",
            "author_name":"writer98",
            "choices":[
                "“I can probably cook something up for you.”",
                "“There’s nothing to eat here, let’s go get breakfast.”",
                "Reader’s Choice"
            ],
            "content":"<div class=\"\"><div> <span>A sudden clattering woke Jack up suddenly, followed by a string of expletives. He looked around, trying to figure out where he was before remembering the previous night’s events. He looked over st the direction of the sound and saw Brooklyn’s roommate, Izzy.<br>\r\n<br>\r\nShe was dressed in old pajamas covered by a pink bathrobe. She was African-American, and, from what Jack could tell, quite tall, though he wasn’t the best person to be the judge of that. She was picking up and stacking a bunch of pots and pans that she had apparently knocked over. <br>\r\n<br>\r\n“Uh, hi!” he called loudly. She didn’t seem to hear him. “Hey!” He yelled louder. She looked over at him.<br>\r\n<br>\r\n“Wha- who are you?” she said, walking over.<br>\r\n<br>\r\n“I’m Jack. I needed a place to stay, and Brooklyn said you were looking to split the rent three ways.”<br>\r\n<br>\r\nShe opened her mouth to speak and then closed it, apparently thinking.<br>\r\n<br>\r\n“Ok then,” she said finally, “As long as you pay one third of the rent, you can stay here.”<br>\r\n<br>\r\n“Deal.”<br>\r\n<br>\r\n“Great,” she said, getting up, “I’m Izzy, by the way. Izzy Clark.”<br>\r\n<br>\r\n“Nice to meet you,” Jack said, “Um, do you have anything to eat here?”<br>\r\n<br>\r\n“Well...”</span></div></div>",
            "created":1538949300,
            "id":2560574,
            "title":"Meeting your new roommate "
        },
        "11322":{
            "author_id":"wr1ter98",
            "author_name":"writer98",
            "choices":[
                "They ran into Izzy’s ex",
                "Nothing significant happens",
                "Reader’s Choice"
            ],
            "content":"<div class=\"\"><div> <span>“I’m actually not much of a cook,” Izzy said with a shrug, “One time I tried to cook Brooklyn an apology breakfast... long story short we ended up in the ER with one sprained ankle and fifteen stitches between us.”<br>\r\n<br>\r\n“Maybe let’s not reenact that.”<br>\r\n<br>\r\n“Agreed. The dining hall opened about half an hour ago, want to snag something there?”<br>\r\n<br>\r\n“Sure.”<br>\r\n<br>\r\n“Great. Um, how do I...?”<br>\r\n<br>\r\nJack gave a little laugh. <br>\r\n<br>\r\n“Just be gentle, really. You can put me in a bag or your pocket, whatever works.”<br>\r\n<br>\r\nIzzy thought for a moment, then seemed to get an idea. <br>\r\n<br>\r\n“Wait here,” she said.<br>\r\n<br>\r\nShe dashed off, and Jack heard her rummaging somewhere. A minute later she returned with a huge pair of hoop earrings.<br>\r\n<br>\r\n“Ever ridden in an earring?” Izzy asked with a smile.<br>\r\n<br>\r\n“Can’t say that I have,” Jack admitted, “You sure that’s safe?”<br>\r\n<br>\r\n“Nope,” Izzy said, her smile growing.<br>\r\n<br>\r\n“Good enough for me,” Jack chuckled.<br>\r\n<br>\r\nIzzy ducked into her room (bookshelf-space?), emerging soon after wearing sweatpants and an old KMFDM shirt, which made the earrings look as out of place as a elephant in California. She picked Jack up and set him in the left earring. She let go of him, holding her hand under him in case he fell. <br>\r\n<br>\r\n“Huh. I wish I’d thought of this year’s ago. Would’ve saved me a lot of hassle,” Jack said.<br>\r\n<br>\r\n“You set?”<br>\r\n<br>\r\n“Yeah. Let’s go.”<br>\r\n<br>\r\nThey walked (or rather, Izzy walked) to the dining hall, Izzy pointing out various buildings and landmarks on the way. A few people did a double take, but the walk passed without incident.<br>\r\n<br>\r\nWhen they got to the dining hall, Jack discovered, to his delight, that it was a buffet format. He and Izzy agreed to get a little of everything, because, as she said, “The food here’s like Russian Roulette. You never know what you’re getting.”<br>\r\n<br>\r\nThe dining hall was almost full, but they found an empty table and sat down. Jack walked around the edge of Izzy’s plate, sample food as he went. She was right; some of the food was quite decent, while some of it wasn’t fit for a dog to eat.<br>\r\n<br>\r\n“So do you know your major?” said Izzy, the sound muffled by the pancake in her mouth. <br>\r\n<br>\r\n“Haven’t decided. I like literature, but I don’t know what I’d do with a degree in it. My parents are pushing me to a career in law, but that’s not really my taste, you know?”<br>\r\n<br>\r\n“Absolutely. But don’t worry about getting it figured out just yet. I thought I was going into sculpture. Took one class and found out I hated it. Now I’m painting and I’ve never been happier. You’ll find your passion.”<br>\r\n<br>\r\nAfter breakfast they cleared up and started heading back to the apartment. On the way...</span></div></div>",
            "created":1547918280,
            "id":2604845,
            "title":"Tracking down breakfast"
        },
        "113221":{
            "author_id":"wr1ter98",
            "author_name":"writer98",
            "choices":[
                "It’s the police. They’ve arrested Dave, and they need Izzy’s statement.",
                "It’s the police. They’re here to arrest Izzy.",
                "It’s the Dean of Students."
            ],
            "content":"<div class=\"\"><div> <span>After breakfast they started back to the apartment. Izzy pointed important buildings and landmarks on the way.<br>\r\n<br>\r\n“That’s Crescent Hall. It’s not technically named that, but everyone calls it that anyway. Best place to get or give tutoring. That over there’s Bailey Field. Basically stoner central, so I’d stay away if I were you.”<br>\r\n<br>\r\n“Yeah. Life’s hard enough when you’re tiny, but it’s a lot harder if the people around you aren’t sober.”<br>\r\n<br>\r\n“I be- hey!” Someone knocked into Izzy’s shoulder. Jack managed to grab the earring in time and steady himself. “Watch it, asshole!”<br>\r\n<br>\r\n“Sorry, sorry... oh, hey, Izzy! How’s it going?”<br>\r\n<br>\r\nJack looked at the man. He was either an older student or a very young professor, though no professor would have been caught dead wearing stained sweatpants and a snapback. He had light brown hair that was cut short, but whoever had done it had left it uneven. When he grinned, Jack could see a chipped front tooth.<br>\r\n<br>\r\n“Fuck off, Dave.”<br>\r\n<br>\r\nHe laughed. “Well that’s not very nice, is it?”<br>\r\n<br>\r\n“I guess you just bring that out in me. Can you go now?”<br>\r\n<br>\r\nIzzy moved to keep walking, but Dave got in front of her.<br>\r\n<br>\r\n“Hey, baby, I only want to catch up. I just-”<br>\r\n<br>\r\nIzzy’s foot swing up and hit him between his legs. Dave fell to the ground, clutching his crotch.<br>\r\n<br>\r\n“You bitch! You fucking cunt! I’ll kill you! I-”<br>\r\n<br>\r\nIzzy got out her phone and started recording Dave’s threats, which got more and more violent. A crowd started to gather.<br>\r\n<br>\r\n“-and your whole fucking family! Huh? Are you recording this?”<br>\r\n<br>\r\n“Yep.” Izzy tapped the screen. “And I just sent it to the Dean. If you feel like damage control, now would be the time. Otherwise I’d just start packing.”<br>\r\n<br>\r\nDave looked terrified, but didn’t say anything. After a moment he ran off, leaving Izzy and Jack behind. Sensing that the drama was over, the crowd started to disperse. Izzy exhaled.<br>\r\n<br>\r\n“You ok?” she asked.<br>\r\n<br>\r\n“Yeah, I’m ok. What was that?”<br>\r\n<br>\r\n“That would be my ex-boyfriend. We dated for a few weeks my freshman year, his sophomore, but I figured out pretty quick he was a creep. He’s been stalking me ever since.”<br>\r\n<br>\r\n“Yikes.”<br>\r\n<br>\r\n“Yeah. But now I’ve got evidence, so they’ll have to listen to me.”<br>\r\n<br>\r\nThey returned home to find Brooklyn painting. She was wearing baggy clothes which seemed to be more paint than fabric. She had rock music blaring, and seemed oblivious to their entrance. Izzy walked over and turned the music off.<br>\r\n<br>\r\n“Excuse me? Why- uh oh. What happened?”<br>\r\n<br>\r\nJack and Izzy filled her in.<br>\r\n<br>\r\n“Hey, at least you have proof. He can’t exactly accuse you of lying.”<br>\r\n<br>\r\nThere was a knock at the door.</span></div></div>",
            "created":1557532560,
            "id":2658119,
            "title":"The dreaded Dave"
        }
    },
    "info":{
        "author_id":"wr1ter98",
        "author_name":"writer98",
        "brief_description":"Life of a three-inch man",
        "created":1524776760,
        "description":"<td align=\"left\" class=\"norm\">Main character is Jack. He was born small, but has survived because he is, to the best of his knowledge, indestructible (yes, I know this is cliche, but just roll with it).<br>\r\n<br>\r\nThe giantesses in this story aren’t supposed to be sadistic or evil. They can be angry (because that’s a natural human emotion), but they aren’t James Bond villains. They’re just people. I’d prefer them to be written in a more gentle light, but how far you take that is up to you.<br>\r\n<br>\r\nThe purpose of this story is to give an alternative to people like myself who have been dissatisfied with other interactives. I want this to be a character-driven experience. Please follow the rules and have fun!<br>\r\n<br>\r\n<br>\r\nWhat is allowed<br>\r\n-pussy play<br>\r\n-ass play (keep it to a minimum)<br>\r\n-mouth play (no killing)<br>\r\n-boob play<br>\r\n<br>\r\n<br>\r\nWhat isn’t allowed<br>\r\n-other men (nothing against men, they just aren’t my type)<br>\r\n-feet<br>\r\n-humiliation/torture<br>\r\n-farting<br>\r\n-digestion<br>\r\n-death<br>\r\n-unaware<br>\r\n-underage (all characters must be at least 18)<br>\r\n-incest (yuck)<br>\r\n-bad writing/grammar<br>\r\n-BBW<br>\r\n-rape<br>\r\n<br>\r\nPlease keep the story in 3rd person (Jack did that, Jack did this, etc.)</td>",
        "id":2156511,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1557533940,
        "modified":1557533940,
        "pretty_title":"Tiny life"
    }
}