{
    "chapters":{
        "1":{
            "author_id":"miradesh",
            "author_name":"Heresh",
            "choices":[
                "a girl in a girls' school",
                "a girl in a mixed school",
                "a boy in a boys' school",
                "a boy in a mixed school"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you? You're...</span></div></span></div>",
            "created":1304139600,
            "id":1097706,
            "title":"Who are you?"
        },
        "11":{
            "author_id":"miradesh",
            "author_name":"Heresh",
            "choices":[
                "You try to talk to her more",
                "You walk around and see who you can find",
                "You go and talk to the girls out front"
            ],
            "content":"<div class=\"\"><div> <span>You walk carefully up the steps to the boarding school, girls giggling as you pass them. You find it shocking how short their skirts are; they're only just below their thighs! You feel more nervous now at the idea of wearing a skirt that high. Thank God it's an all girls' school otherwise I'd have boys gawking at me. <br>\r\n<br>\r\nYou enter the main doors and head up to the desk. A girl was sitting behind the desk her legs up on it. Her panties were showing even though her legs were crossed. Her breasts were straining against her blouse, the top three buttons undone.<br>\r\n<br>\r\n\"Hey, you must be new. I'm Belinda. I'm head girl. If you want your things you can ask some girls around the place where to go. Bye,\" she tells you simply before returning to her glossy magazines.</span></div></div>",
            "created":1304398800,
            "id":1099334,
            "title":"a girl in a girls' school"
        },
        "112":{
            "author_id":"kmiles",
            "author_name":"Kate Miles",
            "choices":[
                "Regain your voice. Tell the girl your name. ",
                "Faint ",
                "Liz catches you staring and drags Alise away before you finish. "
            ],
            "content":"<div class=\"\"><div> <span>\"What a bitch.\" You think as you leave the head girl behind. You step a little further into the hallway looking down each corridor as you pick at a loose string around the button of your blouse, a nervous habit your stepmother hated. You decide to take the left hallway and walk straight into a group of girls, spilling one's books across the floor.<br>\r\n<br>\r\n\"Watch it you stupid cunt!\" The larger of the three shouts. She grabs you by the shirt collar and forces you to the floor. \"Pick them up you clumsy bitch,\" <br>\r\n<br>\r\nYou begin gathering the books when two small hands join yours. \"What beautiful hands,\" you think. You had never before thought hands could look beautiful but it was the only way you could describe them long lean fingers meant to dance along piano keys. \"Or my thighs. What am I thinking? I...I don't like that...I have a boyfriend.\" Quickly, you hurry to finish picking up the books and stand and almost shove them in the big girls hands. You keep you eyes down the whole time. <br>\r\n<br>\r\n\"God, you are a stupid bitch.\" The big says. You look up at her towering over even your impressive 5'6\" stature. Blue eyes glint back at you over sunburned, freckled cheeks. \"Give the books to Alise, they're hers.\" <br>\r\n<br>\r\nYou mechanically retrieve the books and hand them to the next girl. As you place the books into her hands you notice that they are THE hands, unable to resist you look up into the face of the girl before you. The beauty you hand seen in her hands was magnified ten fold in her face. Midnight black hair framed a flawless oval face, her hair tapered down towards her shoulders and curled temptingly on her breasts. A small bow shaped mouth blossomed in a smile that reached all the way to her deep green eyes. You released your breath unaware that you'd been holding it in. <br>\r\n<br>\r\n\"Liz,\" the goddess Alise says, \" don't be so mean to her. She's probably new. What's your name, honey?\" <br>\r\n<br>\r\nYou find it difficult for a moment to wet your mouth enough to speak.<br>\r\n<br>\r\n\"My...my name's...\"</span></div></div>",
            "created":1304658000,
            "id":1101249,
            "title":"You walk around and see who you can find"
        },
        "1122":{
            "author_id":"miradesh",
            "author_name":"Heresh",
            "choices":[
                "Continue exploring",
                "Go after Alise"
            ],
            "content":"<div class=\"\"><div> <span>You feel your legs go from under you and the next thing you know you're lying on the floor. You stare up at the girls in surprise.<br>\r\n<br>\r\n\"Are you okay?\" Alise asks, looking down at you. The other one, Liz, is looking down at you in disgust. <i>Oops she knows why you fainted,</i> you think worriedly.<br>\r\n<br>\r\n\"I'm fine,\" you whisper, sitting up slowly. \"I'm just dehydrated but I'm okay, honest.\" Liz rolls her eyes and tries to drag Alise away.<br>\r\n<br>\r\n\"She's obviously a lesbian. She looks like she's fallen in love with you or something,\" Liz hisses, pulling on Alise's arm.<br>\r\n<br>\r\n\"Don't be silly,\" Alise says back as she's being dragged down the corridor. \"I'll see you around, okay?\" Alise calls to you before disappearing around the corridor.</span></div></div>",
            "created":1305176400,
            "id":1104828,
            "title":"Faint "
        },
        "11221":{
            "choices":[
                "Fall in love"
            ],
            "content":"<div class=\"\"><div> <span><i>Fuck, I'm gonna die here!</i> You think as you turn another sharp corner. You follow the deep carpet through the corridors, glancing through all the windows in the doors. Finally, you find a bright red door with the word <b>Library</b> painted on in thick black paint.<br>\r\n<br>\r\nThe library was warmer than you had hoped. It was a cosy little place. The shelves and cupboards were full of thick and thin books. The carpet was a bright red, and the wallpaper was pastel yellow. Beanbags of purple and pink were all over the place, and there was several desks for studying and writing. You shrug out of your jacket and hang it up on a blue hook, where other coats were hung. You flop down onto a pink beanbag and grab a thick brown book from the shelf. It's about Physics, your best subject, so you instantly become hooked.<br>\r\n<br>\r\n\"Oh look, the bitch came back!\" You hear a familiar voice snigger. You look up and see Liz with her gang looking at you. You instantly blush and try to hide it, but Liz spots it. \"What's the matter, sugarplum? Your baby book to hard?\" Liz snatches the book out of your hands and tosses it over her shoulders.<br>\r\n<br>\r\n\"Yo, Liz, stop teasing her!\" A shadow leaps in front of you. Liz leaves and the shadow turns around.<br>\r\n<br>\r\nA girl, with flaming red hair and pale skin is in front of you. She's wearing a white furry jacket, black trousers and blue shoes. <br>\r\n<br>\r\n\"Hi, I'm Nikki.\" She says.<br>\r\n<br>\r\nYour first thought - <i>Fuck, oh, fuck. She's sexy!</i></span></div></div>",
            "created":1305262800,
            "id":1105192,
            "title":"Library Girl"
        },
        "113":{
            "author_id":"miradesh",
            "author_name":"Heresh",
            "choices":[
                "Get her to show you around",
                "Get her to introduce you to some people"
            ],
            "content":"<div class=\"\"><div> <span><i></i>You stare at Belinda for a few more moments but it's obvious that that's all the interaction you're going to get from her. You stand at the desk wondering which way you should go. You finally come to the decision to go back out to the front rather than walking around the school getting lost. You sigh as you walk back outside, regarding the girls near you nervously. <i>They look really intimidating... not to mention gorgeous</i>, you think, glancing at yourself self-consciously. <br>\r\n<br>\r\nYou aren't ugly or anything but you do wish your 34B breasts were larger and that you were a few inches taller than your 5' 4\" stature. These girls though looked like they'd just stepped out of glossy magazines. Flawless skin, full lips, perfect breasts and tall to top it off. They're watching you with curiosity but you can see some of them looking at you critically. Despite your self-consciousness and nerves, you walk towards them and smile shyly.<br>\r\n<br>\r\n\"Uh, hi. I'm new,\" you whisper, suppressing a wince. <i>Way to state the obvious</i>, you think. You really can't see this going well. One of the girls, however, smiles at you and you feel the butterflies in your stomach increase. Her white blonde hair falls in waves to her shoulders and her green eyes seem to gaze into your very soul. You feel yourself blush.<br>\r\n<br>\r\n\"Hi. I'm Melanie,\" she tells you, her smile making your heart melt. You realise now that you might be bi and not hetreo as you'd always thought. This girl is really getting to you in a way no girl, or guy for that matter, ever has. \"And you are?\" she asks as the other girls look on.<br>\r\n<br>\r\n\"My name's Miradesh,\" you reply, you can't help but hate your name for once. She raises her eyebrows but she doesn't comment, which makes you feel better.<br>\r\n<br>\r\n\"Would you like me to show you around or introduce you to some people?\" Melanie asks you softly. Her friends, you notice, seem to have drifted away.</span></div></div>",
            "created":1308718800,
            "id":1132229,
            "title":"Friends?"
        },
        "1131":{
            "choices":[
                "Turn around to Melanie to see what she's up too",
                "Keep your face away and go into the bathroom"
            ],
            "content":"<div class=\"\"><div> <span>\"Erm...where's Room 4C?\" you ask, desperate for your blush to fade from your cheeks. Using your hair to hide your embarrassed face, she raises one pallid finger and beckons you to follow her; she pushes through a muster of chattering girls and pulls open a heavy door, revealing a carpeted, spiralling staircase. You rush after her, not cutting through the crowd as easily as she did, and yank open the door yourself. Instantly greeted by a vile smell of hair spray, flavored lipstick and deodorant waltzing round, Melanie and yourself hop up the stairs and (more yourself than Melanie) stumble up a seemingly endless corridor. <br>\r\n          \"Here we go!\" says Melanie, pointing at a simple wooden door, and your shaking hand grips the ice cold, brass doorknob. After a deep breath, you push open the door with all your might. The room is neat and tidy, yet very bright. The walls are a dusky amber, the ceiling bright magenta with lime green swirls; two single beds are positioned close to each other, cloaked in a sky blue duvet; a small varnished desk and chair are next to a large, dust-caked window and two plump armchairs are plastered to the violet carpet it random places. A door leads off to what you presume (and hope) is the bathroom.<br>\r\n          \"It's a nice place,\" you manage to squeak out, and dump your suitcases on a bed, crumpling the once-neat quilt.<br>\r\n          \"Yeah, it is.\" Melanie replies, shrugging her slim, square shoulders. As you look at her, you can't help but undress her in your head. Any boy would be happy to fuck her, to slide themselves into her, to listen to her rhythmic moans. Infact, you would. If you could.<br>\r\n          Shaking your perverted thoughts from your head, you turn to unzip your case. And as you drag the zip across, you hear the unmistakeable sound of a door being locked.</span></div></div>",
            "created":1350622800,
            "id":1449778,
            "title":"Get her to show you around"
        },
        "11311":{
            "choices":[
                "Turn round and ask what's going on",
                "Let her carry on"
            ],
            "content":"<div class=\"\"><div> <span>Your ears pricked up, you instantly spin around to see Melanie leaning against the door, hand lingering on the door knob, staring at you like you're a meal. You notice that the first two buttons of her white shirt are undone, revealing the top of her beautiful, perfectly-shaped breasts and her hot-pink bra, which is definitely shifted and out-of-place. Suddenly, her expression changes to a sweet smile, showing off the square pearls in her gums.<br>\r\n          \"Oh, sorry, my hand slipped. If you turn the doorknob left, it locks,\" she explains, she instantly unlocks the door. Satisfied, you pull open the lid of your suitcase and draw out your collection of clothing, which is the complete opposite of all the sexy, showing outfits the others wear. Cradling a stack of shirts, you pull open the first drawer of your bedside table and stuff them in. \"Want a hand with packing?\" Melanie asks, and you nod before you can stop yourself.  She scoops up handful of clothes and just pummels them into the second door, creasing them all, but you don't care. It takes effort to draw your eyes from her anus.<br>\r\n          You bend down yourself to reach the third drawer, and you feel a pelvis brush against your backside in a slow humping motion. </span></div></div>",
            "created":1350622800,
            "id":1449781,
            "title":"Turn around to Melanie to see what she's up..."
        },
        "12":{
            "author_id":"miradesh",
            "author_name":"Heresh",
            "choices":[
                "Left, to get your things",
                "Right, to the library",
                "Straight, to the common room",
                "Back to talking to the head girl"
            ],
            "content":"<div class=\"\"><div> <span>You walk up to the main doors of your new boarding school clutching your suitcase tightly as a shield. You pause and take a deep breath before  pushing open the doors and heading up to the reception desk. You see a girl behind the desk with her back to you. She appears to be rooting in the drawers.<br>\r\n<br>\r\n\"Um, excuse me?\" you manage to squeak. The girl turns around and smiles at you. You notice that she's wearing a uniform so she must be a student. She's attractive with wavy blonde hair down to her shoulders, bright green eyes and large breasts straining against her blouse. A head girl badge was to her blouse.<br>\r\n<br>\r\n\"Ah you must be that new girl I was told about,\" she says smiling. \"One second while I get your file, it has your book list and everything else you need in it.\" She turned back to the filing cabinets and fished around in it, returning a second later with your file.<br>\r\n<br>\r\n\"There you go. Now there are signs all around the school but just to give you a bit of a start I'll give you some directions. If you go down the corridor and turn left you'll be able to get your uniform, books and an assigned locker and your room. Or if you go right, you'll end up in the library and if you were to go straight on, you'll arrive in the common room. Have fun mingling!\" she smiles brightly before shooing you down the corridor. <br>\r\n<br>\r\nYou pause, trying to decide where to go. You finally decide to go...</span></div></div>",
            "created":1304226000,
            "id":1098174,
            "title":"A Fresh Start"
        },
        "13":{
            "author_id":"tessz",
            "author_name":"Zack T.",
            "choices":[
                "Butch introduces Joey to the rest of the football team",
                "They never make it to the dining hall",
                "They sit by themselves at the dining hall"
            ],
            "content":"<div class=\"\"><div> <span>Starting any new school is tough. Starting in mid-year is even tougher. Being the new guy in an all-boys boarding school when you are 15 years old and still haven't gotten your growth spurt can be pure hell.<br>\r\n<br>\r\nThat's what was going through Joey's mind as he unpacked his stuff in his new room. He didn't know anyone at this school and hadn't even met his roommate yet. His parents dropped him off here, and he got directions about where to go, but no one was in the room when he got there.<br>\r\n<br>\r\nHis thoughts were interrupted when the door opened, and a 6-foot, muscle-bound 16-year old in a football uniform came in. He stopped abruptly.<br>\r\n<br>\r\n\"Who the fuck are you?\" he demanded.<br>\r\n<br>\r\n\"I'm Joey. I'm just starting today, and they told me this would be my room. I guess we're roommates.\"  <br>\r\n<br>\r\nThe other boy looked at him uncertainly for a moment before answering. \"I'm Butch. Sorry to react that way, but I wasn't expecting anyone to be here.\"<br>\r\n<br>\r\n\"It's ok. I understand.\"<br>\r\n<br>\r\nButch closed the door behind him and began stripping off his football uniform. \"I'm in a bit of a hurry,\" he explained. \"Practice ran late, and it's almost time for dinner.\"<br>\r\n<br>\r\nJoey felt uncomfortable. He had never shared a room with anyone before, and he was rather modest about nudity. The fact that Butch was getting undressed in front of him was not something he was prepared for. He tried to cover it, though, and act casual.<br>\r\n<br>\r\nAs they made small talk, Butch slipped off his pants and jockstrap, revealing an 8-inch penis. Joey's mouth fell open in mid-sentence.<br>\r\n<br>\r\nButch looked up to see why Joey stopped talking and found him staring at his crotch. He didn't say anything, but appraised Joey with a new look in his eyes. Grabbing his towel he retreated into the bathroom for a shower, leaving Joey to sit on the edge of the bed and try to collect his thoughts.<br>\r\n<br>\r\nA few moments later, Butch was back, freshly showered. He seemed to make a big show of taking his towel off and parading around the room naked before finally getting dressed for dinner. Joey tried not to stare, but he found the sight strangely captivating.<br>\r\n<br>\r\nAs soon as Butch finished getting dressed, he asked Joey to come with him to get dinner.</span></div></div>",
            "created":1362546000,
            "id":1545095,
            "title":"a boy in a boys' school"
        },
        "131":{
            "author_id":"taytaywilliams",
            "author_name":"taytaywilliams",
            "choices":[
                "He hands you panties",
                "He hands you pills",
                "He pulls out his penis"
            ],
            "content":"<div class=\"\"><div> <span>\"Would you like to meet the rest of the team?\" Butch asks, \"We're looking for someone like you.\"<br>\r\n<br>\r\n\"I'm way to skinny to play football.\" Joey responds confused.<br>\r\n<br>\r\n\"I don't know about that, I was really skinny when I got here too. Trust me.\"<br>\r\n<br>\r\n\"Alright.\" Joey had always wanted to play, but his mother didn't want him to get hurt.<br>\r\n<br>\r\n\"Great, let's go.\"  Butch walks Joey to the cafeteria where they meet up with the football team's starters. They appeared to be giants, much bigger than your last schools team.<br>\r\n<br>\r\n\"What do you think about her.\" Joey was a little confused by the choice of pronoun but assumed he misheard.<br>\r\n<br>\r\nThe tallest stepped forward, \"Raise your arms and turn around.\" A little startled by the command Joey as he's told. \"She will work. Bring her to the locker room after dinner. You're in charge of her Butch.\"<br>\r\n<br>\r\n\"Of course.\" Butch responded.<br>\r\n<br>\r\nJoey was sure that he heard him correctly, but was too intimidated to say anything. Butch got in the food line behind the rest of the football player, and Joey got behind him. After a couple of minutes of awkward silence you got to the front of the line.<br>\r\n<br>\r\n\"I'm getting an athlete meal, and she is getting a special dinner.\" Butch says. Butch gets a large slice of roast beef, a hefty portion of mashed potatoes, and steamed carrots. Joey got some chicken breast, and a salad with a vinegar dressing.<br>\r\n<br>\r\nOnce he grabbed his food Joey finally asked, \"Why do you keep referring to me as a girl.\"<br>\r\n<br>\r\n\"Oh, that...\" Butch responds, \"it's a tradition... yeah, a tradition, we refer to new students as girls for a month.\"<br>\r\n<br>\r\n\"Isn't that hazing...\" Joey responds.<br>\r\n<br>\r\n\"Tradition, hazing, there basically the same thing.\" He answers, \"I can stop, but people won't respect you unless you do what we had to.\"<br>\r\n<br>\r\n\"Okay fine, and why did I get so much less food.\"<br>\r\n<br>\r\n\"It's higher performance, It'll be good for tryouts.\"<br>\r\n<br>\r\nThey get to their table and Butch begins scarfing down his food. Joey ate slowly, a little bothered by the flavor of the chicken, it tasted very off. He wasn't even halfway done when everyone at the table started to get up. He tried to finish quickly but Butch motioned that he had to get up. They threw out the scraps, stacked their trays and left. Joey simply continued to follow Butch.  The group started to break up and Butch stayed with the tall player from earlier. Soon it was just those three and they went into the locker room. Inside there were three other players waiting.<br>\r\n<br>\r\nThe tall one from earlier spoke \"Step forward, girl.\" Joey stepped forward and the four football players made a circle around him. \"Strip.\" Joey began to stutter a response but stopped and got out of his clothes.<br>\r\n<br>\r\n\"Good job Butch, she's a prize. A bit skinny, but a blank slate will work great. Girl, here you go.\"</span></div></div>",
            "created":1488168060,
            "id":2282742,
            "title":"Cheerleader"
        },
        "1311":{
            "author_id":"taytaywilliams",
            "author_name":"taytaywilliams",
            "choices":[
                "He has a full female uniform",
                "He has female underwear",
                "He only needs to wear panties"
            ],
            "content":"<div class=\"\"><div> <span>\"What are these for?\" Joey asks.<br>\r\n<br>\r\n\"You, put them on.\" The tall one orders.<br>\r\n<br>\r\nJoey finally works up some courage, \"No, I'm not wearing fucking panties. Butch said you might want me on the team.\"<br>\r\n<br>\r\nButch responds, \"I never actually said that. Now do as Austin says, you might not like the other option.\"<br>\r\n<br>\r\n\"I told you no, now let me back to my room.\" Joey insists.<br>\r\n<br>\r\n\"Now for the fun,\" Austin says, \"boys hold her down.\"<br>\r\n<br>\r\nJoey attempts to bolt but the football play are too fast and too strong, they drag him to a bench and bend him over it. He feels two fingers covered in something start to move around in his ass. \"No, please don't do this to me, I'll wear them, I'll do whatever you want.\"<br>\r\n<br>\r\n\"This is what I want, your ass.\" Austin responds with a sadistic tilt as he begins to slide his dick into Joey's ass. Joey screams but Butch shoves a rag in his mouth to shut him up. Austin slowly slides in and out speeding up as Joey's ass begins to loosen. With a dramatic final thrust he cums in Joey's ass.<br>\r\n<br>\r\n\"There, let him up.\" Austin orders. Joey doesn't move, so Austin pulls him up to his feet and turns him around. \"This is your life now, you're the teams slut.\" Now put those panties on.\"</span></div></div>",
            "created":1488194520,
            "id":2282846,
            "title":"He hands you panties"
        },
        "13112":{
            "author_id":"taytaywilliams",
            "author_name":"taytaywilliams",
            "choices":[
                "All of his stuff has been switched for girl's",
                "Specific items have been switched for a girl's"
            ],
            "content":"<div class=\"\"><div> <span>Joey is still in shock from what just happened and just looks stupidly at Austin.<br>\r\n<br>\r\n\"I'm done, but if you don't get those on we'll let someone else have a try with you.\" Austin orders. This brings Joey too and he quickly slides the panties up. They hurt his dick but he's too worried to do anything about it. Then Austin hands him a bra and orders him to put that on as well, which he does with some difficulty.Once they're on he realizes there's built-in padding, that with the little bit of flab he has there already, gives the impression of breasts. With that, all of the players other than Butch leave.<br>\r\n<br>\r\n\"Get your clothes back on, we're going back to our room.\"<br>\r\n<br>\r\n\"Why should I go with you, because of you I just got raped.\"<br>\r\n<br>\r\n\"No, because of me you had sex with the Captain of the Football team. If it wasn't him it would have been the Captain of the Wrestling team, or the Captain of the Soccer team. Some guy as skinny as you wasn't going to make it here. Now, put on your clothes and let's go, or should I be taking Austin's sloppy seconds?\"<br>\r\n<br>\r\n\"Fine, I'll go.\" Joey responds and he puts his jeans and shirt back on. Butch leads him back to their room, where he finds...</span></div></div>",
            "created":1514802120,
            "id":2435216,
            "title":"He has female underwear"
        },
        "131121":{
            "choices":[
                "Joey agrees and goes to butch.",
                "Joey refuses and is forced to .......",
                "Joey gets dressed up and is taken to the bathrooms/ Principals office.",
                "more ideas / someone knocks at the door."
            ],
            "content":"<div class=\"\"><div> <span>As Butch and Joey enter back into their door room, Butch flops down on his bed while Joey goes directly for his suitcase for a change of clothes.<br>\r\nAs Joey opens his suitcase he is shocked to see that ALL of his clothes have been replaced by girls clothes, skimpy outfits, dresses and loads of panties, a few different bra's and cute ankle socks and sandles, there was also a bag made up of lipstick and toe / finger nail polish, some blush and other womanly beauty products.<br>\r\n<br>\r\n\"WHAT THE HELL HAPPENED TO ALL MY CLOTHES \" Joey screams .<br>\r\nTurning around to face Butch, Joey halts his rant as he sees Butch spread out on his bed with only his boxers on and a huge tent inside of them.<br>\r\nButch looks to Joey while saying \" you have two choices Joey, first choice, you come over here and make me happy or second, you get dressed and prettied up ... either way in about an hour we are going to ....\"<br>\r\n</span></div></div>",
            "created":1547229360,
            "id":2602134,
            "title":"All of his stuff has been switched for girl's"
        },
        "133":{
            "choices":[
                "look back at phil and pull the waist down to the floor.",
                "stand up and drop your own boxers.",
                "dont move till butch says something."
            ],
            "content":"<div class=\"\"><div> <span>Butch wanted to get joey comfortable with his surroundings so he  would show joey everywhere himself, as the day went on they became quite good friends, later that night butch had taken his shower and walked back into the room with no towel this time and just went about like nothing was different .... while joey was riveted to butches cock, joeys mouth open fully, not even realizing it just stared at the huge cock ........<br>\r\n<br>\r\nButch was getting harder and harder knowing joey was drooling over his dick, but butch had another thing happening as well, he told joey that he has a friend coming over tomorrow morning that he thought joey might like very much, joey asked who that might be .... butch just told him that his friend makes him this hard all the time and if joey liked his friend he might also be this hard all the time .... butch walks toward joey who is sitting on his bed, as butch tells joey about his friend and how he might be this hard all the time to, he walked up close enough to joeys face to be only inches away from joeys mouth and nose with his big cock .... joey is hard as can be and just staring at the big cock and smelling the earthy scent, joeys head is spinning ..... never thought this would happen on the first day, joey thought.<br>\r\n<br>\r\nButch suddenly turns away and heads back to his bed and lays down and continuing to tell joey about his friend .... now you may be surprised by my friend when you meet him, he may not be what you think .... I will tell you that his name is Phil, and that he has been involved with me for over a year now, and always looking for someone to share things with us, I wouldn't let anyone else here know about phil because I don't trust any of these guys here, but there is something about you that I feel is different ...... so, tomorrow let me know what you think of phil and we will all go from there, nite joey, and with that butch rolled over and covered up,..... joey stayed up all night thinking about everything and was startled when he jumped at the sound of someone knocking on the door, joey looks over to butch, who has woken up but has not moved and is letting joey get the door,  joey didn't know what to do but by the third knock he rushed to open the door, not knowing what to expect ...... when joey opened the door ..... A young boy who looked to be about ten or eleven stood there looking at joey, he turned to look at the number on the door and then back to joey, does butch live here, Phil asked joey, joey shook his head yes and opened the door wider inviting him inside .... Hi my name is Phil Garresen, I am nine years old and have known butch for a long time, in fact he used to babysit me when I was younger ...... the thoughts going through joeys head just made him hard as iron in his boxers ..... Phil looked down at joeys hard covered cock and licked his lips and told joey to close and lock the door, going on auto pilot you swung the door shut and locked it, never taking your eyes off phil, phil the starts to take off his clothes, by the time he got down to his boxers he asked joey if he could help him with this last piece of clothing ...... Joey still transfixed by this whole experience slowly dropped down in front of phil and reached up to  the waistband of his boxers and slowly started inching them down, when the hard small cock of phil was only inches away from being sprung free in joeys face, butch rolled over and lay there watching them with a huge smile on his face ..... you then proceed to ........</span></div></div>",
            "created":1365138000,
            "id":1565654,
            "title":"They sit by themselves at the dining hall"
        },
        "1331":{
            "choices":[
                "He guides you in.",
                "He tells you to come with him and reaches out to your hardness.",
                "Butch slowly nods his head and smiles."
            ],
            "content":"<div class=\"\"><div> <span>You looked back up to Phil and inched the waistband down only a few more  inches and then ... his small hard piece sprang out and up, hitting you in the face ... you looked over to where butch was and saw him stroking his own huge cock and looked back to the sweet young cock that is still touching your face ..... you look back up to Phil and his hands wrap around the back of your head and .......</span></div></div>",
            "created":1400216400,
            "id":1797332,
            "title":"look back at phil and pull the waist down to th..."
        },
        "13311":{
            "author_id":"chrisdegraaf",
            "author_name":"chris",
            "choices":[
                "phil turn",
                "take advantage of the boy"
            ],
            "content":"<div class=\"\"><div> <span>You slowly approach the boys penis and with your mouth wide open he enters you. All you could do was suck and lick his hard cock until he cums all down your mouth, it was suprisingly a lot more than you could handle as some of it dripped down your face.</span></div></div>",
            "created":1404104400,
            "id":1820665,
            "title":"He guides you in."
        },
        "133111":{
            "choices":[
                "Come back up here you say.",
                "Take what he is offering."
            ],
            "content":"<div class=\"\"><div> <span>Phil says ... my turn and licks up the cum dripping off your face.<br>\r\n<br>\r\nHe starts by kissing  and licking from your belly down, when he gets to your stuff he kind of teases you with small kisses and small licks up and down your hardness, until he takes as much as he can into his mouth, he licks you up and down, up and down and up and down ... then turns around and shows you his cute little butt and asks you if you wanted anything else.</span></div></div>",
            "created":1405227600,
            "id":1826879,
            "title":"phil turn"
        },
        "1331112":{
            "author_id":"gayboy101",
            "author_name":"Gay boy",
            "choices":[
                "MOUTH",
                "BUTT"
            ],
            "content":"<div class=\"\"><div> <span>You lead him over to your bed and you both get up on to it. Phil bends over , showing his cute white ass once more. Phil , in a horny way, exclaimed \"shall we begin\". Without hesitation, you begin to thrust your hard price of meat in and out of his hole.<br>\r\n<br>\r\nYou quicken the pace , harder and harder you thrust until you feel that your dick is ready to explode. But, do you empty your load in his mouth or into his butt?</span></div></div>",
            "created":1505029200,
            "id":2383493,
            "title":"Take what he is offering."
        },
        "13311121":{
            "choices":[
                "what else do you two share",
                "you drop down on Phil ",
                "you seek even more cocks to slurp up ..."
            ],
            "content":"<div class=\"\"><div> <span>Phil feels you swelling inside of him and knows that your gonna bust one real soon, you were concentrating on filling him up but right before you erupted ... Phil quickly turned around and dropped his mouth right over you.<br>\r\n<br>\r\nYou could not stop yourself even if you wanted to ... you erupted with such force that globs came back out of Phils mouth, as much as he tried to swallow it was just way too much...<br>\r\n<br>\r\nEven after you finished, you were surprised when Phil stood up and pulled your head down and opened his small mouth and forced you to share your freshly deposited hot creamy cum ............</span></div></div>",
            "created":1505183400,
            "id":2384455,
            "title":"MOUTH  FULL "
        },
        "14":{
            "author_id":"tessz",
            "author_name":"Zack T.",
            "choices":[
                "You share an adjoining bathroom with girls",
                "You have a roommate",
                "You have to sleep on a cot in the hallway for now",
                "Another Option",
                "Still another option"
            ],
            "content":"<div class=\"\"><div> <span>You are Zeke. This is your first day at your new school.<br>\r\n<br>\r\nAt first,  you didn't like the idea of leaving your friends and moving to a whole new community. Once you found out the only acceptable school to your parents was a co-ed boarding school, however, you changed your mind. <br>\r\n<br>\r\nYou have always been in boarding schools because of the nature of your parents' work. In fact, you've always been in all-male boarding schools. Until a couple of years ago, it was fine with you that you primarily interacted with other boys, but increasingly, you find yourself longing for some female companionship.<br>\r\n<br>\r\nYou have come in part-way through the term. You will have the option of moving, later on as opportunities arise, but for now, you are placed in the only living option available. </span></div></div>",
            "created":1362978000,
            "id":1547945,
            "title":"a boy in a mixed school"
        },
        "141":{
            "author_id":"tessz",
            "author_name":"Zack T.",
            "choices":[
                "She has someone with her",
                "She wants to show you something",
                "She has something to tell you"
            ],
            "content":"<div class=\"\"><div> <span>After carrying your luggage to your room and all of the travel of the day, you decide you could benefit from a shower before dinner. Your room shares a bathroom, which sits between your room and the next one over. You have dealt with that kind of situation before, and it works ok, as long as the person in the other room doesn't hog the bathroom all the time. <br>\r\n<br>\r\nYou check to make sure the bathroom is unoccupied, and then you strip down, start up the shower, and step in to lather up.<br>\r\n<br>\r\nMoments later, you hear a door open to the bathroom. Your first thought is, \"Hello! Haven't you ever heard of knocking before entering a bathroom?\" You are kept from saying anything, however, when you hear a voice saying, \"Hey... Are you our new neighbor?\" The thing that surprises you about the voice is that it is female.<br>\r\n<br>\r\nYou cautiously peek around the edge of the shower curtain and see a girl of your age or maybe a bit younger. She is standing in front of the shower, and she is dressed in what appears to be an oversized t-shirt that she has been using as pajamas. <br>\r\n<br>\r\nYou are not used to being naked in the presence of a girl -- even if there is a plastic shower curtain between you. You feel your face turning red, but you try to act cool.  \"Um... Hi. If you live in that room, then yes, I'm your neighbor. I ... um... figured it would be a guy I'd be sharing a bathroom with, though.\"<br>\r\n<br>\r\n\"I'm Tina,\" says the girl, reaching out her hand and creating an awkward moment when you release the shower curtain to grasp her hand in return, and just barely catch it before she gets to see a lot more than your wet, soapy face.<br>\r\n<br>\r\nShe seems unaffected by your awkwardness and proceeds to talk rather non-stop about how wonderful this school is, and how she's sure you'll love it here, and if there's anything you need to come right over and help yourself.<br>\r\n<br>\r\nYou try to take it all in, but you find this to be all rather strange. <br>\r\n<br>\r\nTina says, \"Hey, why don't I introduce you to some of the other people on the floor? Want me to bring them over?\"<br>\r\n<br>\r\n\"Right now?\" you say. \"Um... I think I probably ought to get dressed first, don't you?\"<br>\r\n<br>\r\nShe looks at you in amazement, as if that hadn't occurred to her. \"Oh... does it make you nervous to have someone talking to you while  you're naked? Weird. OK... well, c'mon... You can put on your robe and I'll take you to them.\"<br>\r\n<br>\r\nShe has to be joking, but she doesn't give any hint of it. You smile and say, \"How about if I dry off first and get dressed. Then I'm all yours.\"<br>\r\n<br>\r\nShe considers this for a moment and then smiles and says, \"Great! Just come on over.\"<br>\r\n<br>\r\nWith that, she bounces into her room and closes the bathroom door behind her.<br>\r\n<br>\r\nAs you rinse off and dry off, you shake your head in puzzlement. That girl is weird! Of course, worse things could happen than having a cute neighbor who parades around in t-shirt and doesn't seem to be embarrassed by nudity....<br>\r\n<br>\r\nYou are back in your room, and you just manage to pull on your boxers when the door to the bathroom opens up, and Tina comes bounding in. </span></div></div>",
            "created":1362978000,
            "id":1548279,
            "title":"You share an adjoining bathroom with girls"
        },
        "1411":{
            "author_id":"taytaywilliams",
            "author_name":"taytaywilliams",
            "choices":[
                "Accept what is going on",
                "Struggle",
                "Offer an alternative"
            ],
            "content":"<div class=\"\"><div> <span>Coming in with Tina is another girl, she looks a little older than you. When you see her you move your hands to cover your crotch. She clearly just came back from a workout as she is still in her sports bra and yoga pants and you're getting a little hard.<br>\r\nTina introduces you, \"This is my roommate, Jessica.\"<br>\r\n\"You can call me Jess, what's your name.\"<br>\r\n\"John, before the introductions could I uh... get some more clothes on.\" You respond.<br>\r\n\"That's what we're here about.\" Tina tells me. \"We've got some clothes for you.\" This is getting weird quick.<br>\r\n\"Don't worry, I have my own clothes.\" I start to step back.<br>\r\nTina responds, \"Those look a little masculine for the girl's dorm.\" Tina pulls her hands from behind her back and she is holding panties and a bra.<br>\r\n\"Hell no.\" I quickly turn around to leave but Jessica puts me in a full nelson even faster, and turns me back around to face Tina.<br>\r\nTina chuckles, \"That was even quicker than I expected, you are pretty wimpy. So, we can do this the easy way or the hard way. Which do you want?\"<br>\r\nJess whispers in your ear, \"Do the hard way, I want some fun.\"</span></div></div>",
            "created":1439614800,
            "id":2021211,
            "title":"She has someone with her"
        },
        "14112":{
            "author_id":"taytaywilliams",
            "author_name":"taytaywilliams",
            "choices":[
                "Put them on.",
                "Go back into your room and lock the door."
            ],
            "content":"<div class=\"\"><div> <span>\"You can't make me do this.\" You drop your weight to get out of Jess' hold.<br>\r\nShe reacts, pins you to the ground and responds, \"Yes we can.\"<br>\r\n\"The school won't stand for it and I'll just tell my parents.\"<br>\r\nTina answers, \"My friend Faith is changing all of your school records to female, and this school is great at covering up its problems. So in other words, you are at our mercy.\"<br>\r\n\"You still can't make me wear those.\"<br>\r\n\"Can't we?\" Jess responds. She uses her weight to hold down your torso and her arms to hold your legs straight. Tina comes over and starts pulling down my boxers.<br>\r\nI give in, \"alright, alright, I'll wear them.\"<br>\r\n\"Great,\" Tina responds. Jess let's me go and once I stand up Tina hands me the panties and bra. \"Once you're dressed come into my room.\"</span></div></div>",
            "created":1439684820,
            "id":2021427,
            "title":"Struggle"
        },
        "141122":{
            "author_id":"taytaywilliams",
            "author_name":"taytaywilliams",
            "choices":[
                "There is a school uniform",
                "There are workout clothes"
            ],
            "content":"<div class=\"\"><div> <span>You go back into your room and lock your door. They can't force you to wear those clothes, they must be out of their minds. Shortly after you get dressed you here someone knock at your door. Fearing it's the girls you look through your peephole. Luckily it is just the head of the dorm, a senior named Caitlin. I open the door for her. I immediately regret my decision as Jessica and Tina follow her in.<br>\r\nTina asks, \"Did you really think you could get away from our grasp?\"<br>\r\nCaitlin heads out, \"I'll leave you three to it.\"<br>\r\n\"Wait, Caitlin they're going to...\" She closes the door behind her.<br>\r\nTina passes me a bag, \"Your new clothes are in there, get dressed.\" You know realize it is hopeless. You have no chance of getting away.<br>\r\n\"Could I at least have privacy while I get changed?\" You ask.<br>\r\nJessica responds, \"You lost that right when you lied to us.\" You get undressed and look into the bag.</span></div></div>",
            "created":1439789460,
            "id":2021875,
            "title":"Go back into your room and lock the door."
        },
        "1411221":{
            "author_id":"taytaywilliams",
            "author_name":"taytaywilliams",
            "choices":[
                "They have shapewear for you.",
                "They don't have shapewear."
            ],
            "content":"<div class=\"\"><div> <span>Before you put it on you lay everything out to look at.<br>\r\n<br>\r\nThe Uniform: A short grey and crimson plaid pleated skirt, a white buttoned short sleeved blouse, a grey and crimson tie, a black vest, and 3\" Black Pumps.<br>\r\n<br>\r\nThe Underwear: Matching neon pink lacy boyshorts and bra, long black hosiery, and a black lacy garter belt.<br>\r\n<br>\r\nAccessories: Silver stud earrings, a braided gold bracelet, and a grey and crimson headband.</span></div></div>",
            "created":1439880660,
            "id":2022262,
            "title":"There is a school uniform"
        },
        "14112211":{
            "author_id":"taytaywilliams",
            "author_name":"taytaywilliams",
            "choices":[
                "You go with them.",
                "You try to change back into your guy's clothes."
            ],
            "content":"<div class=\"\"><div> <span>\"That would be all you had to wear if you just gave in. To teach you your lesson, we've decided to up the ante.\" Tina says.<br>\r\n<br>\r\nFeeling absolutely terrible you respond, \"You couldn't make it any worse.\"<br>\r\n<br>\r\n\"That's where you're wrong. You are skinny enough to make a  passable female but you know what's missing?\"<br>\r\n<br>\r\nYou start to see where she's going, \"Well, yeah, tits, but there's no way to give me those.\"<br>\r\n<br>\r\n\"Really? You don't know how much the nurse likes me.\" You become incredibly distraught, she can't be serious. \"I'm joking, sheesh, we're just going to glue falsies onto your chest.\"<br>\r\n<br>\r\nThis is going way too far, \"I still really don't want that.\"<br>\r\n<br>\r\n\"This isn't about what you want, it's about you learning your place.\" She pulls them out, and puts glue on the back, \"Don't move or they will look terrible.\" Realizing your options you realize that it would be even worse to have misshapen tits, so you stay still. \"Those are B cups, not big, but we can fix that if you fight this.\" She then pulls out what looks like a one-piece bathing suit. \"Ever heard of Spanx? They make these great underclothes that contour your body to help your figure, since you are so skinny to begin with I added some padding to help. That will be your first layer, that only comes off here in your room.\" She passes it to you, \"But first, time to tuck away that unsightly thing in your crotch.\"<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\n\"Press your testicles up into your body, then fold your penis back between your legs, then I'll use the tape.\"<br>\r\n<br>\r\n\"I'm not letting you mess with my dick.\" She gets a phone out, and snaps a picture. \"Okay, okay.\" You follow her instructions, it feels weird but not as weird as you expected. She then comes and tapes your penis in place.<br>\r\n<br>\r\nShe hands you the Spanx, \"put these on.\" You do just as she says. When you look over at your mirror you see your head on a clearly female body. You start on the clothes, first you put on the panties, they are incredibly tight but at it's a normal feeling. Then you put on the bra, it is surprisingly easy, and the relief on your chest is great. Then you slide up the hosiery. As you go to grab the skirt Tina stops you, \"You're forgetting your garter belt.\"<br>\r\n<br>\r\n\"What even is that?\"<br>\r\n<br>\r\n\"It's the black lace, slide it over your panties and hook it to your tights.\" Once you hook it up you pull on your skirt, followed by your blouse, and your tie. Finally you pull your vest on top.<br>\r\n<br>\r\n\"Am I good?\"<br>\r\n<br>\r\n\"Not yet, I've still got to do your makeup, put on your wig, and do your accessories. So go sit down at your desk in front of your mirror.\" As soon as you sit down she starts doing your makeup. Before you know it, all that's left of the old you is your hair. She quickly fixes that, shaving your head and gluing a long straight blonde wig on. \"Now for the earrings.\"<br>\r\n<br>\r\n\"But my ears aren't pierced.\"<br>\r\n<br>\r\n\"Good thing I used to pierce ears for a living.\" Jessica chimes in, you had forgotten she was even there. She gets out the gun, and pierces your ears. Luckily it doesn't hurt as much as you expected. Tina then puts in the studs. She puts in the headband and hands you your bracelet and pumps. \"Alright, you can finish up. Dinner is in 30 minutes, we'll walk you down.</span></div></div>",
            "created":1439967060,
            "id":2022658,
            "title":"They have shapewear for you."
        },
        "142":{
            "author_id":"tessz",
            "author_name":"Zack T.",
            "choices":[
                "Dean -- 15 years old, bisexual, and a horndog",
                "Christi -- 16 years old, gorgeous, and not even supposed to be there",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is your roommate?</span></div></span></div>",
            "created":1362978000,
            "id":1547963,
            "title":"You have a roommate"
        },
        "1422":{
            "author_id":"tessz",
            "author_name":"Zack T.",
            "choices":[
                "\"Um... sure.... We can try it.\"",
                "\"What's in it for me?\""
            ],
            "content":"<div class=\"\"><div> <span>You walk into your new room, set down your bag, and let out a cry of surprise. You are supposed to have a room to yourself, but you can see that half of the room is occupied. What's more, it's occupied by a girl!<br>\r\n<br>\r\n\"I'm sorry... I must have gotten the wrong room,\" you stammer, beginning to back out.<br>\r\n<br>\r\nThe girl jumps up from her bed, where she had been reading. \"No! Don't go!\" she says, rushing across the room, and grabbing you by the arm.<br>\r\n<br>\r\nThis is all too weird. You're not used to having girls appear to be desperate to have you around. Particularly girls like this one. As you start to get over your shock, you begin to take in the view of this beautiful creature. She is a little older than you, but definitely more physically mature. She has shoulder-length blonde hair, and her breasts have developed very nicely. You can't help but notice that, because she is wearing a rather revealing nightshirt that is rather snug at top. Below, it only seems to go about a quarter of the way down her thigh, revealing gorgeous, long legs. <br>\r\n<br>\r\nYou try to overcome your ogling of her body to pay attention to what she is saying.<br>\r\n<br>\r\n\"I'm sorry to surprise you like this.... I'm Christi.... Look, please... you're not in the wrong room. I'm the one who's not supposed to be here. Let me explain....\"<br>\r\n<br>\r\nWith that introduction, Christi proceeds to explain that she is assigned to a room upstairs, but that her roommate's boyfriend had practically moved in with them and stays almost every night. Christi has a choice of either staying there and being kept up by their non-stop sexual escapades, or she has to find somewhere else to sleep. <br>\r\n<br>\r\n\"When this room opened up, I just moved down here, thinking it wasn't hurting anyone. But now we're coming up on final exams, and I REALLY need to be able to get my sleep. I really would appreciate it if you don't say anything to anyone and just let me stay until finals are over. It would mean A LOT to me....   Please?\"<br>\r\n<br>\r\nShe leans over and grabs both of your hands as she says, \"Please,\" and as she does so, you can see right down the top of her shirt. <br>\r\n<br>\r\nAll these years in an all-male boarding school didn't prepare you for this... although a few of your fantasies have looked somewhat similar....<br>\r\n<br>\r\nHow do you respond?</span></div></div>",
            "created":1362978000,
            "id":1547968,
            "title":"Christi -- 16 years old, gorgeous, and not even..."
        },
        "14222":{
            "choices":[
                "\"Deal.\"",
                "\"No deal.\""
            ],
            "content":"<div class=\"\"><div> <span>\"What's in it for me?\" you inquire, spying a chance to get some physical interaction between you and the beautiful blonde who stands in front of you. At your question, her eyes roll and she straightens up, folding her slender arms across her perfect chest.<br>\r\n<br>\r\n\"Oh, I see - you're one of <i>those</i> boys,\" she spits, her voice spiked with a mixture of disgust and venom, yet a devilish smile twitching the corners of her mouth up. You nod, a little too innocently, and her eyebrow raises in a flawless arch.<br>\r\n<br>\r\n\"Alright, prick, I'll make you a deal,\" whispers Christi, curling her blonde locks around two fingers. \"If you keep quiet and let me stay down here, I'll give you what that already-hard dick of yours wants.\" Blushing crimson, you glance down to see a clear boner creasing your jeans. Christi chuckles, a tinkly laugh.<br>\r\n<br>\r\n\"Hmm...\" you pretend to mule over the offer, despite the fact you know what you're going to say. \"I'll switch it round. You give me what I want now, and I'll keep quiet. Deal?\"</span></div></div>",
            "created":1363323600,
            "id":1550869,
            "title":"\"What's in it for me?\""
        },
        "142222":{
            "author_id":"airtran9906",
            "author_name":"Spy For U",
            "choices":[
                "Deal",
                "No Deal",
                "You Counter"
            ],
            "content":"<div class=\"\"><div> <span>\"No\" she says flatly. <br>\r\n<br>\r\nYour smug face turned to one of shock in an instant. \"What do you mean no?!\"<br>\r\n<br>\r\n\"Like I said, no,\" she replies back. <br>\r\n<br>\r\nYou hadn't expect this but in hindsight you should have and now you need to find a way to quickly salvage the situation in your favor. Thinking quick the answer came to you. \"Well I guess I'm going to have to tell the administration that you are staying in the wrong room then\" you hastily respond back turning around and feigning reluctance.<br>\r\n<br>\r\n\"Wait\" Christi calls out from behind you, \"Please don't.\"<br>\r\n<br>\r\n\"Please don't\" you say mockingly while scowling at her. \"You're in MY room\" you angrily reply back stressing the my part. \"This room is assigned to me not you and if there's nothing in it for me then why should I let you stay in MY room?\" you ask hotly back. <br>\r\n<br>\r\n\"Look....\" she starts before sighing, \"I could get in a lot of trouble or kicked out even, I'm begging you please don't I can't have that happen or my parents will ground me for life.\" she says as her tone begins to waver with a tremble of fear. <br>\r\n<br>\r\nYou turn around to face her again staring into her sky blue eyes seeing the fear lace in them as well as... was it sadness as well?<br>\r\n<br>\r\nBreaking your thoughts after a moment of silence she says \"Look there has to be something else I can do, just not that.... not yet.\"<br>\r\n<br>\r\nYou wait curiously trying hard not to let your emotions show. You had her right where you wanted her and all the cards were in your hands. It would be interesting to see what she came up with. Looking like she had come to a decision and a bit of inspiration Christi decided she was going to give you a new deal, one that would work out in both of your favors so you could potentially both get exactly what you two wanted but there was a good chance she assumed you would say no. <br>\r\n<br>\r\n\"How about we date?\" She says questioningly not sure of the idea herself or if you would go for it. <br>\r\n<br>\r\nWhatever it was you were expecting it certainly wasn't that. Taking a moment to compose yourself not quite believing what you hear the only thing you can manage to get out is a shocked \"come again?\"<br>\r\n<br>\r\n\"You heard me\" she replies smirking having realize she totally threw a curve-ball at you. <br>\r\n<br>\r\n\"I'm sorry it's just that I don't really know what to think\" you say in disbelief. She certainly had every right to smirk as you expected a lot of things but not this....<br>\r\n<br>\r\n\"What's there to think about?\" she says smugly, \"It's pretty simple really, you, me, together, you know, boyfriend girlfriend, all that kind of stuff.\" She batters her thin blonde eyelashes at you while giving you an almost irresistible puppy dog eye look that seems to make her blue eyes sparkle.   <br>\r\n<br>\r\nTaking a moment to think you finally say \"Okay Christi it's a......\"</span></div></div>",
            "created":1586664060,
            "id":2817469,
            "title":"\"No deal.\""
        },
        "1422221":{
            "author_id":"airtran9906",
            "author_name":"Spy For U",
            "choices":[
                "Jake, Son of a Military Family Sent To Learn Discipline?",
                "Mason, Son of a Rural Farming Family Sent To Have A Better Choice In Life?",
                "William, The Man With A Plan And a Bright Future"
            ],
            "content":"<div class=\"\"><div> <span>\"It's a deal\" you finish having come to your decision.<br>\r\n<br>\r\nShe jumps up from her bed enveloping you in a tight hug. You feel her breasts crush against your chest which does nothing to help you in your current state of mind. 'How the hell did she flip this around on me so fast? Not even a day in and she has me wrapped around her finger but then again that may not be such a bad thing...' you think to yourself. <br>\r\n<br>\r\nLetting you go she takes a step back grabbing both of your hands with hers. Her hands feel perfect in yours like two puzzle pieces meant for each other.<br>\r\n<br>\r\n\"Thank you, thank you thank you\" she says profusely. \"I promise you won't regret this, me and you are going to be great together I promise.\"<br>\r\n<br>\r\nYou can practically hear the happiness in her voice as she beams at you. <br>\r\n<br>\r\n\"You made the right choice\" she continues, \"Here let me help you get your stuff in and get you unpacked\" she finishes excitingly.<br>\r\n<br>\r\nStill in a slight state of shock you watch as your new beautiful girlfriend skips happily past you to the door humming a tune. Peaking her head out she spots your stuff laying in boxes in the hallway. <br>\r\n<br>\r\n\"Oh, I see you already brought your stuff, good, I'll help.\" <br>\r\n<br>\r\nIn hindsight this may have been the best deal you could have gotten. While it certainly wasn't a first day fuck it could lead to a lot more, a lot more. Only time would tell. She breaks your thoughts pushing past you with one of your boxes in her arms. <br>\r\n<br>\r\n\"Well come on now just because I'm your girlfriend doesn't mean I'm going to do everything for you\" she cracks once again breaking your thoughts. <br>\r\n<br>\r\n\"Right\" you say before grabbing more boxes and bringing them in. Soon you both have brought your stuff in to your side of the room. You both begin opening your boxes and pulling your stuff out. The things we have tell a lot about a person and she notices as she comments on some things she unpacks from one of your boxes. <br>\r\n<br>\r\nSo who are you? </span></div></div>",
            "created":1586665380,
            "id":2817476,
            "title":"Deal"
        },
        "14222212":{
            "author_id":"airtran9906",
            "author_name":"Spy For U",
            "choices":[
                "The Executive Tour",
                "Her Friends Drop By",
                "Take Christi Out On A Date"
            ],
            "content":"<div class=\"\"><div> <span>\"I don't remember ever getting your name\" Christi says.<br>\r\n<br>\r\n\"Mason, Mason Williams\" you reply to her as she pull out a framed photo of your family from the box in front of her and sets it on the desk.<br>\r\n<br>\r\n\"So this your folks\" she asks leaning in to get a better look at the picture. \"You have a pretty big family, when did you guys take this?\" <br>\r\n<br>\r\n\"Well my family wanted something from them I could keep close they said so we took it before they sent me here\" you say as an idle smile rests on your face. She looks at you and at the picture again before resuming taking out another from the box. \"You look a lot like your father\" she comments. You snort \"Yea I get that a lot especially in our town. Everyone thinks I'm gonna grow up to be just like old man but I want to do something different. Our family has been farmers for generations\" you comment back to her. <br>\r\n<br>\r\n\"And who is this next to you there?\" she says grabbing the picture putting her finger against your little brother as she sits down crosslegged.<br>\r\n<br>\r\n\"Oh that,\" you say giving a chuckle, \"that's my little brother Conner. He already loves helping pa out and says he wants to have his own farm one day. I figured I'd give him the chance to do it instead of taking since I would inherit it being as I'm the oldest\" you finish after a short pause. <br>\r\n<br>\r\n\"Awe that's so sweet of you\" she says in response. 'I'm gonna fall head over boots for this girl if she don't stop' you think to yourself as your duck your head down trying to hide your blush. <br>\r\n<br>\r\n\"And what about this one cowboy\" she asks winking at you as she turns another picture this time of you on a horse. \"Oh yea we all learned to ride when we was younger\" you say letting a bit of your southern accent slip out. \"Daddy had us wrangling up the cattle so we could take them to market over the summer. It was a hard days work....\" you don't get to finish as she cut you off, \"So you're saying you know how to ride horses\" she asks excitingly.<br>\r\n<br>\r\nLaughing you nudge her in the side \"Of course, wouldn't be much of a cowboy if I didn't now would I?\" you rhetorically ask giving her a wink.<br>\r\n<br>\r\nShe laughs with you. Her laugh is sweet an melodic it made you feel funny things in your stomach that you didn't know how to explain. You knew you wanted to hear her laugh more often now. \"Can you teach me\" she asks excitedly. <br>\r\n<br>\r\n\"Well yea sure but riding a horse ain't like driving no car or nothing, it's a living thing and you got to form a connection with it if that makes sense.\"<br>\r\n<br>\r\n\"Oh. My. God. I can't wait.\" she's practically rocking back and forth at this point. She stops suddenly standing back up \"One second\" she says grabbing your hat from the table that you had unpacked. She ruffles your thick brown hair as she bites on the side of her tongue as if she is an artist painting a picture deep in concentration. Placing your hat on your head she steps back marveling at her work pausing and once again leaning back in to unbutton your flannel shirt. \"Perfect, stay right there\" she says as she skips over to her side of the room.<br>\r\n<br>\r\nShe comes back with her cell phone in hand before pulling you against her as she smiles brightly at the camera. Quick to catch on you beam back as she takes the picture before releasing you. \"What's your number\" she asks. Giving it to her you here your phone buzz on the nightstand next to your bed. She types furiously away and then sets her phone back down while sitting down on your bed. <br>\r\n<br>\r\n\"You know, at first I thought you were a perverted bastard but I'm glad to have gotten to know you Mason.\" she sighs. \"I'm glad we met today.\"<br>\r\n<br>\r\n\"I'm glad too Christi\" you smile back at her as you both share a moment. Clearing her throat she says \"These boxes aren't going to unpack themselves, let's get finished.\"<br>\r\n<br>\r\n\"Alright\" you laugh back, she's such a sweet girl, your sweet girl. Just what have I gotten myself into you think.<br>\r\n<br>\r\n<div align=\"center\">--Later---<br>\r\n</div><br>\r\n<br>\r\nSoon you have everything unpacked and arranged how you wanted when you hear your new girlfriend perk up from her side of the room. \"Hey babe....\" you hear her call out taken slightly aback at how quickly she seems to be rolling into this new relationship. <br>\r\n<br>\r\n\"Whaaaaat\" you say as you put down the introductory booklet you had been reading. <br>\r\n<br>\r\n\"Come over here\" she says. <br>\r\n<br>\r\nGrumpily you put the pamphlet down walk over to her side of the room she had divided off with closets you had both move into the middle of the room. She pats on her bed motioning for you to sit. Complying you sit facing her. You didn't know how someone could possibly be so talkative but alas her bubbly personality was one quirk you had already come to realize on your first day together since earlier. <br>\r\n<br>\r\n\"So I was thinking\" she starts, \"it's not exactly fair I grilled you earlier and yet here you know next to nothing about me.\"<br>\r\n<br>\r\n\"Since you're my boyfriend now\" she smiles beaming at you continuing, \"it's only fair you get to ask me what you want.\" <br>\r\n<br>\r\n'Crap,' you hadn't exactly thought this far ahead, your primary concern today was getting settled in so you could relax this weekend before classes started. It looks like that plan was getting thrown out the window but since you two are now dating you might as well get to know your new girlfriend. <br>\r\n<br>\r\n\"Okay...\" you start unsure of what you are going to ask her since you weren't exactly prepared. If you knew one thing for certain you knew Christi was the kind of girl who would keep you on the balls of your feet with her seemingly spontaneous nature and a growing part in you liked that already. She was a breath of fresh air from all the other seemingly predictable girls from your hometown out in the country. <br>\r\n<br>\r\n\"Where are you from?\" you ask causing her to roll her eyes. \"What?\" you say in response taken aback slightly.<br>\r\n<br>\r\n\"Nothing I didn't expect you to start with something so is is all\" she says giggling. \"I'm from Michigan and you?\" <br>\r\n<br>\r\n\"Hang on I thought I was supposed to be asking the questions here...\" you say. <br>\r\n<br>\r\n\"Yea but think of it as a game so we can get to know each other after all, we're going to be spending a looooottt of time together\" she says.<br>\r\n<br>\r\n\"Florida\" you respond back noticing her brighten at the mention of this. <br>\r\n<br>\r\n\"Wow that's so cool she says propping her head between her hands as she kicks her legs in the air behind her. \"We used to go there on vacation all the time with my family\" she continues gazing into your eyes.<br>\r\n<br>\r\n\"Yea, a lot of people from your state do I should know\" you say back as you lean back against the wall to get more comfortable. This was probably going to take a while you figured based off what you knew about her personality already. <br>\r\n<br>\r\n<div align=\"center\">---Some time later---<br>\r\n</div><br>\r\n<br>\r\nDespite being slightly annoyed at her ruining your plans at first you quickly got over it the more you two talked over the past hour. You had both learned much about each other and it was scary how you both seemingly chatted as if you were old friends. You felt comfortable around her already. <br>\r\n<br>\r\nYou had learned her parents had sent her down here to the school to \"put her in a better environment\" as she called it giving air quotes as she did. When you asked why that was she dodged the question which you found strange. Something else you noticed was how she dodged questions about most of her family except her younger sister and older brother. You couldn't help but notice that and made it a point to find out why when she was ready to tell you. You also discovered she was a big fan of romance novels you remember her blushing red as a cherry tomato over the revelation. <br>\r\n<br>\r\nIn return you shared an embarrassing story about how you knocked yourself out on the electric fence around your farm where your family raised cattle when you were a kid. She seemingly glowed as she laughed at this.<br>\r\n<br>\r\n\"Alright well I'm going to go to sleep now\" she says breaking you from your inner reflection. \"How about I show you around tomorrow?\" she asks. <br>\r\n<br>\r\n\"Sounds good\" you say as you get up to go back to what is for now your side of the room. There was no telling how long it would soon be that way before it was just both of yours room at this rate. <br>\r\n<br>\r\n\"Night Christi\" you say before shutting off the lights. \"Night Mason\" she says back before you roll over on your side and close your eyes. </span></div></div>",
            "created":1586680920,
            "id":2817540,
            "title":"Mason, Son of a Rural Farming Family Sent To Ha..."
        },
        "1423":{
            "choices":[
                "You flick out your tongue and let it happen.",
                "There is a knock at the door.",
                "You have to take care of your own hard cock now."
            ],
            "content":"<div class=\"\"><div> <span>Your new roommate was named Ike and he was the same age as yourself .... as Ike is talking to you about all the school has to offer, you hear someone caugh in the next room, ike pretends not to notice it and continues to talk but then there is another one with a sneeze  following it ... Ike then stops talking and goes over to open the door, where a small boy of about the age of 10 is standing there in his robe, obviously he had just taken a shower and got back right before you arrived .... Ike describes this little fellow as Stan, his little 9 year old brother, he tells you that right after Ike arrived their parents had been in a car accident and both were gone now, so he had to sneak stan in here and take care of him.<br>\r\n<br>\r\nNo one knows he is here except a few of his buddies, and they wont say anything because stan \"takes care of them\" so they wont speak about him, you look over at stan and he has let the tie on his robe come undone and stands there with a look in his eye that sends your mind screaming for what has just been explained to you .... as stan walks over to you , you see he has opened the robe fully now showing you his body, his fully naked body, and stares at you while asking if you would keep their secret also.<br>\r\n<br>\r\nYou are at a loss for words as stan's hands move to your waist band on your jeans, and without speaking another word unbuttons them, unzips them and has crouched down to help you pull them off your feet, still without speaking stan gets back up and leads you over to the bed by grabbing your hand to follow him ... as you get to where the bed is, stan turns around and places his small hand on your cock through your boxers, stan lets the robe fall off of him completely and sits down on the edge of the bed while once again grabbing your hand to get closer, as you are now standing right in front of stan, he pulls your arm down, you are on auto pilot and sink down till you were on your knees in front of stan.<br>\r\n<br>\r\nYou cannot believe that you are being seduced by a small 9 yr. old boy, but that is exactly what is happening ... stan's hands then move to the back of your head and is now bringing your head in to his crotch .... you see that stan's small member is starting to grow now and as you are close enough to actually smell his slightly growing cock ... your eyes close and without even thinking about it your mouth opens ... then it happens ............</span></div></div>",
            "created":1392699600,
            "id":1747835,
            "title":"Someone else"
        },
        "14231":{
            "choices":[
                "Get ready to swallow his boy juice.",
                "stand up and dont move a bit."
            ],
            "content":"<div class=\"\"><div> <span>You know you are transfixed by this boy and Stan knows thius to so you slowly flick out your tongue with stan guiding you and give three long slow licks up the boys cock, then you let your mouth completely swallow his cock, stan holds your head tight and tells you what to do.</span></div></div>",
            "created":1402808400,
            "id":1812490,
            "title":"You flick out your tongue and let it happen."
        },
        "142311":{
            "author_id":"chrisdegraaf",
            "author_name":"chris",
            "choices":[
                "take full advantage of the boy",
                "freak out"
            ],
            "content":"<div class=\"\"><div> <span>You slowly begin to suck on the boys little penis making fully extend. You are easily able to get the entire thing in your mouth and you suck vigorly.  Not like you had much of a choice with stans firm hand on the back of your head forcing you to do the naughty deed. You continue to suck until Stan's moans get so loud that he leans back a little and let's his juice shoot down your throat almost like a shot gun. Just giant waves of cum go rushing out into your mouth but Stan keeps his hand gripped over your head forcing you to swallow it all. <br>\r\n<br>\r\nOnce he was done you remove your mouth from his tiny cock hoping for a break but just then Stan takes hold of your penis and starts to stroke you.</span></div></div>",
            "created":1404104400,
            "id":1820659,
            "title":"Get ready to swallow his boy juice."
        },
        "1423112":{
            "choices":[
                "Swallows you and your juice.",
                "Throws you on the bed and ..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Stan grabs hold of your cock and pulls you closer, hey wait a minute here .. we should not be doing this, I don't know what came over me ...<br>\r\n<br>\r\nStan keeps stroking you until you are about to cum and then he .....</span></div></span></div>",
            "created":1405054800,
            "id":1825948,
            "title":"freak out"
        },
        "14231121":{
            "author_id":"chrisdegraaf",
            "author_name":"chris",
            "choices":[
                "Stan goes further",
                "You've had enough"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As your face scrunches up Stan gets on his hands and knees and places his mouth around your cock.  He takes your entire load in without spilling a drop.</span></div></span></div>",
            "created":1405054800,
            "id":1826117,
            "title":"Swallows you and your juice."
        },
        "142311211":{
            "choices":[
                "You  make a mess on Stans feet and must clean it up.",
                "Stan calls Joey over to play."
            ],
            "content":"<div class=\"\"><div> <span>After Stan swallowed your entire load, he kept some in his mouth to show you his mouth full of your cum and to savor the flavor, you being exhausted now lean back on the bed and the next thing you know ... there are two small feet rubbing up and down your just spent cock and amazing enough, Stan's little feet brought you back to full hardness.<br>\r\n<br>\r\nStan lay down on the bed opposite from you and was giving you the best foot job you ever received, he would purposely lift his small legs from time to time showing you his cute little rosebud before returning his small feet to your big cock ... Stan asked you if you liked his small feet and you told him that you liked them very much, Prove it then said Stan and lifted a small foot up to your mouth, you started sucking his cute little toes and licking the rest of his foot, you even tasted a little bit of your own pre-cum on his toes.<br>\r\n<br>\r\nStan looked you in the eyes and tells you that if you make a mess on his feet you must then clean up your mess with your tongue ... Stan then gets up on his knees facing away from you and lets his feet go back to stroking your hard cock, while you are now facing Stan's little butt up in the air ... Stan then asked if you would like him to give his best friend a call, Joey was Stan's age and liked the same kind of things.</span></div></div>",
            "created":1405054800,
            "id":1826201,
            "title":"Stan goes further"
        },
        "1423112112":{
            "choices":[
                "Joey and Jamie were walking in.",
                "Joey was by himself only in shorts."
            ],
            "content":"<div class=\"\"><div> <span>Stan just looks at you after asking you that question and with no reply from you he picks up the phone and shows it to you, he asked you the same question again and still with no reply and dials Joey's number, as he is talking to Joey he tells him that he has a holiday treat for the both of you, they both use these code words to describe when one of them has a new \"toy\" to play with, Joey tells Stan that he will be right over and dont start to much without him, he will have to get away from his little brother who he is watching right now, or he might have to bring him along and leave him downstairs.<br>\r\n<br>\r\nAfter Stan hangs up he tells you that his best friend Joey will be right over, he also tells you that if he cant get away from watching his younger brother he might have to bring him along and leave him downstairs while the three of you work on some things.<br>\r\n<br>\r\nAfter hearing this you started to get even harder then you already were, and you thought you couldnt get any harder then you were right now.<br>\r\nTwenty minutes later there is a knock on the door, Stan has kept you hard by licking you all over and talking about what they were going to do to you once Joey got here.<br>\r\n<br>\r\nStan answers the door ... and </span></div></div>",
            "created":1413262800,
            "id":1871714,
            "title":"Stan calls Joey over to play."
        },
        "14231121121":{
            "choices":[
                "Touches you  ....",
                "Turns around and sees his brother and stan."
            ],
            "content":"<div class=\"\"><div> <span>Joey calls out for stan telling him that he is here, while his younger brother Jamie starts to wander upstairs.<br>\r\n<br>\r\nStan races downstairs using the back steps and met Joey in the kitchen, as they are talking about what they should do now Joey notices that Jamie is not with him.<br>\r\n<br>\r\nJamie wandered upstairs looking in every room until he wanders into the room with you on the bed, Jamie just stares at you and how hard you are, you see him move closer to you, now standing right beside you when he ....</span></div></div>",
            "created":1420520400,
            "id":1913902,
            "title":"Joey and Jamie were walking in."
        },
        "142311211212":{
            "choices":[
                "Walks down stairs ... (to return later)",
                "Reaches out to you."
            ],
            "content":"<div class=\"\"><div> <span>Jamie turned around and saw his brother Joey and Stan, both boys were trying to keep Jamie downstairs and had intended to have him play video games for a little while, but now that he is standing right in front of you ... both boys looked at each other untill Jamies Brother Joey tells him that he can do whatever he wanted, there is no secret now.<br>\r\n<br>\r\nJamie looked over at you again and back down to see how hard you were, when Stan tells Jamie that we have pizza and video games downstairs if he wanted to go downstairs.   Jamie looks at the boys and then back down to your cock and ...</span></div></div>",
            "created":1420693200,
            "id":1915345,
            "title":"Turns around and sees his brother and stan."
        },
        "1423112112122":{
            "choices":[
                "Jamie closes around your head / Gets a blast on his face.",
                "Open"
            ],
            "content":"<div class=\"\"><div> <span>Jamie simply reaches his small hand out towards you laying on the bed ... when his hand makes contact with your hard stiff piece you tremble and start to feel yourself building up ... as you watch Jamie now starting to rub you up and down, he leans in closer to get a smell of the scent you are giving off.<br>\r\n<br>\r\nJamie brings his face within inches of your hard member and sniffs your raging cock, you watch his little tongue slip out of his mouth and make contact with your long shaft ... closer and closer you are about to let go until his small mouth reaches the tip of your cock and you cant hold it any longer ...</span></div></div>",
            "created":1421038800,
            "id":1916793,
            "title":"Reaches out to you."
        },
        "144":{
            "author_id":"tessz",
            "author_name":"Zack T.",
            "choices":[
                "They urge you no to go anywhere",
                "You go take a shower",
                "Something else happens "
            ],
            "content":"<div class=\"\"><div> <span>You still aren't sure whether your parents made a mistake or whether they really knew that your awakening sexual interests swung in both directions. Either way, you couldn't have been more excited to find out that your new school catered to bisexual teenagers, 14-18. <br>\r\n<br>\r\nFor months you had tried to find out more details about the school, but they were pretty tight-lipped about what they would say publicly. Now that you have finally arrived, you can't wait to satisfy your curiosity. <br>\r\n<br>\r\nYou take your bags to your room, open the door, and discover to your surprise that it is occupied. On one of the beds lay an older boy and girl, wrapped in each others arms. They are fully clothed, but you can tell they were getting ready to change that when you walked in. <br>\r\n<br>\r\nEmbarrassed, you start to back out, but they stop and the boy jumps up and rushes over to greet you.<br>\r\n<br>\r\n\"Hey, you must be Zeke,\" says the tall, fit, blonde boy. \"I'm Greg. I'm your roommate.\" As you shake his hand, Greg motions to the girl, who is smoothing out her rumpled clothing. \"This is Kelli. Sorry to give you a first impression like that, but we thought you were going to be here an hour from now and kind of got carried away.\"<br>\r\n<br>\r\nIf either of them are embarrassed, they don't show it, so you try to be nonchalant, as well. <br>\r\n<br>\r\nGreg helps you get your stuff in the room, and as he does, you admire the way his muscles flex. You are surprised to be rooming with an upperclassman, but you guess that a lot of things will be different here. <br>\r\n<br>\r\nAs you get settled, Greg points down the hallway. \"The bathroom is down there, including the showers. Beyond that is the Common Room for this floor. There is a fitness center and pool on the lower level, and the Common Room on the top floor is the house's Entertainment Room. In fact, we are having a movie night tonight in your honor, so you will get to see it.\"<br>\r\n<br>\r\nAs he speaks, Kelli gets up from the bed and stands next to Greg, looking at him intently. You see her hand begin to move over his back, shoulder, and arm in a very suggestive way. By the time Greg finishes speaking, his eyes are no longer on you, but on her. <br>\r\n<br>\r\nObviously they want to pick up where they were when you walked in. You say, \"Well, I think I will go grab a shower. After traveling all day, I just want to stand under some hot water for a long time.\"<br>\r\n<br>\r\nYou hope that sounded casual enough, and you grab your towel and a change of clothes.  </span></div></div>",
            "created":1365742800,
            "id":1570250,
            "title":"Another Option"
        },
        "1441":{
            "author_id":"tessz",
            "author_name":"Zack T.",
            "choices":[
                "Kelli and Greg undress you ",
                "They have you get down on your knees",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>As you start to leave, Kelli speaks up for the first time, other than to say, \"Hi\" when you walked in. <br>\r\n<br>\r\n\"Where are you going, Zeke?\" she asks, looking at you, but continuing to touch Greg. <br>\r\n<br>\r\n\"Um... A shower...\" you stammer. \"I thought I'd give you and Greg some space....\"<br>\r\n<br>\r\n\"We don't need any space, do we, Greg,\" she asks, continuing to look at you as her hand slips down to Greg's crotch. <br>\r\n<br>\r\nGreg responds to he touch by leaning in more closely to her and bringing one hand to her ass and another to the side of her face. He says, \"C'mon, Zeke.... What kind of roommates would we be if we couldn't share with each other?\"<br>\r\n<br>\r\nYou want to pinch yourself to make sure this isn't one of your horny schoolboy fantasies, and you stand there, open-mouthed, trying to think of an answer. Kelli takes her hand from Greg's crotch long enough to reach out to you, beckoning you toward them. <br>\r\n<br>\r\nNumbly, you step forward and let Kelli take hold of you and pull you in to them. As you come in contact with the two older teens, Kelli puts her hand on the back of your head and pulls you into a kiss. Her tongue reaches into your mouth, searching out yours, and at first you think that she has grabbed your ass, until you realize her hand is still on the back of your head. Abruptly, you realize the hand must be Greg's. <br>\r\n<br>\r\nGetting over the initial shock of the situation, you begin to eagerly return Kelli's kiss. Her hand releases your head and moves down to your ass, where it joins Greg's hand in exploring and squeezing you. <br>\r\n<br>\r\nCautiously you reach out with both hands as if you are doing a group hug. Feeling no resistance, you let your hands begin to wander over the shoulders and backs of the older teens before finally following their example by dropping your hands onto their asses. <br>\r\n<br>\r\nEven in your wildest fantasies about this place, you didn't think you would be making out with two upperclassmen within 20 minutes of your arrival. You are incredibly turned on. <br>\r\n<br>\r\nGreg begins kissing Kelli's neck, and you feel her shiver in appreciation. Greg's kisses move upward to her cheek, and you feel the roughness of his face against yours for a moment before it is replaced by the sensation of his lips on your cheek. <br>\r\n<br>\r\nYou move your hand from Kelli's ass to her left breast and marvel at how firm and full it is, compared to the few girls your age you have succeeded in feeling up. You are about to say something about it when Greg runs his tongue up your cheek to your ear and begins probing. You let out a gasp and moan, causing Kelli to look to see what is causing it. When she sees Greg tonguing your ear, she giggles and says, \"It looks like Zeke has a bit of an ear fetish, too; you guys will get along great as roommates!\" With that, Kelli turns her attention to your other ear and likewise begins to search it out with her tongue. <br>\r\n<br>\r\n</span></div></div>",
            "created":1365742800,
            "id":1570271,
            "title":"They urge you no to go anywhere"
        },
        "14411":{
            "author_id":"tessz",
            "author_name":"Zack T.",
            "choices":[
                "They tell you to go answer the door",
                "They ignore it"
            ],
            "content":"<div class=\"\"><div> <span>You feel someone pulling on your belt and glance down to see Kelli's hand at work.  Greg's hand move up inside your shirt and begins fingering your right nipple.  Soon his other hand is at work, lifting your shirt up over your head and throwing it onto the floor.<br>\r\n<br>\r\nBy this point Kelli has succeeded in undoing your belt and has unfastened the front of your jeans. Greg helps her in pushing them down to your ankles, allowing you to step out of them.<br>\r\n<br>\r\nThe three of you continue your make out session as you stand there, dressed in only your boxer-briefs. Their hands rove all over your body, making regular visits to your crotch, where your erection is begging to be released from its constraints.<br>\r\n<br>\r\nYour hands are hard at work, too. Between Kelli's scrumptious ass and firm tits and Greg's rock-hard bulge and iron pecs, your hands have never had so many choices for exploration.<br>\r\n<br>\r\nYou start to tug at their clothing, desiring not to be the only one in any state of undress. Just then there is a knock at the door. </span></div></div>",
            "created":1371186000,
            "id":1610792,
            "title":"Kelli and Greg undress you "
        },
        "1442":{
            "author_id":"tessz",
            "author_name":"Zack T.",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><div> <span>As you leave your roommate and Kelli in the room, you head down the hallway toward the bathroom. You wonder just how long you will need to drag out your shower, since  you have no real desire to interrupt them at the most critical moment by barging in on them for the second time that day.<br>\r\n<br>\r\nAs you enter the bathroom you see that the shower area contains two shower stalls, each with a shower curtain for privacy. One of the stalls is blocked and has an \"OUT OF ORDER\" sign in front of it. The other stall is unused at the moment.<br>\r\n<br>\r\nYou set your things on a bench and begin to undress. Just as you pull your shirt off, you hear another student entering the shower area. You look and see your fellow student similarly equipped with shower supplies, a towel and a change of clothing. That other student is....</span></div></div>",
            "created":1365829200,
            "id":1570867,
            "title":"You go take a shower"
        },
        "14422":{
            "choices":[
                "She stays in there longer",
                "She comes out within the next ten minutes"
            ],
            "content":"<div class=\"\"><div> <span>Female. She dumps her things down onto a bench and, not even acknowledging your appearance, begins tugging at her patterned shirt, revealing the back of her strapless bra. You immediately drop your eyes, not wanting to appear indecent, and resume to removing your torn jeans, but her naked presence makes you feel strange.<br>\r\n<br>\r\nUnable to help yourself, your eyes flicker up to her, and now she's completely naked apart from a pair of baby blue panties. Just before you have time to stare in awe at her figure, her head snaps up, and she obviously sees the one empty shower stall. Facing away from you, she bends down and slides her panties down her slender thighs, revealing her bare ass to your grateful eyes. <br>\r\n<br>\r\nThen you realize that she's about to nick the shower stall, so you hurriedly take off your jeans and just as you're about to remove your underwear, the girl turns round and sees you. You step back in a mixture of shock and guilt, but when you expect her to pull a hissy fit and scream at you for staring at her naked, a small smile adorns her gloss-caked lips. She then turns to face you, revealing her entire naked body to you.<br>\r\n<br>\r\n\"I call dibs on the shower first, loser,\" she chuckles, slinging her towel and shower kit over her bony shoulder and racing towards the shower stall. Before you can lift your legs to race after her, she's concealed behind the patterned curtain, and steaming water begins gushing from the shower.<br>\r\n<br>\r\nYou scowl, and mutter curse words under your breath, rewarded by a quiet but audible chuckle from the hidden girl.<br>\r\n<br>\r\nAfter at least twenty minutes, you shout at the girl, \"Hurry up in there! I need to shower!\".<br>\r\n<br>\r\n\"Jeez, be patient!\" she calls back, her voice sweet and high. <br>\r\n<br>\r\n\"If you aren't out in the next ten minutes, I'm bloody forcing you out of there!\" you yell back, then all goes silent.</span></div></div>",
            "created":1368939600,
            "id":1592931,
            "title":"Female"
        },
        "1443":{
            "author_id":"tessz",
            "author_name":"Zack T.",
            "choices":[
                "Show me around",
                "Tell me about yourself",
                "Tell me more about Greg"
            ],
            "content":"<div class=\"\"><div> <span>Before you can get your things together, there is a knock at the door. You head toward the door to open it, knowing that Greg and Kelli are unlikely to want to be disturbed. As you start toward the door, it opens, and you see a boy your age walk in, apparently accustomed to letting himself in  whenever he wants.<br>\r\n<br>\r\nHe glances at Greg and Kelli, grins knowingly, and then turns to you. \"Hey,\" he says, extending his hand to you. \"You must be Zeke. I'm Erik.\"<br>\r\n<br>\r\nYou shake hands with Erik just as Kelli makes a contented groan. Glancing over at the couple, you see that Greg is rubbing his hand between her legs, with obvious approval from her. <br>\r\n<br>\r\nErik motions for you to follow him and says, \"C'mon... I think they need some 'alone time', don't you?\"<br>\r\n<br>\r\nYou grin in response and follow Erik out the door.<br>\r\n<br>\r\nHe tells you that he was Greg's roommate until just a couple of weeks ago. Erik was chosen to be a Resident Assistant for the building and was moved to a private room. His job was to meet you and show you around and get you acclimated to your new school.<br>\r\n<br>\r\n\"So what would you like to do first,\" Erik asks.<br>\r\n<br>\r\nYou tell him....</span></div></div>",
            "created":1365829200,
            "id":1570869,
            "title":"A knock at the door"
        },
        "14432":{
            "author_id":"tessz",
            "author_name":"Zack T.",
            "choices":[
                "Ask him about the sex life at this place. ",
                "Step into his room to take a look. "
            ],
            "content":"<div class=\"\"><div> <span>You take an instant liking to Erik and want to get to know him better. <br>\r\n<br>\r\n\"Me? What can I say? Probably same story as most of the students here... My parents split up, and between their busy schedules and the distance between them, it didn't make sense for me to try to stay with either of them and still be able to go to school. Besides,\" he added with a grin, \"I suspect they were getting tired of finding me making out with a different person every day, so this school seemed like the logical choice.\"<br>\r\n<br>\r\nYou laugh. \"A different person every day?\"<br>\r\n<br>\r\n\"Well, maybe it wasn't that bad... But when dad started getting serious with his new girlfriend, and he came home one day and found me blowing her son, I think he decided I was going to complicate his dating relationship.\"<br>\r\n<br>\r\nYou look Erik over as he leads you down the hallway. Not only is he nice, but he's pretty hot, too. You picture him giving head to that boy and find yourself getting aroused. <br>\r\n<br>\r\nErik stops at a door and opens it. \"This is my room. The door is always open. As RA, I'm here to serve.\" With that, he takes an elaborate bow. <br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1366693200,
            "id":1577037,
            "title":"Tell me about yourself"
        },
        "14433":{
            "author_id":"tessz",
            "author_name":"Zack T.",
            "choices":[
                "try to get some privacy to take care of things",
                "Erik notices your boner"
            ],
            "content":"<div class=\"\"><div> <span>\"So you were Greg's roommate, huh? Anything I ought to know about him?\"<br>\r\n<br>\r\nErik considers your question for a moment. \"He's a great guy,\" he says. \"I was disappointed to have to move out, but getting your own room comes with being RA.\"<br>\r\n<br>\r\n\"I would have thought they'd try to pair up upperclassmen with other upperclassmen,\" you say. \"But Greg got you and me as roommates, and we're each 3 years younger than him.\"<br>\r\n<br>\r\nErik explains. \"They try to accommodate everyone's preferences. Greg likes our type.\"<br>\r\n<br>\r\n\"Our type?\"<br>\r\n<br>\r\n\"You know... Younger, twinkish in build. I assume you are a bottom?\"<br>\r\n<br>\r\nYou blush as you realize what he is talking about. \"Oh... Well, I don't really know about that. But no one asked me, anyway.\"<br>\r\n<br>\r\nErik admits, \"Well, considering we only have a couple of empty beds in this building, there really wasn't much of a choice. If it doesn't work out for you, you can always request a transfer when a bed opens. Or just do what everyone else does and move in, unofficially, with whomever you want.\"<br>\r\n<br>\r\n\"And you are ok with that? At my last school, the RA's were really strict about everyone being where they are supposed to be, making sure no girls are in the rooms after 9 pm, and that sort of thing.\"<br>\r\n<br>\r\nErik laughs, \"If I had to monitor that, I'd go nuts. Remember that we're all bisexual -- so what's the big idea if it's a guy or a chick in your room? We're not stopping sex by doing that!\"<br>\r\n<br>\r\nYou blush and try to change the subject, faintly aware that you are getting turned on by all this sex talk. <br>\r\n<br>\r\n\"So you were telling me about Greg. How long has Kelli been his girlfriend?\"<br>\r\n<br>\r\n\"Girlfriend? Kelli? Heck, they're not in a relationship -- although he probably brings her back to his room just as much as anyone else. They just happened to be together when they were both horny, so they're taking care of it. If you are the closest one around next time Kelli wants it, it will be you back in that room, instead of Greg, with Kelli's legs wrapped around you. Trust me, you are in for a treat!\" Erik winks as he says this. <br>\r\n<br>\r\nYou are definitely getting turned on, picturing the 18 year old girl getting it on with you. <br>\r\n<br>\r\n\"So that won't bother Greg?\"<br>\r\n<br>\r\nErik laughs again. \"You really are new, aren't you? Greg won't care. Heck, if he is around, he may very well join in. I should mention that he's always horny, so I hope you have a lot of stamina. It was awesome being his roommate, but I was always exhausted... Nights that I stayed in the room hardly ever meant that I'd get to sleep through the whole night.\"<br>\r\n<br>\r\nOK... There's no suppressing the complete hardon that has fully come to life in your pants now. <br>\r\n</span></div></div>",
            "created":1365915600,
            "id":1571439,
            "title":"Tell me more about Greg"
        },
        "145":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "introduced themselves.",
                "said you'd look better in the girls uniform.",
                "your choice."
            ],
            "content":"<div class=\"\"><div> <span>The only living space that was available was in the girls' dormitory. The only reason they placed you there was because of an accident you had when you were only nine years old. Your father was fighting off an armed burglar with a shotgun in your home when the gun went off. You were hit in the groin, destroying your 'manhood'. You were left with a false vagina and slightly wider hips as the blast cracked your hip bones.<br>\r\n<br>\r\n\"Zeke is completely neuter due to an unfortunate incident in his past.\" Firmly but kindly, Ms Kay, the headmistress announced to the girls. \"Please welcome him among you until we can find more suitable arrangements for him.\"<br>\r\n<br>\r\nThe girls looked at you curiously after reading the details of your unfortunate incident then shrugged as they began to claim bunks for themselves. You wisely allowed the girls to pick out the beds they wanted and took the only one left which was in the back near the bathroom. Once everyone had settled in, they began to talk among themselves or rather whisper with one girl occasionally looking your way. This made you nervous before the girls walked up to you and...<br>\r\n</span></div></div>",
            "created":1502590140,
            "id":2368398,
            "title":"A boy in grils' territory."
        },
        "1452":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "You get a makeover.",
                "The headmistress enters.",
                "Your choice."
            ],
            "content":"<div class=\"\"><div> <span>\"You would look better in the girl's uniform.\" With a bemused smile, the first girl said. \"That and I think it would make the rest of us feel more comfortable.\"<br>\r\n<br>\r\nThe girl was your height, slender, with shoulder length sand blond hair and blue eyes. She motioned to another girl, holding up a girl's uniform. It was a pleated dark blue skirt with a light blue blouse and and a dark blue jacket with a feminine pink bow tie. You gulped seeing that she was also holding a pair of pink panties with a white lace trim and a matching bra.<br>\r\n<br>\r\n\"I'm Connie, by the way.\" The first girl added. \"The one holding your new uniform is Bree.\"<br>\r\n<br>\r\nBree stepped forward with an almost gleeful smile on her face. She was slightly shorter than you with black hair and green eyes. \"We're all girls here.\" Earning giggles from the room, she said. \"Just change clothes like a good girl and we won't have to be persuasive about it.\"<br>\r\n<br>\r\nYou knew what Bree meant by 'persuasive', they would force the uniform onto you if you refused. \"It's made of the same materials as your old uniform.\" Grinning, Connie said.<br>\r\n<br>\r\n\"It's not me.\" Taking a step back, you protested. \"Also, you heard the headmistress...\"<br>\r\n<br>\r\n\"She told us to welcome you among us.\" Grinning, Bree said. \"Think of this as your initiation.\"<br>\r\n<br>\r\nThe other girls giggled and cooed before Connie shouted, \"Grab her!\"<br>\r\n<br>\r\nYou screamed as the girls lunged at you, stripping you of your clothing. Within minutes, you were wearing the girl's uniform and being tied up in a chair in front of a vanity...<br>\r\n</span></div></div>",
            "created":1505055360,
            "id":2383595,
            "title":"said you'd look better in the girls uniform."
        }
    },
    "info":{
        "author_id":"miradesh",
        "author_name":"Heresh",
        "brief_description":"Become a teenager who gets their dreams fulfilled at boarding school.",
        "created":1304209620,
        "description":"<td align=\"left\" class=\"norm\">All right, here's the story. You are a 15 year old teenager who is new to a boarding school. You are either:<br>\r\n<br>\r\nA girl in a girls' school;<br>\r\nA girl in a mixed school;<br>\r\nA boy in a boys' school;<br>\r\nA boy in a mixed school.<br>\r\n<br>\r\nNo vore, shrinking, etc. Normal stuff. Other than that, everything goes. Have fun and <b>please use correct grammar!</b></td>",
        "id":1772377,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1586680920,
        "modified":1586680920,
        "pretty_title":"Boarding School"
    }
}