{
    "chapters":{
        "1":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "Clean jokes",
                "Dirty jokes",
                "The Chronicles of Lil Johnny",
                "Rants"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your category.</span></div></span></div>",
            "created":1236920400,
            "id":661784,
            "title":"Category"
        },
        "11":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "Animal jokes",
                "People jokes",
                "Cheezy pick up lines",
                "Yo' Mama jokes",
                "Other jokes (as in jokes not in the categories above)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a sub-category</span></div></span></div>",
            "created":1236920400,
            "id":660184,
            "title":"Clean jokes"
        },
        "112":{
            "choices":[
                "Tell me a joke about  what you eat today?",
                "Tell me a joke that pertains to your bad breath?",
                "Tell me a joke about your ugly wife/husband?"
            ],
            "content":"<div class=\"\"><div> <span>Before, I am joking to my friends, aquaintances, brothers, sisters, etc...until one day, a stranger talk to me about something beautiful.  I am amazed by his presentation of the story that I actually called him always to continue the story.  I mean, it is a story, but in actual I have to deal with other people to continue the story.  If I cannot deal with these people, the story, he won't give the real meaning of the story.  I followed his instructions and I found out later that it's only a joke for me.  Now I am not joking to anybody even here in WDC.  So, I am serious now and not joking.  Okay?  But, I will give you an assignment to make a joke/s.</span></div></div>",
            "created":1243486800,
            "id":698524,
            "title":"People jokes"
        },
        "1123":{
            "author_id":"marvinschrebe",
            "author_name":"Chris Breva, M. Div. soon",
            "choices":[
                "More weather jokes about people"
            ],
            "content":"<div class=\"\"><div> <span>i just heard from a friend in Fargo. he said it has been snowing there for three days. He said his wife has nothing to do but stare through the window. He added that if it didn't stop snowing soon he was afraid  he'd have to let her in.<br>\r\n<br>\r\n<br>\r\nThis joke is not my own. I read it elsewhere. I thought it was hilarious so I wanted to share it.</span></div></div>",
            "created":1481582040,
            "id":2249149,
            "title":"Fargo"
        },
        "113":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "More"
            ],
            "content":"<div class=\"\"><div> <span>Just a few that I know:<br>\r\n<br>\r\nI forgot my number can I have yours?<br>\r\nI lost my teddy bear can I sleep with you?<br>\r\nI'm lost can I have directions to your house?<br>\r\nyou've been bad, go to my room!<br>\r\nare your legs tired? 'cuz you've been running through my mind all day.<br>\r\ndo you believe in love at first sight, or should I walk by again?<br>\r\nIf i could rearrange the letters in the alphabet I'd put U and I together.<br>\r\nI have skittles in my mouth, Wanna taste the rainbow?<br>\r\nDo you have a map, 'cuz I'm lost in your eyes<br>\r\n</span></div></div>",
            "created":1236920400,
            "id":660188,
            "title":"Cheezy pick up lines"
        },
        "1131":{
            "author_id":"jocaypa",
            "author_name":"BGM @ the pen",
            "choices":[
                "Even More!",
                "Change Kind of Jokes"
            ],
            "content":"<div class=\"\"><div> <span>Is your name Gillete? Because you are the best a man can get<br>\r\nLet's go to my place and do the things I'll tell everyone we did anyway.<br>\r\nLet me show you the way to heaven.<br>\r\nHi, I'm Mr. Right. Someone said you were looking for me.<br>\r\nCan I buy you a drink or do you just want the money?<br>\r\nWanna come back to my house and do some Maths? You can add the bed, subtract your clothes, divide your legs and we'll multiply.<br>\r\nYour name must be Daisy, because I have the incredible urge to plant you right here!<br>\r\nIs your dad a terrorist? Because your the bomb!<br>\r\n</span></div></div>",
            "created":1241067600,
            "id":684288,
            "title":"More"
        },
        "11311":{
            "author_id":"evilguy",
            "author_name":"evil dude",
            "choices":[
                "More pick up lines",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Just a few...<br>\r\n<br>\r\n\"You can call me milk,cuz I'll do your body good!\"<br>\r\n\"Are you fertilelizer,cuz you are the shit!\"<br>\r\n\"Hi, I,m into recycleing,cat posters,cars, and you in about 5 minutes.\"<br>\r\n\"I've got cash\"<br>\r\n\"Hi, I dropped my pants,can I have yours?.\"<br>\r\n\"Excuse me,you took my breath away and I'd like it back.\"<br>\r\n\"You lose anything,cuz I just found the key to your heart.\"</span></div></div>",
            "created":1241154000,
            "id":684866,
            "title":"More ways to get you slapped"
        },
        "114":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "More"
            ],
            "content":"<div class=\"\"><div> <span>Yo' mama's so fat she jumped in the air and got stuck<br>\r\nyo' mama's so ugly she looked out the window and got arrested for indesant exposure<br>\r\nyo' moma's so poor I went to her house rang the doorbell, and the toilet flushed<br>\r\nyo' mama's so fat she went to the beach and was the only one to get a tan<br>\r\nyo' mama's so fat she has to put on a belt with a boomerang<br>\r\nyo' mama's so fat everytime she turns around its her birthday<br>\r\nyo' mama's so fat if she wears yellow little kids try to ride her to school<br>\r\nyo' mama's so fat when she goes to amusement parks little kids try to ride her<br>\r\nyo' mama's so thin when she turns sideways, she dissapears<br>\r\nyo' mama's so old she was a waitress at the last supper<br>\r\nyo' mama's so old she cries dust<br>\r\nyo' mama's so poor a breeze blew away a cardboard box on the side of the highway and she had to move<br>\r\nyo' mama's so dumb she stood on a chair to try to raise her IQ<br>\r\nyo' mama's so dumb she was yelling into a letter, when i asked what she was doing, she said she was sending a voicemail<br>\r\nyo' mama's so poor she was kicking a can, said she was movin'<br>\r\nyo' mama's so dumb she tried to drown a fish<br>\r\nyo' mama's so dumb she tried to kill a bird by throwin' it off a cliff<br>\r\nyo' mama's so fat she went to the beach, and the lifeguard called in a beached whale<br>\r\nyo' mama's so fat her shadow weighs 58 pounds<br>\r\nyo' mama's so fat she went to the doctor and they had to weigh her on the rictor scale<br>\r\n<br>\r\n</span></div></div>",
            "created":1243486800,
            "id":698493,
            "title":"Yo' Mama jokes"
        },
        "1141":{
            "author_id":"evilguy",
            "author_name":"evil dude",
            "choices":[
                "More yo' mama jokes",
                "Other jokes"
            ],
            "content":"<div class=\"\"><div> <span>Yo' mama's so dumb, when she took an I.Q. test it came back negitive.<br>\r\nYo' mama's so fat,every time she farts she's accused of global warming.<br>\r\nYo' mama's so old and stupid,she dosen't beleave in god,but she is as old as him.<br>\r\nYo' mama's such an old sloppy drunk,I thought she was David Hasslehoff.<br>\r\nYo' mama's so poor,the only bling-bling she got is the fake seashells they let her keep from her old job at seaworld.</span></div></div>",
            "created":1243486800,
            "id":698590,
            "title":"Yo' mama's so..."
        },
        "115":{
            "author_id":"lilithmoon",
            "author_name":"Lilithmoon☽",
            "choices":[
                "Clean Jokes",
                "Dirty Jokes",
                "Bad Jokes"
            ],
            "content":"<div class=\"\"><div> <span>The ancient vampire lay in a torporific state, oblivious to his physical surroundings. Though his body be a prisoner of the soulless land of Catatonia while the sun still ruled the sky, his mind rode Xanadu’s sacred river Alph down to the sunless sea.<br>\r\n<br>\r\nHe slept not the dreamless sleep of the dead but the eternal morpheus sleep of the undead. His dreams flickered across the cobwebs of his mind like the silent films that fascinated him a century ago.<br>\r\n<br>\r\nDreams of the countless loves lost, senseless wars fought, and unspeakable horrors committed, danced through his head, unbidden. And the sun-- like all nosferatu, the vampire dreamed of the sun and the bittersweet day when last they embraced. <br>\r\n<br>\r\nHere tucked in the protective confines of his coffin, sealed within the safety of the mausoleum, the creature basked in the brilliance of a harmless imagined star. A star so bright it brought a crimson tear to his ghoulish eye. He basked in the glow, savoring the sensation of warmth upon his sun kissed skin, flesh glistening with perspiration. <br>\r\n<br>\r\nPerspiring from the heat of Helios … heat … The heat was intense. The fiend did not understand. The smell of charred cloth and burning hair -- his hair-- penetrated the misty veil of his consciousness. The searing pain that invaded every fiber of his languid frame was unbearable. How was this happening?<br>\r\n<br>\r\nThe vampire fought monstrously to break the grip of the supernatural lethargy that plagued him. Screaming in mindless frustration and willing his limbs to move. He felt his skin smolder and crack as he simmered in his own bloody juices. In one mammoth act of desperation, he flung open the lid and slithered weakly over the side, congealing in a pool on the floor of his tomb like drying blood. <br>\r\n<br>\r\nThe coolness of the marble floor revitalized the still smoking vampire. Standing to his full height, he surveyed his surroundings, quickly deducing what had taken place. With moral indignation and outrage he yelled…<br>\r\n<br>\r\n<u><b>“Who's the wise-ass that put me in the tanning bed!”</b></u></span></div></div>",
            "created":1332626820,
            "id":1301731,
            "title":"Other jokes (as in jokes not in the categories ..."
        },
        "1151":{
            "author_id":"lilithmoon",
            "author_name":"Lilithmoon☽",
            "choices":[
                "Clean Jokes",
                "Dirty Jokes",
                "Knock Knock Jokes"
            ],
            "content":"<div class=\"\"><div> <span>A screenwriter comes home to a burned down house. His sobbing and slightly-singed wife is standing outside. “What happened, honey?” the man asks.<br>\r\n<br>\r\n“Oh, John, it was terrible,” she weeps. “I was cooking, the phone rang. It was your agent. Because I was on the phone, I didn’t notice the stove was on fire. It went up in second. Everything is gone. I nearly didn’t make it out of the house. Poor Fluffy is--”<br>\r\n<br>\r\n“Wait, wait. Back up a minute,” The man says. “My agent called?”</span></div></div>",
            "created":1332627060,
            "id":1301734,
            "title":"Clean Jokes"
        },
        "11511":{
            "author_id":"lilithmoon",
            "author_name":"Lilithmoon☽",
            "choices":[
                "Clean Jokes",
                "Dirty Jokes"
            ],
            "content":"<div class=\"\"><div> <span>A linguistics professor was lecturing to his English class one day. \"In English,\" he said, \"a double negative forms a positive. In some languages, though, such as Russian, a double negative is still a negative. However, there is no language wherein a double positive can form a negative.\"<br>\r\n<br>\r\nA voice from the back of the room piped up, \"Yeah, right.\"<br>\r\n</span></div></div>",
            "created":1332627240,
            "id":1301739,
            "title":"Clean Jokes"
        },
        "12":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "Bar jokes",
                "Racial jokes",
                "Animal jokes",
                "People jokes",
                "Other jokes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick a sub-category</span></div></span></div>",
            "created":1236920400,
            "id":660182,
            "title":"Dirty jokes"
        },
        "121":{
            "author_id":"evilguy",
            "author_name":"evil dude",
            "choices":[
                "Next joke",
                "Next joke",
                "Next joke"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A man walks into a bar.\"Ow!Damn it!\"(Bad pun,sorry.)</span></div></span></div>",
            "created":1241154000,
            "id":684858,
            "title":"Walking into a bar"
        },
        "1211":{
            "author_id":"evilguy",
            "author_name":"evil dude",
            "choices":[
                "Next joke",
                "Next joke",
                "Next joke"
            ],
            "content":"<div class=\"\"><div> <span>A man walks into a bar and asks for 10 shots of hard vodka.\"What's the ocassion?\" Asks the bartender.\"My first blowjob.\"says the man.The bartender pours all ten as well as an 11th.\"Here's one on me!\" he says as he lines them up.\"Thanks.\" Says the man.\"But even 11 won't wash the taste of penis out of my mouth.\"</span></div></div>",
            "created":1241154000,
            "id":684863,
            "title":"First time"
        },
        "12111":{
            "author_id":"johnfaber",
            "author_name":"John",
            "choices":[
                "Yet another?",
                "Or maybe this one?"
            ],
            "content":"<div class=\"\"><div> <span>It happened in a bar in the old Wild West. Outside stands a stallion laughing. After a short pause however, he whines and cryes out loud.<br>\r\n A cowboy walks into a bar. The bartender asks: \"Why was the horse laughing?\"<br>\r\nThe cowboy: \"Because I told him I had the bigger penis.\"<br>\r\n\"And why is it crying now?\"<br>\r\n\" 'Cos I showed him.\"</span></div></div>",
            "created":1287301740,
            "id":976472,
            "title":"What about this one...?"
        },
        "1212":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "More",
                "More?"
            ],
            "content":"<div class=\"\"><div> <span>A man walks into a bar and sees a jar stuffed with 10 dollar bills. He walks to the bar and asks whats up with the jar. The bartender explains:<br>\r\n<br>\r\n\"It's a contest, if you pass all three tests you win the jar, but the catch is you have to pay the $10 to hear the rules\"<br>\r\n<br>\r\nBeing very self-confident he takes out a 10 dollar bill and stuffs it in the jar.<br>\r\n<br>\r\n\"OK, first you have to drink a gallon of pepperd tequilla in under 5 minutes without puking it up,<br>\r\nThen you have to go out back to the pit bull, and remove its sore tooth,<br>\r\nThen you have to go upstiars and satisfy the woman upstiars in room 12 who has never had an orgasim in her life\"<br>\r\n<br>\r\nThe man gets really angry and stomps off shouting obcenities that he just got ripped off 10 dollars and no one could do all that. About an hour later the same man staggers up to the bar completely drunk out of his mind. He slams another bill on the bar.<br>\r\n<br>\r\n\"Where'zzat Tequilllaa?\"<br>\r\n<br>\r\nHe takes the jug, and slams it down without taking a single breath. Tears are pouring down the sides of his face and he begins to violently shake. But in the end he finished it off like a pro and staggers out the back door towards the pit bull. After a short moment of scilence, from the back is heard a massive comotion of screams and growls. After 10 minutes of what sounds like a very violent struggle between the man and the pit bull, the man staggers into the bar, shirt torn, bleeding, covered in dirt and mud.<br>\r\n<br>\r\n\"OK, Nowwhere'zzat woman with the sore tooth?\"</span></div></div>",
            "created":1301597640,
            "id":1079412,
            "title":"Next joke"
        },
        "122":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "Short Racial jokes",
                "Longish Racial jokes"
            ],
            "content":"<div class=\"\"><div> <span>There's a white guy, a black guy, a mexican guy, and a german guy all in a plane. The pilot says \"We're goin' down throw off as much stuff as possible\" The german picks up a crate of guns, and throws them off, as he does he says, We have plenty of these in my country. The mexican picks up a crate of tortilla shells and throws them off, as he does he says \"We have plenty of these in my country\" The pilot looks back and says \"That's not enough stuff throw more off\"<br>\r\nThe white guy picks up the black guy and throws him off \"We got plenty of these in my country\"</span></div></div>",
            "created":1243832400,
            "id":700543,
            "title":"Racial jokes"
        },
        "1221":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "More short ones",
                "others"
            ],
            "content":"<div class=\"\"><div> <span>What do you call a bunch of black kids playing in a pile of leaves?<br>\r\nRaisin Bran<br>\r\n<br>\r\nA black guy, a mexican, and an asian are in a car, Who's driving?<br>\r\nThe police<br>\r\n<br>\r\nWhy don't italians like helicopters?<br>\r\n'Cuz dego whap whap whap<br>\r\n<br>\r\nHow do you give a black guy a shower?<br>\r\nAim and spit<br>\r\n<br>\r\nHow do you know adam and eve were white?<br>\r\nHave you ever tried to take a rib from a black man?<br>\r\n<br>\r\nHow do you starve a black guy?<br>\r\nHide his food stamps in his workboots<br>\r\n<br>\r\nHow do you fit 100 jews in one car?<br>\r\nAshtray<br>\r\n<br>\r\nWhat's the difference between a jew and a pizza?<br>\r\nThe pizza doesn't scream when you put it in the oven<br>\r\n<br>\r\nWhats the difference between a black guy and a pizza?<br>\r\nA pizza can feed a family of four<br>\r\n<br>\r\nHow many white men does it take to screw in a lightbulb? <br>\r\nOne, white men will screw anything.<br>\r\n<br>\r\nWhat do you call 500,000 white guys jumping out of a plane? <br>\r\nSnow.<br>\r\n<br>\r\nWhat do you call a bunch of white guys sitting on a bench?<br>\r\nThe NBA<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1243832400,
            "id":700546,
            "title":"Short Racial jokes"
        },
        "1222":{
            "author_id":"marvinschrebe",
            "author_name":"Chris Breva, M. Div. soon",
            "choices":[
                "Add a long joke"
            ],
            "content":"<div class=\"\"><div> <span>A Jewish man, a Black man, and a White man were walking down a country road since their car had broken down. It was getting toward dark so they stopped at a farm and asked to spend the night. The old farmer told them they could stay but warned them not to bother his beautiful daughter. They all went too bed and through out the night took turns visiting the daughter.<br>\r\n<br>\r\nThe next morning the farmer wakes them all up at gun point. \"I told you not to mess with my daughter! Now you'll all be severely punished. Go out to the garden, pick a vegetable, and bring it to me.\"<br>\r\n<br>\r\nThinking they were getting off pretty easy they all went to the garden. The Jewish man picked a cucumber and returned to the farmer. The farmer took the cucumber, told the Jewish man to drop his drawers and  bend over. Then the farmer abruptly shoved the cucumber where the sun doesn't shine!<br>\r\n<br>\r\nThe white guy came  in carrying an ear of corn. He was tolld to drop his drawers and the ear of corner was inserted in a forbidden cavity.<br>\r\n<br>\r\nSuddenly both the Jew and the white man burst out laughing.<br>\r\n<br>\r\n\"What's so funny\"  asked the farmer.<br>\r\n<br>\r\n\"Poor George is coming now\" the white guy answered. \"He's carrying that six inch diameter zucchini squash you grew!\"</span></div></div>",
            "created":1480386120,
            "id":2243397,
            "title":"Longish Racial jokes"
        },
        "12221":{
            "author_id":"marvinschrebe",
            "author_name":"Chris Breva, M. Div. soon",
            "choices":[
                "Add a long joke"
            ],
            "content":"<div class=\"\"><div> <span>On the roof of a very tall building are four men; one is asian, one is mexican, one is black, and the last one is white. The asian walks to the ledge and says, \"This is for all my people\" and jumps off the roof. Next, the mexican walks to the ledge and also says, \"This is for all my people\" and then he jumps off the roof. Next is the black guy's turn. The black guy walks to the ledge and says, \"This is for all my people\" and then throws the white guy off the roof.<br>\r\n<br>\r\nI can't and won't claim authorship for that joke. Like any joke i tell I heard or read it elsewhere. I found this one at this link: <a rel=\"nofollow\" href=\"http://staging.laughfactory.com/\" target=\"_blank\">http://staging.laughfactory.com/</a></span></div></div>",
            "created":1480388820,
            "id":2243416,
            "title":"Another Racial Joke but with an unexpected twist"
        },
        "123":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "More animal jokes"
            ],
            "content":"<div class=\"\"><div> <span>A bear was chasing a rabbit through the woods. They passed a frog who yelled \"Stop chasing eachother and I will grant you both 3 wishes each.\" They agreed and sat still in front of the frog. The bear went first, \"I wish that all the bears in this forest, except for me, were female.\" The frog croaked, and it was so. The rabbit thought for a minute and got an evil little twinkle in his eye. \"I wish for a motorcycle helmet.\" The frog croaked and a helmet appeard next to the rabbit. The bear gave the rabbit a strange look but was too selfish to understand his intentions. The bear wished again \"I wish all the bears in the entire world, except for me, were female\"<br>\r\nthe frog croaked, and it was so. The rabbit almost imediatly spoke up \"I wish for a motorcycle\" the frog croaked and a motorcycle appeard. The bear thought for a moment...\"I wish that I could live having constant sex for the rest of my life\" The frog croaked and it was so. The rabbit chuckled softly to himself then straped on his helmet, climed onto the motorcycle and started it up. He looks at the bear, smirks evily and then says to the frog...<br>\r\n\"I wish the bear was gay\" then took off like a bat outta hell.</span></div></div>",
            "created":1240981200,
            "id":683587,
            "title":"Animal jokes"
        },
        "1231":{
            "author_id":"johnfaber",
            "author_name":"John",
            "choices":[
                "Yet another?",
                "Or maybe this one?",
                "Damn it, why don't I get three choices when I need them?"
            ],
            "content":"<div class=\"\"><div> <span>Once upon a time, a woman met a fairy which granted her three wishes.<br>\r\nThe woman said: \"I wish for a lot of money!\"<br>\r\n(The fairy sighed, because that was THE standard first wish. But she granted it anyway.)<br>\r\nThen the woman received the cash, she said: \"I wish I'd live in a really big castle.\"<br>\r\n(The fairy raised an eyebrow, because the standard second wish was \"I wish for another lot of money\".)<br>\r\nThen her wish was granted, the woman's look fell upon her tomcat, and she said: \"I wish my cat would turn into a beautiful prince, and we would live forever together.\"<br>\r\nThe fairy was even more surprised by this one. After she granted it, she disappeared, saying: \"Have a nice time with it!\"<br>\r\nActually, the woman had dirty thoughts about this wish. She leaded her cat into her bed room and stripped naked. Then she pressed her body against his, he smiled widely and said with a high voyce: \"Now you regret you've castrated me three months ago, right?\"</span></div></div>",
            "created":1287302760,
            "id":976478,
            "title":"More animal jokes"
        },
        "124":{
            "choices":[
                "Any more sex jokes?",
                "Or another type of joke?"
            ],
            "content":"<div class=\"\"><div> <span>A man is walking along on a journey all by his lonesome. To find himself, to visit some great tourist destination... You know, the kind of random journeys everybody takes. As he's traveling along, he notices it's getting late and decides to find a place to stay. As he passes a fellow passerby on the dirt road, he stops to ask him \"Hey, how far away is the Old Log Inn?\"<br>\r\n<br>\r\nThe passerby tells him that it's about an hour's walk from where he is, and that he'll have to take a right turn at an upcoming intersection. After thanking the passerby, the man continues on his way. When he gets to the intersection, he sees a little boy standing in the middle of the fork in the road and asks him \"Hey kid, how far is the Old Log Inn?\"<br>\r\n<br>\r\nThe boy points him in the right direction and tells him that it's just a little ways more. As the man continues along the way he has chosen, he eventually finds himself walking through a large, grassy plain with a young couple making love amidst the flowers. Walking up to the young couple, he asks \"How far is the Old Log Inn?\"<br>\r\n<br>\r\nTo which the young woman responds...<br>\r\n<br>\r\n\"ALL THE WAY!!!!!\"</span></div></div>",
            "created":1237006800,
            "id":660829,
            "title":"Dirty Lil' Sex Joke My Dad Taught Me"
        },
        "1241":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "more sex jokes",
                "other people jokes"
            ],
            "content":"<div class=\"\"><div> <span>A couple who live in an apartment complex can only have sex during the afternoon hours because of their work schedual, but that meant that there son would be home. To solve this delema they made up a game for their son in which he stands on the balcony and overviews the neighboorhood to look for sucpicious activity. One day the couple was makeing love and their son was on the balcony, yelling back to his parents his report.<br>\r\n\"Mr. Nelson is moving out, he's got a U-Haul outside and he's moving his furniture into it. The Johnsons are goin out with their kids. And Mr. and Mrs. Christoper are making whoopie\"<br>\r\nafter that last report the couple stops haveing sex confused. The father asks \"how do you know that?\"<br>\r\nhis son replies \"Their son is standing on the balcony too.\"</span></div></div>",
            "created":1237438800,
            "id":663264,
            "title":"Any more sex jokes?"
        },
        "12411":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "More Sex Jokes",
                "Other People Jokes"
            ],
            "content":"<div class=\"\"><div> <span>A couple was having a baby. While the mother was pregnant they were still having sex. The mother went into labor and 4 hours later gave birth to a boy. The boy looked around and saw the doctor. He looked up and said \"Are you my daddy?\" the doctor said \"No im the doctor.\" The baby looked around and saw a male nurse and said \"Are you my daddy?\" \"No im a nurse.\" The baby looked at the last guy in the room and said \"So you must be my daddy?\" \"Yes im your daddy\" he replied. He leaned in close and the baby poked him in the forehead \"How do you like it?!\"</span></div></div>",
            "created":1240981200,
            "id":683577,
            "title":"more sex jokes"
        },
        "124111":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "More ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>3 men in line to get into heaven, St. Peter at the gate filtering out the oncommers. To the 3 men St. Peter explained the rules:<br>\r\n<br>\r\n\"In heaven you all get a vehicle and a home, the quality of these items are dependent on how loyal you were to your spouse on earth\"<br>\r\n<br>\r\nThe frist man walked up to the gate and was asked the quesstion \"How many times did you cheat on your spouse or significant other?\"<br>\r\n<br>\r\nto which he replied \"Never once, didn't even think about it.\" As a reward he was given a Z06 Corvette and a 3 story mansion.<br>\r\n<br>\r\nThe second mans response to the same question : \"Once or twice when I was really drunk or on vacation.\" He was given a mini-van and a 1 bedroom appartment.<br>\r\n<br>\r\nThe third man answered \"Truthfully, I lost count of all the women i had on the side.\" St. Peter ,although disgusted with the man, had to give him something, so he got a beat up, falling apart, rust bucket punch bug, and a run down trailor.<br>\r\n<br>\r\nA few days go by, and the guy in the bug rolls up next to the man in the Corvette, who was crying.<br>\r\n<br>\r\nThe first man asked \"Dude, what are you crying about, you got the sweetest ride and the nicest house in the place?\"<br>\r\n<br>\r\nTo which he repplied \"Its not the car or the house, I just saw my wife on a skateboard carring a cardboard box under her arm.\"</span></div></div>",
            "created":1301600280,
            "id":1079458,
            "title":"More Sex Jokes"
        },
        "124112":{
            "choices":[
                "Back to sex jokes",
                "Other jokes"
            ],
            "content":"<div class=\"\"><div> <span>I needed to find a place to put these, so I figured I'd list them under \"Other People's Jokes.\" Basically, the punchline of each of these jokes references an infamous despot in history. Most of them are pretty bad (as I came up with them myself) but they're good for a big groan, which can be just as therapeutic as a good laugh!<br>\r\n<br>\r\nQ: What did they call the young leader of the Nazi Party when he showed up to the prom with a large pimple on his nose?<br>\r\nA: Adolf Zitler<br>\r\n<br>\r\nQ: What did they call the young leader of the Nazi Party after his sex change operation?<br>\r\nA: Adolf Titler<br>\r\n<br>\r\nQ: Who is the leader of the Infamous Fascist-farm Animals Party (I-FAP)?<br>\r\nA: Moo-solini<br>\r\n<br>\r\nQ: And the infamous Fascist Cat Party?<br>\r\nA: Meowsolini<br>\r\n<br>\r\nQ: How did a critic of the government respond when the leader of the Khmer Rouge called him murderous? <br>\r\nA: \"That's like the Pol Pot calling the kettle black!\"<br>\r\n<br>\r\nQ: What do you call a porn star from the Soviet Union?<br>\r\nA: A cummunist<br>\r\n<br>\r\nQ: How did the leader of the Soviet Union respond when met with questions about how sustainable his economic system was?<br>\r\nA: He started Stalin for time<br>\r\n<br>\r\nIf anyone knows some good Hideki Tojo jokes, please tell me so I can skewer all three members of the Axis Powers! </span></div></div>",
            "created":1240981200,
            "id":683721,
            "title":"Dictator Jokes!"
        },
        "1241122":{
            "choices":[
                "Anything...",
                "...Else?"
            ],
            "content":"<div class=\"\"><div> <span>A more modern day abusive ruler:<br>\r\n<br>\r\nQ: What would you call the Iranian President if he learned to play the piano very well?<br>\r\nA: Mahmoud Bach-madinejad<br>\r\n<br>\r\nAlthough I personally don't consider him a dictator or even an incompetent ruler...<br>\r\n<br>\r\nQ: How do you cheer on the Venezuelan President?<br>\r\nA: Hugo (You go), Chavez!<br>\r\n<br>\r\nThat's enough for now... maybe...</span></div></div>",
            "created":1241326800,
            "id":685747,
            "title":"Few More Dictator Jokes I Forgot"
        },
        "1242":{
            "author_id":"evilguy",
            "author_name":"evil dude",
            "choices":[
                "Next joke",
                "Next joke",
                "Next joke"
            ],
            "content":"<div class=\"\"><div> <span>Three explorers were shipwrecked on a tropical island.As they walked further into the jungle they came across a tribe of natives.They were then brought to the tribes village as prisoners.The chief offered them a deal:they complete 2 tasks or they die.They all agreed.The first task was to gather ten types of fruit and report back for the second task.Bob and Jeff,being the fastest gathered their fruit first and reported back.While they waited for Larry,their slow friend to return the chief began their second task.They had to shove all ten peices of fruit up their ass while making no noise,or they die on the spot.Bob had choosen ten apples and only got three up his ass before moaning in pain,so they cut off his head.Jeff luckily had picked ten small grapes and fared much better.However on the final one he burst out laughing,and he too,had his head cut off.Bob and Jeff both meet in haven.Bob says\"Dude, you almost had it, why'd you laugh!!!!!!????\"So Jeff says\"I saw Larry walking back with an armload of pineapples!\"</span></div></div>",
            "created":1241154000,
            "id":684498,
            "title":"3 explorers"
        },
        "12421":{
            "author_id":"evilguy",
            "author_name":"evil dude",
            "choices":[
                "Next joke",
                "Next joke"
            ],
            "content":"<div class=\"\"><div> <span>A man meets a beautiful woman walking down the street while driveing his car on his day off.He asks if she'd like to go on a date with him in the countryside.She agrees, so they leave the city and head to the country.Later that night they are about to have sex on the side of the road in their car when the woman says\"I'm sorry,I should have told you before,but I'm a hooker and it'll cost you $100 for sex.\"Begrudgeingly he pays her and they have sex.Afterwards the man climbs upfront,but does'nt start the car.After waiting for 20 minutes the woman asks\"Why don't you start the car?Its late and I would like to go home.\" \"Oh?\"replys the man.\"Well I should have told you before,but I'm a cab driver and it'll cost you $200 to get back to the city.\"</span></div></div>",
            "created":1241154000,
            "id":684502,
            "title":"Next joke"
        },
        "124211":{
            "author_id":"evilguy",
            "author_name":"evil dude",
            "choices":[
                "Next joke",
                "Next joke"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How many babies does it take to paint a house?<br>\r\n<br>\r\nIt depends on how hard you throw them.</span></div></span></div>",
            "created":1243400400,
            "id":697838,
            "title":"Childish humor"
        },
        "125":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "More"
            ],
            "content":"<div class=\"\"><div> <span>cheesy pick up lines:<br>\r\nDo you have a mirror in your pocket? 'Cuz I can see myself in your pants.<br>\r\nThe word of the day is legs. wanna go back to my place and spread the word?<br>\r\nYour left leg is Christmas and your right leg is Thanksgiving, Mind if I visit you between the holidays?<br>\r\nThose pants are very becoming on you. If I was on you I'd becoming too.<br>\r\nI wish you were an oven. So I could be a loaf of bread and rise up in you.<br>\r\n(look down)...(look back up)...It's not gonna suck itself...<br>\r\nCare to go out for pizza and some sex? (usually followed by a slap) What you don't like pizza?<br>\r\nNice shoes, Wanna fuck?<br>\r\nSit on my lap and we can talk about the first thing that pops up.<br>\r\nYou must live on a chicken farm.'Cuz you sure know how to raise a cock.<br>\r\nYou must be a carpenter. 'Cuz when i see you I think of wood.<br>\r\nLets play lion tamer. You bend over and growl and I stick my head in your mouth.<br>\r\nCall someone over by waving a finger:<br>\r\nIf they come over say: You must be pretty fresh I can make you come with one finger.<br>\r\nIf not continue raising fingers and make a comment like: Wow you must be experienced it took me (however many fingers) to make you come.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1236920400,
            "id":660197,
            "title":"Other jokes"
        },
        "13":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "Lil' Johnny and the holidays",
                "Lil' Johnny and politics",
                "Lil' Johnny and sunday school",
                "Lil' Johnny playin' cards",
                "Lil' Johnny and courting"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lil' Johnny is about 5-8 years old and he's at the age of wonder. Everything and anything has a deeper meaning. And unfortunatly Lil' johnny takes everything the wrong way.</span></div></span></div>",
            "created":1237179600,
            "id":661787,
            "title":"The Chronicles of Lil Johnny"
        },
        "131":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "content":"<div class=\"\"><div> <span>Lil' Johnny's family is getting ready for thanksgiving. His mom and dad are upstairs arguing. \"You are such a bastard!\" \"Well your a stingy bitch!\" His father stomps out of the room into the bathroom. Johnny enters and asks his mother \"Mommy whats a bastard and a bitch?\" she replies \"Well a bastard is another word for a gentleman and a bitch is another word for a lady\" she leaves Johnny wondering and goes downstairs. Johnny wanders to his brothers room who is in the middle of his health homework. \"Conception occurs when the man puts his penis in the vagina...\" Johnny speaks up \"Bro whats a penis and vagina?\" His brother not wanting to explain the \"birds and the bees\" says \" A penis is a type of mans hat and a vagina is a ladys overcoat\" He shoos Johnny out of the room and Johnny goes to find his father in the bathroom shaving. He cuts himself and says \"Shit!\" \"Daddy whats shit?\" His dad startled says \"It's the type of shaving cream I use.\" Johhny accepts the answer and goes downstairs to find his mother cutting the turkey. She accedently cuts her finger \"Fuck!\" \"Mommy whats fuck mean?\" She replies \"Its a special way to cut the turkey\" At that statement the doorbell rings and Johnny runs to greet his guests.<br>\r\n<br>\r\nHe gathers them all in the front hall and proudly exlaims to the group:<br>\r\n<br>\r\n\"Welcome bitches and bastards, may I take your penises and vaginas? Mom's in the kitchen fucking the turkey, and dads upstiars wiping the shit off his face.\"<br>\r\n</span></div></div>",
            "created":1237179600,
            "id":661793,
            "title":"Lil' Johnny and the holidays"
        },
        "132":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "content":"<div class=\"\"><div> <span>Lil' johnny came home from school one day and asked his dad \"Daddy what's Politics?\"<br>\r\nhe replied \"Ok, I'll try to explain it in a way you can relate to. Since im the head of the household lets call me Government, your mother is second in command so we'll call her The Senate. The nanny does alot of the chores so we'll call her the Working Class. We provide for you so lets call you The People and your baby brother is the Future. So think about it and see what you can tell me in the morning. Johnny did his homework, ate dinner and went to bed all the time thinking about what his father had said. He woke up in the middle of the night to the sound of his brother crying. He went to his room and found he had soiled his diaper. He went to his parents room and found his mother fast asleep. Not wanting to disturb her, he went to the nanny's room but the door was locked. He peeked through the keyhole and saw his dad having sex with the nanny. He gave up and went back to bed. In the morning he jumped merrily down the stairs to his dad at the breakfast table and gleefully announced \"Dad I think I understand politics now.\" His dad encouringinly replied \"Good, explain to me what you think politics are and how they work\" <br>\r\nHe replied<br>\r\n\"While the Government is screwing the Working Class, The Senate is fast asleep, The people are being ignored and the Futuer is in deep shit.\"</span></div></div>",
            "created":1240981200,
            "id":683594,
            "title":"Lil' Johnny and politics"
        },
        "133":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "More sunday school jokes"
            ],
            "content":"<div class=\"\"><div> <span>In sunday school the teacher asks the group \"What part of the body do you think goes to heaven first?\"<br>\r\nLil' Suzie answers \"I think its your hands because you put them together when you pray\"<br>\r\nDavid interupts \"No its your chest because thats where your heart is and thats where the power of Jesus lives\"<br>\r\nThe teacher says \"Good answers, anyone else have an opinion?\"<br>\r\nLil' Johnny raises his hand and says \"I think its your legs\"<br>\r\nThe teacher, well aware of Johnny's misunderstanding of things reluctantly asks \"Why do you think that?\"<br>\r\nHe answers:<br>\r\n\"Because last night I saw my mommy in bed with the neighbor with her legs straight up in the air screaming \"Oh God im comming!\"\"</span></div></div>",
            "created":1237179600,
            "id":661794,
            "title":"Lil' Johnny and sunday school"
        },
        "1331":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "More"
            ],
            "content":"<div class=\"\"><div> <span>The sunday school teacher gave the students and assignment to find out something exciting about something interesting. The kids all went home to find their interesting topics.<br>\r\n<br>\r\nThe next week they all came into class and one by one told their interesting tales. Johnny purposely waited 'til everyone was done.<br>\r\n<br>\r\nThe teacher called on Johnny and he went up to the board, drew a dot, turned and went back and sat down.<br>\r\n<br>\r\nThe teacher asked \"What is that?\"<br>\r\n<br>\r\n\"Its a period\" replyed Johnny.<br>\r\n<br>\r\n\"Well I can see that, but whats so interesting about a period?\" said the teacher<br>\r\n<br>\r\nJohnny said \"Hell if I know but yesterday 'sis said she missed hers, Mom fainted, dad had a heart attack, and the guy next door left the country\"</span></div></div>",
            "created":1243949520,
            "id":701006,
            "title":"More sunday school jokes"
        },
        "13311":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "content":"<div class=\"\"><div> <span>Lil' Susie was a girl in sunday school that always falls asleep. So one day Johnny decides to teach her a lesson. He brings in a needle to stick her with everytime she dozes off.<br>\r\n<br>\r\nSo the teacher was in the middle of a lecture and , as expected, Susie began to fall asleep.<br>\r\n<br>\r\n\"What is the name of our father in heaven?\"<br>\r\nJohnny sticks the pin in Susies back<br>\r\n<br>\r\n\"Good God!\" She yelled \"Yes Susie, good job.\"<br>\r\n<br>\r\nAs the lecture continued, Susie fell back asleep.<br>\r\n<br>\r\n\"What is the name of our lord and savior?\" asked the teacher <br>\r\nLil' Johnny stabbed Susie with the pin again<br>\r\n<br>\r\n\"Jesus Christ!\" she exclaimed at the poke \"Yes Susie thats correct.\"<br>\r\n<br>\r\nLater in the lecture Susie fell asleep once again.<br>\r\n<br>\r\n\"What do you think Eve said to Adam after she gave birth to their 7th child?\"<br>\r\nAnother jab from Johnny.<br>\r\n<br>\r\n\"If you stick that thing in me one more time I'm gonna break it in half and make you eat it!\"</span></div></div>",
            "created":1301595840,
            "id":1079402,
            "title":"More"
        },
        "134":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "content":"<div class=\"\"><div> <span>Lil' Johnny is walking around bored<br>\r\nHe goes to his dads room but the doors locked<br>\r\nHe knocks and says \"Dad whatcha up too?\"<br>\r\nHis dad replies \"Playin' cards\" Lil Johnny asks \"Whos your partner?\"<br>\r\n\"Your mother now go away\"<br>\r\nHe runs over to his brothers room whos door is also locked<br>\r\n\"Hey bro whatcha doin'?\"<br>\r\nHis brother replies \"Playin cards with my girlfriend, now go away\"<br>\r\nJohnny runs off to his room and closes the door<br>\r\nHis mom and dad finish \"Playin cards\" and his dad walks down the hall and sees that Johnnys door is shut and locked<br>\r\nHe walks over \"Hey Johnny whatcha doin'?\"<br>\r\nJohnny replies \"Playin' cards\"<br>\r\nHis dad curiously, but coutiously asks\"...Oh...really...who's your partner?\"<br>\r\nTo which Johnny replies<br>\r\n\"You don't need a partner if you got a good hand\"</span></div></div>",
            "created":1237179600,
            "id":661797,
            "title":"Lil' Johnny playin' cards"
        },
        "135":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "content":"<div class=\"\"><div> <span>Little Johnny had been hearing quite a bit about 'courting' from the older boys, and he wondered what it was and how it was done. One day he took his question to his mother, who became rather flustered. Instead of explaining things to Johnny, she told him to hide behind the curtains one night and watch his older sister and her boyfriend. <br>\r\n<br>\r\nThis he did. The following morning, Johnny described everything to his mother. \"Sis and her boyfriend sat and talked for a while, then he turned off most of the lights. Then he started kissing and hugging her. I figured Sis must be getting sick, because her face started looking funny. He must have thought so too, because he put his hand inside her blouse to feel her heart, just the way the doctor would. Except he's not as smart as the doctor because he seemed to have trouble finding her heart. <br>\r\n<br>\r\nI guess he was getting sick too, because pretty soon both of them started panting and gettin all out of breath. His other hand must of been cold because he put it under her skirt. About this time Sis got worse and began to moan and sigh and squirm around and slide down toward the end of the couch. This was when her fever started. I knew it was a fever, because Sis told him she felt really hot. <br>\r\n<br>\r\nFinally, I found out what was making them so sick, a big eel had gotten inside his pants somehow. It just jumped out of his pants and stood there, about 10 inches long, honest anyway, he grabbed it in one hand to keep it from getting away. <br>\r\n<br>\r\nWhen Sis saw it, she got really scared, her eyes got big, and her mouth fell open, and she started calling out to God and stuff like that. She said it was the biggest one she's ever seen; I should tell her about the ones down at the lake. <br>\r\n<br>\r\nAnyway, Sis got brave and tried to kill the eel by biting its head off. All of a sudden she grabbed it with both hands and held it tight while he took a muzzle out of his pocket and slipped it over the eel's head to keep it from biting again. Sis lay back and spread her legs so she could get a scissor -- lock on it and he helped by lying on top of the eel. <br>\r\n<br>\r\nThe eel put up a hell of a fight. Sis started groaning and squealing and her boyfriend almost upset the couch. I guess they wanted to kill the eel by squashing it between them. <br>\r\n<br>\r\nAfter a while they both quit moving and gave a great sigh. Her boyfriend got up, and sure enough, they killed the eel. I knew because it just hung there, limp, and some of its insides were hanging out. <br>\r\n<br>\r\nSis and her boyfriend were a little tired from the battle, but they went back to courting anyway. He started hugging and kissing her again. By golly, the eel wasn't dead! It jumped straight up and started to fight again. I guess eels are like cats -- they have nine lives or something. <br>\r\n<br>\r\nThis time, Sis jumped up and tried to kill it by sitting on it. After a 35 minute struggle, they finally killed the eel. I knew it was dead, because I saw Sis's boyfriend peel its skin off and flush it down the toilet.\"<br>\r\n<br>\r\nHis mother fainted.<br>\r\n</span></div></div>",
            "created":1243949280,
            "id":701005,
            "title":"Lil' Johnny and courting"
        },
        "14":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "Prison"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Stand up comedy is a passion of mine, this section is unlike the rest in that its just a place to rant. for anyone who has ever seen a stand up comedy show, you'll know what i'm talking about.</span></div></span></div>",
            "created":1387219560,
            "id":1708716,
            "title":"Rants"
        },
        "141":{
            "author_id":"frosty4098",
            "author_name":"frosty",
            "choices":[
                "More"
            ],
            "content":"<div class=\"\"><div> <span>Hypothetical situation, a guy who is higher than the Hubble telescope on crystal meth and paint thinner breaks into your house, steals everything you own, rapes and murders your children wife and dog, beats the shit out of you and ties you to a phone pole and makes you watch him burn your house to the ground. A few days later he gets arrested and charged with breaking and entering, burglary, premeditated homicide, and bestiality. He gets 7 consecutive life sentences without a chance for parole. He is going to spend the rest of his and his grandchildren’s life in prison. The media is going to call it “justice”. Justice was served. He got what he deserved. And that’s that, everyone goes on about their lives as you try to rebuild yours. Now let’s look at it from the perspective no one ever thinks about. This man has literally taken your entire life away from you and you will never fully recover. And now you, as a free taxpaying citizen of the united states, get to spend the rest of your life, paying for his permanent residency in the form of an 8x8 cell with a bucket to shit in and a slab of crab infested wool to sleep on. You get to pay for him to have 3 meals a day. You get to pay for his gym membership, his laundering services, his rehabilitation, his education on how to find a gang in prison to survive with, his babysitting fees in the form of the prison guards salaries, and last but not least you get to pay every single penny of his healthcare expenses. Something you never thought about isn’t it? All prisoners on this planet have all expense paid healthcare. Because you ,as free taxpaying citizen of the united states, get to front the bill. You get to pay for all the stitches from shiv wounds, and to get his asshole resized and his therapy sessions because a black guy named “big bubba” got a little frisky in the shower. In the meantime the blow to your mental health which prevents you from ever being able to hold a job at a pay grade above shoveling cow shit, means that you have no means to get yourself a permanent residence, or a bucket to shit in, or a crab infested slab of wool to sleep on, or 3 meals a day, or a gym membership, or laundering services, or rehabilitation, or education, or any form of healthcare. Because justice was served. But let’s look at it from another perspective. A crime that heinous should certainly be worthy of the death penalty. However most of the states in America don’t like the capital punishment. So if this happens anywhere in the country other than Texas, this is what happens. 3-10 years of court battles and appeals and overrulings and controversies and delays and overpaid lawyers battling your fresh out of a third rate law school in a third world country public defender asshole. But through it all he finally gets sentenced to death. And then he will sit on death row for 5+ years, while you pay for his entire life after you’ve paid for the millions of dollars worth of court battles. But through it all, finally the day comes where you get to pay for his execution. A lethal injection which contains a secret cocktail of deadly chemicals that probably cost you thousands of dollars each. But through it all, you get to watch this brutal heartless man who stole your life get put down. After they give him an alcohol swab that you also paid for. I mean common, We’re killing the bastard, the least we could do is make sure he doesn’t get an infection. So you tell me does that sound like the kind of justice we should have to live with? Regular people in this country have to fight and claw their way around the workplace to ensure they have enough money to put food on the table, and just because they happen to be free taxpaying citizens of the united states, a percentage of that goes to make sure rapists, murderers, drug dealers, maniacs, cannibals, and thieves have a quality meal, plenty of time in the sunshine to lift weights and sodomize one another and free healthcare. Meanwhile you have to pay 600 dollars to take your child to the hospital because he wrecked his bike in the street on the pothole that the state just doesn’t have the spare money to fix.</span></div></div>",
            "created":1387219620,
            "id":1708717,
            "title":"Prison"
        }
    },
    "info":{
        "author_id":"frosty4098",
        "author_name":"frosty",
        "brief_description":"Not a story just a bunch of jokes",
        "created":1236971280,
        "description":"<td align=\"left\" class=\"norm\">This is not a story it's just a bunch of jokes. I made it interactive so you could add your own and share your jokes and those you heard.<br>\r\n<br>\r\n<br>\r\n                         Yes dirty jokes and swearing are allowed.</td>",
        "id":1538446,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1481582040,
        "modified":1481582040,
        "pretty_title":"Jokes"
    }
}