{
    "chapters":{
        "1":{
            "choices":[
                "I pick Jennifer",
                "I pick Cassandra",
                "I pick Chasity",
                "I pick mom",
                "I refuse"
            ],
            "content":"<div class=\"\"><div> <span>It was an ordinary day like any other. You woke up in the morning, went to school, talked to your friends, and took the bus home. However, when you stepped inside the house, your parents were looking very serious. They called a family meeting. \"Whats going on?\" You inquire.<br>\r\n<br>\r\nMom answered. \"Well honey, today I lost my job. As you know, we were already sinking in debt. Because of the loss of income, the bank is probably going to take our house and car. Unless...\"<br>\r\n<br>\r\n\"Unless what?\" You ask.<br>\r\n<br>\r\n\"Well\" She continued. \"I have a friend who's a scientist at a medical research facility. He's developed a new technology and needs test subjects for his first trial. The subjects will get paid huge sums of money...\"<br>\r\n<br>\r\n\"Then why don't we go for it?\" <br>\r\n<br>\r\n\"Well thats the problem. The tests subjects would have to be you and one of the girls in the house. You would...err...have to swap bodies with one of them.\"<br>\r\n<br>\r\n\"WHAT? Mom that's crazy!\" You exclaim.<br>\r\n<br>\r\n\"Think about it Jake. It'll be cool to try out someone else's life, you can always switch back after the trial.\"<br>\r\n<br>\r\n\"Well, I guess I could think about it...\"<br>\r\n<br>\r\n\"Great! Well then. Your choices are: your older sister Jennifer, your younger sister Cassandra, Chasity your exchange sister from Britain, or me.\"<br>\r\n<br>\r\nWell then...</span></div></div>",
            "created":1361336400,
            "id":1536174,
            "title":"The beginning"
        },
        "11":{
            "author_id":"kaiensekai",
            "author_name":"Kaien",
            "choices":[
                "The switch goes perfectly",
                "You switch unforunately you can never change back",
                "Conflict in the Lab",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>You really didn't want to switch anyone but your parents are right you could use the money...you thought about it and that if you really had to go through with this then you would want the most perks you could out of this. So you thought the best choice was your older sister Jennifer: My sister was hot while I wasn't anything too special so it would be fun to see her reaction to me having her body while she dealt with my ordinary one. Please she never had any chores around the house since your Dad always made you do everything while his princess' did nothing. Plus your sister had the most authority in the house when your parents weren't around so that meant you could boss her around. Plus she was incredible popular you always wonder what that would be like since you kind of an outcast. And deep down even though you never wanted to admit you always to see what it would be like as a hot young girl.<br>\r\n<br>\r\n\"Alright I've decided!\" You said.<br>\r\n<br>\r\nEveryone sat waiting to hear your answer.<br>\r\n<br>\r\n\"I've decided I want to switch with Jennifer.\" You said.</span></div></div>",
            "created":1366866000,
            "id":1578073,
            "title":"I pick Jennifer"
        },
        "112":{
            "author_id":"jackthejackman",
            "author_name":"JackTheJackMan",
            "choices":[
                "Look down",
                "Cry",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up.</span></div></span></div>",
            "created":1561157220,
            "id":2676885,
            "title":"You switch unforunately you can never change back"
        },
        "12":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "the procedure ",
                "change in plans "
            ],
            "content":"<div class=\"\"><div> <span>You really don't want to swap bodies with anyone, but your family does need the money. You think that if you had to swap with any of your family members you would swap with Cassandra You youngest sister who was 12, as the two of you were best friends. Your mother tells you Cassandra has already agreed and had said Cassandra had said the same about you.</span></div></div>",
            "created":1361336400,
            "id":1536360,
            "title":"I pick Cassandra"
        },
        "121":{
            "choices":[
                "Your mother standing there?",
                "Cassandra in your body?",
                "Jennifer a worried big sister ready to help you though puberty?"
            ],
            "content":"<div class=\"\"><div> <span>Well if that's what you want, I'm okay with that too.\" Cassandra accepted.<br>\r\n<br>\r\nThe next day you arrive at the lab. The doctor led you to the procedure room. It was anything but what you expected. Inside the room with few windows, there were two tubes, with a bed that extended out of each one. As you nervously lay down on your end, the doctor strapped you in tightly. He attached electrodes to your face and limbs, and said he was ready to start. Everyone left the room and watched on from the windows. The doctor remained to start the procedure. He started up the machine, it started collecting energy.<br>\r\n<br>\r\nThe doctor called out \"When you're ready, press the button above your head.\" Scanning, you find the button. You raise your hand, and pause. You take one last good look at yourself from this point of view. You press the button, Your whole body begins to shake and your world goes black.<br>\r\n<br>\r\n**************************************************************************** ************************************************<br>\r\n<br>\r\nYou begin to wake up you don't know how much time went by but your whole body feels completely foreign to you then before you passed out. Looking around, you're in a room with two beds. The other one is already empty. Looking around, you see no other people. Then it hits you - you were Cassandra! Nervously, you slowly looked down. You gasped, everything was so new to you.The view was foreign. Looking straight down, you now saw inside the neckline of hospital gown; you could see two small breasts nestled inside Looking further down were a pair of short skinny legs, dainty arms lying beside them. You then felt your legs they were so soft and hairless. Small feet and hands. <br>\r\n<br>\r\nTrying to walk around, it felt totally normal. You remember the doctor saying that motor skills stay with the body. \"Look, he's awake!\" You hear someone call. Your family runs up to you. It was weird seeing your own body talking to you, but you would have to get used to that. All things aside, you notice you need to go to the washroom. You walk towards the wash room, and open the door a crack, noticing your small breasts just starting to develop underneath you. Sighing, you switch over to the girls bathroom, sitting down on the cold seat. You slide down your panties it felt wrong and so right at the same time. You use the washroom, careful to wipe after you are done. While you're at it, you take a quick peak at your new boobs and look at the mirror inside the stall you seem flat chested and then you head home with your family. <br>\r\n<br>\r\nYou get home and head upstairs to the bedroom your new bedroom. the procedure took a lot out of you. When you awake, you sore?</span></div></div>",
            "created":1447304400,
            "id":2060537,
            "title":"the procedure "
        },
        "1213":{
            "choices":[
                "You can't change back till your puberty has finished? ",
                "She explained puberty to you and what will happen?",
                "She tells you she is pregnant after a one night stand?"
            ],
            "content":"<div class=\"\"><div> <span>Hey Jenny, what are you doing? You sat up in bed and then covered your voice and suddenly got very emotional and started crying.<br>\r\n<br>\r\nJenny quickly came over to you hugged you and held you in her arms again her breast, don't worry Jake I'm here.<br>\r\n<br>\r\nYou eventually calmed down, Jenny let you go and started talking to you in a way a mother would to her daughter.<br>\r\n<br>\r\nShe then kissed your forehead and smiled don't worry Jake emotions are expected, thank you mum.<br>\r\n<br>\r\nYou turned red with embarrassment at realising that you just called your big sister mum, Jenny smiled and said don't worry darling, she then explained that when she hit puberty around the age of 12 or 13 that she took you or cassanda under her wing and started becoming connect in a very emotional and material way with you.<br>\r\n<br>\r\nYou looked at her and hugged her once again this time tight and started crying again, I can't handle all these emotions Jenny, Help me please;<br>\r\n<br>\r\nShe took your hand and took you into the bathroom and washed you so she could show you how to wash as a girl.<br>\r\n<br>\r\nRight Jake let's go shopping for you, you smiled and said ok mum, you look at you and realised there was something else wrong.<br>\r\n<br>\r\nWhat is wrong Jenny? It's puberty, what? Well....<br>\r\n<br>\r\n</span></div></div>",
            "created":1447390800,
            "id":2060682,
            "title":"Jennifer a worried big sister ready to help you..."
        },
        "12132":{
            "choices":[
                "Periods ",
                "Till my early 20s "
            ],
            "content":"<div class=\"\"><div> <span>Right Jake this is what will happen:<br>\r\n<br>\r\nDuring puberty, your body begins growing faster. Some girls have uncomfortable growing pains in their arms and legs. How long this \"growth spurt\" lasts and how tall you will be at the end of it depends on a lot of things — but mostly it has to do with how tall the other people in your family are.<br>\r\nDuring puberty, your breasts will change size and shape. Your hips will widen. You may not even notice this because it's a very subtle and slow change.<br>\r\n<br>\r\nYour clitoris will grow a little, too. The inner lips of your vulva will become more prominent and may stick out from the outer lips. They also might change color. Vulvas are as different and diverse as faces, and that's normal. <br>\r\nHair grows in your armpits, around and above your vulva (it's called pubic hair), and the hair on your legs may get thicker and darker.<br>\r\n<br>\r\nYou'll probably begin to sweat more under your arms, and your sweat may smell different or stronger. You can shower or bathe more often and use deodorant if you don't like the way you smell.<br>\r\nIt's common to develop pimples (acne) during puberty. If you have problems controlling your pimples, call your nurse or doctor for help.<br>\r\n<br>\r\nDuring puberty, you'll also start getting your period. <br>\r\nPuberty doesn't happen all at once — it happens in stages. For example, a girl's breasts may start to grow, but she may not get her period until years later. You may continue to go through puberty changes until you're 20 years.<br>\r\n<br>\r\nWhat do you mean....</span></div></div>",
            "created":1494133200,
            "id":2316303,
            "title":"She explained puberty to you and what will happen?"
        },
        "122":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "Jennifer, older sister",
                "Chasity, British exchange sister",
                "Julia, Mom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cassandra came down with the flu right before the procedure was to take place and you were confronted to pick someone else to swap with. You chose _________ as the replacement</span></div></span></div>",
            "created":1361422800,
            "id":1536548,
            "title":"change in plans "
        },
        "1222":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "It works full proof",
                "It works with side effects",
                "something goes wrong"
            ],
            "content":"<div class=\"\"><div> <span>This was a hard choice. You couldn't become Jennifer, she was so mean to you and Cassandra, you didn't want to have to take her place. Plus she probably had a boyfriend, and that would be pretty weird for you. And mom, you couldn't make her do that. What would dad think? You were disgusted by the thought of being turned on by your dad in in her body. That was also out of the question! It might be fun, Chasity was the you age and you crush. Plus laws in Britain let you do things like drinking at a younger age.That would give you the ultimate freedom. You announce \"Alright, I've made my choice.\"<br>\r\n <br>\r\n\"Who will it be?\" Asked a nervous Julia.<br>\r\n <br>\r\n\"Chasity\" You replied to her surprise and disappointment. <br>\r\n<br>\r\n\"Well if that's what you want, I guess we can work things out and explain it to my parents.\" Chasity accepted. The doctor led you to the procedure room. It was anything but what you expected. Inside the room with few windows, there were two tubes, with a bed that extended out of each one. As you nervously lay down on the 'male' end, the doctor strapped you in. He attached electrodes to your face and limbs, and said he was ready to start. Everyone left the room and watched on from the windows. The doctor remained to start the procedure. He started up the machine, it started collecting energy.<br>\r\n <br>\r\nThe doctor called out \"When you're ready, press the button above your head.\" Scanning, you find the button. You raise your hand, and pause. You take one last good look at yourself from this point of view. You press the button, and your world goes black.</span></div></div>",
            "created":1361422800,
            "id":1536843,
            "title":"Chasity, British exchange sister"
        },
        "12221":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "Chasity in your body walks in",
                "you fall asleep"
            ],
            "content":"<div class=\"\"><div> <span>After 5 minutes, you wake up blank. You had no idea where you were. Looking around, you're in a room with two beds.The other one is already empty. Looking around, you see no other people. Then it hits you - you were Chasity! Nervously, you slowly looked down. You gasped, everything was so new to you.The view was foreign. Looking straight down, you now saw inside the neckline of a shirt; a shirt with two perfectly formed breasts nestled inside. Looking further down were a pair of long, tan, skinny legs, dainty arms lying beside them. You were wearing Chasity's black skirt and white blouse. Small feet and hands accompanied. Trying to walk around, it felt totally normal. You remember the doctor saying that motor skills stay with the body. \"Look, he's awake!\" You hear someone call. Your family runs up to you. It was weird seeing your own body talking to you, but you would have to get used to that. All things aside, you notice you need to go to the washroom. You walk towards the washroom, and open the door a crack, noticing your breasts bouncing underneath you. Sighing, you switch over to the girls bathroom, sitting down on the cold seat. You slide down your pants, it felt wrong and so right at the same time. They revealed a pair of silk panties. Sliding them all the way down, you use the washroom, careful to wipe after you are done. While you're at it, you remove your shirt and look at the mirror inside the stall. Looking from a few angles, you're quite well endowed, almost model like. You dress yourself, and head home with your exchange family. You get home and head upstairs to the bedroom you have to yourself, once again, as you had let Chasity have your room and slept in the room with Cassandra.</span></div></div>",
            "created":1361422800,
            "id":1536846,
            "title":"It works full proof"
        },
        "122212":{
            "choices":[
                "Check out your body.",
                "Go out and find Chasity in your body.",
                "Do something else."
            ],
            "content":"<div class=\"\"><div> <span>While sitting down on Chasity's bed a wave of sleepiness just hits you. The bed looks really soft and when you lye down on it, you close your eyes and fall asleep. You begin to dream vividly, but not the usual dreams about saving a hot girl from her castle or something like that. You are standing on a field somewhere in the country, it looks rather British. You look around to see where you are, when suddenly a building rises up from the ground, it looks like some sort of school. Without you even noticing girls wearing school uniforms are surrounding you, walking around like some mindless zombies. It's then that you suddenly notice you're wearing a uniform too, a white blouse and a blue skirt. Before you could do anything about it, you are being pushed inside the school building by the other students. Inside the building you find yourself sitting in a classroom, in front of you stands a very old lady with a mean scorch who keeps hitting you. <br>\r\n<br>\r\nYou quickly escape the classroom and see a house rising in front of you, for some reason one word hits your mind: home. You run towards the house, wanting to get inside. But no matter how fast you run the house doesn't get any closer. A few people come out of the house and you know somehow that they are Chasity's parents, a feeling of comfort and safety hits you. You try to run faster, almost tripping down. It's to no use, as the house slowly disappears and you're all alone. You're sitting down on your knees, feeling sad and lonely. It's then that you suddenly see a bright glowing hand in front of you, inviting you to grab it. When you pull yourself up to see who the person is, a flash of light occurs. <br>\r\n<br>\r\nThe next moment you're lying on your bed. You raise yourself up and looking at yourself, you're still inside Chasity's body. But what was with that dream? Were those perhaps memories of Chasity or was it just some weird life like dream? You're not sure what it was, only that it was freaky. You should keep it in mind though. <br>\r\n<br>\r\nYou stretch yourself out, even though the dream was weird, you feel better now than before. It's then that you're thinking about what to do.</span></div></div>",
            "created":1431925200,
            "id":1979843,
            "title":"you fall asleep"
        },
        "1222121":{
            "choices":[
                "Chasity in your body, hearing the sounds coming from your room.",
                "Jenny, who promised to go shopping with Chasity.",
                "someone else."
            ],
            "content":"<div class=\"\"><div> <span>You know you shouldn't do this, but this is way too weird not to do. You're pretty sure Chasity is doing the same with your body, after all you're both teenagers and interested in the opposite sex. You pull yourself up from the bed, as you pop open the buttons of the blouse you're wearing. The more buttons you open, the more exciting you get. When you're finally done, you can't help but admire Chasity's perfect breasts in the white lacy bra she was wearing. They were beautiful, so perky and yet so supple as you carefully take a squeeze. <br>\r\n<br>\r\nYou can't help but let out a little moan, Chasity's breasts are really sensitive. You then shimmer your way out of the skirt until it falls down on your ankles and you quickly shove it away. The lace panties Chasity was wearing were beautiful, very feminine. Your can't help yourself as you let your hands move all over your body, your breasts, your waist and your nether region. You then decide to take off the bra and panties, looking at Chasity in all glory. Removing her bra is difficult as you can't find the straps to it, but with the help of a small hand mirror you found you manage to take off the bra. <br>\r\n<br>\r\n\"That's so much better.\" You say with your British accent, relieved at the feeling of your breasts being free. You then take off your panties as well, now standing all nude. You can't see much from her vagina, with your breasts in the way but with the help of the hand mirror again, you can see a blond patch of hair above her vagina. You can't help but find it sexy that Chasity lets it grow there.<br>\r\n<br>\r\nThen it's time for the main event. You first carefully play with her breasts, not too hard of course. But the longer you play with her breasts, the rougher it gets. When you begin squeezing your nipples, you know it's time for down there. At first you carefully rub around your vagina, feeling getting wetter. Then you slowly take your fingers inside of her, as you can feel the mother of all pleasures has arrived. It's then that it all went glazy, you barely can remember what you do trying to orgasm, but when you finally do, you get the best orgasm you ever had. After that you decide to continue on, having an orgasm for several more times. <br>\r\n<br>\r\nWhen you're finally done, you lie on your bed, just enjoying the afterglow of your orgasm. Being Chasity might not be so bad after all. It's then that the door to your room opens, and instinctively you cover up your body. You see it's...</span></div></div>",
            "created":1435208400,
            "id":1998599,
            "title":"Check out your body."
        },
        "12223":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "mouth",
                "vagina"
            ],
            "content":"<div class=\"\"><div> <span>You awaken a few minutes later, but you feel very light, almost airy in fact. The doctor looks at you and says, \"Oh, good you're awake. I have some terrible news. Your body and some of Chasity's brain disintegrated during the swap process, leaving you a puddle of goop that can live in a host body, but part of Chasity and your body are gone forever. Her body is here, being preserved, as you will be symbiotically living in it, we don't know for sure of all of Chasity made it out of her, as we think it may only have been her most recent memories that were destroyed. This is because we halted the process as soon as we saw this was occurring, but we were too late. You going inside her should bring back her memories, because she can see them through your eyes, but we aren't sure she will be awake. You will have full access to her memories though, through the symbiotic connection between you two. You feel yourself being moved and see Chasity laying in bed, not moving, but breathing. You watch as the doctor pulls off Chasity's clothes as you will have to enter through the holes of her body, being the mouth, and vagina. You are soon dumped onto Chasity and you start oozing your way to her....</span></div></div>",
            "created":1362891600,
            "id":1547410,
            "title":"something goes wrong"
        },
        "122232":{
            "author_id":"thonan",
            "author_name":"thonan",
            "choices":[
                "explore your new body",
                "go home"
            ],
            "content":"<div class=\"\"><div> <span>You don't want to risk suffocating Chasity, and whatever is left of the male you were says to do it. You ooze your way towards her vagina and start to slide inside. Chasity moans a little and begins to shudder as you turn her on. You are about Halfway inside when you start to feel control over Chasity's body become yours. You hear her consciousness snoring as you take control.  Once you have control of her hands,  you above your hand into 'your' vagina to push the rest if you inside.  You are now in complete control of Chasity's body, so you....</span></div></div>",
            "created":1363064400,
            "id":1548538,
            "title":"vagina"
        },
        "1223":{
            "choices":[
                "The next morning",
                "Dinner time"
            ],
            "content":"<div class=\"\"><div> <span>This was a hard choice. You couldn't become Jennifer, she was so mean to you and Cassandra, you didn't want to have to take her place. Plus she probably had a boyfriend, and that would be pretty weird for you. And Chasity, you couldn't make her do that. What would her parent think? You couldn't just move back to Britain in her body. That was also out of the question. That left only one option: Mom. It was weird to you, she was the biggest age gap from you. But as you thought it over, you took a closer look that you never really did before. Mom didn't wear much makeup and dressed conservatively. She actually had pretty nice skin, a youthful face, and a young looking body. With the right clothes in makeup, she could probably pass for 24 instead of 34! It might be fun, Mom was the legal age to do anything she wanted to. That would give you the ultimate freedom. You announce \"Alright, I've made my choice.\"<br>\r\n<br>\r\n\"Who will it be?\" Asked a nervous Chasity.<br>\r\n<br>\r\n\"Mom\" You replied to everyone's surprise. <br>\r\n<br>\r\n\"Well if that's what you want, I'm okay with that too.\" Mom accepted. The doctor led you to the procedure room. It was anything but what you expected. Inside the room with few windows, there were two tubes, with a bed that extended out of each one. As you nervously lay down on the 'male' end, the doctor strapped you in. He attached electrodes to your face and limbs, and said he was ready to start. Everyone left the room and watched on from the windows. The doctor remained to start the procedure. He started up the machine, it started collecting energy.<br>\r\n<br>\r\nThe doctor called out \"When you're ready, press the button above your head.\" Scanning, you find the button. You raise your hand, and pause. You take one last good look at yourself from this point of view. You press the button, and your world goes black.<br>\r\n<br>\r\n<div align=\"center\">-------------------------------------------------------------------- -------------------------------------------------------------------------------- -------------------------------------------------------------------------------- </div><br>\r\n<br>\r\nAfter an hour, 5 minutes, 10 hours? Who knows. You wake up blank. You had no idea where you were.Looking around, you're in a room with two beds. The other one is already empty. Looking around, you see no other people. Then it hits you - you were mom! Nervously, you slowly looked down. You gasped, everything was so new to you.The view was foreign. Looking straight down, you now saw inside the neckline of a shirt; a shirt with two perfectly formed breasts nestled inside (<a rel=\"nofollow\" href=\"http://thechive.files.wordpress.com/2013/01/womans-pov-14.jpg\" target=\"_blank\">http://thechive.files.wordpress.com/2013...</a>). Looking further down were a pair of long skinny legs, dainty arms lying beside them. Small feet and hands accompanied. Trying to walk around, it felt totally normal. You remember the doctor saying that motor skills stay with the body. \"Look, he's awake!\" You hear someone call. Your family runs up to you. It was wierd seeing your own body talking to you, but you would have to get used to that. All things aside, you notice you need to go to the washroom. You walk towards the washroom, and open the door a crack, noticing your breasts bouncing underneath you. Sighing, you switch over to the girls bathroom, sitting down on the cold seat. You slide down your pants, it felt wrong and so right at the same time. They revealed a pair of silk panties. Sliding them all the way down, you use the washroom, careful to wipe after you are done. While you're at it, you remove your shirt and look at the mirror inside the stall. Looking from a few angles, you're quite perky, almost teenager like. You dress yourself, and head home with your family. You get home and head upstairs to the bedroom you had to yourself. Looking in the closet (<a rel=\"nofollow\" href=\"http://www.outblush.com/women/images/2009/10/Essential.Closet.jpg\" target=\"_blank\">http://www.outblush.com/women/images/200...</a>) you are overcome with a wave of feminine clothing. You close it, and lie down on the bed for a small nap, the procedure took a lot out of you. When you awake, it is</span></div></div>",
            "created":1361422800,
            "id":1536715,
            "title":"Julia, Mom"
        },
        "13":{
            "author_id":"norman33",
            "author_name":"Norman33",
            "choices":[
                "You head over to the switch right now",
                "The switch will be tommorow",
                "other",
                "other",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>You sit there pondering this proposal. The whole idea seems insane to you. \"Why does it have to be one of the girls\", you ask? Your Mom shrugs and says, \"It's what the scientist wants. He wants to observe how someone reacts in a completely different body. He figures if you can cope with being a different gender then anything is possible.\" \"This is crazy! Even if I agreed none of the girls would agree to it\", you state. Unknown to you Chasity, who was listening in walks in and says in her sexy British accent, \"I'll do it. I think it would be cool to be a boy.\" Your Mom then looks back at you. You start feeling the pressure. This is your family's way out of debt and to a better life. You hear yourself saying yes while on the inside you're not so sure. Your Mom smiles and says, \"Great, I'll call him now.\"</span></div></div>",
            "created":1447390800,
            "id":2060708,
            "title":"I pick Chasity"
        },
        "132":{
            "author_id":"jackspack",
            "author_name":"The Chicken Nugget",
            "choices":[
                "The switch worked perfectly",
                "There were complications and you're stuck as Chasity forever",
                "Something Else."
            ],
            "content":"<div class=\"\"><div> <span>Your mother got off the phone to inform you that tomorrow will be the day of the switch. You gulp, extremely nervous as of hearing confirmation of this crazy idea.<br>\r\nYou try to get some sleep that night, but can't get the notion out of your head that this will be the last night as yourself for a month.<br>\r\n<br>\r\nCome morning you're up early, barely having slept a wink, and almost immediately head to the swapping center. Your parents signed some forms and listened to the spiel given by the scientists.<br>\r\n<br>\r\nAfter some time you were escorted to a room with two beds and wires connecting them. You and Chasity were told to put a strange device on your head and wait for further instruction. After several minutes of explaining the machine to you, the scientists give you both the go ahead to push the buttons by each of your beds' in unison. You quickly push down the button and instantaneously your world is spinning. You can't tell real from fake. You see flashes of light and colour surrounding you until it all goes black.</span></div></div>",
            "created":1453093200,
            "id":2091094,
            "title":"The switch will be tommorow"
        },
        "1321":{
            "author_id":"dicle.simone",
            "author_name":"SdcITN",
            "choices":[
                "You turn around and you see your body moving.",
                "You get up and you run away from the laboratory."
            ],
            "content":"<div class=\"\"><div> <span>After that flash you feel confused. And strange. You got also headache. You open your eyes very slowly and you touch your head. However you block yourself because you notice something different... Now you have a smaller hand with nail polish. You have also longer and blonde hair. You feel your chest heavier and your pelvis free. You finally realize that the swap of your and Chasity's bodies have worked perfectly. You're Chasity now. YOU'RE A GIRL!</span></div></div>",
            "created":1494219600,
            "id":2316485,
            "title":"The switch worked perfectly"
        },
        "13211":{
            "choices":[
                "... Chasity comes in",
                "... you check out your whole new body and return to Chasity"
            ],
            "content":"<div class=\"\"><div> <span>You see yourself Standing up from a bed, Holding his head. This must be Chasity! You ask her, how she feels, and are surprised by your new high voice. Chasity now in your male Body Looks at you and answered<br>\r\n\"I am fine. I guess. Feeling a bit strange.\"<br>\r\nShe looked down her Body, touching her flat chest and looking between her legs, Then she Looks up and turns to you.<br>\r\n\"And how are you? My ... cutie\",she adds.<br>\r\n\"It Looks like you want to get used of our new roles right?\", you Reply with a smile.<br>\r\n<br>\r\nYou look down to your new Body, and grip your boobs at firt,shaking them, than curious about you genitils, you spread your legs and look between them. Than you slip your Hands down over your underwear, Feeling ot flat and tight to your Body.<br>\r\n<br>\r\n\"this is how it must feel, if there is no cock in the way. I am missing something down there.\" you say with a laugh.<br>\r\n<br>\r\n\"Oh, if you want to have a dick, maybe I can help you\", Chasity responde, looking like she tries flirting with you.<br>\r\n<br>\r\n\"Well... I will take a closer look, to my new Body and go to the bathroom. You can do malestuff like jerking or whatever\"<br>\r\n<br>\r\nThen you stand up, you recognize your feet are now smaller, your hips wider,giving you the Feeling of a new focus of Balance. You feel a Little weight on your breasts then you take your steps. Not trying to be too much distracted by the Feeling of your new Body you go to the bathroom. You feel how Chasity stares on your round and big butt.<br>\r\n<br>\r\n\"Oh man. A Girls ass really plops out, with that size. No wonder Boys stare on it\", Chasity says to you, while you open the door. You wanted to act \"cool\" and responde with stretching out your hips, to give Chasity a Little Sensation, but you somehow felt ashamed and blushes don't even able to sai something. In this strange and embarassing moment you finally disappear in the bathroom.<br>\r\n<br>\r\nYou take off your dresses and look in your new Image as a cute and sexy Girl. You see your breasts and your curvey hips, your small shoulders and hairless legs. Then your decide to distress your underwear. Afterwhat...<br>\r\n</span></div></div>",
            "created":1494910800,
            "id":2320734,
            "title":"You turn around and you see your body moving."
        },
        "132111":{
            "author_id":"dicle.simone",
            "author_name":"SdcITN",
            "choices":[
                "that she made a mistake: she used to use lady's bathroom.",
                "that she was curious about what you're doing with her old body."
            ],
            "content":"<div class=\"\"><div> <span>You get undressed in order to admire your new body. However someone enters in the bathroom and interrupts your \"show\". You notice that's Chasity in your old body.<br>\r\n\"What the fuck are you doing in here?\" you say a little embarrassed.<br>\r\nChasity answers...</span></div></div>",
            "created":1495083600,
            "id":2321545,
            "title":"Chasity comes in"
        },
        "1321112":{
            "choices":[
                "You left the bathroom",
                "You stayed and explored your new body more"
            ],
            "content":"<div class=\"\"><div> <span>\" I can't believe that you are naked with my body already you perv! \" , Chasity shouted from inside your body. <br>\r\n\" What did you think I would do, I'm still a guy in here and besides it's my body until the end of the month \" , You said pointing to your head. You didn't feel the least embarrassed standing there naked , after all you were less conscious about your new body then your old body. \" I knew this was a bad idea ... at least act like a female while in my body. \" , Chastity said angrily. \" I have no intention of acting differently in your body and I don't expect you to act differently while in my body . \" , You said and continuing to feel your new body up. Chastity burst out into tears and stormed out the bathroom. You weren't really bothered and began to squeeze your firm ass.  </span></div></div>",
            "created":1512420600,
            "id":2423916,
            "title":"You decide not to act differently"
        },
        "13211121":{
            "author_id":"maxamps",
            "author_name":"Maxamps",
            "choices":[
                "Look for Chastity ",
                "Change your clothes"
            ],
            "content":"<div class=\"\"><div> <span>\"Maybe seeing her body in such an erotic way surprised her, plus the doctors did say the change in hormones will make us emotional. \" , you thought and then got back into your body exploration. <br>\r\n<br>\r\nIt took 30 minutes for you to leave the bathroom,  \" That was a fun session,  I can't wait to see what else this body can do. \" you thought licking your lips. Now you had to find chastity and then head home after all the tests. <br>\r\n</span></div></div>",
            "created":1584509220,
            "id":2803113,
            "title":"You left the bathroom"
        },
        "1322":{
            "author_id":"jackspack",
            "author_name":"The Chicken Nugget",
            "choices":[
                "Wake up alone",
                "Wake up with your family"
            ],
            "content":"<div class=\"\"><div> <span>You open your eyes slowly and see only a distorted reality. You believe yourself to still be in the science facility but you don't think it's the same room. Medical equipment and distant beeps from a heart rate monitor surround you. Still not sure where you are you see a blurry figure state.\"He's waking up\".<br>\r\n<br>\r\nYou try to respond but your voice sounds different, you hear an accent. You suddenly remember that you're likely no longer you, you're Chasity. You start to get a grip of this new foreign body and manage to creep out the words \"am I ok?\". Prior to letting out a high pitched yelp from the pain.<br>\r\n<br>\r\nThe dark figure gives you something for the pain and you soon black out.<br>\r\n<br>\r\nSome time later you awake again feeling much better than before. Your vision is no longer cloudy and upon looking around the room you see the loving faces of your family members surrounding you.<br>\r\n<br>\r\nYour mother is crying and your father avoids eye contact, and before they can explain a doctor comes in to do it for them.<br>\r\n<br>\r\n\"Son, I know you're probably frightened and shocked right now, but I'm afraid I have some bad news. I'm afraid that the body switch project had some...complications\"<br>\r\n<br>\r\nYou had so many questions: Why were you being medicated? Where was Chasity? How long were you out cold?<br>\r\n<br>\r\nHe continues, \"It just so happens that the technology we were working with was very unstable and has since been scrapped, during the procedure it seems that the brain cannot be transferred both ways. There is always a weaker brain that takes an extreme hit from the experiment.\"<br>\r\n\"So you mean...\"<br>\r\n\"Chasity's brain was not able to withstand the voltage of the procedure and broke down, meaning she passed away in your body. You were close to death also but we were able to stabilize you at the last moment. You were comatosed for 3 months and we were doubting you would recover but you've pulled through extremely well, I'm impressed.\"<br>\r\n\"This is all happening so fast\" you gasp shocked, \"so what will happen to me.<br>\r\n\"Well partially due to the discontinuing of funding of the body swap project, and the extreme mental trauma preventing you from surviving a second swap, it seems that you will be stuck as Chasity for the rest of your life\". <br>\r\n<br>\r\nYou pass out again</span></div></div>",
            "created":1453093200,
            "id":2091101,
            "title":"There were complications and you're stuck a..."
        },
        "13221":{
            "author_id":"jackspack",
            "author_name":"The Chicken Nugget",
            "choices":[
                "Doctor comes in",
                "Family Member Comes in"
            ],
            "content":"<div class=\"\"><div> <span>You wake up a last time and see the room is dark. All of the medical equipment they had you connected to you is gone. You attempt to get out of bed slowly feeling strange moving for the first time as Chasity. Gazing into the mirror you see the face of a beautiful yet distraught Chasity in front of you. You moved your facial features, and saw the mirror do the same. Gazing down you see 2 protruding bumps from the hospital gown and gently grasp them. It was so strange and daunting to think about life like this but you had to pull yourself together. Heck Chasity was dead, and you weren't about to let her die for nothing.</span></div></div>",
            "created":1453093200,
            "id":2091105,
            "title":"Wake up alone"
        },
        "14":{
            "author_id":"kaiensekai",
            "author_name":"Kaien",
            "choices":[
                "The Procedure",
                "Something went wrong",
                "At the Lab",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>You really didn't want to switch anyone but your parents are right you could use the money...you thought about it and that if you really had to go through with this then you would want the most perks you could out of this. So you thought the best choice was your mom because: You would have power over your siblings, whatever mom had would be yours and to even though you wouldn't want to admit but your mom was hot so it would be cool to check out her body.  She actually had pretty nice skin, a youthful face, and a young looking body.  Your Mom could easily pass for 24 instead of 34! <br>\r\n<br>\r\n\"Alright I've decided!\" You said.<br>\r\n<br>\r\nEveryone sat waiting to hear your answer.<br>\r\n<br>\r\n\"I've decided I want to switch with mom.\" You said.<br>\r\n</span></div></div>",
            "created":1365051600,
            "id":1564511,
            "title":"I pick mom"
        },
        "141":{
            "author_id":"kaiensekai",
            "author_name":"Kaien",
            "choices":[
                "Check out your new body",
                "See the Family",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Well if that's what you want, I'm okay with that too.\" Mom accepted.<br>\r\n<br>\r\nThe next day you arrive at the lab. The doctor led you to the procedure room. It was anything but what you expected. Inside the room with few windows, there were two tubes, with a bed that extended out of each one. As you nervously lay down on your end, the doctor strapped you in tightly. He attached electrodes to your face and limbs, and said he was ready to start. Everyone left the room and watched on from the windows. The doctor remained to start the procedure. He started up the machine, it started collecting energy.<br>\r\n<br>\r\nThe doctor called out \"When you're ready, press the button above your head.\" Scanning, you find the button. You raise your hand, and pause. You take one last good look at yourself from this point of view. You press the button, Your whole body begins to shake and your world goes black.<br>\r\n<br>\r\n**************************************************************************** ************************************************<br>\r\n<br>\r\nYou begin to wake up you don't know how much time went by but your whole body feels completely foreign to you then before you passed out. Looking around, you're in a room with two beds. The other one is already empty. Looking around, you see no other people. Then it hits you - you were mom! Nervously, you slowly looked down. You gasped, everything was so new to you.The view was foreign. Looking straight down, you now saw inside the neckline of red dress; you could see two perfectly formed breasts nestled inside  Looking further down were a pair of long skinny  legs, dainty arms lying beside them. You then felt your legs they were so soft and hairless. Small feet and hands with a wedding ring on it. <br>\r\n<br>\r\nTrying to walk around, it felt totally normal. You remember the doctor saying that motor skills stay with the body. \"Look, he's awake!\" You hear someone call. Your family runs up to you. It was weird seeing your own body talking to you, but you would have to get used to that. All things aside, you notice you need to go to the washroom. You walk towards the washroom, and open the door a crack, noticing your breasts bouncing underneath you. Sighing, you switch over to the girls bathroom, sitting down on the cold seat. You slide down your silk panties it felt wrong and so right at the same time. You use the washroom, careful to wipe after you are done. While you're at it, you take a quick peak at your new boobs and look at the mirror inside the stall. Looking from a few angles, you're quite perky, almost teenager like. You dress yourself, and head home with your family. <br>\r\n<br>\r\nYou get home and head upstairs to the bedroom your new bedroom. Looking in the closet  you are overcome with a wave of feminine clothing. You close it, and lie down on the bed for a small nap, the procedure took a lot out of you. When you awake, you</span></div></div>",
            "created":1365051600,
            "id":1564522,
            "title":"Jake the Mom and Juila the Son"
        },
        "1411":{
            "author_id":"epicness",
            "author_name":"Retarded reader",
            "choices":[
                "Dinner time",
                "You begin your period!"
            ],
            "content":"<div class=\"\"><div> <span>You quickly head into the bathroom, and slowly start to take your clothes off, thinking that since you would be this way for a while, why not get aquainted? When you are down to your bra and panties you take a good long look at yourself.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://cdn.shopify.com/s/files/1/0058/1042/products/338_main_106_large.jpg?v=1291120824\" target=\"_blank\">http://cdn.shopify.com/s/files/1/0058/10...</a><br>\r\n<br>\r\n'I wouldn't mind staying like this for longer than a month...' You thought to yourself as you began to put your clothes back on.<br>\r\n</span></div></div>",
            "created":1446354000,
            "id":2055800,
            "title":"Check out your new body"
        },
        "14111":{
            "choices":[
                "...your son came in, wanting to talk to you",
                "...your husband starts talking to you"
            ],
            "content":"<div class=\"\"><div> <span>Back at home, it is now your Task to make dinner. You never realized the comfort, you mom made the dinner before, while you simply used your free time. Now <i>Jake</i> is in his room with Chasity, and <i>your daughters</i> in their, while your <i>husband</i> watches TV. You also would rather watch TV or hang up with <i>your crush</i>, instead of making dinner. You thought it would be funny, to have authority over your siblings, but forgot the Tasks as a mother. You can´t even date Chastiy. You looked down and smile, remembering you can´t <i>play</i> withher anyway, at the moment.You hope your mom is going to do a good Job as being a boyfriend, you don´t want to lose your relationship with Chasity after this is over. You think about her, knowing you will not spend time with her this evening. But you can still make her happy, with a tasty dinner. So you give your est for a great meal.<br>\r\n<br>\r\nDuring the meal, you enjoyed being the mother. You admonished your sister about manners, asked if everyone did their homeworks and was happy, everyone liked your dinner.<br>\r\n<br>\r\nAfter the dinner, you cleaned up the dishes, thinking it could be annoying doing this every day. So you thought about, giving a Little punishment for your sisters bad manners next time, so they have to help you. Then you finished, you wanted to sit down on the Couch, watching some TV and thinking about being your mom for the next weeks. <br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1488085200,
            "id":2282730,
            "title":"Dinner time"
        },
        "141111":{
            "choices":[
                "...Chasity",
                "...how do you feel"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He wants to talk you about...</span></div></span></div>",
            "created":1488085200,
            "id":2282731,
            "title":"...your son came in, wanting to talk to you"
        },
        "1411112":{
            "author_id":"epicness",
            "author_name":"Retarded reader",
            "choices":[
                "She teaches you about bras, and dressing like a woman.",
                "She talks to you about female anatomy."
            ],
            "content":"<div class=\"\"><div> <span>\"So sweetie...\" Your old body begins, \"How do you feel?\" You inwardly winced with how motherly your old body sounds. You open your mouth to answer that you feel fine, but deep down, you felt awkward, the bouncing of your new assets, the emptiness in your crotch, just everything felt wrong.<br>\r\n<br>\r\nYour mother feels your hesitancy, and how awkward this is for the both of you. She supported it because she felt it could bring the two of you closer together as a mother and son, and truly understand each other better, but after going through with it, it just feels awkward.<br>\r\n<br>\r\nGently taking you by the hand, she leads you into your new room.<br>\r\n<br>\r\n\"Since this is... Pretty awkward, I think we should help each other learn about our new lives, and sexes.\" She suggests, you comply, because this just feels awkward.</span></div></div>",
            "created":1498194000,
            "id":2340844,
            "title":"...how do you feel"
        },
        "14111121":{
            "choices":[
                "you dress the jeans",
                "you dress the white pants"
            ],
            "content":"<div class=\"\"><div> <span>She opens the closet and takes out some stuff. She throws several clothes on the bed, pants, shirts, a dress and some other stuff.<br>\r\n\"Well, I suppose this will fullfill the purpose.\", she hints to the clothes. \"Try to take them on\". You grab some pants and a Shirt and get dressed. You took a tight Jeans, bearely fitting in. You need to hop around so your butt eventually slips in. The Shirt was much easier to dress.<br>\r\n<br>\r\n\"Well, you made it to take it on. That's good\". You respond with a sacastic smile. \"It can be pretty rough to dress on THAT Jeans.\", she responses. <br>\r\n\"This is your casual look. However, if you don't want men to watch your butt, you should wear alonger shirt. Just keep that in mind. Further you can dress any of these\", gesturing to several casual clothes, like jeans, leggings and shirts,\" than ever nothing special happens. To dress formerly, you sould wear this stuff\", poiting on a dress, \"Give it a try\". <br>\r\n<br>\r\nYou sigh, thinking about to undress the tigh jeans again. Fortunately for you, it is much easier to slip into a dress. However, it felt naked. \"Sure you don't see my underwear? It feels like my legs aren't covered properly\", you respond. Your body smiled. \"Sit down\". You do as your body advises you. \"Well, now I can see your underwear\" You imetely push your knees togehter. \"That's right. You must be aware, if you wear a dress or a skirt, always to hold your legs together, otherwise men or even young Boys like me\", your mother in your body takes a break to take breath, \"will enjoy a good look, not preserved for us. But I will see you wearing my panties anyway. Get out of the dress, I will show you how to take on a bra.\"<br>\r\n<br>\r\nYou hesitate, but it is your mother, you don't need to feel ashamed, so you undress yourself. Your body starts to undress you bra, your boobs fall out. You take them on press it against your breast, after all, your mother has a male teenage body, your boobs shouldn't hang that way. Your body Shows you to dress the bra. Afterthat, she wants you to repeat it. After a few attempts you manage to Dress the bra on yourself.<br>\r\n<br>\r\n\"Very good, I guess you can dress yourself now. Call me, then your period starts. I think I don't Need to teach you how to Dress for \"a Special evening\"?\"<br>\r\n\"No, mom, I guess I can handle that myself, just in case \"a Special evening\" SHOULD occur.\"<br>\r\n<br>\r\n\"Alright, then I will leave you now\"<br>\r\n\"Wait a second! Any suggestions I should wear?\"<br>\r\n\"Hmmm. I don't know. Some of the casual stuff I guess? You could wear the jeans again\"<br>\r\n\"I would appreaciate something wider. It feels like my body has swollen. And... and... I feel \"fat\", you know?\"<br>\r\n\"Then take the white pants close to the jeans.\"<br>\r\n<br>\r\n\"Well... fine. Thanks mum, or son\"<br>\r\n</span></div></div>",
            "created":1535761260,
            "id":2541285,
            "title":"She teaches you about bras, and dressing like a..."
        },
        "141112":{
            "choices":[
                "... his son and he cares about how you handle the situation",
                "...his wife and wants to act, like no swap happened"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He talks to you like you are...</span></div></span></div>",
            "created":1488085200,
            "id":2282732,
            "title":"...your husband starts talking to you"
        },
        "1411122":{
            "choices":[
                "Act like were always beeing Julia...",
                "remember him, to be his son..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Hey, Julia. The Kids are gone to bed now. Finally we have time for ourselves.\"<br>\r\n<br>\r\nYou...</span></div></span></div>",
            "created":1494133200,
            "id":2316277,
            "title":"...his wife and wants to act, like no swap happ..."
        },
        "14111221":{
            "choices":[
                "...should watch a romantic movie together",
                "...should go to bed"
            ],
            "content":"<div class=\"\"><div> <span>You try to continue your role as a wife. It was easier to do your Jobs at home, but playing a passionate women? You give it a try, and lool on your \"husband\" hug his shoulders, looking deep in his eyes nad give him a passionate kiss.<br>\r\n<br>\r\nAfer a Minute you release, you \"husband\" stares at you in shock and you try to leave his lips with a seducing look. Now turning to the TV again...<br>\r\nMaybe you...</span></div></div>",
            "created":1494910800,
            "id":2320743,
            "title":"Act like were always beeing Julia..."
        },
        "141112211":{
            "choices":[
                "more intamacy",
                "ebough fpr today"
            ],
            "content":"<div class=\"\"><div> <span>You decided to watch a romantic movie... your husband choices one, Julia always loved, maybe you will like it as well, at leaast you are a women now. But actually the movie is boring to you, but you want to Play your role as a wife and as a wife, you can not be bored by a romantic film with your husband, so you decided to pay more Attention to your relationship. You cuddle to your husaband. He takes you Close to his flat breast. After a while he whispers<br>\r\n\"You take your role really very professional, huh?\"<br>\r\nHe lays his Hand on your breast, and squish them<br>\r\nYou give a quiet noice from you. <br>\r\n\"I am trying my best\"<br>\r\n\"So we may go further?\"<br>\r\n\"If you want...\", you say with a smile.<br>\r\nHe starts kneating your boobs during the movie. Then he sits behind you, Dresses off your top and massage your back. After a while he asks you for a drink. <br>\r\n\"Of Course Darling, wait a Moment, I will bring you something\"<br>\r\nThen you stand up, he give you a slap on your butt, making it shaking. It did not hurt but you can feel your buts flesh shaking, while you go to the kitchen. Then you were back, you give your husband your drink and sit again on the Couch. After a while, your husband lays his Hand between your legs. You look down to your waist, seeing his Hand, still. Then he starts moving over your flat crotch.<br>\r\n<br>\r\nNow you have to decide, if this will go more intimate or will it e enough for today...</span></div></div>",
            "created":1494910800,
            "id":2320752,
            "title":"...should watch a romantic movie together"
        },
        "1411122111":{
            "choices":[
                "you agree",
                "you hesitate"
            ],
            "content":"<div class=\"\"><div> <span>\"you will have to go through this anyway and it could be fun\", you think.<br>\r\nYou husband takes your hesitation as Agreement and already slips under your pants. you squick as he touches you down there.<br>\r\nyou lay your head to his shoulders, whispering<br>\r\n\"take it off!\"<br>\r\nand so he starts taking you clothes off, leaving you here just with your underwear. he stands up to lock the door, you stand up, too, wondering that to do now.<br>\r\n<br>\r\nHe Comes back to you, pressing his finger to you mouth.<br>\r\n<br>\r\n\"pssh, say nothing. just enjoy\", he whispers, then pressing on you and laying you slowly down on the couch.<br>\r\n<br>\r\n\"I..I don't know, that I should do\", you stumbled, then you feel him taking your underwear off. You see a bulb in his pants, asking you to touch it.<br>\r\nYou hesitate, but... you, now his wife, has to touch it if he asks right? You touch it pulls his pants off and grip it. You take it in your softy female hands. And you blushes then you realize you like it. You somehow feel excitment Holding a rocky hard dick in your soft hands.<br>\r\n<br>\r\nBut you release his dick. Your husband then, lays you back and lays over you. You almost automatically spread your legs trying to embrace him. But he aparts them form another, revealing your wet pussy. Last time you were in the bathroom  you already wondered how deep such a pussy might be and soon you may find it out, looking to the dick in front of you, you are sure he will almost fill you.<br>\r\n<br>\r\n\"are your ready?\"</span></div></div>",
            "created":1498107600,
            "id":2340772,
            "title":"more intamacy"
        },
        "14111221111":{
            "choices":[
                "A",
                "B"
            ],
            "content":"<div class=\"\"><div> <span>Your dad/husband starts of slowly and gets you into it as the minutes drag on you feel your body start to react to whats inside you and let out a moan and then another one and then another.<br>\r\n<br>\r\nYou close your eyes and start to enjoy it a lot and realise that your how tense your mother's body is and it slowly relaxed under your dad's touch, then you feel it and your grab hold of him as you orgasm and then feel him do the same inside you and it felt so good.<br>\r\n<br>\r\nAfter your both recovered and cleaned up, you turned to your dad and asked him, when was the last time you had sex? he smiled and said about 3 months darling, you smile and say well i think we should do it more then every three months now, your dad smiled and kissed you.<br>\r\n<br>\r\nYou both went to sleep that night happy and you soon got into a routine and the sex in the evenings was amazing.<br>\r\n<br>\r\nSix months later you discover....<br>\r\n<br>\r\nA) Your pregnant<br>\r\n<br>\r\nB) That your mum who is in your body now is gay, crossdressing and and is still taking her morning contraceptive pill out of habit and it's starting to feminise her body slightly </span></div></div>",
            "created":1498194000,
            "id":2340997,
            "title":"you agree"
        },
        "141112211112":{
            "choices":[
                "Try to make your \"son\" a stright male boy again.",
                "Take revenge and let your dad make your mothers body pregnant"
            ],
            "content":"<div class=\"\"><div> <span>Since you saw, your mother Dressing your body too girlish and somehow it seems to become more and more feminine, you called her to you for a talk.<br>\r\n\"That happened mum?\", your mother asked.<br>\r\n\"That are you doing here? As a Boy you should behave like a Boy. I first thought, you have to get use to be male, but with every week you gain more and more female. In some weeks, we alreydy might Change back\"<br>\r\n\"Yes, sorry, about that. It is just, I do not like it, to be male. At first, I did not understand, why I always have to wear such boring colours. I mean, I still look nice in pink. And the Girls there all nasty. Even Chasitiy, refused a relationship.\"<br>\r\n\"then you behave like a Girl you can not get a Girl. You should talk to me much earlier\"<br>\r\n\"Yes I know. Sorry. But there is another Problem. Since it did not worked with the Girls, I thougt I continiue with Boys\"<br>\r\n\"You did what?!\"<br>\r\n\"Yeah, I already used to have a boyfriend.\"<br>\r\n\"But.... but that mean, you mad me... you made my body gay?\"<br>\r\n\"Yeah. It isn't what bad at all. \"Your\" friends at first, were surprised. And they wondered about my strange behavior, but I managed to say, I were always secretly gay, but never trust to admit that.\"<br>\r\n\"Woooow! Fine, that did Laura and Nick said to that?\"<br>\r\n\"Hmmm... Nick was queit shocked. We, or you, are still friends, but it seems he distants himself. But forethat, I am now better with Laura.\"<br>\r\n\"So... did you... did have already made my butt...\"<br>\r\n\"Oh yes, I had already sex. It isn't that bad at all. With a ounger body in teenage Age it is quiet funny.\"<br>\r\n\"So, then I turn back, I am the one who is...\"<br>\r\n\"Oh, common, I know you already liked to be the one, who got the hard Thing in\"<br>\r\n\"So you know about dad?\"<br>\r\n\"You are moaning so loud sometimes, everyone knows that. Jenny already wondered, if you want to stay as a women forever. And said mean things like, I must be a real bad wife for dad.\"<br>\r\n\"No you weren't. But...  then I am a Boy again, I would like to be again the one, with the dick, you know.\"<br>\r\n\"Oh about your dick... it seems to vanish, since I still used the oill. At first out of Habit, but since I missed to be female, I did not want to stop. It remembered me to be a women. And know it is already changing my body.\"<br>\r\n\"Whaaat?\"<br>\r\n\"yes. This boobs are not pushups.\"<br>\r\n\"Oh....no...! That it really that hard to be male for those months? But I guess it is already to late then\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1500440400,
            "id":2356385,
            "title":"B"
        },
        "1411122111121":{
            "choices":[
                "Not well. after swaping back you have to deal living as a girl.",
                "You change all clothes from your \"son\" and throw away all pills."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How well does it work?</span></div></span></div>",
            "created":1500522360,
            "id":2356386,
            "title":"Try to make your \"son\" a stright male b..."
        },
        "14111221111211":{
            "author_id":"secretspider",
            "author_name":"Susie",
            "choices":[
                "Yes ",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You swap back and you look like a beautiful 5,2 school girl and now have a big F cup and a big butt and finally a working vagina. Is this body sexually attracted to men?</span></div></span></div>",
            "created":1566725460,
            "id":2707502,
            "title":"Not well. after swaping back you have to deal l..."
        },
        "14111222":{
            "choices":[
                "....keep on watching TV",
                "...you allow him to start slowly and allow him to huge you and give him a kiss"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey! I am not really Julia! Please do not Forget that\"<br>\r\n\"Sure, but you are in Julias Body, so you are in my wifes Body\"<br>\r\n\"Yes, but I can not live your lovelife!\"<br>\r\n\"Sure you can. You even have to! I do not want to do without my wife for a month. Ok I see you are not ready for this to night. I can understand that but you have to get used to it the next days. You decided to live as your mom.\"<br>\r\n</span></div></div>",
            "created":1494910800,
            "id":2320741,
            "title":"remember him, to be his son..."
        },
        "141112222":{
            "author_id":"secretspider",
            "author_name":"Susie",
            "choices":[
                "Yes ",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>As he kisses you your leg spreading apart and your vagina gets really wet and all you can think of was have sex with him. And he starts messaging your breasts, butt and vagina. This more you want him more and your body was crying for him . And you can’t take it and you beg him to have sex with you. And he say “are you sure you  might  you might want to be a girl forever after sex and  you could get pregnant  and then  turn into a mom mentally. But  only you cared about was him inside you. You tell him “I don’t care I need you” does he agree?</span></div></div>",
            "created":1560694680,
            "id":2674221,
            "title":"...you allow him to start slowly and allow him ..."
        },
        "142":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "at the psychologist office",
                "meet with your father",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You were waiting at the lab nervous and existed about the switch. Soon you will become your mom for a few weeks. <br>\r\n\"Ready to go?\" the doctor asks you. \"Yeah\" you say and follow him to a room with a strange bed. You lay down on it and wait as the doctor put some strange device on your head. \"Now you will fall asleep. Just relax and breath\" the doctor says. after a few seconds everything becomes black.<br>\r\n<br>\r\nYou wake up later and see your dad and the doctor. They looked very worried, you knew something was wrong. \"Jake, there was a small accident with the switch and it seems we can't turn you back\". <br>\r\n\"What!? What do you mean!?\" you yell panicked.<br>\r\n\"We're very sorry but you will stay like this forever\" the doctor says.<br>\r\n\"No!  This can't be true\" you say and pass out from the stress.<br>\r\n<br>\r\nAfter some time you wake up. \"What a terrible dream... Wait... this wasn't a dream... oh no!\" You sat up and felt an odd bounce on your chest. \"No, this can't be\" you say and grab them. Your hands were feminine now, your hair long, everything was different, You recklessly grab your crotch and started to cry as you felt you had a vagina.<br>\r\nThis whole situation was to hard for you. You lost your life, now you were a 34 years old woman, your mother. Everything changed your dad is now your husband and your siblings are your children.<br>\r\nAs you sit there crying a nurse comes and comforts you. Minutes later she says you need to dress up and meet their psychologist who will help you with your new life. You stand up and take your clothes from the chair next to your bed. You put on your mom's white panties and struggle with the bra. Finally after some time you manage to hook the clasp of your bra and push your breasts right into place so that they fit comfortably in the cups.<br>\r\nYou notice a mirror in the room, you sigh and walk slowly towards it to take a look at yourself. You’re quite shocked by your look, it’s not like you saw your mother for the first time, but now the woman standing  in the mirror was you. <br>\r\n<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://g-ecx.images-amazon.com/images/G/01/Shopbop/p/pcs/products/stela/stela2009331517/stela2009331517_q3_1-0_336x596.jpg\" target=\"_blank\">http://g-ecx.images-amazon.com/images/G/01/Shopbop/p/pcs/products/stela/stela200...</a><br>\r\n<br>\r\n“What am I doing? I don’t have time for this” you say and continue dressing up. You put on your brown tights and look at the rest of your clothes. The next thing was a silk top, white with short sleeve and red flower prints, after that you put a short, black, denim skirt.<br>\r\n“Almost ready” you say zipping the slider at the back of your skirt. You look down at yourself not happy that from today you will dress up like that. You sigh and slip your feet in the black pumps your mom was wearing. after walking around to adjust to them, you take your purse and slowly leave the room to meet with the psychologist.<br>\r\n</span></div></div>",
            "created":1366261200,
            "id":1574115,
            "title":"Something went wrong"
        },
        "1421":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "sleep with your husband",
                "sleep in your old room"
            ],
            "content":"<div class=\"\"><div> <span>You enter the psychologist office and see a woman in her mid 30’s sitting behind a desk.<br>\r\n“Hello Julia, my name is Ellen, please take a sit “ she say’s smiling. You do as she say’s and slowly sit on a leather couch, by the way you notice that even sitting feels different, now that your butt is larger and rounder.<br>\r\n<br>\r\nFor the next hour you listen to Ellen’s instructions about every change in your life. She tells you about the differences in your body and how she can help you with any concerns you will have. You don’t speak to much, you only nod your head with a mournful face.<br>\r\n<br>\r\n“We’re done for today, your husband and son are waiting for you” Ellen say’s<br>\r\n“You mean my dad and mom” you try to correct her but she quickly interrupts you. “You weren’t listening carefully, I told you that now you are Julia, a wife and mother, and you will be treated like that by your family”.<br>\r\nYou stay speechless for a moment. “Guess you’re right” you sigh and leave the room.<br>\r\n<br>\r\nYou walk through the hallway to the exit. Your head is full of thoughts but you can’t concentrate, you’re distracted by every part of your body,  everything felt weird, the sound your pumps with every step, the tights and skirt you were wearing, the stripes of  your bra, the top, that still smelled with perfume, your bouncing breasts and your long hair. Everything felt like a dream but the most surreal part was meeting your former body. <br>\r\n<br>\r\n“Hello mom, how are you feeling” your son asks. It was weird hearing your old self talking to you and calling you mom. “I’m fine, thanks for asking Jake”<br>\r\n“I’m glad you’re okay” your husband says and approach you giving you a quick kiss in the lips. He probably realized it was too soon for you as he saw your confused face.<br>\r\n“I’m sorry I just…” he tried to explain but you interrupted trying to end this topic “ it’s ok, just let’s go home”.<br>\r\n<br>\r\nThe three of you got in the car tired from today’s events, it was already evening, that means you spend almost all day in the clinic.<br>\r\nYou sit in the car still thinking about the kiss, you don’t want to, but he is now your husband, and sooner or later you will need to get intimate with him and live like husband and wife.<br>\r\n<br>\r\nWhen you arrive at home you go straight to your room avoiding questions from the girls. They still don’t know that you will stay swapped forever, and you didn’t feel to tell them now.<br>\r\nOnly a few steps from the door you were stopped by your husband.<br>\r\n“Honey I know it could be to soon, but I think it would be better to sleep in our room, just to adjust faster to your life”<br>\r\n</span></div></div>",
            "created":1366261200,
            "id":1574117,
            "title":"at the psychologist office"
        },
        "14211":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "next day",
                "week later"
            ],
            "content":"<div class=\"\"><div> <span>Without thinking to much you sight and nod in agreement. Your husband grabs you gently by the hand and guides you to your new bedroom where you change your clothes into a nightgown. Tired you lay down on your side of bed and doze off.<br>\r\n<br>\r\nNext morning you wake up and slowly sit at the edge of your bed. “To bad it wasn’t a dream” you whimper when you look down at yourself. Half asleep you went to the bathroom, you almost forgot you can’t pee standing anymore, embarrassed by that fact you sigh and sit down on the toilet, after everything is finished you leave the bathroom and go downstairs to eat some breakfast, your husband went to the clinic and your kids are still sleeping, so you’re alone there only with your thoughts. “I don’t know if I would get used to that” you say looking at the white nightgown on thin straps you wore.<br>\r\n<br>\r\nAfter your meal you decide to take a shower. On your way to the bathroom you notice your breasts are bouncing more without a bra, yet another strange feeling you need to get used to.<br>\r\nAt the bathroom you take off your clothes and get into the shower. You’re embarrassed by looking at your naked body, not to mention touching it, but somehow you managed to wash yourself despite the embarrassment. After drying yourself  you put on your panties and a bra, then a black, long sleeved t-shirt. Next you take a pair of skinny jeans and put them on, they’re tight but you don’t have a choice, as you finish dressing up you start your first day as a housewife.<br>\r\nThe day finally ends, you feel like it lasted forever, you were completely lost and you didn’t know what to do, only thanks to Jake you managed to survive it and your daughters took advantage of this situation to mock you, there were moments when you almost started to cry, at least Chasity was nice to you.<br>\r\n“At last, the day is over” you say loudly and fall into the bed. You’re happy that it finally ended, but that was only your first day, of your new life.<br>\r\n</span></div></div>",
            "created":1366520400,
            "id":1575783,
            "title":"sleep with your husband"
        },
        "142111":{
            "author_id":"shifter98",
            "author_name":"Greatshift98",
            "choices":[
                "Your husband is naked, getting dressed for the day",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You wake up the next morning and find that...</span></div></span></div>",
            "created":1417582800,
            "id":1897411,
            "title":"next day"
        },
        "1421111":{
            "choices":[
                "see, Jake and Chasity in the bed together",
                "see Chasitiy still sleeping"
            ],
            "content":"<div class=\"\"><div> <span>Seeing your husband naked the first time, surprised you. You startled and took the bedspread other your mouth. You haven´t seen a dick since were, a women. And now, it feels unfamiliar. You thought it is odd to look on it, but you can´t even say why, but it fascinates you. You stare on it, until your husband took on his trousers.<br>\r\n\"Good morning Darling\", he says.<br>\r\nYou still busy with yout new and strange Feelings, just looking him, moving your eyes up from the lower half to the face.<br>\r\n\"I have to leave now. Because you are still out of a Job, you should care about the children and clean up again. Have a nice day, darling\"<br>\r\n<br>\r\nYou wonder, that you could do the whole day. You thought about, what womens do. But you have no real idea how to spend time. So you decided to ask Chasitiy. You still like her, even more tha just a bit. But this doesn´t Count anymore. She is now the crush of your son. But you could be something like a mother for her. And maybe she can Show how to spend time as a women. <br>\r\n<br>\r\nSo you go up to her room, she has to stand up anyway, to go to School. So you thought, you enter the room on authority as a mom. You enter and...</span></div></div>",
            "created":1488085200,
            "id":2282736,
            "title":"Your husband is naked, getting dressed for the day"
        },
        "142112":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "first day at work",
                "later that day"
            ],
            "content":"<div class=\"\"><div> <span>The following days were the hardest days of your life, but you finally started to adjusting slowly, at least when it comes to housework you can organize your daily duties. <br>\r\nYou sit in the living room watching tv still dressed in your nightgown. The house is empty since your husband is at work and your kids went to school. You look at the clock and realize you need to get going, today is your meeting with Ellen. You walk to the bathroom and slid down your nightgown, standing before a mirror only in your panties. It’s been a week since you’ve become a woman and you begin to feel as though everything is normal. You stare at your reflection, examining every part of your body, turning around a few times, and watching your body from every angle. Then you take of your panties revealing what was covered by them, again you stare at your body thinking your actually beautiful, at least you don’t feel like a pervert anymore but more like a woman proud of her body.<br>\r\n<br>\r\nBefore going out you take a last look at yourself, you’re dressed in a white front buttoned blouse with short sleeves, a short, black a-line skirt, brown tights and a pair of black high heels. Your makeup was also nicely done since you’ve got some practice at it.<br>\r\n<br>\r\nYou get into your car and fasten the seatbelt, you start the engine and put your hands on the steering wheel, you take a deep breath and start to drive.<br>\r\nWhen you get to the clinic you leave the car satisfied “that was easier than I though” you say smiling.<br>\r\n<br>\r\nBefore you meet Ellen you were examined by the doctor to be sure everything is fine with your body, after that you finally meet her and speak all about your worries. After a long conversation she gives you a proposition.<br>\r\n“Say Julia, would you like to work here” she asks. “Me here? But why so sudden” you say surprised.<br>\r\n “Well it could help with your mental adjustment, you could concentrate on who you are now than who you were in the past”<br>\r\n“I don’t know, what would be my job?” you ask curious. “You would work at the reception, it’s not that hard”<br>\r\nYou think about the offer and finally agree.<br>\r\n“Great, then see you tomorrow” she says.<br>\r\n<br>\r\nLater that day you tell your husband that you’ll be going to work from tomorrow. He’s skeptical about it claiming it’s to soon and you should stay home, but you insist to go.He can not forbid you from doing it, you’re an adult now.<br>\r\n</span></div></div>",
            "created":1366520400,
            "id":1575784,
            "title":"week later"
        },
        "1421121":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "a new car",
                "weekend trip"
            ],
            "content":"<div class=\"\"><div> <span>Today you start a new chapter of your life as an adult woman, it scares you a little bit but your husband is there for you. Nervously you search for an outfit to work but you can’t decide what to wear.<br>\r\n“Still not dressed?” your husband asks, seeing you only in your lingerie and tights.<br>\r\n“I don’t know how should I dress for work” you say annoyed.<br>\r\n“ I don’t know anything about women’s clothing, but you should hurry up if you don’t want to be late” he says leaving the room<br>\r\n“Thanks for help” you mutter sarcastically.<br>\r\n<br>\r\n“How do I look” you ask approaching your husband. Your outfit was a white shirt, a black pencil skirt, brown tights, and a jacket.<br>\r\nYour husband stares at you for a moment and slowly walks up to you. “You look beautiful” he says and takes your hand “you don’t need to worry, you will be fine and I’m always here for you”<br>\r\nSomehow those words make you feel warm inside, you needed some courage.<br>\r\n“Thank you” you say and give your husband a kiss in the cheek. After that you slip your feet into your pumps and take your purse waving for a good bye. “ Take care of the house and make me something good for dinner” you say to your husband and leave.<br>\r\n<br>\r\nYour work was easier than you though, of course you were asking a lot of questions since it was the first time, good thing your co workers are very nice. <br>\r\nAfter going home you tell your husband about your day, he was staying at home today. You’re very surprised when Jenny and Cassandra apologized for being mean to you, they already know the swap is permanent. Your friends Laura and Nick are also allowed to know the truth, they will be very helpful to Jake.<br>\r\n<br>\r\nDay’s and week’s are passing on your daily activities. It’s been a month since you’ve become your mother and you’re adjusting more and more to your life. Being a woman is somehow becoming natural, having breasts and a vagina, even your first period was less disturbing than you though. You stand in the kitchen preparing dinner, you feel that everything is normal with your body, your outfit was a tight-fitting sleeveless mini dress which emphasized your figure, bottle green with black flower patterns. You didn’t feel weird anymore by wearing such clothes, you even like it.<br>\r\nWhile you were preparing dinner your husband walks up to you, he puts his hands on your hips and kiss you in the lips when you turned to face him. Not so long ago you started to open up towards your husband, allowing him to kiss you and touch you, it was the best you could do for now.<br>\r\n“ I have a small surprise for you” he says still embracing you. Courious about what he said you ask, \"what is it?\"<br>\r\n</span></div></div>",
            "created":1366606800,
            "id":1576465,
            "title":"first day at work"
        },
        "14211212":{
            "author_id":"awruk88",
            "author_name":"awruk",
            "choices":[
                "more time at the pool",
                "a walk with your husband"
            ],
            "content":"<div class=\"\"><div> <span>“We’re going on an trip for the weekend, just the two of us” he says hoping you’ll like that idea. A smile appears on your face, you warp your arms around his neck and kiss him in the lips “that’s wonderful, I can’t wait” you say happy about the upcoming trip. Two days later you pack your bags excited that you can get some vacations, as an adult you have more responsibilities and less free time than as a teen. You dress up in knee length, denim shorts and an ivory tank with sheer mesh on neck and waist, then you get downstairs where your husband was waiting. “Ready?” he asks. “Yes we can leave” you say as you put on your sandals. After putting your bags in the trunk you both sit in the car and look at each other smiling. “Let’s go already” you say and put on your sunglasses. Your husband starts the engine and drive off, leaving the kids at home, their old enough to take care of themselves.<br>\r\n<br>\r\nThe first day of your vacation was a disaster, just 1 hour after you arrived a storm started.<br>\r\n“There’s no end to this” you say disappointed. “Don’t worry, tomorrow will be better” your husband comforts you with a kiss. “Beside, they got a pool inside, we can spend the day there” he say’s. “Sound good to me. Wait a moment I’m going to change” you say and take a one piece swimsuit from your suitcase, you put it on and go with your husband to the pool where you spend most of the day. After that you spend some time in the bar with the other guests. After three hours you get tired and decide to go back to your room. You change into your new, navy blue, lace trim chemise and lay in bed alone, because your husband was still at the bar. Later when you were half asleep he gets back drunk which makes you mad. Irritated by him constantly stroking your waist you fall asleep hoping that tomorrow will be better.<br>\r\n<br>\r\n <br>\r\nYou wake up in a better mood than yesterday. Your husband was still hard asleep and you could smell alcohol from him. You shake your head still a little bit mad at him and get up from the bed. At least the weather was beautiful today, stretching you go out at the balcony still dressed in your chemise. “Its wonderful here” you say taking a deep breath.<br>\r\n<br>\r\nAfter breakfast you decide to go swimming. You go back in your room and change into your striped bikini, as you were leaving your husband woke up, you ignored him and went to the pool with other ladies you meet yesterday. <br>\r\n<br>\r\nYou sit at the pool drinking a cocktail under an umbrella, chatting with the other women. You were having a great time swimming and sunbathing, you’ve completely lost the track of time.<br>\r\nIt was already noon and your husband finally shows up and sits next to you.<br>\r\n</span></div></div>",
            "created":1366952400,
            "id":1578721,
            "title":"weekend trip"
        },
        "142112122":{
            "choices":[
                "Continue with the walk",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Your husband is largely quiet as he leads you back to the room, as he simply says that you two are going for a walk. You prepare accordingly putting on a pair of tight white pants and a orange button up shirt, you put your hair into a ponytail and pull out tennis shoes.<br>\r\n\"I'm ready, honey,\" you say smiling, he looks up shyly smiling back and leading you out of the room. You two take the trail that leads behind the hotel you are staying in. The ground is still wet and a nice spring breeze is blowing lightly to the west. As soon as you exit the hotel's back door there is a large cluster of trees the branches stretching in seemingly random directions. <br>\r\n\"I'm sorry,\" he starts sounding as if there is something on his mind more than that.<br>\r\n\"It's okay, but are you okay?,\" you say. You stop walking turning toward him and you see a lone tear rushing down his left cheek.<br>\r\n\"I thought I lost you Julie, just like we lost Jake. It's still sinking in and maybe it's stupid, but I blame myself for him not being here. I keep thinking I could have worked harder, picked up more shifts, got a second or third job to keep this from happening.\" You embrace him as his tears turn into full sobbing and you find yourself unable to contain your own sadness. You have not only lost a life, you've lost a Mother, a Son even. And never in a million years would you even imagine yourself as your Mother, taking care of your siblings, sleeping next to your Father. As the crying subsides, he starts to walk away and you grab his hand. He turns to you and before anything else can be said you kiss your Husband slowly and passionately. The textures of your lips seem to fit perfectly as your smaller body fits against his larger and stronger frame. You stop, and smile at him, looking into his blue gray eyes.  </span></div></div>",
            "created":1367211600,
            "id":1580787,
            "title":"A Walk to Remember "
        },
        "1421121221":{
            "author_id":"dovahsith",
            "author_name":"Dovahsith",
            "choices":[
                "Lets go back to the hotel",
                "There's no-one around....Lets make this memorable."
            ],
            "content":"<div class=\"\"><div> <span>You continue your walk, hand in hand. Both leaning into each other, your bond stronger than before. The Sun is slowly beginning to set, painting the sky a beautiful amber. You kiss passionately, setting yourselves against a tree stump, the ground having finally dried enough to sit upon it.<br>\r\nLooking deep into your eyes, your husband leans over your shoulder, settling his chin on your neck and whispers:</span></div></div>",
            "created":1457067600,
            "id":2113031,
            "title":"Continue with the walk"
        },
        "14211212212":{
            "choices":[
                "risk becoming pregnant...",
                "using another position for interaction..."
            ],
            "content":"<div class=\"\"><div> <span>Before you react, he already pulls your top off. Spending time with your husband was the most enjoyable experpience you made now since you are a women. Maybe you should keep on. And in fact this will be memorable, because you did not had sex before, especially not as a women. Your husbend opens you bra, letting your boobs hanging down. \"Are you ready for it?\", you think, while your husband starts aquishing your boobs rythmically. Since you start Feeling his hard Hands massaging your soft breasts, releasing a Sensation, you do not hesitate anymore, wanting more physical intimcy and start to moan. Realizing it, you want to be quiet, but your husband confrims, it is absolutly normal for a women to moan during sex. Therefore you start Relaxing again and enjoying how your breasts are squished, and then your nipple hardens. Distressed from your bodily reaction you did not realzied your husbands hand goes down to your legs taking your clothes off, leaving you naked and lays you on the ground. he touches your crotch and divided your lips apart with his Hands, now playing on your clitoris. It reminds you, how it felt, then you touched your penis, earlier, just without it's growing. instead of you feel a slit opening between your legs. Your husbands loans over you asking, \"are you ready for it? And remember, we are risking you become pregnant, we have no condoms around here.\"<br>\r\n<br>\r\nYou do not know much about beeing a horny women, but you know if it exist, then you are it now, Feeling yourself empty between your legs, wanting him inside you, you know you can not leave anymore. So  do you...</span></div></div>",
            "created":1495342800,
            "id":2323376,
            "title":"There's no-one around....Lets make this mem..."
        },
        "142112122122":{
            "choices":[
                "Arse",
                "Mouth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Arse or mouth?</span></div></span></div>",
            "created":1500522720,
            "id":2356387,
            "title":"using another position for interaction..."
        },
        "1421121222":{
            "author_id":"epicness",
            "author_name":"Retarded reader",
            "choices":[
                "Time cut to nine months later",
                "You wake up with your husband's penis still inside you."
            ],
            "content":"<div class=\"\"><div> <span>Your husband walked you to the apartment, and shut the door. He then leaned into you, and started to kiss you. If felt much better than the first time he kissed you. And new urges rushed to your brain. Your husband starts to take your pants off, and you accept it. He then strips his shirt and clothes off, leaving his strong body naked, you then take off you shirt and underwear. After kissing and such, he then starts to shove his junk up you vag.,if fills you with a pleasure. You groan.<br>\r\n<br>\r\n\"Yes honey! YES,\" you yell in pleasure. Then he tells you he is going to cum, and if you want this. You exclaim, \"YES!!!\" And a pleasure fills you as sperm shoots through your body. You both then fall asleep.</span></div></div>",
            "created":1444280400,
            "id":2044992,
            "title":"Love"
        },
        "14211212221":{
            "choices":[
                "He drives you to the hospital",
                "Something else happens..."
            ],
            "content":"<div class=\"\"><div> <span>Nine months later, you are a pregnant women, sitting back at home on the Couch, almost unable to move. you look down to your body, seeing a huge belly under your swollen breasts. Today is the big day, a you will give birth. Later your husband will drive you to the hospital. Your son Jake Comes in, trying to preparing that awaits you soon. Unimaginable, this young men were once you. While your son talks to you, you lost Attention and remembers being him. As you were a boy, you never worried about getting a child, because you had never worried about becoming pregnant. And now you have such a big belly, you can not even look down to your own feet. You lie your hand on your belly feeling movements of the baby inside of you. Now you even know how it feels to have a living being, touching you from inside. Then your husband enters the room, ready to drive you to the Hospital.</span></div></div>",
            "created":1490418000,
            "id":2294847,
            "title":"Time cut to nine months later"
        },
        "14211212222":{
            "choices":[
                "you do it again...",
                "you want the day to start..."
            ],
            "content":"<div class=\"\"><div> <span>Then you wake up, you still feel something fleshy inside of you. For a Moment you felt like having a dick again between your legs, but you quickly remembers it is actually inside of you. You disappointment fades, then you remember the Feeling of your last night. You husbands woke up, too.<br>\r\n<br>\r\n\"How are you Darling?\", <br>\r\n\"I feel better then ever. I would even say, how hard this adjustment was, it was it worth. I don´t just like it, to be a women I love it now. I can not even wait for the evening, to do it again.\"<br>\r\n<br>\r\n\"We do not have to wait, honey. I am even still inside of you.\"<br>\r\n<br>\r\nAnd while you thinks of get intimacy again, you feel how something big hardens inside you, making you vag wet. But do you want another turn again so soon?</span></div></div>",
            "created":1488085200,
            "id":2282755,
            "title":"You wake up with your husband's penis still..."
        },
        "142112122221":{
            "author_id":"zeylar",
            "author_name":"noname",
            "choices":[
                "Get up and eat breakfast",
                "Go and take a shower"
            ],
            "content":"<div class=\"\"><div> <span>Yeah, it felt so good last night, you want to feel it again. You smiled and gave an approving nod as you felt your husband slip deeper inside you, making you moan. You lied there thinking about how taboo this situation is as he fucked you. \"Harder baby, harder!\" you moaned as your husband bent your legs all the way down to your shoulders, making him go even deeper inside you.<br>\r\n<br>\r\nIt was the best experience you'd ever had, and it wasn't even over yet. You met his gaze as you put your hands on his shoulders for support. \"I want you to cum inside me\" you mustered. Paul only smiled as he sped up and prepared for the grand finale. He pushed deep inside you and unloaded as he moaned, and you hit your climax simultaneously. It was the wonderful thing you'd ever felt, you thought, as you felt his dick leave your vagina and leaving you empty as the cum slowly ran down your pussy lips.<br>\r\n<br>\r\n\"Wow is this what mom feels like every time you have sex? It's amazing\" you said breathlessly.<br>\r\n<br>\r\n\"Yeah, I can tell you enjoyed it\" Paul replied as you smiled and gave him a quick kiss.</span></div></div>",
            "created":1551210780,
            "id":2623410,
            "title":"you do it again..."
        },
        "1422":{
            "author_id":"epicness",
            "author_name":"Retarded reader",
            "choices":[
                "Your dad forgets about the swap and makes you pregnant",
                "You begin learning to be a mom."
            ],
            "content":"<div class=\"\"><div> <span>Your father now husband looked at you sympathetically, unable to take the stress, you leaned into him and started sobbing. It was over, you were going to be a woman forever. You husband then lifted up your chin with his finger.<br>\r\n<br>\r\n\"It's alright honey, it's alright...\" He said. But it wasn't alright. You were his wife now. Then your mother now son came up to you and started to comfort you as well.<br>\r\n<br>\r\n\"Sweetheart... You'll be ok... Being a woman's not bad, I'll help you learn to be a proper woman... It's ok.\" Hearing that from you helped you calm down, you looked at your son. Slowly smiling.<br>\r\n<br>\r\nAfter being comforted, you were informed that none of your other siblings knew, so it would be easier on them. You walked out of the room, and your children rushed and hugged you.<br>\r\n<br>\r\n\"I'm so glad your ok mom!\" Cassandra said happily. You smiled. Maybe things weren't so bad...</span></div></div>",
            "created":1444107600,
            "id":2044266,
            "title":"meet with your father"
        },
        "14221":{
            "choices":[
                "Turn around, so he can use your butt.",
                "Opening your mouth for the next turn."
            ],
            "content":"<div class=\"\"><div> <span>Return at home, you now have to make the dinner. It´s already late. Your son helped you out in the kitchen this time but wants to stay at home, for the rest of the week.<br>\r\nThe meal proceeded quit, at the beginning, later your son started to talk with your crush Chasity. You felt embarrassed, but fortunatly, there was nothing intime going on.<br>\r\n<br>\r\nAfter the dinner, your children went to their rooms. It was a hard day and you decided to rest now, going to your bedroom.<br>\r\nYou put on your night Dress, Feeling naked, because your dress simply lies other your legs unlike wearing trousers. But you will get used to it, after all, it feels breezy. Then your husband once your dad, enters the room.<br>\r\n<br>\r\n\"Alright my Darling. I see you already suit your Dress. Being a women is not that bad.\"<br>\r\n<br>\r\nYou looked at him nervous, he did not want to get intimate with you?<br>\r\n<br>\r\n\"No, don´t worry, Jake. I know this would be Kind of odd. But I know your Body likes a massage. Just relax. So you will gain more sensitive to your new Body.\"<br>\r\n<br>\r\nYou could realy Need to relax and maybe a massage could help, so you agreed after hesitation. You turned around lying on your belly. You feel your breast a bit squeezed on the mattress. But then you feel strong Hands on your back, kneading your now more slim shoulders. You enjoy it and relaxed. Then your husband wants to proceeds on your back, he enters under your Dress through below. He continued the massage more and more to the bottom half of your Body. Still expecting nothing embarassing, you still lie relaxed on your belly, then you suddenly hear a slap and Feeling your buttock shaking after a Hand hits it. You wanted to admit to stop sexual suggestions at least until you two talked about how to get intimate the next days. But then he turned you around, so you are now lying on your back. He grabs your legs and slides them with his hands up until he touches a point you usually know to be untouchable, becausethere were always \"flesh\" before. But now the fingers enter your Body through this Point. overcome by this new and strange but Kind of pleasent Feeling, you did not made it to stop your new husband from going further. He leaned over you and then pulled his finger out, quickly dresing out his trousers and put his dick in the place, you felt the finger before. You wanted to day \"Stop\", but once you opened your mouth to say something, you started to moan instead.<br>\r\n<br>\r\n\"Sto..ah...ah...oh...\", was everything you were able to Sound. You again triesand take a deep breath, but it causes just a loud moan. You realized it is useless to resist, so you decided to make the best out of it. You are Feeling a hard and warm part of flesh inside you, making  your moan and gave you immense sensations. But still you hope it will be over soon, because you think it is still Kind of odd and do not want to be satisfied by the man you still know as your dad. But your blank out and feel squeezeing liquid. <br>\r\n<br>\r\n\"Oh Julia I see you have reached the climax\"<br>\r\n<br>\r\nAnd then he squeezes his warm liquid inside of you. <br>\r\nYou feel absolutly overwhelmed not even able to put your still spreated legs together. Even you fear, he could see it as an investiagtion to enter you again.<br>\r\n\"I.. thought... no intimacy...today... couldn´t you wait...?\", was everything to say.<br>\r\nThen your husreminds the Body swap.<br>\r\n<br>\r\n\"oh I am sorry, I forgott, you are no longer Julia. I was so turned on by... well... by you. Well, that´s really odd. But now already start to get intimate, we can be intimate, everytime we want\"<br>\r\n<br>\r\nYou look to your belly, wondering, why your husband did not use a condom. Hoping you will not get pregnant.<br>\r\n<br>\r\n\"Now you already know how it feels to be feminne the hard way, we can try it in other positions. I mean, you have some other holes as well.\"<br>\r\n\"Are you crazy?\", you asked.<br>\r\n\"Why? When you used to be a Boy, you would like it too, right? Your mother did it as well. Ok she did not realy liked the butt, but maybe you can feel more pleasure about it. At least we should try one other entrance.<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1487134800,
            "id":2278094,
            "title":"Your dad forgets about the swap and makes you p..."
        },
        "142211":{
            "choices":[
                "Some months later",
                "something else happened"
            ],
            "content":"<div class=\"\"><div> <span>Your husband was still to horny to let you  sleep, and tasting the ejaculation is too much for you today, hoping you could avoid this embarrassing act forever.<br>\r\nSo you thought, you could give him a turn in your ass. So you turned on your belly and Paul stretched your butt, so he can enter it easier. But feeling his cock from behind gave you a whole other sensation, it was like you have to empty your intestine but instead , the \"hard  thing\" leaves it enters you. Then your husband finally finished rubbing his hard cock in your intestine, he sprout his ejaculation and it felt like it flow throw your whole inside.<br>\r\n<br>\r\nSo finally you was finished and you can rest.<br>\r\n<br>\r\n</span></div></div>",
            "created":1487653200,
            "id":2280579,
            "title":"Turn around, so he can use your butt."
        },
        "1422111":{
            "choices":[
                "Gynecologists",
                "Your body swells up"
            ],
            "content":"<div class=\"\"><div> <span>Some months later, you managed to be a mom. At first you daughters tease you, that you are now female too, even they did not exaggerate. Chasity tried to keep the relationship with Jake, even she knows he is now a boy, which used to be a women. But she missed you to be her crush. But after Jake asked for advise, she find a new lovely boyfriend in him. And you helped your \"mom\" to go through the male puberty. Intimacy with your husbands now happens the way you want it to be, and you even started liking the female role by intimacy. And actually, you will miss the most painful part of women´s life: giving birth! So you thought, but now you realize you are pregnant. How did you realized it?</span></div></div>",
            "created":1487653200,
            "id":2280587,
            "title":"Some months later"
        },
        "14221112":{
            "author_id":"secretgoat",
            "author_name":"Ralsei",
            "choices":[
                "You wanna be a mother and wife",
                "You decide to change back "
            ],
            "content":"<div class=\"\"><div> <span>the swap procedure had problems with the pregnancy. So now you can swap back but your pregnancy is happening rapidly. you suddenly get 9 months pregnant then your breasts growing 2 sizes. Your shocked but can’t resist to pinch your nipple and now only does milk squirt out but you instantly go in labor. Then happened when you husband was a work and the kids at school. You can’t move and just push and push until you finally give birth to your baby. Then a whole flood Of female hormones flood your mind and even more when the baby begins sucking on your breasts. Your family takes you to those doctors told you that you can change back now. But thanks to those hormones messing up your mind and making you more motherly and almost forgetting your old life.</span></div></div>",
            "created":1582186020,
            "id":2789992,
            "title":"Your body swells up"
        },
        "142212":{
            "author_id":"zeylar",
            "author_name":"noname",
            "choices":[
                "The next day",
                "You hadn't used protection before, so you went to check if you were pregnant"
            ],
            "content":"<div class=\"\"><div> <span>You pondered on the things your father said. He was right, it actually felt really good, it helped you sink into your new role as a wife and mother.<br>\r\n<br>\r\n\"You.. you're right. I want you in my mouth.. honey\". You stammered, still slightly unsure if you should go this so soon. Those thoughts were interrupted as he wasted no time and shoved his cock into your mouth. He knew you were new to this, and so he helped by pulling down your head on the cock and you started sucking. \"Mmm mmm\" you went, trying to pretend it was a lollipop you sucked on. It was in a sense.<br>\r\n<br>\r\nHe started thrusting your head down faster and faster, until it turned into a mouth-fucking. You kind of liked him being so rough, it helped you further slipping into the role of a dutiful, submissive wife. Suddenly he stopped and held your head in place, not letting you go. \"Uh oh\" you thought as you felt the cum splash against the back of your throat. It was so much, but you didn't want to swallow since it tasted kind of bad. After Paul had come with all he had, he let you go and quietly stared at you. You were confused but it hit you that he was waiting for you to swallow. Reluctantly you swallowed it all down and opened your mouth to show that it was empty. Your husband grinned as he was very happy with your performance.<br>\r\n<br>\r\n\"You're already doing a great job honey\" he smirked.</span></div></div>",
            "created":1551211320,
            "id":2623412,
            "title":"Opening your mouth for the next turn."
        },
        "1422121":{
            "author_id":"secretgoat",
            "author_name":"Ralsei",
            "choices":[
                "Give in",
                "Try to resist "
            ],
            "content":"<div class=\"\"><div> <span>When you wake up you go (still naked) into the bathroom trying to figure out how to wash yourself. You say to yourself “will I have to change the way I behave now that I’m mom” But suddenly you felt your father’s penis get thrusted up your butt and it felt somewhat pleasurable. And then he grabs your breasts and massages them and your dad whispered into your ear “I love you just the way you are. Behave how you want to . I actually find it sexy when you act like a boy. But let not talk now , I’m not done from last night. Your body and even your mind wants him what do you do?</span></div></div>",
            "created":1582186500,
            "id":2789994,
            "title":"The next day"
        },
        "15":{
            "choices":[
                "Readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I refuse to do this!<br>\r\n<br>\r\n(sorry, I accidentaly added without typing this option properly</span></div></span></div>",
            "created":1361336400,
            "id":1536176,
            "title":"I refuse!"
        },
        "151":{
            "choices":[
                "two others to swap as well!",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>\"I refuse to do this swap under these circumstances.\" You tell your family.<br>\r\n<br>\r\n\"What do you mean?\" Your father asks you concerned. You were the ticket to your family being better off so you have a leverage.<br>\r\n<br>\r\n\"If I'm going to swap, I want...</span></div></div>",
            "created":1433826000,
            "id":1990137,
            "title":"Readers choice"
        },
        "1511":{
            "choices":[
                "Jennifer or Cassandra",
                "Chasity or mom."
            ],
            "content":"<div class=\"\"><div> <span>\"But they specifically asked for a boy and a girl to swap.\" Your father says as he tries to understand it.<br>\r\n<br>\r\n\"And I will swap with a girl, but I don't want to be the only one that has to swap. Wouldn't it be more fun if two other people would swap as well. You know to support me.\"<br>\r\n<br>\r\n\"I don't know, I'm not even sure if they are willing to go with it.\" Your father asks himself.<br>\r\n<br>\r\n\"Honey, if two of us would be willing to swap as well, would you then consider doing it?\" Your mother asks to be certain.<br>\r\n<br>\r\nYou nod your head firmly. \"Yeah, then it's fine with me.\" Your mother looks at your father with that all knowing gaze, and a few minutes later he's on the phone. After a few minutes he's back again.<br>\r\n<br>\r\n\"Alright, since they seem to like you, they agree with it. Two others might swap as well.\" Your dad says happy.<br>\r\n<br>\r\n\"That's great, alright in that case I want to swap with..</span></div></div>",
            "created":1434949200,
            "id":1997331,
            "title":"two others to swap as well!"
        },
        "15111":{
            "choices":[
                "Go for Cassandra.",
                "Go for Jennifer."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to swap with one of your siblings. Being one of them would be cool, you think. But who to choose? Should you go for your younger and more fun sister Cassandra or your older and more good looking sister Jennifer?</span></div></span></div>",
            "created":1439096400,
            "id":2019031,
            "title":"Jennifer or Cassandra"
        },
        "151112":{
            "choices":[
                "Cassandra and Julia (mother and daughter)",
                "Cassandra and Chasity (exchange sister with real sister)",
                "Chasity and Julia (exchange sister with mother)"
            ],
            "content":"<div class=\"\"><div> <span>You decide to go for Jennifer. Your friends tell you that she has one of the hottest bodies they've ever seen. And she's the oldest which means she doesn't have to do any of the chores you and Cassandra have to do, because she has always done them (with no great results you heard your parents say one time). <br>\r\n<br>\r\n\"I'll pick Jennifer.\" You tell her with a smirk.<br>\r\n<br>\r\n\"Great. There goes my life.\" She says rolling her eyes.<br>\r\n<br>\r\n\"Jennifer, we let Jake make the decision.\"<br>\r\n<br>\r\n\"So who's going to switch bodies as well?\" Cassandra asks curious.<br>\r\n<br>\r\nSince you were the one who decided to switch bodies, you are also the one who gets to decide who switches bodies as well. There are three girls (or women) over, Cassandra, Julia and Chasity. <br>\r\n<br>\r\n\"The ones who have to swap as well are....</span></div></div>",
            "created":1439096400,
            "id":2019034,
            "title":"Go for Jennifer."
        },
        "1511122":{
            "choices":[
                "The switches are a succes. ",
                "Something goes wrong while swapping.",
                "You're permanently stuck as Jennifer."
            ],
            "content":"<div class=\"\"><div> <span>If that's alright with the two of you at least.\" You tell Cassandra and Chasity. Both begin to smile at each other. <br>\r\n<br>\r\n\"I'd love to swap with you Cassandra that way I can feel how it is to be an American teenage girl.\" Chasity tells her.<br>\r\n<br>\r\n\"And I can't wait to be you Chasity, being way older than I am now.\" Cassandra says happy. <br>\r\n<br>\r\n\"Then that settles it.\" Your mom says standing up from the couch. \"Jake and Jennifer will swap bodies and Cassandra and Chasity will switch bodies as well. I'll make the call then.\" Your mother says walking over to the telephone.<br>\r\n<br>\r\nSeeing as how that is settled everyone goes to do their own business. You go to your room where you're going to enjoy your last day as a guy, at least for now. You're sure you can swap back again. You're busy with playing video games when the door behind you suddenly opens up. Looking back you are surprised to see Jennifer standing there. <br>\r\n<br>\r\n\"Listen I want you to understand that I'm not doing this voluntarily. I'm only doing this because mom and dad asked it because of me, or else I wouldn't even think of trusting my body to you. And I want you to remember one thing very clear, if you somehow manages to screw up my life then be warned that I'll screw up your life even more.\" Your sister says pushing her finger into your chest. <br>\r\n<br>\r\n\"Whatever.\" You tell her slapping her finger away and going back to playing your games.<br>\r\n<br>\r\n\"Enjoy your last day. Who knows? When you get back to your body you might not have a computer anymore.\" Your sister says laughing as she walks out. <br>\r\n<br>\r\nThe comments haunts you a little, what if she says comes true? You decide not to give Jenny a chance, making sure to behave just like her. How difficult could that be?<br>\r\n<br>\r\nThe next day you, Jennifer, Cassandra and Chasity arrive at the lab by car (Jennifer drove of course). What happens next?</span></div></div>",
            "created":1441515600,
            "id":2030626,
            "title":"Cassandra and Chasity (exchange sister with rea..."
        },
        "15111223":{
            "choices":[
                "they are permanently stuck as each other as well.",
                "they can be swapped back. ",
                "they ended up somewhere else than expected."
            ],
            "content":"<div class=\"\"><div> <span>You were all lead to separated rooms where you had to change out of your clothes and into hospital gowns. You sure hope it's over quickly as you can feel your naked bum. You then lye onto a table where the scientist around you attach a device to your head. Then you only need to count down from 10. As you do you slowly feel getting sleepy and you just finish the one when everything is dark for a second. Or should you say feels like a second. <br>\r\n<br>\r\nWhen you open up your eyes you feel so miserable. It feels like a steamroller squashed your head and then something more. It's then that you realize something is different. Looking forward you see two balloons underneath the hospital gown. But that can't be, aren't they? With trembling hands that look different as well, you touch the balloons.  Weird thing is though that you can feel them attached to your chest, they feel rather nice though. <br>\r\n<br>\r\nYou try to lye up by which  you feel the long hair on your shoulder. This is really going to get used to. Before you can do anything else, the scientist guy your dad knows comes inside the room. \"Hello Jake. Or is it Jake?\" He asks. <br>\r\n<br>\r\n\"Yep, it's really me in here.\" You tell the guy with a confident smile.<br>\r\n<br>\r\n\"Good, good, then the project is a success. However there is one setback.\" He tells you.<br>\r\n<br>\r\n\"Wait, what is it?\" You ask him noticing the serious expression on his face.<br>\r\n<br>\r\n\"I don't know how to tell you this, but this switch, I'm afraid it's permanent Jake.\" He tells you.<br>\r\n<br>\r\n\"What?! You said you would swap us back.\" You tell the guy being blown away.<br>\r\n<br>\r\n\"I would, but the results came back. Apparently your brain seems to have developed a resistance against the serum used in the machine. We can't swap you back anymore.<br>\r\n<br>\r\n\"No, no, sis is going to kill me.\" You tell the guy holding up your hands. <br>\r\n<br>\r\n\"Wait, what about Cassandra and Chasity?\" You ask the guy.<br>\r\n<br>\r\n\"Well....</span></div></div>",
            "created":1444366800,
            "id":2045595,
            "title":"You're permanently stuck as Jennifer."
        },
        "151112231":{
            "choices":[
                "try it out yourself. You will have to do it yourself eventually.",
                "let one of your sisters help you. Better do it right the first time."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm afraid the same thing happened to them as well. We were switching them at the same time you and you sister. I'm sorry I don't have any better news. <br>\r\n<br>\r\nYou touch your forhead as you can't believe this happened. First you managed to made you and Jennifer switch bodies and now Cassandra and Chasity where stuck like this as well. You can't imagine their shock when they would find out. Especially Chasity, what would her parents say when they find out about it? Or even worse, she would never be allowed to return home again? <br>\r\n<br>\r\n\"Jake, I know this might not be the right moment, but you need to get dressed up. It's for the best if we all sit together and talk this through.\"<br>\r\n<br>\r\nYou nod your head not thinking anything about it further. You really didn't have time for him. \"Hmm, your sister left her clothes there on the chair.\" He points out to you. You look up and see her clothes including her bra and panties. <br>\r\n<br>\r\n\"Hold on a sec.\" You say noticing your female voice for the first time. \"I don't know how to put a thing like that on.\"<br>\r\n<br>\r\n\"You don't need to worry Jake. We only switched a part of your brain. The rest of the brain inside your head belongs to your sister and contains all the knowledge to do things like that. It should be a snap.\" He explains.<br>\r\n<br>\r\n\"Should?\" You ask him uncertain. <br>\r\n<br>\r\n\"Well, since this is the first time we've ever done it we're not sure exactly, but we're pretty sure.\" The doctor says. He sees your uncertain look. \"I could call for one of your sisters to help you out.\"<br>\r\n<br>\r\nYou consider his suggestion and decide to...</span></div></div>",
            "created":1445749200,
            "id":2052508,
            "title":"they are permanently stuck as each other as well."
        },
        "1511122311":{
            "choices":[
                "awesome!",
                "terrible!"
            ],
            "content":"<div class=\"\"><div> <span>\"No, that's okay. I like to do it myself.\" You tell the doctor. <br>\r\n<br>\r\n\"Are you sure? It's not a problem if you want to ask for help.\" The doctor tells you.<br>\r\n<br>\r\n\"No, that's not it. Please just leave me alone for now.\" You tell the doctor. He looks hesitant, but seeing your determination he walks out of the room leaving you alone. <br>\r\n<br>\r\n\"Alright Jenny, let's do this.\" You tell yourself as you look down. It's a pretty uncomfortable thought to think your sister's body is underneath that gown and even worst is the fact that this is going to be your body from now on. Twenty four seven, no escape possible. If you had known this would happen, you would have switched with somebody else, that's for sure. <br>\r\n<br>\r\nThen taking a deep breath you grab the hospital gown and pull it over your head. As you are free of the gown you do feel a little better, that is though before you looked down and saw you had breasts. Real breasts! Not small ones but actually big ones. With small pink nipples adorning them. Wow, you think by yourself. If this wasn't your sister's body you would actually think they are hot! With a curious look you gently grab one of them, just to get a feeling how they feel in your hand. And to tell the truth, it's not bad. They feel very soft and jiggly, like marshmallows but then even better. It's then that you realize you're playing with your sister's body, something she might not agree on. Well, you could always check it out more at home. You then look at the stuff your sister brought with her this morning. First you put on the pair of panties, they feel like normal underwear except for the fact that you can't feel any bulge forming in them. Then you pick up the bra. Without realizing it you put the bra on in an instant without realizing it. You can't believe you did that yourself. It must be some of those memories that stayed with Jenny's body. You then put on the top she was wearing with the shorts. They felt like your normal clothes, except for the top which showed off a peak of your cleavage. Luckily Jenny decided to wear sandals this morning, you remember she has some really tall shoes as well and you are nervous about the fact that you will have to walk in them too. <br>\r\n<br>\r\nYou then can see your reflection in the machine that did this to you. If you wouldn't know better you would say Jenny was standing there with you. Except for the expression on your face you looked exactly like her. You then decide to get out and confront your sister. <br>\r\n<br>\r\nYou begin to take small steps and instantly feel the difference as you feel your hips swinging a little. You hit your forehead hoping that nobody you know would find this out. It's then that the door opens and your body steps inside, wearing the same t-shirt and jeans you were wearing this morning.<br>\r\n<br>\r\n\"Jenny?\" You ask hesitant. <br>\r\n<br>\r\nShe nods silently.<br>\r\n<br>\r\n\"I guess you heard the news. I'm so sorry. If I had know this I would never have picked you.\"<br>\r\n<br>\r\n\"Jake, you know what I think about this?\" Jenny says with a small voice.<br>\r\n<br>\r\n\"No.\" You say hesitant.<br>\r\n<br>\r\n\"I think this is....</span></div></div>",
            "created":1448686800,
            "id":2067665,
            "title":"try it out yourself. You will have to do it you..."
        },
        "15111223111":{
            "choices":[
                "I always wanted to be a boy.",
                "I'm attracted to girls.",
                "another reason."
            ],
            "content":"<div class=\"\"><div> <span>You think you might have heard this wrong. Did Jenny really say awesome? Or did Jenny's ears have some kind of problem and replace terrible with awesome whenever she heard it?<br>\r\n<br>\r\n\"What?\" You ask confused.<br>\r\n<br>\r\n\"You heard me pipsqueak, this is awesome!\" Jenny said with a big smile as she paraded around like a peacock. \"Look at me Jake, I'm a guy. A guy! Do you know what this means?\" <br>\r\n<br>\r\n\"A lot of things you couldn't do when you were a girl.\" You asked.<br>\r\n<br>\r\n\"Well, yeah some of them. Never having my period, not having to sit down when to pee. Not to mention my chance of lying back for a few years going through high-school again.\" Jenny says with a proud smug on her face.<br>\r\n<br>\r\n\"So you don't mind me being inside your body?\" You ask her confused.<br>\r\n<br>\r\n\"Of course not, help yourself out. I don't care what you do with yourself.\" She says flexing one of her muscles. \"Hmm, I think I might need to go to the gym a couple of days from now on.\" She mumbles to herself.<br>\r\n<br>\r\n\"But all those things you said about me having to take care of your body?\" You ask her.<br>\r\n<br>\r\n\"That was when we would switch back again. Now this body will be mine forever.\"<br>\r\n<br>\r\nYou couldn't believe your sister was like this. Instead of hating you or crying about it, she actually seems happy to be stuck inside your body.<br>\r\n<br>\r\n\"You seem a little too happy about being a boy, why?:<br>\r\n<br>\r\n\"Ugh, fine.\" Jenny says rolling with her eyes (something you hope you would never see again). \"The reason I'm so happy is because,...</span></div></div>",
            "created":1450242000,
            "id":2075360,
            "title":"awesome!"
        },
        "151112231112":{
            "choices":[
                "You all go home.",
                "You go see Chasity and Cassandra."
            ],
            "content":"<div class=\"\"><div> <span>\"Wait what?\" You ask confused not sure you heard this right. Did Jenny just say she was..<br>\r\n<br>\r\n\"Yeah, you heard me I was a lesbian. I just didn't want to tell it to anyone. Not even mom and dad know about it.\" She says nonchalant.<br>\r\n<br>\r\n\"But why not telling us?\" You ask her still confused.<br>\r\n<br>\r\n\"Because you would treat me totally different because of it. You all think of lesbians like girls with short hair and who look ugly. If I would have told you, you would have made fun of me because of it. But now things are different.\"<br>\r\n<br>\r\n\"Different?\" You ask.<br>\r\n<br>\r\n\"Yeah, with your body I can just ask any girl out, not having to wait and see if she's a lesbian. This is going to work out all perfectly for me.\" She says with a smile on her face.<br>\r\n<br>\r\n\"But what about me?\" You ask her with a quiet voice.<br>\r\n<br>\r\n\"Jake, you are not me. You just have my body, that's it. You don't have to feel ashamed of being attracted to girls, like I did. You can just tell our family about it and they wouldn't care less about it. As for a girlfriend that's a whole different problem, but one you have to figure out.\"<br>\r\n<br>\r\nShe then lays her hand on your shoulder. \"That doesn't mean I'm not going to help you get started as a girl. You may do with my body as you like, but you need some guidance.\"<br>\r\n<br>\r\n\"Um thanks Jenny.\" You say smiling friendly at Jenny. </span></div></div>",
            "created":1454389200,
            "id":2098165,
            "title":"I'm attracted to girls."
        },
        "1511122311122":{
            "choices":[
                "being happy.",
                "being nervous."
            ],
            "content":"<div class=\"\"><div> <span>Since you and Jenny are finished being dressed  you walk over to the room where Chasity and Cassandra are currently in. \"How do they hold on?\" You ask Jenny rather nervous about seeing them. After all it's your fault they are stuck as each other as well. Jenny just smiles a bit as she opens the door and mumbles: \"See for yourself\".<br>\r\n<br>\r\nInside the room you see Chasity and Cassandra...</span></div></div>",
            "created":1460005200,
            "id":2129084,
            "title":"You go see Chasity and Cassandra."
        },
        "15111223111221":{
            "choices":[
                "Everyone goes their seperate way.",
                "The pairs that swapped stay together."
            ],
            "content":"<div class=\"\"><div> <span>Inside the room you see a strange sight for eyes. In one corner of the room you saw your sister's body dancing and looking in the mirror as she was checking her body out, in the other room you saw Chasity's body sitting down on the ground heaving her boobs up as she smiles at them. <br>\r\n<br>\r\n\"Heya girls. Enjoying yourselves?\" Jenny asks the girls.<br>\r\n<br>\r\n\"Absolutely, this body is gorgeous.\" Chasity in Cassandra's body says running up to the two of you.<br>\r\n<br>\r\n\"Chas, I never say gorgeous.\" Cassandra in Chasity body tells her.<br>\r\n<br>\r\n\"What do you say then?\" Chasity asks her.<br>\r\n<br>\r\n\"I would say \"this body is awesome.\" Cassandra tells Chasity.<br>\r\n<br>\r\n\"Okay, this body is awesome.\" Chasity says with you all laughing about it.<br>\r\n<br>\r\n\"So how do you feel bro, or should I say sis?\" Chasity asks you in a serious tone.<br>\r\n<br>\r\n\"I'm good, it's just.\" You want to tell more, but Chasity can guess it. <br>\r\n<br>\r\n\"It's the female body right? For us girls it's less of a difference, but cheer up. We're here for you.\" Chasity says hugging you. Then the rest hugs too, until you feel like getting squashed together. \"All right Jenny, a little too much together.\" You tell her.<br>\r\n<br>\r\n\"Sorry, getting used to my strength.\" Jenny excuses herself.<br>\r\n<br>\r\n\"That's okay, glad I don't get those hugs too often.\" Cassandra tells you.<br>\r\n<br>\r\nThe girls then both get dressed in their respective clothes and when they're done you all go home. <br>\r\n<br>\r\nWhat do you do next?</span></div></div>",
            "created":1470546000,
            "id":2192445,
            "title":"being happy."
        },
        "151112231112212":{
            "choices":[
                "hair and make-up.",
                "clothes and shoes."
            ],
            "content":"<div class=\"\"><div> <span>\"Come on Cas, or should I say Chas? We still need to go through a few things.\" The real Chasity tells Cassandra as you all walk in the house. <br>\r\n<br>\r\n\"Oh right yeah, no problem. See you later.\" Cassandra says waving as she hurries after Chasity.<br>\r\n<br>\r\nThat leaves you and your sister alone. It's awkward standing there with her alone until she suggests you need to go over a few things too. So the pair of you go up to Jenny's room or should you say your room. Opening the door it's awkward to think this will be your room for now. It's so girlie. The walls are pink, covered in posters of girlbands. You hesitant sit down on your sister's bed while your sister takes her place on her desk chair. You're not sure where to put your hands and so you awkwardly put them on the bed. It's the same problem as when you traveled home, but at least then you weren't watched by Jenny.<br>\r\n<br>\r\n\"Look we need to get over a few things to make this all work. And I can see you're uncomfortable with my body so the first thing we need to do is strip you down.\" <br>\r\n<br>\r\n\"Wait what?\" You ask confused not sure what your former sister just said.<br>\r\n<br>\r\n\"You heard me. Strip.\" She said in your former commandeering voice.<br>\r\n<br>\r\nYou're not sure what to do, but since your sister seems so persistent you strip off the top and the shorts standing only in your underwear. Your sister still frowns. \"I said all clothes.\" <br>\r\n<br>\r\n\"But then I'm naked!\" You exclaim.<br>\r\n<br>\r\n\"It's my body, I have seen it longer than you have.\" Your sister says still looking at you with a stern gaze.<br>\r\n<br>\r\nWith a sigh you pull off the bra and take down your panties. Automatically one arm covers your breasts and the other your crotch. <br>\r\n<br>\r\n\"Look at yourself in the mirror.\" Your sister points at the large mirror in her room. \"What do you see?\" <br>\r\n<br>\r\n\"Your body.\" You say still ashamed about being stuck inside it for eternity.<br>\r\n<br>\r\n\"Except that, what do you think of it?\" Jenny asks you.<br>\r\n<br>\r\n\"It's pretty?\" You ask.<br>\r\n<br>\r\n\"What about your boobs? Are they big enough?\" Jenny asks you casually.<br>\r\n<br>\r\nYou look down at your breasts, they don't seem that small. Actually they seem just perfect. \"Yeah they are good.\"<br>\r\n<br>\r\n\"How do they feel? Feel heavy?\" She asks you.<br>\r\n<br>\r\nYou try to heave your breasts feeling a small tingling going through your breasts while doing so. <br>\r\n<br>\r\n\"And your pussy, does it look okay?\" She asks pointing down. You look at your reflection for doing so. It's largely hidden between the bush your sister keeps there. <br>\r\n<br>\r\n\"I guess so.\" You tell her as you try to take a look at it. <br>\r\n<br>\r\nYou're surprised as you suddenly feel a hand grabbing your breast and squeezing it while another hand stroke your pussy. A pleasant tingling courses through your body but you quickly turn around to see Jenny doing it.<br>\r\n<br>\r\n\"What was that for?\" You ask her confused.<br>\r\n<br>\r\n\"Because that's what my body feels like, really good. Look, I noticed from your body language that you're not comfortable with my body. And you still feel guilty about this whole experiment. But that doesn't matter anymore. We're inside each other's body so we have to make the best of it. All I wanted to do was show you what a wonderful body you have there. So be happy with it. If you were to swap bodies with another girl, would you acted the same way? And don't tell me the pretentious good boy lie, I know what guys think. And I don't mind you doing it, as long as you don't do it right in front of me.<br>\r\n<br>\r\nYou realize Jenny was right, the way you have being handling her body was like you were afraid. But you shouldn't be like that. You should enjoy yourself. After all for all her faults Jenny did have an amazing body. <br>\r\n<br>\r\n\"That's the spirit.\" Jenny says with a smile. Now we need to tackle the next thing and that is..</span></div></div>",
            "created":1484110800,
            "id":2262230,
            "title":"The pairs that swapped stay together."
        },
        "1511122311122121":{
            "choices":[
                "You or Jennifer.",
                "Cassandra or Chasity."
            ],
            "content":"<div class=\"\"><div> <span>\"Wait, what?\" You ask confused. <br>\r\n<br>\r\n\"I mean it. There is so much you need to know about hair and make-up. That's why I want to tackle this first.\" Jenny tells you as she points for you to sit at her vanity table. \"We're going to have a long talk.\" She says sitting on a chair herself.<br>\r\n<br>\r\nThe talk after that is one of the longest you ever had with Jenny. While you had your hair short and only one style Jenny had long stylish reaching half her back. There were so many styles you were confused at the end of it. A long ponytail for going to the gym, hair loose when going out with friends, her hairs braided when you were visiting your grandmother and so forth. After that talk Jenny let you try out a few of the styles. Even showing off her curling iron. And just as putting on a bra, your body already knows what to do just as long as you focus on doing it. <br>\r\n<br>\r\nAs you were hoping that was over there was even more stuff going on with the hair; like washing it. Jenny showed off her entire collection of shampoo bottles which was overwhelming for you. As Jenny described each shampoo bottle and it's qualities you just hoped that Jenny's brain would help you remembering every one of these bottles. <br>\r\n<br>\r\nWhen that was finally over Jenny talked to you about her make-up. She was never seen leaving the house without it and so you had to do it as well. Jenny first explained what type of make-up was used where and how and after that she let you practice. Putting on lipstick, smooching your lips and then removing the lipstick for lip gloss.<br>\r\n<br>\r\nWhen you were finished you hoped that this was everything for today, but it seemed Jenny had even more planned. It was as that moment your mother called from downstairs that dinner was ready.<br>\r\n<br>\r\n\"Oh crap! We didn't go through with my clothes and what to wear.\" Jenny said.<br>\r\n<br>\r\n\"Relax Jenny, we can do that stuff after dinner.\" You said happy to have an excuse. <br>\r\n<br>\r\n\"Fine, but I hope that we can eat fast. The sooner we have gone through this, the better. Now you get dressed and I'll meet you downstairs.\" Jenny said as she went already. <br>\r\n<br>\r\nYou grabbed the tank top, panties and shorts from the ground. There was also the bra, but it wasn't important for now as only your family was around. When you were dressed (minus the bra) you went over to the vanity table and decided to put on some eyeliner and lip gloss like Jenny would. Doing it on you own was a bit scary, but you did a good job you had to admit. <br>\r\n<br>\r\nWhen you go downstairs (feeling your breasts jiggle all the way) you saw that your family was already seated. Cassandra and Chasity clearly gotten through with clothes and shoes first. Cassandra was wearing Chasity's push up bra, tank top, skirt and pumps while Chasity was wearing a simple tank top, jeans and flip flops. Jennifer looked pleased except when she looked at your chest. \"Ugh, why didn't you put on a bra?\" She asked annoyed as you sat next to her. <br>\r\n<br>\r\n\"Cause he's a boy.\" Cassandra said giggling. <br>\r\n<br>\r\n\"It's only us six tonight. What's the harm?\" You asked her with an innocent smile.<br>\r\n<br>\r\nBefore your sister could say something your mom intervened telling you that it was okay for tonight but you had to remember putting it on. You nodded your head as you began to eat your dinner. Dinner was strange; the people on the table were the same but in different positions and with different eating habits. It was very funny to see Cassandra's body eating with knife and fork while Chasity's body ate with only her fork. The food wasn't that different; you and Jennifer both liked spaghetti so it wasn't anything different than usual. <br>\r\n<br>\r\nAfter you had eaten and some small talk it was time to go upstairs to continue your training. It was at that moment the doorbell rang. Your mother hurried to the door. You, Jennifer, Cassandra and Chasity were all looking at each other. It could be any of your friends that was standing at the door and the only question was who. You then heard your mother calling for...</span></div></div>",
            "created":1505680620,
            "id":2387269,
            "title":"hair and make-up."
        },
        "15111223111221212":{
            "choices":[
                "Cassandra",
                "Chasity"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You breathed slightly relieved as the person who was being called for wasn't you or Jenny. That said you had pity for .... who was being called.</span></div></span></div>",
            "created":1517775840,
            "id":2449379,
            "title":"Cassandra or Chasity."
        },
        "151112231112212121":{
            "choices":[
                "Try it out. ",
                "Go to bed."
            ],
            "content":"<div class=\"\"><div> <span>Luckily Chasity inside Cassandra's body wouldn't be that lost as Cassandra might have been. Chasity came downstairs the stairs running. \"Hey Paula? What's up?\" She said laughing.<br>\r\n<br>\r\n\"Not much, we were going to hang out at our spot. You know.\" Paula's shoulders shrugged. <br>\r\n<br>\r\n\"Okay, then. Let's go.\" She said going outside with Paula. You could hear Paula asking: \"It sounds like you got a Cockney accent somehow, is that new?\" Then the voices faded away as Chasity and Paula went off on their trip.<br>\r\n<br>\r\n\"That's a relief, I think Chasity is going to be fine though.\" Jenny said having heard the conversation as well. Then Cassandra came standing with you as well. \"That means I get a night off. I'm so glad.\" Cassandra said relieved.<br>\r\n<br>\r\n\"You better practice that Cockney accent as well Cass, or else people will find it odd it went away so fast.\" You told her as you and Jenny went upstairs to your new room. Inside the room you sat on the bed as Jenny opened the closet doors. \"Now, I think that we are doing great on make-up. So the next stage is dressing up like me.\" She said holding out a clothes hanger with clothes hanging on. <br>\r\n<br>\r\nThe training continued for a few hours as Jenny showed you her outfits and how to combine them with each other. She even ended up giving you a practical exam: making an outfit to wear to school, for staying at home and special events. You nailed the outfits for school and home but flunked at the shoes for the special events. You're amazed Jenny has that many shoes and combining them with different outfits doesn't come that easy to you.<br>\r\n<br>\r\n\"Not too bad. A bit of practice and you will be as good as I was.\" Jenny muttered as she looked at the outfits. She seemed somehow sad.<br>\r\n<br>\r\n\"Is something wrong Jenny?\" You ask her concerned.<br>\r\n<br>\r\n\"No, it's well, yes there is something. When I look at these clothes, I'm just going to miss them, you know. Never wearing a skirt to school or walking on high heels. I'm going to miss those little things.\" <br>\r\n<br>\r\nWalking over to Jenny you put an arm on her shoulder as you rub it. \"I know, I feel the opposite right now. So many clothes and I can't stop wanting to wear just a pair of pants and regular shirt.\" You both laugh a little at the joke you made. <br>\r\n<br>\r\n\"It's going to be okay, it just takes some adjusting.\" Jenny said rubbing her eyes a little. \"Well, it's pretty late.\" Looking at the clock over your shoulder you see it's already ten. \"Tomorrow we get to the most fascinating part, your hygiene, so that means learning everything about wearing tampons and Aunt flo.\" She says with a wink as she closes the door behind you.<br>\r\n<br>\r\n\"Thanks, I look forward to it.\" You tell Jenny as you lie down on Jenny's bed. This is going to be challenging. You better get dressed for bed time. Luckily Jenny showed you she just wore a tank top and shorts. Nothing too special. You pull off the tank top you wearing. Looking down you can see your naked breasts. Apparently you and Jenny forgot to put one on again. Looking at it, you wonder a little how playing with them would feel. Should you try it out or go to bed for now?<br>\r\n</span></div></div>",
            "created":1535750460,
            "id":2541250,
            "title":"Cassandra"
        },
        "1511122312":{
            "author_id":"cjones2009",
            "author_name":"caleb jones",
            "choices":[
                "\"They are tears of joy!  I'm happy to be a guy!\"",
                "\"I'm a guy.  For the rest of my life! I have every right to cry!\""
            ],
            "content":"<div class=\"\"><div> <span>OK.  I could use some help I guess.  That bra looks confusing!  And how do they walk in high heels?  It is her body so I suppose Jennifer should be the one to show me how to get dressed.<br>\r\n<br>\r\n\"Send her in Dad.\"  He left you alone.<br>\r\n<br>\r\nYou look down at your new body, Jennifer's boobs thrusting out and away from you under a flimsy medical gown, a viewpoint you had never expected to see. It oddly felt like your chest had suddenly moved several inches ahead of you.  How odd.  They wiggled about a little as you moved to see the rest of your body. The sexy round bumps of flesh partially obscured your legs but you could see they were smooth and long with red toenails which matched your new fingertips.  <br>\r\n<br>\r\nYou were just about to check out your sister's long hair flowing over your shoulders as YOU walked in!  Or rather your body under the control of your sister.  You seldom cried but now your body had tears in his eyes...  her eyes... whatever!<br>\r\n<br>\r\n\"Jennifer!  What's going on? Why are you crying?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1457672400,
            "id":2115835,
            "title":"let the prior owner Jennifer help you out..."
        },
        "15112":{
            "choices":[
                "Chasity.",
                "Your mother."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide you didn't want to swap with either of your siblings. That would be too freaky. Instead you think of swapping with either Chasity or your mother. <br>\r\n<br>\r\nWho is it going to be?</span></div></span></div>",
            "created":1438405200,
            "id":2015271,
            "title":"Chasity or mom."
        }
    },
    "info":{
        "author_id":"thonan",
        "author_name":"thonan",
        "brief_description":"The family needs money so you and one of your female family members swap bodies for money",
        "created":1361238120,
        "description":"<td align=\"left\" class=\"norm\">Your family needs money and your friend, a scientist, has developed a one way body swap and needs test subjects. Your dad volunteers you and one of the girl's, being you 3 sisters or your mom, as it will give them a lot of money.<br>\r\n<br>\r\nCharacters<br>\r\n<br>\r\nYou<br>\r\nName- Jake<br>\r\n16 years old<br>\r\nAverage guy who is friends with Laura and Nick<br>\r\n<br>\r\nJenny<br>\r\nName- Jennifer \"Jenny\"<br>\r\nyour 18 year old older sister<br>\r\nhot, by Nick's standards, but is usually a bitch to you and your sister, Cassandra.<br>\r\n<br>\r\nCassandra<br>\r\nYour sister who is 12 and best friend<br>\r\nLaura is good friends with her<br>\r\n<br>\r\nJulia<br>\r\nMom, 34 and still looking fine<br>\r\n<br>\r\nPaul<br>\r\ndad, stayed out of swap so he could keep working.<br>\r\n<br>\r\nChasity<br>\r\nExchange sister from Britain<br>\r\nhot and you have a crush on her<br>\r\nbest friends with Jenny<br>\r\n<br>\r\n</td>",
        "id":1920159,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1584509220,
        "modified":1584509220,
        "pretty_title":"my new life"
    }
}