{
    "chapters":{
        "1":{
            "author_id":"kentasmeller",
            "author_name":"The Stink Sniffer",
            "choices":[
                "Jump in the river",
                "Hide in the tree",
                "Find something else"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Jason, you are driving your nice black Honda along the freeway of Denver, Colorado as you want to make your way to the Denver Comic Con that will be happening tomorrow so you want to get there the day before so you can get a hotel and stuff like that.<br>\r\n<br>\r\nAs you are on your way you hear a crash from your left as you talk a look and see a car smash into the back of another, it was a really bad idea for you to take your eye off the road as you see your inches away from a back of a car yourself. As you some how managed to stop yourself as you swerved to the right, forgetting that your on a bridge. You smash into a metal guard rail and fall of the bridge as the car rolls into a forest. You lay there out cold.<br>\r\n<br>\r\n------<br>\r\n<br>\r\nAfter couple of hours you finally wake up as you see yourself upside down still on the seat of your car because your seatbelt is still keeping you there. You look around yourself as it hurts your neck to do so, you take a look at your car window and see something that looked to be a couple of metres away. It looked like feet, so it's possible there is a person outside, maybe you hit him on your way down the forest. Who knows.<br>\r\n<br>\r\nYou thinks it's best to see who it is as you unhook your seat belt as you fall down. You see your car door all crumpled as you are still able to open it up with your hand and crawl out of the car. You are able to get up on your feet but your right knee is a bit banged up so it looks like you aren't able to fully walk with out pain.<br>\r\n<br>\r\nAnyways, you bring your attention back to the feet, as you look up a little and see a body that looks very grey and some what decomposed for some reason as it starts to confuse you a little, as you look up and funny to see their face. To determine it was not a 'he' or a 'she' it wasn't even a person it was what looked to be like a Zombie!!!<br>\r\n<br>\r\nYou look at it with widen eyes, hoping it was just some dude pretending to be a zombie, but as soon as you see it walk towards you motioning like an actual zombie. You decide it's best not to stand there, you try to run away from it. But with your leg you can't do much but limp as fast as you can to get away from the zombie, as you look back and you see getting closer to you.<br>\r\n<br>\r\nYou try to take bigger steps and walk faster despite your pain in your knee as it feels like it's on fire right now. You try to zig zag through the trees hoping it would help as you look back seeing as it looks to be gone, but you can see it's head a little as it still seems to be chasing you. You look in front of yourself as you see a river that seems to be moving fast, you look back and you see a zombie getting closer. You look around to see if there were better options of escape as you see a tree with a triangle like hole in it, you look at the zombie again and think about what you should do.<br>\r\n<br>\r\nShould you take the river, taking the risk of it going to fast and never being able to get on land.<br>\r\nDo you try to hide in the tree hoping the zombie would just go past you.<br>\r\nOr just find something else, that would be better. </span></div></div>",
            "created":1388997480,
            "id":1722579,
            "title":"The Stinky Beginning"
        }
    },
    "info":{
        "author_id":"kentasmeller",
        "author_name":"The Stink Sniffer",
        "brief_description":"Pretty much just a Parody of the walking dead, with stink instead of bite. ",
        "created":1383831720,
        "description":"<td align=\"left\" class=\"norm\">You are somehow caught, in this stinky apocalypse where these Zombies aren't walkers but stinkers they have no interest in feeding until their bellies a full or clawing someone's stomach into pieces, their interesting in torturing you with their stink, farting up your nose until your lungs are filled with foul dead gas, or making you sniff their body odour until you suffocate to death, and turn you into one of their own, can you fun other survivors and stay alive long enough to find hope in this stinky world or become a Stinker.<br>\r\n<br>\r\nRules: <br>\r\n1. Swearing is allowed<br>\r\n2. There can be a little bit of gore but not much, remember these are stinkers and not walkers so they aren't into much of biting or clawing.<br>\r\n3. Butt vore is allowed, no mouth vote at all.<br>\r\n4. Use a lot of stinks not just farting.<br>\r\n5. The character can die or turn into a stinker (Which also means a chapter game over), but make sure the character is at least 5-7 chapters in before making deaths and give the character options to save his life rather giving him one choose that leads into death.<br>\r\n6. Just like stinky heaven please message me the chapter beforehand so I don't have to hunt down the chapter and have to edit it and delete it.<br>\r\n7. Have a great stinking time.  </td>",
        "id":1961748,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1388997480,
        "modified":1388997480,
        "pretty_title":"The Stinking Dead"
    }
}