{
    "chapters":{
        "1":{
            "author_id":"jawmax",
            "author_name":"Jawmax",
            "choices":[
                "Male",
                "Female",
                "Couple"
            ],
            "content":"<div class=\"\"><div> <span>It is 3246. Cultural differences between men and women have forced them to become to separate and fight each other for rule over the planet. In this war Men capture women to be nothing but wombs while women use men only as sperm banks.<br>\r\n<br>\r\nBut somewhere two young lovers are trying to end the fighting and bring men and women back together.<br>\r\n<br>\r\nSo, what side are you on?</span></div></div>",
            "created":1099371600,
            "id":223704,
            "title":"Decesions"
        },
        "11":{
            "author_id":"jawmax",
            "author_name":"Jawmax",
            "choices":[
                "Normal.",
                "Men are fat.",
                "Women are fat.",
                "Both are fat."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are a male soldier. Now what kind of storyline do you you want?</span></div></span></div>",
            "created":1099371600,
            "id":223706,
            "title":"We are Men!"
        },
        "111":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "You are spotted by a women guard.",
                "Several women and a captured man enter the lab below."
            ],
            "content":"<div class=\"\"><div> <span>You are on a recon patrol deep behind women lines. You are trying to gather info on troop movement and talk of a special weapons lab. You have been out on patrol for a week when you intercept a transmission from the women. You get a bead on the signal and discover the weapons lab.<br>\r\n<br>\r\nYou sneak on to the grounds and get up on the building undiscovered. You gain access to the building a make your way to an overhead access to the main lab. You set up cameras and audio recording equipment.<br>\r\n<br>\r\n.......</span></div></div>",
            "created":1100926800,
            "id":226286,
            "title":"Access to the special weapons lab."
        },
        "1111":{
            "author_name":"dbh",
            "choices":[
                "They take you to the princess",
                "they keep you for their own amusment"
            ],
            "content":"<div class=\"\"><div> <span>you move slowly to avoid being seen, suddenly u step on a twig on the floor. the searchlight instantly points you and u are almost blinded by the light, a female guard, wearing a security uniform, shouts out \"Man in j-20!! u look around, looking for an escape when suddenly u are sent flying 2 the ground. you feel ropes handcuffs clamped around your wrists and ankles and you are hualed up2 your feet. a slim brunette woman in a law enforsment uniform is standing there looking at you, you open your mouth 2 speak but she clamps her hand over your mouth. she smiles at you and moves in, like shes going 2 kiss you but instead she ramms her knee into your crotch. u double over with pain but two other women standing by your side force u back up. the first woman smiles at the others. \"what should we do with him, no one else nos hes here, should we take him the the princess or should we keep him?  </span></div></div>",
            "created":1120539600,
            "id":259752,
            "title":"Spotted"
        },
        "11111":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "I'll keep you as a pet!",
                "I'll throw you in the dungeon!"
            ],
            "content":"<div class=\"\"><div> <span>They take you to the  Princess Tiana! <br>\r\n<br>\r\nThey drag you to her throne room with you kicking and screaming the whole way!<br>\r\n<br>\r\nThey finally dump you before the princess, and you look at her<br>\r\n<br>\r\nShe has wavvy black hair and eyes dark as the ace of spades! \"Well done my subjects.\" She says to the guards \"You may leave now.\"<br>\r\n<br>\r\n<br>\r\nThe guards leave and Tiana looks at you \"What ever will I do with you?\"<br>\r\n  </span></div></div>",
            "created":1190782800,
            "id":447840,
            "title":"The Princess"
        },
        "111111":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Tiana decides to give you a new outfit",
                "You attempt an escape"
            ],
            "content":"<div class=\"\"><div> <span>\"Ah, I'll keep you as a pet. Now won't that be lovely\" Tiana says. Two female guards walk up to you, one holds you down as the other ties a leash onto you. Tiana walks over and takes the leash and ties it onto her throne as she sits back down \"soon all men will be at my knees\" she says to herself. Then...<br>\r\n</span></div></div>",
            "created":1388037120,
            "id":1713572,
            "title":"I'll keep you as a pet!"
        },
        "1111111":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Writer's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tiana looks over at you \"now what could I dress you in to make you really look like mine?\" she says to herself. So she dresses you in...</span></div></span></div>",
            "created":1388037420,
            "id":1713578,
            "title":"Makeover"
        },
        "1111112":{
            "author_id":"justchillen122",
            "author_name":"Brad",
            "choices":[
                "Go for the key",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look up at Tiana and see the key to your collar is hanging out of her cleavage. If you're fast enough you could grab it and make a run for it, or you could try something else.</span></div></span></div>",
            "created":1388037300,
            "id":1713574,
            "title":"You attempt an escape"
        },
        "111112":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "When you wake up",
                "What they do while your asleep"
            ],
            "content":"<div class=\"\"><div> <span>\"Ah, I have the perfect Idea, to the dungeon, well its not really a dungeon more of a... facility\"<br>\r\n<br>\r\nThe guard come back in, grab you and drag you from the room, as you struggle.<br>\r\n<br>\r\nYou wonder what the facility is.<br>\r\n<br>\r\nWhen the guard get to a massive door at the bottom of this place they open it shove you inside and lock it behind you.<br>\r\n<br>\r\nbefore you know it you are grabbed by two different women, they drag you onto something like a hospital bed, one holds you down and the other injects you with something, and you fall asleep</span></div></div>",
            "created":1305954000,
            "id":1110261,
            "title":"I'll throw you in the dungeon!"
        },
        "1111121":{
            "author_id":"spooky1",
            "author_name":"Spooky",
            "choices":[
                "Play along for now",
                "Make a break for it right now!"
            ],
            "content":"<div class=\"\"><div> <span>Tired and groggy you open your eyes, you get jolted awake when you see what they've done to you!<br>\r\n<br>\r\nYou have breasts! you try to feel your crotch but your arms are restrained but you bet they took your penis too.<br>\r\n<br>\r\nAll of a sudden it all makes sense.<br>\r\n<br>\r\nYour government had been wondering how the women were holding their own so well in this war, every battle the women seemed to have overwhelming numbers, it was because of this, every soldier that they didn't kill they'd turn into one of them<br>\r\n<br>\r\nBut it wasn't gonna happen to you, you struggle with your binds hoping to be able to break free.<br>\r\n<br>\r\nThe binds are too strong and before long 3 women come into the room. the smile wickedly at you.<br>\r\n<br>\r\n\"We don't get to many soldiers with as much training as you, you will become a useful asset to us.\"<br>\r\n<br>\r\n\"I'll never join you I'll die first\" you reply<br>\r\n<br>\r\nOh you will, it's not only your body thats been changed you've been infused with hypnotic suggestions. like for instance.  \"Get Dressed\" she commanded as the other two released your binds.<br>\r\n<br>\r\nYou are about to push past and try to escape but something stops you, you need to get dressed, you can't go out naked.<br>\r\n<br>\r\nYou pick up the pile of clothing next to your bed and proceed to put on the panties and bra, then the dress and even the high heels.<br>\r\n<br>\r\nA moment later you realize that they indeed can control you.... what do you do now?</span></div></div>",
            "created":1305954000,
            "id":1110265,
            "title":"When you wake up"
        },
        "11111212":{
            "choices":[
                "Men find you.",
                "Women find you."
            ],
            "content":"<div class=\"\"><div> <span>You quickly flip up the bed onto the 3 women.  While they are struggling you dash for the door, your new breasts bouncing and thrashing every which way.<br>\r\n<br>\r\nYou turn a corner and you see a bright light near the end.  You dash through this corridor, banging through medical stretchers and other sanitary things.<br>\r\n<br>\r\nYou quickly leap through the small opening that is letting the light through and you immediately begin to fall, until you hit the ground, hard.</span></div></div>",
            "created":1308027600,
            "id":1126150,
            "title":"Make a break for it right now!"
        },
        "111112121":{
            "choices":[
                "Bound and gagged, you are brought to the King's chamber",
                "Somehow try to plead your case"
            ],
            "content":"<div class=\"\"><div> <span>You wake up bound.<br>\r\n<br>\r\n\"Help!\"  You scream, but your mouth is gagged also.  <br>\r\n<br>\r\n\"Hey b***.\" You hear a scraggly man say.  \"Hush your cute little mouth!\"<br>\r\n<br>\r\nYou look around.  You are in the male base that is stationed near the male/female border.  You've been here before.  You are chained to a stainless steel table in a completely white room.  Your breasts feel bruised, probably from banging around or maybe from the fall.  But, you can feel your new female genitalia has been bruised too. <br>\r\n<br>\r\nThe men who found you must have taken advantage of your unconscious body.<br>\r\n<br>\r\n\"Some of our men found you on a patrol.  What the hell were you doing in a muddy ditch?\"<br>\r\n<br>\r\nThis was obviously a rhetorical question because you are gagged.<br>\r\n<br>\r\nHe looked over to what was obviously a one-way window and said, \"Well boys this one's a cute little one isn't she?  I think we found ourselves the new courtesan for the King!\"</span></div></div>",
            "created":1308027600,
            "id":1126176,
            "title":"Men find you."
        },
        "1111121211":{
            "choices":[
                "You wake up",
                "You wake up, pregnant"
            ],
            "content":"<div class=\"\"><div> <span>You are pushed by a nurse, (also a slave) through a room where she stands behind a shield and presses a button.  Instantly in a stream of energy, all of your bruises and wounds are healed.<br>\r\n<br>\r\n\"How does it feel to be a virgin again?\"  She smiles.  You simply stare at your perfectly perky breasts in horror.<br>\r\n**************************************************************************** *************<br>\r\nStill naked, you are wheeled to a chamber lit only by torches.  It looks like a room in a stone castle.  You then realize, this is the King's private chamber.  The nurse unbinds and un-gags you and throws you to the hard, stone floor.  \"Have a ball, missy.\"  She smiles as you lay there.  She clangs the large door shut, and you are all alone.<br>\r\n<br>\r\nAnother door opens on the other side of the room from which you can hear thunderous applause before the door slams shut.  You hear a man's footseps come closer as you wait in horror.<br>\r\n<br>\r\n\"Ah!  I see, my new chamber maid!\"  You heard a deep voice ring.  It was the King of All Men.  You want to stand and salute, but in your present form you know you must kneel.  <br>\r\n<br>\r\n\"The most beautiful I have seen!  You look like the one that I want to bear my children!\"  <br>\r\n<br>\r\nYour heart jumps.  What did he just say?<br>\r\n<br>\r\n\"Don't be shy young lady, what is your name?\"<br>\r\n\"Uh...uh...\"  You hear your female voice for the first time.<br>\r\n\"Ah!  Laura it is!  I will send for some rags for you to cover up.  I see that you are very well endowed.\"<br>\r\n<br>\r\nYour face turns red.<br>\r\n<br>\r\n\"Why are you embarrassed?  Your body is beautiful!  Truly a gift to me!  Please come to bed, I just gave a tiring speech to the men of this land.<br>\r\n<br>\r\nStill possessing that hypnotic submissiveness that was implanted in your brain by the Women, you climb in bed with the King and you engage in intercourse.</span></div></div>",
            "created":1308027600,
            "id":1126196,
            "title":"Bound and gagged, you are brought to the King..."
        },
        "11111212112":{
            "choices":[
                "Fast forward 9 months",
                "The next day (who wants to do the long story through those months?)"
            ],
            "content":"<div class=\"\"><div> <span>You wake up with a doctor sticking a probe in your new crotch.<br>\r\n<br>\r\n\"Yes, it is confirmed.  The girl is pregnant with a male.  Congratulations my King, you now have a successor.\"<br>\r\n<br>\r\nYou were instantly brought flowers, piping hot breakfast, and beautiful silk robes.<br>\r\n<br>\r\n\"Thank you fair Laura!  I have had trouble with other women when it came to having children.  You are a gift from heaven!\"<br>\r\n<br>\r\n\"Oh no.  This can't be happening.  I'm a man!\"  You thought to yourself.<br>\r\n<br>\r\nYou rose out of the bread only to feel the bizarre rippling weight of your enormous breasts, which could barely be contained in the silk robe.  You definitely felt pregnant, there was an odd stirring deep inside you.  You stood out on the balcony above what looked like a million cheering men.<br>\r\n<br>\r\nYou, now a woman, where the future of the male race.</span></div></div>",
            "created":1308027600,
            "id":1126202,
            "title":"You wake up, pregnant"
        },
        "111112121121":{
            "choices":[
                "You are transported to the Land of Women",
                "You find a way to escape"
            ],
            "content":"<div class=\"\"><div> <span>For 9 months many attacks were made on the King's Castle by the Women.  All were able to be fought off and you remained safe.  All this time, female hormones began to change who you were, you began to accept being a woman.  Once the King's son was born, John, you insisted that you breast feed him yourself.  When John was at an age where he no longer needed you, the King sat down with you.<br>\r\n<br>\r\n\"Laura, the time has come when you can no longer be with me.  I have arranged your safe return to the Land of Women.  Both sides have agreed not to shoot down the helicopter, and that you will be able to assimilate safely into society there once again.\"<br>\r\n<br>\r\n\"No my King, please, turn me into a man!\"  You plead.<br>\r\n<br>\r\n\"Laura, I will do nothing of the sorts.  You are too beautiful to tarnish.  You were born a woman, and you shall stay a woman!\"<br>\r\n<br>\r\n\"No!\"  You yell as you are dragged out of the chamber by guards.</span></div></div>",
            "created":1308027600,
            "id":1126213,
            "title":"Fast forward 9 months"
        },
        "1111121211211":{
            "choices":[
                "When you wake up",
                "While you are blacked out"
            ],
            "content":"<div class=\"\"><div> <span>It is pouring rain.  As you get off the transport helicopter, the rain drenches your simple T-Shirt, revealing your breasts.  A group of female guards grab you and begin to bring you inside.  Once the door is closed, you are struck over the head and you black out.</span></div></div>",
            "created":1308027600,
            "id":1126214,
            "title":"You are transported to the Land of Women"
        },
        "11111212112111":{
            "choices":[
                "You are brought to the chamber",
                "Refuse"
            ],
            "content":"<div class=\"\"><div> <span>You slowly come to.  You are in a room similar to the one you woke up in the first time you arrived at the King's castle.<br>\r\n<br>\r\nYou open your eyes to the site of an incredibly sexy young woman, naked.  You feel your penis slowly shoot up.<br>\r\n<br>\r\n\"Wait, my....\"  You throw down your hands to feel that you have reclaimed your male body.  <br>\r\n<br>\r\n\"It works!  The surgery was a success!  Wheel her away!\"  You heard a woman yell.  The young woman who was naked was dragged away, screaming.<br>\r\n<br>\r\n\"Okay miss!  Do you miss your breasts yet?  Well, too bad!  We heard that you were able to carry a son for the King of Men!  Well guess what?  You are going to impregnate our fair Princess!\"<br>\r\n<br>\r\nWas this a dream?<br>\r\n<br>\r\nYou are covered up and then thrown through a small opening.  You tumble down what seems to be a chute until you fall to a hard floor.  You look up. You are in the throne room of the Princess of Women!<br>\r\n<br>\r\n\"Rise, boy!  Come here!\"  The princess commands.  \"I don't care if you were a woman before!  Now you are a man!  The lowest of the low!  I want your seed!  I cannot become pregnant!  Tonight you will lay with me in my chamber, and I had better conceive a girl!\"</span></div></div>",
            "created":1308027600,
            "id":1126221,
            "title":"When you wake up"
        },
        "111112121121111":{
            "choices":[
                "She wakes up pregnant",
                "She is not pregnant"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The princess strides into the chamber in a flowing gown.  It shows off her curves perfectly.  She grabs your shirt and brings you to her bed.  You lay with her passionately.</span></div></span></div>",
            "created":1308027600,
            "id":1126224,
            "title":"You are brought to the chamber"
        },
        "1111121211211111":{
            "choices":[
                "You wake up",
                "While you are blacked out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You watch as the doctor uses a similar procedure to check for pregnancy.<br>\r\n<br>\r\n\"My Princess, it worked.  You are bearing a girl.\"  The doctor says<br>\r\n<br>\r\nImmediately, you are knocked out.</span></div></span></div>",
            "created":1308027600,
            "id":1126228,
            "title":"She wakes up pregnant"
        },
        "11111212112112":{
            "author_id":"stabatron",
            "author_name":"Woogie, Destroyer of Worlds",
            "choices":[
                "Fast Forward 9 months...",
                "Something happens six months later..."
            ],
            "content":"<div class=\"\"><div> <span>You flutter in and out of consciousness, but one of the times, you hear one woman say, \"Since the subject was able to have live birth, the female conversion portion of the formula is a complete success then. Test the other half of the formula now. If she bears another child this time, then this war is as good as over.\"<br>\r\n<br>\r\nYou wake up in a palatial bedroom, but found your hands shackled. \"I see you're awake.\" You look around, and in the corner in a shadow was the Princess, the daughter of the ruler of all women, along with two other women who were quietly giggling. Only her face and medium length brunette hair was illuminated by the lamps in the room. \"You may be wondering what is happening to you... Well, see, we women have been working on genetic weapons to alter the physical structure. You've already encountered our prototype female conversion virus. However, turning all men into women would doom the human race in general, so my mother came up with a far more clever plan.\" She steps out of the shadows to reveal her nude form, but what was mind-blowing was right above her vagina, she was sporting an 11\" erect penis all her own. \"Come on out, girls.\" she motioned to the other women. They walked out, their visage the definition of bimbo; long blonde hair, giant breasts, large hips, plump rears, but they had their own penises as well, and you noticed they seemed to be covered in sexual fluids. \"These two were our first two test subjects. They were traitors that were selling other women to the men as part of a larger black market operation. As you see, it worked, but it devolved their minds into nothing more than total sluts. The 'bimboifcation' was a nasty side effect we've manage to get rid of, though. Now it's so safe for women I even volunteered for the procedure. However, another side effect this new virus gives us, we plan on totally exploiting.\" The three futa women swarm around you.<br>\r\n<br>\r\n\"Wha... What are you...\" Before you can finish, the princess enters you, while the other two women take your anus and mouth. They have their way with you, but what disturbs you the most is when the princess finishes, a strange stirring rumbles in your loins, then suddenly, for the first time in years, you had a penis again!! The princess then looked at it, and mounted your newly reborn unit.<br>\r\n<br>\r\nThree weeks later, in a cold lab, a scientist says, \"Yep, you're pregnant, as is the princess.\"</span></div></div>",
            "created":1322895060,
            "id":1233666,
            "title":"While you are blacked out"
        },
        "1111122":{
            "choices":[
                "You wake up"
            ],
            "content":"<div class=\"\"><div> <span>\"Becky don't you understand?  This is our chance!\"<br>\r\n<br>\r\n\"To do what?\"<br>\r\n<br>\r\n\"To start the rebellion!  Once we're through with the sex change procedure, We convince this guy- er, okay, when you made that last cut I guess we should call him a \"she\" now.  Anyway, we convince her to help us start the rebellion!\"<br>\r\n<br>\r\n\"Okay, okay.  But first, what size tits should I give him?  I'm about to put in the implants.\"<br>\r\n<br>\r\n\"Eh, give him some big ole DD's.  He's probably been fantasizing about them his whole life!\"<br>\r\n<br>\r\n\"Okay, they're in.  I sure made one sexy woman!\"</span></div></div>",
            "created":1308114000,
            "id":1126272,
            "title":"What they do while your asleep"
        },
        "11112":{
            "choices":[
                "Foursome orgy",
                "four way blowjob"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Let's keep him *says the blonde on your left* where should we start then? *said the brunette*</span></div></span></div>",
            "created":1372875720,
            "id":1621993,
            "title":"they keep you for their own amusment"
        },
        "1112":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "Fires.",
                "You are spoted by a guard."
            ],
            "content":"<div class=\"\"><div> <span>Several women scientist walk in and behind them 4 guards holding a male prisoner. The guards place him in a large cage, in the middle of the lab. They lock it and stand in the background. One of the women in a lab coat starts addressing them all. \"With our new weapon we will turn the tide of the war to our favor.\" You see here hold up a strange looking rifle. It has a large barrel with a glowing green tip. \"I will now demonstrate the power of the weapon on our prisoner.\" She finishes pointing the weapon at the man in the cage. <br>\r\n<br>\r\nYou see the man stand up and spit at the women. She smiles and........</span></div></div>",
            "created":1100926800,
            "id":226290,
            "title":"Caged male"
        },
        "11121":{
            "author_name":"Diogenes",
            "choices":[
                "Lock and Load"
            ],
            "content":"<div class=\"\"><div> <span>A green jet of light blows out of the barrel of the strange looking weapon.  \"AAAAAGH!\" The prisoner writhes and screams a scream conjured from the primitive times of purest feelings.  The feeling emanating from the scream:  agony.  You wince as the scream grows louder and louder.  Finally, mercifully, the man dies.  His corpse collapses on the floor with a loud plunk.   <br>\r\n<br>\r\nYou realize you only have one choice in front of you.  You WILL take this evil place out.  </span></div></div>",
            "created":1101790800,
            "id":227600,
            "title":"Death of a brave man"
        },
        "111211":{
            "author_name":"Diogenes",
            "choices":[
                "You get back to your lines",
                "You are captured"
            ],
            "content":"<div class=\"\"><div> <span>You realize that you can not destroy the weapons lab by yourself, especially not with a depleted week's worth of supplies.  You mark the coordinates to the lab on your map, then start sneaking away.  You have to get re-enforcements.  Commandos, perhaps?  </span></div></div>",
            "created":1101790800,
            "id":227601,
            "title":"Reenforcements"
        },
        "1112111":{
            "choices":[
                "You find him immediately",
                "You have to look around"
            ],
            "content":"<div class=\"\"><div> <span>You dash back behind a rock.  It looks like you are going to have to use the new technology that the Men have developed.<br>\r\n<br>\r\nYou press a button on your watch, and instantly you have the appearance of a young woman.  You quick give one of your breasts a grab and you smile before heading towards the compound.<br>\r\n<br>\r\n\"What have you been doing out there, girl?\"  You couldn't think of a response, obviously a chick wouldn't be taking a piss.<br>\r\n<br>\r\n\"I got lost ma'am.\"  You squeak back with your new feminine voice.<br>\r\n<br>\r\n\"Lost?  You are a disgrace to the gender, private!\"<br>\r\n<br>\r\nAs you walk through the door you get slapped on the butt and the women laugh.<br>\r\n<br>\r\nTime to find that other guy.</span></div></div>",
            "created":1308027600,
            "id":1126256,
            "title":"You get back to your lines"
        },
        "1112112":{
            "author_name":"Diogenes",
            "choices":[
                "Surrender",
                "Keep trying to escape"
            ],
            "content":"<div class=\"\"><div> <span>You get all the way back to the outside, when suddenly you hear loud noises behind you.  It is gunfire.  No matter how often you are exposed to it, you can never quite make yourself not worry about it, the way some of the guys do.  You start to run.  Then you fall.  You look down and realize you have been shot in the leg.  You're losing blood fast.  As you try to crawl, you feel cold steel pressed against the back of your head, and a soft, high pitched voice, filled with hatred.  <br>\r\n<br>\r\n\"MAN!\" </span></div></div>",
            "created":1101877200,
            "id":227602,
            "title":"Shot"
        },
        "11121122":{
            "author_id":"crowman1993",
            "author_name":"raven",
            "choices":[
                "you cross no harm",
                "you encounter flak from intercepting AA-machine guns"
            ],
            "content":"<div class=\"\"><div> <span>with your good leg you quickly yell \"THIS IS SPARTA!\" and knock the gun away, jump, land on your good foot and karate chope her agianst the neck then do a jump, kick, kick, punch to her abdomen and you slowly take her gun and hold her as a sheild you on one leg hop away and the gunfight continues for a few minutes when they lose you yoou make it a few miles from that spot and call a chopper. now you tear part of her uniform off to make a bandadge for your leg after digging out the bullet and throwing at the guard hard then you break both her legs in revenge kick her in the gut seven time and spit on her then you wake her up after gaging her the chopper appears and your going across the border!</span></div></div>",
            "created":1264222800,
            "id":824510,
            "title":"Keep trying to escape"
        },
        "111211221":{
            "choices":[
                "You are sniped",
                "You start the siege"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You get back to the closest male base and you get medical treatment. The commanding officer comes in and tells you that you are going to lead the assult on the lab. He gives you a M16 and before you know it you are one mile from the female base.</span></div></span></div>",
            "created":1325481660,
            "id":1250918,
            "title":"you cross no harm"
        },
        "11122":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "You have tits and the are growing.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>You try and move into a better position to get it on video. A tall big breasted blond yells,  \"Up in the walk way a male spy!\" SHIT! You grab your gear and start to make an exit. You look down and back at the women in time to see the scientist aim and fire the weapon at you.<br>\r\n<br>\r\nA warm light hits you and you feel a quick ill panic take you over. You make it out of the lab and get down the building in record time. You make it out of the compound and start heading east back to your pick up area, for extraction. You hear the alarms and lab in a bustle as they scramble to locate you. You make it several miles and stop for a break. You are out of breath and you find this quiet odd. You are in top physical shape, hell you ran a marathon last year in under 3 hours. You lean against a tree and you feel weak and fall to one knee. That ray gun those bitches shot me with must be having an...affect.. on... What the hell!<br>\r\n<br>\r\nYou look down at your body and you have gained about 50 lbs. Your cammies are tighter on you and you unbutton the top and you see your belly poking out, but that is not what shocks you the most........</span></div></div>",
            "created":1101013200,
            "id":226346,
            "title":"Shot and on the run."
        },
        "111221":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "Head on to the pick up spot so you can get out.",
                "You here some women coming."
            ],
            "content":"<div class=\"\"><div> <span>You have tits! They are small a cup, but they are there with nipples the size of pencil erasers. What the hell did those women do to me, you think to yourself. You take a quick overview of yourself. The 50 lbs you have gained (U guess) is spread all through out your body. You can tell your legs are fatter along with a bit on your hips, but a good chunk is now on your ass. Your cammie pants are very tight there. <br>\r\n<br>\r\nYou......</span></div></div>",
            "created":1101013200,
            "id":226357,
            "title":"Yup you got tits...."
        },
        "1112211":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "The men point the guns at you as you ruyn up to the chopper.",
                "Women spring and ambush on your extraction."
            ],
            "content":"<div class=\"\"><div> <span>You get yourself together and catch your breath. You got about 2 miles togo to the pick up spot where the helo will be. Those 2 mile are a killer on you. Huffing and puffing as you get to the spot, you are early the helo will be here in 15 minutes you guess. It felt as if your cloths were getting tighter. You get behind some bushes and wait for the helo to land in the clearing. You notice you have gained more fat on your body (20 more lbs), but not on belly. The fat has gone to your tits, which are now C-cup. Also your hips, legs and ass have all gained. Your cammie bottoms are getting quiet snug on you. You are also starving. You have a weeks supply on rations left on you so you break one out and eat it. With out thinking you break out the rest and proceed to pig out. You smile a little to yourself. You feel good from the pig out.<br>\r\n<br>\r\nYou see the helo and it lands you run out to it and...........</span></div></div>",
            "created":1101013200,
            "id":226361,
            "title":"More weight gain and the helo."
        },
        "11122111":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "Scream (in a higher voice).",
                "Don't notice a thing (Has the ray affected your mind)."
            ],
            "content":"<div class=\"\"><div> <span>The crew on the helo all point their guns at you. You freeze about 10 feet in front of the helo. Then one of them yells, \"Eric!? What the hell!\" He waves you in and you get on the chopper. It takes off and you say, \"The women have a new weapon. It did this to me!\" The helo lands at the base and you all get out of the chopper. You head into the barracks to shower and change for debrief. You take off your cammies and grab your shower bag. There is no one else in the barracks at this time. You walk into the shower room, put your stuff down and look in the mirror.<br>\r\n<br>\r\nYou........</span></div></div>",
            "created":1101013200,
            "id":226363,
            "title":"Back at base."
        },
        "111221111":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "Get off the scale...Shower and change for debreif.",
                "Your mind is starting to cloud over....Strange thoughts...."
            ],
            "content":"<div class=\"\"><div> <span>\"AHHHHHHH!\" You scream in a higher octave. Your face! It has no stubble from your beard and it is a lot softer. Your hair is another thing it is longer a lot longer, you didn't notice. Geez no wonder the were staring at you. You had a high in tight before now it has grown down past your ears and is getting closer to your neck. You look at your face closer and notice your lips are thicker, eye lashes fuller, eye brows look trimmed even. All male features are almost gone. Your face is now quiet feminine. <br>\r\n<br>\r\nYou step back and look at your naked body in the mirror. Your hips are wide (42 inches). You turn and see your ass. It is huge! It is like a shelve, jutting out several inches thick and smooth. You legs, along with your body is hairless. Your legs look thick indeed. No muscle tone is left. You look at your tits and they are bigger (38 D-cup). You look at your belly and it is a little pot but none bigger than before (38 inches). You go to touch your face and see your hands look dainty, fingers thin and your nails are 3 inches long and red. <br>\r\n<br>\r\nYou see a scale to your right you get on it. Your weight before the mission was 170, at 5'9\", it reads 240...241...242.......245...<br>\r\n<br>\r\n<br>\r\nYou....</span></div></div>",
            "created":1101013200,
            "id":226366,
            "title":"The mirror and you."
        },
        "1112211111":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "There is so much junk food. You begin to pig out.",
                "Your head clouds and you walk off."
            ],
            "content":"<div class=\"\"><div> <span>You shower and head to your locker. You try to put on your uniform but there is no way it is getting on over those hips of yours (48 inches). You pull out your sweats. You put them on and they are tight but they fit. You look in the mirror, your hips and ass are just huge you wiggle a little and they shake. Your tits are getting a lot bigger as well (48 E). The nipples are the size of quarters and 2 inches long poking out of your sweat shirt. Your hair is now down to your shoulders , blond and curly.<br>\r\n<br>\r\nYou head to the debrief and the commander says, \"What in gods green earth happened to you son!?\" You hand the video of the mission to him and say, \"It is all there sir. The women have a new weapon. It is or does change men to this. I am still growing too.\" The commander says, \"Go see doc and find out if we can do anything about this. We will look into this new weapon. Maybe we can do something back on them.\"<br>\r\n<br>\r\nYou go see medical and the run a number of tests on you. The doctor comes in and says, \"Well you are healthy as you were before you left. In fact healthier. But your body is changing in strange new ways you are becoming more XY or women, but is a weird hybrid. We will keep and eye on you for a couple of days here in the ward.\" You are twisting your hair, which is now down to the middle of your back, you say (In a feminine voice), \"Can I get some food I am starving doc? Oh and some new cloths too?\"<br>\r\n<br>\r\nThe doc gets some women clothing the had from some captured females. He hands you a bag of cloths. \"Here this is all we have. Some of the women were large like you are becoming. Oh the kitchen is closed but the junk food pantry was opened for you.\" He walks off and you sift through the bag. You pull out some black stretch pants and a white baggy t-shirt with some red flowers around the sleeves. You put it on and walk to the pantry for the junk food.<br>\r\n<br>\r\nYou........</span></div></div>",
            "created":1101013200,
            "id":226372,
            "title":"To the pantry."
        },
        "11122111111":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "You grab him and.....",
                "Go with him."
            ],
            "content":"<div class=\"\"><div> <span>You see all kinds of chocolate and fattening treats. You dig in at a fast pace. You lose track of time as you pig out. You grow fatter as your eat. Your ass and hips grow to 60 inches, belly to 45 inches and your tits are now 70 FFF. You have a double chin and fat arms(weight 300 lbs) . You stop eating because some one walks up behind you. You get up and turn around, it is doc. He says, \"OH my Eric. It is worse then I thought. You need help right now come with me.\"<br>\r\n<br>\r\nYou.........</span></div></div>",
            "created":1101013200,
            "id":226373,
            "title":"Bigger you."
        },
        "111221111111":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "Get up and waddle to the command center.",
                "You help Doc."
            ],
            "content":"<div class=\"\"><div> <span>Your mind clouds and you grab Doc. \"What the hell is wrong with you Eric! Let me go.\" Doc says. You smile and fart loudly. Doc's face twists as he breaths it in. You let go of him and he falls to the ground coughing. You sit back down and continue to pig out on junk food. Doc stands up and goes to run away, but he stops and looks at his uniform. It is getting tighter. His belly pushes out and keeps growing. His whole body is fattening up from the fart. 220...250...300....350.....450...and to 500 lbs. He falls onto his fat ass babbling like an idiot. All his cloths are off his body, ripped to shreds.<br>\r\n<br>\r\nYou.......</span></div></div>",
            "created":1101013200,
            "id":226375,
            "title":"The farts fatten men."
        },
        "111221111112":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "Wake up and you are so blindingly hungry.",
                "Wake up and the lab is a wreck and no one is around (except you). lol."
            ],
            "content":"<div class=\"\"><div> <span>\"OK doc. I can't help eating so much I am so hungry.\" You say as you struggle to get up. You stand and the cloths you put on that were baggy are now tight on you. You belly is hanging out and down over your stretch pants and the baggy t-shirt is skin tight. Your boobs are like giant watermelons now. You waddle behind doc to the lab.<br>\r\n<br>\r\nHe has you lay down on the table and gives you a shot. \"Here this will help you sleep and give me time to find out what the women did to your body.\"<br>\r\n<br>\r\nYou fall asleep.......</span></div></div>",
            "created":1101531600,
            "id":227183,
            "title":"Sleep and...."
        },
        "111222":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "break into a bakery.",
                "eat all your MREs ( weeks supply)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You ass is huge too. What was that ray that hit you? You think. You are also starving, you can't think striaght. You ........</span></div></span></div>",
            "created":1101790800,
            "id":227588,
            "title":"A big ass too."
        },
        "1112221":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "Try to contact your extraction team.",
                "You hear the front door open."
            ],
            "content":"<div class=\"\"><div> <span>There is a bakery across the street that is closed. You break in the back door and start looking around for food. You find a pantry full of cookies, brownies and various other sweets. Your mouth drools as you stare at it all.<br>\r\n<br>\r\nYou dig in and lose all track of time as you binge on the sweets. You snap out of it as you finish the last of the snickerdoodles. You notice that your camie pants are shreaded and laying around you. Your lower body is even fatter. You ass is massive at least 60 inches around. You camie top is poking out on your chest. You pull it off and see your t-shirt is sticking out quiet far. You have tits and good sized ones. <br>\r\n<br>\r\n\"What the fuck did those women shot me with? I am getting fat like a women.\" You say.<br>\r\n<br>\r\nYou look around for some cloths to wear and find some baker cloths. They are womens and they must be a really fat womens cloths cause they are huge. The pants are very baggy on you, even for you ass (60 inches) and a blouse too. <br>\r\n<br>\r\nYou.....</span></div></div>",
            "created":1172898000,
            "id":386448,
            "title":"Bakers dozen?"
        },
        "112":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Just a little, unless they want otherwise ",
                "As big as they can get!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>OK, Men are fat, but how much?</span></div></span></div>",
            "created":1252645200,
            "id":758899,
            "title":"Men are fat."
        },
        "1121":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "You panic",
                "You open fire",
                "You retreat"
            ],
            "content":"<div class=\"\"><div> <span>Men, are slightly pudgy these days, they mostly get fatter as they get older<br>\r\n<br>\r\nYou are a youngster with a slight pot belly, you venture on your quest behind woman lines<br>\r\n<br>\r\nYou spy some woman in the distance, women these days are extremly lean and athletic, you sneer at them.<br>\r\n<br>\r\nYou make your way over and between the the trenches hoping to find the Women's hidden fortress<br>\r\n<br>\r\nAlong the way you start to feel tired, your extra weight beginning to weigh you down.<br>\r\n<br>\r\nYou see the two women you were following they are a lot closer now...And heading towards you!</span></div></div>",
            "created":1252645200,
            "id":758900,
            "title":"Begining"
        },
        "1122":{
            "author_id":"wgwriter",
            "author_name":"WGwriter",
            "choices":[
                "as big as a mansion",
                "as big as an elephant"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>now, how big can they get?</span></div></span></div>",
            "created":1312704480,
            "id":1163094,
            "title":"As big as they can get!"
        },
        "113":{
            "choices":[
                "You wake up.",
                "You sleep some more."
            ],
            "content":"<div class=\"\"><div> <span>So in this story, most of the women in here will be fat, and they have lost their morals of beauty.<br>\r\n<br>\r\nThe dumb women think that with no need really to attract men, why be pretty?<br>\r\n<br>\r\nIf they want to have some fun, all they do is capture some men, and that's all...<br>\r\n<br>\r\nThese ugly women love being fat. All eating whatever, and whenever they want, they are with no fear of rejection of their body size, and how unhealthy they are.<br>\r\n<br>\r\nThey are just enjoying life-- that's what they think. <br>\r\n<br>\r\nHeh, and they do not know how it is to be a man! We are the most civilized-- the gender of male.<br>\r\n<br>\r\nSo how does this story start off?</span></div></div>",
            "created":1101013200,
            "id":226389,
            "title":"In This Story"
        },
        "1131":{
            "choices":[
                "a girl now",
                "sleep on"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you have changed into a girl</span></div></span></div>",
            "created":1115960400,
            "id":250143,
            "title":"changes"
        },
        "11311":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Overweight",
                "not"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>are you a fat woman or not?</span></div></span></div>",
            "created":1191387600,
            "id":450117,
            "title":"Large Marge"
        },
        "113111":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are fat! You are one of the fat ugly women you hate so much!<br>\r\n<br>\r\nYou have a big belly and a humoungus ass!<br>\r\n<br>\r\nAre you hungry?</span></div></span></div>",
            "created":1195621200,
            "id":467063,
            "title":"Oh No!"
        },
        "1132":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "You rush over to headquarters",
                "a woman burts in"
            ],
            "content":"<div class=\"\"><div> <span>You sleep some more, untill your roomate, wakes you up.<br>\r\n<br>\r\n<br>\r\n\"You really need to stop sleeping in.\" He says with a frown<br>\r\n<br>\r\n\"I need my beauty sleep.\" You yawn<br>\r\n<br>\r\n\"You stupid.... The male headquarters is under attack by women!\" he yells<br>\r\n<br>\r\n\"What?!\" You scream</span></div></div>",
            "created":1191387600,
            "id":450059,
            "title":"Sleeping in is bad"
        },
        "114":{
            "choices":[
                "You wake up.",
                "You decide to sleep some more."
            ],
            "content":"<div class=\"\"><div> <span>Both of the genders are very much fat, in an era which strangely believes what body size you are does not matter, and so many inhabitants of the male, and female population are BIG...<br>\r\n<br>\r\nNo one really cares about dieting these days in which we are talking about.<br>\r\n<br>\r\nWalking down the street, basically you can see obese people, and those who have a slim figure nowadays get strange looks from others who believe larger IS better...<br>\r\n<br>\r\nSo, anyways, your name is Nimon, which is quite a popular name during the years of 3000.<br>\r\n<br>\r\nName choices have evolved over the eventful years, and once common names such as Kenny, Harry, and Ed have turned exceedingly unfashionable.<br>\r\n<br>\r\nSo how does the story start off?</span></div></div>",
            "created":1101013200,
            "id":226391,
            "title":"Genders"
        },
        "12":{
            "author_id":"jawmax",
            "author_name":"Jawmax",
            "choices":[
                "Normal",
                "Women are fat.",
                "Men are fat.",
                "Both are fat."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are an amazon soldier. What kind of storyline do you want?</span></div></span></div>",
            "created":1099371600,
            "id":223708,
            "title":"Girl Power!"
        },
        "121":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Squirrel has become obese",
                "Squirrel is now pregnant",
                "Squirrel is now a real Squirrel!"
            ],
            "content":"<div class=\"\"><div> <span>You are a 21 year old Blonde named Cassie Evans but your code name is 'Rabbit'<br>\r\n<br>\r\nYour lab is in a secret base in the Yucatan Peninsula deep within humid forests and murky swamps, every woman here has a code name after some kind of animal some of them very fitting of the warriors, some of them an embarrassment like yours.<br>\r\n<br>\r\nIt gets worse, Every agent has to wear a skin tight latex animal costume that resembles your code name, the suits are very realistic, the the muzzles even move realistically to your speech and everything, making you and your comrades resemble a twenty first century phenomena known as the 'furry fandom'<br>\r\n<br>\r\nYou sneak into an underground lair that belongs the Men Rebels, your assignment is to find out what happened to an agent who went missing several days ago.<br>\r\n<br>\r\nThe room is pitch black, but your suit allows a heightened sense of smell while your wearing it, so you know someone is in here.<br>\r\n<br>\r\n\"Agent Squirrel.\" You whisper \"I'm here for you Squirrel, It's me! Rabbit!\"<br>\r\n<br>\r\n\"Rabbit!\" Come Squirrel's voice \"Don't come any closer...I'm not myself.\"<br>\r\n<br>\r\nYou take a match and ignite it, you see Agent Squirrel in a cage by herself, but something is different<br>\r\n  </span></div></div>",
            "created":1308978000,
            "id":1134693,
            "title":"Amazon Beauty"
        },
        "1213":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "The Men Arrive",
                "You bust Agent Squirrel out",
                "You decide to look for Agent Wolf"
            ],
            "content":"<div class=\"\"><div> <span>You can see now Agent Squirrel has become a real squirrel, she is now fused with her costume!<br>\r\n<br>\r\n\"Squirrel!\" You exclaim \"What happened?\"<br>\r\n<br>\r\n\"I don't know!\" She says panicking \"I was captured by the men a few days ago, they said they had 'something special' planned for us women who dress up like animals!\"<br>\r\n<br>\r\n\"How did they...\" You begin to ask<br>\r\n<br>\r\n\"They put me in this cage and fed me for three days.\" Squirrel says \"All that time I couldn't get out of my costume because it was the only thing protecting me from their lecherousness advances.\"<br>\r\n<br>\r\n\"Let me guess...\" You say \"They put something in the food that made you the way you are now?\"<br>\r\n<br>\r\n\"Yes...\" Squirrel says \"But I'm not the first one...Remember Agent Wolf the lieutenant who we all thought was dead? Well it turns out she's alive and they did the same thing to her and now she's pregnant!\"<br>\r\n<br>\r\nYou gasp \"What kind of children will be born of such a union?\" You ask  <br>\r\n<br>\r\n<br>\r\n </span></div></div>",
            "created":1308978000,
            "id":1134698,
            "title":"Squirrel is now a real Squirrel!"
        },
        "12131":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "You get fat",
                "You turn into a rabbit-woman"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly the men arrive, each are wearing animal costumes that are just like the kind you women wear, only their's is designed to fit their muscular manly physiques.<br>\r\n<br>\r\n\"Oh you men!\" You say angrily \"I knew you'd steal our idea and use it for your own!\"<br>\r\n<br>\r\n\"All is fair in love and war.\" Says a burly male in a wolf suit \"But to be honest these aren't costumes, Oh they used to be, but now they are our real skin\"<br>\r\n<br>\r\nHe looks at Agent Squirrel in her cage and sneers<br>\r\n<br>\r\n\"Your little squirrel never saw it coming.\" He says chuckling \"She ate all the food we gave her grateful that we were not planning to starve her into submission claiming it was the best food she had eaten in a while.\"<br>\r\n<br>\r\nThe other beastly men snicker<br>\r\n<br>\r\n\"I'm not afraid of you you arrogant bullies!\" You start to say, but a Man wearing Grizzly Bear skin forces something into your mouth<br>\r\n<br>\r\n\"Don't be afraid\" The Bear laughs \"Have a cookie!\" You know this is the food that transformed Agent Squirrel into what she is now, you try to resist but a thousand flavors flood your mouth, ginger and cinnamon, the cookie goes down your throat and something happens...   </span></div></div>",
            "created":1309052760,
            "id":1134706,
            "title":"The Plan Revealed"
        },
        "121312":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "WHAT???!"
            ],
            "content":"<div class=\"\"><div> <span>After several grisly changes and a few moments of pain, you are now a complete furry, there is no separation from your costume and you you are completely a bunny!<br>\r\n<br>\r\n\"Throw in the cage with the other one!\" Says the Wolf who is apparently the leader \"They can keep each other company while we prepare the wedding bed!\"<br>\r\n<br>\r\nYou are tossed into the cage with Agent Squirrel. The Grizzly Bear fills the through with all kinds of food.<br>\r\n<br>\r\n\"See you dames later!\" Says the Bear \"Enjoy your meal!\"<br>\r\n<br>\r\nYou can't believe what has just happened, Squirrel eagerly helps herself to the food<br>\r\n<br>\r\n\"You shouldn't eat that stuff.\" You grumble \"It might make you fat.\"<br>\r\n<br>\r\n\"Squirrel wipes crumbs off her mouth \"I'm already an animal.\" She says \"The deed is done the food can't hurt me now...and I'm pregnant..\"</span></div></div>",
            "created":1309053120,
            "id":1134709,
            "title":"You turn into a rabbit-woman"
        },
        "122":{
            "author_name":"Oni",
            "choices":[
                "they are just a bit unless they want otherwise. (Which does happen)",
                "As big as they can get!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So.... Woman are fat. How fat are they?</span></div></span></div>",
            "created":1100494800,
            "id":225461,
            "title":"Woman are fat, but by how much?"
        },
        "1221":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Sleep some more",
                "Wake UP!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Women are only just a bit fat, Nowadays woman look like there always pregnant!<br>\r\n<br>\r\n<br>\r\nYou are amoung the the big belly club but you often consider getting bigger<br>\r\n<br>\r\nHow do you start the day </span></div></span></div>",
            "created":1190955600,
            "id":448413,
            "title":"Just a little bit"
        },
        "12212":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Spy on men",
                "Work on secret weapon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This is a war right? You can't afford to sleep in so you get up.<br>\r\n<br>\r\nYou receive your mission<br>\r\n<br>\r\nIt is....</span></div></span></div>",
            "created":1190955600,
            "id":448441,
            "title":"Wake up"
        },
        "1222":{
            "choices":[
                "Orange",
                "Light orange"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So women are as fat as they can get. What color is the sky?</span></div></span></div>",
            "created":1115442000,
            "id":249011,
            "title":"Decisions, decisions..."
        },
        "12221":{
            "choices":[
                "fat",
                "becomin fat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok the sky so orange.are you fat or becomin fat</span></div></span></div>",
            "created":1168664400,
            "id":373424,
            "title":"orange sky"
        },
        "122212":{
            "author_id":"novascreech",
            "author_name":"krawler",
            "choices":[
                "injections",
                "specially enhanced foods"
            ],
            "content":"<div class=\"\"><div> <span> As far back as anyone can remember, men have primitive violent urges, while women have more tame though indulgent desires, this is why the two sexes have remained separated and at war. In this world men use their physical prowess and brute force to dominate their enemies typically resorting to wooden clubs or their fists. Women however, unlike their male counterparts rely on technology such as mechas and machines such as hover crafts and lasers. Interestingly enough the women have found a unique way of powering their technology via synchronization with body fat. Upon discovering that their fat contained an energy source, women folk concocted technologies that could utilize fat and fuse it with energy for their mechas. In short the more fat a woman has the more power her mecha has. With these advances women designed an army to handle the feral men and secure their luxurious lifestyle. <br>\r\n<br>\r\nKatie was a teenage girl enrolling in the Male Control army were the technologically advanced women attempt to suppress the barbaric men. She had long blonde hair, green eyes, and similar to most young girls a thin though disadvantaged body. Katie stood alongside other recruits, skinny as well, dressed in sports bras and shorts. In came the drill instructor, a 600 pound woman riding in on a type of hover craft. She had a black ponytail, huge breasts, a belly hanging over her hover craft, wearing a skin tight plug suit, and bearing a stern countenance. \"All right ladies, you want to join the army huh? As of now none of you have what it takes. Not a single one of you has enough fat to power a prototype mecha! Don't worry we'll fix that. We'll have you eating day and night. You'll be fattened up enough to bring pride to all women. You'll bring fear to those physically fit men who use their bodies for combat, like the primitive loin clothed beasts they are.\" shouted the drill instructor. <br>\r\n<br>\r\nAs the drill instructor concluded her stereotypical introduction, Katie along with the other recruits underwent their training or rather their body preparations.  \"Oh boy I can't wait to get fat so I can take out some men!\" Katie said. \"Yeah thanks to our government's science women can fatten themselves up to unfathomable weights.\" added a girl. \"Indeed I tried getting fat on my own but I could barely put on any.\" added another girl pinching a small roll of pudge on her belly. Soon these ladies will receive the treatment that will change them into obese mecha pilots.<br>\r\n<br>\r\nThe recruits arrived at their destiny were they were given...  </span></div></div>",
            "created":1494694260,
            "id":2318609,
            "title":"becomin fat"
        },
        "1222121":{
            "author_id":"novascreech",
            "author_name":"krawler",
            "choices":[
                "eats fiercely ",
                "ate and then trained"
            ],
            "content":"<div class=\"\"><div> <span>Katie along with the other girls headed over to the mess hall were numerous nurses, each heavily obese, waited for the new recruits. \"Alright ladies line up for your inoculations.\" shouted a nurse. \"Inoculations?\" Katie uttered. \"Yeah my sister told me about this, when a girl first joins the army she is given a shot which halts her metabolism and drastically increases her hunger. And it makes it almost impossible to lose any weight.\" answered a girl next to Katie in line. \"Heh anything to take on those barbarian men.\" Katie replied. Katie watched as girl after girl received her shot and how after they immediately bolted into the mess hall. <br>\r\n<br>\r\nFinally it was Katie's turn. The nurse grabbed her skinny arm with her plump hand and injected her with the serum. Katie felt the pinch then an overwhelming hunger. Katie rushed into the mess hall feeling hungrier than she ever had in her life. Upon entering the building Katie noticed her comrades sitting at tables feverishly stuffing their faces. Girls were gnawing on meat, scooping ice cream, scarfing desserts, and chugging milkshakes. No girl displayed an ounce of restraint as each girl shoveled piles of food through her jaws. Katie also noticed that the girls had developed fat folds on their recently skinny bodies.<br>\r\n<br>\r\nKatie finally reached the food line were she piled heaps of rich foods upon her tray. Katie...   </span></div></div>",
            "created":1496934720,
            "id":2333088,
            "title":"injections"
        },
        "123":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "Eat one cookie to curb your hunger.",
                "No keep on mission. Find intel on secert weapons."
            ],
            "content":"<div class=\"\"><div> <span>Men are fat and getting fatter onpurpose. Life is easy in the future and they do not have to worry about anything. THe average amle is now 300 lbs. <br>\r\n<br>\r\nFemales on the other hand are physically fit. Some are super muscle bound while others are like fitness models. The work hard on there bodies and hate the ovber indulging ways of man. They want to take over.<br>\r\n<br>\r\nWome get word of a secert weapon that the men are planning to release on the women. They have no idea what it is though. They send a spy (You) to sneak into one of the waepon factories to get intel.<br>\r\n<br>\r\nYou spend several days sneaking behind enemy lines. You get into one of the factories undetected. You start to look around in the offices and labs. <br>\r\n<br>\r\nSo far nothing to earth shattering. You walk into a lab and see a plate of cookies, they look like mint chocolate (Like girl scout cookies). <br>\r\n<br>\r\nYou have run out of rations and are quiet hungry, yet you don't want to eat junk food (You are 5'11\" 135 lbs of lean body mass. 34-24-36)<br>\r\n<br>\r\nYou.......</span></div></div>",
            "created":1101790800,
            "id":227572,
            "title":"A plate of cookies (Think passion patties from tot"
        },
        "1231":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "See yourself in a mirror",
                "make your waqy back to the women's base."
            ],
            "content":"<div class=\"\"><div> <span>Hell one cookie won't hurt. You pick one up and take a bite. A thousand lush and wonderful flavors explode in your mouth. You have never tasted such wonders. Without even thinking or hesitating you grab more cookies and eat. You just can't stop eating them. \"Oh I have been missing out on things.\" You say out loud. <br>\r\n<br>\r\nIn 10 minutes you finish the whole plate of cookies. Still very hungry though. You are wearing an all black spy suit that is form hugging and no reflective (It also show off that ripped body of yours) and there is now a small buldge where your belly is. You pay no attention to it.<br>\r\n<br>\r\nYou keep looking for intel on the secert weapon and more cookies. All you can find is paperwork on a contract with the girl scouts of the world for cookies. You grab that and open up a closet door and there is a room full of boxes and they are all labled girl scout cookies. <br>\r\n<br>\r\nYou grab a bag and load up on as much as you can carry. You also open several boxes eating all of the cookies in each.<br>\r\n<br>\r\nYou leave the room with a large bag of cookies.<br>\r\n<br>\r\nYou.......</span></div></div>",
            "created":1101790800,
            "id":227575,
            "title":"More cookies, they are for the girl scouts?"
        },
        "12312":{
            "author_id":"hex49",
            "author_name":"et_smash",
            "choices":[
                "Your commander is shocked to see you.",
                "You notice that everyone on base has girl scout cookies"
            ],
            "content":"<div class=\"\"><div> <span>You make it back to base undetected by any men. all the way back munching on those cookies. It was a day treck and you eat half of the large bag of cookies. You know you have gained, in your mind, a \"little weight\". In reality your weight has jumped, in 48 hours, from 135 to 175. Your suit shows off the gain nicely. Your 34-24-36 body is gone. Replaced by 38(D)-32-48 body. You jiggle everywhere. Your muscule tone is gone. Replaced by cellulite. Your face was sharp and sngular before is now soft with a second chin forming.<br>\r\n<br>\r\n........</span></div></div>",
            "created":1101790800,
            "id":227584,
            "title":"Eat half the bag."
        },
        "123121":{
            "choices":[
                "Laboratory 5, there you will confer with the scientists to lose weight.",
                "Division 7, you're going to be on a rigorous work schedule."
            ],
            "content":"<div class=\"\"><div> <span>The leader of the Internation Female Union stood, looking out the window, staring out at the golden stars, sitting in her large, gray, imposing chair. Its back faced you when the large, airtight doors hissed open after your fingerprint scan.<br>\r\n<br>\r\n\"Name yourself,\" droned Admiraliesa Vera in her slight Gaulic accent.<br>\r\n<br>\r\n\"Agent 340,\" you state.<br>\r\n<br>\r\n\"Ah, Agent 340,\" the Admiraliese smirked as she programmed her chair to rotate around slowly to face you, \"It's no suprise that you came when you did.\"<br>\r\n<br>\r\nSuddenly, the glass of red wine that Admiraliesa Vera was holding shattered as it hit the ground.<br>\r\n<br>\r\n\"What in God's name has happened to you?\" the commander exclaimed, making a brief reference to her ancient religion.<br>\r\n<br>\r\n\"I believe I may have gained weight, Your Admiraliesa,\" you state.<br>\r\n<br>\r\n\"Well, then, we simply cannot keep due with this. This is unacceptable, you simply must loose this weight that is so characteristic of those swines,\" she stated, \"I'm transfering you over to-\"</span></div></div>",
            "created":1119934800,
            "id":258546,
            "title":"The Union"
        },
        "1232":{
            "choices":[
                "The kitchens",
                "The great banquet hall",
                "A private dining room"
            ],
            "content":"<div class=\"\"><div> <span>A little apprehensively you pick up four of the cookies and quickly stash them into your bag. It's a big pile, at least thirty on one large plate, so you figure a few won't be missed. Being a woman, and a superfit field operative at that, you'd normally steer well clear of such a sugary snack. But after several days deep behind enemy lines your food supply is depleted, and you never know when you might get cornered and have to lay low for hours - perhaps even weeks.<br>\r\n<br>\r\nSuddenly you hear footsteps coming down the corridor. Hastily zipping up your bag your dart across to the door on the other side of the room, only to find that it's locked. Swearing under your breath you look around for a hiding place. The lab is huge, full of large microscopes, equipment and tables, but nowhere that you could- aha! You spot a small ventilation shaft underneath a desk that's pushed up against the wall opposite you. For a moment you look at it, biting your lip with doubt, but the sound of voices just outside the door makes the decision for you. Scampering softly across the shiny floor in your skintight black spy gear, you quickly slide off the vent's grill and back your 36 inch hips in, silently thanking your stars that you kept up those extra cardio boot camps.<br>\r\n<br>\r\nYou've just finished pulling the grill back across the vent when two men burst into the room, swinging the double doors on their hinges. Ever the espionage expert you peer throug the grill, watching them closely and taking mental notes and snapshots. <br>\r\n<br>\r\nThe first thing you notice is that the're scientists. This is obvious from their attire. The second, equally obvious thing, is that they're fat. <i>Very</i> fat - even by male standards. Both must be over 500lbs, with massive tummies protruding like yoga balls from their unbuttoned lab coats, and big bubble butts bouncing behind as they waddle towards the workbench you recently vacated. <br>\r\n<br>\r\nThe sight of such sizeable scientists makes your pulse quicken with interest. Three decades ago, long before the war broke out, science reached its apex: pills could guarantee good health and with robots carrying out more and more manual jobs necessary for human survival and flourishing, experts predicted a shift in body shape, towards a softer and rounder physique for both sexes.<br>\r\n<br>\r\nAnd they had been right. Half-right, anyway. With male-dominated consumer society continuing to promote - subtly and overtly - a lean, firm and curvaceous figure as the ideal beauty standard for women, the females of this brave new work-free world dedicated large portions of their extra free time to exercise. Fitness became woven into their social lives. Gyms and swimming pools sprung up everywhere, with all manner of female-oriented fitness classes - from spinning and circuit training to yoga and zumba. Groups of local women started running clubs and cycle groups, donning lycra and spandex, much to the delight of their husbands and boyfriends. As a result of all this, and in direct defiance the initial expert predictions, the female sex actually began to get <i>slimmer</i> and fitter over the subsequent decades. <br>\r\n<br>\r\nAs for the men... Well, with no work to do, and no such beauty standards to live up to, they reclined into a life of leisure. While wives and girlfriends stretched and sweated and toned in the gym, their male counterparts would be found plonked on sofas and bar stools, swigging beer and grazing on pretzels or ordering chips, pizzas and burgers as they cheered scantily clad sportswomen on their ultra-sized TV screens. (Women's sports had quickly overtaken men's in popularity - another consequences of male-domination of society. After all, what man wanted to watch a bunch of sweaty jocks banging into each other on the football field when he could watch supersexy scantily clad young women do it instead?) <br>\r\n<br>\r\nStaying comfortable and well-provisioned on their sofas while their wives worked out in the gym, cycled up mountains and ran charity marathons, men quickly began to fulfil their half of the expert predictions, becoming almost universally obese. A guy's waistline became a good indicator of his social class or rank. The rounder the belly, runs the notion, the richer the man: the more lavish food he can afford, the more robots to make his life easier. After the rebellion and the walkouts by women (triggered mostly by a simmering resentment at how easy the male sex had it, and how demanding they were of the female) it was confidently predicted that the consequent disappearance of all their wives rich home-cooking would cause men to lose weight. In fact the opposite happened. Without women to provide them with Sunday roasts and all manner of delicious pies, the men resorted to fast food, eating enormous quantities of junk to make up for the quality meals that left with the women and swelling up around the middle as a result. What's more, when women were captured, they were inevitably sold to the richer, more important men who immediately put them to work in their kitchens. On this rare, almost-forgotten influx of fine dining, said men gorged wildly, becoming fatter still.<br>\r\n<br>\r\nHence your excitement. Given that weight is generally a sign of rank and social status, these two must be very important scientists indeed. One of them waddles over to the work bench with the mysterious cookies and drops his bag on the table and begins to unload. Your heart starts to beat even faster. Will he notice the missing snacks?<br>\r\n<br>\r\nFortunately his mind is on other things. <br>\r\n<br>\r\n\"Man I can't believe we're not allowed to the feast,\" grumbles scientist 1, a handsome-faced man who looks to be in his mid thirties, with messy highlighted blond hair. His shortness and belly width making him almost spherical.<br>\r\n<br>\r\n\"Don't worry,\" replies the other, a taller darker, slightly older specimen. As he slumps into his seat with a grunt his vast, proud gut surges towards the table, causing your eyes to widen. He must measure at least eighty inches around - a true heavyweight in size and social standing. Surely he and his colleague must be involved in the secret weapon men are developing!<br>\r\n<br>\r\n\"I had the kitchens whip these up specially,\" grins scientist 2, salivating as he pulls a massive foot high burger crammed with beef and bacon and dripping cheese and barbecue sauce. \"They're the same as they got in the banquet hall. And we got four each!\" <br>\r\n<br>\r\nThe petulant blond slaps his belly. \"Well good, I'm starving with a captial ARVING!\"<br>\r\n<br>\r\nWatching the man's enormous gut wobble as he lifts his first burger to flashing white teeth, you can't help feeling that he's exaggerating. Forget missing a meal, these men look as though they eat constantly.<br>\r\n<br>\r\nYou look down at your own deprived stomach by contrast. It starts to grumble. Queitly unzipping the bag, using the grunting chomping noises from the men as cover, you pull out a cookie and lift it to your lips.<br>\r\n<br>\r\n\"Careful there <i>munch buurp</i> Toby,\" cautions the darker scientist, pointing towards the mound of fries his colleague has just dumped onto the work bench. \"Don't get any of that near the specimens!\"<br>\r\n<br>\r\nYou pause, the unbitten cookie between your open teeth.<br>\r\n<br>\r\n\"Haha, you're right man,\" says the blond scientist, carefully pushing the plate of cookies further away from him. \"Damn, I can't wait to unleash these bad boys on the women. They won't know what's hit em!\" He laughs, popping the remaining quarter of his second burger into his mouth and rustles in the bag for his third.<br>\r\n<br>\r\nYou look down at the cookie in your hand, wondering what it might contain. A virus? Unlikely, the men really want to bring the women back until their control, not to kill them. Some sort of long-term sleeping potion, perhaps, an experimental mind-control drug? Breathing a quiet sigh of relief at having narrowly avoided eaten it, you zip the cookie back up safely with the others in your bag. No doubt HQ will want to anaylse it when you get back.<br>\r\n<br>\r\nWith the two scientists gorging on gourmet burgers and glugging huge cannisters of soda, you decide to continue your search for the secret weapon. After shuffling backwards for a while, you find a small area to turn round in, and continue quietly down the ventilation shaft. It's like a maze, running throughout the big industrial building, and you feel like you've been travelling for hours, until, turning a corner, you spy a grill in the ventilation shaft floor just ahead of you. You also smell something incredible wafting up through the grill. Sniffing longingly, you shuffle forwards and peer down the grill, finding that you're just above...</span></div></div>",
            "created":1469668260,
            "id":2187121,
            "title":"Save the cookies and find intel on secert weapons"
        },
        "12321":{
            "choices":[
                "Head through the vents to find the banquet hall",
                "Continue to watch the kitchens"
            ],
            "content":"<div class=\"\"><div> <span>As you crawl towards the gauze, a rich smell of melting chocolate wafts up into your nostrils. <br>\r\n<br>\r\n<i>Must be the kitchens,</i> you think, breathing in sensuously. <i>And it sounds like they're in full flow.</i><br>\r\n<br>\r\nSure enough, as you peer carefully down through the grate you're greated with a birds-eye view of a truly enormous gleaming, uber-modern kitchen complex - and it's a hive of activity. Stacked racks of gleaming ovens line the walls, humming and beeping periodically and huge silver pans bubbles on raging gas hobs. Across the room, a line of deep fat friers sizzle with piles of greasy chips and burritos. Buzzing industriously around all this like worker bees are no fewer then twelve beautiful women in short skirts and aprons. They bustle about the hot room, passing each other like ships in the night as they stir pans, decant trays of melting strawberry sauce onto towering cakes, tug trays of roast beef and glistening lamb shanks from the ovens, spray whipping cream onto rows of cupcakes, stuff chickens, pasting hams, shuffle baskets of french fries - marshalling mountains of food with almost military efficiency as they slowly but diligently transfer plate after plate, platter after platters, tray after tray and bowl upon bowl of edible delights to the enormous granite island in the room's center.<br>\r\n<br>\r\nDespite the heat a shiver goes up your spine. From the firm lean bodies and the way they move, you realise that the women are moving like military because they <i>are</i> military. Soldiers captured on the front lines by the men, and put to work as slaves in their kitchens, toiling endlessly to produce what must be the great feast those two scientists mentioned. You notice the metal bracelets around their slender ankles - some form of imprisonment device, you reason, to stop them running off.<br>\r\n<br>\r\nSuddenly an enormous rumble causes the air vent to shake. You look down at your narrow waist with horror - but no, the sound was much too loud to be hunger.<br>\r\n<br>\r\nAt least, too loud to be<i> your </i>hunger.<br>\r\n<br>\r\n\"<i>Mar-ia!</i>\" The voice booms across the kitchens like a cannon. \"Aren't those deep-fried enchiladas ready yet?!\"<br>\r\n<br>\r\nYour eyes follow the voice to the far side of the room. There, lounging on an immensely large and soft looking armchair, with one hugely fat leg dangling over the padded chairarm, sits a man in a tall chef's hat. His white outfit, pulled across him and held together by huge black buttons, is blotched all over with food stains.<br>\r\n<br>\r\n\"Yes chef!\" calls a cowering voice from near the deep friers. Soon a tall woman with ponytailed blonde hair is hurrying over to the chair, a plate of freshly fried enchiladas in her hands, oozing sauces and bright with colour of fresh meat, refried beans, guacamole and tomato. As she approaches the chef's chair, he leans back, licking his lips and opening his mouth wide.<br>\r\n<br>\r\nYou watch the woman push a whole enchilada into his mouth, taking care to swiftly remove her fingers before he starts chewing.<br>\r\n<br>\r\nThat explains the stains, anyway, you think, watching a huge glob of guacamole drop from the chef's lips. Though he seems more a taste-tester than a chef - and judging by the size of his belly, which sticks out so far that the descending glob simply sits atop of it - you reckon he's tested a <i>lot</i> of food today. The big black buttons on his overall are stretched to busting over an impractically massive paunch.<br>\r\n<br>\r\nThe serving girl has to feed the greedy chef all three enchiladas on the plate before he delivers his verdict.<br>\r\n<br>\r\n\"Needs more guacamole,\" he snaps, picking at his teeth with a toothpick and then belching awkwardly. <i>Only because you spilt half of it on your top, you pig!</i> you think, clenching your fists. As Maria bows and scurries off, the \"chef\" places places a hand on his mighty paunch. <br>\r\n<br>\r\n\"Jennifer, bring me a tube of that chocolate sauce.\"<br>\r\n<br>\r\n<i>Figures, the lazy lug wants something sweet to finish off his meal.</i><br>\r\n<br>\r\n\"Yes chef - just let me get the consistency right\" says a voice directly below you.<br>\r\n<br>\r\nLooking straight down for the first time, you realise right above an enormous pot - or more accurately a massive vat of thick, brown liquid chocolate. Twenty or thirty feet wide and bubbling and glorping noisily. Four women, including the redhead who spoke (Jennifer, presumably) are standing around it, stirring the mixture with a huge wooden spatulas and grunting with effort as they do so. You can see why. The mixture looks as thick as tar.<br>\r\n<br>\r\nThe chef frowns in displeasure at the delay. Reaching to the table next to him, he picks up what looks like a TV remote. \"I said <i>now</i> Jennifer,\" he speaks evenly, but with menace. \"Gateau du Chocolat Supreme is His Exellency's favourite dish. The sauce must be absolutely perfect. I need to test it immediately.\"<br>\r\n<br>\r\nSuch is your shock that you almost bang your head on the roof of the vent. His <i>Excellency</i>? The Emperor of Men is coming here?! It makes sense when you think about it. If this is where the men's new ultimate weapon is situated, the Emperor would surely want to inspect and announce it in person.<br>\r\n<br>\r\nMeanwhile the chef's patience is at an end. He points the controller towards Jennifer and, with a demonic grin, presses a fat finger onto a large blue button.<br>\r\n<br>\r\nThere's a sizzling sound, but not from the bacon. Immediately the redhead releases her spatula, fingers splaying as she yelps in agony, an electric shock coursing through her system.<br>\r\n<br>\r\n\"Coming chef!\" she squeals, reaching for a transparent cannister as long as her torso and as wide as her thigh. She thrusts it into the vat of chocolate sauce, letting it bubble away until it's full.<br>\r\n<br>\r\nAs the poor girl scuttles across the floor, several strands of her hair still vertical from the electric shock, the cruel chef shifts in his chair in excited anticipation of the treat. The second she reaches him he leans back to let her pour the treat down his throat. She lifts the cannister and he begins to chug. <br>\r\n<br>\r\nYou screw up your face in disgust. Even with the cannister tipped up almost vertical he's slurping and gulping at the chocolate, greedy to get it all inside himself as soon as is absolutely possible.<br>\r\n<br>\r\nStill, it's a slow process. There cannister is huge, and its contents incredibly thick. You realise the room has fallen silent, but for the gurgling gulps of the chef. All the women have stopped to gaze at in fear and awe at the gradually rising bulge of their oppressor's monstrous white stomach. <i>Now would be the perfect time to strike,</i> you think, <i>he's so intent on his eating.</i> But the women make no move. Clearly cowed into fear by the ankle bracelets - and surely the infinitely worse punishments they would receive for open rebellion.<br>\r\n<br>\r\nBut you're not amongst them. You're primed for action. Moving as quietly as possible you unzip your rucksack and pull out three of the four cookies you swiped from the lab. <i>Specimens, eh?</i> You muse, recalling the fat scientist's warning to his colleague not to eat them. <br>\r\n<br>\r\nMaking doubly sure no-one is looking, you drop them into the huge vat of chocolate.<br>\r\n<br>\r\nThere's a hiss and a bubble, but that's all. No one notices.<br>\r\n<br>\r\n<i>Bon appetit, your excellency!</i> You whisper with a grin.</span></div></div>",
            "created":1473210420,
            "id":2207094,
            "title":"The grand kitchens"
        },
        "13":{
            "author_id":"jawmax",
            "author_name":"Jawmax",
            "choices":[
                "Your Jason.",
                "Your Linda.",
                "Jason is fat.",
                "Linda is fat.",
                "Both are fat."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jason and Linda are about to meet for the first time. Their love might change the world.</span></div></span></div>",
            "created":1099371600,
            "id":223710,
            "title":"Jason and Linda."
        },
        "131":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Investigate the voice",
                "Report to the general you heard a woman",
                "Stay still and wait"
            ],
            "content":"<div class=\"\"><div> <span>Jason strode confidently through the woods as he was about to make his way back to camp.<br>\r\n<br>\r\nJason was a young man of 18 who had reddish hair, blue eyes and a slender build.<br>\r\n<br>\r\nJason wore a green jacket with a wolf cup patch on the heart, underneith the jacket there was a tatoo of a wolf cub all in black<br>\r\n<br>\r\nThat was the way of his particular special divsion branch they gave themselves animal code names complete with tatoo and other decorations.<br>\r\n<br>\r\nJust as he past the old Oak tree he heard what sounded like a twig snap! He jumped at the sound but when he turned around he saw a little bunny hop out of the bushes Jason was relieved but then he heard the voice of a woman in the distance<br>\r\n<br>\r\n<br>\r\n\"Fox Cub to Wolf Cub! Can you hear me? Fox Cub TO WOLF CUB!\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1293685200,
            "id":1025782,
            "title":"Jason Meets his First Woman"
        },
        "1311":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "She Speaks",
                "She does not speak",
                "Some men see what you've caught"
            ],
            "content":"<div class=\"\"><div> <span>Jason decided he would investigate the voice, He saw something hiding in a patch of tall grass.<br>\r\n<br>\r\nJason decided he would sneak up on this woman...<br>\r\n<br>\r\nHe managed to make his way through the tall grass with out making a sound.<br>\r\n<br>\r\nThe Woman was still trying to commnicate with someone on her walkie talkie<br>\r\n<br>\r\n\"Fox Cub to Wolf Cub! Come in Wolf Cub!\"<br>\r\n<br>\r\n\"So engaged was the woman that she did not notice a man sneaking up behand her, and finally he struck!<br>\r\n<br>\r\nHe grabbed her so feircly by the shoulders that she let out a yelp! She tried to bolt but Jason held on to strong!<br>\r\n<br>\r\n\"All right you...\" Jason said turning the woman around, he found that she had long blond hair, soft blue eyes and thin lips the color of a dusty rose...Jason was somewhat taken a back this was the first woman he had ever seen up close so he was pretty shell shocked<br>\r\n<br>\r\n\"Now listen you...\" He says trying not to let his horomones get the better of him \"What were you doing in Men's territory? And Why have you adopted Animal Code Names? That's our gimmick!\" </span></div></div>",
            "created":1293771600,
            "id":1026143,
            "title":"Investigate the voice"
        },
        "13113":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Some Soliders try to rip open her Jacket",
                "Someone injects her with truth serum so she'll reveal her indedtity"
            ],
            "content":"<div class=\"\"><div> <span>Some of Jason's fellow soliders ran up to him when they noticed what he had.<br>\r\n<br>\r\n\"Hey Wolf Cub!\" Said His Friend whose Code Name was Rabbit (Possibly because he bred like one, he was one of the few men allowed near the women) Rabbit was one of the few Solider's who had confided his real name to Jason (Which was William)<br>\r\n<br>\r\n\"What have ya got there?\" Rabbit asked jumping about like his name sake \"Ooh! I see you got a nice juicy one there!\"<br>\r\n<br>\r\nAnouther Soldier whose Code Name was Red Squirrel (Jason had not figured out his real name yet) Took a look at the Woman's uniform, and saw that like them she also had the image of an animal ebroidered over her heart, in this case a red fox cub.<br>\r\n<br>\r\n\"Well...\" Red Squirrel said \"Looks like the Lady Types have heard about our gimmick and tried to steal it for themselves But tell me this Girly,\" Red Squirrel says unbuttoning his jacket \"Do you have this underneith?\"<br>\r\n<br>\r\nRed Squirrel reveals his tatoo of a squirrel over his heart The Young Woman looks at it in disgust<br>\r\n<br>\r\n\"So tell us Bimbo?\" Red Squirrel asks \"Do you have the guts to tatoo your code name on your body?\"<br>\r\n<br>\r\nThe Woman remains sillent   </span></div></div>",
            "created":1293771600,
            "id":1026144,
            "title":"Thought and Feelings"
        },
        "131132":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "To put her in the breeding pen",
                "To make her his own personal woman"
            ],
            "content":"<div class=\"\"><div> <span>Just than a a Solider called Serpent came by weilding a syrnge filled with something.<br>\r\n<br>\r\n\"Let's see how the pretty little thing will hold up against my truth serum...\" He says in a sly hissing voice <br>\r\n<br>\r\nHe injects the woman with the serum. And she begins to thrash as she feels it take affect<br>\r\n<br>\r\n\"Now than my pretty...\" Serpent says taking her chin in his hand \"What is your name?\"<br>\r\n<br>\r\n\"M...M...My...N..name is...Linda...\" The Girl says after a long pause.<br>\r\n<br>\r\n\"Good!\" Serpent says \"Throw her in the breeding pen, with the rest of the captured women!\"<br>\r\n<br>\r\n\"Now hold on a a miniute!\" Rabbit says <br>\r\n<br>\r\n\"I say we let Wolf Cub decide what we do with this woman.\" Red Squirrel says<br>\r\n<br>\r\n\"Yes.\" Rabbit says \"It's only fair because he caught her.\" <br>\r\nJason decides</span></div></div>",
            "created":1293771600,
            "id":1026145,
            "title":"The Woman named Linda"
        },
        "1311322":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Jason did not know what to do...He looked at Linda's face all he could see was despair and sadness.<br>\r\n<br>\r\n\"Well?\" Red Squirrel said \"We're waiting for your decision...\"<br>\r\n<br>\r\n\"Oh right!\" Jason said \"My decision...\" He had to think for a moment \"Make the Woman my own personal concubine! I want General Lion to know I have caught my first woman!\"<br>\r\n<br>\r\nCheers of huzzahs from from Rabbit and Red Squirrel but Serpent remains oddly sillent<br>\r\n<br>\r\nThe Three Men take Linda away to have her groomed and dressed in the clothes of a concubine. Jason felt reflective, this was the first woman he had ever met and she didn't seem like a psychotic man-hating monster.<br>\r\n<br>\r\nHe walked back into camp, he was greeted with a Warm Hug from General Lion \"So! You caught yourself your first woman eh? That's my boy!\" He says giving the Private a rather rough noogie<br>\r\n<br>\r\n\"General! Please!\" Jason says coughing and spluttering he breaks free of the grasp  \"General, Please...\" He said more softly \"I must get ready...For you know...\"<br>\r\n<br>\r\n\"Ah!\" The General says giving Jason a knowing wink \"That I do know my boy that I do.\"</span></div></div>",
            "created":1293771600,
            "id":1026157,
            "title":"My Woman"
        },
        "13113221":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Jason made his way to his room, where he had been told Linda was all gussed up and ready for him.<br>\r\n<br>\r\nHe had a sinking feeling, he didn't know what to expect.<br>\r\n<br>\r\nFinnally he opened the door, And there was Linda, on his bed with...A Fox with her?<br>\r\n<br>\r\nA Silver Fox was on the Bed with Linda chewing the ropes that were binding her<br>\r\n<br>\r\n\"Good Job Diamond!\" Linda said to the Fox \"Just a little more and I'll be free!\"<br>\r\n<br>\r\n\"Who let that animal in my room!\" Jason shouted<br>\r\n<br>\r\nThe Woman and Fox stare at Jason <br>\r\n<br>\r\n\"Run Diamond run!\" Linda shouted the Fox quickly made a dash for the open window.<br>\r\n<br>\r\nShe hopped though Jason shut the window \"You let that mangy Animal in diddn't you?!\"<br>\r\n<br>\r\n\"Diamond let herself in.\" Linda said \"On the Woman's side of things we have geneticly engenneered pets that will come to our assitance when we need it.\" </span></div></div>",
            "created":1293771600,
            "id":1026159,
            "title":"Jason and Linda's first discussion"
        },
        "1312":{
            "author_id":"xheliwolfx",
            "author_name":"xHeliWolfx",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>    Remembering his training, Jason knew that this could be a trap. The woman might be deliberately letting herself heard, luring unsuspecting men into an ambush. Deciding to not take that risk, he decided to report to this to his general.<br>\r\n<br>\r\n    Jason quickly jogged back to the outpost, and as he reached the gates he put up his arms and yelled \"Friendly!\" A guard on duty stationed in a sniper tower yelled \"Friendly! Open the gates!\" It was standard procedure here. The gates opened and Jason stepped in. No matter how many times he's been in here, the outpost never ceases to amaze him how bland and shitty it looks. Its the year 3246, but decades of warfare has exhausted the planet's resources, forcing both sides to scrounge whatever they could find.<br>\r\n<br>\r\n    Anyway, Jason hurriedly jogged towards the heart of the outpost where his general was. He passed the breeding pens, where captured women were kept. He's been in there once, was not a pretty sight. The women were forced to be impregnated to produce new recruits to fight on the field, while newborns who were female had their heads cut off.<br>\r\n<br>\r\n    At last, Jason had reached his destination. The building was the largest in the outpost, having 2 storeys and balconies on the second level equipped with mounted machine guns in case there was an invasion. Jason opened the door and entered.</span></div></div>",
            "created":1385158740,
            "id":1697805,
            "title":"Report to the general you heard a woman"
        },
        "1313":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "They serch and capture Jason",
                "Jason escapes capture",
                "Jason turns the tables and captures them!"
            ],
            "content":"<div class=\"\"><div> <span>Jason decied to stay still and wait hoping that the invading woman would walk right by him and not even notice...<br>\r\n<br>\r\nThe Woman did walk by looking like a deer in the headlights.<br>\r\n<br>\r\nJason hid behind the Old Oak Tree and took a peek at her she was blond, but not just any blond she was almost a perfect spun gold blond, her eyes were blue and her complextion was of peaches and cream.<br>\r\n<br>\r\nThan he looked at her uniform, it was silver, and over her heart was an embrodery of a fox cub, Jason gnashed his teeth, the Animal Code Names were the Mens' gimmick how dare these women copycat them!<br>\r\n<br>\r\nJust then the sound Parrot sqwaking interupts Jason's train of thought, a large Red Bird swoops down on to the ground.<br>\r\n<br>\r\n\"There you are!\" an Older Woman comes into the scene next to 'Fox Cub' \"We've been looking all over for you\" The Older Woman scolds as she picks up the Bird \"Don't you know you're deep in Men's territory<br>\r\n<br>\r\n\"Oh Scarlet MaCaw do forgive me!\" The Blond girl says \"But I think I lost Wolf Cub! I think the Men got her!\"<br>\r\n<br>\r\n\"There...There...\" Scarlet Macaw tries to comfort her.<br>\r\n<br>\r\nSuddenly the Parrot in the older woman's arms squaks \"Man! Two O Clock!\"<br>\r\n<br>\r\n\"Did you hear what Cassandra said?\" </span></div></div>",
            "created":1293858000,
            "id":1026896,
            "title":"Jason sees too much"
        },
        "13131":{
            "author_id":"curse",
            "author_name":"death",
            "choices":[
                "she puts you in a breeding farm",
                "she keeps you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>they bring him to the girl's camp and sees the traitor Vampire bat (Chris) a teenaged man that looks like a vampire is walking freely around the camp and he sees you. He asked linda what is she going to do to you,</span></div></span></div>",
            "created":1294290000,
            "id":1030164,
            "title":"They serch and capture Jason"
        },
        "132":{
            "choices":[
                "Lower your weapon and let him go",
                "Shoot him on sight, to wound him, and bring him back to camp"
            ],
            "content":"<div class=\"\"><div> <span>It was your turn to be the late night outer guard. You hated the job, it was so boring and you didn't even get to shoot anything. You grabbed your gear and headed out. You walked out of the barracks and past the guards at the door, saluting them as you passed. You reached the outer perimeter, where you would be working tonight. You found a tree, and set yourself up on a lower branch. It was going to be one long night...<br>\r\n<br>\r\nAfter a few hours, you almost began to nod off. It's not like anything happened during your shift. And the men were too cowardly to attack at night anyway. <br>\r\n<br>\r\nThen you heard something, off in the trees to your left. You immediately grabbed your gun and looked around. Your night vision goggles were on so you could see in the darkness.  You could see the leaves rustling, so you jumped out of the tree and slowly inched toward the spot. Suddenly, a man appeared out of the trees, running. He stopped and looked at you.</span></div></div>",
            "created":1101013200,
            "id":226384,
            "title":"Chance Meeting"
        },
        "1321":{
            "author_id":"paulsmuse42",
            "author_name":"Jemimah Netlock",
            "choices":[
                "You  ask him what he means.",
                "Without asking him what it means, you tell him again to leave."
            ],
            "content":"<div class=\"\"><div> <span>You lowered your gun and said, \"Hi there!  Never seen a woman before?\"<br>\r\nHe just stared.  You repeated what you just said, adding, \"What's your name?\"<br>\r\n\"Jason,\" he said.  \"Ummm....uhhh.... what's your name?\"<br>\r\n\"My name's Linda\" you said.<br>\r\n\"Oh! Linda...Linda...that's a pretty name...I've never heard it before.\"<br>\r\n\"Neither have I heard 'Jason' before,\" you said.  \"But listen, you can't come in here.  You'd better go away.\"<br>\r\n\"Okay, I will, but before I go...do you want to go out with me?\"<br>\r\nYou've never heard this expression before: \"go out with me\"<br>\r\n</span></div></div>",
            "created":1101790800,
            "id":227593,
            "title":"Linda meets Jason"
        },
        "13212":{
            "author_id":"cluegirl1989",
            "author_name":"Aysel Finlay",
            "choices":[
                "You reach for the silver alarm whistle on black cord.",
                "You reach for the key on unassuming white string."
            ],
            "content":"<div class=\"\"><div> <span>You gape at him. \"Get out of here!\" You say, menacing him with the crossbow. He backs up, his arms above his head. But he laughs.<br>\r\n\"You're right, you're right,\" he says, \"Archaic...I only wondered your reaction - heard it on an old radio program...\"<br>\r\n\"Radio?\" You glower at him.<br>\r\nHe nods.<br>\r\n\"You have access to the old literature?\"<br>\r\nHe falters - bites his lip. Torn between duty and the urge to share a secret? You've felt that before.<br>\r\n\"I work in a department that studies old files,\" he says carefully. Something in his sideways gaze tells you it's more than a data processing gig.<br>\r\n\"What do you want?\" you say, exhasperated.<br>\r\n\"I...er...\" he fumbles, \"Well, I...I came to see you,\"<br>\r\n\"See me?\" you parrot, shooting him an incredulous look.<br>\r\n\"Yes,\" His embarassed smile falters, \"I...well I saw your picture in the paper.\"<br>\r\nYou finger the trigger and consider him. He doesn't look insane, but he must be. The newspaper's been gone half a decade, at least. Nobody bothers with print anymore. He must be a convict, a madman, but his honest gaze confuses you.<br>\r\nSensing your thoughts, he hurriedly continues, \"An old issue. You couldn't have been older than seventeen, but you were there in black and white, waving a banner and shouting. The old movements against segregation, remember? When all the barricading and barbed wire were first started?\"<br>\r\nYour cheeks burn. Someone's finally dragged up your sophomoric freedom marches. You are a true daughter of the revolution now, you tell yourself fiercely. You have nothing to fear from this rogue...librarian.<br>\r\n\"It intruiged me. I wondered if you were still alive, or whether the thoughtpolice had done away with you, or worse, converted you,\" he says, giving you a meaningful look, his eyes gluing to your badge and bow.<br>\r\n\"Pity such a true patriot should die. We could've used her. I had hoped she would still be for us, but I can see I was wrong. Goodnight to you,\"<br>\r\n\"Wait!\" you hiss at him, lowering your weapon and ushering him closer to you. \"Wait.\"<br>\r\nHe smiles amusedly. Everything comes flooding back: the cries of the gathered, their tears, their blood, the acrid smell of banners burning in heaps alongside the dead, the officers in box formations, closing in, shoving black bags over their heads in terrible silence and practice. <br>\r\n\"Tell me something,\" you whisper, \"Are there many of you?\"<br>\r\nHe shakes his head, keeping your gaze.<br>\r\n\"What do you want from me?\"<br>\r\n\"Give me the key hidden on string under your jacket,\" he breathes, his face inches from yours.<br>\r\n\"I can't,\" you moan. \"They'll track it to me,\"<br>\r\n\"Linda,\" he says into your hair, \"Give me the key and follow me,\"<br>\r\nYou squeeze your eyes closed, trying very hard not to think of the acts of terror commited every day by those who share your badge.<br>\r\n\"Just leave it,\" he says, as though reading your thoughts \"Just leave it and come to us,\"<br>\r\nYour eyes snap open. You slide your hand inside your jacket.<br>\r\n</span></div></div>",
            "created":1181970000,
            "id":417313,
            "title":"Ancient History"
        },
        "132122":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Are you sure you want to join us?",
                "Are you prepared for what we have to show you?"
            ],
            "content":"<div class=\"\"><div> <span>You reach for the key on unassuming white string. You hand it to Jason he quickly pockets it and grabs your hand \"Come with me.\" He whispers<br>\r\n<br>\r\nYou enter the forest. The trees are bare perhaps representing the emptyness of current human exsistance, the lack of meaningful connections now parching the earth.<br>\r\n<br>\r\nYou and Jason run together for who knows how long, Finally you reach what looks like an abandoned summer camp.<br>\r\n<br>\r\nJason approchs one of the Longhouses and knocks three times in a pattern. The door opens a crack<br>\r\n<br>\r\n\"What's the password?\" Asks a gruff male voice<br>\r\n<br>\r\n\"YinYang\" Repiles Jason<br>\r\n<br>\r\nThe door opens fully Jason begins to enter, you hesitate<br>\r\n<br>\r\n\"Don't worry\" He says \"You'll be safe here\"<br>\r\n<br>\r\nYou enter the twilight of the longhouse you are amazed by what you see!<br>\r\n<br>\r\nMen and women together!<br>\r\n<br>\r\n\"Greetings\" Said an Older women \"I am Quenda the leader of the resistance\"<br>\r\n<br>\r\nJason stands next to you and holds the key aloft<br>\r\n<br>\r\n\"I have with me one of the nine keys! With the it we can show our new recruit our hisorical chamber.\"<br>\r\n<br>\r\nThe other men and women cheer you look to Quenda she looks at you serously and asks...</span></div></div>",
            "created":1205902800,
            "id":510537,
            "title":"No turning back..."
        },
        "1321222":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Help Jason with old files",
                "Help spread the word around"
            ],
            "content":"<div class=\"\"><div> <span>\"Yes\" You say \"I'm ready for what you have to show me.\"<br>\r\n<br>\r\nQuenda nods her dark haired head \"Very well\" She says \"Take her to the historical chamber.\"<br>\r\n<br>\r\nYou, Jason and the rest of the crew head out of one longhouse and head for another the door is securly locked but Jason takes your key and opens the door.<br>\r\n<br>\r\nThe inside is pitch black, you can't see anything suddenly you hear a click and turn around to see a projector has been turned on. You turn around again to see that the entire oppisite wall is a projector screen<br>\r\n<br>\r\n\"You might want to sit down.\" Says the gruff dark haired man who turned on the projector \"What you're about to see isn't gonna be pretty\"<br>\r\n<br>\r\nYou sit next to Jason and he says to you \"This is what we discovered in the vualts of the Men's Fortress\"<br>\r\n<br>\r\nYou watch the moving pictures on screen<br>\r\n<br>\r\nYou see a middle aged man in a white lab coat standing in a laboritory.<br>\r\n<br>\r\n\"June 3rd 2008\" Says the Scientist \"I have begun work on a great social experiment! I will divide man from woman to determane who is truly superior! I have rigged several radio stations to sublimanly broadcast both anti-male and anti-female hate speechs I have also contaminated several town's drinking water with mind altering drugs.\"<br>\r\n<br>\r\nThe Scientist moves over to a large computer \"Unfortuetly the effects are slow coming and I fear the conclutison to this experment will reveal it self when I am long dead. So I will upload my mind into this computer to preserve my consiousness long after my body has decopmposed...\"<br>\r\n<br>\r\nThe film cuts off from there... This whole experiance has left you feeling confused<br>\r\n<br>\r\n\"So... this whole war this whole revolution is nothing more than some nut-job's experment?\"<br>\r\n<br>\r\n\"I'm afraid so.\" Said Quenda \"This whole war is nothing more but an experiment in hatred.\"<br>\r\n<br>\r\nShe gestures to the man who turned on the projecter \"Boq discovered that anchiant film when he was working for the Men's army. He joined us after seeing the film.\"<br>\r\n<br>\r\nJason approaches you<br>\r\n<br>\r\n\"You now have a choice. Do you want to join me in uncovering old files? Or do you want to help spread the truth?\"<br>\r\n </span></div></div>",
            "created":1206075600,
            "id":511254,
            "title":"The Conspirasy"
        },
        "133":{
            "choices":[
                "To tranquilize the woman and keep her to himself",
                "Lower his tranquilizer and try to talk to the woman",
                "Run away. More women are in the area"
            ],
            "content":"<div class=\"\"><div> <span>Jason was out patrolling the area that the colonel had assigned him to. As he walked his hefty middle swayed side to side. Jason wasn't always a 600 lb. man, but he signed up for special ops unit called Brasher. Men who signed up for the brasher team were required to put on a lot of weight so they would be harder to kidnap if a woman came by. Also each member of the Brasher unit were essentially fat super soldiers. Unlike ordinary fat men, Brasher men exercise to enable better mobility and to increase their strength. They were also injected with an experimental serum that prevented them from tiring easily.<br>\r\n<br>\r\nThirty minutes into his patrol he heard rustling in the bushes. No doubt that it was a woman. Jason readied his tranquilizer gun, however upon seeing the woman he froze. She was the most beautiful creature he had feasted his eyes upon. Fortunately the woman was also shocked at seeing a large and hefty man stand in front of her. Both Jason and the woman stare awkwardly at each other. Jason then decides...</span></div></div>",
            "created":1469757900,
            "id":2187694,
            "title":"Love at First Sight?"
        },
        "134":{
            "choices":[
                "a man wake you up and ask you on a date",
                "you hear somthing close by"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Linda was a female and she was at lest 230lbs and she was verry pretty.she was grading a town close by. she know there are no men close by so she falls asleep.<br>\r\n<br>\r\nwhat happins next </span></div></span></div>",
            "created":1181278800,
            "id":414419,
            "title":"Linda meet her first man"
        },
        "135":{
            "author_id":"jawmax",
            "author_name":"Jawmax",
            "choices":[
                "Engine trouble.",
                "Pick up distress signal."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Jason at a healthy 400lb. was flying on a routine patrol. Suddenly...</span></div></span></div>",
            "created":1111035600,
            "id":240450,
            "title":"A routine patrol?"
        }
    },
    "info":{
        "author_id":"jawmax",
        "author_name":"Jawmax",
        "brief_description":"Choose to fight for men or women or be a pair of lovers trying to end fighting.",
        "created":1099446240,
        "description":"<td align=\"left\" class=\"norm\">Choose either Male or Female in this battle of the sexes. Or be a young couple who want to end the fight so they can be together. All three will have a weight gain option. No Gay/Lesbain stuff.</td>",
        "id":904753,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1496934720,
        "modified":1496934720,
        "pretty_title":"The Ultimate War of the Sexes"
    }
}