{
    "chapters":{
        "1":{
            "author_id":"murph1204",
            "author_name":"smurf1204",
            "choices":[
                "francine grow or shrink",
                "Hayley(grow/shink",
                "Steve(shrink)",
                "Stan(shrink)",
                "Jeff(shrink)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who shinks or grows</span></div></span></div>",
            "created":1373778000,
            "id":1628127,
            "title":"THE START "
        },
        "11":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Francine Grows",
                "Francine Shrinks",
                "Francine Finds a Size Ray"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Francine Grow or Shrink?</span></div></span></div>",
            "created":1436331600,
            "id":2005137,
            "title":"francine grow or shrink"
        },
        "112":{
            "author_id":"inwowno",
            "author_name":"Inwowno",
            "choices":[
                "1 foot",
                "6 inch",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How small does she get</span></div></span></div>",
            "created":1459400400,
            "id":2125670,
            "title":"Francine Shrinks"
        },
        "1123":{
            "author_id":"samthefatman",
            "author_name":"SamTheFatMan",
            "choices":[
                "3 inch",
                "Smaller"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>3 inches? Or smaller?</span></div></span></div>",
            "created":1596492420,
            "id":2880281,
            "title":"Other"
        },
        "11231":{
            "author_id":"samthefatman",
            "author_name":"SamTheFatMan",
            "choices":[
                "Hayley",
                "Steve/Stan"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Francine shrinks to three inches and wakes up to see a giant<br>\r\n</span></div></span></div>",
            "created":1596492480,
            "id":2880282,
            "title":"3 inch"
        },
        "113":{
            "author_id":"samthefatman",
            "author_name":"SamTheFatMan",
            "choices":[
                "Stan",
                "Steve",
                "Hayley"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does she shrink?</span></div></span></div>",
            "created":1596488820,
            "id":2880254,
            "title":"Francine Finds a Size Ray"
        },
        "1133":{
            "author_id":"coolsterly64",
            "author_name":"Hunter",
            "choices":[
                "Francine Shrinked Roger"
            ],
            "content":"<div class=\"\"><div> <span>Hayley: Why would you shrink me?!!!!!!!!!!!!!! I thought we were cool mom and now turn me back to my normal size right now!!!!!!!!!<br>\r\nHayley: And why I’m in your bed?!!!!!!!!<br>\r\nFrancine: I feel like I just want to have to have some fun with you.<br>\r\nHayley: How’s turning me small is having fun?!!!!!!!!!<br>\r\nFrancine: You’re see. Francine puts her smelly feet on Hayley’s face and make her very nauseous because of the smell of Francine’s feet. <br>\r\nHayley: I (gagged) going (gagged) to (gagged) throw (gagged) up!!!!!!!!!! (gagged) Francine is still putting her smelly feet on Hayley’s face.<br>\r\nFrancine: You’re acting like my feet are the smelliest but truly I just don’t know just yet. Francine is still putting her smelly feet on Hayley’s face.<br>\r\nHayley: Your (gagged) smelly (gagged) feet (gagged) gives (gagged) me (gagged) a (gagged) headache (gagged) Hayley is puking and feeling very dizzy for 3 hours because of the smell of her mom’s feet.<br>\r\nFrancine: Ok Hayley smell my stomach turning morning breath because I decided not to brush my teeth last night. Hayley sniff her morning breath  and it made her even more very nauseous than her stomach turning smelly feet.<br>\r\nHayley: (gagged and puked)<br>\r\nHayley: Please turn me back to my normal size please because if you don’t do it I will never forgive you ever!!!!!!! Francine just turned Hayley back to her normal size.</span></div></div>",
            "created":1598334180,
            "id":2891005,
            "title":"Hayley"
        },
        "11331":{
            "author_id":"coolsterly64",
            "author_name":"Hunter",
            "choices":[
                "It Depends What Happened To The Next America Dad Episode"
            ],
            "content":"<div class=\"\"><div> <span>That story it’s based on The Chilly Thillies because I think Francine and Klaus are mad at Roger for almost killing them by using his alien sleeping powers so they could die despite they knew Roger did it just for his anger issues also Francine felt kind of bad for hurting his feelings in that episode but it truly doesn’t mean Roger should do that to his two closest friends named Francine and Klaus.<br>\r\nRoger: Hey Francie how’s it hanging?<br>\r\nFrancine: Pretty good but there’s something I need for you to do.<br>\r\nRoger: Like what?<br>\r\nFrancine: Hold still.<br>\r\nRoger: But why. Francine just hit Roger with a shrink ray just to teach him a lesson.<br>\r\nRoger: Why I’m so small?<br>\r\nFrancine: Because when you turned green you almost killed me and Klaus with your sleeping powers and you didn’t even say sorry!!!!<br>\r\nRoger: Ok I’m sorry!!!!<br>\r\nFrancine: Not good enough!!!!!<br>\r\nRoger: Listen are we still best friends?<br>\r\nFrancine: We are but I’m still very mad at you about that situation.<br>\r\nFrancine: Now let’s play a game.<br>\r\nRoger: What game are you talking about?<br>\r\nFrancine: That game is called throwing you like so many times until you throw up!!!!! Francine is doing that to Roger felt nauseous because of it.<br>\r\nFrancine: And now your going to say that size for 1 hour because you made me and Klaus fall asleep for 1 hour also almost killed us!!!!! Roger is that size for one hour and Francine just turned Roger back to his normal size.<br>\r\nFrancine: Ok Roger I forgive you but don’t you ever do that again!!!<br>\r\nRoger: I glad we’re still best friends again and I glad we just did the do the Barry dance when we were at the airplane.<br>\r\nFrancine: Thank you for saying that Roger and yes we’re still best friends Roger but I just have to teach you a lesson.<br>\r\nRoger: You’re welcome</span></div></div>",
            "created":1598416020,
            "id":2891574,
            "title":"Francine Shrinked Roger"
        },
        "113311":{
            "author_id":"coolsterly64",
            "author_name":"Hunter",
            "choices":[
                "It Depends What Happened To The Next America Dad Episode"
            ],
            "content":"<div class=\"\"><div> <span>It’s based on the episode called Dammmm, Stan. Francine decided to shrink Stan because she is still upset with Stan for messing up her fishing water.<br>\r\nFrancine: Hey Stan. Francine shrieked Stan.<br>\r\nStan: Unshrinking me at once.<br>\r\nFrancine: No your going to stay like this for a few hours.<br>\r\nStan: Thank you for unshrinking me!<br>\r\nFrancine: You’re welcome and don’t be that selfish again!<br>\r\nStan: I promise.</span></div></div>",
            "created":1599210240,
            "id":2897253,
            "title":"It Depends What Happened To The Next America Da..."
        },
        "12":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Grow ",
                "Shrink ",
                "Grow and Jeff come in the room ",
                "Shrink and Roger come in the room and he was in woman costume",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So did Haylay Grow or Shrink?</span></div></span></div>",
            "created":1449464400,
            "id":2071622,
            "title":"Hayley(grow/shink"
        },
        "122":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Penishole ",
                "Fake woman vagina",
                "Butthole"
            ],
            "content":"<div class=\"\"><div> <span>Haylay was write in her dairy but then sudden she quickly shrink as she freak out because and then Roger come wear one of his costume be woman, and Haylay scream for Roger tried get attention. Roger look down and saw Haylay who was very tiny as he pick her up and said Oh hello dear Haylay, you just time to feel my baby kick inside me, as push her against my belly. <br>\r\n<br>\r\nHaylay: I yell \"ROGER YOU NOT PREGNANT!\" as he said Oh you right not pregnant I wear costumes which make me look like pregnant, as I yell \"LOOK IT ALRIGHT TO PRETEND YOU ARE SINGLE WOMAN WHO IS PREGNANT BUT YOU NEED TO HELP ME GET BACK TO MY NORMAL SIZE. <br>\r\n<br>\r\nRoger: I look at Haylay for few min until sudden I have idea, as I slowly lower Haylay down into my pantie. <br>\r\n<br>\r\nHaylay: I yell \"ROGER NOT PUT ME INSIDE YOUR PANTIES! as he said THAT JESSICA WIND TO YOU YOUNG LADY AND ALSO YOU BE GOOD! and with that Roger drop me inside his pantie, and I was push against his?</span></div></div>",
            "created":1449637200,
            "id":2072340,
            "title":"Shrink "
        },
        "13":{
            "author_id":"ajbomb333",
            "author_name":"AJBOMB",
            "choices":[
                "francine",
                "hayley",
                "akiko",
                "aunt gwen",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>steve woke up to find that he was shruken in his bed even worst was that there was a giant,,,,,,,,</span></div></span></div>",
            "created":1420520400,
            "id":1914276,
            "title":"Steve(shrink)"
        },
        "131":{
            "author_id":"crazyjtn",
            "author_name":"crazyjtn",
            "choices":[
                "find haley",
                "get moms attention ",
                "try and enjoy himself "
            ],
            "content":"<div class=\"\"><div> <span>Steve stared in awe at the size of what was once simple sheets on a bed. He turned a complete 360 looking at the hilly ,distorted, and soft landscape. Then the question rose to steve , \"Why am i so much higher than the rest of the sheets?\" all of a sudden a giant earthquake came underneath his feet causing him to lose his balance and tumble.He picked up his tiny glasses and looked behind him and saw the large blonde area above the sheets. Steve recognized that color and relized where he was, he was stnding on his mothers ass and the earthquake was only her repositioning herself. His heart dropped, he didn't know What to do whether to climb down the bed and get Haley, try and get his mother's attention or try and experience some of his life long giantess fetish on his mother.</span></div></div>",
            "created":1428814800,
            "id":1963277,
            "title":"francine"
        },
        "1311":{
            "author_id":"global.com",
            "author_name":"Nigel2002",
            "choices":[
                "Her butt",
                "Her pussy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He went to haleys room climbed her bed and saw her feet he went over to her feet and licked her toes</span></div></span></div>",
            "created":1546059600,
            "id":2595459,
            "title":"find haley"
        },
        "13111":{
            "author_id":"global.com",
            "author_name":"Nigel2002",
            "choices":[
                "Go to her taint",
                "Go to her stinky pussy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After steve finishes with her feet he went to the back of her panties and started to lick her butthole and started to french kiss it haley felt this and farted and scratched butt and rubbed her butthole with her finger steve then</span></div></span></div>",
            "created":1555650000,
            "id":2646645,
            "title":"Her butt"
        },
        "1312":{
            "author_id":"newlroland22",
            "author_name":"Rolly",
            "choices":[
                "Into Francine’s Bowl of Popcorn",
                "Onto the Couch",
                "Next to Francine’s feet on the Coffee Table"
            ],
            "content":"<div class=\"\"><div> <span>Steve tries to get Francine’s attention but she is watching a movie in the living room and has a bowl of popcorn in her lap. Steve realized that in order to get his mother’s attention he must climb her. Steve gets to the couch and wonders how he will get up, but he the notices his mother’s feet hanging and begins climbing. While climbing Francine kicks her feet up onto the coffee table unknowingly launching Steve into the air. Steve is now falling...</span></div></div>",
            "created":1604430840,
            "id":2933922,
            "title":"get moms attention "
        },
        "13121":{
            "author_id":"newlroland22",
            "author_name":"Rolly",
            "choices":[
                "Francine doesn’t hear him and puts him in her mouth.",
                "Francine hears him."
            ],
            "content":"<div class=\"\"><div> <span>Steve plummets right into his mother’s popcorn bowl. He realizes where he is and has a look of horror on his face as he sees Francine’s hand reaching right where he is. He is lifted up in the air and heading towards Francine’s hungry mouth as he cries out “MOM IM IN YOUR POPCORN DON’T EAT ME.” But...</span></div></div>",
            "created":1604467200,
            "id":2934182,
            "title":"Into Francine’s Bowl of Popcorn"
        },
        "131211":{
            "author_id":"newlroland22",
            "author_name":"Rolly",
            "choices":[
                "Manages to dodge out of the way of her teeth, but",
                "Doesn’t move fast enough "
            ],
            "content":"<div class=\"\"><div> <span>Steve lands in his mother’s mouth. He is panicking and trying to find a way out but realizes it’s too late. His best bet is to just hold on tightly to her tongue for as long as he could however that would not do him good for long as he is covered in saliva he begins slipping and tries to get up but Francines tongues launches him towards her teeth with the rest of the pop corn as his mother’s teeth comes crashing down on him he...</span></div></div>",
            "created":1604503500,
            "id":2934406,
            "title":"Francine doesn’t hear him and puts him in her..."
        },
        "1312111":{
            "author_id":"newlroland22",
            "author_name":"Rolly",
            "content":"<div class=\"\"><div> <span>Steve lands on his mother’s tongue and his swallowed shortly after. Steve is sent down Francine’s throat and ends up falling into his mother’s stomach. Steve in a panic begins to struggle and try to escape. Francine feels her son’s struggle and it makes her very horny and she starts master baiting. Steve gives up and starts to cry as he is quickly getting digested by his own mother. Francine’s stomach acids dissolve her son so the only thing that was left of him was what was in her toilet the next day. The End!</span></div></div>",
            "created":1605126480,
            "id":2938540,
            "title":"Down the hatch"
        },
        "131212":{
            "author_id":"newlroland22",
            "author_name":"Rolly",
            "choices":[
                "Drops Steve right into her mouth ",
                "Has a different idea"
            ],
            "content":"<div class=\"\"><div> <span>Francine heard her son and look closer into her handful and sees Steve. She realized she almost ate him and apologizes to him and asks how he got so small and how he even ended up in her popcorn. Steve trying to catch his breath explained what had happened, but as he is explaining he starts looking at his giant mother’s beautiful face and since he is no longer in danger when he talks about almost getting eaten he unknowingly starts to get a boner. Francine however notices his visible excitement and gets very angry about it. Steve tries to explain but he is interrupted as Francine angrily says “ you little pervert I don’t believe you at all, I bet you shrunk yourself to spy on me, you’re own mother! You disgust me and you will be punished like the pervert you are!” Before Steve can say anything he is lifted high in the air and is hovering above his mother’s mouth. Steve screams out “Noooooo” As his mother says this is the end little pervert and....</span></div></div>",
            "created":1604504760,
            "id":2934427,
            "title":"A concerned parent"
        },
        "1313":{
            "author_id":"crazyjtn",
            "author_name":"crazyjtn",
            "choices":[
                "inbetween her cheeks",
                "the dodge game"
            ],
            "content":"<div class=\"\"><div> <span>Steve couldn't ignore his urges or the fact that this was his life long dream , maybe not with his mother but still, he had to enjoy this while he could. He then began to trek up his to the top of the sheets. Steve had been walking for almost 30 minutes  and had almost reached the top of the sheets when the alarm clock buzzed Francine then jerked awake and sat up causing her son to fall behind her ass. When Steve hit the bed he relized what a dangerous position he was in due to the fact how gassy  his mother he was and how easily she could sit on him. Steve's fetish got the best of and before his mother could get up and started kissing her panty covered ass repeatedly. Francine secertly felt this and let out a slight smirk knowing exactly what it was. Francine had stolen the shrink after going through steves breowser history and discovering the giantess porn. She wanted her son to actually be able to experience his impossible fantasy. Back on Francine's ass Steve was getting bounced and rubbed up and down with every step. This caused steve to dry hump Francine's perfect butt cheek with each step. \"Can't get you to excited yet now can,\" Francine says with a evil smirk. Two large fingers come towards Francine's ass and pick up Steve. She brings steve to her face and asks \"How  was the ride ?\" Steve starts sweating due to the awkward situation he had been put with his mother \"You know I've been working on a little dance you might like \" Steve's awkwardness was replaced with excitement \"but theres a very adult choice you're going to have to make \" she winks . \"You either spend the dace in between mommy's sweaty buttcheeks ,and trust me ive been holding all this gas in for two day it'll come out with all that motion, you can even spend it in on the floor watching every sensual and sexy sway but you'll have to avoid my big sweaty feet,\" she wiggles her dirty and wet toes for effeffect. \"What will it be ?\"</span></div></div>",
            "created":1428814800,
            "id":1963304,
            "title":"try and enjoy himself "
        },
        "13131":{
            "author_id":"crazyjtn",
            "author_name":"crazyjtn",
            "choices":[
                "Starts dancing",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Steve's gut was doing backflips he didn't know what to do. His own mother was staring at him lustfully her eyes narrowed her mouth curved into a twisted smile waiting for his answer. \"I.. I don't know.\" his voice cracking and breaking as he spoke. Francine tilts her head \"Tell mommy what all those little fantasies you have, involved.\" Steve gulps and starts turning red not wanting to give away his secret. \"Steve I'll give you to the count of 3 to tell me where you wanna be during this dance or I'll swallow you alive!\" Steve's heart stops and tries to decide where he would rather spend his next few minutes. \"1\" Steve gets out of his trance and can't seem to think properly \"2\" Steve begins to try to answer but can't make a sentence \"uh uh uh uh\" Francine sticks her giant pink slimy tounge and rubbed it up and down her son's body she moans with pleasure, \"mmmm thre-\" \"ASS\" Steve tells in absolute terror. Francine gives him a kiss and says \"good choice little man,\". Francine lifts up the back of her laced night gown and pulls back her pink panties and slowly lowers her son to the dark ,humid ,and wet crevice. Steve looks in horror and excitment as he looks in between his mother's giant white ass cheeks. As he approaches the orbs his mother let out a little playful fart , \" there's more where that came from ,\". Steve is wedged near the center of Francine's ass and gets a face full of ass sweat .</span></div></div>",
            "created":1434862800,
            "id":1996691,
            "title":"inbetween her cheeks"
        },
        "131312":{
            "author_id":"robobroxt",
            "author_name":"robobroxt",
            "choices":[
                "She has to go to the toilet",
                "She gets hungry",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So maybe she does this?</span></div></span></div>",
            "created":1466226000,
            "id":2166324,
            "title":"Something else"
        },
        "1313121":{
            "author_id":"s124",
            "author_name":"s124",
            "choices":[
                "Poop",
                "Pee/Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does Francine need the toilet for?</span></div></span></div>",
            "created":1469768400,
            "id":2188280,
            "title":"She has to go to the toilet"
        },
        "13131211":{
            "author_id":"crazyjtn",
            "author_name":"crazyjtn",
            "choices":[
                "Become a part of it",
                "Have seconds"
            ],
            "content":"<div class=\"\"><div> <span>\"Ughhh change of plans Steve,\" Francine says gripping her stomach. She begins walking through her house each step grinding Steve that much deeper into her ass. Francine finally reaches the toilet in time for a very large gurgle to make itself known \"Oh my god Steve you're going to love this\" as an evil grin starts to appear across her face. Steve was to busy to notice what was going on here was living out his sexual fantasy in his mother's sweaty posterior he couldn't control his urges. He was licking and humping everything in his reach tasting the sweat from his mother's ass cheeks and sliding his member up and down it. He eventually plants his face on his mother's giant asshole and licks all over it and tries to breathe in the scent and burn it into his memory then a light came shining from above him it was near blinding. As he shielded his eyes from the light a shadow appeared and it slowly grew nearer Steve in a panic tries to borrow deeper into his new home the a large fart erupts from Francine's asshole knocking him backwards into his mother's hand. He was pulled upwards to his mother's giant face she smiled menacingly at him and flirtatiously spoke \"What were you doing in there? It felt like you were definetly enjoying yourself' she said before giving him a slow long lick which caused Steve to shiver in extasy \"Did you like it in there? Did you enjoy the smell?\" Steve nodded excitedly \"Good I've got something that'll drive you mad then.\" She drops Steve unceremoniously into the cold deep water. Steve rushes up for air \"what are you doing!\" Francine doesn't bother to answer as she pulls off her sweat covered panties and lifts her gown and takes a seat. Steve is left in almost complete darkness staring upwards and treading water when suddenly what sounds like an explosion starts ringing and echoing through the bowl. Steve recognizes the scent and feels his member immediately stiffen as his mind goes back to where he wants was then a new sound starts coming through something slimy as if something is sliding. Then he's hit by what felt like a bus that knocks him completely underwater. He comes floating back up stuck to the end of this object as it bobs through the water. While Steve is pulling himself free the scent hits him much stronger and potent than what he's used to smelling he gags but doesn't realize why he's still stiff. While in thought another log comes crashing down then another and another causing the water to splash around violently and it seemed to never end but the longer he was in here the more turned on he got he began to rub himself again to the slimy log he was having to hold onto for dear life. It was warmer and softer the deeper he got the feeling was amazing and the smell was becoming orgasmic he continued to thrust into the log and even licked it and kissed it he started chewing it and just before he could finish a blinding light hits him again interrupting his sick and disgusting acts. He stared ashamed at his mother who laughed evily \"If you lovever my shit so much why don't you...</span></div></div>",
            "created":1487739600,
            "id":2281011,
            "title":"Poop"
        },
        "1313123":{
            "author_id":"deepdark505",
            "author_name":"Dew mark",
            "choices":[
                "Fart",
                "Star squishing him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She begins to</span></div></span></div>",
            "created":1483160400,
            "id":2257256,
            "title":"Something else"
        },
        "13131231":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "does the dance right now",
                "shoves Steve right into her ass",
                "takes Steve back out for something else"
            ],
            "content":"<div class=\"\"><div> <span>And so, Francine grunted and lets out a big fart allowing Steve to take it all in. Normally, he would’ve been yelling and begging his mother to stop this right now. But, thanks to his urges from his fetish, he was actually enjoying his mom’s gas as much as he’s scared of it. He can feel his “little friend” getting harder from this experience as Francine continues to fart.<br>\r\n<br>\r\nAfter that, Francine</span></div></div>",
            "created":1551675600,
            "id":2626186,
            "title":"Fart"
        },
        "13132":{
            "author_id":"violetsly",
            "author_name":"darkjak45",
            "choices":[
                "Be crushed",
                "keeps dodging"
            ],
            "content":"<div class=\"\"><div> <span>I.....I want to watch on the floor! Steve said. Good choice, little man. Francine said. She drops steve on the floor and wiggles her toes right in front of him. You see how big my feet are? Anything under them don't last a second. They are killers.So don't get stomped and good luck, steve. She said. As steve gazes up at his mountain of a mother, her could feel a hard on coming as his mother stared her dance. Francine sways her hips and moves her body seamlessly. Steve was so caught into his mom's dance that he almost was crushed by his mom's foot. Pay attention down there or else. Francine said with a smile. Steve moved quickly. Dodging left, right back, and forth to avoid being crushed, but steve started to tire out. He tried to catch his breath, but Francine's feet kept landing close to him. Keep moving, Steve. I'm not done yet. She said. Francine was enjoying herself. With the dance and having a small person dodge her feet, she feels like a true giantess. She would have never known this if it wasn't for going through Steve's stuff. Steve couldn't keep up. Physical exertion was never his field. He thought about just standing still and let his mother just crush him. That was part of his giantess fetish. In fact, it was the ultimate part. Being crushed was the extreme point of his fetish and he's dreamed about, but would he willingly stand there and just be crushed? Francine did have nice feet. And she wasn't kidding about her feet being killers. Francine has never stan to kill any types of bugs because she would do it herself. The bugs unfortunate to be stomped were completely flat as paper. This isn't a dream. I can't wake up at the last second. If this happens, it's a one way trip. Steve said. Steve decides to.....</span></div></div>",
            "created":1492491600,
            "id":2306803,
            "title":"the dodge game"
        },
        "131321":{
            "author_id":"xcpro9x",
            "author_name":"Jui",
            "content":"<div class=\"\"><div> <span>Steve stood still and looked at her in awe and accepted what came next<br>\r\n<br>\r\n<br>\r\nFrancines foot swiftly and brutally landed on steve crushing him under her toes. She grinded him under her foot. She then flicked her hair put her shoes on and went downstairs<br>\r\n<br>\r\n<br>\r\nThe rest of steve would be washed down the drain when Francine takes a shower later that night.</span></div></div>",
            "created":1594184400,
            "id":2864496,
            "title":"Be crushed"
        },
        "133":{
            "author_id":"violetsly",
            "author_name":"darkjak45",
            "choices":[
                "Steve",
                "bug"
            ],
            "content":"<div class=\"\"><div> <span>Steve looks to see akiko. She was in her school uniform.Steve? Are you in here? She said. Steve remember he and akiko had plans for the day. I guess i'll wait for him. She said. Akiko sat down on steve's bed. Steve watches as akiko's giant butt loomed over him. He manages to move out the way, but the spring from the bed flings him into the air and land hard on the floor. Ow..... Steve said. Steve got up slowly and came face to face with akiko's bare feet. Steve could feel his fetish come on. Steve had a foot fetish and akiko's feet were big, by steve's perspective. Steve's fetish had hit him like a ton of bricks and he started to hump akiko's foot.<br>\r\n<br>\r\n<br>\r\nAkiko could feel something on her left foot. It was persistent. Something was repeatedly hitting her foot like there was no tomorrow. Akiko looks down to see...</span></div></div>",
            "created":1491886800,
            "id":2303165,
            "title":"akiko"
        },
        "134":{
            "author_id":"ricardo2902",
            "author_name":"cool",
            "choices":[
                "Mouth",
                "Cleavage",
                "Purse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As Steve looked up, he got immediately worried as his sexy aunt walked into his room. She seemed to be looking for him, but gave up and sat on his bed. This caused Steve to immediately fly into his Aunt's _____?</span></div></span></div>",
            "created":1469768400,
            "id":2188187,
            "title":"aunt gwen"
        },
        "1341":{
            "author_id":"dra90n68",
            "author_name":"Mladenovic5@live.com",
            "choices":[
                "Swallow",
                "Spit out",
                "Taste more of it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Going strait into Gwen's mouth, Steve landed on his Aunt's tongue. Gwen felt something in her mouth that taste sweet and had to deiced to swallow the strange object or sip it out?</span></div></span></div>",
            "created":1515906000,
            "id":2440922,
            "title":"Mouth"
        },
        "13411":{
            "author_id":"snack54",
            "author_name":"Snack44",
            "content":"<div class=\"\"><div> <span>Gwen loves the taste in her mouth. Without thinking twice, she just swallows the little thing. She closes her eyes to enjoy the taste on her tongue for a moment, her hand moving under her shirt to caress her stomach.<br>\r\n<br>\r\nMeanwhile, Steve moves down her esophagus. After a moment, he lands in his aunt's stomach. Steve was so excited, it was the hottest roller coaster he ever slid down and now he's inside his hot aunt. The little pervert didn't realize what danger he was in.<br>\r\n<br>\r\nGwen wondered what it was, but she came to the conclusion that it must be some toy figure of Steve. She wondered if she should give the toy back to Steve after it came out of her or if she should just sell it to another pervert, if she doesn't forget to look for it.<br>\r\nThen she leaves Steve's room to pursue other matters.<br>\r\n<br>\r\nSteve meanwhile, looks with naive fascination at the inside of Gwen's stomach. A meatball, which probably arrived just before Steve got here, aroused his interest. He took a close look at how Aunt Gwen's stomach juices were working on the meatball. \"What's it like to be a meatball?\" Steve asked himself and imagined landing on Gwen's plate like a meatball. He could probably watch a few other things disappear behind her horny breasts before being led to her sexy lips and sliding down her esophagus like any other food. That's when Steve's got it in for him, he was like the meatball. He was nothing more than food for Aunt Gwen and soon the digestive juices will add to him just like the meatball. Steve went to the stomach walls and drummed against them to draw attention to himself, but all that happened was that Gwen had to burp. Steve soon lost his strength and just before he lost consciousness, the image of Aunt Gwen on the toilet came to his mind. This put a smile on the pervert's face before he passed out.<br>\r\n<br>\r\nOver the next few hours Steve's body wanders through his aunt's digestive tract to be transformed into fat for her breasts and ass and the rest into poop.<br>\r\nThe next morning she doesn't remember the little sweet something she swallowed yesterday when she did her morning shit and so Steve's remains are simply flushed away from his aunt.Over the next few hours Steve's body wanders through his aunt's digestive tract to be transformed into fat for her breasts and ass and the rest into poop.<br>\r\nThe next morning she doesn't remember the little sweet something she swallowed yesterday when she did her morning shit and so Steve's remains are simply flushed away from his aunt.</span></div></div>",
            "created":1591419600,
            "id":2846636,
            "title":"Swallow"
        },
        "13413":{
            "author_id":"samthefatman",
            "author_name":"SamTheFatMan",
            "choices":[
                "Francine",
                "Hayley"
            ],
            "content":"<div class=\"\"><div> <span>Your Aunt Gwen moves you around in her mouth, tasting you with her hot, pink, slimy tongue. She feels all over your body, and she loves your taste. She takes you out of her mouth to see what she was sucking on and she gasps. She says,\"Steve?! How'd you get so small? How did you end up in my mouth?\", and you tell her you woke up like this and flew out of the window into her mouth. She then says,\"Well, you taste delicious!\". She throws you back into her mouth and continues to suck on you and taste you. She loves your taste so much, in fact, that she decides she might want to share the taste with her sister, and your hot mom, Francine, or maybe her neice, Hayley.</span></div></div>",
            "created":1596491400,
            "id":2880270,
            "title":"Taste more of it"
        },
        "1343":{
            "author_id":"fred209m",
            "author_name":"Frede",
            "choices":[
                "Notice him",
                "She didn’t notice"
            ],
            "content":"<div class=\"\"><div> <span>He landed on his aunts sexy toes and was thinking about what to do. When he smelled her sweaty feet and saw how beautiful they really were with her long black toenails. Then he couldn’t control himself and he began sniffing his aunts toes and then began licking them and he couldn’t get enough. He loved the taste, the smell, the look and the how soft her toes were. He then took off his pants and began rubbing it against her toes not long after he came. When all of a sudden she moved he looked up to see if she had noticed him.</span></div></div>",
            "created":1552453200,
            "id":2629823,
            "title":"Toes"
        },
        "135":{
            "author_id":"ricardo2902",
            "author_name":"cool",
            "choices":[
                "Mrs. Yoshido",
                "Lisa Silver",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these women?</span></div></span></div>",
            "created":1469768400,
            "id":2188178,
            "title":"other"
        },
        "1352":{
            "author_id":"bobe",
            "author_name":"bob",
            "choices":[
                "Is Steve alive",
                "Is he stuck"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lisa then walked into the room and crushes Steve underneath her ass </span></div></span></div>",
            "created":1480136400,
            "id":2242074,
            "title":"Lisa Silver"
        },
        "1353":{
            "choices":[
                "Roger",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about?</span></div></span></div>",
            "created":1560834000,
            "id":2675444,
            "title":"Other"
        },
        "13532":{
            "author_id":"samthefatman",
            "author_name":"SamTheFatMan",
            "choices":[
                "Hayley",
                "Family Guy Characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe Hayley?<br>\r\nOr will there be a crossover with Family Guy and he is shrunk by Lois or Meg?</span></div></span></div>",
            "created":1596430800,
            "id":2880253,
            "title":"Other"
        },
        "135321":{
            "author_id":"samthefatman",
            "author_name":"SamTheFatMan",
            "choices":[
                "Put you in her shoe",
                "Eat you/Something Else"
            ],
            "content":"<div class=\"\"><div> <span>You are just sleeping in your room one saturday morning when you wake up to find something is different. Your bed feels a lot bigger, so you get up and are shocked to realize that you have shrunken!<br>\r\nBased on your surroundings, you quickly deduce that you are currently only three inches tall. You look around the room, trying to see if there is any way to get help. <br>\r\nIn that instant, your hot big sister Hayley walks into your room. As she is walking in she asks,\"Steve, have you seen my money I left on the Coffee Table?\", and then she looks at your direction. She then mutters to herself,\"What is that?\", and walks over to you. <br>\r\nShe sees you and says,\"Steve? Is that you? How did you get so small?\", and you say you don't know. She then asks if anyone besides her knows you shrunk, to which you reply no.<br>\r\nShe then says,\"Good, then let's have some fun.\".<br>\r\nThis makes you nervous because she then gets a very devious smile on her face that gives you the chills. She says,\"Okay, we can do a lot of things together.\".<br>\r\nWhat does she do with you?</span></div></div>",
            "created":1596492060,
            "id":2880278,
            "title":"Hayley"
        },
        "1353212":{
            "author_id":"samthefatman",
            "author_name":"SamTheFatMan",
            "choices":[
                "Eat you",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, does she eat you?</span></div></span></div>",
            "created":1596492120,
            "id":2880279,
            "title":"Eat you/Something Else"
        },
        "14":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Eat him",
                "Torture him ",
                "Make videos of do gross thing to him",
                "Insert him into his new vagina",
                "Do something else "
            ],
            "content":"<div class=\"\"><div> <span>Stan was relax in the living room but then he heard noises coming from the attic and knew it was Roger! He got up and went up stair! He see Roger, as he about yell at him when suddenly he felt body shrink! (After few min) Stan was size of ant as Roger pick up Stan and said Wow bug size of Stan! He yell \"ROGER YOU CHANGE ME BACK TO MY NORMAL SIZE RIGHT NOW!\" as Roger look at Stan and then he decide to?</span></div></div>",
            "created":1466139600,
            "id":2165722,
            "title":"Stan(shrink)"
        },
        "143":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "Stan was making a run for it",
                "Francine was coming in",
                "Hayley was coming in"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh no Stan your not the one who is in charge anymore, instead I am the one who is in charge of you. You have been saying to me all week that since your the biggest, that make you in charge. But now your the smallest which means, you Stan will be listening to me. Now I think its time we have fun with your new size\" Roger says this to you, while clenching you very tightly in the aliens grip. The whole way up to the attic you were struggling in the tight grip. Roger who has been ignoring your struggling, drops you into a jar then walks over to the other side of the aliens room. Roger picks up a video camera, then walks back over to the jar that Stan was in and re-grab him into the tight grip.<br>\r\n<br>\r\n\"Okay Stan now I bet your wondering what I have plan for you, so I was thinking we make a movie. Called the adventures of tiny Stan, Starring Stan himself\" Roger said this to you with a big grin. Stan then responds with \"No way, Roger I don't want to be in your crappy movie. Now grow me back...\"  Roger cut Stan off. \"No Stan I am in charge, so what I say goes. Now tiny man It's time to see how far we can push your now gross new big world\". With that said Roger takes Stan down the hallway, but then stops at Hayley's room. Roger see's Hayley's worn out sandals laying on her floor.Upon seeing them Roger remembered that Hailey said she was going out for a run and might be awhile before she returns. And so with that knowledge Roger knew just the first gross obstacle that Tiny Stan will venture.<br>\r\n<br>\r\nRoger places Stan onto Hayley's sandal. Right as Stan was placed on the sandal he noticed the toxic odor emitting from the sole of the sandal that he was standing on. While standing on the squishy sweaty surface. Stan started to Look forward, he saw the huge area that made up Hayleys imprint in her sandal. He also noticed the gross toe jam, specks of dirt, and random pieces of Hayleys hair on the surface.<br>\r\n<br>\r\nStan looked up at Roger in anger \"Roger what the h***, WHY DID YOU PUT ME ON HAYLEY'S STINKY DIRT RIDDEN SANDAL?\". Roger just looked at Stan for a moment and then an idea came to the alien  as Roger said \"I got it, Stan this is the scene where your tiny and are desperate to eat anything. And oh look you see in front of you a feast of Hayley's scraps. a clump of toe jam, a puddle of her sweat in an indent, oooo toe nail clippings, and that loose fallen hair looks good to. Now Stan you go up and eat as much as you can handle. Now action...\". Upon hearing this Stan's anger was reaching new heights, but since Roger saw that he wasn't moving. The alien decided to take matters into its own hands. So right before Stan was able to speak out against Roger. He was grab and then forced head first into the puddle of sweat.<br>\r\n<br>\r\n\"Like this Stan om om om yum good right Stan...\" Roger kept saying to this to Stan who was forced to consume the sweat made from his daughter.  Roger finally let go and Stan was trying his best cough up the disgusting taste of Hayley's nasty sweat. \"Now lets move on, to the toe jam, or would like to be forced head first into that as well?\" Roger asked Stan with a grin. Stan decided it was best just to eat some of it the be forced to that routine again. The nasty texture mixed with the disgusting taste made Stan instantly throw up...<br>\r\n<br>\r\nAt this point Roger was laughing at now humiliated man that was consuming remains from his own daughter. Roger then decided that it was so funny that he/she needed to rematch the video that was just taken. But while Roger was re watching it, he/she didn't even notice that...<br>\r\n<br>\r\n</span></div></div>",
            "created":1554267600,
            "id":2639414,
            "title":"Make videos of do gross thing to him"
        },
        "1431":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "Blond hair girl",
                "jeans girl",
                "Too late!!! Stan waits to long and the bell rings"
            ],
            "content":"<div class=\"\"><div> <span>Seeing his opportunity Stan makes a run for Hailey's door. Roger is so busy laughing at the footage that he doesn't even notice that his one actor is making a run for it. Making it to the door no problem Stan continues his runaway, hearing behind him Roger yelling. But right as Roger leaves the room Hailey is walking down the hallway, finishing her run, in bare feet towards the shower. She see's Roger and stops him with the sound of her voice. This loud noise stops even Stan for a moment who looks up to see his daughter charging towards Roger in anger for him being in her room.<br>\r\n<br>\r\nHer foot comes down right on top of Stan, he is instantly covered in her fresh sweat and toe grime. Luckily for him though the rug floor and Hailey's soft foot wasn't enough to kill him. As she continued walking leaving her dad on the floor. Not even noticing that she even stepped on him. At this point Stan notices that Roger is a bit busy trying to think of an excuse for being in her room. He was a bit dazed from just being stepped on and the pain was ringing like a bell through his body. He ended up tumbling himself into Steve's back pack and knocking out.<br>\r\n<br>\r\nThe next thing that Stan knew that he heard the sound of a locker being closed as Steve walks away to his next class. Stan  looks up for any way out. His luck has continued as he notices that the zipper is undone. He starts to get his footing in the bag and climbs a binder up and through the zipper hole. He notices that he is just close enough to a hole in the top of the locker  as well. So using his CIA training he is able to easily swing himself out through the hole and onto the floor of the high school.<br>\r\n<br>\r\nStan sees's the messing floor of the school and is disgusted about how messy these student's can be. Doing his best to ignore it, the thought he thinks that it might be a good idea to get some help. Looking down the hall he see's a girl wearing jeans and a white crop top (<a rel=\"nofollow\" href=\"https://americandad.fandom.com/wiki/Amy_\" target=\"_blank\">https://americandad.fandom.com/wiki/Amy_...</a>(Merlot_Down_Dirty_Shame)). Then turning around he see's the next closet person to him being a girl with blond hair, platform sandals, and pink crop (<a rel=\"nofollow\" href=\"https://americandad.fandom.com/wiki/Hayden_Panettiere\" target=\"_blank\">https://americandad.fandom.com/wiki/Hayd...</a>). Looking at these two student Stan stands there for a moment considering which one would be a good idea to grab there attention from...</span></div></div>",
            "created":1555909200,
            "id":2648639,
            "title":"Stan's escape"
        },
        "14311":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "Stan is her new Julie (her doll)",
                "Stan will become Julie's new boyfriend",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size4\" style=\"\">The blonde girl (<a rel=\"nofollow\" href=\"https://americandad.fandom.com/wiki/Ashley\" target=\"_blank\">https://americandad.fandom.com/wiki/Ashl...</a>) looked like a smart girl Stan thought as he is now desperate to get help from someone of right mind. Stan makes his way over to the girl passing by the paper balls, pens and pencils that were dropped, dust, lost hairs, and other nasty messes on a school floor. Making it to the girl safely, Stan looks up at the blonde beauty noticing right away that she with her platform sandals on makes you only come up to just below her ankles.<br>\r\n<br>\r\nThe girl at this point, just seems to be rummaging through her locker. Stan who is desperate for help and sick of feeling small just starts banging on her ankle while screaming up to her. In which the girl feel's Stan and look's down to see his tiny form. At first she thought he was a bug but in an instant she felt her eyes were playing tricks on her as she saw that the bug looked like a tiny man. Or more like a doll she thought as she gave a smile and then had to confirm that Stan was real by reaching down to pick him up. <br>\r\n<br>\r\nStan is forcefully grabbed into the young girl's hand as she begins talking \"Woa you are real *giggles* and cute. My name's Ashley Whats your name little guy?\". Stan not wanting to be rude say's \"Listen my name is Stan and I need you to get me to my son Steve. Seeing the way you look, you probably don't know...\". Ashley stop's Stan's talking with her giant finger. She knew of Steve but didn't really care for what the tiny man had to say. She just respond's to Stan saying \"Okay Stan well we can talk after school is over but no I need to get to my class she say's as Stan is forcefully shoved  into her bag and locked inside with the zip of her zipper.<br>\r\n<br>\r\nStan found out quickly that there was no escape from the girl's backpack and was forced to sit and wait out his fate. As Ashley finishes her final class and then heads home she thinks about what your new role is going to be.</font><br>\r\n<br>\r\n(What does she have in mind for Stan?)</span></div></div>",
            "created":1585285200,
            "id":2808417,
            "title":"Ashley the doll lover"
        },
        "1432":{
            "author_id":"blackston22",
            "author_name":"guy14",
            "choices":[
                "tie Stan in dirty underwear",
                "play with Hailey's sandal some more",
                "go to Francine's room with Stan"
            ],
            "content":"<div class=\"\"><div> <span>Stan during this time was on all fours trying to get his energy back from just throwing up. And he tried to get back up to yell at Roger again he found it very difficult due to vibrations that acted like earthquakes knocking him back into the indent of Hailey's sandal. Stan who was confused about what was going on, looked up to see a giant Francine entering the room. Roger was a bit distracted by re-watching what he just shot on the camera, to notice Francine entering the bedroom.<br>\r\n<br>\r\n\"Roger? Why are you in Haley's room and what so funny?\" Francine asked Roger as she entered the bedroom holding a basket of dirty laundry. Upon hearing this Rodger's head turns towards Fraincine and says \"Oh *haha* I'm just having fun making a video with Stan...\" Francine interrupts when hearing this saying \"What do you mean Stan's not here?\". Roger quickly shuts his camera and then grabs Stan with a strong grip and with thinking fast says \"Oh I mean Franny I am.... filming with a Stan Doll....\".<br>\r\n<br>\r\nFrancine's face immediately lights up, \"Ooooo how cute, let me see Roger..\". Roger trying to look as cocky as one could says back \"No Franny I can't show you it. Because... its not done yet and that would ruin the whole experience when its actually done\" Roger looks at Francine hoping that she just buys that excuse. And to Roger's luck she did.<br>\r\n<br>\r\n\"Oh okay that makes sense Roger. I can't wait to see it when your done..\" After Francine said this she began to pick up Hailey's dirty laundry on her floor. Seeing this Roger thought that he could add an action scene to his movie by tie Stan up in one of Hailey underwear. And have him go through the wash. But then again Roger does think that Hailey's sandal scene is to much fun to just give up on right now.<br>\r\n<br>\r\nNoticing that Francine is just picking up the last of Hailey's laundry, Roger now has to think fast about what he is going to do next...</span></div></div>",
            "created":1555909200,
            "id":2648633,
            "title":"Francine was coming in..."
        },
        "145":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "Leave",
                "kick out the window ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of theirs options <br>\r\nChoice one Rodger leaves and another lady enters the room<br>\r\n<br>\r\nChoice two Rodger kicks Stan out of the window and stand lands in a lady's cleavage </span></div></span></div>",
            "created":1476248400,
            "id":2222353,
            "title":"Do something else "
        },
        "1452":{
            "author_id":"brevination",
            "author_name":"Brevination",
            "choices":[
                "Mel (whole slotta love)",
                "Gwen, Francine's sister",
                "Akiko, Steve's friends sister"
            ],
            "content":"<div class=\"\"><div> <span>Roger sent Stan flying. He went up passing birds, and feeling a slight breeze. Looking down, he saw roger get in the car and his family drove to the airport. \"See you guys in three weeks; and screw you Roger!\", Stan shouted. Then he feel back to earth, having been taken by gravity. He fell as he saw a car pull up, and he remembered that a girl was supposed to watch the house with him. Stan was hit by a bird on the way down, and then he sees boobs before making contact with them. Soft landing, one giving him a boner as his hands move around. \"Stan, that you? What happened?\", Stan heard as he looked up at the face of...</span></div></div>",
            "created":1501390800,
            "id":2362061,
            "title":"Pillows of fate"
        },
        "14522":{
            "author_id":"xkiba4lifex",
            "author_name":"Lover Of All Giantesses",
            "choices":[
                "To make Stan disgusted with her. For Francine's Sake.",
                "To make Stan hers. For Her Sake"
            ],
            "content":"<div class=\"\"><div> <span>Stan turns around on the giant bare breast that he landed on. He smiled as he saw his wife's hot Asian sister Gwen. Somehow. Someway. Stan has managed to convince his wife to let his troublemaking sister watch the house when they are all gone. That's why Stan borrowed some spy cameras from the CIA. \"Genius\" Stan said to himself<br>\r\n<br>\r\n\"Stan. Why are you so small?\" Gwen asked obviously confused. \"uhhhhhhhh.\" was all Stan manage to get out. He wasn't a quick thinker and he couldn't really tell her about the alien in the basement that shrunk him. So what does he do, He lies. \"I don't know Gwen. I'm just shrunken.\" Gwen looked at him and said \"Then how did you get on my breast?\" Gwen was getting suspicious. \"Well I fell out the window\" Stan said telling the truth this time. Gwen looked at him still suspiciously. Stan looked up at her beautiful Chinese face. That was until her hands enclosed around Stan.<br>\r\n<br>\r\nGwen walked into the house and dropped off her lougage In the guest room. All the while thinking about what she will do with Stan. It was obvious that he shrunk himself to spy on her or something perverted like that. Due to popular belief. She was never oblivious to her sisters husbands advantages. She just didn't want to bring it up because Stan's very attractive, and it's always a self esteem booster. She just was astonished that Stan would go this far.<br>\r\n<br>\r\nGwen sat down on the couch and breathed in preparing for what's coming next. She opens her palm and sees Stan. But this time his pants were off. After some moments of quiet Stan says \"I know this looks bad, but I can explain, it's just really, really hot in there\" <br>\r\n<br>\r\nGwen sighed at this and decided to put her plan into action<br>\r\n<br>\r\nWhat is her plan?</span></div></div>",
            "created":1505019600,
            "id":2383583,
            "title":"Gwen Is Housesitting"
        },
        "15":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Yes ",
                "No Let go with Roger ",
                "Let go with someone else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you sure want go with Jeff?</span></div></span></div>",
            "created":1449464400,
            "id":2071523,
            "title":"Jeff(shrink)"
        },
        "151":{
            "author_id":"derdane",
            "author_name":"der dän",
            "choices":[
                "Shrink to 2 inches (ca. 5 cm)",
                "Shrink to 4 inches (ca. 10 cm)"
            ],
            "content":"<div class=\"\"><div> <span>Jeff sat in Hayley's room and waited for Hayley. He picked up the bong from the floor, \"Where's my grass?\" Jeff asked, seeing a green packet lying on the floor and picking it up, but it was grass-manipulated grass that was supposed to shrink the director Stan was forced to put up with his fetish and Stan had to leave it in Hayley's room, Jeff started to smoke the grass and started to shrink to...</span></div></div>",
            "created":1534482000,
            "id":2534815,
            "title":"Yes "
        },
        "1511":{
            "author_id":"rampage77",
            "author_name":"rampage77",
            "choices":[
                "Haley",
                "Steve",
                "Roger"
            ],
            "content":"<div class=\"\"><div> <span>Jeff started to feel what started out as a mild high but then this quickly turned to a sickening feeling as the world around him expanded the bed he'd been sitting on became an unending tundra and and he realized that he was no more than 2 inches now in total height.<br>\r\n<br>\r\nSuddenly he heard what sounded like the dropping of bombs that shook him and saw _____ walking into the room.<br>\r\n</span></div></div>",
            "created":1562389200,
            "id":2682744,
            "title":"Shrink to 2 inches (ca. 5 cm)"
        },
        "15111":{
            "author_id":"rampage77",
            "author_name":"rampage77",
            "choices":[
                "Jeff",
                "the bong",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Walking in through the door was his cute and now giant hippie wife Haley. Jeff gazed in awe and they giant goddess before and trembled as her she approached the bong lying on the bed next to him. <br>\r\n<br>\r\nShe stopped at the foot of the bed, as if to examine the bong and study the situation, her giant shadow looming over Jeff. Looking directly forward he could see her now car sized navel and navel ring and realized that he was actually small enough to fit inside her belly button now. <br>\r\n<br>\r\nJeff started to back away when suddenly he saw her shadow blotted out all light and he then realized that she was stooping over to view something on the bed, but what???.....</span></div></div>",
            "created":1562389200,
            "id":2682746,
            "title":"Haley"
        },
        "151111":{
            "author_id":"rampage77",
            "author_name":"rampage77",
            "choices":[
                "Let's have some fun, babe!",
                "Roger comes in ",
                "Steve comes in"
            ],
            "content":"<div class=\"\"><div> <span>Jeff was shocked to then see the giant eyeballs of his wife fix their gaze upon him-each one looking like an individual creature that were casually studying him with the occasionally blink interrupting the scene. The monstrous girl then made a small smirk and scooped up her tiny boyfriend into her hand bringing him level to her face. <br>\r\n<br>\r\n\"Woah-babe! I guess what I heard about that grass being special wasn't an exaggeration\" she cackled. \"You small enough now to fit inside the bong OR my mouth-you'd better hope I don't get the munchies\" she said with a toothy smile. </span></div></div>",
            "created":1562389200,
            "id":2682749,
            "title":"Jeff"
        },
        "1511112":{
            "author_id":"rampage77",
            "author_name":"rampage77",
            "choices":[
                "Roger doesn't see you",
                "Rogers sees you",
                "Someone else come in"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly the episode with Jeff's wife is interrupted by the presence of another giant entering the room-Jeff looks at the door as a giant grey humanoid looking creature came into the room with his eyes fixed on Haley.<br>\r\n<br>\r\n\"Haley-what' this I hear about you having special grass and not giving me any\" he said in an annoyed voice. \"Stop hogging it all and share!\"<br>\r\n<br>\r\n\"Forget it Roger-there's none left\" Haley snapped back hiding Jeff behind her back on the bed, but if you're not picky-I have some normal stuff in my backpack I was saving for later...\" With that she left the room and disappeared leaving Roger in the room alone with Jeff.</span></div></div>",
            "created":1562389200,
            "id":2682753,
            "title":"Roger comes in "
        },
        "15111122":{
            "author_id":"rampage77",
            "author_name":"rampage77",
            "choices":[
                "Roger is a Dom",
                "Rogers is hungry",
                "Rogers holds you for ransom"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly Roger's bored glaze alters as his eyes widen the then walks over to the bed each step as thunderous and frightening as Haley's had been. <br>\r\n<br>\r\n\"Oh, crap-he must see me-I've got to ruuu..\" But before Jeff could run away-a giant long-fingered hand that made Haley's human giantess hand seem small enveloped the tiny man and brought Jeff to Roger's face.<br>\r\n<br>\r\n\"OMG-I can't believe it\" he smirked \"The special grass they were talking about was shrinking grass-we have some on my home planet but it's rare-I guess it's lucky for me I didn't have any-but not so lucky for you, huh? he sneered. With that-everything around him went dark as the enormous hand closed around Jeff and when the light returned he was in the attic (Roger's room) with the mischievous alien. </span></div></div>",
            "created":1562389200,
            "id":2682758,
            "title":"Rogers sees you"
        },
        "151111221":{
            "author_id":"rampage77",
            "author_name":"rampage77",
            "choices":[
                "Roger wants to play with the tiny human",
                "Just kidding-Roger really wants to eat the tiny human"
            ],
            "content":"<div class=\"\"><div> <span>Roger dropped Jeff and his bed and smiled down at the tiny human. \"You know-Jeff I have a fantasy about being a in complete control and power over someone-it's my ultimate fantasy. I've always though you were kind of cute-but at this height-you're just so vulnerable and adorable\" he laughed. With that the giant alien leaned over and extended his long snake-like tongue around Jeff coating him in slobber.<br>\r\n<br>\r\nJeff shrieked but then stopped as he realized the alien wasn't eating him but massaging him with the long warm tentacle of a tongue wrapping around him lifting him over Roger as the alien lied down on the bed. He then lowered Jeff onto his fat, but soft belly and retracted his tongue back into its cave. <br>\r\n</span></div></div>",
            "created":1562389200,
            "id":2682760,
            "title":"Roger is a Dom"
        },
        "153":{
            "author_id":"redf",
            "author_name":"Black hole",
            "choices":[
                "Klaus",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some more choices for you</span></div></span></div>",
            "created":1598829180,
            "id":2894736,
            "title":"Let go with someone else "
        }
    },
    "info":{
        "author_id":"murph1204",
        "author_name":"smurf1204",
        "brief_description":"AMERICAN DAD GTS SHRINK\r\namerican dad is the property of fox",
        "created":1373857800,
        "description":"<td align=\"left\" class=\"norm\">AN AMERICAN DAD SHRINK AND GIANTESS STORY<br>\r\nNO MALE GIANTS IF SOME ONE SHRINKS THE GIANT MUST BE A WOMEN <br>\r\nTHATS THE ONLY RULE </td>",
        "id":1943005,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1605126480,
        "modified":1605126480,
        "pretty_title":"American dad GTS/SHRINK"
    }
}