{
    "chapters":{
        "1":{
            "author_id":"celestia",
            "author_name":"Princess Celestia",
            "choices":[
                "mina's room",
                "Crystal's room",
                "Mom's room",
                "the kitchen",
                "the dining room"
            ],
            "content":"<div class=\"\"><div> <span>Carol was tired. she entered her room and flopped down on her bed. It had been a very long day at school and she was exhausted. she closed her eyes and in moments she was asleep.<br>\r\nhours passed and upon waking up she found she was no longer in her room.<br>\r\n<br>\r\n\"huh? where am I? wait a minuit, something's not right here.\"<br>\r\n<br>\r\nCarol looked around and noticed that not only everything was huge but that she was in...<br>\r\n<br>\r\n(authors note: I hope you guys make longer chapters than this, I'm writing this at 1 in the morning and I'm really tired)</span></div></div>",
            "created":1168146000,
            "id":371662,
            "title":"it begins."
        },
        "11":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Under her bed",
                "Her school bag"
            ],
            "content":"<div class=\"\"><div> <span>  \"OH GOD\" thougt Carol, and for good reason too, your on the floor in Minas bedroom. If Mina finds you, well you dont even wnt to think what'll happen if she does. At least Mina isn't here now, but it won't stay that way for long. Just as you thought that you hear Mina coming back to her bedroom, quick, got to hide... but where</span></div></div>",
            "created":1182574800,
            "id":419322,
            "title":"Mina trouble"
        },
        "111":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Sees you",
                "Walks out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>   You climb over all the mess on Mina's floor to crawl under her bed and hide behind one of her shoes. Mina stomps in and reaches down for her shoes, grabbes them and...</span></div></span></div>",
            "created":1191733200,
            "id":451380,
            "title":"under the cosh"
        },
        "1111":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Mina comes in",
                "crystal comes in"
            ],
            "content":"<div class=\"\"><div> <span>   Mina grabs the shoe that you are hiding behind and blinks in surprise, then swiftly takes hold of your small form, stands up and lifts you up to her face.<br>\r\n\"Mmmmm, what do we have here\" says Mina, looking at you funny<br>\r\n\"Errr, Mina, why are you looking at me like that?\" you ask nervously.<br>\r\n\"Well....\" she goes to say, but is cut off by your Mother's voice<br>\r\n\"Mina, could you take out the rubbish please\"<br>\r\n\"Ok\" she shouts back. She sticks you in a high sided glass and runs downstairs to take out the rubbish. You realize suddenly why she looked at you like that and has imprisoned you, she wants to eat you. For the last year or so, Mina has been saying how much she wants to eat you and so fat you have played along, letting her tie you up and pretend to bite you, a few weeks ago she actually managed to persuade you to let her strip you down and hold you captive for a day, which you enjoyed, but never told Mina. You never know, she might just be playing, but she may be serious and may want you in her stomach and if so, how bad would that actually be. Apart from the fact you would be dead, it wouldn't be so bad, if you weren't going to die you would most probably actually let her do it.<br>\r\n<br>\r\n      Suddenly the door bursts open and....</span></div></div>",
            "created":1191819600,
            "id":762957,
            "title":"Sisters reasons"
        },
        "11112":{
            "choices":[
                "You Mom walks in and says \"Mina, use the oven, she'll cook nicer\"",
                "Crystal walks in and says \"Mina!!! Stop!!! Leave Carol alone! Don't eat her!\""
            ],
            "content":"<div class=\"\"><div> <span>Crystal walks in. She looks around the room suspiciously. She then notices the glass you're stood in. She walked over to you and tips you out on her hand. You look up at your sister. To your suprise, she is wearing no make-up, wearing blue pyjamas, and doesn't look like a goth. You never see her in the mornings anyway, so you wouldn't know what she looks like. <br>\r\n\"Hey, Carol. I'm glad I found you. I can see Mina's had her hands on you already. Now, it was me that shrunk you. Don't go mad at me, but I needed to try out my chemistry assignment on you. Looks like it's worked, eh! You're only two inches tall sis' and look sooooo adorable.\" She suddenly turned to face the door as she heard footsteps on the stairs. She jumped up and grabbed Mina's hair straighteners so it would look like she didn't come in for you. Crystal looked down at you, not knowing where to hide you. He suddenly pulled open her pyjama bottoms and whispered \"Sorry sis', I'll get you out soon\". She dropped you down her pants, and you landed before her almighty shaven pussy. You couldn't hear much when Mina walked in, but Crystal soon got you out and lay you on her table in her room. She stood up, not bothering to pit her pants back on, and locked her door. She took off her top, revealing her large breasts and threw it to the clothes-covered floor. Continuing to hover around her room naked, Crystal seemed to forget about you. But she soon sits at the table to examine you. <br>\r\n\"Ermmm Crystal, perhaps you could get me some clothes? Mine didn't seem to shrink with me.\" Crystal looked down into your desperate eyes, as you stood on her table butt naked. You've never been keen on being barefoot, never mind naked. <br>\r\n\"Sorry sis', only living thinks can shrink, and you know I can't sew. Looked, until I find a way to help you, you'll have to stay like that. I'm going out soon with a few mates, and you know, hopefully end up in a lads bedroom, but until I return stay out of Mina's sight. I can't lock my door from the outside, and there's nowhere to hide you. I'll see you later, ok!\" by this time, Crystal was back to her usual dark gloomy self. About thirty seconds after Crystal left, Mina walked in with a massive grin on her face. <br>\r\n<br>\r\nMina, despite only being 12 years old, has the body that could easily pass for 14/15 years old. She has a slender body, with neat curves, and breasts a tad smaller than your own. She was wearing 3/4 length shorts and a baggy t-shirt. She had thin black ankle socks on and a pair of sneakers. She walked straight over to you amd picked you up by you leg. As you dangled upside down, she warned as she licked her lips. She carried you out of Crystals room amd into her own. <br>\r\n\"Now now Carol, don't go running off with Crystal. I havnt had my breakfast yet and it's almost noon. So what I'm going to do is cook and eat you! You're only small, but you'll do. For now. Right, wait here while I go and get the cocktail stick.\" with those words, your heart sank. You longed for Crystal to return home and save you. Mina took a small strip of tape and taped your arms behind your back. She then took another piece and taped your legs together. She walked out of her room, but to only return seconds later holding a cocktail stick. She placed it beside you and it was huge. She then picked you and and stuck the cocktail stick into a blob of clay on her desk. She secured the cocktail stick in and held you above it. <br>\r\n\"With the cocktail stick in you, you'll be easier to cook and eat. Now, opened your legs a little so I can put the tip of the stick into your tiny vagina.\" she tried to kick your legs but the tape was too strong. Mina lowered you and pushed you onto the stick. The stick pushed your hairless vagina wide open. She Mina let go, there was an explosion of pain in your stomach. Your whole body weight was forcing you deeper onto the cocktail stick. <br>\r\n<br>\r\nAfter several minutes of agonizing pain, you throw your head back and the cocktail stick emerges from your mouth. You have been completely skewered. Mina picked you up as if you were a pig on a spit. She took you downstairs and opened the microwave. She placed you in and closed the door. Tears ran down your face. You knew this would be the end of you. Unable to move, she struggled against the tape. But the cocktail forced your back to remain straight. <br>\r\n<br>\r\nJust as Mina was about to turn the microwave oven on...  </span></div></div>",
            "created":1272430800,
            "id":874922,
            "title":"crystal comes in"
        },
        "111121":{
            "choices":[
                "In Crystal's hand",
                "In front of your mom"
            ],
            "content":"<div class=\"\"><div> <span>You couldn't believe what you heard, your mom knew she was shrunk, and was actually helping Mina.<br>\r\n\"OK\" Mina put you in the oven and started to heat you up. It hurt so much, form the stick to the heat. When you were done cooking, you were still alive. Mina pulled you out with a oven mitt. She licked her lips and put most of you in her mouth, leaving a bit of the stick to hold. She brought her teeth down and pulled the stick out, leaving you in her mouth.<br>\r\n\"Make sure you chew her\" your mom said. Mina did as she was told. She finally swallowed and you black out. You wake up . . .</span></div></div>",
            "created":1462770000,
            "id":2145469,
            "title":"You Mom walks in and says \"Mina, use the ov..."
        },
        "1112":{
            "choices":[
                "\"I found a mouse\"",
                "\"Are you ready for Halloween night?\"",
                "\"This party will be awesome\""
            ],
            "content":"<div class=\"\"><div> <span>She just leaves. You wait a couple minutes before coming out. You run to the door and enter the hallway. You keep running when you see your mom's giant feet. She is wearing black heels, a black suit and cat ears. You don't understand because Halloween is tomorrow night, not this night. Still, you run and jump on her foot. She looks down and picks you up. She smiles and says </span></div></div>",
            "created":1464238800,
            "id":2154386,
            "title":"Walks out"
        },
        "11121":{
            "choices":[
                "Fairy",
                "Mouse girl"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait no, it's me Carol!\" You say. She takes you to her bedroom and pulls out a cage. She then proceeds to put you in, \"Please, take a closer look\" She simply looks at you.<br>\r\n\"I know it's you Carol.\" You eyes widened when hearing this. \"You see, I am a witch, and on Halloween night, whatever costume I am wearing, I turn into.\"<br>\r\n\"So you are going to turn into a cat?\" You ask.<br>\r\n\"Close, I am going to turn into a cat woman, which is part car, part human.\" She licks her lips. \"I may think like I had before the transformation, but my clothes will turn into hair like a cat.\"<br>\r\n\"When are you going to transform?\" You ask slowly.<br>\r\n\"Tomorrow night, also if you are wondering, when I eat you, you will re-spawn, so tomorrow night, I'm going to have so much fun. Another thing, Mina is dressing up as a bunny, so my magic will make her into a real bunny girl.\"<br>\r\n\"What is Crystal going to be?\"<br>\r\n\"She is going to be a vampire, and don't worry about the sun because my magic goes away just before sunrise.\" After hearing all this, you're a little confused.<br>\r\n\"What about me, can't you give me a costume?\" Your mother leans in closer.<br>\r\n\"I was so hoping you would say that. I have two costumes for you. You can be a mouse girl,\" your mother licked her lips when saying that, \"or you can be a fairy, which one do you want?\"<br>\r\n\"Do I get any magic as a fairy?\"<br>\r\n\"You can fly around the house, but no magic, and no matter what you pick, there is going to be a barrier around the house, so you can't escape\" you think for a minute, then say your answer with a smile.<br>\r\n</span></div></div>",
            "created":1465534800,
            "id":2162346,
            "title":"The witch mother before halloween"
        },
        "111212":{
            "choices":[
                "She hits your tummy with her fang.",
                "You cat mom stops her."
            ],
            "content":"<div class=\"\"><div> <span>\"I guess I will be a mouse girl.\" You tell her.<br>\r\n\"Awesome!\" She says and puts you in the cage. She then looks in her closet. From your angle, you can see her long legs, you are a little excited to see if she is telling the truth, however she has never lied before so there wasn't really any worry. Your mother walks back over to your cage and drops mouse ears to wear.<br>\r\n\"Will I grow hair?\" You ask. She just laughs.<br>\r\n\"Of course not, you will be naked with ears and a tail.\" She starts to leave the room. \"See you tomorrow night, oh and don't worry about the cage, when you turn into a mouse girl, the cage door will open for you, so be prepared to run around.\" You shudder a little hearing this.<br>\r\n--------------------------------------------------<br>\r\n The next night, you're waiting for something to happen. Suddenly, you feel something weird. You reach behind you to find a long skinny tail. You teach on your head to find that your regular ears are gone. Instead, the ears you had on we're now part of your head. As your mother had said, the cage door magically opened. You jumped out and ran to the door. As you explored the house, you noticed some differences. The jack-o-lanterns now laughed. You shuddered to think about going in its mouth. You go into the kitchen to see Mina eating some carrots. She had long fluffy ears and a fluffy tail. You walk over to her.<br>\r\n\"Hey Mina.\" You say. She looks up at you.<br>\r\n\"Oh well isn't it little Carol the cute mousy girl. Our mom is looking for you, you know.\"<br>\r\n\"First of all, don't you want to eat me?\" You ask, Mina had always wanted to eat you. \"Nope, not tonight, I'm a vegetarian. However, Crystal might try to get a taste of your blood so be careful.\"<br>\r\n\"Alright, well second, where is mom?\"<br>\r\n\"I don't know, she might be outside in the yard, however she will find you, don't say I didn't warn you.\" You nod and leave to Crystals bedroom. You climb on her bed, wondering where she might be. Suddenly, a hand grabs you. You turn around to see Crystal with sharper teeth and darker eyes.<br>\r\n\"Mm, so I have found my third victim.\"<br>\r\n\"Third? Who was the the other two, not mom and Mina right?\"<br>\r\n\"Correct, the barrier doesn't affect me or Mina, only you, so I found a tasty blondy and a scrumptious red head.\" Crystal starts to bring you closer to her mouth.<br>\r\n\"Wait, what if I turn into a vampire?\"<br>\r\n\"It doesn't work like that, you would need the proper costume, oh and don't worry about the other two girls, they're just passed out, now now hold still, I want all of your blood.\" She starts to bring you closer again.</span></div></div>",
            "created":1475287740,
            "id":2217112,
            "title":"Tiny Carol is now mouse Carol"
        },
        "112":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Hide in minas lunc and risk becoming a snack for her",
                "Dont hide and risk getting found"
            ],
            "content":"<div class=\"\"><div> <span>   You scamble into her schoolbag as quickly as you can, slipping into her lunchbox. You hear Mina come in to her room and then suddenly it feels tike theres an earthquake. Mina must be going to school you realise, but too late. Worse still you cant climb out of her lunchbox. Mina is bound to find you come lunchtime unless you hide, but the only tings in her lunchbox besides you are food....</span></div></div>",
            "created":1182574800,
            "id":419325,
            "title":"Lunchbox dilemma"
        },
        "1121":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "10:30",
                "12:30, lunch time"
            ],
            "content":"<div class=\"\"><div> <span>   You decide to hidein her sandwich, at lest you are unlikely to be found. Besides if she starts to eat the sandwich, you jump back into her lunchbox. You curl up betwen two slices of lettuce and decide to have a nap. You wake up and you are still in the sandwich, good. You look arround and the sandwich is still in the box, even better. You look at your watch and its..</span></div></div>",
            "created":1182747600,
            "id":420648,
            "title":"Hide in the sandwich"
        },
        "11211":{
            "choices":[
                "In the school park",
                "Outside your own home"
            ],
            "content":"<div class=\"\"><div> <span>You think for a second and remember what Mina is doing right now. She has talked about her day before. Right now she is currently doing math in her class. You climb out of her sandwich and out of the lunchbox. You are still in her backpack. You look around and find a receipt. It lists a shrinking potion at a store you never heard of. You keep looking around until some light appears from above. Suddenly, something grabs you and you pass out. When you wake up, you are on someones hand outside.<br>\r\n\"I was wondering where you were.\" A familiar voice said. You eyes adjust and you see Mina.<br>\r\n\"Where are we?\" You ask. She rolls her eyes.<br>\r\n\"Look around dummy.\" You listen and realize you are . . .</span></div></div>",
            "created":1471835100,
            "id":2199374,
            "title":"Mina's receipt"
        },
        "11212":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Sees you",
                "Takes a bite out of the sandwich"
            ],
            "content":"<div class=\"\"><div> <span>   \"Oh no\" thought Carol, its lunch time, and there is nowhere to hide. She hears the school bell ring in the distance and  Minas bag shakes all around her again, sliding the sandwich, along with Carol, to the bottom of the bag, and to make things worse, if thats possible, the sandwich is on such an angle that Carol is stuck in it and is unable to move. Afte about 30 seconds the bag is placed on the floor and the lunchbox is flooded with light as mina removes it from her bag and places it on the table. She pulls the lid off and goes straight for the sandwich that you are trapped in and pickes it up, raising it to her mouth. From your position you get a briliant view of Mina's mouth, two rows of perfect white teeth and a huge gaping black abyss behind them, leading to her stomach. She looks at her sandwich and...</span></div></div>",
            "created":1183525200,
            "id":422589,
            "title":"lunch time"
        },
        "112121":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Licks her lips",
                "takes you out and hides you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>   She looks at her sandwich, and opens it up to see what your Mom has given her, and she spots you! She then...</span></div></span></div>",
            "created":1187845200,
            "id":438436,
            "title":"spotted"
        },
        "1121211":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Kitchen",
                "Hallway"
            ],
            "content":"<div class=\"\"><div> <span>  Suddenly Mina spots you, for a moment she is surprised, but she then licks her lips and moves her finger right on top of your legs, preventing you from escaping. She then opens her mouth wide and bites down, removing her finger off you, you try to escape but are blocked by Mina's teeth. Mina's tongue throws you about her mouth, coating you in a warm sticky coat of saliva, which is very pleasurable for you. Then suddenly you are thrown backwards into Mina's throat, traveling down to her stomach. Her stomach makes quick work of you as it is stimulated by all of the excitement. You will be revived, but where?</span></div></div>",
            "created":1188363600,
            "id":440249,
            "title":"Minas dinner"
        },
        "11212111":{
            "author_id":"jeanmarcjacobi",
            "author_name":"jean",
            "choices":[
                "It's Cristal with a sandwich",
                "It's your mom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Carol weaks up at the kitchen out of her home.<br>\r\nYou hear sombody but were?</span></div></span></div>",
            "created":1234242000,
            "id":645150,
            "title":"at your kitchen Kitchen"
        },
        "1121212":{
            "choices":[
                "\"I can't wait to play with you\"",
                "\"Are you alright?\""
            ],
            "content":"<div class=\"\"><div> <span>Mina quickly pulls you out and puts you in her pocket. You try to get out but Mina won't let you. You are forced to wait. After hours of waiting, she finally pulls you out and sets you on her bed. You look up, terrified of what she is going to do. Finally, she says</span></div></div>",
            "created":1464498000,
            "id":2155728,
            "title":"In Mina's possession "
        },
        "11212122":{
            "choices":[
                "Go put you on your cake",
                "Go get mom to play the first party game"
            ],
            "content":"<div class=\"\"><div> <span>This confuses you, because she usually teases you.<br>\r\n\"Yeah, I'm ok why?\" You ask. Mina has a very surprised face.<br>\r\n\"No one told you?\" Mina says.<br>\r\n\"No, what\"<br>\r\n\"We shrunk you for your birthday, and we're going let you have fun.\" This took you a minute to register.<br>\r\n\"Wait, is it my birthday?\" Mina just laughs.<br>\r\n\"Of course it is\"<br>\r\n\"So what are the details about me being shrunken\" Mina explained.<br>\r\n\"When you were asleep, Crystal rubbed some cream on your face, causing you to shrink. If you die, you will re-spawn. Mom was supposed to meet you in your room to tell you about this, but . . .\"<br>\r\n\"I thought it would be more fun to surprise her.\" This caught both Mina and Carol off guard, as they turn to see Crystal.<br>\r\n\"You put me in Mina's room\" you ask. Crystal nods.<br>\r\n\"Yep, I have a lot of things planned for your birthday.\" She licks her lips. You are worried when you see that, but Mina grabs you.<br>\r\n\"As long as she has fun\" she said. Crystal then tells both of you what she wants to do first.<br>\r\n\"Let's . . .</span></div></div>",
            "created":1464843600,
            "id":2157891,
            "title":"\"Are you alright?\""
        },
        "112122":{
            "choices":[
                "Fall out of the sandwich",
                "Stay trapped"
            ],
            "content":"<div class=\"\"><div> <span>Mayonnaise starts to ooze beside your head as your sister's fingertips knead the sandwich. Her giant face is so close that you can't see anything beyond her mouth now.   Carol stares hungrily at you and licks her lips. Her mouth opens wide, covering your body in her humid breath as her teeth start to sink into the bread. The moist bread peels open like tissue paper. You shut your eyes as the deafening sound of crunching fills your ears. It's the end...?<br>\r\n<br>\r\nSuddenly, the darkness lifts and you see Carol's right in front of you. Cheeks bulging,  mayonnaise clinging to her lips, your sister starts to chew. You are jolted by the horrendous sound of lettuce being torn up inside. Carol's mouth glistens with grease, and she smacks her lips nosily. The edge of the bread is gooey and wet from where a chunk was bitten. Carol finishes her disgusting chewing and gulps down the rest of her mouthful. The sandwich slowly starts to swivel as she prepares to take bite out of the corner. <br>\r\n<br>\r\nYou watch the table below whirl by.  As hard as you try to wriggle out, your arms and legs are covered in mayo and cannot get a grip. The familiar crunching sound roars again as Carol wolfs down the corner of your sandwich prison. This time her lips are so close, you feel the bread pushing down as she wraps her mouth around it.     <br>\r\n<br>\r\n</span></div></div>",
            "created":1208408400,
            "id":521057,
            "title":"Take a big bite"
        },
        "12":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Take you to mom to ask her what to do",
                "Take you to the kitchen nd make a sandwich out of you",
                "take yo to the kitchen to make a meal out of you",
                "eat you",
                "feed you to mina"
            ],
            "content":"<div class=\"\"><div> <span>You look arround you, its a black small room, with a single huge door to your right,a large wooden wardrobe next to that and to your left is a black curtained window. Your on crystals bed, in her room, 6\" tall and stark naked, but also you're cold. The door opens and crystal walks in, she is in nothing but a t-shirt and panties, she goes to lie on the bed but you scream to her \"CRYSTAL!!!!!!\" you scream, she turns and looks at you<br>\r\n\"Hey sis what are you doing in my room, and why are you so small and naked?\" she askes<br>\r\n\"I dont know\"you reply<br>\r\n\"i know what to do\" she says, picking you up i'm going to</span></div></div>",
            "created":1175058000,
            "id":393526,
            "title":"Crystals choice"
        },
        "121":{
            "choices":[
                "Putting you in a sandwich",
                "Having mom's help",
                "Warming you up 1st"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hey mom,I found Carol shrunk!What should I do<br>\r\nWell isn't it obvious, eat her.<br>\r\nYou look at Crystal in horror as she looks at you with a devious smile.<br>\r\nI think I will eat you by . . .</span></div></span></div>",
            "created":1397710800,
            "id":1781258,
            "title":"Take you to mom to ask her what to do"
        },
        "1212":{
            "choices":[
                "Strip completely",
                "Strip into bikini's",
                "Play a game before you get eaten"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hey mom, could you help me eat her?<br>\r\nSure, let's go into your bedroom so that we won't be disturbed.<br>\r\nThey bring you to Crystal's room and lock the door.<br>\r\n<br>\r\nShould they . . . </span></div></span></div>",
            "created":1397710800,
            "id":1781264,
            "title":"Having mom's help"
        },
        "12121":{
            "choices":[
                "Next to mom and Crystal",
                "In the kitchen"
            ],
            "content":"<div class=\"\"><div> <span>Let's get dressed first<br>\r\nYou look In horror as they both take their clothes off,then mom grabs carol<br>\r\nLay on your bed,Crystal obeys and mom gets on her<br>\r\nOpen wide<br>\r\nCrystal opens her mouth,Carol gets licked and gets set in Crystals mouth.<br>\r\nClose your mouth and swallow<br>\r\nCrystal do as she is told.<br>\r\nCarol slides down Crystals throat and reforms where?</span></div></div>",
            "created":1397883600,
            "id":1782653,
            "title":"Strip completely"
        },
        "12123":{
            "choices":[
                "Hide and seek",
                "Cat and mouse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Crystal, let's play with her\"<br>\r\n\"ok\"<br>\r\n\"what shall we play?<br>\r\n</span></div></span></div>",
            "created":1397883600,
            "id":1782659,
            "title":"Play a game before you get eaten"
        },
        "121231":{
            "choices":[
                "Your mother, Susan",
                "Your sister Crystal"
            ],
            "content":"<div class=\"\"><div> <span>Your mother explained the rules.<br>\r\n\"You are given 25 seconds to hide before we come and find you. Whoever finds you will be the one to eat you. If you aren't found in an hour, we will play another game.\" You look at both of their stomachs and imagine being inside. The idea was a little appealing, however you keep quiet.<br>\r\n\"Ready, set, hide\" Crystal said. You go and try to hide while the two giantess close their eyes. You decide to hide under a bra that was next to the bed. The two giantess start to look for you when your hiding time was up. Crystal looked in the closet, and your mom looked under the bed. Crystal left the room thinking you might have gotten out somehow. Susan kept looking in the bedroom. Her stomach growled very loudly. You knew that if you were caught, she would drop you in her mouth and you would be digested to nothing. Suddenly, someone started to pick up the bra on with you attached to it.<br>\r\n\"I wonder where she could be?\" Who picked you up?</span></div></div>",
            "created":1464325200,
            "id":2154914,
            "title":"Hide and seek"
        },
        "121232":{
            "choices":[
                "Truth",
                "Dare"
            ],
            "content":"<div class=\"\"><div> <span>\"ok Carol, we'll give you a 20 second head start\" mom said.<br>\r\nAfter Carol started running, Crystal and mom waited a few seconds,got on their hads and feet and crawled towards her.<br>\r\n\"gotcha, now that you lost,Crystal gets take your arms\"<br>\r\nCarol watched in horror as Crystal pulled Carols arms off and swallowed them whole.<br>\r\n\"Now let's do truth or dare, what do you pick Carol?\"</span></div></div>",
            "created":1398747600,
            "id":1788954,
            "title":"Cat and mouse"
        },
        "1212322":{
            "choices":[
                "Yes",
                "No, let Crystal eat the rest of Carol"
            ],
            "content":"<div class=\"\"><div> <span>\"dare, I guess\" said Carol<br>\r\n\"okay,your dare is to let Crystal chew off your legs\"<br>\r\nMom then lowers your legs into Crystal's mouth and Crystal chews them and swallows.<br>\r\nCrystal, do you think we should have Mina eat the rest of her?</span></div></div>",
            "created":1398747600,
            "id":1788956,
            "title":"Dare"
        },
        "12123221":{
            "choices":[
                "Kitchen",
                "Crystal's room"
            ],
            "content":"<div class=\"\"><div> <span>\"Yeah\" said Crystal<br>\r\n\"Ok, MINA, could you come her?\" yelled mom.<br>\r\nMina enters the room\"what is it?\"<br>\r\n\"We want you to finish off Carol\" said mom as she threw Carol at Mina.\"ok\"<br>\r\nMina lowers Carol in her mouth.Crunch.Crunch. Mina then swallows.<br>\r\nCarol reforms where</span></div></div>",
            "created":1398747600,
            "id":1788961,
            "title":"Yes"
        },
        "122":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Dining Room",
                "Crystal's Room",
                "Living Room"
            ],
            "content":"<div class=\"\"><div> <span>Crystal picks you up and takes you into the kitchen. She then sets you down on the counter and starts to gather ingredients for a sandwich. She takes two slices of bread and places them next to you. She then grabs some lettuce, cheese, tomato, mayo and some mustard. Crystal then starts to construct her sandwich. She spreads one slice of bread with mayo, then adds the cheese, lettuce, and then grabs you. \"Let me go!\" you scream but Crystal just ignores you and lays you down on the lettuce. She then adds the tomato, and the second slice of bread spread with mustard. \"You are cute enough to cute.\" Crystal says with a smile as she picks up the sandwich and takes the first bite. It misses you. Her second bite includes you. You are swiftly swallowed, and soon black out in the stomach.<br>\r\n<br>\r\nWhere do you reform?</span></div></div>",
            "created":1313125200,
            "id":1166788,
            "title":"Make You a Sandwich"
        },
        "123":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Well, ok, id love to be a hotdog condiment",
                "NO WAYYYYYYY!!!!!!!!",
                "Someone walks in before you can answer"
            ],
            "content":"<div class=\"\"><div> <span>     \"I think i'll...\" says Crystal when she's cut short by the loud rumbling of her stomach, her stomach actually shook as it rumbled.<br>\r\n\"Ohhhhh.... Im so hungry\" moaned Crystal \"I think I'll go and make some food before I decide what to do with you\" she says<br>\r\n\"Sounds alrite to me\" you say, hoping that she can hurry up and help you. Crystal then picks you up and carries you out into the hall, then she carries you into the kitchen and places you on the counter next to the stove as she gets all the stuff out of the nearby cupboards and the fridge to make a hotdog. She then brings a pan out and fills it with water, bringing it to the boil and adding a couple of hotdogs. She then looks over at you very strangely, rather hungrily, and licks her lips.<br>\r\n\"Why are you looking at me like that\" you ask kinda scared, because at only a couple of inches tall you cant do much to stop your sister.<br>\r\n\"Oh, I'm sorry, its just im sooooo hungry.\" she says and you know your sister, she cant resist any type of food. And at your size you certainly could fall into that category, but the worst part about it i that you dont seem to mind all that much that you may just end up as so much fat on your sisters thighs.<br>\r\n\"Its alright\" you reply<br>\r\n\"Well... What can I say, I do think you would make a nice tasty hotdog condiment\" she says grinning cheekily at you.<br>\r\n\"I'll take that as a compliment\" you reply nervously, not sure what else to say. Knowing your sister, she may very well be serious about sticking you on that hotdog and eating you all up. Normally you would be running now, but its actually turning you on for some bizarre reason.<br>\r\n<br>\r\n     Crystal turns of the hob and pulls the hotdogs out, placing them in a bun each on the plate next to you, glancing over at you repeatedly. You decide to ask her weather she actually wants to eat you, or is it something else.<br>\r\n\"Crystal, The way you keep looking at me... well it makes me wonder... do you want to eat me, do you want me on one of those delicious looking hotdogs?\" you say<br>\r\n\"Well.... you would taste good on it...\" she replies nervously<br>\r\nHow do you reply?</span></div></div>",
            "created":1197522000,
            "id":475207,
            "title":"Hotdogs and hungry sisters"
        },
        "1231":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "engulfs you in her mouth",
                "crunch",
                "having second thoughts..."
            ],
            "content":"<div class=\"\"><div> <span>       \"Hmmm, i guess so\" you say nervously<br>\r\n\"Oh good, you're gonna taste brilliant\" she replies, opening up one of the buns \"Hop in then\"<br>\r\n\"Can you put me in?\" you ask<br>\r\n\"Ok\" she says, lifting you up and placing you into the bun. The hotdog is very hot but you dont feel any pain for some reason, must be a side effect of the shinking you think. Then you sister continues as she would have done with her hotdogs. She squirts ketchup on the hotdog and you, then mustard. She then squeezes the bun shut, squashing you against the hotdog and covering you in sauce. You lie still, as food doesnt move, and wait for you sister to begin to eat you.<br>\r\nShe bites down on the hotdog, missing you buy milimeters, you look up and watch as she slowly chews her mouthful, her jaw moving round and round. she then swalows it, the large lump slowly sliding down her moist gullet.<br>\r\n\"Mmmmm\" she moans, licking her lips, she lifted the hotdog up for a second bite, and...</span></div></div>",
            "created":1206507600,
            "id":513064,
            "title":"Well, ok, id love to be a hotdog condiment"
        },
        "12311":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "In Susan's bed",
                "In Crystal's bed",
                "In Mina's bed"
            ],
            "content":"<div class=\"\"><div> <span>Carol lay in the hotdog between the warm sausage and the bun, smothered in mustard and ketchup. It felt really nice and at that moment she loved her big sister and.. Crystal's face towered over the bun, her mouth opening wide. She was beautiful and terrifying. Her lips were painted in black lipstick that was smudged and cracked from her snack and there were smears of mustard and ketchup on them. Her teeth were huge and white, her tongue sensuous and frightening. Her hot breath blew over Carol bringing with it the smell of the food she had just eaten and her own smell as well. As the hotdog moved closer to the open mouth Carol could see only an odd view of her sister's face towering over her, but she mainly saw her mouth and then the hot dog and her with it were being pushed between those lips and Carol gasped. She was really going to do it! <br>\r\n<br>\r\nThe whole section of the hotdog she was part of was inside Crystal's mouth. It as dark and hot and very humid, Saliva dribbled down onto Carol as she writhed in the sauce and saw the back of Crystal's teeth as they bit through the hotdog and her mouth closed plunging Carol into darkness. She couldn't even tell if her sister knew that this mouthful was her or if she was just food. And then her huge powerful tongue moved and the hotdog was pushed sideways and back as Crystal began to chew.<br>\r\n<br>\r\nIt was dark and all Carol knew was the smell of her big sister's breath, the feel of her tongue and her saliva and the pain of huge teeth crushing and grinding her body as she was churned around in Crystal's mouth by her chewing. She could feel her bones crunching and her body squishing and mixing with her chewed food. She was food. She could feel parts of her squashed onto her big sister's teeth.. and then the massive tongue rippled and the blob of food which was once Carol and part of a hotdog fell into Crystal's throat. As muscles squeezed the mess towards her waiting stomach it hoped that Crystal had enjoyed eating her. <br>\r\n<br>\r\nThe food dropped into a pool of digestive juices and powerful stomach muscles churned mixing the new food in and breaking it down. It was hot and dark and very noisy as the giant stomach gurgled and heaved. It hurt so much. If the food could cry it would but Carol loved her big sister and it felt ecstatic even as she melted. What was left of Carol had some way to go yet. Later she would filter through the stomach completely as her immense sister broke most of her down and absorbed her as nutrition. Her crushed bones and hair would carry on...<br>\r\n<br>\r\nCrystal wiped her mouth and looked in the cupboard, unsatisfied. Still hungry. She grabbed a bag of Doritos and headed off to find a comfy chair to pig out in. She knew she'd eaten her little sister but she'd been so hungry she hadn't noticed which mouthful she was and mmm Doritos! <br>\r\n<br>\r\nSometime later Carol would be reborn...<br>\r\n<br>\r\n</span></div></div>",
            "created":1464152400,
            "id":2153714,
            "title":"Snack"
        },
        "12312":{
            "choices":[
                "Yes I do sister that was amazing!",
                "No you have had your fun, I want to be normal again."
            ],
            "content":"<div class=\"\"><div> <span>Crunch, the sound is sickning but painless. <br>\r\nAs Crystal bites her sister in half just above the lower back, after a few chews and a swallow Crystal goes for a final bite and consumes the rest of her sister.<br>\r\n<br>\r\nOh My God that was good! Cystal cried licking her lips. <br>\r\nHer breath deepened and she began to sweat. she could feel the remains of her sister slowely being digested. <br>\r\nReleasing Chemicals that were turning her on.<br>\r\nCrystal fell to the ground grabbing her crotch, the orgasims were getting stronger and stronger, almost like there was something in there. she grabbed at the lump it was hairy, With a final pull and gasp she pulled her sister from between her legs. <br>\r\nWhen Christal could breathe again she said \"Wow that was amazings sister, I do not know how that happened but it was great. Do you want to do it again\"?<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1298869200,
            "id":1062036,
            "title":"crunch"
        },
        "1232":{
            "choices":[
                "Embrace your fate: climb inside and become your sister's meal.",
                "I don't wanna go!"
            ],
            "content":"<div class=\"\"><div> <span>\"NO WAYYYYYYY!!!!!!!!\", you immediately blurt out, as you realize the seriousness of your sister's intent.<br>\r\n<br>\r\nNo sooner do you voice your refusal then your sister sharply turns her head to face you directly.  The growing look of consternation across her visage tells you, in no uncertain terms, that this is NOT the answer that she was looking for.  And it quickly sinks in that you are in no position to refuse your older sister whatever she wants, even if what she wants is for you to be her meal.<br>\r\n<br>\r\n\"I...I mean...that is to say...I think if you had me on the hot dog, you wouldn't be able to fully appreciate me.\"<br>\r\n<br>\r\nThe stern look of reproach fades from your sister's face, replaced with a pensive look as she taps her chin with her finger.  She looks down at your unclothed body in appraisal, as thin smile spreading across her face as she slowly starts to nod in agreement with your point of view.<br>\r\n<br>\r\n\"You know what--I think you're right for once.  Maybe I will try you plain.\"<br>\r\n<br>\r\nCrystal reaches down.  Your heart skips a beat and your mind screams for escape, yet your limbs are frozen in place.  She scoops you up in the palm of her right hand.  You are lifted up to her face, mere inches from her mouth.<br>\r\n<br>\r\n\"Over the lips and past the gums, look out stomach, here Carol comes!\"<br>\r\n<br>\r\nCrystal's mouth opens wide in front of you.</span></div></div>",
            "created":1372654800,
            "id":1620908,
            "title":"NO WAYYYYYYY!!!!!!!!"
        },
        "12322":{
            "choices":[
                "Let go and be a nice little meal.",
                "Fight to the bitter end!"
            ],
            "content":"<div class=\"\"><div> <span>Crystal's pearly whites shine in front of you, and you lose your nerve.  Turning tail, both figuratively and literally, you swivel around in her palm and wrap your arms around Crystal's fingers.  Crystal stares down to see your trembling ass pointed at her face, and she giggles involuntarily.<br>\r\n<br>\r\n\"Awww, did you have a change of heart?  Well, let me tell you something--I didn't!\"<br>\r\n<br>\r\nWith that, Crystal leans forward as her tongue darts out, taking an exploratory taste of your derriere.  You hear a smacking of lips as Crystal samples your natural flavor.<br>\r\n<br>\r\n\"Not bad...a subtle flavor, made all the tastier with that lovely garnish of fear.\"<br>\r\n<br>\r\nAnother lick, this one more hearty than the first, traces its way from the base of your butt cheeks all the way up your spine and to the nape of your neck.  The tongue reverses course and retreats back the way it came.  When done, Crystal has left your entire backside coating in her warm, sticky spit.  And yet, you can't deny a certain degree of pleasure from the act.<br>\r\n<br>\r\n\"Remember how you always told me to kiss your ass?\", goads your big sister.  \"Well looks like you'll finally get your wish!\"<br>\r\n<br>\r\nCrystal puckers her lips and plants them square on your ass.  As her lips lock onto your cheeks, you feel a powerful suction pulling you back.  You tighten your grip as Crystal pulls back, and a loud, wet sound tears through the air as her lips pull away from you.  You've just managed to resist her, but just barely.<br>\r\n<br>\r\nBut Crystal is through with playing games, and now she's playing for keeps.  She leans over your curled form, sucking your ass into her mouth as her tongue sweeps up under your thighs while the roof of her mouth presses down on your back.  She seals her lips around your petite body and sucks you further inside of her mouth as she uses the fingers of her free hand to fold your lower legs inside of her mouth.  It doesn't take long before only your head and arms remain outside of her mouth.<br>\r\n<br>\r\nCrystal giggles at the way you still hang on, even now that it is plainly evident that she has won.  Like it or not, you're going down.</span></div></div>",
            "created":1372654800,
            "id":1620918,
            "title":"I don't wanna go!"
        },
        "123221":{
            "choices":[
                "in the kitchen",
                "in the living room"
            ],
            "content":"<div class=\"\"><div> <span>You tire of fighting the inevitable.  Your strength fades.  Your resolve is shattered.  You are food.<br>\r\n<br>\r\n\"Crystal?\" you meekly ask as you release your grip and turn your head up in a meager attempt to face your sister.<br>\r\n<br>\r\n\"Mmmmhmmmm?\" replies Crystal, unable to speak with her mouth full.<br>\r\n<br>\r\n\"Please be gentle...\", you beg, only seconds before a final slurp pops your head between her lips.  Your limp arms still stick out from between her full, pouty lips.  Then, her greedy tongue reaches out, and with a clear, deliberate swipe from one corner of her mouth to the other, she sweeps the rest of you inside of her mouth.  For a split second, you can see daylight from between her lips, you can feel the cool air brushing in from outside of her hot, damp mouth.  And then, before you know it, her lips seal together, and with them, so too is sealed your fate.  Those same lips smile cruelly now that she has you completely inside of her mouth--completely at her mercies, of which she has none.<br>\r\n<br>\r\nHer tongue only does as you bid her earlier.  She tastes you fully and unashamedly, exploring every inch of your naked body.  You do not bother to fight as your body is tosses around by her tongue, forced from one side of her mouth to the next.  Crystal's cheeks puff out as she presses you against one side of her mouth and then the next.  She does this more for the feel of having you in her mouth than for any taste.  She wants to dominate you.  She wants to remind you not only that you are food, but that you are HER food.<br>\r\n<br>\r\nBut in a strange way, you deny her that satisfaction.  Maybe she's hoping to squeeze that one last bit of fear out of you.  Maybe she hopes for one last act of defiance so that she can then stamp it out.  But she soon tires of the game, as any cat must soon tire of playing with a mouse.<br>\r\n<br>\r\nA low rumble from Crystal's stomach serves as a message to her brain that despite the fun she is having, she still needs to eat.  Finally, Crystal's tongue pulls you to the back of her mouth.  With a quick, powerful pull, you are dragged into her throat.  It takes her several gulps, but you do squeeze down her esophagus and work your way into her stomach.<br>\r\n<br>\r\nYou fall inside with a splat and rest there for a moment.  The cramped interior of the mouth has now at least been replaced by a more spacious room.  But it is even hotter here, and darker as well.<br>\r\n<br>\r\nYou feel light-headed.  You are passing out.<br>\r\n<br>\r\nThe stomach churns you around and you are disoriented.  You know that Crystal's stomach is already hard at work, trying to digest you.  Everything before this was no more than play.  Right here, right now, you really know what it means to be food.  But you feel yourself drifting away, and your world turns black.<br>\r\n<br>\r\nConsciousness returns to you, and you open your eyes to find that you are:</span></div></div>",
            "created":1372654800,
            "id":1620930,
            "title":"Let go and be a nice little meal."
        },
        "123222":{
            "choices":[
                "the kitchen",
                "one of the bedrooms"
            ],
            "content":"<div class=\"\"><div> <span>Just because there is no hope does not mean that you must accept the situation.  You tighten your grip as you wiggle your body, as if you might shrug off the mouth of your older sister.  But she merely finds this amusing, as you can tell by the giggles that accompany your frantic movements.  She counters with her tongue, which slithers along your belly before parting her lips, only to lick your face.<br>\r\n<br>\r\nCrystal enjoys this little game.  She can end it at any time, but she thrills at the feel of you struggling inside of her mouth.  The rush of having you alive and squirming inside of her mouth makes her salivate all the more, coating you in puddles of spittle.  She purses her lips and sucks on your body, dragging you in all the way to your neck before releasing her overbearing grip.<br>\r\n<br>\r\nShe allows you to pull yourself out a little, enough so that your breasts pop out and rest on her lower lip.  A gob of spit also escapes, running down Crystal's chin.  But this escape is short-lived.  You feel her massive lips squeeze around your upper body right before she sucks you in again, taking you up to your neck.<br>\r\n<br>\r\nThis time she also pulls away her hand, prying loose from your arms with ease.  Your arms reach straight out, flailing in the air and grasping for the one anchor that has kept you from being fully engulfed up until now.  Feeling nothing, you switch tactics and hug her lower lip, waiting for her assault to end.<br>\r\n<br>\r\nWhen it does, you muster all of what little might that you have, pushing back with your legs as your arms grip her face and pull.  A sudden lurch allows half of your body to escape, so that her upper lip now rests on your ass and your upper body dangles from her lips.  You feel exhilarated for a moment, as if you have won a great victory.  But as you prop yourself up with your arms, you look with horror at the lips surrounding you, noticing that Crystal is smiling.<br>\r\n<br>\r\nIt is obvious, as it always should have been, that she is simply playing with you.  She can end this game at any time.  And that time is now.<br>\r\n<br>\r\nCrystal sucks you back in as if you were little more than a strand of spaghetti.  Your frantic kicks and screams do nothing to stop her.  Crystal places an index finger on the top of your head and uses it to push you back inside.  You attempt to swat away the finger with your arms, but do nothing to stop her.  her lips and tongue work together to gobble you up.  Before you know it, your head has passed over her teeth and you are surrounded by an enamel prison.  Only your arms stick out now, latched onto her index finger.  As the finger withdraws, you hold on as best you can, but your best isn't nearly good enough.  The finger is pulled out of her mouth, but you are still trapped inside.<br>\r\n<br>\r\nYour arms frantically reach around outside, the only reminder to the outside world that you are the meal currently being eaten by Crystal.  Your forearms curl around her lips, once again hoping to keep yourself from sinking in any further.  The slimy slickness of her spit does not allow your grip for long.  Crystal puckers her lips as if for a kiss, your arms visible outside for but a moment, before they are also sucked in.  Crystal's lips curl into a smile of great satisfaction now that you are trapped inside.<br>\r\n<br>\r\nHer head tilts back, and you search for another grip, but there is none.  Your hands grasp, your toes dig into the soft, fleshy interior, but you slip backwards nevertheless.  Looking back, you see the dark, cavernous abyss that leads to Crystal's throat, and this leads to her stomach.<br>\r\n<br>\r\nYour left leg slips underneath you, then goes straight as it dangles over the precipice.  Crystal's tongue alternately licks and slaps at you, both tasting you and working you into the back of her mouth.  You slide back even farther, the soft fleshy interior pulling you back.  Your fingers claw at her tongue but cannot get a grip.<br>\r\n<br>\r\nYour lower legs are falling into the throat.  Everything is going so fast now.  Crystal's uvula is being drawn along your back as you fall inexorably into her throat.  You try to bring your legs up again, but find that they are hopelessly bound together inside her throat.  The peristaltic pull of her throat muscles urge you inside, and you cannot resist.  You fight, but you still slip deeper inside of the throat of you sister.<br>\r\n<br>\r\nYour will to live and the hunger of your sister for your flesh wage a war of wills.  But despite your desire not to become Crystal's meal, her desire to eat you is winning.<br>\r\n<br>\r\nYou are now barely in the mouth anymore.  Only your head and arms can be said to be in her mouth, as you stare out at her teeth and tongue.  Every few second, another tug pulls you down.  The back of her tongue rams you down into her throat, and the throat muscles hug you, squeeze you down enough so that you can't even see the inside of her mouth anymore.<br>\r\n<br>\r\nBut you are still a big meal for her, and the muscles soon tire and release you.  You are able to barely worm your way back up, able to reach out and touch her tongue once more.<br>\r\n<br>\r\nAnother pull drags you down again, this time engulfing your head, and you feel as if you are drowning for a moment.  Crystal holds you there, a lump adamantly stuck in her throat, for a few more seconds before releasing.  As you pop back up, you reach up and your hands grasp her uvula.  You seize it, hanging on just enough so that the next peristaltic push does not drag your head inside of the throat.  But it does pull you down enough that your hands slide down, compromising your grasp.  Crystal shakes her head rapidly from side to side, and your grip is broken.<br>\r\n<br>\r\nCrystal takes advantage of the opportunity and swallows mightily.  Your head immediately is surrounded by the soft, yet firm muscles of her throat.  You descend enough so that only your hands can wiggle about freely.  Your progress is stopped again, as if she cannot get you down any farther but neither can you escape your position.  You wiggle about involuntarily, hoping to worm your way back out.  But your movements only serve to help Crystal, and as you wiggle, you find that you're only working your way deeper.<br>\r\n<br>\r\nAnother pull and you find yourself slowly sliding down, but making definite progress toward her stomach.  Several waves pass by in succession, and you gain momentum.  Eventually, your feet can move again, followed soon by your legs as they kick around in their newfound 'freedom'.  With a quick squirt, you are rudely dropped inside of her belly.  You only have the strength to lie down and rest as Crystal's stomach begins working on you, kneading your flesh and squirting digestive juices onto your helpless body.<br>\r\n<br>\r\nYou attempt to stand up, only to bump your head on the top of her stomach and then fall on your ass as the churning stomach knocks you off of your feet.  You begin to see stars as the lack of oxygen gets to you.  With one last act of defiance, you launch yourself at the side of the stomach wall and pound it with your fists.  Jets of acid launch from every angle by now, covering you head to toe in stomach juices as Crystal's digestive system seeks to make you a part of her.<br>\r\n<br>\r\nYou feel faint and fall back, losing consciousness.<br>\r\n<br>\r\nBut somehow, you regain your senses, and as you open your eyes, you see that you are now in:</span></div></div>",
            "created":1372654800,
            "id":1620944,
            "title":"Fight to the bitter end!"
        },
        "1233":{
            "choices":[
                "Yes",
                "No",
                "Mom Decides she wants you first"
            ],
            "content":"<div class=\"\"><div> <span>\"There you are, my little snack\" your mom comes in.<br>\r\n\"Wait you shrunk me?\" You ask.<br>\r\n\"Of course I did, you look tasty\"<br>\r\n\"May I eat here?\" Crystal asks.<br>\r\n\"Of course, once she is eaten, she will re-spawn\" your mom replies.<br>\r\nCrystal's stomach growls. She grabs you and puts you on a hot dog.<br>\r\n\"Don't I get a say in this?\"<br>\r\n\"Nope\"<br>\r\nDo you try to escape?</span></div></div>",
            "created":1447131600,
            "id":2059576,
            "title":"The shrinker"
        },
        "124":{
            "choices":[
                "In the kitchen ",
                "In mom's room",
                "In Crystal's room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She then shoves you in her mouth and chews you up. You then reform . . .</span></div></span></div>",
            "created":1400302800,
            "id":1797863,
            "title":"eat you"
        },
        "125":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "easy way",
                "Hard way"
            ],
            "content":"<div class=\"\"><div> <span>   \"I Know, i'll let Mina eat you, I know she will eat you because she has been saying how she wants to eat a person allive. Now she can.\" says Crystal, grinning evily<br>\r\n\"No, please \" you beg, \"Anything but that\" You know what Crystal says is true because Mina has been teasing you for weeks now sayinhg she will eat you allive, she even attempted to lat weekend, by cutting some sauce on your arm and nearly bighting it off, luckily you woke up just in time to stop her taking a chunk out of your arm.<br>\r\n<br>\r\n  Crystal grabbes tight hold of you and walks into Minas room<br>\r\n\"Hey Crystal \"she says looking up from her book \"Wacha doin\"<br>\r\n\"Oh i have a surprise for you\" she says <br>\r\n\"what is it?\" asks Mina, getting very curious<br>\r\n\"Well you know how you said you wanted to eat someone alive?\"<br>\r\n\"Yeah\" she repplies, licking her lips<br>\r\n\"Well now you can\" she said opening her ahn enough for Mina to see you<br>\r\n<br>\r\n   Mina takes your tiny form out of Crystals hands and holds you up to her face<br>\r\n\"Mmm, dont you just look delicious, and dont bother aruing, because you are going to end up here\" she says pressing you agains her smooth, flat stomach \"no matter how much you struggle and argue, so do you  want to do this the easy way or the hard way?\"<br>\r\n\"Is there a way where i don get eaten?\"You ask <br>\r\n\"NO!!!\" Mina screams at you \"Now I lay it out simle to you, either you do things the easy way and make it easy and maybe even enjoyable on yourself or you do it the hard way and i will make you suffer, so which will it be?\"</span></div></div>",
            "created":1184389200,
            "id":425766,
            "title":"Crystals"
        },
        "1251":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Tonight with tea",
                "Tommorow for lunch"
            ],
            "content":"<div class=\"\"><div> <span>   You dont know what to do, if you pick the easy way, Mina may let her guard down and you may have a chance at escaping, also if you cant find a way to get away you may just enjoy your end. Its not like you have done anything exciting or interesting in your life, this is the best, or at least most interesting thing that has ever happened to you, so what have you got to loose., you think to yourself.<br>\r\n\"Well...?\" Says Mina \"Which will it be?\"<br>\r\n\"Well, the easy way\" you reply<br>\r\n\"Good\" says Mina, grining devilishly \"Im glad to see you hve decided to make things easier on me and yourself, you may even enjoy being eaten and becoming part of my lovely body. But if you try to escape, I will make the last days of your life a nightmarish misery, and you will beg me to eat you. Any questions?\"<br>\r\n\"Err, how and when dou you intend to eat me?\" you ask<br>\r\n\"Well I will eat you...</span></div></div>",
            "created":1184562000,
            "id":426357,
            "title":"Easy way"
        },
        "12511":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Fish Fingers, Beans and Chips",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>  \"I shall eat you tonight with tea\" proclaims Mina happily<br>\r\n\"Well whats for tea, other than me that is\" you reply<br>\r\n\"MOM!\" Shouts Mina \"WHATS FOR TEA?\"<br>\r\n\"Well\" shouts your Mom back up \"Its...</span></div></div>",
            "created":1184562000,
            "id":426359,
            "title":"What's for tea Mom"
        },
        "125111":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "5 minuets or so",
                "not for another hour"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"OK\" Shouts down Mina, \"When will it be ready?\" She adds<br>\r\n\"Oh in about</span></div></span></div>",
            "created":1185426000,
            "id":429405,
            "title":"What time is your \"Last meal\""
        },
        "1251111":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Stay and let Mina eat you",
                "Run and try to hide from Mina"
            ],
            "content":"<div class=\"\"><div> <span>   \"Oh its almost ready, another 5 minuets or so, you might as well come down now\" Replies Susan. <br>\r\n\"Ok\" Replies Mina \"Im Coming!\" and with that she scoops you up and places you in her pocket, zipping it up so you can't escape. You feel youself bounce around as Mina begins to walk downstairs to the dining room, the smell of cooking hits you even through the material of Minas pants, the smell of your impending fate, normally you would have thougt more of \"Impending doom\" but the thought of being eaten was actually not so bad anymore, no longer did it scare you like earlier, you actuall were looking forward to becoming part of Mina, once she digested you you would have nothing to worry about. But this is your last chance to escape, you can see a small gap in the zip that you could prise open and escape, half an hour ago this would have been a foregone conclusion, run whilst you had the chance, but now part of you actually wanted to stay, part of you wanted to be eaten, to become part of Mina. This is a life changing decision, what will you do?</span></div></div>",
            "created":1185426000,
            "id":429414,
            "title":"Last Chance"
        },
        "125112":{
            "author_id":"meeper15",
            "author_name":"meeper15",
            "choices":[
                "pizza",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other Tea opions</span></div></span></div>",
            "created":1391662800,
            "id":1740583,
            "title":"more food choices"
        },
        "1251122":{
            "author_id":"meeper15",
            "author_name":"meeper15",
            "choices":[
                "Sandwiches",
                "still more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More food for tea.</span></div></span></div>",
            "created":1391662800,
            "id":1740585,
            "title":"even more"
        },
        "12511221":{
            "author_id":"meeper15",
            "author_name":"meeper15",
            "choices":[
                "a c.l.t  (a carol,lettuce,and tomato) sand wich",
                "more sandwiches"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind will carol be imprisoned and devoured in?</span></div></span></div>",
            "created":1391662800,
            "id":1740588,
            "title":"Sandwiches"
        },
        "125112211":{
            "choices":[
                "Get some Mayo",
                "Go out here for example"
            ],
            "content":"<div class=\"\"><div> <span>Mika gets out a slice of white bread and puts it in the toaster.Then she grabs chlo and 2 other slices of white bread and places them on the kitchen counter. Mika then gos to the freezer to get some mayo. She brings it back to the kitchen counter and grabs the bread and spreads mayo on .  She grabs her sandwich and places it inside her mouth and starts to chew. Once shes done with her sandwich she gets the toast and brings it to the counter. Mika then gets the peanut butter and starts spreadihng it on her lunch. She grabs chlo and then holds her above her mouth. Chlo can smell the mayo from Mikas sandwich. Mika then places her on her toast. Mika grabs the toast and brings it to her mouth and places it on her tongue.She starts to carefully chew her toast while chlo was just becoming apart of the mushed up bread and peanut butter. Mika decided to swallow.Chlo went down her sisters throat and was covered in digestive acids and mayo when she entered mikas stomach </span></div></div>",
            "created":1566303000,
            "id":2705194,
            "title":"a c.l.t  (a carol,lettuce,and tomato) sand wich"
        },
        "125112212":{
            "author_id":"meeper15",
            "author_name":"meeper15",
            "choices":[
                "yes",
                "naw"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There will be many sandwices how about grilled cheese?</span></div></span></div>",
            "created":1391662800,
            "id":1740592,
            "title":"more sandwiches"
        },
        "1251122122":{
            "author_id":"meeper15",
            "author_name":"meeper15",
            "choices":[
                "ok",
                "nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok then how dose peanut butter and jelly sandwiches sound?</span></div></span></div>",
            "created":1391662800,
            "id":1740594,
            "title":"naw"
        },
        "12511221221":{
            "author_id":"billyj27",
            "author_name":"Billy",
            "choices":[
                "Crystal gathering up ingredients for a sandwich",
                "Susan licking her lips deciding how best to prepare her daughter"
            ],
            "content":"<div class=\"\"><div> <span>Mina decides she will eat you in a PBJ. Mina keeps you in a cage until later that day. Night time comes and Mina comes over to the cage. You see her in her cute pink pajamas and she says, “Mmm, i’m getting hungry.” Mina says. And she grabs you out of the cage and puts you in her hand. Her soft young skin feels nice on your naked body. She gets into the kitchen and grabs the Peanut Butter Jar, the Jelly Jar, and two slices of white bread. She sets you on the counter and you look up at her gigantic size. you used to be so much taller than her, but now she towers over you as a giantess. Mina opens the Peanut Butter Jar and grabs the butter knife. She scoops up some Peanut Butter and spreads in on a slice of bread. Then she scoops up some more and spreads it on the Peanut Butter covered bread. You look up at her giant young cute face and see her giantess lips start to move and You then hear her loud voice say “I love lots of Peanut Butter in my Sandwiches.” She then finishes putting the Peanut Butter on the bread. You lay in wait, feeling the cold counter on your bare skin. She then looks over at you and reaches to pick you up. You lift off the counter. She then places you firmly in the Peanut Butter covered bread. You can feel the soft sticky Peanut Butter all over your naked body. You start to squirm around as you get covered in the Peanut Butter. You look all around and can see Peanut Butter all over and around you and it is all that you can smell. You start to like the sensation of being so small on such a large piece of bread, absolutely covered in peanut butter. You begin to feel so tiny, and you love it. you start to lick at yourself, and cover yourself in more Peanut Butter. It feels like a soft blanket all over your naked body. You look up and notice the cute kid that is Mina has started putting Jelly all over the other piece of bread. She puts large amounts of Jelly on the other piece, as you start to feel acceptance about the fact that you are going to be apart a nice snack for a young girl. She is now finished putting Jelly on the other piece, and now all she has to do is put the sandwich together. But before she puts the sandwich together, you see her reach up at a cabinet, that she is almost to short to reach, and she grabs a white ceramic plate. She sets the plate down on the counter. You see her pick up the Jelly covered slice of bread, and she puts it down on her plate. You then look up and see her cute face glance down at the Peanut Butter covered bread, which she can barely see you on, and you see Mina’s hand reach and pick up the slice of Peanut Butter covered bread you lay on. The world around you shifts and the bread is picked up. Mina brings it up closed to her,  and your whole view is nothing but her cute face. She then proceeds to smell the Peanut Butter that you are covered in, and she smiles and says, “Mmm i sure do love Peanut Butter”. It seems as if she has become unaware of your prescense in the Peanut Butter, like she has forgotten how small you are. She then places the Peanut Butter covered bread on the plate, beside the Jelly covered one, and picks up the plate. You then look around as she begins walking. Past all the Peanut Butter around you, you see the Jelly on the other piece, and you realize that you are about to be eaten by a little girl, and there is no turning back, because she has forgotten you are there, and she can’t even see you, because you are covered in the Peanut Butter. Mina then walks into the living room, and sits with her feet up on the couch. She then sets the plate down on her lap. You can see her gigantic upper body above you, as you see her not even pay attention to the piece of bread you lay on, like she has forgotten about you, and it is now just her routine, and all you are is her meal. She then reaches for the TV remote, and turns on the TV. For about a minute, she pays no attention to the slices of bread that will soon be her sandwich, and watches the TV show on the screen. You look up at her, and then squirm around in the peanut butter, only making you more camouflaged in the stuff.She then glances down at the bread slices she has on her plate, not even noticing you, and she remembers how hungry she is, and realizes how great a Peanut Butter and Jelly Sandwich will be while watching her show. She then effortlessly picks up the Jelly covered bread, and places it on top of the Peanut Butter covered slice, not even noticing that someone was in there, only focusing on her show, and her hunger for a sandwich. Your whole world turns dark, as the Jelly covered slice is placed on top of you. You can feel the smooth Peanut Butter mix with the Strawberry Jelly, as Mina presses down on her Peanut Butter and Jelly Sandwich. The bread on top of you is soft, and you feel comfortable in the sandwich, and you try to squirm around, only becoming more covered in the Peanut Butter and Jelly. Mina then picks up her PB&amp;J, that she only knows as her snack, and not as the place that you are stuck in, and she lifts it up to her face. She then takes a quick bite, focusing on the TV, preoccupied with her favorite show. After she takes a bite, a hole rips in the bread above you, and you can see Mina’s cute young face, and how close you are to being eaten. After chewing and swallowing the first bite, enjoying the tasty Peanut Butter, she takes another bite, and you can then see her gigantic lips moving, as she is chewing the tasty Peanut Butter, and you can hear nothing but the sounds that go along with eating a Peanut Butter and Jelly Sandwich. Time seems to go by in slow motion, as the last moments of your life is spent in a child’s Sandwich. As she gets done chewing and swallowing the second bite, she opens her mouth and you can smell the Peanut Butter in her mouth as the breathes. You then squirm around one last time in the Peanut Butter and Jelly, trying to escape your comfy Prison that is Mina’s PB&amp;J. You then see her lips part once again, as she prepares to take another bite. All you can see is your naked Peanut Butter and Jelly covered body, and the child’s enormous mouth. She then takes her third bite, with you in it. You then are put on Mina’s warm, moist tongue, and you see her mouth close. You still have Peanut Butter and Jelly all over you, as she starts to chew. Her younger moves you around, as she stars to lick, and taste the Peanut Butter and Jelly. Now that this is her third bite, she goes quicker in chewing. As she begins to get ready to swallow, you are covered in chewed up PB&amp;J, and you again realize that all you are to her now, is another bite of PB&amp;J, as you are to small for her to even notice, or pay any attention to you. All you are is just a part of a young girl’s tasty Peanut Butter and Jelly Sandwich. Mina then swallows her third bite, and you are send down her throat, and digested alongside the rest of her PB&amp;J. Everything goes black as you lose consciousness. When you finally awaken you find yourself on the kitchen counter with...</span></div></div>",
            "created":1513750320,
            "id":2430417,
            "title":"Put in a Peanut Butter and Jelly"
        },
        "12512":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Burgers",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>   \"Well i was thinking of lunch tomorrow so i can have some fun with you\"<br>\r\n\"Well whats for lunch tomorrow?\" you ask<br>\r\n\"Well I'm making lunch tomorrow and im making...</span></div></span></div>",
            "created":1186117200,
            "id":431708,
            "title":"Play time"
        },
        "1252":{
            "choices":[
                "Moms room",
                "Kitchen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Fine\" she said. Mina then pulled your head off and you see her grind up your body. She then drank the liquid and came back to you. She then lifted you up and ate the rest of you.<br>\r\nYou reform . . .</span></div></span></div>",
            "created":1404622800,
            "id":1823857,
            "title":"Hard way"
        },
        "13":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "Susan, seeming to be looking for something",
                "Mina, with a devious look in her eye",
                "Crystal, who is looking for carol for help."
            ],
            "content":"<div class=\"\"><div> <span>Carol rubbed her eyes and got a good look at where she was. With it's huge bed, only one side slept on (Dad had left years ago), nice but simple furniture, and the only office desk in the whole house, it was clear that she was in her mom's room!<br>\r\n<br>\r\n\"WHA?!\" Carol said. \"How the hell did I...?\"<br>\r\n<br>\r\nBut she had no time to wonder, she looked where she was and realized the situation was even worse. She was on top of the dresser, which was very tall and too far to get away from. She was trapped. <br>\r\n<br>\r\nThen she saw it.<br>\r\n<br>\r\nBeside her was a vial. It was about her size but had a FOUL odor to it. But she remembered the smell. It was the same as last night.<br>\r\n<br>\r\n\"What is this? I never seen it before...\" She wondered. But she had to wait to find that out to.<br>\r\n<br>\r\nIn an instant, she saw someone walk in, humming a tune. It was...</span></div></div>",
            "created":1169096400,
            "id":402933,
            "title":"Not a good place to be!"
        },
        "131":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Ok, have it your way... im your tea",
                "No way, you'll never take me alive (Appologies or the Cliche)"
            ],
            "content":"<div class=\"\"><div> <span>\"Ah there you are\" says Susan as she picks your 1\" tall form up in her hand.<br>\r\n\"What do you mean \"There I am\", it sounds like you knew i was shrunk?\" says Carlo, puzzled and scared.<br>\r\n\"I mean, I have finally found you. How do you think you shrunk, I put a shrinking \"Potion\" in your tea\" she says, grinning deviously<br>\r\n\"Www..w.why?\" you stutter, scared to ask<br>\r\n\"Well because I want you as a meal, you look so tasty and your sisters agree with me too, so we decided that we would shrink you and eat you. So do you want to do this the easy way or the hard way?\"<br>\r\n<br>\r\n      Struggling to take all that ha been said in you reply...</span></div></div>",
            "created":1183525200,
            "id":422593,
            "title":"secret desires"
        },
        "1311":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "make a meal out of you",
                "sweat treat or sandwich"
            ],
            "content":"<div class=\"\"><div> <span>   \"Oh good\" sh says grinning from ear to ear \"Im looking forward to eating you, but first i need to give you the taste test2 and wit that she lfts you up to her mouth and begins to lick you and suck on you, her soft tounge caressing your body, covering it in saliva. She sucs you into her mouth and continues to suck and lick your tiny body. You are really enjoying this but you don't want to admit it to yourself. Your Mom then removes you from her mouth<br>\r\n<br>\r\n   \"Well, did you enjoy that, I hope you did because that is just a taster of what is to come\" she says grining, \"But I still havent decided how to eat you\"<br>\r\n\"I know, I will...</span></div></div>",
            "created":1184389200,
            "id":425707,
            "title":"Taste test"
        },
        "13111":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Hot dog and chips",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But what sort of meal?</span></div></span></div>",
            "created":1184389200,
            "id":425708,
            "title":"what to do?"
        },
        "131111":{
            "choices":[
                "Hotdog",
                "Chips"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will Carol be a part of?</span></div></span></div>",
            "created":1401512400,
            "id":1804965,
            "title":"Hot dog and chips"
        },
        "1311111":{
            "choices":[
                "In Mina's room",
                "In Crystal's room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"well Carol, it looks like I'm out of hotdogs, so I'll have to use you.\" she then places Carol on a bun and puts ketchup on her.<br>\r\n\"Down the hatch\" she said as she ate Carol.<br>\r\nCarol respawns . . . .</span></div></span></div>",
            "created":1401512400,
            "id":1804970,
            "title":"Hotdog"
        },
        "13112":{
            "choices":[
                "Crystal comes in",
                "Mina comes in"
            ],
            "content":"<div class=\"\"><div> <span>She takes you to the kitchen and sets you on the table. She then pulls something out of the freezer.<br>\r\n\"Is that what I think it is?\" Carol said. Susan turned and smiled.<br>\r\n\"Yep it's an ice cream sandwich.\" She takes it out of the package and sets in next to Carol. \"Do you want to be on top, or inside?\"<br>\r\n\"I want the inside scoop\" Carol said. Susan just laughed.<br>\r\n\"OK then\" she put Carol inside and held it in front of her mouth.<br>\r\n\"What kind is it?\"<br>\r\n\"Strawberry\" just before she started,</span></div></div>",
            "created":1461128400,
            "id":2136584,
            "title":"Ice cream Carol sandwich"
        },
        "131121":{
            "choices":[
                "Mina appeared behind them",
                "Susan decided to watch a movie with them downstairs"
            ],
            "content":"<div class=\"\"><div> <span>Crystal is wearing a black short sleeve shirt and black shorts. Crystal also wore black socks with skulls on them. She walks up to Susan and looks at Carol.<br>\r\n\"Oh sweet it worked.\" She said. Susan nodded.<br>\r\n\"Yep, and I was just about to eat her.\" Crystal didn't like this idea though.<br>\r\n\"Aw, but I want her.\" Crystal whines.<br>\r\n\"You can have her when I am done\" Susan said.<br>\r\n\"But I want her now.\" Crystal started to cry.<br>\r\n\"Oh come now, you're 18 . . .  Oh alright, you can have her first\" Crystal brought her head up fast and grabbed the ice cream sandwich.<br>\r\n\"Thank you so much.\" Crystal shoved it completely in her mouth and swallowed. Carol re-spawned on the table.<br>\r\n\"Now, may I eat her?\" Susan asked. Crystal nodded. \"Thank you.\" Susan grabbed you and pulled something else out of the fridge. It was vanilla ice cream and Susan grabbed Crystal as well. She took them down to the basement. Crystal and Carol had never been down in the basement before. The walls had bright colors, there was also a couch and a table with a bowl of gummy bears on it. Susan took Crystal's shirt off, revealing her black bra and her bellybutton. Crystal then laid down on her back, in the middle of the soft floor and Susan poured the ice cream on her. Even though it felt cold, Crystal liked the feeling. Susan then put Carol on top of it. Carol already realized what she was going to do. Instead of using a spoon like a normal person, Susan dipped her head and licked Carol, causing her to fall down in front of Crystal's boobs. Susan ate all of the ice cream, licking all spots. Finally, Susan dipped her head down for Carol. Carol ran away from the giant mouth until Crystal shoved her boobs together, making Carol stuck. Susan grabbed her small daughter's head and lifted it up. Carol struggled so much, until Susan threw her body in the air and caught the most of the thing with her mouth, leaving Carol's leg outside. Susan chewed her up and swallowed. Carol's leg, however fell down onto Crystal's massive breast.<br>\r\n\"May I have this part?\" Crystal asked. Susan nodded and Crystal ate Carol's leg. Carol appeared on Crystal's stomach and . . .</span></div></div>",
            "created":1465952820,
            "id":2164369,
            "title":"Crystal comes in"
        },
        "1312":{
            "choices":[
                "Yes, and she kisses you for that",
                "No, so she steps on you fro that",
                "Crystal walks in wanting you"
            ],
            "content":"<div class=\"\"><div> <span>You struggle a lot to get away from her.<br>\r\n\"Have it your way\" she said, as she squeezed hard, making you lose all your energy. She takes you into the kitchen. She takes out tape and tapes your mouth closed. Your mom then takes out a hot dog bun from the cupboard. You struggle, trying to scream. She puts you on the hot dog bun and starts to eat you. First your legs, then up to your belly button, then up past your tits and finally your head. You respond in front of her. You are confused at this point. \"So will you be my snack willingly?\"</span></div></div>",
            "created":1462770000,
            "id":2145474,
            "title":"No way, you'll never take me alive (Appolog..."
        },
        "132":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Stay and let her find you",
                "hide in...."
            ],
            "content":"<div class=\"\"><div> <span>    It was Mina, and she looked like she was looking for something. She started prowling around the room, like a tiger on the hunt, checking under the bed, in cupboards and wardrobes. Then she walks over to the dressing table, right to where you are. You don't know what to do, should you hide or let her find you.<br>\r\n<br>\r\n   You have good reason for not wanting her to find you, because for a long time she has wanted to eat you, she likes to \"take you prisoner\", tie you up and pretend to eat you. She one even stripped you down and put a mixture of flavourings onto your naked back, like ketchup and mustard. But, although you never have admitted it to anyone, you actually enjoy her doing this, and find it a big turn on with her pinning you down and using her body weight to hold you in position, and you are curious what she would do to you now.</span></div></div>",
            "created":1186549200,
            "id":433646,
            "title":"Hide and seek"
        },
        "1321":{
            "author_id":"neraciro",
            "author_name":"Neraciro",
            "choices":[
                "\"Yes,\" you murmur, entranced by your destination.",
                "\"N--no!\" you cry, coming to your senses.",
                "\"Not like this,\" you shake your head, an idea forming."
            ],
            "content":"<div class=\"\"><div> <span>Part of you urges you to dive out of sight, but stubborn fantasy glues your feet in place. You stare, all but helpless as Mina turns her eyes towards you. Her face lights up with delight and she makes her way over. Without a care for your safety she scoops you up and holds you in front of her.<br>\r\n<br>\r\n\"Hey there, sis.\" She licked her lips with a longing far beyond her age. \"I'm glad you didn't wander too far away.\"<br>\r\n<br>\r\nYou swallow. Suddenly it's dawning on you just what kind of situation you've put yourself in. \"D--did you do this to me?\" you manage to ask.<br>\r\n<br>\r\nMina cocked her head and grinned. \"Sort of,\" she shrugged. \"I just slipped you the potion. Mum's the one that made it.\"<br>\r\n<br>\r\nYou shake your head disbelievingly. You've heard that one too many times before to believe it now. But then again, you think, you can hardly imagine how Mina could have managed this by herself.<br>\r\n<br>\r\nThat said, your mother hardly seemed like any more likely a suspect.<br>\r\n<br>\r\nReaching into her pocket, she emerged with a packet of ketchup. Memories of your sister smothering you in the stuff fills your head. Your face twists; a smile begins to creep over your face, but you quickly drive it away.<br>\r\n<br>\r\n\"You dirty little bitch.\" Not quickly enough. All but two fingers fall away as she dangles you above her lips. \"You always told me it was bad to lie, so now I'll tell you the same thing.\"<br>\r\n<br>\r\n\"I haven't told any lies,\" you counter.<br>\r\n<br>\r\n\"But I'm sure you're going to.\" She throws open her mouth as wide as she possibly can, her uvula dancing tantalizingly at the back of her crimson throat. She licks her lips again and bares her perfect white teeth, bringing you down until you can smell peanut butter on her breath... \"You want me to drop you in here and chew you up, don't you?\"</span></div></div>",
            "created":1344747600,
            "id":1403021,
            "title":"Stay and let her find you"
        },
        "13211":{
            "author_id":"neraciro",
            "author_name":"Neraciro",
            "choices":[
                "In the kitchen",
                "In Carol's Room"
            ],
            "content":"<div class=\"\"><div> <span>\"Yes,\" you murmur, entranced by your destination. The thought of lying comes and goes faster than you can even register. Your hand reaches up almost of its own accord and begins to finger your vagina firmly. Mina laughs at the sight and flips her hand and holds her hand out, allowing you to break free of her grip.<br>\r\n<br>\r\n\"Lay down, bitch,\" Mina orders. Her voice carries a note of authority you've never quite recognized before. Obediently you fall to your back, watching as above you your sister rips open the ketchup packet, gratuitously pouring it over your body until you almost feel like a puddle with a head. The desire in her eyes slowly grows stronger and stronger.<br>\r\n<br>\r\n\"I can't believe it,\" she admits. She takes a deep breath. \"Carol, I'm about to eat you!\"<br>\r\n<br>\r\nYou smile weakly. \"Do you want me to kick and scream going down?\"<br>\r\n<br>\r\n\"You'll be dead by the time you reach my throat,\" she reminds you flatly. Nonetheless you can see she's seriously considering your offer. \"No,\" she decided after a long moment. \"I'd rather you went in with a smile.\"<br>\r\n<br>\r\nSomehow her answer doesn't surprise you. As much as her capture fantasies were made to appeal to her own interests there was always something in them that you enjoyed. It was the reason you were lying here now, not even contemplating the idea of escape.<br>\r\n<br>\r\nYou give Mina the biggest, most genuine smile you can. \"Don't stop now.\"<br>\r\n<br>\r\n\"As if I would,\" she laughs. She picks you up by the head, dangling you once more. \"Any last words, &lt;i&gt;little&lt;/i&gt; sister?\"<br>\r\n<br>\r\nYou try to shake your head, then stop. \"No,\" you whisper.<br>\r\n<br>\r\n\"Then down you go.\" Without further delay Mina releases you. The drop from her fingers to her lips feels like it takes an eternity, but in fact is over almost immediately as you bounce off her lip, leaving a blotch and begin to roll to the back of her throat. Expertly she bounces you with her tongue, but, sending you rolling into her teeth. They come down, pressing against her softly for a moment - almost as if giving you one final kiss goodbye. Then they come crashing down and she chews you apart, groaning ecstatically as your flavor fills her mouth. It's difficult to decipher whether you're still her sister or her meal in her mind, but either way she finally swallows every bit of you and burps loudly.<br>\r\n<br>\r\n\"Mmm!\" She licked her lips, capturing the few specks of ketchup that had escaped her. \"I think I need seconds!\"<br>\r\n<br>\r\n***<br>\r\n<br>\r\nYou slowly opens your eyes, and a wave of confusion washes over you. You are no longer in Mina's mouth or belly, you realize immediately. Had it all been a dream? A wave of disappointment sweeps over you at the thought.<br>\r\n<br>\r\nYou look around. You are...</span></div></div>",
            "created":1344747600,
            "id":1403031,
            "title":"\"Yes,\" you murmur, entranced by your de..."
        },
        "1322":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Tin",
                "box"
            ],
            "content":"<div class=\"\"><div> <span>You make a snap decision, HIDE!!!! But where can you hide, two places catch your eye, one is an overturned tin, that is easy to get into, but an obvious place to hide, and a small hole in your Moms jewelry box, you could easily get into it and out, and Mina won't find you, but your Mom will if she goes in it before you get out, which will you pick.</span></div></div>",
            "created":1186549200,
            "id":433929,
            "title":"Hide it is"
        },
        "13221":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Yes unfortunately for you",
                "No you're lucky"
            ],
            "content":"<div class=\"\"><div> <span>Being that a simple box wouldn't be very effortive or a good idea to hide from someone like your mother or sister you decide instead a tin can would definitely be more of the perfect hiding spot and quickly dove into it just as the door opened and in walked your mother calling playfully for you \"Sweetie come on out! You know you can't hide from Mommy! I only want to play a fun game with you!\" She tenderly called as if this was a childhood game of hide and seek but you stayed hidden praying she wouldn't be smart enough to look into the simple tin box just in front of her does she though? </span></div></div>",
            "created":1497757380,
            "id":2337956,
            "title":"Tin"
        },
        "13222":{
            "choices":[
                "Eat you",
                "Cook you for tonight's dinner"
            ],
            "content":"<div class=\"\"><div> <span>You decide to hide in the box, since Mina definitely won't find you. You can't see her, so you are forced to wait. You can hear her grabbing the tin. Good thing you didn't hide there. Finally you can hear Mina say:<br>\r\n\"I guess my doll isn't here.\" You hear the door close. After a minute, you try to leave but then you hear the door open again. The box opens and your mother looks down at you.<br>\r\n\"There you are, my little girl\" she grabs you and pulls you out. She is wearing a green bra and yellow panties.<br>\r\n\"Did you shrink me?\" You ask. She nods and reaches in the box again and pulls out a necklace. On the golden chain, there was a heart shaped stone. It was completely blue. Your mother put it on and walked over to the vial on the bed. She picked it up and explained a lot of things.<br>\r\n\"I pit this liquid in your Mac and cheese last night. It was easy to make, since I am a witch. I have a lot of my power always, however this necklace boosts my power by a lot, and I was able to make this vial because of my necklace.\" Strangely, you understood a lot of this. Then something occurred to you.<br>\r\n\"What are you going to do with me?\" Your mom simply smiled and called your name. You were confused until a copy of you came in. Literally, she looked exactly like you. \"You made a clone?\" You ask<br>\r\n\"Not exactly, she may look like you, however she is just a slave basically. She listens to everything I tell her, but she cannot talk, nor will she do anything without me telling her.\" Your mom gave you to the clone and she gave the copy a command. It was to . . .</span></div></div>",
            "created":1465707600,
            "id":2163294,
            "title":"Mother = Powerful Witch"
        },
        "132221":{
            "author_id":"leviepollard",
            "author_name":"Write/reader",
            "choices":[
                "Nothing you just live in your own stomach/are digested and respawn",
                "Something else "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You will live but what happens with the interactions between the real you and the fake you after you are in your own stomach?</span></div></span></div>",
            "created":1465707600,
            "id":2163347,
            "title":"Eat you"
        },
        "132222":{
            "choices":[
                "You to feed Carol to me",
                "To eat Carol right now"
            ],
            "content":"<div class=\"\"><div> <span>The copy nodded and went into the kitchen. You struggle, but can't move her fingers at all. Carol 2.0 gets to work, getting bread, cheese, lettuce and ketchup together.<br>\r\n\"Why do you listen to mom? Don't you want to be free, or make your own choices?\" You ask her. She keeps working but looks down at you and starts talking without interrupting her work.<br>\r\n\"Even though she called me a slave, I love her. I was created to work for her and the work she gives is really fun.\" She says, using your voice in a sweet way. \"Plus, she treats me very well.\"<br>\r\n\"But don't you want to eat me?\"<br>\r\n\"You re-spawn, so there is time. I trust her commands. However, yes. You do look tasty, oh look, the burgers are done.\" You look down to see three sandwiches all ready. \"All I need to do is put you in and serve you to Mother, Crystal and Mina.\" She set you in one of them and put it on a plate.<br>\r\n\"I have a question first. Did mom make a copy of Mina or Crystal?\" You ask. Carol 2.0 shakes her head.<br>\r\n\"I am the only copy, and I can tell what you are thinking, you are wondering when mother created me. It was one year ago, I was always living in the attic since then, and that is why she never let any of you in there. However, now that you are shrunk, mother is going to give me your bedroom. You were shrunk so that we may play with you, and at night, mother says I shall keep you anywhere I want you. I have decided to put you in my stomach at night. It won't hurt you, I can control digestion unlike you creatures.\" You were paying so much attention to her, you didn't notice where she had taken you. She had brought you to Mina's room.<br>\r\n\"Why Mina first?\"<br>\r\n\"Mother has instructed me to first feed Mina since she is the youngest, then Crystal since she is the other child, and then her, so she can see how well I did the job she gave me. Don't be surprised that our sisters don't show any reaction to me, mother has told them about me this morning.\" You look over to Mina who was taking a nap. Carol 2.0 used her free hand(as she was balancing the plate,with the burger you were in, on her right hand) to wake her up. Mina slowly got up and looked at her.<br>\r\n\"So you are the copy?\" The copy nodded. \"Good, now I want . . .</span></div></div>",
            "created":1468469640,
            "id":2179915,
            "title":"Carol 2.0 makes a Carol cheeseburger"
        },
        "1322221":{
            "choices":[
                "Go to bed in your room",
                "Cook her up for yourself"
            ],
            "content":"<div class=\"\"><div> <span>\"Open wide.\" The copy said. As she was putting the burger in Mina's mouth, something occurred to you.<br>\r\n\"Hey wait a second, mom said you couldn't talk.\" Carol 2.0 stopped for a second.<br>\r\n\"That was a half lie, I can talk but it's that I didn't really talk before in the past.\" She continued to feed Mina. The end with your feet went first. Mina took a big bite. The copy kept feeding her until there was only one more bite. Mina tilted her head back and opened her mouth. The copy raised you over her mouth and dropped the rest in. You woke up in the copy's hand. \"Now it is time for our sister Crystal.\" She said. She went downstairs and put you in the second burger. She then went up to Crystal's bedroom to find that she was on the computer.<br>\r\n\"Oh hey, thanks for this\" Crystal said. Carol 2.0 nodded.\"But can you grind her up for me?\" When you heard this, you looked at the copy. Her stomach opened up and she set you in. You then hear a grinding noise and everything goes black. You re-spawned in the copy's hand again. She has a glass in the other hand. She lowers it down and opens her stomach again, letting the now liquid burger you had been in, fall into the glass. She set it down next to Crystal. <br>\r\n\"Enjoy.\" She says. Crystal brought it up to her lips and drank it. It was hard to imagine that you were technically part of that. The copy goes to the last burger. When you were in it, she took you up to your mother's bedroom. Inside, your mom was laying down on the bed with her eyes closed.<br>\r\n\"So, you have fed the other two?\" The copy nodded. \"Then come and feed me.\"<br>\r\n\"Yes mother.\" She says, and walks over.<br>\r\n\"It's been a very long time since I have heard you.\" Your mom smiled. The copy put your burger on her stomach. Your mom was wearing the necklace from before. She picked you up and sat up. She then bit down on your feet. She kept eating until there was only half left. \"Why don't you have it, since you have been very good.\" She gave you to the copy. Carol 2.0 licked her lips and devoured you. She chewed you up fast, swirling you around, enjoying your taste. Your mom just laughed. The copy swallowed and leaned in. Your mom then kissed her on the lips. \"You had a little bit on your lip.\" She says. You re-spawned on the table. \"Carol, why don't you take tiny Carol and . . .</span></div></div>",
            "created":1468531140,
            "id":2180264,
            "title":"Feeding the whole family"
        },
        "13222212":{
            "choices":[
                "Neeeg ",
                "Gere"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She becomes a sandwich </span></div></span></div>",
            "created":1566272760,
            "id":2705078,
            "title":"Sandwich "
        },
        "133":{
            "choices":[
                "I shrunk Carol and put her in your cake by mistake\"",
                "It's not ready yet\"",
                "\"A cake? Ooh let me see\""
            ],
            "content":"<div class=\"\"><div> <span>Crystal walked in missing a shirt.<br>\r\n\"Carol, are you in here? May I borrow a shirt?\" She then looked on the dresser and picked Carol up. \"I didn't know we had a Carol doll.\" She put Carol in her pocket. Carol started to shake around, then heard \"guess she isn't here\" she started to shake around more, until Crystal took Carol out. On a table was a vanilla cake. \"It's moms birthday today, and you are going right on top\" Crystal put the naked Carol(she was already naked) on the cake. Carol tried to say something, but couldn't seem to get the words out. Crystal  started pushing Carol down in the cake until her legs weren't visible. Finally with one final yell, Carol said<br>\r\n\"STOP!\" Crystal jumped back.<br>\r\n\"Carol? Is that really you?\" Carol nodded. \"Oh dear, what should we do, I didn't think it would actually work.\"<br>\r\n\"What do you mean?\"<br>\r\n\"I ordered a shrinking potion and put it in your milk last night, I didn't think it actually would shrink you. The instruction manual said though if you die, you re-spawn.\" Crystal closed her eyes and started thinking.<br>\r\n\"Well, I'm already in mom's cake, I guess it would be alright if I was eaten.\"<br>\r\n\"What's going on?\" Crystal turned around and Susan was standing right behind them. Crystal started talking.<br>\r\n\"Well, I got you a cake but, . . .\"</span></div></div>",
            "created":1462078800,
            "id":2141884,
            "title":"Susan's Birthday"
        },
        "1331":{
            "choices":[
                "Started eating around Carol",
                "Poured chocolate syrup on Carol",
                "Pulled Carol out to get a better taste"
            ],
            "content":"<div class=\"\"><div> <span>\"Really? How?\" Susan pushed her out of the way to take a look. Carol just stared at them.<br>\r\n\"I put a shrinking potion in her milk last night, and earlier I thought she was a doll, so I pushed her in.\" Susan leaned towards Carol and smelled her. \"She will re-spawn if she dies though\" Susan looks at her.<br>\r\n\"If that is the case, then I want to eat her\" Carol's eyes widened.<br>\r\n\"Wait until the party at least\" Crystal said. Susan just sighed and nodded. She then went to the bathroom. \"Looks like you don't have a choice\" Crystal said. With that in mind, Crystal pushed Carol further down. Carol screamed. More and more disappeared into the frosting. Her belly button, arms and breasts. Soon only her head was visible. Crystal nodded. \"That should be good\"<br>\r\n\"Wait I'm not sure about this\" Carol said. Crystal ignored her. Later that night, Susan was wearing blue pants and no shirt. Instead, she had a red bra on and a bib that said \"Let's eat\". This was too true for Carol. Susan also had a green party hat on. Susan cut Carol's slice and brought her to the counter.  Susan grabbed her fork and. . .</span></div></div>",
            "created":1464238800,
            "id":2154571,
            "title":"Susan's yummy birthday cake"
        },
        "13311":{
            "choices":[
                "Dip her head and grab Carol with her mouth",
                "Open some presents"
            ],
            "content":"<div class=\"\"><div> <span>Susan got little pieces of frosting on her fork and ate them.<br>\r\n\"Soon, you will be in my belly\" Susan said. Carol could see her mother's stomach. She imagined being in there. Soon, Susan got a big piece that was in front on Carol. She brought it up to her mouth and swallowed it. Carol was still stuck, however her boobs were poking out. Susan brought her fork down and grabbed another piece, this time with Carol. Susan put Carol in her mouth and chewed her up. Suddenly, Carol could feel her being pulled. She then entered another mouth from Susan's mouth. Crystal was kissing her mom. Carol went down Crystal's throat and into her stomach. She re-spawned in front of them and they looked at her. Susan then decided to . . .</span></div></div>",
            "created":1465362000,
            "id":2160856,
            "title":"Started eating around Carol"
        },
        "1332":{
            "choices":[
                "Mina appears behind them smiling",
                "Carol sits on the cake, ready to be eaten",
                "Susan immediately returns home"
            ],
            "content":"<div class=\"\"><div> <span>\"It's not ready yet\" Crystal said.<br>\r\n\"Do you know when it will be done?\" Asked Susan curiously.<br>\r\n\"About in a hour or two\"<br>\r\n\"Ooh goody, I will go to the store then for about two hours, we need cookie dough ice cream any way.\" Susan left and they hear the car leave. Crystal turned around.<br>\r\n\"Sorry, I think we should decide what to do first.\" They both think for a minute.<br>\r\n\"Let's tell her I am shrunk, and let her eat me, I do resplendent right?\" Carol asked<br>\r\n\"Of course\" carol climbs out and they fix the hole in the cake, when they get done, . . .</span></div></div>",
            "created":1462251600,
            "id":2142841,
            "title":"Delaying the munching"
        },
        "13323":{
            "choices":[
                "Pushed Crystal out of the way, confused about Carol",
                "Asked if the cake was ready again"
            ],
            "content":"<div class=\"\"><div> <span>\"Is it done yet?\" Susan asked, scaring both Crystal and Carol.<br>\r\n\"Why are you back so fast? HOW DID YOU GET BACK SO FAST!?!\" Crystal yelled. It was true though, it had been only 5 minutes, and yet Susan already had cookie dough ice cream in a Store bag. That really confused Crystal because it took about 10 minutes to get to the store by car. \"WHAT DO YOU HAVE A SECRET STASH OF ICE CREAM AND STORE BAGS!?!\"<br>\r\n\"Stop yelling please, and details aren't important. So is it ready yet? I know you said two hours but I can't wait.\"<br>\r\n\"Um . . .\" Crystal grabbed Carol and hid her behind her back. Carol wasn't sure if Susan saw her. \"It is almost ready. It's taking less time than anticipated.\"<br>\r\n\"Really! That's so wonderful!\" Susan licked her lips. \"When will be done, how long?\"<br>\r\n\"10 minutes\" Crystal said quickly. Both she and Carol knew that their mom got this way when she got excited.<br>\r\n\"Yay! I will go get dressed.\" With that she left for her bedroom. Crystal turned around and looked at Carol.<br>\r\n\"Seriously how did she do that so fast?\" Carol shrugged. Both of them thought for a second. When are we going to tell her?\"<br>\r\n\"How about just before the party?\" Carol asked.<br>\r\n\"Sounds good to me\"<br>\r\n\"What sounds good?\" Susan said behind them. Both Carol and Crystal jumped and screamed.<br>\r\n\"STOP DOING THAT! SERIOUSLY HOW ARE YOU DOING THAT!\" Susan just giggled at Crystal, then</span></div></div>",
            "created":1464670800,
            "id":2157008,
            "title":"The impatient mother"
        },
        "1333":{
            "choices":[
                "Asked where Carol was",
                "Started to eat a piece of cake",
                "Grabbed Carol to eat first"
            ],
            "content":"<div class=\"\"><div> <span>Susan pushed Crystal out of the way to take a look at you and the cake. She stares directly at Carol.<br>\r\n\"You even put an edible Carol on it. I can't wait to taste it.\"<br>\r\n\"It isn't complete yet so you will need to wait a little bit.\" Crystal said fast. Susan huffed.<br>\r\n\"Oh alright, I can't wait though, I bet it is delicious.\" Susan goes in her room to get dressed. Crystal looks at Carol.<br>\r\n\"That was close, after all, I still need to put chocolate syrup on it, and you say it is okay for her to eat you?\"<br>\r\nCarol nodded her head. Crystal then started to get to work, adding the finishing touches. She then left and came back with Susan and Mina. Susan was wearing a bikini and panties. The candles were lite and she blew them out. Susan then. . . .</span></div></div>",
            "created":1462597200,
            "id":2144617,
            "title":"The family together for a party"
        },
        "13331":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Carol is cut up",
                "Carol is on one slice"
            ],
            "content":"<div class=\"\"><div> <span>Carol stared up out of the chocolate syrup as her mother asked \"Where's Carol?\"<br>\r\n<br>\r\n\"Oh she went out somewhere, don't worry about it,\" said Crystal.<br>\r\n<br>\r\nCarol was having second thoughts about this. Her mother's stomach was all she could see right now and it was suddenly terrifying. She tried to cry out but her big sister had covered her mouth with chocolate. She could breathe through her nose but couldn't talk.<br>\r\n<br>\r\nMina leaned over. The little girl seemed huge now and her breath washed over Carol. \"I want to eat Carol!\"<br>\r\n<br>\r\nCrystal told her off. \"No, I made the cake for mum and she gets to eat little Carol.\"<br>\r\n<br>\r\n\"It's okay,\" Susan said, peacemaking, \"I can only eat so much chocolate.\"<br>\r\n<br>\r\nCarol couldn't believe it. Her own family were arguing over who was going to eat her! She struggled but her limbs were held firm in icing. They all seemed so big.<br>\r\n<br>\r\nCrystal smiled \"I know mum. The little Carol is made of sausage. I know most people wouldn't want meat on a cake but...\"<br>\r\n<br>\r\nSusan smiled \"Then Mina, you can't have it! Thankyou Crystal. I can't wait.\" Her stomach rumbled, very loudly to Carol, as her digestive juices started to flow in anticipation. Carol's eyes widened in terror as her mother stroked her body and then licked the syrup off sighing with pleasure. Her stomach rumbled again and she reached for the knife.<br>\r\n<br>\r\nTears welled in Carol's eyes as her mothers stomach loomed overhead and the blade drew nearer..</span></div></div>",
            "created":1464152400,
            "id":2153685,
            "title":"Where is Carol?"
        },
        "133311":{
            "choices":[
                "In Crystal's hand",
                "Just in front of Mina's foot"
            ],
            "content":"<div class=\"\"><div> <span>Carol, who was laying down on the cake, looked up to see the knife. Susan brought the knife down and cut through Carol's belly button. Carol didn't feel any pain, and she knew Crystal would re-spawn her, yet Carol was still afraid. She had her lower half on one slice of cake and her top was on another piece. Susan took the two pieces to the couch and set them on the table in front of it. Susan waited until Mina and Crystal got their pieces and sat down on the other side of the table. Carol still couldn't talk. All she could do was watch her mom's fork come down and take cake to her mouth. Susan finally got Carol's bottom half and brought it up to her mouth. Carol watched it go in her mouth and disappear, on it's way to her stomach.<br>\r\n\"Mm, this Carol meat is just delicious.\" Susan said, spinning her fork around Carol's top half slowly. \"Now for the top half.<br>\r\n\"I hope you enjoy it\" Crystal said. Carol thought the same thing. Her destination was only a few feet away from her, for a normal sized person. Susan brought her fork down scooped the rest of Carol up. She brought it up to her mouth. Carol got a good look at her mother's stomach, breasts, and when she stopped going higher, her mouth. Susan's giant lips opened up, greeting Carol, and Carol went in. Susan closed her mouth and pulled her fork out, leaving Carol in. Carol slid down her throat and into her stomach she could see her other half. Carol passed out, and woke up</span></div></div>",
            "created":1464584400,
            "id":2156180,
            "title":"Two halves, going to the same stomach"
        },
        "133312":{
            "choices":[
                "Mina's piece of cake",
                "Susan's leg"
            ],
            "content":"<div class=\"\"><div> <span>Susan cut a piece with Carol on it. She then asked Crystal a weird question.<br>\r\n\"Crystal, could you come up the the bedroom, and feed this to me? Pleease?\" Crystal wasn't sure how to answer at first, but then said sure. They both went up to Susan's bedroom, leaving Mina downstairs. Susan payed down on the bed, with her plate right next to her. Carol looked at her mom's stomach. She was pretty terrified at the thought of her being on the inside in a few moments. Crystal started to climb on the bed with Susan when she said, \"Your not seriously, going to feed me with full clothes are you?\" Crystal hesitated, but did what the birthday woman wanted. Crystal stripped herself, leaving bet bra and panties. \"That's better\" Crystal grabbed Carol's piece with her hand and lifted in above Susan's mouth. Carol couldn't fall because her legs were still in the cake, and the icing was still holding her limbs together.<br>\r\n\"Down the hatch, birthday mom\" Crystal said, and lowered the piece into her mouth. Susan took a bite, missing Carol by just a few inches. Crystal lowered it some more, making Carol enter Susan's mouth. It started to close, making all the light in her mouth  to exit.<br>\r\n*CHOMP* Carol was now in the process of being eaten. She could hear Crystal outside, saying<br>\r\n\"How does it taste?\" Susan just moaned with pleasure. Her tongue made Carol free of the frosting and chocolate. She tried to yell, but she was too tired.<br>\r\n*GULP* Carol went down Susan's throat, and into her belly. When she landed, she went to the wall. Her fear of being inside of her stomach was here. She passed out and woke up on . . .</span></div></div>",
            "created":1464757200,
            "id":2157223,
            "title":"Crystal gets to feed the birthday woman"
        },
        "13332":{
            "choices":[
                "\"Enjoy eating her, that's the real Carol\"",
                "I want to eat her now, she is the real Carol\""
            ],
            "content":"<div class=\"\"><div> <span>Susan cut the cake and put her piece on a plate. She then went and sat down. Carol was really confused. Susan's piece didn't contain her. Crystal was also confused and spoke up.<br>\r\n\"Don't you want Carol?\" Crystal tilted her head when saying this. Susan shrugged.<br>\r\n\"One of you can take her, I don't want to taste her\" Susan said and put a piece in her mouth.<br>\r\n\"Why?\" Susan swallowed a piece and answered.<br>\r\n\"Because it looks like my daughter, it would be a little creepy to me. Just a little.\" <br>\r\n\"I'LL TAKE HER!\" Mina said and pushed Carol out of the way. As Mina was cutting Carol's piece, Crystal went over and whispered some things in Susan's ear.<br>\r\n\"Really?\" Susan whispered. Susan closed her eyes, tilted her head down and thought for a few seconds. Crystal whispered some more things. Mina was taking her fork close to Carol, getting ready to eat her. \"Wait Mina.\" She turned around to look at her.<br>\r\n\"What is it?\" Mina said. Susan just smiled.</span></div></div>",
            "created":1464670800,
            "id":2156982,
            "title":"Susan isn't eating Carol?"
        },
        "133321":{
            "choices":[
                "Put Carol on a piece of cake",
                "Took Carol to the bedroom for some privacy"
            ],
            "content":"<div class=\"\"><div> <span>Mina was a little confused. Susan explained.<br>\r\n\"Apparently, Crystal shrunk her and put her in the cake. After you eat her, I shall take her, since she<br>\r\nre-spawns,\" When Mina heard this, she got so excited. She jabbed her fork in Carol's belly and pulled it up. The fork had gone all the way through. Carol felt no pain though. Mina stuffed Carol in her mouth and swallowed.<br>\r\n\"How was she?\" Crystal asked.<br>\r\n\"Delicious, scrumptious, amazing, take your pick.\" Carol re-spawned on Susan's hand. Susan licked her lips. She then . . .</span></div></div>",
            "created":1465793880,
            "id":2163362,
            "title":"\"Enjoy eating her, that's the real Caro..."
        },
        "13333":{
            "choices":[
                "They decide to tell her, and Susan is fine with it",
                "No, instead Crystal gives Carol to Susan as a toy"
            ],
            "content":"<div class=\"\"><div> <span>Susan licked the chocolate syrup off of Carol.<br>\r\n\"Why don't you bow to me girls? It is my birthday\" Susan said. Both Crystal and Mina bowed to her.<br>\r\n\"All hail queen mom\" they said and looked up to see what would happen. Crystal couldn't wait to see Carol be eaten. However, she also wasn't sure how her mom would react when she learned the truth. Susan held Carol in front of her face.<br>\r\n\"Carol, my daughter, you showed up late to this party, so I have to punish you\" Susan said, still thinking the Carol she held was fake. \"You shall be sacrificed to me and guess what\" she put her finger on Carol's chin. Susan then leaned to Carol's ear. Carol stayed still because food doesn't move. \"I'm going to swallow you whole.\" Susan held Carol above her mouth, before she dropped Carol, she looked at the other girls. \"This is what happens to girls who don't obey\" Susan dropped Carol in her mouth and swallowed. Mina walked up to her and rubbed her stomach. Meanwhile, Carol re-spawned on Crystal's bed. A few minutes later, Crystal walked in naked.<br>\r\n\"What happened to you?\" Carol asked.<br>\r\n\"Since she is queen for the night, we are ordered to be naked\" Crystal grabbed Carol. \"Anyway, should we tell her the truth?\"</span></div></div>",
            "created":1464498000,
            "id":2155855,
            "title":"Susan, queen of the house"
        },
        "133331":{
            "choices":[
                "They played games",
                "Susan feeds Carol to Crystal as a reward for bringing Carol to her"
            ],
            "content":"<div class=\"\"><div> <span>Crystal took Carol to the living room. Susan was on the couch watching a movie, while Mina was eating cake like a dog. Crystal walked up to Susan.<br>\r\n\"Um, mom, we need to-\" Susan cut Crystal off by pulling up her hand. Crystal just signed. \"Queen mom, there is some-\" Susan cut her off again. Crystal was getting a little angry now, even though she did this on all of her birthdays. \"Queen mom, may I have permission to speak?\" She said as she knelt down.<br>\r\n\"Of course, my child, what is it\" Susan said and smiled. Crystal looked up at her.<br>\r\n\"There is something you need to know.\" Crystal showed her Carol.<br>\r\n\"Carol comes back in my presence?\" Susan questioned.<br>\r\n\"Yes, but not in the way you think, it isn't a fake, it's the real Carol, so was the last one, she just re-spawned.\" Susan took Carol from her.<br>\r\n\"Alright, go and have cake, eat like a dog just like how Mina is eating it. I shall speak to Carol, alone.\" With that, Susan went up to her bedroom with Carol. Susan sat on the bed, and set Carol in front of her. \"Speak, little girl\"<br>\r\n\"It is me, I didn't mind being eaten by you\" Carol said.<br>\r\n\"You better not mind, because for the rest on the night, you are now my slave\" Susan said. Carol looked confused.<br>\r\n\"I . . . am?\" She said.<br>\r\n\"Yes, you will be at my side, doing whatever I tell you to do.\" They both went back downstairs, and Carol had to clean Susan's feet first. After that was done, . . .</span></div></div>",
            "created":1465362000,
            "id":2161161,
            "title":"They decide to tell her, and Susan is fine with it"
        },
        "14":{
            "author_name":"SilentOne",
            "choices":[
                "...Crystal entered the kitchen.",
                "...Mom walked in."
            ],
            "content":"<div class=\"\"><div> <span>She was in the kitchen on the counter! Carol was confused about being there. Last thing she remembered was going to sleep. For some reason this bothered her more than being shrunken. Carol stands up and becomes aware of being completely naked. Embarrassed, she looked around and spotted a piece of lettuce near her. It was a strange thing just to be sitting out but she was glad for it. It was large enough to cover her. She sprinted over to it and lifted it up. The weight surprised her. It felt as heavy as a soaked towel. Carol wrapped the lettuce around her body and looked around once more. Other things on the counter were a couple condiments, a tomato, a slice of cheese, and a couple slices of bread. Crystal must have been upset again. She was not in the room at the moment. Carol walked over to the edge of the counter and looked down. Because of how small it is, the ground looked like it was a mile or two down instead of four feet. Carol sighed and sat down, waiting for someone to come into the room to help her. After a couple minutes...</span></div></div>",
            "created":1168232400,
            "id":371871,
            "title":"Late-Afternoon Snack?"
        },
        "141":{
            "author_id":"celestia",
            "author_name":"Princess Celestia",
            "choices":[
                "\"Yes, but I want you to do something for me first.\"",
                "\"no, and i'm getting hungry for a sandwich\""
            ],
            "content":"<div class=\"\"><div> <span>Crystal entered the kitchen and saw that the lettuce had moved from where she had placed it. \"what the... who could have moved my lettuce? I was only gone for five seconds.\" she said as she looked closely at the lettuce when she noticed her sister wrapped up in it.<br>\r\n<br>\r\n\"Crystal!!! can you hear me?! It's me carol!!\"<br>\r\n<br>\r\nCrystal blinked for a moment and lightly touched her 6 inch sister on her head. \"Carol? but, how did you get so small? and why are you wearing lettuce?\"<br>\r\nCarol took a step back and explained what happened to her. Crystal then smiled as she looked at her sister.<br>\r\n<br>\r\n\"Why are you looking at me like that Crystal?\" said Carol nervously. \"oh, I was just thinking about how good you looked in that lettuce. It's a cute look for you.\". carol blushed upon hearing that, but somehow it didn't calm her down.<br>\r\n<br>\r\n\"So will you help me get back to my normal size Crystal?\" Crystal pondered this for a moment and then reached a decision...</span></div></div>",
            "created":1168318800,
            "id":372196,
            "title":"Crystal: kind hearted sister or hungry giantess?"
        },
        "1411":{
            "choices":[
                "Grabbed Carol",
                "Grabbed the cupcake",
                "Grabbed Carol and put her on the cupcake"
            ],
            "content":"<div class=\"\"><div> <span>\"What is it?\" Carol said hesitantly. Crystal smiled.<br>\r\n\"I want to do something special for mom, because she has been really nice lately\" Crystal said.<br>\r\n\"And this special thing for her involves me?\"  Crystal walked over to the fridge and pulled out a cupcake.<br>\r\n\"I was trying to think about how to make it really special, and seeing you gives me and idea.\" Carol looked at it and sighed.<br>\r\n\"You're going to put me in it?\" Carol wasn't expecting Crystal's response<br>\r\n\"Actually no, instead, I'm going to put you next to it for presentation.\" Carol thought for a minute. \"So, are you going along with it?\"<br>\r\n\"What if I refuse?\"<br>\r\n\"If you refuse\" Crystal walked over to the fridge \"I will put you in some ice cream and eat you\"<br>\r\n\"OK then I'll go along with it\" Crystal spent the next 10 minutes putting the finishing touches on it. She then took the lettuce and put Carol right next to the cupcake. \"So I just have to stand here, and say ' surprise this is for you '?\"<br>\r\n\"That's correct\" Crystal took the plate with the cupcake and Carol to Susan's bedroom. She was sleeping peacefully in her bed. Crystal quietly placed the plate on the desk and left. Carol patiently waited until Susan woke up. After about an hour, Susan stirred and got up. Her blanket fell of, revealing her wearing a bra and panties and nothing else. After a second, Susan noticed Carol and the cupcake.<br>\r\n\"Surprise! This is for you mom\" Carol said and made a gesture showing the cupcake. Susan licked her lips and . . .</span></div></div>",
            "created":1465189200,
            "id":2159944,
            "title":"\"Yes, but I want you to do something for me..."
        },
        "1412":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "\"YES!\" Oopsies.",
                "\"NO!\" Focus on getting back to normal now..."
            ],
            "content":"<div class=\"\"><div> <span>Crystal shook her head sadly. \"I wish I could. But I don't even know how this happened and... well.. I don't want to try anyhting that might hurt you.\"<br>\r\n<br>\r\nCarol sighed and nodded. SHe was right... not much she could do if she did not even know how she got here. Before she could think on it more, she heard a rather scary sound.<br>\r\n<br>\r\nIt was a low rumble, but loud enough for Carol to hear. Crystal patted her belly and shook her head.<br>\r\n<br>\r\n\"Ah great. First I find my sister shrunk and then I have an empty...tummy... wait...\"<br>\r\n<br>\r\nshe hmmms some. Carol stares.<br>\r\n<br>\r\n\"Sis...\" She says nervously, \"What are you thinking?\"<br>\r\n<br>\r\n\"Well... You ARE wrapped in lettuce... and you DO look kinda tasty...\" She licked hert lips, then shook her head. \"No... No I won't.. but I am so hungry....\"<br>\r\n<br>\r\nCarol was sweating. Her sister NEVER resisted a new sandwich, and she certainly would be new. Maybe she should run for it.<br>\r\n<br>\r\nThen again, She had nothing else to do right now. She giggled, slightly embarassed, at thinking that... maybe... it would be fun to be sandwiched? <br>\r\n<br>\r\nCrystal sighed. \"Carol.. my belly is hungry, and I need to make a sandwich... um... will you let me make YOU one?\"<br>\r\n<br>\r\nCarol answers quickly...</span></div></div>",
            "created":1169701200,
            "id":376663,
            "title":"Oh Oh... tummy's rumbling..."
        },
        "14121":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "you reform in your mother's room.",
                "you reform elsewhere"
            ],
            "content":"<div class=\"\"><div> <span>\"well... Ok id love to be in a new sandwich of yours, sounds fun.\" you reply<br>\r\n\"Mmm, I wonder what human meat tases like, well i'm not ging to find out by just standing arround\" replied Crystal, and with that she piked up the tomatoes, and layed them down on the bread, the picked up the lettuce that you were wrapped in, and layed it down flat on the tomatoes, with you on top, then she added the cheese on top of you. to finnish it off she places the bread on top of you.<br>\r\n\"Down the hatch\" exclaims Crystal opening her mouth wide and taking a huge bite out of the sandwich, taking all of you into her mouth at once. you bouce arround her mouth as she chews the sandwich, geting coated in saliva and mashed up sandwich, which feels rather nice and then she swalowes you, you slip slowly down her gullet, curling up and enjoying the experience, you then arrive in the spongy inside of her stomach, which is a nice warm comfortable place. Crystals stomach starts to secrete lots of digestive juices which begin to coat you and tingle. these jucies start to melt you and the stomach walls close in on you.</span></div></div>",
            "created":1175058000,
            "id":450908,
            "title":"sisters stomach"
        },
        "141212":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Basement",
                "Dining room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But where so you want to reform?</span></div></span></div>",
            "created":1184389200,
            "id":425705,
            "title":"Reform!"
        },
        "14122":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Carol stays still",
                "She tries to escape again"
            ],
            "content":"<div class=\"\"><div> <span>\"NO!\" Carol screams! \"That's not even funny Crystal!\" <br>\r\nIt sounded like a little tweet to her big sister and she laughed, \"That's so cute!\" Her big stomach rumbles again and she was still looking at the tiny girl hungrily. <br>\r\n<br>\r\nCarol noticed that Crystals big hands had moved to surround her. Crystal was a big tall girl and Carol was the little cute one in the family. She remembered her greedy sister joking that Carol was 'so cute I could just eat you up'. She wouldn't would she? It was murder.<br>\r\n<br>\r\n\"So sorry little sis but I don't think you're in a position to argue!\"<br>\r\n<br>\r\nCarol shrieked as huge black nailed fingers grabbed her lettuce wrapped body and dumped her onto a slice of buttered bread. \"It's shame what happened but I'm doing you a favour really. You couldn't have much of a life like that anyway; someone would probably step on you or a cat would eat you. And if anyone's going to eat you it's going to be me. Besides you look sooo tasty with that lettuce on you and all sticky with butter.\"<br>\r\n<br>\r\nCarol struggled in the yellow grease and tried to scramble off of the bread, \"You fat greedy pig! Leave alone! I'm your sister!\"<br>\r\n<br>\r\n\"You're a new topping...\" Crystal hit her buttered sister with the butter knife and she fell down, crying. \"Don't make me break your legs.\"<br>\r\n<br>\r\nCarol was dumped back on the bread and monster fingers began dropping lettuce and tomato on to her. Carol was really frightened now. All she could see through the salad was her sisters big fat stomach rumbling away.. It must be just a joke... maybe if played along Crystal would get bored... <br>\r\n<br>\r\n</span></div></div>",
            "created":1177390800,
            "id":402159,
            "title":"Greed"
        },
        "141221":{
            "author_name":"whatsup",
            "choices":[
                "mom didnt listen",
                "mom grounded crystal for a month"
            ],
            "content":"<div class=\"\"><div> <span>so i stay still to see if she will get bored but i could see crystal lifting me up to her mouth and she she took a big bite out of the samdwhich i fought trying to avoid getting chewed so crystal finally swallowed i could feel myslef going down her thraot and i landed in her stomach in nasty stomach juices but luckily it wasnt strong enouh to burn me so i finally got out in a couple of days in the toilet and when i was normal sizes again i took a shower and told mom everything and then </span></div></div>",
            "created":1182315600,
            "id":418589,
            "title":"gettin eatten "
        },
        "1412211":{
            "choices":[
                "\"I'm going to eat you!\"",
                "\"I'm going to eat you, then shrink you, then eat you again!\""
            ],
            "content":"<div class=\"\"><div> <span>\"That's ridiculous!\" your mother says.<br>\r\n\"I'm telling you the truth, mom,\" you plead.  \"I don't know how, but Crystal shrunk me and--\"<br>\r\nYour mother shushes you, placing her hand over your mouth and glaring disapprovingly.  She drives the point home by waving her finger in your face, something you've only seen her do with Mina back when your little sister was 6 and used to make up stories.  You give up trying to convince her for now; it's hopeless.  <br>\r\n\"There, now, Carol,\" your mother says reassuringly.  \"There's no sense in making up stories like this, is there?\"<br>\r\nYou shake your head.  Ironically, if this weren't so depressing, you'd be in tears right now.  You mother tries to cheer you up by hugging you close and scratching the back of your head affectionately.  It doesn't help, but at least she's trying, right?<br>\r\n\"Besides, Carol,\" she whispers, \"I know for a fact that Crystal couldn't have shrunken you, because the only shrinking potion in the house is in my dresser.\"<br>\r\nYou pull yourself away from your mother and stare at her, confused.  She grins evilly, and you note that she's strengthening her grip on your torso and the back of your head.<br>\r\n\"That's right, honey,\" she says, narrowing her eyes at you and licking her lips, \"and from the sound of things it worked like a charm.\"<br>\r\nYou struggle to get away, but she pulls you in close again and whispers into your ear.<br>\r\n\"I'm really anxious to see how it works a second time.  This time, though ...\"<br>\r\n</span></div></div>",
            "created":1189141200,
            "id":442927,
            "title":"Mommy isn't reassuring."
        },
        "14122111":{
            "choices":[
                "\"gulp you down right here.\"",
                "\"make you into a DELICIOUS Carol sandwich.\""
            ],
            "content":"<div class=\"\"><div> <span>Seemingly out of nowhere, your mother produces a bottle of foul-smelling liquid.  Quick as a flash, she opens it and forces the tonic--which tastes even worse than it smells--down your throat.  Choking and coughing, you collapse at your mother's feet.  The last thing you see before your vision fades to black is her massive hand reaching down for you.  <br>\r\n<br>\r\nYou wake up in your mother's hand, completely nude and barely six inches tall.  She gives you a broad, toothy smile.  \"My, but that works quick!\" she says.<br>\r\n\"Oh God,\" you say as your vision clears and you realize the situation you are in.  \"Please, mom, you can't do this.  You can't go around eating people!\"<br>\r\n\"Oh, but I can,\" she replies with a giggle.  \"All thanks to that lovely little potion of mine.  The only question, really, is HOW I'm going to eat you.  I guess I should have thought this through more carefully.  Oh, I know, I'll just ... \"</span></div></div>",
            "created":1189141200,
            "id":442936,
            "title":"In mommy's hand"
        },
        "14122112":{
            "choices":[
                "\"Just eat me like this.\"",
                "\"Bake me.\""
            ],
            "content":"<div class=\"\"><div> <span>You must have passed out.  Or maybe she drugged you.  Either way, you wake up with a start, naked and tied to the kitchen table.  It's night, too; you must have been unconscious for the better part of the day.  You hear the sounds and smell the smells of cooking nearby.  When you turn, you see your mother, naked but for an apron, busily at work on the stove.  A wickedly sharp set of knives sits on the counter nearby.  You'd scream, but it all seems so futile; instead, you can only whimper.<br>\r\nHearing you cry, your mother turns around.  She smiles at you, waves, and sets the stove to a lower heat.  She strolls over to you, pulls up a seat, and starts stroking your hair.<br>\r\n\"Well, it's about time you woke up, Carol, sweetie,\" she coos.  \"I was afraid you'd sleep through dinner.\"<br>\r\nYou start to scream, but she covers your mouth before any sound can come out.  <br>\r\n\"Now, now,\" she says.  \"Screaming will only make you hoarse.  Is something wrong?\"  <br>\r\nYou can only stare; her hand is over your mouth.<br>\r\n\"Oh, I'm sorry.  But you promise not to scream, yes?\"<br>\r\nYou nod.  She takes the hand away.  After taking several deep, steadying breaths, you say, \"Please don't do this, mom.  Please, I'm begging you!  Please don't eat me!\"<br>\r\n\"But why ever not?\"<br>\r\n\"Because I'll DIE, mom!\"<br>\r\n\"You didn't die after Crystal ate you, Carol, and there still ought to be enough of the potion in your system to let you come back from this.  In any event, you're too delicious not to eat.  Oh, which reminds me.\"<br>\r\nShe stands up suddenly and walks over to the spice rack.  <br>\r\n\"MOM!\" you scream.  \"Mom, PLEASE!  I don't want to be eaten!\"<br>\r\nYour mother responds matter-of-factly, not even turning around to watch you beg, as she selects a few choice spices.  \"Yes,\" she says, \"but I want to eat YOU, and since I've gone to all the trouble of getting the shrinking potion, testing it on my own daughter, sending your sisters away for the evening, tying you down, and getting this far along with the preparations, I think I have rather a bit more say in the matter than you.\"<br>\r\nSatisfied with her selections, she sets them down on the table next to you.  She then fetches a gravy-laden turkey baster from next to the stove.<br>\r\n\"I mean, what have you done, exactly?\" she asks.  \"All you've done is complain, really.\"<br>\r\nYour mother proceeds to baste and season you over your protests.  You struggle as hard as you can, but the ropes are tied too well.  From time to time, she licks you, and then either adds more seasoning or purrs with delight and pinches your cheeks, as though you were somehow putting effort into this.  That's the most terrifying part: your mother doesn't even appear to be sexually interested, or bear any malice--it's as though this is a new hobby of hers.  And if you can indeed come back from this one, it very well may be.<br>\r\nSome time later, she is apparently finished.  She looks down at you, smiles lovingly, and tussles your hair.<br>\r\n\"Still with us, deary?\"<br>\r\nYou stare ahead dumbly.<br>\r\n\"Wonderful.  Now, I have a question about preferences for you: I can either gobble you up right here and now and have those lovely veggies I've boiled on the side, or I can stuff you with those veggies and bake you in the oven.  It's really all up to you, so what will it be?\"<br>\r\nDespite yourself, despite the horrible absurdity of the situation, despite the dawning realization that, no matter what happens, you are going to spend the rest of your life as this woman's food, you answer.  You say ...</span></div></div>",
            "created":1189141200,
            "id":442933,
            "title":"Mommy is a busy cook."
        },
        "141221121":{
            "choices":[
                "she makes you into a big sub.",
                "bites a huge chunk out of your thigh and swallows."
            ],
            "content":"<div class=\"\"><div> <span>“Just go ahead and eat me now,” you say.<br>\r\nBy the way your mother’s face lights up, you just made her day.  “Oh, Carol!” she says, smiling a broad, toothy smile.  Quick as a flash, she undoes her apron and lets it fall to the floor.  Her breasts hang freely, jiggling hypnotically as she hustles over to turn off the stove.  You’d forgotten how large your mother’s breasts were.  She must be an E cup!<br>\r\nFinished with the stove, she jiggles her way over to the table and leans over your head.  If you weren’t tied down, you could reach right up and take one of those udders into your mouth.  Right now, there’s nothing more in the world that you’d rather do.  She knows you can’t, though, and teasingly shakes her breasts back and forth just out of reach over you.  “Oh, I bet you like that,” she giggles.  “I bet you’d like Momma’s boobies all mashed up in your face.  Am I right, Carol?  Do you want Momma to smother you with her tits?”<br>\r\nYou don’t respond; you are hypnotized by the pendulous swinging of your mother’s bosom.<br>\r\nEventually, she leaves, patting you on the forehead and taking up a position at your feet.  Slowly, playfully, she unties your legs and brings your feet together near her mouth.  She starts to suck and lick your toes, savoring the taste of each one individually.  God, but it feels good.  You catch yourself moaning with pleasure.  She does, too, and redoubles her efforts, taking both of your feet in her mouth and running her tongue along all ten of your toes at once and rubbing her hands up and down your thighs.  Five glorious minutes later, she lets go of your feet and looks you in the eye.<br>\r\n“Are you ready, baby?” she asks.  Wordlessly, breathlessly, you nod.  “Mmm … good,” she purrs.  She turns her attention back to your legs as she opens her mouth and …</span></div></div>",
            "created":1189486800,
            "id":443998,
            "title":"She plays with her food"
        },
        "1412211212":{
            "author_id":"dragoncatgirl",
            "author_name":"DragonCatGirl",
            "choices":[
                "\"Um, okay.\"",
                "\"I'd rather you just finish me, Mom.\""
            ],
            "content":"<div class=\"\"><div> <span>Somehow you feel no pain as your mother bites down and takes a chunk out of your thigh. She chews, swallows, and beams a smile. \"Carol, you taste marvelous!\"<br>\r\n<br>\r\n\"Um...thanks,\" you say, slightly weirded out, but you're glad you can't feel her eating you. You figure that as long as this remains painless, you may as well let yourself be a meal for your mother.<br>\r\n<br>\r\nYour mother continues feasting, taking another chunk from your leg. You decide to watch as your body is devoured. Soon, your mother has eaten both of your legs. Her eyes move to your upper, remaining half. \"There's still plenty of you left, Carol. How about we let Mina and Crystal have some of you?\"</span></div></div>",
            "created":1293771600,
            "id":1026115,
            "title":"Mom digs in"
        },
        "141221122":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Throughout the duation of your cooking",
                "Not long enough"
            ],
            "content":"<div class=\"\"><div> <span>   \"You can do whatever you wish to me\" you say, defeated.<br>\r\n\"Oh good!\" exclaims your Mother, licking her lips \"I was hoping you would let me roast you in the oven, you will taste soooo good!\" And with that she gives you a little kiss on the lips and turns to a large portion of miscellaneous steaming veggies, picking up the large oval ceramic bowl their in and placing it down next to you. She then picks up a handful of them and shoves them into your womanhood, sticking them all the way into your womb. You squeal as your womanhood is stretched wide open, although it feels amazing, the veggies are hot and are causing a slight mount of discomfort. Once your womb is filled to bursting point your mother forces you to drink a potion that will neutralizes your stomach acid, then proceeds to stuff your stomach as well.<br>\r\n<br>\r\n   \"Almost done\" she says as she rolls you over. She ten stuffs your intestines with veg though your anus, which isn't as pleasant as the first two.<br>\r\n\"All done\" she says as she goes to wash her hands<br>\r\n\"euhhhhhhh\" you moan, feeling very bloated<br>\r\n\"Mmmm, dont you just look delicious\" says your Mother \"You look so goo, i could just eat you right up\" she muses to herself as she undoes your bindings an rolls you into a huge roasting tray. She then, with great difficulty, carries the tray over to the huge double oven you have, she then slides you in to the absolutely blisteringly hot oven and closes the door, blowing you a kiss through the glass. It is very hot, but the potion seems to be stopping you from feeling any pain or passing out through the heat, but you don't know how long it will last</span></div></div>",
            "created":1189400400,
            "id":443572,
            "title":"Your stuffed"
        },
        "1412211221":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Takes a bite out of you",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>   You lie in the oven roasting away, wondering how much longer the potion your mother gave you will last, if it will at all. You lie there marinading in your juices, thinking about your fate and the like, and you come to realize that, if you survive, this could be a regular thing. And if it becomes a regular thing it could be a very enjoyable one too! You have felt no pain whatsoever, only pleasure, even the feeling of the veggies lying in your innards is a pleasant feeling now. So if your mother is enjoying this, and you are, then why not do it more often. You could even make it more fun and enjoyable, adding more and better foreplay. Yeah! why not? you are enjoying this, apart from the fact you may not survive to do it again. So if that factor is removed then this could be very enjoyable experience. By this point you are cooked through completely and you hear the timer start to go off outside. This is it you think, your mother will be hear to eat you any minuet now.<br>\r\n<br>\r\n      You suddenly see the door open to the oven and two oven glove-covered hands enter, taking hold of each side of the tray and hauling you out and, with great difficulty and much cursing, carry you over to the worktop<br>\r\n\"oh!\" exclaims your Mother, who is still just wearing the apron \"you're still alive! Well all the better, you may even survive my stomach, which if you do, I will give you the choice if you wish to do this again, but with more potion so you still survive!\" she adds grinning happily at you<br>\r\n\"Well, if I by some miracle do survive this, I'd love to do it again, but with more foreplay and the like\" you reply happily to your mother<br>\r\n\"I'm glad you said that, because you most probably will survive my eating of your very sexy and tasty looking body, and so we could make this a regular thing even!\" she says very excitedly.<br>\r\n\"But now to more pressing matters, I'm very hungry and you look very tasty, so Its time for me to have my dinner\" says your mother and...</span></div></div>",
            "created":1189573200,
            "id":443999,
            "title":"Realisation"
        },
        "14122112211":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "You are digested and reform in...",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>   Suddenly your Mother sinks her teeth into your thigh moaning in ecstasy<br>\r\n\"Oh, you taste so good!\" she says, \"But you need more flavouring\" And with that she walks over to the cupboards and pulls out some alt and ketchup, but your too busy watching her arse jiggle as she walks. She turns round and notices that you are looking at her, and takes off her apron, showing off her ample breasts and smooth stomach. She them walks back over to you, her breasts bouncing around.<br>\r\n\"Just think\" says your Mother rubbing her gorgeous smooth belly \"Soon you'll be in here\"<br>\r\n<br>\r\n   She then bends over you and puts the salt all over you and a big \"squiggle\" of ketchup, like what you would put on a hotdog, something which hasn’t escaped your mothers eyes<br>\r\n\"Mmm, you look just like that hot dog I had for lunch, except your a lot sexier\" she says licking her lips whilst stroking your womanhood<br>\r\n\"Are you enjoying this\" she asks, as she continues to gently stroke your womanhood<br>\r\n\"Ahhhhh\" you moan in pleasure, its all you can muster<br>\r\n<br>\r\n      Your mother then turns and picks up a fork, which she plunges into your womanhood, pulling it out with some veg on the end<br>\r\n\"AHHHHHHHH!\" you squeal as the pleasure causes you to climax<br>\r\n\"Oh, I see you are enjoying this then\" she quips \"Well enough messing around I'm hungry and you are just asking to be eaten so...\" she says suddenly lunging at you, biting into the tender flesh on your lower stomach. She swivels round so you are staring right at her juicy womanhood, which you immediately begin to lick, you would use your hands, but they are bound  behind you, adding to the sexuality of the scene<br>\r\n\"Mmmmm\" says your mother as she enters your womb to get at your stuffing, gobbling it up in a matter of minuets. She then engulfs your feet in her mouth swallowing them into her warm moist throat, she quickly sucks you in like a piece of spaghetti, forcing you into a foetal position<br>\r\n\"Sorry to cut our fun short, but your sisters will be back soon, i hope you understand that they can't be let in on our secret, so i need to digest you\" she says<br>\r\n\"But if you survive this then we can do this as often as you want my tasty little snack\"<br>\r\n\"Of course\" you reply eagerly<br>\r\n\"Good, now be a good girl and digest\" says your mother</span></div></div>",
            "created":1189746000,
            "id":444461,
            "title":"I do like hotdogs"
        },
        "141221122111":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Your bedroom",
                "Mothers Bedroom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where do you want to reform?</span></div></span></div>",
            "created":1189832400,
            "id":444627,
            "title":"Aftermath"
        },
        "1412211221112":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Your mother walks in",
                "Crystal walks in"
            ],
            "content":"<div class=\"\"><div> <span>   You wake up, full sized, but still naked on your mothers bed in her room. Remembering what she said about wanting to shrink you and eat you again you suddenly sit up, do you really want to do that again. Yes you think, it was the most enjoyable thing you have ever done, maybe you could do it with Crystal as well, or maybe even Mina, although the foreplay would have to be toned down a bit because of her age, it still would be fun. You hear footsteps in the corridor, they're headed your way, you go to hide but its too late suddenly the door opens and .....</span></div></div>",
            "created":1190178000,
            "id":445696,
            "title":"whos behind door number 1"
        },
        "14122112211121":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Ok we should tell them",
                "No way, i'm not going to be my sister's turd"
            ],
            "content":"<div class=\"\"><div> <span>    \"Oh hi Carol\" says your Mother, walking through the door \"How are you?\"<br>\r\n\"Oh i'm great\" you reply truthfully, in fact you've never felt better<br>\r\n\"So are you up for doing it again?\" she asks curiously<br>\r\n\"Any time your hungry just give em a shout\" you reply, thinking of the pleasure you felt all though last night as your mother roasted, fingered and then ate you alive.<br>\r\n\"Ok,\" says your mother \"We could do it now, but we'd have to tell your sisters,and they may want to eat you at some point, or we could wait until next Saturday and keep it a secret.\" says your mother in a hushed voice<br>\r\n\"Well you say \"Crystal has already eaten me, so she'll most probably want to do it again, and I know Mina will want a go, I mean she has constantly talked about eating people, I'm pretty sure that nothing would give her greater pleasure to play act and mouse with me when i'm 2\" tall and then have me for tea, but i'm not sure if I want to be Mina's or Crystal's next meal, but then again I can't wait to be eaten again so...\"</span></div></div>",
            "created":1190178000,
            "id":445761,
            "title":"To tell or not to tell"
        },
        "141221122111211":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Crystals room",
                "Minas room"
            ],
            "content":"<div class=\"\"><div> <span>   \"Ok, I don't mind telling them, I mean Crystal has already eaten me and that was great, also I think Mina would love to eat me, and I would love to let them eat me.\" you say \"Besides how else would I be able to get eaten before Saturday\"<br>\r\n\"Good, but what if they want to eat you before I can?\" says your Mother<br>\r\n\"Well they can eat me\" you say as though it was obvious.<br>\r\n\"Ok\" says your mother<br>\r\n<br>\r\n   You walk out into the corridor, and over to ....</span></div></div>",
            "created":1190696400,
            "id":447495,
            "title":"Who to tell"
        },
        "1412211221112111":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Want to eat you first",
                "Want to join in"
            ],
            "content":"<div class=\"\"><div> <span>   Where do you want to go first, you think. Your Mother is stood next to you, looking very hungry.<br>\r\n\"Who should we tell first?\" she asks you<br>\r\n\"Hmmmm, I think Crystal because she has already eaten me and so should accept it better.\" You say walking over to Crystals door. You knock and Crystals voice replies<br>\r\n\"Come in\". You walk through the door with your Mother<br>\r\n\"Hi Carol, hi Mom\" says Crystal cheerfully<br>\r\n\"Hi Crystal\" you reply \"Remember when you ate me earlier this week?\" you says smiling<br>\r\n\"Errr, oh yeah... that\" mutters your sister nervously, obviously expecting to be shouted at<br>\r\n\"Well...\"  you say, launching into a long explanation on what happened last night<br>\r\n\"Wow\" says Crystal \"Thats cool!\"<br>\r\n\"So we were thinking that Mother could eat me again tonight, and that you wont have a prooblem\" you say grinning with your Mother.<br>\r\n\"Wait a minuet\" says Crystal \"I</span></div></div>",
            "created":1190782800,
            "id":447706,
            "title":"Crystal has a problem"
        },
        "14122112211121111":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "Can you cook me this time? Make a carolburger or something?",
                "Will you hurry up please? You must be starving!"
            ],
            "content":"<div class=\"\"><div> <span>\"I want to eat her first, if that is okay.\"<br>\r\n<br>\r\nCarol smiled. \"I figured. I don't mind myself, since I can just reappear when I am digested.\"<br>\r\n<br>\r\nCarol's mom sighed and nodded. \"Oh, alright.\" she hands Carol to Crystal, patting her head, something Crystal groans at. 18 years and her mom still has to treat her like that.<br>\r\n<br>\r\nAh well, no matter. She had a little person to eat!<br>\r\n<br>\r\n\"Come on Crystal!\" Carol shouted. \"I want in that tummy!\"<br>\r\n<br>\r\n\"Take it easy sis!\" Crystal said, trying not to laugh. \"I got to make you all tasty first!\"<br>\r\n<br>\r\nShe heads off to the kitchen, loking for the sandwich stuff, Carol being set on the counter to watch. She eyes a nearby toaster, and ponders being toasted up or cooked in some way. She looks to Crystal, clearly having a hard time deciding what kind of sandwich to have.<br>\r\n<br>\r\nCarol shouts...</span></div></div>",
            "created":1190782800,
            "id":447710,
            "title":"Crystal's snack, take 2."
        },
        "141221122111211111":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "A cheese toastie",
                "A Carol burger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>    \"Hey, Crystal, could you like cook me this time round\" you shout up to her<br>\r\n\"Of cource I can, but i dont know what to cook you with\" she says back<br>\r\n\"I know\" you reply</span></div></span></div>",
            "created":1191214800,
            "id":449325,
            "title":"Cooking Sister"
        },
        "1412211221112111112":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Yep A Carol Burger",
                "Actually the roast sounds good..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>    Are you sure, maybe you could be resized, and roasted again?</span></div></span></div>",
            "created":1197867600,
            "id":476513,
            "title":"2nd thoughts"
        },
        "14122112211121111121":{
            "author_id":"dragoncatgirl",
            "author_name":"DragonCatGirl",
            "choices":[
                "Your mom says, \"Alright! Let's get you prepped for tonight's dinner, Carol!\""
            ],
            "content":"<div class=\"\"><div> <span>Crystal smiles. \"Alright, then.\" She takes out a pan, and gets the stove top ready. Crystal picks you up, and gently places you onto the grilling pan. you lay there on your stomach, enjoying the warmth. Your sister flips you over after a few minutes, and allows the rest of you to cook. She then spreads some cheese on top of you, which melts into you.<br>\r\n<br>\r\nSoon, you're cooked to a juicy medium-well, and you look up to see your sister's mouth watering. She takes a spatula, picking you up and laying you onto a piece of lettuce. \"Carol, you look delicious! let me just add something, and then I can enjoy my lunch!\"<br>\r\n<br>\r\nA line of mustard and ketchup is spread along your body, then Crystal adds another slice of cheese. Finally, she adds a couple pickles, and places the bun on top.<br>\r\n<br>\r\nYou can feel her take a bite as your feet are pulled into her mouth. She chews, and swallows. \"Hey, this was a good idea!\"<br>\r\n<br>\r\n\"Thanks!\"<br>\r\n<br>\r\nCarol enjoys eating the rest of you, and you soon find yourself back your room, back to normal size.</span></div></div>",
            "created":1301893200,
            "id":1081671,
            "title":"Yep A Carol Burger"
        },
        "141221122111211111211":{
            "author_id":"meeper15",
            "author_name":"meeper15",
            "choices":[
                "a carol pizza.",
                "more"
            ],
            "content":"<div class=\"\"><div> <span>As you wake up once again you here your mother call out to you to report to the kitchen to be prepared for dinner.<br>\r\n<br>\r\n\"Ok mom I am coming\" you say cheerfuly,as you dash to the kitchen.<br>\r\n\"Ok honey it will be dinner time soon and we need you all cooked up and tasty for dinner oh and if you don't mind we told mina about how edible you are, she was vary excited about this.\" says your mother.<br>\r\n\"Well what will I be for tea?\"you ask. \"Cristal,Mina! Come here its time to dicide what we will make carol into for dinner.\" Mom calles to your sisters.<br>\r\n\"Coming mom!\"said your sisters.\"what do we want to make out of Carol humm?\"said mom.<br>\r\n\"Well how about a...<br>\r\n<br>\r\nWhat will become of Carol this time?</span></div></div>",
            "created":1391749200,
            "id":1741236,
            "title":"Your mom says, \"Alright! Let's get you ready for.."
        },
        "1412211221112111112112":{
            "author_id":"leviepollard",
            "author_name":"Write/reader",
            "choices":[
                "Yes",
                "No something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a lasagna?</span></div></span></div>",
            "created":1461128400,
            "id":2136719,
            "title":"more"
        },
        "14122112211121112":{
            "author_id":"dragoncatgirl",
            "author_name":"DragonCatGirl",
            "choices":[
                "\"Let's have a Carol roast again!\"",
                "\"How about Carol pizza?\""
            ],
            "content":"<div class=\"\"><div> <span>\"I want to join in! I'd love to eat you again!\" Crystal exclaims.<br>\r\n<br>\r\n\"No problem, honey,\" your mother says. \"That alright if I share you with Crystal?\"<br>\r\n<br>\r\nYou nod. \"Maybe Mina will want some, too?\"<br>\r\n<br>\r\n\"She's out with friends, so she won't be home for dinner,\" Crystal explains. \"But, we need to figure out how we're going to eat you tonight! Any ideas, Mom?\"</span></div></div>",
            "created":1293771600,
            "id":1026139,
            "title":"Want to join in"
        },
        "141221122111211121":{
            "author_id":"ak185",
            "author_name":"AK185",
            "choices":[
                "Yes, cook me already!",
                "No, hold on, I just thought of something..."
            ],
            "content":"<div class=\"\"><div> <span>\"Mmm, roasted Carol was soooo good last time.\" Carol's mom murred. \"What do you think, Crystal?\"<br>\r\n<br>\r\nCrystal nodded greedily, not bothering to hide the eagerness in her eyes. \"Sis, you're going to be <i>delicious</i>.\"<br>\r\n<br>\r\nBlushing, Carol made an attempt to give her approval, but before she knew it, her mother and sister had already seized hold of her and whisked her down to the kitchen. She soon found herself plopped on the counter island in her family's galley, with her sister rubbing slick cooking oil all over her body. The oil felt cool against her skin, and more than once Crystal's hand would linger over her most sensitive parts. Oddly enough, this cannibal thing had given Carol the most intense feelings of pleasure she had ever experienced, and it wouldn't be so far fetched that her mother and sister had the same reaction as she did.<br>\r\n<br>\r\nOn that note, Crystal took a small nibble of Carol's breast. Carol moaned softly, and Crystal grinned. \"Sorry sis. Couldn't help it.\" Crystal grabbed a handful of Carol's soft rump. \"I can't wait to eat your ass, sis.\" Carol blushed again. \"Aw, thanks Crystal! I hope you enjoy me as much as Mom did! I really would suggest eating some of my thigh, Mom really looked like she loved eating that part.\" Susan looked over her shoulder wickedly and flashed a mischievous smile. Suspicious? What could qualify as suspicious when a girl's family was preparing to eat her with own consent? <br>\r\n<br>\r\nStuffing.<br>\r\n<br>\r\n\"Mom, are you-\"<br>\r\n<br>\r\n\"Yes, dear. I'm going to stuff you.\"<br>\r\n<br>\r\nCarol gulped. \"Umm, how...?\"<br>\r\n<br>\r\n\"In your pussy, silly.\"<br>\r\n<br>\r\nCarol felt Crystal give her another love bite, this time on her shoulder, and she shuddered slightly. \"Sis, I'm going to coat you in spices now. Don't sneeze. Oh, I just can't <i>wait</i> to eat you...\"<br>\r\n<br>\r\nCarol closed her eyes, and felt her fingers drift in the direction of her vagina. She imagined herself, whole roasted, cooked to a succulent golden brown, coated in the luminescent shine of her own meat juices. she saw her sister and mother carving her perfectly cooked body, sinking their pearly white white teeth into her irresistible meat...\"I can't wait to be eaten,\" she breathed.<br>\r\n<br>\r\nSusan was  finished with the stuffing. \"You were so juicy last time, and your meat was so succulent and tender, I don't know if I want to share you this time!\" She winked at Crystal, and began tracing her elegantly manicured finger around carol's pussy. \"You look so scrumptious...you're goign to taste great, baby...\" Susan kissed Carol's breasts between each sentence as she teased the girl's womanhood, forcing Carol to catch her breath and close her eyes, her head tilted back and her body on edge. \"...my daughter is such a tender roast...\" Susan then leaned in to whisper into Carol's ear. \"Maybe I should give your sister some of that potion? Would you like to eat a bit of her, Carol?\" Before Carol could respond or even fully process the thought, Susan suddenly shoved a handful of stuffing into Carol's most private region. <br>\r\n<br>\r\nCarol's world exploded.<br>\r\n<br>\r\nAfter that, it was hard to Carol to focus on what was happening after that. She felt her sister rub an unknown assortment of spices deep into her luscious skin as her mother inserted handful after handful of stuffing into her love-hole. Her body shook with each successive orgasm, blinding her thoughts to all but most base sense of pleasure, as she was transformed into a bird ready to be cooked. She barely even heard her mother's next words.<br>\r\n<br>\r\n\"Ready to roast, sweetie?\"</span></div></div>",
            "created":1465797300,
            "id":2163398,
            "title":"\"Let's have a Carol roast again!\""
        },
        "1412211221112112":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "your bedroom",
                "your mothers Bedroom"
            ],
            "content":"<div class=\"\"><div> <span>   Crystal already knows that you can be eaten, you figure so Mina is the only one you need to tell. So you head towards her her room, still as you were when you woke up (Full sized and naked that is). You knock politely on the door and walk in<br>\r\n\"Hi Carol\" says Mina, looking at you in a slightly weird way<br>\r\n\"Hi\" you reply, and after a few more pleasantries you explain to her what happened last night, but you wisely leave out some of the more choice parts, and you then go on to explain that you plan to do it again.<br>\r\n\"Ahhh\" says Mina sensing an opportunity \"But what if I want to eat you\" she says deviously<br>\r\n\"well you can\" you say grinning at Mina as she licks her lips \"But\" you say \"Yuo have to capture me first.\" you add running to hide, so where do you hide</span></div></div>",
            "created":1191042000,
            "id":448667,
            "title":"Telling Mina"
        },
        "14122112211121121":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Play time",
                "Dinner time"
            ],
            "content":"<div class=\"\"><div> <span>   You run out into the hall, and over into your room and throw yourself under your bed, you purposely hide yourself in an easy place so Mina fins you quickly, and so then you can get on with the fun. You hear her enter and she calls out<br>\r\n\"Come out come out wherever you are my tasty meal\"<br>\r\nYou hear her walk around, looking in your cupboards, but then you hear the door close and footsteps going down the hallway, so you climb out from your hiding place, thinking she has gone, when suddenly you are pinned face-down on the bed by her<br>\r\n\"Gotcha'\" she shouts in joy as she binds your arms together behind your back, then your legs.<br>\r\n\"I have been looking forward to this moment\" she says licking your cheek. She then drags you to her room and puts you on her bed face up this time so you are looking at her<br>\r\n\"And now your mine, all mine\" she gloats<br>\r\n\"So how do you want me to be?\" you ask \"\"Willing to be all yours, begging for my life or defiant to the last?\" <br>\r\n\"Hmmm, I like the sound of willing, at least you will do as i say\" says Mina<br>\r\n\"Ok master\" you reply<br>\r\n\"So what should we do now\" says Mina \"I think...</span></div></div>",
            "created":1191042000,
            "id":448697,
            "title":"Hide and seek"
        },
        "141221122111211212":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "have you as a side",
                "Cook you as a main meal"
            ],
            "content":"<div class=\"\"><div> <span>   \"Mmmm... I'm hungry, so I'm going to eat you now\" declares Mina <br>\r\n\"Ok\" you say, standing up with help from Mina, she then forces you to hobble into the kitchen where she ties you down to the table.<br>\r\n\"I'm unsure what to do with you...\" says Mina \"I could shrink you back down and have you as a side on a Meal, or cook you and eat you as a meal, to do that iI would shrink you down only to about a foot high\" She states<br>\r\n\"I am only but your food, you do what you like with me, as long as I end up in your stomach\" you say<br>\r\n\"Well I'll...</span></div></div>",
            "created":1191560400,
            "id":450793,
            "title":"How to cook you"
        },
        "14122112212":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "One of your sisters walks in",
                "you or your mother suddenly shrink"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens though?</span></div></span></div>",
            "created":1189659600,
            "id":444148,
            "title":"Oh god!"
        },
        "141221122122":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "You",
                "Your Mother"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one of you shrinks</span></div></span></div>",
            "created":1189659600,
            "id":444149,
            "title":"Seeing the shrink"
        },
        "141222":{
            "choices":[
                "in front of you; she wants to see you sweat.",
                "on top of you; she wants to hear you squeal."
            ],
            "content":"<div class=\"\"><div> <span>You kick, squirm, and give a mighty struggle to break free of your sandwich prison, but Crystal's grip is far too strong.<br>\r\n\"No fair making me work this hard for a sandwich, sis,\" she says.  The sound is muffled by the bread and lettuce surrounding you.  You feel yourself being lifted high--well, not really, but high to you--into the air, and then spun around to face your sister.  <br>\r\n\"Still,\" she muses, \"I guess it really isn't work if I'm enjoying it this much, right?\"<br>\r\nCrystal grins widely.  She's really wearing too much make up for the move, but you aren't exactly in a position to critique.  She then opens her mouth even wider, moving you ever-so-slowly closer to her teeth.  You struggle again, but to no avail.<br>\r\nSuddenly, Crystal bites down hard on the sandwich, right ...</span></div></div>",
            "created":1189141200,
            "id":442937,
            "title":"No one escapes from sandwich-traz!"
        },
        "142":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Notices you",
                "eats it"
            ],
            "content":"<div class=\"\"><div> <span>   Its your Mom, she first walks over to the fridge and puts something in there, and then walks over to the counter<br>\r\n\"Oh Crystal\" she moans \"Can you stop leaving your sandwich ingredients out\"<br>\r\n\"Sorry mom\" you herar her repl. She starts packing them away, she picks up the lettuce that you're wrapped in and</span></div></div>",
            "created":1175662800,
            "id":395548,
            "title":"Its your Mom"
        },
        "1421":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "\"Errm... Ok I'd love to be eaten\"",
                "\"NO WAY!!!\""
            ],
            "content":"<div class=\"\"><div> <span>   \"Carol, is that you? How did you get so small?!\" exclaimes your Mom<br>\r\n\"Well i went to bed last night and just woke up here 6\" tall\" you reply<br>\r\n\"Thats strange\" she says.<br>\r\n<br>\r\nShe starts to look at you her eyes apear to be scanning you like an X-ray machine at the airport<br>\r\n\"why are you looking at me like that, Mom?\" You ask<br>\r\n\"Mmmm, I was just thinking how delicious you look in that lettuce, oh you look apsolutely exquisite\" repplies your Mom, licking her lips. You begin to shake<br>\r\nrather a lot, the thought of being ingested by your Mom scares you quite a bit<br>\r\n\"Whats up carol, have i scared you?\"<br>\r\n\"A bit\" you reply starting to calm down, also as you do this you begin to think about being eaten and the prospecs of it begin to grow upon you<br>\r\n\"So I guess you dont want me to eat you then Carol\" says your mom sounding crestfallen<br>\r\n\"actually, now that i have given it some thought It doesnt sound so bad\" you reply<br>\r\n\"so will you let me eat you?\"</span></div></div>",
            "created":1175662800,
            "id":395582,
            "title":"Mommy's Snack?"
        },
        "14211":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                " A Carol burger",
                "A CLT (Carol Lettuce and tomato) with extras"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>  \"Oh good honey, I was hoping you would say that.\" Says your Mom excitedly, then you hear her stomach rumble \"Oh im famished, but what to have for dinner?\"</span></div></span></div>",
            "created":1175662800,
            "id":395553,
            "title":"Whats for dinner Mom?"
        },
        "142111":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Mom enters the room to finally eat you",
                "Sister Crystal enters the room to see whats for tea"
            ],
            "content":"<div class=\"\"><div> <span>   \"Mmmm I'm in the mood for a Carol burger what do you think sweetie?\" said Mom<br>\r\n\"I think that sounds absoluetly scumptious\" you reply<br>\r\nYour Mom turns round and puts you down on a plate and makes sure the lettuce your wrapped in is completely wrapped around you, she then turns to the fridge and gets out some chese slices, half a tomato and lays them down next to you, soon after putting a burger bun next to you. She then starts to prepare the meal, first slicing the bun , then chopping the tomato and laying the slices upon the bottom half of the bun, then the some of lettuce. She then turns to grill 2 slcice of meat, placing one on top of the lettuce soon after. She then puts another layer of lettuce on top of that, and this time she puts you on, squeezes tomato kechup all over you and puts the slices of cheese on top of you<br>\r\n\"Dont worry hone you'll soon be ready for my stomach. She then adds the second slice of meat on top of you, which immediatly causes the cheese to melt, emprisoning you in the burger. Your Mom finishes the burgr by puting the other slice of the burger bu on top, just as she does this the doorbell rings and she goes to answer it. about a minuet later your</span></div></div>",
            "created":1175662800,
            "id":395565,
            "title":"Carol burger"
        },
        "1421111":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "You \"bug out\"",
                "You stay and get eaten"
            ],
            "content":"<div class=\"\"><div> <span>  Your mom re-enters the kitchen to finnnaly eat you<br>\r\n\"Stupid salesmen, cant stand them, anyway back to more immediate matters. Time for tea\" she says opening her mouth wide, giving you a full view of her perfectly white teath and cavenous mouth, then takes a huge bite out of the burger right next to you, slowly chewing it down to a pulp, savouin all of it.<br>\r\n\"your turn now\" says your mom \"but i need to add some more flavouring\" she says lifting the burger bun and picking up the ketchup and squeezing it all over you. This is your last chance to escape do you...</span></div></div>",
            "created":1177390800,
            "id":402109,
            "title":"Last chance burger bar"
        },
        "14211112":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "in the dining room",
                "Crystals room"
            ],
            "content":"<div class=\"\"><div> <span>   You decide that you will stay and let your Mom eat you, after all you said she could, besides your actually looking forward to it.<br>\r\n\"Tea time says your mother, giving you one last look at her face before the burger you are on is thrust into her mouth, she bites down and you feel the burger piece your on start to brake up as she chews on it. You manage to avoid being squashed by the giant teeth long enough for your mother to swallow you. You enter her gullet, the rings of muscles forcing you are giving you what feels like a full-body massage. You drop into the stomach, landing on the spongy, sticky floor, you just sit and wait as the digestive juices kick in. You reform....</span></div></div>",
            "created":1186290000,
            "id":432520,
            "title":"into the belly of the beast"
        },
        "142111121":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Crystal",
                "Mina"
            ],
            "content":"<div class=\"\"><div> <span>   You wake up in the dining room, suprised to be alive at all you take check of your surroundings. Nobody is around. Good, you think, then you start to think about why you are still alive and not just some piece of flesh on your mothers body. Then it dawns on you, if you are undigestable then maybe you could let people eat you, you certainly enjoyed it.<br>\r\n<br>\r\n   You suddenly catch the smell of cooking from the kitchen, smells like Mom is cooking tea for one or both of your sisters, looks like your going down the hatch again, you think to yourself. You hide behind the plant in the middle of the table, after a few minuets someone opens the door carryin their tea, you look out from behind the plant to see...</span></div></div>",
            "created":1186549200,
            "id":433513,
            "title":"Welcome back"
        },
        "1421111211":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "step out and try toi get Crystals attention",
                "hitch a ride on the ketchup  bottle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>   Crystal sits down at the table with a plate of burger and chips, she  takes the top off the burger and reaches for the ketchu, which is right next to you. what do you do?</span></div></span></div>",
            "created":1187845200,
            "id":438441,
            "title":"heres crystal"
        },
        "14211112111":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "No, youre mine!",
                "yes, im never going to eat you, your my sister!!!!"
            ],
            "content":"<div class=\"\"><div> <span>  You step out from behind the plant pot and shout up at Crystal<br>\r\n\"Down here!\" she looks down at you and gasps<br>\r\n\"Carol! How... how did you get so small?\" she asks shocked<br>\r\n\"I dont know\" you reply, \"But it does have some benefits, like that I can be eaten without dieing, Mom has already done it and I reapeared here\"<br>\r\n\"Thats cool!\" she exclaimes <br>\r\n\"And just think how appatising i'd look on that burger\" you say, climbing up onto her plate<br>\r\n\"Mmm, i know, but your my sister, i'm still not sure i could eat you\" she replies, unsure<br>\r\n<br>\r\n    In a final attempt to persuade her to eat you you climb up onto the burger and lie between a slice of cheese and a slice of lettuce.<br>\r\n\"come on sis, you cant say I dont look tasty now can you?\"<br>\r\n\"Well...<br>\r\n</span></div></div>",
            "created":1187931600,
            "id":438751,
            "title":"sisters"
        },
        "142111121111":{
            "author_id":"misterebony",
            "author_name":"Ebony",
            "choices":[
                "She chews you up. Munch munch, yummy!",
                "She misses you for now..."
            ],
            "content":"<div class=\"\"><div> <span>Crystal looks you over and unconsciously licked herlips. \"Welll.... no, I can definately say you look yummy.\" She heard her belly growl, and you know you are about to become a meal again. She puts on a few dabs of ketchup.<br>\r\n<br>\r\n\"I cnanot believe I am doing this.\" You hear her say.<br>\r\n<br>\r\n\"Well, if it will make it easier, now you can get me back for anything wrong I did to you.\" <br>\r\n<br>\r\nCrystal hmms and nods. \"You have a point there. Thanks Carol.\" she pats your head for a second.<br>\r\n<br>\r\n\"Ok, enough talk, I'm food now right?\" You say. In the next instant, on goes the top bun.<br>\r\n<br>\r\n\"Yup, you're mine!\" She licks her lips and lifts the burger to her mouth, taking her first bite</span></div></div>",
            "created":1193202000,
            "id":456374,
            "title":"No, youre mine!"
        },
        "1421111211111":{
            "author_id":"hauser717",
            "author_name":"Hauser",
            "choices":[
                "back in your kitchen.",
                "in your best friend's kitchen."
            ],
            "content":"<div class=\"\"><div> <span>Crystal takes a bite out of the sandwich and thus, a bite out of you.  You feel her teeth cut painlessly through your legs and next thing you know you can feel your calves and feet being chewed up and then swallowed by your sister.  You are a little surprised by this as your mom just swallowed you whole without biting you and chewing you up.  But then if you can survive digestion, then it only makes sense that you can survive biting and chewing.<br>\r\n<br>\r\n\"Wow!  You ARE yummy Carol!  You taste better than bacon.\"<br>\r\n<br>\r\n\"Uh, thanks.  So hurry up and eat me already.  I would like to feel my toes again soon\" you say with a grin.<br>\r\n<br>\r\n\"Sure thing, sis!\"  Crystal takes another bite of the sandwich and your left arm, stomach and hips.  You actually enjoy your bits being chewed up this time now that you know it is going to happen.  Another bite and your right arm and chest are eaten up.  All that is left of you is your head and part of your shoulders with a little bit of bun and ketchup.<br>\r\n<br>\r\n\"You are so YUMMY, sis!  I get to eat you again later, right?\"<br>\r\n<br>\r\n\"Sure thing, Crys!\"<br>\r\n<br>\r\nCrystal then takes your head out of the rest of the sandwich and then licks the ketchup off of you.  You're not sure about this as it leaves you wet and slightly slimy.  Crystal then eats the rest of the bread.  Once she swallows, she tilts her head back and then sucks your head and shoulders into her mouth.  She then chews you up and swallows you.<br>\r\n<br>\r\nYou feel yourself digesting in her stomach and then you find yourself....</span></div></div>",
            "created":1279256400,
            "id":919279,
            "title":"She chews you up. Munch munch, yummy!"
        },
        "14211112111111":{
            "choices":[
                "Mom",
                "Mina"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Carol then sees . . .</span></div></span></div>",
            "created":1399438800,
            "id":1793106,
            "title":"back in your kitchen."
        },
        "1421111211112":{
            "author_id":"thumbelina200",
            "author_name":"Thumbelina200",
            "choices":[
                "In the Living Room",
                "In Mina's Room"
            ],
            "content":"<div class=\"\"><div> <span>Crystal's first bite missed, barely. You watched as she slowly chewed and swallowed. Licking her lips, she looked at you and said, \"Now it's your turn Carol. Bye, Bye.\" Then bites into the burger right around you.<br>\r\n<br>\r\nYou quickly move away from Crystal's teeth. She moaned with satisfaction when she feels you on her tongue. \"You can't get away.\" You are rolled into a ball with the chewed meat, and sent toward the back of her mouth. With a quick gulp, your sends you on a one way trip to her stomach. <br>\r\n<br>\r\nOnce you have been digested, you reform again. Where are you?</span></div></div>",
            "created":1262926800,
            "id":817369,
            "title":"The Delicious Sister"
        },
        "142112":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Crystal's room as she gets ready for school",
                "The hallway"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I will have a CLT.\" Mom said with a sly smile. She proceeded to get out the ingredients. And soon you see huge food items laid out before you. Your mom starts work on the sandwich, She spreads the two thick slices of bread with mayo and mustard respectively, then she added the cheese, tomato, and finally she grabs you, still wrapped in the lettuce, and places you on the sandwich. \"You look so cute, I could just eat you up.\" she said as she placed the top slice of bread on top of you. You feel the sandwich move as she picks it up. You wonder if this was such a good idea. But just then you no longer feel your legs as her teeth cut through the sandwich. And soon after you also find yourself in her mouth and after a quick swallow you black out...<br>\r\n<br>\r\nWhere do you reform?</span></div></div>",
            "created":1313384400,
            "id":1168674,
            "title":"Mom Makes Dinner"
        },
        "14212":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Chewed Whole",
                "A bite at a time",
                "none of the above"
            ],
            "content":"<div class=\"\"><div> <span>\"NO WAY!!!\" you scream in a panic as your mom's hand reaches down and picks you up, raising you to her lips. \"Mommy stop! I thought you were kidding! Please stop!\"<br>\r\n<br>\r\n  Your mom looks down at you, hurt and disappointed. Her face breaks your heart. \"But... baby, I've wanted to taste you and eat you for so long! All those times since you were little and I'd say 'you're so adorable. I want to eat you all up!' and you always laugh and smile and say 'yes please eat me up mommy!' and we talk about how I'm going to chew you up with my teeth and hnd tongue and how you'll go into my tummy?\"<br>\r\n<br>\r\n \"That was pretend!\" you cry, actually crying now at the thought that your mommy really wants to eat you.<br>\r\n<br>\r\n  \"But baby! My sweet little Carol! I've wanted this for twelve years! I was going to eat you when you were four. You were so much cuter than your sister and you made my stomach rumble just looking at you, but I loved playing with you and hearing you telling me how you wanted to be eaten so I kept saving you and saving you. I came so close so many times!\"<br>\r\n<br>\r\n  \"Mommy, please! I don't want to die!\"<br>\r\n<br>\r\n  She hugs you into her suddenly vast bosom and strokes you. It feels really nice. \"Oh, baby, Crystal and I found a way so that you can come back to life again after I've finished digesting you. You'll just come back somewhere in the house as good as new!\"<br>\r\n<br>\r\n  \"But, all the times before that... you would have eaten me for good?\"<br>\r\n<br>\r\n Your mom looked guilty. You would have enjoyed it then! You've changed!\" She starts to cry and it's almost too much. You won't die if she eats you... and you did always like playing pretend about her big strong teeth and her wriggling tongue and dark throat...and you love her and can't bare to see her so upset with you.<br>\r\n<br>\r\n  \"But mommy, won't it hurt? A lot?\" Her face brightens with hope. She looks radiant!<br>\r\n<br>\r\n \"Oh, Carol, honey. I could never decide how to eat you... whether to eat you whole or a bite at a time or swallow you or mix you into other food! Maybe I can let you decide! I love you so much my sweet delicious little Carol! Thankyou!\"<br>\r\n<br>\r\nBut you haven't agreed! </span></div></div>",
            "created":1464757200,
            "id":2157043,
            "title":"\"NO WAY!!!\""
        },
        "142123":{
            "author_id":"benway69",
            "author_name":"Benway69",
            "choices":[
                "Swallowed whole",
                "Mixed into other food",
                "\"I never agreed to be eaten!!\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Neither of those appeal at all... At least if you are swallowed whole you won't be cut up and crushed...</span></div></span></div>",
            "created":1464757200,
            "id":2157047,
            "title":"none of the above"
        },
        "1422":{
            "choices":[
                "Back in the kitchen",
                "In your room",
                "On your mom's head?"
            ],
            "content":"<div class=\"\"><div> <span>Your mom shoves you into her mouth without a thought. She swirls you around with her tongue. She starts to chew you. You don't feel much pain surprisingly. Her whole mouth is shaking.<br>\r\n\"She must be moving\" you thought. She finally swallowed yo. You slide down her throat.<br>\r\nSuddenly you are </span></div></div>",
            "created":1443416400,
            "id":2041067,
            "title":"eaten by your mother"
        },
        "14223":{
            "choices":[
                "Eats you without a thought",
                "Tells you you have been a bad girl for being a pervert"
            ],
            "content":"<div class=\"\"><div> <span>You re-spawn on your mom's head. You grab some hair to not fall off. She heads to her bedroom and decides to lay on the bed. You roll down her face onto her lips. She grabs you and looks at you with an unamused face. <br>\r\n\"She looks tired\" you think. She then . . .</span></div></div>",
            "created":1462251600,
            "id":2142856,
            "title":"On your mom's head?"
        },
        "142231":{
            "choices":[
                "Someone walks in",
                "You move up to her face"
            ],
            "content":"<div class=\"\"><div> <span>Being so sleepy, she shoves you in her mouth and swallows you again. You re-spawn on her bed. With you so unlucky though, your mom comes in and strips to just her bra and panties. She then lays down next to you and falls asleep really fast. You climb on her stomach and look at her. She looks so peaceful. After a minute, . . .</span></div></div>",
            "created":1464152400,
            "id":2153943,
            "title":"Eats you without a thought"
        },
        "15":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Mina",
                "Crystal with a sandwich",
                "Your mom with a burger and chips"
            ],
            "content":"<div class=\"\"><div> <span> you begin to come round, you turn, surveying your environment. you are on a cold white surface, next to the edge are 2wo giant glass pots and a giant bottle full odf red... goo, then you realise you only 6\" tall and stark naked!!!<br>\r\n\"where the hell am I\" you exclaim. Then you realise, your on a plate in the dining room!!! Suddenly someone walks out of the kitchen, its...</span></div></div>",
            "created":1175058000,
            "id":393518,
            "title":"The dining room"
        },
        "151":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "She decides you would make a nice snack (Your willing)",
                "She decides you would make a nice snack (Your not willing)"
            ],
            "content":"<div class=\"\"><div> <span>  Oh god, thought carrol, as Mina walked in with her tea, she put the plate down right next to carrol, carrol clims onto the edge of the plate to see what Mina is eating, she looked up to see Fish Fingers, beans and chips (Fries if you are USA)<br>\r\nShe went to put a dollop of kechup on the edge, but some of it spilled over the edge and covered carrol from head to toe. Mina looked over and saw Carrol stood naked, covered only by the ketchup.<br>\r\n\"Ha! Your so tiny Carrol,\" exclaimed Mina \"and your coated in ketchup like a chip... I wonder if you taste as good as one...\"<br>\r\n\"Put me down now!\" sqeeked Carrol<br>\r\n\"But you look soooo yummy!\" she said whilst licking her lips<br>\r\nWhat happens next?</span></div></div>",
            "created":1180069200,
            "id":410868,
            "title":"Mina is hungry"
        },
        "1511":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "One of the bedroom",
                "the living roon"
            ],
            "content":"<div class=\"\"><div> <span>   \"So Can I eat you please?\" said Mina \"I think you would tase great, and I wont ever bother you again\" she added looking at Carrol pleadingly.<br>\r\n\"Well....\" Said Carrol \"Ok, I suppose\", and the moment those words left her mouth Mina picked her up and dropped her in the pile of beans and continued to eat her tea. Carrol sat in the beans thinking about her decision, and the more she thought about it, the more she liked it. Then she was scooped up onto minas fork and placed into her gaping maw where she sucked on Carrol and licked her from head to toe<br>\r\n\"Mmm you taste great\" said Mina. Carrol suddenly felt herself being pulled toards the back of Mina's throat, then she began to decend down her throat, it felt absolutely amazing, like a full body massage. But then it all came to an end when she dropped into her stomach and landed in a pool of half digested fish finger.she sat there wondering what would happen next when suddenly Mina's stomach filled rappidly with digestive juices and the like.<br>\r\n<br>\r\nCarrol will reform, but where</span></div></div>",
            "created":1180069200,
            "id":410900,
            "title":"Digested"
        },
        "15111":{
            "choices":[
                "Susan",
                "The basement"
            ],
            "content":"<div class=\"\"><div> <span>Carol awoke in her own bedroom, still small. She was at the end of her bed, facing the wall. She turned around to see a giant foot. Carol jumped at the sight of it, but then slowly walked towards it. She climbed on it to see who it belonged to. The foot belonged to Crystal, and she was wearing her black pajamas and was reading a book. Crystal suddenly raised her foot fast, making Carol fly onto Crystal's head. Crystal then tilted her head forward, making Carol fall in front of her. Crystal just looked at her.<br>\r\n\"How did you get so small?\" Crystal asked.<br>\r\n\"I don't know, but can you help me?\" Carol asked. Crystal shut her book and sat up.<br>\r\n\"Sure\" Crystal grabs her and takes her to . . .</span></div></div>",
            "created":1464325200,
            "id":2154845,
            "title":"Crystal on Carol's bed"
        },
        "15112":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Mina again",
                "Crystal"
            ],
            "content":"<div class=\"\"><div> <span>   You wake up after your experience, lying on a rough surface, feeling cold. <br>\r\n\"At least I survived that experience\", as enjoyable as it was you dont like the idea of dieing in your little sister stomach, but if you survived once who says you cant do it again. So maybe you could be eaten regularly by your siblings and survive. If you want that is you add to yourself.<br>\r\n<br>\r\n   Your vision starts to come back into focus and you see someone sat on the sofa watching TV, she comes into focus and its...</span></div></div>",
            "created":1183698000,
            "id":423084,
            "title":"Reformed in the living room"
        },
        "151121":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "You shout up to Mina",
                "You look for someone else"
            ],
            "content":"<div class=\"\"><div> <span>   You realise that the person your looking at is Mina again, watching TV.You go to shout for her and then think to yourself do you really want her to eat you again, it was really enjoyable for you, but would you rather try to find someone else to eat you?</span></div></div>",
            "created":1186290000,
            "id":432394,
            "title":"Mina again?"
        },
        "1511212":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "one of the bedrooms",
                "kitchen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to look for someone else, but where do you want to look?</span></div></span></div>",
            "created":1186290000,
            "id":432399,
            "title":"Where else?"
        },
        "15112121":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Crytals room",
                "Susans room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But which one? (Appologies ofr all of the questions, this is the last one)</span></div></span></div>",
            "created":1186290000,
            "id":432400,
            "title":"Bedroom"
        },
        "15112122":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Crystal toasting some bread for a sandwich",
                "Susan cooking something"
            ],
            "content":"<div class=\"\"><div> <span>You walk out of the front room, down the hall to the kitchen, you arrive at the door to see that it is open. You walk into the kitchen, keeping close to the edge of the floor so if someone walks in they are unlikely to stepped on, which is a big concern when you are so small.<br>\r\n<br>\r\n   You Look in the direction of the oven and see...</span></div></div>",
            "created":1186290000,
            "id":432402,
            "title":"the kitchen"
        },
        "1512":{
            "choices":[
                "In Crystal's room",
                "In mom's room",
                "Back in the kitchen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Carol struggle as much as she can but Mina just squeezes the energy out of her until she's tired.<br>\r\n\"sorry but I need food.\" <br>\r\nShe then puts her in her mouth and chews her up. She then swallows.<br>\r\nCarol reforms . . .</span></div></span></div>",
            "created":1401080400,
            "id":1802734,
            "title":"She decides you would make a nice snack (Your n..."
        },
        "152":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "Yeah great idea",
                "No i dont want to"
            ],
            "content":"<div class=\"\"><div> <span>Crystal walks through the door with a sandwich and puts it on the plate next to you.<br>\r\n\"Crystal\" you shout, she looks down with a puzzled look and replies<br>\r\n\"what are you doing down there and why are you so small?\" Then her eyes light up with an idea, she looks at you hugrilly<br>\r\n\"why are you looking at me like that\" you ask starting to get scared<br>\r\n\"I was just thinking what a good sandwich you would make\" she repplies. Your instincts are to run but this sounds like an interesting idea<br>\r\n\"so what do you think sis?\"</span></div></div>",
            "created":1175058000,
            "id":393522,
            "title":"Sandwich girl"
        },
        "1521":{
            "author_id":"dragoncatgirl",
            "author_name":"DragonCatGirl",
            "choices":[
                "Crystal walks into the dining room",
                "Mina is in the kitchen",
                "Your mother is in the kitchen"
            ],
            "content":"<div class=\"\"><div> <span>\"Um, okay. I think that'd be an interesting experience,\" you decide.<br>\r\n<br>\r\nCrystal grins. She lifts up part of her sandwich, and helps you climb in between two slices of cheese. To top you off, she squeezes a line of mustard down your back. Crystal puts back the rest of her snack, and presses down on it a little to make sure you're snug. <br>\r\n<br>\r\n\"Ready?\" she asks.<br>\r\n<br>\r\n\"Sure.\"<br>\r\n<br>\r\nCrystal lifts up her sandwich and takes a bite out of it, taking your feet part of your legs with it. Somehow, you felt no pain at all.<br>\r\n<br>\r\n\"Oh, wow, Carol, you really taste good! I think I just found myself a new favorite topping!\" Your sister bites again, taking the rest of your legs and your rear with it. Before long, only your head remains. This was quite the ride, you think to yourself.<br>\r\n<br>\r\n\"Well, this is it,\" she says, turning the sandwich around so you can see her face. \"And now you'll be nutrients for my body! See you later, Carol!\" With that, she pops the last bit of you and the sandwich into her mouth, chews, and swallows, digesting you in her stomach.<br>\r\n<br>\r\nHowever, in what seems like moments later, you find yourself standing back in the dining room, still shrunken, and still naked. \"How in the world did I survive that?\" you wonder. \"Hmm... wonder if Crystal is still around?\"</span></div></div>",
            "created":1293771600,
            "id":1026129,
            "title":"Tasty Topping for Sis"
        },
        "1522":{
            "choices":[
                "the dining room.  Again",
                "the kitchen."
            ],
            "content":"<div class=\"\"><div> <span>\"What?\" you say.  \"No!  Of course not!  That's sick!\"<br>\r\nYou turn around an start to leave when you are suddenly slammed down against the table.  You crane your head around to look, only to see Crystal smiling evilly and licking her lips.<br>\r\n\"That's funny,\" she says, \"I don't remember you having any say in this.\"<br>\r\nShe hoists you into the air and plops you down in her sandwich, your feet pointed towards her.  She grips the sandwich firmly, preventing any hope of you wriggling free, and lifts you towards her mouth.  You can hear her smacking her lips, probably for effect as much as anything else.<br>\r\nShe bites down on the sandwich, her teeth neatly severing your legs beneath the knees.    As you scream she moans with delight.  \"Oh, sis!\" she purrs.  \"If I'd known you tasted this good, I'd have eaten you when you were normal-sized!\"<br>\r\nCrystal takes her time eating you, biting off chunks as she ever-so-slowly works her way up your body.  You pass out long before she finishes, to the sound of your sister wishing she could only eat you again.<br>\r\n<br>\r\nTo your surprise as much as anyone else's, you reform, whole and unharmed (although still shrunken) in ...</span></div></div>",
            "created":1188622800,
            "id":441272,
            "title":"Sandwiches are not a Democracy"
        },
        "153":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "and she hears you",
                "doesnt hear you"
            ],
            "content":"<div class=\"\"><div> <span>Your Mom walks trough the door wih a burger in one hand and a pack of fries/chips in the other hand. she walks over to the table and putsthe burger down on the plate next to you, and emtys the pack of chips/fries on top of you, you scream to your mom...</span></div></div>",
            "created":1175058000,
            "id":393520,
            "title":"Tea time"
        },
        "1531":{
            "choices":[
                "\"You were supposed to be eaten by Crystal!\"",
                "\"You were supposed to be eaten by Mina!\""
            ],
            "content":"<div class=\"\"><div> <span>Your mother pauses, unsure of where your voice came from.  She looks around the room, trying to trace it.  \"Carol?\" she calls.<br>\r\n\"I'm down here, mom!\" you cry out from beneath the chips.  <br>\r\nUnsure of her sanity now, your mother slowly brushes the chips off of you.  When she sees you, she gives a start and has to steady herself against the table.<br>\r\n\"Oh, God, Carol!\" she says, uneasily.  \"What on earth happened?\"<br>\r\n\"I wish I knew.\"<br>\r\n\"I mean, my God, I could have EATEN you, Carol!\"<br>\r\nOvercome with relief, you let out a laugh.  \"Well, I'm glad you didn't.  How do you think we can fix--\"<br>\r\nWithout warning, your mother grabs hold of you and lifts you off the plate.  Startled, you manage to stammer out a quick \"What are you doing?\" as she strides briskly into the kitchen, to which she answers ...</span></div></div>",
            "created":1189227600,
            "id":443042,
            "title":"From bad to worse"
        },
        "15311":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Leapt to the floor and began running ",
                "You couldn't break her grip"
            ],
            "content":"<div class=\"\"><div> <span>\"Crystal?\" You mutter \"I-I am supposed to be eaten? Yo-you planned this?\" You cried out your mother grinned savagely <br>\r\n<br>\r\n\"Of course I did! How else doc you think you got that size sweetie? You'll make a declious snack for Crystal don't you think?\" As she picked you up again brushing off chip crumbs from your tiny,defenseless body and looked you over licking her lips \"Mmmmmm you certainly look yummy but I'll let my other daughter do the honor of devouring you!\" You were beyond shell shocked jaw dropped and nearly crying <br>\r\n<br>\r\n\"Bu-but why are you doing this?\" You cried out as your mother began taking you straight back to your other sister's room  she shrugged <br>\r\n<br>\r\n\"Oh no reason it's just something I feel like doing in fact I wanted to do this for a while now........\" You try and question her further but she yields no answers and you're completely helpless at her mercy soon you're at the door of your older sister and your mother knocks gently on the door <br>\r\n<br>\r\n\"Crystal sweetie time to wake up! I got a surprise for you come on out!\" As she was pounding on the door you saw your chance to escape and.......</span></div></div>",
            "created":1497663300,
            "id":2337243,
            "title":"\"You were supposed to be eaten by Crystal!&..."
        },
        "153112":{
            "choices":[
                "She ties a rope around your belly, and hangs you for her to grab with her mouth",
                "She gets a small pool and drops you in, acting like a shark"
            ],
            "content":"<div class=\"\"><div> <span>No matter what you tried, you couldn't get free. Your mother walked in, still holding you behind her. You knew you could bite her to get free, but you couldn't bring yourself to do it. Though you couldn't see it, Crystal was starting to wake up, and she was hungry.<br>\r\n<br>\r\n\"Oh mother, must I get up now? I'm still a little tired.\" Crystal said, yawning.<br>\r\n<br>\r\n\"Dear, I know that you like to taste new food, and I have something for you. Something tasty. Someone tasty.\" Mom said, getting ready to reveal you.<br>\r\n<br>\r\n\"What do you mean . . Someone?\" Crystal asked, slowly. Mom held your tiny body in front of her. You were pretty scared, but you weren't going to run away. Your mother dropped your naked body onto Crystal's lap.<br>\r\n<br>\r\n\"I shrunk her, and I hope you enjoy her. Don't worry about killing her, when you eat her, she will re-spawn. I'll leave you two alone so you can have fun.\" Mom left, closing the door behind her. As soon as she was gone, Crystal grabbed you.<br>\r\n<br>\r\n\"Well well, it looks like I have the advantage. I know exactly what I want to do with you.\" She said.</span></div></div>",
            "created":1498623720,
            "id":2343798,
            "title":"You won't last long against her"
        },
        "1532":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "puts you in her mouth",
                "sees you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You keep shouting but your Mom doesnt hear you. she covers you with salt and pepper, then she squeezes Kechup all over you. She grabbes you in a hndfull of chips/fries and...</span></div></span></div>",
            "created":1175058000,
            "id":393527,
            "title":"Moms tea"
        },
        "15321":{
            "choices":[
                "mom licks her lips",
                "mom stares at you in disbelief"
            ],
            "content":"<div class=\"\"><div> <span>Your mom grabs you along with a hand full of chips/fries to feed her hungry belly. Her open mouth is approaching fast and before you know it your on your mom's tongue. She begins to chew the food as you fight to avoid being chewed up. As she is about to swallow you push your way near the front of her mouth. The food along with suddenly vanishes with the sound of a \"gulp\". Your mom begins to hmm with sounds of pleasure as she is rolling you around  inside of her mouth. It has become apparent that she has notice your presence. Suddenly light re-enters her mouth as she spits you out onto her plate. </span></div></div>",
            "created":1178168400,
            "id":404611,
            "title":"nearly swallowed"
        },
        "153211":{
            "author_id":"cookynator",
            "author_name":"EdibleCooky",
            "choices":[
                "The bathroom",
                "The dining room again"
            ],
            "content":"<div class=\"\"><div> <span>   You sit on your Moms plate, covered in saliva when you look up to see her looking down at you with a hungry look in her eyes<br>\r\n\"What do we have here\" she says, licking her lips. you sit there in disbelief as your Mom picks you up, lifts the bun and 1st slice of lettuce of her burger, and places you on her burger, adding a large ammount of ketchup on top of you before putting the bun back on top of you.<br>\r\n\"Mom, what are you doing?\" you ask, scared to hear the answer<br>\r\n\"Im eating my tea of cource\" she replies \"besides I didn't know food could talk\" and with that she takes a enormous bite out of the burger, missing you by a hair<br>\r\n\"Mom, please don't do this\" you say, but she just continues chewing, then swallowing. You knew it was your turn this time, you squirm and struggle but its no use, your Mom has tight hold of the burger. <br>\r\n<br>\r\n     She bites down behind your feet, taking you in in one bite. She cotes you and the burger in saliva, and chews the burger around you, encasing you in a burger prison. She then swallows hard taking you out of the fleshy cavern that is her mouth and into her gullet. The ring of muscles around you massage you down her throat to her stomach, it would have been very pleasant if it wasn't for what came next. then you dropped into her hot and humid stomach, landing on the sticky, spongy floor, encased in your burger prison, you could only watch and wait as her stomach set to work on digesting you, but you didn't realise that you would reform in...</span></div></div>",
            "created":1186290000,
            "id":432409,
            "title":"Mom from hell"
        },
        "1532111":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Your body was sucked and turned into fat, you were aware",
                "Your body was packed in the feces, your mother goes to the bathroom, you were aw"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your body began to burn and you went straight to the intestine, the intestine began to suck your nutrients, but you were still aware. After hours</span></div></span></div>",
            "created":1501253940,
            "id":2360758,
            "title":"The bathroom"
        },
        "15322":{
            "choices":[
                "Crystal walked in.",
                "your mother put you in her mouth."
            ],
            "content":"<div class=\"\"><div> <span>She looks directly at you.<br>\r\n<span class=\"chotpink\"><i>Yes! She sees me!</i></span> You think to yourself. She looks at you for about a minute. Your mother then smiles.<br>\r\n\"<span class=\"cgrape\">Well, it's nice to see that you have found yourself in my food.</span>\" She says. You are really confused about why she isn't surprised. \"<span class=\"cgrape\">Do you know how you got this way? Well last night, I sneaked into your room and poured a shrinking potion into your mouth. I'm unsure how you got in here, however, I do know that if you are eaten, you will re-spawn.</span>\" Your eyes widen, as she licks her lips.<br>\r\n\"<span class=\"chotpink\">You don't mean . . .</span> \" You start to say, and she nods. Then . . .</span></div></div>",
            "created":1470545040,
            "id":2192208,
            "title":"Mother isn't surprised"
        }
    },
    "info":{
        "author_id":"celestia",
        "author_name":"Princess Celestia",
        "brief_description":"Carol is your average teen when she suddenly shrinks. (vore/cannibal content within)",
        "created":1168150560,
        "description":"<td align=\"left\" class=\"norm\">this is the story of Carol, a normal 16 year old girl. she has a slender body, blue eyes and long red hair which she keeps in a ponytail. however today is different because today she will end up shrunken in her home with her mom and two sisters.<br>\r\n<br>\r\nSusan is Carol's mom, she's about 35, she's a brunet with brown eyes and she too has a slender build. she is kind and yet has a secret desire that is a very dark one.<br>\r\n<br>\r\nMina is Carols younger sister at the age of 12, she has long brown hair and blue eyes and she constantly taunts Carol about various things. this annoys Carol to no end.<br>\r\n<br>\r\nCrystal is Carol's older sister at the age of 18. she has long black hair and black eyes. she's a goth girl to the end and she likes sandwiches as a sort of comfort food to keep her going.<br>\r\n<br>\r\nplease follow these rules:<br>\r\n1. no guys or additional characters, this will be enforced.<br>\r\n2. this story is a vore/cannibalism story but I don't want to see generic swallowed alive scenes.<br>\r\n3. no crushing, toilet stuff, sex, or things like that. <br>\r\n4. Carol can regenerate (by that I mean that she can reform as herself and only herself and only at her current size) so just because she gets chewed up doesn't mean she's dead.<br>\r\n5. no transformation!<br>\r\n6. have fun, I hope to see carol in a sandwich soon.<br>\r\n7. NEW RULE you can not kill of caren. (if she can reform from being chewed up she can reform from being digested.) and no more one to two sentence chapters unless it's a choice chapter.</td>",
        "id":1199350,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1566303000,
        "modified":1566303000,
        "pretty_title":"a girl shrunken"
    }
}