{
    "chapters":{
        "1":{
            "author_id":"elloello",
            "author_name":"X-Kid",
            "choices":[
                "Accept his help",
                "Kil,l him",
                "Let go of his hands (warning this will be the end of the story)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>(We leave off where Wesley is about to fall off the train)   <br>\r\n<br>\r\nYour staring deep ito crosses eyes should you accept his help or kill him?? Your choice</span></div></span></div>",
            "created":1309463820,
            "id":1137925,
            "title":"Yourr choicee"
        },
        "11":{
            "author_id":"elloello",
            "author_name":"X-Kid",
            "choices":[
                "He proves it",
                "You pass out and wake up in Fox's body",
                "He points a gun at you",
                "You pass out and have a dream about Janice your ex-boss"
            ],
            "content":"<div class=\"\"><div> <span>\"What are you waiting for cross help me up\" Wesley said. As Cross helped you up he said \"Wesley I'm your father\". \"Bullshit\" Wesley  said. You peeked around the corner and saw Fox staring at you she said\"It's true he's your father\". She pointed a gun at you \"Any last words \"? She said. You and your father looked at each other you both jump out of the train. While you were falling you turned around to see Fox preparing to fire her gun at you. You felt anxiety coming on and went into slo-mo you pulled your gun and fired. You saw you hit Fox in the knee, shoulder and stomach. As soon as you put your gun away you land in water and see a very brigh light. You wake up wit the same old crusty white stuff on you body and see your father sitting next to you.<br>\r\n<br>\r\n\"If you really are my dad prove it\".</span></div></div>",
            "created":1309465140,
            "id":1137936,
            "title":"Accept his help"
        }
    },
    "info":{
        "author_id":"elloello",
        "author_name":"X-Kid",
        "brief_description":"You are wesley gibson choose your path.",
        "created":1309463580,
        "description":"<td align=\"left\" class=\"norm\">You are wesley gibson you think cross is the one who killed your father but cross is your father accept his help or kill cross? <br>\r\n<br>\r\nRules:<br>\r\n1. Sex allowed<br>\r\n<br>\r\n2.No gay stuff or I will delete<br>\r\n<br>\r\n3.Keep cursing minimal<br>\r\n<br>\r\nEnjoy!!</td>",
        "id":1789780,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1309465140,
        "modified":1309465140,
        "pretty_title":"Wanted:A diffrent path"
    }
}