{
    "chapters":{
        "1":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "He gains 100 pounds of muscle",
                "He gains 200 pounds of muscle",
                "He gains 300 pounds of muscle"
            ],
            "content":"<div class=\"\"><div> <span>Alan was an average 18-year-old wolf. He liked was all guys liked: sports, video games, girls, etc. Alan tried to get people to notice him and trying to like him but people never saw past his appearance. He was really scrawny for someone his age. He was 5 foot 7 with twigs for arms and legs. He was constantly rejected from everyone in school. No one wanted to be with a tiny guy like him. Alan's dream was for someone to at least look at him and take the time to know him. However, it seemed that dream would never come true.<br>\r\n<br>\r\nOne night, Alan wasted his time like he always does by watching TV and surfing the Web in his dorm. He felt they were his only escape from the real world. Although he liked doing these things, he would love to escape into the real world and see what it had to offer it for him. The only thing he knew about it was that it was cruel to those that don't look the part. Alan wanted to reject the world for rejecting him but he knew that would be impossible. All of Alan's thoughts and life shortly changed after taking one glimpse of the moon from his window.<br>\r\n<br>\r\nAlan raised his head out of boredom, tired of doing the same thing every night. He turned his head to the window and caught a glimpse of the moon. He saw that it was full but there was something more to it. Alan felt compelled by it. He didn't know why, but he simply had to go outside and get a better look at it. He left his dorm and walked to the deserted center of the campus. As he looked at it, Alan couldn't help but admire the full moon that was out that night. It was luminous, round, and beautiful. The majesty of the moon overtook Alan's brain. He also loved how the moonlight was shining against his fur.<br>\r\n<br>\r\nAlan stood on campus for several minutes simply adoring the moon with no idea why. He then felt weird all of a sudden. A knot in his stomach appeared without warning. It made him feel nauseous but there was also a hint a euphemism in it. Alan didn't know if he was getting sick or he overwhelmed by the sight. Before Alan could figure it out, he started to get a tingle all over his body. Little did he know his thoughts on life were about to change.  <br>\r\n<br>\r\n</span></div></div>",
            "created":1308632400,
            "id":1131595,
            "title":"The compelling glow"
        },
        "11":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Goes to a party",
                "Tests out his strength"
            ],
            "content":"<div class=\"\"><div> <span>The moonlight felt good on Alan's body. He didn't know why but he felt more energetic as if he was going through photosynthesis. However, the sensation was short lived as a striking pain enters in every muscle in his body. Alan immediately felt excruciating pain. He squatted down with his hands on the ground trying to relieve himself but to no avail. Alan had no idea what was wrong with him. For one moment, he felt like he was on top of the world and then felt horrible the next. More questions than answers emerged as he looked at his right arm.<br>\r\n<br>\r\nAs Alan glanced at his arm, he saw it growing in size right before his eyes! His arm grew thicker and thicker in fur and power. Alan noticed the same thing happening to his other arm, but he couldn't enjoy it as another strike of pain appeared. This pain bothered him so much that he screamed till his lungs fell out of his throat. <br>\r\n<br>\r\nIt was as if Alan was was being overflowed with some sort of power from the moon. He didn't notice but the thickening was happening all over his body. His legs grew over the limit of his pants and split the seems of them. His shirt grew tighter as his chest expanded to extreme proportions. Finally, his biceps grew to the size of soccer balls. All of a sudden, the pain stopped but the questions remained.<br>\r\n<br>\r\nAlan finally gets up from the pain still confused over what had just happened. As he stumbles to his feet, he looked at himself in shock. Alan looks at his arms and 6-pack in admiration. He then looked at his legs and saw the damage they did to his pants. Only streams of fabric ran through his newly strong legs with the upper part intact. Alan flexed his biceps to power running through his bulging veins. He didn't know what just happened but he simply loved it.<br>\r\n<br>\r\nThe only thought that Alan could think of was the amount of respect he would get now. Now that he looked like a teen model, everyone would want to hang out with him. He looked at the time to see the night was still young. Alan wanted to see what he could now in his new body. </span></div></div>",
            "created":1308718800,
            "id":1132327,
            "title":"He gains 100 pounds of muscle"
        },
        "111":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Alan talks to her",
                "Alan excuses himself from her",
                "Alan's interrupted"
            ],
            "content":"<div class=\"\"><div> <span>Alan couldn't stop flexing his biceps to himself. He was simply amazed by the transformation. This new power flowing through him made him feel stronger than ever. Alan also liked how his muscles made him look good too. Alan felt like he could do anything now. The question was what to do.<br>\r\n<br>\r\nThen it hit him. Alan remembered there was going to be a party at a frat house that night. Normally, he would stay away from frats because of jocks who would pick on him. But they wouldn't bother him now with his new shape. Alan looked down to see only his upper parts of his pants still intact from his growth. He would have to change first.<br>\r\n<br>\r\nAlan thought about his roomate who was on the varsity football team. Surely he would have some spare clothes Alan could use. It only took a couple minutes for him to reach his room, his powerful new legs, made it running a snap, and he could two step the stairs with ease. He rifled through his roommate's dresser, until he sound a plain red T-Shirt that hugged his biceps tightly and showed off his well defined chest and abs and some snug blue jeans. The frat house was on the other side of campus, so it gave him an excuse to really test out how fast he could run now. Alan stepped out of the building into the bright moonlight again and grinned, this was going to be a night he wouldn't forget.<br>\r\n<br>\r\nAlan took off in a dead run, flying down the road like an olympic sprinter, it felt amazing, the wind whipped through his fur and he was barely winded. The frat house loomed ahead, getting closer all the time. although Alan was alittle disappointed, he wanted to see just how far he could run, but hanging out at the party, could be just as fun.<br>\r\n<br>\r\nThe frat house boomed with music, cheers, and popping of beer cans. Alan had no intention of doing anything crazy; he just wanted to see if anyone would check his new body. The wolf walked in to a room packed with dancing students. Alan felt shy at first. He had no idea where to start.<br>\r\n<br>\r\nAlan thought he could calm himself down with a soda. As he walked, Alan noticed a few girls staring at him curiously. They never seen a handsome wolf like him before. Obviously this would make Alan thrilled as he always dreamed of girls noticing him. But he was still shy and nervous about where to begin acting socially. He pulled a soda out from one of the coolers that stood on either side of the living room table and went to pull the tab, but applied too much strength to it and he ripped the tab right off. He stared at the tab, for a moment before he slipped it into his pants pocket. A couple of the girls laughed at Alan's confused face when he ripped the tab off, thinking he had been showing off for them. Alan blushed, and felt a little hurt, thinking they were making fun of him rather.<br>\r\n<br>\r\nAlan slipped through the crowd into the kitchen with the soda still in hand and set it down on the table. he realized he needed to be a little more careful with how much force he used when doing normal stuff now. Looking at the soda, he wondered whatelse he could do, and he pressed his thumb onto the oval where the tab was supposed to be pressed in and it popped open almost immediately, with almost no resistance.<br>\r\n<br>\r\nOne wolf girl saw the whole thing. She saw Alan rip off the tab of the soda can and simply push it open. She wanted to talk to him but she too was shy. A lioness and a tigress were with her and encouraged her to talk to him, saying that he looked like a nice guy. What could happen?<br>\r\n<br>\r\nThe wolf girl saw Alan not drinking alcohol and looking sober. Knowing Alan wasn't a drunkard calmed her nerves and lifted her spirits to talk to him.<br>\r\n<br>\r\n\"Um...excuse me.\" Alan looked down to see a cute wolf girl up to his meaty pecs. This was a dream come true for him. A girl was actually talking to him. But what should he say what should he do?</span></div></div>",
            "created":1367211600,
            "id":1581345,
            "title":"Goes to a party"
        },
        "1111":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Take her to the movies",
                "Take her to dinner",
                "Take her somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Alan blushed a little bit. he'd never had a conversation with a girl at the college before, he'd usually been too afraid or they looked like they would have chewed him up and spit him out. \"H-Hi there.\" the wolf girl blushed and looked down, she was just as embaressed as he was and it gave him a little comfort. \"Did you want something? maybe we could talk?\" the girl nodded her head gently, slowly tilting her head up, but stopped at his chest, still a little too afraid to look him in the eyes. \"Y-Y-Yea.. I c-couldn't help n-notice you s-seemed n-new around here.. No one has s-sen you a-around before.\" Alan smiled, it wouldn't matter if he had said that he had been around for a while, must much skinnier, he doubted she would believe him and simply nodded. \"Yea I guess you could say I'm new.\" she tiled her head up and started him in the eyes. \"I-I was w-w-wonder i-if you w-want to take a walk around c-campus, I could s-show you around.\" Alan already knew the college campus pretty well, but he didn't want to seem rude and she was really cute. \"Sure I'd like that\"<br>\r\n<br>\r\nThe wolf girl felt more comfortable around Alan as they walked around campus. Even though Alan knew the place, he liked being with her. She seemed like a very nice girl. He also enjoyed the clear and quiet night compared to the noisey and crowded party. Alan looked up at the full moon again fueling him with warm power underneath his fur. Alan asked her, \"You don't look like a party goer. What's a nice girl like you doing at a frat party?\"<br>\r\n<br>\r\n\"Well,\" she stuttered, \"I'm a bit shy and my friends thought it would be good for me to go. I don't like going to parties like that. They're too noisy and someone's bound to act stupid there.\"<br>\r\n<br>\r\nA girl with good intentions. Alan liked that. But then he remembered, \"I'm sorry, I don't think we've been introduced. My name's Alan.\" Alan rose a paw for a shake. The girl responded, \"Alice.\" Alan grinned, this girl seemed really. Could he ask her out? he didn't know if she would agree. \"So Alice I was wondering....\" he blushed, wonder if he was making the right choice. Alice looked up at his face. \"Alice i wanted to know if... maybe we could.. I don't know go out sometime?\" It was Alice's turn to blush and she looked down, suddenly interested in nails on her hand. \"I. uh..It's sounds really nice and all..\" Alan closed his eyes, waiting for that 'But' to dash his hope, but it didn't come. \"Sure. I think a date sounds nice..\" her voice grew quiet as the blush in her cheeks grew brighter. Alan didn't know whether to hug her, or to jump up and howl for joy, so he decided to try and play it down. \"Great! how about...\" Alan frowned. where could he take her? the movies were nice, but so was going out to dinner.</span></div></div>",
            "created":1367211600,
            "id":1581382,
            "title":"Alan talks to her"
        },
        "11113":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "At the date",
                "Something comes up"
            ],
            "content":"<div class=\"\"><div> <span>Alan scratched his head for a moment. He thought about taking her to the movies, but wanted to do something a little more special. then he remembered the arboretum that was close to the campus. He could take her there for a picnic. so he made up his mind. \"So there is this arboretum nearby.. maybe we could go have a picnic there?\" Alice gave a big grin. \"That sounds perfect!\" Alan smiled. \"how about I meet you there tomorrow at 11? I'll bring the food you can meet me at the front gate.\" Alice nodded. \"I can't wait\" Alan stared up at the moon again, knowing this moment wouldn't have even happened without it. \"Hey how about we walk back to the party? I'm sure your friends will want to know what happened. or I could walk you back to your dorm if you wanted.\"<br>\r\n<br>\r\n\"My friends are probably going to be looking for me,\" said Alice. \"Might as well head back there. I think the party's about over by now.\" Alan understood and kindly escorted her back to the frat house. As they walked back, Alice hugged on Alan's arm sensing the power brewing within his muscles. She felt a sense of warmth and protection as the frat house's music grew louder and louder.<br>\r\n<br>\r\nThey stopped at the front door of the house. \"Thanks for the walk,\" said Alan. \"I really enjoyed your company.\" Alice blushed again and said, \"To be honest, I didn't think you'd be interested in a girl like me.\" Alan lifted her muzzle with his paw. \"You see a shy girl but I see a kind and beautiful girl.\" Alice went so red Alan could see it under her fur but made no remark. Alan opened the door for Alice for scurried back in to talk to her friends. a lot of the partygoers had gone, except for a few diehard partiers, or those too drunk to stand. Alan saw Alice talking animatedly with her friends and smiled. He left the party after that. he needed to find some nice clothes or by them when he was out getting food for the picnic, but it didn't matter at the moment. He had his first date ever since coming to college and he looked forward to it. He took off when he was outside the frat house, running across campus, and he let out a howl. It didn't take him long to get back to his dormroom and he let out a laugh. he was too excited to sleep, so he decided to look through his roomate's clothing for something decent he could wear.<br>\r\n<br>\r\n<br>\r\nAlan found a pair of  jeans and a green shirt that looked nice enough and he set it aside for tomorrow. He looked out his window, grinning and he let out a yawn and decided to head to bed. None of his sleeping clothes would fit him, so he decided to simply sleep in his boxers. stripping off his clothes and slipping in under the covers.</span></div></div>",
            "created":1367298000,
            "id":1582065,
            "title":"Take her somewhere else"
        },
        "111131":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Alice runs away",
                "Alice stays"
            ],
            "content":"<div class=\"\"><div> <span>Alan anxiously held a cooler in paw while waiting at the arboretum gate for Alice. He arrived right on time but she was no where to be found. He grew worried thinking something happened or she stood him up. Alan shook this head getting the crude thoughts out of his head. If something were to happen, Alice would call. Besides, she wasn't the type of girl who would stand someone up, even with her shyness.<br>\r\n<br>\r\n\"Hey, Alan!\" Alan's ears perked to see a young slender wolf girl walking up to him. \"Hi Alice!\"<br>\r\n\"Sorry, I'm a bit late. I got a little lost trying to find the place.\"<br>\r\nAlan waved his paw dismissively. \"Don't worry about it. At least you made it.\" He then curled his arm in a loop in front of Alice. \"Shall we go?\" Alice giggled and grab hold of his muscular arm.<br>\r\n<br>\r\nIt was getting pretty late, but that wasn't gonna stop them from having a wonderful time. Plus it didn't take them long to find a good spot underneath a few trees neither. The female sat patiently in front of her favorite wolf, watching as he was tending to his cooler. \"So, what did you bring?\"<br>\r\n<br>\r\n\"Not too much, but nothing too sugary either.\" Alan pulls out a club sandwich with an olive that was stabbed with a toothpick and hands it over to Alice, \"Care for a club sandwich? It's tuna.\"<br>\r\n<br>\r\nAlice grabs the sandwich, \"Thanks. It's fine.\" Alice takes a small, but quick bite of her piece. Alan also pulls out his own sandwich, which was filled with ham instead of tuna. The female wolf suddenly overheas a large chomping noise. Turns out to have come from the big muscular wolf. Turns out Alan has been stuffing his face, as if he was hungry all day. She never really saw the big guy like this before, but she didn't mind, letting out a small chuckle. \"Heheh.\"<br>\r\n<br>\r\nAlan takes a big gulp. \"Hm? What?\"<br>\r\n<br>\r\nAlice holds up a napkin to Alan, wiping off some of the mess off his maw. \"You're so cute when you engorge yourself.\"<br>\r\n<br>\r\nThe big wolf blushes. \"Uh... Um, heh...\" Alice backs away a bit. \"Sorry. Guess I was hungier than I thought.\"<br>\r\n<br>\r\n\"It's okay. I said it was cute, didn't I?\" That makes the proud wolf blush once again, a little more than before. Alice takes a look out at the soon-to-be night sky, letting the sunset in front of them sink in. She sighs, \"Just look at that sunset. Ooh, and it looks like it's going to be a full moon tonight too.\"<br>\r\n<br>\r\n\"Yeah...\" Alan's ears perked up, \"Fu-full moon?!\" Alan looked out into the sky. he didn't know what would happen if he was caught out in a full moon. would he grow bigger? would it be painful like last time? Alice had a confused look on her face. \"Are you alright Alan? you look a little scared, is something wrong?\" Alan looked at Alice and shook his head and remained quiet for a moment before talking. \"No i'm fine...\" There was no way he could tel her that the moon had made him more muscular, could he? would she even believe him? \"well... maybe there is something wrong...\" he started, his voice getting a little lower. What if he told her, and the moon came up but nothing happened? would she think he was lying? would she end the date and leave? Alice looked him in th eyes. \"It's okay... you don't have to talk about it if you don't want to..\"<br>\r\n<br>\r\nThen Alan felt it: the same warmth and pain he felt before he grew the first time. He stood up clunching onto his chest gritting his teeth. Alice followed him in concern. \"Alan, are you okay?\" Alan looked like he was in pain and Alice didn't know what she could do to help. Through Alan's grunts, Alice could see his shirt and jeans seeming to get smaller against him. His fur grew thicker and his muscles swelled to new peaks. Alice gasped as Alan's arms ruptured the sleeves of his shirt and his legs the seems of the jeans.<br>\r\n<br>\r\nAlan could feel great power flowing through him but he felt scared not just for Alice; the power felt overwhelming as if he was going to explode. After what felt a long time, Alan stopped to see his shirt and jeans in tears. He also grew to a new height. He looked down to see a surprised Alice. Alan didn't know what to say or do.</span></div></div>",
            "created":1367298000,
            "id":1582106,
            "title":"At the date"
        },
        "1111312":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Alan shows off",
                "Alan goes shopping"
            ],
            "content":"<div class=\"\"><div> <span>Alice was completely awestruck of the even bigger Alan that kneeled before her in pain. She was scared but she couldn't help but feel a sense of empathy seeing Alan painfully huffing for air. \"Are...you okay, Alan?\" she asked. Alan was too scared to look up to her. He knew he absolutely terrified her with the ability he has yet to understand. Alan clenched everything he could: his eyes, teeth, and hands.<br>\r\n <br>\r\n\"Yeah,\" responded Alan still looking at the ground, \"I'm okay.\" All of a sudden, he felt a cool chill running up his rippled back. Alice stroked his back, squatted to Alan's level, and rose his muzzle. \"It's okay. I'm just glad that you're fine.\" Alan didn't understand. Why was Alice still here when she should be running in fear? \"I don't really understand.. you saw what happened and yet here you are...\" Alice smiled. \"I wouldn't leave someone who needed help, even though i'm a little scared of what happened\" Alan gave a sad smile, it wasn't often you met someone so selfless. \"Thank you, it means a lot to me, I was sure you would have run away.\" Alice shook her head. \"No, not from you, you are so sweet and gentle\" Alan shivered a little, was this was what it felt like to find love? to find someone who could accept you for who you are? Alan felt a warmth blossoming in his chest, but it was different from when he grows, it was tender and felt wonderful. \"Alice?\" she looked him in the eyes. \"Yes?\" Alan's heart was beating fast as he worked up the courage to speak. \"I was wondering if perhaps you'd want to go out on another date with me? this may seem like a weird time to ask it's just..\" Alana didn't get a chance to finish his sentence as Alice pressed a kiss to his lips. \"Yes I'd like to go out with you again..although let's make sure not to go out during a full moon ok?\" Alan laughed a little relieved and elated. <br>\r\n<br>\r\nAlan smiles, and chuckles. \"Okay.\" The bigger wolf gets up and then heads to their picnic setting to grab his basket. He then looks back at Alice, \"Well, I guess I'll call you then?\"<br>\r\n<br>\r\nAlice raises an eyebrow, \"Hm? What, you're leaving now?\"<br>\r\n<br>\r\nAlan's eyes widen a bit, unsure of what to say, \"Well...yeah.\"<br>\r\n<br>\r\nAlice walks up to the muscular wolf, \"Alan, we've only been here a few hours and you want to leave now?\"<br>\r\n<br>\r\nThe mighty wolf was still just as speechless. \"Well...uh...\"<br>\r\n<br>\r\n\"Look Alan, I'll admit this was a big surprise, but that doesn't mean we'll automtically just leave because of it.\", Alice explained. \"I mean, would you like it if we only spent a few hours on a date?\"<br>\r\n<br>\r\n\"Well...no.\", Alan utters. \"But, do you think I should even be out here like this?\" Alan holds out a hand to show his ripped and tattered clothers.<br>\r\n<br>\r\nAlice merely blushes in return, \"Mm...\" The female wolf quickly turns around, \"Oh. Yeah, well...um...I, don't mind. Is, isn't that all that matters right now?\"<br>\r\n<br>\r\nAlan's eyes rise up, blushing a bit himself. \"Oh. Uh, alright.\" The big wolf sets the basket back down, noticing that there was still enough food to go around for the two.</span></div></div>",
            "created":1367557200,
            "id":1583703,
            "title":"Alice stays"
        },
        "11113121":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Go clothes shopping",
                "Head home"
            ],
            "content":"<div class=\"\"><div> <span>Alan and Alice went back to their picnic as if the growth never happened. Alan felt so relieved and happy that Alice stayed. He confidently took a big bite out of another sandwitch he stored in the cooler. Alice also felt relaxed around Alan. She continued eating and enjoying Alan's company but she couldn't stop staring at his bulging and rippling muscles. Every time Alan took a bite of food, Alice could have sworn she saw Alan's chest thicken slightly. Alice like how muscular Alan was before but she was really curious as to how strong he is now.<br>\r\n<br>\r\nAfter Alan finished another sandwitch, Alice spoke up, \"So, Alan, with this...change, how strong do you think you are now?\" Alan's ears perked and lips curled. He too was curious and was happy to find out with Alice. He curled his arm flexing a bicep and said, \"Let's find out!\"<br>\r\n<br>\r\nThe first thing Alan was thinking about was WHAT he could do to show how strong he was. The only thing that was around was their picnic setting and a couple trees. Maybe... Alan stands up, and then takes a light feel out of the tree. It felt pretty hard and well-aged, although Alice was curious to what Alan was doing. \"Alan? Is something up with that tree?\"<br>\r\n<br>\r\nThe big wolf turns his head towards his date, putting on a sly smirk, \"Um, just checkin' it out.\" Alan wraps his largely-muscled arms around the tree.<br>\r\n<br>\r\nAlice sits up, \"Wait, you're not seriously thinking about trying to lift that thing, are you?\"<br>\r\n<br>\r\nSuddenly, Alan's entire upper body flexes out, his back and arms rippling with so much power the remaining remnants of his shirt stretching right off. The two wolves then heard cracking and trembling from the tree's roots. The noise grew louder and louder as Alan pulled harder. Veins were literally popping out of his fur to feed him the energy to complete the feat.<br>\r\n<br>\r\nWith a loud growl, the tree rose from the ground in Alan's paws. Both he and Alice stare at the muscles of steel in amazement. However, the feat left Alan too tired to lift it any longer. The moment the tree got into his paws, Alan dropped on the ground.<br>\r\n<br>\r\nAlan went back to a still stunned Alice and flexed his arm again charmingly. \"How was that?\" he said slightly out of breath. Alice didn't say anything. She just ran to Alan to give him the biggest hug she could offer. Alan responded by wrapping the monstrous arms around her so she could feel the warmth and strength of his body. \"That was amazing!\" said Alice. Alan couldn't but shed a tear. \"Thank you. Thank you for giving me a chance.\"</span></div></div>",
            "created":1367643600,
            "id":1583755,
            "title":"Alan shows off"
        },
        "111131211":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Walk with Alice",
                "Go back to the college"
            ],
            "content":"<div class=\"\"><div> <span>Before they knew it, the two had been hugging a little longer than expected. Alan finally backs away a bit. \"Um, so, it's not too late right now. You, wanted to do something else tonight?\", Alan asks shyly. Guess he's not as used to being aroung Alice, just yet.<br>\r\n<br>\r\nAlice starts to ponder to herself, but she wasn't getting much help staring into Alan's lucious abs. She quickly turns away instead, \"Um... Ooh! I know! Maybe...we can clothes shopping?\"<br>\r\n<br>\r\nAt first, the big wolf was unsure about what the passers by might think when a big, muscular wolf just strolls along shopping for clothes. He then takes another look down at his frame, seeing only ripped pants covering his titanic body. \"Heh... I guess shopping for bigger clothes won't be so bad.\"<br>\r\n<br>\r\nAlice grabs a firm hold of Alan's palm, \"Come on. You'll thank me for this.\", she winks. It only took about 15 minutes to reach the shopping district of town, along the way Alan got more than his fair share of looks, some of admiration, some of envy, but it still made Alan feel self conscious about being almost naked. Alice tugged him into one sports clothing shops, there were only a few customers inside and a single cashier and sales representative.<br>\r\n<br>\r\n\"Can I help you?\" asked the horse anthro sales representative. Alice nodded. \"We're here to buy a couple new outfits for my boyfriend.\" Alan stiffened. B-Boyfriend? Alice slipped her hand into his and gave it a light squeeze. The sales representative gave Alan a quick once over, before leading them towards the back of the store where the extra large clothing was set out. There were all kinds of clothes, sweatshirts, sweatpants, spandex shorts, beach wear, and much more lining the walls.<br>\r\n<br>\r\nThe vast array of clothes overwhelmed Alan. He didn't know where to start looking. Alice still kept her smile while looking at the clothes picturing Alan in all of them. \"So,\" started Alan, \"Where do we start?\" Alice grabbed a pair of blue sweatpants, black spandex shorts, and extra large muscle shirts. She then handed them to Alan. \"Try these on! I'm sure you'll look great!\" Alan knew Alice was excited about seeing his rippled body in clothes that'll emphasize it but he was more than happy to give her a show. Alan took the clothes from Alice and said, \"Be right back,\" with a smile.<br>\r\n<br>\r\nAfter a few minutes, Alan walked out of a dressing room and Alice couldn't help but be amazed. Alan wore the spandex short which his tree trunk thighs filled perfectly and a muscle shirt that still defined his pecs and abs. Alan like how they felt. They were not too tight and he felt like he could move freely. With their elastic material, the shirts and pants should withstand another growth outburst if it happens again. Alan felt great and looked great.<br>\r\n<br>\r\nSuddenly, the massive wolf was reminded about his growth. Sure, he likes it if Alice didn't mind, but what if it happens again? Would he even be able to turn back to normal. Out of nowhere, Alice runs up to give the worried another big hug, only Alan's worries soon melted away. He sighs, \"So, I guess I look good then?\"<br>\r\n<br>\r\n\"No. You don't look good.\", She replies blaintly. \"You look GREAT!\"<br>\r\n<br>\r\nAlan's ears perked down. \"Oh. She went there.\" The muscular wolf smiles again, and then lifts up both his shredded arms, making Alice burst out blushing once again. \"But, if you like it.\" Alan picks the female wolf up, and then heads out the door, \"Come on.\"<br>\r\n<br>\r\nSuddenly, the horse stops them, \"HEY! You need to pay for those!\"<br>\r\n<br>\r\nAlan felt embarassed, setting Alice back down, \"Oh! Right! Sorry...\"</span></div></div>",
            "created":1367643600,
            "id":1584221,
            "title":"Go clothes shopping"
        },
        "1111312111":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "Flex for show",
                "Perform a feat of some kind."
            ],
            "content":"<div class=\"\"><div> <span>Alan paid the cashier for the clothes and walked out with the bag of clothes in one hand and hold Alice's hand in his other. \"Now that i have some new clothes, what do you want to do? Alice smiled, looking up in the sky. \"How about a walk through the park? it'll be good to break those clothes in.\" Alan nodded. \"That sounds great\" the park was only about a block away, with his new clothes Alan didn't get as many stares, but he didn't mind it this time, his clothes hugged his body very well showing off his excellent definition<br>\r\n<br>\r\nthe park was peaceful enough, a couple here, some joggers further off. The path was lit brightly and very easy to follow. As they walked Alice moved closer to Alan. \"You know... This wasn't what i was expecting when you asked me out.\" Alan smiled, \"Well how guys can say they grew another couple inches taller and grew more muscled just by looking at the moon?\" Alice giggle. \"Not many I suppose, It certainly made it interesting.\" Alan nodded \"yea..\" They walked in slilence for a little while after that before Alan spoke again. \"So.... in the store you called me your boyfriend, what was up with that?\"<br>\r\n<br>\r\nAlice looked up at him \"Well it would have been strange if we went out clothes shopping on our first date... besides wouldn't you like to be my boyfriend?\" Alan nodded. \"Of course i do, i just didn't know you liked me that much.\" Alice blushed. \"Well...yeah. I'm don't just like because of your muscles. Throughout this whole night, you've been so nice and considerate. I...I never thought I'd meet a nice guy like you.\" Alan couldn't believe what he was hearing. No one ever said something like that him, much less a girl. \"Thank you,\" Alan responded. \"I'd never thought I'd meet a nice girl like you. You may be shy, but I want to help get out your shell.\" Alan then took out a paw to Alice. \"Will you let me do that for you?\" Alice blushed completely red with her heart racing. She took his paw and said, \"Yes.\"<br>\r\n<br>\r\nAlan smiled to her again and picked her up to his chest like he did at the store. Alice was scared at first by the surprise but relaxed in the warmth and protection of her defender. \"Let's go see what else we can find in this park,\" said Alan to Alice softly.<br>\r\n<br>\r\nAs the night slowly rolls through, the two lovebirds were staring intently at the starry sky. \"It sure looks lovely out tonight, huh?\"<br>\r\n<br>\r\n\"Yeah. Is sure is.\", the big wolf responds. He then stops stops in front of a park bench that was shining under a park lamp. \"This looks like a nice spot for you to sit.\"<br>\r\n<br>\r\nAlan soflty sits his girlfriend down, although Alice was feeling a tad confused. \"For, for me to sit? Why?\"<br>\r\n<br>\r\n\"For the show!\", Alan replies happily. \"You know this shirt that I'm currently wearing?\"<br>\r\n<br>\r\n\"Yeah. What about it?\"<br>\r\n<br>\r\nThe handsome wolf raises up an extensively thick arm, the sleeve nearly stretching apart around his hardened peak and tricep, \"It's actually a tad too tight for me from all the others after all. Wanna see how much it can take?\"<br>\r\n<br>\r\n\"Oh... Okay.\" As much as Alice loved to see, she was still feeling skeptical about it, \"But, I just paid for that shirt...\"<br>\r\n<br>\r\n\"I'll pay you back however much you spent on it.\"<br>\r\n<br>\r\n\"YAY!\"<br>\r\n<br>\r\nAlan started pushing his arm against his shirt. First there was nothing except the veins that ran through his biceps underneath his shirt. Alice was stunned to see so much power trying to escape Alan's body. With a slight growl, Alan heard a slight tear coming from the stretched out sleeve.</span></div></div>",
            "created":1367643600,
            "id":1584271,
            "title":"Fancy a Stroll"
        },
        "11113121111":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "They make it to school.",
                "Alan checks on Alice."
            ],
            "content":"<div class=\"\"><div> <span>Alan and Alice spent most of the walk holding paws lost in each other's company. Alice felt secure and happy with Alan's kindness and strength while Alan felt bliss and excited with Alice by his side. Alan wrapped his bulging arm around his wolf girl and she enjoyed feeling even more warm with him.<br>\r\n<br>\r\n\"You are so sweet Alan,\" said Alice. Alan smiled at her and said, \"Well, you're sweet too.\" Alice giggled slightly and stood on the tip of her pawed feet to give Alan a kiss on the muzzle. This made him feel more warm than the transformation under the full moon. He liked it very much. Alice then gave a yawn. \"I think it's time we head on home.\" Alan nodded. \"I think you're right. It's getting kinda late. Let me walk you home.\"<br>\r\n<br>\r\nThe two lovebirds started to walk their way back to campus. It was kind of a long way by foot, but Alan didn't mind. If he had to, he'd be happy to carry Alice the rest of the way there. As they were passing a rather large oak tree, a tall figure pops out from behind the tree. \"Alright, stop right there!\" The two were alerted, and immediately turned around, standing before a tall, but well-built lion holding a swiss army knife. \"Alright, you two just gimme yer cash, and no one gets hurt.\"<br>\r\n<br>\r\nAlice was terrified, cuddling up against the big wolf as hard as she could. This in turn enrages Alan a bit on the inside. How dare this guy come from out of nowhere and scare his girlfriend. \"Alan...\"<br>\r\n<br>\r\nAlan wasn't going to let this jerk ruin the rest of their night. He then pushes Alice back a bit, \"Just stay back.\" Alice calls for the large wolf to come back, but he wasn't listening as he walks up to the burglar lion. Upon further inspection of the feline, Alan notices he was just a tad bigger than him, but that wasn't going to stop the angered wolf from ripping him a new one. \"You aren't getting a single cent from us, now unless you feel like losing use of your arm or a leg I suggest you back off\"  Alan emphasized this last part with a deep growl from his throat which sent a ripple across his chest, his muscles tightening in anticipation for the fight. The lion hesistated and there was a flicker of fear in his eyes, he could hear the dead serious tone and knew Alan meant every word of it, he took a hesitent step back and his grip tightened on the knife before he thrust it forward. Alice watched in horror as the knife flew upward toward's Alan's chest and her lungs filled to scream, but it died in her throat when Alan's arm lashed out, grabbing his wrist and bring it to a complete halt just an inch from his chest.<br>\r\n<br>\r\n\":You shouldn't have done that...\"  Alan tighten his grasp on the Lion's wrist so hard he heard the cracking and groaning from the bone and the lion let out a howl of pain and dropped the knife. Alan stopped down and picked up the knife and held it up in front of him. \"I warned you, now I'm going to give you a small demonstration of what I can do.\"  Alan pressed his thumb roughly against the knife, which bent in half with almost no resistance. The lion began whimpering, which quickly turned to howls of pain as Alan twisted his arm behind his back and pulled until he heard a loud crack inciting a screech of agony. \"Now.... you are going to get out of here. You're lucky i didn't do more than bruise the bone and if i ever find out you mug someone else, i will hunt you down, and next time i am going to shatter your arm, do you hear me?!\" The lion nodded, shaking in fear. Alan let go of the lion's arm shoving him to the ground and he scampered away giving off a low whine of pain as he cradled his arm.<br>\r\n<br>\r\nAlan turned back to Alice who was completely terrified. She had tears running down her muzzle. Alan walked to her and wrapped his muscular arms around her. Alice's breaths slowed as Alan whispered to her, \"It's okay. Everything's fine. We're okay.\" Alice hugged his thick waist and said, \"That was so scary...I...I don't...\" Alan shushed her and hugged her tighter. \"It's okay. I'm sorry that happened. But don't worry. I won't let anything harm you. I will do whatever I can to protect you.\"<br>\r\n<br>\r\nAlice began to calm under Alan's grip. His soft and firm chest comforted her after the horrifying event. Alan let her go thinking she had calmed down. \"You alright now?\" asked Alan. Alice just nodded still a little shaken. \"Come on, let's go home and forget about this whole thing.\" Alice couldn't agree more. She took Alan's paw again and rushed back to campus.</span></div></div>",
            "created":1368162000,
            "id":1587752,
            "title":"Nearly Robbed"
        },
        "111131211112":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Go to class",
                "Do more feats of strength"
            ],
            "content":"<div class=\"\"><div> <span>The next morning, Alan woke up really early. Although he had a great night's sleep, he still couldn't bear the thought of Alice's terror on his mind. He quickly slips on a pair of jean shorts that Alice bought for him, and then walks out of his dorm to head to Alice's. Sure Alan was shirtless, but he was more concerned about Alice's well-being. He moved across campus quickly, the first rays of the sunlight felt great against his chest, but he didn't stop to enjoy it, he moved faster and faster, bounding up the steps that lead to her dorm room. he stopped to take a breath and calm himself before he knocked. A very sleepy Alice opened the door, staring at his muscular chest and her face turned a deep shade of red and she looked up into Alan's concerned face. \"A-Alan! what are you doing here?\" Alan pulled Alice into an emrbace. \"I... I couldn't sleep, I kept thinking about what happened how scared you'd been and... it hurt me, I never want to you to be that scared again..\" Alice's eyes teared up, she'd never met someone so kind and gentle and who cared so much for her. She buried her face in his chest. \"It will be okay, I am not afraid anymore.. and I know you'll be here to protect me.\"<br>\r\n<br>\r\nThe couple calmed down a bit. \"Sorry for coming so fast, Alice,\" said Alan. \"I just wanted to make sure you were okay.\" <br>\r\n\"Don't worry, I'm fine.\"<br>\r\nAlan took another deep breath. \"Okay, well, I guess I'll head back to my dorm.\"<br>\r\n\"Wait, Alan,\" Alice stopped his tracks. \"I was thinking about taking a morning jog in a little bit. Want to come along with me? I can always use the company.\" Alan streched a smile at the thought. \"Yeah, that sounds cool!.\"<br>\r\n\"Great! Just let me get changed.\"<br>\r\n\"Should I get changed too?\"<br>\r\nAlice looked at Alan's rippling chest once more blushing. \"No, you look fine for a jog.<br>\r\n<br>\r\nAfter Alan's waiting for five to ten minutes, Alice walked out wearing a sports bra, sport shorts, and sneakers. Despite Alice's clothing being very casual, Alan thought she looked better than ever. \"Shall we go?\" asked Alice. Alan nodded and flexed his arms playfully to her. \"Yep. Let's go.<br>\r\n<br>\r\nIt wasn't that far away, but they were both currently jogging on route around the campus and into a few neighborhoods nearby. Alan felt kind of odd, not in a bad way, but it seems even after half-an-hour of running, he was just breaking a little sweat. Heck, he wasn't tired at all! Guess he never took good enough notice of his growing body until now, even after their unexpected encounter. Boy, wouldn't want to bring something like that up. \"Hey Alan, wait!\"<br>\r\n<br>\r\nAlan takes a look back, \"Oh, what's up?\" The next thing he knew, Alice was practically a fourth of a mile away from him, \"Holy cow!\" They both were at a stop, Alice with her hands on her knees as she tries to catch her breath. \"Heh, sorry. Never really noticed how much faster I had gotten.\"<br>\r\n<br>\r\nAlice takes a couple more breaths, and then, \"Are you kidding? That's incredible! You should have seen yourself. It was like you were running at a high rate of speed without even breaking a sweat!\"<br>\r\n<br>\r\n\"Eh-heh... Was it, really that impressive?\", Alan asked unsurely.<br>\r\n<br>\r\n\"Okay, I guess I'm just exaggerating a bit.\", Alice blushes. \"Well, you wanna head back to school?\" Alice was about to walk off, but then she notices Alan looking back and forth. \"What's up?\"<br>\r\n<br>\r\n\"Oh nothin'.\", Alan answered. \"No one's around so...\", Alan raises an arm up, making the wolfess's eyes grow wide as he flexes it a bit for her, \"...How 'bout a quick little show?\"<br>\r\n<br>\r\nWith no shirt to wear, Alan's strength had no limit. He raised his arms to his shoulders and tense them as hard as he could making them swell and throb with power under his fur. He then pushed downwards to make his abs and chest more defined. Alice could have sworn she saw another row of abs form from that flext. Alan then turned around, raised his arms above his head and tensed his legs showing the strength that made him run like an olympic athlete. His back was also showing great definition. Alice had mixed emotions wathcing the show. She enjoyed while trying to contain her blushing.<br>\r\n<br>\r\nAlan took a slight bow as a sign he was done. \"Thank you,\" said Alan. \"You were a lovely audience.\" Alice ran up to him to kiss him on the muzzle. \"You were a lovely show!\" Alan blushed and came up with another idea to charm her even more. Alan scooped Alice up with her head resting in his pecs. \"What are you doing?\" asked Alice. Alan winked. \"Taking you home.\" Alan began running at the same lightning speeds like before. The two wolves felt the thrill of wind in their face and the joy of being together. </span></div></div>",
            "created":1368162000,
            "id":1587783,
            "title":"Run and Play"
        },
        "1111312111121":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "Hang out in the cafeteria.",
                "Hang out someplace else."
            ],
            "content":"<div class=\"\"><div> <span>Alan put down Alice right in front of her dorm room. She still felt exhillerated after such an exciting morning and Alan still had a smile on his muzzle. \"Thanks,\" said Alice, \"That was...really awesome!\" Alan shrugged his moutainous shoulders. \"Thanks. This was fun. I'll see you soon.\" Alice gave Alan another kiss on his muzzle. \"Looking forward to it.\"<br>\r\n<br>\r\nAlan decided to head back to his dorm to find a shirt to wear. Although he loved his scultped chest, he figured he needed to find a shirt so people wouldn't stare as much. He scurried through the plastic bag of clothes Alice gave him and found a decent red T-shirt. Alan put it on and loved how it felt on him, tight but not too tight. He looked at a nearby mirror and saw the shirt hugged his body very well. It showed the slenderness of his waist while emphasizing his powerful pecs. Alan then raised his arms to see the sleeves of his shirt filled out his biceps and triceps very well. The sleeves were stretched but not as if they were going to tear at any moment. Alan felt fantastic in his new shirt and it was time for him to show off to the rest of the world. Alan headed out of his room, class didn't start for another 20 minutes, but he wanted to take a walk around campus and see how many people noticed his new body. It was still pretty warm when he left the dorms, there weren't many people out and around near the dorms, so Alan decided to head down towards the classrooms. he began at a normal walk, enjoying the warmth, around him the few people that were out turned to look at him, most didn't recognize Alan which wasn't very surprising. He got more than his fair share of oogling from several females he passed, but he didn't really pay them any mind, he already had a very sweet girl for a girlfriend.<br>\r\n<br>\r\nIn the main classrooms area, the student traffic picked up considerably, and more people stopped to stare at the very muscular wolf. Alan couldn't help but blush with pride as people admiried his body. His first was gym, which before would have filled him with dread because of how scrawny he'd been, but with his new body? he wondered what exactly he could do with this new strength. The gym wasn't exactly fancy, it had all the necessities, some weight lifting equipment, sports gear, and a small track that ringed the football field out behind the building. Alan stopped to look at the weight lifting equipment, and he wanted to try it out and see just how much he culd push his body.<br>\r\n<br>\r\nThe first thing Alan thought about picking up were the dumbbells, which were sitting together on a rack. The room wasn't no gym, but it has a good selection of different weights. The first Alan picks up was a 35-pound weight, and boy did it feel light! Before he grew, he was barely even able to lift this up, or do 5-10 reps at one time. \"That's not much of a surprise.\" He sets the weight back down, and then goes straight to the 50-pounder. It added a little more stress to Alan's arm, but t'weren't no problem at all. \"Hmm... Good, but, not good enough.\" The next weight beside it was a 75-pound one. As soon as the big wolf picks it up, he nearly drops it, \"Whoa!\" He smirks, \"This seems just right.\"<br>\r\n<br>\r\nJust for fun, Alan grabbed the other 75-pound weight and starts doing arm lifts one arm at a time. It was starting to feel really good. It's almost like what he did last night with that tree, and before he knew it, he just finished a set of 30. \"Incredible...\" He puts the dumbbells back on its rack, and raises his left arm to give it a good pump. \"And I'm still not tuckered out too.\" Alan then does the same with his right arm, watching his bicep peak out thickly. While he did so, he spots a pull-up bar hanging against the wall. \"Hey now...\" Without a second thought, the excited wolf walks up to the bar. He first wipes off the sweat from his hands on his shirt, and then grabs a firm hold of the bar. As he tenses up his ripped arms, and thickens out his meaty pecs, Alan was picking himself off the ground in no time!<br>\r\n<br>\r\n\"Holy cow...!\", he murmurs to himself. He decides to do it once again, and makes it without too much strain on his body. Alan felt pretty proud, talking in his head as he just kept it up, \"I can do this all day if I wanted to!\"<br>\r\n<br>\r\nWithout noticing, someone takes a walk into the room, immediately taking notice of the pumped wolf. \"Whoa...\" Alan's sensitive ears overheard that, and immediately stopped what he was doing to turn around and see who it was. He saw a buff tiger standing in awe at Alan's physique. The tiger was about the same size and strength as Alan and even he couldn't pull on the bar with the same ease. Alan let go of the bar making the whole floor thump under his muscular weight. He then turned his attention to the tiger.<br>\r\n<br>\r\n\"Sorry,\" said Alan, \"I guess I got a little carried away.\" The tiger was still amazed at the wolf. \"Dude, you kidding? You were doing awesome! I usually call it quits after 15 reps. You were at least 50!\" Alan's ear perked up. \"Really? Heh, I guess I lost count.\" The tiger took out his paw to Alan. \"I'm Tobias, by the way, please don't call me Toby.\" Alan took his paw and responded his name. \"You were doing pretty awesome, Alan,\" said Tobias. \"Despite our similar size, it seems like you've been training for a very long time.\" Alan knew it wasn't true but he didn't want to lie to him. \"I do what I can,\" said Alan vaguely.<br>\r\n\"I can tell!\"<br>\r\n<br>\r\nAlan and Tobias began talking about workout routines, muscles, and pretty much anything else. They seemed to be very friendly towards each other. Alan never thought he'd meet a nice muscular guy like Tobias. People like him would pick on him before his growth. \"Say Alan,\" said Tobias, \"I just finished my workout for today, you wanna hang out somewhere?\"</span></div></div>",
            "created":1368326340,
            "id":1588180,
            "title":"Gym Class"
        },
        "11113121111212":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Do something else with Tobias",
                "Go check on Alice"
            ],
            "content":"<div class=\"\"><div> <span>Alan smiled. \"How about we hang out at the track? I kinda feel like going for a run.\" Tobias grinned, \"Sure! Let me get changed and I'll be set to go!\"<br>\r\n\"Cool! I'll get ready too. See you at the track!\"<br>\r\nAlan rushed back to his dorm excited about hanging out with a new friend. A friend he never thought he would ever have. He quickly put on the spandex shorts he had earlier with his jog with Alice, took off his shirt, and headed off. Alan lightly jogged to the track and got more stares than ever while on the way. With no shirt to hide his muscled chest, most girl students couldn't stop staring at him dreaming of how strong Alan must be. He liked the attention but that didn't distract his love for Alice or his meeting with his new friend, Tobias.<br>\r\n<br>\r\nAlan arrived on the tracks. Nobody was there. Alan figured he arrived before Tobias did. He didn't mind; he could wait. Alan found a spot on pewds and waited for Tobias while relaxing a bit from his jog to the track. The energetic wolf waits patiently while he sat with his body bent forward, his elbows set on his knees, and his tail wagging excitedly back and forth. As for Alan's fur, the sun was making it glisten quite well with his thick muscles all over. \"Hey, Alan!\" The big wolf's ears perk up, then turning his head to his left. He was pretty astonished at what he sees. Tobias was shirtless as well, only wearing a pair of shorts and tennis shoes. Alan stands up once T walked up to him, \"Well, I thought there's be a lot of meat under that shirt.\", he remarks.<br>\r\n<br>\r\nAlan blushes a wee bit, scratching the back of his head out of flattery, \"Heh. Thanks. Though, I guess I should be saying the same about you.\"<br>\r\n<br>\r\nTobias smirks, raising an arm in an impress bicep flex. \"Heh. Gotta stay above tip-top shape as a quarterback.\" A few girls in the background even screamed at the sight of Tobias's flexed arm.<br>\r\n<br>\r\nAlan's eyes grew wide, \"Holy cow! You're the football team's quarterback?!\"<br>\r\n<br>\r\n\"Yup!\", Tobias smiles proudly, spreading his thick chest a bit. \"What, you didn't know?\"<br>\r\n<br>\r\n\"Well, I'm not much of a sports guy.\" Infact, Alan was never a sports guy. \"I was always interested in getting bigger by working out in the gym and all.\"<br>\r\n<br>\r\n\"Ya don't say.\", the tiger remarked with an eyebrow raised. \"Hey, we gotta work out together some time.\" Alan nodded his head in agreement. \"But for now, why don't we see just how fast you are.\" Alan can tell the tiger was speaking to him as if it were a challenge.<br>\r\n<br>\r\nAlan stepped off his spot and headed to the starting line of the track with Tobias. They both stopped side by side and squatted to make their marks. \"On the count of three.\" Alan concentrated and breathed as slowly as he could. His breaths quickened as Tobias counted. \"One, two, THREE!\" The muscle men ran as fast as they could. Alan was pretty fast but Tobias was as well. Alan pressed his feet against the ground as hard as he could. He even closed his eyes to focus all his strength in his legs. Tobias still kept a steady pace with his new friend and tried to be even faster than he ever ran before.<br>\r\n<br>\r\nAfter what seemed forever for the both of them, Alan and Tobias crossed the finish line and collasped in the grass after slowing down. They were both gasping for air. \"Who...Who won?\" asked Alan. \"I...I don't know,\" huffed Tobias. \"You're pretty fast!\"<br>\r\n\"You too!\"<br>\r\n\"Wanna call this a tie?\"<br>\r\n\"Yeah, I can live with that!\"</span></div></div>",
            "created":1368331680,
            "id":1588228,
            "title":"Track Race"
        },
        "111131211112121":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "\"Sure!\"",
                "\"Mmm...no thanks.\""
            ],
            "content":"<div class=\"\"><div> <span>Alan and Tobias were still huffing air from their run. Alan placed his paw against his giant chest to feel his heart pumping blood wildly to support his godlike body. He then reached to his abs feeling hunger pains. \"That was a pretty good warm up!\" gasped Tobias while standing. \"You up for a bit more?\" Alan nodded his muzzle. \"I think I'm getting hungry actually. Want to get something to eat?\" Tobias was still pumped from his run that he forgot the fact that he was hungry himself. The muscle tiger chuckled. \"Yeah, let's do it. It's not a good idea to workout on an empty stomach.\" Alan grabbed his friend's shoulder. \"Let's go get something at the cafeteria.\"<br>\r\n <br>\r\nStill in their work out clothes, Alan and Tobias walked into the cafeteria feeling like they could both chuck down a truck load of food. As they made their way, Alan noticed more stares from students regarding his muscles, Tobias as well. They both enjoyed getting some attention after working so hard for the bodies they wanted. Tobias held the door to the cafeteria open for Alan \"after you.\"  Alan smiled walking in \"Thanks!\" As Alan and Tobias walked through the cafeteria, they got quite their shareof stares, many looks of admiration, others of curiosity seeing Tobias with the \"new student\". Alan grinned, the urge to show off echoed in his mind, but his stomach growled louder and he decided there was plenty of time to pose later. Alan turned to Tobias \"anything you want to get in particular? I am starving so I could eat anything\" Tobias smiled \"I was thinking a nice big breakfast, Eggs, bacon, maybe some toast or some bagels and milk or juice? Gotta keep our bodies strong and full.\" Alan nodded \"That sounds great!\" Together Alan and Tobias moved into the line, stacking a plate each with multiple egss, several pieces of bacon, a couple pieces of toast for Tobias and Alan grabbed a nice toasted bagel with everything on it and some Orange juice for each of them.<br>\r\n <br>\r\nAlan and Tobias found a table to place their mountains of food. When they sat down, they didn't hesitate to start eating. Between mouthfulls, Tobias began talking to Alan. \"You really did a great job on that run! And not bad on those weights either! How long have you been training?\" Alan paused just when he was about to finish his third egg. Alan stuttered and continued eating to avoid suspicion. \"Um, well,\" Alan didn't want to lie about his growth but what would Tobias think if he told him the truth? Alan was stuck until a voice shouted to his direction.<br>\r\n <br>\r\n\"Tobias!\" Alan and Tobias turned to see a young muscular panther walking their way carrying the same amount of food they started with. \"Tony!\" exclaimed Tobias. \"Come on over here and meet my new bud!\" Tony took a seat between Tobias and Alan. \"This is Alan,\" said Tobias pointing to the muscle wolf. \"We met at the school gym today. You should have seen him! He lifted giant weights as if they were nothing and tied me on a track race!\" Tony perked his ears with intrigue. \"Really?\" asked Tony. \"That's pretty cool! Not that many people beat Tobias in a race!\" Alan blushed. \"Well, I just work out as much as I can.\"<br>\r\n <br>\r\nAlan didn't to go back to Tobias's question, so he started a new conversation with Tony. \"How do you stay in shape, Tony?\" Tony took a piece of bacon to his mouth. \"I'm part of the school's baseball team. I bat clean-up so I need to stay in tip-top shape.\" Tobias chuckled and said, \"He's a powerhouse with a bat! I'm not kidding! He hardly ever gets striked out!\" Alan had heard about their school's star player, but he'd never seen him before. \"That's amazing!\" Tony laughed \"Amazing? I just have good reflexes, which anyone can earn with hard work and lots of practice.\" Alan nodded, though he believed Tony was more talented than he was admitting to, but it was nice to see populairty didn't spoil his attitude or friendlyness. Tobias clamped his hand on Tony's shoulder. \"So what are you up to today?\" Tony smiled sitting down. \"Just going to have some breakfast before i start working out, gotta practice for the upcoming game.\" Tobias nodded \"Sounds like fun,mind if i tag along?\" Tony shook his head \"Not at all\" he looked at Alan \"What about you? feel like coming along?\"</span></div></div>",
            "created":1370016240,
            "id":1600674,
            "title":"Do something else with Tobias"
        },
        "111132":{
            "author_id":"bygameboy",
            "author_name":"bygameboy",
            "choices":[
                "show Alice",
                "try these babies out"
            ],
            "content":"<div class=\"\"><div> <span>as Alan slept, he didn't realize what was happening. the full moon shone down upon him and worked its magic. his buff wolf body was growing bigger. his muscles enlarged and rippled across his body. he grew maybe an inch or 2, but nearly doubled in muscle mass. the next morning he woke up and felt so much better then he did yesterday. he looked at himself and gasped to see himself even bigger. he poked himself to see if it was a dream and it was. A dream come true! he ran to his mirror and saw his shoulders had broadened to support his new chest, and arms. his legs were thicker and were a little tight on his boxers. \"this is a amazing! I gotta get dressed and\"</span></div></div>",
            "created":1428960780,
            "id":1963673,
            "title":"Something comes up"
        },
        "112":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Find a gym and lift some more!",
                "Go clothes shopping and avoid suspicion.",
                "Get ready for school tomorrow."
            ],
            "content":"<div class=\"\"><div> <span>Alan suddenly remembers something. Once, he tried to make himself look better by getting some barbels a few months ago. He was planning on bulking up, even just a little bit so someone would at least notice him. But, his former skinny frame refused to lift anything heavy, so he gave up on it. He hurriedly made his way back to the dorm, carefully making sure no one sees him wearing mostly-torn clothing. As he closes the door and locks it, he opens his closet and digs up his old barbels. He slowly lifts them up, only to be surprised by how light they are! He looks for the heavier weights and attaches it to the handlebar. Still too easy! He gets the heaviest weight in his closet, attaches it, and lifts it over his head with ease! Alan was very excited about it. To lift something this heavy, and not even break a sweat! He was dying to find something even heavier to lift, but it's a school day tomorrow. Plus, he needs to buy bigger clothes for his bigger body. He sits down on his bed and starts thinking about what to do next.</span></div></div>",
            "created":1309150800,
            "id":1135440,
            "title":"Now That's Power..."
        },
        "1122":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Go to the gym",
                "Flirt with a girl",
                "Go to class"
            ],
            "content":"<div class=\"\"><div> <span>Alan took this sudden change as a new beginning for his life. People would now see him as a muscular guy rather than a scrawny guy. He thought the first step of his new life should be to get some new clothes. Although he was wearing torn jeans and no shirt, Alan headed to the clothes store. As Alan walked through the doors of the store, he got a few stares regarding his muscles. Alan was normally a shy person, but he liked the attention he was getting. He thought he could get use to it.<br>\r\n<br>\r\nAlan started off with gym clothes. He thought it would be a good idea to go to the gym and see what his muscles could really do. He got a few tank tops and some spandex shorts. He then went to the casual clothes starting with t-shirts. He picked some thin shirts hoping they would show off his chest through them. After picking a few more things, Alan went into the dressing room. The moment he put on a shirt, he loved how they defined his muscles and how tight they felt on him. He flexed a little bit and the results were even better. The sleeves looked like they were going to explode from your arms and he could see some veins pushing against them. He smirked thinking they would do fine. Alan liked everything else he liked, so he bought all of his pickings and went back home.<br>\r\n<br>\r\nAlan closed the door to his room feeling refreshed. \"Everyone will now see the new and improved me!\" he thought to himself. He walked up to his mirror and performed a flexing session. Alan loved each posed he made and knew everyone else will too. Before too long, he decided to go bed. Alan got into his boxers and jumped on to his bed. At first, he had trouble sleeping because he was fantasizing about tomorrow but after a half hour he drifted to sleep. </span></div></div>",
            "created":1343451600,
            "id":1391796,
            "title":"Go clothes shopping and avoid suspicion."
        },
        "11222":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Alan fights under the full moon",
                "Alan backs off"
            ],
            "content":"<div class=\"\"><div> <span>Alan headed to school with a new outlook and attitude. Things were going to be different from now on. He could feel it. He came to campus in jeans and a recently torn long sleeved shirt. Alan loved his new look and so did everyone else on campus. Everyone turned and stared at Alan, thinking how muscular he looked and where he came from. Alan glanced at some girls who were shyly staring at his rippled arms. Alan gave a slight flex following some girlish giggling. There would be some time for that later; right now, it was time for class.<br>\r\n<br>\r\nDuring Alan's classes, nobody could take their eyes off of him, even the teachers. Who was this new and big student. It wouldn't matter if Alan gave his name because nobody paid attention to him. Alan went through classes full of pride. As he was walking down the hall, Alan noticed a girl in peril: a tigress pulling at a stubborn locker. He couldn't help but look at the tigress's beauty. Before, he wouldn't have a chance with her. Let's see about that. Alan strolled to the girl. \"Do you need some help?\" he said in a deep voice developed from the change. The tigress turned to see a lean yet very strong wolf. She always had a thing for muscle men. \"Uh, yeah, my locker won't open even though I gave it the combination.\" Alan puffed his arms slightly. \"Let me give it a try.\" The tigress stepped out of the way to make room for Alan. Alan gripped the locker handle and gave a slight tug. It didn't budge. He tugged it a little harder and it still wouldn't move. A little annoyed, Alan pulled at the locker full strength; he ripped it right off its hinges! The tigress was amazed! The locker door now looked like a crooked and dented sheet of metal. She was stunned how it looked and how Alan looked while pulling it. His arm plumped and she could have sworn she saw a vein pop up on his bicep. She got her things and said to Alan, \"Thanks for the show! That was cool! Come meet meet in front of this building tonight.\" Alan fist pumped to himself as the tigress walked away. Yep, things were going to be different.<br>\r\n<br>\r\nAlan found the tigress sitting on a bench next to a school building, above a glowing lamp post. He smiled at her and she offered him a spot. \"Didn't think you'd show up.\" said the tigress. \"And miss a pretty girl like you? No way!\" said Alan. The tigress giggled and introduced herself as Teresa. \"So Alan, you new around here.\" Alan didn't want to lie to her, so he came up with a technicality. \"I guess you can say that,\" responded Alan, regarding the \"new Alan\", \"I've been busy building myself up so I can be ready meeting new and cute faces.\" Teresa knew he was trying to get to her, not that she didn't like it. She looked at Alan's chest and arms, imagining how much power they must hold. \"So, how strong are you?\" Teresa asked. Alan wasn't sure but he didn't want to lie to her. Then, it hit him. \"This strong!\" Alan rose up and posed flexing his arms downward and puffing his chest to more definition. Teresa almost couldn't contain herself. It was a sight to behold. Alan smirked to her. \"You wanna feel?\" Without answering, Teresa jumped up to grasp Alan's strength. She started with his arms. They were raw and powerful. She could feel his blood and adrenaline feeding them. She then stroked his chest. With his shirt still on, Alan loved how Teresa petted his pecs to his abs. The warmth from her hands actually chilled his spine. Teresa stopped. \"With a little more work, you could be the strongest guy around.\" She teased.<br>\r\n<br>\r\n\"Teresa!\" A voice made Teresa jump away from Alan. The glow of the lamp post shined a giant and muscular tiger. He was a least a foot taller than Alan and stronger than him. \"Mark!\" exclaimed Teresa, \"What are you doing here?\" \"You were acting strange so I wanted to check on you, only to find you meeting another guy!\" Alan turned to Teresa and said, \"This is your boyfriend?\" Teresa nodded anxiously as Mark got closer to her. \"When I'm done with you, you're gonna..\" Alan stopped in front of the hulking tiger, right in front of Teresa. \"Get out of my way, punk!\" yelled Mark.</span></div></div>",
            "created":1347858000,
            "id":1429883,
            "title":"Flirt with a girl"
        },
        "112221":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Teresa stays",
                "Teresa runs away"
            ],
            "content":"<div class=\"\"><div> <span>\"You don't talk to anyone like that,\" said Hunter, \"especially her.\" Mark punched Alan in the face and knocked him to the ground. \"I'll talk anyway I want to anyone!\" Mark yelled. \"And I'm saying Teresa needs to know better!\" He then kicked Alan to the side, making Alan wince at more pain. Mark stepped over him and walked towards Teresa. Teresa was shaking and crying in fear. \"Please, stop, Mark.\" She pleaded. \"I'm not doing anything!\" Mark yelled to her. \"You're the one who did something wrong!\" Mark grabbed her wrist and smacked her cheek.<br>\r\n<br>\r\nAlan rolled onto his back to look at the sky dazedly. He then caught a glimpse of the moon. It attracted him like the last time and the pain he was already stretched all over his body. Alan howled in pain as he tried to get up. Mark and Teresa turned to Alan's direction to see Alan changing. Alan shirt grew tighter, revealing the outlines on his growing chest and abs. Along with his torso, Alan's arms were swelling massively; the short sleeves of his shirt were tearing as his shoulders shifted into boulders. Alan's legs then plumped into knotted tree trunks; they looked like Alan could run on them tirelessly for a long time. Alan could also feel his nails and teeth growing sharp as he clenched the both of them.<br>\r\n<br>\r\nAlan screamed as he transformed. Mark and Teresa had no idea what was happening to him. They both got really scared as Alan's growing muscles pushed Alan's shirt off of his body. Alan's jeans were still hanging on, but barely while showing great definition. All of sudden, the pain stopped. Alan was standing tall and strong. He too was surprised by the change. He flexed an arm and squeezed a bicep. It was tougher than before. In fact, Alan felt stronger than before. He turned to Mark and Teresa and saw the red spot on Teresa's face where Mark hit her. Alan growled loudly to Mark.<br>\r\n<br>\r\n\"You're going to wish you never did that!\" yelled Alan in a deeper voice. Mark, now scared, stood his ground. \"Yeah?\" he said, \"Well, you're going to wish you were never born!\" Mark ran to Alan with a tight fist and punch him in the same place before; Alan didn't flinch. He kept the same angry look and grabbed Mark by the neck, picking him off the ground. Mark was terrified to death. He was always the big guy and nobody ever messed with him, until now. \"Listen!\" Alan screamed in Mark's face. \"You are going to leave Teresa alone! If I see that you hurt her, you are going to wake up in a hospital bed! Got it?!\" Mark didn't say a word; he just nodded agreeing with Alan. Alan threw Mark to the side and Mark ran off in tears.<br>\r\n<br>\r\nAs Mark disappeared, Alan calmed down and turned to Teresa, who was absolutely terrified of what just happened. \"I'm so sorry.\" Alan told her. \"I promise I'm not going to hurt you.\"  </span></div></div>",
            "created":1349845200,
            "id":1444316,
            "title":"Alan fights under the full moon"
        },
        "1122211":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Alan agrees.",
                "Alan feels uncertain."
            ],
            "content":"<div class=\"\"><div> <span>\"A-Alan? What h-happened to you?\" Teresa asked.<br>\r\n<br>\r\n\"Didn't you see? I grew.\" he replied.<br>\r\n<br>\r\n\"B-but, but how?\"<br>\r\n<br>\r\n\"I...I dunno, but I think it has something to do with the full moon.\"<br>\r\n<br>\r\nTeresa looked up at the sky, then back at Alan. She slowly approached him and touched his arms. They were quite a bit thicker than last time. Not only that, but Alan even grew in height as well.<br>\r\n<br>\r\n\"I'm sorry for scaring you. I'd understand if you want to go.\" Alan said.<br>\r\n<br>\r\nTeresa squeezed his arms, then felt his chest and abs.<br>\r\n<br>\r\n\"No, I think I'll stay here. You helped me when that brute Mark slapped me in the face. Thank you.\"<br>\r\n<br>\r\nTeresa wrapped her arms around the muscle wolf, taking him aback a little. Slowly, he wrapped his arms around her.<br>\r\n<br>\r\n\"And thank you for understanding.\"<br>\r\n<br>\r\nWhen they broke, they sat back down on the bench, the lamppost glowing it's light on them. Alan had already began explaining his life before he first grew. Teresa was still amazed when Alan finished his story, especially about the effects of the full moon on him.<br>\r\n<br>\r\n\"So, you grow when you see the full moon?\" she asked.<br>\r\n<br>\r\n\"Yeah. I don't know how, but that's how I got that big when you first met me at your locker.\"<br>\r\n<br>\r\n\"But...Is it only temporary? Or are you going to stay at that size?\"<br>\r\n<br>\r\nAlan flexed a bicep when he responded, \"Do you think so?\"<br>\r\n<br>\r\nTeresa smiled as she replied, \"Well, I sure hope not.\"<br>\r\n<br>\r\nAs the two chatted for a little more, Alan suddenly remembered something. He looked at the spot where he grew, seeing the tattered remains of his shirt. He placed a paw on his face as Teresa looked at him worriedly.<br>\r\n<br>\r\n\"What's wrong? Is something the matter?\"<br>\r\n<br>\r\n\"Yeah! I grew! That means I have to buy bigger clothes again! Oh man, I might have to start working a part time job if this happens every time.\"<br>\r\n<br>\r\n\"Don't worry! I'm sure the store is still open, we can head there now!\"<br>\r\n<br>\r\nAlan looked up at Teresa, smiling at him. \"W-what?\"<br>\r\n<br>\r\n\"We can pick out some new clothes for you, and I'll pay! Consider it my thank you for saving me.\"<br>\r\n----------<br>\r\nLater, the two were already at the changing rooms, with Alan trying on different sets of clothes. Teresa had picked out a large number of them, even though they agreed to only buy a few. Alan stepped out of the changing room, only to see Teresa shake her head. Alan had to return to the room and come out with a completely different set of clothes, only with the same result. This went on for a few more times until Teresa finally nodded his head and gave Alan a hug, which he happily returned. Alan now wore a green sleeveless shirt and grey camo print parachute pants, along with a dog tag Teresa hand picked on the side. At the counter, Teresa was already counting the money in her hand when Alan spoke up.<br>\r\n<br>\r\n\"You know, I could still help out with paying for all these.\" he whispered.<br>\r\n<br>\r\n\"No, I already told you. I'm paying for them as a thank you, so don't worry about it.\"<br>\r\n<br>\r\nWhen the clothes were all payed and bagged, the cashier made a remark, \"So, are you two boyfriend and girlfriend or something?\"<br>\r\n<br>\r\nAlan was about to respond when Teresa quickly said yes. \"Yup! We sure are!\"<br>\r\n<br>\r\n\"I see. Thank you for shopping, come back soon!\"<br>\r\n<br>\r\nThe two got a number of looks from other shoppers, mostly for Alan, as they made their way back.<br>\r\n<br>\r\n\"Hey, why'd you tell that cashier that we're boyfriend and girlfriend?\" Alan asked.<br>\r\n<br>\r\n\"Why? You don't want to?\" Teresa answered, pouting her face cutely at him.<br>\r\n<br>\r\n\"Ngh...No, that's not it. I mean, sure I'd like to have a girlfriend, but...Isn't that taking it a little fast?\"<br>\r\n<br>\r\n\"Hmm...Alright then, how about a date this weekend? You, me, and the movies. Unless you still think that's taking it too fast.\"<br>\r\n<br>\r\n\"Er, well...\"</span></div></div>",
            "created":1352264400,
            "id":1462663,
            "title":"An Explanation"
        },
        "11222111":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Perform feats of strength",
                "The full moon show up"
            ],
            "content":"<div class=\"\"><div> <span>Alan felt uncomfortable with Teresa's rushing, but she was so cute and grateful to him. How could he refuse. Alan shrugged a shoulder. \"Ok, that sounds cool.\" Teresa jumped with excitement. \"Great!\" she said. \"I'll see you then.\" Teresa walked into the darkness after pecking Alan on the cheek. \"Maybe this won't be so bad.\" Alan thought to himself. He walked back into his dorm ready for bed. As he was changing his clothes, Alan looked at his bare and rippled chest. He flexed them, making them swell and thick. \"I can get use to this.\" Alan told himself and went straight for bed.<br>\r\n<br>\r\nThe weekend came almost instantly to Alan. He found himself in front of the theater and Teresa waving at him in line. He walked to her spot. Nobody dared confronting him about cutting in line due to his size. \"I'm so glad you could make it!\" Teresa told Alan. \"Glad to be here.\" Alan responded. They got their tickets and went inside. Teresa found seats for the both of them in an action movie showing. Alan's seat was a bit uncomfortable for him. His giant torso and leg muscles bumped the corners of his seat but Alan didn't mind as long as Teresa sat next to her. Alan and Teresa enjoyed the movie and each other's company. Teresa even laid her head on Alan's massive bicep as if it was a firm yet soft pillow.<br>\r\n<br>\r\nAlan walks out of the theater with Teresa still hugging his arm. \"That movie was pretty good.\" said Alan. \"Yeah,\" replied Teresa, \"I really liked the hero. He kinda reminded me of you.\" Alan blushed. \"What makes you say that?\" \"Well, the hero was brave, strong, and handsome.\" Alan knew what Teresa implied. Alan commented, \"The girl was a nice touch too. She was beautiful, funny, and friendly.\" Alan and Teresa stopped hinting at each other and kissed. They both felt sparks that shook from spines to their legs. It was obvious what came next. \"You want to be boyfriend and girlfriend?\" asked Teresa. \"You bet I do!\" Alan scooped Teresa up to his chest. His heart was beating fast from his love for Teresa but she found it soothing while close to his cozy and muscly chest.<br>\r\n<br>\r\nAlan carried Teresa all the way home until she asked, \"How strong are you?\" Alan shrugged. \"I don't know. I never tried.\" Teresa looked up to him with a smile and eyes full of desire. \"Could you show me?\" How could Alan say no?</span></div></div>",
            "created":1352523600,
            "id":1464727,
            "title":"Alan agrees."
        },
        "112221111":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "Alan was starting to grow some more.",
                "Alan might have reached his limit."
            ],
            "content":"<div class=\"\"><div> <span>Alan smiles back at Teresa, \"Sure. Why not?\" Alan looks away, \"Question is, where should we go?\"<br>\r\n<br>\r\nTeresa began thinking to herself, \"Hmm... How about the gym? I'm sure there's a gym that's open late around here.\"<br>\r\n<br>\r\n\"Ehhh, too traditional.\", Alan replied. \"I'd rather go someplace with no one around.\" Alan sets Teresa down, who looked back at him with a rather confused look. Alan turns his body back as he spread out his legs and raised up his arms, flexing all the muscles in his arms, legs, and back, which was an impressive show. Alan held his pose while Teresa watched, \"And so that <i>you</i> would be the only person watching.\"<br>\r\n<br>\r\nA sound yell, \"Wow!!\"<br>\r\n<br>\r\n\"See what I mean?\", Alan replied. Later, Alan and Teresa were walking through downtown. Alan scouted around for an area to find a decent strength testing location. Teresa was also doing the same. It was pretty late so there weren't many people around. Upon scouting some more, Alan held a hand in front of Teresa to stop. \"Ah! There!\"<br>\r\n<br>\r\nTeresa stared at the spot Alan was pointing at for a moment. \"But...Alan, this is a construction site.\"<br>\r\n<br>\r\nAlan said as he picked Teresa up again, \"Exactly.\" The site was gated, but that wasn't gonna be a problem for Alan, who immediately leaped right up and over the fence. He set Teresa back down and started making his way towards building under construction. \"Come on.\"<br>\r\n<br>\r\n\"Alan, I don't think we should be here.\", Teresa said worriedly.<br>\r\n<br>\r\nAlan picked a large metal rod. \"Don't worry. I'll leave everything back the way it is.\" Alan tenses up his arms and chest muscles. Teresa watches as you used your powerful muscles to begin bending the rod into a perfect 90-degrees. Alan holds up the bent metal, \"I think they'll need a piece like this anyway.\"<br>\r\n<br>\r\n\"Wow...\" Alan looked over to Teresa, who was really impressed with what he did. \"That was amazing!\"<br>\r\n<br>\r\n\"Oh.\" Alan flexed his right bicep for her, \"Heh. I try.\" Before doing another pose, Alan quickly slipped his shirt off and tossed it to Teresa. \"Wouldn't want to ruin one of the few shirts you bought for me.\" Alan turned around and raised his arms up to do a back double-bicep pose, his arms and back looking shredded with all that muscle he packed on. \"How do I look?\"<br>\r\n<br>\r\nTeresa held Alan's shirt in her hands, \"You look fantastic.\"<br>\r\n<br>\r\nAlan grinned back at her, and then noticed a bulldozer a couple feet in front of him. Alan got another idea. \"Hey, I'm gonna go and lift this bulldozer right up.\"<br>\r\n<br>\r\n\"! What!?\", Teresa yelled out. Alan walked up to the front of it. \"... Okay, just, be careful.\"<br>\r\n<br>\r\nAlan slapped his hands together and began rubbing them, \"Heh. You know me.\" Alan reached right underneath the entire the front of the bulldozer, and then started to pick it up with all his might. His arm muscles tensed, harder and harder, until they flexed right out enormously. His chest and back were also starting to do the same, pumping up and rising. Teresa watched with her mouth agape a bit as the large and muscular creature standing in front of her swelled up with immense muscles mass just to pick that thing up from the front. The bulldozer was slowly being lifted up higher and higher, \"Nnnnnnaugh!!\"<br>\r\n<br>\r\nTeresa's eyes widened at the sight of it, \"Wow! You did it!\"<br>\r\n<br>\r\n\"I'm not done yet!\", Alan replied. Once the bulldozer was lifted high enough from the front, Alan quickly reaches in underneath, until he was able to get his entire body underneath the large piece of metal with wheels. Alan pants for a bit. He looked up at Teresa, who was feeling worried. He then smiled back at her. \"Heh. Just catchin' my breathe.\" Alan starts flexing his muscles again, as well as his legs. He starts by tensing his leg muscles, a lot, enough to cause a lot of indentations to appear on his pants, but not enough to rip them. He finishes off by flexing all of his upper body muscles as much as he could, until finally... \"RRRAUGH!!\"<br>\r\n<br>\r\nTeresa was nearly at a loss for words, \"My goodness...\"<br>\r\n<br>\r\nAlan had managed to lift the bulldozer 10 feet off the ground, which was about his standing height. Alan smiled back at her. \"Gack!\" Suddenly, Alan appeared to be in pain.<br>\r\n<br>\r\n\"Alan!\", Teresa screamed out.</span></div></div>",
            "created":1352869200,
            "id":1467854,
            "title":"Construction Site Fun"
        },
        "1122211112":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "The next day",
                "The next full moon"
            ],
            "content":"<div class=\"\"><div> <span>The bulldozer looked like it was going to flatten the painful Alan. Except it crashed to its side behind him. Alan fell to his hands and knees still wincing in pain. Teresa ran to him. \"Alan, are you okay?\" she asked worriedly. \"Yeah,\" answered Alan puffing breaths. \"I guess I overdid it.\" \"Where does it hurt?\" said Teresa. \"My back. Ow, my back!\" Alan wanted to put his hands on his back, but his arms were too exhausted from the lift and the pain was too crucial. <br>\r\n<br>\r\n\"Here, let me help you.\" Teresa walked around Alan and put her hands on his mighty back. At first, she was transfixed by Alan's back muscles as they rippled and and flexed underneath her hands. She had to feel more. Teresa began rubbing Alan's back, stroking and relaxing every back muscle she could find. Alan calmed down as the pain and tensity disappeared. It was as if every one of Teresa's strokes and pinches erased his being hurt. Alan was feeling a lot better. As Teresa continued massaging him, Alan tensed his back making it double in size. Teresa stopped out of surprise but loved the sight of Alan's back strength returning. \"Feeling better?\" asked Teresa. Alan got up instantly. \"Much better!\" he told her. \"Thank you so much!\" Alan showed his appreciation by pressing his arms downward and his chest outward. Teresa enjoyed seeing Alan better and his arms and chest large.<br>\r\n<br>\r\nTeresa and Alan decided to walk home holding hands. Teresa still had Alan's shirt in her other hand. \"I guess I need to wait for the next full moon to try something like that,\" said Alan. \"You still did great!\" commented Teresa. \"I've never met anyone who would've thought of lifting a bulldozer!\" \"Thanks.\" said Alan blushing. Alan began to appreciate Teresa deeply. He never had a girlfriend or anyone who was nice to him. He still wasn't sure if this relationship would last, but Alan was going to embrace every minute.<br>\r\n<br>\r\nAlan and Teresa stopped in front of an apartment building. \"This is me.\" said Teresa. \"I had a great time, Alan. Thanks.\" \"Me too.\" replied Alan. \"Here's your shirt back.\" said Teresa holding Alan's shirt in front of him. \"Keep it.\" Alan told her. \"Think of it as a souvenir. Besides, do you really want me to have it back now?\" Teresa blushed in front of the wolf titan's amazing body. \"I guess not.\" she replied chuckling. \"Good night.\" Teresa raised herself on her toes and kissed Alan on the cheek. \"Good night.\" Alan said simply. As soon as Teresa closed the door behind her, Alan pumped his arms praising himself. He just went on a date with a hot girl! Alan looked up at the waning crescent moon and noticed a giant truck across the street. With his powerful legs, Alan ran and jumped on top of the truck. He then howled at the moon as saying thank you to the moon. Teresa heard him from her window and smiled knowing it was Alan. </span></div></div>",
            "created":1352955600,
            "id":1468513,
            "title":"Alan might have reached his limit."
        },
        "11222111121":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "It was Teresa",
                "It was someone else"
            ],
            "content":"<div class=\"\"><div> <span>The next morning, Alan was asleep in his room. The only thing he really had on were the pants that he wore last night. The bed covers were wrapped around his left thigh, his right calf, and around his abdomen. \"Huh?\" Alan wakes up. He lets out a long yawn, stretching out his lengthy and rippling arms as he did. He looks down at his blankets, noticing it was slightly wrapped around said muscle parts on his body. He was merely going to slip it off, but then, he got a fun idea in his head that made him smile.<br>\r\n<br>\r\nHe sits up on his bed, and then grabs both ends of his blanket, tightening them so they would be so easy to slip off of his mucular body. He then stretches and flexes his leg, his thigh and calf muscles being flexed to immense proportions. Within a couple seconds, his massive thigh rips apart the blanket that part of the blanket that was wrapped around it. He then flexes his right calf, the blanket being torn to shreds as well. As for the blanket that was left around his abdomen, he sets his hands on his hips, perfoming a lat spread that REALLY stretched out his pecs and lats. His abs also swelled out underneath his moutainous chest, stretching the fabric until it could no longer bear the strength being released from the muscular wolf and shreds to pieces. <br>\r\n<br>\r\nAll that was left were the remnants of your old blanket all over the bed. \"Wow... seven o'clock in the morning and already I'm pumped up!\"<br>\r\n<br>\r\nYou let out a fairly loud howl, even though it was morning time. Suddenly, \"Hey! Keep it down in there!\"<br>\r\n<br>\r\n\"Sorry.\", you say lightly. Later, you headed out of your room in said pants and wearing another shirt that Teresa bought for you. You headed straight for the cafeteria on an empty stomach, getting numerous comments that you overheard from a couple people from campus and now the lunchroom. You just smiled, minding your own business while you got your breakfast: A banana, an orange, and egg muffin, and orange juice. You walked up to the female cashier once you were ready. You held up a hand to wave at her, \"Hi. I'm ready to pay for all this.\"<br>\r\n<br>\r\n\"Wow, that's, a pretty big meal.\", the cashier says.<br>\r\n<br>\r\nYou huffed and pounded your chest with your right hand, \"Well it's fit for a big guy.\" The cashier chuckles, and then you were taken care of in no time. You walk up to an empty table, when you suddenly hear someone greet you from behind.<br>\r\n</span></div></div>",
            "created":1353474000,
            "id":1472463,
            "title":"Pumped up Morning"
        },
        "112221111212":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Call Gerome",
                "Call Teresa"
            ],
            "content":"<div class=\"\"><div> <span>Alan turned around to see a giant and muscular polar bear. Alan recognized him. The polar bear was the school's sports star. He was quarterback of the football team, best shot in basketball, even striker in soccer. \"Hey,\" said Alan, \"I remember you. You're the quarterback that won the big game last week.\" The polar bear chuckled, puffing in well defined chest which was covered by a tank top. \"Yeah,\" said the polar bear, \"I'm Gerome.\" \"Alan.\"<br>\r\n<br>\r\nGerome sat down next to Alan. \"I've never seen a big wolf like you around here before.\" said Gerome. \"You new here?\" Alan didn't want to lie, but then again, not many people acknowledged his existance before his growth. \"Naw,\" Alan replied, \"I just don't get out much.\" \"Why not?\" asked Gerome. \"You're huge! You can get any girl or any sports team with those muscles!\" Alan just shrugged with no explanation.<br>\r\n<br>\r\nTo change the subject, Alan asked Gerome about sports. Gerome told story after story about how he single-handedly saved victories for his teams. He even flexed a bicep with swelling tendons and thick power. Alan thought that was the biggest flex he ever saw. It was slightly bigger than his own.<br>\r\n<br>\r\n\"Anyway,\" Gerome continued, \"I wanted to ask you something.\" Alan gave him his attention. \"In our last game, our best receiver broke his leg and we're going to be in trouble without him in our next game. We're having auditions for a replacement. You interested?\" Alan didn't know. He was never a big fan of sports or getting tackled by a buch of guys all at once. But Alan was bigger and stronger now. Surely he stood a better chance than before. What's the point of having muscles if he wasn't going to use them. \"Sure. Why not?\" Alan answered.<br>\r\n<br>\r\nGerome pumped his arms excitedly, showing off more muscle than before. \"Awesome!\" exclaimed Gerome. \"The auditions are this weekend and our next game is the week after. How about we have a workout before the auditions. I know we just met but I would love for you to be on the team.\" Alan didn't see why not. \"Sure! That sounds awesome!\" \"Great! Can't wait to see what you can do with those muscles! Let's workout the night before auditions!\"<br>\r\n<br>\r\nAfter breakfast, Gerome and Alan went their ways. Alan had a good day with people staring at his muscles thinking who he was. He had a smile all day until he looked at his computer. He looked at his computer calendar to mark his workout with Gerome to see that night was going to have a full moon.</span></div></div>",
            "created":1353474000,
            "id":1472478,
            "title":"It was someone else"
        },
        "1122211112121":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "Tell Gerome",
                "Don't tell Gerome"
            ],
            "content":"<div class=\"\"><div> <span>The night of Alan and Gerome's workout, also the night of the full moon, Alan gave Gerome a quick call to let him know he was on his way. Gerome said he was already at the college gym and that he'll be the only one there because of the time of night. Alan hung up the phone, but then thought about the full moon. Maybe Gerome won't notice. Maybe it'll be okay to tell Gerome about your, condition, or just show him by growing right in front of him. These things clouded your thoughts for a short time, but you already said you were on your way so it wouldn't be nice to back out now. Alan just sighs, and then walks out of his room with a gym bag he had just gotten recently being carried around his shoulder, and in a white tank-top and blue shorts.<br>\r\n<br>\r\nA few minutes later, Alan made his way into the college gym. He looked around for Gerome, but instead first heard his grunts. Gerome was standing in front of the mirror wall in a blue tank-top, yellow gym shorts, and white tennis shoes, bending his thick and powerful legs up and down as he was doing reps with a 200-pound barbell being carred on his back. Alan approached Gerome, but not so that he ended up standing right beside him. Alan just stood a few feet away and watched as Gerome continued his reps. His thighs and calves were impressive, pulsating as he just continued doing his thing. After a few more reps, Gerome sets the barbell back on the ground. Alan grinned at him, feeling proud of his workout.<br>\r\n<br>\r\nGerome walks over to his gym bag to grab a sweat towel. After wiping his sweaty forehead with the towel and sets it back down, that's when he noticed Alan. \"Alan!\"<br>\r\n<br>\r\nAlan just waved back at Gerome, \"Heya!\"<br>\r\n<br>\r\nAlan and Gerome grab each other's hand and held it to test each other's strength. \"How uh, how long have you been standing there?\", Gerome's bicep and forearm thickening with his and Alan's grasp.<br>\r\n<br>\r\nAlan's bicep was doing the same thing, only it didn't swell out as much as Gerome's did, \"Eh, long enough to see just how much you can handle.\"<br>\r\n<br>\r\nYou two then laugh as you let go. \"So, you ready to get blood flowing through your veins?\"<br>\r\n<br>\r\n\"You bet!\", Alan says flexing both his arms and stretching his chest.<br>\r\n<br>\r\nGerome points back with his thumb, \"I'll be over at the bench-pressing equipment.\"<br>\r\n<br>\r\n\"Alright.\" The first thing Alan decided to do was start pumping with the dumbbells. He walks over to the dumbbell rack and picks up two dumbbells that weighed 100-pounts. Alan immediately starts pumping his arms with them, liking the feeling of his arms being worked as he slowly raises them up and down. He looks back towards Gerome. Gerome was lying under a bench-pressing equipment, already pumping his arms and chest up and down with a 250-pound barbell. Alan was amazed by just how much this bear can handle. It's no wonder he's such a hot shot in sports teams. Alan watches as Gerome's peaking biceps raised up and down along with his reps. Alan looks down to his and watches his own biceps pump up and down. It still wasn't as impressive as Gerome's, but he didn't want to complain.<br>\r\n<br>\r\nAlan takes a look out the glass doors that were on the other entrance of the gym. His eyes shoot wide open. It was the moon. A full moon. This causes Alan to freeze from his reps, one dumbbell still up in the air. Now was the moment of truth, tell Gerome, or don't.</span></div></div>",
            "created":1353474000,
            "id":1472502,
            "title":"Night Time Workout"
        },
        "11222111121211":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "\"How strong are you?\"",
                "\"Get out of here, you freak!\""
            ],
            "content":"<div class=\"\"><div> <span>Alan figured he didn't have a lot of time left before his growth. He thought it would be fair to tell Gerome. Maybe it would ease the freakout? Alan walked to the pumping polar bear. \"Gerome,\" said Alan. Gerome was still pressing. \"Yeah, what's up?\" he asked. \"There's something I gotta tell you.\" said Alan. \"It's about my physique.\" Before he could tell his new friend. Alan felt the moonlight soaking into his muscles, making them ache.<br>\r\n<br>\r\nAlan's pain got more intense by the second. Alan knelt down moaning and dropping the dumbbell he still held. Gerome was scared for Alan. He put his weight down, and knelt to Alan's level. \"Alan, are you okay?\" Between heavy breaths, Alan told Gerome, \"Get. Back.\" A shock of pain alerted Alan that his growth was beginning.<br>\r\n<br>\r\nAlan felt blood pumping in his arms. It was as if his body had to much blood and was storing it in his arms as his muscles grew to bigger proportions. The pain then went to his chest. Gerome was surprised beyond imagination as he saw Alan's shirt appearing smaller. Alan's pecs and abs grew more defined and sculpted under shirt until his shirt couldn't hold their power any longer. Alan's flest and fur erupted from the seems, tearing the shirt into uselessness. Alan's legs were next. Alan could feel them growing longer as well as his arms when they were pumping. His thighs and calves shredded to legs that belonged to a god.<br>\r\n<br>\r\nIn an instant, the pain stopped and Alan huffed for air. Gerome's jaw dropped at the sight of Alan. Alan stood up and found himself taller than Gerome by at least a fefew inches. He saw his bare chest and rubbed them. They felt extremely hard, like diamonds! Alan then turned to his arms, now more shreded and ripped than before. He flexed an arm as hard as he could and his bicep grew to the size of a beachball, twice as large as Gerome's bicep! As he looked at his legs, Alan saw his gym shorts were still intact but they greatly defined his thighs and appeared shorter than before. He looked and felt good but Alan was scared for Gerome<br>\r\n<br>\r\n\"Alan,\" started a alarmed Gerome, \"What the heck just happened to you?!\" Alan sighed. \"This is what I was trying to tell you.\" said Alan. \"My mucles grow during the full moon. I don't know why. I knew there was going to be one tonight but I wasn't sure how you were going to take it.\"<br>\r\n<br>\r\nGerome was speechless. He just saw a stong wolf get more muscular right before his eyes! Alan was bigger than him now, maybe even stronger! Gerome never met someone who could outdo him. </span></div></div>",
            "created":1353474000,
            "id":1472517,
            "title":"Tell Gerome"
        },
        "112221111212111":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "Add a little more weight.",
                "Add a lot more weight."
            ],
            "content":"<div class=\"\"><div> <span>Gerome stood there, taking a second glance at Alan's bigger body. Alan on other hand couldn't even look up at Gerome at this point. He was so worried about Gerome would feel he just didn't want to lock eyes with him. \"So...\", Alan glances up at Gerome, \"...how strong are you?\"<br>\r\n<br>\r\n\"!!\" Alan raises his head up at Gerome, who actually had a small grin on his face. \"What...what did you just say?\"<br>\r\n<br>\r\n\"What are ya, deaf? I just said how strong are ya?\", Gerome asks in an anticipated tone.<br>\r\n<br>\r\nAlan stands up straight, \"Wait, so, you're not scared or terrified about me becoming a bigger werewolf?\"<br>\r\n<br>\r\n\"Dude, it's been ten minutes and you haven't tried to eat me or anything.\", Gerome explains.<br>\r\n<br>\r\n\"Well, yeah.\" Alan bows his head down a bit, \"Thankfully I still can control myself.\"<br>\r\n<br>\r\nGerome walks up to Alan, placing a hand over Alan's enlarged shoulder, \"Hey, don't worry about it. I actually like the new you.\"<br>\r\n<br>\r\nAlan turns his head to Gerome with a skeptic look on his face, shrugging his shoulders, \"Why?\"<br>\r\n<br>\r\nGerome explains while scratching the side of his head, \"This might sound a little odd to you, but being a big guy myself, I'm used to being around tough guys. Even if one of them happens to be bigger than me. Heck! I'm in the football team, man.\"<br>\r\n<br>\r\nAlan was still really surprised about Gerome's reaction. He had thought only Teresa would be used to his growing form, but Gerome too? Well, if he's not afraid of you, then maybe you should take advantage of this moment. Alan smiles at Gerome, \"Alright. You asked how strong am I?\" Alan walks up to the barbell Gerome was using earlier. \"I just pumped up, so I guess we'll just have to see.\" Alan bend down to grip the barbell with both his large hands. The barbell weighs 200 pounds, so it shouldn't be too bad. Heck, he nearly picked up that bulldozer...oh...right. Anyways, he starts by tensing the massive muscles in his arms, \"Hnnng...!\"<br>\r\n<br>\r\nGerome steps up beside Alan with his arms crossed to take a closer look. Upon tensing his arms, Alan's arm muscles already shredded out from all around. Alan then starts tensing up the massive thigh and calf muscles to aid him. After flexing just to look good, Alan finally picks up the barbell. With ease. Alan was already standing up straight with what felt like a metal pipe in his hands. \"Uh...\"<br>\r\n<br>\r\n\"Perhaps, a little more weight?\", Gerome asks.</span></div></div>",
            "created":1354338000,
            "id":1479882,
            "title":"\"How Strong are You?\""
        },
        "1122211112121112":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Talk to Teresa",
                "Go to tryouts"
            ],
            "content":"<div class=\"\"><div> <span>The weight literally felt like nothing to Alan. He figured it could 400 lbs. and it still wouldn't slow him down. \"Let me try something heavier.\" said Alan to Gerome. Alan walked to with two dumbbells that were the size of Gerome's peaking biceps. Gerome looked at weight labled on the side of the dumbbells. \"800 lbs?!\" said Gerome. \"That's 1,600 lbs. combined! You think you can handle that?\" Alan just smirked. \"Only one way to find out!\"<br>\r\n<br>\r\nAlan pushed the dumbbells upwards towards his chest. They were heavy, but Alan still had his confidence. The giant wolf's arms pushed veins against his fur and showed amazing slabs of muscle storing incredible power. Very slowly, Alan brought the dumbbells to his chin and then over his head. \"Whoa!\" exclaimed Gerome. \"You just lifted 1,600 lbs!\" Alan chuckled blushing.<br>\r\n<br>\r\n\"Watch this!\" Alan told Gerome. Alan then began doing reps with the huge dumbbells. Alan's arms rippled in and out on each rep. He began to sweat. The dumbbells were still pretty heavy for him. Alan then dropped them after 15 reps.<br>\r\n<br>\r\n\"That was so cool!\" said Gerome. \"I can't believe you just did that! I can't believe what you can do!\" As Gerome was talking enthusiastically, Alan took deep breaths. \"Yeah,\" said Alan, \"Me neither!\"<br>\r\n<br>\r\n\"We definitely need to get you on the team!\" said Gerome. \"You'll be unbeatable! Imagine another full moon! We'll win the national championship!\" A football championship did sound interesting to Alan, but what if there was another full moon? Would he just keep growing until he was a monsterous blob of muscle? How could he help Gerome if that happened?<br>\r\n<br>\r\n\"Uh, yeah,\" said Alan, \"I bet we could.\" Gerome grabbed Alan's shoulders again. \"Please tell you'll be at tryouts tomorrow, Alan. We NEED you!\" How could Alan say no to an overexcited and muscular polar bear? \"Don't worry I will.\" Alan answered. Gerome let out a \"Woohoo.\" \"We got this in the bag, Alan.\" said Gerome. \"I just know it!\"<br>\r\n<br>\r\nAlan layed in bed excited and anxious. He was going to be the secret weapon of the football team. But for how long as long as there are full moons? What if he can't control himself. Alan was worried but he shook it off thinking he didn't have time to worry. He needed to get some sleep for tryouts tomorrow.</span></div></div>",
            "created":1354338000,
            "id":1479896,
            "title":"Add a lot more weight."
        },
        "11222111121211121":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "Tell her it was Gerome.",
                "Lie. She doesn't sound too happy."
            ],
            "content":"<div class=\"\"><div> <span>Early the next morning, Alan was starting to wake up. The sun's glare was making it harder for Alan to sleep anyway, what with the sun's rays shooting through the curtains in his dorm. \"...\" 'Yawwwn' Alan slowly sits up on his bed, when suddenly, 'Riiip' \"!!\" Alan's once snug shirt that he normally sleeps in had just ripped apart from the collar halfway down. Alan sighs, \"Great.\" At first it wasn't so bad getting new clothes, but this was starting to get tedious. Now he'll have to go clothes shopping again, but now he might not have any shirts that'll fit him. Luckily the pairs of pants Teresa bought him'll still fit just fine.<br>\r\n<br>\r\n\"Oh shoot, Teresa!\" He's gonna have to show Teresa the new him, again. It's not the part about showing Teresa the new him, it's about him joining the team while Gerome knows about his transformations. \"... Maybe I'll find a shirt that'll fit me.\" Alan pulls the bed covers off, as well as his ripped shirt, which he tosses in the wastebasket. Alan walks up to his closet, only to find his old clothes, most of them being before any of his changes. \"Hang on...\" He also finds a couple large clothes that would fit him. Only thing was, they were jackets and sweaters. \"Darn it. It's gonna be hot today. Hmm... Maybe I can trouble...\"<br>\r\n<br>\r\n\"You grew? Again!?\", Teresa cries out to you. The both of them were on campus. Alan was wearing an orange jacket that was starting to make him feel, real, hot.<br>\r\n<br>\r\nAlan wipes off some sweat from his forehead. \"Uh, yeah. Hey, mind doing this in the shade?\"<br>\r\n<br>\r\nAlan and Teresa start to make their way towards a tree that had enough shade for the both of them. Teresa asks, \"So when did this happen?\"<br>\r\n<br>\r\n\"Last night. I was just workin' out at the time.\", Alan replies.<br>\r\n<br>\r\n\"Ooh...\" Teresa blushes, and then imagines Alan in only a pair of gym shorts, lifting a 100-pound dumbbell while winking at her. She then shakes her head, \"Uh... So, uh, did anyone see you?\"<br>\r\n<br>\r\n\"...\" Alan bowed his head down a bit, then raises it up to reply, \"...Yes.\"<br>\r\n<br>\r\n\"What?!\"<br>\r\n<br>\r\n\"Somebody saw me.\", Alan repeated.<br>\r\n<br>\r\n\"When? How?\", Teresa asks profusely.<br>\r\n<br>\r\n\"I...kinda showed him.\" You backed your head away, worried about what Teresa was about to say.<br>\r\n<br>\r\n\"Wha...what do you mean you showed him!? Was he even okay with this? You know what, who did you show exactly?\"</span></div></div>",
            "created":1354856400,
            "id":1483693,
            "title":"I...Told Someone Else"
        },
        "112221111212111211":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Be with Teresa",
                "Check on Gerome"
            ],
            "content":"<div class=\"\"><div> <span>\"I showed Gerome,\" said Alan. \"You mean that football polar bear?\" asked Teresa. Alan nodded. \"Well, what did say? What did he do?\" she continued.<br>\r\n\"He took it rather well. His reply was how strong I was now.\"<br>\r\nTeresa blushed again imagining how strong Alan was now. \"How strong are you?\" she asked. Alan smiled at her and said, \"Strong enough to lift 1600 lbs!\"<br>\r\n\"Really?! That's amazing!\"<br>\r\n<br>\r\nAlan was beginning to sweat even more under the heat. Teresa couldn't help but notice. \"If you're hot, Alan, you can take that coat off.\" \"But it's the only thing that can fit,\" said Alan. \"I'm not wearing a shirt.\" \"It's okay,\" Teresa replied with a smirk. \"I don't mind.\" Alan knew what Teresa wanted and was happy to do it. Anything to get rid of the coat. Alan unzipped the coat to reveal bare and steely abs and pecs to Teresa. She could see a vein pulsing out of his already relaxed bicep. Alan posed his mighty arms downward and playfully swelled them to great proportions. \"What do you think?\" asked Alan. \"You look wonderful,\" said Teresa. \"Nothing to be embarassed about.\"<br>\r\n<br>\r\nAlan chuckled. He actually like being shirtless and showing off his muscles. But he really did need to get clothes. \"I think we need to make another clothes shop errand,\" said Teresa. \"Agreed,\" said Alan, \"but what can we find? They'll just rip when I grow again.\" Alan made a good point. Teresa pondered for a second and said, \"We'll figure it out. Don't worry.\"<br>\r\n<br>\r\nAlan and Teresa walked to a different clothing store from the previous they went to avoid suspicion. The couple went the plus size area and began to look. Teresa went through piece after piece hoping they will fit and hold Alan's growing shape. Alan was lucky to find some elastic tank tops but nothing casual. \"I don't know about this,\" said Alan. \"Don't give up!\" said Teresa. \"We just need to look harder.\"<br>\r\n<br>\r\nAfter about a half hour, Teresa and Alan searched through the t-shirts. Some of the shirts were big and elastic. \"I think these will work,\" said Teresa holding a stack of shirts. \"Try them on!\" Alan walked to the dressing room and came out with a shirt on. \"It fits,\" Alan told Teresa. The shirt really did. Its sleeves hugged his arms very tightly but didn't look like they were going to burst and Teresa could still see Alan's abs and pecs. \"I agree!\" replied Teresa. \"You look handsome!\" The couple were so excited their mission was successful that Alan picked Teresa up to his eye level and they kissed. \"And you will always look beautiful.\" said Alan.</span></div></div>",
            "created":1354856400,
            "id":1483722,
            "title":"Tell her it was Gerome."
        },
        "1122211112121112111":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "Check on Gerome, with Teresa.",
                "Check on Gerome, alone."
            ],
            "content":"<div class=\"\"><div> <span>Teresa blushes again after Alan's comment. \"Oh you...\"<br>\r\n<br>\r\nAlan wanted to check on Gerome, but he actually had plenty of time before then. Why not spend some of it with Teresa? \"Hey Teresa, would you be interested in a movie?\"<br>\r\n<br>\r\n\"... A movie? Now?\", Teresa questions.<br>\r\n<br>\r\nAlan starts scratching the back of his head, \"Er, uh, if not, maybe uh...\"<br>\r\n<br>\r\nTeresa suddenly runs up to hug your shredded left arm, \"I'd love too!\" Alan smiles at her, and then picks her up off the ground again using only his arm, letting her watch his bicep ripple and shred with thick tendons, just for fun. The movie theatre wasn't too far down, so getting there was no trouble at all. The both of them waited patiently in line, checking out the different movies currently being featured. \"So, which movie did you have in mind?\", Teresa asks.<br>\r\n<br>\r\nUpon scouring the selection a bit, Alan comes across one of the movie posters. On it was a real buff alligator in commando gear: a black tank top, camo pants, camo boots, and a black headband. You know, one of those classic commando films. He was running through a forest with a swiss army knife in one hand while holding a female fox in the other. \"How 'bout 'Going Commando on This Thing'?\"<br>\r\n<br>\r\nTeresa chuckles at you. \"This really doesn't surprise me, but okay.\"<br>\r\n<br>\r\nLater on, they were both already halfway through the movie. Teresa was starting to shiver a bit what with all the violence, clenching Alan's left arm like before, only a little harder. She would close her eyes a couple times, but feeling his hardened arm everytime made her feel more comfortable watching it. Soon, there was a scene where the alligator and fox were starting to get comfortable with each other, the fox feeling the alligator's right bicep, knowing no matter what happens, he will always be by her side.<br>\r\n<br>\r\nTeresa blushes a big, \"Oh... I love this scene.\"<br>\r\n<br>\r\n\"You do?\", Alan asks with a smirk. While still feeling Alan's bicep, Teresa watches as Alan raises his arm, just like the alligator in the movie. Teresa even had the same response as the fox on screen. Alan flexes his bicep, just like the alligator, and then copies what he says, \"'No matter what, I, will always be there to protect you.'\" Alan continues, \"'Now to kill these sonsof--' Okay sorry, I thought there was gonna be more to that.\" Teresa starts to laugh, but then someone shushes her. Alan stares at them with angry eyes, \"Problem?\"<br>\r\n<br>\r\nThe person stares at Alan, and then slowly sits back down. Alan and Teresa both turn back to each other while enjoying the movie. Later, Alan and Teresa walk out of the theater. \"That was a great movie.\", Teresa commented.<br>\r\n<br>\r\n\"Yeah... Hey, wouldn't it have been better if you and me were in it?\" Alan asks sarcastically.<br>\r\n<br>\r\nTeresa laughs once again, and then suddenly wraps her arms around Alan's muscular neck to give him a smooch on the lips. \"You are real cheesy, ya know that.\" Alan blushes, and then Teresa laughs once again.</span></div></div>",
            "created":1354856400,
            "id":1483740,
            "title":"Cheesy Attitude"
        },
        "11222111121211121112":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Go to auditions",
                "Something came up"
            ],
            "content":"<div class=\"\"><div> <span>Alan walked Teresa back to her apartment after their date. \"Another great time!\" said Alan to Teresa. \"Yep!\" replied Teresa. \"You sure know how to entertain a girl.\" Teresa kissed Alan and walked back to her building.<br>\r\n<br>\r\nAlan walked back to his dorm until he remembered Gerome. Maybe he should check on him. Alan made his way to the gym and found the muscle polar bear doing squats. \"Still working out, I see.\" said Alan. Gerome turned excitedly to see Alan. \"Hey, I gotta stay in shape somehow.\" he said with a chuckle. Gerome dropped the weights he was carrying and walked to Alan. \"You ready for some football?\" Gerome asked. Alan replied with a double upward arm flex that hugged the sleeves of his shirt (luckily not tearing them). \"You bet!\"<br>\r\n<br>\r\nGerome and Alan made their way to the football field. There were already some huge players on the field doing some plays. They were being watched by an ox with a whistle. \"Coach!\" yelled Gerome to the ox. The ox saw Gerome with the massive wolf beside him. \"Hey, Gerome,\" said the coach. \"Is this the guy you told me about?\" Gerome nodded. \"This is Alan.\" \"Nice to meet you Alan.\" said the coach offering his hand to Alan. \"You too.\" Alan shook the coach's hand and the ox was really impressed on how tight his grip was. \"You two go get changed and we'll get started.\"<br>\r\n<br>\r\nAlan made it to the locker rooms while Gerome was talking to the coach. \"I have to say, Gerome,\" said the coach, \"I've never seen a wolf that big before. He's a lot bigger than I thought you told me.\" Gerome didn't want to tell the coach about Alan's \"full moon\" thing just yet. \"He's a special guy,\" said Gerome, \"Trust me. He's going to be awesome!\" Gerome then followed Alan to the locker rooms.<br>\r\n<br>\r\nLuckily for Alan, the football uniform was just right for his frame. If Alan grew anymore, his suit wouldn't have fit him. The padding, helmet, and shirt were skin tight to him but not in a uncomfortable way. Alan turned to mirror to see a football superstar ready to play. Alan flexed an arm playfully and swelled a bicep. \"This wolf is ready to play!\" </span></div></div>",
            "created":1355461200,
            "id":1488242,
            "title":"Are you ready for some football?"
        },
        "112221111212111211121":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "Hang out with Gerome some more.",
                "Go find Teresa."
            ],
            "content":"<div class=\"\"><div> <span>\"Alright Alan, show me whatcha got!\", the ox calls out to Alan. Alan and Gerome took their positions on the field. Gerome being the quarterback, he calls for Alan to hike the ball. Alan does so, and then basically barrels through people in his way, Gerome soon being able to score a touchdown. Alan and a few other teammates cheered for him. As for their coach, his mouth was agape, staring in awe of Alan's feat. He was so stunned  the clipboard he was holding slipped right out of his hands and onto the grass. \"D-...did, did you see that?\" The ox turns to the sheep waterboy who was sitting on a bench, \"Did you just see that?!\"<br>\r\n<br>\r\nThe sheep shifts his eyes at the coach and back at the players, \"I, I uh, saw everything coa--\"<br>\r\n<br>\r\n\"GOOD!\", the sheep falls off of the bench from the ox's reaction. \"'Cause I think we've found our top defender!\" Gerome kicks the football towards the other team. One of them, a bull, captures the ball. He was big, but Alan was still a bit bigger. The bull made his way past a few of Alan's team members, until he came across Alan. Alan grabs the bull by his shoulders, standing his ground. Alan then pushes his weight against the bull, bringing the bull down for their first down. The sheep slowly picks himself off the ground, only to fall back from the ox's loud voice, \"WOW! That wolf sure is tough!\"<br>\r\n<br>\r\nFor the next hour, Gerome and Alan have been playing their hearts out. In the end, the score was '28 - 4'. The coach has never been so proud to welcome someone into the team. Maybe not since Gerome. Even the other team surrounded Gerome and Alan, applauding them for their efforts and skills. A few of them asked Alan how he got so big, and his answers would pretty much be, 'I just like to workout a lot.', 'I guess it's a growth spurt', and him flexing his muscles a bit as well. Later, the coach announces who will be on the team. Gerome and Alan were one of them, including the bull and 8 other players of the 22 who participated.<br>\r\n<br>\r\nAfterwards, Alan, Gerome, and everyone else head back into the lockeroom to undress and get ready to leave. Alan was dressed back in his shirt and shorts, and then waits for Gerome to meet him outside. A few minutes later, Gerome walks right out of the lockeroom in the same clothing he wore before their audition. \"Ah! There you are!\"<br>\r\n<br>\r\n\"Heh, where'd you think I'd be?\", Alan replies.<br>\r\n</span></div></div>",
            "created":1355461200,
            "id":1488253,
            "title":"Auditioning for Football"
        },
        "1122211112121112111211":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Take off the ring to grow",
                "The next day"
            ],
            "content":"<div class=\"\"><div> <span>Alan and Jerome walked across the football field talking about their auditions. \"Seriously, wolf man,\" said Jerome, \"You were awesome! Other teams don't stand a chance against you!\" Alan flexed a giant bicep to Jerome. \"Thanks! But you're going to be useful too! My muscles maybe big but you know how to use yours!\"<br>\r\n<br>\r\n\"But what are you going to do when you grow again?\" asked Jerome. \"The next full moon is tomorrow night!\"<br>\r\n<br>\r\nAlan's smile disappeared when he realized this fact. He didn't want to become a giant blob of muscle but it might come to that if he keeps growing at this rate. \"I don't know,\" said Alan. \"I honestly don't know.<br>\r\n<br>\r\n\"Alan! Jerome!\" the muscle duo turned to see the coach was walking up to them. \"What's up, coach?\" asked Alan.<br>\r\n\"Alan, I have to say, I was really impressed with you and Jerome can back me up on that! <br>\r\n The muscle wolf shrugged a shoulder while blushing. \"Just trying to do my part, sir,\" he said modestly.<br>\r\n\"Well, I see a lot of potential in you, boy. I really do. Here, I want you to have this.\"<br>\r\n<br>\r\nThe coach pulled out a silver ring with a big blue stone in the middle from his pocket. It looked really fancy and expensive. \"I won this at the regional championship. It's my personal good luck charm. Never lost a game with it. I want you to have it. With this and you're muscles, we'll be unstoppable!\"<br>\r\n<br>\r\nThe ring was such a generous gift. \"Sir, I couldn't possibly accept this if it means that much to you,\" said Alan.<br>\r\n\"Which is why I'm giving it to you. Don't worry about it!\"<br>\r\nThe coach seemed really sure about it and wouldn't take no for an answer. Alan accepted the ring and looked at it from his meaty paw. \"Thank you, sir! I'll make you proud!\"<br>\r\n\"You already have!\"<br>\r\n<br>\r\nAlan walked with Jerome to their dorms. Alan was still holding the ring. \"That's really an honor, Alan!\" said Jerome. \"Why don't you put it on?\"<br>\r\n\"Umm..well...my fingers are too big.\"<br>\r\nJerome chuckled slightly. \"Don't worry, I got this.\" Jerome search the bag he was carrying and took out a piece of lace. \"Tie this onto the ring and wear it like a necklace!\" Alan thought that was a clever idea. He did as Jerome told him. The ring layed on top of the crevice between his giant pecs. Alan liked how the lace felt tight around his neck. \"You look cool with it!\" said Jerome.<br>\r\n<br>\r\nThey continued walking until Jerome stopped to look up into the sky. \"Uhh, Alan,\" said Jerome. \"What?\" asked Alan. \"Look.\" Alan followed Jerome's direction and saw a giant glowing orb in the sky. It was a full moon. \"I thought you said it wasn't coming till tomorrow!\" exclaimed Alan to his polar bear friend. \"Sorry, I haven't memorized my lunar calendar!\" Jerome said sarcastically.<br>\r\n<br>\r\nAlan flinched waiting for the warmth of growth to overwhelm him. But it never came. He waited a few more seconds before opening his eyes. The full moon was still there and he was still his current size. \"What's going on?\" asked Alan. \"Why am I not growing?\" The wolf and polar bear had no clue. Alan was happy that he wasn't getting any bigger, but how? Jerome saw the ring around Alan's neck glittering in the moonlight. \"Alan, it's the ring! I think the ring is stopping you from growing!\"<br>\r\n\"What? How?\"<br>\r\nJerome got up to Alan's rippling chest to get a closer look at the ring. Jerome was right. The ring was made of silver. \"The ring is made of silver!\" said Jerome. \"Silver must stop your growing like it stops someone from turning into a werewolf!\" Alan was amazed and glad by this discovery. He could now control his growth now! \"Wow!\" said Alan. \"I thought this stuff only happened in the movies!\"<br>\r\n\"Alan, you turn into a hulking wolf under the full moon. We're past a movie!\"</span></div></div>",
            "created":1358571600,
            "id":1511752,
            "title":"Silver Lining"
        },
        "11222111121211121112111":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "Alan runs into Terisa.",
                "Head back to Alan's dorm without any interruption."
            ],
            "content":"<div class=\"\"><div> <span>Although Alan knos it must have been because of the ring that he wasn't growing, he just HAD to make sure. Alan takes a hold of the lace, and was about to lift it off of his head. Gerome stops him, \"Dude!? What're you doing?!\"<br>\r\n<br>\r\nAlan turns to his polar friend, \"Sorry Gerome, I just have to make sure.\" The necklace was nearly off his head, but he could see his friend was still staring worriedly at him. \"It'll just be a sec.\" The necklace was now off, but he still kept it above his head just in case, when suddenly, the rush of warmth filled his entire body. \"Gah!\" All of Alan's muscles started to throb out at once, causing him to let go of the necklace! \"Oh shoot!\"<br>\r\n<br>\r\nGerome quickly caught the necklace, but Alan had already started to grow just a bit. Gerome worked quickly, squeezing the necklace back on to Alan's neck. With that, Alan stopped growing, his thick muscles still throbbing a bit from his recent spurt in growth. Gerome sighed with relief, sort of, \"Well, that was a close one.\"<br>\r\n<br>\r\nAlan was still panting a bit heavily, but was glad Gerome quickly stuffed the necklace back on to him. \"Yeah...\" Alan took another look down all over his body, noticing the small, but known changes. \"I, didn't grow too much, did I?\"<br>\r\n<br>\r\nGerome takes a look for himself, looking up and down Alan's large frame. \"Well, you certainly grew. Not enough for anyone to notice, but it looks like the gear and necklace you're wearing seems to be rather tight on you.\"<br>\r\n<br>\r\nAlan was having a hard time adjusting to his new size with his tight clothing. \"Ugh... Yeah, no kidding.\"<br>\r\n<br>\r\n\"Hmm...\", Gerome started to think to himself. He then reaches a conclusion, \"I got it! Follow me!\" Gerome runs off.<br>\r\n<br>\r\nAlan was about to do the same, but upon lifting on leg, he hears a noticeable loud rip come from his lower gear. Alan quickly covers his behind, \"Uhhh...\"<br>\r\n<br>\r\nGerome walks back, tugging Alan's right arm, \"Alright, we'll, just walk.\" Gerome walks off while Alan followed along by side-stepping. The place they both ended up at turned out to be Gerome's dorm. Gerome shuts the door behind him and locks it, turning to his restrained friend. Gerome walks over to his closet, \"Alright. Feel free to rip off the gear if ya like.\"<br>\r\n<br>\r\n\"Wait, what?!\", exclaimed the burly wolf.<br>\r\n<br>\r\n\"It'll be fine. I've got plenty of clothes that'll fit ya.\" Gerome starts searching in his closet. Alan felt a bit uncomfortable, but hey, it was just Gerome. Alan tried to just slip the clothes off, but that was proving to be a little tough. Gerome looks back to him, \"Don't worry about it. We'll be getting new gear anyway, so you can just forward the coach your measurements.\"<br>\r\n<br>\r\n\"Oh. Uh, okay.\" Alan started to tug onto his upper gear, ripping his shirt right off. Alan then did the same for his lower pants, which were already ripped, and decided to tear them off by flexing his immense thighs and calves. With a gentle tensing of his leg muscles, the pants shredded right off, the remnants floating to the floor. All that was left was a large and well-sculpted wolf wearing only the necklace and his boxer shorts, which was starting to look like underwear on his person. \"Phew. Least I can walk around now.\"<br>\r\n<br>\r\n\"Here, try this.\" Alan turned to his friend, who threw a shirt to him, which he caught. \"It was my dad's.\"<br>\r\n<br>\r\nAlan took a close look at the black shirt. He was a little iffy about the color, but he just shrugs it off. After slipping it on over his chest and back, Alan was surprised to see that the shirt was actually a tad big for him. \"Whoa! This shirt, is big! I bet I can even grow a second time if I wanted to, and it would still be a bit loose. You said this is your dad's?\"<br>\r\n<br>\r\n\"Yeah, my dad's a business man, but he does bodybuilding part-time. He even used to be part of the football league. And, that's what got me into sports. And weight training.\" Gerome starts shifting through his closet some more. \"My dad sends me a lot of his old clothes. Good thing too, my closet was getting a little cramped.\"<br>\r\n<br>\r\n\"Oh.\", Alan remarks. \"So, this shirt is too big for him now?\"<br>\r\n<br>\r\n\"Actually, he outgrew it.\"<br>\r\n<br>\r\nAlan's eyes grew wide, \"What?!\"<br>\r\n<br>\r\n\"Yeah. You should see him. He hasn't even reach his 40's yet.\" Gerome pulls out a pair of shorts and throws them to Alan. \"Sorry. I can't seem to find any pants.\"<br>\r\n<br>\r\nAlan shrugs. \"Eh. Anything's better than these boxers.\" Alan slips the yellow shorts on. They fit just fine, but they looked stretchy enough to withstand his growths once or twice as well.<br>\r\n<br>\r\nGerome suddenly holds out a couple pieces of clothing, which he hands to Alan. \"Here! You can keep these.\"<br>\r\n<br>\r\nAlan was surprised, taking the many pieces of clothing in his arms. \"Why, why are you giving me all of these?\"<br>\r\n<br>\r\n\"You kidding? You think I'd grow into all of these? It's no problem. It's not like I'll get as big as you someday.\", Gerome replies with a grin. \"Plus I didn't give you anything that meant a lot to me, so don't worry about it.\"<br>\r\n<br>\r\n\"What? Hey man, I know you can grow into these someday. I've seen you work out, and if you kept at it more and more, maybe you'll even surpass me.\", Alan added.<br>\r\n<br>\r\nGerome chuckles, \"Right.\"<br>\r\n<br>\r\n\"Trust me, I don't plan to grow anymore as long as I have this thing around my neck.\"<br>\r\n<br>\r\nGerome grins warmly. \"Thanks.</span></div></div>",
            "created":1358571600,
            "id":1511808,
            "title":"Just Making Sure"
        },
        "112221111212111211121111":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Head to the beach",
                "Get a call from Gerome"
            ],
            "content":"<div class=\"\"><div> <span>\"Thanks again for the clothes,\" said Alan. \"And don't worry about your routine! Just keep doing what you're doing!\"<br>\r\n<br>\r\n\"No problem! And thanks!\" replied Gerome.<br>\r\n<br>\r\nAlan walked to his dorm feeling comfortable in his new clothes and ring. He felt so relaxed he looked up to the full moon to see how beautiful it was. Alan couldn't get over how loose his clothes felt. It's been a long time since he felt so relaxed. Gerome's father outgrew these giant clothes? Alan couldn't help but wonder how big Gerome's dad is and how he got so big.<br>\r\n<br>\r\n\"Alan?\" Teresa stood in a sidewalk a few feet from the hulking wolf. \"Hey, Teresa!\" The tigress walked to see her boyfriend. \"That's a new look for you,\" she said referring to his clothes. \"Yeah,\" Alan said, \"I grew a little tonight under the full moon.\" Teresa didn't realize it was a full moon tonight and that Alan grew at all. After a few seconds, she saw the slight differences in his muscles. \"You didn't grow as much as you usually do,\" said Teresa. \"How?\"<br>\r\n<br>\r\nAlan flashed the ring around his neck. \"This. The football coach gave this to me after auditions. It's made of silver. I found out that I can stop my growth while I have silver on me! I don't have to worry about becoming too big anymore!\" Teresa was happy to hear that. As much as she loved her muscular wolf, she didn't want Alan to become monstrously huge that she barely recognizes him. \"That's great!\" Teresa said. \"I was getting worried about that!\" Alan smiled and said, \"Not anymore!\"<br>\r\n<br>\r\n\"Where did you get the clothes?\"<br>\r\n<br>\r\n\"Gerome gave them to me. They belong to his dad. Get this, his dad is a bodybuilder and he outgrew these!\"<br>\r\n<br>\r\n\"What? Seriously? How big is he?\"<br>\r\n<br>\r\n\"I don't know but I hope he can teach me a few pointers!\"<br>\r\n<br>\r\nTeresa chuckled at Alan's joke. \"So, how did the auditions go?\"<br>\r\n<br>\r\n\"Awesome! The coach loved me!\"<br>\r\n<br>\r\nTeresa got close to her man's cheek and said, \"Not as much as I love you.\" Alan couldn't help but blush. \"What brings you out here?\" asked Alan.<br>\r\n<br>\r\n\"Just taking a stroll. You wanna do something tonight?\"<br>\r\n<br>\r\n\"I'd love to but I'm kinda tired from auditions and the growth scare. How about we head to the beach tomorrow?\"<br>\r\n<br>\r\nTeresa loved that idea. She couldn't wait to see Alan in a swimsuit and his newly grown chest. \"That sounds awesome!\" she said.<br>\r\n<br>\r\n\"Great! I'll see you then!\"<br>\r\n<br>\r\nThe happy couple said their goodbyes and went to their according dorms. Alan felt happier than ever. Things were finally under control now that he can stop growing. With his growth under control, Alan felt like he could do anything.</span></div></div>",
            "created":1358571600,
            "id":1511817,
            "title":"Nightly Stroll"
        },
        "1122211112121112111211111":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "Flex for Terisa",
                "Show-off a bit"
            ],
            "content":"<div class=\"\"><div> <span>The next morning, Alan was just starting to wake up. It was pretty early, so Alan didn't really want to get out of bed yet. That was until he remembered, the beach! Alan's eyes burst open, and was wide awake now. Alan gets up, only to get hit by a large beam of sunlight, which he anticipated by covering his eyes with his large right arm. \"Ah...\" Alan pulled up the bed covers, and swung his enormous legs off the bed. The sun was still a bit too much for him, so he quickly runs off into the bathroom.<br>\r\n<br>\r\nAlan turns on the faucet to start washing his hands, but then takes notice of himself in the mirror, still wearing the large black shirt. \"Hmm...\" Alan went ahead and pulls his shirt off. He's gonna need to change it since he slept in it anyway, pluse he's never really taken notice of how big he is until now. His pecs and abs were sculpted really nicely on his frame, as well as his arms and shoulders. He went ahead and started flexing and making poses a few times, and was fascinated with the results.<br>\r\n<br>\r\nA few minutes later, he was out of the bathroom and getting another shirt that Gerome gave him. It was just as big as the old one, but at least it'll fit snuggly. Alan was so hyped up about the beach now, grabbing a small bag of his and put in few pairs of clothings. He even thought about just wearing his boxers, but that could wait for when he gets to the beach. Alan just grabs a pair of those and then zips his bag right up. Alan runs to his phone, and then dials the numbers that made out Terisa's phone number. \"Hello, Terisa? I'm ready for the beach!\"<br>\r\n<br>\r\n\"What? I haven't gotten to eat breakfast yet.\", Terisa chuckles.<br>\r\n<br>\r\n\"Oh...right.\" Alan was patient though. He just spent the next hour or two watching TV and flexing to himself in front of a mirror in his dorm. Later though, Alan and Terisa were already on their way to the beach, Alan carrying a gym back around his broad shoulder, and Terisa also carrying her own. \"Man... That was the longest two hours of my life.\"<br>\r\n<br>\r\nTerisa chuckles at her large wolf friend. \"What have you been doing during that time?\"<br>\r\n<br>\r\n\"Now much.\", Alan replied. \"Just been hyped up and watching TV.\" Alan raises an arm to flex the enormous peak that popped right out, \"Plus I've been, checkin' myself out a bit more too.\" Terisa blushes a bit in response. It wasn't long before the sandy beach lay right beneath their feet. Alan took a deep breath, sniffing out the fresh beachy air as he puffed out his miraculous chest to pound it a few times, and then breathed out. \"Ahhh... I love this place. Well, now I do.\"<br>\r\n<br>\r\nTerisa points out, \"Oh look, there's a spot.\" The beach was pretty packed, but this certain spot looked really spacey for Alan's bulk.<br>\r\n<br>\r\nAlan looks out to it. \"I see it.\" He then picks Terisa up and carries her as he runs past the many people populated the area, then taking notice of the burly titan that rushed past them. Alan made it to the desired spot on the beach, setting Terisa down with ease. \"Here we are.\"<br>\r\n<br>\r\nThe two take a moment to set up their spot, even though it was just a large parasol and a large beach blanket. They both then headed to a tent to change into their bathing suits. Terisa was the first, coming back to Alan in a red two-piece that shaped her slender body quite nicely. \"Well? How do I look?\"<br>\r\n<br>\r\nTerisa was able to notice the blush that appeared on Alan's cheek. \"Uh, wow. You look great!\"<br>\r\n<br>\r\n\"Okay. Your turn. I think the tent should be big enough to fit you.\"<br>\r\n<br>\r\nAlan shifts his hand. \"Ah I don't need to go there. You can just watch me undress right here.\" Alan starts by grabbing the bottom of his shirt and slowly pulled it off of his person, the sun glistening over his protruding muscles. Terisa couldn't help but blush back in response. Alan even pulls of his shorts, revealing a pair of shorts that looked really small on him, but made his legs stick out as much as his upper body. Alan strikes a pose, \"There. Now how do I look?\"<br>\r\n<br>\r\nTerisa was amazed at her man's body and how much his muscles stuck out. She couldn't help but stare at his shorts though. \"Are those, boxers?\"<br>\r\n<br>\r\n\"Eh-heh... Well, they're supposed to be.\"</span></div></div>",
            "created":1358571600,
            "id":1511853,
            "title":"To the Beach"
        },
        "11222111121211121112111112":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Gerome appears",
                "Girls notice Alan"
            ],
            "content":"<div class=\"\"><div> <span>Alan and Teresa walked across the hot sand while listening to the crashing waves in the distance. Teresa had her arms hugged around Alan's gigantic arm feeling safe and cool with him. The happy couple enjoyed the envious stares they were getting from the crowds. \"So, what do you want to do?\" asked Alan.<br>\r\n\"I'm up for anything!\" replied Teresa, \"As long as you keep those muscles of yours!\"<br>\r\nAlan flexed the bicep Teresa was holding. \"Wouldn't dream of it!\"<br>\r\n<br>\r\nThe wolf and tigress finally found a spot in the sand to call their own. First, they just enjoyed each other's company by lying on the beach towel. Alan held on to Teresa by her waist while Teresa rubbed his abs. They continued doing nothing until Teresa sat up instantly. <br>\r\n <br>\r\n\"I have the perfect idea!\" she said to Alan.<br>\r\nAlan shared her enthusiasm. \"What's that?\"<br>\r\n\"How about we play in the sand a little bit?\"<br>\r\n\"Like what?\"<br>\r\n\"Like burying you in the sand kinda fun.\"<br>\r\nAlan knew what she was going with this and was thrilled to do it for her. \"I love the way you think!\"<br>\r\n<br>\r\nTeresa and Alan left their spot to find an open place of sand to work with. They found a spot unoccupied by anyone and took it before anyone else could. They then began to dig as much as they could to make a hole big enough for Alan to squeeze in and bury. After about a half hour, the couple dug a hole literally six feet deep. \"I think it's done!\" said Alan.<br>\r\n\"You sure?\" asked Teresa.<br>\r\n\"Only one way to find out! <br>\r\n<br>\r\nAlan jumped into the hole and and the top of the hole met him at his strong chest. \"Yep. It's good!\" said Alan. \"Let's do it!\" Teresa began pouring sand into the hole while Alan just stood there. He remained in the hole until he could not move his feet in the sand. \"You doing okay, Alan?\" said Teresa. Alan nodded excitedly. With his assurance, Teresa continued piling sand on the giant wolf.<br>\r\n<br>\r\nFinally, the sand was under Alan's muzzle and made his limbs immobile. \"Okay, I think that's it!\" said Teresa. Alan smiled at his girl. \"Stand back.\" To Teresa, it seemed like Alan was just squirming his head and thickening his neck but he was really pushing his mountainous arms and legs against the sand's weight. Alan could feel his muscles thickening and growing underneath the sand and was sad he couldn't witness it. But the outcome would be worth it.<br>\r\n<br>\r\nTeresa could feel trembling under her bare feet and saw Alan's arms pop right out of the sand! Alan then pressed his arms against the ground to get his legs free. With a gentle growl, Alan was able to do so. Alan was covered in sand but he didn't care. The sun reflected off the sand grains in his fur making him shiny in front of Teresa.<br>\r\n<br>\r\nTeresa was literally looking at a golden man. She loved how the sand in Alan's fur made his muscles shiny. They looked better than ever before. Alan showed her that his strength was both for show and for great feats. \"You're so amazing, Alan!\" exclaimed Teresa. She couldn't help herself from running to her man and drowning herself in his sandy abs and pecs. Alan hugged her covering her entire body with his hands and arms. \"You're also amazing,\" said Alan to his tigress. \"Thank you for being by my side.\" The couple just got happier and kissed not minding the sand on each other's body.</span></div></div>",
            "created":1359090000,
            "id":1517012,
            "title":"Buried Alive"
        },
        "112221111212111211121111121":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "Head out for a quick swim as well.",
                "Just lie back to enjoy the sun's rays, and talk."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey you two!\" Alan and Trixie suddenly break from their kiss, to turn and see a burly bear walking in their direction. \"Small world, isn't it.\"<br>\r\n<br>\r\n\"Oh. Hey Gerome.\", you greeted. \"What brings you here?\"<br>\r\n<br>\r\nGerome just shrugs his shoulders, \"Eh. Just thought I stop by to relax and unwind.\" The strong bear takes notice of the female tigress in Alan's arm. \"Well hello.\", Gerome says with a smooth tone, \"And who might you be?\"<br>\r\n<br>\r\nGerome doesn't know her, but Terisa sure knows him. \"My name is Terisa. I never thought I'd get to see the college's greatest athlete here. Or see him only in his shorts.\"<br>\r\n<br>\r\nGerome flexes an arm for the tigress, \"Heh. Well, I get around a lot. Name's Gerome.\"<br>\r\n<br>\r\nTerisa chuckles a bit. \"I know who you are. Oh!\", Terisa remembered, \"I'm gonna go to the snack bar real quick. You want anything?\"<br>\r\n<br>\r\n\"Nah, I'm good.\", Alan assured. Terisa then runs off.<br>\r\n<br>\r\nGerome walks up to his burly wolf pal, \"Boy, she's a keeper.\"<br>\r\n<br>\r\nAlan chuckles. \"Yep. She sure is!\", he adds with a big grin.<br>\r\n<br>\r\nGerome inches his head in to whisper to Alan, \"Does uh, she know?\"<br>\r\n<br>\r\n\"Huh? Oh. Yeah.\", you replied softly.<br>\r\n<br>\r\n\"Well!\", the large bear suddenly blurts out, slapping Alan on his back, \"Alright then! Well, you two have a good time. I'm gonna go out for a swim. I seriously need this.\" Gerome runs off and out towards the shifting waves.<br>\r\n<br>\r\nAlan sighs. \"Well, he sure is having a good time.\" Alan walks back to his and Terisa's spot on the beach. His and her belongings were also right where they were, otherwise he'd be searching and storming the whole beach. Alan turns around to sit and lie on the grass, kicking on leg up over the other. He let's the sun's shining rays wash all over his entire body, his well-defined muscles really showing out over his lustrous body. It wasn't long until Alan hears some footsteps walk up and stop beside him. He looks up, seeing that it Terisa. \"Oh, you're back.\"<br>\r\n<br>\r\nTerisa takes a seat next to Alan, holding ice cream cone in her hand. \"Sorry I took so long. Where's Gerome?\"<br>\r\n<br>\r\n\"He's off takin' a swim.\", Alan replied.<br>\r\n<br>\r\n\"Oh, okay.\" Terisa then just continues licking her ice cream. Alan was just lying back, waiting patiently for his girlfriends to finish her ice cream. This would be a good time to think of something interesting to do with her.</span></div></div>",
            "created":1359090000,
            "id":1517048,
            "title":"Unexpected Guest"
        },
        "1122211112121112111211111212":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Gerome comes back",
                "Head home"
            ],
            "content":"<div class=\"\"><div> <span>Alan felt so warm and comfortable being with Teresa under the hot sun. After finishing his ice cream, he lied down stretching his chest to show off for his girl. He could help but make Teresa blush and make her drip her ice cream a little. Alan then took a deep breath that puffed his chest to massive proportions.<br>\r\n<br>\r\n\"This is really nice,\" said Alan. Teresa nodded and layed with him after she was done with her ice cream. \"This really is,\" Teresa commented. \"I'm really glad I'm here with you.\" Alan hugged her closer to him and kissed her on the head. \"I never thought someone so big would be so nice,\" said Teresa.<br>\r\n<br>\r\n\"What do you mean?\" asked Alan.<br>\r\n<br>\r\n\"I mean Mark.\"<br>\r\n<br>\r\nThe sound of Mark's name made Alan's blood hotter than it already was under the beaming sun but he cooled down for his tigress. \"You mean he never did stuff like this?\"<br>\r\n<br>\r\nTeresa shook her head. \"No, never. I guess he just saw me as a trophy. I can't believe I fell for him!\"<br>\r\n<br>\r\nAlan couldn't control his curiousity. \"If you don't mind me asking, how did you two get started?\"<br>\r\n<br>\r\nTeresa sighed. \"It was stupid. I got a soft spot for big guys and Mark was the biggest guy around before you showed up. I figured a muscular guy could protect me but he was just a jerk behind all that muscle.\"<br>\r\n<br>\r\nI'm sorry, I didn't mean to bring up bad memories.\"<br>\r\n<br>\r\n\"No, you're fine. I'm glad that's over and done with. I'm especially glad to be with you. You've shown me not all big guys are like Mark. I'm glad you're different.\"<br>\r\n<br>\r\nAlan moved her closer to him. \"I'm glad you left him. He doesn't deserve you. You deserve so much better.\"<br>\r\n<br>\r\n\"Someone like you?\"<br>\r\n<br>\r\n\"That's up to you. What do you think?\"<br>\r\n<br>\r\nTeresa was filled with strong emotions for Alan. She loved the fact that he was big, strong, and kind to her. While with Mark, Teresa thought she would be stuck with him until Alan came to her rescue. The tigress kissed her titan wolf. \"I think I love you,\" she said. Alan shared the same emotions Teresa held in her heart. \"I love you too,\" he replied. The couple then went back to where they were before Gerome interrupted them earlier.</span></div></div>",
            "created":1359176400,
            "id":1517060,
            "title":"Old Flames"
        },
        "11222111121211121112111112121":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "Go get some lunch at school.",
                "Go get some lunch somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>Alan and Trixie just kept their lips locked for only a short moment longer, when suddenly, \"Hey you two!\" The two lovebirds quickly backed away from their passionate kiss. \"Whoops, sorry. Did I ruin the moment again?\"<br>\r\n<br>\r\nAlan remarks with his teeth gritted, \"No, no, it's okay.\"<br>\r\n<br>\r\nGerome was actually soaked all over, his fur all dripping wet, but it also shows off his muscular <br>\r\nframe even more. \"I'll just get out of your guys' hair.\", Gerome chuckled. He then walks off on his own while carrying a towel around his neck.<br>\r\n<br>\r\nAlan sighs. \"Well, I think we've been interrupted enough today. What say we head back?\"<br>\r\n<br>\r\nTerisa quickly wraps her arms around as much of the wolf's body as she could, giving him a smooch on his lips. \"Okay. Hope you had fun.\"<br>\r\n<br>\r\nAlan shrugs his broad shoulders, \"Eh, yeah. It was fun while it lasted.\"<br>\r\n<br>\r\nFor the next couple minutes, Alan and Trixie started picking up and gathering their things. Alan was about to take off with his things, but not before taking notice of a couple people checking out his entire frame. Alan looks over to Terisa, who gives Alan a nod okay. The big wolf sets his stuff down, and then raises up his arms to flex out his massive arms, his bowling ball-size biceps swell out on his arms. The crowd cheered, and only got bigger.<br>\r\n<br>\r\nFor Alan's next pose, he turns his body sideways and lowers his arms to perform a side-chest pose, his pecs sticking right out with his shredded left arm. Terisa was happy to clap for the proud wolf, as Alan raises his arms again to do a back double-bicep pose, thickening out his thighs. This goes one for about fifteen more minutes, and then he waves off to the crowd as he and his girlfriend walked off to head back to their college. Alan did assure them that he'd be back though.<br>\r\n<br>\r\nAs they walked across the parking lot, they were both taking notice of Gerome, who seemed to be chatting, and flexing, to a few girls. Looks like he's got his own fans as well. Alan and Terisa look at each other, and then chuckle to themselves about it. After their time at the beach, it was barely past noon time. Maybe the two go for some lunch, not before putting their stuff away of course.</span></div></div>",
            "created":1359176400,
            "id":1517069,
            "title":"Another Moment Ruined"
        },
        "112221111212111211121111121212":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Go to the next class",
                "The instructor hires Alan"
            ],
            "content":"<div class=\"\"><div> <span>Alan noticed a hog dog stand on the pier he and Teresa were approaching. \"You wanna a hot dog for lunch?\" Alan asked Teresa. \"Sure,\" she answered. \"Sounds good!\"<br>\r\n<br>\r\n\"Okay, I'll be right back.\"<br>\r\n <br>\r\nAlan ordered two hot dogs with everything on them. When he returned to Teresa, Alan noticed a lean muscled cheetah talking to her. Just by looking at the cheetah's sly look, Alan could tell the cheetah was trying to charm her. Big mistake.<br>\r\n<br>\r\n\"Come on,\" said the cheetah to Teresa, \"You know you feel something between us.\" Teresa nodded, \"Yeah, nausea above all else. I'm waiting for someone. I don't mean to sound rude but please leave. I don't want my boyfriend to beat you up.\" The cheetah scoffed. \"Please, I'm not afraid of a..\" A shadow came over the cheetah and Teresa. The cheetah turned to see a massive wolf with an angry grin behind him.<br>\r\n<br>\r\n\"Hi, honey,\" said Teresa to Alan. \"Honey?\" said the cheetah. \"Yep,\" implied Alan. Alan growled at the cheetah intimidatingly while tensing his muscles. \"You leave my girl alone. Got it?!\" The cheetah just nodded and ran after Alan let him go.<br>\r\n<br>\r\nAlan then gave Teresa her hot dog. \"You seem to be the popular girl on the beach,\" said Alan. Teresa chuckled. \"I guess so. But you know I'm the girl for you.\"<br>\r\n<br>\r\nAfter lunch, Teresa asked Alan what the time was. It was almost 1 o clock. \"Oh no,\" exclaimed the tigress, \"We're going to be late for our art class!\"<br>\r\n\"Not on my watch!\" Alan picked up Teresa to his meaty chest and ran to the school. They didn't have time to change from their suits. They would have to wait until they got there.<br>\r\n<br>\r\nLuckily, Teresa and Alan got to their art classroom dressed right on time. They took their seats on stools in front of canvases. Their instructor, a female cougar, walked into the classroom. \"Good afternoon, class,\" began the cougar. \"Today, we'll begin painting portraits. I've hired a model to stand in the middle of the classroom for you to create your work.\" Suddenly, the teacher's phone rang and she answered it. \"What?\" the cougar exclaimed. \"What do you mean? I understand.\" She hung up and turned to her students. \"I'm sorry, class. But I'm afraid our model is unable to come to class today. We have no model to begin class with.\"<br>\r\n<br>\r\nTeresa turned to Alan and Alan saw her staring at him enviously. He knew what she was thinking. At first, Alan felt uncomfortable about being a model for an art class but he exposed himself at the beach. Why not an art class? Alan raised his hand. \"Uh, professor, I'll volunteer to be a model.\" The cougar was surprised to hear a student volunteer. Modeling in front of an art class was not a favorable job for most people. The professor was going to say no but judging by Alan's size and muscle, he would be perfect.<br>\r\n<br>\r\n\"Okay,\" said the instructor, \"As long as you don't mind.\"<br>\r\n\"I don't.\" Alan got up from his seat and walked towards the center of the room with the professor. He whispered to her if he have to go naked for the class. She told Alan he didn't. Taking off only his shirt would be fine.<br>\r\n<br>\r\nWithout hesitation, Alan took off his shirt to reveal a rippling and bumpy to chest to everyone to envy, even the teacher couldn't help but be amazed by his glorious chest. Alan lied down on his side with a paw to his cheek. He was ready and so were the students. This was so far everyone's favorite art class.</span></div></div>",
            "created":1359694800,
            "id":1522180,
            "title":"Hot Meat"
        },
        "1122211112121112111211111212121":{
            "author_id":"hrrb",
            "author_name":"GeaMeX",
            "choices":[
                "\"Um...that sounds nice.\"",
                "\"I...think I'll just stick to the book.\""
            ],
            "content":"<div class=\"\"><div> <span>Art class had come to an end, but Alan sure has gotten a lot of praise for his participation. And physique. Alan and Terisa were making their way out of the room to head to their next class as the rest of their classmates left the room as well. Alan started to think to himself. \"Hmm...you know, after all the fuss with my growth and junk, I've kinda forgotten what class we're supposed to head to next.\"<br>\r\n<br>\r\nTerisa chuckles at the burly wolf. \"Good thing I do. But, unfortunately, it's anthro anatomy class.\" The tigress sighs sarcastically.<br>\r\n<br>\r\n\"Hey, I'm sure it's not that bad.\", Alan remarks, wanting to cheer Terisa up.<br>\r\n<br>\r\n\"Yeah, maybe not for you.\" Terisa sighs once again. \"It's just so hard to know all the specific body parts and muscle groups. I'm in trouble if the teach gives us a quiz or something.\"<br>\r\n<br>\r\nAlan chuckles, wrapping a thick arm around the tigress's shoulder to bring her in. \"Not to worry. That's why I'm here. I may be big and muscular now, but I've got a lot of intel up here.\", Alan adds pointing at his forehead. Alan then puts on a toothy grin, showing off by flexing his raised arm, \"Plus, I'm sure I can show and direct you to each and every muscle group on this pumped body.\"<br>\r\n<br>\r\n\"Wow...\" Terisa blushes, \"I never thought you'd be so smart too.\"<br>\r\n<br>\r\nAlan sighs. \"To be honest, I'm sure there was A LOT people didn't know about me until I found out about my affiliation with the moon.\"<br>\r\n<br>\r\nThe two were almost to class, but Terisa gives Alan a quick hug as best she could. \"Ohhh, you even talk smart too!\"<br>\r\n<br>\r\n\"Uhhh, yeah.\" Alan took it as no surprise. \"I suppose I do.\"<br>\r\n<br>\r\nA few minutes into class, Terisa and Alan were off taking notes while their instructor, a male crocodile, was standing in front of the class and lecturing to them. After about a half hour of lecturing, the croc turns to face the class. \"Alright class. Hope you've been writing good notes\", Terisa starts to gasp under her voice, \"'cause there will be a test next week on all of this. Be sure to keep up with this.\"<br>\r\n<br>\r\nTerisa lets out a gasp of relief. \"Oh... Thank goodness.\"<br>\r\n<br>\r\n\"Darn. And I was so ready for it too.\" Terisa stares at Alan with a stern look on her face, Alan just grinning and winking back at her.<br>\r\n<br>\r\nTerisa lets out another sigh, \"I still don't think I'm gonna pass this. Or barely even make a C.\"<br>\r\n<br>\r\nAlan ponders to himself, twirling his pencil in his meaty hand. \"Oh! I know.\" Alan faces the distressed tigress, \"Why don't you stop by my dorm? I'm sure we can, study, then.\"<br>\r\n<br>\r\nTerisa raises her head, blushing at the idea. \"Mm...\"</span></div></div>",
            "created":1359781200,
            "id":1522206,
            "title":"Anatomy Class"
        },
        "11222111121211121112111112121211":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "They continue this for the next few days.",
                "Skip to after they take the test."
            ],
            "content":"<div class=\"\"><div> <span>Terisa was still blushing as she returned her gaze to her notes. Alan sorta knew that Terisa was most likely running some kind of fantasy in her head right know, the way she hesitated in accepting his invite. But he was also thinking of how it might turn out, although it was a little less on the fantasizing part.<br>\r\n<br>\r\nIt was later after the day's classes were over when Terisa decided to come to Alan's dorm for their study session. She knocked a couple times before Alan welcomed her inside. Terisa was holding her anthro anatomy textbook, along with all the notes she took that day.<br>\r\n<br>\r\n\"Wow, you've got a nice place here.\" Terisa said, looking around.<br>\r\n<br>\r\n\"Heh, thanks! So, ready to start hitting the books?\" Alan asked.<br>\r\n<br>\r\nThe next several minutes or so were spent with Alan trying to explain the different body parts and muscle groups to his girlfriend, who's brain was having trouble keeping the information inside. In fact, both were already getting a little tired from having to go through the same groups over and over again.<br>\r\n<br>\r\n\"...Alright, let's just try one more time...Do you know what this muscle is called?\" Alan asked, pointing at the diagram's arm.<br>\r\n<br>\r\n\"Uh...I-I know it has 'ceps' somewhere...Um...Dryceps?\"<br>\r\n<br>\r\n\"*sigh* So close, yet so far. It's the 'triceps' You almost got that one.\"<br>\r\n<br>\r\n\"Ugh! I can't believe this stuff! Did they have to think up of names this complicating!?\" Terisa yelled, throwing some papers into the air.<br>\r\n<br>\r\nAlan felt bad at how the study session was going. At this rate, Terisa really will fail the test next week! He had to think of something...Something to help her visualize the different muscle groups, and actually keep the information stuck there. That was when Alan's head turned a light bulb on.<br>\r\n<br>\r\n\"Terisa, I think I might have something that can help. The test is only on the different muscle groups, right?\"<br>\r\n<br>\r\n\"Yeah, but it's hopeless. I can't even get a single muscle right...\"<br>\r\n<br>\r\nTerisa looked pretty down. Alan then started taking his shirt off, which caught her attention a bit. The wolf then flexed an arm, making the huge, steel-hard muscles pop out with veins snaking across it. Alan pointed at one part of his arm.<br>\r\n<br>\r\n\"Over here is the biceps. This muscle contracts when I flex my arm, and relaxes when I relax my arm.\"<br>\r\n<br>\r\nTerisa was staring at his arm as Alan relaxed it, then pointing at another part.<br>\r\n<br>\r\n\"And over here, we've got the triceps. This muscle works vice versa to the biceps, so it relaxes when I flex, but contracts when I relax my arm.\"<br>\r\n<br>\r\nNext, Alan now pointed at his godly eight-pack.<br>\r\n<br>\r\n\"And what we have over here is a fine example of what we call the abdomen. These rock-hard bumps you see here are the abdominal muscles, which allows me to lean my upper body forward, or backward. You may feel them to know what I'm talking about.\"<br>\r\n<br>\r\nTerisa was wide-eyed at this point, being so close to such finely-sculpted muscles. She laid a hand on Alan's abs, which he happily flexed for her.<br>\r\n<br>\r\n\"Ooh, these are definitely a fine example of abdominal muscles. But, how is this gonna help me for the test? N-not that I'm complaining...\"<br>\r\n<br>\r\n\"Easy. Just think of me when you take the test, and you'll know which is which. I guarantee it. And besides, you really think you can forget these after a few more sessions?\" Alan said with a grin.<br>\r\n<br>\r\nTerisa giggled as she saw what Alan was talking about. Laying a hand on his arm, she can hear his voice talking about which is which inside her mind.<br>\r\n<br>\r\n\"The biceps, the triceps, the abdomen...And, can you inform me what these beautiful muscles are called?\" Terisa said, placing a hand on his chest.<br>\r\n<br>\r\n\"Why, these are the pectoral muscles, my dear Terisa.\" Alan said, tensing up his chest so Terisa can feel the raw power inside.<br>\r\n<br>\r\nTerisa giggled as she continued to feel Alan's muscles more. So far, this is definitely her favorite study session, ever.</span></div></div>",
            "created":1364187600,
            "id":1557481,
            "title":"Study Session"
        },
        "112221111212111211121111121212111":{
            "author_id":"bygameboy",
            "author_name":"bygameboy",
            "choices":[
                "Mark is on the warpath!",
                "Someone's in trouble!"
            ],
            "content":"<div class=\"\"><div> <span>Days had gone by, Alan spent his time balanced between Gerome and Terese. When he was with Gerome theyd talk about muscles, workouts, and other stuff. When he was with Terese it would either be studying or enjoying each others company. <br>\r\n<br>\r\nhe was currently having lunch with Terese. \"Thanks for helping me study, the test next period will be easy now\"<br>\r\n<br>\r\n\"Hey no problem. don't forget. think of me\" he said flexing.<br>\r\n<br>\r\nshe nodded and left for her class. Alan got ready to follow when suddenly Gerome ran up in a panic<br>\r\n<br>\r\n\"Dude you gotta help me!\" Gerome said</span></div></div>",
            "created":1429133940,
            "id":1964767,
            "title":"They continue this for the next few days."
        },
        "1122211112121112111211111212121112":{
            "author_id":"bobosmith01",
            "author_name":"Risha",
            "choices":[
                "Refuse to get her involved",
                "Ask Teresa"
            ],
            "content":"<div class=\"\"><div> <span>Alan swiftly turned to Gerome-The polar bear's normally calm nature was gone, sweat dripping down his white fur. <br>\r\n<br>\r\n\"Dude, what's the matter?\" Alan spoke quickly, focusing all of his attention on his friend.<br>\r\n<br>\r\n\"Okay, so you remember the football team?\"<br>\r\n<br>\r\n\"Yeah, of course. Something the matter?\"<br>\r\n<br>\r\n\"You think?\" The sports player grunted, taking another deep breath. \"Anyways, we have a game away <i>tonight.</i> Most of the cheerleaders and players caught a cold or something, and we're down. Point is, I really need you to help us out.\"<br>\r\n<br>\r\n\"Alright, I might be able to fill in, but what about the cheerleaders?\"<br>\r\n<br>\r\n\"That's the other problem. For some reason, some of the girls said no. Party somewhere. ...Think you can ask Teresa?\"<br>\r\n</span></div></div>",
            "created":1438723860,
            "id":2016741,
            "title":"Countdown"
        },
        "11222111121211121112111112121211122":{
            "author_id":"bygameboy",
            "author_name":"bygameboy",
            "choices":[
                "He feels the ring there as always",
                "The ring is gone! And the clouds are threatening to move!"
            ],
            "content":"<div class=\"\"><div> <span>Alan nodded \"Yeah I'm sure She'll love to. I'll go find her now!\" Alan dashed off with his muscled legs throbbing. <br>\r\n<br>\r\nHe ran into her quickly. \"Hey Trixie I need a big favor!\" He said<br>\r\n<br>\r\n\"If you want to do another study session\" she started<br>\r\n<br>\r\n\"No not that\" the wolf said, \"This is for the school! The cheerleaders are missing some, and I want you to join them.\"<br>\r\n<br>\r\n\"You want me to be a cheerleader?\" Trixie asked clearly not expecting that<br>\r\n<br>\r\n\"Just this once, unless you want to do it more.\" Alan said, \"Please? Its for the school\"<br>\r\n<br>\r\nTrixie thought it over, \"Alright. I'll do it for the school, and for you\" She smiled and walked off.<br>\r\n<br>\r\n\"Awesome! that other team doesn't stand a chance!\" alan grinned flexing.<br>\r\n<br>\r\nLater that night it grew dark. The game took place at nighttime. As promised Trixie was in a cheerleaders outfit and joining the others. Alan had struggled to put on a football uniform with Gerome helping. <br>\r\n<br>\r\n\"Your gonna kill em out there.\" He said. Alan nodded then gazed up at the sky frowing. <br>\r\n<br>\r\n\"Another full moon\" he said, \"I can sense it\"<br>\r\n<br>\r\nGerome blinked and looked up, but clouds were in the way for now. \"Eh doesn't matter\" he said.<br>\r\n<br>\r\n\"Yup, as long as I have my ring.\" Alan said feeling his chest.</span></div></div>",
            "created":1448524800,
            "id":2066811,
            "title":"Ask Teresa"
        },
        "112221111212111211121111121212111222":{
            "author_id":"riolande",
            "author_name":"Rio",
            "choices":[
                "show trixie your muscles see if she likes it.She is your fiance after all",
                "go for the match first its much more important"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh no its gone\"Alan yells<br>\r\n<br>\r\n\"What?how did you lose it\"<br>\r\n<br>\r\n\"must have lost it sometimes a while ago\"<br>\r\n<br>\r\n\"O.K what do you think we should do?\"<br>\r\n<br>\r\n\"well the shirt still fits you and you can do a bit of growth right? just get another ring tomorrow. We need you man\"<br>\r\n<br>\r\n\"O.K if you say so\"<br>\r\n<br>\r\nAlan starts to fill the strange warm filling coursing through his already magnificent muscles.<br>\r\n<br>\r\n\"question is how much will i grow?\"<br>\r\n<br>\r\n\"what you normally should i think\"says Gerome <br>\r\n<br>\r\n\"well there is only one way to find out\"<br>\r\n<br>\r\nAlans groans as his biceps grow larger and even more magnificent. His Abs thickens hardens and forms another layer his chest grows larger and huge.Alan moans as his Muscles expand with the full moon.<br>\r\n<br>\r\n\"well what do we do now?\" queries Gerome<br>\r\n<br>\r\n\"well i think that the growth is complete why not go for the match now?\" says Alan flexing his humongous muscles \"wait till Trixie sees this\"<br>\r\n<br>\r\n\"well do you wanna show her now or later after the match?\"</span></div></div>",
            "created":1470811080,
            "id":2193845,
            "title":"The ring is gone! And the clouds are threatenin..."
        },
        "1122211112121112111211111212121112222":{
            "author_id":"user474",
            "author_name":"NotMyself",
            "choices":[
                "He tried to put on his clothes.",
                "He checked his weight."
            ],
            "content":"<div class=\"\"><div> <span>Alan walked towards the field, more confident than ever with another 20 new pounds of muscle. He felt unstoppable. Weighing in at nearly 400 pounds and nearly 7’ feet tall, he may have been. He walked onto the field, feeling how the uniform fit him perfectly. The game began, and as he expected, he dominated. He and Gerome scores a combined 56 points, but he was more concerned about his uniform. The sweat was causing the uniform to clench up. Gerome told him, “You see why we get our uniforms loose?” “Yeah, but we won. It’s not like it matters.”<br>\r\nAs Gerome entered the locker room...</span></div></div>",
            "created":1591844400,
            "id":2849392,
            "title":"The match"
        },
        "11222111121211121112111112121211122221":{
            "author_id":"user474",
            "author_name":"NotMyself",
            "choices":[
                "Yeah...",
                "No, that’s wrong."
            ],
            "content":"<div class=\"\"><div> <span>Gerome walked into the locker room, with Alan right behind. The two both tried to wipe as much sweat as they could off their massive bodies, before giving up and just putting their clothes on. Gerome has brought an extra pair, Alan had the same T-shirt that was Gerome’s father’s. “Hey, that thing nearly fits you now.” Gerome told him. It took Alex a second to realize that the previously loose shirt now fit him perfectly. “Huh, wonder how big that spurt was.” He thought to himself, before saying goodbye to Gerome and meeting Trixie. <br>\r\n<br>\r\n“You feel bigger,” she told him as he walked her back to her dorm. “Yeah, I... lost the ring.” He sheepishly told her. “Oh no, that’s so bad.” She told him, sarcasm dripping from her voice. “If you truly want to stay at this size, figure something out soon, because there’a another full moon tomorrow, it happens once ever 10 years or so. Of course it chooses to happen now.” Alan was worried now, these current clothes fit him fine but could they handle another growth spurt? They were already feeling slightly uncomfortable, he needed to ask Gerome for another size up or two. He preferred loose clothes anyway, but that would be hard to find considering he was only getting bigger.<br>\r\n<br>\r\nAlan finished taking Trixie to her dorm and ran back to his firm’s gym. He wanted to test the new muscle he got, and he was loading 400 pounds into each side of the bench bar, nearly everything the gym had. He started slowly doing reps, beginning to pick up speed before stopping at 100 as Gerome entered. “Ey, you getting a late night workout in as well?” “Yeah,” Alan told him, “I’m restless and I wanna rest out this new strength.” The two talked for an hour or so while working before Alan piped up. “Oh yeah, do you have a size or two up from what you gave me? Apparently there’s a full moon tomorrow as well, Trixie told me.” Gerome, surprised, nearly dropped the 750 pounds he was lifting before he told him, “Already? That spurt can’t have added more than 20 pounds. Come over to my dorm real quickly and I’ll see what I have.”<br>\r\n<br>\r\nThey both went to Gerome’s dorm, and Alex got about a dozen different shirts, all of which were too big for him. For now. “Thank you so much, again.” Alan told him, embarrassed he had nothing in return. “Eh, it’s not like I can wear these. Hopefully in a year or two, we can’t all be magic werewolves. And while you’re here, let’s check your weight.” Gerome pulled out an industrial scale, rated to be able to handle 1 ton. Alan steppes onto it and was a little over 430 pounds. “We really underestimated that last spurt. I’ve actually got 2 of these, shipping company messed up. You can take one.”<br>\r\n<br>\r\nAlan thanked Gerome again, picked up the scale and returned to his dorm. He placed the scale in the corner of his room and checked on his height like he had been meaning to. “7’3”, woah.” He then stepped on the scale again to make sure he set it up right. “435 pounds? That can’t be right...”  he thought to himself before realizing, “Wait a minute, was I growing the entire time I was under the moon?” Well, it couldn’t hurt to sleep outside tonight and “learn about it” tomorrow, right?</span></div></div>",
            "created":1591900980,
            "id":2849741,
            "title":"He tried to put on his clothes."
        },
        "112221111212111211121111121212111222212":{
            "author_id":"user474",
            "author_name":"NotMyself",
            "choices":[
                "Next morning."
            ],
            "content":"<div class=\"\"><div> <span>He quickly shook the thought out of his head. “No, I shouldn’t do that.” He told himself as Trixie called him, “Hey, come over here. I’ve got Gerome and, like, 10 other people over right now.” “Yeah, sure, be there in 15 minutes.” He said without a second thought, quickly showering and getting the clothes on. They were just ever so slightly becoming snug, but barely noticeable, as 5 pounds of muscle could be spread out pretty far on a 7’3” body.<br>\r\n<br>\r\nHe arrived shortly, trying to decide whether to run as to not get too big, or walk to avoid getting sweaty. However, Trixie made that decision for him when he saw everyone outside in the back section of the dorm. He walked through the door, being grateful for the dorms to be designed to look old, with double doors that reached up high. Had this been his house at home, he might have a problem.<br>\r\n<br>\r\nHe walked onto the back deck as Trixie pulled him aside to tell him who all the other people were. He said hi to everyone, and he, Trixie and Gerome all talked for hours, Alan forgetting that he’d be growing the entire time. They all talked about the game and how well they did as people began to file out until it was just the 3 of them. They walked back to their respective dorms until it was just Trixie and Alan, again. Alan was becoming more conscious of how the shirt was now snug on him. If he didn’t find some form of silver for tomorrow, these current shirts would be useless. He was thankful when he saw his dorm, quickly ducking inside before any damage could be done. Trixie followed him in, telling him that “My roommate’s having her boyfriend over, it’s gonna be impossible to sleep.“ she told him as he removed his shirt, showing off his diamond cut 8-pack and below two thick pecs, all covered in a blanket of thick, fluffy black fur. “Hey, what’s that thing in the corner?” She asked him, pointing to the scale. “It’s a scale, and yes, I’ll get on it for you.” He stood on it, he now weighed nearly 460 pounds, gaining another 25 from all the time outside. It had a built in height checker as well, meant to be used to lock things in place, but it could get used for this as well.<br>\r\n<br>\r\n“ 7’6”, wow.” She told him, not able to say much else. She was pretty tall herself, but she reached up to just under Alan’s pecs. Alan told her goodnight and climbed into bed. She laughed, watching how he took up the entire thing. After he fell asleep, she climbed on top of him, sliding under one of his arms. It was easily the best sleep she was going to have. His pecs made a perfect pillow, being big enough she could rest her head in between the two, and his chest and arms combined to make a wonderfully soft and warm mattress, with his arms being big enough to cover her body from the waist up.<br>\r\n<br>\r\nShe fell asleep in just a few minutes, the intoxicating sense of warmth, safety, and security helping her along.</span></div></div>",
            "created":1591902060,
            "id":2849744,
            "title":"No, that’s wrong."
        },
        "1122211112121112111211111212121112222121":{
            "author_id":"user474",
            "author_name":"NotMyself",
            "choices":[
                "Nightfall",
                "He gets a call first."
            ],
            "content":"<div class=\"\"><div> <span>Alan woke up to his alarm, quickly noticing Trixie sleeping on his chest, feeling how her weight was so light on him. He looked at her as she woke up, laughing at how such a big guy was so flustered. She slipped out and said goodbye to him, as Alan got dressed and left for his morning classes. He went through the day, itching to talk to Gerome and get to practice.<br>\r\n<br>\r\n<br>\r\nThat time finally came, and he was able to let out so much energy in the hour he had. After that, he went to the cafeteria to get lunch, looking for Gerome. “Hey, I’m getting bigger.” “When, tonight?” Gerome asked. “No, any time there’s moonlight now.” Alan told him. “Um, wow, that’s...” Gerome said, worried. They both sat there eating, each trying to find what to say and how to say it. The bell rang, breaking the tension as they went to their classes. Alan’s mind was more focused on tonight, and he returned to his dorm as the time hit 5pm.</span></div></div>",
            "created":1593465300,
            "id":2858676,
            "title":"Next morning."
        },
        "12":{
            "author_id":"blitz2",
            "author_name":"Helpinghand23 ",
            "choices":[
                "Why he is processs this information he grows again",
                "He look over himself",
                "Someone saw the transformation ",
                "His memories change",
                "He goes to a doctor to see how this is possible "
            ],
            "content":"<div class=\"\"><div> <span>As he was staring at the moon his body begaon to grow his biscets looked like they had basket ball in them. As he saw this his legs gave out and he fell to the ground his les started to gain musle pound after pound as they look they were being filled with rocks. Then his stomach hurts as his abs started to form a perfect six pack. He then grew to six feet tall. When this was over he decided to get up and look at home self. </span></div></div>",
            "created":1526307720,
            "id":2493077,
            "title":"He gains 200 pounds of muscle"
        },
        "13":{
            "author_id":"jerrodinferno",
            "author_name":"the black ripper jerrod",
            "choices":[
                "to go work out looking never worked out before",
                "he's very, very hungry",
                "he smells something , and it's benevolent",
                "he hears cries for help"
            ],
            "content":"<div class=\"\"><div> <span>Alan felt like his body literally exploded before he got a good grasp what's going on next thing he knew what he was on the ground, then done not in the pit of his stomach erupted into ripples of excruciating pain. Pain that he did not know even existed a ripped its way across Alan body it was so bad he couldn't even scream himself<br>\r\n<br>\r\nThen if you like his body exploded for the second time, all the pain that he was experiencing right their double<br>\r\n<br>\r\nBut through it all his body was going to a change that he soon would not forget<br>\r\n<br>\r\nThe entirety of his body started gaining – no – stacking on the pounds of muscle. His arms went from we ask to a person who must've been working out for half his entire life ,complete with impressive peaks. Even his forearms were rippled with the same strength<br>\r\n<br>\r\nHis torso was next his chest field out ridiculously good any girl would love to feel on. Not to mention his stomach ripped up into a crazy strong sixpack<br>\r\n<br>\r\nAll about this his back was not neglected as it is now amateur bodybuilders his age would weep for shame if they swa him compared their own bodies<br>\r\n<br>\r\nlastly his legs took on the challenge of becoming the very definition of defined in huge. His eyes looking reminiscent of that of the mountain range made of meat and fur<br>\r\n<br>\r\nAlan could not help but to breathe heavy after all this insane changes to a his body<br>\r\n<br>\r\nHe stood up he just barely had time to realize  his pants, shoes and shirt were tight <br>\r\n<br>\r\nThen out of nowhere at all in vomited on the ground<br>\r\n<br>\r\nThen he filled his body starts shaking again<br>\r\n<br>\r\n\"Oh no, oh God no\"<br>\r\n<br>\r\nPain racked Allen's body again it was so bad he couldn't maintain consciousness<br>\r\n<br>\r\n---------------------------------------------------------------------------- ------------------------------------------------------------------------------<b r></b>\r\n<br>\r\nwhen Alan woke up again he was still staring up at the moon you rolled over to his side<br>\r\n<br>\r\nAlan took a moment to look down at his body. And he had it do a double take to see if what he was saying was real<br>\r\n<br>\r\nTo sum up how Alan body looks right now in one word<br>\r\nthat one word would be: monstrous<br>\r\n<br>\r\nEvery part of Allen's body was not only huge not only ripped to shreds but incredibly strong, Alan could just feel that<br>\r\n<br>\r\nEven his foot paws muscular now<br>\r\n<br>\r\nhis fangs look ferocious, his claws look deadly<br>\r\n<br>\r\nand lastly his eyes were glowing brilliant yellow<br>\r\n<br>\r\nThis new because you just can keep that out a window cracking earthshaking howl <br>\r\n<br>\r\nthen something else must having a weird urge which was:<br>\r\n</span></div></div>",
            "created":1369501020,
            "id":1596555,
            "title":"He gains 300 pounds of muscle"
        },
        "132":{
            "author_id":"blitz2",
            "author_name":"Helpinghand23 ",
            "choices":[
                "The fridge has some meat in it",
                "He doesn't have enough food",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>He feels a overwhelming hunger his stomach was growling like crazy. Alan monster arms go to his stomach in pain he never felt this hungry before and after the pain of his body growing he doesn't want to risk having more pain so he gets up and goes to the fridge to get something to eat.</span></div></div>",
            "created":1543677600,
            "id":2584349,
            "title":"he's very, very hungry"
        }
    },
    "info":{
        "author_id":"nyx2857",
        "author_name":"Thoughtful Writer",
        "brief_description":"A wolf anthro grows muscle during the full moon! MG ONLY!!!",
        "created":1308624720,
        "description":"<td align=\"left\" class=\"norm\">This is a story of a wolf anthro male who grows muscle during the full moon. Here are the rules:<br>\r\n<br>\r\n1) He's the only one that grows<br>\r\n2) Muscle growth only. No fattening, expansion, etc.<br>\r\n3) The wolf character does not get corrupted or power hungry. He's an ok guy.<br>\r\n4) Keep it decent. That means no gay, vore, or sex stuff.</td>",
        "id":1787004,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1593465300,
        "modified":1593465300,
        "pretty_title":"Full Moon Muscle"
    }
}