{
    "chapters":{
        "1":{
            "author_id":"darksandman",
            "author_name":"THExDARKxSANDMAN",
            "choices":[
                "\"My name is Clarice Scarlett...\"",
                "\"My name is Christopher white...\""
            ],
            "content":"<div class=\"\"><div> <span>You approach the wooden door of a rather large mansion, after the hike up the lengthy driveway you are already slightly winded.<br>\r\n\"this place really is in the middle of nowhere\" you say to yourself \"I hope this guy isn't some crazy old weirdo\"<br>\r\nyou raise your hand to knock but before you can lay a knuckle on the door it opens up. behind it stands young girl with dark black hair pulled into a ponytail and still wet from a shower. shes adorned in nothing but a purple tank top and sweatpants that bag around her ankles, her bare feet poking out from under the fabric. She looks up at you with bright green eyes, seeming slightly impatient she asks \"can i help you...?\"</span></div></div>",
            "created":1467432780,
            "id":2173914,
            "title":"The New Job"
        },
        "12":{
            "author_id":"darksandman",
            "author_name":"THExDARKxSANDMAN",
            "choices":[
                "\"Are your parents home?\"",
                "\"so about this job\""
            ],
            "content":"<div class=\"\"><div> <span>\"My name is Christopher white, im here about a job interview for the position of assistant housekeeper\" you smile kindly.<br>\r\nShe returns a faint smile \"guess some people still do read the newspaper after all.\" she gestures inside \"My name is Anya by the way, will you come in? its far to bright outside.\"<br>\r\nyou step into the house, its slightly dark but everything is perfectly visible. This is a greeting area there are couches and a table in the middle, the walls are adorned with fine knickknacks and a few mysterious objects who's purpose you cant begin to fathom. You figure you should say something to break the ice.</span></div></div>",
            "created":1467433500,
            "id":2173932,
            "title":"\"My name is Christopher white...\""
        },
        "121":{
            "author_id":"darksandman",
            "author_name":"THExDARKxSANDMAN",
            "choices":[
                "\"Sorry if you look like a 12 year old kid...\"",
                "\"my apologies I meant no disrespect\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she narrows her eyes harshly and furrows her brows. \"im sorry? what was that?\" she appears agitated by the question. \"im not as young as i look Mr. White...\" <br>\r\nYou decide she is definitely offended, you respond...</span></div></span></div>",
            "created":1467433800,
            "id":2173942,
            "title":"\"Are your parents home?\""
        },
        "1211":{
            "author_id":"darksandman",
            "author_name":"THExDARKxSANDMAN",
            "choices":[
                "\"Your flat body obviously\"",
                "\"your so small\""
            ],
            "content":"<div class=\"\"><div> <span>She goes beyond agitated in the blink of an eye, her eyes flash in disbelief for a second before returning to cold narrow slits. \"wait right there...\" she says softly before walking around the corner, she returns a moment later holding a large leather bound book in one hand. \"tell me... Chris. do you know what kind of assisting you were going to be doing in my mansion?\"<br>\r\n<br>\r\nyou shake your head nervously<br>\r\n<br>\r\n\"You were going to be a witches assistant, MY assistant. I have no need for rude assistants but maybe I have another position for you to fill...<br>\r\ntell me what made you think i was only a child?\"<br>\r\n<br>\r\n\"this girl is nuts\" you think \"a witch? ya ok\"<br>\r\nyou answer her question... \"i thought you were a child because...\"</span></div></div>",
            "created":1467434400,
            "id":2173955,
            "title":"\"Sorry if you look like a 12 year old kid....."
        },
        "12111":{
            "author_id":"darksandman",
            "author_name":"THExDARKxSANDMAN",
            "choices":[
                "\"Your such an asshole!\"",
                "\"Stop running your mouth an help me\"",
                "\"Im sorry!\""
            ],
            "content":"<div class=\"\"><div> <span>As if she couldn't get any madder, her pale face reddens as she examines her small breasts. \"oh i see\" she snarls \"you think women should be curvy? then i have the perfect place for you...\" she looks down at the book she is holding and mutters something under her breath.<br>\r\nyou feel kinda tingly all the sudden, like your arm is falling asleep or something except the feeling has spread all over your body.<br>\r\n\"whats happening to me?!\" you begin to panic, you go to take a step but your leg wobbles and you fall. you try to recover but your body is no longer responding to your commands. <br>\r\nyou look up to see the girl standing above you, she places her bare foot on top of your chest and smiles triumphantly. \"I hope you enjoyed casting insults at my body, you are going to be spending alot of time with it from now on.\"<br>\r\nyou need to say something quick...</span></div></div>",
            "created":1467435060,
            "id":2173958,
            "title":"\"Your flat body obviously\""
        },
        "121111":{
            "author_id":"darksandman",
            "author_name":"THExDARKxSANDMAN",
            "choices":[
                "Not a chance",
                "i guess i don't have a choice..."
            ],
            "content":"<div class=\"\"><div> <span>the girl takes a few steps away from you and places her hands on her hips, in one swift motion she drops her sweatpants revealing her curvy bottom clad only in a pair of tight boyshorts. stepping out of her discarded pants she walks back over to you allowing you to gaze up at her from below. she gets on her knees and places her behind up to your face. you feel your pants tighten as your manhood hardens, \"what are you---\" you are cut short as she sits back on your face smothering your cries and filling your nose with the sent of her. you can feel her slight wetness through her fabric underwear. <br>\r\n\"no talking\" she says with a pant \"your tongue only has one use right now\" she reaches back and pulls her underwear down revealing her small tight asshole nestled between her cheeks. \"you can use that tongue to please me, and if you do well i might show you some mercy\"</span></div></div>",
            "created":1468866840,
            "id":2182573,
            "title":"A poor choice of words"
        },
        "1211111":{
            "author_id":"gfamus",
            "author_name":"Besaisgo",
            "choices":[
                "She shows you what she can do to you",
                "She does more than just show you"
            ],
            "content":"<div class=\"\"><div> <span>\"No way!\" you say as best you can from beneath her petite form, unwilling to please someone that is treating you like this. But, little did you know, is that it was a grave mistake to deny her command as you are about to learn what she is truly capable of...<br>\r\n<br>\r\nYou protest \"i don't want to be anywhere near your ass!\"<br>\r\nshe stands up and gazes down at you with malice in her eyes \"I don't like you very much, you are boring, and rude, and not very appealing to look at either.\" then her face lights up, \"i have the perfect way to deal with unsightly guests like you.\" she drops her panties the rest of the way down to her ankles, her womanhood is glistening in the light dripping with excitement. she beckons with a finger and your body forces itself into an upright sitting position. she once again lowers her backside to you \"you might want to take a deep breath, not a whole lot of air were you are going.\" before you can protest further her ass cheeks are resting on your face and you nose is buried deep within her tightly puckered ass. your eyes are wide with panic.<br>\r\n<br>\r\nshe lets more of her weight down on you and just when you think your neck might snap from the force, Her body gives way and your face begins to fall more and more into her backside, just before your ears are eclipsed you hear her laugh \"maybe you should be a little nicer to people you just met. you acted like shit and now your going to a place were shit belongs, right up my ass.\"<br>\r\n<br>\r\nshe lets her weight down hard and the rest of your head is immersed into her colon, the tight walls press tight against your face. the descent stops at your shoulders \"thank god\" you think to yourself \"i dont think she can go any further.\". no sooner had the though perished then you felt the walls of her ass start to move, pulling you upward into her gut. pushed from the outside and pulled from within, the muscular circle found its way around your shoulders. <br>\r\n<br>\r\n****NOT COMPLETE*****</span></div></div>",
            "created":1468899900,
            "id":2182762,
            "title":"Not a chance"
        },
        "122":{
            "author_id":"darksandman",
            "author_name":"THExDARKxSANDMAN",
            "choices":[
                "Caring for animals",
                "House and groundskeeping",
                "Assist her with studies"
            ],
            "content":"<div class=\"\"><div> <span>\"oh? eager to get started are we? very well i can walk you through some of the responsibilities you will need to keep up with if you like\"<br>\r\nAnya reaches in her pocket and pulls out a list \"lets see here... what should we go over first?\"</span></div></div>",
            "created":1467438720,
            "id":2173982,
            "title":"\"so about this job\""
        }
    },
    "info":{
        "author_id":"darksandman",
        "author_name":"THExDARKxSANDMAN",
        "brief_description":"A shrinking/vore story that puts you in the place of a young witches new assistant.",
        "created":1467431340,
        "description":"<td align=\"left\" class=\"norm\">Hey everybody just a few things before we begin but i'll keep this brief. <br>\r\n<br>\r\n1.) This is a vore story! people will be eaten inserted and otherwise ingested, if any of that makes you uncomfortable please leave.<br>\r\n2.) 18+ only. this was intended for mature audiences<br>\r\n3.) Anyone can contribute! please use proper grammar and spelling (im not going to scold you for minor issues but please use good judgement)<br>\r\n4.)There is no hard vore (chewing, dismemberment, crushing ect.) Allowed. sorry not my thing.<br>\r\n5.) Graphic digestion is allowed but use blood gently<br>\r\n6.) This story contains magic so you can get creative (do not change the subject matter however)<br>\r\n7.) This is an interactive story don't make links like (she ate you) leave a little bit of surprise for the reader.<br>\r\n8.) I reserve the right to remove unsuitable links without warning, I also reserve the right to add new rules as they are needed.<br>\r\n<br>\r\nThank you for reading and contributing, enjoy the show!<br>\r\n</td>",
        "id":2089040,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1468899900,
        "modified":1468899900,
        "pretty_title":"The Witch's Assistant"
    }
}