{
    "chapters":{
        "1":{
            "author_id":"raptor1",
            "author_name":"Raptor1",
            "choices":[
                "Male Vampire",
                "Female Vampire",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Vampire do you want to start with?</span></div></span></div>",
            "created":1274733840,
            "id":888522,
            "title":"Which Vampire?"
        },
        "11":{
            "author_id":"raptor1",
            "author_name":"Raptor1",
            "choices":[
                "Alucard (from Hellsing)",
                "Slayer (from Guilty Gear) ",
                "D (from Vampire Hunter D)",
                "Count Di-Amon (from Bastard!)",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, which male vampire do you want to start with?</span></div></span></div>",
            "created":1274734380,
            "id":888534,
            "title":"Male Vampire"
        },
        "12":{
            "author_id":"raptor1",
            "author_name":"Raptor1",
            "choices":[
                "Rachel Alucard (from Blazblue)",
                "Miyu (from Vampire Princess Miyu)",
                "Evangeline A.K. McDowell (from Negima)",
                "Seras Victoria (from Hellsing)",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which female vampire do you want to start with?</span></div></span></div>",
            "created":1274734680,
            "id":888541,
            "title":"Female Vampire"
        },
        "122":{
            "author_id":"raptor1",
            "author_name":"Raptor1",
            "choices":[
                "Rachel Alucard (from BlazBlue)",
                "Miyu's Evil Doppleganger",
                "Someone Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, now who does she fight?</span></div></span></div>",
            "created":1299648300,
            "id":1067478,
            "title":"Miyu (from Vampire Princess Miyu)"
        },
        "1221":{
            "author_id":"raptor1",
            "author_name":"Raptor1",
            "choices":[
                "Miyu Wins",
                "Rachel Wins",
                "HERE COMES A NEW CHALLENGER!!!"
            ],
            "content":"<div class=\"\"><div> <span>Miyu was walking down the streets, searching for a new meal, or a new shinma to hunt, when a golden sphere of energy suddenly appeared with a radius of fifty feet. Everyone in or around the dome vanished as soon as it appeared. However, a certain young blond girl with red eyes appeared inside the golden sphere at the opposite end of Miyu.<br>\r\n<br>\r\n\"You're Rachel Alucard.\" Miyu said. \"Yes, and you're Miyu.\" Rachel replied. \"Hmmm...this is the first time we've met, yet we know everything about each other.\" Miyu said, while placing her right hand up to her mouth. \"Yes, that is strange.\" Rachel replied while looking around. \"You wouldn't know how to get out of here, would you?\"<br>\r\n<br>\r\n\"I would.\" A male voice said from above. The two immediately turned their heads skyward and saw a velociraptor standing atop the golden sphere, waving at them with its right talon. The dinosaur was also dressed in a black, leather trench coat that hung open, revealing its bare chest, and a pair of black, leather pants. The velociraptor also wore a pair of spectacles. <br>\r\n<br>\r\n\"Hi there.\" The dinosaur said, before lowering his arm. \"The short version of this thing is that you two have to fight until one of you can no longer continue. Once that happens, everything will go back to normal. So...begin!\"<br>\r\n<br>\r\n\"So we have to fight for your amusement? I think not! I have better things to do!\" Rachel replied indignantly. \"As do I!\" Miyu said. The dinosaur chuckled and then squatted down. \"Actually, you don't. This sphere isn't going to disappear until The two of you fight and someone wins. I'm the one who set all this up, which is why I am out here and you are in there. You know I am not lying. Why do you think you knew about each other as soon as you saw each other for the first time? So that this would be a fair fight. And maybe the fight isn't just for my amusement. Maybe there is a temporal anomaly in the time/space continuum and the only way to fix it is by one of you beating the other in a fight.\"<br>\r\n<br>\r\n\"What will happen to the people who disappeared when there is a victor?\" Miyu asked. \"Everything will return to normal and the two of you will be free to go......from me, anyway.\"<br>\r\n<br>\r\n\"How are we supposed to win?\" Rachel asked. The velociraptor stood up and said, \"Kill each other...fry each other...drink each other's blood...hypnotize each other...cast a spell of permanent exhaustion...oh wait...you're vampires, not wizards, soooooo you can't do <i></i> that<i></i> but you get the idea, right?\"</span></div></div>",
            "created":1299651420,
            "id":1067496,
            "title":"Rachel Alucard (from BlazBlue)"
        }
    },
    "info":{
        "author_id":"raptor1",
        "author_name":"Raptor1",
        "brief_description":"Like Celebrity Deathmatch, only with vampires.",
        "created":1274733720,
        "description":"<td align=\"left\" class=\"norm\">Rules:<br>\r\n<br>\r\nAnything goes. However, any stupid posts like, \"Rachel and Miyu had sex then Miyu burnt Rachel to a crisp. The End.\" will be deleted.<br>\r\n<br>\r\nKeep the story focused on the vampires fighting. You can write about something else only if it has something to do with the current battle. (Example: the Loch Ness Monster VS Bigfoot episode of Celebrity Deathmatch.)<br>\r\n<br>\r\nThe Vampires can be in character or out of character. Also, you can create an original character if you want (as long as it is a vampire of course.).<br>\r\n<br>\r\nLET'S GET IT ON!!!</td>",
        "id":1675984,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1299651420,
        "modified":1299651420,
        "pretty_title":"Vampire Deathmatch"
    }
}