{
    "chapters":{
        "1":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "To mom's room.",
                "Cindy's room.",
                "To the kitchen."
            ],
            "content":"<div class=\"\"><div> <span>I would've never believed it possible but sure enough here I am shrunk to the size of a flea on my bedroom floor. I was feeling very strange all day so I decided to take a nap early in the evening, that's when a painful tingling sensation shot through my body. I just jumped out of bed and was about to scream to my sister for help when I saw the world spin around me and seem to grow bigger. Now here I am staring in shock at my bed high above.<br>\r\n<br>\r\nIt's very cold as the air is expansive relative to my very tiny body. There is a constant ambient noise of air making it very loud constantly. Everything towers impossibly big and seems far away. Even my bedroom door is at least two miles away. How am I going to get help? Then I realize, my phone is still in my pocket as my clothes shrink with me! I pull out the phone and try to make a phone call to my sister as my mom is at work but there is no signal. The phone is too tiny to be of any use in that regard. Looking at the time on it, I see that it's seven at night, my mom will be here any moment. But for now I should get out the bedroom.<br>\r\n<br>\r\nAs I make the long walk to the door, I couldn't be happier that the whole house is hardwood floor except the tiles of the kitchen and bathroom. If it were carpet, it would be like traveling through a forest. I would be hopelessly lost. The once smooth floor is slightly bumpy with scuffs everywhere and a light dust coats the ground. I am happy I cleaned the room so travel is easy besides how long it is. By the time I get to the door twenty minutes passes by. Even though the door is closed the gap under the door is spacious enough to hold several story buildings of height before it would hit the bottom of the door. I walk right through.<br>\r\n<br>\r\nI take a moment to look around the hallway and my heart sinks. I'm not getting to anybody anytime soon. It's even longer of a distance to get anywhere. Even the bathroom just across from my room is like 3/4 of a mile, nevertheless walking down the hallway to reach any other room. The pictures on the walls of the family are massive portraits that put billboards to shame. Looking down the hallway, I see a closed door with a light shining from under it. I also hear unintelligible voices echo through the air from it. Cindy's room. Did she have someone over? Maybe it's just her TV. Either way, she seems to be my only option. <br>\r\n<br>\r\nAs I start to walk I hear a loud bang from the other side of the hallway. A loud clacking rhythm cracks through the air and the ground quivers with each \"CLACK!\" Suddenly from around the corner of the hallway and living room comes a mountainous figure that I can make out in what little light comes from the evening sky shining through the windows. Wearing a white blouse and black skirt with black high heel sandals, my gigantic mom walks towards me with a tired look on the slight wrinkles around her eyes. I try to frantically yell for her and wave my arms but as she gets closer I realize how useless it is. I knew she was big but as she gets closer, I realize she is at least a mile in height to me. She doesn't even bother to look in my direction! With each step her heels take, the ground quivers and the clacking noise echoes through the air. It all intensifies as she gets closer, her stride carries her thousands of feet with each step. In seconds she is upon me and I cower as her right foot lands right next to me, the displaced air blowing me against the baseboard like dust. My eardrums nearly shatter from the noise of her heel crashing into the ground. The woman continues to walk on by to her room, leaving me with my back against the wall in a seated position with my pants wet from pissing uncontrollably.<br>\r\n<br>\r\nAfter a minute to collect myself, I stand up and decide where to go from here...<br>\r\n</span></div></div>",
            "created":1482901200,
            "id":2255538,
            "title":"Out The Door"
        },
        "11":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Follow her in there.",
                "Get on the bed.",
                "Get in her purse"
            ],
            "content":"<div class=\"\"><div> <span>Even though Cindy's room is closer, I decide it will be better to go to my mom for help. There is no doubt Cindy would help me but my mom is more mature and can probably come up with a more rational decision on what the hell needs to happen for life to be normal again. The only immediate problem is the travel. My mom's room is all the way at the back of the hallway. That's several miles to me.<br>\r\n<br>\r\nIt takes nearly an hour. At several points during the walk, I would fearfully cling against the wall as the ground would shake and the thunderous boom of footsteps would be heard but nobody ever left their rooms. I would grow used to this as I continued to walk. As it got later, the hallway got darker. With my mom's bedroom door closed, I go through the gap under it just like I went through my own door.<br>\r\n<br>\r\nI walk into the room and take a moment to take in the sight of the now ginormous master bedroom. The dressers and bed are larger than any city building fathomable. To the left of me are my mom's high heel sandals that stretch into the sky. Next to those are her favorite black flip flops. The soles of the once thin flip flops are several stories high to me, like a wall of rubber. One of them is upside down with its sole exposed to me to show me the gunks of dirt and even pancaked bug carcasses the size of buses. My mom hates bugs and the thought of her noticing me as one brings a shiver to my spine but what's scarier than that is the thought of her never noticing me since i'm barely any bigger than a flea. <br>\r\n<br>\r\nWith my immediate surroundings taken in, I look just ahead on the bed is my gigantic mother. But I immediately look away as I see she is almost completely naked sitting on the edge of her bed with her cellphone in hand wearing only black panties. Her large breasts sway at her breaths and her pudgy slight overweight stomach jiggles. With shades of red on my face, I turn to face her again realizing that I can't let my morals get in the way. I need to get her help at all costs. <br>\r\n<br>\r\nAs I start to walk towards her, the woman suddenly rises up off the bed and tosses her phone down on top of it before reaching down to pull off her panties exposing a jungle of blonde hairs around her vagina. The giantess walks towards her bathroom, creating chaotic earthquakes with each step before walking in and closing the door. <br>\r\n<br>\r\nI figure she is most likely about to take a bath. What do I do?</span></div></div>",
            "created":1482901200,
            "id":2255588,
            "title":"To mom's room."
        },
        "111":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Climb up the shower curtain.",
                "Stay here."
            ],
            "content":"<div class=\"\"><div> <span>I walk past the gigantic shoes and towards the bedroom bathroom. Even though it's only a few steps away for a normal sized person, it's miles away to me. Meanwhile, I hear the monstrous sound of a waterfall erupt in the distance. The bathwater. Yet the sound doesn't change into the more dispersed sound of the shower-head. Which means she's taking a bath instead of shower which gives me more time.<br>\r\n<br>\r\nAs I get closer, the sound of the bathwater dissipates and then I hear the sound of a splash like a large mass entering a body of water. I hear the sounds of water moving for about ten minutes until it finally stops. I am now at the door. <br>\r\n<br>\r\nGoing under the door, I transition from being on hardwood floor to being on the tiled floor of the bathroom. Each tile is large enough to have a tennis match on. Ahead of me is the toilet, a super massive porcelain structure along with the counter next to it. In the distance ahead, I can make out the blurry imagine of my mom's upper body as she rests in the tub. Her head leaned back and her eyes closed as she lounged in the warm water.<br>\r\n<br>\r\nI make my way over to her, avoiding the rug in front of the counter and toilet to avoid getting embarrassingly lost in the tall carpet strands. After several minutes, I am near the tub. My mom's features are now less blurry as she is more like a mountain range in high definition. She is so big and I feel that she is so close so I yell her name for her to look down but my voice is too tiny for her to hear. I mean, she is still very high in the sky while being in the tub. I'm going to have to get closer but there's no way I can scale the smooth porcelain walls. I look to the left of the tub to see the navy blue shower curtain. It's material has tiny holes in the stitching that I can put my fingers through and climb if I'm brave enough or foolish...</span></div></div>",
            "created":1482987600,
            "id":2256054,
            "title":"Follow her in there."
        },
        "112":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Go to the phone.",
                "Stay out of the way, at the edge of the bed."
            ],
            "content":"<div class=\"\"><div> <span>With how far her bathroom is from here, there is no way I'll reach her in time. She'd probably finish her bath and be walking out by the time I even get anywhere near the tub. In order to get help I'm going to have to think smart and plan ahead of these enormous giants. My mom is going to take a bath and most likely wind down on the bed before going to sleep. If I get on the bed, she'll be laying still and awake giving me time to get her help.<br>\r\n<br>\r\nI walk closer to the bed and realize that this is taller than any existing building, it's like a mountainous plateau extending more than one thousand feet into the air. My fear for heights makes me hesitate my decision but if I let it dominate my choices from here on out I'll never get attention. <br>\r\n<br>\r\nUnder and surrounding my mom's bed is a thick cream colored rug used not only to stop the bed from scuffing her floors when it moves but for decoration. To me, this is a huge forest of carpet fibers as thick as tree trunks. I have to navigate through them for several long minutes until I reach the base of the bed. Normally it would be impossible for me to get up the bed, but my mom's comforter hangs off the edge and touches the ground. At my size, the smallest holes in the stitching of the blanket is more than big enough for my hands to fit inside and grasp like the rope ladders thrown off the side of old ships. From here, I begin my very long climb to the top.<br>\r\n<br>\r\nIt had to have taken over an hour. Good thing my mom took a very long time in the bathroom. But now I'm on top of the bed. I lay down on the thick comforter and take deep breaths, covered in sweat and my arms pained in exhaustion. The top of the bed is a vast field with wrinkles in the blankets and sheets looking like large hills and slopes with the pillows in the distance being mini-sized mountains. Something then catches my eye, my mom's phone. Maybe I can head to it and see if I can use it to get her attention?</span></div></div>",
            "created":1482987600,
            "id":2255863,
            "title":"Get on the bed."
        },
        "1122":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Try to get her attention now.",
                "Wait until she falls asleep so there's less of a chance she moves."
            ],
            "content":"<div class=\"\"><div> <span>Even though the phone would normally be a good idea. I know that I'm just too tiny  to be able to affect the screen at all. And at the best, when Mom leaves the bathroom, she would probably check her phone and tilt it downwards without seeing me, causing me to tumble to my doom. At the worst, she thinks I'm a tiny gnat or something and squishes me with her finger to rub me off the screen. Although using the phone isn't an option, what I can do is move close to it on that side of the bed. After all, when most people get on beds they get on it from the side and I don't want to risk getting smothered onto the mattress. <br>\r\n<br>\r\nMoving to the other side of the bed is a several minute journey like any distance of a few feet or more at this size. Going up and down wrinkles in the sheets, I am soon at the foot of the bed, near the phone. Then in the far distance from the bathroom, I hear the sound of the drain being unplugged as gallons among gallons of water finds its way down the pipes. The thought of being in the tub while that's going on is terrifying to me. The sound of splashing is heard and then minutes of rummaging in the bathroom before silence.<br>\r\n<br>\r\nThe loud, ominous creaking of the door breaks the silence and out walks Mom wearing a white robe with a white towel wrapped around her wet hair. Her tall body moist and glistening. She is so far away that she's blurry to me but she starts walking, the wood floor moaning under her weight with each booming step accompanied by the slapping noise of her barefeet. She towers over the bed that took me awhile to climb and walks right past it, her body producing a strong breeze that makes waves on the sheets as she passes that spreads her soapy scent through the air. Mom walks out the bedroom door leaving it cracked open and I'm left wondering if she plans on being in the living room, she could be going to the kitchen to cook but she usually doesn't cook when she comes home after working overtime. <br>\r\n<br>\r\nI am left wondering if I should stay on the bed or begin a climb down to start walking to the living room or try getting help from Cindy instead when the door swings to full open and I see my mom carrying a glass of red wine. She walks to the side of the bed that I was on earlier, putting the glass on her bedside table and then she bends down to set a knee on the bed before lowering the rest of her body onto it to sit down with her back against her pillows and headboard. The bed bucks and bounces wildly while the mattress springs groan at the weights imposed on them. I manage to hold on to the sheets instead of being launched into the air by the chaos. Eventually all settles down and I'm left staring at my mom in the distance. Her legs slightly spread to reveal her canyon-like pussy under her robe while she pulled out a book from the drawer of the bedside table. <br>\r\n<br>\r\nI decide to..</span></div></div>",
            "created":1483160400,
            "id":2257052,
            "title":"Stay out of the way, at the edge of the bed."
        },
        "11221":{
            "choices":[
                "In the hairs of her vagina",
                "In her glass of wine"
            ],
            "content":"<div class=\"\"><div> <span>I have to get her attention now! Or else I don't want to be stuck never getting the attention of anyone! I look forward and can't help but stare at the wrinkled soles of my mother's gigantic bare feet. Her giant toes slightly wiggle increasing the wrinkles in each sole. It makes me wonder how she could crush me underneath one of them and never even know. So I walk past them and look down the hallway of her giant legs. It seems like forever, when all of a sudden a large creaking sound and an earthquake happened, but it was just my mother, Joyce, leaning over to grab a glass of wine. The earthquake happened again when she leaned over to put it back on the nightstand which made me fall in the sheets. When I lifted my stuff back up I looked straight ahead, about a hundred feet, and saw her huge forest of pubic hair which was completely all over her monstrous vagina. I couldn't believe this, I actually got turned on and hard. I started to touch myself and I felt myself getting wet quickly. I then started to think, Dan you are masturbating to your mother, Joyce!!!! I meant to stop myself, but it was too late, as I ejaculated looking at my mother's giant pussy. This is not good. Then all of a sudden, my mother rolled over a little bit to put her phone in the charger, as her gigantic right knee almost landed on top of me. I dodge just in time, but watched as her knee landed in and squished the tiny puddle of cum that I left in her sheets. When she turn back over, she adjusted herself, roughly, and at the same time sliding her butt towards me and putting her feet flat on the bed with her knees raised up high. She bounced a little too when she slid her butt up causing me to pop into the air and land...</span></div></div>",
            "created":1486530000,
            "id":2274937,
            "title":"Try to get her attention now."
        },
        "112211":{
            "content":"<div class=\"\"><div> <span>I wasn't sure where I was. I was hanging out for dear life, with kind of a furry substance all around. I felt my toes and feet tangled up a bit and I grabbed a big rope of the fur in my face.  There was a warmth and humidity all around me as I turned to see alot of pinkish, fleshy material that slightly glistened behind me. There was a slight musty, but sweet smell emerging from the flesh. Then I felt vibration and a deep humming sound that went through me. It was a very familiar hum with a small chuckle, it was my mom's voice. I screamed for her and looked up and saw her face in the distance, way up high. They were beyond her giant breasts and up along her stomach. Then I realized where I was, her vagina!!! \"OH NO! MOOOOM! DOWN HERE!!!!\" I shouted as I struggled to climb the bush to get down. \"What are you stuck, hehe?\" my mother said. I couldn't believe it. She sees me. \"Yes MOM PLEASE HELP ME.....\" \"Finally! I've been waiting and drinking a bit too much. Hehe. Mmmm.\" She said. \"What? Mom?\" I was confused until I heard it. \"Well I'm here now hun.\" Another voice, a male voice, no, no , NOOOOOO! A large shadow elicpiced all around as I heard and felt the mattress creak and give way under human weight. I saw a huge torso of a human male lean over top and saw his chin as he kissed my mother. This was my mother's boyfriend, and they're about to have sex whether I like it or not. It's getting hot as the slurping of the kisses gets louder and vibrations get rougher. My mother's moans get more and more frequent as I hear skin slapping. Then a large chunk of flesh starts pushing her forest of hairs towards her clit. He was fingering her and I was forcefully pushed against her moist vaginal lips. I try to scream but my mother's moans drown me out and a salty wetness covered my face. His fingers disappeared and I heard laughing and moaning from both people. Then my mother's fingers appeared and pushed into her lips, rubbing so softly, but aggressively rough from my perspective, pushing me further in and right onto her clitoris. It was slippery and fleshy as I tried to stay a foot but it didn't matter as I felt more aggressive movement than before. My mother's lips were spreading apart and her moans got real loud as I saw it. The gigantic throbbing, moist penis head of her boyfriend. It came at me light a freight train and wasn't about to slow down. It backed up and came back again. I was now face to face with his penis hole and a bit of cum poured out all over me. Then I felt my bones crackle was his penis slid and literally steamrolled over me. I stuck to a part of his throbbing beast as I was pushed deeper into my mom. Then the storm like back and forth crushed me and crushed me and crushed me and CRUNCH. It was over. My body was destroyed. Squashed and smeared between them. They were still going at it, enjoying every second and unaware that I was even there. The more they enjoyed, the more I suffered. I never had a chance.</span></div></div>",
            "created":1487912400,
            "id":2281632,
            "title":"In the hairs of her vagina"
        },
        "113":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Her work cubicle.",
                "Her booth at a fast food restaurant.",
                "A women's footwear store at the mall."
            ],
            "content":"<div class=\"\"><div> <span>Well, there is no way I'll be able to reach her at the bathroom in time. It's so far away, unless she took a really long bath, there is no way I'd get to her in time.  And getting on the bed? It's so high, it seems like an impossible climb. There just isn't a feasibly, realistic way to get help and I feel completely hopeless. Then I see it, my mom's purse tipped over next to her bed.<br>\r\n<br>\r\nI make the journey to the purse and after several minutes, I am at its opening. It looked like a large cave dwelling that could fit a city. A lipstick tube in there is the size of a sky scraper to me. I walk through the various clutter and trash to get deep in the back. <br>\r\n<br>\r\nMy mom uses her purse for everything, I just have to wait. If anything she will definitely use it when she goes to work. I think she has work tomorrow. After several long minutes of silence, I drift into a sleep in the dark enclosure.<br>\r\n<br>\r\nThe world tips over sideways and I go into a free fall! Gigantic clutter falls around me. A tampon packet almost lands on me to crush me flat. I look up and through various objects I make out the light of the purse's opening high above. It looks significantly brighter than before I slept, it must be morning time. After the eventful tip over, several minutes pass with no real action besides what I think are my mom's footfalls as she gets ready to leave. I catch very brief glimpses of her when she walks near the purse, her body so high above, I can't even make out her face or what she's wearing. Probably an hour of this goes by until I catch her gigantic hand reaching towards the opening at first but then misses to go to the side giving me only a view of her powerful arm. Her hand then comes back into view, holding the purse's straps. G-Forces push my body downwards and more clutter falls around me as my mom lifts up the purse and all I can do is watch the ceiling move. The white ceiling becomes blue sky as she walks out the house and off the porch to the outdoors. But that sky then becomes the interior of the car, the roar of the engine nearly deafening. The car is on the move and after half an hour, the car engine stops and Mom grabs the purse again starting another walk.<br>\r\n<br>\r\nThe blue sky becomes a white ceiling again. The sound of various voices at once echo to create a loud environment. The feeling of weightlessness occurs as my mom sets down the purse but it accidentally tips over again giving me a chance to escape! I run out the purse to see I am at...</span></div></div>",
            "created":1482987600,
            "id":2255873,
            "title":"Get in her purse"
        },
        "12":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Cindy on her bed watching TV.",
                "Cindy and her friend Kayla on the floor watching a movie."
            ],
            "content":"<div class=\"\"><div> <span>Cindy's room is by far the best decision by virtue that it is the closest room. I walk down the hallway and after fifteen minutes, I am across from her bedroom door. I have to cross the hallway, something very scary to me as I would be right in the path of my mom or sister if they walk out but I don't have a choice. I run as fast as possible across the hall for a couple of minutes and stop only when I'm just in front of her door. <br>\r\n<br>\r\nWalking through the gap under it, my eyes are filled with the brightness of her light above, representing a false sun. The room is a mess. There are clothes everywhere; including a pair of pink panties that could fit several domed stadiums to the right of me, a sock to my left, overturned shoes and trash line the floors up until I look ahead to see...</span></div></div>",
            "created":1482901200,
            "id":2255809,
            "title":"Cindy's room."
        },
        "122":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Cindy",
                "Kayla"
            ],
            "content":"<div class=\"\"><div> <span>It's Cindy and her red haired friend, Kayla. Kayla is sitting with her back against the bed while Cindy is laying on her stomach with her legs and feet under the bed. Both are watching some movie while snacking on a pack of microwaved popcorn in between them.<br>\r\n<br>\r\nAs I maneuver past more junk littering the bedroom floor, I become more mesmerized by how gigantic these girls are. Kayla's feet are humongous, as her pale sole stretches beyond that of any sky scraper I can compare them to. With both girls staying still and calm, getting help shouldn't be too difficult I hope. But who do I approach? Kayla is closer but Cindy is my sister. <br>\r\n<br>\r\nI go to...</span></div></div>",
            "created":1482987600,
            "id":2256108,
            "title":"Cindy and her friend Kayla on the floor watchin..."
        },
        "1221":{
            "author_id":"akplez",
            "author_name":"Mr. Phorcys",
            "choices":[
                "Cindy rolls over and you're under her butt",
                "You decide to start climbing",
                "Kayla notices you, and thinks your a bug"
            ],
            "content":"<div class=\"\"><div> <span>I choose Cindy. After all, she is my sister. I trek towards her, trying to stay covered by the various pieces of trash and clothing scattered on the floor. But it's slow going. Eventually, at about the time I passed Kayla's other foot, I decide to just move quickly, beelining towards my sister. When I get to her hips, I pause to catch my breath. But just then...</span></div></div>",
            "created":1486357200,
            "id":2274385,
            "title":"Cindy"
        },
        "12211":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "content":"<div class=\"\"><div> <span>I feel relieved that I made it here safely. Passing in front of Kayla's massive feet was the scariest thing I ever done in my life. I never knew preteens could ever be able to scare me so bad but here I am, the size of a tiny ant trying to get my little sister's attention. Even at Cindy's hips, I realize my journey is far from over. I look down her enormously long body as she lays on her stomach with her elbows planted on the ground and her hands under her chin. Down the opposite side of her body, I cannot help but be awestruck by her long legs stretching a vast distance to her feet under the bed. <br>\r\n<br>\r\nSnapping my thoughts back to reality, I think about what I should do next. I need to get her attention. Maybe I can walk in front of her and just wave my arms. She would look down eventually, see me and I can get help. Yeah, that should work. I am about to start walking alongside her hip to reach her front when the ground shakes and a strong wind knocks me off balance!<br>\r\n<br>\r\nCindy shifts her position by shooting her body upwards and then she lets her legs pass from underneath her and shifts her body to the right just slightly before she lowers her butt, deciding she wants to sit upright like Kayla. The motion is so simple for Cindy and she thinks nothing of it.<br>\r\n<br>\r\nI let out a scream as Cindy's massive ass covers over me like a gigantic meteor before crashing down, causing my body to leave a red speck on right ass cheek jeans that will go completely unnoticed.</span></div></div>",
            "created":1537686300,
            "id":2552029,
            "title":"Squashed"
        },
        "12212":{
            "choices":[
                "A bowl of onion dip her and Kayla are dipping chips into",
                "Kayla's slushie "
            ],
            "content":"<div class=\"\"><div> <span>I start to climb my giant sister as I hang on to a thread on the cuff of her jeans. She pulls her leg up and sends me flying upward and I land on top of her knee.  I keep hearing her voice, loud and echoing, I try to scream for her attention, but it's impossible for her to hear me at my size. My frequency is way too low and no matter how loud my efforts are, she would never detect me. Just then her hand came down and brushed me off of her, causing me to fall and land in a sticky liquid.</span></div></div>",
            "created":1537803600,
            "id":2552863,
            "title":"You decide to start climbing"
        },
        "122122":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Kayla drinks through the straw to finish what is left of her slushie.",
                "The girls pause the movie to throw away the slushie cups and get another drink.",
                "Someone knocks over the slushie cup, freeing me in a river of slushie."
            ],
            "content":"<div class=\"\"><div> <span>If it was not for the g-forces being imposed on me while I am flying through the air, I would be in absolute pain from being flicked off my sister's knee. Her fingers were like sky scrapers smacking a tiny city inhabitant, if it was not for the fact that she put no force into it and her skin was not soft, I would have been splattered into a pulp. Instead, my body feels like it has been slapped by a freight train as I continue flailing my arms about uselessly while I fall, fully expecting the fall to end my life. <br>\r\n<br>\r\n<b>SPLASH!</b><br>\r\n<br>\r\nI fall into an ocean of blue water that chills me to my bones. I have an instant gasp reflex as all the heat exits my body in less than a second while I try to swim up to the surface. It feels like it takes me several minutes to push myself up past the thick liquid until my head erupts out the icy waters and I draw in a huge breath of air. With my mouth open, the water enters onto my tongue giving me the taste of a syrupy berry flavor. Looking around while swimming in place, I see swaths of blocks of blue ice floating everywhere. Some of them are like icebergs with a large piece of ice floating out the surface but an even larger body of ice underneath the water. I then take note that surrounding this ocean I am in are clear walls of glass or plastic that extend far above and the only way out is a large, red, cylindrical device that is lodged into the icy waters and extends out and above the imprisonment. I realize that I am trapped in a cup that contains only a minute amount of slushie in it and the only way out is a giant red straw!<br>\r\n<br>\r\nI climb up the nearest block of blue ice to get out of the slushie juice before I get hypothermia. I am shivering and I know I will not last here for long so I do the only thing I can and use my arms to paddle my way towards the straw. Once I reach it, I realize that the straw is too smooth to climb and even if I did climb it, I would have nowhere to go to escape the cup still. Looking past the clear walls of the cup, I see Kayla, the red headed tween far above, is completely absorbed in the movie she is watching while fitting the occasional chip that could fit several houses in proportion to you inside her massive mouth with her tongue dyed in blue from drinking the slushie.<br>\r\n<br>\r\nCalling out for her attention is completely useless and she would have to look super close into the cup to even notice that I am a speck in her drink, nevertheless a tiny person. Even worst is that the slushie has stained me blue and I blend in with the blocks of ice and liquid. While I try to ponder my next move, Kayla bends her knees while leaning her back against Cindy's bed and lets her feet be placed firmly on the floor because she was starting to lose circulation in them. She starts to wiggle around her toes to regain blood flow. This seemingly harmless movement, causes the slushie waters to churn and make tidal waves while I hold on to the ice block for deal life all because of the impact of Kayla's simple, absentminded movements. <br>\r\n<br>\r\nMy prayers for this chaos to end are answered, in a way, when...</span></div></div>",
            "created":1537812000,
            "id":2552946,
            "title":"Ocean of Dark Blue"
        },
        "1221223":{
            "choices":[
                "Joyce sees a bug that she is about to crush ",
                "Joyce sees more debris on the ground that needs to be vacuumed up "
            ],
            "content":"<div class=\"\"><div> <span>Even though I knew I could not be heard, because my frequency was way too low for my sister or friend to hear me, I screamed and waved my arms and did everything I could to get their attention. I had a better view of Kayla as she was continuing to eat chips and watch the movie. Just then, like a flash, I saw the huge Barefoot of my sister blow past the cup that I was in, knocking it over. My world was like an earthquake in a monsoon at the same time. Everything was rocked and I was being carried out with a flood of ice cold slushie. I was covered and nearly drowned when all of a sudden I heard a large creaking as I looked to see the Cup being lifted way ,way up into the distance. And in my view, were the tips of 20 gigantic bare toes. I looked up to see my sister Cindy and her friend Kayla miles and miles and miles in the sky. Cindy had accidentally kicked the cup over and most of the slushie Spilled Out. Luckily I was in it ,however it was so thick I had a hard time trying to get out. I struggled and struggle as much as I could, as I noticed both girls walk out of the Room. I was nearly out and free of the slushie when, large trembling booms started surrounding me. I looked up and seen the bare feet of Cindy and Kayla stomping towards me and then all of a sudden, I was surrounded by four giant knees. I looked up as Kayla was approaching the area where I was with a wad of paper towels. She brushed right over me as she soaked up and started cleaning up some of the slushie. I tried to run when I got nicked by the finger of my sister Cindy as her wad of paper towels started soaking the other side. I wasted no time knowing that this was a certain death to me. So I just ran. I kept running and running and running, and as I reached the door to the hallway, I noticed the girls getting up as they finished cleaning. They were both stomping towards me again. The earthquake from their feet made it almost impossible for me to keep my balance, but I made it into the Hall just as the edge of Kayla's  heel slammed down right next to me. Her heel then lifted up and stomped down the hall into the bathroom with my sister Cindy. My heart was racing as I knew that if I was just a centimeter to the right, I would have been crushed instantly under Kayla's heel. I stopped and took a breath, knowing that I needed to collect myself, and knowing that everything right now is okay. I then turned around to see a giant high heel shoe stomp down  right in front of me! I looked up see the face of my mother Joyce, looking down at me. I was super tiny, naked, and stained light blue from the slushie. Joyce then..</span></div></div>",
            "created":1537852740,
            "id":2553345,
            "title":"Accidentally kick over the slushie cup, freeing..."
        },
        "12212232":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Back to Cindy's room.",
                "Into the bathroom.",
                "My tiny legs can't carry me far enough, I can't escape!"
            ],
            "content":"<div class=\"\"><div> <span><font class=\"size1\" style=\"\">\"Mom! Down here! It's me!\"</font> I cry out but my voice doesn't even reach past her ankles nevertheless to her looming face seemingly miles above. <br>\r\n<br>\r\nJoyce scanning the ground, is disgusted by how dusty the hallway floor is. It looks like it has not been vacuumed in weeks! All kinds of lint and crumbs from Kayla's room dot the hardwood floor. Even with Mom looking straight down at me, I am just too tiny for her too detect. She would have to squat down to get a closer look and even then, thanks to the slushie staining my body, she would probably just mistake me for an insignificant piece of blue lint. <br>\r\n<br>\r\n<b><font class=\"size35\" style=\"\">\"This hallway is disgusting\"</font></b>, Joyce bellows with a booming echo with her hands on her hips and standing high above me. I crane up my neck to look up her long legs, past her skirt and blouse to see the scowl on her face. Or at least what looks like a scowl, she is so high above that I can barely make out her facial features like seeing blurry objects from a long distance. <br>\r\n<br>\r\n<b><font class=\"size35\" style=\"\">\"Don't worry kids, I guess I'll be your maid and vacuum it!\"</font></b> Joyce's voice reverberates through the air with a power that shakes me to my core. Her enormous high heel lifts up and sails above me, briefly casting a shadow over my body as I am greeted with a view of her shoe's sole covered in grime and bug carcasses from insects she has unknowingly squashed. As her shoe dashes, my new ceiling is replaced by a view of under her skirt, only to discover she is wearing no panties and revealing her valley-like pussy. <br>\r\n<br>\r\n<b><font class=\"size4\" style=\"\">CLICK!</font> <font class=\"size45\" style=\"\">CLACK!</font></b><br>\r\n<br>\r\nJoyce's heel lands behind me from her first step, causing the ground to violently tremble and I lose balance as my legs buckle underneath me. Thankfully the impacts of her next step is less powerful as her long legs carry her seemingly tens of miles in the course of seconds as she walks down the hallway to open the linen closet and grab the vacuum cleaner. <br>\r\n<br>\r\nShit! I need to get out of here quickly! I start running past boulder and house-sized crumbs and lint balls as I sprint as fast as my legs can go while Mom's heels start making the ground tremble again as she walks closer to plug the vacuum into the socket. Meanwhile I can only hope it is not too late as I run...<br>\r\n</span></div></div>",
            "created":1537897380,
            "id":2553753,
            "title":"Amongst Debris"
        },
        "122122321":{
            "choices":[
                "She noticed a bug on the floor and grabbed a napkin.",
                "Cindy came in to greet her."
            ],
            "content":"<div class=\"\"><div> <span>I have to act now, and I have to act quick. My mother obviously never noticed me and that vacuum would certainly be the death of me. I just ran as fast as I could towards my sister's bedroom. As I was approaching the entrance way, my mother had plugged in the vacuum. I heard her heels clicking and she moved closer to the cleaner, as I turned around to see her foot lift up and step down on the \"on\" button. The noise was incredibly loud. It was like a storm was approaching. And to add to that, the wheels of the vacuum and the clicks of her heels added to it as I was deafened by the sound and the vibration coming from it rattled the floor making it harder for me to actually run and keep my balance. And to make matters worse just as I was almost about to crawl back into my sister's room, a huge Dark Shadow fell over me. I looked up just in time to see the Flesh of the sole of Kayla's bare heal, as I rolled out of the way just in time before getting squashed into the floor. Kayla stepped back into the room. I was safe, or so I thought, as my sister Cindy's toes bashed into me, and kicked me from behind. I was kicked in the air, and landed hard on the ground, far from Cindy's room, as I saw in the distance Cindy disappear into her room, and close her door. The sound of the vacuum was still loud and the vibrations were still felt. As I saw my mother turned towards the direction where I was. I got up and started running again as I felt my mother approaching closer and closer and closer, as I took a sharp left towards the kitchen. I made it just in time as my mother walked by with the huge cleaner. I even felt the wind and the suction of the cleaner start to lift me up. But she pushed it so quick that it didn't have enough of a chance to claim me. I knew she was coming back, and I knew that when she wasn't done cleaning as she would start sweeping the kitchen. Once she starts cleaning all debris is doomed. At least I have enough time to collect myself and figure out a way out of this, when suddenly a huge figure walked into the kitchen, as I noticed a huge sandaled foot land hard on the ground. I looked up to see my giant larger-than-life grandmother. She had come to go shopping with her daughter, my mom. She was about to take a seat at the kitchen table knowing that my mother was vacuuming, and had no problem waiting. As I ran to get our attention<br>\r\n</span></div></div>",
            "created":1538399880,
            "id":2557405,
            "title":"Back to Cindy's room."
        },
        "1221223212":{
            "choices":[
                "Grandma thought I was a bug",
                "Cindy thought that I was a bug"
            ],
            "content":"<div class=\"\"><div> <span>Just then a large Barefoot, with five huge massive toes slammed down right behind me. As I cranked my head up, I saw my giant sister Cindy towering over me. She greeted our grandmother and gave her a big hug. I screamed at the top of my lungs as I stood between the sandal foot, and the Barefoot of these two giants. I jumped, I waved my arms, I screamed, I did everything I could but none of my sounds even got near their ears. None of my motions were even detected by them. They continued to chat, as I continued to fight for my life to at least get noticed. And then I said to myself, \"I just wish that one of them would see me\". Just then my wish was granted. As one of them looked down, and noticed a tiny moving Speck between their feet.</span></div></div>",
            "created":1542979620,
            "id":2580911,
            "title":"Cindy came in to greet her."
        },
        "122122323":{
            "content":"<div class=\"\"><div> <span>The sound of the vacuum was monstrous. Debris start flying everywhere as it was being sucked right into the powerful machine. The rolling of the machine on the floor caused thunderous vibrations, which made it difficult for me to keep my footing. The Stomps of my mother's giant feet, caused even louder and more powerful vibrations, as I fell to the ground over and over. I got up, and tried to run as fast as I could, but I was overtaken by a strong gust of wind. This wind didn't Blow me, but sucked me. I try to grab onto any piece of debris, or section of carpet that I could, but it was no use as my mother rolled the powerful giant machine  right over me, and I was never seen again. To my mother, I was nothing but a piece of debris that dirtied her floor. To my mother I was nothing but a crumb that was instant garbage. To my mother I was nothing but an unwanted item that she wanted removed from her home and her life permanently. I was bashed around in this dark noisy powerful tunnel, as debris larger than me pelted me and bashed around me, until I was crushed and bashed enough to my death. My mother eventually turned off the machine. And went on with her day, happy that she cleaned all that unwanted filth, including me off of her floor and out of her life for good. Even though I went missing, no one would know that I ever shrunk, and no one would know that my own mother vacuumed me up like garbage.</span></div></div>",
            "created":1542980100,
            "id":2580914,
            "title":"My tiny legs can't carry me far enough, I c..."
        },
        "12213":{
            "content":"<div class=\"\"><div> <span>\"EEEEWWWWWWW! A BUG!\" screamed Kayla! <br>\r\n\"EWWW WHERE?\" said Cindy, looking all over.<br>\r\n\"RIGHT THERE!\" screamed Kayla as I notice her finger pointed right at me!!!! I have to get out of here as I started to back away, but was interrupted by a loud commotion which included an earthquake as the floor beneath me shook, causing me to fall to my knees! The sound was disturbing as the rustling of the two giants above me stirred about in a panic and included words like, Shit, damn, ewww, ugh, where did it go, and KILL IT! I was then surrounded, as I looked at twenty, gigantic toes scrunched all around on both sides of me and as I looked up, two humongous faces with disgusted looks on them! I knew at this moment that I needed to get their attention, but it was impossible as they would not get close enough to recognize me. I was a teeny bug as far as they were concerned and their minds weren't willing to consider anything else but how I was going to be killed. Make no mistake, I would have been stepped on already, but they were both barefoot and probably didn't want my guts on their feet. But I did notice Kayla back up a bit and slip on one of her flats! This was not good! She will step on me for sure! As I backed up, I failed to notice my sister slip on her flip flop as I hear her say with a confident and satisfying tone, \"Got it!\" I tuned just in time as I saw my sister's right foot lift up and hover above me, showing me the sole of her dirty black flip flop! I screamed and quickly backed up, but this monstrous foot would have it's way! Like an titanic, epic ship out of Star Wars, Cindy slammed down her foot! My teeny self never stood a chance, as in an instant, my body gave way and popped like a pimple, my bones all cracked and crushed into dust and my guts all squished into liquid, but nothing was heard by the girl's but Cindy's foot slamming down. Cindy applied all her weight as the tips of her toes turned white and she twisted her foot 3 times then followed by firmly dragging her foot backwards, smearing me completely into a tiny, barely noticeable streak. <br>\r\n\"Showed you little bug.\" Cindy said as she smiled so proudly.<br>\r\n\"Stupid little thing. Women rule haha!\" Said Kayla as she kicked off her flat and laid back down and the girls continued the movie and soon forgot about the insect. Poor Dan never had a chance as his own sister considered him insignificant as she killed him despite his teeny pleas of help.</span></div></div>",
            "created":1486530000,
            "id":2274942,
            "title":"Kayla notices you, and thinks your a bug"
        },
        "1222":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Go to the living room.",
                "Go to another bedroom with a light on under it's closed door."
            ],
            "content":"<div class=\"\"><div> <span>I decide Kayla is a good option. She's closer and I'm sure she will help me. I've seen Cindy crush bugs without hesitation and the thought of her treating me like one makes me shiver. I don't know Kayla that well but I'm willing to take a risk. I reluctantly walk past a pair of black flats in front of her outstretched left foot. Just the sheer size of them are flat out intimidating to me. I would never be able to escape in time if they were descending upon me, no matter how fast I ran.<br>\r\n<br>\r\nAfter making it past the shoes, I watch as Kayla keeps her nearest foot, the left one outstretched but moves her right foot back as she bends her knee and uses her arms to hug that leg while being engrossed in the movie. I walk along her long leg, noting how many of the freckles and blotches on them are bigger than my body. I soon make it past her denim shorts and soon I'm right beside her and craning my head all the way back to look up at her. She seems so close and all enveloping to me but in comparison to my size, her head is probably about half a mile above. <br>\r\n<br>\r\n\"K-Kayla down here! Please look down!\" I yell up at her with my hands cuffed over my mouth to get louder but the volume of the TV is just too loud. Even if the room was dead silent would she even be able to hear my tiny voice?<br>\r\n<br>\r\nKayla continues to watch the TV without looking down. Even if she did glance down, it's highly unlikely she would be able to decipher me from being a piece of lint or some kind of tiny bug. I need to get her to feel me to examine me closer or even just get closer to her eyes. I could go to her bare legs and try to pound on them until she notices me but if she reacts by scratching or mistakes me for a flea trying to suck her blood, I would be crushed into paste before she could get a second look. The only option I have is climbing her. The denim material of her shorts have many grooves that I can fit my hands in between like an easy rock wall.<br>\r\n<br>\r\nI walk closer to Kayla's now gigantic posterior seated on the floor. I needed to start climbing soon, if she adjusted her seating position just slightly, I would be smothered under her weight. I grab at the material and start the long climb. It takes almost an hour of climbing until I reach her waistband right near one of her belt loops and I still have so much more climbing to do. <br>\r\n<br>\r\nAs I'm about to reach up to continue climbing, the sound of a generic phone ring is so loud that my ears are screaming. Kayla lifts up her cellphone that was on the other side of her body and from my angle I can see that it says \"Mom\" for the caller ID. <br>\r\n<br>\r\n\"Pause it, it's my mom.\" Kayla demands as she pushes the touchscreen \"Talk\" button.<br>\r\n<br>\r\nCindy pulls out the remote and pauses the TV, while Kayla puts the phone to her ear. It's now quiet enough in the room to where you can hear the words of her mother.<br>\r\n<br>\r\n\"Hello?\" Kayla says.<br>\r\n<br>\r\n\"Kayla where are you at?\" An older woman's voice inquires.<br>\r\n<br>\r\n\"At Cindy's house watching a movie.\"<br>\r\n<br>\r\n\"Okay, I need you to get home now. It's getting late.\" <br>\r\n<br>\r\n\"Can I at least finish this movie?\"<br>\r\n<br>\r\n\"Now.\" The mother repeats.<br>\r\n<br>\r\n\"Okay, Mom.\"<br>\r\n<br>\r\nKayla hangs up the phone. \"I have to go now, I'll see you tomorrow.\" <br>\r\n<br>\r\n\"That sucks\", Cindy replies. \"See ya.\"<br>\r\n<br>\r\nI should've found a way to get down off of Kayla's shorts but I'm so high in the air and it took me so long to get up here it would've been impossible anyways. Now I'm holding off for dear life as Kayla stands up to full height and slips on her flats before beginning her walk to her house. Each step she takes creates an impact of energy that moves up her leg and threatens to dislodge me to a deadly fall but I manage to keep hold. I just need to last until she gets home and she lives on the same street, just all the way down. Kayla walks outside, which is lit by the sunset and street lights. I've never been to Kayla's house and no nothing about her family. She only moved here a year ago with her and Cindy becoming friends shortly after but I've been so busy at work since I finished high school a few years ago that I never had the time to know her. I was only just starting to get consistent two days off in a row until this shit happened. What a quality way to spend it.<br>\r\n<br>\r\nCindy walks down the sidewalk and up her driveway to go through her front door in a completely foreign home to me. I'm sure her family will help me but it's unsettling to rely on relative strangers now that my house is hundreds of miles away. <br>\r\n<br>\r\nWalking through her living room, I catch glimpse of a woman that looks very similar to Kayla except way older with a curvy and thick body type. She sat on the couch with her back resting on the arm rest and her legs and feet outstretched on the lap of a brunette man with a thick beard. Both of them lounged watching TV, barely acknowledging Kayla walked in as she continued down the hallway and turned to a bedroom. <br>\r\n<br>\r\nThe room was what I would expect from any preteen. A transitioning from little girl with the dusty dollhouse in the corner of her room to teen with the boy band posters everywhere. I expect the girl to go to her bed and can only hope she doesn't lay her side that I'm on. Instead, I watch her hands brush past me to the front of her shorts. A loud zipping sound echoes through the air and then the feeling of free fall occurs as I hold on to the shorts tightly. Looking up, I see Kayla is now only in her teal panties as I'm on the crumpled up shorts. The giantess then takes off her shirt to reveal her flat chest before tossing it on the ground. Her enormous feet move up past me as she walks to her dresser in the distance to pull out grey sweatpants and a white tank top and slips them on before grabbing her mini laptop laying on top of the dresser as well and then walks to her bed. The bed creaks and moans under the girl's weight as she lays on her stomach and browses the web while I watch from her discarded shorts. <br>\r\n<br>\r\nThere is no way I can reach her. The gap under the bed is too vast and there is nothing like sheets or anything touching the floor that I could climb to get up there. I'm so close to Kayla yet there is nothing I can do to get her attention. I could wait until she gets off the bed but that would be useless as she would only walk somewhere, giving me no time to get her help and it would likely result in me getting stepped on anyways. I will need to go elsewhere.</span></div></div>",
            "created":1483074000,
            "id":2256563,
            "title":"@t Another Home"
        },
        "13":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "My sister and her friend walk in the kitchen.",
                "My mom walks in the kitchen.",
                "No one comes, it was someone walking in the distance."
            ],
            "content":"<div class=\"\"><div> <span>There is no way I'm going to any of these giants in the house. My mom was so humongous that I was like dust to her! How can I possibly get her help!? I'm going opposite of wherever she is. I'm going to the kitchen to figure shit out.<br>\r\n<br>\r\nIt takes a solid hour of walking through the hallway and living room area before traversing on the tiles of the kitchen. Each tile was large enough to hold a football stadium to me and the ridges between the tiles were like ditches. Crumbs the size of boulders, some well bigger than I am. The kitchen table and chairs loomed in the distance like monuments that make up one of the Earth's wonders. They represent some kind of beacon of safety to me so I walk straight for the nearest chair and rest by one of it's legs. <br>\r\n<br>\r\nWith my back against the massive pillar, I start to sob as I realize I'm not waking from this nightmare. I'm stuck like this forever until I get help but I'm so damn small, how will that be possible?<br>\r\n<br>\r\nMy thoughts are interrupted as the floor shakes under me and a thunderous rhythmic boom echoes through the air. This wasn't the clacking of heels anymore but still terrifying nonetheless as...</span></div></div>",
            "created":1482901200,
            "id":2255624,
            "title":"To the kitchen."
        },
        "131":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Cindy",
                "Kayla"
            ],
            "content":"<div class=\"\"><div> <span>I look at the kitchen doorway and see a humongous red headed preteen stumble into the kitchen. Kayla. It's too hard to distinguish the difference of her height from my mom's of earlier. She's so tall that I can barely make out her facial features! She's like a living mountain to me. Even though she is seemingly a couple of miles away, her long legs carry her an impossible distance at incomprehensible speed. Her feet create an even more intense boom and tremors along with a slapping sound. She walks right by the chair leg I'm leaning against, her foot landing so close that the displaced air from under creates a wind that blows against me and whisks crumbs and dust in all directions like hail. I am left in awe at the sheer length of her pale foot with blue chipping pain on her toes having to move my head laterally to even be able to take it all in.<br>\r\n<br>\r\nKayla continues her walk deep into the kitchen to grab a cup from the cabinet and then opens the refrigerator to pull out a two liter bottle of Coke, pouring it in the cup before placing the bottle back into the fridge and closing it. I watch as the red haired giantess walks right back towards me. I instinctively hide to the other side of the chair leg, not wanting her to accidentally squish me or even see me. I should be trying to get her help but I am absolutely intimidated by the once-petite girl that now towers over me. <br>\r\n<br>\r\nThe table and chair quiver until the booming footfalls finally stop. I peek my body from the chair leg, and get startled by the sight of Kayla's gargantuan toes just yards away. She lazily flexes them, crushing crumbs into dust beneath them. I stare up her freckle covered legs but can't see past her knees due to the bottom of the chair getting in the way. I walk forward, warily glancing at her toes to make sure I don't get too close until I can crane my head all the way back to see the girl gulping down on the cup of soda before placing it on the table. I'm only able to see her blurry chin and limited facial structure from this angle until she puts the cup down on the table. Kayla then opens up her mouth to let loose a massive burp that shakes my insides with its base.<br>\r\n<br>\r\nThe sound of a torrential pouring of water is heard in the background and then the creaking of a door opening before footfalls are heard with subsequent tremors are felt. I look down the hallway to see Cindy walking out the hallway, across the kitchen doorway and to the kitchen. Sudden movement catches my eye as I turn to see Kayla move her foot forward to begin walking out the kitchen. I look at the soles of her feet covered with crumbs and soot as she walks out the kitchen and to the living room.<br>\r\n<br>\r\nAlmost everything in me wants me to stay in here and be safe but I know that if I don't man up and try to get help from someone, I'll end up being squished by someone or worst, eaten by a bug with all these crumbs everywhere. I sigh before starting the walk to the living room.<br>\r\n<br>\r\n\"What kind of movie should we watch?\" I hear Cindy's voice echo through the air.<br>\r\n<br>\r\n\"I don't know. Something scary?\" Kayla replies sounding further away.<br>\r\n<br>\r\n\"Oooo, I like scary! Let's watch this one!\" <br>\r\n<br>\r\nI get through the corner of the doorway in time to see the supermassive TV screen in on a netflix selection and then switches to a movie viewing. I look into the living room to see the furniture consisting of the couch, recliner, table and multiple stands some that have plant vases or lamps on them. Miles away on the recliner at the other side of the living room is Kayla. I can't see Cindy but I can only assume she is laying on the long couch just ahead. I feel very awkward walking through the middle of living room as I get enough of an angle to confirm that Cindy is laying on the couch. I decide to go to...</span></div></div>",
            "created":1482987600,
            "id":2256348,
            "title":"My sister and her friend walk in the kitchen."
        },
        "132":{
            "choices":[
                "Aunt Debbie notices a bug?",
                "Joyce walks in and joins her sister?"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello? Joyce are you in here?\" I heard a familiar voice echoing through the kitchen. \"I came to drop off those papers. I guess I'll leave them on the kitchen table for you.\" Just then loud deafening clicks started pounding for the kitchen and started shaking the ground beneath my feet. I ran as fast as I could knowing some gigantic human being was coming when SMACK! I ran into something unbelievably enormous. I looked up at the black shiny surface and realized it was high-heeled shoe! The toe of the shoe lifted and slam down 3 times. As I looked up to the towering giant, I recognize this person, it was my Aunt Debbie! She stopped by to deliver some papers to my mother and she had no idea that she nearly stepped on me, her nephew, and that I'm standing right next to her foot about the size of a fruit fly.</span></div></div>",
            "created":1489467600,
            "id":2289589,
            "title":"My mom walks in the kitchen."
        },
        "1321":{
            "content":"<div class=\"\"><div> <span>Aunt Debbie was gigantic!! She Towers over me like 20 Statue of Liberties. She was obviously in a hurry and couldn't wait forever for my mother to come. So she gathered the papers together and placed them on the table. In doing so one of the papers slipped and floated to the ground period it was huge and it actually scared me as it looked like it was going to land on me! So I turned to run as fast as I can, just as my aunt leaned over with an outstretched hand and caught the paper just before it hit the ground. As I turned around I tripped and fell on my butt. I looked up at my Giant Aunt Debbie as her face was in plain view. She looked a lot like my mother, only she had shorter hair. Her eyes were like the size of buildings as I noticed them move towards me and notice me!! I tried to scream for my Aunt Debbie, please notice me please notice me it's me your nephew!! But I felt chills go through my body as she squinted her eyes, developed a disgusted look on her face and stood straight up. She was now towering over me like before, but I had a bad feeling. I tried to back up but I noticed her right foot Lift High into the sky period I knew what was happening and I was so scared that I could barely move. My Aunt Debbie thought that I was a bug and was going to step on me. I stood up and try to run, but notice the large Dark Shadow completely engulf me on the ground. I turned around just in time see the gigantic sole of my shoe. It stretched on for miles and was coming down fast and hard!! Became inevitable as she stomped down her foot and ended my teeny life instantly. She then lifted her heel applying all the pressure on the ball of her foot crushing every last ounce of me. Then she twisted her foot 3 times and dragged her foot firmly back, completely smearing all that was left of me making me a unidentifiable squished bug. Aunt Debbie then put that paper with the rest of the papers and left.</span></div></div>",
            "created":1494046800,
            "id":2315644,
            "title":"Aunt Debbie notices a bug?"
        },
        "1322":{
            "content":"<div class=\"\"><div> <span>\"Hey Debbie, I just got out of the shower what's up?\" I heard the gigantic voice of my mother booming and echoing through the kitchen. Followed by earth-shattering Booms that caused earthquakes under my feet. The ground rattled. Boom-slap boom-slap boom-slap boom-slap, It was the sound of my mother walking in the kitchen and her bare feet slapping on the ground. I saw the giant soles lifted up and slam on the ground as she got closer and closer! I tried to scream for my mother and realized she couldn't hear me as her foot was coming my way. I ran as fast as I could then realized that my Aunt Debbie was blocking my path. Aunt Debbie took a step forward and nearly stepped on me. As the sole of her shoe slammed on the ground, it made a large Bang and knocked me on my butt. I got up and tried to run the opposite direction, however I noticed a shadow surround me as I looked up to see the wrinkled sole of my mother's barefoot descending quickly on top of me!!! I screamed as loud as I could, but it was no use boom-slap!! I was instantly squished into a teeny stain. I was never noticed, like an significant bug.</span></div></div>",
            "created":1494926460,
            "id":2320167,
            "title":"Joyce walks in and joins her sister?"
        },
        "133":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Approach",
                "Stay away"
            ],
            "content":"<div class=\"\"><div> <span>The noises and earthquakes stop as I figure it must be someone going to the bathroom. And here I am still in the same predicament. At this point the only light in the kitchen is the moonlight through the window. My heart still races as I watch my surroundings. Various clicks and thuds randomly sound off. The usual sounds of a quiet home but amplified into sudden, loud noises at my size. Through the corner of my eye I see movement and I turn to see an ant that size of a tank walking around in the distance! This ant would be teeny tiny to anyone but to me, it was a behemoth! I see another thing moving in the other direction, a beetle that is longer than a bus and bigger than four of the ants side to side is walking about as well! <br>\r\n<br>\r\nI crouch in a ball as various bugs stroll by without noticing me, feasting on the crumbs left on the floor or each other. Thankfully, I'm so tiny they don't notice me or figure I'm not worth the trouble. It's a long night that I barely get any sleep.<br>\r\n<br>\r\nI nod off and then when I open my eyes, the kitchen is dimly lit. The morning sun shining through the windows. Looking around, crumbs are still everywhere but no bugs to be seen. I let out a sigh of relief, glad to have survived the night. A banging noise is heard in the background and the sounds of footfalls follows. From the kitchen doorway, comes my gigantic mother wearing a white robe around her body. Bags rest under her blue eyes as she lumbers into the kitchen. As she gets closer, the view of her upper body is obscured from the chair I'm under and instead I'm left with the sight of her colossal legs and feet. <br>\r\n<br>\r\nMom's feet crush crumbs into literal dust as she walks to the cabinet far away to the other side of the kitchen. Her full body visible again as she grabs a bowl, a spoon and then proceeds to the fridge for milk and a box of cereal above. She then walks towards me to the table again, the chair blocking her top half. <br>\r\n<br>\r\nA nearby chair makes a sickening creak against the floor as Mom pulls it back and then sits down on it. The items she has in her hand make a loud thud as she sets them on the table. Her legs stretch forward and her feet lay on the floor under the table. This might be my chance, should I approach her or stay away and safely watch?</span></div></div>",
            "created":1482901200,
            "id":2255643,
            "title":"No one comes, it was someone walking in the dis..."
        },
        "1332":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Approach Cindy.",
                "Stay safe."
            ],
            "content":"<div class=\"\"><div> <span>There is no way I'm getting anywhere near her. If each tile can hold a football stadium, her feet span more than two tiles in length. They are absolutely massive and she moves them about carelessly in a shuffling motion or tap; any contact would crush or splatter me without her ever knowing. I'll just stay right here where it's safe.<br>\r\n<br>\r\nThe sound of an avalanche rings through my ears as my mom pours cereal into her bowl and a waterfall like sound of milk being poured is heard shortly afterwards. The sound of her eating is heard for a moment until the floor quivers again with more booming sounds.<br>\r\n<br>\r\nLooking back to the doorway, I see Cindy pop into view. Wearing blue pajama pants and a white t-shirt; her feet bare just like Mom's. <br>\r\n<br>\r\n\"Good morning\", I hear my mom's loud voice freakishly echo through the air.<br>\r\n<br>\r\n\"Good morning, mom. Where were you last night?\" <br>\r\n<br>\r\n\"I got home a little later. Long day at work. I just wanted to sleep so you wouldn't have saw me since you were in your room.\"<br>\r\n<br>\r\nCindy steps forward right on top of a concentrated pile of crumbs the size of houses. Even she noticed she stepped in it. She lifts her leg up and brushes the crumbs off her sole.<br>\r\n<br>\r\n\"Yeah, this kitchen is a mess. Did you not do you chores?\" My mom asks.<br>\r\n<br>\r\n\"I did mine! Dan was supposed to clean the kitchen, remember?\" <br>\r\n<br>\r\n\"Hmm, where is he anyways?\"<br>\r\n<br>\r\n\"I saw him earlier yesterday, I think he works Friday mornings so he's probably gone now.\"<br>\r\n<br>\r\nMy mom sighed in annoyance. It irritated her that I forgot to do chores but she couldn't complain since I at least had a job and helped pay bills. What she didn't know is that I felt sick yesterday and then obviously after I tried to take a nap all the craziness happened. <br>\r\n<br>\r\n\"Well if you see him after school, make sure he cleans this place up.\" Mom says from above.<br>\r\n<br>\r\n\"Well about that.\" Cindy says as she walks down the kitchen to grab a bowl and then back to the table. \"Since I've been doing my chores all week, I wanted to ask you if I could sleepover with Kayla tonight.\"<br>\r\n<br>\r\nCindy's body is covered by the top of your chair allowing me to only see her legs and feet. I watch as she sits in the chair at the opposite side of the table from me. <br>\r\n<br>\r\n\"That's fine.\" Mom replies. \"Just make sure to lock the house if you end up coming back here. I won't be here until very late, I have plans with Jennifer tonight.\"<br>\r\n<br>\r\nI hear Cindy whisper a victorious \"yes\" at the okay to stay with her friend. This means if I stay here, I'll be alone for a while as my mom and Cindy have plans after work and school. Looking ahead, Cindy's gigantic feet move just as much as Mom's but at the back of her pajamas are strings that touch the floor. Perhaps I can climb those strings to get up to her or I can stay safe.</span></div></div>",
            "created":1482901200,
            "id":2255652,
            "title":"Stay away"
        },
        "13321":{
            "choices":[
                "Joyce's cereal",
                "Joyce's cup of \"lukewarm\" coffee "
            ],
            "content":"<div class=\"\"><div> <span>I decided to try to climb Cindy. I took a deep breath and grabbed onto one of the giant strings attached to Cindy's pajamas. I grabbed the string and pulled myself up. I kept on going until about 5 minutes past and I found himself near her hip. Cindy and mom, Joyce, continue to have conversation, and both are completely oblivious to my tiny existence. I got tired as I slipped and fell onto Cindy's thigh. All of a sudden, the string that I used to pull myself up around Cindy flipped and I was no longer able to get near it. But just as luck would have it, Cindy's giant fingers landed around me, and she started to scratch and itch. I quickly grabbed a hangnail on Cindy's pinky finger, as she brought her hand back to the table. The rush was almost too much for me, but I managed to hang on. But then Cindy became animated in her explanation about something, as she flung her hand forward, causing me to lose grip, and fly towards mom. I unfortunately landed with a wet splash! I was now in a very dangerous situation, as I was too small to be detected by mom or Cindy! I landed in...</span></div></div>",
            "created":1486357200,
            "id":2274144,
            "title":"Approach Cindy."
        },
        "133212":{
            "choices":[
                "Sucked right into Joyce's mouth",
                "Safe from being swallowed but not saved from a refill of hot coffee"
            ],
            "content":"<div class=\"\"><div> <span>I landed with a splash. I looked up to see towering White Walls all around me dripping with a brownish liquid. I noticed that I was swimming in a very warm brown liquid. I look up and I see the nostrils and the forehead my mother Joyce. Except gigantic, a true Giant and I was the size of a bug, probably more the size of a mosquito and I realize I was swimming in her coffee. I tried to scream to get her attention, but my voice is way too tiny for her to hear she was still not completely awake as she didn't even finish her first cup of coffee. And knowing that she loves her coffee and that fact that I'm swimming in it it's one thing, but I will get swallowed by my mother if I fail to get her attention. Just then everything shook as her nose started to appear and point into the cup and her beautiful upper lip caressed the opening of the cup and everything started flowing towards her mouth........</span></div></div>",
            "created":1493614800,
            "id":2313348,
            "title":"Joyce's cup of \"lukewarm\" coffee "
        },
        "1332121":{
            "content":"<div class=\"\"><div> <span>Dan's heart raced as he saw the coffee quickly begin rushing into her mouth. Her throat opened and closed with every gulp. He screamed to his mom over and over as the coffee continued to disappear into her body. All he could think to do is, swim down, swim to the bottom of the cup. \"She won't drink all of it\" he thought to himself. He began swimming in a panic, down down down, he was almost there. He then watched as the bottom of the cup began to pull away, further and further. He swam even harder as he realized the current had him. He swam and swam, but his mom's lips got closer and closer, and the current became stronger and stronger. He watched the outside world pull away as the waves washed him past Joyce's lips. The dark shadows surrounded him from the confinement of her mouth. He rode the rapids that washed over her tongue towards the coffee water fall that poured down the back of her throat, vanishing into the dark tunnel of her esophagus. He caught his last glimpse of daylight coming through the crack between her lips as he plunged down the waterfall into darkness. Dan met the inevitable as he was swallowed and completely digested inside of his mother Joyce.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1493874000,
            "id":2314663,
            "title":"Sucked right into Joyce's mouth"
        },
        "13322":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Try to use this damn phone again.",
                "Go outdoors."
            ],
            "content":"<div class=\"\"><div> <span>I can't help but feel so weak and helpless. I'm so close to them and feel like I could easily get their help but it's just too risky to get near their gigantic feet and not get squished. <br>\r\n<br>\r\nAbove, the giants talk about school and other small talk. Under the table, the ground shakes as Cindy's and the significantly larger feet of my mom tap on the ground. Eventually the women finish up and Mom takes the dishes to the sink as Cindy walks by to the hallway, Mom doing the same shortly after.<br>\r\n<br>\r\nI stay under the table for the next hour and a half until booming footsteps alert me to see Mom leaving the hallway and towards the living room. She wore a black blouse and black skirt with extravagant black high heels. <br>\r\n<br>\r\n\"C'mon, Cindy. It's time to go.\" Mom yells out in a commanding echo.<br>\r\n<br>\r\n\"Just a minute, mom.\" I hear Cindy's voice in the distance.<br>\r\n<br>\r\n\"No. We have to go right now.\"<br>\r\n<br>\r\n\"Coming!\"<br>\r\n<br>\r\nMore footfalls and Cindy trots through the hallway wearing a black t-shirt with jeans and pink converses. The two walk through the front door leaving me in the house alone. The last major noise is the sound of the roar of the car engine before they drive off, leaving only the sounds of natural creaking and settling of the house.<br>\r\n<br>\r\nNow I'm alone again but could I really survive sixteen or more hours until someone gets home? Especially with no humans around and the kitchen floor still a mess, bugs might show up again. There is no way I can stay here. I have to...</span></div></div>",
            "created":1482901200,
            "id":2255669,
            "title":"Stay safe."
        },
        "133221":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Her room.",
                "The kitchen (fall)"
            ],
            "content":"<div class=\"\"><div> <span>What else can I do besides try this phone again? I don't think I can survive in this house for long and getting help from the neighbors would require a travel that could take days. I pull the phone out my pocket and my eyes widen. I have the faintest of signals! I don't want to move at all to ruin it. I open up the contact list and before I make a call I realize I have to choose carefully. Emergency services wouldn't believe me, same with Mom and Cindy to where they would leave work or school to come home. Same thing with most of my friends but there is one person. Jess.<br>\r\n<br>\r\nEvery guy knows Jess. She's a slutty nineteen year old who lives two houses down from me. Of course she won't believe me either but I can easily convince her to at least come to the porch and then get her to look down at me. I've been friends with her for awhile and she's been trying to aggressively hook up with me but I always denied her advances due to having a girlfriend in the past and now recently even without one because of my dignity. Now I need her help.<br>\r\n<br>\r\nWith that I press the call button.<br>\r\n<br>\r\nAfter the second ring. \"Hello?\" Says Jess's tired voice, she must've just woke up.<br>\r\n<br>\r\n\"Jess, I need you to come to my porch I can't really explain right now.\"<br>\r\n<br>\r\n\"Dan? Is that you? You're breaking up really bad, I can't make out what you said.\"<br>\r\n<br>\r\n\"Come to my house! I'll explain later!\"<br>\r\n<br>\r\n\"Come to your house? Like now?\"<br>\r\n<br>\r\nI think for a second. It'll take me about thirty minutes to reach the porch.<br>\r\n<br>\r\n\"Thirty minutes! Come to my house in thirty-\"<br>\r\n<br>\r\nMy signal cuts out. I have to get to that porch now! I start the trek through the kitchen. Quickly walking around boulder sized crumbs and over powdery dust of the crumbs my mom and sister crushed. Walking through the living room for the better majority of the thirty minutes I make it to the foyer area in front of the front door. Walking past a large pair of Cindy's brown sandals, I go under the front door. The gap is smaller than that of the bedroom doors but still more than small enough to go through for me. <br>\r\n<br>\r\nI am introduces to blinding sunlight and a breeze that threatens to whisk me away. I am now on the porch and on top of the welcome mat caked in mud and dirt. I walk forward to get off of it and onto cement. That's when I see her. Coming up my driveway miles in the distance is a young woman with short blonde hair, wearing a black tank top that barely held her oversized breasts and revealed her flat stomach. Her shorts may as well have been denim panties and looking down her long legs I could see her thin-soled tan sandals with a black thong strap. She had a gold piercing on her nose and stomach and a black tribal tattoo extending from her left upper thigh to her knee and the top of her right foot had a rose tattoo.<br>\r\n<br>\r\nI look at my phone and see I have a signal again! I get to her number on the contacts list and press the call button. Jess is walking up the steps of the porch. By now her footfalls create the menacing earthquakes and the thunderous boom from impact. Jess walks up the steps and I am left watching her in full height as she picks up her phone. As she puts it to her ear her foot positioned a few hundred feet forward of me is about to lift up, meaning it will travel another few hundred feet to crush me flat! <br>\r\n<br>\r\n\"Dan?\" Jess answers, her voice echoing in real time and her voice in the phone making a metallic distortion of her.<br>\r\n<br>\r\n\"STOP!\" <br>\r\n<br>\r\nJess stops in her tracks. <br>\r\n<br>\r\n\"What?\" Jess asks with a confused look.<br>\r\n<br>\r\nLooking at her frozen still for a brief few seconds. I can tell she looks moist as if she just took a shower. The smell of her berry scented soap mixed with cheap perfume permeates the air. She believes I invited her over to fuck. I will owe her anything she wants after this. Even with her wearing a pair of very thin soled sandals, they are still several stories in height to me. I'll have to get her to look down at me.<br>\r\n<br>\r\n\"Look down in front of you!\" I tell her on the phone.<br>\r\n<br>\r\n\"What you're breaking up again?\"<br>\r\n<br>\r\n\"Look down in front of you!\" I say again.<br>\r\n<br>\r\nJess looks down right at me with her brown eyes. I wave my arms at her. \"Down here! Do you see me!\"<br>\r\n<br>\r\n\"What are you talking about, Dan? Are you going to let me in or what?\" <br>\r\n<br>\r\nShe can't see me, she needs to get down closer.<br>\r\n<br>\r\n\"Jess, squat down and look at me closer!\"<br>\r\n<br>\r\nJess lets out a sigh. \"Fuck this, wasting my time.\"<br>\r\n<br>\r\nWith that she hangs up the phone and turns around leaving me feeling hopeless. I try to run after her but she is already off the porch going down the first step when her phone drops from her hand. She curses under her breath and bends down to pick up the phone. I sprint full speed to reach the edge of the porch just as she picks up her phone and starts to wipe off the dirt from it. Looking down off the edge of the porch I see my ticket out of here. Her foot just below me. Of course it's hundreds of feet down but maybe her skin can absorb the impact. This isn't a choice either way, it's either do this or die alone in the house. I jump before she can walk away!<br>\r\n<br>\r\nAir whooshes around my ears as her foot nears until I land with a hard impact on top of her rose tattoo. The impact is so intense that even Jess feels it and looks down but dismisses it when she sees nothing. The wind is knocked from my lungs and my body stings with a searing pain but before I get a chance to recover, G-force impose their will upon my body as Jess lifts her foot up to begin walking. Before she puts her foot down to complete the step, I quickly grab onto small blonde hairs that are as thick as shoe strings and then negative g-forces attempt to lift me off her foot until it smacks onto the ground. This continues for several minutes as Jess walks to her house. Completely unaware of her tiny passenger.<br>\r\n<br>\r\nAfter throwing up several times and nearly losing grip, I start to gain the ability to somewhat think of my predicament. I appear to be on the way to Jess's house. I've never been in there but I know she lives with her mom who is just an older version of her in terms of looks and sluttiness. I should've just got my family's attention last night when I had the chance...<br>\r\n<br>\r\nJess walks through the front door to go to...</span></div></div>",
            "created":1482901200,
            "id":2255790,
            "title":"Try to use this damn phone again."
        },
        "1332211":{
            "content":"<div class=\"\"><div> <span>Jess stomped her feet up the stairs and was completely unaware that I was hanging on for my life on her foot. It was getting harder and harder to hang on as I tried to scream for her but she could not hear me. Finally as she was about to walk into her room I lost my grip and fell off just as I saw the sole of her sandal drift off into her room as she shut the door. I pondered if I should go into her room and try to get her attention again or was it just no use. Here I stand two houses away from my house inside the neighbor's house the size a small ant. I heard some noises that startled me but had no idea what they were and nothing was coming so I figured I was safe. As I sat down to try to collect myself and figure out my next move Tremors started to surround me. A loud humming sound started to get louder and louder which sounded like a freight train and then a wind started sucking all over like a tornado. It was Jess's mother and she was vacuuming the hallway, pushing the gigantic machine right towards me. I got up to run but the machine roll right over me and sucked me in. She then turned it off, wrapped it up and put it away leaving me in the dust of mess in darkness. I spent about a day and a half inside the chambers of the vacuum cleaner, until her mother started vacuuming again. Everything inside blew around as my world shook violently inside. New crumbs and new debris join me and quickly buried me inside. It eventually stopped and Light finally came in and Blinded Me. She was emptying all of the Dust into the garbage to throw it away. But as fate would have it as I was falling out, Jess accidentally bumped into her mother while on her cell phone and me and some of the Dust landed on the ground, hard. I thought my tailbone was broken that I had just enough strength to get up and out of the way before Jess's mother swept me up into the dustpan, as she did the other dust that fell out with me. She then stomped away with the garbage bag and threw it out. Finally safe, I had to figure a way out of here. As I stopped to take my breath Tremors appeared All Around Me Again. I turned around to see a giant pair of barefeet stomping towards me and then stopping right in front of me. Ten huge toes slightly wiggled and shook the ground. I looked up to see the face of Jess's eight year old brother Owen looking down at me, smiling. \"Well, well, well what do we have here?\"said Owen. I tried to scream to him but he cut me off \"looks like a little bug who shouldn't be in this house.\" I tried to scream again for him to know that I'm not a bug that it's me Dan the boy who lives two houses down, his sister's friend! But he responded with, \"well looks like today is the last day you get to live!\" I screamed no you don't understand up to him...as he then lifted his giant foot into the air showing me the entire sole of the his huge barefoot and wiggled his giant toes as he laughed at me! Owen then said \"it's time to play splat! Goodbye little bug! I'm the Giant and I've decided your time is up!\" He then slammed his barefoot down on top of me, completely splattering me beneath it. He held his foot firmly on the ground for 60 seconds before lifting it up, turning it over and looking at my squished remains within the wrinkles on the sole of his foot. He smiled and felt good that he destroyed a little bug that he knew his mother would not want to the house.</span></div></div>",
            "created":1495555860,
            "id":2324142,
            "title":"Her room."
        },
        "1332212":{
            "content":"<div class=\"\"><div> <span>As Jess enters the kitchen she trips and sends me flying into the air. I end up Landing in a giant pool. But I'm confused as the water is all white and it is filled with giant brown squares. As I reach for one of the squares I realize they were a bit sticky. Smell of cinnamon fills the air and I taste my hand, and it is the flavor of cinnamon. I wonder I thought to myself as I put my head down and took a sip of the White Water. I was right this was milk. Then I realized where I was, I was in a gigantic bowl of cereal. And this cereal was Cinnamon Toast Crunch. Just then I realized the danger I was in. At my size I will get eaten and never noticed. I tried to scream as Jess was nowhere in sight. Just then a loud commotion happened around outside of the cereal bowl. I looked up just to see a huge shiny metal object dive into the bowl. It was a larger-than-life spoon as it scooped up a lot of the cereal and brought it up to a giant mouth that devoured it. I heard a loud dangerous crunching as the spoon descended back into the bowl nearly scooping me up. As another load was successfully scooped, the spoon hovered in the air for a bit as the giant finished chewing. At this time I got a look at the Giant who was about to make me it's breakfast, it was Owen, Jess's little 8 year old brother!! I tried to scream up but he then ate the next spoonful crunching away and enjoying the cereal. He had no idea that a super tiny person was swimming for his life in the cereal. He then carelessly put the spoon back into the cereal, scooping up a huge load of Cinnamon Toast Crunch, and unfortunately me as well!! The air rushed by me as he quickly brought the spoon to his open mouth!! I tried to scream for Jess to help me but she left the house already, so she will do nothing to prevent her brother from eating me!! I screamed Owen's name and begged for him not to eat me but I went right into his mouth as his lips slammed shut around the spoon. The spoon pulled out of his mouth, dumping me and all the cereal on his tongue. The tongue bounced me and the cereal around and started pushing me forcefully and abusively towards his giant molars. I heard nothing but squishing and crunching as I knew I would be next. The cereal was becoming mush all around me and the scent of nothing but cinnamon, milk and saliva filled my nostrils. I started being encased in chewed up cereal as his tongue then pulled me away from his molars. This is great I thought, I'm not getting chewed up as I tried to free myself from the big ball of mush that started cementing me in. But then I realized, but this is worse he's going to swallow me and I'll be alive. I screamed one last time as my scream was drownded out by a giant wet gulp!! I felt myself being process downward along with sticky saliva and mushed up cereal. I got to a point where there is no more oxygen and all I hear is gurgling and sloshing all around me. I was soon through his intestine and into his stomach where I started getting churned into a milky substance. Everything went black as I was completely digested inside of this young boy.</span></div></div>",
            "created":1495462920,
            "id":2323605,
            "title":"The kitchen (fall)"
        },
        "133222":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Right",
                "Left",
                "Back/Forward through the jungle"
            ],
            "content":"<div class=\"\"><div> <span>I pull out my phone to see if I have any signal but it's still nothing. I don't even have a wifi signal as the transmitter is too tiny to function properly. To make matters worst the phone is already at only twenty percent battery after leaving it on all night. I turn the phone off and let out a sigh. I'm going to have to leave this house. There is no I'm going to wait here alone just to be stuck with being unable to get help again. <br>\r\n<br>\r\nBeyond the kitchen table and chairs I'm under is the sliding glass door leading to the backyard. I take the trek to it and find that the metal separator and tracking is like a tall wall to me but a piece of dead grass creates a sort of ramp for me to walk upwards on. I walk up this dry stalk of grass and then across another over more of the tracking like a bridge until walking along the top of the metal track to reach the end of the glass door where there is plenty of room more me to walk through like how a bug enters the house.<br>\r\n<br>\r\nI'm now outside, the cool air of the morning makes me shiver but the sun's rays provide some warmth. I look across the bumpy cement patch to see vast jungles of grass surrounding. Beyond those jungles, very many miles away, I see monolithic houses. The chirping of birds echoes through the air and various clicking of insects as I already take note of some ants moving in the distance. If I can survive walking through this jungle, I know I have neighbors to the left and right and the back fence. <br>\r\n<br>\r\nTo the left is an older Asian woman who is in her fifties and by herself as her husband passed away some time ago. To my right is a black woman just a couple years older than me and her Hispanic female roommate. Through the back fence is a two storied house with a pool belonging to a white couple with an eight year old and eighteen year old daughter.<br>\r\n<br>\r\nI decide to go to... </span></div></div>",
            "created":1482987600,
            "id":2256073,
            "title":"Go outdoors."
        },
        "1332221":{
            "author_id":"thenumber1",
            "author_name":"TheNumber1",
            "choices":[
                "Naomi's shoelace.",
                "The other girl's flip flop."
            ],
            "content":"<div class=\"\"><div> <span>Knowing the layout of my backyard, I figured the house on the right was the best bet. It was by far the closest and, being roughly the size of a flea, I wanted as short a trek as possible. I’d have to get under the fence and into the neighbors’ backyard. From there, hopefully I could find a way in. With the journey mapped in my head, I began the trip across the concrete and into the forest of grass. <br>\r\n<br>\r\nThe next four and a half hours were downright brutal and painfully boring. What would have been a quick walk across the lawn was now a harrowing slog in the wilderness. I trudged through the dirt, occasionally made into a soft slurry by morning dew. From time to time, I’d have to dodge a massive droplet as it rolled off a towering blade of grass. I could tell morning was passing into noon as it became unbearably humid. It felt like I was wandering through the sweltering canopy of a vast rainforest. Covered in a mixture of sweat and dried mud, I groaned as I neared the fence. I was barely halfway there. <br>\r\n<br>\r\nThe terrain began to change after I passed under the wooden barrier, which seemed to stretch endlessly into the sky. The jungle of the lawn abruptly stopped, giving way to an even plain of black soil. Gargantuan clusters of vegetation were evenly spead throughout the flat landscape. My jaw hung slightly open as I gazed upward at the nearest one. A tomato plant. I'd wandered right into a vegetable garden. <br>\r\n<br>\r\nA sudden, rhythmic thumping grabbed my attention. The ground began to quake as distant voices echoed above. I felt the blood drain from my face as the source of the tremors crashed into the ground just a few centimeters to my right. An unfathomably large, white tennis shoe. The impact of the enormous sneaker knocked me flat on my back. The largest living being I'd ever seen loomed above. My African American neighbor's hair was back in a ponytail. She wore a pink t-shirt, which was fairly tight around her torso. Charcoal gray yoga pants clung to her toned legs and rear. I couldn't say we were well-acquainted. She'd only been living next door for just a few months and I hadn't even gotten her name. With an athletic build at around 5'9, she was pretty tall. She used to be just  <i>pretty</i> tall, anyway. <br>\r\n<br>\r\nBefore I could get my bearings, a second woman lumbered into view with a basket in hand. The Hispanic girl had joined her in the garden. She was on the shorter side, more thickly built than her roommate. I wouldn't say she was chubby but she definitely had some curves. I could tell even at normal size, her chest was significantly larger than average. Dark hair flowed well past her deeply tanned shoulders, which were bare except for the straps of a white tank-top. The shirt was cropped just above her navel, revealing where the waistband of black athletic shorts dug into soft flesh of her hips. Thick, silky thighs descended into round calves. Her simple, black flip flops thundered against the ground as she approached. <br>\r\n<br>\r\n\"I think they're ripe, Naomi.\" The shorter woman boomed as she began to crouch above you. The taller, apparently named Naomi, followed suit lowering her impossibly huge frame toward the ground. They were about to start picking tomatoes! Feeling like I'd finally caught a break, I decided to act quickly.<br>\r\n<br>\r\nI climbed onto...</span></div></div>",
            "created":1537961880,
            "id":2554279,
            "title":"Into the Garden"
        },
        "13322211":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "Am flung off the shoe string somewhere inside the house.",
                "I manage to hold on to the shoestring through all the chaos."
            ],
            "content":"<div class=\"\"><div> <span>The only option that makes sense to me is climbing Naomi. The other giantess is seemingly miles away even though she is in reality just a couple feet away from the closest female. By the time I would get to her, she would probably be finished picking the tomatoes and walk away, leaving me behind. Another barrier that I cannot simply jump on to her flip flops. The thickness and height of the sole of the flip flops are probably well over a hundred feet compared to me! Naomi on the other hand is closer, and although climbing the sole of her shoe would be an ever greater impossibility than climbing the thin sole of a flip flop, that will not be a factor due to a loose shoe string that is thicker than several tree trunks combined in one. I just need to reach the shoe string and climb up!<br>\r\n<br>\r\nAlthough Naomi is so close, a few centimeters at my flea size is a good forty yards away. Not wanting to waste this opportunity to escape the outdoors, I clock my legs into overdrive to sprint towards the godlike shoe. While I am sprinting, Naomi accidentally drops a tomato. The massive, red sphere that may as well be some kind of mini-moon collided with the ground with enough force to make me lose balance as the floor trembled and the uneven, moist soil lashed around like it was alive. I look in horror as the tomato rolls towards at a couple hundred miles per hour. This is how I die, getting crushed by a tomato.<br>\r\n<br>\r\nJust as the tomato is upon me, it suddenly stops leaving me face to face with a wall of glistening red covered in blotches of dirt bigger than your body. The massive sphere starts to shift back to reveal five enormous fingers with a reflecting burgundy color painted onto their nails that are latching onto the tomato and lifting it up in the air with an impressive shoe of strength.<br>\r\n<br>\r\n<b><font class=\"size35\" style=\"\">\"Oops.\"</font></b> Naomi's booming voice echoes through the air as she places the tomato in the basket and continues with the other tomatoes.  <br>\r\n<br>\r\nMy heart still pumping from the near death ordeal, I continue sprinting forward. I did not have much time to reflect on what just happened, I need to get to this shoe string. The closer I get, the more I realize how tiny I am. This massive foot is big enough to flatten cities compared to me! I still cannot comprehend how insignificant I really am! Finally just in front of the loose shoestring, I latch onto the woven threads the shoe string is made of as if it is like climbing a wall of rope that extends hundreds of feet to get off the ground and to the top of the shoe, a harrowing and climb just to reach the top of her foot. <br>\r\n<br>\r\nWhile, I am trying to climb, Naomi filled her basket and gets up to walk inside the house with the tomatoes. This creates havoc for me as I...</span></div></div>",
            "created":1537973400,
            "id":2554399,
            "title":"Shoelace Solace"
        },
        "133222112":{
            "author_id":"thenumber1",
            "author_name":"TheNumber1",
            "choices":[
                "I managed to climb to the top of her foot.",
                "I fell, tumbling dor"
            ],
            "content":"<div class=\"\"><div> <span>The world around me became a blur as the titanic sneaker began to lift into the air. I dug my hands deep into the treads, trying desperately not to be thrown off the shoelace. Wind ripped at my clothes as Naomi sent her foot hurtling forward in a colossal first step. An earth-shattering <i>BOOM!!</i> shook me to my core as the shoe collided with the ground, sinking heavily into the soft soil.<br>\r\n<br>\r\nI was forced to cling to the shoestring with all my strength as she walked toward the house. Every step rocketed me miles forward, always ending in a thundering crash. By the time she passed through the sliding door my energy was almost totally sapped. I shivered, feeling the air-conditioning as Naomi obliviously carried me into the kitchen.<br>\r\n<br>\r\n<b>\"I'll get started on the salad.\"</b> She said to the other giantess. I heard the distant rush of running water. Looking skyward, I saw her rinsing tomatoes at the sink. <br>\r\n<br>\r\nWhile she was standing still I...</span></div></div>",
            "created":1538148480,
            "id":2555669,
            "title":"Stowaway on a Sneaker"
        },
        "1332223":{
            "author_id":"dreaddormammu",
            "author_name":"Dread Dormammu",
            "choices":[
                "The neighbor's backyard, my destination.",
                "The neighborhood park."
            ],
            "content":"<div class=\"\"><div> <span>The best bet for help is the house across the back fence. The only person I sort of know there is their daughter, and I don't really know her as much as I remember her being a freshman when I was a senior at high school. By now she has to be in her own senior year. The good thing about this family is there is more of them to get help from the bad is that they are the furthest away out of my choices. It could take me days to cross this forest. <br>\r\n<br>\r\nI walk through the cement patch which in and of itself was almost two hours before I even reach the grass line with the stalks towering over me bigger than any tree I've ever seen. It completely obscured my view of anything in front of me but the one thing that did catch my eye is a tall aged dandelion with white seeds that resembled a tall radio tower. If I climb that, I can use it as a vantage point to see what direction to take so I can reach the house fast.<br>\r\n<br>\r\nThe dandelion has small hairs on it that are like vines for me to climb. I try my best not to look down especially as I start to pass the canopy of the tall grass. To make sure I have the best view, I continue all the way to the top, standing on the flowering dandelion. As I look at the back fence and try to think of the best route, a particularly strong breeze blows that feels more like a hurricane gale! The whole dandelion leans and I almost fall off so I have to grab one of the large dandelion seeds! Me grabbing the seed along with the force of the breeze, makes the seed break off and I am sent flying in the air holding on to the seed like a glider! If I let go, I'll surely fall to my death as I'm now miles above ground! <br>\r\n<br>\r\nI can only helplessly watch as the seed floats towards...</span></div></div>",
            "created":1482987600,
            "id":2256098,
            "title":"Back/Forward through the jungle"
        },
        "13322232":{
            "content":"<div class=\"\"><div> <span>I keep floating as I pass by somebody's yard and I see a bunch of swings getting closer and closer and closer. I'm now over the neighborhood park and I passed by a few empty swings as I start to float through a giant Pavilion filled with a lot of people. It was a family picnic as the breeze just picked up and pushed me faster amongst these Giants. A giant head of a middle-aged man almost crashed into me has I floated right by his ear. And then a elderly man walked right past me brushing me with his shoulder which sent me spinning backwards and Landing towards the picnic table. A woman reached for a bunch of things on the table as I hit her elbow and landed backwards falling off my seed, and Landing right in a pile of mush, which happened to be giant container of onion dip. I couldn't help but taste it as I tried to free myself. I screamed and screamed but first of all I realize I was too small for any of these people to hear me, second of all all these people were much too loud, especially a lot of kids screaming, which made it impossible for anyone to hear me even if they were listening for me. Then it happened, a huge chip scooped into the dip pushing more dip on top of me making me completely covered in it. As I wipe my eyes I saw the chip enter the mouth of an elderly man who ate it quickly and then another and another as he kept eating as if he never ate before. Then another chip came from a different direction as dip was scooped up and eaten by a middle-aged man. Another chip came in as an elderly woman chomped it. I kept having to dive and dive to avoid chip after chip, until finally a chip came in and scooped me right up. my heart sank to my stomach as I was being lifted quickly into the air, and was presented with a large huge giant face of a teenage boy. I screamed for him to hear me I screamed for him not to eat me, I waved my arms as much as I could, but he just shoved me into his mouth. He started to chew quickly as wet crunching surrounding me and I soon felt the pressure of his molars as they crushed me and grinded me along with the rest of the chip and dip. I was then forced by his tongue with my mangled body almost dead, to the back of his throat as he swallowed and I was sucked into the process of complete digestion.</span></div></div>",
            "created":1500031980,
            "id":2353027,
            "title":"The neighborhood park."
        }
    },
    "info":{
        "author_id":"dreaddormammu",
        "author_name":"Dread Dormammu",
        "brief_description":"Generic story",
        "created":1482949800,
        "description":"<td align=\"left\" class=\"norm\">Just a generic story, really nothing more or less. No underage sexual scenes like insertion but vore/crush allowed. Everything else with 18/older characters is allowed. <br>\r\n<br>\r\nIf chapters are short/very low quality, I reserve the right to edit them or delete if it's beyond saving.<br>\r\n<br>\r\nYou can change point of view if you want, but my adds will usually be done in 1st person.<br>\r\n<br>\r\nDeath encouraged for realism. <br>\r\n<br>\r\nDon't just read it, let me know how I'm doing! I'm trying to add at least once a day.</td>",
        "id":2106730,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1542980100,
        "modified":1542980100,
        "pretty_title":"Shrunk @t Home"
    }
}