{
    "chapters":{
        "1":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "you get another call from Britney",
                "You decide to go home",
                "You go to Rachel's house. She's less demanding",
                "you arrive at Britney's house",
                "something starts to happen to you"
            ],
            "content":"<div class=\"\"><div> <span>You can't believe this. Britney called you to come over to her place. While, you like the fact that you've got two hot girlfriends, and better yet, they have no way of discovering each other, this is the last thing you need. You remember agreeing to bring her a present. \"Urrggh. Why did I start going out with her to begin with?  What can I get that girl?\" you mutter, as you drive towards her house. You're friends have warned you not to date two girls at the same time, but since they're from two diffferent towns, twenty miles apart, you figure its okay. You look out the window, and spot a sign, saying garage sale. Perfect.<br>\r\n<br>\r\nStopping, you get out of the car, and head up the path, seeing the mailbox saying 'Forester'. A woman, in her tweenties is standing near the door. She gives you a smile. \"Here to buy something?\"<br>\r\n<br>\r\n\"Yeah. I need something for my girlfriend\" you say. Unfortunately for you, you're talking to Samantha Forester, a witch notorious for turning bad boys (or any type, actually) into girls. She looks at you and guesses your cheating nature. Of course, you don't now this. \"I've got the perfect thing for you. What's your name, young man?\" \"Err Luke. I'm getting something nice for my girlfriend, Brit: you say. She hands you a pendant with a ruby set in it. You look at it delightedly. Britney would love this... You have over twenty dollars, and get into your car. You don't hear what she says to herself. \"Goodbye <i>Lucy</i>. Don't come back, you cheating, jerk.\" You spot another car arrive, as you're leaving, containing a grey haired woman, and a teen with honey blond hair. You recognize the teen a girl from Britney's school, some chick called Hayley. You've thought a couple of times of working your magic on her, even though you haven't seen her for some time, but you keep getting a bad feeling every time you see her. Plus, you don't need a third girlfriend... You drive away, not hearing the grey haired woman ask \"Up to your old tricks, Samantha?\"<br>\r\n<br>\r\nAs you drive...<br>\r\n<br>\r\n</span></div></div>",
            "created":1292302800,
            "id":1014951,
            "title":"The beginning of your troubles"
        },
        "11":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You don't answer",
                "You answer it, She wants you to pick some things from the mall",
                "She's heard about your cheating ways..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A buzz tells you that someone is trying to call you. You pick up the phone, and wish you hadn't. It's Britney.</span></div></span></div>",
            "created":1292302800,
            "id":1014955,
            "title":"you get another call from Britney"
        },
        "113":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "A hot looking 13 year old girl.",
                "A cute but sad six year old girl.",
                "Only his mom, looking frustrated."
            ],
            "content":"<div class=\"\"><div> <span>\"You horrible jerk!\" yelled Britney, crying on the other line. \"You told me I was only one for you!\"<br>\r\n<br>\r\n\"You are the only one for me, babe!\" you said, feeling nervous. <i>\"Did she find out?\"</i><br>\r\n<br>\r\n\"Liar!!\" screamed Britney. \"I bumped into your other girlfriend at the mall, she was wearing <i>your</i> football ring!! The ring you said had gotten lost!!\" she cried for a moment as sweat began to bead onto your forehead. \"She told me that you two made love last night...\"<br>\r\n<br>\r\n\"Baby, listen to me, Rachel is lying.\" you said, desperate. \"She's just jealous of what we have...\"<br>\r\n<br>\r\n\"She was wearing your favorite shirt, Luke!!!\" yelled Britney, now hysterical. \"You're a cheating liar! (SOB!) To think I trusted you, defended you... I don't ever want to see you again!\"<br>\r\n<br>\r\n\"Baby, please...\" you said, trying to reach her.<br>\r\n<br>\r\n\"If you ever come near me again, I'll make you regret it!\" said Britney, ice in her voice. \"I'll tell the strongest boy in school, John Harrison, that you assaulted me and <i>he</i> will take care of you!\"<br>\r\n<br>\r\nWith that, she hung up, leaving you shaken as you looked at the pendant you bought at the yard sale, not knowing what it was or what it could do.<br>\r\n<br>\r\n\"Well, this didn't turn out quite as well as I had planned.\" you said to yourself. \"I have to get her back and I think this beauty will do the trick.\" you frowned, thinking about Britney's threat. \"Only, I will have to first win over John before she decides to calls him.\"<br>\r\n<br>\r\nFormulating a plan, you drive over to his house, not knowing what was in store...<br>\r\n<br>\r\nYou arrive, looking for John but find...</span></div></div>",
            "created":1292734800,
            "id":1018115,
            "title":"She's heard about your cheating ways..."
        },
        "1131":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "You put it on, something happens.",
                "You put it your pocket.",
                "You toss it aside."
            ],
            "content":"<div class=\"\"><div> <span>The door was answered by a very attractive young girl you recognized as Mel, John's twin sister. She was wearing a pink, strapless dress that highlighted her features very well, making her look hot. You had to fight not to drool as she looked at you with an air of impatience.<br>\r\n<br>\r\n\"Wow, you look sexy.\" you whispered, without thinking.<br>\r\n<br>\r\nMel did not look impressed. \"Hello, Luke.\" she said, trying to be polite. \"I doubt you came here to compliment and stare at me, what do you want?\"<br>\r\n<br>\r\nYou shook your head, forcing yourself to look Mel in the eye. \"I... I found a pretty antique for my girlfriend, Britney, at a garage sale a few miles from here,\" you said, showing her the pendant. \"I was hoping John or his friend could give me a history on it.\" you paused, smiling at Mel's beauty. \"Then again, maybe I can persuade you to dump that Harry freak and go out with a real man instead.\"<br>\r\n<br>\r\nMel fought her anger while, inside, her mom (Natalie) held back and silenced a furious Harry in a black tux, who had just asked Mel out earlier that day, hence the sexy dress. Only Mel was quick to recover and smiled at you. \"Why, do you know where I can find a real man?\"<br>\r\n<br>\r\n\"Very funny, Melanie.\" you said. \"It's your loss... is John home or not?\"<br>\r\n<br>\r\nMel shook her head. \"He's sick right now.\" she told you. \"I don't think he's in any mood for company.\"<br>\r\n<br>\r\n\"It'll only take a second.\" you promised. \"May I please come in?\"<br>\r\n<br>\r\nMel paused to turn to Natalie, who shook her head before whispering something to Harry, as Mel turned back to you. \"Sorry, Luke.\" she said. \"Mom told me not to let anyone disturb him.\" she gave you an almost evil smile. \"That's a very pretty pendant, though. Bye.\"<br>\r\n<br>\r\nWith that, she slammed the door in your face. \"Little bitch.\" you thought, walking away.<br>\r\n<br>\r\nUnknown to you, Mel had a conversation with her mom after she had slammed the door. \"Poor Luke doesn't realize what he has.\" said Mel with a giggle. \"What do you think we should do?\"<br>\r\n<br>\r\nNatalie shook her head. \"I will tell Elvira, the head witch, that Luke had purchased a magical item from Samantha.\" she said, seriously. \"After that, it is out of our hands.\" she then grinned. \"We will be having our hands full as it is with John, he should have known better than to try to break up a 'cat fight', least he now knows magic is real.\"<br>\r\n<br>\r\nLittle did you know that John was truly sick and irritable, being hit with a sick day spell after trying to break up a 'fight' between Hayley and Mel. As you got back into your car, you looked at the medallion, thinking. \"Mel probably lied out her ass and is laughing at me right now.\" you thought, glumly. \"Hopefully, I will catch him at school tomorrow, I can't take the risk that Brit will carry out her threat.\"<br>\r\n<br>\r\nStaring at the medallion, you felt the sudden urge to put it on, not knowing that it was the medallion itself compelling you. It was very pretty and it did seem to match your style, again the medallion playing on your mind. \"Maybe I'll just keep this and forget about Britney.\" you muttered. \"She was a pain anyway.\"<br>\r\n<br>\r\nWhat do you do?<br>\r\n</span></div></div>",
            "created":1292994000,
            "id":1020217,
            "title":"You fall further into trouble"
        },
        "11311":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "your manhood is a fifth on its normal size",
                "you look like a 10 year old"
            ],
            "content":"<div class=\"\"><div> <span>\"Why did I do that?\" you wonder, seeing the medallion around your neck. You try to take it off, but it emits a weird green glow, creeping you out a little. \"Who cares. I'll talk to that bitch of a sister. She'll help me patch things up with Brit\" you think, smiling, trying to mask your surprise. Bella has helped you before when you've been caught out, even though she detests you. You just laughed at her threat last time that 'this is the last time I'm helping'. You've heard it before... Thirty minutes later, you're home.<br>\r\n<br>\r\n\"Bella, I need...\" you say, only to have your sister look at you coldly. \"Britney called me. I warned you, you jerk. What do girls see in you anyway. I wish.....\" Bella says icily, unaware her wish is about to come true. You stare at her, internally laughing at her wish, before you start feeling weird.<br>\r\n<br>\r\n</span></div></div>",
            "created":1293512400,
            "id":1024324,
            "title":"You put it on, something happens."
        },
        "113111":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "a pair of panties",
                "her phone, ready to call your ex"
            ],
            "content":"<div class=\"\"><div> <span>\"I wish your manhood is only the fifth of the size it is now, bro. That'll stop you from going <i>near</i> girls\" Bella says meanly, even though she knows her wish will never come true. She turns around, wanting to do something pleasant. \"Aaarrgh, even homework is better than being near that loser\" she thinks to herself.<br>\r\n<br>\r\nYou laugh, but you begin to feel weird, especially around your groin \"Luke, quit it. You're not fooling anyone\" Bella says over her shoulder, but you ignore her since you can feel something shrink. Desparately, you take a look, again ignoring Bella, and her disgusted look. As you feared your manhood has shrunk but is still there, only the size of that of a little boy. Fearfully, you turn to Bella.<br>\r\n<br>\r\n\"How is this possible? What did you do to me? Change me back, now!\" you demand to your puzzled sister. <br>\r\n<br>\r\n\"What? You're telling me it worked! I'm not a witch. Did you do anything to another girl, 'little' brother?\" Bella grins meanly. You shrug, still unaware that the medallion caused Bella's wish to come true, and will make things a lot worse for you later.<br>\r\n<br>\r\n\"Wait a sec. I've got something more comfortable\" she says, smiling even more meanly, as she runs to her room.<br>\r\n<br>\r\n\"stop. Don't leave me\" you say frightened, partly because you're afraid of what she's going to do. She returns a minute later, with something behind her back<br>\r\n<br>\r\n</span></div></div>",
            "created":1293512400,
            "id":1024331,
            "title":"not such a big boy now"
        },
        "1131111":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "You go to Rachel",
                "You run into some buddies"
            ],
            "content":"<div class=\"\"><div> <span>A few minutes later, Bella comes back carrying something small and pink in her hands. She grins as she said, \"These would be much more comfortable for you. I wish you would be compelled to take these and wear them, and that you would never wear any underwear but panties from now on.\"<br>\r\n<br>\r\nYou started to say, \"That is not going to hap..., to hap..., that won't...\" But you couldn't take your eyes off of those panties! You recognized them as Rachel's, that you stole from her panty drawer one day that you were at her house. Where did Bella get them? You whined, and then said, \"No! This can't be happening!\" As you said it, you grabbed the panties out of her hands and ran to the bathroom. You were not content until you were wearing them, and you had to admit, they felt wonderful!\"<br>\r\n<br>\r\nAfterward, you tried to sneak out of the bathroom, but Bella was waiting, and walked up to you, \"It worked! Didn't it?\" She jumped up and down, \"Now you can learn what it is like! Only, you don't deserve to be male at all. I wish you had a pussy and all that goes with it, just like a normal girl.\"<br>\r\n<br>\r\nYou yelled, \"No! Please don't!\" Even as you said it, you could feel you tiny penis fade away and pull inside of you. Then you felt other changes inside of you. Soon, where it counted most, you were a fully functional female. You tried wishing yourself back, but it didn't work for you! Then you begged Bella, \"Please! Change me back! I will do better! I promise!\"<br>\r\n<br>\r\nBella sneered at you, \"You don't get off that easy... sister. I will do this for you. I will wish you back to normal 'if' you do one thing.\"<br>\r\n<br>\r\nYou got your hopes up, \"Yes! Anything!\"<br>\r\n<br>\r\nShe grinned, \"Good. You have to tell Britney and Rachel the truth about each other, then come back here.\" You started to protest, but she just smiled and said, \"Or get used to peeing sitting down.\"<br>\r\n<br>\r\nYou had no choice, \"Oh, okay. You win.\"<br>\r\n<br>\r\nBella smiled, \"Good, but I have a wish to go with you. I wish that any lie you tell to them or any other girl, or any lie that you tell a guy about a girl, will boomerang back onto you, but only you and I will see or know of the changes.\" Before you could protest more, she said, \"You better go before you are in a dress and makeup.\"<br>\r\n<br>\r\nYou hurried out!</span></div></div>",
            "created":1528693200,
            "id":2505924,
            "title":"a pair of panties"
        },
        "11311112":{
            "author_id":"nmelissa",
            "author_name":"PonyGirl",
            "choices":[
                "To Rachel's house",
                "To Britney's house"
            ],
            "content":"<div class=\"\"><div> <span>You are desperately trying to think of a way out of this. There has to be something you can do! You haven't gone far when you run into some of your best buddies, Joel and Rob. You can't just walk past them, so you stop and chat. However, they soon sway the subject when Rob says, \"Hey! Are you still seeing both Rachel and Britney?\"<br>\r\n<br>\r\nWhen you say you are, Joel asks, \"Why do you bother with such a square girl as Rachel when you are dating Britney? I mean, Britney is much sexier!\"<br>\r\n<br>\r\nAll to quickly, you forgot about your sister's wish, and you lie to them, \"You would think, huh? But it is not what it seems. Sure Rachel 'acts' square, but she is one horny bitch! When she sees a guy, she always wonders what his cock would feel like inside of her. And she gives the greatest blow jobs! She even loves the taste of cum! On the other hand, Britney is sexy, but she is looking for a guy who wants to get married and raise a big family. You just can't judge a book by its cover guys!\"<br>\r\n<br>\r\nSuddenly, there was a tingle in your head. The next thing you knew, when you looked at Rob, you thought about how he would make a great husband and father. That it would be great to have a lot of children with him! You looked away from him, but when you looked at Joel, you started to get horny! You could feel the pussy between your legs tingle and begin to get wet as you wondered what his cock would feel like between your legs! Worse yet, you started wanting to taste his cum!<br>\r\n<br>\r\nYou had to get out of her and get this over with! \"Um, sorry guys. I gotta go. Talk to you later!\" You almost ran off! You had to! You wanted sex with either of them so much you couldn't believe it!<br>\r\n<br>\r\nYou realized that you had no choice but to do as your sister said! </span></div></div>",
            "created":1529298000,
            "id":2508884,
            "title":"You run into some buddies"
        },
        "1131112":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Bella stops you from escaping",
                "You escape"
            ],
            "content":"<div class=\"\"><div> <span>\"Look what I've got?\" Bella teases. You tense up fearing she is going to try and dress you in girls clothes, but she got something worse.... her phone.<br>\r\n<br>\r\n\"What don't take a picture\" you scream but Bella grins.<br>\r\n<br>\r\n\"Relax, little bro... I'm not that mean, even though you deserve whatever caused this. It doesn't mean I'm not going to enjoy it. Maybe if you're good, I'll try to help you\" Bella say, dialling a number. <br>\r\n<br>\r\n\"Why are you calling me? I told him I want nothing to do with that jerk\" the familiar pissed off voice of your now ex, Britney says. You look at Bella, horrified. \"No\" you mouth, but Bella grins. \"Trust me, you want to see this. It will make up for what he did to you\" Although Britney is initially hesitant, Bella manages to convince her to come over within an hour.<br>\r\n<br>\r\n\"Why did you do that?\" you hiss, feeling sick. You'd rather be bashed by that Harrison boy, than Brit seeing your now baby sized member, who would enjoy your discomfort. You think of you options, not there are many. No doctor on the planet will believe your story, and worse doing anything opens you up to ridicule from <i>everyone</i>, ruining your chances with any girl within 200 miles. Maybe you can run...</span></div></div>",
            "created":1293598800,
            "id":1024658,
            "title":"her phone, ready to call your ex"
        },
        "11311121":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Britney arrives",
                "Bella accidently regresses you to 14, and figures out the pendant does it"
            ],
            "content":"<div class=\"\"><div> <span>\"No no no!\" Bella says, as you try to dive past her. \"You're going to stay there and take it like a man, not that you're much of a man, Luke\" Bella teases as she grabs you.<br>\r\n<br>\r\n\"Let go of me\" you yell, but its useless For some reason you can't fight her off and she quickly ties you on a chair. \"Why are doing this to me? I've never done anything to you.\"<br>\r\n<br>\r\n\"Really? How about this. Always been a jerk, treating women like crap then getting <i>me</i> to sort out your mess. I don't know why your dick is like a baby's but I think its karma, little boy\" Bella grins<br>\r\n<br>\r\n\"Let me go or I swear....\" you say. Bella sighs and picks up her phone again. \"Hey Britney. Its Bel again. I got the pig tied in a chair, and he's squealing like one too. Should I start now?\"<br>\r\n<br>\r\n\"No, let me go\" you shout again. You hear Britney's laugh from the phone. \"No. I'm going to be late. I'm at the mall to pick up a new pair of panties and a skirt...\"<br>\r\n<br>\r\nYou don't like the sound of that and start banging the chair to escape. Both girls giggle, then Bella ends the call. She looks at you meanly. \"Looks like dress up for little Luky.\"</span></div></div>",
            "created":1294117200,
            "id":1028701,
            "title":"Bella stops you from escaping"
        },
        "113111212":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "little girl's clothes",
                "extra big clothes"
            ],
            "content":"<div class=\"\"><div> <span>\"Don't you dare\" you yell, bumping the chair. As you do it, the necklace falls out of your pocket. Bella notices, and picks it up.<br>\r\n<br>\r\n\"Where did you get this. Its pretty\"<br>\r\n<br>\r\n\"That bitch wanted it\" you rage.<br>\r\n<br>\r\n\"You're not acting like a man, are you?\" Bella says, picking up the necklace. \"God, you're so childish. I wish you was younger\" Bella says, before gasping. You're shrinking, back to the same size as you was when you was 14. Bella looks at the necklace and gasps. \"The necklace must be doing this. Wonder what else I can do\" she thinks, before giving another evil smile.<br>\r\n<br>\r\n\"I've got a few things to prepare for, Luke. Hoping you like it\" she grins, leaving you alone.<br>\r\n<br>\r\n\"Whats happening to me\" you think, trying to escape. It doesn't work, Bella returns fifteen minutes later, and Britney is beside her. Britney looks annoyed. \"I thought you was taking me to see that scum ex of mine\"<br>\r\n<br>\r\n\"I am. You see somehow Luke had, err, an accident. I regressed him to 14 and lets say he isn't quite the man he was downstairs. Since I wouldn't believe this story either, I'll demostrate. What size is that skirt you wanted to put Luke in?\"<br>\r\n<br>\r\n\"32\" Britney says evenly. Bella grins, and tells Britney to open her bag. She rolls her eyes, but does it. She lets out a small scream. \"What happened!?!\"<br>\r\n<br>\r\n\"That same thing that happened to Luke.\" she says before whispering something you can't hear to Britney. Whatever she said mustn't be good, since your ex now has that same evil smile as your sister. \"Let's show little Luke whats in the bag\" she says. pulling out</span></div></div>",
            "created":1294203600,
            "id":1029369,
            "title":"Realization"
        },
        "1131112121":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "you remain a boy",
                "you go girly"
            ],
            "content":"<div class=\"\"><div> <span>From the evil grin on the girls faces, you excepted to see baby clothes in that bag, but what Britney pulls out is not much better; a pair of blue tights, a sky blue dress and clip on earings, all suitible for a five or six year old.<br>\r\n<br>\r\n\"No way!\" you scream as Bella comes menacing towards you. \"Wait!\" yells Britney. You give a sigh of relief, thinking she must have taken some pity on you. That's until you see her eyes.<br>\r\n<br>\r\n\"Please don't. I'm sorry Britney. Don't do, whatever you're going to do\" you beg as Beritney turns to Bella. \"The clothes are a bit small for him. Can't you do something about it?\"<br>\r\n<br>\r\n\"Sure, I can shrink him. Should I shrink him down into a little boy, dress him up, and if he steps out of line even once, he goes girly on us, apart from the girls' clothes. I bet he won't last ten minutes\" Bella sneers. You gulp, since you don't want Britney to see what Bella has already done to you, and you don't want Bella to turn you into a girl. \"Don't do that to me. I'm begging you two. If you going to change me, I'll be a good little boy\" you beg.<br>\r\n<br>\r\n\"Quiet, you're not part of this discussion\" Britney snaps. She turns to Bella. \"I don't know maybe we should do the change straight away and get <i>her</i> to shut up. You'll make a cute girl, yes you would\" Britney teases, as you start feeling weird again, a sign Bella is using some sort of freaky power on you...</span></div></div>",
            "created":1294290000,
            "id":1030105,
            "title":"Dress up for little Luke"
        },
        "11311121212":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "\"Change you back? This is your true body, Lucy\" as she breaks the necklace",
                "\"Don't worry, little sis. I can't keep you like this. mom would find out...\""
            ],
            "content":"<div class=\"\"><div> <span>\"As I said, <i>Lucy</i> would only last a couple of minutes\" Bella says, to Britney, who is in full agreement. <br>\r\n<br>\r\n\"You can't do this to meeeee. My voice\" you say alarmed, seeing that your voice is much higher pitched. Only then you realize you're shrinking.<br>\r\n<br>\r\n\"You're going to make a cute little girl. Much better than that worthless brother\" Bella grins.<br>\r\n<br>\r\n\"Or boyfriend\" Britney adds.<br>\r\n<br>\r\nThe strange feeling intensifies, and you see that the world seems to be much bigger. You move, and your clothes fall off of you. You turn to the girls, who giggle. You're almost done, <i>Lucy</i>\" Bella says. You look down and feel that your rear is becoming much more perky, and whats left of your member is shriveling up, along with your balls. Within seconds a gash has opened, and you feel like your insides a twisting. You know that you're developing girls' reproductive parts. <br>\r\n<br>\r\n<br>\r\n\"Just a few seconds more. She's gaining her overies. All done\" Bella says cheerfully. \"Brit, can you help me dressing my little sister?\" Britney grins evilly. You try to run, but she's too big. \"Little girls can't run around naked\" Britney laughs, as she pulls a pair of panties over your femine crotch. While she holds you, Bella slams the dress over you, then ties you in it. Finally, she gets some blue ribbons, and ties your hair into two pigtails. You feel sick as the show you your reflection; the cute six year old that they're cooing over is you.<br>\r\n<br>\r\n\"W what are you going to do to me?\" you stammer. \"You're had your fun and revenge. Change me back\" <br>\r\n<br>\r\n<br>\r\nBella grins</span></div></div>",
            "created":1294635600,
            "id":1032581,
            "title":"you go girly"
        },
        "113111212121":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Lucy forever"
            ],
            "content":"<div class=\"\"><div> <span>\"Why would we want to do that? You make a great little sister, Lucy Michelle Adams\" Bella grins, as she gives a nod to Britney. Britney returns the nod. \"Why would we? So you can cheat on another girl? You're not going to cheat on anyone else. Bella, do it\"<br>\r\n<br>\r\nYou watch helplessly as Bella pulls out the necklace. \"See this? This what turned you into a little girl\" she says, pauses then snaps the necklace into half.<br>\r\n<br>\r\n\"Noooo!\" you scream. \"Change me back. Change me back!\" you scream.<br>\r\n<br>\r\n\"I can't even if I wanted to. This is your true body, Lucy. Don't worry, you're adjust quickly to your new life. Brit, before I snapped it, I got a few supplies to redecorate this place. No little princess wants an icky boys room\" Bella grins, as Britney goes out. You dash to the broken pieces of the necklace, hoping that something can get you out of this.</span></div></div>",
            "created":1294808400,
            "id":1033978,
            "title":"Change you back? This is your true body, Lucy"
        },
        "113111212122":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "a couple of minutes later",
                "next morning, and you think everything is a dream, until Bella shows the dress"
            ],
            "content":"<div class=\"\"><div> <span>\"Don't worry, <i>Lucy</i>. Do you think I'm going to <i>keep</i> you as my little sister?\" Bella grins.<br>\r\n<br>\r\n\"Yes, you psychotic little bitch\" you say quickly, before wincing. You don't want her to doing anything rash; you know you won't like it.<br>\r\n<br>\r\nBella shakes her head. \"Seriously sis. You know <i>nothing</i> about girls, so I'm going to keep you as one... when we're alone. Do you think I want mom to find out? Britney, you want a job?\"<br>\r\n<br>\r\n\"Babysitter? Sure. Not all the time though. I'm sure you want some bonding time with your little sister\" Britney grins.  <br>\r\n<br>\r\nYou can't believe these two. As you stand up, you feel funny and collapse. You wake up</span></div></div>",
            "created":1294808400,
            "id":1033972,
            "title":"I can't let mom find out..."
        },
        "1131112121222":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You wait for her, since you don't want to infuriate her even more",
                "you drive as far away as you can"
            ],
            "content":"<div class=\"\"><div> <span>You wake up the next morning, in your own bed. \"What happened\" you mutter, then freeze. Its your real voice. \"Wait. Am I really thinking that it was real. Seriously Luke. Bella got some sort of witch powers, and got Britney involved? As if...\" you think getting up. As you get ready for school, you decide that the whole thing, Britney breaking up with you included, must have been some sort of weird dream.<br>\r\n<br>\r\n<br>\r\n\"Urrrgggh. No more spicy food for me\" you mutter as you head down for some toast. Bella is sitting at the table, grinning. She hasn't looked as happy for months.<br>\r\n<br>\r\n\"Morning bro. Any interesting dreams?\" she says somewhat sinesterly. \"Great, I must have said something in my sleep\" you think, deciding you should get away from the little brat. Mom comes over, and says. \"I've got to work late again. You two have to look after yourselves. And Luke, try to get along with your sister\" She gets up and leaves for work.<br>\r\n<br>\r\nYou have no intention of 'getting on well' with Bella. In fact you concider driving to school now, and forcing her to walk. \"Bella, I have to go now\" you say, knowing she is nowhere near ready for school. She doesn't seemed phased at all. Grinning you walk out the door, knowing she will get into trouble for arriving late to school. as you're about to unlock your car, something is banging on the house window. Its Bella, and she's holding something. You look closer and see its a blue, little girls' dress, like the one from your dream.<br>\r\n<br>\r\n\"That dream was real\" you freak after seeing that dress, and the creepy look on your sister's face. <i>She did turn you into a little girl, and she said she's going to do it every time you're alone....</i><br>\r\n<br>\r\nThink, Luke what should I do...</span></div></div>",
            "created":1294894800,
            "id":1034495,
            "title":"That horrible 'nightmare' is real"
        },
        "11311121212222":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Yes, she can....",
                "You crash your car into Natalie's Harrison's while distracted"
            ],
            "content":"<div class=\"\"><div> <span>Terrified, you jump into your car, and drive off. You want to get as far away from that girl as you can. Within minutes, you start to calm down. \"The necklace. How is that possible. I bet that Forester woman knows, but she creeps me out. I don't want to go anywhere near her.. NO, why did I drive in this direction?\" you think, seeing that you in your panic started driving toward's Samantha's town.<br>\r\n<br>\r\nYou get another thought. \"Maybe it won't be a bad thing. Bella won't think I came to hide here. Good she can't do anything to me now\"</span></div></div>",
            "created":1294894800,
            "id":1034849,
            "title":"you drive as far away as you can"
        },
        "113111212122222":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "John pulls you from the car.",
                "You get away, for now."
            ],
            "content":"<div class=\"\"><div> <span>Distracted by insanity of the day before and your thoughts of Bella's plans for you when you return, you failed to see that your car had swerved into the other lane. An angry horn startled pulled you back into reality and you saw the other car coming at you, with a startled young woman with honey blond hair at the wheel.<br>\r\n<br>\r\n\"Woah!\" you screamed, frantically turning the wheel.<br>\r\n<br>\r\nOnly you were too late and you hit the other car head on, causing your airbag to deploy. You were only out for a few seconds and you looked up to see that the airbag in the other car's steering column had also deployed. the woman driver was sitting back in her seat, stunned but alive. She tried to turn her head to the passenger seat where a young boy with brown hair sat, dazed as well. Only she winced as she did, you guessed that her neck was injured from whiplash, caused by the crash. Not wanting to get sited, or worse, arrested, you tried to restart your car to haul ass out of there!<br>\r\n<br>\r\n\"They're fine.\" you assured yourself. \"They're insurance will cover the damages, I'm out of here!\"<br>\r\n<br>\r\nUnknown to you, she had a brief conversation with the passenger.<br>\r\n<br>\r\n\"Mom... you okay?\"<br>\r\n<br>\r\n\"I'll... (wince) live, John.... My neck hurts a little but other than that..\"<br>\r\n<br>\r\nHearing you trying to start the car, John became enraged. \"He's trying to flee the scene!\"<br>\r\n<br>\r\n\"Don't hurt him, John.\" said his mother as he exited the car. \"Just stop him.\"<br>\r\n<br>\r\nStill trying to start your car, you looked up to see the boy, coming at you from the other car, looking furious. He looked to be twelve or thirteen, judging by his height, only he was very muscular. As he came closer, your blood ran cold as you recognized him as John Harrison from Britteny's school. Frantic, you tried to start your car again. \"Come on!\" you yelled, hitting the steering wheel. \"Start, you piece of shit!\"<br>\r\n<br>\r\nJohn was standing next to the drivers side door in the next breath,  just as the car started...<br>\r\n<br>\r\nWhat happened?<br>\r\n</span></div></div>",
            "created":1294981200,
            "id":1035226,
            "title":"You crash your car into Natalie's Harrison&..."
        },
        "1131112121222222":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Yes, you're car starts to change into a kid's bike",
                "Britney hears about the accident"
            ],
            "content":"<div class=\"\"><div> <span>The boy that Britney wanted to turn on you is coming at you. Earlier you would have prefered to been beaten up by this 13 year old, even though you would never have lived that down, than your physico sister doing magic on you constantly. Seeing the enraged boy come towards you, changes your mind quick; no you don't want to be beaten to a pulp by John Harrison. You turn the key again, and it starts your car. You wave cheerfully as you reverse, and drive into the distance.<br>\r\n<br>\r\n\"That jerk was pissed\" you say, as your heart stops racing. John had chased you for several hundred yards while you was reversing. Only when you got a place you could do a 180, could you put some distance between that boy. You drive, wondering what to do. Going home while Bella is at school sounds good. Maybe she left the necklace at home.... Meanwhile....<br>\r\n<br>\r\n\"Don't worry, John\" Natalie Harrison says to her son, as she drives her now repaired car towards him. \"He will get what's coming to him. I just got off the phone with Elvira. Seems that boy is one of Samantha Forester's  'projects' right now. Normally I don't approve of Sam's actions, but I think I'll make an exception. He won't get an favors from me.\"<br>\r\n<br>\r\n\"What is happening to him?\" John asks.<br>\r\n<br>\r\nNatalie says to John \"That boy brought a necklace pendant from Samantha, and it got into the hands of his long suffering sister. She is now using it to cause trouble for that jerk, though should I cause him trouble too...\"</span></div></div>",
            "created":1294981200,
            "id":1035615,
            "title":"You get away, for now."
        },
        "11311121212222221":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You reluctantly ride the bike",
                "you abandon the bike, and walk home"
            ],
            "content":"<div class=\"\"><div> <span>Natalie mutters some words, as John asks her what she is doing. \"Since that jerk will be almost home, I know he will be safe. However he is a menace to other motorists, so he needs a new form of transportation\" she says, as she casts her spell. Miles away, you notice something is wrong.<br>\r\n<br>\r\n\"What's happening to my car?\" you wonder as the interior starts to shimmer with a weird light. You're on a deserted street, so you pull up and stop the car., worried that Bella has the necklace and is using it to get some sort of revenge. You get out, hoping that you're not going to see it hot pink of something like that. The instant that you get out, the car vibrates, glows and shrinks down to the shape and size of a kid's bicycle. \"My car!\" you fume, as the car changes color to that what you feared; hot pink. You stare at your car turned girls' bike, wondering what to do, since you still a couple of miles from home.</span></div></div>",
            "created":1295413200,
            "id":1038168,
            "title":"Your car starts to change into a kid's bike"
        },
        "113111212122222212":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "You are taken for a ride.",
                "You become a little girl."
            ],
            "content":"<div class=\"\"><div> <span>\"This day keeps gets better by the minute!\" you whispered, sarcastically, kicking the girl's bike in the front tire. \"I guess I'm walking home.\"<br>\r\n<br>\r\nWith that, you stuffed your hands deep into your pockets and began to walk down the side walk, glumly mumbling to yourself, not knowing that you were being watched. That, and the little hot pink bicycle was starting to follow you, under it own power. Miles away, Samantha Forester giggled, sitting at her dinning room table, staring into a large crystal ball.<br>\r\n<br>\r\n\"I <i>knew</i> you had it in you, Natalie!\" she said with a mad grin. \"Now, allow an expert to show you how to really drive a boy mad with fear!\"<br>\r\n<br>\r\n\"I can't believe this week, so far!\" you said, angrily, kicking an empty can. \"What a pain in the ass!\"<br>\r\n<br>\r\nThen, the sound of a bicycle bell reached your ears, causing you to freeze. Slowly turning around, you saw the hot pink girl's bike, that was once your car, only a few feet behind you. Its bell rand under its own power and the front white reflector turned red for a second, then turned white again. Seeing that, all the color ran from your face as you screamed out in utter terror and ran for your life! The pink girl's bicycle gave immediate chase.<br>\r\n<br>\r\n\"Run, little boy, run!\" yelled Samantha, before laughing madly.<br>\r\n<br>\r\nThrough her crystal ball, she watched you jump a wall, landing on the other side and teleported the bicycle to the othjer side of the fence, ringing its cute bell at you.\"<br>\r\n<br>\r\n\"No!\" you screamed, panicked. \"Get away from me, you psycho bicycle!\"<br>\r\n<br>\r\nYou ran from the bicycle again only it caught up with you quick and, before you knew what was happening, it had hit you from behind and you were thrown off your feet, landing onto the seat of the bicycle. you feared what would happen next.<br>\r\n</span></div></div>",
            "created":1295413200,
            "id":1038273,
            "title":"Run, little boy, run!"
        },
        "1131112121222222122":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You  go home but Bella is waiting for you",
                "the bike decides for you"
            ],
            "content":"<div class=\"\"><div> <span>As you feared, as soon as you landed on the seat, you begin to change. Your jeans quickly change texture and legs fuse together, then shrink into a skirt. The changes then creep up, changing your top into a pink and white one. You feel yourself begin to shrink down to childish size. Then comes the part you hate the most. You cringe as you gain girlish features. Within seconds where a terrified teenage boys was, a cute but terrified looking five year old girl looks on. Annoyed you brush your loose hair back. \"Least I don't have to worry about being seen on a girls' bike\" you think sourly, wondering what to do. You know that you'll be turned back before mom finds out, Bella has made that clear, but you don't want to spend the day doing girls' stuff.</span></div></div>",
            "created":1295413200,
            "id":1038432,
            "title":"You become a little girl."
        },
        "11311121212222221221":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "She tells you to play with other little girls",
                "she pulls you inside"
            ],
            "content":"<div class=\"\"><div> <span>As much as you don't want to do it, you decide going home is the best option you have. Sadly, you being cycling home, still feeling weird about riding a girls' bike, even though you're now a girl. It is about 1pm when you get home, and you're exhausted. As you thought, Bella is sitting outside, not looking happy that she is missing school thanks to you, and locked out the house for the day.<br>\r\n<br>\r\n\"What happened to you? I didn't change you. And did you steal someone's bike?\" Bella says surprised as soon as she sees you.<br>\r\n<br>\r\n\"That witch must have done this to me. She turned my car into this\" you say disgustedly.<br>\r\n<br>\r\n\"Good. Saves me from having to do it. Besides that car suits you better now\" Bella grins. She eyes a key, strapped to your bike, and takes it, opening the door.</span></div></div>",
            "created":1305349200,
            "id":1105572,
            "title":"You  go home but Bella is waiting for you"
        },
        "113111212122222212212":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                ".. but brainwashesd you to think nothing is wrong.",
                "you notice, and complain"
            ],
            "content":"<div class=\"\"><div> <span>\"Let go of me\" you whine. Bella snickers. \"Okay little girl. I'll be nice, and even turn you back\" she says, looking at you. You suddenly feel weird again, and realize its the feeling that you get when she changes you. You look at her, wondering what she is up to. Mom isn't going to be home, and you doubt she is doing this out of the goodness of her heart; you doubt you like her sense of being 'nice'. That said, you don't want to push your luck. Everything that has happened to you has deeply unnerved you, so you spend the rest of the day in your room. You'd be even more unnerved if you knew Bella had called your ex-girlfriends/babysitters/tormentors.<br>\r\n<br>\r\nThe next morning, you open your eyes, still fearful of what Bella is planning to do to you. You feel big, so you know she isn't planning more little girl thing with you. Plus you feel that nothing is missing, or you have something you shouldn't; again a good sign. Opening an eye, you see that your room is normal too. Getting up, you decide to confront Bella, she is driving you mad, plus you doubt she has grow tired of this game. Knowing that bitch of a sister, she would leave you as a chick once she had.<br>\r\n<br>\r\n\"What are you doing to me?\" you demand.<br>\r\n<br>\r\n\"What do you mean, bro?\" Bella grins sweetly.<br>\r\n<br>\r\n\"Its too quiet. you're not tormenting me\" you accuse.<br>\r\n<br>\r\n\"What? You want me to?\" Bella grins.<br>\r\n<br>\r\n\"NO!! DEFINATELY NOT\" you say quickly.<br>\r\n<br>\r\n\"It sounds you want to be my little sis. I'll be glad to do that, but we both need to go to school. Mom will notice something if we skip it again\" Bella says. You nod, and head to your wardrobe, hoping Bella hasn't done something to your uniform. She has, she has magicalally changed it into a girls' uniform..<br>\r\n</span></div></div>",
            "created":1314334800,
            "id":1175883,
            "title":"changed back. What is she up to?"
        },
        "1131112121222222122122":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "go to school",
                "Skip school"
            ],
            "content":"<div class=\"\"><div> <span>It takes a few minutes, but you eventually notice the uniform that you're wear was definitely not the one you put on. \"Bella! You've changed my uniform to the girls' one. Are you insane?\"<br>\r\n<br>\r\n\"Of course I've changed it. Did you think I wouldn't leave you alone?\" Bella said slyly. You thought about protesting about how this would completely ruin your reputation , but you knew it would be pointless. Of course you knew she cared deeply about hers.<br>\r\n<br>\r\n\"What about your reputation? Wouldn't you be embarrassed about having a brother that (wince) wore this?\" you said as you tugged the skirt.<br>\r\n<br>\r\n\"Already covered. God, you're such an idiot Lu. I'm the one that put you in that uniform. Maybe I should turn you back into a kid again so your body matches your intelligence\" Bella said. You was unfazed as you felt it was an empty threat. Instead, you folded your arms and glared at your sister.<br>\r\n<br>\r\n\"What if I don't want to go to school?\" you said icily.<br>\r\n<br>\r\n\"Bad idea. One, you're going to have to answer to mom for missing school. Two, you have to sign up for the new round of sports today\" Bella said with a shark like grin. You gulped; you had been looking forward to choosing something good for PE. now you was torn between the embarrassment of going to school and the embarrassment of whatever that bitch would give you; both you and Bella remembered that old Simpsons cartoon.<br>\r\n<br>\r\n</span></div></div>",
            "created":1399525200,
            "id":1793599,
            "title":"reputations and punishments"
        },
        "11311121212222221221221":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "on the bus",
                "walking to school",
                "you try your bike"
            ],
            "content":"<div class=\"\"><div> <span>Gulping, you saw that missing school wasn't an option because of PE. You love doing sport and you're certain you'd get worse than ballet, or whatever tortuous thing your evil sister could dream of. Plus you knew she would never exposure herself to ridicule just to bring you down. Grumpily, you grabbed you now girlish school bag, and walked outside. instantly you realized that you was in trouble as your car was still a pink little girls' bike.<br>\r\n<br>\r\n\"Bella! How am I going to get to school?\" you asked.<br>\r\n<br>\r\n\"You're a big 'girl'. Figure it out\" you sister cheerfully said. You groaned, wondering what to do.....</span></div></div>",
            "created":1405400400,
            "id":1828370,
            "title":"A humiliating start to school"
        },
        "113111212122222212212211":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Everyone sees you as a girl",
                "Everyone sees you as a guy... dressed as a schoolgirl",
                "Everyone seems indifferent to your outfit"
            ],
            "content":"<div class=\"\"><div> <span>Considering that everyone at school would be seeing you anyway, you figured you may as well catch the bus. Gulping slightly, you waited for the bus. After about five minutes, the bus pulled up and you nervously looked at it. Up to this point, you had gambled that Bella wouldn't risk embarrassing herself through your actions, but now you began to doubt yourself; being seen in a girl's school uniform would be a blow your reputation would never recover from. </span></div></div>",
            "created":1405400400,
            "id":1828415,
            "title":"on the bus"
        },
        "113111212122222212212213":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "the bike takes you to elementary school",
                "the bik takes you to your normal school",
                "the bike drops beneath your feet"
            ],
            "content":"<div class=\"\"><div> <span>You figured that you may as well try your bike, hoping that it had changed back. Cautiously, you approached the back where you had fearfully left it. Almost immediately, you saw your hopes were in vain. The bike was still there, lying motionless on the ground.<br>\r\n<br>\r\n\"Damn it\" you muttered, wondering what you should do next. You knew the last time you was near it, the bike chased you for a mile, then turned you into a little girl. Cautiously, you stepped back, but you wasn't cautious enough; you stepped on a twig, and the crunch of it breaking was enough to announce your presence. the bike righted itself, and immediately moved straight for you. You tried to run, but the bike rode straight into you, bumping you off your feet, and straight into the seat. Within a second you had changed once more into a little girl, wearing a yellow skirt, white puffy sleeved top, mary janes and a terrified look on her otherwise innocent and childish looking face</span></div></div>",
            "created":1405400400,
            "id":1828417,
            "title":"you try your bike"
        },
        "11312":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You find yourself changed in the morning",
                "At school (you keep the medallion with you)"
            ],
            "content":"<div class=\"\"><div> <span>Yes, Britney was a pain. \"Luke, you're losing it. Going out with an airhead like her. What was I thinking!\" you think, as you pocket the medallion. Trying to silence Britney will take up too much time, plus you're not really too concerned. \"Who's going to believe her anyway, and John Harrison,, He's still only a kid..\" you think dismissively, wondering who else at that school is going to go out with you. Smiling, you decide to have a challenge. One of those Harrison girls is great, even though that older one, Hayley somehow gives you the creeps. Looking next door, you get the answer. \"Yes, the doc's kid. That is a worthy challenge. Not now Luke, wait a month, then make my moves...\" Smiling you get back into your car, and head home. You ignore the whining of your bitch of a sister about how you treat girls, and head for bed. Even though its 7pm, you feel tired for some reason.<br>\r\n<br>\r\nMeanwhile, Natalie Harrison has a quick conversation. \"You're aware that Forester sold that thing? No, I haven't talked to Hayley. So you're saying that boy is trouble, and deserves everything he gets. Elvira, mom, I wouldn't. Okay, I'd change him if he did something to the girls long before Samantha can do anything.  Of course I won't interfer.  I'm too busy anyway. You try raising two teen witches, a teen boy...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1292994000,
            "id":1020407,
            "title":"You put it your pocket."
        },
        "113122":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You approach a cute looking girl",
                "you duck into the bathroom first"
            ],
            "content":"<div class=\"\"><div> <span>\"She's hot. Nerd. Maybe, if she dropped 20 pounds\" you think, as you walk towards school, looking at various girls. You don't ofter consider having two girlfriends from the same area, but maybe... It will help pass the time before you seduce that Megan. Shaking your head, you pat your pocket. \"Why did I bring this piece of junk?\" you wonder, wishing that you didn't have to wear this dorky uniform. Pants, white shirt, tie... It drives you crazy. Least the girls look good in theirs, and it does make it a bit easier asking them out. You decide to get rid of this thing, give it to some girl as part of a first date.</span></div></div>",
            "created":1292994000,
            "id":1020418,
            "title":"At school (you keep the medallion with you)"
        },
        "1131222":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You turn into a really hot girl your own age",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>FOr some reason you feel like you have to go to the bathroom. Badly. Ignoring your original thought, you duck into the the nearest bathroom, unaware the the medallion in your pocket has begun to glow, and that its magic is about to be realized on you...</span></div></div>",
            "created":1292994000,
            "id":1020425,
            "title":"A bathroom change"
        },
        "11312221":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You change at once",
                "You don't change now (slow physical and mental changes)"
            ],
            "content":"<div class=\"\"><div> <span>Without warning, your hair lengthens from your normal short cut, to about three inches past your shouders. \"What the fuck is going on?\" you say, more annoyed to realize that things like this isn't possible. The fact that you got hair like some hippie, like those that you ridicule annoys you more than anything, and you look in the mirror, wondering what to do about your hair</span></div></div>",
            "created":1293598800,
            "id":1025119,
            "title":"same age, new gender"
        },
        "113122211":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You decide the boys bathroom is not the best place to be, you move to the girls",
                "somebody did see your metamorphisis"
            ],
            "content":"<div class=\"\"><div> <span>The hair is the least of your worries, as you suddenly feel your chest begin to itch. \"What's happening to me?\" you say, as your chest begins to push outwards. Only when they past an a cup, do you realize that you're growing breasts.<br>\r\n<br>\r\n\"Its impossible. I can't be growing tits\" you mutter, noticing that you're voice is becoming higher. You take a quick look to see if anyone is in the bathroom, but you can't see anyone. Something flicks you, and you realize that your shirt buttons are coming off. While you know that somehow you're becoming female, a part of you is in denial, but the breasts staring at you, which must at least be in the d range convinces you the impossible is really happening. Quickly, you look down you pants to see your worst fear; your member has already shrunk and the beginnings of your new womanhood is becoming visible. Plus increaing discomfort in your gut tells you whats happening to you.<br>\r\n<br>\r\n\"No. I can't be turning into a chick\" you moan, distrubed that you say it in a girls' voice. You feel a sharp pain in your gut, and you realize that you now have a uterus and overies. Desparately, you look in the mirror to see if anything of you is left, but all you see is a 16 year old girl in a damaged boys uniform.<br>\r\n<br>\r\n'Think, Luke. What should I do\" you think, knowing that no one would believe your story. You imagine the conversation at lunch. \"Hey, heard about the crazy chick? She thinks the bathroom changed her into a girl...\"</span></div></div>",
            "created":1293598800,
            "id":1025131,
            "title":"You change at once"
        },
        "1131222111":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Rachel. She doesn't recognize you",
                "a girl that you mutually hate"
            ],
            "content":"<div class=\"\"><div> <span>You suddenly realize you're in a really bad situation. Not only you've turned into a girl, you've become a hot girl. And a hot girl shouldn't be in the boy's bathroom. You suddenly feel nervous, not helped by the empty feeling you have between your legs. The last thing you want is someone to come in...<br>\r\n<br>\r\nQuickly you look around, and see that the place is deserted. Sticking your head out, you see that the hall is also deserted, giving you time to dash to the girls' bathroom. While you always wondered what it would be like, be invisible, and <i>allowed</i> (while you're a cheat, you're not a pervert, and you want to be invited in) to be there, you never wanted it to be like this. You open the door, and seethat someone is inside</span></div></div>",
            "created":1293771600,
            "id":1026049,
            "title":"Into the girls' bathroom"
        },
        "11312221111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "hide some time more inside the bathroom",
                "risk it and just run over to your car"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my god. What happened if she will realize that I am Luke?” you think to yourself, but first you are hidden inside a stall and second how could she guess that this girl you appear on the outside, has been her cheating ex-boyfriend a couple of moments before…<br>\r\nEven she does not recognize you, you are into deep shit now:<br>\r\n\"Crap, what can I do now\" you wonder. Although class has started and not many people are wandering around, you're very conscious that you're a hot chick in torn, ill-fitting boys clothes. A reminder of this is when you walk, since your shoes keep sliding, your breasts bounce, you can't help but wiggle your hips slightly. You think of your options. \"That woman and necklace. That must have caused it\" you think, before you realize a problem with your plan. \"Wait my car. It’s on the other side of the school. I can't get to it without the whole school seeing me.<br>\r\n</span></div></div>",
            "created":1372395600,
            "id":1619188,
            "title":"Rachel. She doesn't recognize you"
        },
        "113122211111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "made it",
                "bump into someone"
            ],
            "content":"<div class=\"\"><div> <span>You hide into some empty stall as fast as you can.<br>\r\nRachel has not seen you; she only saw some kind of shadow rushing into a stall.<br>\r\nYou wait for a while and heard Rachel leaving. So the cost seems to be clear now for leaving the girls toilets and also school. You have to get to your car safe somehow.<br>\r\nYou think and decided to take the longer way to the parking lot, because otherwise you would have to pass by the windows of the teacher’s room, which might not be any good idea….<br>\r\nSo you sneak out through the hall and…<br>\r\n</span></div></div>",
            "created":1421902800,
            "id":1921293,
            "title":"hide some time more inside the bathroom"
        },
        "1131222111112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "a girl",
                "a boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who you bump into?</span></div></span></div>",
            "created":1421989200,
            "id":1921783,
            "title":"bump into someone"
        },
        "11312221111121":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it Rachel?</span></div></span></div>",
            "created":1422507600,
            "id":1924913,
            "title":"a girl"
        },
        "11312221111122":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "yes",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>is it Harry your best friend?</span></div></span></div>",
            "created":1588238880,
            "id":2827391,
            "title":"a boy"
        },
        "1131222112":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "you try to go through the door, but get caught by the boy",
                "you leave by the window"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my god. What happened to you, Luke? You you you're a...\" are voice says, causing you to wince. \"Crap someone saw that. Know everyone will know...\" you think in a panic, not even concidering this might useful to you. You've got two problems; someone saw you, and you're been turned into a chick, but your clothes haven't. You turn to run, you see this boy stand in front of the door, barring your escape.</span></div></div>",
            "created":1293771600,
            "id":1026045,
            "title":"Somethings are hard to explain"
        },
        "11312221122":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You go to the mall",
                "Forget the mall and anyone seeing me. I need my car"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, Luke, you listening to me?\" the guy says. You're not even listening, evne paying attention to who he is. All you're concerned about is getting away and out of this girly body you're trapped in. You see a window and force it open.<br>\r\n<br>\r\n\"Err Luke, you don't want to do that. Just stay here and..\" the boy says, but you've already climed up and gone through the window.<br>\r\n<br>\r\n\"Crap, what can I do now\" you wonder. ALthough class has started and not many people are wandering around, you're very conscious that you're a hot chick in torn, ill fitting boys clothes. A reminder of this is when you walk, since your shoes keep sliding, your breasts bounce, you you can't help but wingle your hips slightly. You think of your options. \"That woman and necklace. That must have caused it\" you think, before you realize a problem with your plan. \"Wait, my car. Its on the other side of the school. I can't get to it without the whole school seeing me. Maybe I should go to the mall and get new clothes first\" you say softly. For the first time you're glad the mall is only a few hundred yards from the school.</span></div></div>",
            "created":1294290000,
            "id":1030632,
            "title":"Escape "
        },
        "113122211221":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "try to sweet talk Evan",
                "run into the mall"
            ],
            "content":"<div class=\"\"><div> <span>\"That woman! She is the key to this. How did she turn me into a chick anyway? Forget it, all I want is for her to turn me back, or her life expectancy will be very short\" you mutter, as you face towards the mall, knowing that you need to draw as little attention towards yourself as possible. You reach fro your pocket where you stash your cash, but its empty. \"Damn it. Maybe I can steal something\" you mutter.<br>\r\n<br>\r\nUnfortuately for you, you don't notice where you're going, and you bump into someone. Instantly you blood chills, since its Evan Thomas, one of the football members, not the ideal person you want to meet in your present situation. You're heard rumors he has knocked up three of the cheerleaders within the last 4 months, but you don't believe it. Besides you're the king of the school, though you carefully ensure none of the girls you're with get anywhere near pregnant; too much hassle. \"Why am I thinking of that. He is not going anywhere near me. I'm a guy, damn it\" you think.</span></div></div>",
            "created":1308200400,
            "id":1127223,
            "title":"You go to the mall"
        },
        "1131222112211":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "explain",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>But something inside forced you to chat with Evan in a nice way and he seems to be polite. This is not what you have been expecting from him, because normally he is quite rude around you. But now things have changed, he sees a hot girl, even she wears a male school uniform, which is quite out of place at some parts of her body…</span></div></div>",
            "created":1372222800,
            "id":1617902,
            "title":"try to sweet talk Evan"
        },
        "11312221122112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "you make it",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But no time for any further sweet talk with Evan, you need to run to the mall to at least get some fitting clothes for your new girly body…</span></div></span></div>",
            "created":1421643600,
            "id":1919939,
            "title":"something else"
        },
        "113122212":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You find yourself giggling, causing the transformation to accelerate",
                "Rachel doesn't notice anything either, and you act normally for the rest of the "
            ],
            "content":"<div class=\"\"><div> <span>'Damn hair. I should beat up the first person that comments about it \" you say frustrated, as you leave the bathroom, wondering why nobody has commented about it. You go over to your locker, and see that one of the football players is standing next to you, opening his locker. You've never liked Steve, and you're certain that he's going to comment about it.<br>\r\n<br>\r\n\"Good. Gives me an excuse to beat him up\" you think, unaware that you giggled slightly. Steve ignores you, and you watch him leave. \"What's wrong with me? Sure I want to beat him into a pulp, but I was <i>staring</i>. Great. Thats the last thing I need\" you think, looking around to see if anyone wanting to confront you, but nobody is giving you a second glance.<br>\r\n<br>\r\n\"Better get to class. Wonder if Rache is there\" you think, not noticing that your hair has begin to split and that two green ribbons are working their way through your hair to tie them into long pigtails...</span></div></div>",
            "created":1293598800,
            "id":1025126,
            "title":"A slow change is coming"
        },
        "1131222121":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Your voice changes",
                "Your face changes"
            ],
            "content":"<div class=\"\"><div> <span>Your nervousness over your hair causes you to start giggling. The harder you try to make yourself stop, the longer you end up giggling. \"Crap,\" you think, \"they're going to notice me for sure.\"<br>\r\n<br>\r\nYou try to muffle the giggles with your hand, and that's when you notice another change has taken place. Looking at your hand, you see that your fingernails are 1/4 of an inch past your fingertips. They are well-manicured, and covered with clear nail polish. \"Oh my God,\" you think, \"what's happening to me?\" You hurry to class, hoping nobody sees your hair or your nails.<br>\r\n<br>\r\nAs you scan the guys, seeing if anyone notices what's happened to you, you find your mind wandering down a path both familiar and strange. \"Too nerdy,\" you think about one boy. \"Needs to lose a few pounds,\" is your assessment of another. \"He's got a big nose,\" you think of a third boy. \"I wonder if it's true what they say...?\"<br>\r\n<br>\r\nAll of a sudden, you realize what you're thinking. \"I'm thinking about guys, the same way I was thinking about girls just this morning! What's going on?\"<br>\r\n<br>\r\nYou start getting more nervous, bringing on another giggle fit...</span></div></div>",
            "created":1293771600,
            "id":1026148,
            "title":"The trouble with giggle fits"
        },
        "11312221212":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "your clothes begin to change",
                "one of your girlfrinds, Rachel finds you"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm a guy! Act like one, Luke\" you think furiously, barely containing hte urge to giggle more. carefully, you check the changes to you. \"great. I've got pigtails\" you mutter, unaware that giggling doesn't cause the changes, it only a by-product of it, and helps re-enforce any changes. You're unaware that your face has changed as well; your cheeks are higher, lips fuller, nose more button like, and all the excess hair has retreated into your skin. You've got the face of a cute girl.<br>\r\n<br>\r\n\"I a guy. Beat this thing\" you continueously think, as you step into another hallway, where the people in it don't notice anything odd about you. You look to se if anyone can help you, but your eyes lock onto the school football captain, Steve. The thoughts return.<br>\r\n<br>\r\n\"no. I like girl, girl, girls, gi.. guys\" you thin in horror. Quickly you more into the shadows, when the urge to giggle returns too. \"Only girs giggle\" you remind yourself, only for you to start giggling.</span></div></div>",
            "created":1293771600,
            "id":1026410,
            "title":"Your face changes"
        },
        "113122212121":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "some girls grab you and lead you somewhere",
                "You reach Bella, only to find your clothes have changed even more"
            ],
            "content":"<div class=\"\"><div> <span>After a few seconds, you pull yourself together. \"Stop it Luke. You're in trouble, and you're standing around giggling like some stupid schoolgirl! You're <i>be</i> one if you don't get help now!\"<br>\r\n<br>\r\n\"Who can help me though? Got up to someone and say 'Something turning me into a chick and everyone thinks things are normal'\" you think, as you look at yourself. Apart for your hair which has adjusted to pigtails and a parted fringe, and your face (still undetected), you see that the rest of you is still okay. Going near guys is out of the question; especially since this girly mind wants to stare at them. That leaves various girls, and the one that is mostly likely to help is your sister Bella. While neither she or you like each other all that much, you find she can be persauded to do things for you. You look at your watch, knowing you've got 10 minutes to find her. As you move out of the corner you discover that while you're relatively unchanged, you're clothes are slightly different. You're shirt is longer, and that creeps you out since longer shirt means its turning into a dress of something like that. Plus your pants are less defined, like it they're fading into nothing, or worse, pantyhose. The other change is like if something is growing over the top part of your shirt, almost like a jacket is forming, though from the cut, you know its a <i>girls{/i } jacket.<br>\r\n<br>\r\n\"I've got to get help fast\" you think</i></span></div></div>",
            "created":1294117200,
            "id":1028696,
            "title":"your clothes begin to change"
        },
        "1131222121212":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Put it on (the change completes)",
                "Resist the urge"
            ],
            "content":"<div class=\"\"><div> <span>You frantically search the hall, finally finding Bella chatting with her friends. \"What luck,\" you think, \"she's in front of the girls' room.\" Without a moment's hesitation, you grab her and pull her into the bathroom.<br>\r\n<br>\r\n\"What the - what are you doing? Who are you, and who do you think you are?\"<br>\r\n<br>\r\n\"Bella,\" you say, \"it's me, Luke! Something weird is happening to me!\"<br>\r\n<br>\r\n\"So, why are you wearing a wig and makeup, and a girl's uniform?\"<br>\r\n<br>\r\n\"Huh?\" You look into a mirror for the first time since the changes began, and see what's happened to you. \"Holy crap! I didn't think it was even this bad!\"<br>\r\n<br>\r\n\"What are you talking about?\"<br>\r\n<br>\r\n\"Something's turning me into a girl! I'm not wearing a wig, this is my real hair! The uniform was just starting a few seconds ago, and now I'm in a freaking skirt, and I think I feel a bra on underneath my blouse!\"<br>\r\n<br>\r\n\"Let me see.\" She unbuttons your blouse. \"Yep, that's a bra. I don't know how else to break this to you, but you've got a pretty big cup size.\"<br>\r\n<br>\r\n\"Oh, man,\" you say. \"I always wanted to get into the panties of a hot girl, but I didn't want it like this! What can I do?\"<br>\r\n<br>\r\n\"Well, when did this start?\"<br>\r\n<br>\r\n\"It started with this necklace I got at a garage sale.\" You reach for it. \"Damn, these skirts don't have pockets! Where'd it go?\"<br>\r\n<br>\r\n\"Check your purse.\"<br>\r\n<br>\r\n\"Huh?\" You look to your right side, and are surprised to see a purse over your shoulder. \"Where'd this come from?\"<br>\r\n<br>\r\n\"If you put that thing in your pocket,\" Bella says, \"it's probably found its way into there.\"<br>\r\n<br>\r\nYou open the purse, and see the necklace, now glowing.<br>\r\n<br>\r\n\"Why's it glowing like that?\" Bella asks.<br>\r\n<br>\r\n\"I don't know,\" you answer. \"Maybe it's connected to the change. Bella... Bella, I don't know why, but I feel like I want to wear it.\"</span></div></div>",
            "created":1294117200,
            "id":1028932,
            "title":"The change continues..."
        },
        "11312221212122":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Luke is such a boys name....",
                "you go to your car, but find its different"
            ],
            "content":"<div class=\"\"><div> <span>\"Don't. Its probably changing you. I can't believe it Luke, but jewellery doesn't glow like that. If it did, every girl in this school would want some\" Bella says. A part of her wants to run as far away as she can, another part wants to abandon you to your girlish fate as payback for all the women you've mistreated, but the strongest part wants to help. \"So you got this at a garage sale. Who from, and who did you intend to buy it for?\"<br>\r\n<br>\r\n\"I got it from some house near where Britney lives. She wanted a present, but I felt too tired and went home\" you say. Bella remains quiet, but you can tell she disproves. \"you can yell at me all you want. Help me sis. My hair is in pigtails, I'm wearing girls clothes, I've got a purse over my shoulder,  my face is getting cute, and I'm starting to notice <i>guys</i>\" you say desparately. \"Look, I'm even wearing a girls jacket\" you say, seeing that the jacket has fully formed over your now girls' uniform. Bella gasps. All remaining doubts are gone.<br>\r\n<br>\r\n\"Until five minutes ago, I didn't think this was possible....\" Bella says. Without noticing, you brush the hair away from your face, and notice you're now wearing earings.<br>\r\n<br>\r\n\"My god. Bella. I'm waering earings. I have to do something\" you say. Bella sighs as a bracelet forms where your watch was. She looks at the necklace which is still glowing. \"We're going back to where you found this\"<br>\r\n<br>\r\nYou nod, as you exit the bathroom. </span></div></div>",
            "created":1294203600,
            "id":1029359,
            "title":"..but you find yourself wearing jewellery anyway"
        },
        "113122212121221":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Nobody is home",
                "Someone is home"
            ],
            "content":"<div class=\"\"><div> <span>The two of you head for your car. \"Keep it together, Luke,\" Bella says. \"We'll get to the bottom of this.\"<br>\r\n<br>\r\nYou roll your eyes. \"Ugh.\"<br>\r\n<br>\r\n\"What?\"<br>\r\n<br>\r\n\"Luke. Why do I have to be called Luke? It's such a boy's name.\"<br>\r\n<br>\r\nBella stops. \"Do you realize what you just said?\"<br>\r\n<br>\r\nYou stop. \"Holy crap. It's still getting worse.\"<br>\r\n<br>\r\nYou both get into the car, and fasten your seatbelts.<br>\r\n<br>\r\nAs you speed toward the house where you bought the necklace, you watch your hands become smaller, more slender. \"Please,\" you think, \"let me be at least partly boy before we finish this.\"<br>\r\n<br>\r\nWhen you finally get there, you click off your seatbelt and head for the front door, as quickly as your girl's shoes will let you move.</span></div></div>",
            "created":1294203600,
            "id":1029578,
            "title":"Luke is such a boys name...."
        },
        "1131222121212211":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "That bra you're wearing is filled....",
                "you break a window"
            ],
            "content":"<div class=\"\"><div> <span>You knock on the door, hoping that someone is inside, but the house seems to be empty. Dejected, you head back to Bella, who is staring at you even more wide eyed; not a good sign. <br>\r\n<br>\r\n\"Bella, just tell me\" you sigh, glad your voice is the same. You look at you hands, seeing that they're now danty with long pink fingernails. Your shoulders have slimmed down to more a girlish size. you're glad that you chest is still flat, but a part of you wishes that you wasn't, which distrubs you immensely. \"Bella, tell me. I'm starting to wish that I have breasts. I don't want breasts, sis.\"<br>\r\n<br>\r\nBella sighs and points up that your hips are wider, and rear more perky like a girls. You have a sudden fear, and feel for your manhood. You're relieved to feel it still, but you know it won't be for long it your don't find a cure for this 'Curse?', you're not exactly sure what is changing you into a hot chick.<br>\r\n<br>\r\n\"I have to break in\" you say quickly.<br>\r\n<br>\r\n\"No Don't do that. If something from that woman is turning you into a chick, what do you think will happen to you if you break into her house. Don't even think about it Luke\"<br>\r\n<br>\r\n\"I told you, don't call me Luke. I really need a better name. Something like...\" you begin to say, before coming to your senses. \"See, I'm changing, Bel. I have to\" you say</span></div></div>",
            "created":1294290000,
            "id":1030011,
            "title":"Nobody is home"
        },
        "11312221212122111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "There is a spell guarding the house",
                "No spell, but changes continue"
            ],
            "content":"<div class=\"\"><div> <span>As you lean against the glass, you feel a strange pressure against your chest. Looking down, you see that your breasts have begun to fill your bra. Bella was right: your breasts are quite large.<br>\r\n<br>\r\nShock and delight war within you. \"Bella, I've got boobs!\"<br>\r\n<br>\r\n\"I still say we should leave,\" she says, \"and come back later. If somebody at this house is causing you to change, they probably won't like it if you break into their home.\"<br>\r\n<br>\r\n\"Bella, haven't you figured it out yet? The change is only going to get worse! If I don't find a way out of this - soon - I might be your big sister for life!\"<br>\r\n<br>\r\nYou search the porch, and find a potted plant. As you pick it up, you are surprised at how heavy it is, before you remember that your arms are no longer a boy's. With great effort, you manage to throw the plant through the window.<br>\r\n<br>\r\nOnce you knock glass shards out of the windowframe, you say, \"Here goes nothing,\" and crawl through the window.</span></div></div>",
            "created":1294290000,
            "id":1030179,
            "title":"That bra you're wearing is filled...."
        },
        "113122212121221111":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Bella's twin sister!",
                "A young female version of yourself."
            ],
            "content":"<div class=\"\"><div> <span>Upon crawling into the house, you found that it was like any other home that belonged to a woman living alone. Everything in sight was spotless and highly organized. Only you got an uneasy feeling the second you placed both feet onto the hardwood floor. Unknown to you, once a non witch girl boy gets a taste of magic, they gain an ability to sense it but you do not believe in magic and you are left feeling increasingly uneasy.<br>\r\n<br>\r\n\"Maybe this wasn't such a good idea after all.\" you whispered.<br>\r\n<br>\r\nThen, you felt a powerful rush as the front door opened behind you. An invisible force threw you off your feet and out the door as you felt your body changing again. You hit the ground, letting out a high pitched scream, the landing hurt more than you thought it would and you felt the urge to wail in tears. You looked up, fighting your emotions, and saw the door close on its own before the broken window repaired itself and the potted plant returned to where you had taken it.<br>\r\n<br>\r\n\"No way!\" you said, not believing what you saw. then you paused, surprised by your new, tiny voice as Bella gasped.<br>\r\n<br>\r\n\"Luke, you... you're younger!\"<br>\r\n<br>\r\n\"What!?\" you asked, startled.<br>\r\n<br>\r\nYou looked at yourself and found that you were now Bella's age, judging by your new size, wearing a pink frilly dress, white stockings, a bracelet, earrings, and... a distinct scent of perfume. You quickly got up and looked at yourself in the rear view mirror of your car and screamed. You were...<br>\r\n</span></div></div>",
            "created":1294290000,
            "id":1030215,
            "title":"Things get worse..."
        },
        "1131222121212211112":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "you turn and see your car is gone",
                "you shrink. No school for you"
            ],
            "content":"<div class=\"\"><div> <span>You look at yourself, noticing that physically you're no different to what you was, except that you're about 3 years younger, making you the older sibling, just. \"This can't be happening\" you freak. Being the older sister is bad, but being a girl entering her teens, thats worse.  You shift uncomfortably, even though your hips and breasts are smaller than they was a minute ago. You're more concerned about your manhood, a part of you wanting it to remain, but a growing part wanting it gone. You look under your dress and see that you're still a guy, much to your conflicted relief. \"I don't want... I want to be a girl\" you say softly, before you realize what you said. \"I've got to get out of this house\" you panic, not caring what happens if you can only escape this cursed house. Your fear gives you strength and you smash the window again.<br>\r\n<br>\r\n\"This place creeps me out\" Bella says, looking at you. \"Luke, we have to come back\" you nod, since you want to get away from this place, no matter what. You're too frightened to care that your sister called you that name again. You need something more pretty, more you, like... Bella snaps your thoughts.<br>\r\n<br>\r\n\"Any idea why you're in that dress\" Bella asks. \"Its still a schoolday. Lets get out of here before we're missed\"<br>\r\n</span></div></div>",
            "created":1294290000,
            "id":1030608,
            "title":"A young female version of yourself."
        },
        "11312221212122111122":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "The change is permanent",
                "You can change back - but it won't be easy"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, your head seems to spin, and everything loses focus.<br>\r\n<br>\r\nWhen you can see again, you are surprised to see Bella is now much taller than you are. \"Wha-what happened?\" you ask, shocked by your new voice.<br>\r\n<br>\r\n\"You've gotten even younger,\" Bella says. \"You're too young for anything but day care, now.\" She picks you up \"I told you we should've just left this place alone.\"<br>\r\n<br>\r\n\"He doesn't listen much, does he?\"<br>\r\n<br>\r\nBella turns at the sound of the voice, and you see the woman who sold you the necklace.<br>\r\n<br>\r\n\"You should have waited,\" she says. \"I had just stepped out for a bit of shopping.\" She unlocks the front door, then bids Bella and you enter.<br>\r\n<br>\r\nBella swallows. \"C-can you h-help us? M-my brother started changing into a girl, and n-now - \"<br>\r\n<br>\r\nShe puts up her hand. \"Being a toddler is what she got for breaking into my house. Just set her down.\"<br>\r\n<br>\r\nBella puts you on the floor. From this angle, the woman seems to loom impossibly large. \"Hewp me,\" you beg.<br>\r\n<br>\r\nThe woman touches your nose, and the world loses focus again. When your vision clears, you are once again 16 years old, but still a girl. A quick check confirms that, during your time as a baby, you became fully female.<br>\r\n<br>\r\n\"Please help me,\" you say again. \"I'm sorry I broke into your house - I'll pay for the damages, I swear - but I don't know how I feel from one moment to the next, anymore. W-will I ever be the person I'm supposed to be?\"</span></div></div>",
            "created":1294462800,
            "id":1031492,
            "title":"you shrink. No school for you"
        },
        "113122212121221111221":{
            "author_id":"lunatic",
            "author_name":"kerney",
            "choices":[
                "We accept.",
                "We're sorry, but no."
            ],
            "content":"<div class=\"\"><div> <span>\"Person your supposed to be?\" she says with just bit of contempt in her voice. \"Are supposed to be someone with two girlfriends? Or someone who breaks into house. Laura, is that who your supposed to be?\"<br>\r\n<br>\r\nWhen she says Laura, something klicks in your head. You were Luke, now your name is Laura. You see Bella shake her head also.<br>\r\n<br>\r\n\"I'---uhhhh, it wasn't like I was hurting anything.\"<br>\r\n<br>\r\n\"Not physically.\" She eyes your sister, \"Bella, were you proud of Luke?\" <br>\r\n<br>\r\nShe pauses reluctantly. \"Not particularly.\" Her tone is flat.<br>\r\n<br>\r\n\"Is that not harm?\"<br>\r\n<br>\r\nYou nod. You can see Bella and the witch looking at you.<br>\r\n<br>\r\n\"But you did ask for help,\" the witch says, almost reluctantly. \"Where going to have some coffee,\" daring you and your sister to disagree, gesturing for you and your sister to sit down. \"And we're going to discuss both your situations.\"<br>\r\n<br>\r\nYou gulp but you and Bella sit at her table. She comes back with a fresh cream, sugar in a bowl, and a thermos used to keep coffee warm, and three warn, mismatched cups. She pours for you and Bella, leaving room for cream and sugar, then pours for herself, adds some cream and a teaspoon of sugar.<br>\r\n<br>\r\nYou and your sister pause, wondering.<br>\r\n<br>\r\n\"Don't worry, nothing's enchanted.\"<br>\r\n<br>\r\nYou both add cream and sugar to the coffee. As you're about to take a sip, she gestures for you both to stop.<br>\r\n<br>\r\n\"Bella dear, can you take the cream and sugar from your coffee?\"<br>\r\n<br>\r\n\"No,\" she eyes the witch questioningly, \"can you?\"<br>\r\n<br>\r\n\"No, I can't. Just like I can't take the magic out of Laura that's made her a girl. He put it in, and the magic just disolved and merged, like cream and sugar in coffee. It's part of you now, dear,\" She says meaningfully, and for the first time, not unsympathetically. \"But that doesn't mean I can't help you.\"<br>\r\n<br>\r\n\"With bras and panties and makeup and stuff?\" you ask. Strangely, whatever you did to yourself seems to have given you basic knowledge of those things. You also finally admit to yourself you're attracted to guys, and knowing that you're stuck, it's oddly liberating.<br>\r\n<br>\r\n\"No, with the lack of ethics that got you transformed in the first place.\" <br>\r\n<br>\r\n\"Oh.\"<br>\r\n<br>\r\n\"Your situation makes you ideal as my personal assistant. I mean, you're probably going to be reluctant to mess with anything you shouldn't and you'll do what I ask because I'm offering to teach you how to be the best possible version of yourself.\"<br>\r\n<br>\r\nYou swallow, your not even sure what that means.<br>\r\n<br>\r\n\"Bella, you have shown character, selflessness, and maturity. I would like to offer you a place as my apprentice.\" <br>\r\n<br>\r\nBella swallows. The room is very quiet.<br>\r\n<br>\r\n\"One last thing. Your fates are intertwined. You either both must accept or both reject my offer.\"<br>\r\n<br>\r\nYou can hear your heart beating.<br>\r\n<br>\r\n\"Can we talk about it for a moment?\"<br>\r\n<br>\r\n\"Of course.\" The witch stands up and with a ruffle of her skirt she exits the room.<br>\r\n<br>\r\nYou and Bella debate back and forth, arguing and talking and whispering. You don't know how much time passes. You call the Witch back into the room.<br>\r\n<br>\r\nThe witch sits down expectantly.<br>\r\n<br>\r\n\"What does the best possible version of Laura mean exactly,\" Bella asks, while you stay silent.<br>\r\n<br>\r\n\"For each person, it's different, so I can't tell you exactly.\" She eyes you meaningfully. But some people who have been the best versions of themselves include Einestien, Mozart, Lincoln, Joan of Arc, King Arthur---\"<br>\r\n<br>\r\n\"Didn't they burn Joan at the stake?\" Bella asks. You only kinda know who Joan is. Bella was always a better student.<br>\r\n<br>\r\n\"Yes, but she still changed the world.\"<br>\r\n<br>\r\nYou take a deep breath. Bella looks at you while you consider.  Finally you nod ever so slightly to your sister. <br>\r\n<br>\r\nShe back mouths \"you're sure.\" You nod.</span></div></div>",
            "created":1568487900,
            "id":2718176,
            "title":"The change is permanent"
        },
        "113122212121221111222":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Back to school",
                "Home"
            ],
            "content":"<div class=\"\"><div> <span>\"The person you're supposed to be,\" the woman says. \"That's an appropriate way to put it, Luke. Or should it be Laura, now?\"<br>\r\n<br>\r\nThe shock at hearing her call you by name collides with your mixed feelings about her giving you a girl's name. \"How... how did you know?\"<br>\r\n<br>\r\n\"I've heard quite a few things about you,\" she says, \"none of them good. Unlike most, I have the ability to do something about it. I, as you may have gathered, am a witch.\"<br>\r\n<br>\r\nBella asks, \"C-can he be Luke again, ma'am?\"<br>\r\n<br>\r\n\"There is one way to reverse the enchantment,\" the woman answers. To you, she says, \"You must find three women - just so we're clear, I mean three natural females who have experienced menses - whom you have wronged. If these three will sincerely forgive you, you will be a boy again.\"<br>\r\n<br>\r\n\"Really?\"<br>\r\n<br>\r\nShe nods. \"However, there is something of a time limit. If you become pregnant before you are forgiven, you will be bound in this body. You will grow into womanhood, then grow old, and eventually die, with Luke Adams nothing but a memory.\"<br>\r\n<br>\r\n\"What if I had an abortion?\"<br>\r\n<br>\r\n\"That would be your decision,\" she says, \"but you would make it as a girl. It is conception that would seal you, not childbirth.\"<br>\r\n<br>\r\nYou swallow. \"C-can you help me?\"<br>\r\n<br>\r\n\"I can help you in one way.\" Looking you in the eyes, she says, \"I forgive you for breaking into my home. There. Now, you must find only two more.\"<br>\r\n<br>\r\n\"Thank you,\" you and Bella say together, before leaving the woman's home, to go...</span></div></div>",
            "created":1294462800,
            "id":1031497,
            "title":"You can change back - but it won't be easy"
        },
        "1131222121212211112222":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "A girls room ",
                "your room is still a guy's"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I better go home\" you say to Bella. \"I don't think I can go to school like this\"<br>\r\n<br>\r\n\"You're right, Luke...\"<br>\r\n<br>\r\n\"Call me Laura. It just feels... better, somehow. Plus it suits me more\" you say.<br>\r\n<br>\r\n\"You're not feeling girly again?\" Bella asks worried.<br>\r\n<br>\r\n\"I'm feeling weird. I know I was a guy, and that I want to be a guy again, but an equal part of me likes being a girl and having girl feelings. While I was chaning I went from noticing girls, to noticing guys, plus a few other things. I want to test myself since I don't have memories of actual girl stuff. It like my mind's been scrambled. Plus school is expecting Luke Adams, not Laura Adams\" you sigh.<br>\r\n<br>\r\nBella nods. \"L Laura, I was the only one that noticed you changing. Maybe everyone is expecting Laura\" she offers. You remain silent, knowing that you'll find out when you check your bedroom and photos. You quickly get out of the car and into the house. As expected mom isn't home. You run upstairs, and open your door.<br>\r\n<br>\r\n</span></div></div>",
            "created":1294635600,
            "id":1032572,
            "title":"Home"
        },
        "11312221212122111122221":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "you're wronged me several times. I forgive you",
                "Let me teach you to be a girl so you fit in, and we will search for the two"
            ],
            "content":"<div class=\"\"><div> <span>You stare at the pink room in front of you. \"Laura, are you okay?\" Bella asks. You let her see for herself. You step in and move towards the vanity, while Bella sits on your pink bed. Least one good thing is you can take these pigtails out. You undo the ties holding your hair in place, and let it loose. You're slightly disturbed to see that there are more ties, indicating 'Laura' has this hairstyle often.<br>\r\n<br>\r\n\"Laura, you okay? You're spacing out again\" Bella asks.<br>\r\n<br>\r\n\"I'm just thinking about everything. Its like it Laura has always been here. You reach for a book, stunned to see its a diary. Flicking it open, you read a few lines, and stagger back.<br>\r\n<br>\r\n\"Laura, talk to me\" Bella says, but you sob. <br>\r\n<br>\r\n\"Its like I don't exist. I know normally we can't stand talking to each other, but in this reality, we're close. All the girls I like, they're my friends now. Do you know what this means? How can I change back if they don't even remember the old me? I'm stuck as this girl for the rest of my life!\" you say, sobbing even more.<br>\r\n<br>\r\n\"Snap out of this, sis\" Bella says, hitting you. \"That woman wouldn't have said you can change back if it is impossible for you to do so.\"<br>\r\n<br>\r\n\"Maybe\" you sob. Bella smiles. \"Look, sis...\"</span></div></div>",
            "created":1294635600,
            "id":1032574,
            "title":"A girls room "
        },
        "113122212121221111222211":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "You find someone to apologize to",
                "Laura is just too darned well-behaved"
            ],
            "content":"<div class=\"\"><div> <span>\"... I forgive you.\"<br>\r\n<br>\r\nYou look up. \"What?\"<br>\r\n<br>\r\n\"You've hurt me several times over the years, but I forgive you.\"<br>\r\n<br>\r\n\"Thanks, Bella,\" you say, \"but the lady said I had to be forgiven by girls who've had periods.\"<br>\r\n<br>\r\nShe smiled. \"Remember when Mom gave me some stuff from the drugstore, just a couple days ago? What did you think that was for?\"<br>\r\n<br>\r\nYour eyes light up, and you hug Bella. \"Congratulations, sis.\"<br>\r\n<br>\r\n\"Thanks, Laura. See? Now you've just got to find one more girl. That can't be too hard, can it?\"<br>\r\n<br>\r\n\"But where would I look?\"<br>\r\n<br>\r\n\"Try your diary. It'd have all your innermost thoughts. Besides, it would also tell you about your cycle. You'll need that, so you can avoid getting pregnant.\"<br>\r\n<br>\r\n\"Good point, Bella. I wouldn't want to screw up and get pregnant accidentally.\"<br>\r\n<br>\r\nAs you pick up the diary and start reading, you think, \"Even if I'm starting to like being Laura.\"</span></div></div>",
            "created":1294722000,
            "id":1033445,
            "title":"you're wronged me several times. I forgive you"
        },
        "1131222121212211112222112":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Go ahead. Its not like its about me anyway",
                "Sorry, but it is my diary"
            ],
            "content":"<div class=\"\"><div> <span>As pick up the diary, you think \"No, I want to be me again. Why would I want to learn about my cycle anyway? Its not like I'm going to have sex\", though a part of you is curious, and that the idea of boys is making you tingle slightly. Shaking your head, you begin to read. Quickly you see that its no good. Unlike you, the real you, Laura is too well behaved. She is a good student without being a nerd, outstanding athelete, well respected amongst everyone. She is practically wanted by every boy at school, but to your surprise, no boyfriend, though its clear from the diary she wants one. You groan, since this is the ideal chick.<br>\r\n<br>\r\n\"Why me? Why me!\" you say in frustration. Bella says, giving you a slight hug. \"Don't worry, Laura. I doubted it would have been quick. That woman <i>did </i>say it would not be easy. Let me help you. Mind if I borrow this?\" she asks, holding the diary</span></div></div>",
            "created":1294808400,
            "id":1033968,
            "title":"Laura is just too darned well-behaved"
        },
        "113122212121221112":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "bedroom",
                "stay on the ground floor"
            ],
            "content":"<div class=\"\"><div> <span>As you land on the other side, you walk over to a mirror to see what happened to you. As expected, your head, arms and legs are completely that of a girl, you're got breasts in the large c or smaller d cup range, your ass is getting bigger. The only thing that seeems to be unaffected yet is that your manhood is fully intact, those it looks stupid in your panties. You look at it in disgust, before you're horrified by those thoughts. You have to find a cure from this witch, fast. \"Bella, I'm in. If I'm not back in ten minutes, call me\" you say, annoyed that your cell in your purse is now hot pink.<br>\r\n<br>\r\nAs you walk, you notice that you're swaying your hips just like another girl, which causes you to freak. The only thing thats freaking you more is the dull pain in your gut. Whether its due to nerves, or that your growing female reproducive organs, you're not sure, and you don't want to find out. \"Okay, Luke. Arrgg I hate that name. I wish it was more pretty\" you say, before shaking your head.  \"Where should I search first?\"</span></div></div>",
            "created":1294290000,
            "id":1030635,
            "title":"No spell, but changes continue"
        },
        "1131222121212211122":{
            "author_id":"anonymous51",
            "author_name":"Anonymous51",
            "choices":[
                "You Hear What Sounds Like Chanting Coming From the Basement Door",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>For a moment, you think about checking the woman's bedroom, but then you decide to check down here first, so you stay on the ground level.  As you move further into the house ...</span></div></span></div>",
            "created":1401253200,
            "id":1803821,
            "title":"Stay on the Ground Floor"
        },
        "11312222":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Fat chick",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>If not, hot, what?</span></div></span></div>",
            "created":1292994000,
            "id":1020427,
            "title":"other"
        },
        "113122221":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You rapidiy change into a plump girl",
                "you start gaining weight (and Maddie lose it) every time you taunt"
            ],
            "content":"<div class=\"\"><div> <span>You look in the mirror, revolted by your previous encounter with Maddie Vale, one of the few girls you don't want to date. Maddie is a 16 year old girl in your class, but she is plump. Not exactly huge, or grossly overweight, but it doesn't stop you from exagerating her 170lb weight, or putting her down. Miles away, Samantha grins, knowing the pendant in your pocket is glowing. \"Okay, you jackass. Lets see you be the 'fat' chick as you call it\"</span></div></div>",
            "created":1308200400,
            "id":1127228,
            "title":"Not the fat chick, except in your eyes"
        },
        "113122222":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Nerdy",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You not fat or hot, you're becoming </span></div></span></div>",
            "created":1292994000,
            "id":1020431,
            "title":"other"
        },
        "1131222221":{
            "author_id":"mrwhite.13",
            "author_name":"mrwhite.13",
            "choices":[
                "continue this ",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Your change begins in the bathroom, your height is now 5'8\", your legs are longer, slim and toned, your feet are shrinking to a women's size 8, you can see and feel your muscles and skin change, the later smoother, your body is now slim and toned, lifting up your shirt you see a toned 6-pack abs, as well as small b-cup breasts. More changes occur as your hair is now jet black growing to you slim toned shoulders, your face has changed to a vision of beauty with grey eyes. Your getting turned on as you feel your once proud cock hard, but now retreating inward after your testicals have become overies, swallowed cock is now changed to female plumbing. Your clothes are changing to match your new body, long skirt, g-string panties, Mary Janes black, an black bra, and long sleeve shirt, on your wrist is a g-shock watch. Your brain is now gaining knowledge of who you are now, Demi Michelle Allen, the school nerd and star swimmer (sprinter) on the school team, smartest in the school and will be a marine biologist, you have a new life to live, and can't be bothered with high school life, you have a gf and helping your mother out, she's an oceanographer.</span></div></div>",
            "created":1390798800,
            "id":1733888,
            "title":"Nerdy"
        },
        "11312222211":{
            "author_id":"mrwhite.13",
            "author_name":"mrwhite.13",
            "choices":[
                "continue this",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your done changing, and pick up your new purse and fake glasses for your cover, afternoon practice after school, and studying as well as prep for diving trip this weekend</span></div></span></div>",
            "created":1390798800,
            "id":1733893,
            "title":"continue this "
        },
        "113122222111":{
            "author_id":"mrwhite.13",
            "author_name":"mrwhite.13",
            "choices":[
                "the rest of day, then hooking up",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>You open your purse and look in your black wallet finding your new drivers license, social second card and other things your school id card has grade 12 on it, you 2 years ahead, now realizing your now a social outcast and like this, your brain works better, your happy this way you think, looking down you find your large black backpack and put your small purse in it, and seeing your books now your small purse in it. On your way out, coach Scottie sees you and says hello with a sexual tone, she's young hot and ripped, you like her and have been with her, on the low key, she's the head swim coach, teaches a.p. English, and maybe hooking up later after practice, \"yes, tonight\" you smile back.  </span></div></div>",
            "created":1391058000,
            "id":1735388,
            "title":"continue this"
        },
        "1131222221112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "a girl you like",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>But then you remember what has happened, how can this be, that you suddenly change into Demi Michelle Allen?<br>\r\nYou stand there motionless in the school hall, all alone and by yourself:<br>\r\n\"What the fuck is going on?\" you say, more annoyed to realize that things like this aren’t possible. The fact that you got hair down to your shoulders annoys you more than anything, and you look at your reflection, which is in some of the glasses here: You are, wondering what to do about your hair.<br>\r\nBut the hair is the least of your worries, as you suddenly feel your chest and how heavy this is now!<br>\r\n\"No. I can't be running around as into a chick\" you moan, disturbed that you say it in a girls' voice.<br>\r\n<br>\r\n'Think, Luke. What should I do\" you think, knowing that no one would believe your story. <br>\r\nYou imagine the conversation at lunch. \"Hey, heard about the crazy chick Demi Michelle Allen? She thinks something has changed her into a girl...\"<br>\r\n<br>\r\nYou realize you're in a really bad situation. Not only you've turned into a girl, you've become a nerd, an outcast…<br>\r\nThinking about the encounter with the coach one minute earlier, you suddenly feel nervous, not helped by the empty feeling you have between your legs. The last thing you want is to live someone else’s life!<br>\r\n<br>\r\nQuickly you look around, and see that the place is still deserted. You are not feeling well and decided to o dash to the girls' bathroom. While you always wondered what it would be like, be invisible, and allowed (while you're a cheat, you're not a pervert, and you want to be invited in) to be there, you never wanted it to be like this. You open the door, and see that someone is inside<br>\r\n</span></div></div>",
            "created":1423630800,
            "id":1931677,
            "title":"something else"
        },
        "11312222211121":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "do it",
                "hesitate"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my god. What happened if she will realize that I am Luke?” you think to yourself, but first you are hidden inside a stall and second how could she guess that this girl you appear on the outside, Demi, has been her cheating ex-boyfriend a couple of moments before…<br>\r\nSo you think you should play the role of the girl you have turned into…<br>\r\n</span></div></div>",
            "created":1423630800,
            "id":1931678,
            "title":"a girl you like"
        },
        "1131222222":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "A seven year old girl.",
                "Something worse."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Unknown to you, your own fears and desires are deciding your transformation, you become...<br>\r\n</span></div></span></div>",
            "created":1292994000,
            "id":1020442,
            "title":"other"
        },
        "11312222221":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Two girl haters, Karl and Greg.",
                "John Harrison and Harry Rich."
            ],
            "content":"<div class=\"\"><div> <span>As you finished doing your business and washed your hands, you felt a dull pain everywhere inside of you, growing stronger by the second. You collapsed to the floor and moaned miserably as your insides felt like they were being run through a blender. You felt your skin moving against your clothing, unaware that you were quickly shrinking. A pain in your stomach, followed by a dull pain in your groin added to your suffering.<br>\r\n<br>\r\n\"What's... happening... to ... me!?\" you whimpered, between waves of pain.<br>\r\n<br>\r\nThe pain increased and you closed your eyes, trying to ride out whatever it was, and felt your hair fall over your eyes as you also felt your clothing shifting somehow. Suddenly, you felt a draft against your legs and opened your eyes to find that you were now wearing a girl's school uniform! A whispered scream echoed from your throat as you found that you had somehow shrunk to the size of a child!<br>\r\n<br>\r\n\"No way! No way!\" you repeated, your voice rising in pitch, but still hushed. \"This is not happening!\"<br>\r\n<br>\r\nThe pain then vanished and you were, once again, able to move. Shaken from the experience, you slowly got up and looked into the mirror. What you saw, left you feeling numb, not knowing how to react. Staring back at you was a very cute little girl in the school uniform with a stunned look on her face. You were so shocked by what had happened that you did not notice that the medallion was in the pocket of your new skirt and that two boys had just walked into the boys bathroom with you.<br>\r\n<br>\r\n\"What are you doing in here?\" asked an irritated voice. \"This is the boys' bathroom.\"<br>\r\n<br>\r\nRealizing what you now looked like and where you were, you slowly turned to find...<br>\r\n</span></div></div>",
            "created":1293166800,
            "id":1021899,
            "title":"A seven year old girl."
        },
        "113122222211":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "John Harrison.",
                "Your sister, Bella (student police)"
            ],
            "content":"<div class=\"\"><div> <span>Seeing the two known girl haters, you swallowed hard, knowing that your new size was no match for them and began to back towards the exit. \"I... I just walked into the wrong room.\" you said, still freaked by your transformation. \"S... Sorry.\"<br>\r\n<br>\r\nKarl shook his head as Greg blocked your path. \"You're not sorry, princess.\" he said with an evil smile. \"But you will be.\" he turned to his friend. \"Grab her!\"<br>\r\n<br>\r\nGreg took you by both wrists, causing you to struggle immediately as Karl dropped a book bag he was carrying and pulled out a large roll of duct tape and a small rolled up pair of socks.. Seeing him quickly approach you with them, you opened your mouth to scream but Karl shoved the socks in and had the tape over your mouth before you could make the sound, silencing you. \"Shut up, girl!\" he hissed. \"You trespassed onto our turf and now you are going to pay for it!\"<br>\r\n<br>\r\nYou struggled more wildly but Greg proved to strong as Karl then taped your ankles together before lifting your skirt and taping it up, completely revealing your pink butterfly panties. You screamed against the gag, blushing brightly, but no sounds came out as Karl then ripped your uniform shirt, revealing a pink training bra. By this time, you were crying as you were feeling the true cruelty of the two boys you had earlier laughed at.<br>\r\n<br>\r\n\"Hurry up, man!\" barked Greg. \"Someone is bound to come in here soon!\"<br>\r\n<br>\r\n\"All we have left is to tape her wrists.\" said Karl, calmly. \"Then we'll leave her in a stall for someone to find.\"<br>\r\n<br>\r\nKarl did quick work of taping your wrists together, leaving you helpless, before they dragged you, vainly struggling into one of the stalls. Greg forced you to sit onto one of the toilets before telling Karl to leave.<br>\r\n<br>\r\n\"What are you going to do?\" asked Karl.<br>\r\n<br>\r\nGreg smiled. \"I have to pee.\"<br>\r\n<br>\r\nYou screamed at that, though your gag did not allow any sound to escape. Then, the two boys ran upon hearing a familiar voice yell, \"What are you two doing to her!?\"<br>\r\n<br>\r\nYou sighed, believing you were saved, then looked up to see...<br>\r\n</span></div></div>",
            "created":1293512400,
            "id":1024340,
            "title":"Two girl haters, Karl and Greg."
        },
        "1131222222112":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "she thinks you're her little sister",
                "she doen't recognize you, and sends you to the second grade"
            ],
            "content":"<div class=\"\"><div> <span>\"Now I know why these two were expelled and forced to come here\" Bella fumes, as she eyes the two known jerks and you. For the first time in your life, you've glad Bella is on the student police. Another person, a boy who is about 15 is with her.<br>\r\n<br>\r\n\"You can't come in here\" Karl protests to Bella, as the guy grabs him and Greg. \"Normally no, but we heard <i>you</i> and know you was up to no good. We was told to keep an eye on you two\" Bella retorts, as  both bullies are escorted out, struggling. Bella turns to you, shaking her head. \"They couldn't come here for two days without causing trouble. Are you okay...?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1293598800,
            "id":1024652,
            "title":"Your sister, Bella (student police)"
        },
        "11312222221121":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Fainted.",
                "Ran."
            ],
            "content":"<div class=\"\"><div> <span>\"Are you okay, Lucy.\" she asked you. \"Those guys didn't punch you or anything, did they, sis?\"<br>\r\n<br>\r\n\"Lucy!?\" you thought, alarmed. \"Sis!?\"<br>\r\n<br>\r\nYou mumbled something behind the gag and Bella carefully peeled the tape off before pulling the sock roll out of your mouth, allowing you to turn your head and throw up onto the floor. The taste of the socks alone was enough to make you vomit but being called Lucy and Bella calling you sis threw you over the edge.<br>\r\n<br>\r\n\"Please untie me, sis.\" you said, as she was your sister. \"I'm having a really bad day!\"<br>\r\n<br>\r\nBella looked at you with a sense of pity. \"It'll be alright, Lucy.\" she said, gently. \"Once we get you out of this and into a new uniform, I'll take you back to class, okay?\"<br>\r\n<br>\r\nYou tried to protest but Bella cut you off. \"I know you are scared, Lucy.\" she told you, untying you. \"I would be too, if I was attacked like that but this is a good school, with good kids.\" she smiled. \"It's not like home school, but I know you will make a lot of friends.\"<br>\r\n<br>\r\nYou mind reeled, leaving you lost and confused. \"The irony of this is sick!\" you thought. \"Yesterday, I was having an argument with my little sister over how I treated girls and now, I'm somehow stuck in the body of a little girl being, cooed by her, thinking I am her little sister!\"<br>\r\n<br>\r\nOnce you were free, Bella, thinking you were her frightened little sister, grabbed your arm and took up a radio, calling for a school uniform, stating what could have only been your measurements. \"Don't worry, sis.\" she said, winking at you. \"The first day is always a little rough.\"<br>\r\n<br>\r\nYou began to sweat a little, wondering what to do.. soon after, a young boy arrived, holding the school uniform for girls. Seeing it, you began to panic, and...<br>\r\n</span></div></div>",
            "created":1293598800,
            "id":1025057,
            "title":"she thinks you're her little sister"
        },
        "113122222211211":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You awaken with Bella near you",
                "You awaken in your second grade class"
            ],
            "content":"<div class=\"\"><div> <span>Its too much for you to take, first being transformed somehow into a little girl, <i>then</i> confronted by the biggest jerks on the planet, then rescued but your sister, who you always hated, but is now acting like you're her little sister, not her older brother. You faint.<br>\r\n<br>\r\n\"Lucy, you okay?\" Bella aks your unconcious body. \"Can you give me and Lu some space\" she asks, thinking the shock of the boys' bullying has called you to faint. The boy nods, and walks out. Bella wastes no time getting you dressed in the school uniform, replacing the torn one you was wearing. Within minutes, she has you in another pleated skirt, a blouse and she ties your hair into braids. \"She's been though a lot today. I'll give her a surprise\" she thinks, as she takes of fyou black mary janes. She replaces your ankle length socks that the younger students tend to wear with a spare pair of her own knee length socks, then grabs a small amount of pink lip gloss and applies it to your lips. If you really was her younger sister, you'd be thrilled to be allowed to look like 'a big girl', since the changes have made you look cuter than ever, but to your teenage guy mind, it will be a nightmare. SHe picks you up, and carries you outside.<br>\r\n<br>\r\n</span></div></div>",
            "created":1293685200,
            "id":1025312,
            "title":"Fainted."
        },
        "1131222222112111":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Tell Bella who you really are.",
                "Insist upon calling mom."
            ],
            "content":"<div class=\"\"><div> <span>You were only outside, sitting on a bench with your head down for a few minutes before you woke up with a low moan. At first, you did not notice Bella, sitting next to you, concerned. \"What a horrible dream.\" you muttered. \"I had become a little girl and attacked by two real jerks.\"<br>\r\n<br>\r\n\"It wasn't a dream, sis.\" said Bella, trying to be comforting. \"You were attacked by two jerks but you're not that little.\"<br>\r\n<br>\r\nYour eyes popped wide open and you turned to Bella, who smiled kindly at you, before looking down at your very small and clearly feminine body. It was not a dream, it was real! The only difference, you noticed, was that you were wearing knee length socks instead of ankle length and you could feel something on your lips. you touched them and looked at your fingers to find pink lip gloss.<br>\r\n<br>\r\n\"Surprise, Lucy.\" said Bella, giggling. \"I thought making you look more like a 'big' girl would help you feel better.\"<br>\r\n<br>\r\n<i>\"Thanks a lot!\"</i> you thought, forcing a small grin. <i>\"What a nightmare! Why is this happening to me!?\"</i><br>\r\n<br>\r\nWithout knowing why, you began to cry, still holding your small grin. You wanted to tear the girls uniform off and tear it to shreds and smack your sister for treating you like a child. You also wanted your original body back so you could kick the shit out of the two boys who had humiliated you in front of your sister. Only, you did not know how and that frustrated the hell out of you. What was more of a nightmare was that Bella took your frustration as joy.<br>\r\n<br>\r\n\"Aw!, I made you so happy, you're crying!\" she said, smiling. \"You're welcome, sis.\"<br>\r\n<br>\r\nShe leaned over, hugging you warmly, sending you over the edge and you cried harder, burying your face into your hands. \"I'm dreaming!, I'm dreaming!\" you whispered, trying to pull away from the nightmare you were in.<br>\r\n<br>\r\nBella giggled. \"One would think I was nice to you.\" she said, softly. \"Those guys must have really shaken you up.\" she paused, worried for you. \"I think you had better call it a day. Mom is still at work so I'll have aunt Sam pick you up.\"<br>\r\n<br>\r\n<i>\"Aunt Sam?\"</i> you thought, confused. <i>\"We don't have an aunt Sam.\"</i><br>\r\n<br>\r\nSeveral yards away, in the school parking lot, inside her sports car, Samantha Forester giggled.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://www.wallpaper4u.cn/wp-content/uploads/2009/08/muscle-car-wallpaper-mustang-60s-gt-1600x1200.jpg\" target=\"_blank\">http://www.wallpaper4u.cn/wp-content/upl...</a><br>\r\n<br>\r\nToday, she he was a tall, beautiful woman with shoulder length auburn hair and brown eyes. She often changed her outward appearance so that no one, outside of her family, would know what she truly looked like.<br>\r\n<br>\r\n\"So, the pendant made you the little sister.\" she thought, smiling. \"Just wait until I get my hands on you... Lucy.\"<br>\r\n<br>\r\nAlthough you knew nothing of Samantha's thoughts, or even of her presence, you began to panic as this reality you were stuck in was threatening to pull you deeper and deeper.<br>\r\n<br>\r\nWhat do you do?<br>\r\n</span></div></div>",
            "created":1294117200,
            "id":1029277,
            "title":"You awaken with Bella near you"
        },
        "11312222221121112":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "To the mall. ",
                "Straight home"
            ],
            "content":"<div class=\"\"><div> <span>\"I need to talk to mom\" you think, panicked to see Bella hugging Samantha warmly, and being hugged back. \"Bella, I think we need to talk to mom.\"<br>\r\n<br>\r\nBella looks at funny. \"First time I've heard you call her that. Maybe you're wanting to grow up, since you're in big girls' clothes. While I know mom has told you about 'stranger danger', it doesn't apply to family! You're so cautious at times Lucy\" Bella very lightly scolds. \"Just take her home, aunt Sam. She's had a rough day. Maybe not straight home, I'm sure she'd like a present\" she says as she places your tiny hand into that of Samantha. Reluctantly, you get into the back set of Samantha's car. You don't notice the grin on Samantha's face, who's deciding how to punish you further, though she knows she has to do as Bella asked, unless she wanted a trip before the witch courts, something she doesn't want, ever. <br>\r\n<br>\r\n\"Where are you taking me, auntie Samantha\" you ask, talking like the little girl you appear to be, though you wish that you could openly speak.</span></div></div>",
            "created":1294203600,
            "id":1029415,
            "title":"Insist upon calling mom."
        },
        "113122222211211121":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "a beauty parlor to 'de-stress'",
                "Forester antiques"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll take you to the mall\" Smanatha says.<br>\r\n<br>\r\n\"I'm sure she'll appeciate it\" Bella says, as she says goodbye to you and 'aunt Samantha' She  quickly leads you to her car, and straps you in a booster seat.<br>\r\n<br>\r\n\"Where are you taking me?\" you say quite fearfully seeing you're not going to the mall in your hometown. <br>\r\n<br>\r\n\"To the mall, like I said\" Samantha says. <br>\r\n<br>\r\n\"Why are you doing this?\"<br>\r\n<br>\r\n\"Because you had a rough day and need cheering up.\"<br>\r\n<br>\r\n\"You know what I meant\" you snap. \"I'n not a little girl. Why did you change me you pycho <i>witch</i>?\"<br>\r\n<br>\r\n\"You was a complete jerk, but now you're a cute, sweet little girl, <i>Lucy</i>. Don't worry, you and me are the only ones aware of your past. You'll soon get used to it\"<br>\r\n<br>\r\n\"You can't up end my life like this! Plus there are worse guys out there. What about those two visiting jerks that ruined my clothes? Who gave you the right to do this anyway?\" you splutter<br>\r\n<br>\r\nSamantha looks at you coldly. \"Behave yourself young lady.\" She grabs your hand again and takes you to </span></div></div>",
            "created":1305349200,
            "id":1105557,
            "title":"To the mall. "
        },
        "1131222222112111211":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Your home.",
                "Her home."
            ],
            "content":"<div class=\"\"><div> <span>\"No, don't!\" you whispered, seeing Samantha dragging you to a beauty parlor. \"I'm begging you, not a makeover!\"<br>\r\n<br>\r\nSamantha grinned but ignored you as she pulled you into the beauty parlor where you saw a girl you recognized as Mel Harrison who was getting a makeover of her own with who you recognized as her little sister, Hannah. She gave Samantha a worried look, seeing her with a little girl in tow. Still holding you, she leaned towards her and carefully whispered a few words into her ear. She whispered back but you were unable to hear what they were saying...<br>\r\n<br>\r\n\"This is a teen jerk who needs to learn a lesson.\" she had whispered, unknown to you. \"I'm having a little fun with 'her'.\"<br>\r\n<br>\r\n\"Grandma will not like this, aunt Samantha.\" warned Mel, too quietly for you to hear. \"If its permanent...\"<br>\r\n<br>\r\n\"Only 'she' can break the curse by getting closer to her family.\" whispered Samantha. \"It's entirely up to her.\"<br>\r\n<br>\r\nMel sighed. \"It's your mess.\" she said.<br>\r\n<br>\r\nJust as you were about to step closer to hear better, Samantha pulled you away and planted you in a chair before turning to one of the beauticians. \"My niece, Lucy has had a bad day at school.\" she said, kindly. \"She needs a makeover and pierced ears to cheer her up.\"<br>\r\n<br>\r\n<i>\"Pierced ears!?\"</i> you thought panicking. <i>\"I'm out of here!\"</i><br>\r\n<br>\r\nOnly, you found it impossible to move, you had been somehow locked inside the chair as the beautician called over some help and they began to work on your makeover. First came a foundation with a large brush, making your entire face one color tone. Then, they moved in with smaller brushes, adding some light red blush, pink lipstick, and light blue eyeshadow before they moved on to your nails, shaping and painting them a candy pink. Seeing yourself in the mirror made you feel ill but you were still unable to move as the girls then moved on to your hair, giving it a more crimped and curled look and adding honey blond highlights at Samantha's request.<br>\r\n<br>\r\n\"This might pinch a little, dear.\" said one of the girls, working on you. \"Don't worry, though, it will pass quickly.\"<br>\r\n<br>\r\nTo your horror, you heard yourself reply, \"Okay, thank you.\"<br>\r\n<br>\r\nYou glanced at the mirror while the girl rubbed alcohol onto your earlobes and saw Samantha grinning at you madly. Your mind spun, desperately trying to think of a way to get out of the nightmare you were in but then everything stopped when you felt a tinge of pain in your right earlobe, quickly followed by an identical pain in your left ear. Before you knew it, you were wearing pink heart shaped earrings. You wanted to scream but instead, you saw yourself smile before hearing yourself say, \"They're beautiful, I love them!\"<br>\r\n<br>\r\n\"I'm glad we could cheer you up, sweetie.\" said the beautician, smiling. \"We are done with you, go show your new look to the world.\"<br>\r\n<br>\r\nFinally able to move, you gladly jumped out of the seat but Samantha had your wrist in an iron grip before you could take your second step. She then paid for the makeover and dragged you out of the store while Mel rolled her eyes, shaking her head....<br>\r\n<br>\r\nWhere does Samantha take you next?<br>\r\n</span></div></div>",
            "created":1305522000,
            "id":1107258,
            "title":"a beauty parlor to 'de-stress'"
        },
        "11312222221121112111":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "She is trying to scare you ",
                "She is serious. You have five weeks to improve"
            ],
            "content":"<div class=\"\"><div> <span>\"Don't worry sweetie. I'm taking you home\" Samantha sooths.<br>\r\n<br>\r\n\"Why are you doing this to me?' you whine, alarmed that you're doing it like a little girl. Samanatha giggles.<br>\r\n<br>\r\n\"Because Luke Adams was a jerk. If they could remember you those two girls you was dating would agree. I'm hoping Lucy Adams is better. Don't worry <i>princess</i>. I'm a good witch after all.\"<br>\r\n<br>\r\n\"Turn me back. I don't want to be a little girl. I promise I'll behave. I'll even keep it to just one girl\" you beg, tears running down your check.<br>\r\n<br>\r\nSamantha grins. \"You'll like being a good little girl, escpecally after what I did for your room.\"<br>\r\n<br>\r\n\"Never\" you say<br>\r\n<br>\r\n\"Yes you will. You see, if you can't break the spell in five weeks your girls' mind will take over and you'll be Lucy forever\"<br>\r\n<br>\r\n\"No! Don't do this to me\" you scream as she pulls into your driveway. You jump out of the car immediately and to your horror, start skipping to the front door. Samantha grins. \"I'll be seeing you, Lucy. Five weeks\" </span></div></div>",
            "created":1305608400,
            "id":1107569,
            "title":"Samantha the 'good' witch"
        },
        "113122222211211121112":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Continue 'Lucy's' POV.",
                "Continue Mel's POV."
            ],
            "content":"<div class=\"\"><div> <span>Unknown to you, as you tried to find a way out of your predicament, Samantha was visited by a woman with long black hair and green eyes. Samantha let out a low scream, startled by her sudden appearance as she stopped at a red light. \"You really need to work on your entrances, madam head witch.\" said Samantha.<br>\r\n<br>\r\n\"Why are you tormenting this boy.\" asked the woman, ignoring Samantha's comment.<br>\r\n<br>\r\nSamantha sighed. \"He is dating two girls at once, Elvira.\" she explained. \"One is a witch on the council. Once she learns of his of his actions, he will be given a trip to Girl Island but I sense 'her' sister really cares for her, despite her short comings, I'm giving 'him' a chance.\"<br>\r\n<br>\r\n\"What do you care about this Bella?\" asked Elvira.<br>\r\n<br>\r\n\"I made a mistake with her.\" replied Samantha, reluctantly. \"I owe her for that.\"<br>\r\n<br>\r\nElvira turned to Samantha, turning red. \"A mistake? Explain.\"<br>\r\n<br>\r\nThe light turned green and Samantha began to drive. \"Last year, I accidentally allowed a magical artifact to be sold to her.\" she said. \"It temporarily gave her the power of a witch, I corrected the mistake but it left her feeling empty, though she has no clue why, as I had removed her memory of the incident.\"<br>\r\n<br>\r\nElvira shook her head. \"So you are making this up to her by teaching her brother a lesson?\" she asked.<br>\r\n<br>\r\n\"I am making this up to Bella by helping her brother become a better person, as a teenage boy or a little girl.\" corrected Samantha. \"Everything hinges on how 'Lucy' acts in the next five weeks.\"<br>\r\n<br>\r\nElvira sighed. \"I will allow this, Samantha.\" she said. \"However, I will be watching this case closely. Do nothing to influence this further, unless there is no other choice, if you wish to avoid the courts.\"<br>\r\n<br>\r\nWith that, Elvira vanished from the car...<br>\r\n</span></div></div>",
            "created":1307854800,
            "id":1124264,
            "title":"She is serious. You have five weeks to improve"
        },
        "1131222222112111211121":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "you check out your room",
                "you decide to watch tv"
            ],
            "content":"<div class=\"\"><div> <span>As soon as you get to the front door, you stop skipping. 'What is happening to me? What did that witch do to me?\" your mind screams, as you open the door. As expected, neither mom or Bella are home. Normally this is a good thing, but right now, you need someone to talk to, even though you suspect they'll think you're playing some weird game. looking around, you remember that Forester witch saying 'she did something to your room'. A part of you wants to check it out, see what damage she did, since you fully expect to see some pink girly girl little girl's room, but you're frightened that you're going to go all 'little girl' again like outside...</span></div></div>",
            "created":1308027600,
            "id":1125640,
            "title":"Continue 'Lucy's' POV."
        },
        "11312222221121112111211":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "the lure of the dolls...",
                "you hear someone coming home"
            ],
            "content":"<div class=\"\"><div> <span>While you're scared of what you might find, you know you're going to have to go to your room within a couple of hours anyway, and you don't want any nasty surprises then. Nerviously, you push open the door to your room, and immediately you groan. Its a girly room for sure.<br>\r\n<br>\r\n\"Why did she have to make 'Lucy's' room so girly?\" you moan, refusing to call it your room. It looks like another typical girly girl room, and you don't want to go in in case it does something to you, even though you want to get out of this ridiculous uniform Bella put you in. \"Luke, that witch said I've got five weeks. She isn't going to do anything more to me in my own house. So stop being a wimp and get this thing off. SHe can't have replaced all my stuff with this crap\" you say sharply to yourself, as you step into your girlified room. Blinking a couple of times, you're pleased that you're not feeling any different.<br>\r\n<br>\r\n\"See, nothing to be afraid of\" you mutter to yourself as you look around the room. Somethings you want to get rid off fast, mainly the big dollhouse in the corner of the room. \"Maybe Bella would like that junk. She probably still plays with them\" you grin, as you start taking down the princess posters around your room..</span></div></div>",
            "created":1311138000,
            "id":1150883,
            "title":"you check out your room"
        },
        "113122222211211121112112":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "changing further"
            ],
            "content":"<div class=\"\"><div> <span>You've never been so relieved to hear the front door open. Even Bella sounds good, since you're afraid of going 'little girl'. You rush down down to see who it is. to your shock, its your girlfriend, Rachel.<br>\r\n<br>\r\n<i>Is she going to be my babysitter?</i> you think disgustedly. Rachel looks at you (you're still dressed as a schoolgirl) and smiles. Its not one you've seen before.<br>\r\n<br>\r\n\"Hello Luke. You look much better like that\"<br>\r\n<br>\r\n<i>Huh!? How does she know? Everyone else thinks I'm a little girl</i>. Rachel looks closer, like she is guessing my thoughts. \"I'm a witch <i>young lady</i>, but this is not my doing. I heard how much of a jerk you've been. I tried to ignore it, be the adult. I tried to wait for you to mess up. However it seems another witch did my work for me.\"<br>\r\n<br>\r\n\"Change me back. I'd do anything! I'd publically tell everyone I cheated.\"<br>\r\n<br>\r\n\"It's too late for that, little girl. You've got a powerful curse on you which I can't lift until the end, even if i wanted to. But I don't.\"<br>\r\n<br>\r\n\"Please!\" you beg.<br>\r\n<br>\r\n\"Tell me Luke. What's your name?\"<br>\r\n<br>\r\n\"Its Luke. Luke. Luke Lu.. Luc.. Lucy!\" you say, with increasing horror.<br>\r\n<br>\r\n<br>\r\n\"What have you done to me?! I don't have a girl's name. my name is Lucy.\"</span></div></div>",
            "created":1321419600,
            "id":1224110,
            "title":"the witch girlfriend turned babysitter"
        },
        "11313":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Go to Rachel's ",
                "go home"
            ],
            "content":"<div class=\"\"><div> <span>You're done with Britney, and everything to do with her. You take the necklace out of your pocket, and toss it away, even though you're just paid heaps for it. It gives you the creeps...<br>\r\n<br>\r\nAs you drive home, you start feeling better. So what if that bimbo cheerleader says anything, or that Harrison jerk gets mad. You're 16, he's only a kid. Laughing you reach for your pocket, and nearly drive off the road. Inside is the necklace!<br>\r\n<br>\r\n\"What the fuck? \" you scream, knowing that you dropped it several miles away. Its like one of those horror stories that something keeps chasing you. Terrified, you toss the necklace out of the car.<br>\r\n<br>\r\n\"Luke, you idiot\" you mutter a minute later as you calm down. Somebody probably saw you and slipped it back into your pocket. This is something you don't want to admit. As you near your house, you wonder what to do</span></div></div>",
            "created":1299042000,
            "id":1063239,
            "title":"You toss it aside."
        },
        "113132":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "OMG! Bella's clothes are alive! And they want to be worn by you!",
                "You look in the mirror and find that you're a girl"
            ],
            "content":"<div class=\"\"><div> <span>It been a long day, and you just want to relax. A mean smile forms over your face. Bella isn't home, neither is mom... Time to read Bella's diary. <br>\r\n<br>\r\nYou're crept into her room before to read her diary, mainly as a blackmailing tool. \"Girls are such idiots\" you grin, as you open the door, as you enter, you again brush your pocket, and find the necklace still in it. You instantly scream in terror. Dropping the necklace outside, you lock the door, and back again fast. Patting your pocket, you're relieved to feel it empty.<br>\r\n<br>\r\n'What have I done to be creeped out like this? How is this possible? Is that old hag I brought it from some find of witch?\" you think, unaware if you had said that to Samantha Forester's face, you'd be dealing with more problems than haunted jewelery. Jumping up the stairs, while feeling your (empty) pockets, you open Bella's door, and step in. Least you're going to enjoy the read...</span></div></div>",
            "created":1299042000,
            "id":1063241,
            "title":"go home"
        },
        "1131321":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Bella's reaction"
            ],
            "content":"<div class=\"\"><div> <span>You close the door behind you, still worried about the necklace left outside, even though you know its nowhere on your body, and walk to Bella's vanity, where you see her diary is resting. As you pick it up, you hear some light, high pitched voice. You look around in shock, since you was certain this place was empty.<br>\r\n<br>\r\n\"As we planned..\" the voice says, as you look around, but you see noone, only one of Bella's hairbands. Suddenly, you see a jacket move towards you on its' on. Almost like its alive...<br>\r\n<br>\r\n\"What!?\" you freak, as the arms pin you again the wall. Already you feel something tug at your clothes. Its too much for you, and you faint. An hour later, you come to, and immediately you wish you hadn't. Somehow, you're been dressed in Bella's clothes. You shudder seeing a skirt, and tube top on your body, and the hairband keeping your hair from your face. For the first time, you wish you had a much shorter hairstyle. While its not as long as a girls', the clothes make up for that. You look to see what other nasty surprised are on you. Yikes! You're even evening a bra and panties.<br>\r\n<br>\r\nPanicking, you reach for the top, when you hear a door open. Crap, its Bella, and she steps into her room, and stares at you in shock.<br>\r\n<br>\r\n\"Bella, you've got to help me. Call an exorcist! The clothes are alive!\" you say panicked.</span></div></div>",
            "created":1299128400,
            "id":1063885,
            "title":"Attack of the clothes!"
        },
        "11313211":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "You run from the room, screaming.",
                "You beg Bella for the antidote."
            ],
            "content":"<div class=\"\"><div> <span>Bella looked at you for a moment longer then burst into a giggling fit. \"I can't believe it actually worked!\" she said, smiling. \"I'll have to remember to thank that lady at the garage sale.\"<br>\r\n<br>\r\nYou immediately paled when you heard that. \"You did this to me!\" you raged. \"Get these clothes off of me, now!\"<br>\r\n<br>\r\nBella only laughed. \"Sorry.. sis, I can't do that.\" she said. \"The lady told me that when I pour the stuff onto my clothes, it will attack the first person who enters the room, dressing him or her into them.\" she knelled down to look you in the eye. \"Didn't you not notice that you're smaller than me now? I used clothes from when I was seven.\"<br>\r\n<br>\r\nYou looked down at yourself again and found that your sister was right, making you feel ill with panic. Only one thing puzzled you. \"Why did you call me sis?\"<br>\r\n<br>\r\nBella's smile grew. \"The lady also told me that the stuff would make the trapped person match the clothes .\" she told you. \"If everything else worked, well...\"<br>\r\n<br>\r\nYou eyes bugged out and you quickly pulled the skirt and panties you were wearing open to find that you were now, in fact, Bella's little sister....<br>\r\n<br>\r\n</span></div></div>",
            "created":1300856400,
            "id":1075002,
            "title":"I can't believe it actually worked!"
        },
        "113132111":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Well you are live with it",
                "I could change you into my 16 year old sister"
            ],
            "content":"<div class=\"\"><div> <span>You hear you mum shout for downstairs \"Bella why is Lucy screaming\" don't worry mum she saw a spider \"I'll deal with it\" thanks Bella Lucy couldn't ask for a better big sister.<br>\r\n<br>\r\nYou paused... \"Lucy\" yeah that's the name mum would of called you if you were born a girl and \"guess what\" you were.<br>\r\n<br>\r\nWhen you ran you went in your old room and found i filled with unicorns and Disney princesses although you do have a few Marvel super hero posters on the wall.<br>\r\n<br>\r\nWhat's going on? Bella smiled and said your my little sister now and reality has changed so i was the first born now.<br>\r\n<br>\r\nYou just sit there and then say this is my life now.<br>\r\n<br>\r\nYes till i decide you've learnt your lesson then I'll consider changing you back.<br>\r\n<br>\r\nI don't want to be seven... Bella smiled and said...</span></div></div>",
            "created":1534654800,
            "id":2535559,
            "title":"You run from the room, screaming."
        },
        "1131321112":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Tomorrow ",
                "Next week "
            ],
            "content":"<div class=\"\"><div> <span>Why a fucking girl? You could stay as my little sister then, \"NOO\", right then.<br>\r\n<br>\r\nThen all of a sudden in front of you your room began to change from unicorns plain white.<br>\r\n<br>\r\nThen it stopped and you looked around and saw your room back to how it was when you were male except a few differences like like bra's and knickers in the pile of dirty washing in the corner on the room and a jewellery box on your bedroom side side.<br>\r\n<br>\r\nYour skirt had changed into jeans and your top had turned into a girls nirvana tshirt.<br>\r\n<br>\r\nBella smiled and said i geuss if you were born a girl you would of been a tomboy.<br>\r\n<br>\r\nYour mum then came upstairs and entered your room.<br>\r\n<br>\r\n\"Lucy i thought i told you to tidy your room\" you can do it when we get back.<br>\r\n<br>\r\nBack from where? The mall you auntie is getting married and she's sent me a list of what you can wear and you need a dress fitting since your a bridesmaid.<br>\r\n<br>\r\nA dress? \"Yes Lucy your not wearing jeans\" you pretty much get dragged out.<br>\r\n<br>\r\nYou spent hours there and you hated every second of it and your mum could tell.<br>\r\n<br>\r\nYou got fitted for a very feminine dress and  heels that went with it plus a basque that went underneath it.<br>\r\n<br>\r\nThen your mum took you to the salon and got your hair tidied up and then got you some new earrings.<br>\r\n<br>\r\nYou didn't even realise till that point that your ears were even pierced, your mum said you'll have to take you nose stood out for the wedding darling.<br>\r\n<br>\r\nWhen is the wedding...</span></div></div>",
            "created":1534654800,
            "id":2535564,
            "title":"I could change you into my 16 year old sister"
        },
        "113132112":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You rush her",
                "She grins, and drags you to the mall; your clothes are out of style"
            ],
            "content":"<div class=\"\"><div> <span>Bella grins evilly as you stare at her alarmed. \"Don't rush me sis. I need to think of a good name for you. Something cute and girly...\"<br>\r\n<br>\r\n\"Change me back! You've got to have an antidote!\" you demand, cringing at your higher voice. <i>How could you not have noticed it before?</i> \"Please turn me back!\"<br>\r\n<br>\r\nBella grins but remains silent. \"I'm not a little girl. Mom will kill you\" you say pouting. If begging won't work right now, maybe being annoying, will. Bella looks at you even more closely, and her grin spreads.<br>\r\n<br>\r\n\"I wouldn't worry about mom too much, sis. I <i>told</i> you don't rush me. I want to enjoy having my little sister\"<br>\r\n<br>\r\n\"Great. She is in one of her moods again\" you think dejected<br>\r\n<br>\r\n</span></div></div>",
            "created":1300856400,
            "id":1075116,
            "title":"You beg Bella for the antidote."
        },
        "1131321122":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "her friends",
                "your girlfriends (who aren't impressed on learning about your cheating)"
            ],
            "content":"<div class=\"\"><div> <span>\"Really sis. Those clothes went out of style years ago. You need a makeover\" Bella grins wickedly.<br>\r\n<br>\r\n\"No!\" you scream. \"Change me back\"<br>\r\n<br>\r\n\"Can't. I was only told how to change you to begin with, not how to change you back\" she gsays, grabbing your hand. \"Don't worry. you'll be mom's little princess after I've done with you\"<br>\r\n<br>\r\n\"How can you explain this to mom\" you scream.<br>\r\n<br>\r\n\"She'll get over it quickly, Laura\". Bella grabs a phone, and calls</span></div></div>",
            "created":1305349200,
            "id":1105562,
            "title":"Fashion sense is outdated. You need a makeover"
        },
        "11313211221":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "begged Bella to help you.",
                "fainted."
            ],
            "content":"<div class=\"\"><div> <span>Bella dials a number, grinning at you as you tried to escape her now seemingly iron grip. Two rings later, a young girl answered. \"Hello?\"<br>\r\n<br>\r\n\"Hey, Trish. It's Bella, I have a new sister.\" said Bella with a giggle.<br>\r\n<br>\r\nShe held the phone towards you so you could hear Trish's response. \"You mean it worked!?!\" she screamed. \"I'm on my way, right now! Don't do anything until I get there!\"<br>\r\n<br>\r\nBella hung up then turned to you. \"Trish is Britteny's little sister, we met at summer camp a few months ago, we've been planning this revenge for Brit's sake ever since.\" she said. \"Now, I'm calling my school mate, Sarah.\"<br>\r\n<br>\r\nAs Bella dialed a number, you began to panic. \"Sarah Connors?\" you asked. \"You mean Rachel's little sister?\"<br>\r\n<br>\r\nBella giggled. \"You catch on fast.\" she said. \"Oh, wait, she's picked up.\"<br>\r\n<br>\r\n\"Hello?\" said a girl on the other line.<br>\r\n<br>\r\n\"Sarah? It's Bella, the potion we got from madam Forester worked, my big jerk brother is now my frightened seven year old sister in need of a full makeover.\"<br>\r\n<br>\r\nAgain, Bella turned he phone to you to hear Sarah's scream of delight. \"I'm on my way!\" she said. \"Should I tell Rachel?\"<br>\r\n<br>\r\n\"Not until we get 'Lucy' ready for the real fun tonight.\" replied Bella. \"I'm sure they would love to baby sit.\"<br>\r\n<br>\r\nYou gulped, hearing that as Bella gave you an evil grin. <i>\"Baby sit?\"</i><br>\r\n<br>\r\nOnce Bella was done on the phone, she turned to you. \"I really don't understand how these things work, <i>little sister.</i>\" she said, grinning. \"But, from what I was told, you can only be changed back while wearing those original clothes.\"<br>\r\n<br>\r\n\"You wouldn't throw them away, would you!?!\" you asked, panicking.<br>\r\n<br>\r\nBella laughed. \"I'm not that mean.\" she said. \"I'll just give half of them to each of your girlfriends and have them decide when or if they want the old you back.\"<br>\r\n<br>\r\n\"What about mom, she won't stand for this!\" you screamed, desperate to escape your fate.<br>\r\n<br>\r\nBella giggled. \"Don't worry, Forester told me that she would change things so that everyone would only remember you as my little sister, Lucy.\" she said. \"Of course, your girlfriends are exempt from that and, if they forgive you, she'll change everything, including you, back to what it once was.\" she gave you a grin. \"I wouldn't hold my breath, though.\"<br>\r\n<br>\r\nRealizing the true horror of your situation, you screamed then...<br>\r\n</span></div></div>",
            "created":1306904400,
            "id":1117936,
            "title":"her friends"
        },
        "113132112212":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You wake up alone in Bella's room",
                "You wake up ried to a chair with"
            ],
            "content":"<div class=\"\"><div> <span>You feel like the world is collapsing around you. Your sister somehow turned you into a little girl, got the younger sisters of your girlfriends involved, and only your boy clothes will turn you back, which are in the hands of your girlfriends. It is too much for you to take, and after you stammer something incomprehensible, you collapse onto the floor. Bella gets up, and prods your body, before she is satisfied that the shock of your situation has knocked you out.<br>\r\n<br>\r\n\"Sleep well, sis. This is the start of a new life for you. Hopefully you'd make a better little sister that that jerky older brother\" Bella giggles at your unconcious body. Looking at her vanity, she resists the urge to start the makeover early. Instead she heads downstairs and waits for Trish and Sarah to arrive.</span></div></div>",
            "created":1311310800,
            "id":1152090,
            "title":"fainted."
        },
        "1131322":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "freak out",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>But suddenly you feel very strange and distracted. You stop reading the diary, it is full of teenage girl’s bullshit ideas and feelings anyhow….<br>\r\nYour uneasy feeling doesn’t stop and you additionally started to swear all over….<br>\r\nWhoa man, I need a haircut you think as you feel your long hair, even you wonder, because it certainly has not been that long in the morning. As you stand up to leave to the hair salon you get a glance of yourself in the long mirror, which always shows full size reflection of the person in front. A possibility you will not miss, you never knew who you will meet today, maybe this cute girl from the hairdresser has some time for a private session tonight…<br>\r\nBut as you look into the mirror you are frozen in shock by what you see: A female person, about your height, but she was wearing ultra-tight jeans, showing her round ass and nice long legs. Also from the top you could see that has some good assets to offer…. But the freaky think is that she follows your movements…. It doesn’t take long when you realized that you somehow are her…..<br>\r\n</span></div></div>",
            "created":1534395600,
            "id":2534396,
            "title":"You look in the mirror and find that you're..."
        },
        "11313221":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "In a hospital bed",
                "On the floor"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You look at image in front of you and it's to much for you mind to handle and you start feeling very light headed and pass out.<br>\r\n<br>\r\nWhere do you wake up</span></div></span></div>",
            "created":1534654800,
            "id":2535554,
            "title":"freak out"
        },
        "113132212":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>You wonder how long you have been passed out, as you open your eyes again you find yourself on the ground, seeing through the window, you realize that it is already dark outside, so it must be night.<br>\r\nBut the worst thing is that you are still a girl…..<br>\r\n</span></div></div>",
            "created":1535950800,
            "id":2542296,
            "title":"On the floor"
        },
        "1133":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "A ten year old girl.",
                "A six year old old girl.",
                "A baby girl!"
            ],
            "content":"<div class=\"\"><div> <span>John's mother, Natalie Harrison answered the door. She sighed, seeing you. \"I am having a rough morning, Luke.\" Patiently, she said. \"Please make this brief.\"<br>\r\n<br>\r\n\"I, uh, got this cute antique at a garage sale today and I was hoping John could give me a history on it.\" Showing Natalie the bracelet, you said. \"Is he available?\"<br>\r\n<br>\r\nA crash from inside the house caused Natalie to wince as you heard John roaring in anger. \"John, you need to calm down!\" Firmly, a female voice said. \"Don't make me force you into a time out!\"<br>\r\n<br>\r\n\"I guess I came at a bad time.\" Wincing, you said.<br>\r\n<br>\r\nNatalie sighed. \"John is normally a very calm person but someone hurt Megan Thompson at school.\" Calmly, she explained. \"Look, I doubt he is any mood for a social call so I'll tell him you stopped by after I get him to calm down.\"<br>\r\n<br>\r\nWith that, she closed the door and you could hear John still roaring in anger with the girls of the house pleading with him. \"If Brittany calls John, I am so dead.\" Turning pale, you muttered. \"I better smooth things out with her as fast as I can.\"<br>\r\n<br>\r\nYou returned to your car and stared at the bracelet, trying to think of what to do next. \"Hmmm... Brittany's little sister, Trish loves jewelry. Maybe if I give this gift to her, she will talk to Brittany for me.\"<br>\r\n<br>\r\nYou smiled at the idea and drove out to the park where you knew Trish would be playing with her favorite babysitter, Harry Rich. You knew that Harry was into antiques but you were more interested in getting Trish on your side. \"Hey, how is my favorite little girl?\" Trying to sound sweet, you said.<br>\r\n<br>\r\nTrish looked up at you and rolled her eyes. \"You really stink when it comes to pick up lines.\"<br>\r\n<br>\r\nHarry chuckled. \"Kids say it as they see it.\" Shrugging, he said. He then turned serious. \"What do you need here, Luke?\"<br>\r\n<br>\r\n\"I just wanted to give Trish here a little gift, that's all.\" Lightly, you said.<br>\r\n<br>\r\n\"You know my rules, Luke.\" Standing between Trish and you Harry said. \"Trish does not get anything from anyone without her parents okay unless I examine it first.\"<br>\r\n<br>\r\n\"You are really a hard a...\" You began.<br>\r\n<br>\r\n\"Now, Luke!\" Annoyed, Harry demanded.<br>\r\n<br>\r\nYou sighed and held up the antique item. \"It's just a bracelet I got at a garage sale, man.\"<br>\r\n<br>\r\nHarry took the bracelet and examined it carefully. \"Sorry, I can't let you give this to her.\" Tossing it back, he said. \"Her parents would kill me.\"<br>\r\n<br>\r\n\"What?\" Taken back, you asked. \"It's just a bracelet.\" You opened it up. \"See, look.\"<br>\r\n<br>\r\n\"I wouldn't do that, Luke.\" Serious, Harry warned.<br>\r\n<br>\r\nIt was too late, you clamped the bracelet onto your wrist with an audible click. It was very tight as it was not made for a wrist your size. You trued to Harry who merely sighed, shaking his head. \"I tried to warn you but now you're stuck with it.\"<br>\r\n<br>\r\n\"What do you mean?\" Confused, you asked. \"It's just a harmless bracelet.\"<br>\r\n<br>\r\n\"It's a bracelet that does not come off unless you have a key, you idiot!\" Annoyed, Harry hissed. \"Good luck getting that off unless you can get the person who ran that garage sale to give or sell you the key to unlock it.\"<br>\r\n<br>\r\nTrish giggled, hearing that. \"It suits you, Luke.\" Smiling, she teased.<br>\r\n<br>\r\n\"Very funny, squirt.\" Frowning, you said. \"Only I think this bracelet was made for a little girl.\"<br>\r\n<br>\r\nWith that, you walked back to your car only to be stopped by Harry. \"Where do you think you are going, little miss?\" Serious, he asked. \"You better than to wander off.\"<br>\r\n<br>\r\n\"What?\" Confused, you asked.<br>\r\n<br>\r\nThen you caught a glimpse of yourself in your car's rear view mirror. You had somehow become...<br>\r\n</span></div></div>",
            "created":1399352400,
            "id":1792435,
            "title":"Only his mom, looking frustrated."
        },
        "11332":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "You run away.",
                "You throw a tantrum.",
                "You try to convince Bella you are a boy."
            ],
            "content":"<div class=\"\"><div> <span>You could not believe your eyes as you saw your reflection. There was a cute six year old girl in the place of the teen boy that had greeted you before. \"How did this happen!?\" Frightened, you asked. \"I was a teen boy only a minute ago!\"<br>\r\n<br>\r\n\"What are you talking about, Lucie?\" Curious, Harry asked. \"Did you have cookies for breakfast again?\"<br>\r\n<br>\r\n\"But- But Harry!\" Desperate, you protested. \"I'm not a little girl!\"<br>\r\n<br>\r\n\"You could have fooled me.\" Bemused, Harry said. \"Come on, your older sister, Bella will be by any minute to pick you up.\"<br>\r\n<br>\r\nAs if on cue, you heard your car horn and turned to see Bella only as a teen girl, sitting in the driver's seat waving at you! \"Hey, Harry!\" Smiling, she said. \"Was Lucie good for you today?\"<br>\r\n<br>\r\n\"She was okay.\" Smiling back, Harry replied. \"Only I think she got into the cookies again.\"<br>\r\n<br>\r\n\"She's acting weird, huh?\" Amused, Bella asked.<br>\r\n<br>\r\n\"She said she was a teen boy.\" Chuckling, Harry replied.<br>\r\n<br>\r\nBella and Harry laughed while you blushed slightly. \"How did this happen?\" Frustrated, you asked yourself. \"It started right after I put on the bracelet...\" You gasped. \"The bracelet must have some kind of curse on it!\"<br>\r\n<br>\r\n\"What are you babbling about now?\" Looking at you, Bella asked. \"Get in the car; I have to take you to ballet today.\"<br>\r\n<br>\r\nYour eyes went wide. There was no way you wanted to go to ballet. You had to the the woman who sold you the bracelet to give you the key before anything else happened!<br>\r\n</span></div></div>",
            "created":1404795600,
            "id":1824580,
            "title":"Under lock and key."
        },
        "113321":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "you run for the garage sale.",
                "you hide.",
                "you tell Bella you want to buy something.",
                "Bella catches you before you decide."
            ],
            "content":"<div class=\"\"><div> <span>Not wanting to be trapped as a little girl, you ran off as fast as your small body could carry you towards the house that was holding the garage sale. Bella was quick to give chase, shouting at you to stop. With your smaller body, you were able to run through holes in hedges Bella could not follow but you were quickly running out of energy. You knew it was only a matter of time before your now older sister caught up with you.<br>\r\n<br>\r\n\"Lucie, stop this instant!\" Irritated, Bella called. \"Mom will 'kill' me if you get hurt!\"<br>\r\n<br>\r\n\"I need to get to that garage sale!\" Not looking back, you cried. \"I need to!\"<br>\r\n<br>\r\n\"You're not making any sense, Lucie!\" Becoming frustrated, Bella yelled. \"Stop so we can talk about this! Maybe we can figure this out!\"<br>\r\n<br>\r\nYou looked about, desperate and spotted the garage sale less than a hundred yards away. Only Bella was almost right on your heels. You had to make a decision and you had to make it fast.<br>\r\n</span></div></div>",
            "created":1534395600,
            "id":2534599,
            "title":"You run away."
        },
        "12":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "you change into a girl version of yourself (16 years old)",
                "you change into a ten year old girl",
                "you turn into a five year old girl",
                "you become an infant girl",
                "nothing happens to you... yet"
            ],
            "content":"<div class=\"\"><div> <span>you decide you've had enough. You're tired, sick of school even though it only has just started, and had enough of Britney's constant whining. Besides, you've dated her for about a month, almost a record. You'll text her that you're breaking up with her tomorrow. It takes thirty minutes to drive back home. You get out of the car, and step into the kitchen. Both mom and Bella are waiting.<br>\r\n<br>\r\n\"Luke. We need to talk...\" mom says. You throw a dirty look at Bella. That bitch must have spied on you, and discovered your girlfriends.<br>\r\n<br>\r\n\"I'm don't\" you say, annoyed. Mom shakes her head. \"Bella told me...\"<br>\r\n<br>\r\n\"That spying bitch\" you hiss to Bella, how looks at you distastefully. \"Don't make judgments on me. Its not like you're better\", you say hurtfully. Ever since Dad walked out three years earlier, mom has gotten into some bad relationships, fortunately none lasting.<br>\r\n<br>\r\n\"How dare you! You're always been a brat\" mom says heatedly. You ignore them. What do they know about anything? Suddenly you start feeling weird...</span></div></div>",
            "created":1292302800,
            "id":1014953,
            "title":"trouble on the homefront"
        },
        "121":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "more",
                "something else",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Without warning, your hair lengthens from your normal short cut, to about three inches past your shoulders. \"What the fuck is going on?\" you say, more annoyed to realize that things like this isn't possible. The fact that you got hair like some hippie, like those that you ridicule annoys you more than anything, and you look in the mirror, wondering what to do about your hair.<br>\r\nThe hair is the least of your worries, as you suddenly feel your chest begin to itch. \"What's happening to me?\" you say, as your chest begins to push outwards. Only when they past an a cup, do you realize that you're growing breasts…<br>\r\n</span></div></div>",
            "created":1421643600,
            "id":1919940,
            "title":"you change into a girl version of yourself (16 ..."
        },
        "1211":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "your clothes started to change",
                "your nails grew out and became painted",
                "your body shifted shape"
            ],
            "content":"<div class=\"\"><div> <span>Bella was the first to recover and put into voice what you had realized. \"Oh my God! Luke! You're turning into a girl!\"<br>\r\n<br>\r\nA part of you wanted to deny it, but the evidence was clear, as well as your now b cup breasts. Panicked, you turned to mom for help, but she was frozen, due to shock.<br>\r\n<br>\r\n\"Bella?\" you pleaded, hoping for her help. You didn't expect it; she was a bitch and a part of you suspected she had a role in this, even though you saw her surprise was genuine. Unlike mom, Bella's shock didn't paralyze her. Unfortunately for you, Bella took a step back.<br>\r\n<br>\r\n\"Help!\" you pleaded, your voice cracking as it became much high pitched.<br>\r\n<br>\r\n\"What can I do?\" Bella said, her voice frightened, as she took another step back.<br>\r\n<br>\r\n\"Anything\" you said, your voice now that of a girl your age. <br>\r\n<br>\r\n\"Luke...\" Bella gasped, as....</span></div></div>",
            "created":1421730000,
            "id":1920662,
            "title":"more"
        },
        "12111":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>As she looked on you, she saw your jeans become a little tighter, you shoes turn into a pair of black and purple sneakers and your vest because tighter fitting and a bra a visible underneath it as there is red straps on your shoulders now.<br>\r\n<br>\r\nYou almost fell over but luckily Bella was there and quickly pulled a chair out before you fell over and landed on the chair instead of the floor.<br>\r\n<br>\r\nYour mum looked at you and said \"Luke you are a girl... You are a girl... You are\" then she fainted\".<br>\r\n<br>\r\nBella and ordered you to help her with your mother and help her onto the sofa. <br>\r\n<br>\r\nA few hours later<br>\r\n<br>\r\nYou and Bella waited for your mother to come around and eventually she did and looked at you and said \"Luke it wasn't a dream was it\".... No mum it wasn't</span></div></div>",
            "created":1555849800,
            "id":2647816,
            "title":"your clothes started to change"
        },
        "121111":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>Then suddenly you felt something with the long hair and the changed voice and also the very visible and present breasts your upper body looked like a girl and your voice is also doing the support for this…<br>\r\nBut now also your lower body started to shift: Your hips push outwards, which is painful and also your ass reshaped to a more feminine butt…<br>\r\nTears are rolling down your checks as you feel your manhood fading away….<br>\r\nA reshape of your legs completed the gender transformation and you are a full girl now…<br>\r\n<br>\r\nThe clothes fitted you a lot better now and you mum sat up and said \"how did this happen Luke?\"... I don't know mum... Then Bella said \"Luke has been cheating again\"... Well Luke that might be it. <br>\r\n<br>\r\nWe might as well get on with it now as there is nothing we can do about anything now.... But mum! But nothing Luke you bought this on yourself and now you have to live with the consequences of your behaviour... <br>\r\n<br>\r\nMaybe been a girl will teach you a lesson Luke.... </span></div></div>",
            "created":1555850340,
            "id":2647819,
            "title":"Continue "
        },
        "1211111":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>It's been a week now since the change and to be honest the only change is my name as my mother calls me Lucille Christina Adams now or Lucy for short. <br>\r\n<br>\r\nBella is enjoying having a big sister and my mother appears to really enjoy having two daughters and less arguments have been happening in the house and it seem more settled and not so on edge. <br>\r\n<br>\r\nI still haven't figured out what happened or how it happened.... I mean when my clothes changed all my clothes changed that night I went to my room to discover that my clothes had changed into female version of them selves and bra's had been added too. <br>\r\n<br>\r\nAs I said it's been a week and my mum has let me dress as a tomboy... Although the other day we went out for a meal and that day me and my mother went out a I was forced to buy a dress and shoes. <br>\r\n<br>\r\nI'm still me but I've kept to change to myself and apart from Bella and my mum no one else knows about the change.</span></div></div>",
            "created":1555852800,
            "id":2647827,
            "title":"Continue "
        },
        "12113":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "clothes change next",
                "reality changes",
                "nothing else happens"
            ],
            "content":"<div class=\"\"><div> <span>With the long hair and the changed voice and also the very visible and present breasts your upper body looked like a girl and your voice is also doing the support for this…<br>\r\nBut now also your lower body started to shift: Your hips push outwards, which is painful and also your ass reshaped to a more feminine butt…<br>\r\nTears are rolling down your checks as you feel your manhood fading away….<br>\r\nA reshape of your legs completed the gender transformation and you are a full girl now…<br>\r\n</span></div></div>",
            "created":1421816400,
            "id":1920876,
            "title":"your body shifted shape"
        },
        "121131":{
            "author_id":"quasarwolf",
            "author_name":"Firestorm",
            "choices":[
                "Someone's waiting for you",
                "Bella smiles at you"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my God. I'm a... I'm a....\" you say, hyperventilating as you feel your body for parts that were no longer there. Feeling nothing in your crotch, you briefly heft your new B-cup breasts in your hands, then pull at your hair, which now reaches the middle of your back. Panicking, you look at your mother and Bella, who are just staring at you in shock, then back down at your newly-female body.<br>\r\n<br>\r\nThe change isn't done yet, though. You feel your clothes moving and shifting around your body. You can feel your underpants shifting, and you feel the cloth touching your crotch more closely than it should. You pull your pants out a bit, and see that your underpants are now plain white panties. Immediately afterward, you feel your undershirt mostly vanish, except for a part which tightens around your new breasts while the part on your shoulders thins to mere straps. You check and confirm that it had become a plain white bra.<br>\r\n<br>\r\nYour sneakers change as well: They become smaller and shift to fit closer around your feet, and their tops lower and they become black, becoming simple flats. Your socks, meanwhile, just become low top socks.<br>\r\n<br>\r\nIt's still not done, though. Your pants change from jeans to cloth, and the legs start widening. The pant legs quickly become wide enough to be touching, and start to fuse together. The outside of your merged pants smooths out, while the cloth separating your legs vanishes, turning your pants into an ankle-length skirt. The skirt and your shirt then both become a light blue color and begin to fuse together, merging at the waist. You try pulling them apart but to no avail; they move like a single piece of cloth and soon had fuse completely, leaving you wearing a simple modest blue dress.<br>\r\n<br>\r\nYou stare down at the dress you're now wearing in shock for several seconds, then back up at your mother and Bella. \"What's happening?\" you mutter quietly, \"Why am I... a girl?\" You pull at the dress with one hand, then drop it.<br>\r\n<br>\r\nYou look at your mom and Bella. Nothing else seems to be happening, the change is done. \"Why am I a girl?\" you repeat quietly.<br>\r\n<br>\r\nBella giggles. \"Luke's been cheating!\" she laughs, \"and now Luke's a girl!\"<br>\r\n<br>\r\nYour mom nods hesitantly. \"Perhaps this has resulted from your treatment of females...or is a karmic response, at least. Bella, take your bro-<i>sister</i> to her room, and we'll figure out what to do about this.\"<br>\r\n<br>\r\nBella takes your arm and leads you upstairs. You're too stunned to resist, and she pulls you to your room. She opens the door and pushes you in, then follows you. Fortunately, your room is unchanged - only your body and clothes (<i>all</i> your clothes, though you don't know that yet) changed. But...</span></div></div>",
            "created":1431406800,
            "id":1977482,
            "title":"clothes change next"
        },
        "1211312":{
            "choices":[
                "pass out and woke up in bed with your mum thee?",
                "just stood in shock, your sister left you rang a friend?"
            ],
            "content":"<div class=\"\"><div> <span>You stand there and bella looks in your closet and draws and smiled at you, luke your clothes have changed but only into female versions of your clothes.<br>\r\n<br>\r\nYour jeans have turned into boot and straight leg jejeans, your tshirts have turned into female ones and vest tops although your suit has turned into a little black dress sexy Bro and Your school uniform has turned into a dress, garter belt, stockings, blouses and school blazer.<br>\r\n<br>\r\nShe then looked In your draws and said looks like you boxers have turned into thong, boyshorts and bikini style briefs and your PJ's are still there and the same colour just female versions of them and the last draw Bro your shorts have turned into skirts and hot pants plus your swimming trunks have turned into a bikini and a one piece suit.<br>\r\n<br>\r\nShe turned to you smiled and said looks like I have a tomboy sister-brother luke.<br>\r\n<br>\r\nWhat did you do?</span></div></div>",
            "created":1431493200,
            "id":1977573,
            "title":"Bella smiles at you"
        },
        "12113121":{
            "choices":[
                "Next morning?",
                "Two weeks later, school morning and your still a girl."
            ],
            "content":"<div class=\"\"><div> <span>you open your eyes and see your mum standing there, mum what happened? you passed out Luke, sit up and drink some water it might make you feel better darling, you sat up and realized you where no longer in your clothes you where in <a rel=\"nofollow\" href=\"https://static.wowcher.co.uk/images/deal/57622/25587.jpg.\" target=\"_blank\">https://static.wowcher.co.uk/images/deal...</a><br>\r\n<br>\r\nmum why am i wearing these? i dressed you darling i thought you would be able to breath better in less tight clothes, thank you i guess, you trid standing up and then felt light headed and sat back down on your bed.<br>\r\n<br>\r\nRight Luke look i'm not sure what has happened but me and Bella will help you till we can figure everything out, how can you help me now, well we can show you how  it is to be a girl and what you need to do.<br>\r\n<br>\r\nwhat am i going to tell my freinds and what about school what is going to happen, you are still going to school young man female or not, but we have two weeks till it starts so i'm sure we'll figure it out before then.<br>\r\n<br>\r\nyou then laid back down and fell back to sleep?  </span></div></div>",
            "created":1431493200,
            "id":1977826,
            "title":"pass out and woke up in bed with your mum thee?"
        },
        "121131211":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Lucy ",
                "Alex (Luke's middle name)"
            ],
            "content":"<div class=\"\"><div> <span>The next morning you woke up and looked at what your wearing a cotton nightie .<br>\r\n<br>\r\nYou hoped it was a dream but it wasn't and you went downstairs to see your mother in the kitchen as you got your breakfast and sat across from her.<br>\r\n<br>\r\nWhere is Bella mum? She's staying at a friend's house for a few days thought it would help if it was just me and you in the house.<br>\r\n<br>\r\nLuke you need to remember your a girl! ....? \"Close your legs darling\" ok sorry mum.<br>\r\n<br>\r\nYou sat talking for awhile and then you got dressed and your mum invited you out as she had an appointment at the salon.<br>\r\n<br>\r\nYou thought about it and said \"yes\" she then said \"Luke while we are out i can't keep calling you Luke as your a girl now.<br>\r\n<br>\r\nYou now what she means and say while we are out call me...</span></div></div>",
            "created":1533877200,
            "id":2531462,
            "title":"Next morning?"
        },
        "12113122":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "nobody believes you",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my God. What I'm going to do....\" you said, hyperventilating. You felt so lost!<br>\r\nBella left you back all alone in your room.<br>\r\nAfter a while you decided to ring some of your friends. You need to share what has happened to you!<br>\r\n</span></div></div>",
            "created":1431493200,
            "id":1977641,
            "title":"just stood in shock, your sister left you rang ..."
        },
        "121131222":{
            "choices":[
                "Amy Jones, female, straight ",
                "William Harris, male, gay "
            ],
            "content":"<div class=\"\"><div> <span>You think and then ring your friend who lives a few doors down from you, you have both known each other since kindergarten and are more like siblings then friends and know they won't take advantage of the situation and will help you and there is your class at school.<br>\r\n<br>\r\nYou ring your friend and they said hello, hello it's luke I need your help? They laugh, bella give the phone to luke, this is luke.<br>\r\n<br>\r\nOk bella? I'm not bella it's luke, come over please I need your help.<br>\r\n<br>\r\nThey laugh again, ok bella and by the way that's a good impression of luke.<br>\r\n<br>\r\nSo your friend comes around to see you a few minutes later they arrive and come up stairs to your room.<br>\r\n<br>\r\nThey immediately recognised you and said luke, what has happened to you?<br>\r\nWho is your friend?</span></div></div>",
            "created":1431493200,
            "id":1977643,
            "title":"something else"
        },
        "1211312221":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "she helps you",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Amy, a friend of yours is always on your side, even she doesn’t like how you treat girls sometimes….</span></div></span></div>",
            "created":1448514000,
            "id":2066837,
            "title":"Amy Jones, female, straight "
        },
        "12113122211":{
            "choices":[
                "Get you some shoes?",
                "Teach you to walk like a girl?"
            ],
            "content":"<div class=\"\"><div> <span>Right Luke go get a shower and I'll help you, what? Go get a shower and I'll be back in a minute.<br>\r\n<br>\r\nLuke goes and gets into the shower and then hear the bathroom door open, Luke it's Amy.<br>\r\n<br>\r\nOk, you get out of the shower and Amy talked to you and you don't remove the towel, Amy smiled look Luke I've seen a girls body before so just dry of and get dressed.<br>\r\n<br>\r\nBut I have no clothing that will fit Amy, don't worry about that Luke, you looked over and sore some clothing next to Amy, right get dried off Luke.<br>\r\n<br>\r\nSo you do and Amy said Luke you know I'm not a tomboy, but I've managed to find somethings for you to wear that are not to girly.<br>\r\n<br>\r\nYou dry off and Amy hands you a satin and lace thong and then a bra, sorry Luke but I'm not a tomboy and like wearing thongs.<br>\r\n<br>\r\nIt's ok Amy you put them on and Amy hepls you with the bra, she then passed you some jeans, you pull them on, there called Bootleg jeans and then passed you a strappy top.<br>\r\n<br>\r\nNow your dressed Luke, I think I should?</span></div></div>",
            "created":1461214800,
            "id":2136937,
            "title":"she helps you"
        },
        "121132":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "ask her to be sure, you need confirmation",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my God. I'm a... I'm a....\" you said, hyperventilating as you felt your body for parts that were no longer there. <br>\r\nBut something strange was going on: One moment mom and Bella were staring at you in shock, next moment they look relaxed and normal…<br>\r\n\"Luka, Listen to me. I need your help in the kitchen” mom said…<br>\r\nBella jumped in. \"Thanks mom, today it is Luka’s turn to help you with the cooking!\" she said smiling and leaving, properly to meet her friends…<br>\r\nYou are shocked mostly by the fact that they address you as Luka!<br>\r\n\"Mom, I'm not fine in this changed body and the first thing you think about is preparing the food!\" you protested, holding your new acquired tits…<br>\r\n<br>\r\n\"What are you doing?\" mom hissed.<br>\r\nSuddenly you realize that she must think that you are and always have been a girl, her daughter; Luka!<br>\r\n</span></div></div>",
            "created":1423630800,
            "id":1931680,
            "title":"reality changes"
        },
        "1211321":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "find out something",
                "think and play the game until you have a plan",
                "call from?"
            ],
            "content":"<div class=\"\"><div> <span>“Mom, don’t you think I should be a boy?” you ask her, but you already knew the answer and got another hissed look from her: “Waiting for you in the kitchen in 5 min clear, girl!” was her official answer.<br>\r\nOh shit was has happened here? This can’t be and is not normal that one moment you are a boy and the next moment you are a girl in body and for all the rest of the world this seems to be normal…..<br>\r\nAnd even worse you seem to be trapped with your stupid sister and mom….<br>\r\nHow to come out of here and this mess again?<br>\r\n</span></div></div>",
            "created":1534395600,
            "id":2534398,
            "title":"ask her to be sure, you need confirmation"
        },
        "12113211":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "continue",
                "continue "
            ],
            "content":"<div class=\"\"><div> <span>You stopped and started thinking and then you hear your mum almost shout in a irritated tone \"Luka Charlotte Emilia Adams\" get here now and help me or you will be grounded and i won't let you go to watch your friend at his kickboxing competition.<br>\r\n<br>\r\nYour shocked at your name and how she spoke to you, you quickly went into the kitchen and helped your mum cook and then after eating you helped clean up.<br>\r\n<br>\r\nAs you helped clean up your mum chatted away saying things like \"you remind her of herself when she was your age\" and \"she couldn't ask for two better better daughter\" although she wished you would both stop fighting so much and get along, she then smiled and said \"but i guess that's what i get for have two teenage girl's in the house\".<br>\r\n<br>\r\nYou finished cleaning up and went to your room and sat on the bed \"as you looked around\" you didn't see any difference really, you still had the same heavy metal posters on your walls the same furniture with the same graffiti drawn on them although it did seem a little more cleaner although you still had a pile of clothes in the corner of your room but with bra's and knickers added.</span></div></div>",
            "created":1534568400,
            "id":2535109,
            "title":"find out something"
        },
        "12113212":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>Your mother sits down and gently says \"Lucille Rose Adams, I live both you and your sister and you might dress and act like a boy, but you are definitely a girl\".<br>\r\n<br>\r\nAlthough sometimes I do think you should of been born a boy, you are are a loving big sister and daughter and I couldn't ask a better person to be my daughter.<br>\r\n<br>\r\nYou decid to carry on till you figure out what the hell is going on.<br>\r\n<br>\r\nShe continued and said \"you have your father's brains and looks... She said\" you know your father was a massive nerd and I was a cheerleader and we met thou our mother and we were best friends and one thing led to another and we ended up together. <br>\r\n<br>\r\nHe would of been proud of you... </span></div></div>",
            "created":1575442440,
            "id":2755192,
            "title":"think and play the game until you have a plan"
        },
        "121132121":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>She continued and said \"you know you Bella adores you although I suspect at times she is jealous too\" she is a lot like I was at school but luckily like you she has your father's brains although she doesn't always use them\".<br>\r\n<br>\r\nYour mother hugged you and said \"I love you Lucia (nickname)\" you are a little taken back but said \"I love you to mom\".<br>\r\n<br>\r\nMaybe you could be a big sister to Bella and help her with her hair and make up for her date tonight. <br>\r\n<br>\r\nYou think and smiled and said \"sure mom but I'll help you sort out the kitchen first\" it's fine darling there is only a few pots anyway. </span></div></div>",
            "created":1575474180,
            "id":2755313,
            "title":"Continue "
        },
        "1211321211":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "of course with the kittchen work you hate ",
                "of course with helping Bella with preparing for her date",
                "no, I managed everything"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>and do you struglle?</span></div></span></div>",
            "created":1588239120,
            "id":2827392,
            "title":"Continue "
        },
        "121133":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Bella gets you the most girlish outfit she could find",
                "Bella chose a Halloween costume; puffy black lolita dress and stripped tights",
                "Bella passes to you a bikini"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my God. I'm a... I'm a....\" you said, hyperventilating as you felt your body for parts that were no longer there. Both mom and Bella were staring at you in shock, stunned that you went from a 16 year old boy to a 16 year old girl.<br>\r\n<br>\r\nMom was the first to recover, though she had been nearly useless as you underwent the transformation. It was like you and her underwent a role reversal as she was now calm and controlled, whereas you was panicking. \"Luke. Listen to me. Do you have any idea what caused this?\"<br>\r\n<br>\r\nBella jumped in. \"Luke been cheating again\" she said.<br>\r\n<br>\r\nMom frowned. \"We have to consider that your.... lack of respect towards women is a factor in this. Bella, take your bro.... sister to your room and get her some clothes.\"<br>\r\n<br>\r\n\"Mom. I'm perfectly fine in this\" you protested, holding your now ill-fitting clothes.<br>\r\n<br>\r\n\"Do it\" mom hissed. Reluctantly, you followed Bella, who was beginning to smile. The shock had worn off, and like mom, thought this was some kind of cosmic justice for your behavior. She was still smiling as she opened her bedroom door. You caught it, and knew things were going to get ugly for you.<br>\r\n<br>\r\n</span></div></div>",
            "created":1422075600,
            "id":1922681,
            "title":"nothing else happens"
        },
        "1211331":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "more instructions",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Bella seems to have her fun with this as she hands you a short skirt and a revealing top…<br>\r\n“Are you serious?” you ask her and wanted to escape, but mom has been following and blocks any way out from here. So together with a frilly bra and some panties you have to wear the skirt and top now…<br>\r\n</span></div></div>",
            "created":1422507600,
            "id":1924905,
            "title":"Bella gets you the most girlish outfit she coul..."
        },
        "12113311":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "but there are changes",
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Bella cheered and also mom has a smile on her face, when they see you now wearing these girly garments…<br>\r\nBella pushes you in front of the mirror, where you can or must see your new self:<br>\r\n\"Oh my God. I'm a... I'm a....\" you said, hyperventilating as you felt your body for parts that were no longer there. And with the clothes Bella gave to you, you appear to be nothing else but a girl…There is no trace of anything indicating that you are or were a boy! Damn!<br>\r\nMom brakes the silence and told you: \"Luka, Listen to me. I need your help in the kitchen” <br>\r\nBella jumped from joy, since normally this is her part, but today it is Luka’s turn to help with the cooking!<br>\r\nYou are shocked mostly by the fact that they address you as Luka! And of course that you now have to follow the kind of old fashioned role model that a girl needs to help in the kitchen. You look at mom indicating that you don’t want to do that, but…<br>\r\n“Waiting for you in the kitchen in 5 min clear, girl!” was her official answer.<br>\r\nOh shit was has happened here? This can’t be and is not normal that one moment you are a boy and the next moment you are a girl in body and for your Mom and sister this seems to be funny…..<br>\r\nAnd even worse you seem to be trapped with your stupid sister and mom….<br>\r\nHow to come out of here and this mess again?<br>\r\nYou stand motionless in front of the mirror and started thinking and then you hear your mum almost shout in an irritated tone \"Luka Charlotte Emilia Adams\" get here now and help me or you will be grounded and I won't let you go to watch your friend at his kickboxing competition.<br>\r\nAgain your shocked at your name and how she spoke to you, you quickly went into the kitchen and helped your mum cook and then after eating you helped clean up.<br>\r\nAs you helped clean up your mum chatted away saying things like \"you remind her of herself when she was your age\" and \"she couldn't ask for two better daughter\" although she wished you would both stop fighting so much and get along, she then smiled and said \"but I guess that's what I get for have two teenage girl's in the house\".<br>\r\nYou finished cleaning up and went to your room and sat on the bed \"as you looked around\" you didn't see any difference really, you still had the same heavy metal posters on your walls the same furniture with the same graffiti.<br>\r\n</span></div></div>",
            "created":1537974960,
            "id":2554406,
            "title":"more instructions"
        },
        "123":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "They freak out",
                "Bella grins meanly, mom doesn't notice",
                "They take you to your room. Maybe it will wear off..."
            ],
            "content":"<div class=\"\"><div> <span>A sudden pain stops you. Its not in one particular area, its all over your body. Before you can say anything, you collaspe. \"Don't do this, young ma. The pretend you're sick!\" mom says angrily, but Bella screams. \"Mom. Luke's shrinking!\"<br>\r\n<br>\r\n\"Impossible\" mom snaps, curious why her daughter would defend you. You and her have never really gotten on well with each other, before seeing tha Bella is right you are shrinking.<br>\r\n<br>\r\n\"Whats happening?\" you barely say, not liking that your voice is increasing in pitch. You're already a quarter of your height and you feel that you're still shrinking.<br>\r\n<br>\r\n\"Have you done anything wierd?\" mom says concerned, the anger out of her voice seeing you're half your normal size and looking more like an eight year old, than the sixteen year old you really are.<br>\r\n<br>\r\n\"No\" you say, realizing that you're turning back into a little kid again for some reason. Bella screams. \"Your hair! Luke, you're turning into a girl!\" You spin around and cut a glimpse of your hair. Its still your dark brown, but now past your shoulders. You open your mouth to protest, but in your heart, you know that Bella is right. Somehow you're turning into a little girl. A pain in your stomach comfirms it. Within minutes, you've completely changed into a five year old girl, wearing, or surrounded by, oversized teen boys' clothes.<br>\r\n<br>\r\nMom and Bella are too stunned to do anything..</span></div></div>",
            "created":1292389200,
            "id":1015569,
            "title":"Changing..."
        },
        "1232":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Sorry, Luke.",
                "Let me hold my baby.",
                "Don't you have anything else?"
            ],
            "content":"<div class=\"\"><div> <span>After the initial shock wore off, a small but very mean grin formed onto Bella's face, causing you to sweat. Only mom did not notice it as she turned towards the house. \"I better call Dr. Thompson!\" she said, frantic, before mumbling. \"She is never going to believe this!\" she turned to Bella, who quickly hid her grin. \"Bella...\"<br>\r\n<br>\r\n\"Yes, mom?\"<br>\r\n<br>\r\nMom sighed, not knowing what else to do. \"Take Luke inside and find him, err, her something to wear while I call our family doctor and see if she won't squeeze in a house call.\"<br>\r\n<br>\r\nBella turned to you, her mean grin returned, and half carried, half dragged you into the house, protesting and struggling. \"Let me go!\" you demanded, angrily. \"Don't you dare put me in your clothes!\"<br>\r\n<br>\r\n\"My clothes won't fit you... sis!\" teased Bella, giggling. \"I do, however, have some baby stuff in my room for when I babysit, they should fit you fine.\"<br>\r\n<br>\r\nYou turned pale at that and began to struggle more but your now older sister was too strong and you were dragged into her bedroom with her slamming the door shut, trapping you.<br>\r\n<br>\r\n\"No!\" you screamed, as she yanked off your shirt. \"I won't be your stupid baby!\"<br>\r\n<br>\r\nBella ignored you and pushed you onto her bed before pulling off your pants and socks. Your shoes fell off the moment she started dragging you into the house. \"Bella, please!\" you begged, seeing her strip you of your underwear. \"Can't we make a deal or something?\"<br>\r\n<br>\r\n\"The deal is simple.\" said Bella, picking you up. \"Mom told me to find something for you to wear, this is the only stuff I have that will fit you.\" she then smiled, placing you onto a changing table. \"But she didn't tell me I couldn't have some fun with you while I was at it.\"<br>\r\n<br>\r\n\"You total...!\" You never got to finish the sentence as Bella pushed a large pacifier into your mouth and tied it around your neck to keep it in place before strapping you down, on the changing table.<br>\r\n<br>\r\n\"I don't like the tone of your voice... Lisa.\" said Bella, giggling. \"Now then, let's get your diaper on, shall we?\"<br>\r\n<br>\r\nYour eyes bugged out as Bella then reached into a baby bag and pulled out some baby oil and began to rub it onto you, the smell was not that bad but you were horrified that she was actually treating you like a baby. Next came a bulky plastic diaper. she lifted up your feet and slid it under before grabbing some baby powder and sprinkling it onto your feminine groin and your bottom before placing you down and sealing you inside the diaper.<br>\r\n<br>\r\n\"That's a gooood girl.\" she cooed, still teasing you. \"Big sis is going to now put you in a very pretty dress and brush your hair, yes she is!\"<br>\r\n<br>\r\nYou screamed against the large pacifier but all that came out was a mumble, causing Bella to squeal and giggle in delight as you had been a terror to her lately and she was finally getting some payback. She turned around for a moment then came back with a large pink flowered dress. Seeing it made you feel sick, you knew that she had every intention of making you wear it.<br>\r\n<br>\r\n\"Baby Lisa is going to love her pretty dress, yes she is!\" said Bella. \"After you are all pretty, big sis will show you to mommy and she will see how much better you are, staying this way...\"<br>\r\n<br>\r\nAgain, you screamed but in no avail. Bella freed you from the straps, holding you onto the changing table then forced you into the pink dress before dragging you out to see mom, who was still on the telephone, talking to Dr. Thompson.<br>\r\n<br>\r\n\"That's right, doctor.\" said mom, still shaken. \"He changed right in front of us, will you please come and take a look?\" she listened, as Dr. Thompson replied, then sighed in relief. \"Thank you, doctor. We will be waiting, good bye.\"<br>\r\n<br>\r\nAfter hanging up the telephone, she turned find Bella holding you firm as you sulked. She barely contained her laughter as she saw you in nothing but a pair of diapers and a small pink dress. Seeing her reaction, Bella grinned.<br>\r\n<br>\r\n\"This was all I could find that would fit her, mom.\" she said. \"I had to diaper her up like a real baby or she'd probably end up getting a rash or something.\"<br>\r\n<br>\r\nAlthough concerned by your new condition, Mom giggled slightly, seeing the predicament you were in, while you looked up at her, your eyes begging for help. Finally, mom replied...<br>\r\n  </span></div></div>",
            "created":1292907600,
            "id":1019839,
            "title":"Bella grins meanly, mom doesn't notice"
        },
        "12323":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Of course mom. I'll get Lisa some clothes",
                "I think Lisa will prefer to stay in diapers. Oh yes she would.."
            ],
            "content":"<div class=\"\"><div> <span>\"Don't you have anything else, Bel?\" mom chuckles, as she moves to a window. A car stops outside, and the figure of the doctor, Katie Thompson walks out. She knows magic exists, thanks to her best friend being a witch, but she can't say \"Oh, you son became your young daughter. It must be witchcraft that did it\", unless she wants a trip in front of the misconduct review. Plus, she doesn't really like Luke Adams all that much, especially since her daughter Megan told her about some rumors she heard...<br>\r\n<br>\r\n\"Is this a joke?' Dr Thompson says, looking at the girl dressed as a baby in front of her. \"People don't spontaneously change age and gender, Mrs Adams. All I can say is she is not a teenage boy, and she is a perfectly healthy young girl\" Mom looks at the doctor, wondering why she called her anyway. She curses her impulsiveness, realizing Dr Thompson acted like any sane person would, and is now likely to think she is wasting her time on a practical joke, or worse, crazy. \"While Luke is a pig, he no she, still needs my help. I can't give it to her if I'm locked away.\" <br>\r\n<br>\r\nKatie, seeing Becky's concern, gets a thought, hoping to stir things up. \"Why is she dressed like a baby anyway? I know someon that can potty train her...\"<br>\r\n<br>\r\n\"No, no. That won't be necessary\" mom says, to your relief. \"Sorry for wating your time. Of course, I'll send you your money.\" Once alone, she collaspes into a chair.<br>\r\n<br>\r\n\"We need to get some proper clothes. I'm broke, but Luke has some money stashed away\" mom says. \"Hey!\" you try to say, but the pacifier muffles your voice. Bella looks at you and says</span></div></div>",
            "created":1292907600,
            "id":1019869,
            "title":"Don't you have anything else?"
        },
        "123231":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "ribbon to put your hair into pigtails",
                "scissors, but she intends to give you a girlish styled haircut"
            ],
            "content":"<div class=\"\"><div> <span>\"Of course, mom. I'll get Lisa her new clothes, though she will have to pay for them\" Bella says, trying not to laugh at your misfortune. Before you can protest, not that you can with the pacifier stuck in your mouth, she is out the door. You try not to shiver. While anything is better than being a four year old dressed as an infant, considering what she dressed you as an infant to begin with doesn't give you too much confidence about what she's going to get for you to wear.<br>\r\n<br>\r\nMom looks at you. \"I'm sorry that this is happening to you, Lisa\" she says evenly. You just glare at her, but she is unconcerned. \"While I don't know how to change you back; I'm still trying to understand out <i>how</i> something like this is even possible, I think its best we treat you as the four year old girl you appear. However until your sister gets back, I'm keeping you dressed like that. If you promise to not freak out and <i>behave</i> yourself, I'll remove the pacifier\"<br>\r\n<br>\r\nYou nod, what else can you do? Besides anything is better than being gagged like this. Nod smiles and unties the pacifier. She is pleased that you remain quiet, and not swear and yell like she feared, but you're afraid that she would stick the pacifier back in, or worse.<br>\r\n<br>\r\n\"Sweetie, I've got something to get your hair out of your face\" mom offers, rushing off to her room. You think glumly \"Yeah, a pair of scissors would solve that problem, but no. Mom will get ribbon and lace and that girly crap...\"<br>\r\n<br>\r\nA couple of minutes later she returns with<br>\r\n<br>\r\n</span></div></div>",
            "created":1293598800,
            "id":1025067,
            "title":"Of course mom. I'll get Lisa some clothes"
        },
        "1232311":{
            "author_id":"gregmss",
            "author_name":"Horatio Alp",
            "choices":[
                "A Ballerina costume",
                "A very girly onesie"
            ],
            "content":"<div class=\"\"><div> <span>A couple of minutes later she returns with ribbon to put your hair into pigtails. You try to vent your anger from behind the pacifier, but it is no good. Mom just calmy braids your hair into two pigtails with shiny pink ribbon. <br>\r\n<br>\r\n\"There, now don't you look pretty?\" Mom says, showing you a mirror. You look, and for a 5-year-old girl, you did look pretty, but that's the problem, you aren't a 5-year-old girl. Suddenly, the door opens and Bella bursts in. She takes one look at you and cackles with laughter. \"Wow, glad I got you these new clothes, they'll go perfectly with that hair!\" She guffawed.<br>\r\n<br>\r\nShe opens her shopping bag to reveal...</span></div></div>",
            "created":1372136400,
            "id":1617697,
            "title":"ribbon to put your hair into pigtails"
        },
        "12323111":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "forced into the costume",
                "you start to pout, and act increasingly childlike",
                "at your first ballet"
            ],
            "content":"<div class=\"\"><div> <span>Bella's words made you feel uneasy, but it didn't prepare you for the sight of her producing both a ballerina outfit and ballet slippers. Stunned for a few seconds, you screamed, \"Bella! You bitch. I'm going...\"<br>\r\n<br>\r\nMom cut you off. \"Language, young lady\" she scolded.<br>\r\n<br>\r\n\"But mom. Its a ballet outfit\" you protested.<br>\r\n<br>\r\n\"I can see that. Bella, why did you get your bro.. err sister that?\" mom asked in a dangerous tone.<br>\r\n<br>\r\nYou smirked slightly, hoping that Bella was going to get into trouble. Bella seemed unfazed; she smiled and said, \"Lisa has always been into sports, so I figured if she's stuck like this for any amount of time, she would want to do some actively.\"<br>\r\n<br>\r\n\"I see\" mom said slowly, after a few seconds. She paused for a few seconds as if making a decision, before saying, \"You're right Bella. She has always been a sportsman. Help me get her changed into her new clothes.\"<br>\r\n<br>\r\n\"What?!\" you said in disbelief. No way you wanted to wear the leotard, tights or shoes, and you couldn't believe that mom has taken your devil of a sister's side.</span></div></div>",
            "created":1405486800,
            "id":1828438,
            "title":"A Ballerina costume"
        },
        "123231111":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "continue",
                "the next day",
                "a week later"
            ],
            "content":"<div class=\"\"><div> <span>\"Mom. You're not seriously going to allow <i>her</i> to dress me in that?: you half screamed at your mom, as Bella swiftly rushed up to you and started to remove the flowery dress that she had so eagerly forced you into earlier.<br>\r\n<br>\r\n\"Knock it off. i don't want&gt;.' you whined, but Bella cut you off by whispering into your ear. Her voice was unsettling.<br>\r\n<br>\r\n\"This is only the beginning, <i>Lisa</i>. I'm going to remake you into my perfect little sister\" Bella said mockingly. Horrified, you briefly broke from her grip and faced mom. Even though you knew you never gotten on well with her, surely she wouldn't allow Bella to get away with everything.<br>\r\n<br>\r\n\"Why is Lisa looking like that? What did you tell her?\" mom thundered.<br>\r\n<br>\r\nBefore you could respond, Bella cut in. Lying, she said as she seized you again,  \"I told her that she shouldn't feel bad being undressed. She hasn't got anything I haven't seen before.\" To emphasize the point, she removed the diaper that she had forced you to wear, leaving you completely undressed in front of both her and mom. Instantly, you began to blush.<br>\r\n<br>\r\n\"You better get her dressed then. I would be embarrassed too if I found myself as a five year old. How long do you think if would take?\" mom said, as she moved to the door. <br>\r\n<br>\r\n\"Five minutes\" Bella said as she calmly grabbed the tights and started to slide them up your legs. You didn't resist that part; you preferred the pink tights to the diaper, or seeing the emptiness that was your new crotch. Your cooperation ended the second she reached for the leotard. \"Mom. Bella lied!\" you said, hoping that it would put an end to Bella's reign of terror.<br>\r\n<br>\r\nYou half expected mom to start yelling at your sister, but there was only silence. Bella giggled meanly. \"Too late, Lisa. Mom has gone to arrange your ballet lesson. She believes me, not you\" she mocked.<br>\r\n<br>\r\n\"Let go\" you protested, vainly as she forced you into the leotard. She took a step back to admire her handiwork. You too, took a step back mainly to give her the most hate filled glare you've ever given her. <br>\r\n<br>\r\n\"A pretty little girl like you Lisa shouldn't glare like that. It's unbecoming\" Bella said in her unusual cheerful voice as she picked you up and started to carry you to the car.<br>\r\n</span></div></div>",
            "created":1405918800,
            "id":1831176,
            "title":"forced into the costume"
        },
        "1232311113":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Bella takes you to the mall",
                "Bella forces you to watch some movies"
            ],
            "content":"<div class=\"\"><div> <span>After Bella's ballerina stunt, she backed off, though you suspected it was more out of fear of overstepping than out of concern for your plight. Instead, for the next week, she had to be content in dressing you in tomboyish clothes. Naturally, you thought everything was too girlie and demeaning. For the next five days, she didn't do anything drastic, through on the sixth day since your transformation, you discovered that your fingernails and toenails were painted light pink. It did concern you as you knew that the money that Bella had spent was only a third of what you had.<br>\r\n<br>\r\n\"Mom? Look what Bella has done to me! Get her to back off. I'm not her little sister\" you screamed somewhat desperately. While there was some things that you were starting to get used to, much to your distress, hearing such a girlish whiny voice coming from your mouth wasn't one of them. Mom started at you tiredly; between work, you waking her with nightmares, and trying to discover what had happened to you, she wasn't getting much sleep.<br>\r\n<br>\r\n\"Please don't scream, Lisa. Mommy is tired\" mom said, as she stiffled a yawn. <br>\r\n<br>\r\n\"Mom. I know you're tired, but look at what that bitch did to me\" you said, showing mom your hands.<br>\r\n<br>\r\n\"Sweetie, I had hoped that you and your sister would had started to get along better now....\" mom started.<br>\r\n<br>\r\n\"Mom!\" you whined. She was so far out of it, she couldn't see the obvious.<br>\r\n<br>\r\n\"Mommy needs to get some sleep. Be a good girl for Bella, sweetie\" mom said gently.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1421384400,
            "id":1918930,
            "title":"a week later"
        },
        "12323111131":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Bella is actually nice, having your 'confession' you want to move on",
                "Bella decides to give you a small makeover",
                "Bella decides to complete your wardrobe"
            ],
            "content":"<div class=\"\"><div> <span>\"You're taking me there?! No\" I'm not going!\" you pouted, looking and acting like the five year old girl you appeared to be.<br>\r\n<br>\r\n\"Somebody sounds like they need a nap as well. You've got no say in this matter, little girl\" Bella teased.<br>\r\n<br>\r\n\"Shut up, you psychotic bitch! How would you like to be in my shoes?\" you snapped, pouting even more. \"Least mom is trying to help me. All you're doing is trying to push me further into being your little sister.\"<br>\r\n<br>\r\n\"Why not? You was a jerk as a boy. Think of this as a chance to begin again\" Bella said sweetly. You didn't know she was getting her phone out to record your reaction.<br>\r\n<br>\r\n\"Why would I want to begin again? I'm a little girl\" you said agitated, unaware Bella had just recorded 'I want to begin again'. All you could see was her widening smile. It caused you to pout even more which she gleefully snapped up.<br>\r\n<br>\r\n\"I just want you not to be a bitch\" you said.<br>\r\n<br>\r\n\"I just want you to behave properly\" Bella countered.<br>\r\n<br>\r\n\"Fine. Whatever. If I have to go to the mall with you, least treat me with some respect.\"<br>\r\n<br>\r\n\"Sure thing, sis\" Bella said, tossing your pigtailed hair.<br>\r\n<br>\r\nWhen you arrived at the mall....<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1421730000,
            "id":1920668,
            "title":"Bella takes you to the mall"
        },
        "123231111312":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Cooperate",
                "Refuse, but she forces you ",
                "Bella increases her bribe; she needs you to willingly have your makeover"
            ],
            "content":"<div class=\"\"><div> <span>Bella quickly decided you needed a small makeover, partly for her own amusement, and partly to reenforce the idea you was getting used to the idea of being Lisa, so she headed for a salon. Halfway there, you said in your whiny voice, \"Where are we going?\"<br>\r\n<br>\r\nBella grinned, but not her usual nasty smile. \"I think we need to do more work on your disguise, sis\" she said.<br>\r\n<br>\r\n\"Don't call me that!' you pouted, before adding, \"What? Isn't it enough you've kept this embarrassing hairstyle?\"<br>\r\n<br>\r\n\"You liked seeing them on the cheerleaders, Lisa\" Bella said with a half smile.<br>\r\n<br>\r\n\"That was different. So what are you going to do? More girly clothes?\" you demanded.<br>\r\n<br>\r\n\"If you want, but I was actually going to take you to get a small makeover\" Bella said.<br>\r\n<br>\r\n\"What!? You said you was going to be nice for once. I don't want to do either.\"<br>\r\n<br>\r\n\"It will help you relax. Look at you; you're tense. Besides, girls your age have pierced ears.\"<br>\r\n<br>\r\n\"What happens when I change back?\" you demanded, horrified by the thought of having pierced ears. You wanted to beat up guys like that.<br>\r\n<br>\r\n\"You could be like this for some time, sis. don't be such a drama princess. You're getting your ears pierced whether you want it or not, but if you cooperate, i'll buy you an ice-cream\" Bella said.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1422421200,
            "id":1924760,
            "title":"Bella decides to give you a small makeover"
        },
        "1232312":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "not too girly clothes. She's planning something else for you",
                "ultra girly clothes"
            ],
            "content":"<div class=\"\"><div> <span>You're relieved to see mom return with scissors, but you wouldn't be if you knew her thoughts. \"How could this happen? Maybe its an ironic fate for Luke, after all the mistreatment he's done to women. I can't see him changing back, even if I knew how he changed to begin with. I better start getting 'Lisa' adjusted to her new life as a little girl, starting with a nice haircut that will promote hair growth....\"<br>\r\n<br>\r\n\"Thanks mom\" you say as she orders you to sit down. You sit, and she starts cutting your hair. \"What is going to happen to me?\" you whine, hating the fact your new voice is perfect for whining. Its too... cute.<br>\r\n<br>\r\n\"I don't know, but I can't send you to school. Everyone would think you're another five year old girl\" mom says inbetween cuts. You can't help but smile at the thought of no school, but you don't want to stay like this. \"No school sounds great mom, but knowing my luck, I'd change back just as I'm supposed to leave\" you say, half hoping you change back at anytime.<br>\r\n<br>\r\n\"So do I. I hope you won't be such a jerk\" mom says, causing you to remain quiet. While you want to protest, you remaind yourself that you're stuck as a five year old at the moment and you're not in a particularly powerful position. \"All done\" mom says smiling. You get up and realize she was quick. Too quick. You rush to the mirror.<br>\r\n<br>\r\n\"Mom! You're supposed to give me a haircut!\" you yell. Mom comes to you, grinning. \"I did give you a haircut. A <i>girl's</i> haircut. I said it before, everyone sees you as my little girl, and do you know any little girls that have boyish haircuts?\"<br>\r\n<br>\r\n\"No\" you sulk. Mom goes up to you. \"Hey, I know its hard for you, but it could be worse. I could have tied it in ribbon, and made it all girly. I know you don't want that\" mom soothes.<br>\r\n<br>\r\nAt that moment, Bella returns with a heap of bags. \"Here, a couple of days of clothes for my little sis. How is Lisa going?\" Bella grins. You know from her look she's disappointed you're getting out of hte diaper, but you know she's probably got something bad for you in those bags<br>\r\n</span></div></div>",
            "created":1294290000,
            "id":1030110,
            "title":"A haircut, but not one you want"
        },
        "12323122":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "piecre your ears. All girls have pierced ears, Lisa",
                "put on your makeup before we play tea-party"
            ],
            "content":"<div class=\"\"><div> <span>\"Bella, can you show Lisa how to dress herself since some things are a bit different\" mom asks your sister. You protest, since you know how to dress yourself; you're boy may be that of a five year old girl, but your mind is still the same. Plus you don't trust Bella at all; how else but your sadistic sister would dress you in diapers. She grabs your tiny hand and pulls you to her room, then locks the door.<br>\r\n<br>\r\n\"Nice haircut <i>Lisa</i>\" she grins. \"Will suit these clothes perfectly, once we grow it out a bit\"<br>\r\n<br>\r\n\"Its not going to grow out at all. I don't know how you did this, but I know you somehow turned me into a little girl...\" you snarl. Bella shakes her head. \"Mom and I are just as shocked as you are <i>Lisa</i>, and you know it. However I'm not going to sit and not take <i>advantage</i> of it. If I can't keep you in diapers, this will have to do\" she grins, pulling out a pair of panties. You look at her, but she pins you down, and strips you.<br>\r\n<br>\r\n\"Girls wear panties, Lisa. If you don't want to, I guess I can tell mom that you'd prefer diapers instead\" she grins, as she forcfully pulls the panties up your tiny legs. She then grabs the next item of clothing, white tights. You struggle, but the tights are soon around your legs. Furiously, you glare at Bella, who grabs tanother object, and you cringe at the sight, since it's a pink princess style dress.<br>\r\n<br>\r\n\"No way. We both know...\" you protest, as Bella forces the dress over your head, your arms through the sleves, then ties you in. She smiles as she looks at you. \"Looking much cuter, sis. We'll turn you into a perfect little princess for mom\"<br>\r\n<br>\r\n\"I'm already in your stupid dress. Let me go\" you demand. Bella laughs. \"No, sis. I need to</span></div></div>",
            "created":1295758800,
            "id":1040433,
            "title":"ultra girly clothes for Lisa, mom's new princess"
        },
        "123231221":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You wake up the next morning still as Lisa",
                "you dream of Samantha Forester"
            ],
            "content":"<div class=\"\"><div> <span>\"Pierce you ears. All girls have pierced ears, especally when we enroll you into your new school. You don't want to be the only girl without them, do you? Or when we take you to get your new uniform tomorrow?\"<br>\r\n<br>\r\n\"No get away from me\" you yell, but her increased size makes the difference. She easily grabs you and starts rubbing alcohol onto your ears.<br>\r\n<br>\r\n\"Don't you dare! I'll...\" you say, as a stabbing pain comes from one ear. A few seconds later, you feel an identical pain in the other. You look at Bella, and your own, girlish relection, trying not to sob from the pain and anger you're feeling.<br>\r\n<br>\r\n\"Don't worry. The pain wll go away\" Bella sooths, almost kindly for once. \"You make a pretty pritty young lady, Lisa\"<br>\r\n<br>\r\nYou can't take anymore, and rush over crying to your room, locking the door. You quickly strip off the girlish clothes and lie sobbing on your bed. </span></div></div>",
            "created":1305349200,
            "id":1105568,
            "title":"piecre your ears. All girls have pierced ears ..."
        },
        "1232312211":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Of course sweetie",
                "'mommy' told be to dress you my princess sister"
            ],
            "content":"<div class=\"\"><div> <span>You feel yourself being shaken awake, something that hasn't happened for years. \"Wake up Lis\" Bella says. From the sound of her voice, she is excited. \"Lisa? Wasn't tha a crazy dream?\" you wonder as you open you eyes and see everything is much bigger than it should be. \"What? Get...\" you begin to say, but 'out' never forms. Instead you say \"My voice!\"<br>\r\n<br>\r\n\"Don't tell me you forgotten, Lisa\" Bella grins, throwing the sheets off, to reveal your girly body. You scream. <br>\r\n<br>\r\n\"I haven't. Looks like you're going to get your uniform\" Bella grins, grabbing your hand, and pulling you towards the bathroom. \"I've got everything ready\". Your heart sinks as you see she's got scented water run for your bath, as well as your clothes. You cringe at the golden princess gown ready for you, which looks like she dragged out of her old costumes from when she was a kid.<br>\r\n<br>\r\nYou look at her, and say something you never thought you'd want to say. \"Can I wear something mom brought for me yesterday?\"<br>\r\n<br>\r\nBella responds.</span></div></div>",
            "created":1305608400,
            "id":1107573,
            "title":"You wake up the next morning still as Lisa"
        },
        "1233":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Bella is not impressed with your clothing choice",
                "There is still magic around. The shirt turns into a real dress"
            ],
            "content":"<div class=\"\"><div> <span>\"Luke! How?\" mom says, the most shocked in her life. You're too shocked to respond, but Bella moves over to you, and before you can stop her, she grabs your now flat crotch.<br>\r\n<br>\r\n\"Hey! What are you thinking?\" you say finding your voice, that of a five year old girl. And she thinks you're bad...<br>\r\n<br>\r\n\"Luke has become a girl\" Bella says, a slight grin on her face as she begins to think of that that means.<br>\r\n<br>\r\n\"I don't know how you two did this to me, but you have to change me back!\" you whine, cringing. Your new voice is perfect for whining, and when it isn't, it makes you sound adorable.<br>\r\n<br>\r\n\"We had nothing to do with this\" mom says. \"Bella, take Luke to umm her room. Maybe whatever caused this will wear off. Get her something to wear. Those oversized clothes must be uncomfortable for her.\"<br>\r\n<br>\r\n\"I can find something myself\" you protest. Even though it is uncomfortable, you're certain Bella would pick something that you won't like much. Both mom and Bella ingore you, as she takes you up to your room.<br>\r\n<br>\r\n\"Stay here sis\" Bella grins meanly as she heads to find some clothes for you. \"I always wanted a little sister, and now I have one, I'm going to enjoy it\"<br>\r\n<br>\r\n\"Sounds good\" you say sarcastically to yourself, wondering what you've done to deserve this. You decide to search through your old clothes to see if anything remotely fits you. Eventually you find a white shirt. While oversized, it will cover you to your knees, making an improvised dress. Although you don't like it, aybe that will placate Bella enough not to put you into something worse.</span></div></div>",
            "created":1311310800,
            "id":1152466,
            "title":"They take you to your room. Maybe it will wear off"
        },
        "12332":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Bella isn't too freaked by the thought. She completes your princess look",
                "Bella freaks out and agrees to help you"
            ],
            "content":"<div class=\"\"><div> <span>Miles away, Samantha is looking into a ball, seeing your reaction. \"That jerk makes such a cute girl. Better make her even cuter!\" She casts another spell...\"<br>\r\n<br>\r\nYou look at your room, and wonder what has happened to you. People don't suddenly switch genders and lose 10 years. As you look at the door, waiting for Bella to come back, you begin to notice your shirt is looking different. Almost like...<br>\r\n<br>\r\n\"What is happening to me!?!\" you freak as the shirt takes on a pinkish hue. The sleeves begin to puff out, before pinching back to emphase the sleeves. Likewise the shirt is collasping around your waist. \"No! Not a dress\" you moan, as you see it finish its transformation into a pink princess dress. <br>\r\n<br>\r\nAs you get up in terror, Bella comes back, a big grin on her face, imagining how she is going to dress you with the girly clothes she is carrying. She looks at you and smiles. \"You make a pretty little sister, Luke-y.\"<br>\r\n<br>\r\n\"Cut that out\" you whine. \"What if whatever did this to me turns you into a little kid?\"</span></div></div>",
            "created":1319000400,
            "id":1209414,
            "title":"Magic in the air"
        },
        "125":{
            "choices":[
                "your mom? (35)",
                "your sister? (14)",
                "someone else?"
            ],
            "content":"<div class=\"\"><div> <span>Since your such a little shit head son, I'm going to let you start life again and maybe it will help, don't worry you won't loose any off your memorys and you'll still be you just a girl you sort off.<br>\r\n<br>\r\nSo who's womb do you want to go into, what? And what do you mean sort off as your laughing, well if you say go into your sister's womb both your DNA will mix so it would be as if you and her had a baby together.<br>\r\n<br>\r\nSo who will it be?</span></div></div>",
            "created":1402981200,
            "id":1813511,
            "title":"nothing happens to you... yet"
        },
        "1251":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "freak out",
                "something else",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>“But Mom please don’t do this…” you beg her.<br>\r\n“Fine, but I only will skip the part with going to the womb; I just make you a girl…<br>\r\nAnd without further words or any warning, your hair lengthens from your normal short cut, to about three inches past your shoulders.<br>\r\n\"Please mom no!?\" you say, becoming now scared as you realize that your mother indeed has some strange power to do such things, which normally should not be possible at all. But the fact that you got long hair now from out of nothing confirms that it is possible!<br>\r\nStill scared in and shock you look in the mirror, wondering what else besides your hair has changed!<br>\r\nThe hair is the least of your worries, as you suddenly feel your chest begin to itch. \"This can’t be happening to me?\" you say, as your chest begins to push outwards.<br>\r\nWith now a female voice you realized. \"Oh my God! I have indeed turning into a girl!\"<br>\r\nA part of you wanted to deny it, but the evidence was clear, as you now had b cup breasts. Panicked, you turned to mom…<br>\r\n</span></div></div>",
            "created":1421902800,
            "id":1921295,
            "title":"your mom? (35)"
        },
        "12511":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>\"Mom?\" you pleaded, hoping for her mercy to undo what she has done…<br>\r\nYou didn't expect it; she was such a bitch!<br>\r\nBut she showed no mercy at all leaving you with the long hair and the changed voice and also the very visible and present breasts…<br>\r\nMeanwhile also your lower body started to shift: Your hips push outwards, which is painful and also your ass reshaped to a more feminine butt…<br>\r\nTears are rolling down your checks as you feel your manhood fading away….<br>\r\nA reshape of your legs completed the gender transformation and you are a full girl now…<br>\r\n</span></div></div>",
            "created":1421902800,
            "id":1921296,
            "title":"freak out"
        },
        "125111":{
            "choices":[
                "Lingerie, nightwear and swimwear shopping first? ",
                "Tomboy clothes first"
            ],
            "content":"<div class=\"\"><div> <span>Bitch no, please change me back, look young lady any more words like to out of your month I'll change you from a 16 year old girl into a 16 day old girl and you'll realize your mistake when you have to start growing up again.<br>\r\n<br>\r\nyou couldn't do that your to old to have a baby and you'v been sterilized to, you mother smiles to you, what you think since i changed you i can't change myself say into a teenage mother and have you as my baby daughter.<br>\r\n<br>\r\nOK mum i believe you please don't change me into a baby, i don't like the thought of wearing nappies or drinking out of a bottle, a bottle? what are you on about i would breastfeed you it's healthier for babies or maybe i could just have sex with the next male a see and you could go into my womb like i originally planed.<br>\r\n<br>\r\nPlease don't, OK Luke but i don't want to hear any language like that again directed at me, now young lady we have to go and get you a new wardrobe, new school uniform and new underwear and nightwear.<br>\r\n<br>\r\nBut can't you just do it by magic? i could but, i won't as i changed you as punishment and it will be nice to go shopping as mother and daughter, come on let's go.<br>\r\n<br>\r\ni expect you will want to be a tomboy? Yes, OK darling that's fine by me but i would like you to wear feminine lingerie under your tomboy jeans and tops and feminine nightwear and feminine swimwear as well.<br>\r\n<br>\r\ndo i have to? it ether that or you wear dresses and skirts, ok fine I'll wear feminine lingerie under the jeans and other clothes, i'm not not happy about it but i'll do it, good you never know you might like it, don't bet on it.<br>\r\n<br>\r\nMum? yes Luke, well I'm a teenage girl now what do i say at school about the change, well you are still you and your just a female version of yourself, say you went to hospital for minor surgery and they made a mistake and gave you a full body sex change by accident, how do i explain i have a womb now? just say they gave you a experimental womb transplant to make you into a full teenage girl. <br>\r\n<br>\r\nboth of you arrived in town and started shopping where did you go first?</span></div></div>",
            "created":1421902800,
            "id":1921299,
            "title":"continue"
        },
        "1251111":{
            "choices":[
                "Go for a coffee first before we finish the shopping?",
                "Just get the the shopping over with plain jeans, tops and vest?"
            ],
            "content":"<div class=\"\"><div> <span>Right Luke Lets see where shall we start,<br>\r\n<br>\r\nSchool<br>\r\n5 of these <a rel=\"nofollow\" href=\"http://www.comparestoreprices.co.uk/images/po/pour-moi-aura-thong-by-pour-moi.jpg\" target=\"_blank\">http://www.comparestoreprices.co.uk/imag...</a><br>\r\nOne black bikini <a rel=\"nofollow\" href=\"http://site.elitefashionswimwear.com/designer-swimwear/2012-swimwear/caffe/VB1214-BLACK.jpg\" target=\"_blank\">http://site.elitefashionswimwear.com/des...</a><br>\r\n<br>\r\nKnickers and bra sets<br>\r\n<a rel=\"nofollow\" href=\"http://i.dailymail.co.uk/i/pix/2013/01/23/article-2266507-171CF1FF000005DC-770_308x425.jpg\" target=\"_blank\">http://i.dailymail.co.uk/i/pix/2013/01/2...</a><br>\r\n<a rel=\"nofollow\" href=\"http://blog.miodestino.com/wp-content/uploads/2013/04/4084__3.jpg\" target=\"_blank\">http://blog.miodestino.com/wp-content/up...</a><br>\r\n<a rel=\"nofollow\" href=\"http://blog.miodestino.com/wp-content/uploads/2013/04/4075__3.jpg\" target=\"_blank\">http://blog.miodestino.com/wp-content/up...</a><br>\r\n<a rel=\"nofollow\" href=\"http://www.comparestoreprices.co.uk/images/fr/frankly-darling-studio-54-blue-retro-brazilian-knicker-by-frankly-darling-exclusive-.jpg\" target=\"_blank\">http://www.comparestoreprices.co.uk/imag...</a><br>\r\n<a rel=\"nofollow\" href=\"http://ecx.images-amazon.com/images/I/418e9x3wzwL._SY445_.jpg\" target=\"_blank\">http://ecx.images-amazon.com/images/I/41...</a><br>\r\n<br>\r\nnow that's done lets start on the nightwear for you shall we Luke <br>\r\n<a rel=\"nofollow\" href=\"http://www.stylishboard.com/wp-content/uploads/2013/08/nighty7.jpg\" target=\"_blank\">http://www.stylishboard.com/wp-content/u...</a><br>\r\n<a rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/736x/1f/da/13/1fda13a92436a77d1452810b1b6b1dc8.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/736...</a><br>\r\n<a rel=\"nofollow\" href=\"http://i01.i.aliimg.com/wsphoto/v0/1855596071/cute-girls-transparent-Sexy-nylon-lace-nightwear-font-b-silky-b-font-and-elegant-purple-sexy.jpg\" target=\"_blank\">http://i01.i.aliimg.com/wsphoto/v0/18555...</a><br>\r\n<a rel=\"nofollow\" href=\"http://www.comparestoreprices.co.uk/images/po/pour-moi-aura-thong-by-pour-moi.jpg\" target=\"_blank\">http://www.comparestoreprices.co.uk/imag...</a><br>\r\n2 of these <a rel=\"nofollow\" href=\"http://site.elitefashionswimwear.com/designer-swimwear/2012-swimwear/caffe/VB1214-BLACK.jpg\" target=\"_blank\">http://site.elitefashionswimwear.com/des...</a><br>\r\n<br>\r\nNow that is done Luke you can get some tomboy clothes to cover up this very nice lingerie, although i don't know why you would want to though, But Luke what would you like to do first?<br>\r\n<br>\r\n</span></div></div>",
            "created":1421902800,
            "id":1921305,
            "title":"Lingerie, nightwear and swimwear shopping first? "
        },
        "12511111":{
            "choices":[
                "My tomboy clothes shopping first?",
                "Let just get it out the way with and buy the girly school uniform?"
            ],
            "content":"<div class=\"\"><div> <span>You go for a coffee still not happy that you will have to wear girly underwear, you looked though the bags and realized that your mum had picked up two bikinis and put them in the nightwear bag, you looked at her and said mum do you realize that i have three bikinis now, What no you don't i only got one, she looked well i guess you have three now darling but give me one second please.<br>\r\n<br>\r\nshe got up and went into the lingerie shop and got you 2 packs of <a rel=\"nofollow\" href=\"http://3.bp.blogspot.com/-3dorn9OdfZc/TrsdlN6GPCI/AAAAAAAAHnM/Tmsf24Y1Rn4/s1600/Screen+shot+2011-11-09+at+7.38.29+PM.png\" target=\"_blank\">http://3.bp.blogspot.com/-3dorn9OdfZc/Tr...</a> here we are look this is what i meant to get you.<br>\r\n<br>\r\nthey sat and chatted about things and then your mother said to you something that you didn't want to hear, Luke i have just realized, realized what? that the school uniform well you can't dress as a tomboy at school, what do you mean mum? well the girls uniform is a skirt, blouse, blazer, stockings and flat shoes or a dress, blazer, stockings and flat shoes, high heels are not aloud, well that good cause i wouldn't wear high heels anyway.<br>\r\n<br>\r\nWell is there anything we can do about that? not really Luke, how about you turn me back into a teenage boy? how about i turn you into a new born baby, OK point taken mum.<br>\r\n<br>\r\nWell want are we going to do mum? I'll just get both then that way you can choose weather you want to wear a skirt or dress to school Luke, well i guess but I'm not happy about it mum, i know but there is nothing we can do about it that's the school uniform and that's it.<br>\r\n<br>\r\nTell you what I'll let you choose what we are going to do next your shopping or school uniform shopping<br>\r\n<br>\r\n</span></div></div>",
            "created":1421902800,
            "id":1921311,
            "title":"Go for a coffee first before we finish the shop..."
        },
        "125111112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "sizing needs to be done",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Luke’s school had a contract with a special shop, which was located downtown, not in the mall.<br>\r\nSo changed Luke and his mom drive there. For getting the clothes you have to present you school ID card, where it says “male”.<br>\r\nThe sales lady from the shop looked at you seeing nothing else as a girl and wonders: ”I think they mixed it up again while creating the card, one moment I will bring you the basic wardrobe for girls…”<br>\r\n</span></div></div>",
            "created":1421989200,
            "id":1921782,
            "title":"Let just get it out the way with and buy the gi..."
        },
        "1251111121":{
            "choices":[
                "Find the things now?",
                "Go somewhere else?"
            ],
            "content":"<div class=\"\"><div> <span>She take you into a changing cubicle and measured you up for the clothes, then she hand you mother a list off what clothes and uniform you need for the school.<br>\r\n<br>\r\nList: Everything should have the school emblem on them<br>\r\nUniform<br>\r\nSkirt<br>\r\nDress<br>\r\nBlouse<br>\r\nTie<br>\r\nBlack or White stockings<br>\r\nBlack or White garter belt<br>\r\nBlack or White Plain Knickers <br>\r\nBlack or white Plain Bra<br>\r\n<br>\r\nSports<br>\r\nTwo piece Bikini<br>\r\nOne piece swimsuit<br>\r\nOne Leotard<br>\r\n<br>\r\nthere seems to be alot?</span></div></div>",
            "created":1421989200,
            "id":1921798,
            "title":"sizing needs to be done"
        },
        "12511111211":{
            "choices":[
                "Lucy's in your room getting you uniform ready for school?",
                "Lucy's cooking you some breakfast before school?"
            ],
            "content":"<div class=\"\"><div> <span>But i already have some underwear and bra's for school, the sale's assistant looked at me and my dad and said well young lady, that made shiver go down my back, You know it's new and your school has just bought it in so everyone is wearing the same.<br>\r\n<br>\r\nshe look at the list she gave your dad and said it looks like i gave the old one your school has changed the list twice in two weeks, so she gave your dad the new list and wrote new next to the new peices of uniform that the school expect you to wear.<br>\r\n<br>\r\nList: Everything should have the school emblem on them<br>\r\n<br>\r\nUniform<br>\r\nBlack and White Checked Skirt<br>\r\nBlack and White Checked Dress<br>\r\nBlouse<br>\r\nTie<br>\r\n(New) Black or White stockings <br>\r\n(New) Black or White Tights<br>\r\n(New) Black or White garter belt<br>\r\n(New) Black or White Plain Knickers <br>\r\n(New) Black or white Plain Bra<br>\r\n<br>\r\nSports<br>\r\nTwo Piece Bikini<br>\r\nOne Piece swimsuit<br>\r\nOne Leotard<br>\r\n(New) Two Spaghetti Strap Full Length Bra Top underwired<br>\r\n(New) Two Pairs of Shorts<br>\r\n(New) Two Sports Bras<br>\r\n<br>\r\nRight Luke come on let get your school uniform, You just sat there as your dad was chatting with the sales assistant <a rel=\"nofollow\" href=\"http://www.siue.edu/news/img/MLKTrejo09.jpg\" target=\"_blank\">http://www.siue.edu/news/img/MLKTrejo09....</a> you over heard her say that she is 19 and at university studying medicine, you just sat there as you dad flirted with this girl and she was reciprocating the subliminal messages.<br>\r\n<br>\r\nYour dad is in has 40's so what was he doing with this girl, after an hour your dad and the girl came to you and she introduced herself to you as Lucy and smiled, she appeared to be very nice, young but nice.<br>\r\n<br>\r\nyou and your dad left the store and went home after buying everything you needed for school and casual clothes for outside school, your dad appeared to be in a good mood now and let you buy lots of tomboy clothes for yourself.<br>\r\n<br>\r\nWhen you arrived home you went to your room and put everything away and then went to bed, your dad is going out tonight with a friend and woundn't be back till late, so you went to bed as you where tired from all the walking you did today.<br>\r\n<br>\r\nYour woke up at about 2am to hear a women moaning and screaming in pleasure in your dads room as she climaxed and orgasmed you soddenly hear you dad moan Lucy's name, no way your dad has hooked up with that 19 year old girl he met in the clothes store, ou think i guess my dad deserves to be happy even with someone that young so you decide if anything happens between them two, you'll try to be nice to her.<br>\r\n<br>\r\nYou fell back to sleep smiling and woke the next morning?<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1422075600,
            "id":1922409,
            "title":"Find the things now?"
        },
        "125111112111":{
            "choices":[
                "Lucy picked you up and told you she was moving in?",
                "Went to Lucy's work to talk to her to tell her the truth about yourself?"
            ],
            "content":"<div class=\"\"><div> <span>Your half asleep and then remember what your dad told you last night before going on the date, that him and your mother had split up and that's why he took over from your mother taking you shopping and she has taken your sister with her.<br>\r\n<br>\r\nyou had known that your parents had not been getting on and in the past six months and she just up and left you and your dad, your dad knows what had happened to you and that was the final strew that she changed his son into a girl.<br>\r\n<br>\r\nyou where glad to see the back of her although you think that it may not be possible to changed back now but hopefully you can some how find out how to at some point.<br>\r\n<br>\r\nLucy got your uniform out and then left your room, you didn't believe him about your mum till you sore Lucy in your room, you got up and got dressed Lucy came back and sore you struggling with a bra, Would like some help darling? you went beetroot red, don't worry darling she took the bra put your arms though it and fastened it for you at the back.<br>\r\n<br>\r\nYour father told me the your mother never let you wear proper bra's, a 14 year old girl needs proper support for her breast, Thank you Lucy, No problem darling, she left and than realized what she said.<br>\r\n<br>\r\nhang on 14 I'm 16 not 14 after getting dressed you left your room and sore your dad, dad why did you tell Lucy I'm 14? Well son before your mother left she regressed your age and now your 14 not 16.<br>\r\n<br>\r\nYou went downstairs and sore Lucy, she turned around and sore you, Darling you look very nice? yeah but i don't like skirts or dresses, OK darling guess that means your a tomboy? yes, well when you get back from school you can always get changed in to something more comfy, yeah i guess so.<br>\r\n<br>\r\nYou went to school and kept your head down it went slow but you finished it with no trouble, you went outside and? <br>\r\n<br>\r\n</span></div></div>",
            "created":1422075600,
            "id":1922424,
            "title":"Lucy's in your room getting you uniform rea..."
        },
        "1251111121112":{
            "choices":[
                "you tell her everything and she believes that you where a boy?",
                "say something else and wait for a better time to tell her the truth?"
            ],
            "content":"<div class=\"\"><div> <span>You wonder to the clothes store where Lucy works and wonder around and you see her at the till, she smiles and see's you there, hi Louise how are you and how was school? school was OK a guess and I'm fine thank you, good to hear that darling.<br>\r\n<br>\r\nnow about what i said about you getting out of those cloths and you putting on clothes that you would find comfier, your just stood there in your own world and just said what about it Lucy, well i have something for you, what? <a rel=\"nofollow\" href=\"http://www.fashionmazia.com/wp-content/uploads/2014/02/skinny-jeans-for-women-latest-jeans-fashion-for-women-3.jpg,\" target=\"_blank\">http://www.fashionmazia.com/wp-content/u...</a> <a rel=\"nofollow\" href=\"http://images.esellerpro.com/2477/I/386/663/FVEST-V1-BLACK-01.JPG,\" target=\"_blank\">http://images.esellerpro.com/2477/I/386/...</a> <a rel=\"nofollow\" href=\"http://cdn1.picvpicimg.com/pics/5934196/chantelle-haussmann-t-shirt-bra-panty-black.jpg\" target=\"_blank\">http://cdn1.picvpicimg.com/pics/5934196/...</a> and <a rel=\"nofollow\" href=\"http://www.adidasukvipstores.co.uk/images/adidas-VS9Y8QFY.jpg.\" target=\"_blank\">http://www.adidasukvipstores.co.uk/image...</a><br>\r\n<br>\r\nYou look and said thank you, Lucy smiled at you and said now Louise go get that uncomfortable school uniform of and get dressed into something more comfy darling, so you walk into the changing room and take off your uniform and uncomfortable bra and thongs and then put the clothes on that Lucy got for you.<br>\r\n<br>\r\nyou walk out and see Lucy is shouting the shop, wait there a minute Louise and I'll give you a lift home if you want, she turned around and sore you and smiled as she said you look beautiful, you smiled and just nodded and said thank you so do you, that very sweet of you darling thank you to you.<br>\r\n<br>\r\nright we are done now, let go to my car and get you home so both of you walk across you car park and made it to her car, you both got in and Lucy started driving she looked and you and said Louise i know what it's like to be a girl and i also know you have something on your mind other wise you wouldn't of come to where i work, would you? i guess not.<br>\r\n<br>\r\nyou invite her to your house as you have never seen your father this happy for along time, she stops at some traffic light and looks at you, so Louise what has brought this on? well i heard you to last night, what do you mean? well your not quite are you, i guess I'm not but it was enjoyable? as i heard Lucy i think the whole street could hear you.<br>\r\n<br>\r\nwell Louise i think we should stop talking about what me and you father do in the bedroom, but i am surprised you not angry at me? why would i be Lucy my father is smiling again and you did it thank you for that.<br>\r\n<br>\r\nshe then changes the subject and says? so what did you want to talk to me about that you couldn't tell you dad, well Lucy it like this?  </span></div></div>",
            "created":1423544400,
            "id":1931466,
            "title":"Went to Lucy's work to talk to her to tell ..."
        },
        "12512":{
            "author_id":"secretgoat",
            "author_name":"Ralsei",
            "choices":[
                "You freak out",
                "You thank your mom and ask her to change him back"
            ],
            "content":"<div class=\"\"><div> <span>\"Mom?\" you pleaded, hoping for her mercy to undo what she has done…<br>\r\nshe showed mercy at leaving you with the mid length hair and the changed voice and also the very big visible and present F cup breasts…<br>\r\nMeanwhile also Your hips push outwards, which is painful and also your ass reshaped to a more feminine butt…<br>\r\nWhen she stop and apologizes you now had mid length hair huge F cup breasts and very big and feminine butt with hips to match. What was your reaction?<br>\r\n</span></div></div>",
            "created":1584136200,
            "id":2801059,
            "title":"something else"
        },
        "12513":{
            "author_id":"secretgoat",
            "author_name":"Ralsei",
            "choices":[
                "Yells at his mom",
                "Cry "
            ],
            "content":"<div class=\"\"><div> <span>\"Mom?\" you pleaded, hoping for her mercy to undo what she has done…<br>\r\n she showed mercy leaving you with the mis length hair and the changed voice and also the very big visible and present F breasts<br>\r\n<br>\r\nTears are rolling down your checks as you feel your manhood fading away…. And is replaced by with your new vagina with reproductive system to match.<br>\r\n<br>\r\nSo now you had mid length hair and huge F breasts and I fully functioning vagina. What is his reaction?</span></div></div>",
            "created":1584136440,
            "id":2801061,
            "title":"something else"
        },
        "1252":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "details",
                "you are interupted",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>“But Lucy please don’t do this…” you beg her.<br>\r\n“Fine, but I only will skip the part with going to the womb; I just make you a girl…<br>\r\nAnd without further words or any warning, your hair lengthens from your normal short cut, to about three inches past your shoulders.<br>\r\n\"Please Lucy no!?\" you say, becoming now scared as you realize that your sister indeed has some strange power to do such things, which normally should not be possible at all. But the fact that you got long hair now from out of nothing confirms that it is possible!<br>\r\nStill scared in and shock you look in the mirror, wondering what else besides your hair has changed!<br>\r\nThe hair is the least of your worries, as you suddenly feel your chest begin to itch. \"This can’t be happening to me?\" you say, as your chest begins to push outwards.<br>\r\nWith now a female voice you realized. \"Oh my God! I have indeed turning into a girl!\"<br>\r\nA part of you wanted to deny it, but the evidence was clear, as you now had b cup breasts. Panicked, you turned to Lucy again, hoping for her mercy to undo what she has done…<br>\r\nYou didn't expect it; she was such a bitch!<br>\r\nBut she showed no mercy at all leaving you with the long hair and the changed voice and also the very visible and present breasts…<br>\r\nMeanwhile also your lower body started to shift: Your hips push outwards, which is painful and also your ass reshaped to a more feminine butt…<br>\r\nTears are rolling down your checks as you feel your manhood fading away….<br>\r\nA reshape of your legs completed the gender transformation and you are a full girl now…<br>\r\nStill, again and even more angry, you shout at her:<br>\r\n“Bitch, now change me back!”<br>\r\nLucy:” Look, young lady, if more words like that will come out of your month I'll change you from a 16 year old girl into a 16 day old girl and you'll realize your mistake when you have to start growing up again!”<br>\r\nYou start to get frightened and shiver about the way she pronounced and emphasized “Day”: You certainly don’t want that, at least you need to keep your age!<br>\r\nSo you answer: “OK, Lucy. Please don't change me into a baby; i don't like the thought of this! I promise to be more polite from now on!”<br>\r\nShe seems to accept: “OK Luke but i don't want to hear any language like that again directed at me, now young lady we have to go and get you a new wardrobe, new school uniform and new underwear and nightwear.”<br>\r\nYou again shiver by the thought about this and ask her, if she could just do it by magic?<br>\r\nLucy: ”Ii could but, i won't as i changed you as punishment and it will be nice to go shopping as sisters, come on let's go.” She drags you out to the mall.<br>\r\nOn the way she said: “i expect you will want to be a tomboy?”<br>\r\n“Yes” you answer staying 100% behind this<br>\r\n“OK darling that's fine by me but i would like you to wear feminine lingerie under your tomboy jeans and tops and feminine nightwear and feminine swimwear as well.”<br>\r\nYou try to get out of this: “do i have to?”<br>\r\nBut your sister gives you some options: “Either that or you wear dresses and skirts!”<br>\r\nYou give in: “ok fine I'll wear feminine lingerie under the jeans and other clothes, I’m not happy about it but I’ll do it!”<br>\r\n<br>\r\n</span></div></div>",
            "created":1422507600,
            "id":1924932,
            "title":"your sister? (14)"
        },
        "12521":{
            "choices":[
                "might as well stay here?",
                "Go somewhere else?"
            ],
            "content":"<div class=\"\"><div> <span>Right Luke where do we start, we can leave you school uniform for last and get you other wardrobe first, \"OK fine, what ever Lucy\" Right lets see Lucy looks around and see's a Victoria Secret store.<br>\r\n<br>\r\nRight let start there then Luke, you both walked in and hour and hour later come out with?<br>\r\n<br>\r\nright you need:<br>\r\n<br>\r\nBra's and general underwear<br>\r\n<a rel=\"nofollow\" href=\"http://static.my.groupon-content.net/61/53/1380080625361.jpg\" target=\"_blank\">http://static.my.groupon-content.net/61/...</a><br>\r\n<a rel=\"nofollow\" href=\"http://www.nighty4u.com/wp-content/uploads/2015/04/2014414945174687073.jpg\" target=\"_blank\">http://www.nighty4u.com/wp-content/uploa...</a><br>\r\n<br>\r\nnext sleep/nightwear<br>\r\n<a rel=\"nofollow\" href=\"http://www.polyvore.com/cgi/img-thing?.out=jpg&amp;size=l&amp;tid=55079924\" target=\"_blank\">http://www.polyvore.com/cgi/img-thing?.o...</a><br>\r\n<a rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/236x/98/80/68/9880684147e4f20c3cff55578f7e1a77.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/236...</a><br>\r\n<a rel=\"nofollow\" href=\"http://www.fav.com/images/206_org.jpg\" target=\"_blank\">http://www.fav.com/images/206_org.jpg</a><br>\r\n<a rel=\"nofollow\" href=\"http://www.viecouture.com/wp-content/uploads/2009/03/vspink-wovennightie.jpg\" target=\"_blank\">http://www.viecouture.com/wp-content/upl...</a><br>\r\n<br>\r\nnow that's done swimwear<br>\r\n<a rel=\"nofollow\" href=\"https://s-media-cache-ak0.pinimg.com/236x/22/6b/70/226b707d40987607ce4f8a135e03f5ea.jpg\" target=\"_blank\">https://s-media-cache-ak0.pinimg.com/236...</a><br>\r\n<a rel=\"nofollow\" href=\"https://cdna.lystit.com/photos/2013/10/08/victorias-secret-white-harlow-tankini-product-1-13919503-306261806.jpeg\" target=\"_blank\">https://cdna.lystit.com/photos/2013/10/0...</a><br>\r\n<br>\r\nand last of all just in case<br>\r\n<a rel=\"nofollow\" href=\"https://dm.victoriassecret.com/product/224x299/V565496.jpg\" target=\"_blank\">https://dm.victoriassecret.com/product/2...</a><br>\r\n<a rel=\"nofollow\" href=\"https://dm.victoriassecret.com/product/224x299/V279085.jpg\" target=\"_blank\">https://dm.victoriassecret.com/product/2...</a><br>\r\n<br>\r\nRight that's done now Luke, perfect for a 16 year old girl, what do you want to do now regarding your tomboy clothing stay here or go somewhere else, you think, come on Luke hurry up we don't have all day.<br>\r\n<br>\r\nWhat's have you decided?<br>\r\n</span></div></div>",
            "created":1448427600,
            "id":2066757,
            "title":"details"
        },
        "13":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "You pick up something else from Samantha",
                "That woman creeps you out, you're heading to the mall",
                "You don't bother getting Rachel a present",
                "You get a call from someone"
            ],
            "content":"<div class=\"\"><div> <span>\"You decide that Rachel's house is better. You're tired of Britney demanding all your time. If you wanted that, you're break up with Rachel\" You call Britney and say that you're feeling tired and heading home. She says annoyed, but you don't care. As you swing around, you past the garage sale again. \"I suppose I should get something for Rachel\" you think, noticing that Hayley chick is gone. \"She must have brought something\" you mutter</span></div></div>",
            "created":1294376400,
            "id":1030682,
            "title":"You go to Rachel's house"
        },
        "131":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "rings",
                "other jewellery",
                "clothes"
            ],
            "content":"<div class=\"\"><div> <span>Samantha grins as she spots your car. \"That jerk must be wanting punishing. Lets grant <i>her</i> wish. Hopefully I can make someone very happy\" she giggles as you get out of the car. \"Hello young man. Though of picking something else?\" she says plesantly.<br>\r\n<br>\r\n\"Yes I'd like something extra special for my girlfriend, a necklace is a bit small\" you say grinning. \"Not that you need to know its for my other girlfriend\" you think.<br>\r\n<br>\r\nSamantha grins even more. \"What a <i>nice</i> young man you are\" she says. You're slightly distrubed that she emphesises nice, but you know she can't know. Besides even if she did, its none of her business anyway. \"Screw the old hag\" you think, even though Samantha is in her thirties. She grins, as she pulls out more things. Jewellery including rings, earings and more necklaces, even some clothes that look new. A prom gown catches your eye, and you imagine Rachel in it (all with several other girls)\", though the other clothes are just as tempting, for some reason. You smile and ask if you can see the</span></div></div>",
            "created":1294376400,
            "id":1030689,
            "title":"You pick up something else from Samantha"
        },
        "1311":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "you have the desire to put on the ring",
                "You decide to go home",
                "drive to Rachel's, and her her the ring"
            ],
            "content":"<div class=\"\"><div> <span>You spot a ring, and its the most beautiful ring you've seen. It has a diamond center, with smaller diamonds set around it. The band is definately gold. You look at it mesmerized by it, not bothering to think that its not something you can give to Rachel, since its either an engagement or wedding ring. \"How much?\" you ask, before realizing that you can't possibly afford it. It must be at least two thousand dollars.<br>\r\n<br>\r\n\"Eighty dollars\" Samantha smiles. You look at her stunned; she must be going through a rough time finanically if she is virtually giving it anyway. You quickly pay her, and jump into your car before she can change her mind. Samantha smiles even more than the first time as you drive into the distance, humming a wedding tune\"<br>\r\n<br>\r\nMeanwhile you </span></div></div>",
            "created":1294376400,
            "id":1030693,
            "title":"ring from Samantha means wedding time"
        },
        "13111":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "The effects of the ring are quick",
                "The effects are delayed"
            ],
            "content":"<div class=\"\"><div> <span>You're almost to Rachel's house, when you hear a bang. <br>\r\n<br>\r\n\"Shit\" you mutter, knowing you have a flat. As you get out, you have the desire to put on the ring. \"Don't be stupid, Luke\" you say to yourself, as you grab your spare and get to work, though you put the ring in your other pocket. As you're almost finished, you hear a voice. \"Do you want to try on the ring? Will you marry me?\"<br>\r\n<br>\r\nHuh? You look around, and you spot nobody. \"I must be going crazy. Still, it is expensive. Maybe I want ot keep it safe\" you think, as you get up. The ring falls out of your pocket, and you see it lying on the ground. You lean down to pick it up, only for you to put it onto your ring finger. Unknown to you, the magic begins its work, as your finger starts to slim and the nail lengthens<br>\r\n<br>\r\n</span></div></div>",
            "created":1294376400,
            "id":1030702,
            "title":"you have the desire to put on the ring"
        },
        "131111":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "the wedding",
                "Samantha gets a visitor"
            ],
            "content":"<div class=\"\"><div> <span>Looking down, you see the ring on your finger. \"It looks good with the ring on it. It suits me\" you say, as the fingernail changes showing pink nail polish. You're eyes boogle with shock. What!?! How is this possible? You watch as your other nails on your hand begin to lengthen as well. Within a minute, you're got all nails at past your tips and covered with pink polish. You're too  stunned to do anything.<br>\r\n<br>\r\n\"OMG\" you moan as something white starts to form above your fingers. It quickly wraps around your hand, then up your wrist.  This pulls you out of your shock. Somehow you're becoming a girl. \"How can something like this happen?\" you wonder, seeing that the white thing, or glove is half way up your forearm. You wonder if pulling hte ring off will help, or just change your other arm. As you move your other arm to remove the ring, you glance down at your leg. Something white is crawling up it. <br>\r\n<br>\r\n\"No\" you moan as you see the white thing is a wedding gown. It already past your groin, and you see that your clothes are beginning to disappear as the gown moves closer. Within minutes, it completely moved over your other leg, and is starting to creep up your waist. \"Do something, Luke\" you say to yourself, but your body is unresponsive. You know the gown is changing your body, as you feel your legs and waist slim, hips and rear flare out, and something is twisting in your gut. A glance at your arms tells you that the glove has grown to a few inches short of your shoulder on the ring arm, and is just short of your elbow on the other. You don't realize that your hair has grown almost to your shoudlers<br>\r\n<br>\r\n\"This gown is gorgeous, just like my ring. no, its getting harder to think\" you say, realizing that the changes aren't restricted to your body. Terrified you try to push the gown down, but you find yourself pulling it up further, the top having split into two, sits over your flat chest. The strapless gown, now in its final position starts to do its work, as two mounds begin to inflate. The rest of your body fills into feminine proportions, as your breasts finish growing to a c cup, causing a smile to form as you look at your breasts partly covered by your gown. Another, conflicting thought snaps you out of it. \"I have to get this ring off!\" you think as your mind begins to fill with feminine thoughts. \"No, I'm a man\" you repeat, but each time you do, it sounds less convincing. Now dominated by your new fewminie self, you grin and say \"OMG. Yes I'l marry you\"</span></div></div>",
            "created":1294376400,
            "id":1030724,
            "title":"Here comes the bride..."
        },
        "1311112":{
            "author_id":"runner1240",
            "author_name":"Runner",
            "choices":[
                "Sam grins, \"got to get them in love, but how? Magic won't do it...\"",
                "unravelling weddings "
            ],
            "content":"<div class=\"\"><div> <span>\"Forester! Oen this door NOW\" a voice yells.<br>\r\n<br>\r\nSamantha hesitantly opens the door, to see head witch Elvira looking extremely annoyed. \"What's your explaination for this\" she demands, showing a photo of you (as your new self, complete with bridal gown) and a guy wearing casual clothes. \"You have to stop turning any guy you see into women!\"<br>\r\n<br>\r\n\"Its that Adams boy. He is a complete jerk and...\"<br>\r\n<br>\r\n\"a womanizer and pig\" Elvira adds. \"What happens when the spell on that ring wearing off in a day or two? I don't want to deal with your mess. Who is the other boy?\"<br>\r\n<br>\r\n\"Rachel's 18 year old brother. He has been desparately been looking for a girlfriend... See, I don't change every guy I met.\"<br>\r\n<br>\r\n\"You still brainwashed him into marrying a complete stranger, and a stranger that used to be a guy! Fix this\" Elvira says, before storming out<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1309410000,
            "id":1137672,
            "title":"Samantha gets a visitor"
        },
        "13111121":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "things go on from all alone",
                "Elvira interacts!"
            ],
            "content":"<div class=\"\"><div> <span>Sam had no intension at all to undo her spell. This Luke guy, now bride Lucy has received this kind of punishment for sure! Even Elvira confirmed that he is or at least was a womanizer and a pig! So why not having two days of fun. Also Sam will not be the only one having fun, but also the bridegroom, Rachel’s brother, who now finally has a girlfriend and she will become his wife tonight….</span></div></div>",
            "created":1372222800,
            "id":1617909,
            "title":"Sam grins, \"got to get them in love, but ho..."
        },
        "131111212":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "do it",
                "hesitate"
            ],
            "content":"<div class=\"\"><div> <span>Since Sam did not stop this, Elvira had enough.<br>\r\n\"That bitch\" she hissed to Sam…<br>\r\nBut then Elvira also wanted to have a little fun. She thinks: “What happened when the two lover birds, who are just in the chapel to marry, would know about anything? Suddenly Elvira started to realize a new wicked side on her…<br>\r\n</span></div></div>",
            "created":1421643600,
            "id":1919943,
            "title":"Elvira interacts!"
        },
        "13113":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "that very moment something happends",
                "she likes the ring",
                "wrong size"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now you arrived at Rachel’s house finally and you see her cheering as you presented to ring to her.<br>\r\nShe was so happy and put it on her finger…..<br>\r\n</span></div></span></div>",
            "created":1534395600,
            "id":2534462,
            "title":"drive to Rachel's, and her her the ring"
        },
        "15":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "clothes change next",
                "police stops next to you",
                "something else",
                "something else",
                "your phone rings"
            ],
            "content":"<div class=\"\"><div> <span>Unknown to you, Samantha’s magic begins its work, as your fingers starts to slim and the nail lengthens:<br>\r\nYou feel uneasy and stop your car on the side way: Your fingers hurt and looking down, you see also your fingernails changing and getting pink nail polish. You're eyes google with shock. What!?! How is this possible? You're too stunned to do anything.<br>\r\n<br>\r\n\"OMG\" you moan as something started to grow on your chest area:<br>\r\nYou quickly wrap around your hand to your chest and feel the flesh, the female kind of flesh they have on their breasts…<br>\r\nThis pulls you out of your shock. Somehow you're becoming a girl. \"How can something like this happen?\" you wonder, seeing that your arm have lost all the hair you had there one moment before.<br>\r\nYou feel a strange pulling inside your pants as you glance down at your legs. Something has changed there…<br>\r\nAs the pulling has stopped you feel an emptiness between your legs:<br>\r\n\"No\" you moan as you touch yourself between your legs, but not find what should be present there!<br>\r\n\"Do something, Luke\" you say to yourself, but your body is unresponsive. You know your body is changing, as you feel your legs and waist slim, hips and rear flare out, and something is twisting in your gut. <br>\r\nThe rest of your body fills into feminine proportions, as your breasts finish growing to a c cup…<br>\r\n</span></div></div>",
            "created":1421902800,
            "id":1921294,
            "title":"something starts to happen to you"
        },
        "151":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "that very moment something happends",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>And the changes did not stop: Suddenly your band shirt moves around your new c cups, giving you some touches causing your new nipples to get erect: You almost faint from the strange sensations….<br>\r\nBut next moment you feel different, your chest is covered in a bra, wait, what, no way, but it true: Your band shirt became a girly shirt by its own and from out of nowhere a bra appeared on your new female cups to cover them and keep them in a appropriate shape…and position….<br>\r\nNext thing you can feel in your jeans and your boxers, who suddenly become panties and your jeans are now female cut blue jeans….Your sneakers don’t change much but now you wear a woman’s size…..<br>\r\nLess than a minute later you find yourself looking like a perfect girl of 16 in body and clothing…..This can only be a bad dream…..<br>\r\n</span></div></div>",
            "created":1534395600,
            "id":2534466,
            "title":"clothes change next"
        },
        "1511":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Stopped you",
                "Want past you but got a text about a family thing tonight ",
                "Something else happened at that moment "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>All this happened as your driving you realised your height had changed slightly so you adjusted the seat and continued home.<br>\r\n<br>\r\nAl that moment you saw tow flashing lights behind you... they.....</span></div></span></div>",
            "created":1534395600,
            "id":2534488,
            "title":"that very moment something happends"
        },
        "15111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "the papers showed a female id",
                "the papers showed your male id",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And they asked for your driver’s license and the papers. You hand it to the cops becoming nervous….</span></div></span></div>",
            "created":1535950800,
            "id":2542298,
            "title":"Stopped you"
        },
        "151111":{
            "choices":[
                "Lucille how was school",
                "Who the hell are you?"
            ],
            "content":"<div class=\"\"><div> <span>The cop looked at your Identification and then back at you, Well Miss Lucille Elizabeth Adams what were you doing back there? \"your shocked at the name\" sorry officer a friend was sat in the car earlier and he must of changed the seat settings.<br>\r\n<br>\r\nHe smiled and said well this is only a waring this time Lucille \"Please the next time you you have to adjust your seat stop first\" sorry officer i will, right get on your way and we can forget this happened.<br>\r\n<br>\r\nThank you officer.<br>\r\n<br>\r\nYou get home and your mum is there and says...</span></div></div>",
            "created":1535950800,
            "id":2542313,
            "title":"the papers showed a female id"
        },
        "1511111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "it is a girly room",
                "it is almost the same, almost!",
                "it is exactly the same"
            ],
            "content":"<div class=\"\"><div> <span>What? Also mom thinks I am a girl! This can’t be. But then you are reminded about the clothes you wear. And not only the clothes, you are definitely a girl wearing them!<br>\r\nShit you must play the game and find out why all of this happened…<br>\r\nSo you answer your mom, that school was fine and leave to your room….<br>\r\n</span></div></div>",
            "created":1536037200,
            "id":2542611,
            "title":"Lucille how was school"
        },
        "15111113":{
            "choices":[
                "Your mum calling you for tea",
                "Your phone ringing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You walked into your room and its exactly the same the only difference in there are girls clothing and underwear in the corner instead or boys clothing.<br>\r\n<br>\r\nYou sit on your bed and then hear...</span></div></span></div>",
            "created":1536123600,
            "id":2543095,
            "title":"it is exactly the same"
        },
        "151111132":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "Brittney",
                "Rachel",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who is calling you?</span></div></span></div>",
            "created":1536123600,
            "id":2543128,
            "title":"Your phone ringing"
        },
        "1511111321":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "she now is your BFF",
                "she still thinks you are a boy",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A buzz tells you that someone is trying to call you. You pick up the phone, and wish you hadn't. It's Britney.</span></div></span></div>",
            "created":1536123600,
            "id":2543129,
            "title":"Brittney"
        },
        "15111113213":{
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>- Hello Luke or should i call you Lucille now?<br>\r\n- \"What\" you know?<br>\r\n- of course i know, who the fuck do you think did this to you, you cheating piece of shit.<br>\r\n- why?<br>\r\n- Thought it was self explanatory Luke, you fucked with me, so I'm fucking with you now and as far as the world is concerned your a girl called Lucille Adams, whom is a tomboy.<br>\r\n<br>\r\n- Good look Luke.<br>\r\n<br>\r\nBritney then put the phone down and leaves you feeling shocked and shaken from the information you just received \"that your a girl now\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1536123600,
            "id":2543133,
            "title":"something else"
        },
        "151111132131":{
            "choices":[
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>You hear your mum shout \"Lucille Elizabeth Adams\" get downstairs this instance.<br>\r\n<br>\r\nYou make your way down and see your mum holding a piece of paper from school and she looks angry.<br>\r\n<br>\r\n\"Lucille youe grounded\"<br>\r\n<br>\r\nWhat for? Don't give me that young lady! You've been missing school and your grades have dropped, so till they are to the were they should be your grounded which should give you time to clean and tidy your room.<br>\r\n<br>\r\nIf you don't I'll paint your room pink do you understand me young lady.<br>\r\n<br>\r\n\"Yes mum\"<br>\r\n<br>\r\nNow go to your room, do your homework and clean that pigsty you call your room.</span></div></div>",
            "created":1536123600,
            "id":2543135,
            "title":"Continue "
        },
        "1511111321311":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "sneak out",
                "stay in- grounded is grounded",
                "talk to your mom and ask if you can visit Brittany"
            ],
            "content":"<div class=\"\"><div> <span>As Luke you never had to clean your room and had such issues with your mom, but now as a girl, she seems to be more caring but also more restrictive towards you. This is one more fact, why you don’t like to a girl! It is bad that you are grounded, because you need to go over to Brittany to share some words with her and convince her that she undoes what she has been done! You wonder how she had done it…</span></div></div>",
            "created":1536210000,
            "id":2543743,
            "title":"grounded"
        },
        "15111113213111":{
            "choices":[
                "Your mum came in your room and apologised for slapping you",
                "You have calmed down and realise you need to say sorry to your mum "
            ],
            "content":"<div class=\"\"><div> <span>You sneak out and managed to almost get to Brittany's place when you feel a hand on your shoulder.<br>\r\n<br>\r\nYou turn around and see a police officer whom guided you his car and back to your house with your waiting mum.<br>\r\n<br>\r\nThe police officer handed you back to your mum and left.<br>\r\n<br>\r\nYour mum hugged you and said what do you think you were doing \"i was worried\".<br>\r\n<br>\r\nRight Lucille your grounded for a month, when you finish school you come straight back home and you'll do your homework immediately.<br>\r\n<br>\r\nWhen it is over you'll have to be back by 6pm till i can trust you.<br>\r\n<br>\r\nI have also signed you up for Capoeira as i think you have to much time on your hands , it's dance, acrobatics, gymnastics and self defence all rolled into one.<br>\r\n<br>\r\nAlso I've taken all your technology off you so you have no TV, PlayStation or laptop in your room now and the only reason to use the laptop is so you can do your homework. <br>\r\n<br>\r\nWhat the fuck mum? \"Slap\" you suddenly felt an intense pain on your face and started crying.<br>\r\n<br>\r\nYou ran to your room and planted yourself on your bed and cried with frustration and anger.<br>\r\n<br>\r\nA few hours later...</span></div></div>",
            "created":1536210000,
            "id":2543751,
            "title":"sneak out"
        },
        "151111132131111":{
            "choices":[
                "The next morning ",
                "A month later "
            ],
            "content":"<div class=\"\"><div> <span>You hear a knock on your door and your mum walked in and sits next to you and apologised for slapping you.<br>\r\n<br>\r\n- it hurt mum, I'm sorry too.<br>\r\n- Lucille i want the best for you as your my only child and i don't want you getting hurt or injured?<br>\r\n- i know mum!<br>\r\n<br>\r\nSuddenly your mum received a phone call and as she listens she seems to freeze and then come back around, she looks at you.<br>\r\n<br>\r\n- Luke?<br>\r\n- yes mum?<br>\r\n- OMG, you know my name?<br>\r\n- yes darling and i know why you've been turned into a girl and I'm in agreement with it.<br>\r\n- What?<br>\r\n- you had sex with alot of girl's and then just left them for your next conquest.<br>\r\n<br>\r\nBrittany told me and now i know Luke, she wants to teach youa lesson and as for the rest of the world your Lucille Elizabeth Adams.<br>\r\n<br>\r\nRight darling although, go to bed and we can discuss what we are going to do tomorrow...</span></div></div>",
            "created":1536296400,
            "id":2544215,
            "title":"Your mum came in your room and apologised for s..."
        },
        "1511111321311111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "yes",
                "no",
                "she is not sure, let's discuss"
            ],
            "content":"<div class=\"\"><div> <span>\"Luke. We need to talk...\" mom says. You throw a dirty look at her, it is weekend and so early in the morning. Your gender might have changed but not your need of sleep!<br>\r\n\"I'm not ready yet, let me sleep one more hour\" you say, annoyed. Mom shakes her head. “ok, let’s meet in the kitchen for a breakfast in 1 hour, strict, don’t be late!”<br>\r\nAfter a while you detect that even if you wanted you could no longer sleep. Also this female body annoys you as every morning, you miss your morning wood!<br>\r\nWhile getting up and seeing your current reflection in the mirror, you curse Brittany: \"That spying bitch\"<br>\r\nThen you remember your family situation hurtfully. Ever since Dad walked out three years earlier, mom has gotten into some bad relationships, fortunately none lasting. You understand that she doesn’t like cheating men, because her own husband and others did it and were hurting her very much. But let her own son suffer because of this? You will discuss with her for a way out and maybe she can support you with convincing Brittany to make you a man again!<br>\r\nAfter throwing on some casual clothes you meet mom at the agreed time in the kitchen.<br>\r\nMom asked what you would like for your breakfast.<br>\r\n\"Mom, I'm not fine in this changed body and the first thing you think about is preparing the food!\" you protested, holding your new acquired tits…<br>\r\n\"What are you doing?\" mom hissed.<br>\r\n“Mom, don’t you think I should be a boy?” you ask her<br>\r\n</span></div></div>",
            "created":1536296400,
            "id":2544354,
            "title":"The next morning "
        },
        "15111113213111111":{
            "choices":[
                "That's up to Brittany",
                "Brittney has left that to me to decide "
            ],
            "content":"<div class=\"\"><div> <span>- yes Luke, but Brittany cursed you to be my genetic daughter due to your cheating and only me, you and  Brittany know.<br>\r\n- Do you want me like this?<br>\r\n- No Luke, i want my son back but you have to learn a lesson and i agree with Brittany.<br>\r\n<br>\r\nRight after breakfast you should go upstairs, get a shower and changed into some jeans and a top by the way don't forget to wear a bra.<br>\r\n<br>\r\nWhy a bloody bra? Because your a girl now Luke and your lucky that Brittany turned you into a tomboy and nothing worst as she could off made you a slut or a girly girl, but she's not mean she just wanted to teach you a lesson.<br>\r\n<br>\r\nHow long do i have to stay like this mum?</span></div></div>",
            "created":1536382800,
            "id":2544697,
            "title":"yes"
        },
        "151111132131111111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "continue",
                "continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>she does not know since it is up to Brittany</span></div></span></div>",
            "created":1588239420,
            "id":2827395,
            "title":"That's up to Brittany"
        },
        "151111132131111112":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "agreed",
                "discuss - maybe you will get a shorter period of time",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"What can I do to end this quick?\" you said.<br>\r\nYou look at your mom expecting an answer, her voice was friendly as she spoke while she took another sip of her morning coffee.<br>\r\n\"Anything\" was her plain answer: and as she saw your confused face she additionally said:<br>\r\nJust learn how to be a girl of your age. Nothing more nothing less. Let’s say we discuss again next week, same time…”<br>\r\n</span></div></div>",
            "created":1536572400,
            "id":2545695,
            "title":"Brittney has left that to me to decide "
        },
        "1511111321311111121":{
            "choices":[
                "Continue from here",
                "A month later "
            ],
            "content":"<div class=\"\"><div> <span>A week later <br>\r\n<br>\r\nIn the week you've had your ears and nose pierced and you've been trying your best to do as your mum said although she is happy your still yourself to a point \"you dress as a tomboy\".<br>\r\n<br>\r\nYou are sat down with your mum and she smiled and said \"close your legs honey\" right your doing well and your grades are coming up plus you've been keeping your room tidy.<br>\r\n<br>\r\nBut i think your grades need to improve more as you've got the brains but your just not using them.<br>\r\n<br>\r\nSome time and place in a month...</span></div></div>",
            "created":1536593700,
            "id":2545790,
            "title":"agreed"
        },
        "1511112":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>You park the car in the drive then get out and walk into the kitchen and immediately see your mom.<br>\r\n<br>\r\nYour mom said \"who you hell are and why are you in my house\"<br>\r\n<br>\r\nMom it's me Luke, I don't know how it happened but I turned into a girl, please help me.<br>\r\n<br>\r\nDo you expect me to believe my son has suddenly turned onto a girl? \"yeah, I know it sounds crazy but it's true\".<br>\r\n<br>\r\nYou go to your bag opened your wallet and throw your new identity card on the table.<br>\r\n<br>\r\nYour mom picked it up and looked at it and said \"this is what I would of called Luke if he was born a girl\" she looked at you then the card then you again. <br>\r\n<br>\r\nShe then suddenly said \"Luke is that really you?\" yeah mom I don't know what to do and you sat down and began to cry into your hands.<br>\r\n<br>\r\nYour mom walked over to you and gave you a comforting motherly hug and said \"we can figure this out Luke, I promise\".<br>\r\n<br>\r\nYour mom said \"get the shoes off and then you can get a shower a refresh yourself Luke\"... <br>\r\n<br>\r\nAs you took your boots of your mom noticed you had just readjusted the shoulder strap of the bra without even thinking about it...<br>\r\n<br>\r\nShe tested it and said \"you should tie up your hair Luke it's getting in your eyes\" and without thinking you pulled your hair back and tied it into a ponytail.<br>\r\n<br>\r\nYour mom thought hmm anyone could tie there hair into a ponytail it's not proof enough... She then said out of the blue \"Luke when is your period due\" you automatically say in about two weeks mom.<br>\r\n<br>\r\nYou then covered your mouth and said \"how the hell do I know that\" your mom said \"I suspect whoever or whatever did this to you gave you basic knowledge of how to be a girl Luke\".<br>\r\n<br>\r\n\"We should check your room Luke\" why? \"because I also suspect your clothes have changed\" you must be kidding mom! \"no I'm not you are already wearing girls clothes Luke.<br>\r\n<br>\r\nYou looked down and said\" I almost forgot I was wearing these mom\" will I think you are still a rocker/skater and I girl terms a tomboy.</span></div></div>",
            "created":1588150380,
            "id":2826702,
            "title":"Who the hell are you?"
        }
    },
    "info":{
        "author_id":"runner1240",
        "author_name":"Runner",
        "brief_description":"never be a jerk around a witch...",
        "created":1292317200,
        "description":"<td align=\"left\" class=\"norm\">During the same time John Harrison (from the witch) discovered that magic is real and is undergoing life changing events, another boy, from a non witch family discovers the hard way that magic is real.<br>\r\n<br>\r\nYou're name is Luke Adams, a 16 year old boy. You're a bit of a jerk, and don't get on well with you younger sister, Bella (13) and constantly argueing with your mom Becky. You are dating two girls at the same time, (a cheerleader called Britney from another town(16) and a sweet girl called Rachel (also 16). Both girls don't know the other exists.<br>\r\n<br>\r\nThe story starts when Luke picks something from a garage sale. Unfortunately for him, its from a witch. One that doesn't like jerky, cheating boys such as yourself...</td>",
        "id":1732713,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1588239420,
        "modified":1588239420,
        "pretty_title":"A new path in life"
    }
}