{
    "chapters":{
        "1":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "Male human",
                "Female human",
                "Male anthro",
                "Female anthro"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which of these are you?</span></div></span></div>",
            "created":1385269200,
            "id":1698729,
            "title":"Gender And Species"
        },
        "11":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "Young Child (6-9 Years)",
                "Adolescent Child (10-12 Years)",
                "Young Teen (13-16 Years)",
                "Older Teen (17-20 Years)",
                "Adult (21+ Years)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Around what age are you?</span></div></span></div>",
            "created":1385269200,
            "id":1698730,
            "title":"Age Group"
        },
        "113":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "Canine",
                "Feline",
                "other furry"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Jake your a young teenager in a small forest town. What was always considered a boring normal town is now considered very special even if you still find it boring. It has been two years since the furry's appeared and built their society over the remains of human society and since then your small town has become a human sanctuary. A place where humans can live in peace and not worry about being captured or hurt, it is one of over 200 cities that... blah blah. All that really meant to you was that you went from living in a boring town to not being allowed to leave the boring town.<br>\r\n<br>\r\nOne reason you hated the rule was the boundary set for the city made it so any hideout you had before the takeover was now off limits. You hated the rule but, you did obey until that one day you had a fight with your mom, over something petty it was an argument dumb enough that you didn't even remember the reason by the time you calmed down. <br>\r\n<br>\r\nBut that moment of anger was enough to change your life as you decide you didn't care about the rules you wanted to go to your old hideout so you were going to go. You get out of the town and find your old hideout find that your comic collection was still where you hide it so you stayed there reading it you calmed down. That when you realized that in those two year you forgot how to find your way back home. So you walk the forest lost until you hear a rustling in the trees, as you cross a clearing, you look to see two eyes looking down at you.<br>\r\n<br>\r\nYou stood there in shock for a moment you were always told how big the furrys are but looking it in the eyes you knew it was far larger then anything you have ever seen. So you quickly turn to run away but it moves faster, faster is an understatement as it could outrun you if you both were the same size, It blocks your path and you now see that those eyes belonged to...</span></div></div>",
            "created":1486702800,
            "id":2276044,
            "title":"Young Teen (13-16 Years)"
        },
        "1131":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "a collage dorm with roommates",
                "her own house alone",
                "her parents house with or without siblings"
            ],
            "content":"<div class=\"\"><div> <span>As you turned to run the eyes quickly got around you to block your path. It enters the clearing blocking your path on all fours and eyes, sticking out from under a hoodie, that feel like it is stalking prey, until it looks you over then you and it's eyes soften. It hops forward into a squat and lifts the hood for you to see the the predictor was a female around 19 years old with black fur and dyed red hair and she had the biggest amber eyes you ever seen. she was wearing a dark green sleeveless and unzipped hoodie over a sports bra that was holding in some very large breasts. She had on spandex shorts and tennis shoes and appeared to be out for a jog. She sat there watching patiently as you looked her over then when she felt you had enough time she leans in to examine and smell you. <br>\r\n<br>\r\nWhen she leans in she starts to talk to you, \"Sorry for that thought I found a little rodent (wild human) but your so clean are you a lost pet?\" You hesitate for a moment before saying, \"I'm... I'm not a pet but I am lost I am part of the human sanctuary.\" Her face lights up when she hears you. she starts a rapid fire of questions about like, how many people, do furry visit, do you like it, and so on. You answer her question the best you could and it quickly becomes a long conversation.<br>\r\n<br>\r\nShe explains that her name is Amber and that humans like you without pet tags are considered rodents and the finder can do whatever they want with them. Then she winks and informs you that means she is now your master unless she wants to eat you. Then she does a biting motion towards you to make her point. Intimidated by her remark you try to back up but she moves her arm behind you Then laying down she traps you in a circle she makes with her arms and she rests her head over her arm asking, \"Why are you trying to run?\" As you look her in the eyes you can't tell if shes playing or actually hurt so you apologize timidly.<br>\r\n<br>\r\nShe smiles and forgives you as she picks you up and lays on her back before setting you between her breasts. When you land on her fur your so surprised by the softness that you zone out as your rub your face against it. She giggles and says, \"If you want to get friendly...\" Then she squeezes both her boobs together and jiggles them for a bit. Then after releasing you she sits up which causes you to fall in her cleavage. Then she just gets up and goes back to the path and returns to her jog she was doing when she originally smelled you. After her job she returns home to...</span></div></div>",
            "created":1486702800,
            "id":2276069,
            "title":"Canine"
        },
        "11312":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "yes I want to stay",
                "I'm not sure"
            ],
            "content":"<div class=\"\"><div> <span>The ride back to her place tossed you back and forward but, luckily you were in a very welly padded area. After about 10 mins she stops jogging and begins to walk. You are still stuck inside her cleavage unaware of what is happening around you but, at least the slowed pace allowed you to get your bearing. The only thing that you can see besides the furry mountains on either side is Amber's face which looked more beautiful the longer you looked at it.<br>\r\n<br>\r\nSoon she stops and tells you that we are here before reaching in to pull you out. You look at the house as she walks up and it was the largest building you think you ever seen. She brings you in and shows you the two bedroom house and you think its amazing how this house probably the size of your entire town is only considered cozy to Amber's size. She notices your reaction and finds it quite enjoyable to show you things she finds normal like her 30 ft TV, gigantic bed, and other things. When she is done she puts you on her couch's armrest and turns on the tv before telling you she will be back after a shower. You tryed to use the remote she left but, after realizing it takes your full body weight to change the channel you decide what she had on was fine.<br>\r\n<br>\r\nIn a few mins you hear the shower stop and soon after she comes out with a towel around her head, for the long hair, a black t- shirt and skull PJ's. You stare for a bit before she happily teases, \"flattery will get everywhere, little boy.\" You blush and look away as she sits next to you. Then she picks you up as she moved positions to lay on the armrest. When she gets all settled in she sets you on her stomach. It was interesting sitting there cause the fur made it very soft and inviting but you could also feel under the coat she had pretty hard abs so you assume she often worked out.<br>\r\n<br>\r\nShe asked if there was anything you wanted to watch and you tell her you don't know any shows cause your town hasn't had TV other then news for two years. So she flips through the channel and you both watch for a bit till you finally feel you need to ask the obvious question. \"Do you consider me your property?\" She mutes the TV and looks at you. As she sits there thinking you began to get nervous. Then to your surprise she asks, \"do you want to be?\" Then she goes on to explain that she can buy stuff that would allow you to move around the house freely and the pet tags are cheap. You think about it staying with her does sound very temping but  your family doesn't know what happened to you. Then you remember that Amber found you looking for a snack for all you know you really would just be answering if you want to be a pet or food. <br>\r\n<br>\r\nShe sees that its a hard decision for you so she says, \"I can't just let you back in the forest when it is so dark out so how bout this we have dinner, hangout till bed, then in the morning you can give me your answer.\" You agree so you both do just that, eat she is an amazing cook by the way, then she plays some video games while you watch then you both go to sleep her in a bed and you on a folded up towel on her night stand.<br>\r\n<br>\r\nYou wake up to Amber poking you. She brings you into the kitchen where breakfast was already prepared. You both eat and after the meal she asks if you made a decision and you say...</span></div></div>",
            "created":1486789200,
            "id":2276417,
            "title":"her own house"
        },
        "113122":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "Amber is waiting",
                "no one there yet but you hear something in the trees"
            ],
            "content":"<div class=\"\"><div> <span>You hesitate to answer cause after two years in your boring town her offer seems to be everything you wanted but, you think about how worried your family must be. Amber sees this and gives a suggestion. \"I need to go to class this afternoon I can leave you near the sanctuary, you can tell people your fine, pack some cloths and leave for me to take you back.\" <br>\r\n<br>\r\n\"What if I just stay in the town?\" you retort.<br>\r\n<br>\r\nShe leans in with a playful smile, \"well, then you would be a boring little boy.\" Then she heads toward her bedroom. As she walks away you watch her butt sway side to side in an almost dramatic fashion. Then after a few steps she stops and looks over her shoulder to say, \"You can't say no to this butt anyway.\" Your face turns red and you quickly turn away knowing that you fell for her trap hook line and sinker. She laughs as she walks away to go get changed and she comes back in with a black T, great looking jeans, Boots, and the green hoodie from yesterday. She grabs her backpack then you. <br>\r\n<br>\r\nShe softly pets you as she takes you back home. Amber's petting and peaceful walking pace completely relax you to the point of barely staying awake. You look out at the city as she walks and notice for the first time that human really are just pets in this world. This culture shock starts to freak you out but, then you hear Amber softly shh you and soon her petting soothes away your anxiety. Soon she walks into a park and follows a walking trail but, after a while she goes off into the forest. <br>\r\n<br>\r\nShe softly sets you down and points you toward your town then she tells you to be at this spot at 7 tonight. You thank her and go back into town to a mother worried sick. You get everything settled with the town your family doesn't want you to go but allow you to choose. So you leave with your bag and arrive at 6:45 at the meet up.</span></div></div>",
            "created":1486962000,
            "id":2277383,
            "title":"I'm not sure"
        },
        "1131221":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "all dog like furrys",
                "mixed bunch of furrys"
            ],
            "content":"<div class=\"\"><div> <span>You arrive at the meet up spot but stay hidden in the bushes almost questioning your own want to stay hidden as you spot Amber in the clearing. She was laying there leaning against the tallest tree, (and probably the only one that can support her size) as she read a book. She was wearing glasses and didn't seem to notice that you were there so you took sometime to admire her beauty. She smiles as she turns the page and closes the book, then she turns to face you still hidden in the bushes, \"ready to go Jake or do you want to sit there staring at me some more.\" <br>\r\n<br>\r\nEmbarrassed you come out to say, \"I'm ready to go.\"<br>\r\n<br>\r\n\"You sure? I can do some poses for you.\" she moves onto her stomach then arches her back shoving her butt in the air. You look down as the heat building in your face from the embarrassment. She just laughs as she gets up and puts you in her pocket. \"I hope your hungry cause I'm meeting some friends at a delicious dinner.\" She tells you as she starts to walk back into town. When you get to the dinner you see her friends are...</span></div></div>",
            "created":1488517200,
            "id":2284765,
            "title":"Amber is waiting"
        },
        "1133":{
            "author_id":"dinosaurking",
            "author_name":"dragon",
            "choices":[
                "reptiles!!",
                "birds!!",
                "other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about reptiles or birds?</span></div></span></div>",
            "created":1575648000,
            "id":2756177,
            "title":"other furry"
        },
        "114":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "A well-endowed male.",
                "A busty female."
            ],
            "content":"<div class=\"\"><div> <span>Once again you woke up without much reason to do so. For the last four years you've been living in this cage in the local pet shop ever since the Transformation. The moment it happened you knew everything would change. Humans only live because of an agreement to let other animals become masters to us. Oh well, at least you're not dead. Although you're life would only be less exciting if you were dead. Everyday you got up, sat around in your cage, ate, talked to your friends in the adjacent cages, and most crushingly, never get fucking bought!<br>\r\n<br>\r\nToday though you woke up, still bleary-eyed to see a stranger looking at you in your cage. Though you couldn't see too well yet having just woke up you could tell that it was...</span></div></div>",
            "created":1385269200,
            "id":1698745,
            "title":"Routine"
        },
        "1141":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "A wolf.",
                "A lion.",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What species is the big fellow?</span></div></span></div>",
            "created":1385269200,
            "id":1698746,
            "title":"Big Guy"
        },
        "11411":{
            "author_id":"shadowdragon21",
            "author_name":"ShadowDragon21",
            "choices":[
                "Was pretty muscular",
                "He was pretty fat"
            ],
            "content":"<div class=\"\"><div> <span>As your eyes finally adjusted you saw the face of a wolf stating at you. As soon as your eyes met you notice he gave a small smile. After seeing that you couldn't hold in your excitement was he really going to buy you. As a big grin formed on your face it ended up not lasting long as after looking at you a bit longer he stood up straight and walked away. After watching the wolf walk out of your field of view you went and sulked back to your bed. This wasn't the first time your hopes had been crushed.<br>\r\n<br>\r\nThere were two kinds of human pets in this world the ones who are fine with being pets and others that aren't. You belonged in the category that being a pet was fine. You actually liked being around the giants. Sometimes some of the workers here would take you out for a little bit of fun since you've been here for 4 years. Even if you were about to be 20 the thought of playing hide and seek with someone much more bigger than you excited you. <br>\r\n<br>\r\nJust as you were thinking if you were ever going to be bought you heard a tap on cage. Turning around you saw it was the same wolf from earlier. You saw him open his mouth to say something but you couldn't hear him as the humans cages were built so neither human or anthro could talk to each other as sometimes problems would arise if they got into arguments. It wasn't long after though that you heard the door to your cage open up behind you. What soon came in though was a brown furred hand you were familiar with. Knowing that the hand was here to pick you up. Not wasting any time you got unto to palm and were whisked out of your cage and brought up to the face of the otter whose name was Geoff. He was one of the few workers here that would pay attention to you and play some games with you. <br>\r\n<br>\r\n\"Hey looks like someone finally bought you I bet your excited.\" The giant otter told you as he rubbed your stomach with one of his fingers. You never really cared for belly rubs before but when it was by one of the giant anthros you liked the feeling of the fur against your bare skin. \"I am but I'm also going to miss you.\" You told the otter as you were reaching the door so you could meet your new owner. \"Don't say that we'll probably see each other again since your vet is going to be from this store so you'll he back every once in a while so I'll make sure to visit you when you're here.\" Geoff told you while flashing a big smile. Getting red with embarrassment you looked down at his palm left to wonder if the giant otter knew of your affections for him. You soon reached the door and you finally got a good look at your owner. The first thing you noticed was that he...</span></div></div>",
            "created":1420952400,
            "id":1916539,
            "title":"A wolf."
        },
        "114111":{
            "author_id":"shadowdragon21",
            "author_name":"ShadowDragon21",
            "choices":[
                "To your new home",
                "Get some food"
            ],
            "content":"<div class=\"\"><div> <span>As you couldn't get a good look at his body earlier you inspected him the moment you could. Not to say you ha standards but you did want to look at how your new owner looked. As you looked his body over you noticed he had a good amount of muscle not too much but he also wasn't lightly muscled either. His huge cock didn't escape your notice either. After you finished giving him a quick look over you noticed him walking around Geoff to get a look at you. \"You know if you want you can hold him.\" Geoff told the wolf as he looked at you intently. <br>\r\n<br>\r\n\"Huh.. do you think it'll be okay I've never had a human before but I have interacted with some before and the ones I have are a little nervous with strangers.\" The wolf said surprising you. Even though he could grab you and you would be powerless he still considered your feeling even though those weren't your feelings but still he tried. \"It's okay if you want I'm fine with you holding me.\" You said with a loud voice to the giant wolf. \"There you see you can't argue with the human himself.\" Geoff said as he handed you to the wolf. \"You're sure I can hold you right?\" The wolf asked with a slightly worried tone. This wolf actually surprised you, here you were thinking he would be a master who wouldn't care to much about your feelings but you were proven wrong. \"Yes you can I trust you.\" You told him. \"Ok then.\" The wolf said as he put out his palm for you. Geoff put you over the paw and let you jump down yourself. As you stood on the palm of the wolf he stared at you some more and when he was satisfied he told Geoff he was ready to take you. After Geoff finished going over the rules to the wolf over again about their human policy. The wolf had to sign some papers and then you officially became his. As you left the store in the wolfs palm at the entrance he lifted you up to his face. \"I know you probably heard my name already but I haven't really introduced myself my name is Rick.\" Your owner Rick told you. \"Well I have an actual name but my nickname from the store is squirt so you can call me that if you want or you can call my Eddy which is what the other humans in the store called me.\" You told Rick as you gave him a quick smile. Smiling back he said, \"That's good I'll decide what to call you later but now we need to go...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1421038800,
            "id":1916804,
            "title":"Was pretty muscular"
        },
        "1141111":{
            "author_id":"shadowdragon21",
            "author_name":"ShadowDragon21",
            "choices":[
                "Have a family.\"",
                "Live alone.\""
            ],
            "content":"<div class=\"\"><div> <span>You were actually a little excited to see your new home. \"Before we go to the checkout are you going to want to carry him the whole way or do you want a box to put him in.\" Geoff asked as they were about to go to the cash register. \"If it's alright with him I would like to carry him.\" Rick said as he gave you a smile. \"I'm okay with it.\" You told the gentle wolf. As you sat in his palm you looked out at the rest of the store passing by in a blur since at your size Rick was moving incredibly fast. Once you got to the checkout right before he was about to pay for you Geoff stopped him. \"I forgot to ask you an important question do you have kid or a significant other we need to know this and if so they also need to know the rules of taking care of a human.\" Geoff told Rick who was stating at him. \"I.....</span></div></div>",
            "created":1421384400,
            "id":1918588,
            "title":"To your new home"
        },
        "11412":{
            "author_id":"roman_typhos",
            "author_name":"Salazar",
            "choices":[
                "Tell your new owner your name.",
                "Stay silent and be named."
            ],
            "content":"<div class=\"\"><div> <span>          As you focused in you saw him, a massive set of blue eyes hidden behind an even big pair of glasses as well as the dark grey brown of a triangular nose. You could tell he was HUGE even without seeing the rest of him as the giant maned head looked around at you from all angles. His long, blond mane flowed from his had and down his shoulders and even under the chin, he was hairy and... a tad sweaty if your nose told you anything. <br>\r\n<br>\r\n“This guys kinda cute.” The massive lion thooms overhead to the store manager.<br>\r\n<br>\r\n          You pay attention to what could very well be your new owner as he walks away and the first thing you can tell is her really is HUGE as you surmised before, standing a good foot or two over everyone else in the store. He was wearing athletic clothes, a tank top that showed his bulging pecs and draped over his pudgy belly, shorts that looked way too tight no matter what angle you viewed them from, from the back displaying the generously sized and perfectly round butt and to the from they hugged his equally jaw dropping manhood, they looked like they were practically painted on. Below was two pairs of athletic shoes, old, scuffed but large in their own right, they needed to be to cover such paws. Overall he was breathtaking, he was exceptionally well built with bulging muscles everywhere you looked but on top of all that he seemed to be mostly unaware of how stunning he was given the happy little smile he wore the entire time we was in the store, even as his giant, clumsy tail whipped around, knocking things off shelves. Needless to say you were very much infatuated with this unbelievably sexy stud of a lion and would have no problem calling him your owner.<br>\r\n<br>\r\n“That’s very good, would you like to hold him?” The owner asked, scooting past the large bulge and belly of the lion to get to the human cages.<br>\r\n<br>\r\n“Oh yeah! That’d be awesome, thank you!” He said excitedly, following after the shorter manager.<br>\r\n<br>\r\n          You sat, a little afraid of what to expect as the owners large paws undid the latch on your cage and reached in to pick you up with ease before pulling you out. It was strange, seeing the store from a different perspective for the first time since you and your fellow humans were stacked there but you didn’t have long to dwell on the thought before the manager spun around and raised his paws slightly to the lion who now looked even bigger than before as he loomed over you like a smiling colossus.<br>\r\n<br>\r\n“Make sure you support the legs, they can be a bit unsteady at first but after a while they get used to being held.” He says, handing you off to the noticeably bigger paws of the lion.<br>\r\n<br>\r\n“Oh my god! He so tiny!” He says excitedly, holding you on the soft, doughy pad of his paw which matched the color of his nose. “He’s so cute, I mean... like just look at how little his limbs are, I’m worried I might hurt him.” He says, gingerly cupping you in his paw as he pokes a plump, feline digit at you, trying his hardest to pet you with one finger but most of the time not even touching you at all. “He seems pretty calm.” He says, after holding you a bit and truth be told you did feel pretty calm in his paws, you felt like you knew he wouldn’t hurt you... intentionally at least.<br>\r\n<br>\r\n“Oh yes, all of our humans are calm, we make sure to get the ones like that because we find they take to their owners easier.” He says, speaking about your kind like they weren’t sentient. “The rest we usually keep around for ourselves for some anthro training, getting them acquainted with the prospect of creatures bigger than them interacting with them. Some have trouble with the prospect but this little guy seems right at home with you. So do you think you’ll take him?” He says, smiling at the oversized cat.<br>\r\n<br>\r\n“Oh yeah, absolutely!” The lion stud says, still kinda petting you sometimes with one finger.<br>\r\n<br>\r\n“Excellent, I’ll just put him back and get the paperwork and we should be good!” And with that you are taken from your now owners paws and placed back into your cage and and carried to the counter where the two exchange paperwork for money and with a wave goodbye and a bidding a good day and good luck to the lion the two of you depart the store.<br>\r\n<br>\r\n“This is so cool little guy, my name is Roman, I guess I’m your pet dad now.” He says, chuckling to himself. “I promise you’ll love being mine, I already have a nice place picked out for you and everything, you’re gunna love it!” He says walking. “So, do you have a name or is that something I give you, do you speak much?” He asks and you...</span></div></div>",
            "created":1579447140,
            "id":2775568,
            "title":"A lion."
        },
        "11413":{
            "author_id":"shadowdragon21",
            "author_name":"ShadowDragon21",
            "choices":[
                "Real",
                "Fictional"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is it a real animal or fictional?</span></div></span></div>",
            "created":1406005200,
            "id":1831785,
            "title":"Other"
        },
        "1142":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "A black house cat",
                "A tigress.",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What species is the lovely lady.</span></div></span></div>",
            "created":1385269200,
            "id":1698747,
            "title":"Lovely Gal"
        },
        "11421":{
            "author_id":"killerwolf552",
            "author_name":"bloodwolf2243@gmail.com",
            "choices":[
                "\"what is this\"",
                "'this will be fun\""
            ],
            "content":"<div class=\"\"><div> <span>The female takes you out of the cage and carefully puts you on the counter and gives a hand full of money to the man\"will that be all\" said the man\"yes he is the one I want\" said the female and walks off putting you in her bra between her massive brest she starts to jog to her house where there are two Uther females waiting and you think</span></div></div>",
            "created":1583564640,
            "id":2797724,
            "title":"A black house cat"
        },
        "11422":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "Her bed.",
                "A clean cage."
            ],
            "content":"<div class=\"\"><div> <span>As your vision finally became clear the goddess before you was unmistakable. You've seen her around the shop before looking around, but never seeming to buy anything or anyone for that matter. From her physical appearance she'd make any man her personal bitch. Her breasts were wonderfully sized. Not too big but you'd definitely get lost in those E-cups. Her legs were impossibly long, which was obvious to you despite the size difference. Her hair was long and jet black. Her amber eyes glowed beneath her hair too.<br>\r\n<br>\r\n\"Hi there little fella. I'm Skylar. I've seen you a lot around here,\" she said to you with a small grin on her face, thankfully a gentle one. You were always shy around anthros, especially exotic animals like tigers. \"Um... hello Skylar. Nice to meet you,\" you replied quite meagerly. She reached through the cage and softly petted your head with a finger, which admittedly you like and made you smile. \"How would you like a home little guy?\" she asked, in a rather manipulative way knowing that you loved the petting. \"Yes please Skylar. I'd love to have you as my master.\" Her smile widened and she took you out of the cage to purchase you.<br>\r\n<br>\r\nAfter bringing you home she brought you upstairs into her room and set you down at...</span></div></div>",
            "created":1385269200,
            "id":1698764,
            "title":"Skylar"
        },
        "11423":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "An anthro dog (each breed gets its own storyline)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, what about...</span></div></span></div>",
            "created":1385614800,
            "id":1700140,
            "title":"Other"
        },
        "114231":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "A Husky",
                "A different breed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, what breed is your new owner?</span></div></span></div>",
            "created":1385614800,
            "id":1700141,
            "title":"An Anthro Dog"
        },
        "1142311":{
            "author_id":"infinity421",
            "author_name":"infinity421",
            "choices":[
                "Inside your cage, which is on a table next to your mistress' bed",
                "On your mistress' body, being softly petted"
            ],
            "content":"<div class=\"\"><div> <span>Hm...<br>\r\n<br>\r\nYou hadn't seen this customer before. She was a husky, seeming to be fifty feet even, with a layer of grey-white fur covering her admittedly rather attractive body, which sported E-Cup breasts and a large rear, as well as somewhat wide hips. The husky slowly pads around the room in which all the cages were kept, inspecting each human individually. <br>\r\n<br>\r\nThe husky disappears from view, and her footsteps halt. She must have found someone that attracted her attention. Good for them. <br>\r\n<br>\r\nSuddenly, the husky's massive muzzle appears right in front of your cage, and you instinctively shrink back, huddling into yourself and scooting backwards until your back hits the bars of your cage. Damnit, why did you always go like this whenever a furry inspected you?<br>\r\n<br>\r\nYou feel your cage swing forward and back... Was the husky... Going to buy you?<br>\r\n<br>\r\nUnable to cease your body's panic induced huddle, you can only listen as the store owner attempts to convince her to buy a different, and most likely more expensive human. The husky sticks to her guns, however, and before you know it your cage has been placed inside a bag. <br>\r\n<br>\r\nFiguring you might as well go to sleep and wake up inside your new mistress' house, you close your eyes and lay on your side, drifting asleep. <br>\r\n<br>\r\nWhere do you wake up?</span></div></div>",
            "created":1385614800,
            "id":1700154,
            "title":"A Furry Angel"
        },
        "11423112":{
            "author_id":"sweetace2211",
            "author_name":"AceSweet2211",
            "choices":[
                "Reader's Choice (Just choosing name, can do whatever else is chapter)",
                "Reader's Choice (Just choosing name, can do whatever else in chapter)"
            ],
            "content":"<div class=\"\"><div> <span>You wake to find yourself on top of something very soft and something or someone lightly stroking your head. Still groggy from the nap you took on the way over to where ever you are now you didn't barely move or even give away that you were even awake to the massive woman or girl that was now your owner. After some of the grogginess started to fade way you tried to get your head around the events that have transpired thus far.<br>\r\n<br>\r\n\"Good morning sweepy head.\" you heard the voice of someone of the female gender say in a cutesy voice. When you opened your eyes you could easily see that you were around the size of a real world* mouse to this gargantuan beauty. After even more inspection you come to find out that you were laying on her body. You thanked whatever gods that may or may not actually be there for a nice owner.<br>\r\n<br>\r\n\"H-h-hello.\" You manage to squeak out nervously. \"Hi and let me begin by introducing myself, my name in Jane Nadia° and I guess that I am kind of your new owner.\" Jane said while putting you down gently and sitting up. All you could do was marvel in the fact that she even recognised you as another intelligent species \"Do you have a name?\" Jane says to break the silence. \"As far as know, I'm pretty sure that's your job.\" You reply. \"Oh yeah, right. I think I'll name you...\" <br>\r\n<br>\r\n°= Translate Nadia from Corsican to English and you will see my little trick. And yes Corsican is a real language</span></div></div>",
            "created":1461387600,
            "id":2137843,
            "title":"Body Pillow"
        },
        "114231121":{
            "author_id":"sweetace2211",
            "author_name":"AceSweet2211",
            "choices":[
                "\"At a pet store and yes I would say she was about as nice as I am to humans\"",
                "\"At work and absolutely not. I barely convinced her to let me get you.\" "
            ],
            "content":"<div class=\"\"><div> <span>\"Ace, I'll name you Ace. Is that okay?\" Jane said. Surprised at the mere fact that she even asked you if the name was okay. You asked \"Are you talking to me?\" \"Well of course silly. What did think, that I was going to give you some random name and not ask if you liked it? I can see where you are getting the notion from but I am not one of those owners.\" \"Actually, yeah I didn't really think there were any of those mystical anthos that treated humans like another intelligent species actually existed.\" You replied. \"Well, do you like the name?\" Jane said expectantly. Not entirely in love with the name, you pondered other names that you liked but decided against saying anything.You didn't really want to find out if merely disagreeing with her would make her snap so you nodded anyway.<br>\r\n<br>\r\n\"Great! Then I guess for now your name is Ace. Just know that if you aren't okay with the name or if you want me to call you something else just let me know.\" Jane said excitingly. <br>\r\n<br>\r\nA sort of awkward silence fell upon the room. <br>\r\n<br>\r\n\"Uuuhhhm. You want see around the place?\" Jane said to break the silence. \"Sure, why not.\" You replied hapily.<br>\r\n<br>\r\nYou flinched a little Jane went to pick you up but quickly relaxed. Your stomach churned a little as Jane brought you up to her shoulder. Setting you on her shoulder, Jane began to stride out of the room with a sort of spring to her step. You couldn't discern why exactly but you were shaken from your personal thoughts when Jane introduced the first room.<br>\r\n<br>\r\n\"This is the  bathroom, pretty obvious what it is used for but I have a smaller little stall set up for you in there with a sink, shower, and toilet in there for you. I've been anticipating getting a pet for a while so I have a lot of stuff pre prepared. Speaking of pre-prepared things, do you want some clothes?\"<br>\r\n<br>\r\nYou nod furiously in reply to the very rarely asked question between a giant anthro and their miniature human pet and by very we are talking about almost never asked like only happens every one in a million times an anthro decides to get a new pet. <br>\r\n<br>\r\nAfter getting into your new wardrobe which is mainly comprised of loose fitting black T shirts and boot cut jeans with a couple black sweatshirts on there as well. \"You look nice.\" Jane said as you finished getting dressed \"sorry about the generic wardrobe, I wasn't sure what gender of human I was going to get and there weren't very many places that sold clothes at human size.\" \"Ahh it's fine so don't worry to much about it. Either way, this is basically what I wore before the whole, pets turning into giant anthros thing.\"<br>\r\n<br>\r\n\"Well that is very convenient, so anyway, back to the tour.\" Jane bellowed.<br>\r\n<br>\r\n\"If you would notice on the walls that there are a series of catwalks at about my eye level and when it crosses over the hallway or to something in the middle of the room, it will go over my head and down to the other side. Main use is to get around my house a bit faster.\"<br>\r\n<br>\r\n Next room is the kitchen, again pretty obvious what it is used for but I have a small table set up there for you to use. Do you like the human food they gave you at the store?\" \"About fifty fifty.\" You reply truthfully. \"Ok then so I'll give you some of what I make for myself for meals for you.\"<br>\r\n<br>\r\n Next we have the guest room but you really shouldn't have any need to go in there at the moment. Here's the living room, again pretty obvious what this room is used for but I do have a chair set there for you. Just FYI I control the remote.\"<br>\r\n<br>\r\n Last but not least, we have your room or well, your part of my room. I have a room set up for you on my nightstand with a bed, a nightstand for you, a lamp, and a closet. Sorry I couldn't give you very many entertainment options in there but I did have a bay window in there so you can watch TV from my TV while I am rather gone or somewhere else in the house. Do out like it?\" <br>\r\n<br>\r\n\"Amazing, but I do have some quick questions and just say something if you aren't comfortable answering any of them.\" You say. \"Sure. Shoot.\" Jane replied calmly.<br>\r\n<br>\r\nQ. How long have been wanting a pet?<br>\r\n<br>\r\nA. About a year or two now.<br>\r\n<br>\r\nQ. Do you own this house?<br>\r\n<br>\r\nA. Yes I do for a matter of fact. Well my name is on the mortgage but both my and my roommate Jessica, she is a Blue Jay anthro, share the payments.<br>\r\n<br>\r\nQ. How old are you?<br>\r\n<br>\r\nA. 18 almost 19, moved out of my parents about a half a year ago. B-day is in a month.  <br>\r\n<br>\r\nQ. In the light of you having a roommate, where is she and is she as nice as you to humans?<br>\r\n<br>\r\nA. ________________________________<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1461733200,
            "id":2140268,
            "title":"Hello, my name is Ace"
        },
        "1142311212":{
            "author_id":"sweetace2211",
            "author_name":"AceSweet2211",
            "choices":[
                "Menacingly",
                "With Adoration"
            ],
            "content":"<div class=\"\"><div> <span>\"At work and absolutely not. I barely convinced her to let me get you. In fact I think she is on her way home right now.\" Your mind instantly wanders to the thought of some giant bird woman crushing you... not sure if to be terrified or aroused. \"Uhhhhm, are you going to be here when she is? Or am I going to be left here with a giantess who hates little people?\" You ask worryingly. \"Only when I have work which is only for 3 hours a day every day of the week. And speaking of which I have to get to work here in a little bit.\" Jane replied, trying to reassure you but didn't do very well.<br>\r\n<br>\r\nJust then, you hear the jingling of keys and the turning of a door handle. You both look to the door to see a small breasted blue Jay with a large butt and thick thighs standing in the threshold. \"Oh, you actually got one of those little vermin?\" Jessica said whilst looking at you in disgust. \"He may be little but he is in no way a vermin. In fact I find him quite nice.\" Jane said in your defense. Jessica left the room in disgust all while eyeing you menacingly.<br>\r\n<br>\r\n\"Well, I have to get to work now. Sorry I have have to leave you here with her, I would take you with me if I could I swear but pets aren't allowed where I work, boss says so.\" Jane says apologetically. You decide to stay silent but think to yourself \"I'm gonna die I'm gonna die I'm gonna die.\" As Jane left and said bye you turn to see Jessica standing in the hallway staring at you...</span></div></div>",
            "created":1464066000,
            "id":2153527,
            "title":"\"At work and absolutely not. I barely convi..."
        },
        "11423112122":{
            "author_id":"lordoftrash93",
            "author_name":"LordAlmighty",
            "choices":[
                "Kisses you",
                "Hugs you"
            ],
            "content":"<div class=\"\"><div> <span>You start to get confused as she looks at you this way. Jane said Jessica didn't like humans and she made it clear she didn't like you. Why would she have a look that contrasted that. As you get lost in your thought she starts to walk towards you. \"Look at you cutie.\" \"Why are you suddenly being nice to me? I thought I was a vermin.\" You hear her let out a large sigh. \"Ok so I might need to explain some things first.\" She then kneels in front of you, her enormous face the only thing you can see. \"It's just I want you guys to be free like some of us used to be before this happened. Some humans treated us great but some didn't. And there are so people who act that way towards humans and I don't want humans to get hurt.\" She starts to look sad as if she's about to cry. You walk up and start to comfort her. \"Hey, hey it's ok. There are also people who treat humans well. I mean Jade already made a good impression and you seem like you have a good heart.\" She then smiles and...</span></div></div>",
            "created":1555902120,
            "id":2648200,
            "title":"With Adoration"
        },
        "114231121221":{
            "author_id":"lordoftrash93",
            "author_name":"LordAlmighty",
            "choices":[
                "She breaks it up",
                "It continues"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Your so cute and sweet. I just can't stop myself from..\" She suddenly picks you up puts her beak in a kissing position and then engulfs your body in a kiss. You feel her saliva all over your face but the kiss feels so good. </span></div></span></div>",
            "created":1555903320,
            "id":2648217,
            "title":"Kisses you"
        },
        "1142312":{
            "author_id":"dinosaurking",
            "author_name":"dragon",
            "choices":[
                "Yes!!",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, how about a German shepherd?</span></div></span></div>",
            "created":1566266100,
            "id":2705007,
            "title":"A different breed"
        },
        "11423122":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe a Bulldog?</span></div></span></div>",
            "created":1566349320,
            "id":2705434,
            "title":"No."
        },
        "114232":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "Vixen.",
                "Next."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about it?</span></div></span></div>",
            "created":1385614800,
            "id":1700179,
            "title":"V For Vixen"
        },
        "1142321":{
            "author_id":"infinitebull",
            "author_name":"InfiniteBull",
            "choices":[
                "She Tries To Train You",
                "Her Friend Comes Over"
            ],
            "content":"<div class=\"\"><div> <span>Looking up you see a fox women standing by your cage. She's got beautiful red fur with black ears and paws. Her hair is also red and reaches down to her back. Another thing that gets your attention is her humongous breasts. They almost obscure your view of her pretty green eyes. She bends down so that she's eye level with you and peers inside the cage. Along with her face you get a good look at her cleavage, which makes you gulp nervously. \"Hey there little guy.\" she says and sticks a finger inside. You step back, but she motions for you to come over. \"Its okay, I won't hurt you.\" she says. You slowly walk over to her massive digit and place a hand on it. It quickly moves above you and starts petting your head. You want to retreat backwards but are captivated by the feeling. You get closer as she continues and lean in for more. \"I think I'll take this one.\" she says to the owner of the store. You are snapped out of your little trance when she stops and walks away. She gives the owner some money and then comes to pick up your cage. The movement makes you nervous but she tries to calm you down. \"Its okay little guy.\" she says and makes some cooing noises. \"We're just going to your new home. She carries the cage to her car and places it in the passenger seat. When she starts the car it frightens you and you fall on your butt. This is the first time you've ever been in a car and the its scary at first. Looking toward your new owner you see her looking back at you before she turns to the road. \"Calm down, we'll be there soon.\" she says. Once the start is over the ride is quite smooth and you actually enjoy it.<br>\r\n<br>\r\nSoon the ride stops and she takes your cage inside a building that you assume is her house. She sets you down on a table and opens the cage door. You stay inside but she gently tips it over and you tumble out. She lifts you between her two fingers and brings you to her face. Seeing her this close is a little overwhelming. She's gorgeous and looking down you see those giant breasts. Also behind her that bushy tail is swishing around almost hypnotically. \"So can you talk?\" she asks. \"Uh yes master.\" you say shyly. She smiles and places you in her paw while petting you. \"Good!\" she says proudly. \"Now you'll be a good boy right?\" You nod quickly. \"Yes master! I will! I promise!\" you tell her. \"Good, now just to let you know,my name is Veronica, but you still call me master.\" she says. You nod and look around at the room you're in, then find yourself examining her body. \"Hey now, looks like you love your new master already.\" she says with a grin. You blush and get on your knees. \"I'm sorry master!\" you say. \"Its okay, I don't mind.\" she says, then drops you into her cleavage. She squishes her boobs together before pulling you out. \"See?\" she asks with a laugh.<br>\r\n<br>\r\nLater that night when its time for bed you find yourself in her bedroom on her dresser. She catches you looking at the bed and smiles at you. \"Sorry but thats my bed.\" she says. \"You sleep in the catch, but if you're a very good boy I may let you sleep with me as a reward.\"  She then turns and walks to the bed, showing her fantastic butt. Her tail swishes to emphasize it and you get a little aroused. This seems like it will be a good life. She makes sure you remember you're a pet but she's pretty open minded toward you. She even let you eat the same thing she had for dinner! It was so much better than the human food at the pet store. \"Good night little guy.\" she says and turns off the lights. You drift off to sleep happy about the day. The next day...</span></div></div>",
            "created":1405832400,
            "id":1831022,
            "title":"Your Foxy New Owner"
        },
        "11423212":{
            "author_id":"infinitebull",
            "author_name":"InfiniteBull",
            "choices":[
                "She Plays With You",
                "She Lets You \"Play\" With Her"
            ],
            "content":"<div class=\"\"><div> <span>The next morning you awaken to the sounds of your owner walking around. You hear her booming steps as she gets dressed. When she has her back to you her tail swishes back and forth, your eyes following along. When she's done she turns to you and grins when she sees you. \"Staring again eh?\" she asks as she nears your cage. She opens the door and reaches inside to scoop you up. She then walks you to the kitchen and sets you on the table. \"Okay, time for breakfast.\" she says. As she cooks your mouth begins to water at the smell. When its done she has a plate with eggs and bacon much bigger than you. She sets a few small portions aside for you and eats her own. You attack the food with gusto and love every bite. Having real food is so good! When you're done you look up at her and she smiles. \"Enjoy the meal?\" she asks. You nod with a smile and she brings down a furry finger to pet you. Once its close enough you can smell the faintest bit of bacon grease in the fur and can't stop yourself. You begins to lick her finger and she giggles in surprise. <br>\r\n<br>\r\nVeronica watches in amusement as you lick her until there is a knock on the door. \"Coming!\" she calls and leaves you on the table for a second. As the booming of her steps gets father away you are drawn to her plate. there are still some bacon bits on it and you greedily gobble them up. Soon there is a rumbling and you feel a huge presence behind you. At first you assume its your owner but it doesn't quite feel the same. You slowly turn and are faced with what looks like a pale blue under belly. Further up you see the belly belongs to a massive dragon woman. She's got sky blue scales and dark blue hair reaching down to her shoulders. On the sides of her head are horns that curve downward in a spiral. This new woman is even bigger than your owner, and you fall back in shock as she bends down to get a better look at you. \"Well hello little guy.\" she says. You tremble as her gigantic claws come down and pick you up. You are brought to her huge face and dangle in the air as she stares at you. She's actually quite good looking, and upon gazing down you see she's got huge breasts. Your thoughts are cut short when she grabs both your arms and begins moving them around like you're a toy.You feel like you're about to cry when Veronica comes back.<br>\r\n<br>\r\n\"Hey Doreen let me show you my-\" she says but then sees whats going on. \"Put him down!\"she says and snatches you from the dragon. \"He's not a toy!\" Doreen folds her arms. \"I was just playing with the little guy. He's really cute!\" she says. \"Look at him! He's shaking!\" Veronica tells her friend. Doreen leans in closer and sees you trembling. \"Aww, I'm sorry!\" she says and picks you up once again. Veronica watches closely to make sure she doesn't do anything funny. \"I didn't mean to scare him. I was just checking him out.\" Doreen explains. \"Well just tell him you're sorry then.\" Veronica says. \"Okay, okay.\" the dragon says. \"Sorry little guy, but I'll give you a treat to make it up to you.\" Your ears perk at the word \"treat\". What kind of treat does she give you?</span></div></div>",
            "created":1406696400,
            "id":1835641,
            "title":"A Dragoness Appears"
        },
        "114232122":{
            "author_id":"infinitebull",
            "author_name":"InfiniteBull",
            "choices":[
                "Fun's Over",
                "She Joins In"
            ],
            "content":"<div class=\"\"><div> <span>Doreen lowers you down her body, giving you a tour of sorts. She allows you to see her underbelly, and further up she holds you over her cleavage. \"I think I'll let you play with me.\" she says. She then looks at Veronica. \"If its okay with your owner.\" The fox looks from Doreen to you and sighs. \"Okay, I guess he does need to unwind after you scared him like that.\" she says. \"You can use my bed.\" The dragoness carries you to the bedroom and tosses you onto your master's bed. You don't understand. She said she wanted to play but instead she's throwing you around. You start to get scared again, wondering what she'll do next. She then starts taking her clothes off and you wonder if she's going to sleep.The next thing you know she's plopping down on the bed, causing you to spring up and back down. You roll down the mattress and bump into her giant ass cheek. \"You must be a little confused.\" she says. \"Um, yes. ma am.\" you say. \"I thought we were going to play.\" She grins. \"Oh we will. Your little brain might not get it at first, but when your male instincts kick in you'll love it.\"<br>\r\n<br>\r\nShe picks you up and places you between her giant boobs as she lies on her back. You look around at the mountains on either side as she glances down at you. \"Climb them.\" she orders. You comply immediately, not wanting to make her mad. It takes a little while but you reach the top of her breast, with Doreen giggling the whole time. You see something big in the center and are drawn to it. When you reach it you touch it and it grows slightly. \"Ohh, keep it up.\" she moans. You do as she says and the things grows larger and larger. You feel yourself getting an erection as you do this. Your little human brain finally puts two and two together. This is her nipple! Upon realizing this you start gripping it tighter, sending shivers down her spine. You then nibble on it and rub your erection along it. Her giant fingers come down and begin twisting it, pressing you against it in the process. Her fingers are working her vagina down below and she twitches as she goes. She finally stops and pulls you away from her nipple. You look disappointed but she smiles. \"We're not done yet.\" she tells you.<br>\r\n<br>\r\nAnother finger comes from her vagina and presses down on you. The juices cause you to stick to it and you are taken for a ride. You arrive in front of her snatch and she wipes her finger against it. You come off onto it and struggle to get free. As you do you stimulate her labia and she begins twitching some more. You break free but keep clinging to her labia. You climb it and when you see her clit you grab it. This causes her to spasm uncontrollably and she begins masturbating again. As her finger plays with her clitoris you also begin biting it, causing her to reach climax faster. When it happens she spasms and then a flood of thick liquid rushes out of her vagina. You fall off and land in it, finding it hard to move in it. From above you hear Doreen speaking. \"I hope you enjoyed that, because I think I want some more.\" she says. Just then booming footsteps approach and you look up to see your master standing over the bed. What does she say?</span></div></div>",
            "created":1407042000,
            "id":1837041,
            "title":"A Really Big Treat"
        },
        "1142321222":{
            "author_id":"infinitebull",
            "author_name":"InfiniteBull",
            "choices":[
                "Go To Work With Veronica",
                "Go To Work With Doreen"
            ],
            "content":"<div class=\"\"><div> <span>Your master looks at the scene before her with her hands on her hips. Part of you is still aroused but part is also kind of scared. Is she mad? But she said it was okay if you had a treat! You begin to shiver a little but then look up again. She's taking off her shirt and pants. \"Damn it Doreen, I was going to make him earn this but you got me all horny now.\" she says. Doreen grins and tosses you down between her legs. \"Well I am your girlfriend after all, I'd like to think I make you horny.\" You stare from one to the other in confusion. Girlfriend? You don't have much time to think before your master plops down onto the bed. Now there is a giant on either side of you and you start to feel intimidated. \"He's a nervous little guy isn't he?\" Doreen notices. \"Thats good in a way.\" your master says. \"He knows his place.\" The two of them lower their faces to you and smile. \"This might be a little late but this is Doreen, and she's your master too.\" Veronica says. With two huge beauties this close you begin to turn red.<br>\r\n<br>\r\nWithout warning each one of your masters lowers their tongues on you. They lick the other's tongue with you caught in the middle. They separate with you wrapped in Veronica's tongue and she pulls you into her mouth. You are surrounded be saliva and giant teeth as she swirls you around. Soon her mouth opens and light floods in only to be blocked again. Doreen's tongue enters and they once again play with you together. Their tongues wrestle with each other and throw you around. You end up swallowing quite a bit of saliva but you find it actually tastes good. After a while you are grabbed by Doreen and she pulls you out into the open air. She lowers her head toward Veronica's boobs and begins licking her nipple with you along for the ride. \"Hey, start doing your part.\" Veronica says as she breathes heavily. Following orders you grab hold of the nipple and squeeze and bite like crazy. You and Doreen work hard as Veronica pants. The giant tongue lifts up and you are caught in a strand of saliva. You drop to the bed below and are between their massive pussies. The two of them move closer and you are mashed between their privates. As they make out above you their juices coat you and your arms and legs end  up inside the both of them. Soon everyone climaxes and you are laying in a puddle of mixed juices.<br>\r\n<br>\r\n\"Whew!\" Doreen says as she wipes her forehead. \"Didn't expect to do that this morning. I'd say this little guy is already pretty useful.\" She scratches underneath your chin and you smile at the praise. \"Yeah, I knew he'd be a good little boy.\" Veronica says and also gives you a scratch. The fun ends however when they get up and begin getting dressed. \"Well now that we've started the day with a bang we should head to work.\" Veronica says. \"Maybe our little bed buddy would like to come too.\" Doreen suggests. The two of them decide you will...</span></div></div>",
            "created":1407646800,
            "id":1840004,
            "title":"Between Two Masters"
        },
        "11423212222":{
            "author_id":"infinitebull",
            "author_name":"InfiniteBull",
            "choices":[
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll take him with me today.\" Doreen says. \"Are you sure?\" Veronica asks. \"Yeah, it'll give him a chance to get to know me better.\" the dragoness says. \"Until we move in together he'll be with you most of the time so I want him to get used to me too.\" You listen to the conversation between your two gigantic masters. You get to live with both of them one day? This is great! Veronica is really nice and Doreen seems to like you. You are so glad the days of the pet store are behind you now. Not to mention you're hoping for more \"treats\" in the future. \"Well okay.\" Veronica says. \"Just be sure to keep him safe.\" Doreen gives her a kiss and picks you up. \"Don't worry, I'll take good care of him.\" she says and puts you in a small cage Veronica bought for traveling purposes. \"Are you ready little guy?\" she asks, and you nod.<br>\r\n<br>\r\nOnce again you find yourself riding in a car. You're still a little scared at first but looking up at your master calms you down. \"Almost there.\" she says as she puts a hand on your cage. Soon you come to a stop and she grabs your cage. After getting out of the car she enters a building and you look around. There are a lot of tables and chairs. There are even little sections near the walls where it looks like people can sit separate from everyone else. Doreen walks behind a long counter with stools in front of it. \"This is called a bar little guy.\" she tells you. \"People come here to have a good time, and I serve them their drinks.\" You look around and don't see many people. \"We're getting ready to open.\" she says. \"I tend to work varying shifts and today I'm on day duty.\" She sets your cage on the counter and begins rummaging around, getting ready for work.<br>\r\n<br>\r\nA rumbling then starts and huge badger woman comes out of a door behind the counter. She's got long black hair with white highlights and a nice hourglass figure. \"Hey Doreen.\" she says but then she's sees your cage. \"Whats this?\" she asks and plants both hands on the counter. Its so sudden you are knocked to your feet as she lowers her face to get a better look. \"You brought your pet? You know this isn't the place for that.\" she says sternly. \"Come on Betty.\" Doreen says as she takes you out. \"He's perfectly sanitary and just look at how cute he is!\" She holds you up but Betty doesn't look impressed. You smile nervously and wave but she just sighs. \"Yes he's great but just make sure he stays out of trouble.\" the badger says. Another woman, this one a very chubby cow girl, walks over and gets a look at you. \"Oh he's so cute!\" she says. She's got shoulder length brown hair and enormous breasts. You get a great look at them before Doreen returns you to your cage. \"Thanks Bonnie. Veronica bought him yesterday and I'm just taking him out for the day.\" Bonnie and Doreen get to talking and it seems she works here too. You see them open the place for business and your day begins. How does it go?</span></div></div>",
            "created":1408165200,
            "id":1842746,
            "title":"Go To Work With Doreen"
        },
        "114232122221":{
            "author_id":"infinitebull",
            "author_name":"InfiniteBull",
            "choices":[
                "You're Drunk",
                "You Pass Out"
            ],
            "content":"<div class=\"\"><div> <span>You sit in your cage as Doreen works. You have a clear view of everything from your position, but there's not much to see. A few people come in but nothing really exciting happens. After some time passes and it gets later in the day however, more people show up. From your spot behind the counter you see some people sitting there drinking as they chat with Doreen. Bonnie will also come up to the counter and get drinks to take to others. Every now and then she comes up to your cage and sticks a finger in to pet you, which you appreciate greatly. \"You doing okay?\" Doreen asks at one point when she has a break in customers. \"Yes master.\" you tell her. She smiles and reaches for a small plate to the side. \"Here you go.\" she says and offers you a small piece of what smells like onion, but its got some kind of bread on it. You taste it and then gobble it down. \"The kitchen's closed while we get some stuff fixed but we can still make some food.\" Doreen says. <br>\r\n<br>\r\nAs the day goes on you sit quietly. One group of girls sits at the counter and one of them, a doe, sees you as they talk and drink. \"Excuse me, what is that?\" she asks Doreen. \"Oh thats my little pet. I brought him along today to give him a taste of the world.\" Doreen says. \"Can I get a closer look at him?\" she asks. Doreen smiles and puts your cage on the counter. The doe peers inside and grins. \"He's so cute!\" she says. \"He is kinda cute.\" her friend, a sheep girl, agrees. Soon all the girls are fawning over you and you love it. Doreen grins as she watches. \"The little guy just loves attention.\" she says. \"Can I hold him?\" a squirrel girl asks. \"Okay, but real quick.\" Doreen tells her and gets you out of the cage. The squirrel picks you up and pets you gently with a smile. You enjoy the petting and also the view of her breasts as she does so. When she finishes she sets you on the counter to watch you walk around.<br>\r\n<br>\r\nNext the sheep girl picks you up and begins to pet your head. Everything is fine until someone behind the girls backs up and bumps into her. She fumbles with you but ultimately drops you forward. You're afraid you'll get hurt but land in her drink instead. As you try to get to the top some of it gets in your mouth and you find it rather tasty. Its sweet, and if you can recall you heard her call it \"wine\" when she ordered. You become a little greedy and begin drinking more of it as you float in the glass. Soon though you are fished out and placed on the table.\"Are you okay?\" Doreen asks worried. You feel great at first but suddenly start to feel a little woozy. The next thing you know...</span></div></div>",
            "created":1408683600,
            "id":1845871,
            "title":"Meeting The Customers"
        },
        "1142321222211":{
            "author_id":"infinitebull",
            "author_name":"InfiniteBull",
            "choices":[
                "You Feel Fine",
                "You're Hungover"
            ],
            "content":"<div class=\"\"><div> <span>You find yourself stumbling as Doreen looks on with a concerned look. You fall forward and she puts out a claw to catch  you. When you land on it you grab it and hug your body to it. The three girls find this adorable and coo at you while you cuddle Doreen's finger. Your dragoness owner lifts her hand with you still attached and brings you to her face. \"Oh he's drunk.\" she says with a sigh. \"Really? Can I see him?\" the sheep asks. Doreen looks hesitant but holds you out for her to see. As the giant sheep peers at you her squirrel friend nudges her. \"Jeez Wendy I know you need a man but getting him drunk?' she says with a laugh. \"Shut up Pam.\" Wendy replies with her own chuckle. <br>\r\n<br>\r\nWhile the two girls banter they get your attention. You look up from your spot in Doreen's hand and see them shoving each other playfully. Your focus is brought to their breasts, which are jiggling slightly as they shove each other. In your alcohol ridden mind those breasts look very inviting, like giant pillows. With a drunken smile you jump from your owner's palm and land inside Pam's cleavage. The squirrel lets out an EEK and looks down. When she spots you she starts laughing and gets her friend's attention. \"I guess the little guy's feeling a little more daring.\" she says. \"I'll bet, with that liquid courage in him.\" the doe says and fishes you out. \"Stealing my buddy, Dana?\" Pam asks. \"I'm just giving him back to his owner.\" she answers. Before she can though you make another jump into Wendy's boobs. It feels like heaven. They're bigger than Pam's, and while the squireel's furry breasts were comfy, these woolly ones are divine. Its like cuddling with a cloud.<br>\r\n<br>\r\nAfter a little more playtime with the three girls Doreen finally takes you back. \"You should bring him more often!\" Pam says. Not wanting to draw her bosses attention Doreen puts you back in your cage. \"You're a popular little guy huh?\" she asks as she scratches your head. When her shift is finally over she heads home with your cage in tow. \"Guess you got an up close view of my job.\" she says with a smile. \"Lets just keep the whole getting drunk thing between you and me though okay?\" She pets your head before starting the drive home and you drift off to sleep. When she gets home and you wake up how do you feel?</span></div></div>",
            "created":1411016400,
            "id":1858594,
            "title":"A Little Tipsy"
        },
        "11423212222111":{
            "author_id":"infinitebull",
            "author_name":"InfiniteBull",
            "choices":[
                "Your Masters Have The Day Off",
                "You Go To Work With Veronica"
            ],
            "content":"<div class=\"\"><div> <span>Doreen gets to Veronica's place and grabs your cage. \"Okay, little guy. Home sweet home.\" she says. You don't hear her because you're still asleep as she carries you inside. Veronica is sitting in the living room watching TV when her girlfriend walks in. \"Hey sweety.\" she says as Doreen sits down next to her. They share a kiss and Doreen puts your cage on an end table. \"So how did he like it?\" Veronica asks. \"I think he had a good time.\" Doreen answers. \"The customers loved him. He's popular with the ladies.\" The beautiful fox laughs. \"He is a little cutie. Thats why I picked him out after all.\" She reaches into your cage and pats your head with a finger, which wakes you up. You rub your eyes slowly and yawn before opening them all the way. When you see your masters you perk up and smile. \"Hey little guy! Did you miss me?\" Veronica asks. You nod happily as she opens your cage. Doreen is secretly thankful that you don't have a hangover.<br>\r\n<br>\r\nVeronica pets you in her palm as she and Doreen chat. \"So I'm about set to start moving my stuff.\" Doreen says. \"Already?\" Veronica asks. \"You must be pretty eager to move in.\" Doreen smiles and gives her a kiss on the cheek. \"Well of course! I love you!\" she says. \"Besides, I'm sure our pet would love to see both of his masters first thing in the morning.\" They both look down at you knowing you're listening. You nod your head and are treated with a scratch under your chin. \"Well we wouldn't want to keep him waiting, now would we?\" Veronica says. Doreen puts an arm around her and they watch TV until its time for bed.<br>\r\n<br>\r\nWhen your two masters decide to turn in Doreen says she'll stay the night. Veronica puts you back in your cage and carries you to the bedroom. She places you on the dresser and Doreen comes up from behind and hugs her. \"Come on, lets get to bed.\" she says in a seductive voice. Veronica sees the hopeful look on your face and bends down to your cage. \"Sorry, but you're not coming along this time.\" she says, much to your disappointment. She reaches in and pets you with a smile. \"Your little treats are just that. TREATS. We can't give them to you all the time or you would end up spoiled.\" she explains. You give her a sad look and Doreen leans in. \"Not gonna work little guy, so just bear with it.\" They head to the bed and she gives you a glance. \"Nice try though.\" The two of them start to go at it and you watch in excitement. When they finish the both of them lay there before Doreen reaches for the lamp by the bed. As she pulls the cord she gives you a wink. She must have kept the light on so you could watch! You smile back and think about how wonderful she is. You really love your masters. The next day...</span></div></div>",
            "created":1412485200,
            "id":1867311,
            "title":"You Feel Fine"
        },
        "114232122221112":{
            "author_id":"infinitebull",
            "author_name":"InfiniteBull",
            "choices":[
                "One Of Her Coworkers",
                "Her Boss"
            ],
            "content":"<div class=\"\"><div> <span>The next morning you wake up and yawn. The sound of walking draws your attention and you see both of your masters getting ready for work. Doreen walks over to your cage and takes you out. \"Morning little guy.\" she says and pats your head. Your eyes trail downward and see that she's currently in her bra and underwear. \"Sorry, no time for any of that.\" she says and sets you back down. \"We've got to get ready for work.\" As she walks away Veronica walks in straightening her outfit. She's wearing a blouse with a long skirt and has her hair done up in a bun. She looks pretty formal. \"Hey there.\" she says with a smile and pets you. \"Guess what? You get to come to my job today!\" You smile and hug her finger. \"I don't think it will be as fun as yesterday though.\" Doreen adds as she walks by putting a shirt on. Veronica rolls her eyes. \"Hey it puts food on the table.\" she says. After they're ready you all have a small breakfast and head out.<br>\r\n<br>\r\nDoreen gives both of you a kiss before driving away in her car. Once you're alone Veronica places you back in your cage and sets you in the passenger seat of her car. \"So are you ready to come to my work?\" she asks. You nod happily and she giggles. \"Good, and don't worry, its a very safe place.\" she tells you. After the drive there she takes your cage and gets out of the car. she carries you into a large building and walk to an elevator. When she reaches her floor she walks down a hallway, passing other women on the way. You marvel at all the pretty ladies and wonder what this place is. Soon your master arrives at a cubicle and sits down. As she places your cage on the desk you see a computer, which she starts up and begins typing on. She looks at you and smiles. \"I know a desk job isn't as fun as a bar, but it pays good.\" she tells you.<br>\r\n<br>\r\nYou sit in silence as she types and start to doze off. Every once in a while she looks over at you with a smile as she works. When you wake up you see that nothing has changed, but then someone walks over. Its...</span></div></div>",
            "created":1413608400,
            "id":1873945,
            "title":"You Go To Work With Veronica"
        },
        "1142322":{
            "author_id":"fancyknife",
            "author_name":"TheCrimsonFreak",
            "choices":[
                "Bring on the Pachyderm!",
                "Nah..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe a rather, ahem, \"pear-shaped\" hippo woman?</span></div></span></div>",
            "created":1390539600,
            "id":1732629,
            "title":"A hippo, perhaps?"
        },
        "11423222":{
            "author_id":"fancyknife",
            "author_name":"TheCrimsonFreak",
            "choices":[
                "A Dragoness Mistress? Dangerous, but fun!",
                "No way!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if your mistress was a more...<i>dangerous</i> sort of creature? One that comes from myth and legend.<br>\r\nSay, a <b>Dragon</b>? </span></div></span></div>",
            "created":1409115600,
            "id":1848336,
            "title":"Here Be Dragons!"
        },
        "114232222":{
            "author_id":"2wakawakalol",
            "author_name":"1WAKAWAKALOL",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about a grizzly bear?</span></div></span></div>",
            "created":1458536400,
            "id":2120586,
            "title":"other"
        },
        "1142322222":{
            "author_id":"dinosaurking",
            "author_name":"dragon",
            "choices":[
                "Dinosaurs or Ice Age?",
                "Other?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one that is supposed to be extinct, like dinosaurs or ice age creatures?</span></div></span></div>",
            "created":1505986980,
            "id":2388862,
            "title":"no"
        },
        "11423222222":{
            "author_id":"dinosaurking",
            "author_name":"dragon",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a MLP pony?</span></div></span></div>",
            "created":1546722180,
            "id":2599315,
            "title":"Other?"
        },
        "115":{
            "author_id":"carlosanchez",
            "author_name":"Hazari",
            "choices":[
                "Calm on and obey",
                "Go back and protest",
                "Go to the exterior"
            ],
            "content":"<div class=\"\"><div> <span> The night it's cold and dark and nobody walk for the lonely streets of the ghost town, the buildings have nearly lost any sign of be inhabited, the paint of the walls has begin to fall in small scales, the windows have cracks or are fallen to the ground and some roofs  are now submitted to the element of weather. It’s hard believe what one up on a time where this streets were full of life and prosperity.<br>\r\nThe silence of this massive tomb it is violated for the small sound of steps running between the dilapidated structures, like subtle shadows this emissaries of a remote past cross the darkness  with agility. Finally they come to a very special ruin, a decrepit building of three floors, it’s wrecked structure was nearly to collapse, thanks to the immense damages of the structure. <br>\r\n<br>\r\nThe strange figures await in front of the building from where his relatively still intact façade what in his top in big letters was yet readable: Ashtown Town Hall<br>\r\nFinally the wait ended when the last figure come to the town square , making the group of  a total of seven what decide enter to the wreck It Town hall for the principal door. The seven going down for long stairs and corridors to a special room in what in his door was written “Fallout Vault”<br>\r\nNobody follows you-exclaim a feminine voice from the inside.<br>\r\n<br>\r\nAll the ways are abandoned, Anna-claim a full dressed human soldier with respect to the women.<br>\r\n<br>\r\nYou a young man dressed with a military uniform take the word- Miss Stendhal we finally find the perfect targets for our plan.<br>\r\n<br>\r\nAt the same time your friend, Alex, take a few of papers and photos and  walk to the center of the room where a council of 12 persons was seated in chairs behind a large table. A old man took the papers and immediately start to distribute at the group what look it’s with great satisfaction.<br>\r\n<br>\r\nMr. Taylor, thanks again for your services-said the woem with great happiness- You and  the men under your command are the greatest  example of the Expedition Corp of the P.A.G. (Provisional American Government).<br>\r\n<br>\r\nAfter the brief show of gratitude, a pair of soldiers, even more impressive that your goup orders you to leave immediately. Soon you are your pals go to the common room whre more of 30 men and women try to rest in the small space of a basement. You reaction is a great disappointment, you have risked your life thousands of times for the last 5 years and at your 23 years you are lieutenant of your squadron and still that damned bureaucrats tract you like a child.<br>\r\n<br>\r\nFilled with rage you decide</span></div></div>",
            "created":1422853200,
            "id":1927228,
            "title":"All according to the plan."
        },
        "1151":{
            "author_id":"carlosanchez",
            "author_name":"Hazari",
            "choices":[
                "The chubby hen",
                "The bulky goat",
                "The girly iguana"
            ],
            "content":"<div class=\"\"><div> <span>That that anger is dangerous what make you immediately try to distract your mind for more pleasant things but sadly nothing come to your mind, for the last 18 years, life was a constant struggle for survive. Since the mysterious event that transform all animals in macro humanoid of 50 ft the few surviving humans have to reduce to live in remote regions leaving to a even few groups to fight this war.<br>\r\nSadly the war has being lose, in the beginning they were susceptible to chemical and nuclear weapons but since for the last 7 years the giants has started to organizes between them and his attacks has destroyed any human capacity for fight them directly and if that doesn’t was sufficient they have starting to build giant cities in the areas that they dominate.<br>\r\n<br>\r\nFinally the PAG has decided that a new strategy was needed, something new and radical. The Trojan Horse Operation or how it was called for the common soldiers’ operation Pet time who was designed infiltrate some soldiers how pets to the macros in hope for find weaknesses behind the enemy lines.<br>\r\nYou was waiting that the Council choose you how first recruit for this mission anmd finally do something significant against the race what take your family and town. Finally you start to notice your fatigue and soon you slept like a baby between all your group.<br>\r\nTo the next morning you felt something weird, something that you don’t filled for long years. The commodity of a bed, what make you awake confused. You see that you don’t are in the room with the rest of the soldier instead you rest in a small white room with only a bed and a screen in a wall. Suddenly a voice come form that mentioned screen-God morning Lieutenant Taylor, we sorry foe don’t give you notice of this mission but we know how our dare discipline is and we decide make this the most secret. <br>\r\n<br>\r\nAre you saying that I will be part of Operation Trojan Horse?-you exclaim confused<br>\r\n<br>\r\nYou are our finest element, Mr Taylor , your last data was the vital information that we needed, Today we will change history and make this macros return to the filthy place that they belong. <br>\r\n<br>\r\nDuring the rest of the day they explain you that they will go to leave you in the exterior of the macro city, in the place where the targets going to be located. You notices that your cloth was changed for civil ones and certain gadgets were give to you, a small radio who was inserted in your head like a implant, was rechargeable  and activated with your voice and a eye contact with a micro camera for take photos.<br>\r\nFinally after all preparation you go up to a small plain, what will fly near to the city and leave you fall with a parachute near to a place that accord to your data look like a park. The emotion increased every second and when your plain was in fact over the giant city you jump to the vacuum filled with hope. When you are to a height of 5000 ft you activate the parachute and your descend it’s slowed in great measure.<br>\r\n<br>\r\nThe park where you are landing it’s a strange place, for unknown methods the macros make that the plants starting to grow for be to the same proportion than themselves, what make the place look like a fantasy place. When you finally touch the ground immediately you hide the parachute and with military precision you occult between bushes located near to a road from where your targets will came, a group of girls.<br>\r\n<br>\r\nJean, Amy and Henrietta were the best friends; they have the same age, 17 years, and never see a human with their eyes, making the unique thing that they have in common.<br>\r\n<br>\r\nJean is a slender green iguana, with a row of brown spines in her back and a very long tail, she wears a simple t-shirt and a skirt .she is an extrovert girl who talks always excited.<br>\r\n<br>\r\nAmy is a tall and buff goat, his bulky body scarcely fit her adjusted sport suit, she look like be a tomboy but she don’t talk like a stereotypical jock instead she sound very smart and gentle.<br>\r\n<br>\r\nFinally was Henrietta, the biggest of the three a chubby hen with a great bust but in contrast with her friend she was dressed in a very modest way, what reflect perfectly her shy personality.<br>\r\n<br>\r\nYou look to the three with excitation, soon you will make eye contact and that should look in the form more realistic possible way.<br>\r\n<br>\r\nThe girls was talking about their problems when suddenly they hear a small sound from the bushes. They stop immediately and go to the bushes to investigate, soon that same sound happens again and the three decide examine in detail the bushes. <br>\r\n<br>\r\nThe plan it’s a success and after a moment of great suspense, you are found for…<br>\r\n</span></div></div>",
            "created":1422853200,
            "id":1927263,
            "title":"Mankind last hope"
        },
        "11511":{
            "author_id":"carlosanchez",
            "author_name":"Hazari",
            "choices":[
                "Share you, with the others",
                "Keep you, for herself"
            ],
            "content":"<div class=\"\"><div> <span>The way between thee branches and leafs of that giant bush make you fell anguish and excited at the same time.  You know that e three giantesses are very near beside the fact that you don’t see them, the unmistakable sound of steps and tweets being brokered it’s enough evidence for you.<br>\r\nSuddenly the darkness of your hiding place its interrupted for straight  rays of lights, momentary your eyes can see anything, but immediately how the light appear this it’s gone when a big object interpose between you and the sun.<br>\r\nOne of the titan monsters finally has spotted you, for an awkward instant was a silence what very soon you will miss.<br>\r\n<br>\r\n-Look what I founded! - Exclaims with a loud voice the giant creature.<br>\r\n<br>\r\nImmediately you start to feel the temblors of the other two, what bow down around the fat giant, treating of give to you a look. The three animal faces were battling for give you a inspection and how you was expected they was excited of you.<br>\r\n<br>\r\n-How a little human come here? -  Ask the green one with a firm tone.<br>\r\n<br>\r\nPossibly is a kind of prisoner- Respond the one muscled one with the face of  a goat.<br>\r\n<br>\r\nWell, whatever be the reason, I see he first- exclaims the giant bird in a shallow tone.<br>\r\n<br>\r\nNo take much time for this three beast start to discuss, apparently they really want have you, but it’s evident that the chicken was the least interested in fight, besides of be the biggest with her 60 ft. of height,  what defy the natural limit of 50 ft, she  avoid any conflict with her friends.<br>\r\n<br>\r\nExcuse me , please, don’t fight for me, I don’t deserve that kind of attention – you interrupt their petty brawl, treating sound sweet and the same time, scared. You immediately notice that your tactic it’s an exist when the three give a collective awww how if you were a nice puppy.<br>\r\n<br>\r\nThe chicken rapidly extend his hand, what grab you like a small doll and raise you carefully avoiding the pointy tweets of the bush. Sadly this exposition to the air its immediately interrupted when she put you in her breast and hug you like a small baby, the suffocating pressure of her plump arms almost leave your longs without air.<br>\r\nFortunately one of her friends points to the excited bird, that you look are wriggling excessively and what her should be more careful. Thankfully she obey at the instant and you can breathe again with normality.<br>\r\n<br>\r\n-I sorry little one, I never have a little friend, but that don’t excuse of nearly squish you- she talks with a shamed tone.<br>\r\n<br>\r\nYour vision of his avian head from a so short distance give you a confused series of emotions, being the first, fear to her terrifying and imposing look,  following with your rage against this beings and your wish of kill them all and finally you desire to win this war what mean have to hide yourself with this pathetic façade.<br>\r\n<br>\r\n-Thank you for save me of the bad furs, You don’t know how I filled here alone, waiting no be founded for the soldiers.<br>\r\n<br>\r\nShe instantly down her head with her flexible neck to her chest and with his beak she give you a kiss, what give you chance of look inside her mouth a gigantic hoe what can eat your whole body. <br>\r\nThis painful show of emotions it’s interrupted for the others that require the turn for touch you and give you caress. Immediately you turn your head to the giant chicken what for his look she will…<br>\r\n</span></div></div>",
            "created":1425099600,
            "id":1941187,
            "title":"Little Lady inside Feathered Fiend"
        },
        "11513":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "A girly iguana",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who found you?</span></div></span></div>",
            "created":1510045620,
            "id":2412114,
            "title":"The girly iguana"
        },
        "115132":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Sexy fox girl",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who found you?</span></div></span></div>",
            "created":1533834120,
            "id":2531113,
            "title":"More"
        },
        "12":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "Young Child (6-9 Years)",
                "Adolescent Child (10-12 Years)",
                "Young Teen (13-16 Years)",
                "Older Teen (17-20 Years)",
                "Adult (21+ Years)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What age are you?</span></div></span></div>",
            "created":1385269200,
            "id":1698731,
            "title":"Age Group"
        },
        "125":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Steph Tsunade, human pet of a dog anthro",
                "Olapen, pet of a dragon anthro",
                "Other choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose your female!</span></div></span></div>",
            "created":1583567820,
            "id":2797730,
            "title":"Adult (21+ Years)"
        },
        "13":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "Young Child (6-9 Years)",
                "Adolescent Child (10-12 Years)",
                "Young Teen (13-16 Years)",
                "Older Teen (17-20 Years)",
                "Adult (21+ Years)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What age are you?</span></div></span></div>",
            "created":1385269200,
            "id":1698732,
            "title":"Age Group"
        },
        "131":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "6 year old dog",
                "7 year old wolf",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You're a...</span></div></span></div>",
            "created":1397019600,
            "id":1776087,
            "title":"Young Child (6-9 Years)"
        },
        "1313":{
            "author_id":"tntdmd",
            "author_name":"TnTdmd",
            "choices":[
                "8 year old horse",
                "9 year old deer",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You're a...</span></div></span></div>",
            "created":1412571600,
            "id":1867636,
            "title":"Other"
        },
        "13133":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "6 year old fox",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You're a....?</span></div></span></div>",
            "created":1510181040,
            "id":2412728,
            "title":"Other"
        },
        "14":{
            "author_id":"jdtd7197",
            "author_name":"jdtd7197",
            "choices":[
                "Young Child (6-9 Years)",
                "Adolescent Child (10-12 Years)",
                "Young Teen (13-16 Years)",
                "Older Teen (17-20 Years)",
                "Adult (21+ Years)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What age are you?</span></div></span></div>",
            "created":1385269200,
            "id":1698736,
            "title":"Age Group"
        },
        "141":{
            "author_id":"dean3",
            "author_name":"Sean",
            "choices":[
                "Dresser, it is the correct place",
                "But the bed will be comfy and nice",
                "Oh he is waking up"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok liliana, you can have a pet, but taking care of it is a must, I don't want him near me so you have to train him and bring him to school with you, if you lose him, I won't get another so keep him close at all times, and only let someone borrow him under your supervision\"<br>\r\nMom always would say. I knew I would keep him close always, I love those pets, some can be mean though. Some are weird, my mommy said it was something I might think of when I was 13 or so.<br>\r\n<br>\r\n      I finally make it to the store and immediately find a scared person in the corner of a cage. \"It's okay whittle guy, I won't let anyone hurt you again\" I put on a brave face for him and hold him against my chest, I walk up to the counter and stand on my tippy toes, \" I wana but this guy mista\" I say holding this up and bringing out my allowance. I have stuff already for him, my mom told me I would need to<br>\r\n<br>\r\nWhen I get home I realize he is still scared, if I put him in his cage he might get scared. So I walk up the stairs and enter my room I can let him rest on my dresser, talk to him on my bed, or let him think of something.</span></div></div>",
            "created":1482296400,
            "id":2252728,
            "title":"Young Child (6-9 Years)"
        },
        "1412":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "talk",
                "cage",
                "play"
            ],
            "content":"<div class=\"\"><div> <span>You decide that he will probably be less scared if you laid on the bed at his level. So you go to your bed and spin in a circle before laying down then you place your new pet on your bushy black tail. You always wondered by you spun around before sitting or laying but, your mom said it is just something wolf have always done. You look down at the new pet shivering and pressing himself into your tail away from your face. You find the pointless attempt to be cute so you calmly introduce yourself, \"Hi I'm Alison, Alison Wolf but, I'm usually called Ali, I'm going to be your master now so I will take good care of you. Do you have a name?\" <br>\r\n<br>\r\nHe looks up at me as if he didn't expect me to talk to him. He still looks scared which is cute in it's own way and he softly answers, \"I... I was told... that I would be given a name.\" He says with his head down. \"So you don't have a name yet?\" I say mainly to myself but, he nods anyway. \"Well a cute little guy deserves a cute little name so how about Toby.\"<br>\r\n<br>\r\n\"Toby?\" he replies and I nod with a big smile. \"I like it,\" he says with a small smile, it isn't much but your glad to see that he is warming up to you. In your excitement you forgot that you set him on your tail so a few happy wags sends him flying towards you. With a giggle you say, \"Sorry Toby got a little excited there do you want to play a game, see your cage or just get to know each other?\" and he replies...</span></div></div>",
            "created":1486616400,
            "id":2275769,
            "title":"bed will be comfy and nice"
        },
        "14121":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "it's time to show him to mom and dad",
                "play time"
            ],
            "content":"<div class=\"\"><div> <span>Toby looks up to me and asks, \"why did you buy me.\" He pauses seeming unsure of why he is asking, \"Most humans are less scared of people then me.\" It is really cute watching him nervously asking questions so I decide I'll tell him the truth. I lay my head right in front of him and he shivers but doesn't retreat this time. \"If I tell you will you promise to keep it a secret?\" I ask and he quickly nodes his head.<br>\r\n<br>\r\nAfter a deep breath I tell him, \"I have trouble talking to others, when I try to meet new people I get scared and run away. Then I saw you sitting there shacking in the cage and since you are scared of me there's no reason to be scared of you.\" As I smile at him I slowly bring my hands around him and softly lift him as I turn on my back. \"I know your scared but I promise to keep you safe as long as you promise to be my friend.\" He agrees and...</span></div></div>",
            "created":1489554000,
            "id":2289945,
            "title":"settling in"
        },
        "141212":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "House",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to play a game with him. <br>\r\n<br>\r\nWhat game did you play?</span></div></span></div>",
            "created":1536976500,
            "id":2547865,
            "title":"play time"
        },
        "1412122":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Hide and seek",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other games did you play?</span></div></span></div>",
            "created":1542006300,
            "id":2576536,
            "title":"Something else"
        }
    },
    "info":{
        "author_id":"jdtd7197",
        "author_name":"jdtd7197",
        "brief_description":"A parallel universe where not only are animals giant anthros, but you're their pet.",
        "created":1385342640,
        "description":"<td align=\"left\" class=\"norm\">This story is set in a parallel universe where animals are instead anthros who grow up to 50 feet tall. Houses are adjusted to massive sizes to accommodate for this. Only this time, you're the pet.<br>\r\n<br>\r\nSome small rules:<br>\r\n- The pets are intelligent beings and speak and walk like humans.<br>\r\n- No graphic violence.<br>\r\n- Sex and other explicit content is permitted.<br>\r\n- Sex with animals in this world is seen as perfectly normal and fine.<br>\r\n- NO killing off main character(s)<br>\r\n- Please have the chapters make sense.<br>\r\n- The animal size will start off small (they can be held in human arms) but as they get older will quickly outgrow humans.<br>\r\n- The animals will age in human years so to keep it all tidy.<br>\r\n- Exotic animals are perfectly fine as well<br>\r\n- Fictional animals (dragons, Pokemon, etc) are also OK.<br>\r\n- If you choose to be an anthro specify what species you are please, or I'll just pick one at random.<br>\r\n<br>\r\nPlease add and have fun!</td>",
        "id":1964112,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1583567820,
        "modified":1583567820,
        "pretty_title":"Pet To A Macro Furry"
    }
}