{
    "chapters":{
        "1":{
            "author_id":"dustindemon",
            "author_name":"Dustin",
            "choices":[
                "Velma Dinkley",
                "Daphne Blake",
                "The Hex Girls",
                "The Grimwood Girls",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's the lucky victim?</span></div></span></div>",
            "created":1325653200,
            "id":1252541,
            "title":"Pick a character!"
        },
        "11":{
            "author_id":"dustindemon",
            "author_name":"Dustin",
            "choices":[
                "A creepy carnival!",
                "A macabre museum!",
                "A loopy laboratory!",
                "A scary shopping mall!",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where is the mystery going down? </span></div></span></div>",
            "created":1325653200,
            "id":1252545,
            "title":"Velma Dinkley"
        },
        "111":{
            "author_id":"dustindemon",
            "author_name":"Dustin",
            "choices":[
                "the Big Top!",
                "the food court!",
                "the carnival games!"
            ],
            "content":"<div class=\"\"><div> <span>\"Jinkies... If I had known the others weren't going to show up, I wouldn't have come!\" Velma said to herself. She shivered as the cold wind blew against her. She had heard about some strange things happening at the old, abandoned carnival down by the docks. She had planned to meet the others, but she was the only one who showed up. \"Nice, guys, leave me with all the work...\" It was pitch black. The sleuth was surrounded by run down carnival games and ripped tents. She shone the flash light in front of her, every now and then thinking she saw something move out of the corner of her eye. \"Is anybody heeere?\" she called out, when suddenly...<br>\r\n<br>\r\nFLASH!<br>\r\n<br>\r\nthe lights of the carnival turned on, bright lights of every color flashing  in her glasses. \"Jinkies!\" she tensed up, looking around in alarm. The sounds of the carnival rides and games slowly rose up, accompanied by eerie carnival music. \"I-I'll find whoever's doing this!\" she stammered, shining her flashlight in various directions, when her eyes caught...</span></div></div>",
            "created":1325653200,
            "id":1252552,
            "title":"A creepy carnival!"
        },
        "1111":{
            "choices":[
                "Bring out the elephants!\"",
                "Bring out the clowns!\"",
                "Bring out the Freak Show!\""
            ],
            "content":"<div class=\"\"><div> <span>\"I guess I should check out the Big Top first...\" Velma said to herself, \"That's where the BIG shows happen!\" <br>\r\n<br>\r\nShe made her way over to the giant blue tent (which had its tears and holes repaired, somehow) and peeked through. She was right! There was a show going on inside! There were lights shining all around inside, music playing, and right in the middle was a curvaceous female ring leader. <br>\r\n<br>\r\n\"Come one, come all! Come see the Marvelous Magnolia's Transformation Carnival!\" the raven haired ring leader called out, \"Once you see it, you'll NEVER be the same!\" Velma made sure to make slow, quiet movements, slowly slipping into the tent. \"Now, I'm going to need some help down here in the ring! Any volunteers?\" Magnolia called out. Velma had only made it a few steps before the spotlight shone on her. She stopped dead in her tracks. \"YOU there!\"<br>\r\n<br>\r\n\"W-who, Me?\" Velma said, eyes wide.<br>\r\n<br>\r\n\"That's right! Come on down!\" The ring leader pointed her finger at Velma. Before Velma could react, she was levitating in the air, being pulled down center stage.<br>\r\n<br>\r\n\"J-jinkies! Put me down!\" the sleuth tried to resist, but couldn't move. Every muscle was frozen in place until she came to the ground, right next to Magnolia.<br>\r\n<br>\r\n\"Let's give a big round of applause for VELMA DINKLEY!\" The sounds of thunderous applause filled the tent. <br>\r\n<br>\r\n\"How did you know my na-\"<br>\r\n<br>\r\n\"OKAY, VELMA,\" Magnolia interrupted, \"You're going to be a star! YOU get to star in the Marvelous Magnolia's Transformation Carnival! And for our FIRST performance, we will...</span></div></div>",
            "created":1325653200,
            "id":1252601,
            "title":"the Big Top!"
        },
        "11112":{
            "choices":[
                "grow even bigger each time she bounces!\"",
                "blow up balloons with her butt!\""
            ],
            "content":"<div class=\"\"><div> <span>...bring out the clowns!\"<br>\r\n<br>\r\n\"C...clowns?\" Velma stuttered, \"N-no! No no no, you can't, I'm begging you! I-I have a terrible...\"<br>\r\n<br>\r\n\"FEAR?\" the ring leader said, \"Oh but that's why you're here, Velma! We're going to conquer that fear!\" She pulled out a big, rubbery red nose, about the size of an apple and plonked it on Velma's face.<br>\r\n<br>\r\n\"Aaahh! Get it off!\" Velma screamed, but no matter how hard she tried to pull, the rubbery nose wouldn't come off. <br>\r\n<br>\r\n\"Let's give Velma a BIG hand for agreeing to conquer her fear of clowns, folks!\" Again, the applause filled the tent. \"And the only way Velma can stop being AFRAID of clowns is to BECOME one!\"<br>\r\n<br>\r\n\"WHAT?! No, no!! I don't want to be a clown!\" Velma pleaded, but the effects had already started.her real nose had fused with the rubbery ball, becoming a part of her body. Though she couldn't see it, white face paint had covered her entire face. she looked down at her hands as two big, puffy white gloves appeared on them. \"This can't be happening, this can't be happening... i-it's illogical! It's impossible! It must be a dream!\" Velma tried to assure herself, despite the changes happening right before her eyes.<br>\r\n<br>\r\n\"Oh it's a dream alright,\" Magnolia grinned, \"A dream come true!\"<br>\r\n<br>\r\nVelma tensed up as her (already large) breasts began to swell outward, with loud, audible BWOING! noises. The sound of laughter circled Velma, still in too much shock to move. \"I-it's not funny! How am I supposed to carry these things around?!\" But that wasn't her ONLY concern. Her thick, orange sweater had begun to shrink into a tiny, orange t-shirt, just barely able to cover her nipples a pair of suspenders crossed over her chest, connecting from the back to the front of her red skirt. \"Id's dot fubby, dou guys! W-whab? Whab habbened do by boice?! Why cab't I dalk right?!\" Her lips had about quadrupled inside, now a bright shiny red, flopping around with each word she attempted to say.<br>\r\n<br>\r\n\"Isn't she a RIOT, folks?\" the ring leader teased, slapping one of Velma's now massive buttcheeks, hanging out from under her skirt. \"Look at those buns shake!\"<br>\r\n<br>\r\n\"Dop! Dop doing dib do bee!\" she cried. She felt her red shoes turn into giant clown shoes, just barely able to contain her new 2-foot long feet! she tried to walk, but after the first step, she came tumbling down, tripping on her feet and onto her rubbery, boobs. Velma wasn't sure what was coming over her, but... it WAS funny! This whole thing was funny! \"Huh huh... sssneheheheee....\" she chuckled, \"BFFAAHAHAHAHAHA! HA HA HA HOOOAHAHAHA!\" She started laughing uncontrollably! her glasses had filled with multicolored spirals, making her see the world in a much more silly light. \"Duuhuhuhuh! Madamb Bagdolia ib right!  I'bba silly clown! Velma da Clown!\" What was Velma so worried about? She LOVED clowns now! She was such a happy, silly, dumb clown girl, with big bouncy boobies and butt cheeks! With a big, stupid grin, she grabbed her legs and began to bounce on her asscheeks around the ring, her breasts and clown nose wobbling around each time.<br>\r\n<br>\r\n\"Give it up for VELMA THE CLOWN!\" Magnolia snickered, \"Now, silly widdle Velma here is going to put on a little show for all of you! She's going to...</span></div></div>",
            "created":1325653200,
            "id":1252606,
            "title":"Velma conquers her fear."
        },
        "111121":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "Larger (Giantess Velma)",
                "Fatter (BBW Velma)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bigger as in...</span></div></span></div>",
            "created":1402549200,
            "id":1811063,
            "title":"grow even bigger each time she bounces!\""
        },
        "11113":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Futanari women...",
                "Giantess'..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What walks out?</span></div></span></div>",
            "created":1450674000,
            "id":2077741,
            "title":"Bring out the Freak Show!\""
        },
        "1112":{
            "choices":[
                "a corn dog!\"",
                "some cotton candy!\"",
                "a pickle on a stick!\""
            ],
            "content":"<div class=\"\"><div> <span>...the food court! She sniffed the air a couple times before her stomach grumbled loudly. \"Hmmm, well, I guess I'm sort of hungry...\" she said, licking her lips. She walked toward the middle of the food court, surrounded by stands that sold just about every kind of food: Corn Dogs, milk shakes, funnel cakes, everything! And the smells from each one were tickling Velma's nose, making her hungrier and hungrier. \"Jinkies, there's so much to choose from! Hmm, I think I'll have...</span></div></div>",
            "created":1325653200,
            "id":1252608,
            "title":"the food court!"
        },
        "11121":{
            "choices":[
                "eat more... and more... and more! ",
                "get Daphne. She HAD to try this wonderful carnival food!"
            ],
            "content":"<div class=\"\"><div> <span>\"A corn dog sounds really good about now...\" she smiled, \"but I can't forget why I'm here! Buuut just a LITTLE snack won't hurt...\" <br>\r\n<br>\r\nVelma walked to the corn dog stand. \"Uhmm, helloooo? Is anybody working here? I'd like to get a corn dog please?\" Velma squinted, looking inside the stand for anyone, but with no luck. She hadn't noticed that a corn dog had popped up right underneath her, its aroma wafting up her nose. \"Mmmmm... oh! Uhh, thanks!\" she said a bit nervously, picking up the corn dog. As soon as her teeth sunk into it, she knew this was the best corn dog she'd ever had. \"Mmmphh... mmmm, JINKIES! This is really good! Not like the cruddy food this place USED to serve...\" She took bite after bite until the entire thing was gone. \"Ahhh....\" she sighed, patting her belly, followed by a small belch. \"Oops! Excuse me!\" she giggled. <br>\r\n<br>\r\nJust then, her mind snapped back to the entire reason why she was here! She needed to find out who was behind the weird happenings at the carnival! But the corn dog was just SO good... She just HAD to...</span></div></div>",
            "created":1325653200,
            "id":1252612,
            "title":"a corn dog!\""
        },
        "111211":{
            "author_id":"wildinsaneguy",
            "author_name":"Dervish",
            "choices":[
                "see if there would be more food in this carnival!",
                "find something to wash it all down with!"
            ],
            "content":"<div class=\"\"><div> <span>Velma decided that whatever the strange occurrences were, they could wait until she was finished eating. Looking towards the stand, she was quite surprised to find that not one, but two more corn dogs had appeared in the place of the first. \"Jinkies,\" she thought, \"very strange...\" Her stomach had begun to growl from smelling the corn dogs; they just looked so good, so fresh and warm... \"Oh, well,\" she thought aloud, \"I guess a <i>couple</i> more wouldn't hurt!\" She bit into the two corn dogs with the same vigor she used to devour the first; within a minute both of them were merely sticks.<br>\r\n<br>\r\nVelma burped a bit louder and chuckled nervously, a rosy blush tinting her cheeks even though there was no one around. \"Jinkies, pardon me,\" she said to the empty air, looking back towards the stand. To her surprise, four corn dogs had appeared, lined up in a row. \"Okay,\" she said to herself, \"someone's playing a joke on me...\" She hesitantly grabbed one of the corn dogs and nibbled it. It certainly tasted like the real thing... \"Maybe I should sample ALL of them, just to be sure.\" What she considered \"sampling\" quickly turned into full-fledged eating, the girl gobbling up all four of the corn dogs in record time. She could feel her stomach start to fill up, but the corn dogs were just SO delicious...<br>\r\n<br>\r\nShe sighed to herself, seven corn dogs slowly digesting in her belly. She normally wouldn't have eaten so much--she preferred to leave the eating to the \"experts\", i.e. Shaggy and Scooby--but the food she'd just consumed was better than anything she'd had in a long time. Her mind buzzed back and forth; on the one hand, she still had no idea who was behind all of this, but on the other, she wondered if there would be more food. She decided to...</span></div></div>",
            "created":1325653200,
            "id":1252669,
            "title":"eat more... and more... and more! "
        },
        "1112111":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "The cotton candy booth",
                "The funnel cake booth"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, maybe I should check out the rest of the food court here. I can't do my thing just standing in one place, after all.\" Velma rationalized to herself. She then walked over to another stand to get more carnival food. But where did she go?</span></div></div>",
            "created":1325826000,
            "id":1253292,
            "title":"see if there would be more food in this carnival!"
        },
        "11121112":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "A secondary change begins to overcome her...",
                "Someone comes out of the shadows!"
            ],
            "content":"<div class=\"\"><div> <span>Velma walked over to the funnel cake booth, looking to see if anyone was there. She said to herself she was trying to find a suspect, but she really just wanted to see if anyone was there to make a funnel cake.<br>\r\n<br>\r\n\"Hello? Anyone there?\" She called out.<br>\r\n<br>\r\nShe looked down, and to her surprise she saw a large, freshly made funnel cake right there, dripping with chocolate syrup and covered in powdered sugar. She would have called out again, but the smell was just too much for her so she dove right in and gobbled it up. Soon she finished it, and began to pat her belly, suddenly noticing it to be bigger than before despite an orange sweater over it.<br>\r\n<br>\r\n\"Jinkies! I've really got to stop this!\" Velma said, surprised by her larger belly. \"I should go on a diet...\"<br>\r\n<br>\r\nSuddenly a wonderful smell came to Velma's nose. She looked over and saw two more funnel cakes in the place of the first one.<br>\r\n<br>\r\n\"Starting tomorrow.\" Velma said to herself before diving into the two new confections. As she ate her sweater began to feel tighter and tighter...</span></div></div>",
            "created":1325826000,
            "id":1253298,
            "title":"The funnel cake booth"
        },
        "111211121":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "...stronger.\"",
                "...gassy.\""
            ],
            "content":"<div class=\"\"><div> <span>Soon Velma finished off the two new funnel cakes, and began to rub her larger belly, which now began to peek out from under her sweater. \"Mmm, those were great...\" Velma moaned. She was beginning to lose her concern for her weight, wanting to just indulge herself on the wonderful foods here. \"Maybe I should inspect this area for a little while longer...\"<br>\r\n<br>\r\nVelma then began to feel something strange in her body. \"Oh my, I'm starting to feel...</span></div></div>",
            "created":1325826000,
            "id":1253309,
            "title":"A secondary change begins to overcome her..."
        },
        "1112111212":{
            "choices":[
                "She started getting lazier, fatter, and gassier!",
                "Her body starts to change!"
            ],
            "content":"<div class=\"\"><div> <span>Velma's growing gut groaned out loud. \"Hnnghhh....\" she moaned out, clutching her gut. \"I... c-can't hold...\" but her sentence was cut off by a loud blast of wind from her backside. Her face turned a soft red. \"JINKIES! Excuse ME!\" she grinned nervously. Her stomach continued to slowly inflate outward. It got to the point that she had to carry it around with both hands. Each step forced a loud, disgusting fart out from between her freckled ass cheeks. She managed to make it to a park bench, where she plopped her chubby butt down, sighing contently. \"Mmmm, those funnel cakes were -*URP!*- delicious! Hnnghh...\" she lifted her leg and let out another gross fart. \"Whew, what was IN those funnel cakes?\" She chuckled softly to herself, \"Well, at least nobody is around to hear...\"<br>\r\n<br>\r\nWhat happened next?</span></div></div>",
            "created":1325826000,
            "id":1253324,
            "title":"...gassy.\""
        },
        "11121112121":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "French fries (another transformation)",
                "A large soda (WG, pooping)"
            ],
            "content":"<div class=\"\"><div> <span>Velma just sat on that bench, farting to herself. She was getting very tired, so she didn't want to get up. She just rubbed her swollen stomach and smiled.<br>\r\n<br>\r\n\"Mmm, I want some more funnel cakes, but I don't want to have to get up...\" Velma said.<br>\r\n<br>\r\nPHRRRRRRRRRRRRRRRRTTTT!!!<br>\r\n<br>\r\nAfter unleashing another fart, Velma decided to try and get up. After grabbing her stomach to lift it up though, she saw something. Three funnel cakes were sitting on the bench right net to her!<br>\r\n<br>\r\n\"Well, looks like my wish came true!\" Velma said, digging into the new funnel cakes. As she did, her belly grew larger and larger, getting filled up with gas as well as funnel cake. Speaking of gas, her farts got longer and more smelly as she sat there, but she didn't care. All she wanted were those funnel cakes.<br>\r\n<br>\r\nAfter finishing these cakes off, Velma was a sight to behold. Her orange sweater was no longer able to contain her vast stomach, which was now the size of a volleyball and sitting comfortably on her noticeably larger thighs. Her farts now lasted at least six seconds each, and she seemed to have a cloud of green gas surrounding her all the time.<br>\r\n<br>\r\n\"Jinkies, this might just be the best case ever...\" Velma said to herself, rubbing her big belly. She looked to her left, and was happy at what she saw...</span></div></div>",
            "created":1326517200,
            "id":1258155,
            "title":"She started getting lazier, fatter, and gassier!"
        },
        "111211121211":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "she gives in and embraces her fat gassy witch self, she looks for Daphne",
                "she tries to resist but is met by another gassy witch of the carnival"
            ],
            "content":"<div class=\"\"><div> <span>an excited squeak of a fart flew out of her rear as Velma saw a giant bowl of french fries had appeared to her left, grabbing it she began to wolf it down in earnest. handful after handful went down her throat, adding more and more weight to her body. <br>\r\n<br>\r\nwhat she didn't realise however, where the other changes taking place while she ate, her skin was slowly but surely turning a light shade of green, her usual chestnut hair was growing past shoulder length to her ass and darkening to a midnight black sheen, her fingernails darkening and sharpening as well as she gobbled up the fries, her skin becoming more sweaty as the bowl's contents where devoured. <br>\r\n<br>\r\nby the end of the bowl Velma rose from the bench a very different girl then when she had sat down, she was still in her trademark outfit, although her sweater was becoming more of a wonder bra as her belly had forced it upwards, while her dress had become a mini skirt due to the titanic size of her ass. but she looked to have been corrupted by the creepy carnival and the treats it had given her, she wasn't just Velma Dinkley, mystery solver, she was Velma, the fat sweaty gassy witch of the creepy carnival, she only realised what she had become when she noticed her glasses had fallen off her face several snacks ago, yet she could see perfectly well, she could see the weight she'd put on and the changes she'd undergone. she could also feel the influence of the carnival start to take over</span></div></div>",
            "created":1326603600,
            "id":1258904,
            "title":"French fries (another transformation)"
        },
        "1112111212112":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "She forces the urge to fart back and leaves to find the gang",
                "She can't resist anymore, releases the fart and embraces her new self."
            ],
            "content":"<div class=\"\"><div> <span>Velma realized that she had changed far too much already and had to get out before it was too late.  \"I have to get the gang together and find a way to reverse this!\" Velma said panicked as she started searching for an exit.  \"But why would you want to leave?  Don't you like this new body of yours?\" a mysterious voice called out to her.  Velma turned around to find a fully changed carnival witch behind her.  Like Velma, she also had green skin, long black hair, and was very fat and sweating profusely.  \"Stay here with me and the rest of us,\" the witch said, \"Become one of my many sisters.  Doesn't it feel good to just let your body go?  Let your hair flow free and your body expand!\"  Velma felt another fart coming, but was finding it harder and harder to control, and she found it harder to resist the changes and leave all of this behind.  Finally, after holding it in with all her might...</span></div></div>",
            "created":1350536400,
            "id":1449440,
            "title":"she tries to resist but is met by another gassy..."
        },
        "11121112121122":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "\"You getting the rest of your gang to join us.\"",
                "\"A new name for you.\""
            ],
            "content":"<div class=\"\"><div> <span>Velma struggles to hold onto what's left of herself and resist the urge to fart, but the smells of the food in the carnival are just so good.  All of this delicious food could be hers and she just had to stay here.  \"But what about my friends?\" Velma asked.  The witch smiled and said, \"I think we can always use a few new members of the family.\"  The witch leaned in close to Velma and whispered into her ear, \"I know you want to fart.  Let it out and release the old you for us.  I can help you feel good.\"  And that was enough to make Velma release a loud fart.<br>\r\n<br>\r\n<b>PHRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRT!!!!!</b><br>\r\n<br>\r\n\"I'm glad you decided to join us, sister,\" the first witch said to the new carnival witch.  \"Let's start your new life off with...\"</span></div></div>",
            "created":1350536400,
            "id":1449647,
            "title":"She can't resist anymore, releases the fart..."
        },
        "111211121211222":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "Vilhelmina",
                "another name"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"A new name?\"  Velma asks.  \"But of course, sister.  Velma is not good enough for a beautiful witch such as yourself.  How about...</span></div></span></div>",
            "created":1354856400,
            "id":1483619,
            "title":"\"A new name for you.\""
        },
        "1112111212112221":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "They resembles a sexy witch costume, which exposed her cleavage and butt.",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I love it!\" the witch formerly known as Velma declared, farting in joy.  \"Excellent, now we need you to get properly dressed.  These rags are not becoming of a carnival witch such as yourself.  Follow me to the tent.\"  Vilhelmina followed her sister, who for some reason she remembered being Brunhilda, to the nearby carnival tent.  They walked into a dressing room where there was a costume awaiting her.  Vilhelmina then happily put on her new clothes.  What did they look like?</span></div></div>",
            "created":1354856400,
            "id":1483622,
            "title":"Vilhelmina the Carnival Witch"
        },
        "11121112121122211":{
            "author_id":"dustindemon",
            "author_name":"Dustin",
            "choices":[
                "Her nose start to get longer!",
                "Her body start to get fatter!"
            ],
            "content":"<div class=\"\"><div> <span>Her fat, sweaty body just barely fit into her new outfit, which showed off her green, freckled cleavage and ass. \"Jinkies! I look like a REAL witch now!\" Vilhelmina squeezed her breasts together with both hands, her long black fingernails sinking into them a bit. She turned around in the mirror to see her massive green rump, reaching back and giving it a nice slap. Vilhelmina let out a loud witchy cackle.<br>\r\n<br>\r\nBrunhilda chuckled as the green booty shook like lime jello. \"I'm SO glad you decided to join us, Vilhelmina! However, I should warn you, this is not the LAST of your changes....\"<br>\r\n<br>\r\n\"Huh? What do you mean?\" She looked into the mirror and saw...</span></div></div>",
            "created":1355029200,
            "id":1484509,
            "title":"They resembles a sexy witch costume, which expo..."
        },
        "111211121211222111":{
            "choices":[
                "Her other facial features became ugly and exaggerated!",
                "Her nose grew even longer and floppier!"
            ],
            "content":"<div class=\"\"><div> <span>\"W-what's happening to me?\" Vilhelmina stammered as her  nose began to elongate in front of her. Inch by inch it grew until it was about 6 inches long! <br>\r\n<br>\r\n\"Well, you wanted to be a witch, didn't you?\" Brunhilda's cackles ringing in Vilhelmina's ears, \"You need to LOOK the part!\" Velma's  long fingernails gently scraped her new nose, tingling against her green skin.<br>\r\n<br>\r\n\"Ooohhh, hehee, it feels nice~\" She used one hand to start jerking off her own long nose, her other hand on her breast. \"I suppose I could get used to it!\" The raven haired  no-longer-teen-sleuth  lifted her chubby leg and pushed out another loud, gross fart and immediately SNOOORRRRTED it up with her new nose. \"Ohhh, JINKIES! No wonder you gave me this, my farts smell even BETTER with this thing!\" She bounced her fat freckled ass up and down and pushed out more loud farts, snorting up her terrible aroma.<br>\r\n<br>\r\n\"I just KNEW you would like it~\" Brunhilda said, \"But that's not all...\"<br>\r\n<br>\r\nVelma's changes continued as...</span></div></div>",
            "created":1355029200,
            "id":1484512,
            "title":"Her nose start to get longer!"
        },
        "111211121211222112":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "Casts a spell on Vilhelmina to give her farts magic powers",
                "gives her a broom stick to fly upon"
            ],
            "content":"<div class=\"\"><div> <span>At that moment, Vilhelmina's body began to bloat up and expand until her new clothes burst open, leaving her naked once again and surprising her enough to unleash another fart.  Brunhilda gave gave her new clothes similar to her old ones, only this time, her large flabby belly hung out from beneath her shirt.  After letting out a witchy giggle, Vilhelmina hugs her sister and thanks her for the new body.  \"I have one more gift to bestow upon you.\"  Brunhilda then...</span></div></div>",
            "created":1355029200,
            "id":1484863,
            "title":"Her body start to get fatter!"
        },
        "1112111212112221121":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "\"Recruit that other girl from your group into our coven.\"",
                "\"Seduce the two men you brought with you to be our slaves.\""
            ],
            "content":"<div class=\"\"><div> <span>Brunhilda casts a spell on Vilhelmina, then says, \"This spell will give your farts magical powers and allow you to bring more sisters into our coven.  It will make any woman who smells them more susceptible to the changes and will also make them change faster.  It will also turn men on and allow us to give birth to baby witches for us to bring up.  But the farts don't work on fellow carnival witches and each fart will cost you a memory of your former life.  I hope you use this gift well, my dear Vilhelmina!  Now for your first job as my sister, I want you to...\"</span></div></div>",
            "created":1355029200,
            "id":1484869,
            "title":"Casts a spell on Vilhelmina to give her farts m..."
        },
        "111211121212":{
            "choices":[
                "a Caramel Apple Stand! (IQ loss, complete slobbification)",
                "Daphne on a platter like a roast pig!"
            ],
            "content":"<div class=\"\"><div> <span>Velma grinned as she saw a large cup of fizzling soda. She licked her lips. \"Mmm, Jinkies, I AM a little parched...\" she said to herself, picking up her large stuffed gut and started to walk over to the stand, only stopping to push out a loud fart. She wrapped her arms around the giant cup, letting the bubbles pop and fizzle in her face. \"Mmmm...\" she moaned. She stuck out her tongue and lapped at the surface like an animal. \"Oooh, cherry flavored!\" she happily chimed and began sipping up big gulps of the delicious soda.<br>\r\n<br>\r\nVelma didn't notice, however, that the drink was having another weird effect on her. She was packing on the pounds with each gulp from the delicious soda. By the time she had finished, she was a good 250 lbs.! \"Ahhhh... *BUURRARRRRRPPPTT!!!* JINKIES! Hee hee, that was a BIG one...\" she giggled, plopping her jiggly ass on the ground. Her beach ball sized stomach gurgled and roared out. \"Uh oh... that doesn't sound good...\" Velma grunted and pushed out another ground shaking fart, killing the grass underneath her massive fleshy ass cheeks. \"Nnnnnghh.... c'mon...\" she said to herself. Finally, she managed to push out a fat, solid log of poop into her panties... then another... and another! Velma's eyes crossed and nostrils flared, teeth and gums showing, making all sorts of odd expressions as turds kept building up in her panties. \"Ooohhh... AAaaahh... mmmnnghh, ooh that feels... kind of nice!\" She said with a crooked grin and eyes rolled back. Explosive farts blasted out of her flabby behind one after another, sometimes lasting more than half a minute each! Finally, Velma's shitting streak ended, leaving her panties stretched out and filled with solid coils of poop. \"Jinkies... that was.... nice! Huhuhh...\" She giggled to herself. She looked over to her right at the remaining food stand and saw...</span></div></div>",
            "created":1342242000,
            "id":1378250,
            "title":"A large soda (WG, pooping)"
        },
        "1112111212121":{
            "choices":[
                "A Creepy Clown!",
                "A Carnival Food Monster!"
            ],
            "content":"<div class=\"\"><div> <span>The slob sleuth waddled her way over to the caramel stand, the hot wad of shit in her soiled panties dripping bowel juice down her legs. Without any sort of caution or consideration, she plucked one of the caramel apples from the stand and jammed the entire thing into her greedy mouth, chewing it with difficulty as slobber ran down her face. As she devoured apple after apple, the changes that had already been taking place in her body were accelerated. Mere lack of caution and naivette transformed into base stupidity as her vaunted intelligence evaporated. Her body swelled with flab to the point where her clothes burst off of her body with a loud tearing sound, her panties falling to the ground with a wet slap. Her flesh began to stink, as though she hadn't washed for months, and rivers of sweat began to run down her body. Her bowels went into overdrive as she moaned euphorically, evacuating her waste as she pleased like the big dumb animal she'd become. SPLARRPHT! With a rippling, juicy fart, a massive, arm-thick turd log pushing out from her shit-stained crack and falling out onto the floor while her bladder emptied itself, drizzling her legs with piss.<br>\r\n<br>\r\n\"Hhhuhhh... Jinkies... BRAAAAAAAAAPH...\" The rank belch spewed from Velma's mouth like a volcanic eruption, causing her entire four-hundred pound body to wobble and shake like a jello mold gone bad, sweat sprinkling off from the movement. Taking a deep whiff of her own filth, Velma smiled vacantly, her eyes glazed over in oblivious bliss.<br>\r\n<br>\r\nAnd it was at this point that the nefarious culprit behind these transformations revealed itself!</span></div></div>",
            "created":1365829200,
            "id":1571066,
            "title":"Bad Apples"
        },
        "11121112121211":{
            "choices":[
                "\"I bite you, and turn you into a clown like me! Sexier, probably, but still!\"",
                "\"A custard blob beast! The pies have to come from somewhere.\""
            ],
            "content":"<div class=\"\"><div> <span>\"HEYYYYYYYYYY KIDS!\"<br>\r\n<br>\r\nFrom a tent it shuffled, with long feet shod in crimson rubber and a gruesome shock of blue hair on an otherwise bald, moon-white scalp. A red smile leered on its fanged face, a bulbous red nose perching above it like a throbbing blister.<br>\r\n<br>\r\nThe dread Bozferatu. Squeaking over to Velma, he took a deep whiff of her pungent odors, licking his lips.<br>\r\n<br>\r\n\"Well! Looks like someone's been having a good time!\" Velma just stared at him dumbly as her stomach grumbled, letting loose a noxious fart and a splatter of waste. \"You seem like you're about ready for... The NEXT STEP! HAHAHAHAHAHAHAHA!\"<br>\r\n<br>\r\n\"Uhh... *PHWRRARRRP, PLRRP* Gosh. What's that? *HRRRP BLAAAARP*\"<br>\r\n<br>\r\n\"Ahahahaha! Glad you asked! Glad you asked!\" He honked a bicycle horn ominously.</span></div></div>",
            "created":1368507600,
            "id":1589805,
            "title":"Clowning Around"
        },
        "11121112121212":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "She leads her towards a collection of fat ladies",
                "She takes her to the freak show AKA her collection of randomly changed girls"
            ],
            "content":"<div class=\"\"><div> <span>as the giant sweaty blob that velma had become sat itself down on a park bench that groaned under the strain, the mastermind of the carnival of change revealed itself from the shadows, Cindy the Cotton Candy Demon Girl oozed forward from behind  the scenes, 5ft tall, with feminine features, her body made entirely of a blobby Cotton Candy esque fluffy blob like substance, looking like a 200 pound girl would where they made of sinister enchanted confectionery, Cindy oozed forward towards Velma, smiling at her handiwork that was in front of her.<br>\r\n<br>\r\nVelma was none the wiser as she just continued to sit on the bench, fart, belching and generally stuffing her face with whatever treat she could reach from where she was, only paying attention when she felt something begin to envelop her and stroke her belly<br>\r\n<br>\r\n\"There there deary, just keep glutting yourself, you belong to me now\" Cindy whispered into velma's ear as she rested her face on Velmas shoulders, she raised a Cotton Candy Tendril to Velmas mouth, biting her lip in pleasure as Velma began to suckle from it, enticing the obese detective from her chair Cindy led her on like a mule with a carrot dangling in front of it towards a collection of caravans and tents off to the far end of the park</span></div></div>",
            "created":1366174800,
            "id":1573812,
            "title":"A Carnival Food Monster!"
        },
        "1112111212122":{
            "choices":[
                "\"I'm going to eat you.\"",
                "\"I'm going to make you pay.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Help! Is anyone out here?\" Daphne cried<br>\r\n<br>\r\nVelma grinned when she saw the skinny teen on a platter. She had her feet and hands bound and was lying in the position of a roasted pig. The only thing Daphne was missing was an apple in her mouth.<br>\r\n<br>\r\n“Daphne! How did- uggh- get here?” Velma asked as she added another turd into her panties.<br>\r\n<br>\r\n“Velma, oh thank goodness you’re here. Please untie me so that- whoa! You’ve gotten fat!” Daphne exclaimed.<br>\r\n<br>\r\n“Hey, I *urrrrrp*only had a few snacks.” Velma said.<br>\r\n<br>\r\n“Look it doesn’t mat- *sniff* ugh were you trapped in the porta-potties? You smell awful.”<br>\r\n<br>\r\nVelma farted in shock and said, “I don’t smell *pfffffffffrt* that bad!”<br>\r\n<br>\r\n“Whatever, can we talk about this later? I’m hungry and scared.”<br>\r\n<br>\r\nVelma just looked at Daphne staring daggers at her. She wasn’t sure if she wanted  to free Daphne. Aside from the rude comments, Velma secretly disliked Daphne. Velma was always jealous of Daphne’s beauty and popularity even though Daphne never really contributed to the group. She wanted to get rid revenge on Daphne and she had an idea how.<br>\r\n<br>\r\n“No, I think I’m gonna keep you like this.” Velma said.<br>\r\n<br>\r\nGrrrgrlll!<br>\r\n<br>\r\n“What are you talking about?” Daphne asked.  <br>\r\n</span></div></div>",
            "created":1342242000,
            "id":1378604,
            "title":"Daphne on a platter like a roast pig!"
        },
        "11121112121221":{
            "choices":[
                "\"Not for long,\" promised Velma, as she shoved a funnel into Daphne's mouth.",
                "\"Why not eat the boys?\" Daphne suggested. \"They're already big and fat.\""
            ],
            "content":"<div class=\"\"><div> <span>\"What are you talking about, Velma?\" cried Daphne, \"Stop kidding around and untie me.\"<br>\r\n<br>\r\n\"No,\" Velma repeated and approached her friend, \"I'm serious, Daphne, I am going to eat you.\"<br>\r\n<br>\r\n\"But why?\"<br>\r\n<br>\r\n\"Because I'm starving!\" complained Velma, rubbing her swollen belly, which was still expanding as the two girls talked. Velma's belly continued to push its way between the girl's sweater and skirt. She rubbed her fat gut and added, \"And I want to get so much fatter!\"<br>\r\n<br>\r\n\"But why would you want to eat me? I'm so skinny,\" whined Daphne.<br>\r\n<br>\r\n</span></div></div>",
            "created":1454907600,
            "id":2101629,
            "title":"\"I'm going to eat you.\""
        },
        "11121112121222":{
            "choices":[
                "fart on Daphne (and maybe poop)",
                "forcefeed Daphne"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Y-you're not going to eat me, or you?\" Daphne asked when she heard Velma's stomach growl.<br>\r\n<br>\r\nVelma chuckled and said, \"Tempting but no, I have something better planned.\"<br>\r\n<br>\r\nVelma planned to....</span></div></span></div>",
            "created":1342242000,
            "id":1378607,
            "title":"\"I'm going to make you pay.\""
        },
        "111211121212221":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "She takes off her panties and poops on Daphne!",
                "She removes Daphne's clothes and eats her!"
            ],
            "content":"<div class=\"\"><div> <span>Velma moved herself over Daphne so that her ass was just above the other girl's chest. Her poop filled panties plopped down on Daphne's face, almost making her barf. \"Oh my god Velma, this is disgusting!\"Daphne said.<br>\r\n<br>\r\n\"I know, isn't it?\" Velma said. \"Now get ready for this!\"<br>\r\n<br>\r\nPHRRRRTTTT!<br>\r\n<br>\r\nVelma unleashed a huge fart all over Daphne, covering her entire body in its stink. \"Aaaah, that felt good.\" Velma said, with Daphne barely getting some disgusted complaints out.<br>\r\n<br>\r\nPHRRRRRRRRRRRRTTTTTTTTT!<br>\r\n<br>\r\nPHRRRRRRRRRRRRRRRRRRRRRTTTTTTTTTTTTT!<br>\r\n<br>\r\nMore and more gas erupted from Velma's behind, the whole area seeming to get covered in a smelly green cloud. Daphne could do nothing but sit there and take this. Just where would it end?<br>\r\n<br>\r\nVelma's stomach growled once again, which made her smile...</span></div></div>",
            "created":1347598800,
            "id":1427085,
            "title":"fart on Daphne (and maybe poop)"
        },
        "11121112122":{
            "choices":[
                "Daphne! ",
                "someone else "
            ],
            "content":"<div class=\"\"><div> <span>suddenly Velma felt her body begin to transform. She felt her newly gained fat suddenly melt away but strangely her clothes continued to get tighter. Velma rushed to find a mirror and found a hand mirror that was left on the ground. Velma brought the mirror up to her face and found that she had transformed into...</span></div></div>",
            "created":1480136400,
            "id":2242269,
            "title":"a new velma "
        },
        "111211121222":{
            "choices":[
                "A blonde Supermodel ",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who else? </span></div></span></div>",
            "created":1480136400,
            "id":2242270,
            "title":"someone else"
        },
        "1112111212222":{
            "choices":[
                " a Runner",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who else!? </span></div></span></div>",
            "created":1480136400,
            "id":2242271,
            "title":"someone else"
        },
        "11121112122222":{
            "choices":[
                "A Swimsuit Model",
                "someone else? "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who else!? </span></div></span></div>",
            "created":1480136400,
            "id":2242272,
            "title":"someone else"
        },
        "111211121222222":{
            "choices":[
                " a female Fitness Trainer",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who else!? </span></div></span></div>",
            "created":1480136400,
            "id":2242273,
            "title":"someone else? "
        },
        "1112111212222222":{
            "choices":[
                "Herself only hotter ",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>a better version of herself maybe? </span></div></span></div>",
            "created":1480136400,
            "id":2242275,
            "title":"someone else"
        },
        "11121112122222222":{
            "choices":[
                "a lingerie model ",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who else could it be? </span></div></span></div>",
            "created":1480136400,
            "id":2242310,
            "title":"someone else"
        },
        "111211121222222222":{
            "choices":[
                " A Hippie chick",
                "A Cheerleader"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> who else could it possibly be? </span></div></span></div>",
            "created":1480136400,
            "id":2242311,
            "title":"someone else"
        },
        "1112112":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "Soda (makes her fatter and lazier, making her a bit slobby)",
                "Lemonade (Drains her intelligence, making her a bit ditzy)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What does she find?</span></div></span></div>",
            "created":1366174800,
            "id":1573845,
            "title":"find something to wash it all down with!"
        },
        "111212":{
            "choices":[
                "Already gorging herself on food.",
                "Caught in a trap"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmmm, Daphne would love this food. I better show this her before Shaggy and Scooby come and eat it all.\" She left the stand and went to search for Daphne. In the back of her mind something was telling her something was wrong but for now she just thought about eating the food with Daphne. She didn't think about finding Fred, Shaggy, or Scooby and for some reason just focused on Daphne.<br>\r\n<br>\r\nEventually, Velma found Daphne near some concession stands filled with fattening food....</span></div></div>",
            "created":1380862800,
            "id":1674103,
            "title":"get Daphne. She HAD to try this wonderful carni..."
        },
        "1112122":{
            "choices":[
                "Forcefeed Daphne",
                "Free her"
            ],
            "content":"<div class=\"\"><div> <span>Daphne was tied up to a lamppost with her hands and feet bound by rope and her mouth gagged. She was squirming around near an abandoned stand full of food. Velma's first thought was to leave Daphne and stuff herself but the better part of her decided to save her friend. She removed the gag in Daphne's mouth and she let out a gasp. <br>\r\n<br>\r\n\"Oh Velma, am I glad to see you. I've been stuck here for an hour with nothing to do but smell that disgusting, greasy food over there. Can you untie me so I don't have to inhale those fumes anymore?\"<br>\r\n<br>\r\nVelma was relieved to see Daphne was ok but felt insulted the way she talked about the food. She went to all this trouble to find Daphne so they could eat and she bad mouths the food. The brunette looked at the food and saw that Daphne was in no position to fight back. She was tempted to force Danphne to see how good the food was but also wanted to free her. Eventually she chose to...</span></div></div>",
            "created":1380862800,
            "id":1674105,
            "title":"Caught in a trap"
        },
        "1113":{
            "author_id":"jeremyth",
            "author_name":"Mataku",
            "choices":[
                "Skeeball",
                "Balloon Popper",
                "Water the Clowns"
            ],
            "content":"<div class=\"\"><div> <span>Velma decided to go down the Carnival game gallery. \"This games were always unwinnable.\" She said to herself as she looked in each of the stalls. Suddenly a girl with long blonde hair and red striped shirt, pants, and hat, and a wooden cane, popped out of one of the stalls and started yelling to Velma. \"Hurry hurry hurry to play one of our great games like Skeeball! Balloon Popper and Water the Clowns!\" She said in a booming voice, Velma looked at the games and gulped.<br>\r\n<br>\r\nWhich one shall she play?</span></div></div>",
            "created":1325653200,
            "id":1252647,
            "title":"the carnival games!"
        },
        "11133":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "Velma felt her chest, warm up, and expand at the announcement.",
                "The stall holder passes her a ticket, 'One TF for free'.",
                "She watched, as Fred's hand slipped down to cup Daphne's ass."
            ],
            "content":"<div class=\"\"><div> <span>Velma fancied her chances with the Clowns, she was a better aim than Shaggy, or Fred, and Daphne was already looking uneasy. Probably the thought of the water ruining her make-up, she thought.<br>\r\n<br>\r\nPassing the man enough for each of them to play. She was already aiming for the clown's mouth, as the man counted down until the water was turned on. She was quite unaware of her her arse danced behind her, providing entertainment for the passers-by.<br>\r\n<br>\r\nFrom the corner of her eye, she spotted Daphne, as she held the gun as far from herself as possible. She suppressed the anger she felt. Daphne was Fred's girl, conventionally beautiful: slender and pretty. Why couldn't Fred see her beauty. She had fuller curves than her friend, a bigger bust and firmer ass.<br>\r\n<br>\r\nShe felt the pistol jerk in her hand as the water started flowing.<br>\r\n<br>\r\nQuickly she directed it towards the gaping clown's mouth. Skill. She thought, if he can't (or won't) appreciate my body, I can still impress him with my skill. Her face was set as the water gushed, and her balloon inflated.<br>\r\n<br>\r\nShaggy was distracted by a burger. While Daphne was barely managing to hit the clown's head, let alone get any through his open mouth.<br>\r\n<br>\r\nFred. Her lip curled, Fred was trying to help. Providing a steadying hand. Barely aware of his own pistol, the water streaming to the ground, coming closer to soaking the stall holder than the clown.<br>\r\n<br>\r\nHer shoulders slumped, as she sighed. Where was the victory, in defeating these guys. Where was the challenge?<br>\r\n<br>\r\nAs a finally mockery, Velma's balloon popped, and the stall holder called her the winner.</span></div></div>",
            "created":1466485200,
            "id":2167772,
            "title":"Water the Clowns"
        },
        "111331":{
            "author_id":"foxygrandpa1",
            "author_name":"Ferris Daly",
            "choices":[
                "Try to go somewhere more... Private.",
                "Start masturbating right there.~"
            ],
            "content":"<div class=\"\"><div> <span>Velma smirked to herself, happy that she had won. Her celebration is interrupted, however, when she starts to feel a tingling sensation in -- or rather, on -- her thighs, rear, and breasts. The nerdy girl pants slightly as her nipples harden, poking through her sweater as her tits begin to slowly fill up. Pale titflesh practically overflows from her sweater as her body changes, her tattered bra and soaked panties falling to the ground.</span></div></div>",
            "created":1577395380,
            "id":2764945,
            "title":"Velma felt her chest, warm up, and expand at th..."
        },
        "112":{
            "choices":[
                "The Egyptian Mummy Exhibit!",
                "The Dinosaur Exhibit!",
                "The Art Exhibit!"
            ],
            "content":"<div class=\"\"><div> <span>Velma slowly opened the museum door. \"Helloooo? Anyone here?\" she called in, closing the door behind her. \"Okay, ghost, where are you hiding...\" She had gotten a call about some weird stuff going down with some of the exhibits at the museum. Velma was a big fan and made sure to come to the museum almost every day, but she hadn't seen anything weird.<br>\r\n<br>\r\n\"Hmmm, where should I check first...\"</span></div></div>",
            "created":1325653200,
            "id":1252678,
            "title":"A macabre museum!"
        },
        "1123":{
            "author_id":"jeremyth",
            "author_name":"Mataku",
            "choices":[
                "Be the clay",
                "Be the paint",
                "Be the model"
            ],
            "content":"<div class=\"\"><div> <span>Velma shone the light into the art section, it was full of strange and beautiful artworks, Velma walked into the section and looked around, nothing seemed out of place, till she got to an old section of the museum that had been closed down. She stepped through the doors and was shocked to see a young woman thinking on a pedastill. \"Ah! A visitor!\" She said, hopping down and walking over to Velma. \"Ooo, such a magnificient figure.\" She said, rubbing her hands down Velma's sides, causing the nerdy girl to blushy. \"I've been waiting for someone to help me with my painting. I've been needing a model, although, I need some new supplies like some clay and paint.\" She said and thought. \"I know! You'll....</span></div></div>",
            "created":1325739600,
            "id":1252906,
            "title":"The Art Exhibit!"
        },
        "11233":{
            "author_id":"bigcolt",
            "author_name":"BigColt ",
            "choices":[
                "Sexy",
                "Cute"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“Be the model. Now stand right there.” The woman says as she pushes Velma into the stage. Now give me something....</span></div></span></div>",
            "created":1553928300,
            "id":2637130,
            "title":"Be the model"
        },
        "113":{
            "author_id":"scoobyfan1984",
            "author_name":"Scoobyfan1984",
            "choices":[
                "The gang splits up and searches for clues",
                "Mystery Inc. encounters a mysterious scientist",
                "The gang finds a secret lab full of half human, half reptiles"
            ],
            "content":"<div class=\"\"><div> <span>It all started fairly typically for the members of Mystery Incorporated. You know the type of situation; Scooby Doo and his fellow young sleuths are called into investigate some monster, or ghost, or phantom, or creature.<br>\r\n<br>\r\nHowever, when it was all over, the members of Mystery Incorporated(or rather two of them) would never be the same again.<br>\r\n<br>\r\nIt all began one day in February specifically; Mystery Inc. had been called to a college in the state of Arizona by a Professor at the school. The Mystery Inc. gang specifically had been contacted to investigate why equipment was disappearing from the university's biology department and the rather strange appearance of human sized reptiles on campus.<br>\r\n<br>\r\nWhen this mystery was finished though, Velma Dinkley and Daphne Blake would experience a major change in their lives... and in their bodies as well.</span></div></div>",
            "created":1480136400,
            "id":2242339,
            "title":"A loopy laboratory!"
        },
        "1131":{
            "author_id":"scoobyfan1984",
            "author_name":"Scoobyfan1984",
            "choices":[
                "The strange man meets Velma, Shaggy and Scooby",
                "Back to Fred and Daphne",
                "The strange man follows Velma, Shaggy and Scooby"
            ],
            "content":"<div class=\"\"><div> <span>Once the Mystery Inc. gang had gotten the information they needed from Professor Watkins(the man who had called them to the campus in the first place), they went off in search of clues.<br>\r\n<br>\r\nFred and Daphne took one half of the campus, while Velma, Shaggy and Scooby took the other half. After taking a brief sojourn to the campus cafeteria, Velma, her erstwhile boyfriend Shaggy(sorry to those who aren't Velma/Shaggy pairing fans), and the group's cowardly canine Scooby Doo had made their way to the main biology lab.<br>\r\n<br>\r\n\"Like it's as quiet as a morgue in here.\" Shaggy remarked, before quickly covering his mouth.<br>\r\n<br>\r\n\"It is rather silent in here Shaggy.\" Velma said, closely following Shaggy and Scooby.<br>\r\n<br>\r\n\"Ri rope re ron't run into ranything scary.\" Scooby added.<br>\r\n<br>\r\nAh, but the chicken hearted Great Dane and his master would be wrong, for as the trio searched the lab, something scary was awaiting them...<br>\r\n<br>\r\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@<br>\r\n<br>\r\nAround a nearby corner, a middle-aged man with jet black hair, wearing a lab coat, dark blue jeans and dark brown shoes watched the trio carefully.<br>\r\n<br>\r\n\"So, that blasted Professor Watkins has found out about my experiments eh?\" the man said, laughing silently and in a menacing tone of voice.<br>\r\n<br>\r\nThe unnamed individual then thought to himself for a moment, before out of sight and soon he was out of the room altogether. Before long, he had come to a room marked with the number 415 on the front window and with a key he fished out of his lab coat pocket, he opened the door and entered the room.<br>\r\n<br>\r\n\"If Professor Watkins believes he will stop my experiments with reptile and human DNA, he is sorely mistaken. And to prove that old fool wrong, I will test out my experiments and theories on that brat with the glasses!\" the man said, laughing evilly as he held up a glass beaker triumphantly.</span></div></div>",
            "created":1480136400,
            "id":2242346,
            "title":"The gang splits up and searches for clues"
        },
        "11311":{
            "author_id":"scoobyfan1984",
            "author_name":"Scoobyfan1984",
            "choices":[
                "Velma begins to transform",
                "Velma and friends rejoin Fred and Daphne"
            ],
            "content":"<div class=\"\"><div> <span>Having been unable to find any clues in the main Biology Lab, Velma, Shaggy and Scooby Doo cut their losses and left; the intrepid trio of sleuths then headed down a nearby hallway, that is until Scooby Doo's ears picked up a mysterious sound.<br>\r\n<br>\r\n\"What is it old buddy?\" Shaggy asked his canine companion.<br>\r\n<br>\r\n\"Rlass.\" Scooby replied.<br>\r\n<br>\r\n\"Glass?\" Velma asked, curiously.<br>\r\n<br>\r\n\"Reah, reah.\" the Great Dane said.<br>\r\n<br>\r\n\"Hmm... where would there be glass around here? Most of the students and faculty have been scared off by what Professor Watkins told us has been happening.\" Velma wondered aloud.<br>\r\n<br>\r\n\"Like I have a bad feeling we're going to find out where it's coming from right Velma?\" Shaggy asked.<br>\r\n<br>\r\n\"Right.\" Velma nodded.<br>\r\n<br>\r\nThe bespectacled brunette then urged her boyfriend and the Great Dane to follow her, as the intrepid trio went in search of the peculiar sounds that Scooby's ears were picking up.<br>\r\n<br>\r\nA few moments later, the canine sleuth had led his human companions to a room with 415 marked on the front of the door, or rather the glass window in the door.<br>\r\n<br>\r\n\"Good going Scooby, this must be where you heard those sounds.\" Velma said, softly rubbing Scooby's head as she spoke.<br>\r\n<br>\r\n\"I know one thing, like I wish I could hear the sound of me leaving right now.\" Shaggy quipped.<br>\r\n<br>\r\n\"Oh, don't be such a worry wart Shaggy. Nothing's behind that door that could cause any difficulties.\" Velma replied.<br>\r\n<br>\r\n\"Well just to be sure, I think I better leave and check the cafeteria again.\" Shaggy said, while getting ready to turn in the other direction to leave.<br>\r\n<br>\r\nOr, he would have been preparing to leave, had Velma not attempted to open the door and it opened with no difficulty. Shaggy gulped audibly as he tried to talk his companions out of searching the room, but alas it was to no avail.<br>\r\n<br>\r\n\"Come on guys, we have to get to the bottom of this mystery.\" Velma said, as Shaggy and Scooby closely followed behind the orange clad young adult.<br>\r\n<br>\r\nHowever, just as soon as the trio entered the room, the door closed and locked behind them.<br>\r\n<br>\r\n\"Zoinks! I should have known that was coming.\" Shaggy said, in a frightened tone of voice as he attempted to somehow open the door.<br>\r\n<br>\r\nWhile Shaggy was trying to budge the door, a mysterious voice began to speak to the trio.<br>\r\n<br>\r\n\"Who are you?\" Velma demanded, hoping the owner of the voice would make an appearance.<br>\r\n<br>\r\n\"Here, let me step into the light so you can see better my dear.\" the voice remarked, as he stepped into the trio's line of sight.<br>\r\n<br>\r\nThe overhead light now helped magnify the appearance of the same dark haired man in a lab coat who had been watching Mystery Inc. previously.<br>\r\n<br>\r\n\"Allow me to introduce myself. Dr. David Crowne, at your service.\" the man said, briefly bowing in front of Velma and the others.<br>\r\n<br>\r\n\"Just what are you doing here Dr. Crowne? Professor Watkins told us that everyone on campus had left because of the weird happenings and missing equipment on campus.\" Velma said, watching the strange doctor closely.<br>\r\n<br>\r\n\"Yes, Professor Watkins. That old fool is the reason why I stuck around; as one of the heads of the university's biology department, I had some business to attend to on campus, and experiments to conduct.\" Dr. Crowne replied.<br>\r\n<br>\r\n\"Just what kind of experiments Dr. Crowne?\" Velma asked, glaring at the lab coat clad individual.<br>\r\n<br>\r\n\"Ah, that's where you three come in, and you in particular my dear.\" Dr. Crowne replied, motioning towards Velma as he spoke.<br>\r\n<br>\r\n\"What do you mean?\" Velma said, in a displeased tone of voice.<br>\r\n<br>\r\n\"Perhaps you would like to see for yourself?\" Dr. Crowne asked in response.<br>\r\n<br>\r\n\"Hmm... common sense tells me no, but scientific curiosity says I should be interested.\" Velma replied.<br>\r\n<br>\r\n\"Good, if you would come stand next to me please.\" Dr. Crowne noted.<br>\r\n<br>\r\nHearing the menacing and evil tone in Dr. Crowne's voice was enough to send a shiver up Shaggy and Scooby's spines, so the duo tried to talk some sense into Velma in order to make sure she would not watch the doctor conduct his experiments.<br>\r\n<br>\r\n\"Come on Velma, I think we need to get out of here while we still can.\" Shaggy said, taking hold of Velma's right arm.<br>\r\n<br>\r\n\"Shaggy, you worry too much. It's just a scientific experiment, what could go wrong?\" Velma asked.<br>\r\n<br>\r\nShaggy attempted to reason with his girlfriend once again, but alas she was dead set on joining the doctor on the other side of the room. The bespectacled brunette then smiled and gave Shaggy a brief kiss on his right cheek, prior to walking to the other side of the room and standing next to Dr. Crowne.<br>\r\n<br>\r\n\"Ah excellent. Now, I would like to know the name of my assistant if you please...\" Dr. Crowne said.<br>\r\n<br>\r\n\"It's Velma doctor, Velma Dinkley.\" the brunette replied.<br>\r\n<br>\r\nDr. Crowne then nodded and smiled, although it appeared to Shaggy and Scooby that it was a menacing smile. Dr. Crowne then picked up a glass beaker and showed it to Velma, who had a curious look on her face.<br>\r\n<br>\r\n\"What is that liquid in the beaker Dr. Crowne?\" Velma asked.<br>\r\n<br>\r\n\"Ah yes, this is a part of my experiments. It is a serum that contains the DNA of a Lizard; I have been using it in my studies of what would happen if one combined the DNA of a Reptile with the DNA of a Human Being.\" Dr. Crowne explained.<br>\r\n<br>\r\n\"But why? Why would you want to combine the DNA of a Reptile with the DNA of a Human?\" Velma inquired.<br>\r\n<br>\r\n\"Why? Why not? As a matter of fact, that is the same thing the heads of the university's biology department said... just before they fired me.\" Dr. Crowne replied.<br>\r\n<br>\r\n\"I certainly can believe it.\" Velma said, with a disgusted look on her face.<br>\r\n<br>\r\n\"Bah! You, you Miss Dinkley are just like the people at this school's biology department. No ingenuity, no comprehension of the benefits this could have for mankind!\" Dr. Crowne replied, now clearly angry with the brunette.<br>\r\n<br>\r\n\"Benefits? This is crazy; you cannot think that combining the DNA of a human and a reptile would be beneficial to mankind could you?\" Velma asked, as she noticed the doctor staring at her unsettlingly.<br>\r\n<br>\r\n\"Yes I do. Man could survive the most extreme temperatures with the DNA of a reptile; if the planet cools too much or goes into a new ice age, one could simply take the DNA of a creature that could survive in cold temperatures. Or, if the planet warms too much, one could simply take the DNA of a warm blooded creature.\" Dr. Crowne replied.<br>\r\n<br>\r\n\"But mankind is not equipped to handle being part animal.\" Velma reasoned.<br>\r\n<br>\r\n\"Ah, but they will have to. Once I am done with the school and you meddlers, the world will have to recognize me as a scientific genius!\" Dr. Crowne declared, laughing menacingly.<br>\r\n<br>\r\n\"Not if I have anything to say about it!\" Velma said, as she tried to turn in the other direction; however, Dr. Crowne had a death grip on her right arm and was holding the glass beaker in the other.<br>\r\n<br>\r\n\"Now now Miss Dinkley, let's not do anything too hasty. You wished to see what my experiment was, and now you shall experience it first hand!\" Dr. Crowne said, uncapping the glass beaker with one hand and continuing to hold onto Velma's right arm with the other.<br>\r\n<br>\r\n\"Just what do you plan on doing with that?\" Velma asked, while Shaggy and Scooby prepared to advance on the insane doctor.<br>\r\n<br>\r\n\"What else? I shall grant you the wondrous feeling of having the DNA of a reptile!\" Dr. Crowne said, as he moved the beaker closer and closer to Velma's face.<br>\r\n<br>\r\nVelma stood helpless, she could not break free at all from the doctor's grip. While at the same time Shaggy and Scooby were quickly walking towards the mad doctor; however, as he prepared to tackle the doctor, Shaggy realized if he tried to do this, there was a chance he might accidentally cause Velma injury.<br>\r\n<br>\r\nAs all of this was occurring, the doctor now had the glass beaker mere inches away from Velma's face. Velma shivered at the thought of being half reptile, but with Dr. Crowne acting like a bodybuilder, she felt helpless once again, as there was no way she could avoid her fate.<br>\r\n<br>\r\n\"Now my dear, if you will be so kind...\" Dr. Crowne said, forcing the brunette's mouth open with the top of the beaker before he began pouring the strange liquid into her mouth.<br>\r\n<br>\r\nDr. Crowne in a few moments had proceeded to pour the entire beaker's contents into Velma's mouth, and soon the serum was going into the brunette's stomach.<br>\r\n<br>\r\n\"What... did you do?\" Velma asked, as she dropped to her knees, feeling as if the inside of her body was on fire.<br>\r\n<br>\r\n\"I merely subjected you to my first experiment Miss Dinkley. And soon, I will do the same thing your red haired friend, as females seem to make perfect test subjects.\" Dr. Crowne explained.<br>\r\n<br>\r\n\"H-how do you k-know about D-Daphne?\" Velma asked as Shaggy and Scooby were now holding onto her arms, in an attempt to keep her standing, or at least off the floor.<br>\r\n<br>\r\n\"Oh, I've been watching you meddlers for sometime, keeping track of you.\" Dr. Crowne said.<br>\r\n<br>\r\n\"Velma, I think we better get out of here and find the rest of the gang.\" Shaggy suggested, as Velma felt her mind spinning and her stomach churning, all the while shooting death glares at Dr. Crowne.<br>\r\n<br>\r\n\"It will do you no good to leave, especially considering Miss Dinkley is about to become part Lizard in the next few moments.\" Dr. Crowne said.<br>\r\n<br>\r\n\"Well, we're going to try to anyway.\" Shaggy replied, trying the door again... only this time it opened for him.<br>\r\n<br>\r\nShaggy, Scooby and the now woozy Velma Dinkley had now left the room, only for Dr. Crowne to taunt them as they departed.<br>\r\n<br>\r\n\"It will do you no good... you will be a reptile soon enough....\" Dr. Crowne said, laughing evilly as the trio went out of sight.<br>\r\n<br>\r\n</span></div></div>",
            "created":1480136400,
            "id":2242374,
            "title":"The strange man meets Velma, Shaggy and Scooby"
        },
        "114":{
            "author_id":"sixsodacola",
            "author_name":"Wuelt",
            "choices":[
                "Woman's Clothing Store",
                "Baby Store",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Velma walks down one of the branches of the mall seeing several stores infront of her.</span></div></span></div>",
            "created":1443589200,
            "id":2041882,
            "title":"A scary shopping mall!"
        },
        "1141":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Yes...",
                "Magic sex shop...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She goes into cursed clothing store</span></div></span></div>",
            "created":1507957200,
            "id":2401176,
            "title":"Woman's Clothing Store"
        },
        "11412":{
            "author_id":"moonheat",
            "author_name":"Moonheat",
            "choices":[
                "Dildos and accessories ",
                "Costumes",
                "Potions"
            ],
            "content":"<div class=\"\"><div> <span>Velma was quietly walking amongst the shop  of this gigantic mall they were investigating. As usual, Fred had ordered to spread out and search for clues, he went with Daphne, Shaggy and Scooby naturally went together, and she was left alone to explore the west wing of the building.<br>\r\nResolved to solve the case as quickly as possible, she carefully and thoroughly searched every shop she had encountered, with no results so far.<br>\r\n<br>\r\nDisappointed, she exited the candy store that would have drove Shaggy and Scooby insane, and looked at the next one. A deep blush colored her cheeks in red, and she tried to ignore the discreet tingling that had appeared between her legs.<br>\r\nIt was a sex-shop...<br>\r\n<br>\r\nGlad there wasn't anybody here to see her getting all embarrassed in front of the window full of dildos, kinky accessories, costumes and other errmm…stuff… she began to turn away when a sudden movement grabbed her attention. It had been really fast and she almost missed it, but something had unmistakably moved inside the shop.<br>\r\n<br>\r\nInhaling deeply to get control of herself, she entered the shop. The inside was unusually arranged, but it seemed rather organized which could only please her. In front of her, three signs indicated the three main sections of the shop:<br>\r\n<br>\r\n- Dildos and accessories <br>\r\n- Costumes for all fetishes<br>\r\n- Chemicals and magic potions<br>\r\n<br>\r\nEach accompanied by a little drawing in case people forgot what these items looked like. Attentive, she listened intently, searching for every sound betraying the presence of whoever was hiding here.<br>\r\n<br>\r\nWhere will the sound come from ?</span></div></div>",
            "created":1530610740,
            "id":2514395,
            "title":"Magic sex shop..."
        },
        "115":{
            "author_id":"scoobyfan1984",
            "author_name":"Scoobyfan1984",
            "choices":[
                "Mr. Reynolds continues talking to the gang",
                "The gang splits up to look for clues"
            ],
            "content":"<div class=\"\"><div> <span>On a clear, bright sunny day in Southern California, the members of the famous detective agency Mystery Incorporated, or Mystery Inc. for short stand at the start/finish line of the equally famous race track known as Santa Anita.<br>\r\n<br>\r\nThe reason for this conclave is because Velma, Shaggy, Scooby Doo, Fred and Daphne are chatting with a dark brown haired man in his mid fifties. The man, whose name is Jeremiah Reynolds, is a cousin of one of the members of the group, specifically Velma Dinkley.<br>\r\n<br>\r\nSeveral weeks ago, Mr. Reynolds wrote Velma in regards to some rather unusual happenings at Santa Anita, specifically involving some of the jockeys at the track. At the present time, Velma and her friends are transfixed by what the bespectacled young woman's cousin is telling them.<br>\r\n<br>\r\n\"I just can't understand what's going on around here.\" Jeremiah said.<br>\r\n<br>\r\n\"From the contents of your letter cousin Jeremiah, it sounded like something very strange around here. And it sounded like something that you need Mystery Inc. to investigate.\" Velma replied.<br>\r\n<br>\r\n\"It is Velma, it is.\" Jeremiah responded.<br>\r\n<br>\r\n\"Why don't you explain to us what's going on Mr. Reynolds, maybe we can pick up a clue or two from what you tell us.\" Fred replied.<br>\r\n<br>\r\n\"Sure thing Fred. It all started several weeks ago; after the end of one of the races, one of our jockeys, a man named Roger Porter, was headed for the jockey lounge to grab a snack and a soda before he headed home. Unfortunately he never made it to the lounge.\" Jeremiah explained.<br>\r\n<br>\r\n\"Never made it? What happened to him?\" Daphne asked, with a curious look on her face.<br>\r\n<br>\r\n\"We're not entirely sure. All we know is that a few hours after he disappeared, myself, and a couple of the higher ups here were passing by one of the horse stalls, when we spotted Mr. Porter. At first we thought he was checking on one of his horses, but when we walked closer to him, he stepped up to us; however, something was definitely off about him.\" Jeremiah clarified.<br>\r\n<br>\r\n\"Like what?\" Shaggy asked.<br>\r\n<br>\r\n\"Believe it or not, he walked up to us as a half horse, half human, a centaur.\" Jeremiah replied.<br>\r\n</span></div></div>",
            "created":1339650000,
            "id":1359798,
            "title":"The Mystery Of The Photo Finish"
        },
        "12":{
            "choices":[
                "The Mystery of Whats Eating Crystal Cove",
                "or a mystery involving a masked criminal",
                "or a mystery involving a real monster",
                "or a mystery involving a strange discovery",
                "or a mystery involving a supernatural phenomenon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Daphne Blake the red head pampered vixin of the group.</span></div></span></div>",
            "created":1325739600,
            "id":1253174,
            "title":"Daphne Blake"
        },
        "121":{
            "choices":[
                "Stacy is alive but something attacked her",
                "Stacy has vanished",
                "Stacy has changed"
            ],
            "content":"<div class=\"\"><div> <span>In the fading light of dusk on a mid summer night a loud clatter rung out from behind the Fire Grill Buffet. Mrs. Stacy Irons the assistant manager of the restaurant was tossing sacks of garbage into the dumpster before heading home. Stacy turned and waved goodbye to one of the grill cooks who was leaned against the wall by the back door on a smoke break. As she neared her car a strange smell began to fill the air around her. Stacy looked around trying to identify the source of the smell, it was so sweet and alluring. From the alleyway that provided a secondary exit from the parking lot Stacy saw a faint glow, the closer she got the stronger the smell became.<br>\r\n<br>\r\nThe cook who had been taking a smoke break was now laughing and chatting with one of the waitresses who had joined him in the warm evening air for a quick reprieve from the crowded restaurant when suddenly the sharp scream of the assistant manager echoed through the parking lot. Quickly both employee hurried to the alleyway where Mrs. Irons had wandered into only to find...</span></div></div>",
            "created":1325739600,
            "id":1253242,
            "title":"The smell of a new mystery"
        },
        "1213":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "An anthro.",
                "A monster.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Stacy had been changed the moment that she had touched the light. She was becoming...</span></div></span></div>",
            "created":1406523600,
            "id":1834563,
            "title":"Stacy's new look."
        },
        "12133":{
            "author_id":"rosearc",
            "author_name":"Vanitus45",
            "choices":[
                "Daphne comes to the restaurant withVelma due to the boys being sick ",
                "Daphne gets a call from her house",
                "Daphne walks to the restaurant without knowing about the attack"
            ],
            "content":"<div class=\"\"><div> <span>Into a giant blob of fat and sweat!<br>\r\n<br>\r\n“Ohh...buuurp!” She moaned while farting like crazy with a loud FSSSSSS. As she farted, her body kept on morphing from a 150 pound woman to an almost 2000 pound slob who’s clothes were ripped and in tatters. <br>\r\n<br>\r\nBoth workers looked on in horror as Stacy looked at the waitress and grabbed her with her meaty fingers.<br>\r\n<br>\r\n“Join me, BURP!” She moaned before farting a massive cloud of stink that knocked out the chef and caused the waitress to blimp up to her form. “FSSSSSSS!”<br>\r\n<br>\r\n(Some days later)</span></div></div>",
            "created":1553900760,
            "id":2636941,
            "title":"Sumo Slob!!!! BOOO!"
        },
        "122":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "The Phantom of the Opera.",
                "The Ghost of Geronimo.",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who's the masked foe?</span></div></span></div>",
            "created":1404622800,
            "id":1823748,
            "title":"The masked terror."
        },
        "123":{
            "author_id":"kamenmaster",
            "author_name":"kamenmaster",
            "choices":[
                "A bizzare frog creature",
                "A mothman",
                "A giant plant thing"
            ],
            "content":"<div class=\"\"><div> <span>There were always stories floating around Crystal Cove, from simples little urban legends to the stuff of horror that some of the most twisted thriller writers couldn't hope to come up with. And today was no different, for you see yet another monster was sighted somewhere near the town. The stories all come from campers fleeing in terror from the nearby woods all in a panic from seeing...</span></div></div>",
            "created":1359349200,
            "id":1519075,
            "title":"or a mystery involving a real monster"
        },
        "1231":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "It turns her into a female frog monster",
                "It makes her bloated and fat and slimy",
                "Another option."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she change while searching for the monster?</span></div></span></div>",
            "created":1359349200,
            "id":1519100,
            "title":"A bizzare frog creature"
        },
        "12311":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "A few minutes?",
                "Days?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How Long does it take?</span></div></span></div>",
            "created":1436418000,
            "id":2005381,
            "title":"It turns her into a female frog monster"
        },
        "12313":{
            "choices":[
                "Fat Frog Princess",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, what if we combined the two? What if we Daphne became a bloated, fat, slimy frog creature?</span></div></span></div>",
            "created":1365742800,
            "id":1570449,
            "title":"Another option."
        },
        "123131":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "as she walks the slime begins to seep into her skin and fatten her up",
                "she comes across a cave, the walls coated in the sludge like a nest of somekind"
            ],
            "content":"<div class=\"\"><div> <span>Daphne Blake, super sleuth and mystery solver walked along the coast of Crystal Cove, flashlight in hand as she inspected the area for clues, she and her friends had split up into groups as per usual but oddly enough it was a case of boys vs girls this mystery, as her and Velma Dinkly had been left to go investigate the coast while Shaggy Scooby and Fred had gone off to question the Lakeside cabin hotels owners.<br>\r\n<br>\r\nDaphne had somehow managed to lose Velma somewhere between the boat house and where she currently stood, she hadn't heard her friend speak up about losing her glasses or speak up in general, so she assumed she was fine or at the very least had left something in the mystery machine and gone back to get it without telling her. either way Daphne pressed on, eager to find something noteworthy, not having to go back empty handed to the group. <br>\r\n<br>\r\nThey'd been travelling around the countryside when their van had broken down someways up the road, a nice trucker lady had been kind enough to tow them to the nearest place with a phone, the hotel, but upon arrival all they'd heard was rumors of a giant amphibian creature roaming the area at night and frightening off the tourists and locals alike. <br>\r\n<br>\r\nDaphne had already made her mind up it would just be another freak in a costume but was still apprehensive about what she could bump into in the dark, especially as she was alone, but she kept on looking anyway, pausing as something glimmered in the light cast by her torch. <br>\r\n<br>\r\nWalking closer to the object Daphne covered her nose as she began to notice a really odd stench waft up from the direction she was walking, but she put it down to some drift wood or pond scum rotting nearby. gasping in surprise as she came across what had caught her attention and was also causing the smell.<br>\r\n<br>\r\nbefore her lay a giant squishy pile of green gloppy gooey sludge, she knew the lake could easily have frogs in it but none of them could be responsible for this gigantic pile of sludge in front of her, looking around to see if Velma had caught up she sighed as she realized she was still alone, edging closer to the goo to get a better look she yelled out in fright as something pushed her forward causing her to lose her footing, falling face first in the pile of rancid goo. <br>\r\n<br>\r\nspluttering to her feet she quickly realized her flashlight had broken her fall and gotten smashed in the process as well based on the blackness around her only illuminated by moon light, she groaned as she knew her clothes were completely ruined, as she felt the sludge continue to stick to her and drip down her body she shuddered at the thought of what it would be doing to her hair and complexion, ignoring those thoughts as best she could she caught sight of some footprints leading away from the sludge that weren't there before she was pushed, these prints seemed like they belonged to a woman, she was beginning to get very suspicious of not being able to see Velma but she couldn't bring herself to think her friend would do something so mean as to push her into the glop that now pretty much coated her body. <br>\r\n<br>\r\nGrinning and bearing it for now Daphne followed the footprints to see if she could at least find out who had pushed her into that mess and why. </span></div></div>",
            "created":1365742800,
            "id":1570496,
            "title":"The Meddling Kid and the Frog Princess   "
        },
        "1231311":{
            "choices":[
                "Fred was up ahead and Daphne was looked more amphibean.",
                "Velma was nearby and Daphne was about to fart up a storm."
            ],
            "content":"<div class=\"\"><div> <span>Daphne followed the footprints as she tried to ignore the slime sticking to her skin. She hoped that there was a clue at the end of this trail. It would have been even better if she could get a change of clothes.<br>\r\n<br>\r\n\"Ugh, now I know how the movie theater floors feel like. At least they're starting to dry.\" Daphne murmured. Little did Daphne know that her clothes hadn't dried, they had seeped through her clothe and into her skin. It began to alter her body by increasing her metabolism and expand her body. With every step she grew bigger. Daphne was unaware of this because without her flashlight she could barely see her own two hands. Her stomach was the first to expand wth her butt following shortly after. Event hough she couldn't see her body changing, she did notice that the footprints were not only glowing but also webbed and more than 5 ft. far apart from each other. It's like they...jumped the entire way<br>\r\n<br>\r\nDaphne was starting to feel the changes, but blamed it on her surrounding. When her bloated belly began to slow her down she assumed that the mud was getting thicker and when her bubble butt was starting to rip her skirt she automatically thought that it just got caught on a branch. Even when her bra was beginning to tear she was too focused on following the footprints to notice.When she got to the end of the trail, she found a shocking clue. In front of her were several barrels with a radioactive symbol on it that were leaking a green ooze that trickled into a nearby river. <br>\r\n<br>\r\n\"Oh wow this is incredible. This is the clue of a lifetime. I gotta tell the gang about this.\" Daphne said. <br>\r\n<br>\r\nCrrrroak!<br>\r\n<br>\r\nDaphne twirled around when she heard a loud croak behind her. She gasped when she saw in the shadows a pair of orange eyes staring at her. They were intimidating and yet enchanting at the same time. Daphne backed away slowly and fell backwards when she stumbled on a rock. When she tried to stand up she finally got a look at her body. The first thing she noticed was that her stomach which was beginning to look like she was 9 months pregnant. Next were her breasts which were now D-cups that almost blocked her view of her gut. Even though she couldn't feel it, Daphne could feel her butt had gotten bigger, like she had two balloons in her bun. Daphne started to hyperventilate, scrambled to her feet, and ran for her life. She didn't care if it was a man in a mask, she wanted to get out of there and find out what was wrong with her. Whatever was wrong with her, she hoped that it could be fixed.<br>\r\n<br>\r\nAfter a couple minutes, she spotted one of her friends in the distance. Unfortunately, she was undergoing another change at the same time.</span></div></div>",
            "created":1365915600,
            "id":1571986,
            "title":"as she walks the slime begins to seep into her ..."
        },
        "12313111":{
            "author_id":"yyy24",
            "author_name":"yyy24",
            "choices":[
                "She saw the owner of the eyes hop into a lakeside cave",
                "She lost her footing and fell down a well into an underground nest"
            ],
            "content":"<div class=\"\"><div> <span>As Daphne hurried forward, her strides turning into a fast paced waddle as her thighs and weight continued to bloat up, she noticed Fred off in the distance, as she went to yell to him for help all she managed was a rather loud belch that she croaked out, her tongue flying forward as she did, she raised her hands to her face in shock only to see her fingers a lot longer and greener then she was used to seeing them, and the beginnings of webbed palms between her fingers. <br>\r\n<br>\r\nShe couldn't bare to let her friends see her like this, let alone Fred, turning around in a complete one eighty she ran as best she could, putting down her lack of steady footing to the mud, not her rapidly changing feet and legs that she had yet to notice, hoping that she wasn't spotted by anyone.<br>\r\n<br>\r\nThe further she got away from where she'd seen Fred the more she knew she'd been unseen, she still had some time to solve these changes by herself, no one would have to know what she was becoming, looking around she saw the eyes she'd seen earlier looking at her from behind some plant life, again she tried to yell out after it but found herself ribbiting instead. as the eyes dissapeared into the overgrowth she gave chase, only to find herself falling forwards onto all fours and bounding forward like the big fat overweight frog girl she was becoming. <br>\r\n<br>\r\nThis was all getting to much for her, her bright red hair was clinging to her head and face drenched in the slime still and her weight was still climbing up as she kept absorbing the sludge into her skin, her belly now tickling the ground as she was crouched on all fours, suddenly</span></div></div>",
            "created":1366174800,
            "id":1573807,
            "title":"Cryptic Croaking Conundrums and Conspiracies "
        },
        "123132":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "yeah lets go with this",
                "no something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what if the Frog monster used Daphne isolation to possess her</span></div></span></div>",
            "created":1529861340,
            "id":2511434,
            "title":"possession?"
        },
        "1232":{
            "author_id":"kamenmaster",
            "author_name":"kamenmaster",
            "choices":[
                "A larval form of the moth creature",
                "A female version of the moth creature"
            ],
            "content":"<div class=\"\"><div> <span>At the moment Daphne was walking alone in the twilight of the forest, not that long ago she was paired off with Fred, as usual, until the blond \"leader\" of the gang whent off on a long winded exposition about what kind of traps would be best to catch a mothman. She loved the boy but by god could he be irritating at times.<br>\r\n<br>\r\n\"The big dope, he probably hasn't even noticed that I'm gone yet.\" Daphne sighed in aggrivation, all this effort for what was probably some goon in a costume that was using mass hysteria in combination with a local legend to drive people away from a abandond gold mine or some such thing.<br>\r\n<br>\r\nSo distracted was Daphne that she walks headlong into someone standing in the middle of the path, knocking her back onto her butt.<br>\r\n<br>\r\n\"Ow, sorry about that I didn't see you there.\"<br>\r\n<br>\r\nDaphne looks up at who she walked into and see's a tall dark figure, wearing what appears to be a long cloak. The figure stares down at Daphne, blankly, silent as the grave.<br>\r\n<br>\r\n\"Um, do you even speak english?\"<br>\r\n<br>\r\nThe response she gets is a deep throaty hiss, Daphne then starts crawling backwards slowly away from who, or whatever it was she was talking to.<br>\r\n<br>\r\n\"Is that a no?\"<br>\r\n<br>\r\nThen slowly, painfully so, the cloak starts to unfold itself unfurling into a set of large wings, moth wings if Daphne was seeing right. A pair of feather-like antennae unfurl from its head, and the vaugly human like face splits apart revealing itself to be two small arm like appendages attached to the creatures sholders revealing a set of chitenous jaws and two insectoid eyes.<br>\r\n<br>\r\nDaphne is stunned silent for a few seconds, before screaming like a woman posessed. The moth creature responds in kind with a roar like hiss. Then pounces on it's unlucky prey, pinning her arms and legs to the ground with it's vice like hands and feet. The moth beast roars again before opening its mouth wide and starts spraying Daphne with a thick viscous silk gagging her mouth shut and eventually cocooning her whole body in silk.<br>\r\n<br>\r\nWith its prey securly cocooned the creature then produces a large stinger from its abdomen which it then jabs into the cocoon pumping somthing into Daphne's leg.<br>\r\n<br>\r\nWith her mouth gagged Daphne can only moan at the burning senstation that comes from the sting which quickly spreads from the injection point to all over her body. The red head of the Mystery inc. gang writhes in agony for a few while, which only causes her silk prison to shudder slightly. A minute or so passes and soon the pain becomes to much and Daphne starts to pass out.<br>\r\n<br>\r\n'Feeling faint getting dizzy, am I dying?'<br>\r\n<br>\r\nOnce Daphne has passed out the cocoon stops to shiver, the moth creature lets of a soft yet victorious hiss, grabbs its prize and flys deep into the forest far beyond the trails and camp grounds.<br>\r\n<br>\r\nDeep into the trees the creature retuns to its lair a small portion of the forest quartered off with silk tripwires to warn of intruders, and the leaves of the trees clumped together with more silk to create a think canvus that shades all beneath it from the sun, the moth creature then carefully sticks to cocoon containing Daphne to a tree in its grotto with more silk, then it finds a nearby brach hangs from it like a bat, wraps its wings around it and focuses all its attention on the cocoon.<br>\r\n<br>\r\nEventually the rest of the gang notice Daphne's abscense and start to search, as the hours crawl by they get the police involved, as the hours start to become days, Daphne's parents use their wealth to get private eyes, search parties, the national guard even, but none know where to look.<br>\r\n<br>\r\nThe days become one week, then two, then comes the third week. In the creatures nest neither it nor the cocoon have seemed to move at all during this time, if the thin layer of dust on both is anything to go by.<br>\r\n<br>\r\nThen suddenly a sickening squelch noise comes from inside the cocoon and it starts to shiver and shake. The moth creature perks up and drops from its spot stalking up to the cocoon and carefuly caressing it with its antennae all the while making gentle clicking sounds to whatever it was Daphne had become in the past weeks.<br>\r\n<br>\r\nThen a large crack appears in the cocoon spilling a sickening sludge on the ground beneath it, then whatever it was inside starts to push its way out, it tumbles from the cocoon onto the ground with an uncerimonious flop.<br>\r\n<br>\r\nDaphne had emerged from her internment at last but now she was</span></div></div>",
            "created":1363237200,
            "id":1550241,
            "title":"The Mothman of Crystal Cove, or, mimic 4"
        },
        "12322":{
            "author_id":"wolfman26",
            "author_name":"j.c.kempman",
            "choices":[
                "Screamed",
                "Cried"
            ],
            "content":"<div class=\"\"><div> <span>Daphne quivered as she tried to stand and get her bearings. The light of the setting sun shined thorough the cracks between the leaves and stung her eyes,causing her to look away and cover them with her claws. Wait, claws?<br>\r\n<br>\r\nShe pulled her claws away from her eyes and saw exactly what she was suddenly fearing, She could feel herself quivering a bit more as she glanced from her claws and down to the rest of her body. Her body still retained much of it's humanoid shape, but was now covered in thick hair. There was not one bare spot on her body, not even her claws.<br>\r\n<br>\r\nHe reached to the top of her head and felt the feathery feeling of antennae sticking out. <br>\r\n<br>\r\nThe writing was on the wall and she knew what it meant. She could feel the slight flapping of her wings as she collapsed to her knees. She looked up to the sky and</span></div></div>",
            "created":1486789200,
            "id":2276449,
            "title":"A female version of the moth creature"
        },
        "1233":{
            "author_id":"windgarden",
            "author_name":"WindGarden",
            "choices":[
                "A giant plant thing",
                "A vicious werewolf",
                "another kind of monster"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Surely, there are other kinds of monsters...</span></div></span></div>",
            "created":1365742800,
            "id":1570461,
            "title":"Hold up"
        },
        "12333":{
            "author_id":"mrhawlprime",
            "author_name":" mrhawkprime",
            "choices":[
                "A powerful witch.",
                "a different monster."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><b>How about a <span class=\"cgrape\">wi</span><span class=\"cplum\">t</span><span class=\"cblack\">ch</span>.</b></span></div></span></div>",
            "created":1508043600,
            "id":2401416,
            "title":"another kind of monster"
        },
        "124":{
            "author_id":"nanook",
            "author_name":"Nono",
            "choices":[
                "Switch body parts with Velma",
                "Swap bodies with Velma",
                "Switch body parts or bodies with someone else"
            ],
            "content":"<div class=\"\"><div> <span>Daphne, being as headstrong as she is, got tired of waiting for the guys to finish with all of their snacks and other antics.  \"Enough of this foolishness!\" she thought.  \"I'm going to explore this place on my own!\".<br>\r\n<br>\r\nWandering out of the old house that they had come upon in the fog, she was strangely drawn down a hill, and into the woods.  Shortly, she came upon a grouping of rocks that seemed to call to her.  Daphne carefully approached it, only to see a weird, green glow coming from the center.  As she kneeled down to investigate, she was suddenly overcome with a thick green fog that almost made her feel like she was floating.  As she continued to stare at the rocks, a green light arose that grew in intensity, until it was floating in front of her face and the size of a basketball.<br>\r\n<br>\r\n\"Do not be alarmed!\" said a voice emanating from the hypnotic light.  \"You have been chosen to receive a great gift!  An amulet that will allow you to do things you never thought possible!\"  Daphne felt something hanging around her neck.  When she looked down, she saw a green glowing amulet, with the same hypnotic color and pulsing as the ball of light in front of her.<br>\r\n<br>\r\n\"However, to earn the right to use this gift, you must prove your worth by unlocking its secrets on your own.  Farewell!\"<br>\r\n<br>\r\nWith that the light and green fog lifted.  The only thing remaining of this experience was the amulet hanging around Daphne's neck.<br>\r\n<br>\r\n\"I wonder what this thing does?\" she thought.  \"Oh well, one way to find out!\"  She grasped the amulet and concentrated until a book, a manual if you will, appeared in her minds eye, giving her the secrets to the device.  \"Oh WOW!  I've GOT to try this out!\" she cried out.  <br>\r\n<br>\r\nWhat does she do first?<br>\r\n<br>\r\n</span></div></div>",
            "created":1380949200,
            "id":1674554,
            "title":"A Truly Strange Discovery"
        },
        "1241":{
            "author_id":"firstlastname",
            "author_name":"firstlastname",
            "choices":[
                "\"-We should trade even more parts, Velma!\"",
                "\"-let's combine all our body parts into the ultimate woman!\"",
                "\"-Let's show the boys...maybe try it on them too!\""
            ],
            "content":"<div class=\"\"><div> <span>The first person Daphne immediately saw was Velma, and darted right over to her.<br>\r\n<br>\r\nRight away, Velma rolled her eyes. \"Geez Daph, I know you love fashion but do you need to try stuff on in <i>every</i> haunted house?\"<br>\r\n<br>\r\n\"Hey, this isn't just any necklace,\" Daphne fired back, \"it told me I've got incredible powers now!\" While she struck a pose with it, Velma proceeded to facepalm.<br>\r\n<br>\r\n\"Okay, get real. What makes you think that piece of jewelry is magical, much less fashionable?\"<br>\r\n<br>\r\nRealizing it would take more to sell over Velma, Daphne pouts and attempts to use her new abilities. \"Weeeell...I can fix both your doubts. This necklace would go much better with <i>your</i> sweater, don't you think?\"<br>\r\n<br>\r\n\"I guess, but-\"As Velma shrugged, a flash of light instantly enveloped both girls. Seconds later Daphne was posing again, but Velma skipped a beat when she noticed what was different. \"H-how did you take my sweater?!\"<br>\r\n<br>\r\nDaphne giggled. \"Not just your sweater, Velm...even better than that~\"<br>\r\n<br>\r\nVelma felt her proportions were a little odd, until she looked down. She was met with long, slender, manicured arms, and an impressive rack poking out of her shirt. Then realization hit her; she wasn't just wearing Daphne's sweater, they had swapped upper torsos somehow! \"Daphne! you change us back right <i>now!</i>\"<br>\r\n<br>\r\nShe just continued posing with Velma's arms. \"Hmmm....I got it!-\"</span></div></div>",
            "created":1484802000,
            "id":2266111,
            "title":"Switch body parts with Velma"
        },
        "12412":{
            "author_id":"firstlastname",
            "author_name":"firstlastname",
            "choices":[
                "Average human",
                "Twice is always nice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will Daphne and Velma have a normal body with two arms and legs (and heads), or will they crm all of their limbs and body mass into one form?</span></div></span></div>",
            "created":1484802000,
            "id":2266112,
            "title":"\"-let's combine all our body parts into..."
        },
        "125":{
            "author_id":"normjr",
            "author_name":"kingler",
            "choices":[
                "fountain of youth",
                "spear of height",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The mystery inc. gang have heard of a strange phenomenon and Daphne and Velma have been sent to investigate. <br>\r\n<br>\r\nWhat is it.</span></div></span></div>",
            "created":1391317200,
            "id":1736985,
            "title":"or a mystery involving a supernatural phenomenon"
        },
        "1251":{
            "author_id":"ageregressmlp",
            "author_name":"MLPAgeRegress",
            "choices":[
                "Velma takes her to an apartment and becomes Daphne's mommy",
                "Something else",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>It looked like a ghost of some sort. A babysitter ghost. It spotted them.<br>\r\n<br>\r\n\"What are you two doing here, come forth don't be shy?\"<br>\r\n<br>\r\nThey were surprised, but did so.<br>\r\n<br>\r\n\"We're her to investigate youth claims\" Daphne said.<br>\r\n<br>\r\n\"Aaahh, yes. I've been changing peoples' ages lately. That reminds me.\"<br>\r\n<br>\r\nShe transformed Daphne into an infant. She was wearing all the same clothes, she just was babified and you could see the diaper going beyond the skirt.<br>\r\n<br>\r\n\"Waaaaah!! WAAAAAAAAAAHhh!! Mommy\"<br>\r\n<br>\r\nVelma picked her up and cradled her. \"Its ok, Mommy is here. Now let's get you situated into your new life.\"</span></div></div>",
            "created":1393563600,
            "id":1752638,
            "title":"fountain of youth"
        },
        "1252":{
            "choices":[
                "left lying down on the road in front of daphne's home mansion",
                "hidden in a deserted forest",
                "In front of velma's house"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where is the spear if height to be found?</span></div></span></div>",
            "created":1440738000,
            "id":2026893,
            "title":"spear of height"
        },
        "12522":{
            "author_id":"psiredem",
            "author_name":"Psiredem",
            "choices":[
                "Three inch tall, the spear looking like a gigantic tree to her.",
                "20 foot tall, the item having the same size as a toothpick to Daphne."
            ],
            "content":"<div class=\"\"><div> <span>As the Scooby Doo gang was settling in the middle of a forest to camp for a few days, the Mystery Machine stopped in a place where trees were rare enough to let the vehicle's crew leave the van. Once out, each of them reacted differently: Fred was happy to find some place to rest and started to gather the necessary elements to build a fire. Velma, on the other hand, simply stretched and sat on a flat boulder to keep reading the encyclopedia she had recently tackled. Shaggy and Scooby, for what was about them, were busy listing what food they had left after consuming more of its half during the trip. <br>\r\n<br>\r\nFinally, Daphne, carefully left the Mystery Machine, as she had just finished to put on her swimming suit. Fred and Velma had laughed when she told them there would be no where to take a swim and not enough of a good weather for sunbathing. The redhead had simply shrugged, telling them they would be the one regretting their decision once a beautiful lake would show up to the group. Since everyone else was busy minding their own business, Daphne allowed herself to go for a walk, hoping to find find a big enough spot to swim in and make them jealous. <br>\r\n<br>\r\nA few minutes later, the young woman thought her wish had been granted when her naked feet stepped in some mud. She grinned and told herself. <br>\r\n\"I can't wait to hear them complaining about their sunburns and mosquito bites while I'll be diving into my paradise of fresh water!\" <br>\r\nUnfortunately, all what the woman could find was a bunch of puddles, filled with extremely smooth sand and clear water.<br>\r\n\"Strange... It looks like... Tiny pools...\" <br>\r\nAs she walked further to investigate her discovery, her curiosity brutally ceased when she tripped on some sort of branch.<br>\r\n\"What the-\" the redhead said before barely stabilizing herself, preventing her from sinking into the muddy surface. A quick look on what she thought to be an ordinary stick caught her attention, especially when Daphne noticed its golden grip and sharp tip, as if decorated with a shard from a shattered sapphire. <br>\r\n\"Hey, who would throw away something like that?  I'd rather bring it to Velma, she always loved to study archeology, maybe that would help her to drop that stupid book of hers.\" <br>\r\nBut as soon as Daphne grabbed the ancient item, which seemed to be a spear, its jewel glew in a powerful flash, momentarily blinding the young woman. Once able to open her eyes again, she was...</span></div></div>",
            "created":1508043600,
            "id":2401511,
            "title":"hidden in a deserted forest"
        },
        "125221":{
            "author_id":"psiredem",
            "author_name":"Psiredem",
            "choices":[
                "...A strangely dressed individual of her size, poking her with a spear.",
                "...An insect about to take a bite of Daphne ! "
            ],
            "content":"<div class=\"\"><div> <span>Daphne lingered speechless as the strange tool she had just checked seemed to have exploded in her hands. Rubbing her forehead like after a hangover, the young woman got up, only to notice a huge, golden structure standing in front of her. <br>\r\n<br>\r\n“W-where am I, what happened..? “ She stood there for a few minutes, thinking about her situation while carefully looking around her. <br>\r\n“I...I was just there, holding that thing to bring it back to Velma and-”<br>\r\nShe suddenly stopped when she almost fell off into a hole in her walk. What surprised her even more was how this gap was shaped like a footprint. Daphne looked this time down, and remembered how she tripped on the spear she had found before spotting it. The young lady stared at the ground, noticing how it was composed of rocks, and not sand, as she remembered. In fact, it looked exactly like sand particles, only bigger. The next thing Daphne saw was a bunch of wooden cabins, flattened as if some monster from a Japanese movie had stomped them. Daphne's feet felt awkwardly itchy at this sight. Some explanation came to her after quickly checking them: wooden shards, probably stuck on her foot after this long walk, looked exactly like if they were made of the same material than the constructions next to her. <br>\r\n<br>\r\n“Aw…” she said removing the last needle. “At least that's one thing taken care of…”<br>\r\nDaphne then proceeded to keep analyzing the situation, causing her to look again at the huge gilded structure. After finally circumventing it, something unavoidably caught her attention: some sort of blue boulder was shining at the tip of that...thing. And it was too much of a coincidence for Daphne to prevent her from understanding what happened.<br>\r\n<br>\r\n“Wait a minute… if this is the spear from earlier, only thousands times bigger, and the wood shards look like the wooden planks from the cabins, not to mention those huge footprints on the ground, while I was the only one here...does that mean that… I'VE SHRUNK?!”<br>\r\n<br>\r\nDaphne could not believe it. There had to be a rational explanation. There had always been one. She probably had fallen asleep, and all of that was nothing but a bad dream? <br>\r\n<br>\r\n“It's the only possibility. All what I have to do is to wake up!” <br>\r\n<br>\r\nAnd so, she pinched her cheek hard. The slight discomfort did not prove helpful, but what surprised Daphne instead was a sharp pain in her back!  When she turned around in the blink of an eye to understand what was happening, what she saw was…<br>\r\n</span></div></div>",
            "created":1509390420,
            "id":2408951,
            "title":"Three inch tall, the spear looking like a gigan..."
        },
        "1252211":{
            "author_id":"psiredem",
            "author_name":"Psiredem",
            "choices":[
                "”Welcome to my humble empire, Majestic One.”",
                "”You shall pay for soiling the Height of Spear with your filthy hands, Fiend.\""
            ],
            "content":"<div class=\"\"><div> <span>Daphne reacted immediately by staring at what had just hit her, but what she could see was a man -or at least a person she thought was male- since a scary looking helmet hid his entire head. He was not wearing anything if one excluded the large piece of cloth covering from his waist to his feet. What truly revealed his gender was the absence of breasts on his chest. <br>\r\nDaphne flinched at his sight: his mask was intimidating, and the spear he kept pointing at her did not help. Daphne, although not psychic, could definitely read fear in the position of her attacker, as the latter was clutching his spear as if Daphne could trigger a hurricane to send him flying by simply blowing at him. Taking this advantage into account, she, while pointing at his weapon, said:<br>\r\n“Hey! What the heck are you doing?! This thing hurts, you know!”<br>\r\n<br>\r\nThe man, standing still, slightly shook his head, as if unable to understand what the redhead just told him. But Daphne did not have the time to explain anything further since two other individuals, dressed in a similar fashion, burst out of the rocks -now as big as boulder to Daphne- and lifted her. <br>\r\n<br>\r\n“Hey!’” she shouted, pointlessly pounding her fists against her attackers. “Let me go, you brutes! You hear me? I should have stomped your entire villa-”<br>\r\nBut she could not end her sentence as one of them gagged her and tied Daphne up to one of their vehicles. To the young woman’s dismay, she realized the red shell she was attached on was that of a beetle ! <br>\r\n<i>“Oh my, am I really this tiny?!”<br>\r\n</i><br>\r\nAnd so the flight began. Daphne did her best to not panic. One could think that after all the captures she had gone through, the lady would no longer care, but in all previous cases, there had always been a rational explanation to what had happened, but she doubted she would be able to find one here. After all, had she not gotten shrunk as small as a bug? Even a scientist like Velma would linger baffled by that! And what was going to happen to her at this size?! How was she going to live like any other persons?  What were Fred and the others going to think if they ever found her back?  And most importantly… How was she going to use any of her makeup, now that a mere lipstick was five times bigger as she currently was? All of those questions ceased as soon as the bug landed on a leaf nearby. The other people came right after her, riding different insects as well. They lifted her through the massive vegetation, making simple grass look like a dense jungle to Daphne. In spite of their efforts to restrain her moves, she kept struggling to break free. All her attempts stopped when her abductors suddenly threw her into a wide room after entering some sort of building. <br>\r\nDaphne was almost stunned by the way the mysterious men got rid of her. The latters immediately kneed toward the far end of the room, where someone was sitting on what seemed to be a throne. Still unable to speak or move, all what she could do was to gaze at that same person approaching her. He waved the others to leave. <br>\r\n<br>\r\n<i>“That is not good…”</i> Daphne thought.<br>\r\n<br>\r\nOnce done, the man snapped his fingers, causing the ropes and rag to untie and magically fly away from Daphne. Two ideas came to the mind of the young woman: fleeing and fight to survive in this gigantic world to live as a minuscule damsel in distress forever, or simply listen to that creep and possibly negotiate a way to grow her back to normal size. Given how shaken she felt after all that mess, she complied to the second option, hoping that guy was at least able to understand a word of English. Surprisingly, he told her…<br>\r\n<br>\r\n</span></div></div>",
            "created":1510432260,
            "id":2413933,
            "title":"...A strangely dressed individual of her size, ..."
        },
        "12522111":{
            "author_id":"psiredem",
            "author_name":"Psiredem",
            "choices":[
                "...asked: \"What kind of help exactly?\"",
                "...barked: \"You gotta be kidding me!\""
            ],
            "content":"<div class=\"\"><div> <span>“W-What did you say?” the destabilized woman asked, recovering from her brutal treatment. <br>\r\n<br>\r\n“Why yes, my dear, my people and I, to tell you the truth, have been waiting for you.” <br>\r\n<br>\r\nHe sighed.<br>\r\n<br>\r\n“Please accept the apologies of my men for taking you to me in such a way. As I have told you, Majestic One, your presence here is a bless for my Empire. Allow me to introduce myself: my name is Akzolon, of Xijun, the territory under my protection.”<br>\r\n<br>\r\nDaphne looked at him angrily. She got back up, put her hands on her waist and said, as if scolding a child who had committed some mistake.<br>\r\n<br>\r\n“So, what you say is that your way of greeting someone is to shrink that person, capture her like some beast, and then pretend to worship her like some deity?! And what's that “Majestic One” title you are calling me anyway?!” <br>\r\n<br>\r\nAkzolon, as if expecting such a reaction, did not even flinch at the accusation from the shrunken woman. <br>\r\n“Please, try to understand, we just want to-”<br>\r\n<br>\r\n“-To keep me prisoner as a toy for freaks like you?! Grow me back immediately!” Daphne thundered. <br>\r\n<br>\r\nThis time, the chief, or whatever his title was, looked worried -even through his bizarre helmet- as if afraid of messing up a very important opportunity. This detail caught Daphne's attention, and gave her the strength to keep shouting.<br>\r\n<br>\r\n“You have no idea how terrible it is to be that small, when supposed to live in a world a hundred times bigger than your current size! And how did we all got so small anyway?!”<br>\r\n<br>\r\nAkzolon took advantage of her brief silence to convince her into listening to him.<br>\r\n<br>\r\n“Good. Now that we are done, will you listen?”<br>\r\n<br>\r\nDaphne crossed her arms in anger, but did not interrupt him.<br>\r\n<br>\r\n“It is the first time in centuries, that the Spear of Height reacted in such a way. Normally, anyone who touched it would never had been affected in any kind of way, but you...are obviously different.”<br>\r\n<br>\r\n“Oh, am I?” the sarcastic woman asked. <br>\r\n <br>\r\n“I assure you this is no lie. Not to mention you are the only woman I've seen in centuries!”<br>\r\n<br>\r\n“Centuries?  Don't you think it isn't a little far-fetched?”<br>\r\n<br>\r\nAkzolon smiled at her, and removed his mask. What was concealed behind dazzled Daphne: the skeletal face of Akzolon, as well as the rare silver hair on his head proved his words were speaking the truth. <br>\r\n<br>\r\n“Do you see now, Majestic One, the time we have been waiting for you? For a woman to bring our civilization back to life?”<br>\r\n<br>\r\nAt this sight, a thousand of questions were popping inside Daphne's head. She asked the most important one, stuttering: <br>\r\n“B-but...who are you all exactly..? What do you want from me?”<br>\r\n<br>\r\n“As I've told you we are what is left of an ancient empire. A fallen empire, sustaining itself on my weakening magic to not collapse for good. All the men you can see here...are my sons, who, unlike me, benefit from my powers to escape the harmful impact of time. This is how we survived for hundreds of years, shrinking ourselves to protect ourselves from those who might interfere with our desperate struggle for survival, especially since we can't have new children…without females. Now please...we need your help.”<br>\r\n<br>\r\nSkeptical, Daphne…<br>\r\n</span></div></div>",
            "created":1511710800,
            "id":2420546,
            "title":"”Welcome to my humble empire, Majestic One.”"
        },
        "12522112":{
            "author_id":"psiredem",
            "author_name":"Psiredem",
            "choices":[
                "\"I think your friends have come to give us a visit.\"",
                "\"The Spear of Height is awakening !\""
            ],
            "content":"<div class=\"\"><div> <span>Daphne did not know what to do: not only had she been shrunk, captured, transported like mere merchandise on fricking bugs, to which she could not even compare in matter of size, but now she had gotten tossed like some criminal and accused of something she did not even understand! At least were some of them able to talk.<br>\r\n“I, Akzolon, of the Xijun Empire, shall not allow this.”<br>\r\nThe self-proclaimed emperor kept speaking:<br>\r\n“Not only have you destroyed some of our villages, but you even dared to claim the Spear of Height, the treasure our mighty ancestors left to us for our protection!” <br>\r\n<br>\r\nAs the man walked away from the shadows concealing his throne, Daphne could see how old this so-called emperor was, and from her point of view, he probably was seventy. Once close enough to check his prisoner in detail, he looked astonished. <br>\r\n<br>\r\n“A female?!  What's a female doing here? Why didn't any of you warn me any sooner?!” he barked at his subjects. <br>\r\nOne of them, coming back from the the antichamber, shaking, answered in a language Daphne could not identify.<br>\r\n<br>\r\n“A demon, you say? You fool. What we have here is simply a woman from above, the world we chose to reject!”<br>\r\n<br>\r\nThe humble masked man had the bravery to keep explaining. Judging by his hesitating tone, this emperor was probably no one to mess with, Daphne thought. Fortunately for him, the emperor sighed as a sign of forgiveness. <br>\r\n<br>\r\n“I see. So she hasn't come alone. If only one of them succeeded in causing such a mayhem…then we must proceed quickly. That said, I think we have a unique opportunity here. We haven't had a woman among us for dozens of years…I'm wondering if this would be a sign of our ancestors to-”<br>\r\n<br>\r\n“-will you turn me back to normal and let me go already?!” Daphne yelled, furious.<br>\r\n<br>\r\nAkzolon sighed like an adult would do with an ill-mannered child. <br>\r\n“I shouldn't have expected anything else from a woman from above.”<br>\r\n<br>\r\nHe approached her, staring at his prisoner with a disgusted expression on his face. <br>\r\n“Let me tell you a story: our civilization has been at war with one composed exclusively of women, whose goal was to make of our magic their own. We struggled for a long time against our enemy.”<br>\r\n<br>\r\n“Thank you old man,” Daphne said, “But I'm currently not in the mood for a bedtime story.”<br>\r\n<br>\r\nAkzolon ignored her reply and kept talking: ”None of us could defeat one another, until our own women decided to betray us. And so, our ancestors lost their powers after this treason. As a last resort to escape extinction, we had no choice but to shrink our population to escape those warmongers, after shrinking down our traitors even more, that is. You should count your blessings that the Spear of Height lost a lot of its power over time.  Otherwise, I think you would have turned even punier, even to us.”<br>\r\n<br>\r\nHis scolding was interrupted again as the ground violently quaked, causing the palace to vibrate, as if shivering in terror from an upcoming danger. <br>\r\n<br>\r\nAkzolon grinned as if he knew all along what was happening. He then turned to Daphne and said…</span></div></div>",
            "created":1511628540,
            "id":2420109,
            "title":"”You shall pay for soiling the Height of Spea..."
        },
        "125221122":{
            "author_id":"psiredem",
            "author_name":"Psiredem",
            "choices":[
                "Shrink to an even smaller size.",
                "Grow back to the size of a doll."
            ],
            "content":"<div class=\"\"><div> <span>“Unfortunately for both of us, I fear I'll have to go check this...miraculous phenomenon out.”<br>\r\n<br>\r\n<i>“Sure, I'm truly sad too to not see that ugly face of yours…”</i> Daphne thought.<br>\r\n<br>\r\nBut her secret sarcasms ceased as guards burst into the throne room, grabbing her.<br>\r\n<br>\r\n“How nice of you guys to help me getting up, it's true that I'm not smart enough to do it mysel- OH!” the shrunken woman said as she was tossed again in a tight and dark room. The only light source was what appeared to be a crystal ball encased in the door. The latter glew, and casting Akzolon’s image. <br>\r\n<br>\r\n“So is our dear guest enjoying her cell?” the old emperor asked.<br>\r\n<br>\r\n“A little more than you do with your old bones, you fossil.” Daphne replied.<br>\r\n<br>\r\nAkzolon burst out laughing. <br>\r\n<br>\r\n“There's no need to feel so angry. Soon, you'll have some company. I'll be sure to help your friends into finding you back.” he said while flaunting a familiar looking mace in his hand. Daphne remained dumbstruck at this sight.<br>\r\n<br>\r\n“It...It can't be! This is-”<br>\r\n<br>\r\n“-the Spear of Height, yes. I think the filth of your touch revived its true nature again, accepting me as its master.”<br>\r\n<br>\r\n“And probably resized to better fit your brain, too.”<br>\r\n<br>\r\nYet again, Akzolon simply grinned to the insult, and did not explain how such a result was even possible.<br>\r\n<br>\r\n“We'll see each other very soon, and as I've told you, I think your friends deserve an invitation into my palace as well!”<br>\r\n<br>\r\nDaphne flinched to the threat.<br>\r\n“You wouldn't dare!”<br>\r\n<br>\r\nBut the orb suddenly stopped the transmission.<br>\r\n<br>\r\n“Dang it!” Daphne said, slapping the door with her hand. The walls started to shake again as a response. <br>\r\n<br>\r\n“Oh what again?” Daphne said, annoyed. <br>\r\n<br>\r\nThe answer did not take long to come, as this time, her cell, and the entire palace, collapsed as beams of sunlight flared through the rifts shattering the ceiling. Once she saw what was responsible for such a mayhem, Daphne screamed, but given her size, it sounded more like a squeak than a real cry for help. A massive hand burst in the palace -or what was left of it- and grabbed the miniature woman, as if catching a fruitfly. After spotting the huge golden weapon in the giant hand, it did not take long for Daphne to understand what was going on: the Spear had not shrunk to Akzolon’s size, he was the one who got bigger all along, or at got back to human size !<br>\r\n<br>\r\n“If you knew,” her abductor said, “How long I had been waiting for this moment, for the Spear of Height to recover its original powers, causing our entire civilization to collapse in amazement, all of that thanks to the trap we landed to one of you, the people from above. Now all what I need, is the taint of a few more volunteers to make the world my own, and I think your friends are going to be of a great help.”<br>\r\n<br>\r\nThat said he aimed at Daphne with his weapon, causing the latter to…<br>\r\n<br>\r\n<i></i></span></div></div>",
            "created":1512303180,
            "id":2423379,
            "title":"\"The Spear of Height is awakening !\""
        },
        "1252212":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Keep going",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do we keep going or try something else?</span></div></span></div>",
            "created":1510348620,
            "id":2413451,
            "title":"...An insect about to take a bite of Daphne ! "
        },
        "12522122":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she noteds someone coming?</span></div></span></div>",
            "created":1577438040,
            "id":2765216,
            "title":"Something else"
        },
        "1253":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Were-animal plague.",
                "Real monsters!",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What's going on that defies all explanation?</span></div></span></div>",
            "created":1433653200,
            "id":1988962,
            "title":"Something's up..."
        },
        "12531":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Daphne goes in first.",
                "Velma goes in first."
            ],
            "content":"<div class=\"\"><div> <span>It was a wonder what was happening- anthropomorphic animals were quickly becoming more common than the local humans. But how was this happening? Well, as far as the Mystery Inc. gang knew, it had all happened rather suddenly. It all started roughly on the first day of the new school year. Everyone was excited- after all, it's not everyday that you reach junior year. Yet, despite the excitement that the gang had, as well as their other fellow juniors, one soul didn't seem as excited. That one was Hot Dog Water, otherwise known as Marcie Fleach. She seemed nervous and, concerningly, seemed to be shedding hair in fear. Velma (and Daphne, who served as liaison due to Marcie and Velma's shaky friendship) went to find out what was wrong. That's when it happened.<br>\r\n<br>\r\nThe three met in secret after school. Marcie had been wearing a lot of clothes lately- a heavy overcoat, a wide-brimmed hat and a ton of bandages over the face (among other such things). This was weird enough- it was still partially summer, but here was Marcie, dressed like it was the middle of the harshest winter ever! However, Marcie was only beginning to show the strangeness that was going on. She tore off her heavy clothes, revealing that she was coated with fur and had metamorphed into an Anthro dachshund!<br>\r\n<br>\r\nThat had been a week ago. As time went on, however, things got worse. Marcie was taunted, of course, but she didn't seem to mind; in fact, as time went on, she seemed to get lost in an endless bliss. Imagine the shock when this fairly new Anthro had given birth to Anthro puppies during a class. The professor, none too impressed, tried to dispose of them. Marcie responded violently, biting the professor. He quickly healed from the injury- nearly instantly -and became an Anthro in a matter of seconds and (in a shocking twist) his mind suddenly went from loathing the anthros to loving them- and Marcie, in particular, who the professor now saw as a mate (awkward much?). Everyone was freaked out- but the changes still kept coming. New strains of anthros seemed to pop up within a matter of hours- cats, dogs, birds, lizards and (in a deja vú kind of moment) Anthro crabs (among other such species) began to show up everywhere!<br>\r\n<br>\r\nThe police were helpless to stop this- any attempt to cull the anthros seemed to trigger a hive mind-like reaction from all the other anthros, who quickly swarmed and tore apart the cops. Thankfully, acts of aggression were few and far between. Despite this, the endless changes were becoming noticeable and the government was considering quarantining the city of Crystal Cove- or worse, cleansing the area with a bomb! This couldn't come to pass.<br>\r\n<br>\r\nDoing investigation on a scale never done before, Mystery Inc. began to look into the situation to see if a cure could be obtained. Thankfully, the first victim- Marcie -was more than willing to tell where the whole ordeal began. An old abandoned pet care facility- part pet daycare, part pet supply factory -situated on the edge of town was where she had been before she was turned into an Anthro. This was the first stop.<br>\r\n<br>\r\nHowever, only the girls were willing to go there. Scooby had gone missing in the chaos during the Anthro takeover, leaving Shaggy heartbroken. He quickly rushed off to find his canine companion. As for Fred, he had locked up his house, refusing to leave- the Anthro surge had left him in a panic over who- or what, in this case -was the dominant life form, so he began to produce major traps to prove that humanity was better than anthros. How typical of Fred- when the going gets tough, make a trap.<br>\r\n<br>\r\n\"Well, here we are\" said Daphne.<br>\r\n<br>\r\n\"If Marcie was right, then this place should be the source of all these mutations\" said Velma.<br>\r\n<br>\r\nThe pet facility was an eyesore, to put it bluntly. Having it settled in swampland- similar to the home of those Gator People that had shown up in one of their earlier cases -was a major turn-off for any workers. The building had also seen the wear and tear of what seemed to be years of neglect- windows were broken, doors had been coated in rust and any paint that remained on the building was flaking off. Still, it was quiet- a little TOO quiet,McGovern that this was the source of the Anthro origin.<br>\r\n<br>\r\n\"Let's see what's up. We won't be able to restore Crystal Cove just standing here\" said Velma.</span></div></div>",
            "created":1450674000,
            "id":2077517,
            "title":"The furry takeover."
        },
        "125311":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "The girls find a lot of info.",
                "An Anthro guard attacks."
            ],
            "content":"<div class=\"\"><div> <span>\"I'll go first\" said Daphne.<br>\r\n<br>\r\nTaking point, she slowly opened the door... and was met with a horrific smell. It was like every kind of domestic animal's scent had been rolled into one and left to stagnate. It wasn't pleasant, but the scent must have been an indicator that they were on the right track. The inside of the building, despite being a mess, actually had some cleanliness to it; the floors had been recently steeped and a front desk had a computer that was turned on.<br>\r\n<br>\r\n\"Let's see what we can find...\" said Velma. She began to type the computer's keys, breaking down the security codes...</span></div></div>",
            "created":1462078800,
            "id":2141645,
            "title":"Let's do this!"
        },
        "1253111":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "An anthro attacks the girls.",
                "A scream echoes out from elsewhere in the facility."
            ],
            "content":"<div class=\"\"><div> <span>Velma didn't have to search very hard to find out some concerning details of the company. As it turned out, this company had been built in the 1800s, with the founder- one Dr. Moreau -having shown an overly serious love for animals. He took in animals that had been abused, neglected and downright abandoned- which was admirable -but what he did with them afterwards was a shock. He had been taking their DNA and splicing it into the human chain. The end result was a series of anthropomorphic creatures, which the founder quickly sent to torment the city. The less-than-good Doctor was arrested, only to disappear when a prison riot saw his cell broken into. His death remained ambiguous, but his business continued, despite negative attention. Unfortunately, each successor intended to continue Moreau's work (as the police discovered), suggesting Moreau either had planned his successors in advance or had an equally insane family working under assumed identities. Either way, the facility was closed down in the aftermath of World War 2... That was when things got interesting. The police raid uncovered several ancient relics, dating to the time of the Annunaki. It was clear that Moreau had plans to bring these Anthros back to life. However, the real shock was that Moreau hadn't just been making humans animalistic, but the animals were being made into humans, too! Horrified, the government had the company shut down for good, with all employees being thrown in asylums and the lab subjects were exterminated or (in the case of the newborns that were forged from the altered animals) kept under quarantine. These latter creatures eventually escaped \"as he had expected\"... Had Moreau somehow predicted that his creations would become as smart as humans, or even smarter? What mattered now was that the facility was back on-line.<br>\r\n<br>\r\n\"But who would want to keep this going?\" wondered Velma. Just then...</span></div></div>",
            "created":1465966800,
            "id":2164627,
            "title":"A data gold mine."
        },
        "12531112":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "It was a trap!",
                "Someone they knew was changing!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A scream suddenly emanated from deeper in the facility! Looks of worry on both their faces, Velma and Daphne ran down the hall nearby to see what was wrong. They found...</span></div></span></div>",
            "created":1469941200,
            "id":2188993,
            "title":"What noise!"
        },
        "125311121":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Hot Dog Water (she was behind the whole thing).",
                "Nova (she is recreating the Anunnaki)."
            ],
            "content":"<div class=\"\"><div> <span>Velma and Daphne ran down a nearby hallway, rushing into a room that looked as though it had housed a particularly vicious anthro breed (if the claw-marks on the wall were anything to go on), when the door slammed shut on them with a thunderous \"Boom!\". Attempting to open it was met with no success.<br>\r\n<br>\r\n\"We're trapped!\" said Daphne. \"Can this get any worse?!\"<br>\r\n<br>\r\n\"Depending on your opinion, yes\" said a female voice outside of the room. Turning to the one wall made of reinforced glass, both Daphne and Velma saw they were being observed by someone. It was..</span></div></div>",
            "created":1500181200,
            "id":2354257,
            "title":"Caged like animals!"
        },
        "125311122":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "A friend of theirs.",
                "A foe from an old case."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Running down a nearby hall, the girls saw (through a window of thick plexiglass) that someone was being turned into an anthro! It was...</span></div></span></div>",
            "created":1493528400,
            "id":2312938,
            "title":"Don't I know you?"
        },
        "1253111221":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "A friend from school.",
                "A member of Velma or Daphne's family (give the choice for either)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who was being turned into an anthro-beast?</span></div></span></div>",
            "created":1506834000,
            "id":2395120,
            "title":"This just got personal!"
        },
        "1253112":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Feline.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What creature attacked the girls?</span></div></span></div>",
            "created":1474779600,
            "id":2214440,
            "title":"Busted!"
        },
        "12533":{
            "author_id":"readmystory",
            "author_name":"Aaron",
            "choices":[
                "Sounds intriguing ",
                "Another mystery "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A people of a small town is experiencing some strange physical changes?</span></div></span></div>",
            "created":1477803600,
            "id":2230448,
            "title":"Something else."
        },
        "125332":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What if she find a wishing stone?</span></div></span></div>",
            "created":1515864780,
            "id":2440221,
            "title":"Another mystery "
        },
        "13":{
            "author_id":"writer-srf",
            "author_name":"Sam Cravin",
            "choices":[
                "They gain weight",
                "They shrink ",
                "They grow old unnaturally",
                "They age in reverse",
                "They transform seperately"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens to the Hex Girls?</span></div></span></div>",
            "created":1329973200,
            "id":1282812,
            "title":"The Hex Girls"
        },
        "131":{
            "author_id":"writer-srf",
            "author_name":"Sam Cravin",
            "choices":[
                "1 out of 3 gains weight",
                "2 out of 3 gains weight",
                "They all gain weight"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will they gain weight seperatly or all together?</span></div></span></div>",
            "created":1329973200,
            "id":1282848,
            "title":"They gain weight"
        },
        "1311":{
            "author_id":"writer-srf",
            "author_name":"Sam Cravin",
            "choices":[
                "Thorn",
                "Luna",
                "Dusk"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, but which one?</span></div></span></div>",
            "created":1332306000,
            "id":1299671,
            "title":"1 out of 3 gains weight"
        },
        "1312":{
            "author_id":"writer-srf",
            "author_name":"Sam Cravin",
            "choices":[
                "Dusk and Luna",
                "Luna and Thron",
                "Thorn and Dusk"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which ones?</span></div></span></div>",
            "created":1332306000,
            "id":1299681,
            "title":"2 out of 3 gains weight"
        },
        "1313":{
            "author_id":"writer-srf",
            "author_name":"Sam Cravin",
            "choices":[
                "They get cursed",
                "They decide to gain weight with Scooby and Shaggy to become more popular",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How and why?</span></div></span></div>",
            "created":1332306000,
            "id":1299683,
            "title":"They all gain weight"
        },
        "13133":{
            "author_id":"writer-srf",
            "author_name":"Sam Cravin",
            "choices":[
                "Pizzas",
                "Other Junk Food"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"center\"></div>Our story begins on a night in Oak Haven, Massachusetts, where the famous Eco-Goth rock band, the Hex Girls were enjoying the private life at the home of their lead singer, Sally McKnight.  Who you may know as Thorn.  It was the girls night off, and they decided to have a little slumber party at Thorn's place and she along with Dusk and Luna were at the moment, eating...  </span></div></div>",
            "created":1411707600,
            "id":1862620,
            "title":"Something else"
        },
        "134":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "kids",
                "toddlers",
                "babies"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how young do the hex girls become</span></div></span></div>",
            "created":1408338000,
            "id":1843439,
            "title":"They age in reverse"
        },
        "1343":{
            "author_id":"sixsodacola",
            "author_name":"Wuelt",
            "choices":[
                "One of them Changes",
                "Two of them Changes",
                "All 3 Change"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do they All Change</span></div></span></div>",
            "created":1443589200,
            "id":2041830,
            "title":"babies"
        },
        "14":{
            "author_id":"wildinsaneguy",
            "author_name":"Dervish",
            "choices":[
                "Cybella, Dracula's daughter",
                "Winnie, the werewolf pup",
                "Elsa Frankenteen",
                "Or maybe one of the others?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ah, the girls of Grimwood's Finishing School for Ghouls. Enough strange things go on there to warrant some form of transformation... Which of the girls will you choose?</span></div></span></div>",
            "created":1325653200,
            "id":1252652,
            "title":"The Grimwood Girls"
        },
        "141":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Transform into a human.",
                "Animal TF.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happens to Cybella?</span></div></span></div>",
            "created":1417064400,
            "id":1894395,
            "title":"A vampire no more."
        },
        "1413":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "size TF",
                "age TF",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else happen to Sibella</span></div></span></div>",
            "created":1467867600,
            "id":2177044,
            "title":"Something else."
        },
        "14131":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "bigger",
                "smaller"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So well she grow bigger or smaller?</span></div></span></div>",
            "created":1468040400,
            "id":2177460,
            "title":"size TF"
        },
        "141312":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "Winnie use a shrinking potion",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how did she get small?</span></div></span></div>",
            "created":1468040400,
            "id":2177735,
            "title":"smaller"
        },
        "14132":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "older",
                "younger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So well she grow older or younger?</span></div></span></div>",
            "created":1468040400,
            "id":2177465,
            "title":"age TF"
        },
        "141321":{
            "choices":[
                "19",
                "21"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Age how old<br>\r\n</span></div></span></div>",
            "created":1486184400,
            "id":2273223,
            "title":"older"
        },
        "142":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "Age progression",
                "growth",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What's going to happen to Winnie?</span></div></span></div>",
            "created":1462424400,
            "id":2143743,
            "title":"Winnie, the werewolf pup"
        },
        "144":{
            "author_id":"wildinsaneguy",
            "author_name":"Dervish",
            "choices":[
                "Phantasma, the fun-loving phantom",
                "Tanis, the miniature mummy",
                "Or maybe even Miss Grimwood herself!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Those three weren't to your liking? Maybe one of these others will prove slightly better?</span></div></span></div>",
            "created":1325653200,
            "id":1252657,
            "title":"Or maybe one of the others?"
        },
        "1442":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "age progression",
                "size change",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What's going to happen to this cute little mummy girl?</span></div></span></div>",
            "created":1483506000,
            "id":2259218,
            "title":"Tanis, the miniature mummy"
        },
        "14422":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "bigger",
                "smaller"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is she bigger or smaller?</span></div></span></div>",
            "created":1483592400,
            "id":2259623,
            "title":"size change"
        },
        "144221":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "9 feet",
                "bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How big did she get?</span></div></span></div>",
            "created":1483938000,
            "id":2261068,
            "title":"bigger"
        },
        "1442211":{
            "author_id":"redwolf12",
            "author_name":"wolfbood",
            "choices":[
                "potions",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How did that happen?</span></div></span></div>",
            "created":1484024400,
            "id":2261877,
            "title":"9 feet"
        },
        "14423":{
            "author_id":"mindlessdog",
            "author_name":"Draxus",
            "choices":[
                "Tf",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else?</span></div></span></div>",
            "created":1595529120,
            "id":2873670,
            "title":"something else"
        },
        "15":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Ruby-doo.",
                "Scooby-dee.",
                "Nova.",
                "Amber.",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are some more girls to choose from. Mind you, they may be animals, but they're still girls.</span></div></span></div>",
            "created":1404018000,
            "id":1819636,
            "title":"More mystery girls."
        },
        "151":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Age TF.",
                "Full anthro TF.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, what happens to Scooby's sister/Scrappy's mother?</span></div></span></div>",
            "created":1405227600,
            "id":1827129,
            "title":"Scooby's sister altered."
        },
        "1513":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Species TF.",
                "Growth.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happened to Scrappy's mom?</span></div></span></div>",
            "created":1411102800,
            "id":1858800,
            "title":"Other alterations."
        },
        "152":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Species TF.",
                "Age TF.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, what happens to the movie star dog?</span></div></span></div>",
            "created":1408338000,
            "id":1843433,
            "title":"Recasting the star."
        },
        "1522":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Teenage dog.",
                "Puppy.",
                "Younger."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How young would Scooby Dee get?</span></div></span></div>",
            "created":1431234000,
            "id":1976043,
            "title":"They always go for younger dogs."
        },
        "153":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Anthro transformation.",
                "Species TF.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well... reality was re-written at the end of \"Scooby-Doo: Mystery Incorporated\", so this would kinda make sense...<br>\r\n<br>\r\nSo, what happened to Scooby's latest love interest?</span></div></span></div>",
            "created":1405918800,
            "id":1831612,
            "title":"The new girl remade."
        },
        "1531":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Partial anthro.",
                "Full anthro.",
                "Why not human?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is Nova going to become part-anthro, like Scooby is, or a full-on anthro?</span></div></span></div>",
            "created":1436245200,
            "id":2004515,
            "title":"One thing to make clear..."
        },
        "15311":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "In Scooby's doghouse.",
                "Somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>Pain- that was what Nova felt first; colossal, unyielding pain. What had happened to her? The last memory that she clutched to was holding on to Scooby as she dangled from a helicopter that threatened to crash at any second, then falling when her grip have way... Everything afterwards was a blur.<br>\r\n<br>\r\n\"You have died, Nova\" said a voice from... somewhere. \"Your body was trampled to death by those disturbing mutant cows unleashed by the original Mystery, Inc.\"<br>\r\n<br>\r\n\"That definitely explains the pain\" thought Nova. A few thousand cow hooves (normal or mutant) hardly did the body any good. Straining to open her eyes, she finally realized she was... nowhere. All that stretched before her was an endless expanse of whiteness. \"Where am I?\" she wondered aloud before placing a paw to her throat; it had been so long since she had spoken coherent English. \"I can talk again!\"<br>\r\n<br>\r\n\"Yes\" said the voice Nova heard earlier. \"However, there is more news that you should be informed of- the warped reality that Crystal Cove once possessed is being rewritten; a certain canine friend of yours and his meddling teenage allies are to thank\".<br>\r\n<br>\r\n\"Scooby...\" said Nova, a hopeful look crossing her face. However, her face was quick to turn confused. \"Wait- if reality is being remade, then why am I here? This better not be the new reality... Whatever you are!\"<br>\r\n<br>\r\n\"Thankfully, this is not the new reality\" said the voice. \"As to who- or, rather, what -I am, let's just say that, for all intents and purposes, I am the guardian of the space between realities\".<br>\r\n<br>\r\n\"Okay- so, why am I here?\" asked Nova.<br>\r\n<br>\r\n\"I was getting to that\" said the voice. \"Before you may cross into this new reality, you must be reborn\". Perhaps noting the distress on Nova's face, the voice added \"Do not worry; the procedure is neither painful, nor long. Also, you will still retain your current age, though any and all memories of your past life and this place will be destroyed\".<br>\r\n<br>\r\n\"Well, that's good to know... I guess. So, when does the procedure start?\" asked Nova.<br>\r\n<br>\r\n\"Right now\".<br>\r\n<br>\r\nBefore Nova could even respond, a small yellow sphere enveloped her. She was temporarily blinded, while an invisible force pulled her. After a few seconds, she found that not all of her was still the same- her front paws were less like actual paws and were more like hands, just like Scooby's. She also found herself...</span></div></div>",
            "created":1439269200,
            "id":2019766,
            "title":"Back to square 1- more or less."
        },
        "1532":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Cat.",
                "Bird.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which species did Nova become?</span></div></span></div>",
            "created":1422680400,
            "id":1925991,
            "title":"Sorry, Nova."
        },
        "154":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Species change.",
                "Age change.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ah, Scooby's love from beyond the stars. So, what happens to her?</span></div></span></div>",
            "created":1407474000,
            "id":1839189,
            "title":"Extraterrestrial reformed."
        },
        "1542":{
            "author_id":"maccar110",
            "author_name":"Fanfic T-Mac",
            "choices":[
                "Older.",
                "Younger.",
                "Both?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Did Amber get older or younger?</span></div></span></div>",
            "created":1426741200,
            "id":1950239,
            "title":"There's something different about her..."
        },
        "155":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Yes",
                "nope, more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Simone Lenoir and/or Lena Dupree from Scooby Doo on Zombie Island?</span></div></span></div>",
            "created":1510801380,
            "id":2415895,
            "title":"Someone else."
        }
    },
    "info":{
        "author_id":"dustindemon",
        "author_name":"Dustin",
        "brief_description":"Transform the girls of Scooby Doo!",
        "created":1325720700,
        "description":"<td align=\"left\" class=\"norm\">The girls from the various Scooby Doo cartoons undergo some STRAAAANGE transformations! Setting and used characters can be whatever you want. They can turn into animals, inanimate objects, alien creatures, they can be inflated, basically anything can happen. Want a girl to eat another girl? GO FOR IT! Want a girl to become a brand new planet? YOU GOT IT BOY. A few rules, though:<br>\r\n<br>\r\n- No male TF.<br>\r\n- No gender bending into males.<br>\r\n- No werewolf TF. No offense to people that like it, I just find it boring and overdone.<br>\r\n- No crossovers with other shows<br>\r\n- Please try to write at least a paragraph. I hate when stories have, like, three words in a chapter.</td>",
        "id":1838122,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1595529120,
        "modified":1595529120,
        "pretty_title":"Scooby Doo Girls TF Interactive"
    }
}