{
    "chapters":{
        "1":{
            "author_id":"jfoxx",
            "author_name":"Johnny Foxx",
            "choices":[
                "A werewolf couple with dozens of offspring already",
                "A hippie centaur couple",
                "A dragon couple who are a bit too protective ",
                "A Giant and his wife, who keep you as slaves",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>You stare out the window from the backseat of your social worker's car. From what you had been told, this town was going to be your new home, even though you had never heard of it. Your sister, Shelly,who was five years younger than you, is in the adjacent seat playing her Switch. For as long as you could remember, the two of you stuck together like glue, especially when your former parents would leave the two of you alone for days at a time, having gone nobody knows where. <br>\r\n<br>\r\n<br>\r\n\"We're here.\" Your social worker says as she parks in front of a rather large and lavish house. As you and your sister exit the vehicle, the social worker pops open the trunk to get your bags. But before she can accompany the two of you to the door, her phone rings. After she answers, she is silent for about half a minute before hanging up. \"I'm sorry kids, but something just came up, urgent matter. You two just go ring the doorbell and meet your new folks, and I'll see you in about two weeks when I come back to check on you. Have fun with your new family!\" <br>\r\n<br>\r\nAs she drives off, you and your sister approach the front door and ring the bell. So just who will be your new family?</span></div></div>",
            "created":1594766100,
            "id":2868658,
            "title":"A New Family"
        }
    },
    "info":{
        "author_id":"jfoxx",
        "author_name":"Johnny Foxx",
        "brief_description":"You and your little sister are in a foster home with new parents. Monsters, to be exact.",
        "created":1594765140,
        "description":"<td align=\"left\" class=\"norm\">You and your younger sis haven't exactly had an easy life. Your birth parents were less than capable of caring for you properly, and so the both of you were taken by child protection services and put in a new home together. what you don't know is your new guardians aren't human. They are in fact monsters, and where the story goes from there depends on who they are. Will they be kind, caring parents? Or worse than your original family? <br>\r\n<br>\r\nRules<br>\r\n<br>\r\n1. No killing the main characters<br>\r\n2. Your foster family may or may not have children already, depending on who you choose.<br>\r\n3. Please not gross content such as farting or toilet stuff.</td>",
        "id":2226858,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1594766100,
        "modified":1594766100,
        "pretty_title":"The Fearsome Fosters"
    }
}