{
    "chapters":{
        "1":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "Father Lenny or Mother Vera",
                "Oldest brother Sam / Middle brother Bob",
                "Only sister Sara",
                "Johnny the youngest in the family.",
                "Extended family and friends "
            ],
            "content":"<div class=\"\"><div> <span>The whole Taylor family has a week vacation at home together, some of the kids have set up a large tent in the backyard and rarely leaves it.<br>\r\n<br>\r\nThe Taylors are just your family next door, no different than any other family except they all have fetishes of some kind. and will involve anyone else to have it.<br>\r\n<br>\r\nSome fetishes in the family are …   Sissy boys,  Shrinking ( 1 person down to 3 ft. tall ),  talking to ghosts, seduction, persuasion , Hyptnosis. and of course feet, lesbian and gay .<br>\r\n<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- ---------------------<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nIts a normal day at home for the Taylor's , the kids are either off playing in their rooms, talking on the phone and watching tv. Lenny is tinkering around in the garage and Vera is cooking dinner or washing dirty laundry.<br>\r\n<br>\r\nWho will we follow first ?</span></div></div>",
            "created":1590469200,
            "id":2841331,
            "title":"The Taylors at Home"
        },
        "11":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "Eggs, toast and feet ",
                "Chocolate covered toes.",
                "Mom's Special ",
                "More ideas",
                "Johnny skipped school and was watching them !"
            ],
            "content":"<div class=\"\"><div> <span>Mother Vera  is a devoted mother and had passed on her love for feet and toes to all of her children but Johnny had gotten more of her fetish than the others, it was a Monday morning when her husband left for work and she had gotten all the kids off to school except Sara who said that she was sick today, Now Sara was a very happy girl and loved spending her time with her favorite person, her mother Vera.<br>\r\n<br>\r\nVera also loved her alone time with Sara, you see Vera loved small soft feet and toes and Sara loved making her mother happy as well as the feeling that her mother gave her small soft feet, so it was no surprise that Sara was \" Sick \" today, at least one day a month Sara would be \" Sick\" when the rest of the family went to school and work.<br>\r\n<br>\r\nThis morning Vera made a special breakfast for her daughter Sara and surprised her …. her breakfast was …..</span></div></div>",
            "created":1592110800,
            "id":2851055,
            "title":"Father Lenny or Mother Vera"
        },
        "111":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "Sara suprised Vera in the shower",
                "Sara waited for Vera to return",
                "Vera talked to herself in the shower while Sara listened",
                "More Ideas"
            ],
            "content":"<div class=\"\"><div> <span>Vera knew why Sara was 'sick' today, it was their special only girls morning and Vera made it special for her daughter.<br>\r\n<br>\r\nVera cooked her daughter scrambled eggs with cheese and toast with apple butter  and a glass of orange juice, after having all the breakfast together, Vera walked upstairs to Sara's room and gently opened the door, there she saw her daughter asleep, Vera placed the breakfast tray on her dresser and walked over to Sara and gently pulled down the bedsheet, looking at Sara, Vera  bent down and pulled up Sara's long nightgown and stared at her pretty pink painted small toes, Vera couldnt help it and placed all of her toes in her mouth at once, sucking and licking her daughters tasty toes.<br>\r\nSara gently stirred awake and smiled as she saw her mother sucking her toes and said \" Good morning Mommy ... I love waking up this way \" as she smiled at Vera, after a few more minutes of sucking her daughters toes, Vera stood up and walked over to the dresser and grabbed the breakfast tray and placed it on Sara's lap as she sat up, \" Eat up your breakfast baby and Mommy will have some clean and tasty toes for you for your desert\"  Sara just giggled and said \" Ok mommy \" .<br>\r\n<br>\r\nAs Sara ate her breakfast, Vera told Sara  \" Mommy is going to go take a shower and after that we can spend the day together, okay baby ?\"  Sara just smiled and said \" That sounds great Mommy \" and she watched Vera walk off to the bathroom.</span></div></div>",
            "created":1592629200,
            "id":2854053,
            "title":"Eggs, toast and feet "
        },
        "12":{
            "author_id":"dmarkac",
            "author_name":"Rufus",
            "choices":[
                "Johnny decides to join the fray",
                "When the game is over Bob would like to go out and play",
                "Lenny calls Sam over for help",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Sam and Bob are an interesting duo. Sam, the oldest of the siblings, is the tech savvy fixer of the household's electronics. A good big brother and son and that slightly nerdy popular student, currently trying to get into one of the prestigious tech colleges in the country. He's big and in shape, although with a little bit of chub to his cheeks and belly.<br>\r\nBob is nearly the polar opposite: An energetic athlete, a rising football star playing for the school team as its newest addition.He might be teasing little Johnny a bit more than the others, but it is nothing malicious. Already collecting medals and trophies he's got a bright future laid out in front of him in the world of sports and although he is only the junior in high school, he is pretty tall for his age and in great shape. Funny thing is that even a couple of inches shorter than Sam, Bob has the same foot size. In fact, they are used to borrowing each other's shoes when needed which tells volumes on how they are getting along despite any differences.<br>\r\n<br>\r\nRight now they are both sitting on the couch in the living room, watching the game on the TV with their legs stretched out and crossed at the ankles.</span></div></div>",
            "created":1592110800,
            "id":2851145,
            "title":"Oldest brother Sam / Middle brother Bob"
        },
        "124":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "Johnny gets ready for Bob",
                "Bob cant wait and goes out following Johnny",
                "More Options",
                "More Ideas"
            ],
            "content":"<div class=\"\"><div> <span>As both brothers sat watching the game and relaxing with their feet stretched out , Johnny came into the room on the way to the kitchen for a drink, Passing his brothers, Johnny stops and stares at his brothers feet and licks his lips, his brother Bob notices this and tells Johnny to come sit with them.<br>\r\n<br>\r\n\" I cant right now guys, I am redecorating my tent outside, I plan on staying out there all weekend, EVEN OVERNIGHT \".<br>\r\n <br>\r\n As Bob watches Johnny walk by and see's that he only has his short shorts on, and his slender legs and soft small feet looks really good, \" Hey Johnny, after the game is over I will come out to your tent and we can hang out and find something to do \" .<br>\r\n<br>\r\nJohnny got excited \" That's great Bob, we can do Anything that you want \"  as Johnny skips out of the room and back to his tent .</span></div></div>",
            "created":1592110800,
            "id":2851156,
            "title":"Johnny's Tent "
        },
        "1242":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "Johnny tells Bob what he wants to do",
                "Bob makes the first move",
                "Johnny makes the first move",
                "Sister Sara watches from behind a tree",
                "More Choices"
            ],
            "content":"<div class=\"\"><div> <span>Bob stood up saying that he had to use the bathroom and probably take a nap, but once Bob got out of sight from the others, he made a straight line outside towards Johnny's tent. As Bob got close he could hear his brother Johnny talking to himself … \" Oh I am so happy that you are hear Bob, come in and sit down, is there anything I can do for you Bob ?  ANYTHING that I can do TO YOU Bob ? \"<br>\r\n<br>\r\nBob stood outside of the tent and listened to Johnny and thought about the way his brother was dressed and Bob got excited, As Bob comes inside of Johnny's tent, he sees Johnny on the floor on his hands and knees cleaning up, Bob walks straight over to Johnny, Johnny looks up surprised that Bob was standing there when Bob smiles and says \" I couldn't wait to come out here with you Johnny .. What do You want to do Johnny ?\"  as Johnny still on his hands and knees looks up at Bob and is now eye level with Bobs really tented out shorts ….<br>\r\n<br>\r\nJohnny's eyes got big as Bob says \" This is your tent Johnny so I will let you do whatever you would like Johnny \" as Bob stands there and sways back and forth ,</span></div></div>",
            "created":1592542800,
            "id":2853558,
            "title":"Bob cant wait and goes out following Johnny"
        },
        "13":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "none just the femdom foot stuff",
                "she wants to shrink you",
                "she wants to feminize you turning you in to a sissy  ",
                "she wants to gender-swap you",
                "more fetishes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>other than the foot stuff what is your little sisters fetish? </span></div></span></div>",
            "created":1592370000,
            "id":2852478,
            "title":"Only sister Sara"
        },
        "131":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "she makes you kiss her feet",
                "she gagged you with her sweaty socks",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>you got home and ran up to your room.<br>\r\nyou swung the the door open,and found your little sister laying in your bed.<br>\r\n\"hey big bro\" she said lazily stretching her feet out, she then began to brush her foot over your crotch.<br>\r\nmost of the family have a foot fetish, and you where no exception, so when she did you got incredibly hard.<br>\r\n<br>\r\nshe snapped a photo with her phone<br>\r\n\"why big brother whats this it looks like a photo of you getting an erection from your little sisters feet, could you imagine what would happen if it got sent to your high school.\"<br>\r\nyou fell to your knees, and began to beg.<br>\r\n\"please Sara you cant show that to any one from the high school my social life would be completely destroyed! ill do anything please!\"<br>\r\n<br>\r\nshe smirked<br>\r\n\"anything you say, well iv always wanted my own slave.\"<br>\r\nyou look down in shame.<br>\r\n\"OK Sara ill be your slave.\"<br>\r\nshe smirked in victory playfully gave your face a few light slaps.<br>\r\n\"from now on its mistress Sara.\"<br>\r\nyou looked you into your little sisters face.<br>\r\n\"yes mistress Sara.\" <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1592542800,
            "id":2853800,
            "title":"none just the femdom foot stuff"
        },
        "1311":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "as she rubs you jizz your pants",
                "she goes from rubbing to stomping ",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>she placed her feet on your face, and said<br>\r\n\"ill right slave bro, kiss my feet!\"<br>\r\nin a voice that was muffled by feet you said<br>\r\n\"yes Mistress Sara.\"<br>\r\n<br>\r\nyou place your lips to the shoals of her feet, and began  to kiss her them.<br>\r\nher feet where salty with sweat, and there sent was intoxicating.<br>\r\nafter kissing them, you open your mouth, and she shoves her toes into your mouth.<br>\r\nwith her free foot she began to rub your erection threw your pants, making moan with pleasure.<br>\r\nshe gigged<br>\r\n\"wow being a slave is perfect for a total perv like you.\"<br>\r\n<br>\r\ndeep down you know your little sis is absolutely right about you<br>\r\n</span></div></div>",
            "created":1592542800,
            "id":2853821,
            "title":"she makes you kiss her feet"
        },
        "13111":{
            "author_id":"funguy69",
            "author_name":"J.s",
            "choices":[
                "You lick your jizz off her foot",
                "You suck your jizz off her foot"
            ],
            "content":"<div class=\"\"><div> <span>As she's rubbing your crotch through your pants, you shudder in ecstasy and shame.<br>\r\nSara felt some thing warm and sticky ozzeing out of your pants on to her petite young foot, when she realized what had happened she began to laugh at you.<br>\r\n\"Hahah, can't believe you came so fast!\"<br>\r\nYou blushed from the shame, and embarrassment that your little sister was inflicting upon you.<br>\r\n<br>\r\nShe used her etremly flexible toes to unzip your pants, she then rubbed her foot all over you jizz coated cock.<br>\r\nWhen her small foot had a nice coating of sticky jizz all over it she placed it in front of your face.<br>\r\n\"Your so pathetic slave, looks like you made a mess.\"<br>\r\nYou sadly nod exquisite shame.<br>\r\n\"Well slave, it only fitting that you clean it up.\"<br>\r\nYou look at her young yet incredibly dominant face.<br>\r\n\"Yes misstris sara.\"<br>\r\nHearing just ho much control she had over her older brother made her gring from ear to ear.</span></div></div>",
            "created":1592629200,
            "id":2854065,
            "title":"as she rubs you jizz your pants"
        },
        "131111":{
            "author_id":"funguy69",
            "author_name":"J.s",
            "choices":[
                "You do as your toled",
                "You disobey hoping the she publicly  humiliates you"
            ],
            "content":"<div class=\"\"><div> <span>You looked at the jizz coated foot infront of your face, sara's natual foot oder was now tenged with a beach like smell.<br>\r\nYou slowly began to lick your salty cum off of your younger sister's petite foot.<br>\r\n the jizz was hot, sicky, and salty in your obedient mouth, It's flavor mixed with her foots natural flavor, and over welmed your taste buds.<br>\r\n<br>\r\nThe shame and humiliation that have been experiencing at the hand or rather feet of your little sister had awakened something deep with in you, and you craved more.<br>\r\n<br>\r\nWhen you had used your tounge to clean off every last drop off your cum, and sara's foot was once again sparkling clean, she stood up and exposed her bare butt to you.<br>\r\n\"Now I want you to kiss my butt slave!\"</span></div></div>",
            "created":1592629200,
            "id":2854221,
            "title":"You lick your jizz off her foot"
        },
        "1313":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "called over a few friends",
                "sat on his face",
                "more choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>1<br>\r\nshe called over a few of her friends<br>\r\n<a rel=\"nofollow\" href=\"https://www.writing.com/main/interactive-story/item_id/2222802-Foot-Fetish--at-home/map/15\" target=\"_blank\">https://www.writing.com/main/interactive...</a><br>\r\n<br>\r\n2<br>\r\nshe sat on his face</span></div></span></div>",
            "created":1592542800,
            "id":2853807,
            "title":"readers choice"
        },
        "13131":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "they use you one at a time",
                "they use you at the same time",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"https://www.writing.com/main/interactive-story/item_id/2222802-Foot-Fetish--at-home/map/153\" target=\"_blank\">https://www.writing.com/main/interactive...</a><br>\r\n<br>\r\nSara got on her phone, and called Kathy<br>\r\n\"hey Kathy guess who just enslaved her older brother with her feet?\"<br>\r\nKathy giggled <br>\r\n \"Francine, drew, and sally will get a real kick out of this.\"<br>\r\n<br>\r\nyou mouth fell open in shock<br>\r\n\"Sara you promised you wont tell any one!<br>\r\nshe waged her finger.<br>\r\n\"first, its mistress, and no i didn't, i promised not to show the pic to any one from the high school.\"<br>\r\nshe smirked as he went pail, \"and as you well my friends don't go to the high school, do they.\"<br>\r\n<br>\r\njust then her 4 friends arrived, and drew the trap cut in.<br>\r\n\"not to mention she never even promised not tell any one, you really need check the fine print slave boy.\"<br>\r\n<br>\r\ndrew was a super convinseing trap/crossdresser.<br>\r\nsally was a shy shemale/futa<br>\r\nKathy was a super nerdy fat girl<br>\r\nFrancine was a large athletic girl<br>\r\n</span></div></div>",
            "created":1592542800,
            "id":2853816,
            "title":"called over a few friends"
        },
        "131311":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "drew was a super convinseing trap/crossdresser.",
                "sally was a shy shemale/futa",
                "one of the others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who is going first?</span></div></span></div>",
            "created":1592629200,
            "id":2854135,
            "title":"they use you one at a time"
        },
        "1313111":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "begin to cry from the humiliation ",
                "beg for more you don't care that he's actuality a guy",
                "Sara was live streaming what just happened to the rest of her jr high"
            ],
            "content":"<div class=\"\"><div> <span>the girls pushed you into a chair, and tied you to it.<br>\r\nyour sister began to record what was about to happen to you.<br>\r\ndrew then began to give you a lap dance.<br>\r\nyou've seen drew hanging out with your sister, and had always thought that she was super hot for her age.<br>\r\nit wasn't like she  her boobs early or any thing like that in fact she was pretty much flat chested; no the reason drew was hot was that she had these super slender legs, amazing hips/ass, and a gorgeous face framed by long silky hair, but  unknown to you drew was actually a guy.<br>\r\n<br>\r\nhe straddled your lap rubbing his tight trap ass on your lap, and he began to nibble while at your lip kissing you<br>\r\nthis felt incredible, soon you where rock hard.<br>\r\nhe smirked and stood up<br>\r\n\"oh by the way i'm a guy.\"<br>\r\nhe then striped naked to show you that he was in fact male, your mouth fell open in shock, and you blushed deeply.<br>\r\nhow can some one so hot, some one felt so amazing actually be boy!?<br>\r\n<br>\r\nhe sensually blew on your ear as leaned in close to you.<br>\r\n\"so how dose i feel knowing you just got hard for a jr high boy? if you beg me ill keep going.\" as he said this he began to nibble on your ear, and slid one of his slender hands into your pants stoking your erection with the tips of his fingers.<br>\r\n</span></div></div>",
            "created":1592629200,
            "id":2854240,
            "title":"drew was a super convinseing trap/crossdresser."
        },
        "1313112":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "she rewards you with a foot job",
                "she bend you over the bed and takes your anal virginity",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Sara whispered in to sally's ear<br>\r\n\"because hes being blackmailed your secrets safe with him'\" <br>\r\nthis made the young futa/she-male blush, she then grabbed her hand and pulled you into your sisters room for more privacy.<br>\r\n<br>\r\nsally was an adorable jr high school cheer leader, who was incredibly shy.<br>\r\nshe pulled down her pink panties, and forced your head under her skirt.<br>\r\nyou came face to face with her large cock.<br>\r\nyou where shocked that such an adorable young girl had such a monstrous cock, seriously it was like twice your size.<br>\r\nseeing that your little sister's friend was so much bigger than you made you feel incredibility in comparison.<br>\r\n\"so um you better start sucking slave, it um wont um suck itself.\"<br>\r\n<br>\r\nyou opened your mouth, and began to give her a blow job.<br>\r\nher love rod felt rock hard, and warm in your mouth.<br>\r\n as you sucked on sally's cock you could feel it twitch and pulse, soon she began to moan in pure pleasure.<br>\r\nas she got closer to climaxing you could feel her hand pushing on the back of your head through skirt, then she began to shudder as she moaned,<br>\r\nsally came hard down your throat,you guzzled down every last drop of her hot salty cock seed.<br>\r\n<br>\r\nfeeling completely drained of energy she fell down onto Sara's bed, and blushed.<br>\r\n\"huff, huff, that was my first time being with a boy.\"<br>\r\ndespite in the matter, you cant make your self resent someone so adorably flustered.<br>\r\nyou kiss the tip of he penis,<br>\r\n\"then i'm a lucky guy.\"<br>\r\nshe hugged you<br>\r\n\"aww your so sweet.\"<br>\r\nyou deside to flirt some more with her.<br>\r\n\"its easy to be sweet when talking to the most adorable girl in the world.\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1592629200,
            "id":2854153,
            "title":"sally was a shy shemale/futa"
        },
        "13131121":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "Sally waits to hear from you again",
                "You tell your dad and brothers Sally's message",
                "You decided to help your dad and brothers in the same way ",
                "More choices",
                "More Ideas"
            ],
            "content":"<div class=\"\"><div> <span>Sally was so happy with you and how wonderful you had made her feel. that she wanted to do something for you as well to make you feel just as good.<br>\r\n<br>\r\nSally had come from a home where they didnt shun sex in any way and footjobs were just a part of daily life, So Sally knew how to give excellent footjobs.<br>\r\n<br>\r\nSally brings down her small soft feet and rubbed them all across your super hard penis and it felt amazing to you, as she picked up speed, her small feet were like a blur as they went up and down so fast it made your head spin, then she stopped and flew her smal feet in your face saying \" WET THEM ... I need more lube so lick them all over\"  and without even thinking about it, you were licking and slobbering all over Sally's soles, you then hear her say \" Do you like the taste of your penis scent on my feet ? \"  and you just shook your head yes as you finished lubing up her feet.<br>\r\n<br>\r\nSally smiled as she dropped her feet back down on you and made you feel like you never had before, soon her small feet made you cum so hard that you actually passed out for a few minutes.<br>\r\n<br>\r\nAfter everything was over, Sally had you clean up her cum covered feet with your cum loving tongue, It suprised you and excited you when she finally said \" Be sure to tell your daddy and your brothers how I made you feel with my footjob and tell them that I could help them as well as long as they make ME feel good to, the way You made me feel \" as Sally dropped down and gave me a long french kiss  before leaving the room.</span></div></div>",
            "created":1592715600,
            "id":2854444,
            "title":"she rewards you with a foot job"
        },
        "133":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "Sara Hypnotizes Johnny ",
                "Sara invites her sissy friend over from school",
                "Sara forces Johnny ",
                "More Ideas"
            ],
            "content":"<div class=\"\"><div> <span>Your sister Sara always wanted another sister and Johnny was the perfect person to make that happen, Sara already knew that Johnny loved sucking on things like your mother does and Johnny was already more or less a pretty boy, Johnny wanted to be a sissy boy and his big sister, his only sister Sara was going to make that happen for Johnny, she was going to make that happen for all of the family, mostly her other brothers .<br>\r\n<br>\r\nSara liked the control that she has over Johnny and wanted to exploit his sissy side for the rest of the family !</span></div></div>",
            "created":1592370000,
            "id":2852519,
            "title":"she wants to feminize you turning you in to a s..."
        },
        "1331":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "your sister dressed you as a french maid",
                "your sister dressed you as a cheer leader",
                "more sissy outfits"
            ],
            "content":"<div class=\"\"><div> <span>Sara arrived home to find the hypnotism kit that she had ordered online.<br>\r\nshe grabbed it, and ran up to her room.<br>\r\nshe lamed her door shut, and ripped into it.<br>\r\nthe kit contained a pocket watch, and a book on hypnotism.<br>\r\nshe read the book, and waited for you to get home.<br>\r\n<br>\r\nyou had to stay late after school so it was around 7 when you got home, when you got there you found your little sister Sara waiting for you.<br>\r\n\"hey johnny, want to help me practice my hypnotism?\"<br>\r\njohnny sat down on the sofa, and scratched the back of his head.<br>\r\n\"i don't know Sara, i heard that hypnotism can have strange side effects?\"<br>\r\n<br>\r\nSara sat on the sofa, and stretched her legs out placing them in your lap, rubbing them on your crotch.<br>\r\n\"please johnny, id <b>really </b> appropriate it.\"<br>\r\nyour breath hitched<br>\r\n\"OK.\"<br>\r\n<br>\r\nshe clapped her hands in excitement<br>\r\n\"yay!\"<br>\r\n<br>\r\nshe began to swing the pocket watch in front of your face<br>\r\n\"you are getting sleepy, every sleepy.\"<br>\r\nyou closed your eyes, and she smiled.<br>\r\n\"when i snap my fingers you will have an irresistible urge to be a sissy,you will want to be called jenny, and  you will obey my every command!\"  <br>\r\nshe then snapped her fingers, waking you up <br>\r\n<br>\r\nshe smirked<br>\r\n\"so johnny, how do you feel?\"<br>\r\nyou began to fidget with your clothes <br>\r\n\"i feel like these clothes are all wrong for me, and i don't like the name johnny from now on call me jenny!\"<br>\r\n<br>\r\nSara smirked <br>\r\n\"come on up to my room jenny, ill help you find the new you.\"<br>\r\nyou look at her confused<br>\r\n\"how do you plan on doing that?<br>\r\nshe smirked<br>\r\n\"by giving you a make over.\"<br>\r\n<br>\r\nyou felt incredibly giddy, and the two of you ran up to her room.<br>\r\nshe picked out a few out a few outfits, and began to dress you.<br>\r\n  <br>\r\n<br>\r\n  </span></div></div>",
            "created":1592370000,
            "id":2852544,
            "title":"Sara Hypnotizes Johnny "
        },
        "13312":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "Your brother Sam is his audiance",
                "Your brother Bob is his audiance",
                "Your father Lenny is his audiance",
                "Sara brings over the boys",
                "More choices "
            ],
            "content":"<div class=\"\"><div> <span>Sara wanted to dress you up as a cheer leader and you were very excited about it … \" I cant wait Sara, I have always wanted to be a cheer leader \" as you giggled along with Sara.<br>\r\n<br>\r\n:Okay Jenny, I have the clothes right here but you have to be a very special cheer leader ok\" Jenny clapped his hands and put on the cheer leader outfit but stopped and asked Sara \" I have all the clothes Sara but where are my panties ?\" <br>\r\n<br>\r\n\" Silly boy, I said you were going to have to be a special cheer leader, and that means that you don't wear any panties, we want all the boys to remember that YOU are the most special cheer leader that they have ever seen \"  Jenny was happy after Sara said that to him.<br>\r\n<br>\r\n\" Okay Sara … so who am I going to cheer for now ?\"<br>\r\n</span></div></div>",
            "created":1592370000,
            "id":2852556,
            "title":"your sister dressed you as a cheer leader"
        },
        "134":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "in the end she used magic",
                "in the end she used scince ",
                "readers chice"
            ],
            "content":"<div class=\"\"><div> <span>your little sister had a thing for older girls, and always thought that you would be way hotter as a girl than you where as a guy.<br>\r\nso Sara began to research ways to transform you in to a girl.<br>\r\nin the end it came down to a choice of magic or scince for how to change your gender.</span></div></div>",
            "created":1592370000,
            "id":2852570,
            "title":"she wants to gender-swap you"
        },
        "14":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "yes",
                "no lets stay here ",
                "more choices",
                "more choices"
            ],
            "content":"<div class=\"\"><div> <span>Sam was watching tv downstairs in the living room when he heard and then saw his brother Johnny skipping through the house and down the stairs … \"Hi Johnny, why are you skipping around and so happy ?\"  Johnny just stops and looks at his big brother Sam and said \" I am happy because I am going out to my big tent and I am skipping around because I like it... and don't I look good skipping around big brother ?\"  as Johnny struck a pose and laughed, Sam was just watching Johnny and how he had his soft bubble butt stuck out and his flat hairless chest pushed out the other way .<br>\r\n<br>\r\n\"Want to go with me  big brother ?</span></div></div>",
            "created":1591160400,
            "id":2845423,
            "title":"Johnny the youngest in the family."
        },
        "141":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "I lick his big toe and more",
                "Sam has other ideas",
                "More choices",
                "More choices",
                "Someone else comes out to the tent ."
            ],
            "content":"<div class=\"\"><div> <span> Sam looks at Johnny and said \" Sure little brother, I will go out there with you, I seem to have all the time in the world now that Chris broke up with me \" as Sam got teary eyed.<br>\r\n<br>\r\nJohnny didn't know that his big brother just got dumped by his girlfriend, they always go back and forth but I never have seen Sam like this before, as Sam was getting up from the couch he said more to himself than to me …\" She said I want her to suck me off too much … Huh... \" as Sam passed me and walked outside.<br>\r\n<br>\r\nI quickly followed Sam and was walking behind him and wondering ' if Chris broke up with Sam because she didn't want to suck him off anymore than maybe I could help my big brother Sam out in some way ...'<br>\r\n<br>\r\nAs they get inside of the large tent Sam quickly sits down on an some old cushions that I decorated the tent with, we were both hot from the hot summer day and both only wore loose fitting shorts, as I scanned Sam his foot was sticking out from the rest of his body and I got that urge to have something in my mouth again and looked at his big toe....</span></div></div>",
            "created":1591506000,
            "id":2847507,
            "title":"yea sure"
        },
        "1411":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "Johnny continues",
                "Someone was watching both of you",
                "Someone comes in the tent .",
                "More choices",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Everyone in the family knows about my oral fixation, mom and I share the same thing, we always want something in our mouths and when I saw Sam's foot sticking out by itself, I layed down with my head beside Sam's foot and started stroking his big toe as he talks about Chris.<br>\r\n<br>\r\nSoon I give his big toe a kiss and then I lick his big toe, I look up at Sam and he is smiling at me, so I bring my mouth down and start sucking his big toe and then all the smaller ones ... I was taken back when Sam said \" Johnny that feels really good, keep going Johnny, and who knows I might have something else for you later \" as Sam leans back and relaxes while watching you please his toes.</span></div></div>",
            "created":1591678800,
            "id":2848529,
            "title":"I lick his big toe and more"
        },
        "14114":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "Johnny happily poses again and more",
                "Sam likes watching Johnny pose a lot",
                "Johnny doesnt stop sucking his big toe",
                "Johnny wants to go change for his poses ",
                "More Ideas"
            ],
            "content":"<div class=\"\"><div> <span>While Sam is laying there watching Johnny suck on his toes, his mind goes back to his ex-girlfriend and how she used to suck him dry, Sam tries to get these thoughts out of his head but watching Johnny suck his toes makes Sam get hard.<br>\r\n<br>\r\nNot wanting to call attention to his growing member, Sam says \" Hey Johnny, I really liked it in the house when you posed for me, could you do some more poses for me and anything else that you want to do \"?</span></div></div>",
            "created":1592110800,
            "id":2851090,
            "title":"Sam's thoughts"
        },
        "141144":{
            "author_id":"bethany7",
            "author_name":"Bethy",
            "choices":[
                "One of Sara's teddy's",
                "One of Sara's Summer dresses",
                "One of Sara's Panties",
                "Sam had been pleasuring himself when Johnny returns",
                "More Ideas"
            ],
            "content":"<div class=\"\"><div> <span>Johnny was excited that Sam wanted to see him pose again for him but Johnny really wanted to pose in some of his sister Sara's clothes, so Johnny jumps up and down while saying \" Oh Sam, I would love to pose for you some more big brother. I will be right back, DONT go anywhere Brother \"  as Sam chuckles and watches Johnny run out of his tent as fast as he could and returned about fifteen minutes later wearing  ___________  as an outfit to pose for me in.</span></div></div>",
            "created":1592715600,
            "id":2854430,
            "title":"Johnny wants to go change for his poses "
        },
        "15":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "extended family",
                "johnny's friends",
                "Sara's friends",
                "Lenny and Vera's friends ",
                "more friends and family"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who is it?</span></div></span></div>",
            "created":1592542800,
            "id":2853727,
            "title":"Extended family and friends "
        },
        "151":{
            "author_id":"funguy69",
            "author_name":"J.s",
            "choices":[
                "Female and she-male cousins ",
                "Male and femboy/trap cousins ",
                "Other extended family "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What extended family </span></div></span></div>",
            "created":1592629200,
            "id":2854223,
            "title":"extended family"
        },
        "153":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "kathy",
                "Francine",
                "more of Sara's friends"
            ],
            "content":"<div class=\"\"><div> <span><b>Kathy </b><br>\r\nKathy is Sara's best friend, she is a fat nerdy girl who likes the idea of being in a polygamous relationship, and lives next door.<br>\r\nshe is the same age as Sara, she is is a bisexual girl who has a thing for both Sara, and her brother johnny.<br>\r\nKathy is ginger who has glasses, and braces.<br>\r\nshe loves the classic nerdy school girl look, she wears a sweater vest, pleated skirt, white stockings, a black pair of penny loafers.<br>\r\nshe also she is an older sister who is the same age as johnny named Natasha, a fat goth girl.<br>\r\n<br>\r\n<b>Francine</b><br>\r\nshe is a large, yet athletic girl<br>\r\nher large size is due to her workout routine rather than fat<br>\r\nshe is the caption of the jr high girls wrestling team  </span></div></div>",
            "created":1592542800,
            "id":2853730,
            "title":"Sara's friends"
        },
        "1533":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "drew",
                "sally",
                "more of Sara's friends"
            ],
            "content":"<div class=\"\"><div> <span><b>drew</b><br>\r\ndrew is a friend of Sara who is in the same class as her, he is a very eliminate cross-dressing trap.<br>\r\ndrew loves to trick straight guys then turn them gay/bi.<br>\r\n<br>\r\n<b>sally</b><br>\r\na good friend of Sara's who is a bisexual futa/she-male.<br>\r\nsally is a member of the jr high cheer leaders who is a bit shy because she is scared to open up to people because she is scared of what they will think her if they find out about her being a futa/she-male Sara is the only friend she she has told so far<br>\r\n</span></div></div>",
            "created":1592542800,
            "id":2853736,
            "title":"more of Sara's friends"
        },
        "155":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "bob's friends",
                "Sam's friends",
                "more friends and extended family"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who is it?</span></div></span></div>",
            "created":1592542800,
            "id":2853791,
            "title":"more friends and family"
        },
        "1553":{
            "author_id":"funguy69",
            "author_name":"J.s",
            "choices":[
                "Your friends?",
                "More friends and family?",
                "How about some thing difrent  a list of  enimes? "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More friends and family?</span></div></span></div>",
            "created":1592629200,
            "id":2854227,
            "title":"more friends and extended family"
        }
    },
    "info":{
        "author_id":"bethany7",
        "author_name":"Bethy",
        "brief_description":"A foot fetish story at your home, involving Your father,Mother, brothers, sister and You !",
        "created":1590509940,
        "description":"<td align=\"left\" class=\"norm\">The Taylors are on a weeks vacation at home,they don't have a lot of money and Lenny has a lot of debt, so he works two jobs, so its during springl break and dad's taken a week off work to have more time with them.<br>\r\n<br>\r\nYour Father is Lenny Taylor, a 44 year old Jr. High Principal.<br>\r\n                                   Vera, a 37 year old loving stay at home Mother.<br>\r\nYour brothers are …   Sam, a senior in high school<br>\r\n                                   Bob,  a Jr. high schooler<br>\r\n                                   Sara, just going into Jr.High.<br>\r\n                                   Johnny, you another brother ( no age )<br>\r\n<br>\r\n<br>\r\nThis is mainly a foot fetish story, yet there can also be a number of things going on along with it.<br>\r\n the family can like feet but like footjobs better and even blowjobs best.<br>\r\n You can make it where two people are involved and the others don't have any idea, or one boy and his friend, or Dad and someone... ect<br>\r\n<br>\r\nI would like to stay away from vore and gore, toilet things, growing.<br>\r\nIf you wish to shrink<i><b> one </b></i>of the family or their friends then they cannot shrink below 3 ft, tall.<br>\r\nall of the family has some kind of fetish along with feet, some may be sissy boys, some might want to shrink ONE of the family, some might be able to talk to ghosts and some may be very seductive, to be able to get their way.<br>\r\n<br>\r\nMost of the  family teases Johnny because out of all the family, Johnny like feet the Most, anything and everything involving the others feet.<br>\r\nMom may also get mad at Johnny from time to time because she also really likes others feet, that's where Johnny got his fetish from.<br>\r\n<br>\r\nFeel Free to add other friends, cousins and extended family members.<br>\r\n<br>\r\n</td>",
        "id":2222802,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1590511020,
        "modified":1592743680,
        "pretty_title":" Foot Fetish ... at home"
    }
}