{
    "chapters":{
        "1":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Grow her breasts a little ",
                "Grow her ass a little ",
                "heads to the mall to find some victims ",
                "Angela's sister comes over ",
                "Visits a friend "
            ],
            "content":"<div class=\"\"><div> <span>After coming home from a good night at her girlfriend's house she finds a package left at her door. Getting inside and getting dressed in her comfy clothes she opens the package and finds a what looks like a toy ray gun with a grow and shrink option on the side. Thinking it's a joke gift from a friend she playfully fires it at her table only for it to shrink. This shocked her and caused her to recoil slightly. Switching it to grow she fired again and the table was back to it's original size. Angela was in thought about what she could do with this.</span></div></div>",
            "created":1595066580,
            "id":2870905,
            "title":"It starts "
        },
        "12":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "Big as LL size",
                "Big as a beanbag chair ",
                "Big as the table",
                "Even bigger",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Angela thought her butt was too small so she sets it to grow as she fires it, she feels lust and pleasure wash over her as she keeps growing her but to dd, ee, and more<br>\r\n<br>\r\nHis big does her butt get?</span></div></span></div>",
            "created":1597664280,
            "id":2886816,
            "title":"Grow her ass a little "
        },
        "13":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "go with the group near the front ",
                "Victoria secret ",
                "The Anime store ",
                "The video game store ",
                "The food court "
            ],
            "content":"<div class=\"\"><div> <span>Deciding she could find plenty of people to crush she goes to her room to get dressed. Taking off her comfy clothes she puts on her black bra with pink lacing and matching panties on with a crop top and shorts that hugged her ass. Once dressed she heads off to the mall. When she got to the mall she walked around a bit to see what her options were for the time being. At the front she sees a group of teen girls that looked like they would be fun to mess with. She also would like to mess with the Victoria secret worker that always helped with picking out bra's. There a couple other stores she thought about going in but in the end she decided to</span></div></div>",
            "created":1595132280,
            "id":2871410,
            "title":"heads to the mall to find some victims "
        },
        "15":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Tammy ",
                "Sarah ",
                "Lisa",
                "Kim",
                "Jessie "
            ],
            "content":"<div class=\"\"><div> <span>She decided she wanted to mess around with one of her friends so she gets up to get dressed. Taking off her comfy clothes she puts on her black bra with pink lacing and matching panties on with a crop top and shorts that hugged her ass. She walks out and gets into her car thinking about which of her friends she wants to mess with first.<br>\r\n<br>\r\nTammy was her friend who had a thicc ass but only B cup breasts.<br>\r\n<br>\r\nSarah was her friend who was tall with a decent ass and decent C cups breasts.<br>\r\n<br>\r\nLisa was her friend who had a big pair of DD breasts like her but a non-existing ass.<br>\r\n<br>\r\nKim was her friend who was just average all around.<br>\r\n<br>\r\nFinally there was her nerdy friend Jessie who was just above average looking.</span></div></div>",
            "created":1595143440,
            "id":2871457,
            "title":"Visits a friend "
        }
    },
    "info":{
        "author_id":"shooter243",
        "author_name":"Death",
        "brief_description":"Angela grows or shrinks people around her ",
        "created":1595063280,
        "description":"<td align=\"left\" class=\"norm\">Angela is a 27 year old brunette who's 5'7 with natural DD breasts and a bubble butt. She loves playing with her breasts and having her girlfriend play with them too. One day she finds a ray gun that lets her grow and shrink things.<br>\r\n<br>\r\nThis story is about Angela crushing people with her breasts, ass and body.</td>",
        "id":2227130,
        "image_url":"https://www.writing.com/main/images/action/display/ver/1599708630/item_id/2227130.jpeg",
        "last_full_update":1599712200,
        "modified":1599712200,
        "pretty_title":"Angela the Giantess "
    }
}