{
    "chapters":{
        "1":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "Heather",
                "Clare",
                "Karina",
                "Martha",
                "Titania"
            ],
            "content":"<div class=\"\"><div> <span>Heather <br>\r\nHeight 5 ft <br>\r\nBust B <br>\r\nBig butt<br>\r\n<br>\r\nClare <br>\r\nHeight 5,6 feet <br>\r\nBust C<br>\r\nAverage butt<br>\r\n<br>\r\nKarina <br>\r\nHeight 5,2 <br>\r\nBust A <br>\r\nBubble butt<br>\r\n<br>\r\nMartha <br>\r\nHeight 5,4 feet <br>\r\nBust D<br>\r\nSmall butt<br>\r\n<br>\r\nTitania <br>\r\nHeight 5,8 feet <br>\r\nBust C <br>\r\nSmall butt<br>\r\n<br>\r\nChose a girl to grow </span></div></div>",
            "created":1582693200,
            "id":2793262,
            "title":"Characters "
        },
        "11":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "Reader choose ",
                "Reader choose ",
                "Reader choose ",
                "Reader choose ",
                "Reader choose "
            ],
            "content":"<div class=\"\"><div> <span>Heather was waiting for a package from her friend that would improve her life forever.<br>\r\n<br>\r\nHer door bell rings, she get up and is met by a the mailman at the door, “I’m have a package for Heather is that you”, “yes that me”, “well here you go have a nice day”, “thank you”. She take the package inside and place it on her kitchen island.<br>\r\n<br>\r\nShe opened the box and inside was a remote with it manual.<br>\r\nThe manual was titled enchantment remote, Heather look at the remote and it had a increase and decrease buttons on it. She then read the manual points a the subject and push ok the the other button will change the target body...<br>\r\n<br>\r\nHeather points at herself then push ok. “Let try this remote out”, and the time she was wearing a red shirt and shorts shorts. She take off her to see her blue bra then push increase on the boobs option, her bra inches forward, “it actually works awesome”, she continued to push the same button till her breasts were D cups.<br>\r\n<br>\r\n“That better I have some breast now but bra it feeling pretty tight I should take it off”, she unhook her bra to reveal her new boobs.<br>\r\nI want to be taller so do that she then push the Height button repeatedly, “ohhh that feels amazing” she said as her inching closer to the ceiling, then she ripped right through her shorts, now she was 5,10 feet tall.<br>\r\n<br>\r\n“I wonder what else I should grow?”<br>\r\n</span></div></div>",
            "created":1582693200,
            "id":2793318,
            "title":"Heather"
        },
        "111":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "Reader choose ",
                "Reader chose ",
                "Reader choose ",
                "Reader chose ",
                "Reader choose "
            ],
            "content":"<div class=\"\"><div> <span>After pondering for few minutes she picks her boobs again, starts pushing the increase button again. Her breast expands into F cups <br>\r\n“Now that more like maybe the should be a little bit bigger” she push it more and her tits grew to G cups, “these are huge”maybe I should go to a club later.<br>\r\n<br>\r\nShould touch her huge boobs, so soft and big but they heavy maybe some muscle will help, she look at the remote to see it there a muscle button, she finds it at the bottom of the remote. “That your are” she tapped on the button to activate it functions. <br>\r\n<br>\r\nShe click it five times, her body became stronger with every click,<br>\r\nAfterward she hand a muscular body. “That should do it I’m so strong, she said as she feels her big biceps and calves I have abs too fantastic this remote can do anything what else should I change”.<br>\r\n<br>\r\nShe changed in a sports bra it straight to her new size and then wear sweatpants pants. Let go have so fun at the club she leaves the remote at home and drives the the nearest club in her city.<br>\r\n<br>\r\nShe arrives at the club around 6 pm and she enter the club building. Heather walks up the cashier, “can I volunteer for entertainment tonight?”, the cashier looks at her, “you have a very sexy body sure you can come this way and the other girls with sets you up for the club” thanks”.<br>\r\n<br>\r\nThe cashier take her to the changing room, just go in there and everything with be ok, the cashier goes be to the cash register in the front. The other girls in the changing room has hourglass Like body. <br>\r\nThe Head woman the tallest one out of the employee walk up to Heather, “well well what do we have here”, she was 6 feet tall with D cup breast.<br>\r\n<br>\r\n“Nice size” the woman said as she stoke heather breast. “you will fit in perfectly just wear what we’re wearing and walk around like you own the place” ,“ok”they handled Heather a stripper outfit that fit her body size.<br>\r\n<br>\r\n2 hours went by as the girls got ready to put on a show for the men who dare enter the club building to night. <br>\r\n<br>\r\nNow the fun shall truly begin</span></div></div>",
            "created":1582693200,
            "id":2793355,
            "title":"Reader choose "
        },
        "12":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "Try it on herself ",
                "Reader choose ",
                "Reader choose ",
                "Reader choose ",
                "Reader chose "
            ],
            "content":"<div class=\"\"><div> <span>Clare was always  the hottest girl in all her schools being orange haired with hazel eyes and a slim fit body to show off. she didn’t think she was perfect and she wanted all the boy and girls to be jealous of her but they weren’t because of Zoey was a little taller but a lot busty then Clare. <br>\r\n<br>\r\nZoey breast were G cups and she standed at 5,10 feet tall with a slim tones body to show off she a 10 grader in  Clare high school and she hated her with are her guts because she want to be the sexiest woman in the world. <br>\r\n<br>\r\nClare was staying with her grandparents for the summer while her parents was out on a business trip so they couldn’t watch her after the freshman year ended. <br>\r\n<br>\r\nOne day while Clare was shifting through her grandparents attic she found a very dust box out the corner of the attic. She brought it down to her room and dusty it off. Magical wand for ticks she reads off, wait could this be real magic.<br>\r\nShe open the box and inside was a blue wand with an white gem in a holster on the top of it. Also a book on how to become a beginner sorcerer this can be true she goes to the first page and starts reading.<br>\r\n<br>\r\nGrowth spell increase the size of anything just by pointing at the target and say grow.<br>\r\nShrink spell decrease the size of anything just by pointing at the target and say shrink. <br>\r\nInvisible spell same as above but say invisible,<br>\r\nTeleport spell say the name of the building and you be teleported there. <br>\r\n<br>\r\nSpell for beginners, it want advanced spell buy the book on the back cover. </span></div></div>",
            "created":1588827600,
            "id":2831859,
            "title":"Clare"
        },
        "121":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "Increase her height ",
                "Reader choose ",
                "Reader choose ",
                "Reader choose ",
                "Reader choose "
            ],
            "content":"<div class=\"\"><div> <span>Clare was wearing a crop top and jeans. Clare aim the wand at her breasts and say grow. Her chest started to heat up then her boobs increase in size stretching her top out farther. <br>\r\n<br>\r\nWow it’s actually works, her breast were now D cups, there a nice size now but they need to be bigger to make Zoey jealous. She aims at her breasts again and say grow three times. Her chest heated up again making her feel horny as her boobs grew larger stretching her top it limits tearing at the sides.<br>\r\n<br>\r\nAfter returning to normal feeling she look at her breasts, they were huge and her crop top was super tight cause her some pain. There so big now, Clare removes her crop top to release her of the pain. <br>\r\n<br>\r\nNow these are bigger then Zoey breasts, Clare bust is now 120 cm or H cups.<br>\r\nClare look at her self in her bathroom mirror, so large,<br>\r\n<br>\r\n incomplete <br>\r\n</span></div></div>",
            "created":1588827600,
            "id":2831901,
            "title":"Try it on herself "
        },
        "1211":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "Has some fun",
                "Reader choose ",
                "Reader chose ",
                "Reader choose ",
                "Reader choose "
            ],
            "content":"<div class=\"\"><div> <span>Clare decided to increase her height. She aims the wand at her leg <br>\r\nand say grow her legs grew longer making her pants shrink.<br>\r\nI wonder how tall I’m now, I think I need to be taller still she says grow again at her legs, her legs grew even longer turn her pants into shorts. That better now I should be taller than Zoey.<br>\r\n<br>\r\nClare looks at herself in the mirror, I look amazing but now I need new clothes to fit my new body. She looks the biggest shirt that she could find in her closet <br>\r\nand try putting it on, the shirt just cover her breasts barely show all of belly.<br>\r\nWell this looks ok time to go shopping.<br>\r\n<br>\r\nShe hides the wand in her room then get in her car and heads to the clothes store. Few minutes later she arrives at a clothing store and walks in.<br>\r\nClare ask one of the female employees to help her on finding clothes to fit her.<br>\r\nThey enter the changing room. <br>\r\n<br>\r\n“I’m going to measure your body to see what size your are in clothes wear”,<br>\r\n“Ok”<br>\r\n“Your height is 6,4 feet, waist is 40 inches, wow your breasts are huge they were H cups and shoes size is 12. I will got get you some fittings clothes” <br>\r\n“Ok”<br>\r\n<br>\r\nThe employee leaves the room to grabs clothes.<br>\r\n“I’m 6 foot 4 that taller than I that I was but I like it, it intemperate people”.<br>\r\nThe employee returns with 5 shirts, pants, bras, and shoes inside a shopping cart.” Here you go these should fit you”.<br>\r\n<br>\r\nClare takes off her shirt to put on the bras, they fitter her perfectly then she try on the other clothes.<br>\r\n<br>\r\nClare put back on her original clothes then pay for them and return home.</span></div></div>",
            "created":1590037200,
            "id":2839184,
            "title":"Increase her height "
        },
        "13":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "Karina finally does it ",
                "Reader chose ",
                "Reader choose ",
                "Reader choose ",
                "Reader choose "
            ],
            "content":"<div class=\"\"><div> <span>Karina is a Scientists but she only study body enhancement do to her low stature of shortness and having no tits. After reaching the age of 17 fully knowing that her body wouldn’t grow any more she set a goal to create a potions that would increase her stature tenfold. <br>\r\n<br>\r\nIn college she major was in biology , anatomy and medicine to learn everything about the human body. She graduated with a master degree. <br>\r\n<br>\r\nNow at the age of 27 she lives alone in a two story house with a basement and a 1/2 arch yard surrounded by a 8 feet tall fence. <br>\r\nShe a laboratory build in her yard that took about half of it.<br>\r\n<br>\r\nKarina has been working on this potions since she graduated college four years ago. After tens of failed experiments on her best friend Abby which wasn’t very smart but she would do anything for Karina.<br>\r\n<br>\r\nAbby body was disproportionate because of the fail potions effects follows after she drank them. She was tall and busty but with a very skinny profile and a flat butt. Standing at 6,4 feet with a bust of D cups and weight only 160 lbs, and every time Karina try to return her back to normal it become worse. <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1588827600,
            "id":2831822,
            "title":"Karina"
        },
        "14":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "She explore earth ",
                "Reader choose ",
                "Reader chose ",
                "Reader choose ",
                "Reader choose "
            ],
            "content":"<div class=\"\"><div> <span>Martha wasn’t human but an shapeshifter alien from the one of Jupiter many moons. On her way back home from explore the solar system her ship is hit by a meteor which changes her chose of flight to hit earth then her home moon.<br>\r\n<br>\r\nMartha ships crash in the Toiyabe National Forest of Las vagus.<br>\r\nShe was in hyper sleep stats for the entire fight. So she does even know that she crash land until the online ship ai open her pod.<br>\r\n<br>\r\nLarry are we home, Martha ask the ship, <br>\r\nno where are on a planet called earth an meteor hit us during your hyper sleep. <br>\r\nWhat the stats report on my ship, <br>\r\nwell the engine is damage and the wings were burn off during entry of earth atmospheric forces. <br>\r\nDoes earth have a breathable atmosphere.<br>\r\nYes it in habit are a races called human they are a young species <br>\r\nand have descent technology threat to you none but you need to transform into one of them to get parts to repairs me. <br>\r\nWell what are my choices.<br>\r\nWell there are males and female human, Larry pull up a picture of both gender to show then to Martha. Martha alien body is red scaled skin and under a soft monocular substance that change her physical appears. Her species Stand at 12 feet tall and weighs 400 pounds on there home world.<br>\r\n<br>\r\nI like the girl form, Martha starts transformation her body into a girl at the age of 25. Height of 5,4 feet tall with a bust of D cups and Green colors hair with brown eyes.</span></div></div>",
            "created":1588827600,
            "id":2831877,
            "title":"Martha"
        },
        "141":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "Has some with the human race ",
                "Reader choose ",
                "Reader chose ",
                "Reader choose ",
                "Reader choose "
            ],
            "content":"<div class=\"\"><div> <span>After putting on earth clothes she leaves the spaceship.<br>\r\nWow this world is beautiful now where can I get parts to repair Larry.<br>\r\nShe pull a device that so her the location of a junkyard, it 10 miles away wow ,how I’m going to get there. <br>\r\n<br>\r\nMaybe I could change my size so it would take me as long radar scans the area around us for 10 miles, the device Starts to scans the forest, no human in area.<br>\r\n<br>\r\nPerfect I change my size and no will see me, <br>\r\nMartha began changing her body, she decided to increase her height to 20 feet tall and then equalized the rest of her body.<br>\r\nThat better I can get there in no time.<br>\r\n<br>\r\nShe ran towards the junkyard to pick up the supplies needed for her ship. She arrives at the her desalination in five minutes vs an hour.<br>\r\nThen she called a drone from her ship to meet her there. Martha changes back in a normal size human wearing a red t-shirt and black pants. <br>\r\n<br>\r\nYes Martha the drone replyed after it arrives, take all the supplies needed from here to repair my ship then signal me when your finished repair it, <br>\r\nYes master. <br>\r\n<br>\r\nMartha walk into town that was in front of the junkyard and began seeing earth for what it is.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1590037200,
            "id":2839203,
            "title":"She explore earth "
        },
        "15":{
            "author_id":"growthhot",
            "author_name":"Leo xian",
            "choices":[
                "Month two ",
                "Reader choose ",
                "Reader choose ",
                "Reader choose ",
                "Reader chose "
            ],
            "content":"<div class=\"\"><div> <span>Titania loves working out to see the full potential of her body and she was finally ready to start her transformation from weak to strong. One a month she plan to ordered muscle enhancement formula to increase her muscle as a faster rate then normally. <br>\r\n<br>\r\nCurrently Titania was a slim fit girl at the age of 21 with brown hair and green eyes. She normally wears a red sports bra a black sweatpants. Her weight room was in the basement of her one story house and it had everything you need, weights, dumbbell, sand-balls, brunch, leg lift,<br>\r\npull up bar, etc.  <br>\r\n<br>\r\nDuring her first month she work out every day with out the muscle formula because she wanted to get her body use to the routine <br>\r\nbefore making more intense with those supplements.<br>\r\n<br>\r\nMonth one <br>\r\n<br>\r\nTitania started with dumbbells of 10 pounds each, 50 pounds brunch press and 60 pounds leg lift to set her basic routine for the month of January. <br>\r\n<br>\r\nAfter the first week her body was in lot of pain from exercising so much but it was needed to get her body ready for the body building life style. <br>\r\n<br>\r\n</span></div></div>",
            "created":1588827600,
            "id":2831737,
            "title":"Titania"
        }
    },
    "info":{
        "author_id":"growthhot",
        "author_name":"Leo xian",
        "brief_description":"Girls growing in many ways",
        "created":1582599600,
        "description":"<td align=\"left\" class=\"norm\">Instructions <br>\r\n<br>\r\nIncrease the girls body parts in any way you want <br>\r\n<br>\r\nLike breast, butt, height, muscular etc <br>\r\n<br>\r\nThe first chapter of every character is the story I’m doing for them<br>\r\nThe rest is free to make your own event in the reader choose parts <br>\r\n</td>",
        "id":2213918,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1590096660,
        "pretty_title":"Growing girls"
    }
}