{
    "chapters":{
        "1":{
            "author_id":"the_watchers",
            "author_name":"The_watcher",
            "choices":[
                "Movie and Talk",
                "Go out"
            ],
            "content":"<div class=\"\"><div> <span>Smack!<br>\r\n<br>\r\nThe feeling was confrontational, the sound would suggest it would have hurt, yet you could not attest to that feeling, you didn't feel any impact nor pain. Rather just blackness. You opened your eyes, or what you initially thought were yours and looked around. Your sister's room, the pink walls hurt your eyes, the posters sporting familiar bands that your younger gushed about all day every day. All her furniture was in the same formation that it was in your room, the difference being the feminine aesthetic that she had decided to dissipate around her room. <br>\r\n<br>\r\nYou looked down, for the first time, two mounds met your view, they were not your sisters. How did you get here?<br>\r\n<br>\r\nOne hour earlier...<br>\r\n<br>\r\nYou picked through your breakfast, staring lifelessly at the pancakes that sat in front of you. Stabbing your fork into the sugary surface and twisting carelessly and breaking it in small crumbly pieces. <br>\r\n<br>\r\n\"Are you alive?\"<br>\r\n<br>\r\nA voice broke your day dream, swiftly tracing the source you landed on your sister, she had a warm grin, so wide you could see her braces, they were coloured blue as she had requested at her last orthodontist appointment, you respected her self-confidence to look and wear what she liked with no care of what others thought of her. Deep down you knew that this was not completely true, but you didn't know how to bring it up to her, and on most days you did not want to bring down her ever sun-shining view of the world. <br>\r\n<br>\r\n\"Sorta\" You muttered through your frown, realising you appeared to have nothing behind the eyes. It was hard to match Laura's energy, she was constantly bubbling, about to boil over the brim, it was a rare day that you saw her any less than ecstatic, you, on occasion, felt guilty for not even attempting to join her in her high, as unattainable as it may be. <br>\r\n<br>\r\n\"Just to let you know Carrie is coming over today, please don't scream and run around naked like you usually do\" She joked arching her smile into a smirk. <br>\r\n<br>\r\n\"You caught me!\" You retorted. Carrie was Laura's Best-friend, she was a small girl, with long brunette hairs, messy and frizzy with big glasses that magnified her eyes,her smile was rarer, and suppressed,  she had the same view towards personal fashion that your sister had, only she cared about it, the weirdest experiences is when you saw her in 'boob tubes' and short shorts on when she would attempt to climb the social ladder to mirror her more attractive peers. Usually when she was at yours she reflected Laura in both clothing and personality. Sheepish around you, she spent most of her time in your sister's room, if she ate it would be in polite silence and with some minimal noises of thanks and enjoyment. Although you would not know if she was ever discontented  <br>\r\n<br>\r\n\"How is she anyway?\" You inquired,both out of manners and slightly out of genuine worry. <br>\r\n<br>\r\n\"She's okay.\" Your sister's demeanour changed, only slightly and had you been more tired maybe you would have missed the transition, her arched lips did not change it was her upper face, her eyes looked sadder. <br>\r\n<br>\r\n\"It's school it's taking a toll...\" Laura continued, you contemplated whether she had meant to tell you even that much, you knew you weren't going to press on, you didn't know the girl, it was non of your business, arguably nothing was if you never made anything your business, it didn't matter anyhow this morning was not the morning you intended to start caring. <br>\r\n<br>\r\n\"Sorry\" She chuckled awkwardly \"You don't need to hear this.\" The horrible thing is, is that you did need it, you needed some semblance of emotions, you doubted your sister ever felt sad, but would you know if she did feel upset? Would she come to you? You had never presented anything but a moody front since the age of 13, how could you read and help with others when your well being was elusive to even yourself. <br>\r\n<br>\r\n\"Oh. Give her my love!\" You regurgitated, like you always did, that sounded good, that sounded right.<br>\r\n<br>\r\n\"I will!\" Her attitude seemed to have resumed to before you'd asked about Carrie's health. Proceeding this she chirped her way out of the room. <br>\r\n<br>\r\nThis was your cue to get up and throw what remained of your meal into the trash, pushing your foot down on the bin lever and flipping the lid and tossing the discarded the sweet treat into the abyss of the black bin bag. <br>\r\n<br>\r\nFollowing in Laura's footsteps you exited the kitchen stumbling towards your room, and exhaustively dragging yourself inside. And throwing yourself on your bed. <br>\r\n<br>\r\n\"Uhhhh\" You breathed into your pillow. \"I just wish... For something exciting.\" <br>\r\n<br>\r\nThe door bell rang, loudly, accompanied by loud footsteps, followed by loud voices. Muffled as they were. Eventually you reached the end of your tether, catapulting your weary corpse out of your bed and striding toward your door, swinging it open and pushing yourself forward, without searching in front of you. <br>\r\n<br>\r\nSmack! <br>\r\n<br>\r\nYou're back, now with a new height. <br>\r\n<br>\r\n\"My clothes they're not mine.\" <br>\r\n<br>\r\nYou stood, frozen, your legs rooted like tree trunks in a dense forest, your mouth slightly perched open. Your arms heavy as you felt them beside you. <br>\r\n<br>\r\n\"Carrie!\" Laura yelled, It couldn't be directed at you, yet you felt the words, coming in your direction, behind you. A hand placed itself on your back, it's probably Laura asking where Carrie was. It had to be. <br>\r\n<br>\r\n\"Carrie, come on.\" The voice said again. <br>\r\n<br>\r\nIt couldn't be denied, she was talking to you, but she was saying Carrie, she said Carrie twice, she tapped you whilst calling you Carrie. <br>\r\n<br>\r\nIt would explain this changed of outfit, and some extra stuff here and there. You could feel yourself being taken by the arm, and moved towards your sister's bed. <br>\r\n<br>\r\n\"So did you see Love Note?\" Your sister did not miss a beat, she instantly turned back to her quirky self. <br>\r\n<br>\r\n\"L... Love Note?\" You found a voice but this one was not your own, you assumed that it was a film on Netflix but your brain didn't make the connection before the words escaped you. <br>\r\n<br>\r\n\"Yeah, the one with Jake Bradbury.\" She shoved playfully. <br>\r\n<br>\r\n\"No, I... Uh... didn't have time.\" You stuttered you way through trying in vain to balance listening to Laura your sister turned best friend and your brain going crazy, not understanding how you even got here. <br>\r\n<br>\r\n\"How did you not have time! I will force you to watch it.\" Laura then throw her weight on top of you holding you down by your arms and had her knees spread to either side of you. <br>\r\n<br>\r\n\"I will pin you down and make you watch it.\" There was a moment where you felt something, but this was clearly not you, something within Carrie's psyche, an impulse you couldn't explain. <br>\r\n<br>\r\n\"Hahaha\" Laura feel beside you. <br>\r\n<br>\r\n\"Bested you again.\" She gloated. Placing her head on your shoulder. <br>\r\n<br>\r\n\"Now you need to watch it!\" <br>\r\n<br>\r\nYou waited there, led there for a while feeling the warm friendship of your sister. <br>\r\n<br>\r\n\"What shall we do.\"<br>\r\n<br>\r\n </span></div></div>",
            "created":1571806800,
            "id":2737416,
            "title":"An unlikely collison"
        },
        "11":{
            "author_id":"the_watchers",
            "author_name":"The_watcher",
            "choices":[
                "The Afterglow"
            ],
            "content":"<div class=\"\"><div> <span>\"The movie sounds good\" You breathed nervously, again startled by your voice. <br>\r\n<br>\r\n\"Awesome\" She chirped, pushing herself towards her TV set, switching it on with the speed of one thousand teens and threw the film off. <br>\r\n<br>\r\nLaunching herself back at you folding herself into your arm that you had extended to your side. <br>\r\n<br>\r\nWere they dating? Had your sister been so sure of herself because she was dating her best friend, in truth you hadn't had such an intense friendship before this didn't mean that they didn't exist though. Was this just what girls did. Was this just what Laura did. <br>\r\n<br>\r\nLuckily for you your compatriot was so involved with the movie your tell-tale facial expressions went completely unnoticed.<br>\r\n<br>\r\nThe movie flew by, mostly because you were in your own head for far too long, you silently hoped that there wasn't a trivia quiz coming up later. <br>\r\n<br>\r\n\"Do you want to sleep over?\" You're sister broke the silence whilst the credits rolled. <br>\r\n<br>\r\n\"I think so.\" This was almost involuntary from what you had experiences, your feelings had been warped, mangled in a way that you had never felt before, the worst bit was that you didn't know whether they were your emotions or Carrie's. <br>\r\n<br>\r\n\"Let's get into our Jim Jams\" Laura catapulted herself up onto her carpet. <br>\r\n<br>\r\n\"Should I leave the room.\" You asked a knot in throat. <br>\r\n<br>\r\n\"Oh my goodness why even would you!\" She looked shocked, yet still optimistic and shining. She yanked her shirt off, leaving her in a bra. Soon after she grabbed a tank top that she put on. <br>\r\n<br>\r\n\"Hope that didn't make you too uncomfortable.\" Laura fell on top of you, her chest pressed against yours, you knew that if you had any male appendages that it would be stood to attention. <br>\r\n<br>\r\n\"Oh yeah, oh yeah!\" She began a parodied porn star ore as she writhed fully clothed on top of you. <br>\r\n<br>\r\n\"Call me mommy.\" <br>\r\n<br>\r\n\"What?\" You shot out. <br>\r\n<br>\r\n\"Oh lighten up!\" Her voice hd changed for the first time in ages. <br>\r\n<br>\r\n\"I understand about school and your parents, and everything. I am trying Carrie, I push movies towards you, I play fight like we used to do, I act like a sodding porn star, in some vain attempt to make you smile and I'm so sick of it! I am sorry that Jake doesn't like you, I am sorry that you're mom is giving you a hard time about your grades. But I am trying so hard to help you, yet everything I do is thrown back in my face. Why do you even want to sleep, just so you have someone in the room so you can feel sorry for yourself because if that's the case then you can... fuck off!\"<br>\r\n<br>\r\nYou saw tears forming in her eyes, whether it was platonic or romantic she genuinely cared for her friends, for the first time you could read your sister, she had put off her problems all her pain and directed it all to help her friend, and it was clearly weighing so heavy on her. <br>\r\n<br>\r\n\"Look I'm sorry, I shouldn't have been like that, it's just so hard. You are so beautiful, and funny and wonderful and fabulous, and it hurts me so much to watch you go through this, and I can't carry on, and now you can't even look at me when I get changed. What has gone on since last month. Who are you?\" <br>\r\n<br>\r\nWho were you? Was this the time to come clean, or for your sister's sake should you play along, maybe try and mend the relationship between the friends, see how the other half live. <br>\r\n<br>\r\n\"No, I'm sorry, it's just so difficult with Jake and everything, I don't know who I am anymore, do I want to dress like everyone and feel weird when people look at me or dress like I want to and feel shit for no one looking at me. I am out of place everywhere. I am a ghost in a world of the living, and I hate it!\" Tears started to form in your own eyes. <br>\r\n<br>\r\nYour sister stared at you, her eyes softening once more, she moved and embraced you hard, the droplets that sat merely on your lids started to flow freely down and unto your cheeks, in a way you related to her, understood her. <br>\r\n<br>\r\n\"It's okay.\" Your sister consoled you her own rosy cheeks now wet.  <br>\r\n<br>\r\n\"I just want you to know, that I'm here. I always will be here.\" <br>\r\n<br>\r\n\"I know, should I get in my Jim Jams.\" You smiled through the sadness, in order to distract from all the wholesome weeping. <br>\r\n<br>\r\n\"You can borrow some of mine.\" After releasing you she meandered over to her drawer and pulled out a similar tank top that she was sporting.  <br>\r\n<br>\r\n\"Do you want me to leave the room?\" She queried satirising your exchange earlier.<br>\r\n<br>\r\n\"Only if you peak in without me knowing.\" Taking the offering and lifting the t shirt you had on over your heads, leaving a second for both you and your sister to glance at your bra-clad body. This minor level voyeurism made you feel slightly hot inside. Making sure you didn't take to long you carried on dressing. The top was much baggier on you than it was on your best friend, due to her larger assets and curvier figure, but it worked for now. <br>\r\n<br>\r\nNow back on the bed you cuddled and talked about everything, for chick flicks to your virginity to boys and girls, everything and anything. <br>\r\n<br>\r\nThere was no denying that you felt an air of something more, you had to resist planting a kiss on your own sister, the mixture of family love and intense friendship was too much to handle, but you couldn't do anything. You needed to escape for five minutes just five minutes. <br>\r\n<br>\r\nSo you did, you slithered away, explaining you needed to go to the bathroom, you ran into your room, and exited this poor girls body, she flew back like she'd had a small push. <br>\r\n<br>\r\n\"Y...You possessed me, y... you said the things I was thinking to L...Laura.\"<br>\r\n<br>\r\n\"I am so sorry.\" You felt a powerful increase of sadness and guilt twang in your heart.<br>\r\n<br>\r\n\"No... Thank you!\" She gained a minimal smile. <br>\r\n<br>\r\n\"I think I love Laura.\" <br>\r\n<br>\r\n\"She loves you too!\"<br>\r\n<br>\r\n\"Not in that way... I love her like I love her so much.\" She laughed you imagined that if she had not she would burst into frantic crying. <br>\r\n<br>\r\n\"Tell her.\" You advised with so much empathy you wanted to do it yourself. <br>\r\n<br>\r\n\"Can you do it... as me?\" <br>\r\n<br>\r\n\"As you?\" <br>\r\n<br>\r\n\"Possess me, go back in there, hug her, kiss her, please. Please!\" Carried handled you by the arms and forced you into her. <br>\r\n<br>\r\nBlackness again, a similar but alien form greeted you again. As well as a renewed confidence that took your body towards your sisters room, she jumped out a you for behind the door. This was your chance, you shoved her onto the bed mimicking how she had done earlier holding her arms down, but this time was different you placed your lips on her and began kissing her, all the feelings that had built up all night came to a head. <br>\r\n<br>\r\n\"Wait what are you doing?\" Your sister asked in between smooches.<br>\r\n<br>\r\n\"It was you it was always you.\" You continued, until you felt Laura move you off her, your initial thought is that you'd badly misjudged the situation, but then you felt her climb on top of you. <br>\r\n<br>\r\n\"I told you I'd pin you down.\" She threatened, penetrating your mouth with her tongue. Her hand moved from your hand to her stomach, gliding up your belly to your tit and massaging it sensually. <br>\r\n<br>\r\nLaura yanked herself up panting. <br>\r\n<br>\r\n\"Are you sure you want this?\" <br>\r\n<br>\r\n\"Give me your hand.\" As you ordered you grabbed her hand cramming it into your shorts. A wave of pleasure toured your body as you rocked on Laura's fingers. <br>\r\n<br>\r\n\"And your other hand\" taking the second hand you guided it into the borrowed top and under your bra, her index finger rotating your nipple.<br>\r\n<br>\r\n\"You sexy bitch\" you called your best friend now biting your neck.<br>\r\n<br>\r\n\"I'm about to cum, you moaned electric filling your entire body, like you were walking on clouds. <br>\r\n<br>\r\nIt was her turn now. removing her hands from where they were, you swapped again, throwing her tank top off. <br>\r\n<br>\r\n\"You're boobs are amazing.\" <br>\r\n<br>\r\n\"I want you to touch them.\" <br>\r\n<br>\r\nThis was not a request you wanted to refuse so you complied kneading her bra then going under and fingering what was underneath. <br>\r\n<br>\r\nYou journeyed down south, removing her shorts and underwear, invading her with your tongue. Spelling the alphabet, you wanted to repay the favour, it didn't take long before you felt your partner spasm from your activity.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1571979600,
            "id":2738258,
            "title":"Movie and Talk"
        },
        "111":{
            "author_id":"the_watchers",
            "author_name":"The_watcher",
            "choices":[
                "Comfort your sister. (Green Choice)",
                "Go to Carries. (Red Choice)"
            ],
            "content":"<div class=\"\"><div> <span>You both led there, side by side, Laura with her bra and without her bottom half and you still in Laura's pyjamas. In silence, your eyes fixed to the ceiling not because of regret, or guilt but because you had been the beneficiary of a million experiences in one blissful hour. <br>\r\n<br>\r\n\"So...\" Laura began turning to you her hand gracing your arm and rubbing it up and down. \"How was it?\"<br>\r\n<br>\r\n\"The best night I've had\" You mused. Turning to her and smiling. The warmest smile that you had ever gifted someone. <br>\r\n<br>\r\n\"I'm glad\" The grin that she returned was not her usually bubbly one, it was strong, there was a genuine air to it, like she was happy and she was actually happy. <br>\r\n<br>\r\nThe silence resumed. <br>\r\n<br>\r\n\"Thank goodness your parents weren't home\" <br>\r\n<br>\r\n\"My brother was.\" Her faced dropped. \"What if he heard?\" <br>\r\n<br>\r\n\"I doubt it. Wasn't he sleeping?\" You lied, knowing the actual truth would sound mental beyond belief. <br>\r\n<br>\r\n\"We were pretty loud.\" She was proud and almost boastful in how she spoke. <br>\r\n<br>\r\n\"YOU were pretty loud\" You retorted, grasping her right breast at and giving it a hearty squeeze. <br>\r\n<br>\r\n\"I wonder why?\" She lent in and kissed you. <br>\r\n<br>\r\nPulling away you got up from the bed walking towards the bathroom, entering you stepped out once more from Carrie's body, watching her in an initial dazed confusion until her expression became one of calm thanks.<br>\r\n<br>\r\n\"You did all that in my body. Thank you! How can I repay you!\"<br>\r\n<br>\r\n\"Honestly you're fine, I got to experience it as much as you did remember.\" You were still tired, like you were that morning, it seemed like all the energy you had, had come from Carrie's young vessel. <br>\r\n<br>\r\n\"Are you sure?\" Her lips became more seductive \"Do you want to use my body from the outside.\" She sauntered towards you. <br>\r\n<br>\r\n\"No, it wouldn't be right, not after what we... you did with my sister.\" <br>\r\n<br>\r\n\"You think that was real? I like men, I just wanted you to pilot my body like a whore, because I knew you wanted to fuck your own sister.\" <br>\r\n<br>\r\nYou launched yourself at her pinning her to the bathroom wall, your hand firmly pressed against her neck, your eyes fiery and intense, molten anger rising to the surface. <br>\r\n<br>\r\n\"You like this. Don't you, the power, over a small little nerdy girl, who can't get a boyfriend and who's mother doesn't want her. But who's worth a fuck after a couple of drinks, I can feel it, I could feel it when you were in me too, the big hero picking up the vulnerable little girl who can't fend for herself. 'Oh please possess me master, please.'\" She spat threw the choke hold that you had her in.<br>\r\n<br>\r\n\"You're pathetic.\" You grimaced, insulting through gritted teeth. <br>\r\n<br>\r\n\"I'm pathetic?\" She giggled \"I'm pathetic? Just because you're little cute sister, tried to save me, by frigging herself off to me when I got changed, writing little 'platonic' poems, I always came here for you, James. Do you not feel it, what we have. I've seen you, tossing off, I watch from the crack in the door, soaking up every little gesture you did, I imagined you screaming my name.\" She looked as if she was turned on by the entire encounter. <br>\r\n<br>\r\n\"Look what you're going to do..,\"<br>\r\n<br>\r\n\"What am I going to do, get down on my knees and apologise, go to your sister, and tell her it was my mistake. Only it wasn't was it. It was your mistake.\" <br>\r\n<br>\r\nYou loosened your grasp and stepped back. <br>\r\n<br>\r\n\"You were the one in control weren't you, writhing my body in all the ways you wanted.\" She pushed her way onto you. \"What do you want me to say to her, 'ooo sorry I asked your brother to possess me and ride you like a untamed horse, and wiggle your forefinger all the way up inside me.' Oh, that wouldn't make sense would it, so what would you want me to say. 'I'm sorry Laura I'm not a lesbian and would rather skip out on any tongue play for the foreseeable future, but if that big-dicked brother of yours wants some send him my way.\" She laughed her back now against the wall her hands planted on the wall tiles. <br>\r\n<br>\r\n\"What was your end game? If it was to get to me, why be friends this long why me?\" You started to get upset, so confused at this scenario that it was making you slightly sick and weirdly a little aroused. <br>\r\n<br>\r\n\"Why anyone, your hair, your eyes, the way you undress me when I wear revealing outfits. I just want you James, I want you to be mine, is that so hard.\" She grabbed your bulge in your pants. \"Maybe not, but you are.\" <br>\r\n<br>\r\n\"Get off me!\" you seethed.For some reason you didn't push her away. <br>\r\n<br>\r\n\"You haven't tossed me off you. Strange I thought you didn't want this. Fine I'm not going to to get you like this am I. I'm going to head home, you know where I live.\" <br>\r\n<br>\r\nYou eaves dropped as this psycho sauntered back into your sister's room like nothing happened. There was murmurs of questions about the sudden change of heart, then 3 minutes later she wandered out, without your sister behind her, she flashed you as she left. Whispering 'You know where I live.\"<br>\r\n<br>\r\nYou had a choice. </span></div></div>",
            "created":1572066000,
            "id":2738746,
            "title":"The Afterglow"
        },
        "1111":{
            "author_id":"the_watchers",
            "author_name":"The_watcher",
            "choices":[
                "Leave and go to your room (Green Choice)",
                "Go to Carries. (Red Choice)"
            ],
            "content":"<div class=\"\"><div> <span>You timidly made your way to your room, taking a second to peer into your sister's room, she was crying. Going against you're best instincts you went in, your sister was still in her bra, it didn't feel as queer now that you had touched her in a way you never thought you would. <br>\r\n<br>\r\n\"Laura.\" <br>\r\n<br>\r\nShe seemed startled. <br>\r\n<br>\r\n\"Oh its you... Sorry I'm just.\" She looked so disappointed in herself, that you had found her this way. <br>\r\n<br>\r\n\"Don't you dare apologise for being upset.\" The words felt so natural yet so unnatural, it was a new challenge attempting to be a good brother. <br>\r\n<br>\r\nHearing this she burst into tears. you involuntarily sat yourself next to her bringing her closer to you in a familial embrace. <br>\r\n<br>\r\n\"She didn't want me. She doesn't want me James?\" She said through quick breaths. <br>\r\n<br>\r\n\"Who didn't Laura?\" Your empathy was real, the ignorance was not. <br>\r\n<br>\r\n\"Carrie we... did... stuff.\" You saw it in her face that she didn't want to say those words, that she didn't even know how to engage with what had just happened. Just 20 minutes before she was walking on air with her best friend and now she's hit rock bottom. <br>\r\n<br>\r\n\"Oh, Laura.\" <br>\r\n<br>\r\n\"And then she just... fucking left!\" The outburst made you jump. You got up and grabbed a blanket that was draped over a chair and wrapped it around your sister's shoulder. <br>\r\n<br>\r\n\"Thank you. I just don't get it. Everything was fine... she finally spoke to me, and then I ruined with my fucking libido.\" That was your sister, even in the worst of situations she managed to make a least a tiny bit of it light. <br>\r\n<br>\r\n\"I doubt that's what ruined it sis...\" <br>\r\n<br>\r\n\"Then what?\" She interrupted \"I tried my best to support her.\" <br>\r\n<br>\r\n\"You tried too hard, you deserve so much better.\" After seeing Carrie's display when you depossessed her  you wanted your sister to break off that toxic friendship, if not for her sake, for yours. <br>\r\n<br>\r\n\"You're right, but we've been friends for so long.\"<br>\r\n<br>\r\n\"She liked me.\" You admitted, to your sister's chagrin. <br>\r\n<br>\r\n\"What?\" She breathed puzzled. <br>\r\n<br>\r\n\"When I de... I mean when I went to the toilet she followed me and told me that she was only your friend to get to me.\" It felt like cement was coming out of your lungs and you're stomach felt like a washing machine on a spin-cycle. <br>\r\n<br>\r\n\"You're lying.\" She whispered maliciously. <br>\r\n<br>\r\n\"No, I'm not she...\"<br>\r\n<br>\r\n\"You're fucking lying!\" She bawled ramming you off her bed, forcing you to a standing position. \"Why would she? Huh? She had just fingered me and then went off to confess her love you. Is that it?\" <br>\r\n<br>\r\n\"No its not that...\" It was that. <br>\r\n<br>\r\n\"Because it fucking sounds like it was...\" <br>\r\n<br>\r\n\"Laura, calm down.\" <br>\r\n<br>\r\n\"Are you going to go over there, go and stick your cock in her? Where I've just been! Get out!\" <br>\r\n<br>\r\n\"Laura...\" <br>\r\n<br>\r\n\"Get out.\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1572066000,
            "id":2738784,
            "title":"Comfort your sister. (Green Choice)"
        }
    },
    "info":{
        "author_id":"the_watchers",
        "author_name":"The_watcher",
        "brief_description":"Ghostly Powers, and possession, what could go wrong?",
        "created":1570217460,
        "description":"<td align=\"left\" class=\"norm\">Finding out that a spell can turn people into a Ghost is an amazing power. In the right hands. <br>\r\n<br>\r\nJames Farworth (19)- An average student.<br>\r\n<br>\r\nLaura Farworth (18)- James' nerdy younger Sister. <br>\r\n<br>\r\nClara Farworth (21)-  James' older step-sister. <br>\r\n<br>\r\nLisa Farworth (39)- James' Mother. <br>\r\n<br>\r\nTim Harbour (19)- James' mischievous best friend. <br>\r\n<br>\r\nSarah Harbour (22)- Tim's older sister. <br>\r\n<br>\r\nSally Harbour (41)- Tim's mother. <br>\r\n<br>\r\nHeather Atwood (19)- James' friend.<br>\r\n<br>\r\nElla Atwood (18)- Heather's sister.   <br>\r\n<br>\r\nGina Atwood (36)- Heather's mother.<br>\r\n<br>\r\n</td>",
        "id":2202270,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1572129420,
        "modified":1572129420,
        "pretty_title":"Ghostly"
    }
}