{
    "chapters":{
        "1":{
            "author_id":"starbomber",
            "author_name":"starbomber",
            "choices":[
                "She wants more (but what?)",
                "She stops it for now",
                "An interruption",
                "Your choice",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>A normal day in the life of James.<br>\r\nHe's happy that the holiday starts right now. His parents do a travel and he will be alone with his sister at home.<br>\r\nFrom time to time his aunt will be looking for the kids but the most time he can do what he want to do.<br>\r\nThe only requirement is doing the housework.<br>\r\nToday was Amys turn to taking out the trash and buy some food so you can relax in your room even you know she would go to her girlfriends holiday party.<br>\r\n<br>\r\n\"Allright James, I'm now going to the party. The housework I will do tomorrow after I'm back.\"<br>\r\n\"You will do it two times if aunt Jenny comes over and I should do it.\"<br>\r\n\"Yeah I do but can you do me a favor?\"<br>\r\n\"What it is little sis?\"<br>\r\n\"I will take your shoes to the party. They seems to be comfy and warm and I love these colors.\"<br>\r\n\"No way you take my shoes. That's my only pair I have at home\" shouted James down the stairs.<br>\r\n\"Okay, you're the boss\" <i>I will take them anyway</i> thought Amy and put James shoes on and leaves the house.<br>\r\n<br>\r\n30 minutes later aunt Jenny come to take a look.<br>\r\n\"James, Amy, is anyone of you at home?\"<br>\r\n\"Yeah aunt Jenny, I'm in my room and watch tv.\"<br>\r\n\"I know it's Amys turn but would you do the housework before the stores are closed? I come over in one hour again and will cook something for you.\"<br>\r\nAnd with this sentence aunt Jenny were leaving the house again.<br>\r\n<i>Sounds good to get something warm to eat. I better hurry</i> and James run down the stairs only to realize that his shoes were missing.<br>\r\n\"Amy...what should I do now? I will get in trouble if I don't do the houseworks\" and so he takes a look at his sisters shoes.<br>\r\nThere were standing different pairs:<br>\r\nHer flats: <a rel=\"nofollow\" href=\"http://0.tqn.com/d/15minutefashion/1/0/7/8/-/-/Nine-West-Ignacio---black.jpg\" target=\"_blank\">http://0.tqn.com/d/15minutefashion/1/0/7...</a><br>\r\nSome ankle boots: <a rel=\"nofollow\" href=\"http://files.edelight.de/img/posts/228x228_tamaris-ankle-boots-black-von-edelina-47.jpg\" target=\"_blank\">http://files.edelight.de/img/posts/228x2...</a><br>\r\nAnother pair of boots: <a rel=\"nofollow\" href=\"http://www.160mmpumps.com/images//c/201203161100091879.jpg\" target=\"_blank\">http://www.160mmpumps.com/images//c/2012...</a><br>\r\nAnd heeled sandels: <a rel=\"nofollow\" href=\"http://vfashion.co.uk/bmz_cache/f/f406995a1fb3fc6f11f1b98bcb1d94b2.image.325x470.jpg\" target=\"_blank\">http://vfashion.co.uk/bmz_cache/f/f40699...</a><br>\r\n<br>\r\n<i>I think I have no other choice. I will take these shoes.</i> and so he took the flats and put them on. <i>Damm puberty. The shoes of my sister fit me. Hopefully nobody will see me like this.</i><br>\r\n<br>\r\nJames made the housework without any interruption and nobody notice something strange at him.<br>\r\nHe took off the shoes, put them back down and waited for his aunt. She made him a nice meal, after that James helps her with the washing-up and goes to bed.<br>\r\n<br>\r\nThe next morning he meet his sister.<br>\r\n\"Amy, what were you thinking yesterday? Taking my shoes...\"<br>\r\n\"What's the problem?\"<br>\r\n\"What's the problem? Aunt Jenny came by yesterday and I should still make the house work. So I must take one of your pairs. Luckily nobody notice something.\"<br>\r\n\"Oh... I'm sorry James but your shoes were comfy, warm and practical than my and I must say I like to walk with them last night.\"<br>\r\n\"To be honest... I like the walking with your flats too but...\" and at this point Amy interrupt James.<br>\r\n\"You like it too, hmm... Do you want to trade shoes with me?\"<br>\r\n\"What...Why should I do it?\"<br>\r\n\"I like your shoes and you like my shoes. Easy thinking.\"<br>\r\n\"But these are girl shoes and if you want some shoes like mine than ask mum and dad.\"<br>\r\n\"No way. They buy me some shoes last week so... Please big brother, do me the favor. Please, Please, Please, Pleeeeeeeaaaaaaaaaasssssss....\"<br>\r\n\"Okay, Okay, Okay... You get my shoes and I get your shoes but which pair will you give me?\"<br>\r\n\"Hmmm.... I get your only pair of shoes so it would be fair if I give you all of my shoes.\"<br>\r\n\"But....okay.\"<br>\r\n<br>\r\nAmy starts to jump up and down with joy but then run up in her room only to bring \"your\" new shoes to your room.<br>\r\n<i>Fortunately are holiday and I can stay at home the most time</i> thought James but again his sister has an idea.<br>\r\n\"James, with your new shoes you can't wear your typical socks but I could...\"<br>\r\n\"I know what you want to say and okay if you stop with this now.\"<br>\r\n\"Yippieeeee...\" and again Amy runs in her room to switch the complete drawer of each of your wardrobes.<br>\r\n<br>\r\n\"One last thing brother...\"<br>\r\n\"What?\"<br>\r\n\"You're wearing currently my socks so switch with me.\"<br>\r\n\"But...you're wearing...\" James stutter \"Okay.\"<br>\r\nMoments later James now wearing the thights <a rel=\"nofollow\" href=\"http://4.bp.blogspot.com/-xtzb7jZGbKI/Tx_4mv03xCI/AAAAAAAACMA/ej2PR_YEf5o/s1600/sheer-patterned-tights.jpg\" target=\"_blank\">http://4.bp.blogspot.com/-xtzb7jZGbKI/Tx...</a> Amy was wearing and Amy the socks <a rel=\"nofollow\" href=\"http://images.def-shop.com/images/product_images/original_images/94150_0.jpg\" target=\"_blank\">http://images.def-shop.com/images/produc...</a> James was wearing.<br>\r\n<br>\r\n\"Now we done Amy?\"</span></div></div>",
            "created":1355461200,
            "id":1487996,
            "title":"The start"
        },
        "11":{
            "author_id":"starbomber",
            "author_name":"starbomber",
            "choices":[
                "Legwear",
                "Underwear",
                "Torso",
                "Jackets and Co.",
                "Accessories and Make-Up"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could be switched?</span></div></span></div>",
            "created":1355461200,
            "id":1488001,
            "title":"She wants more (but what?)"
        },
        "111":{
            "author_id":"starbomber",
            "author_name":"starbomber",
            "choices":[
                "Underwear time",
                "The day goes on without any happens",
                "Your idea"
            ],
            "content":"<div class=\"\"><div> <span>\"Now we're done Amy?\"<br>\r\n\"I'm not sure...something seems to be wrong...\"<br>\r\n\"Like I'm wearing your tights and have all your shoes?\"<br>\r\n\"Shoes... thights... socks... hmmm I know... your jeans.\"<br>\r\n\"What is with my jeans?\"<br>\r\n\"They don't fit you.\"<br>\r\n\"What do you mean with they don't fit? They don't press and they're not too long. Plus I'm feeling really comfy in them.\"<br>\r\n\"That's not what I mean. They don't fit with your shoes and socks.\"<br>\r\n\"And?\"<br>\r\n\"Let us switch our legwear too. I know you take a look at your style and at the moment it doesn't fit.\"<br>\r\n\"I know in some points you're right but how far will you go little sis?\" <i>What a window did I open?</i><br>\r\n\"Till it looks good I would say bro.\"<br>\r\n\"And how long you wanna play this game?\"<br>\r\n\"I don't know. Until I lose the pleasure.\"<br>\r\n<i>Good luck. Normaly she loses it very fast</i> James thought \"Allright Amy but not longer till our parents came back.\"<br>\r\n\"Sounds fine to me\" and again Amy rushed into the rooms and trade every legwear she could find in them.<br>\r\nWhen she came back you know what would happen.<br>\r\n<br>\r\n\"You know James...\" and this time James interrupt.<br>\r\n\"I know what you wanna say. Lets do it fast.\"<br>\r\nJust as you drop your pants your sister gets this crazy eyes again.</span></div></div>",
            "created":1355461200,
            "id":1488093,
            "title":"Legwear"
        },
        "1111":{
            "author_id":"starbomber",
            "author_name":"starbomber",
            "choices":[
                "Amy wants more",
                "Stop it for now",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>\"One last thing bro to complete the look.\"<br>\r\n\"Oh no, please not what I'm thinking sis. This goes to far.\"<br>\r\n\"But James. You know that I'm wearing a skirt and take a look at the lenght of your boxershorts. They would been seen.\"<br>\r\n\"But, this goes to far...\"<br>\r\n\"Please, Please, Please brother. I promise you that you must never again make me gifts.\"<br>\r\n\"Never again?\"<br>\r\n\"Promised bro\" she smiled happy.<br>\r\n\"Ok, so you want now to trade underwear. I'm right?\"<br>\r\n\"Your right. Do you do it?\"<br>\r\n\"But only till our parents came back. Promised?\" <i>Hopefully that was it.</i><br>\r\n\"Promised\" and once again Amy rushed up the stairs and switched the drawers of our wardrobes.<br>\r\n<br>\r\n\"Why did you switched two drawers?\"<br>\r\n\"My underwear needs two drawers that's all.\"<br>\r\n\"Allright, I don't wanna ask again and now?\"<br>\r\n\"What do you think we will do... we switch.\" Amy smiled bright and happy.<br>\r\n\"But please let us do it in the bathroom okay?\"<br>\r\n\"Like you say bro.\"<br>\r\n<br>\r\nSo the two walk in the barthroom. Amy under the shower behind the milky glass and James on the other side.<br>\r\nOnce again he drops the pants <a rel=\"nofollow\" href=\"http://content.yancor.de/product_images/danny_cotta_herren_jeans_maverick_9912__1400_1.jpg\" target=\"_blank\">http://content.yancor.de/product_images/...</a> but this time he handed them to his sister. Next he drops \"his\" tights to undress from his boxers <a rel=\"nofollow\" href=\"http://www.manupabouthealth.com/wp-content/uploads/2012/07/2094184.jpeg\" target=\"_blank\">http://www.manupabouthealth.com/wp-conte...</a> and handed them to his sister.<br>\r\nNow came the worst part for James. First he saw the skirt <a rel=\"nofollow\" href=\"http://www.chicas-boardshop.de/images/product_images/original_images/DC_Owen_Denim_Mini_Skirt_rdud_0.jpg\" target=\"_blank\">http://www.chicas-boardshop.de/images/pr...</a> he has to wear then he saws the rest <a rel=\"nofollow\" href=\"http://image.made-in-china.com/2f0j00HBiTmkZdSfcy/Fashion-Cotton-Silk-Embroider-Underwear-Printed-for-women-.jpg\" target=\"_blank\">http://image.made-in-china.com/2f0j00HBi...</a><br>\r\n\"Why your bra is here?\"<br>\r\n\"Easy thinking bro. It's part of my or better \"your\" underwaer and so you will have to wear it too.\"<br>\r\n\"Your right\" <i>I hope this stops it for now.</i> First he takes the thong <i>Why in hell she has to wear it today</i> and steps inside it. Unknow why but he likes the soft feeling of the material and was even more suprised that it fit fine. Next he put the tights back on, then the skirt and again he was suprised that he fit into it.<br>\r\n<br>\r\n\"Amy, could you help me at least with the bra? I don't know how to close it.\" and within a second she has done it. You put your shirt back on and leave the bathroom.<br>\r\nNow you standing there. Your lower half complete dressed in the clothes of your sister and vice versa and unknow why in a way you like it but in the other way it was very wrong to you.<br>\r\n\"So bro or should I call you sis now?\" your little sister laught.<br>\r\n\"Why...oohh understand.\" you laugh too.</span></div></div>",
            "created":1355461200,
            "id":1488134,
            "title":"Underwear time"
        },
        "11111":{
            "author_id":"kinect",
            "author_name":"Vortex",
            "choices":[
                "Now we go out and buy wigs",
                "Okay I think we are done "
            ],
            "content":"<div class=\"\"><div> <span>\"Okay Amy now what\"? You said. You looked up at your sister who had the most evilest smile on her face \"now we swap shirts\". WE WHAT! You yell at her and she says \"oh come on bro it will be fun\"you finnaly agree but only until mom and dad get home your sister gets so happy and then runs to her and picks out all her shirts and brings them to your room and takes all your shirts and takes them to her room when she gets back she says.....</span></div></div>",
            "created":1378011600,
            "id":1655332,
            "title":"Shirts"
        },
        "11112":{
            "author_id":"starbomber",
            "author_name":"starbomber",
            "choices":[
                "Amy want to trade more",
                "You want to trade the rest"
            ],
            "content":"<div class=\"\"><div> <span>\"So, we done now sis?\"<br>\r\n\"Hmmmmm... I think yes and I like it\" Amy smiled \"and I think I go up to my room and took a look at my new clothes\" and within a second she was in her room. \"Maybe you should do it to bro\" she screamed down.<br>\r\n<i>Maybe I should really do it and found something better to wear for myself</i> and so James walk up to his room.<br>\r\n<br>\r\nIt feels very different for him to wear a skirt and thights, not to mention the thong, but again in a way he likes it.<br>\r\nAs he reaches his room at first nothing seems different but then he saw his new shoes.<br>\r\n<i>Great, there was still something else but first out of these clothes</i> and James takes of his clothes <i>I don't want to be nude when I look for something better so, where is my pj?</i><br>\r\nHe found his upper part of his pj but the pants were gone <i>She even takes the pants of my pj? When she does something she does it properly. Maybe she put her pj's pants in the wardrobe or does she has one at all?</i> He take a quick look in his wardrobe but couldn't find one <i>Great, I have to clarify it later but now I close the louver</i>.<br>\r\nHe closed the louver and starts to take a look at his new underwear <i>They look pretty normal for a guy to wear</i> so he took the boy cut panties <a rel=\"nofollow\" href=\"http://www.ecofriendonline.com/prodimages/Cttnfield_BoyCut_350.jpg\" target=\"_blank\">http://www.ecofriendonline.com/prodimage...</a> and put them on.<br>\r\nNext he opened the wardrobe again and just reached in to take something to wear only to found out that he reached another skirt <a rel=\"nofollow\" href=\"http://www.prignitz-moden.de/bilder/produkte/gross/R.E.VintageCord5Pkt_GANT-Cordrock-RE-Vintage-Cord-5-PKT-Skirt-espresso-braun-brown-chocolat-online-kaufen-bestellen.png\" target=\"_blank\">http://www.prignitz-moden.de/bilder/prod...</a><br>\r\n<i>Great another one</i> he thought, put it back and reached in again but this time he was looking for pants and found a pair <a rel=\"nofollow\" href=\"http://www.evo.com/imgp/1500/62487/306665/levi-s-535-legging-red-tab-jeans-women-s-black-as-night-front.jpg\" target=\"_blank\">http://www.evo.com/imgp/1500/62487/30666...</a><br>\r\n<i>They look good lets put them on. Damm they thight but better than a skirt</i> he thought as he put on the pants <i>And now a pair of socks my feets get cold</i> and again he only reached in the drawer without looking.<br>\r\nSo he saw this pair <a rel=\"nofollow\" href=\"http://www.five-toesocks.com/photo/pl520439-summer_comfortable_mercerized_cotton_pink_ankle_socks_for_women_ladies.jpg\" target=\"_blank\">http://www.five-toesocks.com/photo/pl520...</a> in his hand<i> better than nothing</i> and so he put them on.<br>\r\n<i>It feels more normal than before the skirt, thights and at least the thong. Now I clarify the thing with the pj</i> so James walk to his sisters room.</span></div></div>",
            "created":1355547600,
            "id":1488805,
            "title":"Stop it for now"
        },
        "111122":{
            "author_id":"starbomber",
            "author_name":"starbomber",
            "choices":[
                "The day goes by without an interruption",
                "An interruption"
            ],
            "content":"<div class=\"\"><div> <span>James open the door to his sisters room and saw her relaxing on her bed with James baggy jeans <a rel=\"nofollow\" href=\"http://images.kapatcha.com/bilder/produkte/gross/Karl-Kani-Gothic-Inked-Baggy-Fit-Jeans-Indigo-Raw-Denim.jpg\" target=\"_blank\">http://images.kapatcha.com/bilder/produk...</a> on.<br>\r\n\"Hey sis...where is your pj or better the trousers of your pj?\"<br>\r\n\"I think here\" and she showed James his on pj trousers with a big smile.<br>\r\n\"I mean the trousers before we switch Amy.\"<br>\r\n\"I don't have any pj trouseres or even a pj. I only got nighties bro.\"<br>\r\n<i>Great</i> thought James <i>what now?</i><br>\r\n\"But if you want we can trade again. You get my shirts and I get yours. So you will have a pj again, also it would be this\" and Amy showed this <a rel=\"nofollow\" href=\"http://vanitykilledthecat.files.wordpress.com/2012/09/dscf4970.jpg\" target=\"_blank\">http://vanitykilledthecat.files.wordpres...</a> to James.<br>\r\n\"The only great thing about this is the color\" James pointed at the nightie. <i>If I agree, this won't stop. But I think I got an idea.</i> \"I want to suggest you something. You know that mom and dad will be away for at least two weeks and I say we would switch till our parants came back.\"<br>\r\n\"Yeah, you told so.\" Amy nods in agreement.<br>\r\n\"What would you say if I gave you the chance to switch all our clothes BUT then only for one week?\"<br>\r\nAmys eyes went wild open with every word James told.<br>\r\n\"That would you do?\"<br>\r\n\"Yeah\" <i>and I hope this stops it before it gets any worse. And I*m pretty sure I can hide for one week.</i><br>\r\nAnd once again, without even finish the word James say, Amy rushed between the rooms and switch everything she founded and once again, as she was finished, she want ro trade the rest James was wearing of his own stuff.<br>\r\nJames get the top Amy was wearing since the party <a rel=\"nofollow\" href=\"http://media.cdn.impericon.com/media/catalog/product/r/a/ragwear_kitten_blackjack_girltop_lg.jpg\" target=\"_blank\">http://media.cdn.impericon.com/media/cat...</a> and some ear clips <a rel=\"nofollow\" href=\"http://24.media.tumblr.com/c0ec9c5d667e14057e4eaa04c46fedec/tumblr_mj5kvqHqfi1s7sfjgo1_500.jpg.\" target=\"_blank\">http://24.media.tumblr.com/c0ec9c5d667e1...</a><br>\r\nAmy gets only James shirt <a rel=\"nofollow\" href=\"https://www.qwertee.com/images/mens-black.png\" target=\"_blank\">https://www.qwertee.com/images/mens-blac...</a> but was happy like anything or anywhere else.</span></div></div>",
            "created":1427691600,
            "id":1956281,
            "title":"You want to trade the rest"
        },
        "112":{
            "author_id":"reaveromega",
            "author_name":"mick",
            "choices":[
                "Amy's helps her brother put on her bra.",
                "Amy steals her brother's jeans in exchange for her own.",
                "James skips the bra for now and returns to his room.",
                "An interruption."
            ],
            "content":"<div class=\"\"><div> <span>\"Your boxers don't work with your new tights, we'll have to switch those too.\" Amy declared as James's face turned white.<br>\r\n\"No way, that's way too personal and the fit is totally different!\" James complained as he refused.<br>\r\n\"They'll stretch, please!\" Amy pouted and shot some puppy eyes at James.<br>\r\n\"This will be it, no more swapping after this and I'll get to call in one favor from you for whatever at any time.\" James reasoned.<br>\r\n\"Deal!\" Amy said as she rushed into both rooms and switched all of their underwear, but what James didn't account for, was he would have to wear her bra's.<br>\r\n<br>\r\n\"I'm not wearing your bra's!\" James yelled as Amy was switching the drawers.<br>\r\n\"It's part of my underwear and you agreed.\" Amy responded as she stuck her tongue out.<br>\r\n\"Fine.\" James grumbled annoyed.<br>\r\n\"One more thing.\" Amy winked and James knew exactly what she meant and nodded.<br>\r\n<br>\r\nThey turned their backs to each other and quickly took off their jeans and drop their underwear. James kicks his boxers backwards towards his sister as he sees some cotton panties appearing before him. He picked up the small cotton panties and pulled them over his legs. Once finally pulled up he immediately noticed the tightness grip him, very unlike he was used to.<br>\r\n<br>\r\nAmy on the other hand was enjoying her new boxers, they fit her surprisingly well. She reveled in the feeling on the new looser gray boxers as she took a peek at her brother, now tightly packaged in her tight undies, she couldn't help but let out a giggle as her brother struggled putting the tights back on.</span></div></div>",
            "created":1555453020,
            "id":2645566,
            "title":"Underwear"
        },
        "1122":{
            "choices":[
                "Amy tries on more of his clothes",
                "Amy steals his boxers",
                "She leaves the room to show James"
            ],
            "content":"<div class=\"\"><div> <span>Amy, feeling mischievous, decided to keep going with the swapping. Maybe it was the boxers that were making her feel this confident. Either way she decided they should swap jeans too. \"Your boxers are comfy but if we're wearing each other's underwear, shouldn't we switch jeans too? .\" Amy asked as James's face blushed.<br>\r\n\"How are you still going? I feel like you've asked for way too much today?\" There's not a chance that's happening.\" James replied firmly. Though standing in the tights and underwear, he didn't make his point as well. <br>\r\n\"Alright, fine. At least I got your boxers. They're very comfortable.\" Amy laughed as she stood around. Afterwards they both tried to move on with their normal, if somewhat strange day. Amy had a plan to raid James' closet later while he was busy. <br>\r\n<br>\r\nJames was pre-occupied and not paying attention when she snuck past him into his messy room. It had clothes scattered all over the place, alongside his characteristic unmade bed. She went over to his closet to take the jeans. They seemed baggy and had a few tears, but actually way cooler than her current jeans. She took them off the hanger and put them on over the boxers she was wearing. When she pulled them up the fabric of the boxers bunched up and spilled out at the top. The jeans hung loose on her after she adjusted the boxers underneath, but James didn't wear a belt and she wouldn't either. She couldn't help but smile as she walked around the room sagging and was going to go show James, but before that she:</span></div></div>",
            "created":1563906060,
            "id":2691089,
            "title":"Amy steals her brother's jeans in exchange ..."
        },
        "12":{
            "author_id":"megafan7790",
            "author_name":"MegaFan",
            "choices":[
                "Try out your new shoes.",
                "Maybe go out somewhere?",
                "Your sister suddenly bursts back in wanting to trade again!",
                "Maybe you can just stay around the house for a while...",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now that your sister and you have switched shoes what are you going to do now?</span></div></span></div>",
            "created":1488776400,
            "id":2285851,
            "title":"What to do now?"
        },
        "121":{
            "author_id":"tjboomer83",
            "author_name":"tjboomer83",
            "choices":[
                "Yes trades leg wear with her.",
                "No just need more practice.",
                "An interruption"
            ],
            "content":"<div class=\"\"><div> <span>-------Kitchen------<br>\r\n<br>\r\nJames walked to his room at the other end of the house well wearing his sisters flats and leggings. But on his way there he tripped on his Pants. His sister started to laugh and poke fun of him for falling down.<br>\r\n<br>\r\n\"Well James maybe you should be using one of the heeled shoes as to not trip on your pants\" Amy said with a smile on her face. If she played her cards right she may be able to trade even more clothing with him. James just got up and started to walk again only to trip one more time.<br>\r\n<br>\r\nJames though that maybe she was right and something a little bit taller would help keep him from tripping. So as he finally made it to his room he looked at the shoes that where given to him. Placing the flats in his closet next to his other new shoes James grabbed the 160 mm pumps (V<a rel=\"nofollow\" href=\"http://www.toppack4u.com/womens-zoulou-black-160mm-leather-platform-pumps-p-927.html\" target=\"_blank\">http://www.toppack4u.com/womens-zoulou-b...</a>). they where the tallest of the Pairs and his pant legs with the flats went under his foot half way some how. <br>\r\n<br>\r\nJames sat on the bed and looked at the shoes in hand. He then Place them on his feet and they felt really comfortable. He zipped up the back to hold them in place and started to walk across the room only to fall backwards on to his bed. From the look of it even with the tall heel his pants still got caught. He would need to do something about that if he was going to be wearing these pumps for at least the next  week that is when he looked up and saw his sister standing in the door with a smile on her face.<br>\r\n<br>\r\n-----kitchen after James left------<br>\r\nAmy could only smile to herself as she looked at James. His old sneakers had a back to catch the pants now he would have to trade for her skirts, short shorts, and her skinny jeans. Amy waited for some time before she followed James. She peeked through the door and saw him zip up the 160 mm pumps. Even with them his pants got caught on his new shoe. She pushed the door open and walked in on her brother. She helped him up from the bed and lead him to her room across fro his. Amy told James to sit on her bed and pick up on leg rolling up the pants leg so it would look like it would not get caught under the pump. Amy did the other leg after that and had him start walking around her room. James had finally some what gotten walking in his new shoes. that is until his pants legs unrolled and he fell right on the floor again. <br>\r\n<br>\r\nAmy started to say\" I think we need to trade Leg wear brother\". Jame was shaking his head...</span></div></div>",
            "created":1525669200,
            "id":2489818,
            "title":"Try out your new shoes."
        },
        "1211":{
            "choices":[
                "Amy wants to swap underwear too",
                "James explores his new clothes",
                "They are interrupted "
            ],
            "content":"<div class=\"\"><div> <span>James was shaking his head about the idea of swapping bottoms but you knew that your jeans would keep getting caught and tripping you unlike with your old shoes so you just nod your head <br>\r\n<br>\r\nAmy was so happy about you agreeing that she rushed towards her drawers and closet and grabbed all her pants, shorts and skirts then ran to your room and removed your shorts and pants from your drawers and closet then placed her clothes in their place and moved your clothes into her room<br>\r\n<br>\r\nFinally Amy looked at James and he knew what she wanted so standing back to back so as not to see each other he takes off his beige khaki jeans (<a rel=\"nofollow\" href=\"https://scene7.zumiez.com/is/image/zumiez/pdp_hero/Free-World-Night-Train-Khaki-Jeans-_289102-back-US.jpg\" target=\"_blank\">https://scene7.zumiez.com/is/image/zumie...</a>) and she takes them then hands him her color block high waisted mini skirt (<a rel=\"nofollow\" href=\"https://media.dollskill.com/media/NwSaeIiuKulNFcZFLg8DNgULH28Ow6dP-34.jpg\" target=\"_blank\">https://media.dollskill.com/media/NwSaeI...</a>)<br>\r\n<br>\r\nJames cringes as he puts on the mini skirt then turns and sees Amy in his khaki jeans smiling brightly at you<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1563942480,
            "id":2691308,
            "title":"Yes trades leg wear with her."
        },
        "1212":{
            "author_id":"tjboomer83",
            "author_name":"tjboomer83",
            "choices":[
                "Well i don't think those shirts go with your new skirts",
                "Amy wait's for the exact moment to swap some more",
                "interruption to the next swap"
            ],
            "content":"<div class=\"\"><div> <span>\"No i just need a little more practice with my new shoes\" James said. <br>\r\n<br>\r\nAmy just looked at him and shook her head. Let him think that but even with practice nothing would come of it. His pants just hang to low on him and will always get stuck under those heels. Amy left her bothers room for the night. It was time for bed and a shower.<br>\r\n<br>\r\nAs Amy head for the shower she put her skirt in her brothers door way so it was in his line of sight.  James continued to walk in his new heels. At this point he just took his pants off and was walking around in just his underwear and socks. He was getting better at this with out the pants on. It was then that he noticed the skirt in his door way. Well if he could not wear his pants then better to leave the room in something other then his underwear. He slowly pulled the skirt up his legs and it felt very comfortable around his waist (<a rel=\"nofollow\" href=\"https://www.ebay.com/itm/Sexy-Womens-Schoolgirl-Cosplay-Plaid-Super-Mini-Short-Skirt-Sleepwear-Costumes-/172739388178\" target=\"_blank\">https://www.ebay.com/itm/Sexy-Womens-Sch...</a>). But then some cold air from the vent came and hit him. That was it he needed something longer to keep from getting cold. <br>\r\n<br>\r\nSo James went across the hall to Amy's room and started to look thru her skirts for something a little longer. James throw four or five different skirts on the bed before he started to look at them. Most where just above his knees and where pink.  The only long one he found was a pencil skirt that look like it would keep him some what warm but would make walking a little harder. (<a rel=\"nofollow\" href=\"https://images.windsorstore.com/images/products/1_389106_ZM_FUCHSIA\" target=\"_blank\">https://images.windsorstore.com/images/p...</a>).  But it was this or a micro skirt (<a rel=\"nofollow\" href=\"https://www.aliexpress.com/item/Blue-Black-Gold-Silver-Rose-Red-5-Colors-Sexy-Luminous-Miniskirt-Women-Metallic-Faux-Leather-Pleated/32376742940.html\" target=\"_blank\">https://www.aliexpress.com/item/Blue-Bla...</a>) and he really did not want to wear that. So he start to put on the pencil skirt when he heard an laugh coming from the door way. It was Amy and she was wearing his pants from right before. Her hair was wet so she had just gotten done with the shower.  <br>\r\n<br>\r\n\"Well looks like i was right. why don't you start taking your new skirts to your room. Oh and well where at it you should also take the socks and panties as well\" Amy said. James just looked at her in shock. Amy walked over and hand him the panties that she had worn up till her shower a few minutes ago. She then held out her hands waiting for something which James realized was the boxers he had on. Pulling the skirt up and pulling his boxers down he handed them to Amy who slipped the off the pants and put on the boxers and then pulled the pants back up. <br>\r\n<br>\r\n\"Wow know wonder guys like to wear boxer they are so much more comfortable then panties. But you will soon know that\" Amy said. James pulled the panties up and let the skirt fall back down into place. He started to leave when his sister pointed at the drawers that where now his. She helped him to take and place all his new skirts panties and socks in the drawer in his room. Then both started to move Amy's new pants boxers and socks to her room. </span></div></div>",
            "created":1527448500,
            "id":2499441,
            "title":"No just need more practice."
        },
        "12121":{
            "author_id":"mickgratton57",
            "author_name":"Spider1957",
            "choices":[
                "Amy passes him the rest of her uniform",
                "They are interrupted by a knock at the door"
            ],
            "content":"<div class=\"\"><div> <span>James was beginning to accept his role although whilst partly excited he was also fearful, he should be able to stand up to his younger sister but as if in a trance he felt that he had to do as she bade,<br>\r\nJames went upstairs closely followed by Amy, “hey sis” she said “you need to put on a blouse that matches your skirt,”<br>\r\nAmy threw a white school blouse to James which he put on, he looked at himself in the full length mirror &amp; couldn’t help thinking something was missing.</span></div></div>",
            "created":1559912460,
            "id":2669981,
            "title":"Well i don't think those shirts go with you..."
        },
        "12122":{
            "author_id":"tjboomer83",
            "author_name":"tjboomer83",
            "choices":[
                "Amy gets him to swap for the last of her items",
                "Slow but stead wins the race a permanent swap is in the works not by Amy.",
                " interruption to the next swap"
            ],
            "content":"<div class=\"\"><div> <span>It was a moment of truth for Amy she wanted every thing from her brother. Or maybe she should say sister because James had just under half of the female clothing in the house. James was also starting to take to the girl roll to his walk was more like a girls then hers ever was which kind of wanted to make her laugh a bit. <br>\r\n<br>\r\nIt had been two day since the last trade and everything was going well for her. But she want more She need the shirts and hair items that went with her new clothing. but how to do it. That was when she had a flash of inspiration.first she need to get him in a bra then the shirts would come after that. So as James was sleeping she took the breast forms that her mother had gotten for her and place them on James chest and added some lite tape to hold them in place.<br>\r\n<br>\r\n\"Great part one good to go\" Amy said. This part would take a few more night to get right. With any hope the new breast he had acquired would force him to sleep in a different position and then James would seek help with his new addition which would come off before James woke up. This would make James feel like his chest was getting bigger and may need support Amy would then trade for Her bras and shirts for James Shirts.<br>\r\n<br>\r\nBoy was she right James had could feel his chest get bigger He was emmbarased to ask about it.<br>\r\n<br>\r\n\"Amy i Need so help. It feels like my chest is getting heavier each day. Can you help me out\" James asked. Amy smiled and told him to sit on the bed. She then told him to take off is shirt. Amy then hand him a bra. <br>\r\n<br>\r\n\"Well this should help out but you need to trade me something for it them\" Amy said. James look down and knew he had very little left to trade with his sister.<br>\r\n<br>\r\n\"What do you want then sister.\" James asked.<br>\r\n<br>\r\n\"How about if i give you the bras and shirts for your shirts. That seems fair to me\" Amy said. Jame walk across the hall still half naked and started to bring his shirts into the room. Amy took all her Bras and shirts and brought them to James room. James was putting on the bra or at least trying to when Amy stopped him.<br>\r\n<br>\r\n\"First slide one arm in the loop then the other after that. then grab the clips on the sides and bring them together.\" Amy said<br>\r\nJames did just that. It took a few tries but he so got it. But he looked down and felt it was a little to empty.<br>\r\n<br>\r\n\"OK my chest feels somewhat better but now look the bra feels empty what should we do\" James asked. Amy went to the closet to get the breast forms out then place a little glue on them and stuffed them into the bra.<br>\r\n<br>\r\n\" There that should feel better and look better right\" Amy said with a smile on her face. James just nodded. He went to his room and got a shirt out from his new stuff. Amy closed the door and started to jump for joy. She now had almost everything. She just needed to get his hats and shades. For that trade she would give him the makeup and hair items she had. But she only had a few more weeks to finish the trades.<br>\r\n<br>\r\n<br>\r\nHow to do it....</span></div></div>",
            "created":1534569540,
            "id":2535058,
            "title":"Amy wait's for the exact moment to swap som..."
        },
        "121221":{
            "author_id":"tjboomer83",
            "author_name":"tjboomer83",
            "choices":[
                "The parents come home and like what they see",
                "James trys to stand up for himself",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>At the start of the trades Amy had also come to consider how to deal with getting him to where makeup and do his hair. So she replace his shampoo with one that helped hair grow. It would take a few weeks but in the end everything would go fine.<br>\r\n<br>\r\nIt had been 3 weeks since the start and James was having a bit of trouble now. It seemed that his hair was growing at a fast rate. He would need to get it cut and soon. Till then he would have to make do with hair that went down past his shoulders. Maybe his sister could help him out with this.<br>\r\n<br>\r\nJames first need to get dressed. putting on his panties and socks first then he put on one of his new longer skirts. he still could not get use to this. The shirt was next and pulled tight across his new chest with the words girl power on it. He then left to his sisters room. He approached and knock on the shut door. <br>\r\n<br>\r\n\"What do you need now Sis\" Said Amy. James still did not like that Amy would say that.<br>\r\n<br>\r\n\"I need some help with my Hair. It gotten really long over the weeks. Can i come in and we can talk\" James asked. Amy smiled and opened the door. The sight James saw was Amy with a short buzz cut.<br>\r\n<br>\r\n\"What happened to your hair mom is going to throw a fit\" James yelled.<br>\r\n<br>\r\n\"Well I though that since mom always say only one of us can have short hair and all. You where growing yours out so i could do this i though\" Amy said. James did remember there mom saying something like that. Ok so that could cause a problem.<br>\r\n<br>\r\n\"Oh i called mom and asked her if it was ok since you where growing yours. She said yes and to make sure you see it i had her text your and my phone see\" Amy said well holding up the phone. James was shocked.<br>\r\n<br>\r\n\"I really need to sit down Amy\" James said. Amy lead James over to the vanity that held all her hair and makeup supplies and sat him on the small chair that was their. James still in shock did not notice that Amy started to pull his hair back into a pony tail and leave it there. Of course James shock came to an end and he looked pleased for the help.<br>\r\n<br>\r\n\"Amy thank you for doing this without trading anything\" James said in a soft voice. <br>\r\n<br>\r\n\"Oh that not true I am doing this for something your clothing for your face and head\" Amy said. James could not think of what happened now.<br>\r\n<br>\r\n\"Now hold still I need to do your makeup and get you looking ready for a night at the movies\" Amy said. From off the vanity Amy took brush and some blush and added it to his face lightly. She then added eye shadow. Last was a tube of pink lip stick that she put on him. She then went to her closet and pulled out what appeared to be a gun. James had seen this before it was the piercing gun that Amy and his mom used when they need to redo the erring holes. She place it up to his right ear.<br>\r\n<br>\r\n\"Hold still this will sting\" Amy said as she pulled the trigger. It did hurt and she was putting it up to his left ear now. She pulled the trigger once again and he felt the pain.she then placed some loop earring in the new holes. She then put the gun away and started to pack up all the stuff on the vanity. He now knew that it would be his stuff for the time begin. Amy move it to his room and place in around.<br>\r\n<br>\r\nAs James stood up he looked in his sister full length mirror and found that he looked just like her. He would need to do something about this and now.</span></div></div>",
            "created":1551566820,
            "id":2625519,
            "title":"Amy gets him to swap for the last of her items"
        },
        "1212211":{
            "author_id":"tjboomer83",
            "author_name":"tjboomer83",
            "choices":[
                "A permenet change of gender is on its way",
                "stop mom and dad where just joking",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>James still had a week before his parents came home to fix everything that was going on. But first he needed to get dressed and since his sister had locked the door to her (or was it His room) he could not get any of the clothing that was needed for him to go outside and sort it everything out. <br>\r\n<br>\r\nJames decided he would put on something that would let him move fast. A very sort skirt and a nice tight tube top.You may be wondering why he is wearing this. Well it come down these were the last of his new clothes before he did his Landry.  All his sandals and flip flops had broken so it was high heels for him as well. He really need to get some new shoes now.<br>\r\n<br>\r\nJames made his way down stairs to the kitchen where his sister was having breakfast.<br>\r\n<br>\r\n\"Well sis you clean up very nice. but that outfit is a little slutty if you ask me\" Amy responded. James just sat down and started to eat the eggs that were made for him. As the two were eating the sound of a car pulling up the driveway was missed by both of them.<br>\r\n<br>\r\nThe parents wanted to surprise both children with coming home early. So when the front door was open and mom walked thru in heel clicking against the wooden floor the two stopped and stared. Mom came into the kitchen and greeted both children.<br>\r\n<br>\r\n\"Amy is that the outfit you are going to wear today it looks like you are a slut. An James why did you not tell her to change\" their mother said to the two. Amy could only laugh at what had been said to James. <br>\r\n<br>\r\n\"Mom i already told her the same thing but that is all she has left to wear this week she did not do her landry yet\" Amy said. Still laughing and her mother shaking her head. There father came in and he said the same thing. Amy was getting really annoying about this James though.<br>\r\n<br>\r\n\"Mom and Dad you have it wrong I am James and that is Amy sitting over there\" James said. Their mother looked upset with this.<br>\r\n<br>\r\n\"Don't you think that is a bad joke Amy. Well prove it to use then Amy\" Mom said. James started to take of the skirt and panties that any male would have. Amy just stared at it with thoughs that she needed to have that as well. If she did then she could really take over as James.<br>\r\n<br>\r\nMom and Dad were confused what was going on hear. James started to tell the story and finish about an hour later.<br>\r\n<br>\r\n\"Well James that was a good story. But why did you not stop it sooner.  I think from that story you actually wanted this to happen\" Dad said with a smirk on his face.<br>\r\n<br>\r\n\"Yes it seems that you will make a better daughter then you have a son. I mean even i could not tell the two of you apart you were so into the role. I really think that we should make this a permanent thing\" mom said. With dad and Amy shaking their heads in agreement.</span></div></div>",
            "created":1554164880,
            "id":2638289,
            "title":"The parents come home and like what they see"
        },
        "12122111":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "choices":[
                "James wants tongo back to being a boy",
                "Time skip"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After all the paperwork is done, Jamie is now looking forward to the crotch transplant. They have to wait until Adam turns 18 in another 3 years.</span></div></span></div>",
            "created":1578462060,
            "id":2770896,
            "title":"A permenet change of gender is on its way"
        },
        "121221112":{
            "author_id":"hallens25",
            "author_name":"Hallens25",
            "content":"<div class=\"\"><div> <span>It is the 10th anniversary of the Game amy played on James and now they couldnt be happier. On occasion Jamie will ask to borrow her brother's clothes but goes back to her beloved girly clothes within a few minutes. She's too small to fit Adams wardrobe but they like to keep the tradition alive. All that will stop when Jamie moves in with her Soon to be husband tomorrow. Looking to the future, Jamie is excited because her groom and her are the same size.</span></div></div>",
            "created":1578462360,
            "id":2770898,
            "title":"Time skip"
        },
        "124":{
            "choices":[
                "Do some housework ",
                "Play some video games ",
                "Look around your sisters room"
            ],
            "content":"<div class=\"\"><div> <span>After you and your sister have moved all of her shoes into your room as moving your socks into her room and then moving her socks, stockings and tights from her room to yours. <br>\r\n<br>\r\nYou didn’t know what to do you looked around to find something to do and your sister just went to the mall with her friend ten minutes after moving your stuff around leaving you by yourself. <br>\r\n<br>\r\nThere was nothing interesting on tv so you didn’t know what to to do you pace around your room trying to figure out what to do next. <br>\r\n<br>\r\nEventually you decided to</span></div></div>",
            "created":1540193460,
            "id":2567006,
            "title":"Maybe you can just stay around the house for a ..."
        },
        "1243":{
            "choices":[
                "Try on some of her clothes ",
                "Take your old stuff back",
                "Leave her room and do something else "
            ],
            "content":"<div class=\"\"><div> <span>As your sister was out you decided with nothing else to do to look around your sisters room as you are doing that you see your old shoes and look at your old socks sitting in her underwear draw making you miss your old stuff<br>\r\n<br>\r\nThen you look around at her clothes in her drawers and closet then after looking around for some time you decide to</span></div></div>",
            "created":1563932580,
            "id":2691258,
            "title":"Look around your sisters room"
        },
        "13":{
            "author_id":"starbomber",
            "author_name":"starbomber",
            "choices":[
                "Your aunt want to eat at a fancy restaurant",
                "One of your friends came to play",
                "Your parents return",
                "Readers choice",
                "Readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of interruption?</span></div></span></div>",
            "created":1355893200,
            "id":1491137,
            "title":"An interruption"
        },
        "131":{
            "choices":[
                "Get ready for tonight ",
                "Sister wants to swap clothes ",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>After you and your sister swapped your clothes and moved the shoes and socks from your room and the shoes, socks, stockings and tights from your sisters room. <br>\r\n<br>\r\nYou hear a knock on the front door and you headed downstairs then opened the front door and saw your aunt there<br>\r\n<br>\r\nShe says “James since your mom and dad are away for a while I decided to take you and Amy out to a fancy restaurant tonight so make sure your ready for tonight and also remember to put on some formal clothes, I’ll be back at seven to pick you both up so be ready by then”<br>\r\n<br>\r\n“Okay see you later and we will be ready by then” you return and your aunt leaves to get ready so you tell your sister<br>\r\n</span></div></div>",
            "created":1563937620,
            "id":2691275,
            "title":"Your aunt want to eat at a fancy restaurant"
        },
        "1312":{
            "author_id":"hugo9o9",
            "author_name":"Hugo9o9",
            "choices":[
                "In the nigth",
                "James wants a new swap"
            ],
            "content":"<div class=\"\"><div> <span>Amy, we have to prepare for an elegant dinner tonight, you have to wear something formal. Then Amy comes up with something ... <br>\r\nAmy: I think that these shoes do not look good with any dress I have, we will make another change, I give you my dresses and you give me your pants and shirts, so my new shoes will agree with my outfit !! James: I'm not kidding, I'm not going to an elegant dinner wearing a dress, in fact I don't want to wear these shoes either, it's embarrassing. <br>\r\nAmy: please James! If you make this change I will do all the duties of the house until the holidays are over. How about? James: I don't know, well that's fine, we'll explain to my aunt that it's a challenge, all my friends are out of the country and nobody will see me dressed like that. <br>\r\nAmy: yeeeei !!! I'm going to change our outfits, and I'll take a shower later. <br>\r\nJames: very good Amy, whatever you say.<br>\r\nAmy exchanges all her brother's elegant clothes with all her dresses ... Then he goes to bathe and while taking a shower he has another idea. When leaving the bathroom he goes to James's room and steals some boxers and puts them on. Amy: wooow these are very very comfortable, they do not squeeze so much, in addition they will not be noticed with my new elegant pants. <br>\r\n(James enters his room) <br>\r\nJames: what are you doing? why do you have my boxers, take them off.<br>\r\nAmy: Okay, I'll take them off, (Amy leaves them in their place) I didn't ask for your permission, I'm sorry, but if I wear my panties, they'll show up with my pants, please change them, they have to look good. <br>\r\nJames: Okay (James accepts fast since he was always curious to feel what it was like to wear a girl's underwear) <br>\r\nAmy: great !!! Turn around and give me those you have on, I will give you the ones I was wearing before taking a shower and I hope you take a shower soon, because I have been wearing these panties since yesterday (Amy looks at James pervertedly) <br>\r\nThen James turns, takes off his pants and gives the boxers to Amy and then receives the underwear that Amy had before bathing. James sees his new panties, they are pink, with stars, they have lace at the edges and a nice bun at the top. First put one foot and then the other and slowly go up the panties <br>\r\nJames: wow, what a soft fabric, they fit me very well! (James thinks surprised and looks at his panties a little), They are a little sweaty and it shows that you have used them since yesterday, I better get to bathe. <br>\r\nAmy: You look great James, enjoy your new panties, I'm going to change all our underwear (leaves the room and spanks James).</span></div></div>",
            "created":1572816960,
            "id":2741884,
            "title":"Sister wants to swap clothes "
        },
        "14":{
            "author_id":"hugo9o9",
            "author_name":"Hugo9o9",
            "choices":[
                "Swap jeans",
                "Swap shirts",
                "James follow the game"
            ],
            "content":"<div class=\"\"><div> <span>Amy, start thinking that you would most like to change with your brother, but don't decide yet, then go to your room and put on the james shoes you like best. Amy goes to James's room and says \"how do I see my new shoes, the truth is that they fascinate me, although I know they look good, I'm glad we are the same size, and you know you too my flats look very pretty, in fact I think they look prettier than me. \" James with a face of anguish says \"I do not think they look as good as you say and less with these means that make me feel ridiculous, besides all your shoes set very used, and more these floors, you have so many pairs and I do not know how you do to wear them down so much, but what does it matter, as long as you don't bother it is ok \" Amy smiles and says \"I think we are ready for another change\"</span></div></div>",
            "created":1570596360,
            "id":2730338,
            "title":"Probando zapatos"
        }
    },
    "info":{
        "author_id":"starbomber",
        "author_name":"starbomber",
        "brief_description":"A normal day for you till your sister has an idea that change your life",
        "created":1355500380,
        "description":"<td align=\"left\" class=\"norm\">Inspired by these story: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://herrothar.deviantart.com/gallery/#/d4mwgax\" target=\"_blank\">http://herrothar.deviantart.com/gallery/#/d4mwgax</a><br>\r\n<br>\r\nYou and your sister are at home and do your normal tasks.<br>\r\nLater that evening your sister do something that change at first your day, later your life.<br>\r\n<br>\r\nCharacters:<br>\r\nYou: James, a normal 16 year old guy who starting to reach puberty late (what a fun for his sister)<br>\r\nSister: Amy, your 15 year old sister. Has a lot of fun that she reach your size through puberty<br>\r\n<br>\r\nPlease no sex and/or killing.</td>",
        "id":1908465,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1578462360,
        "modified":1578462360,
        "pretty_title":"Game of a Sister"
    }
}