{
    "chapters":{
        "1":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "\"Nah, lets check this wierd thing out a bit first\"",
                "\"Sure, he's only a block away anyways\"",
                "Let's head for the park (put belt on to carry it)",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You (Jay) and your friend Denise are out walking when you decide to check out a garage sale. There's the usual assortment of knick knacks and musty old clothes, along with a few mildly amusing items that you both briefly play with. Like the WWII era helmet and the nurse hat, the hula hoop, the chair that immediately breaks. You quickly look back and forth before quietly walking away from it, as Denise looks on with a smirk. <br>\r\nDenise is ready to go, holding a large red wig over her long brown hair, when you notice a funky looking belt. It looks like something out of Star Wars, and think you're buddy Aj would love it, as hes a huge star wars fan. <br>\r\n<br>\r\nAs you pay the old man sitting out front, he smiles, and says \"Thats a quality belt there, treat it well.\" <br>\r\n<br>\r\n\"Ummm, sure man.\"<br>\r\n<br>\r\nYou and Denise walk off, and she asks, \"Do you wanna go give that belt to Aj now, or you wanna keep walking?\"<br>\r\n<br>\r\nYou say...</span></div></div>",
            "created":1199250000,
            "id":533666,
            "title":"Finding a belt..."
        },
        "11":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Oooh, a shiny red button! Time to press it.",
                "Ok, this thing is stupid, time to take it off and give to Aj"
            ],
            "content":"<div class=\"\"><div> <span>You put the belt on and start fiddling with the half dozen knobs. \"Hey,\" you say, \"theres even a Knob with the year on it!\"<br>\r\n\"Prolly so the old geezer didn't forget which century he was in.\" Denise says and starts to laugh. \"Whats this thing here, looks like it comes off.\"<br>\r\nYou grab one of the disks on the side of the belt, and sure enough it pops right off. A latch releases and a velcro strap comes out. \"It even comes with some special bracelets! Here, don't say I never got you nothing.\"<br>\r\n\"Oh whoopie, just what I always wanted! A bracelet to match your wierd belt,\" replies Denise sarcastically. Though she still puts on the bracelet. <br>\r\nYou've checked out the belt, and fiddled with everything except the red button on the center...</span></div></div>",
            "created":1199250000,
            "id":522504,
            "title":"Examining the belt"
        },
        "111":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "What happened?"
            ],
            "content":"<div class=\"\"><div> <span>You press the button... and nothing happens. You press again... and still nothing happens. \"Well thats anti-climactic,\" you say. You take off the belt and just as you are about to put it in your bag you notice a little panel on the inside. Its a space for batteries!<br>\r\n<br>\r\n\"Well DUH!\" says Denise. \"If its gonna light up and do anything you gotta have power, dork.\"<br>\r\n <br>\r\nYou and Denise both have a quick laugh before she takes a battery out of her pocket. You insert the battery and put the belt back on. \"Ok, here goes!\" You press down the button again...and there's a bright flash of light! <br>\r\n<br>\r\nThe last thing you remember before you pass out is Denise yelping as she's startled by the light...</span></div></div>",
            "created":1199250000,
            "id":482291,
            "title":"Oooh, a shiny red button! Time to press it."
        },
        "1111":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "You set the dial back to your year",
                "You just quickly turned the dial to go anywhere else",
                "Malfunction!"
            ],
            "content":"<div class=\"\"><div> <span>You awaken to Denise shaking you and yelling in your ear \"WAKE UP!\"<br>\r\n<br>\r\nYou open your eyes to see her standing over you, hands on your shoulders. \"What happened?\" you ask her. <br>\r\n<br>\r\n\"I don't know, but I just woke up and now we're in this forest.\"<br>\r\n<br>\r\nYou get up and quickly survey your surroundings. Just like she said, you're in a sparse forest. Suddenly you both hear a trumpet sounding a military trumpet call a ways off to your left. \"Well,\" you say, \"at least there's people that way. Let's go.\"<br>\r\n<br>\r\nYou both start walking and after a minute arrive at the edge of the forest and are the top of a hill. Looking down you see what looks like a column of men in old military dress open fire on several people on horses. As you watch you realize the people falling off the horses aren't doing some war reenactment, they really are dieing! Denise realizes it at the same time and clutches your arm in horror. <br>\r\n<br>\r\nAs the last remaining Indians ride off on the horses, you look down at the belt and notice the year is set on 1875. You time traveled to 1875!<br>\r\n<br>\r\nYou realize you've been spotted by the soldiers as they start moving in your direction, and you decide it might be better to get out of here. You turn the dial and press the red button and see another bright flash of light!</span></div></div>",
            "created":1199250000,
            "id":489443,
            "title":"What happened?"
        },
        "11111":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "You're both suddenly in what appears to be a dense jungle",
                "Chameleon effect"
            ],
            "content":"<div class=\"\"><div> <span>You set the dial back to the present and press the red button. A flash of bright light and suddenly you're back to your own time. <br>\r\nBut where's Denise? Uh oh...<br>\r\nYou're about to yell for her when you hear a loud clanging sound, and hear Denise say ouch. Where is she?<br>\r\n\"Denise?\" you tentatively call. She responds momentarily with an \"Over here!\" She's inside the garage you're standing next to. Right about where she was standing when you left 1875. <br>\r\n\"Nice landing girl.\"<br>\r\n\"Shut up loser. It ain't easy going from a forest to someones garage!\"<br>\r\n\"You're the only loser I see here, you lost your footing!\"<br>\r\n\"Oh haha, funny guy, funny guy. Now that we're not being shot at, what else can that belt do?\"<br>\r\n\"Ummm, lets see, theres the time traveling controls on this side. And on this side looks like something else. What do you make of them\" you ask.<br>\r\nDenise kneels down and starts turning one of the dials. \"Only one way to find out!\" she says, as she quickly presses the button.</span></div></div>",
            "created":1199595600,
            "id":495736,
            "title":"No longer behind the times"
        },
        "111111":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "What now?"
            ],
            "content":"<div class=\"\"><div> <span>You look around at your new surroundings, thought you have no idea where you are. \"Denise?\" you call out.<br>\r\n\"I'm coming!\" you hear her yell back. She comes running out of the wierd trees and is soon back with you. \"Any idea where we are now?\"<br>\r\n\"Don't know,\" you reply, \"but lets check it out.\"<br>\r\nYou both start walking, and suddenly you realize you seem very light. <br>\r\n\"Do you feel kinda light too?\" you ask Denise.<br>\r\n\"Yeah, kinda.\"<br>\r\nHmm, wonder how high I can jump you think. You jump and are suddenly at the tip of the wierd trees. You've easily jumped to twice your current height. And you know where you are. <br>\r\n\"We're still outside that garage,\" you quickly tell Denise. \"We've shrunken.\"<br>\r\n\"What?\" replies Denise<br>\r\nYou look at the belt and see the dials she turned. the first has a zero, while the second has a 1 on it. \"We must be one inch tall.\" <br>\r\n</span></div></div>",
            "created":1199768400,
            "id":485075,
            "title":"Tiny!"
        },
        "1111111":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Sizing up the area",
                "No time like another time!"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok, so let me get this straight,\" starts Denise. \"That belt can actually make us travel through time... AND change our size? But you're the one wearing it. Why is it bringing me along?\"<br>\r\n\"Yeah, I was wondering about that too, but you're wearing the bracelet thing so that must be pulling you along too.\" you reply. <br>\r\n\"Oh yeah! Duuuhhhh! Well now, we could go anywhere, do almost anything. What's next on the docket?\"<br>\r\nThats a good question. You could play around more with the size features, or you could go nearly anywhere in time. Which do you want to do first?</span></div></div>",
            "created":1200546000,
            "id":487957,
            "title":"What now?"
        },
        "11111111":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "A spying we will go",
                "Max headroom at the theater"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok,\" you start off, \"lets get experimenting with the size features!\" <br>\r\n\"Sweeeeeet!\" Denise exclaims, clapping her hands in excitement. \"So do we go spy on people from a tiny perspective or get big and intimidate people? My roommate is going to a party tonight, or we could just sit as giants in front of people at the movie theater. There is that new Scifi movie opening tonight thats supposed to be packed.<br>\r\n<br>\r\n\"Hmm, those sound better than my ideas! Let's do it!\"<br>\r\n</span></div></div>",
            "created":1200546000,
            "id":489970,
            "title":"Sizing up the area"
        },
        "111111111":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "The purse is on the couch alone",
                "The purse ain't there, but Katie is!"
            ],
            "content":"<div class=\"\"><div> <span>You and Denise make your way over to her house, but just as you arrive Katie is leaving with her friend Jamie for the party. Seeing Katie get into Jamie's car, Denise looks crestfallen that you guys missed your chance.\"Well that sucks.\" she says. \"Guess me gotta find other people to spy on then.\"<br>\r\n<br>\r\n\"No we don't,\" You reply. \"We just have to go back about twenty minutes and jump into her purse.\"<br>\r\n<br>\r\n\"Oh yeah! Good thing we're doing this together. I'd be lost on my own.\"<br>\r\n<br>\r\nYou both head inside and go into the living room. \"She always leaves her purse here on the corner of the couch.\" Denise explains. \"Drives me nuts sometimes.\"<br>\r\n<br>\r\n\"Ok,\" you reply. \"Lets get on the cushion and shrink, then we'll go back and we can easily jump in.\" You both get on the cushion and you quickly shrink yourselves down to 1 inch. Then you set the time controls for twenty minutes in the past, and off you go!</span></div></div>",
            "created":1201064400,
            "id":577266,
            "title":"Inch high spy"
        },
        "1111111111":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Stay with Katie",
                "Jump from ship slob to S.S. Jamie's Purse"
            ],
            "content":"<div class=\"\"><div> <span>The flash of time travel light fades, and sure enough there's Katie's pink purse, leaning over and several different shades of lipstick spilling out. <br>\r\n<br>\r\n\"See what I have to deal with!\" Denise exclaims. \"She can be such a slob sometimes.\"<br>\r\nJust then Katie walks in talking on her phone and doing her hair at the same time. You look at each other and then take off at a dead run for the purse. Katie is still talking on the phone so she must not have noticed the both of you, and you sigh in relief. Katie finishes her phone call and picks up her purse, dropping her phone into it. It barely misses Denise, and she gives you a worried look. You can tell shes having second thoughts, seeing as you're both so small and helpless, and that phone could have easily injured her. You bring your finger to your lips to signal her to stay quiet and she nods. The swaying of the purse has stopped as Katie sets it down on the counter, and suddenly little sample bottles of liquor drop all around the both of you.<br>\r\n<br>\r\nYou both huddle within the purse in silence for a while longer, staring at the giant sample bottles, lipstick, and phone, among other feminine items. Suddenly a horn honks and you hear Katie yell \"I'm coming.\" You quickly brace yourself against the nearest inner pocket of the purse, and with a lurch your ride takes off. After some jostling, the purse settles down and all you hear is Katie and Jamie singing along to Velvet Revolver.<br>\r\n<br>\r\nYou start to leverage yourself up to look out when Denise suddenly pulls you back down. \"What are you doing!?!\"<br>\r\n<br>\r\n\"I'm taking a look out.\" you reply. \"That is the point of this whole thing.\" You pop your head out and look upon Katie's giant legs swaying to the music above you. You're amazed and mesmerized at the leg muscles effortless movement. <br>\r\n<br>\r\nSuddenly Denise pops her head up too and quietly says \"Wow. This is such a different perspective. She used to perform ballet ya know. Hey, check it out over there,\" she suddenly says pointing. You nod with appreciation at the towers of muscle before looking where Denise is pointing, and see its Jamie's purse. \"We should get in that one instead. I already know Katie pretty well, but almost nothing of Jamie.\"<br>\r\n<br>\r\nThat could be interesting you think. Jamie is really damn hot, and could have a more organized purse that wouldn't be such a handful. Plus she's got a huge rack. <br>\r\n<br>\r\nBut then again those legs of Katie's look so powerful, and it might not be such a good idea to wander off with strangers, at least not till you have a better handle on how you can move around at this size.</span></div></div>",
            "created":1201410000,
            "id":494585,
            "title":"Purse ride!"
        },
        "11111111111":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Still in Katie's purse, at the party",
                "Open your eyes to see Katie's giant face and frazzled hair"
            ],
            "content":"<div class=\"\"><div> <span>You are still deciding on the options when suddenly Denise gets up and climbs out to get in the other purse. \"Where are you going?\" You start to get up to follow when suddenly Katie's leg shifts, knocking the purse and making you fall back in it. <br>\r\n<br>\r\nSuddenly Katie's giant hand reaches down and picks up the purse. You quickly crawl into a corner to avoid the hand as it grabs the phone. Taking the phone out, she zips the purse shut before dropping it on the floor. Unfortunately, one of the mini bottles of alcohol falls and conks you on the head. You're now unconscious, trapped in Katie's purse, and Denise is either in Jamie's purse or on the floor of the car. <br>\r\n<br>\r\nThings couldn't get much worse, could they? Wake up and find out</span></div></div>",
            "created":1202101200,
            "id":494594,
            "title":"Stay with Katie"
        },
        "111111111111":{
            "author_id":"sseiler76",
            "author_name":"cards_fan_76",
            "choices":[
                "Katie and some random guy making out",
                "Katie and Jamie playing a drinking game"
            ],
            "content":"<div class=\"\"><div> <span>You wake up and find that you're still in Katie’s purse, but now you're at the party.  You see that the mini bottles of alcohol are gone, and have been replaced with a pair of women’s panties.  They must be the panties that Katie had been wearing. It's a wonder she didn't find you when she was taking the bottles out. You look out of Katie’s purse and see:  </span></div></div>",
            "created":1202274000,
            "id":517784,
            "title":"Still in Katie's purse, at the party"
        },
        "111111111112":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "She thinks you would make a cute pet",
                "She's drunk and horny, and wants a show"
            ],
            "content":"<div class=\"\"><div> <span>You open your eyes and find yourself naked on a hard wooden surface. You look around wondering where you could be, then you look up. And right into Katie's giant face. And she's licking her lips and brimming with excitement.<br>\r\n<br>\r\nUh oh!</span></div></div>",
            "created":1202360400,
            "id":495380,
            "title":"At the mercy of a giantess"
        },
        "1111111111121":{
            "author_id":"sseiler76",
            "author_name":"cards_fan_76",
            "choices":[
                "RUN",
                "PRAY"
            ],
            "content":"<div class=\"\"><div> <span>You look to your left for a possible escape route and see Denise naked &amp; trapped in a mason jar.  Katie exclaims, “Look Jamie!  My cute little pet is now awake, too.”<br>\r\n<br>\r\nYou reach for your time belt and then realize it had been removed with rest of your cloths.<br>\r\n<br>\r\nYou are one inch high, naked, and trapped on a wooden table.  What do you do next?<br>\r\n<br>\r\n</span></div></div>",
            "created":1202360400,
            "id":495455,
            "title":"She thinks you would make a cute pet"
        },
        "11111111111211":{
            "author_id":"sseiler76",
            "author_name":"cards_fan_76",
            "choices":[
                "Make to the Mason jar",
                "Katie catches you before"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You run for the Mason jar containing Denise.  Your plan is to knock the jar off the table, since it is at the edge.  Hoping Denise is not hurt in fall and in the confusion, you both will be able to hide.<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1202446800,
            "id":495784,
            "title":"RUN"
        },
        "111111111112111":{
            "author_id":"sseiler76",
            "author_name":"cards_fan_76",
            "choices":[
                "You are able to push the Mason jar off",
                "You are unable to push the Mason jar off"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You make to the Mason jar containing Denise and:</span></div></span></div>",
            "created":1202446800,
            "id":495785,
            "title":"Mason jar"
        },
        "111111111112112":{
            "author_id":"sseiler76",
            "author_name":"cards_fan_76",
            "choices":[
                "Katie’s Grandpa, the old man that sold you the belt",
                "AJ"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You run about three steps before Katie catches you.  After catching you, she said, “Do you think, I am going to let my cute little pet get away.”   As she puts you in the Mason jar with Denise, the Door Bell rings.  Who is at the door?</span></div></span></div>",
            "created":1202446800,
            "id":495787,
            "title":"To the Mason jar"
        },
        "1111111111122":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Dance",
                "Run"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey girls, my little man woke up!\" Here Katie reaches to her left and grabs a video camera that she trains right on you. She then turns the reading lamp that's nearby to fully shine on you. \"Dance my pet, dance!\"<br>\r\n<br>\r\n\"Turn the light, we can't see him that well!\" Oh no, Katie and whoever else must have the camera hooked up to a TV or something. And here you are, naked and only an inch tall. Who knows where your belt is.<br>\r\n<br>\r\nSo what do you do?</span></div></div>",
            "created":1203483600,
            "id":500372,
            "title":"She wants a show"
        },
        "11111111111221":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Dance like the pretty ballerina you are",
                "Refuse"
            ],
            "content":"<div class=\"\"><div> <span>Seeing as how she's so tall, and you don't have any way to get back to your regular height, you might as well appease her and dance. Hopefully she'll have your clothes somewhere nearby so you can regrow yourself later. You never really were good at dancing, so you do your best. <br>\r\n<br>\r\nAnd it's quite the horrible dance show you give. But the women are drunk so it's enough to get them hooting and hollering. <br>\r\n<br>\r\nSuddenly a hand reaches in and grabs you. It opens, and you're looking into the face of Jamie. And suddenly her right hand comes in with a marker. She's painting your body purple! You protest, most especially at the cold wetness of it, but she ignores you. When she's done she sets your now half purple naked body down. <br>\r\n<br>\r\n\"Ooooh, my pet is now a pretty ballerina!\" exclaims Katie. \"Dance gracefully, my pretty ballerina!\"<br>\r\n<br>\r\nYou look down at your legs and it certainly does resemble a tutu and tights. </span></div></div>",
            "created":1203483600,
            "id":500376,
            "title":"Dance"
        },
        "111111111112211":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Sit down in protest",
                "Hump the doll's leg"
            ],
            "content":"<div class=\"\"><div> <span>Hoping she'll tire of this sooner rather than later, you make a half hearted attempt at dancing like a ballerina. They don't care and holler for more. So you dance a little more. <br>\r\n<br>\r\nThe hoots aren't quite as loud as before, maybe they are tiring of making you do things. But just as suddenly as you think this, another giant hand plops down a doll. \"Make love to the dolly, my pet. Do your best, or else!\" <br>\r\n<br>\r\nEven if the doll were anatomically correct, it'd be kinda hard for you to make love to it, seeing as its easily 9 inches tall, and you're only 1. <br>\r\n<br>\r\nSo what now?</span></div></div>",
            "created":1203483600,
            "id":500379,
            "title":"Such a pretty ballerina"
        },
        "1111111111122112":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Denise gives you your clothes, tiny like you",
                "She shrinks herself to make you large again"
            ],
            "content":"<div class=\"\"><div> <span>Yelling up at the titanesses, you say \"Ok, but this is the last thing I'm gonna do for you before I get some clothes, and I'm no longer purple!\"<br>\r\n<br>\r\n\"Wanna bet?\" Katie responds, with a somewhat evil looking smirk on her face. \"Oh, don't look so down, we'll get you all cleaned up in a minute. Now pleasure the doll.\"<br>\r\n<br>\r\nYou walk over to the doll, and start humping its mammoth leg. There's several more hoots and hollers at this, though not as many, nor as loud, as before. After a moment, Katie says \"Ok, you did very well so we'll reward you a little. Bring it on over here.\" as she beckons to someone from the direction of the hollers.<br>\r\n<br>\r\nStanding up, you watch another titaness face come over the rise of the table. It's Denise!<br>\r\n<br>\r\n\"Don't look so surprised buddy.\" Denise says, seeing your shocked look that she's there, and large. Looking down, well, at your eye level, you notice her wearing the belt. \"It's just a bunch of my girls and me having fun at a tiny little boys expense.\" Here she gives you a little wink. then she says \"Here you go,\" as she drops a giant sock on you. <br>\r\n<br>\r\nFighting out from under the sock, you look up at Denise a little angrily. \"What,\" she responds, \"didn't you say you wanted some clothes?\" At this Katie and the other titanesses giggle. \"Ok, here you go.\"</span></div></div>",
            "created":1207630800,
            "id":517329,
            "title":"Hump the doll's leg"
        },
        "11111111111221122":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "\"You are, the girls are just taller now.\"",
                "\"I don't remember saying you were going back to normal"
            ],
            "content":"<div class=\"\"><div> <span>Denise sits herself down on the table, then pulls her rear towards you and the mammoth sock she had dropped on you. Then she starts shrinking before your eyes, when she is near you own height, she stops shrinking and tosses you a bracelet. \"Hurry and put it on Jay, cause I ain't staying this small for long!\" <br>\r\n<br>\r\nYou quickly put the bracelet on, and without hesitation Denise starts herself and you a-growin. Within moments you are able to jump off the table safely, and do so, even though you are naked, and still purple. Looking around, you see several women, including Katie and Jamie, all watching the both of you growing with smirks on their faces. You finish growing, and realize that Katie is larger than you, even though you know you're about 5 inches taller than her. <br>\r\n<br>\r\n\"Why am I not at my regular height?\" You ask Denise accusingly.<br>\r\n<br>\r\nShe responds, </span></div></div>",
            "created":1207630800,
            "id":522510,
            "title":"Growing tall again"
        },
        "111111111112211222":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "\"Because we can. Go girl power!\"",
                "\"You're too cute to have power back yet.\""
            ],
            "content":"<div class=\"\"><div> <span>Denise responds, with a slightly sadistic smirk, \"I don't remember saying you were going back to normal, I just said I was going to make you taller.\" <br>\r\n<br>\r\nNow Katie's hands and the hands of two other girls come in and the hold you down, while Denise takes the bracelet off your arm. The girls carry you like a little child, and you are about the size of a child to them, and the set you on the couch. Denise meanwhile decides to grow back to normal height, and shortly joins you on the couch. You must be only 4 feet tall. <br>\r\n<br>\r\n\"Why are you doing this to me?\" you ask Denise and the other assembled women. </span></div></div>",
            "created":1208754000,
            "id":522519,
            "title":"Not normal again yet"
        },
        "11111111112":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Barely make it in, just as the purse is grabbed by Jamie",
                "Jump for the purse, but it lifts away from you, with Denise inside"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok,\" you reply, \"let's see what Jamie's purse has to offer!\" Both of you get out of Katie's purse, and start the trek over to Jamie's purse. Above you Katie's legs are swaying back and forth as the hotties sing to the music. You stop for a moment to marvel again at the muscles in the back of Katie's legs.<br>\r\n<br>\r\nSuddenly the song changes and you hear both girls squeel in joy. It's a Linkin park song that you know Katie absolutely loves. Suddenly she starts stomping her feet to the music, and you Denise get separated, with Denise getting ahead to the purse. It's too dangerous to keep moving for the moment though, with the feet stomping so hard in front of you like wrecking balls. Each time you try to stand up an impact shakes just a bit too much and you fall on your ass again. Might as well sit it out till the song ends.<br>\r\n<br>\r\nThe song ends and sure enough Katie calms back down. But just as you start to continue your trek the car stops and Jamie announces \"We're here, let's rock!\"<br>\r\n<br>\r\nUh-oh, can you make it to the purse in time to rejoin Denise?</span></div></div>",
            "created":1204520400,
            "id":505249,
            "title":"Trek across a car floor"
        },
        "1111111112":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "She heard, and stares right down at you both",
                "Nope, TV is too loud, but she just changed the channel to something quieter"
            ],
            "content":"<div class=\"\"><div> <span>The flash from Time traveling fades, and you look around. There's no purse, but there is Katie, all dolled up for a night out, and just waiting for Jamie to arrive. She's sitting on the couch, feet propped on the table and watching TV, with hand on the remote. <br>\r\n<br>\r\nAnd Denise and yourself just happen to be between the remote and Katie's mammoth legs.<br>\r\n<br>\r\n\"Oh my god!\" exclaims Denise at seeing her roommate so close, and above all so large! She then clamps her hands over her mouth. Did Katie hear that?</span></div></div>",
            "created":1204520400,
            "id":518582,
            "title":"The purse ain't here, but Katie is!"
        },
        "11111111121":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Tell her the truth",
                "Lie, say you don't know"
            ],
            "content":"<div class=\"\"><div> <span>Denise is staring wide-eyed up at Katie, hand covering her mouth at her mistake. And then there's Katie, eyes growing wide at suddenly seeing her roommate and friend each an inch tall and on the couch with her. \"Oops.\" says Denise, but its enough to break Katie out of her shock and she drops the remote and grabs the both of you with lightning speed. <br>\r\n<br>\r\nThere's a large pressure around yourself and Denise and you're thrown against each other and in darkness. Moments later the pressure is relieved and you're laying against Katie's palm. Looking up you see Katie's ginormous eyeball, and it seems to widen a little more. <br>\r\n<br>\r\n\"Denise, Jay, is that really you? How did you guys end up like this?\" </span></div></div>",
            "created":1219986000,
            "id":575906,
            "title":"Caught"
        },
        "111111111211":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Katie is sober and upset",
                "Katie has already started drinking and thinks its awesome"
            ],
            "content":"<div class=\"\"><div> <span>\"Well...\" you begin, but Denise suddenly starts telling everything. <br>\r\n<br>\r\nAnd she starts telling it fast as she can. \"We went to a garage sale and got this belt that can let us travel through time and change our sizes, and we were going to spy on you and Jamie, but you already left so we went back in time to hide in your purse, but you saw us and here we are!\" Denise takes a deep breath and then resumes. \"Please don't be mad at us, we didn't mean any harm, and oh my god your face is huge!\"<br>\r\n<br>\r\nKatie stares at you both for a second and then simply says \"Wow.\"</span></div></div>",
            "created":1219986000,
            "id":575975,
            "title":"Denise explains"
        },
        "1111111112111":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Katie manages to activate the time travel function",
                "Katie activates the size changing function"
            ],
            "content":"<div class=\"\"><div> <span>Katie's eyes narrow and she suddenly looks angry. \"Well, I guess I have two little spies to take care of now.\" At this she closes her hand around the both of you, pinning you together and unable to see anything and barely move. When she opens her hand again she quickly grabs your arms and binds you and Denise together with a rubber band, then suspends you both with some string from a lamp. <br>\r\n<br>\r\n\"What are you going to do Katie?\" you ask her, and not without a little fear.<br>\r\n<br>\r\n\"You'll see.\" she responds, grinning in what can only be described as an evil smile.<br>\r\n<br>\r\nTaking a magnifier glass, some tweezers, and various other tools, she locates the belt on you and removes it. She sets it down and is about to get down to business with it when she stops, looks at you, and grins again. The she makes short work of your pants, removing them and your boxers to leave you exposed. <br>\r\n<br>\r\n\"Oh, come on Katie, it's cold in here!\" you say. <br>\r\n<br>\r\n\"Is that why it's so small?\" she responds. Your cheeks burn crimson, and you're about to reply when she says \"Oh don't be like that.\" She then removes you both from the lamp and sets you on her bed behind her, but still bound together, while she goes to work on the belt with her tweezers and toothpicks.</span></div></div>",
            "created":1219986000,
            "id":575980,
            "title":"Katie is upset"
        },
        "11111111121112":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Denise",
                "Katie"
            ],
            "content":"<div class=\"\"><div> <span>Katie is working with the tweezers and finally manages to activate the belt to grow. You and Denise had been squirming around doing your best to free yourselves from the rubber band while this was happening, though without any success. Katie activates the belt to grow it to a normal size, and it does. <br>\r\n<br>\r\nBut Denise is still wearing the bracelet, and grows with it. The rubberband pinches you and the expanding Denise together, and Denise is finally able to stand up as she outgrows you. Your feet are lifted off the bed, and you keep rising into the air. Finally when Denise reaches two feet tall the small rubberband snaps and you fall, grabbing onto Denise's shirt as you are just three inches tall compared to her. She starts to grow even faster now, and she fixes her full attention on Katie, who is oblivious as she marvels at the expanding belt.<br>\r\n<br>\r\nWith you grabbing hold of the edge of the v-neck of her shirt, Denise jumps at Katie, and you are sandwiched between the giants as they tussel over control of the belt. Your universe is now two grunting and screaming coeds as you're pounded between the two as they equalize in size and fall back and forth, finally falling in the cleavage of one of them. Denise finally wrests control of the belt away from Katie and she quickly spins a dial to dissapear in a flash of time travel light. <br>\r\n<br>\r\nQuestion is, whos cleavage did you fall in?</span></div></div>",
            "created":1220158800,
            "id":576876,
            "title":"Denise and Katie wrestle for the belt"
        },
        "111111111211121":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Katie's room, microscopic",
                "The very distant future, near the end of the universe"
            ],
            "content":"<div class=\"\"><div> <span>From your inch high perspective, your world is massive mounds of flesh on either side of you, encased in their purple lace prisons. And just beyond those is a black shirt. Denise was wearing a black shirt, wasn't she?<br>\r\n<br>\r\nThen your world shakes as the giantess you're on says \"wow\" and sits up. In the moment that she sits up, you roll against one of the flesh mounds and then into the V-neck of the shirt, barely able to grab hold of the bra. Looking up, you see Denise's massive smiling visage looking down at you. \"Well,\" she says, \"you look to be right at home there.\"<br>\r\n<br>\r\n\"Yeah, though I wouldn't mind being back to my regular size at some point soon.\" you reply.<br>\r\n<br>\r\n\"Sure, once I figure out where we are, I'll restore you. I really have no idea where we are though. It's all dim and fuzzy here.\"<br>\r\n<br>\r\nSo where are you and Denise at?</span></div></div>",
            "created":1223355600,
            "id":592073,
            "title":"With Denise"
        },
        "111111111211122":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "They drive to Jamie's house",
                "They stop at a pet store"
            ],
            "content":"<div class=\"\"><div> <span>From your inch high perspective, your world is massive mounds of flesh on either side of you, encased in their black lace prisons. And just beyond those is a red shirt. Uh oh, you think, wasn't Denise wearing a black shirt?<br>\r\n<br>\r\nThen your world shakes as the giantess you're on says \"damn\" and sits up. In the moment that she sits up, you roll against one of the flesh mounds and then into the lowcut shirt, falling through and finally landing on the skirt below. You roll over and look up to see Katie's massive visage looking down at you. A smile starts to creep across her face, as dread starts to set into your stomach. <br>\r\n<br>\r\n\"Well at least I didn't lose you as well.\" Katie announces. \"We're gonna find some way to have fun despite losing that belt and my spying roomie. Now what should we start with...\"<br>\r\n<br>\r\nBefore Katie can decide though there is the honking of a horn outside. \"Hmm, Jamie is here, she's gonna flip out when she sees you. Forget the party, we're gonna have an awesome night in!\" Katie grabs onto you and heads outside, grabbing her purse along the way. You're still pantsless, and encased in her warm hand and with no way to escape. Katie makes her way outside and gets in Jamie's car, just as you saw when you and Denise arrived the first time. <br>\r\n<br>\r\nAs they drive along Katie is telling Jamie everthing and shows you to her. They talk about several different things to do, but it's not like they bring you in on the discussion. So what are they going to do with you?</span></div></div>",
            "created":1220590800,
            "id":578819,
            "title":"With Katie"
        },
        "1111111112111222":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "They introduce you to some animals",
                "They buy the equipment and head to Jamie's place"
            ],
            "content":"<div class=\"\"><div> <span>Finally the vehicle stops the ladies get out, though Katie puts you in her purse first. Luckily theres not much in it, so it isn't too crowded. Moving around a little you find a tiny hole in the side and try to tear it open, but the material is too strong for a little inch tall pipsqueek like you. Finding it futile to try and make the hole bigger, you content yourself with watching the world on the other side. <br>\r\n<br>\r\nAfter a moment you recognize the surroundings outside as the Roseville shopping center. And after a few moments the girls reach their destination... the Pet Store. A few birds caw into the air, and a dog barks to get himself noticed. Your captors walk on and you notice they brought you to the hamster accessories aisle. Off to one side you can see Jamie picking up a hamster ball in one hand, and the tunnels for a hamster playpen in the other. You think to yourself, this can't get much worse.<br>\r\n<br>\r\nOr can it?</span></div></div>",
            "created":1223269200,
            "id":591675,
            "title":"They stop at a pet store"
        },
        "111112":{
            "author_id":"overlord",
            "author_name":"The Crying Shadow",
            "choices":[
                "Time of Knights",
                "Time of Robots"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, your clothes begin to shimmer and change. Soon, your in an old western cowboy outfit. \"Cool! This must be how we can blend into the time period we're in.\" you say surprised. \"I wish we had known that earlier. Ah well, at least that means we won't have to worry about people shooting us again.\" she replies.<br>\r\nThey played with the clothing changer for a while to get use to how it works. Once they got the gist of it, they needed to decide what they should do. They came up with two choice.<br>\r\n\"Well, I've always liked The Medieval Ages. Kings &amp; Queens, Princes &amp; Princesses, Knights, Wizards, and treasure.\" you suggest.<br>\r\n\"Yeah, but I've always wanted to see the future. Flying Cars, Robots, Holograms, and new forms of sports.\" suggests Denise, \"but I'll leave the choice to you.\"<br>\r\n<br>\r\nSo where will you go?</span></div></div>",
            "created":1199595600,
            "id":484460,
            "title":"Clothing Change"
        },
        "1111122":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "You're someplace you shouldn't be",
                "Its something completely unrelated"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, how far ahead do you think till there's tons of robots?\" you ask. <br>\r\n<br>\r\n\"Hmmm,\" Denise says, putting her thumb on her chin and scrunching her eyes slightly while she thinks. She really is cute when she thinks hard like that. \"Maybe 300 years?\"<br>\r\n<br>\r\n\"That sounds good, but I'll go for 500 just to make sure we see some.\" You quickly turn the dial and press the button. After a brief flash, you're both in what appears to be a factory. Assembly lines zoom by at incredible speeds with shiny metal parts to who knows what. <br>\r\n<br>\r\n\"Wow!\" Denise exclaims softly. Suddenly an alarm starts blaring really loud. And I mean REALLY LOUD! Uh, oh.</span></div></div>",
            "created":1200805200,
            "id":488933,
            "title":"Time of Robots"
        },
        "11111221":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "A man in a control chair",
                "The Central computer that is in charge"
            ],
            "content":"<div class=\"\"><div> <span>That alarm sound can't be good you think. Suddenly there's a blaring voice over an intercom... \"Living organisms in section C28, capture for analysis!\"<br>\r\n<br>\r\nWhistles start to blow as the assembly lines slow down, and now there's the sound of wheels and gears approaching. It'd be a good idea to get out of here, so you start to reach for your belt, but cables come at you out of nowhere, and end up pinning you to the ground. You hear a yelp and a thud from Denise and know she's been caught too. <br>\r\n<br>\r\nSeveral robots come out from behind boxes, including several that are connected to the thick cables that are holding you down. You hear some static from the robots, and then suddenly the alarms shut off. The cables holding you down start to lift you up, but you still cant move. Suddenly you're pulled into the robot that is restraining you, but your arms are still held too far for you to be able to use the belt. Denise is similarly being lifted into the robot that's holding her.<br>\r\n<br>\r\nOnce you are completely encased within the robot, it starts to move. As the sounds of assembly lines start to fade, your prison goes through several turns. It's pitch black inside, so the only thing you can do is listen to the machinery you're encased in work, and the sounds of doors shushing open and closed.<br>\r\n<br>\r\nAfter several minutes your ride stops moving, and then the door to your compartment opens, and you see...</span></div></div>",
            "created":1202878800,
            "id":497645,
            "title":"There's robots here all right"
        },
        "111112211":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Security director of this factory city",
                "Owner of this planet factory"
            ],
            "content":"<div class=\"\"><div> <span>\"Humans?\" exclaims the man, jumping in his chair slightly in surprise. \"How interesting. I have several questions for you, and you had better answer them truthfully. How did you gain entry into my factory, much less penetrate all the way to Block C, without being detected?\" <br>\r\n<br>\r\n\"I'm not going to answer any questions until I know where we are, and who you are.\" you answer.<br>\r\n<br>\r\nThe man lifts his eyebrows slightly, then chuckles quietly. \"You are a bold one, aren't you. Very well, I have been a rude host not introducing myself, though I did imagine since you made your way into my facility, you might have an idea who I am.\" <br>\r\n<br>\r\nHe brushes his hand through his wispy gray hair and stands up, smoothing down his grey tunic and pants. \"I am Gra'Mof Tarkin,...<br>\r\n<br>\r\n</span></div></div>",
            "created":1218862800,
            "id":570875,
            "title":"Meeting Gra'Mof Tarkin"
        },
        "1111122112":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "A new kind of teleportation device, and it malfunctioned.",
                "My belt can travel through time"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait, this whole planet is a factory? What could you be making that would need the whole planet to construct it?\" you ask, incredulous. <br>\r\n<br>\r\n\"Wait a moment young man. I have answered a question of yours, and seeing as this facility is mine, I think it only fair that you tell me who you are and how you arrived here before I answer any more of your questions.\"<br>\r\n<br>\r\n\"Okay, I'm Jay and this is Denise.\"<br>\r\n<br>\r\n\"And how did you gain entry within my facility?\"<br>\r\n<br>\r\nYou don't really want to tell him that you're wearing a time travel belt, but you are trapped here in his facility and it is the future. Who knows if he'll be able to tell that you are lying or not? Though a little lie would be much better than the truth. <br>\r\n<br>\r\n\"I'm still waiting. How did you get into my facility?\"</span></div></div>",
            "created":1225342800,
            "id":601738,
            "title":"The Factory Planet"
        },
        "11111221121":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "\"Send them to the detention block.\"",
                "More questions..."
            ],
            "content":"<div class=\"\"><div> <span>\"A teleportation device that malfunctioned? Do you really expect me to believe that?\" he says, sarcasm palpably dripping. Gra'mof Tarkin stares at you, as if waiting for you to continue, silence thick.<br>\r\n<br>\r\n\"Yes, in a sense.\" Denise pipes up.<br>\r\n<br>\r\n\"Very well. I shall let it go for the moment. Though we shall revisit that topic later. Now why have you come here?\" Tarkin states, sitting back down in his command chair.<br>\r\n<br>\r\n\"It was a malfunction. We don't even know where this facility is located!\" you say.<br>\r\n<br>\r\n\"What do you make here anyway?\" Denise asks. <br>\r\n<br>\r\n\"It is hardly private knowledge, that I am in the business of assembling starships.\" Tarkin states, swiveling his chair around and turning back on several monitors. And you see that he isn't lying, as several screens show full fledged starships in the process of construction, and also a line of what can only be starfighters on several other screens. <br>\r\n<br>\r\nBut now you have to wonder, is he done questioning you now, or is he just checking the status of some work before continuing with more interrogation?</span></div></div>",
            "created":1225342800,
            "id":601742,
            "title":"He knows you lied"
        },
        "11111221122":{
            "author_id":"pompombella",
            "author_name":"SarahandAshley",
            "choices":[
                "Steals the Belt.",
                "Set's you free for now."
            ],
            "content":"<div class=\"\"><div> <span>After telling him that your belt can travel through time, he's very intrigued. \"So, you're telling me if I use this belt to travel trough time, I can go to that exact point?\"<br>\r\n\"Ummm...no\"<br>\r\n\"Interesting, I may even take over the world 1000 years in the past.\"<br>\r\nThen he...</span></div></div>",
            "created":1370011440,
            "id":1600648,
            "title":"My belt can travel through time"
        },
        "11112":{
            "author_id":"norman33",
            "author_name":"Norman33",
            "choices":[
                "Past",
                "Future"
            ],
            "content":"<div class=\"\"><div> <span>Wanting to get out of there as quickly as possible, you spin the dial, grab Denise, and hit the red button without really looking at the read out. There is a flash, again its very disorienting, but this time you don’t pass out. When things stop spinning your still holding onto Denise, but the world has changed. By what you see around you, you know without looking at the dial you’re in the……….</span></div></div>",
            "created":1199250000,
            "id":517779,
            "title":"Get somewhere else fast!"
        },
        "111121":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Try to climb a leg",
                "Head for the tail and work your way up"
            ],
            "content":"<div class=\"\"><div> <span>There's no way you can't be in the past, as looking up you see a Dinosaur eating the tree above you. Denise starts to scream, but her terror quickly changes to fascination. The only other life nearby is this giant herbivore, and she seems almost entranced by it eating the tops of the tree. Luckily she comes back to reality in time to dodge a giant droplet of saliva. You, on the other hand, are not so lucky, and get your shoes coated by it.<br>\r\n<br>\r\n\"Ewwwwww!\" exclaims Denise, \"Pay attention next time.\"<br>\r\n\"Yeah yeah,\" you reply. \"This is so cool! I love this belt. And that Dinosaur is HUGE!\" <br>\r\n\"Yeah, wanna try to hitch a ride on it?\" asks Denise. <br>\r\n<br>\r\nThat might not be a bad idea. You'll get to see more of the surroundings, along with being out of the way of more spittle. But how to get up?<br>\r\n<br>\r\n</span></div></div>",
            "created":1199336400,
            "id":482620,
            "title":"Dinosaurs!"
        },
        "1111211":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Denise falls off and is still with you",
                "Denise is still on the Dino"
            ],
            "content":"<div class=\"\"><div> <span>You start trying to climb the Dinosaur's leg, but can't keep a grip and keep sliding back down. Denise is having a much easier time though and climbs right up. She reaches down to help pull you up but suddenly the dinosaur shifts and starts to walk away. Because of the enormous size of the Dino, and the fact you were on your butt from falling, it quickly moves far out ahead of you. <br>\r\n</span></div></div>",
            "created":1199595600,
            "id":489440,
            "title":"Try to climb a leg"
        },
        "11112112":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Sure did",
                "Not at all"
            ],
            "content":"<div class=\"\"><div> <span>Because of the enormous size of the Dino, and Denise's fear of falling off, she is quickly taken very far away from you. She yells for help from you, but is out of sight within moments on her fast moving platform.<br>\r\n<br>\r\n\"Oh my god.\" you say in despair. \"Denise is gone. What am I going to do?\" Walking over to a tree you sit down to think the situation over. How did she travel with you in the first place? You weren't touching when you activated the belt either time before, so how were you two still together?<br>\r\nThe bracelet! She was wearing one of the bracelets you guys found on the belt! You surmise it must link the bracelet wearer with the belt, and since the belt went back in time, so did the bracelet! Now you can just go back to your own time and once there call her on her cell and you can be reunited. Its only logical that it would work, so you set the belt for home and press the button.<br>\r\n<br>\r\nDid it work?</span></div></div>",
            "created":1200891600,
            "id":489447,
            "title":"Denise is still on the Dino"
        },
        "111121121":{
            "choices":[
                "To a time in your past",
                "Lets explore the ancient past "
            ],
            "content":"<div class=\"\"><div> <span>Again there is a flash of light, and once again you find yourself standing on the sideway, you quickly look around, and breath a sigh of relief as you see Denise there, although at the moment is hugging a street sign for dear life with her eyes close. You can't help but laugh at the sight, before saying, \"Denise its fine you can let go,\" and she slowly open her eyes and looks around.<br>\r\n<br>\r\n   \"I can't believe it!\" she said a moment later after letting go of the sign, \"me either,\" you say looking at the belt with wonder, \"its just like that movie, Back to the Furture,\" Denise says with excitement. Your mind races with ideas for this belt, you could go back and take back ever mistake you have done in the past, and redo it, or even go forward and find out the winning lottery numbers. You can see Denise is having similar visions, and both of you grin as you look down at the belt. <br>\r\n<br>\r\n  There is only one draw back, your not sure what would happen if you met your past self, you remember someone saying that it was possible that the world was simply pop of existance, but you doubted that they could prove that.<br>\r\n<br>\r\n\"Ok lets go,\" you say, but Denise pauses for a moment, \"you know, now that we know what it can do, we could also explore the past, think about it, that would be the greatest adventure!\" she says.<br>\r\n<br>\r\nYou think about this as you begin to play with the dial <br>\r\n<br>\r\nSo where to?</span></div></div>",
            "created":1201755600,
            "id":492782,
            "title":"We're Back for the moment"
        },
        "1111211211":{
            "choices":[
                "Smiling mischievously, ready for fun",
                "A fifth grader now, as are you, but you have the belt"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's go back to when we in fifth grade,\" you say, \"Why?\" Denise asks. You think about that had been the first time you had ever gotten into a fight, it had be with the school bully Matt, you remembered getting beaten up badly. You had taken martial arts lesson after that, but Matt had moved before you were able to finish. \"No reason,\" you answer Denise's question trying to hide a grin as you put in the time and place into the belt, and press the red button.<br>\r\n<br>\r\nThere is a flash of light that causes you to blink a few times. \"Wow,\" you hear Denise say as you look around. You find that you are now standing in front of your old school, and you can see children playing in the sandbox area and swinging on swing, and you smile as you remember some of them. You look over at Denise and notice that she is...</span></div></div>",
            "created":1202101200,
            "id":495625,
            "title":"Back to the Past"
        },
        "11112112111":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Prank Mrs. Saltzman",
                "Say hi to yourself"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok, I think I understand. There's Mrs. Saltzman, the playground policer. Sleeping as usual.\" Denise says.<br>\r\n<br>\r\nYou look over at the picnic table beneath the old oak and sure enough she's sleeping away. And there's scrawny little you over on the swings with Aj. But the bully Matt is nowhere to be seen. <br>\r\n<br>\r\nHmm, since he's not here, what to do then?</span></div></div>",
            "created":1202360400,
            "id":495640,
            "title":"Back to school"
        },
        "111121121112":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Still go say hi to yourself",
                "Forget yourself, go search for the bully Matt"
            ],
            "content":"<div class=\"\"><div> <span>You start to head on over to say hi to yourself, but Denise grabs your arm. \"What are you gonna do?\"<br>\r\n<br>\r\n\"I'm going to say hi to myself, see what I was up to today.\" You reply<br>\r\n<br>\r\n\"Couldn't that mess things up a little bit? Some scifi shows with time travel say that meeting yourself could blow a hole in space and time, or maybe just change things horribly. We didn't meet until seventh grade after all! What if we never meet because of something that happens today?\"<br>\r\n<br>\r\n\"That's a possibility, but what about back to the future? it just changed those that weren't time traveling.\" But her argument has you a little worried. This is a once in a lifetime opportunity though. It can't affect you that much if it even does change you. Could it?</span></div></div>",
            "created":1202360400,
            "id":495644,
            "title":"Saying hi to yourself?"
        },
        "1111211211121":{
            "choices":[
                "Tell him the Truth",
                "Chicken out and Lie"
            ],
            "content":"<div class=\"\"><div> <span>You decide to try anyway, what's the harm, after all you're here right now, and so therefore nothing happened...right?<br>\r\n<br>\r\n You scan the playground till you see him (er...you) playing on the swings. You start to walk over to your younger self, all the time Denise is biting her nails hoping that the world will not just disappear in some sort of paradox. Your younger self turns and see you, \"Er...Hello,\" you say, and mentally scorn yourself for that lame introduction. Your younger self stares at you for a moment, \"Hello...\" he answers back, in an unsure tone as awkward silence follows.<br>\r\n<br>\r\n  What were you suppose to say to yourself, for a moment you think of telling him all the answers to his test, a test that you remember failing. Denise shifts uneasily, \"Let's go,\" she says with a bit of worry in her voice. Suddenly your younger self, \"How are you?\"<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1202706000,
            "id":563212,
            "title":"Hello...me...."
        },
        "11112112112":{
            "choices":[
                "you decide to time travel again",
                "you called back into class"
            ],
            "content":"<div class=\"\"><div> <span>You look over at Denise and notice that she is a fifth grader now, as are you, but you have the belt.<br>\r\n<br>\r\n\"I guess if we travel to a time where we lived, we become the age we were that year\" you realize.<br>\r\n<br>\r\n\"You mean we are 5th graders in the year we we're at?\" asked denise<br>\r\n<br>\r\n\"I guess so we dont run into our past selves, we are our past selves.\"<br>\r\n<br>\r\nCool.<br>\r\n<br>\r\nYou and Denise then play in the playground until</span></div></div>",
            "created":1204174800,
            "id":503904,
            "title":"Keeping up with the past"
        },
        "111121121121":{
            "choices":[
                "at the women's restroom",
                "in a lady's clothing store"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, if going to a familiar place in the past made us younger, then if we did the same thing in the future...?\" Denise remarks quietly.<br>\r\n<br>\r\nYou are about to ask her what she said, when there is another flash and you're at the mall. As you get your bearings, you look over at Denise. She is now about your mom's age, somewhere in her early forties.<br>\r\n<br>\r\n\"So, this is the future? You still look pretty good, for someone around mom's age,\" you say, wondering why your own voice seems so foreign to you. For that matter, your body seems off somehow as well. Things are happening so fast; there is no time to dwell on it.<br>\r\n<br>\r\n\"I do? Oh,\" she giggles, \"so do you...though not quite what I was expecting. Wow, I even sound a little like mom. My butt is a touch larger, and I seem to have added a pound or two here and there. Oh, I know it sounds crazy, but could we go somewhere and find a mirror so I could get the full impact of it.\"<br>\r\n<br>\r\n\"Sure, just remember we don't want to encounter our own selves. So, we have to keep an eye out for each other.\" Why did she giggle? Is there something you are missing? Still, you follow her as she seems to have an idea of where she needs to go. <br>\r\n<br>\r\nYou soon find yourself....</span></div></div>",
            "created":1219899600,
            "id":591667,
            "title":"Take a Look Ahead"
        },
        "1111211211211":{
            "choices":[
                "make a run for it",
                "follow her and find out more"
            ],
            "content":"<div class=\"\"><div> <span>       The next thing you know, you are standing in front of the women's rest room. <br>\r\n<br>\r\n       \"Well, aren't you coming in with me?\" Denise inquires, as she pulls you on after her anyway.<br>\r\n<br>\r\n       \"Why would I do that?\" you ask, feeling confused.<br>\r\n<br>\r\n       \"Well, I hate to break the news to you, but you are a woman now.\"<br>\r\n<br>\r\n       Looking at your reflection, you gasp. \"No wonder my voice and body feel foreign to me.\"<br>\r\n<br>\r\n       \"Ya think?\"<br>\r\n<br>\r\n       \"Very funny,\" you mutter, as you peruse the new woman you are now. You were almost 6 feet tall, and now you are about 5 feet 7 inches, with large breasts, and a more or less petite figure. Long, curly, jet black hair is pulled back from the side of your face hangs down to the middle of your back. There is just the faintest touch of gray in your bangs, while there are light crows feet and fine lines on your face. You are wearing black capris, silver tennis shoes, and a teal blue long sleeved blouse. A string of pearls hang around your neck, and fancy rings are on your fingers. The time belt seems to somehow fit right in.<br>\r\n<br>\r\n       \"How could this happen?\"<br>\r\n<br>\r\n       \"I'm not really sure, but I think we better call you Jayne now,\" Denise laughs.<br>\r\n<br>\r\n       \"Maybe I could still be Jaye, just with an \"e\" on the end instead. Wait a minute, how can I possibly be a woman when all we are doing is time traveling?\" you say, not enjoying having to make this adjustment.<br>\r\n<br>\r\n        A voice behind the two of you says softly, \"I can answer all of your questions if you just follow me.\"<br>\r\n<br>\r\n       After overcoming the shock of this lady coming up behind you, you decide to...</span></div></div>",
            "created":1220072400,
            "id":591666,
            "title":"Surprise at the Ladies Room"
        },
        "11112112112112":{
            "choices":[
                "Yes, with conditions",
                "No, not really"
            ],
            "content":"<div class=\"\"><div> <span>     You decide to follow her and soon find yourself at the food court. As you sit down at the food court, you notice that the woman looks to be about college age. She has a belt like you, and then a little boy joins her wearing bracelets like the ones Denise has on.<br>\r\n<br>\r\n     \"I see the two of you are a bit confused,\" she says. <br>\r\n<br>\r\n     \"Easy ta unnerstan,\" the little boy adds.<br>\r\n<br>\r\n     \"My name is Tanya and this is Jason. We're time agents.\"<br>\r\n<br>\r\n     \"Aren't you a bit...well...\"<br>\r\n<br>\r\n     \"I think what Denise is trying to say...is...\"<br>\r\n<br>\r\n     \"...why am I so much older than Jason? I could ask you why you find yourself a woman.The answer to that is anything can happen when you time travel, and that is why we make sure time agents are paired up.\"<br>\r\n<br>\r\n     \"Yeah, you getta used ta it affer while.\"<br>\r\n<br>\r\n     \"Well, that is just lovely to know,\" you sniff, amazed how much more feminine even your actions and reactions have become.<br>\r\n<br>\r\n     \"At least you know it now, and be grateful your clothes changed with the shift. It's not much fun to have an outfit that looks old when you're young, or too young when you are older.\"<br>\r\n<br>\r\n     \"Sometimes, da cwothes be too big, an nudder times dey gets to small. Could I go gitta corn dog ?\" Tanya gave him some money and sent him off.<br>\r\n<br>\r\n      \"That must be hard having a partner so much younger than you. At least,\" Denise said looking at me,\" my partner Jayne is about the same age, though both of us are older than we're used to dear. \"<br>\r\n<br>\r\n      \"Well, now you are partners in time travel, and time agents as well. First off, to dispell rumors to the contrary, you don't have to worry about meeting yourselves.\"<br>\r\n<br>\r\n      \"We don't?\" I replied.<br>\r\n<br>\r\n      \"No, due to the fact that your bodies shift in age, size, gender, even race at times to assure this does not occur. Things also work that if one of you gets too old or young, the other will be somewhat more stable when you shift. You may also find after travelling you get even older or even younger, sometimes suddenly but usually gradually. If you are in danger of getting too young or old, you will find that things go into auto pilot and you will travel into another time.\"<br>\r\n<br>\r\n       \"Is that all sweetie?\" Denise moaned, contemplating the ramifications.<br>\r\n<br>\r\n       \"Almost. You will also find there are times you have to care for one another if the your partner gets too old or young. And this does mean changing their diapers, helping the other get around, and a variety of other things.\"<br>\r\n<br>\r\n       \"I hate to ask this, but can we even go home again?\"<br>\r\n<br>\r\n       \"Well...\"</span></div></div>",
            "created":1220763600,
            "id":591665,
            "title":"New Time Agent Orientation"
        },
        "111121121121121":{
            "choices":[
                "they go to the past",
                "they go to the future"
            ],
            "content":"<div class=\"\"><div> <span>\"Well,\" said Tanya, as her clothes changed  to a black leather mini skirt and purple bustier, black stiletto heels, and her hair became long and curly with touches of gray as fine lines and crow's feet showed on her face,and elegant cat's eye glasses on a beaded chain rested on her nose\"oh my, I suppose this is a good demonstration of what can happen. An outfit I might have worn in my early twenties and me being 48 now. At least this shows what can happen. <br>\r\n<br>\r\nAnyhow my dears, you can go home though with some conditions. You have to never mention being time agents. Also, you won't be going home to life exactly as you knew it.<br>\r\n<br>\r\n There will always be something different and you just have to accept it.\"<br>\r\n<br>\r\n\"Why...I didn't ask for this, at least I don't think I did...\"<br>\r\n<br>\r\n\"Whew, is it warm or just me?\" Jayne complained as she fanned herself.<br>\r\n<br>\r\n\"Don't you worry there sweetie pie, you do get used to it and the changes don't seem to be too radical. Speaking of radical, the free radicals seem to be having quite the time with you darling,\" she let Jayne know,\"I'd say you are dealing with menopause. By the way, nice flower print blouse there sunshine.\"<br>\r\n<br>\r\n\"Eeeek, this is something my Aunt Gladys would wear, and with tan polyester slacks...it's...it's...\"<br>\r\n<br>\r\n\"I can see the family resemblance,\"laughed Denise, as she found suddenly  found herself a flat chested ten year old in a bratz t-shirt, blue jeans, and tennis shoes with her hair in pigtails. \"What the...my chest...\"<br>\r\n<br>\r\n\"...laugh at me will you girlie girl,\" Jayne chuckled. <br>\r\n<br>\r\n\"Well, fine, I'm going to join Jason at the playground,\" she said as she ran off.<br>\r\n<br>\r\n\"Is there anything further to know my dear?\" Jayne asked, feeling a little more comfortable than a moment before. Taking out her compact, she found her hair more gray still with touches of white. Creases had formed around the sides of her mouth, crows feet deepened, she wore elegant older woman's squared glasses on a wooden beaded chain, her breasts had lowered a touch and her neck had started to get wobbly. Slight jowls were showing, and she noted her voice was a bit raspier, deeper in tone. Her eyes had gotten slight bags, and she wore a girdle as well.<br>\r\n<br>\r\n\"Yes, honey. We agents have to stick together. No matter what, you are now paired with your partner. As for what you do as time agents, just keep going and you'll be where you need to be when we need you there, and in the condition we need you--whether young or old, male or female, fat or skinny,\" she said as a large sized girl in her late teens came up to their table with a middle aged business man in tow, as they watched Tanya visibly get younger and younger until a baby in diapers sat there before them. <br>\r\n<br>\r\n\"Looks like it's time for her diaper change,\" laughed Jason, as Jayne found herself leaning on a cane, wearing bifocals, her hair now completely white.<br>\r\n<br>\r\n\"Looks like we best be a goin, eh dearie?\" she said as the belt went off, and she and Denise vanished.<br>\r\n<br>\r\n</span></div></div>",
            "created":1221973200,
            "id":591662,
            "title":"Some Conditions May Apply"
        },
        "111121122":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Find the tar pits she fell in and stay near",
                "Figure out why technology is futurized a bit first"
            ],
            "content":"<div class=\"\"><div> <span>You open your eyes to the present and look around. And you can immediately tell somethings not right. But you can't quite place what it is. Eh, you think, its probably nothing, as I have been in the past. You take out your cell phone and start to call Denise, but you can't get a signal. Hmm, phone tower must be down or something.<br>\r\n<br>\r\nYou start to walk along, heading for Denise's house, 'cause you're sure she must be heading there too, now that you're back. But while you're walking, you notice something that nearly makes you jump out of your skin. Some of the cars aren't using wheels and are hovering instead. You look down at the belt, and sure enough it does say the same day you left, but it looks like a little ways into the future. People you pass are wearing the same fashions of clothes, but all the technology you see is a little futurized. <br>\r\n<br>\r\nThen you notice a holographic billboard and your jaw drops in horror. The headline reads \"Tar pit lady digitally reconstructed!\" Below the headline is a side shot of Denise's face. She must have stayed in the past. <br>\r\n<br>\r\nBut how? You were so sure it was the bracelet that connected you both. Or could she have been far enough to be out of range of the belt?<br>\r\n<br>\r\nWhat to do now?</span></div></div>",
            "created":1200891600,
            "id":494692,
            "title":"The same, but different"
        },
        "1111212":{
            "author_id":"sweetvengeance",
            "author_name":"Corra Nyx",
            "choices":[
                "Go back to your time.",
                "Spin and get the hell out of there."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You and Denise start to work your way up the dinosaur's tail, toward his back. All of a sudden the creature lets out a loud roar.<br>\r\n<br>\r\nDenise begins to panic and she reaches over to the belt to get you guys out of there.</span></div></span></div>",
            "created":1208840400,
            "id":522883,
            "title":"Head for the tail and work your way up"
        },
        "11112122":{
            "author_id":"3oct1111",
            "author_name":"Wendy",
            "choices":[
                "Yours or Denesis parents (Better not mess with theme)*Wink Wink*",
                "Some other person"
            ],
            "content":"<div class=\"\"><div> <span>You wind up close to your own time but still a ways off, your in the year before you where born, more spesificaly the day of your own connseption. And for the sake of lazy writing Denises to.<br>\r\n<br>\r\n\"Now this is how to time travel\" Denise said<br>\r\n<br>\r\n\"Yeah\" You said<br>\r\n<br>\r\n\"Lets go find someone we know when they where young\"</span></div></div>",
            "created":1260334800,
            "id":803278,
            "title":"Spin and get the hell out of there."
        },
        "111121221":{
            "author_id":"3oct1111",
            "author_name":"Wendy",
            "choices":[
                "Your parents (A consert)",
                "Denises parents (happy houre at a bar)"
            ],
            "content":"<div class=\"\"><div> <span>\"Lets see what oure parents where like before us\" Denise says<br>\r\n<br>\r\n\"Maby it's not sutch a good Idea\" You say \"If we affect them in any way it could totally change our lives\"<br>\r\n<br>\r\n\"Good point\"<br>\r\n<br>\r\n\"I'm just kidding I always wanted to punch my dad\" You say</span></div></div>",
            "created":1260334800,
            "id":803279,
            "title":"Yours or Denesis parents (Better not mess with ..."
        },
        "111121222":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "a martial art  female student who later became famous",
                "a young Ed Sheeran(before he was famous)",
                "the shy Jim."
            ],
            "content":"<div class=\"\"><div> <span>Who should we meet--asked Denise.<br>\r\n<br>\r\nJay replied - I was thinking of a celebrity or athlete and befriend them when they were not just famous.<br>\r\n<br>\r\nDenise sighed  I was hoping to meet our other friend  Jim who is too shy.  If we met him earlier, we might have overcome his shyness.<br>\r\n<br>\r\nJay paused a bit and went to meet</span></div></div>",
            "created":1557241860,
            "id":2656576,
            "title":"Some other person"
        },
        "111122":{
            "author_id":"norman33",
            "author_name":"Norman33",
            "choices":[
                "You give in to Denise and go some when else",
                "You want to look around some more"
            ],
            "content":"<div class=\"\"><div> <span>One look around and you know you must be in the future. You’re in some kind of large city with a dome. A man holding some kind of device is standing just a few feet from you looking at you with a startled look on his face. He then looks at your belt and says, “Ah, you’re time agents”. He then comes up and shakes you hands. “Anything I can do to help”, he says with a smile.<br>\r\n<br>\r\n Thinking quickly you say, “Yes there is. We’re having a problem with our spatial displacement temporal locater. Where and when are we”, you ask making up a lot using stuff you’ve seen in science fiction show. “Oh, well that’s easy you’re in New Chicago and it’s the year 2113”, he answers. “What’s with the dome”, you ask out of curiosity? His expression changes slightly and he says, “It’s to keep out the glaciers. All the northern cities have had them for years”. <br>\r\n<br>\r\n“Glaciers, how can you have glaciers? What about global warming”, Denise blurts out? Now he really does get a concerned look on his face. “I don’t know anything about global warming. When are you two from? You do know that time travel is prohibited and can only be done by time agents and selected scientists,” he says, backing away. You quickly respond by saying, “My partner is new and still gets disoriented in the time jumps. I can’t tell you when we are from exactly except by saying the future. We’re having a global warming problem there and we’re trying to trace back to when it started. <br>\r\n<br>\r\nThe man relaxes some and says, “No warming here friend. We’ve been in an Ice Age for the past 80 years. I do remember now something about global warming in the beginning of the 21st century, but that turned out to be BS. It seems that the earth warms up slightly right before an ice age. It was a normal cycle, but the scientists of the time misinterpreted it, and blamed it on man-made emissions. They passed a lot of regulations and restrictions on the burning of fossil fuels. It destabilized the world economy and caused a fuel shortage. When the cold hit, more than half the world population died as a result. You guys probably know all this though”. <br>\r\n<br>\r\nShocked by this, but managing to keep a cool face you thank the man and he goes on his way. Denise on the other hand is more emotional. “I don’t think I want to know anymore about the future”, she says. <br>\r\n</span></div></div>",
            "created":1199250000,
            "id":517780,
            "title":"To the future"
        },
        "1111221":{
            "choices":[
                "Berlin, Germany 1941 (Oh Noes!)",
                "Moscow, Russia 1956 (In Soviet Russia time travels you!)"
            ],
            "content":"<div class=\"\"><div> <span>You decide its better to not jump that far into the future again since its not always good to know too much about the future as you just found out. You look down at the time belt and think about what year to visit when you notice a previously overlooked feature. A certain knob with a display says Chicago.<br>\r\n<br>\r\n\"Wow! This just keeps getting better!\" You say. \"What?\" Denise says. \"It appears to have an option to select a city.\" you tell her while trying to turn the knob but it seems to be stuck. <br>\r\n<br>\r\nFinally you get fed up with the knob and just smack the belt hard causing it to send traveling through time again and you end up in......</span></div></div>",
            "created":1221368400,
            "id":582306,
            "title":"Darn Knob"
        },
        "11112212":{
            "author_id":"australorp",
            "author_name":"Beatrix Amber Robinson",
            "choices":[
                "You time travel to escape",
                "You're arrest before you can press the button"
            ],
            "content":"<div class=\"\"><div> <span>An icy breeze hits your face.  You close your eyes in an instinctive reaction against the cold.  Once you open your eyes, you see a man holding a gun to your face.  \"I need to see your internal passport,\" he says in a demanding voice.<br>\r\n\"We don't have one,\" you say.<br>\r\n\"Then I'm afraid I'll have to take you into custody.  You might be forgien spies.\"</span></div></div>",
            "created":1223787600,
            "id":594502,
            "title":"Meet the KGB"
        },
        "111122121":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "Berlin 1941",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so where do you end up then?</span></div></span></div>",
            "created":1452153960,
            "id":2085574,
            "title":"You time travel to escape"
        },
        "1111222":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Someone wants to sell you something",
                "It's the popo! The man didn't believe your story"
            ],
            "content":"<div class=\"\"><div> <span>It probably would be good to go back, but you just can't help taking a quick look around. \"We'll just stay for 15 minutes then we'll get out of here.\" you tell Denise. <br>\r\nShe quickly flashes a concerned look, but since its only 15 minutes she quietly nods her ascent. \"But only 15 minutes.\"<br>\r\nYou start walking down the street, and Denise is close on your heels. You soon come to a place of bustling commerce, and realize if it weren't for all the future tech, it'd be just like the farmer's market your mom used to bring you to when you were a kid, back when you lived in Minnesota. You watch the people closely for a minute, but no one is exchanging any type of currency. Then you notice people scanning customers arms where theres a barcode seemingly tattooed on. You point this out to Denise and she starts to get interested too. <br>\r\nSuddenly a hand clamps down on your shoulder. </span></div></div>",
            "created":1201237200,
            "id":490913,
            "title":"You want to look around some more"
        },
        "11112221":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Get some animal DNA in you",
                "Keep yourself you"
            ],
            "content":"<div class=\"\"><div> <span>Startled, you jump around and back away from the man, who looks very similar to a snake. \"Welcome to Sssstephanssss geneticssss shop. I'm Sssstephan.\" Damn, the guy even sounds like a snake. And you could swear his tongue is forked like one too. He continues, \"You look like a bear of a man, or that you would like to be assss one with the bear sssspirit. Or maybe the lady would like to purr assss the kittenssss do?\"<br>\r\n<br>\r\nWhat could this guy be going on about? Denise is wondering the same thing and says as much. \"What do you mean?\"<br>\r\n<br>\r\n\"I am sssspeaking about ssssubstituting geneticssss of animalssss with your own. You could become fasssster, sssstronger, or maybe sssslipperier?\" At this he somehow winds his body halfway around Denise until his legs are on one side of her, but his head and arms are in between the both of you. \"What ssssay you, travelerssss? Interessssted?\"<br>\r\n<br>\r\n\"We don't have any money to, even if we wanted to.\" Denise tells him matter of factly. <br>\r\n<br>\r\n\"Are you ssssure about that?\" asks the snakeman. \"I sssssee you both wear antique timepiecessss on your wrisssstssss. I'm ssssure they would cover the cosssst of one treatment.\"<br>\r\n<br>\r\nBeing stronger or faster would be a boon with sports, and just fun in general. Though what if there were side affects?</span></div></div>",
            "created":1205125200,
            "id":507349,
            "title":"The slippery shopkeep"
        },
        "111122211":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Page 1, Bear or Snake",
                "Page 2, Bat or Shark"
            ],
            "content":"<div class=\"\"><div> <span>\"What do you have to offer, that wouldn't be too noticeable?\" you ask, more than a little intrigued.<br>\r\n<br>\r\nDenise gets a slightly horrified look on her face, grabs you by the shoulder, and blurts out \"You can't seriously be thinking of doing this Jay? Who knows what could happen!\"<br>\r\n<br>\r\n\"I'm just willing to hear a little bit more about what he has to say. I can always walk away if I don't like what he says.\"<br>\r\n<br>\r\n\"A wissse sssentiment my boy. There is sssertainly no harm in lisssstening. Come inside with me and I can show you a catalog.\" Stephan dissappears behind a red curtain in the side of a small shack, and with a shrug to Denise, you follow him inside. <br>\r\n<br>\r\nWithin the shop is a massive waiting room, with a viewport to a lab that looks quite clean, especially given Stephan's slippery nature. In fact it looks so massive you don't understand how it could fit in the little shack. Stephan points you in the direction of an electronic catalog fitted onto the wall, and within moments you figure out how to go from one choice to another. There's so many options, and all are so appealing its hard to make a choice. There's bear DNA, which would undoubtedly make you stronger. Snake, which has obviously made Stephan quite flexible, as you look over and he seems to be doing some feats with his body that would be impossible with a regular spine. And quite frankly looks a little gross. <br>\r\n<br>\r\nTurning to the next page there's Bat ears, which would increase your hearing, and shark gills that could allow you to breath under water. There's several other pages, but not much looks appealing to you at this point. <br>\r\n<br>\r\nSo what do you choose from?</span></div></div>",
            "created":1223355600,
            "id":592099,
            "title":"Get some animal DNA in you"
        },
        "1111222111":{
            "author_id":"scarecrow131",
            "author_name":"MossyA",
            "choices":[
                "Bear",
                "Snake"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So which one do you choose</span></div></span></div>",
            "created":1354242720,
            "id":1478485,
            "title":"Page 1, Bear or Snake"
        },
        "11112221112":{
            "author_id":"scarecrow131",
            "author_name":"MossyA",
            "choices":[
                "Skin (Scales)",
                "Spine (Naga)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I choose the snake DNA\" you said to Stephan.<br>\r\n\"Oh excccelent,\" he said \"Now, where to put the DNA\"</span></div></span></div>",
            "created":1354243080,
            "id":1478489,
            "title":"Snake"
        },
        "111122211122":{
            "author_id":"scarecrow131",
            "author_name":"MossyA",
            "choices":[
                "You go back to your present (People think you were always like that)",
                "You decide to stay "
            ],
            "content":"<div class=\"\"><div> <span>\"I think that it'll hurt a bit, but I'll choose the spine to put the DNA\"<br>\r\n\"OK, now that'sss all sssorted out. I'll get you ready\" and with that Stephan disappeared and returned a minute later with 3 syringes and anaesetic.<br>\r\nHe made the base of your spine numb as well as your legs.<br>\r\nYou asked why the lega and he replied by saying<br>\r\n\"In order for the legsss to fusssse to become the tail\" right before he jabbed the syringes into you, one in each leg and the 3rd one into the spine.<br>\r\n\"Don't be ssshocked if you cant ssstand up, It happensss to everyone\"<br>\r\nWith that, you fell over and watched as your toned legs ripped through your shorts stretched to a length of almost twenty feet, and they finished fusing soon after. The thin legs began to get thicker as they were filled with the muscles that make a snake's tail so flexible. The skin at her feet began to crack and dry out, being covered over by small scales.  <br>\r\nThe scales spread out from where the injections were. The top of her tail was also covered with a dark green diamond pattern. The scales formed hard plates on her front, and her breasts expanded several cup sizes to a full and pert DD-cup. The scales came to below her breasts, but still left them smooth and soft. Her waist narrowed and her hips widened just a bit, still allowing her to keep her attractive hourglass figure.<br>\r\n </span></div></div>",
            "created":1354243680,
            "id":1478494,
            "title":"Spine (Naga)"
        },
        "111122212":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Trout DNA",
                "Tigress DNA"
            ],
            "content":"<div class=\"\"><div> <span>\"No thanks.\" you say, turning around to leave. \"I'd prefer to stay myself.\"<br>\r\n<br>\r\nSuddenly Denise pipes up, \"What kind of animal DNA is available?\" You give Denise a slightly surprised look. Though it does make some sense. She never was really strong. Kind of a clutz sometimes actually. <br>\r\n<br>\r\n\"Well, there'sss many different choicessss, from the aquatic, mammal, or airborne varietiessss.\" the stephen replies.<br>\r\n<br>\r\n\"I assume anything that lets me fly would give me feathers?\" Denise asks, with a thoughtful look on her face, finger on her chin in thought. <br>\r\n<br>\r\n\"For the mosssst part, yesssss. I've heard tell that flying issss sssensssational!\"<br>\r\n<br>\r\n\"Yes, but that would be too conspicuous though. What is very unnoticeable to people everyday?\" <br>\r\n<br>\r\n\"Darling, if you want your change to go unnoticed by your friendssss, for asss long asss possible, you would do right to ssselect either the Trout for itsss gills, or the Tigressss, for its agility and ssstrength.\"<br>\r\n<br>\r\n\"A Trout?\" you interrupt. \"Why is a trout the most discrete fish?\" <br>\r\n<br>\r\n\"It meldssss the best with our geneticssss, for sssome reassson.\" <br>\r\n<br>\r\nNow Denise gives a thoughtful hmmm, and thinks it over. Suddenly her eyes light up. \"I want you to give me some </span></div></div>",
            "created":1206594000,
            "id":513525,
            "title":"Denise is an Animal!"
        },
        "1111222122":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "You and Denise are back",
                "You and Stephen are back, he stole the bracelet from Denise!"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok, give me some Tigress DNA!\" exclaims Denise. \"I've always wanted to be faster.\"<br>\r\n<br>\r\n\"Sssertainly, madam. If you would follow me back into thisss room, and leave your antique timepieccce on the counter to the left, we can get ssstarted.\" Here Stephen dissapears behind some purple curtains, while beckoning Denise to follow. She does, with you right behind. When Stephen notices you have entered as well, he stops you with a scaly hand on your chest, and says \"Only paying cussstomersss are allowed within, you may ssstay jussst outssside, however.\"<br>\r\n<br>\r\nGiving you a reassuring look, Denise says \"Don't worry, I'll be ok.\" Still not entirely sure about Stephen, you accept Denise's wishes, and sit on a stool just outside. <br>\r\n<br>\r\nAfter about 20 minutes, which you spend watching the weird varieties of people and aliens doing business, Denise and Stephen com out of his booth. \"Now be sssure to get some good ressst tonight, and you will be able to feel the changesss once you wake.\" Good day to you folksss. At this he dissapears into the crowd to presumably find more customers.<br>\r\n<br>\r\n\"So what all did he do to you?\" you ask, curiosity getting the better of you.<br>\r\n<br>\r\n\"He just scanned me with something, then gave me two injections. He also gave me this,\" here she holds up a vial of blue liquid, \"and told me to drink this before I go to bed tonight. Well, should we head back home?\"<br>\r\n<br>\r\n\"Yeah, this'll be interesting to see what happens.\" Adjusting the dials on your belt, you set it for home and press the red button. A flash of light and...</span></div></div>",
            "created":1207717200,
            "id":517778,
            "title":"Tigress DNA"
        },
        "11112221221":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Does Tiger lady want some pancakes?",
                "Less sleep, more fun with future products!"
            ],
            "content":"<div class=\"\"><div> <span>The light of traveling fades, and you see by the clocktower it's now 8:50. Looking just beyond it you see the magnificent hues of purple and orange, as the sun sets on the day. <br>\r\n<br>\r\n\"Wasn't it closer to noon when we left?\" Denise asks.<br>\r\n<br>\r\n\"Yeah, but I figured, you got your new look to try out, so why not get to it sooner? Besides, we may not have been in other times that much, but I'm beat. So much to wrap my head around.\" you reply.<br>\r\n<br>\r\nHere Denise lets a large yawn escape. \"Guess you're right, I didn't even realize I was tired. Guess I'll see you tomorrow morning Jay.\"<br>\r\n<br>\r\n\"Later!\" Denise tosses you the bracelet and with a wave you part ways for the night. But as you start trekking the few blocks back to your place, do you really want to go to sleep now? You could go straight to the morning and see how she is with her new DNA immediately. Or maybe search through time for a way to sleep less, and still be rested...</span></div></div>",
            "created":1209531600,
            "id":526132,
            "title":"You and Denise are back"
        },
        "111122212211":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "It's Denise, seeing the results",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You walk the 3 blocks to the nearby Immense House of Pancakes, and get 2 orders of pancakes to go. After paying and walking outside, a quick adjustment and boom its dawn. Blinking your eyes against the suddenly bright sun, you start to make for Denise's apartment. <br>\r\n<br>\r\nIt's not long before you do arrive, but just as you are about to knock on the front door there's a loud noise from Denise's open bedroom window. What happened?</span></div></div>",
            "created":1210482000,
            "id":530587,
            "title":"Bringin pancakes to Tiger lady"
        },
        "11113":{
            "author_id":"sseiler76",
            "author_name":"cards_fan_76",
            "choices":[
                "State your name",
                "Denise offers to do anything in order to be let go"
            ],
            "content":"<div class=\"\"><div> <span>You awaken with Denise at your side in a dark ten by ten room.  There is a man on the other side of the room surrounded by a strange blue glow.<br>\r\n<br>\r\nThis man speaks “I am Time Cop Charlie.  You will be held in this cell until your trial.  You are in violation of Time Codes 1 and 14, unauthorized time travel and time travel by unauthorized personnel.  Please state your names for the record.”<br>\r\n</span></div></div>",
            "created":1201669200,
            "id":517781,
            "title":"Malfunction!"
        },
        "111131":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "a 7ft tall lithe female commando",
                "a 5ft tall ripped male commando"
            ],
            "content":"<div class=\"\"><div> <span>You reach down to check the belt, but find it's not on you anymore. <br>\r\n<br>\r\n\"You will find your belt and weapons are no longer within your reach.\" Charlie states. A spotlight suddenly turns on and is shining on a table next to him. There you can see within a glass box, the belt, your swiss army knife, and for some strange reason Denise's lipstick and nail polish. Denise gives you a puzzled look and shrugs. \"State your names, or we shall force them out of you. Unauthorized time travel is not something thats taken lightly here.\"<br>\r\n<br>\r\nYou are obviously in trouble, and it would probably be best to just cooperate with him. You sigh, then say \"This is my friend Denise, and I'm Jay.\"<br>\r\n<br>\r\nSuddenly there's a loud explosion in the distance, and an alarm starts blaring. Red lights start to flash in each corner of the room, a door opens behind Charlie, and he runs over to it. You look at Denise and see she's just as wide eyed as you. Gunfire is going off nearby, and another explosion goes off, closer than before. You could've sworn it was from the other side of the wall behind you. Thinking its best to get away from possible explosions, you pull Denise to the center of the room. Sure enough, the wall behind you collapses, and out of the smoke walks someone with futuristic armor and camouflage body paint.. It's...</span></div></div>",
            "created":1201755600,
            "id":522505,
            "title":"State your name"
        },
        "1111311":{
            "author_id":"sseiler76",
            "author_name":"cards_fan_76",
            "choices":[
                "You have returned to your own time.",
                "You have gone somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>It's a 7ft tall female commando. She walks in, glances quickly in your direction, then steps up to the box with your belongings in. She  brings the butt of her gun down on the corner, where it easily separates one side from the rest, and she grabs your belt. She hands it to you, then she also gives Denise and you each a bracelet, while saying \"Hurry, put these on. They are shielded from the Time Cops.  You are now members of the Renegade Time Traveler Union.\" <br>\r\n<br>\r\nAs soon as you put on the bracelet, you see a bright flash of light.<br>\r\n<br>\r\n</span></div></div>",
            "created":1201842000,
            "id":522507,
            "title":"a 7ft tall lithe female commando"
        },
        "11113112":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Wake sleeping ugly",
                "There's gotta be a way out of here"
            ],
            "content":"<div class=\"\"><div> <span>When the bright light fades, you're in a large white room with a fat guy in a silvery suit sleeping at a desk. There's a large green sign on the wall above him with 'Reception' printed on it. The desk is empty except for a plastic tablet of some sort, a little halfcircle in the middle that kinda looks like a boob and nipple, and a bell with a sign next to it that reads 'Wake if sleeping.'<br>\r\n<br>\r\nShould you wake him, or try to find a way out?</span></div></div>",
            "created":1202878800,
            "id":497674,
            "title":"Now where is this?"
        },
        "111131121":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "You both scored the same",
                "Mixed results"
            ],
            "content":"<div class=\"\"><div> <span>You tap the bell, and the man wakes with a start. He looks around bewildered for a second, taking you and Denise in before he says, \"Welcome to the Union!\" <br>\r\n<br>\r\nHe reaches across to shake both your hands, then grabs the tablet and presses a few buttons. The nipple looking thing lights up and a screen appears in front of him. He presses a few more buttons and 2 more tablets like his pop out of your side of the table. \"Fill in any personal information it asks for, and answer the questions at the bottom of the form.\" <br>\r\n<br>\r\n\"Is there anywhere we can sit while we fill this out?\" you ask. <br>\r\n<br>\r\nHis brow darkens slightly as he presses a few buttons on his tablet, and two stools rise out of the floor on either end of the room. As you walk towards the stool, you can swear you hear him mutter 'primitives' under his breath. When you say \"What?\" he just responds with \"Don't dawdle and fill those out.\" <br>\r\n<br>\r\nLooking at the form there's the usual questions of name, age, sex, birthday. Then at the bottom it looks like a history/psychological exam.  When was the first moon landing? What color is the sky? What prompted the outbreak of the third world war? Purple is to rain, as Orange is to Crush; True/False? California became an island in what year?<br>\r\n<br>\r\nMore than half of these questions don't make any sense at all! But you fill it out, and bullshit it, as best as you can. Getting up to give the tablet back to the man in the silvery suit, you see his computer screen is now 3D and he's playing some sort of super tetris. He sees you getting up and says \"Stay there, put the tablet in your stool and I can get your results here. <br>\r\n<br>\r\nDenise finishes then as well, and you wait for a few moments as the man changes his tetris screen to a set of report documents. He seems to be concentrating on them pretty heavily, and seems surprised by several answers.</span></div></div>",
            "created":1202965200,
            "id":497958,
            "title":"Time for a test!"
        },
        "1111311211":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Charlie, it was a timecop test",
                "The leader of the Renegade Time Traveler Union"
            ],
            "content":"<div class=\"\"><div> <span>\"You both came up with the same results.\" says the man. \"Not surprising really, when two people are from the same time. But here and there we are surprised. Anyways, you passed.\"<br>\r\n<br>\r\nHe presses a button on his tablet and glass comes from the floor to encase the both of you. Then the stools start moving towards each other along the wall, until you are right next to Denise separated only by your glass casing. Then the wall rotates behind you, and you're both in a different room. <br>\r\n<br>\r\nNow standing in front of you is the 7ft tall commando that rescued you earlier and...</span></div></div>",
            "created":1202965200,
            "id":497962,
            "title":"Same results"
        },
        "11113112112":{
            "choices":[
                "Help save the time lines and stop the time cops. ",
                "Live out as much of your life left in peace without risking it too much"
            ],
            "content":"<div class=\"\"><div> <span>You see the commando that saved you and Denise earlier standing alongside a man who you assumed was the leader of the union. \"Hello, I am General John Morgan. I am the current leader of this group of ruffians. he said smirking at the female commando who glares at him whith an intensity that could freeze suns. \"Ahem, in any case I see you've met my second-in-command Joana or Jo as we here at the union call her by the way you looked at her when you came in. She's the leader of our best platoon called Sirius Platoon. You'll be seeing alot of her around from now on.\" he explained.<br>\r\n\"What's going on? We just want to go home. We don't want to in this union of yours.\" you say and Denise nods in agreement. \"I'm sorry to tell you both, but you are a renegade time traveler forever now that you're wanted by the time cops. Even if you went back home, you'll be hunted down. We also can't allow you to get caught by the time cops alive because you are here now and they can trace where you've been if you're caught for too long. We can't allow for our base to be compromised, I'm sorry.\" John saids sadly shaking his head. \"You'll have to stay at this facility from now on, but whether you choose to help us in our cause is up to you entirely. Before you make any decisions, allow me to explain the situation and what we are fight for first.\"<br>\r\n\" The Renegade Time Traveler Union or RTTU is an organization comprised of time travelers who have had encounters with the time cops. Initally it was just a group that despised the time cops and it was more like a terrorist group than anything. Recently though, upon coming across a certain file we managed to steal from the Time Cop main computer, we found out about a plan from the Temporal council to raise a vast army and sweep across all possible time lines which of course over the length of time the universe has been around is countless universes branching off from different time lines. They will not be able to target them individually as this will take way too much time and manpower to do so they are planning to go for the main time branches and more importantly the main time line in the past which we have located is this one we're in. We have the past tightly guarded though so we'll know when they attack. Therefore, this version of the RTTU is under the heaviest stress because the main Time cop HQ is also in this time line. We are trying to prevent this plan from succeeeding, but we need all the people we've got in every single timeline we can muster to battle the Time Cops when the plan is enacted.  What we have to do to prepare for this is contact as many agents we can in as many timelines as we can while all the while we are also attempting to finish the Time Cops off here in this timeline hopfully so the plan isn't activated because this version of their HQ is responsible for setting off the plan. If their plan starts though, the time lines may be severly changed and disrupted so we are trying to stop it as much as possible on our end. Any questions?\" John finishes shuts up after his very long speech. Your head and Denise's is still spinning <br>\r\nWhen you regain your senses you ask\" What about their future main HQ? Can't they start the plan?\" \"No, we designed a blocker that stops the tme cops in the future fromgetting to the past. Only the current and past are open to them now. That being said, we have to protect the time disrupter at all cost or the plan will immediately enact more or less. Now, decide if you want to help us or not. We will not force you but any help is appreciated. If you choose to help us, basic training will be two days from After that, you and Denise followed Jo down the hall  now just down the hall from the rooms that Jo will show you to. \" he said and walked off into another room.      <br>\r\nAfter he was gone, Joana walked down the hall to the left and Denise and you followed. After a couple turns, you came upon a heavy metal door.\" This will be your room John. Please try not to wreck the place. Changes of clothes are provided and a training suit in case you decide to show for training. Communicate to me with the communicator on the wall when you've reached your decision.\" She said and moved off with Denise to her room further down the hall. You walked up to the door and it scanned you and somehow knew you were and it unlocked. Once you got inside, you notice the communicator on the wall next to the door and otherwise, the place looks like an average one person apartment  You lay on the bed and carefully consider what John had said and what has haoppened since you got the time belt. Should you help them save the time lines and attend basic training or should you just let them figure it out themselves and you live on without risking killing yourself(though you may die if they get attacked). Finally you come to a decisioon after much debate. </span></div></div>",
            "created":1250312400,
            "id":744447,
            "title":"The leader of the Renegade Time Traveler Union"
        },
        "1111311212":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "'You failed!' uh oh, poor you!",
                "'You passed! uh oh, poor Denise!"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I have mixed results from the two of you.\" he says. \"One of you has passed, and the other has not. Of course the one who did pass will go immediately into training, while the one who did not will be evaluated again.\"<br>\r\n<br>\r\nWith this he presses a button on his tablet and glass comes up from the floor to encase you in at your stool. The wall behind you starts to rotate bringing you around to a different room. You're now in a new room, and there's a big light up sign on the wall that shows...</span></div></div>",
            "created":1202965200,
            "id":497959,
            "title":"Mixed results"
        },
        "111131122":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "The left button",
                "The right button"
            ],
            "content":"<div class=\"\"><div> <span>You and Denise whisper to each other and start poking around the room trying to find an exit. Finding none, you turn your attention back to the desk, while Denise decides to check the walls again. The tablet on the desk has a screen with several little buttons on it, all with strange symbols that you can't read. They do look familiar for some reason, but you can't quite place them. <br>\r\n<br>\r\nMight as well press one of them, and see what happens. Not like there's anything else in this room.</span></div></div>",
            "created":1202878800,
            "id":497675,
            "title":"No way out?"
        },
        "1111311221":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Yep, with Denise on the other side",
                "Nope, he shut the door with a hidden switch"
            ],
            "content":"<div class=\"\"><div> <span>You press the left button, and suddenly a door opens near Denise. The sound of the door opening also wakes up Mr. Sleepytime here though. He's a bit bewildered, but wakes up quickly and shouts \"HEY!\"<br>\r\n<br>\r\nDenise rushes through the door, and you're not far behind. It's too bright on the other side to see what's through from inside. If you can just make it, you'll find out whats there.<br>\r\n<br>\r\nDo you make it?</span></div></div>",
            "created":1202878800,
            "id":497678,
            "title":"The left button"
        },
        "11113112211":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Saved by a rival gang attacking the Peroxsides!",
                "The smallest member of the gang speaks up"
            ],
            "content":"<div class=\"\"><div> <span>You make it through the door, and it suddenly slams shut behind you. Waiting a second, your eyes adjust to the light, and you see you're on a walking pathway between several buildings. It's like an open skyway, with people all around, walking and joking like nothing is wrong at all. And off to the left, just beyond what looks like an observation platform, you can make out a stunning sunset, turning the sky all sorts of shades of orange.<br>\r\n<br>\r\nYou and Denise look back at the building you just came out of, but there's no door anywhere now. Other buildings nearby there's clearly defined archways sticking out, but behind you is nothing but a concrete wall. Its like there never was a building that you came out of in the first place.<br>\r\n<br>\r\nSuddenly you hear a whirring noise coming towards you. Turning you see several guys on what look like a cross between a skateboard and a surfboard, and they're floating in the air! And they're coming at you pretty damn fast! \"Move it yepero!\" the leader says. \"Out of our way while we ride the flows.\"<br>\r\n<br>\r\nBacking up, you trip and fall down, while the gang of board riders float over you and a similarly stunned Denise on her butt as well. The last guy in the group even does a little jump against the wall, then flips over before rejoining the pack. <br>\r\n<br>\r\nThe pack of board riders who has now formed a semicircle around you. The one that spoke before leans forward on his board, putting it at a 45 degree angle toward the ground, and leans down close to you. \"What do you think you're doing, getting in the way of our flow riding, you punk yepero. This is Peroxide turf here. Everyone knows to get out of our way when we ride. Or we show them why they should!\" <br>\r\n<br>\r\nThis can't be good. Now that all of them are around you, you notice they share a these large red earphone type things, and all have a faint purple aura surrounding their arms. This is some kind of future skate gang!<br>\r\n<br>\r\nWhat now?<br>\r\n<br>\r\n</span></div></div>",
            "created":1203656400,
            "id":501311,
            "title":"Outside, and in trouble"
        },
        "111131122112":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Tell the truth, 2008",
                "Play dumb. \"What are you talking about?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Snake!\"<br>\r\n<br>\r\n\"Yeah?\" replies the guy who's holding his face in front of you. At least its good to know that no matter the year, people in gangs still take on ridiculous nicknames to sound tough.<br>\r\n<br>\r\n\"Leave them alone, they ain't from around here. Isn't that right?\"<br>\r\n<br>\r\n\"Yeah, we actually don't have any idea where we're at.\" Denise pipes.<br>\r\n<br>\r\nSnake grins and says \"All the more reason to let them know who's turf it is.\" At this he pulls out a handle to something, and flicks a switch to make a little purple and red blade appear, then sticks it in the concrete behind your head as he starts to bring it closer. It cuts through the material as if it were plastic!<br>\r\n<br>\r\n\"SNAKE! Who is your MATRIARCH!\" Even though this knife is inches from your head you realize a matriarch is always a female. And this is confirmed when the smallest member inches forward on the board and removes her hood to reveal prominent latina features, and a stern, disapproving countenance. <br>\r\n<br>\r\nSnake deactivates his knife, then steps off his board to kneel before her. \"Torch is my Matriarch, may she ride the waves forever.\"<br>\r\n<br>\r\n\"Ride the waves forever.\" echo the rest of the riders. Torch slaps Snake once, a ring creating a thin strip of blood across his cheek, before she moves forward and extends a hand to you. \"So travelers, welcome to 4219. What time are you from?\" She knows you're time travelers?</span></div></div>",
            "created":1204693200,
            "id":505748,
            "title":"The Matriarch of the Peroxides"
        },
        "1111311221122":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "They beat you to a bloody pulp",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>\"What time?\" you ask, deciding to play stupid. And she sees right through you. Her features turn to a disapproving scowl, and she flips her hood back on. <br>\r\n<br>\r\n\"I thought you would be grateful to someone who just saved your life.\" she says. \"Do what you wish Snake.\" She steps back on her board the front of it rises, as she moves back among her goons.<br>\r\n<br>\r\n\"Wait!\" you say, but she doesn't listen, and half the gang takes off on their boards. Snake and the other half, however, pull out wicked looking weapons and break out evil smiles, and close in on you and Denise.<br>\r\n<br>\r\nWhat are they going to do to you now?<br>\r\n<br>\r\n</span></div></div>",
            "created":1207976400,
            "id":518902,
            "title":"Play dumb. \"What are you talking about?\""
        },
        "11113112211221":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "content":"<div class=\"\"><div> <span>Snake and the Peroxides take thier turns flailing thier whips, cutting you and Denise, and everything else they can do. Noone comes to help you, cause they're all too scared from the terror the Gang members have instilled in them before. Local law enforcement does arrive eventually. But there's not really anything they can do for you. Medical science has improved considerably in thier time, but it still can't bring the dead back to life...</span></div></div>",
            "created":1217394000,
            "id":563211,
            "title":"A bloody mess"
        },
        "11113112211222":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Good riddance to the garbage",
                "Frozen as well"
            ],
            "content":"<div class=\"\"><div> <span>One of the Peroxide members comes forward with what looks like an energy whip, and lashes it at you. Instinctively putting your arms up, you feel a searing pain and a shocking jolt all at once along your arm, as the energy whip opens a long slash and cauterizes it again in an instant. The Peroxides laugh, and whip boy lashes again. <br>\r\n<br>\r\nYou keep your arms up, but he didn't go for your chest or head this time. The whip connects with the belt, and everyone screams as the whip explodes into an aura of light, encompassing all present. You tingle all over, and through your blindness you can make out a faint outline to your arms and a slight purple electric charge moving over them. It doesn't hurt at all, and you stare in wonder. <br>\r\n<br>\r\nAs the brightness fades and everyone can see again, Snake yells \"What did you do to Ep's whip you time bastards!?!\" Not waiting for an answer, he charges for you whirling a chain. Putting your arms up again, the chain wraps around your left arm, which lights up with energy. Snake screams out in pain as he's thrown back by the glowing chain. He's launched into the air, and suddenly the air around him ripples a muted blue, like a droplet landing in a pool of water, and he just hangs suspended in midair. <br>\r\n<br>\r\nThe other gang members gape at Snake in shock, and several take off for wherever they can get that's far away. <br>\r\n<br>\r\nDo they get away or are they stopped like Snake?</span></div></div>",
            "created":1215579600,
            "id":563205,
            "title":"Untamed energy + Time belt = The unknown"
        },
        "111131122112222":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Time suddenly reengages on its own",
                "Run to the edge, hope the bubble stays where it is"
            ],
            "content":"<div class=\"\"><div> <span>Many of the Peroxide members run off as well, but just end up stopping at the same distance from you as Snake, about 10ft away. The rest of the Peroxides gaze back and forth at you and their frozen comrades just hanging there<br>\r\n<br>\r\n\"What did you do Jay?\" Denise asks you, eyes wide with fear.<br>\r\n<br>\r\n\"I wish I knew.\" you reply. Looking beyond the frozen gang bangers, you notice that everyone beyond the periphery is frozen as well. The whip interacting with the belt must have damaged time in this spot and formed a bubble. Question is, how do you escape it, or just disable it?</span></div></div>",
            "created":1217394000,
            "id":563210,
            "title":"In a time bubble"
        },
        "1111311221122221":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "A spark from the belt hits you",
                "You press the button to engage for home"
            ],
            "content":"<div class=\"\"><div> <span>While staring at the belt trying to figure out how to undo the damage, theres a sudden spark and sound comes flooding back to you. Looking up, all the Peroxide members are suddenly running away from you again, with the exception of Snake who is flying backwards quite fast. In fact he slams against a guard rail and tumbles over, falling down the steps on the other side. <br>\r\n<br>\r\nAfter a few moments you can hear him groaning. \"I think we should get out of here Jay, who knows if they're gonna come back for us...\" says Denise quite worriedly. <br>\r\n<br>\r\n\"I think you may be right. Let's beat it.\" Reaching down you start adjusting the dials for home. </span></div></div>",
            "created":1219467600,
            "id":573511,
            "title":"All in motion again"
        },
        "11113112211222211":{
            "choices":[
                "Yes, the spark gave you the power to control time.",
                "No, it's just another time bubble."
            ],
            "content":"<div class=\"\"><div> <span>As you adjust the dials to send you back to your time, a spark suddenly comes out of the belt and hits your hand. \"Ouch, what the hell?!?\" you exclaim as you notice you're starting to glow a mysterious white color. Then you start to feel very cold.\"God, I'm FREEZing, are you cold too Denise?\" you say. You say as you look towards her and gasp. She is very still looking at you looking like she was about to say something. \"Denise?\" you say as you wave your hand in front of you. Did the bubble act up again? No, it couldn't have unless it only had enough power to affect you this time. No, that can't be it. Could time have frozen? Why did it happen and... how? All you said was you were freezing. That white aura surronding you is suspicious too. Wait, maybe you somehow commanded time to freeze. Did you actually gain the power to control time? </span></div></div>",
            "created":1250226000,
            "id":744151,
            "title":"Time powers?"
        },
        "1111311222":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Wake up and everything is ok",
                "Wake up in chains"
            ],
            "content":"<div class=\"\"><div> <span>You press the right button, and suddenly the nipple looking thing on the desk lights up. Suddenly a screen lights up in the middle of the air. It looks like... a computer?<br>\r\n<br>\r\nThis could be cool. But suddenly, like all computers, it has a startup sound. Bum bum bum! And of course Mr. Sleepy wakes with a start. He looks quite bewildered until he sees you standing next to him with his computer in your hands. And now he's pretty angry. <br>\r\n<br>\r\n\"Hey!\" he yells, grabbing the tablet out of your hands. He's surprisingly fast for an older fat guy. He quickly punches several buttons on the tablet, and some kind of glass tube falls from the ceiling to encase you. <br>\r\n<br>\r\nHe says something in a strange language, and hearing this you say \"What?\"<br>\r\n<br>\r\nHe comprehends, and repeats in english \"You didn't wake me with the bell, so you must be an enemy.\" You look over and see Denise is in a similar glass prison. You look back at the man and he presses another button. This causes some yellow mist to come shooting in from the floor and ceiling. You can't help but cough at the acrid odor. As you feel yourself losing consciousness you recognize the language he spoke. It was Chinese. Maybe Denise can talk a way out of this, she took Chinese back in high school. <br>\r\n<br>\r\nAnd everything goes dim.</span></div></div>",
            "created":1202878800,
            "id":497677,
            "title":"It's a computer!"
        },
        "11113112222":{
            "author_id":"hurttoto",
            "author_name":"^HURTTOTO^",
            "choices":[
                "1 hour later",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Denise: finally your awake ! she says as you slowly wake up \"wha?\" your in chains unlike any you seen before they weren't steel or futuristic like you exspected them to be but they had a plastic like smell in fact they were made out of plastic \"why are the chains made out of plastic? yet \" ypu say as you notice a small peice of metal magnetically attached to the \"plastic\" chains \"its made out of something that doesn't exists mabey its being computer generated\" said Denise \" good you learn fast \" said the fat guy speaking through a window  but now that you see him he looks more... like a video game character suddenly a guy looks like this (<a rel=\"nofollow\" href=\"https://t7.rbxcdn.com/c931d68b2979bdd29a49a8c76186edd1\" target=\"_blank\">https://t7.rbxcdn.com/c931d68b2979bdd29a...</a>) come in and say \" do the tresspassers like chichen?\" \"uh no also did you get builderman on this we havent had a exstra terrestrial visitor since..... well ever we sheilded up the whole planet didnt we? unless..\" \"ill go ask him (floats away comes back 3 seconds later)\" he said give them a chance to explore roblox but keep watch over them.<br>\r\n<br>\r\nwhat happens next?</span></div></div>",
            "created":1486332360,
            "id":2273889,
            "title":"Wake up in chains"
        },
        "1111312":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "you a brief kiss and hands the belt to Denise",
                "Denise a brief kiss and hands the belt to you"
            ],
            "content":"<div class=\"\"><div> <span>In comes a 5 foot tall ripped guy, looking like a futuristic Rambo. \"General!\" he says, \"We're glad to see you safe. We must get out of here, immediately!<br>\r\n<br>\r\nOut of the settling dust come three more people, in similar futuristic garb. One of them says \"What's taking so long, come on!\" He's wearing goggles and has spiky brown hair, but you can't determine anything else about his features with all the grime covering his face. <br>\r\n<br>\r\nAnother commando, a female with shapely legs and tufts of brown hair sticking out of her bandanna takes a quick look at you and swears. \"You morons, this isn't the commander! Or at least not the General we're looking for.\" She walks over to glass case as the Rambo guy sets up to guard the door Charlie left through, and the other 2 take up positions on either side of their hole. \"Just as I thought, this is a younger version, this belt is so obsolete! No wonder you were caught!\"<br>\r\n<br>\r\nShe breaks open the glass covering and starts fiddling with the belt. She takes a few pieces off and replaces them with parts of her own belt, which is much shinier. Throughout all this Denise and yourself have just been standing in shock staring at the four strange people that obviously know you both. <br>\r\n<br>\r\nFinished with her upgrades, she walks up in front of you both and says \"This is the best I can do outside of my lab. We have to go find the current versions of yourselves now, but you'll at least be safe from being taken by the Time Agency for a while. Captain, you certainly are cute without the scar. Here's your belt General.\" She gives...<br>\r\n</span></div></div>",
            "created":1201842000,
            "id":495017,
            "title":"Commandos, HO!"
        },
        "11113121":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "2436, the Isle of California",
                "2059, Rioting in China"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait a second,\" Denise says, \"I'm your General? And this is his belt, not mine.\"<br>\r\n<br>\r\n\"What!!!\" exclaims the shocked woman. You notice the other three commandos are looking at the both of you shocked as well. <br>\r\n<br>\r\n\"Julia, this is bad.\" says the one to the right of the hole with a large beard.<br>\r\n<br>\r\nJulia looks back at him disapprovingly, \"I can see that, the time streams must be even more destabilized than we thought.\" Turning back to you and Denise, she says \"You should get out of here now, find previous versions of ourselves and start the time rebellion. I suggest you start in either 2436 on the Isle of California to find myself, or during the riots of 2059 in China to find Grinder.\" Here she indicates the skinny guy on the left side of the door with the goggles. <br>\r\n<br>\r\nHe briefly waves at the two of you, before turning back to guard the door. So, which shall it be?</span></div></div>",
            "created":1202446800,
            "id":495685,
            "title":"Time Streams gone bad"
        },
        "111131211":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Streets of London, UK",
                "Toronto Canada"
            ],
            "content":"<div class=\"\"><div> <span>\"Isle of California?\" you ask. \"Isn't California a state? And not an Island?\"<br>\r\n<br>\r\n\"Not after the San Andreas fault upheaval of 2029.\" says Julia. \"And then the second great American Civil War of 2048. After that Alaska joined Canada, and California became a sovereign entity. The rest of the 47 states became split between the Northeast and Southwest, eventually becoming the North US and Greater Texas. The capitals are still Washington D.C. and Mexico City though!\"<br>\r\n<br>\r\n\"Wait, Mexico City? And what about Hawaii?\" asks Denise. <br>\r\n<br>\r\n\"That,\" she says somberly, \"sunk from the shockwaves of California splitting from the mainland.\"<br>\r\n<br>\r\n\"Well what about...\" but Julia cuts you off. \"No more time for explanations, we have to leave now! Get to my time and make your way to the west!\" And as if to punctuate her statement gunfire erupts in the halls, which Grinder gladly returns, all while yelling in broken english.<br>\r\n<br>\r\nAs Julia returns to the hole in the wall, you quickly turn the knob to 2436, and press the red button. Big white flash and you're suddenly in 2436. But where?</span></div></div>",
            "created":1202792400,
            "id":497338,
            "title":"The Isle of California?"
        },
        "111132":{
            "author_id":"sseiler76",
            "author_name":"cards_fan_76",
            "choices":[
                "Charlie takes Denise up on her offer",
                "Charlie charges Denise with more Time Code violations"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Denise responds “My name is Denise.  I will do anything if you let us go.”  While unbuttoning, the buttons on her shirt.<br>\r\n<br>\r\nCharlie calls her a Time Whore and:</span></div></span></div>",
            "created":1201669200,
            "id":492669,
            "title":"Denise offers"
        },
        "1111321":{
            "author_id":"sseiler76",
            "author_name":"cards_fan_76",
            "choices":[
                "Denise accepts the offer",
                "Denise declines the offer"
            ],
            "content":"<div class=\"\"><div> <span>“So you are offering to do anything?” Charlie asked.  Charlie then tells her that he is a polygamist and look for a fourth wife.  He offers, “Denise, if you agree to return to my time with me and become my fourth wife.  I will fix your friend’s time belt and bracelet, so it is very hard for us, Time Cops, to tract his time travel.  Then if he chooses he can go on his way.  But first, I must warn you, I like my wives barefoot and pregnant.”</span></div></div>",
            "created":1202360400,
            "id":495453,
            "title":"Charlie takes Denise up on her offer"
        },
        "1111322":{
            "author_id":"sseiler76",
            "author_name":"cards_fan_76",
            "choices":[
                "Accept Charlie’s offer",
                "Decline Charlie’s offer"
            ],
            "content":"<div class=\"\"><div> <span>Charlie adds “Denise, I am adding the violations of Time Code 7, offering to have sex to someone not of your time and Time Code 16, attempting to bribe a Time Cop.  Sir, since you are witness, and due to the severity of these new Time Code Violations charged to Denise, I can drop the time code violations charged against you if you agree to testify against Denise. \"</span></div></div>",
            "created":1201669200,
            "id":517782,
            "title":"Charlie charges Denise"
        },
        "112":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "content":"<div class=\"\"><div> <span>What!?!?! There's a shiny red button and you don't press it? What the hell is wrong with you... <br>\r\n<br>\r\nIts a piece on a belt, what could possibly go wrong? <br>\r\n<br>\r\nNow man up and quit being a little wimp. Go back a chapter and press the shiny red button. It's not like its a big red button on some essential control board for anything! Then again, even then I might press it. Just to see what happens. Something could explode...</span></div></div>",
            "created":1199250000,
            "id":563214,
            "title":"What's wrong with you, PRESS THE BUTTON!"
        },
        "12":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "It's night time, several hours earlier",
                "It's night time, several hours later",
                "There's tons of bright lights, it's a future nightclub",
                "Hippies drive by, its the 70s!",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You and Denise start off for Aj's house, laughing and joking. Though you get the odd feeling you're being followed. You look behind you but brush it off as your imagination. You turn back around and suddenly there's a man in front of you. <br>\r\n<br>\r\n\"Give me the Time Belt, Boy!\" Snarls the man. With the small shock of blond hair poking out from under his cap, and his intense blue eyes, he looks pretty menacing. <br>\r\n<br>\r\n\"This thing?\" you ask, holding up the belt in your hand. \"I bought this fair and square at that garage sale. Go get your own!\"<br>\r\n<br>\r\nHe takes a small step towards you, then another. Now Denise is getting a little scared by him. Suddenly he breaks out into a full run and jumps at you. You swing your right fist around to stop him, but hes got a hand on the belt anyways. You struggle for a minute before he loses his grip, and you fall back. In doing so, you end up pressing a big red button on the belt, and suddenly everything flashes bright white.<br>\r\n<br>\r\nWhat happened?</span></div></div>",
            "created":1202014800,
            "id":494215,
            "title":"Attacked!"
        },
        "121":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "He notices you wearing the belt",
                "He doesn't notice you",
                "He knocked himself unconcious  with the fall"
            ],
            "content":"<div class=\"\"><div> <span>After the flash of light fades, you realize its night time. You're in the exact same spot, but its dark and there's no one around. Taking out your cell phone, you see the time and date suddenly change before your eyes to the previous night. You look up the street where the garage sale was and suddenly notice the man that attacked you sneaking around.<br>\r\n<br>\r\nIt probably wouldn't hurt to get a closer look so you sneak up to the house next door and watch from the bushes lining the yard. You can just make out the guy sneaking around the house. He looks pretty nervous. Suddenly he takes off his belt... The same belt you're wearing right now! He takes off the belt and tosses it in the basement window of the place. Then he gets up and starts running around to the back. <br>\r\n<br>\r\nSuddenly three more guys in blue uniforms come running up to the front, they at first pass the house by, when suddenly one back up and looks down and sees the man climbing over the fence to the yard behind. \"There he is!\" yells the man. \"Stop fugitive, you cannot Time Travel now, we have frozen the temporal displacement here. Turn yourself in!\"<br>\r\n<br>\r\nAll three start running after the man, when one suddenly trips on a root and falls right in front of you. The other two are starting to climb the fence.</span></div></div>",
            "created":1202014800,
            "id":494223,
            "title":"The previous night"
        },
        "1211":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Wake up alone in a concrete box with only a ceiling camera",
                "Wake up in a jail with forcefield doors",
                "Wake up strapped to a hospital bed"
            ],
            "content":"<div class=\"\"><div> <span>As he's getting up, he glances in your direction. He quickly shines his flashlight at you, notices the belt, and shouts to his comrades, \"Over Here! Don't move fugitive!\" <br>\r\n<br>\r\nUh oh, he thinks you're the other guy. You back out of the bush and get up to run, but suddenly you see a flash of light before you're hit by a paralyzing pain. You collapse to the ground, and find you can't move at all. The three officers slowly walk around you, and you can see the one that tripped is holding a ray gun of some sort. After a moment more one of the men puts a pair of bracelets on your wrists, presses a button, and they magnetize together. <br>\r\n<br>\r\nThe one with the ray gun sneers at you before saying \"I'm Time Cop Charlie, and we've finally caught you Jorgenson. I don't know if you realize how many Time Code Violations you've committed, but you're going away for a very long time. Good night, criminal.\"<br>\r\n<br>\r\nCharlie shoots you again, and everything goes black. This could be trouble.</span></div></div>",
            "created":1202101200,
            "id":494583,
            "title":"He notices you wearing the belt"
        },
        "12112":{
            "author_id":"amylaverick",
            "author_name":"Nish Laverz",
            "choices":[
                "You are taken to a room with mirrored walls and a table and 2 chairs in the midd",
                "you are taken somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>You wake up. As your eyes focus on your surroundings you realise you are in a room with three metal sides, the forth side at first glance looks open, but as you go to walk forward you are thrown back by an invisible force. It takes a few minutes for you to realise what just happened and as you sit your self up you see a silver clad figure standing  just in front of you pointing a long silver stick at you.<br>\r\n<br>\r\n'Get up' he says wiggling the stick in your direction.<br>\r\n<br>\r\nYou hesitate for a monent looking at the figure who top you looks like something out of a Science Fiction film.<br>\r\n<br>\r\n'Get up' He says again this time proding you with the stick.<br>\r\n<br>\r\nYou feel an electric shock run through you makingyou decide to get up before he does it again.<br>\r\n<br>\r\nProdding you in the back the figure pushes you forward.<br>\r\n<br>\r\nWhere does he take you?</span></div></div>",
            "created":1260248400,
            "id":802927,
            "title":"Wake up in a jail with forcefield doors"
        },
        "121122":{
            "author_id":"3oct1111",
            "author_name":"Wendy",
            "choices":[
                "One of them morphs into a man",
                "Fun as is",
                "Emergency"
            ],
            "content":"<div class=\"\"><div> <span>Jay was left in a strange room it was pale grey with yellow grid limes on the floor and the walls had lights clusterd at seemingly random points.<br>\r\n<br>\r\nA single battered green sofa stood in the center, with Jay sitting on it. He was hunched over, his right leg bounced up and down  and frankly he was nervous. He waited in that room for the 45 longest minutes of his life, for someone anyone to come in. Finally though, two officers made their way in.  The first a woman, who Jay would assume was Latina if not for the single white horn that grew out of her the center of her for head, the second was a large man who inspite of looking to be no more then 30 had completely white hair and instead of his left arm had a robotic replacement.<br>\r\n<br>\r\n\"Hello Mr. Dunkle, I trust you know why your here\" the man said in a nutral voice.<br>\r\n<br>\r\n\"ISwearIDidntDoAnythingThisGuyJustAttackedMeAndMyFriend\" Jay better out in one breath.<br>\r\n<br>\r\n\"Relax\" the woman said holding a manila folder, she went to drop it and a coffee table manifested itself for the folder to land on \"We know what happened, we had agents go back and watch the incident. If you weren't there we wouldn't have caught the guy. We owe you our thanks, and since you've been treated so badly the Time Agency decided you should have some fun before being sent back.\"<br>\r\n<br>\r\nJay just stares stunned, but that's nothing to what happens next. The woman, without warning is replaced by a long curly pink haired woman, with pale skin and perfect curves. She was dressed in juat a light pink tube top and darker pink ruffled short skirt that barely contained her crotch. Strangest of all she starts rubbing herself all over in a way that drove Jay wild.<br>\r\n<br>\r\nJay completely confused lookes to the male agent who proceeds to also be replaced with a beutiful woman. This one was slightly tan and had ginger hair in a low ponytail and only wore what looked like a pink sports bra.<br>\r\n<br>\r\n\"Um, what?\" Jay said completely confused.<br>\r\n<br>\r\n\"Go on touch us. This is your reward.\" The ginger girl says in a monotone \"we transformed for your pleasure.\"<br>\r\n<br>\r\nJay stood up and the couch vanished as he did. \"Transformed? So you're still the same cops?\"<br>\r\n<br>\r\n\"Of course silly, what did you think we teleported? That would be geode negligence of the tech.\" The pink one said cheerfully.<br>\r\n<br>\r\n\"Could.. Could I transform to? \" Jay asks curiously.<br>\r\n<br>\r\n\"In this room you could be whatever you want, just concentrate\" the bottomless ginger girl explained.<br>\r\n<br>\r\n\"You can even change your mind, though it will all go back when you leave. It's holograms like in the show Star Trek from your time, of course the show Star Trek in our time is a documentary show about the journey to different stars, this season is Betelgeuse\" the perky pink one rambled.<br>\r\n<br>\r\n\"Ok, I'm going to try this\" Jay said concentrating. In a flash where Jay once stood was now a resplendid purple haired woman who wore a bra, puffy princess sleeves and a long flowing skirt that  exposes her hips all in purple with light blue accents and belt. \"Ok I want to get my metaphorical money's worth out of this body while I have it.\"</span></div></div>",
            "created":1510729500,
            "id":2415470,
            "title":"you are taken somewhere else"
        },
        "1211222":{
            "author_id":"3oct1111",
            "author_name":"Wendy",
            "choices":[
                "The Ginger one",
                "The Pink One",
                "Both"
            ],
            "content":"<div class=\"\"><div> <span>Responding to Jay's subconscious mind the room morphs into a club's dance floor. Surprised it takes Jay a moment to start dancing to the music, unused to the female body he currently had moved it was a little clumsy bit he was bouncing and shaking, he found the pink cop in the non descript crowd and started shaking and grinding with her.<br>\r\n<br>\r\nSatisfied with the scenario but not done, the room shifted putting a wall between him and the pink one. Now in a lush jungle wearing a loincloth Jay went looking around. On the beach he found the ginger one amid pices of a destroyed ship, forgetting what this was he ran to her and preformed CPR.<br>\r\n<br>\r\nAgain the room shifted and he was in a bedroom, the bed was covered in satin sheets and inviting Jay to join ___________ on the bed.</span></div></div>",
            "created":1510878120,
            "id":2416155,
            "title":"Fun as is"
        },
        "12113":{
            "author_id":"jimminycritic",
            "author_name":"Jimminycritic",
            "choices":[
                "Agree to the operation and wake up when?",
                "Wait for a better plan."
            ],
            "content":"<div class=\"\"><div> <span>You wake up strapped to a hospital bed which you recognize as such, but you don't have a care in the world because everything feels alright.  You see images floating in the air which you intuitively believe to be your heart beat, pulse-oxygen, and etcetera.  You can't help but hold your breath to see if your theory might be right and almost immediately the pulse-oxygen goes down as your oxygen level in your body decreases.  A sort of wonder crosses your mind as you realize that you seem devoid of feeling.  Your logical abilities seem intact though as you further your beliefs into guessing you are in a future hospital.  “Logically”, you think to yourself, “you have lost your mind.”<br>\r\n<br>\r\nJust then, a shadow looms over you and a feminine voice declares, \"Jorgenson!  It's been a long time but I am here to bust you out so hold still.\"<br>\r\n<br>\r\nYou try to speak but nothing comes out.  You can do nothing but look at this female who apparently knows you except you aren't 'Jorgenson'.  This woman has a name tag which said, \"Omy\" and he wondered if it was a joke but he didn't feel like laughing.  The woman was wearing an all white uniform except for a swastika that he was sure was backwards and that was red.  She had straight blond hair and deep blue eyes. <br>\r\n<br>\r\n\"The deal is since you can understand me is that we have to transplant your brain and psych into another body but I promise you won't feel a thing.\"Omy said quietly.  \"It's going to take about an hour and we have people who are in place to ensure we won't be interrupted but we have to hurry.  Do you agree to the operation?\"<br>\r\n</span></div></div>",
            "created":1226120400,
            "id":605500,
            "title":"Wake up strapped to a hospital bed"
        },
        "1213":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Take it with you",
                "Crush it",
                "Leave it alone"
            ],
            "content":"<div class=\"\"><div> <span>As the man falls and hits his head on a rock, his fellow pursuers keep on following the blond man. Soon enough they are over the fence and you're alone with an unconscious man. Might as well find out about these Time Cops. <br>\r\n<br>\r\nYou crawl out from under the bush and check out what the man has on. He's wearing a futuristic uniform, and even though he's from another time it just screams law enforcement. He has a bracelet on his wrist, and when you touch it a hologram of a badge pops out in the air in front of you. It says Time Cop Charlie, 31415926535. Wow, how many time cops are there?<br>\r\n<br>\r\nYou then turn your attention to his belt. It's obviously a more advanced version of the belt you have on. There's also a holster attached to the belt, and it has a ray gun of some sort in it. You deftly pull it out, thinking it may help you during your experiments with your time belt. <br>\r\n<br>\r\nLooking over Charlie some more, you find he doesn't have anything more that could help you, except for a crystal on the other side of his belt. It's labeled Temporal Displacement Field. That could be handy, or it could be annoying, if it really does disrupt time travel. <br>\r\n<br>\r\nWhat do you do with it?</span></div></div>",
            "created":1202101200,
            "id":494307,
            "title":"Meet sleeping Charlie"
        },
        "12132":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "It's cracked",
                "It won't break!"
            ],
            "content":"<div class=\"\"><div> <span>It would probably be best to just leave it where it is, you think. Otherwise these time cops might find out about your soon time traveling escapades. Besides, Denise is still with that guy in about 12 hours from now. You have the time cops ray gun, so it should be easier to save her now anyways. You look at the belt and its buttons, and realize there's not just time settings on this thing, there's also size settings! That could be fun later, but Denise comes first.<br>\r\n<br>\r\nYou adjust the time settings on the belt, then go to press the red button... but nothing happens. You look back over your shoulder at Charlie lying there, with the glow of the crystal faintly shining beneath his overcoat. So it does disrupt time travel. Hmm. Well you're already taking the ray gun, so might as well destroy this crystal too. <br>\r\n<br>\r\nYou go back over to Charlie and take the crystal out of his pocket, and place it against a rock. You lift your foot up to crush it, and at the same time Charlie wakes up. He yells \"NOOOOO!!!\" just as you start to bring your foot down...</span></div></div>",
            "created":1202878800,
            "id":497661,
            "title":"Crush the crystal?"
        },
        "121321":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Charlie disappears midleap in a blue mist",
                "Charlie knocks you over"
            ],
            "content":"<div class=\"\"><div> <span>You bring your shoe down atop the crystal, and you hear it crack. That's a tough little bugger. You raise your foot to stomp it again. Charlie gets up into a crouch to stop you, then propels himself at you. <br>\r\n<br>\r\nYou bring your foot down on the crystal again, and this time there's an even more satisfying crunch as the crystal shatters. </span></div></div>",
            "created":1202878800,
            "id":497660,
            "title":"Now it's crushed"
        },
        "1213212":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "He starts bawling",
                "He's severly pissed, and more than a little psycho now"
            ],
            "content":"<div class=\"\"><div> <span>As the crystal shatters underfoot, Time Cop Charlie continues his forward leap. He's not in time to save the crystal, but he does succeed in knocking you over into the grass. <br>\r\n<br>\r\n\"You Moron!\" He yells as his face turns bright crimson. He is livid! He stares at your face in shock and anger for a while, and having him knock the wind out of you with that leap there's not much else you can do.<br>\r\n<br>\r\nSuddenly he stands up and begins pacing back and forth muttering to himself. All you can make out is him saying 'stuck,' and 'destabilized.' He doesn't sound very angry now, just immensely worried. And are those tears?<br>\r\n<br>\r\n</span></div></div>",
            "created":1204606800,
            "id":505479,
            "title":"Time Cop Tears?"
        },
        "12132121":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Reinforcements! More time cops are stuck",
                "Others show up"
            ],
            "content":"<div class=\"\"><div> <span>Charlie suddenly falls to his knees and is bawling his eyes out. This is certainly unexpected.<br>\r\n<br>\r\nEver curious, it ain't long before you ask \"What is wrong with you man?\"<br>\r\n<br>\r\nHe turns his face towards you, and with red eyes and soaked cheeks, says \"That crystal, it was made to prevent fugitives from escaping by jumping to another time. But now that it's smashed, the essence of the crystal is permeating this time. People are still able to come to this time, but now no one can leave for another dozen years or so.\"<br>\r\n<br>\r\n\"That can't be all bad. I mean, how many people time travel anyways?\"<br>\r\n<br>\r\n\"You still don't get it, do you buddy. Time is eternal, so there are more people traveling all the time, no matter what restrictions are set. People forget about the technology, only to let it be reinvented. Or the items are refound after some apocalypse or another. And now that none can leave this time, it's going to get very crowded around here.\"<br>\r\n<br>\r\nHe's right, more time travelers could arrive at any time. In fact...</span></div></div>",
            "created":1206421200,
            "id":512743,
            "title":"He's bawling"
        },
        "12133":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Aj will help you out, and his couch is pretty good, for a couch",
                "The sis will help you out.... or will she?"
            ],
            "content":"<div class=\"\"><div> <span>It would probably be best to just leave it where it is, you think. Otherwise these time cops might find out about your soon time traveling escapades. Besides, Denise is still with that guy in about 12 hours from now. You have the time cops ray gun, so it should be easier to save her now anyways. You look at the belt and its buttons, and realize there's not just time settings on this thing, there's also size settings! That could be fun later, but Denise comes first.<br>\r\n<br>\r\nYou adjust the time settings on the belt, then go to press the red button... but nothing happens. You look back over your shoulder at Charlie lying there, with the glow of the crystal faintly shining beneath his overcoat. So it does disrupt time travel. Guess it's time to find a place to stay for tonight. <br>\r\n<br>\r\nAj is nearby. Denise is nearby too, but what if seeing her interrupts the timeline and you never get the belt in the first place, what would happen then? Best not to chance it. <br>\r\n<br>\r\nYou start to walk to Aj's house, when you suddenly remember your older sister Kristine who just moved back in town last week. You havn't seen her in several years, and were out of town at Aj's parent's cabin when she moved back. Surely she'd be willing to help you out. Your mom said she was rooming with some friends, and most of her friends always thought you were a handsome little brother. Imagine what they'll think now that you're 20! And it's only 3 blocks farther than Aj's house.</span></div></div>",
            "created":1202706000,
            "id":497199,
            "title":"Leave it alone"
        },
        "121332":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Tell her the truth",
                "Make something up"
            ],
            "content":"<div class=\"\"><div> <span>You walk along, and realize it really was a nice night last night. Or now it is a nice night tonight as the case would happen to be. Not cold so you don't feel uncomfortable in your t shirt. Not many people out anymore tonight. It's not long before you arrive at Kristine's new pad. <br>\r\n<br>\r\nYou walk up to the door and notice several lights on. There's also the faint sounds of women laughing. Won't she be surprised to see me you think. Then you knock. It takes a few moments but someone finally comes to answer the door. \"Hello?\" says the cute little asian girl who answers. She has her hair up in pigtails, large glasses hanging from her tanktop, and a mini bucket of ice cream with a spoon in it in her left hand.<br>\r\n<br>\r\n\"Hi, is this Kristine's place?\" you ask. You don't remember this particular friend of hers. <br>\r\n<br>\r\n\"Yeah, just a second.\" she says, before half closing the door and yelling inside, \"KRISTINE! Someone for you.\" A few moments later, and there she is, your older sis Kristine. <br>\r\n<br>\r\n\"Bro? What are you doing here, it's been forever!\"<br>\r\n<br>\r\n\"Yeah, it has. Sorry to come over like this, but I'm in a bit of a jam, I need a place to crash for the night. Can you help me out?\"<br>\r\n<br>\r\n\"Well we're kinda having a girls night in. What's wrong with your's and John's place?\"<br>\r\n<br>\r\n\"Well, about that...\"</span></div></div>",
            "created":1202965200,
            "id":497990,
            "title":"At Kristine's house"
        },
        "1213321":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Try to use the belt again",
                "Turn off your cell phone and have them call you"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm kinda in two places at once. I don't want to chance some sort of time paradox or anything by meeting myself.\" You hear giggles from behind the door after you say this. Then full on laughing. <br>\r\n<br>\r\nThe door opens wider and you see her old friends Ashley and Laura, along with the cute little asian girl, all with big grins. Then Ashley says to Laura, \"Told you he'd make something up to get in here once he heard about our girls night.\"<br>\r\n<br>\r\nThen Laura says, \"But he is pretty cute now that he's all grown up. Let's bring him inside and hear the rest of his far-fetched tale. He can be our cheap entertainment for the night.\"<br>\r\n<br>\r\n\"Oh fine.\" responds Kristine. \"Come on in Bro. Entrance Laura with another of your fantastic tales from childhood. I'm getting more ice cream before we listen to this though. By the way, this is Toshiko.\" The little asian woman smiles at you before she sits takes the couch with Laura and Ashley.<br>\r\n<br>\r\nThey let you in, and you sit down in their living room. It's not long before you've told them everything from the day so far, and how you came to the night before. You even show them the ray gun you took earlier. <br>\r\n<br>\r\n\"Not one of your best stories by far bro. Though the props are a nice addition. Anything else you wanna say before we kick you out and go back to our movies?\"<br>\r\n<br>\r\nTime to prove it to them. But how? The gun could be dangerous, so best save that for later.</span></div></div>",
            "created":1202965200,
            "id":497992,
            "title":"Tell her the truth"
        },
        "12133211":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Standing as high as her knee",
                "Bumping your head into thier 9 ft high ceiling"
            ],
            "content":"<div class=\"\"><div> <span>\"Well,\" you say, \"maybe the belt will work now.\" You stand up and fiddle with it a little, and press the button... but nothing happens. \"Damn\"<br>\r\n<br>\r\nAshley lets out a disappointed sigh, then they all start laughing. \"I was actually hoping it would do something. Can't believe I fell for that.\" <br>\r\n<br>\r\nThen you look over at the size switches you noticed earlier. \"Guess I'll try these ones then.\" You fiddle with them, press the red button again, and...<br>\r\n<br>\r\n\"Oh my!!!\"<br>\r\n<br>\r\nYou were standing next to Laura. Now you are</span></div></div>",
            "created":1202965200,
            "id":497993,
            "title":"Proving the belt"
        },
        "121332111":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Laura",
                "Toshiko"
            ],
            "content":"<div class=\"\"><div> <span>\"Holy crap, where'd he go?\" Laura asks. Reaching out you put your hand on the back of her leg. She looks down before screaming, then turns to face you and back away. She promptly falls on her rear, and you feel the shock waves from her fall. <br>\r\n<br>\r\n\"Oh my god, thats fuckin' awesome!\" exclaims Ashley, who gets off the couch and kneels in next of you. <br>\r\n<br>\r\n\"Stare any longer and you're gonna have to purchase, little lady.\" you say. Everyone breaks out into a nervous giggle at this ironic statement, though the girls are quickly recovering. Ashley grabs you around the waist and picks you up, bringing you closer to her face. Looking down you can see the huge mounds below you, and forward is her huge face. That cute little mole she has on her cheek seems huge now. <br>\r\n<br>\r\n\"So you changed size with that belt, and also traveled through time with it earlier?\" Boy, being this close you can sure smell the salsa on her breath now. <br>\r\n<br>\r\nCrinkling your nose a little from the smell, you respond with a quick \"Yep.\"<br>\r\n<br>\r\n\"And can you change other people's sizes and bring them through time with you?\" chimes in Laura, recovering from her initial shock and now standing up.<br>\r\n<br>\r\n\"Maybe, I havn't fully checked out this belt yet. Only bought it an hour ago.\" The clock on the wall suddenly chimes 11 o'clock. \"Make that 14 hours from now.\" you amend. The ladies are all standing around staring at you now, and another nervous giggle escapes them all. \"If you set me down, I can check out the belt some more and see if it can.\"<br>\r\n<br>\r\nAshley gets very excited by this and does a few quick little small jumps, nearly squeeling in anticipation. \"Yes, yes, please!\" She turns around and sits down on the right end of the couch, placing you on the center cushion. Changing the settings back to normal, you press the red button and grow again. You take the belt off and they all stand or sit around you looking at the belt. Turning it over to the back, you find three pieces that detach. And underneath each piece is velcro straps, making the item a bracelet. <br>\r\n<br>\r\n\"These things might link the wearer to the belt, otherwise why would they come off?\" You set them down on the table in front of you and say \"Since there's only three, who's sitting out?\" While you put the belt back on, the ladies discuss their options. <br>\r\n<br>\r\n\"I'm his sister, so I deserve a bracelet.\" states Kristine matter of factly. <br>\r\n<br>\r\n\"I really really want to do this now.\" says Ashley. \"Besides, I wasn't so scared that I fell over backwards at a tiny man.\" Here she looks rather pointedly at Laura. <br>\r\n<br>\r\n\"Ok, fine.\" Laura looks at Toshiko here, who makes the motion of starting rock paper scissors. Smiling, Laura says \"You're on!\"<br>\r\n<br>\r\nWho wins?</span></div></div>",
            "created":1203397200,
            "id":500052,
            "title":"Knee high"
        },
        "121332112":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Just Toshiko",
                "More the merrier!"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly you bang your head into their ceiling. Shocked, you stumble for a second and knock Laura over, then fall ass backwards into their glass coffee table, shattering it and sending ice cream and drinks splattering everywhere. <br>\r\n<br>\r\n\"Holy crap!\" shouts Laura. Toshiko echoes with a \"Jeez man, my table!\"<br>\r\n<br>\r\nIt takes a moment but you're able to get up. You dust off you jeans before standing up, all hunched over. \"Believe me now when I say this is a special belt?\"<br>\r\n<br>\r\n\"Yeah, but did you have to smash through my table?\"<br>\r\n<br>\r\n\"Sorry, the suddenness kinda surprised me. I hadn't tried the size settings yet. Forgive and forget?\"<br>\r\n<br>\r\n\"Ok, so it was an honest mistake, but you gotta let me try that thing out a bit. I've always wanted to be huge!\" Toshiko now has a far off look in her eyes, dreaming of the possibilities. That might actually be fun. But you don't really wanna give them control of the belt, it is your toy after all.<br>\r\n<br>\r\nSuddenly Ashley pipes up from the other side of the room. \"Whats that over there?\" You turn around and look where shes pointing to notice a round object on the floor. <br>\r\n<br>\r\n\"Hey, there's more of them on his belt!\" exclaims Tosh. Before you can look she reaches out and grabs one off. Did she just grope your ass a little bit too? \"It looks like a bracelet of some sort. Maybe it links others to the belt wearer!\" That would be nice, you wouldn't have to give up control of the belt, but could still increase the size of this hot Asian. <br>\r\n<br>\r\nYou quickly reduce your height back to original, so you don't have to stoop so low, and the bracelet shrinks right in her palm. \"Ok Tosh, put it on and I'll make you bigger with me.\"<br>\r\n<br>\r\n\"Yay!\" She doesn't hesitate and slips it right on.<br>\r\n<br>\r\n\"What about the rest of us, make us bigger too!\" says Kristine. Do you really want to make them all bigger, or just have some fun with Toshiko?<br>\r\n<br>\r\n</span></div></div>",
            "created":1204693200,
            "id":505717,
            "title":"Proof, and growth, positive"
        },
        "12133212":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Time to make a call",
                "Your argument is a sinking ship"
            ],
            "content":"<div class=\"\"><div> <span>You take out your cell phone and turn it off. \"Ok sis, call my phone.\" <br>\r\n<br>\r\nAnd the girls burst out laughing at this. \"Boy,\" says Ashley, \"he sure is determined now ain't he.\" <br>\r\n<br>\r\n\"Yeah,\" agrees Kristine. \"What do you girls think, should we humor him or just kick him out now and get back to our movie?\" <br>\r\n<br>\r\n\"Oooh!\" exclaims Toshiko, \"Let's watch Titanic again.\"<br>\r\n<br>\r\n\"Awww, I think his determination is kinda cute.\" says Laura.<br>\r\n<br>\r\nWho do they listen to, you, or a sinking ship?</span></div></div>",
            "created":1202965200,
            "id":498053,
            "title":"Turn off your cell phone and have them call you"
        },
        "121332121":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "They took the belt!",
                "You still have the belt, they're asleep in their own rooms"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok, I'm ready to chat with your voicemail bro.\" Kristine grabs her purse from behind the couch and takes out her cell, calling you. \"La la, no one is going to answer. Get to the mach... hello? Bro? But... yes I did call you... no, I just didn't expect to talk to you. Ok, talk to you again real soon. Bye.\"<br>\r\n<br>\r\nAs she hangs up the phone she gives you a really weird look. \"How did you do that?\"<br>\r\n<br>\r\n\"Like I said before, I traveled back in time.\" you reply. <br>\r\n<br>\r\n\"And you can't travel back because of that crystal thing?\" confirms Laura.<br>\r\n<br>\r\n\"Correct, so I need a place to stay for tonight.\"<br>\r\n<br>\r\n\"Well, guess you get to join us for girls night in. But you are gonna have to bring us with you on a time trip later!\" says Ashley. <br>\r\n<br>\r\n\"Uhhh, sure, at some point.\" you reply. Maybe you will and maybe you won't. But for now it won't hurt by saying sure. You and the ladies spend the rest of the night watching movies and playing some Uno. You fall asleep at some point while watching one of the more girly romance movies. You wake up with a cramp in your neck, and spread across the armchair. Laura and Toshiko are asleep on opposite ends of the couch, and Ashley and Kristine are nowhere to be seen. </span></div></div>",
            "created":1203051600,
            "id":498359,
            "title":"A phone call"
        },
        "1213321211":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Ashley is back, but different",
                "Ashley isn't back quite yet, but everything is different."
            ],
            "content":"<div class=\"\"><div> <span>You reach down to scratch yourself, and suddenly realize the belt is gone. The ladies took it! Jumping up, you run down the hall towards Kristine's room. You open the door, and there she is, halfway on and halfway off her bed. You turn back and go to the room that was pointed out as Ashley's earlier. Opening the door, and sure enough she isn't there. She must have taken it while you were asleep. <br>\r\n<br>\r\nSuddenly you get very dizzy, and it seems like a wave of energy flows over you and everything else. You put your hand against the wall to steady yourself, and the moment passes quickly. You look around, but you feel ok now.<br>\r\n<br>\r\nWait, is that bacon you smell now? Wasn't everyone else asleep still?</span></div></div>",
            "created":1203138000,
            "id":498735,
            "title":"They took the belt!"
        },
        "12133212112":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Ashley is back, she'll explain things",
                "Laura comes in and doesn't know you either"
            ],
            "content":"<div class=\"\"><div> <span>You head back to the living room, and look over into the kitchen to see Toshiko making breakfast.<br>\r\n<br>\r\n\"Smells good Toshiko, what all ya making?\" <br>\r\n<br>\r\nLaura looks over at you and has a very puzzled look on her face. \"Excuse me? Did you come home with us last night? I must have drank more than I thought!\"<br>\r\n<br>\r\nAs she turns back to the bacon, you give her your own puzzled look. There was a little bit of vodka drank last night, but nowhere near enough to make someone forget the night. Then again, you just met her, so maybe she's a real lightweight.<br>\r\n<br>\r\nYou sit back into the chair you spent the night in and look at your watch. Still several hours to go till you and Denise got attacked by that man. Guess there's plenty of waiting to still do. <br>\r\n<br>\r\nWait a second, isn't that your sister Kristine sleeping on the couch? She opens her eyes and says \"Hi, who are you and who brought you back last night?\"<br>\r\n<br>\r\n\"Haha Kristine. Very funny.\"<br>\r\n<br>\r\n\"Seriously, my head is pounding and I don't remember you. Who are you.\"<br>\r\n<br>\r\nIgnoring her you look at some of the pictures they set up on the wall. You could have sworn there was one of the both of you and your Grandma in the mix, but there's only one of her with Grandma. Now she's sitting up and says, \"Who the fuck are you?\" <br>\r\n<br>\r\n\"This ain't funny anymore sis. Cut it out.\"<br>\r\n<br>\r\n\"Sis? Excuse me?\"</span></div></div>",
            "created":1203138000,
            "id":498738,
            "title":"Everything is a bit off"
        },
        "121332121121":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "You're slowly being erased from existence",
                "It's just after-effects of the time shift"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly there's a flash of light from the hallway and you hear Ashley exclaim \"Awesome!\" She comes skipping into the living room wearing a bunch of tie dye clothing and a bandana. <br>\r\n<br>\r\nSeeing you glaring at her Ashley becomes a little sheepish and says \"Umm, sorry I took your belt. I just wanted a quick little trip and everyone was sleeping, so I figured what the hell.\"<br>\r\n<br>\r\nKristine looks at her and then you, and then says, \"So you know this asshole Ash? 'Cause he was really starting to piss me off!\"<br>\r\n<br>\r\nAshley gives Kristine a puzzled look before responding. \"Uh, duh, of course I know your brother, he was with us last night while we were playing Uno and watching movies.\"<br>\r\n<br>\r\n\"Oh haha,\" says Kristine, \"you two are in on a little joke together. So which one of Matt's friends put you guys up to this? I had a lot of Tequila last night but not that much.\" She then gets off the couch and joins Toshiko in the kitchen.<br>\r\n<br>\r\n\"What is with her this morning? And who's Matt?\"<br>\r\n<br>\r\n\"You fucked something up, thats what happened!\" you hiss back at Ashley. \"Where did you go and what did you do?\"<br>\r\n<br>\r\n\"Well, I just went back to the late 60's and smoked some pot with the hippies who lived here then. How could that affect anything?\" <br>\r\n<br>\r\n\"I don't know, but now my own sister doesn't even know me. It's like I was never born. Maybe I wasn't!\"<br>\r\n<br>\r\n\"Wait, if you weren't born, why are you still here?\"<br>\r\n<br>\r\n\"I don't understand time travel, I just went back about 12 hours. Not like you going back 40 years. Ooooh, I suddenly don't feel so good.\"</span></div></div>",
            "created":1203224400,
            "id":499147,
            "title":"Ashley is back, she'll explain things"
        },
        "1213321211212":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Time Cop Charlie and his men",
                "The man that attacked you before"
            ],
            "content":"<div class=\"\"><div> <span>It suddenly feels as if another wave of energy is radiating out, and this time it concentrates around you and Ashley. Holding your stomach in slight pain, you look over and see Ashley is feeling it too. Not only that, she seems to be glowing a faint green. <br>\r\n<br>\r\nThen the moment passes and you feel ok again. \"Ugh, what was that?\" asks Ashley, as she straightens up. <br>\r\n<br>\r\n\"I felt that energy before, only this time it was more intense.\" you reply.<br>\r\n<br>\r\n\"When did you feel it before?\"<br>\r\n<br>\r\n\"When I was in the hallway, looking for you and the belt. Come to think of it, right after that, Kristine was suddenly in here instead of her bedroom, and Tosh was cooking instead of asleep! It must signal shifts in the timeline or something...\"<br>\r\n<br>\r\n\"Precisely.\" says someone behind both of you. Who is it?</span></div></div>",
            "created":1204174800,
            "id":503913,
            "title":"Shifting time lines"
        },
        "12133212112122":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "More explaination from blondie",
                "Time Cops arrive, forcing a retreat"
            ],
            "content":"<div class=\"\"><div> <span>It's the blond guy that attacked you the other day. Or actually the guy that attacks you later today. <br>\r\n<br>\r\n\"You again!\" you shout, backing away from the blond guy. \"How'd you find me?\"<br>\r\n<br>\r\nStanding there calmly, he gives you a puzzled look. \"Again? I guess we've met before, though I don't remember it. I assume you came from the future? Because that would explain it, judging by the fact you have my belt.\"<br>\r\n<br>\r\n\"Yeah,\" you say, narrowing your eyes and bringing up your fists. \"You attacked me, and during the fight I time traveled back to last night.\"<br>\r\n<br>\r\nSeeing your hostility and anger at him, he spreads his hands out palm up and says \"I apologize for doing that, even though I havn't done it yet. I can only assume I was trying to avoid more contamination of the timeline. But now that you have used the belt, you are removed from it. Since you were in pain a moment ago, it's obvious something drastic happened to the time line, and you are no longer a part of its normal course and flow.\"<br>\r\n<br>\r\n\"What do you mean by that, is that why Kristine doesn't remember her own brother?\" interjects Ashley. <br>\r\n<br>\r\n\"Ahhhh, that would explain it.\" Looking at you he says, quite simply and matter of factly, \"You were never born.\"<br>\r\n<br>\r\n\"Oh My God!\" exclaims Ashley. Then she surprises you both by fainting.</span></div></div>",
            "created":1204174800,
            "id":503919,
            "title":"Blondie is back!"
        },
        "121332121121221":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Try to make things right",
                "Acclimate to your new situation."
            ],
            "content":"<div class=\"\"><div> <span>\"That happens here and there.\" Blondie says, stepping over the fallen Ashley and sitting on the couch. \"Anyways, one of you has done something that has altered the timeline, specifically your timeline. What have you two done in the way of time travel?\"<br>\r\n<br>\r\n\"I havn't done anything besides come here, but she said she went back to the 60's and smoked with some hippies. How could that make it so I was never born?\" <br>\r\n<br>\r\n\"A single insect killed, or item used before its time, can change the flow in subtle yet powerful ways. Someone ran out of grass before they were meant to, so they refilled sooner, maybe didn't have money for groceries or something when they needed it, etc, etc. Its nearly impossible to tell what exactly caused this change, or if its even possible to change it back.\"<br>\r\n<br>\r\nFeeling pretty glum now, you sink into the recliner. \"So how do we change it back?\"<br>\r\n<br>\r\n\"Thats quite tricky. It may not even be possible. Look, you have two choices now. Either go back and risk fucking stuff up further, or accept that this has changed, and try to move on with your new life. In the here and now. I'll help you a little, either way you choose. So whats it gonna be?\"</span></div></div>",
            "created":1225515600,
            "id":602490,
            "title":"More explaination from blondie"
        },
        "1213321211212212":{
            "choices":[
                "are your (Jay) former parents.",
                "aren't the old ones."
            ],
            "content":"<div class=\"\"><div> <span>You are still a bit shaky about your existence being deleted, you don't want to mess things up more. <br>\r\n<br>\r\n\"I think we'll stay here for now.\" Ashley grabs your hand.<br>\r\n<br>\r\n\"Good, it takes even more guts to stay in a twisted future than to twist your past.\" Blondie nods.<br>\r\n<br>\r\n\"Now, your existence hasn't been deleted yet, right?\" Blondie asks Ashley.<br>\r\n<br>\r\n\"No, well I'm not sure.\" Ashley isn't sure.<br>\r\n<br>\r\n\"She felt the effect of the time belt too, although my sister or former sister did recognize her.\" You explain.<br>\r\n<br>\r\n\"Did she? Could you check out if you're still with your own parents? Sometimes the time line just shifts that your are born to other parents.\"<br>\r\n<br>\r\n\"Sure,\" Ashley grabs her cellphone and calls her parent's number.<br>\r\n<br>\r\nAs she talks with them, you can see her eyes going wide as something had happened.<br>\r\n<br>\r\n\"Bad news, Ashley begins, my parents... </span></div></div>",
            "created":1360508640,
            "id":1528945,
            "title":"Acclimate to your new situation."
        },
        "12133212112122122":{
            "choices":[
                "the abandoned farm.",
                "the shabby old apartment."
            ],
            "content":"<div class=\"\"><div> <span>\"In what way?\" Blondie asks.<br>\r\n<br>\r\n\"They're not alive anymore. They're dead. I just called my adoptive parents, apparently.\" Ashley falls down and you're just in time to catch her.<br>\r\n<br>\r\n\"You kids really messed up.\" Blondie says shaking his head.<br>\r\n<br>\r\n\"But you can't do anything about it, you just told me, you wouldn't want to change the past. That includes her parents as well.\"<br>\r\n<br>\r\nYou hesitate about that decision, it was one thing that your family didn't recognize you, another thing was the fact your parents were now officially dead while they would be still alive. <br>\r\n<br>\r\n\"I'm not sure.\" You tell Blondie. \"Perhaps we should....\"<br>\r\n<br>\r\n\"No, Jay. Let's not do that.\" She pulls on your shirt as she signs she wants to stand up. \"Who knows what will happen if we go back in time again, next time we might as well kill our grandparents.\" <br>\r\n<br>\r\n\"But what about...\" <br>\r\n<br>\r\n\"That's okay Jay, I will accept it. Just.. give me some time to mourn them, alright?\" You nod to it. It's probably for the best.<br>\r\n<br>\r\n\"Now, we need to get you someplace else. A place to stay.\"<br>\r\n<br>\r\n\"Where?\" You ask curious. \"We don't exist even more.\"<br>\r\n<br>\r\nBlondie pulls some computer device out of his pants and checks something. \"Alright, there are two locations I can bring you to. One is an abandoned farm in the remote outskirts of your former hometown Jay. The other is a shabby old apartment in the same town. Which one will it be?\"<br>\r\n<br>\r\nYou and Ashley talk about it and in the end decide to go to...</span></div></div>",
            "created":1411157640,
            "id":1858889,
            "title":"aren't the old ones."
        },
        "1213321212":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Shoot first, see what happens",
                "Wait till you go away, before shooting"
            ],
            "content":"<div class=\"\"><div> <span>Looking at the clock you see there's still 3 hours to go until you and Denise got jumped by the guy. Not really wanting to wait you grab the gun and leave the ladies house. It's been so many hours, the temporal field thingy is probably gone by now. You walk the several blocks to the ambush point, then find a good tree to hide behind so you'll remain out of sight until you make your move. You set the belt for 5 minutes before the altercation, and press the button. <br>\r\n<br>\r\nSuccess! Spying around you notice the guy peeking out at past you and Denise from the row of hedges nearby. The both of you are down the street walking this way, laughing and joking, unknowing of the attacker. But here you are, up a tree, and with a ray gun. <br>\r\n<br>\r\nThinking about it though, it really would be easier to make sure Denise is all right by just stopping the guy before he attacks at all. It couldn't do much damage to space and time, could it?</span></div></div>",
            "created":1203310800,
            "id":506337,
            "title":"Ready to pounce"
        },
        "12133212121":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Stay with the future version",
                "Follow the altered past version"
            ],
            "content":"<div class=\"\"><div> <span>It would sure be easier to make sure Denise is safe by taking him out this way, so taking careful aim, you fire just as Blondie jumps out from the bushes. You hit him directly in the chest, and you watch as he develops a smoking hole before falling backwards. You run up with the gun still trained on him, completely forgetting Denise and Past you are nearby and can now see you. <br>\r\n<br>\r\n\"Wha... what!?!\" exclaims Denise, looking back and forth at you and past you. <br>\r\n<br>\r\n\"Oh, hey. I'm from the future.\" you say. <br>\r\n<br>\r\n\"How? Why?\" asks past you.<br>\r\n<br>\r\n\"Umm, that man was...\" and suddenly you double over in pain, dropping the ray gun from your grasp. <br>\r\n<br>\r\n......................................<br>\r\n<br>\r\nYou and Denise look at future you as he suddenly doubles over in pain, dropping the gun that left a crater in the other guys chest. Both of you rush over to see if there's anything you can do. but trying to touch the future you, your hands pass right through. \"Is there anything we can do for you?\" asks a concerned Denise. <br>\r\n<br>\r\nIn response the future you can only gasp in pain, as he fades away to nothingness. The only proof that he was ever there is the dead man to your left, and the ray gun laying on the ground.</span></div></div>",
            "created":1204866000,
            "id":506605,
            "title":"Shoot first, then vanish"
        },
        "121332121211":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "There's a response",
                "No response, pick a direction and swim"
            ],
            "content":"<div class=\"\"><div> <span>When you come to, you are floating in a dark space. In the distance is dim light, seeming to come from the edges of nothingness. It is beautiful, but scary at the same time, the deep purples and dark oranges telling you that there is nothing out there. Floating in this void, it is similar to swimming, as if there were no gravity. <br>\r\n<br>\r\n\"Hello?\" you call out. \"Anybody out there?\" There's no echo, the words floating off into nothingness.</span></div></div>",
            "created":1205298000,
            "id":507955,
            "title":"The Void"
        },
        "1213321212111":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "GOD",
                "ELLEN, master of the worlds void"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello?\" you tentatively call out again. Here you get a response, not exactly what you were thinking you'd get though. <br>\r\n<br>\r\n\"WHO ARE YOU, AND WHERE ARE YOU FROM?\" asks a voice, that seems to reverberate all through you and the void you inhabit. <br>\r\n<br>\r\n\"I'mmmm J-j-j-j-jay.\" you stutter out, impressed and a little fearful of this huge voice. \"And I'm from Idaho.\"<br>\r\n<br>\r\n\"PLANET AND YEAR, JAY.\" responds the voice.<br>\r\n<br>\r\n\"Earth,\" you start out again, with a little more confidence. \"2008. Who are you?\"<br>\r\n<br>\r\n\"IF YOU WERE TRUTHFUL I WILL RESPOND, OTHERWISE YOU WILL NOT HEAR FROM ME AGAIN. NOW PLEASE WAIT WHILE I CHECK OUT YOUR CLAIMS.\"<br>\r\n<br>\r\nAfter a few minutes of waiting, the voice returns. \"YOU HAVE BEEN TRUTHFUL, SO I WILL REVEAL MYSELF TO YOU. I AM ______.\"</span></div></div>",
            "created":1208754000,
            "id":522509,
            "title":"There's a response"
        },
        "121332121212":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Go see AJ, he's a loyal friend",
                "You can always count on your older sis"
            ],
            "content":"<div class=\"\"><div> <span>\"What was that, what do we do now?\" exclaims a frightened and worried Denise. \"That was you, and you killed that guy before fading to nothingness!\"<br>\r\n<br>\r\n\"I don't know, but we have to get out of here. There's a dead body here, and that future me was wearing the exact same clothes that I'm wearing now. He even had this belt on. We were heading to Aj's house anyways, maybe we should just continue there.\"<br>\r\n<br>\r\n\"I don't know, maybe it's because we were heading to Aj's house this was happening. Maybe we should go someplace else and hide out. Not my place though. Didn't your sister just move back in town?\"<br>\r\n<br>\r\n\"Yeah,\" you say, as you grab the gun and start off. \"Maybe she could help us out. Let's just start walking while I think on this.\" </span></div></div>",
            "created":1204952400,
            "id":506611,
            "title":"Go with the altered past"
        },
        "12133212122":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Zap. Blue ray comes out and hits him.",
                "Zip. Yellow ray goes out and hits him."
            ],
            "content":"<div class=\"\"><div> <span>You wait for a few moments more, and past you and Denise make it to the attack point. The man jumps out and snarls just like last time \"Give me the Time Belt, Boy!\"<br>\r\n<br>\r\nYou mouth along as past you says \"This thing? I bought this fair and square at that garage sale. Go get your own!\"<br>\r\n<br>\r\nHe takes off at you, and you watch as your right hand connects squarely with his jaw. That looked like it really hurt, you didn't realize it then, but you can't believe he didn't react more to it. The struggle ensues, past you falls black, then disappears in a puff of blue smoke. Denise looks at the spot that you were just in, with her jaw dropped in amazement. <br>\r\n<br>\r\n\"What did you do to him!?!\" she yells at the man. Suddenly she jumps at him and starts pounding on his chest. He barely even reacts, finally reaching up a hand to push her down. He looks like he's about to walk away when he thinks better of it, and reaches down to grab Denise by the wrist. <br>\r\n<br>\r\nHe picks her up, then says calmly, \"Don't worry, he'll probably be back. Judging by your reaction the two of you are close. I'll keep you close until he returns. Didn't really look like a smart boy anyways.\"<br>\r\n<br>\r\nLooking at Denise's face, you're a little surprised to see so much emotion from her. You've been really good friends for so many years, but there's hardly been an emotional attachment. Now is probably the best time to stop him though, before he takes Denise away from here. <br>\r\n<br>\r\nYou take careful aim, and fire. You never did test this ray gun out to find out what exactly it does. What does it do?</span></div></div>",
            "created":1203310800,
            "id":499635,
            "title":"Saving Denise!"
        },
        "121332121221":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "in cold storage locker 14B of the Department.\"",
                "in the memory of the gun. Please do not lose before you report back.\""
            ],
            "content":"<div class=\"\"><div> <span>A blue ray comes out of the gun and hits blondie squarely in the chest. He has a confused look on his face for a moment, then horror. A blue glow surrounds his whole body, and since he's got Denise by the wrist, she is enveloped as well. Uh oh.<br>\r\n<br>\r\nThe blue glow becomes brighter around their bodies, then both of them vanish in a puff of smoke. Where did they go, did you incinerate them?<br>\r\n<br>\r\nSuddenly the gun beeps on the side, and 2 of the five lights there turn on. Then a little display projects into thin air above the gun, and a mechanical voice reads the text that appears; \"Congratulations Time Cop Charlie, on capturing these wanted criminals!\" At least they're not dead. But the guy you took this gun from is so vain he needs a congratulations whenever he captures someone with this gun? Or maybe it's an automated message his time department does. <br>\r\n<br>\r\nThe voice continues as more text appears. \"These two criminals are safely stored...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1204606800,
            "id":505718,
            "title":"Stored"
        },
        "1213321212212":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Time Cop Charlie is standing behind you",
                "It was Jax on the screen. You can communicate on here!"
            ],
            "content":"<div class=\"\"><div> <span>The holographic display disappears from the air. Ok, so they're stored within this gun. Now how to get Denise out? There's only the trigger, a white button on the left side, and the blue lights on the right side, of which only the two are lit. That must be how many people this thing can store. Maybe the white button can rematerialize them, or maybe bring out some sort of keypad or something. Might as well press it.<br>\r\n<br>\r\nYou press the white button, and nothing happens. Maybe if you hold it for a second... and suddenly the holo display rematerializes. Looking at the screen, it looks kind of like a palm pilot. There's several folders on the screen, so you reach out your finger and press one. It opens up and shows a display that says targets. Maybe this will help you get them out!<br>\r\n<br>\r\nYou click on the first one, but its just a dossier of some muscly black dude with what looks like a mechanical arm. Age, name, date born, blah blah blah. Maybe you can get some information on that blond guy from this. Finding a back button in the bottom left corner, you press it and your back at the folder menu. The next file is the same, except for a woman with bright pink hair, and what looks like blades coming out of her shoulders. Next.<br>\r\n<br>\r\nEwww, this is some sort of squid creature, and it doesn't look that nice. Next<br>\r\n<br>\r\nNow we're talkin! It shows a picture of him, says his name is Jax, age and date born, unknown. Actually, more than half the file is unknown. Guess there's not much to find out about him. <br>\r\n<br>\r\nGoing back to the main screen you click on another file. just pictures in here of Charlie and his friends and family. Yawn. The next folder you check though, has outlines of 2 figures in it. Pressing one, it pulls up what looks like a picture of Jax, but no details. A little disappointed, you go to press the back button when suddenly you hear a voice say \"Who are you?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1204693200,
            "id":505719,
            "title":"Trapped inside"
        },
        "121332121222":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Drop the gun in horror",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>A yellow ray comes out of the gun and hits blondie squarely in the chest. He has a confused look on his face for a moment, staggers a moment, then falls to his knees, looking straight at you. Denise uses the moment he staggers to break her hand free, and backs up quickly before looking between you and him. She has an immense look of relief on her face.<br>\r\n<br>\r\nBlondie however, has a look of confusion, and then pain. You stop firing thinking he's stopped, but he now clutches at his chest, before a glazed look overcomes his face. Within moments the spot that you shot him opens a hole of ash into his chest, which spreads throughout the rest of his body. After about 10 more seconds, all thats left of him is ash. <br>\r\n<br>\r\n\"Oh my god, what did you do to him?\" Denise is right, and what is this gun capable of?</span></div></div>",
            "created":1204606800,
            "id":505481,
            "title":"To ashes"
        },
        "122":{
            "author_id":"amylaverick",
            "author_name":"Nish Laverz",
            "choices":[
                "Set the date and time to just before you were attacked",
                "Go home and decide what to do in the morning",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>After a few minutes your eyes start to focus. As you look around for Denise and the man who had attacked you realize its dark and the only light is from the street lights above. There is no sign of any one as you here a clock in the distance strike 12. I've been out for 10 hours you say to yourself as you look down realizing you are still holding the belt. 'What the hell is this thing' you say out loud holding the belt up. Examining it you find a digital display with date and time on it next to the red button. Under the display you see some buttons which as you press them change the date and time.<br>\r\n<br>\r\nWhat do you do now?</span></div></div>",
            "created":1260248400,
            "id":802921,
            "title":"It's night time, several hours later"
        },
        "123":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "A girl walks in, its the Woman's room!",
                "2 guys walk in making out, it's a gay bar!",
                "Future cops walk in, they tracked your time displacement!"
            ],
            "content":"<div class=\"\"><div> <span>The bright white light fades, and you look around to see you're in a bathroom. You can feel the bass from music outside vibrating the bathroom around you. What the hell?<br>\r\n<br>\r\nThen you remember that guy that attacked you called this a time belt. You must have time traveled somewhere. But where. And when? Obviously you're in a night club. You stand up to check out the belt, and notice the buttons and stuff that you thought were just futuristic decals are really on there. You can see different labels for year, month, day, hour, and minute on one side, and on the other side it looks like there's other buttons for size. Can this belt change your size too?<br>\r\n<br>\r\nMight as well try it out you think. You put on the belt and adjust the size settings. 1 foot tall would be a good test. You look at the time settings quick and notice the year is set to 2014, so you're not too far into the future. You try pressing the size dial in, but nothing happens. Then you notice the red button, and press that. <br>\r\n<br>\r\nWHOA!!!<br>\r\n<br>\r\nAfter a few seconds of dizziness you see that you're just 1 foot tall. That was certainly a trip. You fiddle around with the dials a little more, when suddenly...</span></div></div>",
            "created":1202014800,
            "id":504932,
            "title":"Nightclub bathroom"
        },
        "1231":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Shrink more, stay undetected",
                "Say hi to this voluptuous beauty",
                "Try to shrink, but you had the settings wrong"
            ],
            "content":"<div class=\"\"><div> <span>Hearing the door open, you turn your head and look to see this brunette bombshell walk in, and she is so smokin! She's got this emerald skirt and fishnet stockings covering her miles of legs, and this black and green swirly top on, and its all shiny. And looking at her bare midriff you can see a flashing green piercing at her belly button. Staring in awe at this busty beauty, you're almost in a trance. Luckily she doesn't see you yet, and walks right over to the sink you're standing under.<br>\r\n<br>\r\nYou back up so she doesn't step her toes on you. She could probably crush your feet with the pointed toes of her shoes. Looking at the feet of the giantess in front of you, you realize she's got some monstrous heels on, as they reach as high as your knees are now. <br>\r\n<br>\r\nYou hear her open her purse, and look up around the edge of the sink. She's reapplying some of her makeup, when suddenly she drops her lipstick. It bangs against the sink, then falls down right past you. Ducking back beneath the sink, you hear her say fuck. <br>\r\n<br>\r\nThen you see her knees start to bend down. You've only got a split second to decide, do you let her see you, or do you shrink yourself more so she can't see you?</span></div></div>",
            "created":1204434000,
            "id":504929,
            "title":"The ladies room"
        },
        "12311":{
            "choices":[
                "she turns and move away",
                "two more women enters the bathroom."
            ],
            "content":"<div class=\"\"><div> <span>The <i>giant </i>brunette kneels down, trying to reach for her lipstick that has just fallen under the bathroom sink, where you, <i>reduced to one foot tall</i>, sand beneath, <br>\r\n<br>\r\nYou stare at her in awe, she is so beautiful, so hot, and her siwze, in your perspective, just turns you more, but you understand the danger of the situation, You cannot let her see you. <br>\r\n<br>\r\nYou don't know yet how to settle the time space coordenates of the belt to zap yourself away from there. But you already know how to change your size, so, the only thing to do is to shrink further, so smal, that she cannot see you.<br>\r\n<br>\r\nYou are face to face to her bended knees as she crouches down, her face lowering down is already visible to you. In the moment that her eyes pass down the edge of the sink you press the shrink button in the belt.<br>\r\n <br>\r\nYou cannot know if she had spotted you or not.<br>\r\n<br>\r\nThe scenario around you changed again, changed so, that for a second you believed that you've been transported somewhere else in time and space  once again. But you start to recognize your surrounding.  The bathroom floor was a great endless plain, divided in tiles, each one as big as four football fields. The spaces between the tiles formed endless paths, that sembles trenches, you can rocks and debris that were actually just dirt, maybe unoticed if you were normal sized.<br>\r\n  <br>\r\nAnd the woman...<br>\r\n<br>\r\nSome moments before, she was already a giant, If you streched up your arm you could reach her knee, well, maybe barely touch... <br>\r\n<br>\r\nBut now, after pressing the button, she was so big, so monstrous, so gigantic, that you cannot see her whole, head to toe, at once, in only one look, even her being a third of mile away from you.  She was just a mountain! A moving mountain, still lowering down to reach for her lipstick under the bathroom sink. Inspite her size, still a typical feminine move, her feet side by side touching each other, as well as her knees. Graceful, if not for her size, you could say delicate.<br>\r\n<br>\r\nIn the belt holographic display you see that you are reduced to 1/16 of an inch.<br>\r\n<br>\r\nHer feet, her shoes are big as transatlanic vessels,  in high heels that were towering columns for you, about 300ft high, sustaining the colossal body. <br>\r\n<br>\r\nA giant hand moves upon you, passing like a cloud, blocking the sun, you can see the lines of her palm deep as cracks, her huge spreaded fingers could be tree trunks, her nails could be house roofs , the giant hand passed by you, reaching for the fallen lipstick  a hundred of yards ahead, a lipstick as big as a container truck.<br>\r\n<br>\r\nThe tips of her giant fingers touched the giant lipstick, grabbing it, moving it to the palm of her hand, the lipstick disaperad in her fist, and the hand was gone. All this simple movement, for you is like a flying giant monster with tentacles snatching a mammoth size prey.<br>\r\n<br>\r\nThe giant woman stood up. Stood there for a few seconds, you stare at her giant feet on her giant pumps side by side, You see noises from above, she was probably retuching her makeup.<br>\r\n <br>\r\nthen...<br>\r\n<br>\r\n</span></div></div>",
            "created":1323259800,
            "id":1236118,
            "title":"Shrink more, stay undetected"
        },
        "123111":{
            "choices":[
                "two other  women enters the bathroom, as she leaves...",
                "you hear the flush sound from the toilets..."
            ],
            "content":"<div class=\"\"><div> <span>You're still below the sink of the women's bathroom in a nightclub, and reduced to 1 mm tall <i>(a little more then 1/36 inch)</i>.<br>\r\n<br>\r\nBefore you, a pair of huge feet inside black high heels pumps, as big as ships, the 5 inches heels, for you are 750 ft heels, The gigantic feet sustains a pair of proportionally gigantic legs, that rises up themselves to the skies like the columns that sustains the heavens, ending in the edge of the marble surface of the vanity top up there high above. <br>\r\n<br>\r\nSuddenly all that huge superstructure move, move upon the heels, spinning all that colossal body, then a foot rises and moves on an incredible velocity landing almost a mile ahead, a single step. Everything shakes with the impact, and then another step, you already can see the girl ass, she would crush a thousand men sitting on them with that ass, she moves away, to the door....<br>\r\n<br>\r\nthen...</span></div></div>",
            "created":1323364380,
            "id":1236575,
            "title":"she turns and move away"
        },
        "123112":{
            "choices":[
                "you decide that's time to try to get back to your own time and your regular size",
                "you rather observe a little more"
            ],
            "content":"<div class=\"\"><div> <span>You are still impressed by the sight of the mile high lady before you, this brunette goddess in a green sexy outfit, and high heels, to watch her simpliest moves is like to stare at natural forces like hurricanes or volcanic eruptions. And she didn't even noticed you, you feel tiny, very tiny...<br>\r\n<br>\r\nThat's when, to make thing even more frighten, or exciting, the door of the bathroom opens again, an air burst hits you and you fall on the ground. You feel not only the air impact of the door opening but also the shockwave of the music like an atomic exposion.<br>\r\nYou see, far away, emerging from behind the cliff size door, a giant foot in a high heel shoe, another one, conected to an ankle and a leg... you rise your face to look once again, and then another leg, and after that another, and another, four female bare legs, in high heels, two other giant women.<br>\r\n<br>\r\nYou look up to see them, each pair of mile high legs end inside thigh high skirts. One purple one black, very tight dresses that takes the curvy shapes of their bodies, tits, bellies and asses, became mounts, there above, beautiful faces like planets, surrounded by a cascade of hair , another brunette and a blonde.<br>\r\n<br>\r\nTheir high heels make the tiled ground shake in booming steps, you feel the shockwaves, up there you their giggles, chatting, their voices so loud that you cannot understand what their saying, but everything vibrates, the two giantesses joined the first one before the sink.<br>\r\n<br>\r\nWhen the three pair giant high heeled are aligned together you start to notice the differences between the shoes... peeptoes, slingbacks, another pointed toe, all them are black and shiny, toe cleavages and arch cleavages, sometimes just details, that not small enough for you, specially at your minuscule size. <br>\r\n<br>\r\nYou look at the exposed tips of the toes on the peeptoed shoes, you could perfectly fit between those toes, even joined together, and maybe the giantess won't even notice.</span></div></div>",
            "created":1323286140,
            "id":1236244,
            "title":"two more women enters the bathroom."
        },
        "12313":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Ask her for help",
                "Adjust the settings yourself and see what happens"
            ],
            "content":"<div class=\"\"><div> <span>Until you know what the future is like, it would probably be best to go undetected. Quickly you press the button to activate another size change. Wait, did you have the settings right to go smaller?<br>\r\n<br>\r\nApparently not, as suddenly you shoot up and hit your head on the underside of the sink. You fall back from hitting your head, and the emerald color clothed hottie you were admiring a moment before yelps in surprise, and jumps back as you keep on growing. <br>\r\n<br>\r\nWhen the whole process is done, your head is wedged beneath the sink in quite an uncomfortable position, head facing away from the door. Each leg is trapped in a stall across the room, and being careful to not break anything and leave a lasting impression you don't move much. Your hands are free, but there's not much you can do since you can't see the settings on the belt. And there's the emerald clad beauty, standing in front of your face gazing at you in wonder at your sudden appearance and size. <br>\r\n<br>\r\nNot knowing what else to do you simply say \"Hello.\"<br>\r\n<br>\r\nStill in a little bit of shock, she echoes with her own soft \"Hello.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1204779600,
            "id":518586,
            "title":"Largely exposed"
        },
        "123131":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Yeah, she sets you to six feet tall",
                "Nope, keep on shrinking!"
            ],
            "content":"<div class=\"\"><div> <span>\"I, umm, seem to have gotten myself in a jam here.\" you say.<br>\r\n<br>\r\n\"I would certainly say so!\" exclaims the woman. <br>\r\n<br>\r\n\"Would you mind helping me out? One of these dials changes my size, but I'm still not entirely certain which side does that. Could you help me out and turn it to 6 feet?\"<br>\r\n<br>\r\nShe looks dumbfounded for a second, that you would even be asking for her help, let alone need it. She takes a moment to work her jaw up and down, before saying, \"Sure, I suppose so.\" She moves out of sight range from you, and goes over and turns one of the dials. \"Ok, you're all set. Now how does it happen?\"<br>\r\n<br>\r\n\"Stand back a little bit, and I'll be down to size in a second.\" you respond. Pressing the button, you start to shrink and immediately feel relief from where the sink was pressing against your head. \"By the way, whats you name?\"<br>\r\n<br>\r\n\"My name is Tabitha.\" she responds. But did she put the settings right?</span></div></div>",
            "created":1207890000,
            "id":518595,
            "title":"She'll surely help you out"
        },
        "1231311":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "The blond man is holding Denise in the air by her neck",
                "The blond man is standing there, but where's Denise?"
            ],
            "content":"<div class=\"\"><div> <span>As you shrink you move into a sitting position and turn your gaze toward Tabitha. \"Thank you very much for the help Tabitha, my name is Jay.\"<br>\r\n<br>\r\nTabitha reaches out a hand to help you up, which you gladly take. \"How did you get something like that belt? That is seriously awesome.\" <br>\r\n<br>\r\nFully erect again, you rub your head a little and say, \"Bought it at a garage sale, though I thought it was a toy. Me and my friend got attacked by some guy, the belt got activated, and I wound up here. So I decided to play around with it a bit before I went back and figure it all out.\" <br>\r\n<br>\r\n\"Wicked. Any chance that thing can bring me with you? I would love to change size and explore time with you. And does it do anything else?\" <br>\r\n<br>\r\n\"I don't know, lets look at this thing a bit.\" You both look over the belt and find no more dials than the time and size changing ones, but you do find some detachable bracelets, and surmise that they must bring others with the belt wearer. You play around with the settings and change size a couple times, and Tabitha changes size as well, staying just an inch taller than you the whole time with her massive heals on. <br>\r\n<br>\r\n\"This is so awesome. But I assume you want to go save your friend now?\"<br>\r\n<br>\r\n\"Yeah, though lets be seven feet tall so we can easily deal with that guy.\" You change the settings and activate the belt, disappearing in a flash of light to the past. But what is it like when you get back?</span></div></div>",
            "created":1223269200,
            "id":591685,
            "title":"Tabitha is a helper"
        },
        "1231312":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "She finds a cab",
                "She's walking home"
            ],
            "content":"<div class=\"\"><div> <span>As you shrink you move into a sitting position and turn your gaze toward Tabitha. \"Thank you very much for the help Tabitha, my name is...\" you start to reply, but she interrupts you. <br>\r\n<br>\r\n\"You can call me Goddess, and I don't care what your name is, cause you're going to be my pet!\" You look at her funny, then realize you're still shrinking. You finally stop at about 3 inches tall, and then Tabitha grabs you. She's now holding you tight enough that you can't move, but at least she isn't crushing you. Looking over you carefully, you now see she even has green eyes, matching the rest of her emerald outfit. She then takes a hair band out of her hair, and uses it to bind you tight, and proceeds to remove the belt from your waist. <br>\r\n<br>\r\n\"What are you going to do to me?\" you ask her. <br>\r\n<br>\r\n\"I havn't decided on that yet, but it certainly wouldn't do to let you escape from me using this belt again!\" she says. Here she loops the belt through one of her earrings. \"For now though, since you were such an easy capture I'll give you a little reward.\" At this she takes you and stuffs you in her bra. \"Now be a good little boy, and we're gonna have some fun when we get back to my place. You can tell me all about this fun little belt you had on!\"<br>\r\n<br>\r\nOh boy, what have you gotten yourself into now?</span></div></div>",
            "created":1207890000,
            "id":518601,
            "title":"She's your goddess now?"
        },
        "12313121":{
            "choices":[
                "You escape inside  the cab",
                "The journey ends in her place."
            ],
            "content":"<div class=\"\"><div> <span>You're in 2014 - six year in the future - You're just three inches tall, stuffed in the bra, of a beautiful girl named Tabitha, pressed against a mountain of warmy and soft flesh.<br>\r\n<br>\r\nYou've been captured. <br>\r\n<br>\r\nMaybe you're yet a little comfy , but still trapped, you barely can move. But you try, as you do, you tickle the giantess in her breast.<br>\r\n<br>\r\n\"Hey!! Stay puft there, teeny!\"<br>\r\n<br>\r\nShe pokes you with her giant fingertip, her giant finger, as big as you whole. With her finger she pushes you deeper into her bra. <br>\r\nYou hear, acutally <i>feel</i> -  the booming of her footsteps down below, as a bombing raid! Each impact vibration passes through her colossal body and reaches you.<br>\r\nFrom her bra you hear the noises of the outside world as a defening storm, thundering voices, male and female, other giants, and music that reaches your more in shockwaves then properly in sound, you feel the \"music\" it in your head, in your bones, you feel like your whole body are being teared appart. That's when the music ceased, the voices become less frequent, just people passing by, you hear other sounds, as deafening as , but different, vehicles. She took you outside. <br>\r\n<br>\r\n\"Hey Taxi!\"   Then the metheoric impact of car door slamming.</span></div></div>",
            "created":1323147600,
            "id":1235748,
            "title":"Another Strange Journey"
        },
        "123132":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Changing time",
                "Changing Size"
            ],
            "content":"<div class=\"\"><div> <span>The easiest way out of this would be to just adjust the settings on your own. However not being able to see them will make it kind of tricky. You can adjust the size settings and take the chance of blowing through the building or getting to a regular size. <br>\r\n<br>\r\nOr you could take a chance with the time settings, but who knows when that will take you to. It's a gamble either way, so might as well get it over with.</span></div></div>",
            "created":1204779600,
            "id":506076,
            "title":"Gamble with the settings"
        },
        "1231321":{
            "choices":[
                "Jay Was Reborn~~",
                "Jay's Mother Finds The TimeBelt~~"
            ],
            "content":"<div class=\"\"><div> <span>Jay took a huge gamble, messing with the time settings as the whole room around him seemed to disappear and he found himself in utter darkness and having lost the time belt as he felt smaller, warmer and yet felt his eyes were closed as he had not only travelled back into the past....but the past where he was yet born yet alive, in his teenage mother's belly, about 8 months along when...</span></div></div>",
            "created":1298437200,
            "id":1059226,
            "title":"Changing time"
        },
        "1232":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Back to the past, as an 8 ft Giant",
                "Back to regular size, and try to find a future weapon",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You're startled by the sudden increase in the music, along with the two giants stumbling into the room. Luckily they're too interested in each other to even see you, as you're still just a foot tall. You quickly dart underneath one of the sinks, and watch as they continue to stumble past you. That was close. <br>\r\n<br>\r\nIt would probably be good to get back now, as that guy is still with Denise, and even if he's not with her, she would still be pretty worried. Her friend just disappeared into thin air after all. Though it might be a good idea to get some sort of weapon to defend yourself with first. But you could also just be really tall to fight him off too.</span></div></div>",
            "created":1202101200,
            "id":494552,
            "title":"It's a Gay Bar!"
        },
        "1233":{
            "author_id":"navatar1",
            "author_name":"Ducttape Knight",
            "choices":[
                "Wait for them to leave the bathroom before returning to normal",
                "Hitch a ride somewhere else",
                "Grow so you can take the crystal and smash it"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly two cops in future uniforms pop through the door. They look around quick, then notice you staring at them in shock at their funky uniforms. They look like Robocop met the worst tailor in the universe, and then they added all sorts of glittery things on after that. They quickly level their guns at you and say in unison \"Freeze Malagort!\"<br>\r\n<br>\r\nThen the first one says, \"Wait a second Charlie, that's not Malagort...\"<br>\r\n<br>\r\nTo which the second replies, \"It doesn't matter. He's wearing the experimental time belt Malagort stole from us. He's even activated the size settings! Unless his people are all a foot tall.\"<br>\r\n<br>\r\n\"What if they are? I saw people with red skin back in 3218!\"<br>\r\n<br>\r\n\"No you didn't, that was the lighting.\"<br>\r\n<br>\r\n\"Well what about the people with tentacles in 2793?\"<br>\r\n<br>\r\n\"I've told you before rabbit, we were giving you some rookie hazing. That was Thorny in a bad octopus costume.\"<br>\r\n<br>\r\n\"Well Farva was sure scared as hell by it.\"<br>\r\n<br>\r\n\"Yeah, that's cause Farva is an idiot we love to prank. Hey, where'd he go?\" The two cops were so engrossed in their argument they didn't notice you shrink yourself down even more. Now you're barely a millimeter tall. \"It's gonna be your head for this Rabbit!\"<br>\r\n<br>\r\nThinking now would be a good time to beat it out of here, you activate the time settings for the day you left... but nothing happens. You start to press the button in a fury, but still nothing happens.<br>\r\n<br>\r\n\"Well, at least we know he can't leave this time. You did bring the anti-temporal displacement crystal, right?\"<br>\r\n<br>\r\n\"Sure did Charlie. Right here on my belt.\" <br>\r\n<br>\r\nHmm, can't leave this time yet, what do you do now?</span></div></div>",
            "created":1203483600,
            "id":500320,
            "title":"Trapped with some super time troopers"
        },
        "13":{
            "author_id":"wredgranny814",
            "author_name":"granny",
            "choices":[
                "Hey, lets push some more of those buttons.",
                "How do we get out of here?",
                "Did we BOTH lose our minds at the same time?",
                "Do you think Noah will let us go with him?"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, Jay, what's wrong with you?\" Denise asks. <br>\r\n\"Ddddenise, something is WRONG, this thing is vibrating!\" All of a sudden bright colors run all over the belt and Jay 'fades' out, then pops back with a strange noise. \"Whoa, did you see that? I was, um, somewhere else for a minute there.\"<br>\r\n\"Man, what are you talking about?\" Denise says as she backs away eyeing Jay carefully. <br>\r\n\"C'mer\" Jay says, \"look, feel this!\" <br>\r\n\"Hey!\" Denise yells, \"what IS that?\" <br>\r\n\"I'm not sure but it's kinda cool, here hold on to my hand see if you can feel it through my hand.\" <br>\r\n<br>\r\n'POP' <br>\r\n<br>\r\n\"Oh, my, GOD, do you see that!!!!!!!!!!!!! Where ARE we, and how did we get here?\" Slowly the kids look around at a VERY different place than they had been just seconds ago. <br>\r\n\"Tell me that is NOT, what I think it is, man I thought that was just a story, this CAN'T be real.\"<br>\r\n<br>\r\nJay and Denise are looking at a VERY big, very wooden BOAT of some kind, and there were animals lined up calmly walking aboard, Lions, walking beside Kangaroos, Tigers walking by Goats, there were even Turtles crawling along two by two! <br>\r\n\"Man, you have got to be kidding me!\" Jay laughs nervously, looking pleadingly at Denise as if to say please tell me I am not the only one seeing this. <br>\r\n\"Out of the way children.\" a gravely voice says, \"There is a need to hurry if we are to get everyone loaded in time.\" Um, Jay, Denise says, if this IS Noah, how are we understanding what he says, shouldn't he be speaking like Yiddish or something? No, silly Sumerian, or German,or something like that Jay said with a dazed look on his face.</span></div></div>",
            "created":1223355600,
            "id":598790,
            "title":"Let's head for the park (put belt on to car..."
        },
        "132":{
            "author_id":"amylaverick",
            "author_name":"Nish Laverz",
            "choices":[
                "To late its started vibrating again",
                "You dont listen to denise and fiddle with the buttons",
                "You decide to exemine the belt further before you try using it."
            ],
            "content":"<div class=\"\"><div> <span>'How do we get out of here?' Asks Denise looking at you for the answer.<br>\r\n'Search me' you reply shrugging your shoulders before looking down at the belt. 'It must be some kind of time travel device or something.<br>\r\n'That big button could be the control.' says Denise Pointing to a big red button.'<br>\r\n'Could be' you say as you look down in the direction Denise is pointing. 'Hang on theres a display next to it but I cannot read what it says.'<br>\r\n'It loks like a date, but I cannot make it out.'<br>\r\n'I've found some more buttons next to it tell me if the display changes.'<br>\r\n'Do you thinks its wise to mess about with it.'<br>\r\n'You want toget home don't you?'<br>\r\n'Yes, but I don't think you should mess about with it. Lets see if there is a last date recall or something before we go hitting any other buttons.</span></div></div>",
            "created":1260334800,
            "id":803444,
            "title":"How do we get out of here?"
        },
        "133":{
            "author_id":"amylaverick",
            "author_name":"Nish Laverz",
            "choices":[
                "You get on the boat and stay through the flood",
                "As you climb the ramp the belt starts to vibraite again"
            ],
            "content":"<div class=\"\"><div> <span>'This cannot be real' says Denise looking at you with a strange look in her eyes<br>\r\n'But if its not how can we both be seeing the same thing?' you reply<br>\r\n'It must have something to do with that belt' Denis says pointing at your waist.<br>\r\n<br>\r\n'Don't just stand there, come on get on board we don't have much time.' came the gravly voice again<br>\r\n<br>\r\nYou and Denise look at each other look up at the boat then start walking up the ramp with the animals.</span></div></div>",
            "created":1260248400,
            "id":802935,
            "title":"Did we BOTH lose our minds at the same time?"
        },
        "1332":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "Dinosaurs",
                "boss monsters?",
                "Fiantesses"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The belt brought other travelers into the arc, they were</span></div></span></div>",
            "created":1484899440,
            "id":2266448,
            "title":"As you climb the ramp the belt starts to vibrai..."
        },
        "14":{
            "author_id":"sseiler76",
            "author_name":"cards_fan_76",
            "choices":[
                "You are at the Party",
                "Jamie and you are together",
                "A bracelet appears",
                "An Image appears from the belt asking date, time, and location of travel",
                "Nothing happens"
            ],
            "content":"<div class=\"\"><div> <span>You say, “Not now. Are we still going to that party tonight with your roommate, Katie, and her friend, Jamie?”  Denise answers, “Oh yeah. Oh crap, I told Katie I'd meet her for a late lunch. Meet us at my place about 7.” Then she runs off. Might as well head to Aj's house, nothing much to do for a couple hours<br>\r\n<br>\r\nYou think to yourself 'Jamie is HOT!  I’d like to get to know her better.' And then you trip and fall pressing the red button on the belt.<br>\r\n<br>\r\nWhat Happens?</span></div></div>",
            "created":1202706000,
            "id":505713,
            "title":"Tonight's plans"
        },
        "142":{
            "author_id":"sseiler76",
            "author_name":"cards_fan_76",
            "choices":[
                "Find Jamie some cloths",
                "Press the red button, again",
                "Press the help button"
            ],
            "content":"<div class=\"\"><div> <span>Its night!  You’re lying on the side walk along Parker Street.  Denise is gone and Jamie is standing next to you only wearing, bra, panties, and a bracelet.  She looks very confused as are you.  Jamie speaks, “I just got home a few minutes ago from the garage sale on Parker Street.  I bought this bracelet at it.  I was in my bathroom undressing to take a shower and now I am here.”<br>\r\n<br>\r\nYou look at your belt and see two date setting, red button that was pushed, and a help button.  The first date setting labeled current is twelve hours later than it was when you left the garage sale.  The second date setting labeled to/from is the time you left the garage sale.  It is a time machine.<br>\r\n<br>\r\nWhat next:<br>\r\n</span></div></div>",
            "created":1203051600,
            "id":498384,
            "title":"Twelve Hours Later"
        },
        "1421":{
            "author_id":"sseiler76",
            "author_name":"cards_fan_76",
            "choices":[
                "Jamie decides to give him her panties",
                "Panty Bandit has to use his ray gun",
                "You fight the Panty Bandit"
            ],
            "content":"<div class=\"\"><div> <span>You think, we got to fine Jamie some cloths, before I try this, again.<br>\r\n<br>\r\nThen a strange man appears with some kind of ray gun.  He looks at Jamie and proclaims, “We can do this the easy way or the hard way.  Give me your panties.  I am the Time Traveling Panty Bandit.  I steal the panties of great women through out time.  I am stealing the panties of Jamie, The Great, Queen of Time Travel, after her first time travel experience.”<br>\r\n<br>\r\nWhat next:<br>\r\n</span></div></div>",
            "created":1203051600,
            "id":498393,
            "title":"Panty Bandit"
        },
        "1422":{
            "choices":[
                "You feel a hand on your shoulder!",
                "You see a tailor's clothing store nearby!",
                "forget the low batteries, I'm hitting the red button!"
            ],
            "content":"<div class=\"\"><div> <span>          You spin the dial and hit the red button again. You cover your eyes as a bright flash goes off around you. When you unshield your eyes, you're still standing next to an almost naked Jamie, but you're now in the woods. Looking down to examine the belt, it displays that you are in 1885, but the battery icon is blinking red, and you know that's no good.<br>\r\n          \"What is going on? Where are we?\" Jamie is freaking out, and she tries to cover her body with her dainty arms.<br>\r\n          \"Follow behind me, and make sure to stay out of sigh, I'm going to go ahead for a second and see if there's any civilization around here,\" You reply, basically ignoring her. She looks at you doubtfully, obviously not trusting your instinct.<br>\r\n          Sneaking forewards through the woods, you find that your old main street is still around, as you peer at it from behind some shrubberies. The street is slightly busy, with people walking back and forth, the men all dressed in neat tuxes, and the women with veils, parasols, and bustle dresses.  The roads are made of cobblestone and horses pull carraiges lightly over the rocky path. <br>\r\n          You stroke your chin thoughtfully, devising a plan on how to lightly assimilate into their ranks, when...</span></div></div>",
            "created":1273986000,
            "id":884191,
            "title":"Press the red button, again"
        },
        "14222":{
            "choices":[
                "Ask if you can negotiate a work deal",
                "Pawn the watch, and maybe the I-Phone"
            ],
            "content":"<div class=\"\"><div> <span>          You hear Jamie working her way towards you through the brush, and you hold your index finger to her mouth to let her know to keep quiet. You strip yourself of the mechanical belt that got you in this dilemma, and hand it to Jamie. You hold up a finger to say 'one second' and calmly emerge from the brush, and make your way to the Tailor's. A few people give you awkward looks, but no one approaches you. Once inside, you approach the store clerk with caution, not sure how he will react to your outlandish wardrobe. <br>\r\n          \"Excuse me, sir, I was looking for an inexpensive dress for my wife, if you wouldn't mind helping me out,\" You propose to the old man, who has white hair and a large white moustache. The man just nods in response and raises his arm to direct you to the dress section. <br>\r\n          There are many beautiful dresses, decked out with frills, bow, ruffles, and tiny jackets. Unfortunately you have no money from this time, and most of these dresses are quite expensive.<br>\r\n          You still have your Citizen's Eco-Drive Solar Powered, silver watch, your I-Phone, and a wallet with 400 Dollars from AD2010, that might be worth something to the man. Do you could ask him if you could work to pay off some clothing, or pawn your valuables?</span></div></div>",
            "created":1273986000,
            "id":884209,
            "title":"You see a tailor's clothing store nearby!"
        },
        "142221":{
            "choices":[
                "Lie and say you're with Jamie, your wife",
                "Lie and say you're with Jamie, your sister"
            ],
            "content":"<div class=\"\"><div> <span>          decide that trying to pawn the watch with a solar powered supply and the I-Phone is a bad idea, seeing as you need a battery source to go back to the future, and these both have unique power sources.You approach the counter and tell the man that you just got to town, and have no money. He seems to understand but it's clear he is confused by why you are telling him about your problems. <br>\r\n          \"I need a place to stay for a little until I can afford a place of my own, and I would be willing to work to pay off my stay, I'm also with my ___________\" You confess.<br>\r\n          You...</span></div></div>",
            "created":1273986000,
            "id":884218,
            "title":"Ask if you can negotiate a work deal"
        },
        "144":{
            "author_id":"averagejack",
            "author_name":"AverageJack",
            "choices":[
                "Run down the alley like Forrest Gump",
                "Greet the gents and see what happens"
            ],
            "content":"<div class=\"\"><div> <span>A hologram is generated from the area of the belt buckle, generating the image of a face right in front of you.<br>\r\n<br>\r\nBefore being able to figure out what is going on, the figure speaks, “Please name date, time and location to proceed to desired reality.”<br>\r\n<br>\r\nRealizing that you must be wearing some type of novelty belt, you want to see if it responds to voice commends.<br>\r\n<br>\r\n“1102AD, 20h00, Jerusalem”, you say having recently read a book on the crusades and the Knights Templar.<br>\r\n<br>\r\nA sudden flash makes you dive for cover, but instead of hitting the concrete sidewalk, you hit a cobblestone street. You shake your head and look around. Feeling slightly dazed, you realize that you must have hit your head on the sidewalk, because you’re pretty sure that you are hallucinating.<br>\r\n<br>\r\nGetting to your feet, you try to shake off the confusion and figure out what is going on.<br>\r\n<br>\r\n“Year – 1102AD, time – 20h00, location Jerusalem”, the belt says.<br>\r\n<br>\r\nLooking down at the belt, you freeze up and colt shiver shoots up your spine.<br>\r\n<br>\r\n“Noooo”, you hear the words escaping your lips as you look around, suddenly aware that you are indeed not wearing a novelty belt.<br>\r\n<br>\r\n“Halt, who goes there”, you hear from behind you. Swinging around, you see two men with battle-axes and heavy armour approaching you.<br>\r\n<br>\r\nTo your left, a dark alley leads away from your ‘new friends’.  Alternatively, the two gentlemen might be able to help you.<br>\r\n</span></div></div>",
            "created":1226206800,
            "id":605676,
            "title":"An Image appears from the belt asking date, tim..."
        },
        "145":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "you travel to your own past",
                "you travel to future",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>At the first sight nothing happens, but then…</span></div></span></div>",
            "created":1258434000,
            "id":792809,
            "title":"Nothing happens- at the moment"
        },
        "1451":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>should a gender change be involved?</span></div></span></div>",
            "created":1258606800,
            "id":793794,
            "title":"you travel to your own past"
        }
    },
    "info":{
        "author_id":"navatar1",
        "author_name":"Ducttape Knight",
        "brief_description":"Time Travel! When will you go, what will you see? ",
        "created":1199284620,
        "description":"<td align=\"left\" class=\"norm\">You are Jay, a 21 year old college student who's taking the current year off from school. At a garage sale you find a belt from the future. The belt has controls that can easily let you choose whenever you want to go, and on the other side has controls that depend on the story line.<br>\r\nIt also has bracelets that link the bracelet wearer to the belt wearer, so others can travel with you. Where it goes from there is up to everyone who reads and hopefully adds. <br>\r\n<br>\r\nPlease add, but a few rules. <br>\r\n1- Don't kill off any main characters, though abandoning, or losing a limb are fine, because someone else can always write a re-entrance. <br>\r\n2- Nothing that would be illegal, like underage sex<br>\r\n3- More than 2 sentences if you add<br>\r\n<br>\r\nAnd remember, HAVE FUN with this. =D<br>\r\n<br>\r\nP.S. If you do find a story line you want to continue, but neither of the choices are appealing, just add what you want and send me a message about changing the choice that you chose to continue<br>\r\n</td>",
        "id":1369305,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1557241860,
        "modified":1557241860,
        "pretty_title":"The Time Belt"
    }
}