{
    "chapters":{
        "1":{
            "author_id":"kickfacer",
            "author_name":"ULTIMEGA",
            "choices":[
                "Naruto Uzumaki",
                "Sasuke Uchiha",
                "Other Characters",
                "Characters from other anime or a game",
                "Create your own Character"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who do you want as your main character?</span></div></span></div>",
            "created":1269406800,
            "id":856208,
            "title":"The Beginning"
        },
        "11":{
            "choices":[
                "Tsunade and she came to take him back to his apartment",
                "Kabuto and he came to poison Naruto",
                "Anko, she was there training and heard him collapse",
                "Unknown sound girl who came to the village under Orochimaru's orders",
                "someone else"
            ],
            "content":"<div class=\"\"><div> <span>\" Hi I'm Naruto Uzumaki, I like ramen, I hate people who hate me just because I hold Kyuubi, and my dream is to become Hokage.\"<br>\r\n<br>\r\nNaruto lied on his bed staring at the bed. He had just came back with Jiraiya, Tsunade, and Shizune and visited Sasuke in the hospital after Tsunade healed him. \" I don't get it. After getting healed and waking up, Sasuke-teme stared at the wall and then glared at me. What did I do?\" Naruto mumbled to himself.<br>\r\n<br>\r\nHe stood up and left his apartment. As usual he saw another hate message on his windows. He sighed, made a clone, and told him to clean it off before any of his friends saw it. He then ran towards the training field to get some extra training and to shake off the boredom. <br>\r\n<br>\r\n\" I need to become the strongest, I need to become the strongest, I need to become the strongest to protect my friends!\" Naruto yelled as he fought off a huge pack of clones he created. The clones all created Rasengans and charged at the real Naruto. Naruto looked down and felt of some Kyuubi's chakra enter him. He then looked up right when the clones got to him. He ducked under the first clone, grabbed its wrist, spun around while hitting other clones with the one he had a hold, and then threw it at another clone. <br>\r\n<br>\r\nNaruto felt one of the clones hit him with a Rasengan which sent him flying into a tree. Naruto pushed himself off of it, turned back around, and made a Rasengan filled with Kyuubi's chakra. He sent all of the Kyuubi's chakra that was within him (not a lot of it) into it and looked at the rest of the clones. \" Lets see if this will work...Rasengun!\" Naruto yelled as he shot the Rasengan off of his hand and hit one clone, but it kept going and destroyed more before exploding destroying the rest. \" Huh...huh...huh...Okay...I won...that...but I need...more...trai-\" He stopped as he collapsed unconsciously. <br>\r\n<br>\r\nAfter passing out, someone appeared out of the trees and walked over to Naruto. It was...</span></div></div>",
            "created":1299463320,
            "id":1066108,
            "title":"Naruto Uzumaki, Fox Boy"
        },
        "114":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "Tayuya of the sound four?",
                "Kin Tsuchi who is somehow alive?",
                "more sound girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which sound girl approaches the leaf villages number 1 knuckleheaded ninja?</span></div></span></div>",
            "created":1545338760,
            "id":2591331,
            "title":"Unknown sound girl who came to the village unde..."
        },
        "1141":{
            "author_id":"imageveiwer",
            "author_name":"Imageviewer",
            "choices":[
                "She is to seduce him?",
                "To kidnap him?",
                "more options"
            ],
            "content":"<div class=\"\"><div> <span>Unbeknownst to the leaf village's number 1 knuckleheaded Ninja who was about to collapse, he was being watched by a pair of eye's in the thick cover of the surrounding tree's. Tayuya of the sound four was the red headed sailor mouthed Kunoichi who served as Orochimaru's elite bodyguard was assigned the task of observing and following the blonde 9 tailed jinchuriki first before acting.<br>\r\n<br>\r\nshe looked down upon Naruto with her famous irritated glare at having to stalk a kid for days on end learning his routine before deciding when to act and the timing couldn't be anymore perfect, she watched as Naruto tried to drag himself from the grounds only to fall from over exhaustion both physically and spiritually as well as charka wise.<br>\r\n<br>\r\nShe dropped down from her position and walked over to the passed out blonde until she stood over him.<br>\r\n<br>\r\nTayuya glared down upon his sleeping peaceful face with a frown as she remembered her instruction regarding her mission on the blonde Ninja before her.<br>\r\n<br>\r\nShe was ordered by Orochimaru to....<br>\r\n<br>\r\nwhat were her orders regarding Naruto?</span></div></div>",
            "created":1545339720,
            "id":2591336,
            "title":"Tayuya of the sound four"
        },
        "12":{
            "choices":[
                "Sasuke likes to take a pause with his mission and enters the pub.",
                "Sasuke gets to hidden leaf village in no time."
            ],
            "content":"<div class=\"\"><div> <span>\"I'm Sasuke Uchiha and my only goal in life is to sentence people to death. Those who have missbehaived toward the Uchiha clan will not get away. All shall die! Now!\"<br>\r\nSasuke travels through a dark forest alone. It seems he is a one man army now days. It's alright, his powers are somewhat godlike compared to any other living ninja. At least to his knowledge. <br>\r\nSasuke remembers this path. It was the same one he took when he betrayed his home country some years ago. Of course then it was to the opposite direction. Away from all the friends. Are they his friends anymore? He doesn't care. That is nothing compared to his destined mission. Nothing to waste time thinking at.<br>\r\nHe passes a pub. It looks to be crowded and noicy. Alcohole is served and the people seem to be all ninjas.<br>\r\n</span></div></div>",
            "created":1288545180,
            "id":984320,
            "title":"Sasuke Uchiha"
        },
        "122":{
            "choices":[
                "Sasuke hides in the woods.",
                "Sasuke pulls a hood over himself and tryes to hide his face."
            ],
            "content":"<div class=\"\"><div> <span>Sasuke has been walking for a day and at last he can see the face statues in the distance. The time has finally arrived, he gets to mess Konoha around. For everything.<br>\r\nStill walking on the road, he will go through the main gate. But before he gets there, he sees something and gets scared. There, comming up of a hill, team 7, and heading towards Sasuke. It seems, the Konoha team hasn't noticed him yet. They are talking and joking and laughing, acting relaxed and doesn't look forward, where a great threat might appear.<br>\r\n\"That moron.\" Sasuke mumbles.\"Do I have to deal with them already?\"</span></div></div>",
            "created":1289253180,
            "id":990035,
            "title":"Sasuke Uchiha's encounter with the past."
        },
        "13":{
            "author_id":"kickfacer",
            "author_name":"ULTIMEGA",
            "choices":[
                "Sakura Haruno",
                "Ino Yamanaka",
                "Hinata Hyuga",
                "Neji Hyuga",
                "Other choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay. Who else?</span></div></span></div>",
            "created":1269406800,
            "id":856212,
            "title":"Other Characters"
        },
        "135":{
            "author_id":"kickfacer",
            "author_name":"ULTIMEGA",
            "choices":[
                "Itachi Uchiha",
                "Garra",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Take your time.</span></div></span></div>",
            "created":1269406800,
            "id":856213,
            "title":"Other choices"
        },
        "1353":{
            "choices":[
                "Deidara",
                "Sasori",
                "Other characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One of these?</span></div></span></div>",
            "created":1270702800,
            "id":864385,
            "title":"More Choices"
        },
        "13531":{
            "choices":[
                "He is inside of Orochimaru's laboratory",
                "He is inside of a hut and there is a person taking care of him"
            ],
            "content":"<div class=\"\"><div> <span>Deidara tossed and turned uncomfortably; his entire body was burning. He was inbetween the state of consciousness and unconsciousness. He had just been having a very odd dream about Sasuke Uchiha juggling balls of explosive clay while Sasori lectured Deidara about being more prepared because apparently Sasuke should be able to juggle 6 balls of clay instead of just 5. <br>\r\n<br>\r\n\"What a strange dream...\" Deidara thought to himself. <br>\r\n<br>\r\nSlowly as Deidara began to regain the ability to think clearly the strangeness of the situation started to be evident in his mind. <br>\r\n<br>\r\n\"Ugh...why is my body burning... Un...? Wait a second... Wasn't I just fighting that Sasuke guy? Did I win...wait... DIDNT I BLOW MYSELF UP?! Yes.....I did! I shouldn't be alive...where am I? Hm...well it's too quiet and not painful enough to be hell, and this sure is not heaven. Hah, and I'm no reincarnation of myself... Hmph! Well, I suppose I will just have to open my eyes and see for myself what is going on.\" <br>\r\n<br>\r\nDeidara slowly started to open his eyes...and he saw...</span></div></div>",
            "created":1270702800,
            "id":864389,
            "title":"Deidara"
        },
        "14":{
            "author_id":"kickfacer",
            "author_name":"ULTIMEGA",
            "choices":[
                "Final Fantasy",
                "Kingdom Hearts",
                "Soul Eater",
                "Prince of Persia",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which game or anime?</span></div></span></div>",
            "created":1269493200,
            "id":856361,
            "title":"Characters from other anime or a game"
        },
        "15":{
            "author_id":"scorpiokun",
            "author_name":"Scorpio-kun",
            "choices":[
                "a boy",
                "a girl"
            ],
            "content":"<div class=\"\"><div> <span>Wrapping my bandages back into place, I decided to run some errands for extra training.<br>\r\n<br>\r\nI always keep my name a secret, naturally only one person knows my real name...atleast that's what She thinks.<br>\r\n<br>\r\nI watched myself grin stupidly in my mirror.<br>\r\n<br>\r\nPoor Tsunade-sama, if only she knew, that one of my hobbies is collecting headbands,identities and especially...hehe ALL SORT OF TECHNIQUES!!<br>\r\n<br>\r\nBut well...nobody should know...unless it's reeeeeeaaallyy necessary...<br>\r\n<br>\r\n<br>\r\nYeah,right, they wish.<br>\r\nI'm not going to give away my freedom just like that to any of the villages!Besides it's not like I reeeeaallyy belong to any of them anyway.<br>\r\n<br>\r\n<br>\r\nSheezzz is it me or do I start sounding like that fox-kid?<br>\r\n<br>\r\nNot that I don't appreciate his presence or anything...it simply isn't in my nature to act all moronic on my own.<br>\r\n<br>\r\nThat would be more my something for me to act around my teammates, gosh I simply looove to make them think I'm a childish naive little kid.<br>\r\n<br>\r\nOnly to blast them of their freaky feet and snarl in their ignorant faces at make them feel stupid and helpless with their stupid little \"problems\".<br>\r\n<br>\r\nI yawned, ugh glad that I'm a ...</span></div></div>",
            "created":1278046800,
            "id":910325,
            "title":"Create your own Character"
        },
        "151":{
            "choices":[
                "Find my old friend.",
                "Help Neji Hyuuga."
            ],
            "content":"<div class=\"\"><div> <span> I stared at my reflection and sighed my 5 tailed wolf demon made me a outcast with its over protection and lack of trust. My real name is Otomo[wolf].My Demon power is that when ever I was about to get hit long Silver hairs and hardened to real silver! Protecting me from Knifes and swords. I remember my old friend Luna Ellen how she wanted to go with me but I left without her. I missed her. I checked the time 5pm I decided to go to get a bite to eat.<br>\r\n I payed and I went to the hotsprings.When I was done soaking I ran into Tsunade and Sakura.\"Gensu[Fake Name] I need you to go on a mission.\" Then lady Tsunade handed me form:<br>\r\n<br>\r\nRank:B<br>\r\nMission: Track down[choice 1]: rough ninja Luna Ellen. [Choice 2]: Neji Hyuuga<br>\r\nPlace:[Choice 1] Land of Lightning.[Choice 2] Land of wind<br>\r\nTeam Mates: [Choice 1] Naruto Uzamaki &amp; Sasuke Uchiha. [Choice 2] Rock Lee &amp; Ten-Ten</span></div></div>",
            "created":1292093520,
            "id":1012722,
            "title":"a boy"
        },
        "1511":{
            "choices":[
                "It was a person",
                "It was a animal"
            ],
            "content":"<div class=\"\"><div> <span>[Listen Readers Im going to make Luna my gf so if you add on dont make her like Naruto or Sasuke and vice-versa]<br>\r\n<br>\r\n I couldnt belive it Luna Ellen. I made her go rouge. We where both from the hidden cloud. I stared at Lady Tsunade \" I accept the mission thank you Tsunade- sama.\" She nodded and told me to prepare. The next morningI got prepared my sword and knifes etc. I felt a tingle of emotion I had the thought of wearing a trench coat over my old Hidden Cloud uniform. Would that be safe? Would either Naruto or Sasuke find out? I steeled my nerves I put on my old uniform[ Black short sleeve shirt Black Pants and a set of gloves] I knew Luna would reconize me we were on the same team My other Team mate was killed in the war against the Hidden Mist Village. He was hilled by a guy with a huge sword and banages over his mouth Zabuza I heard he was already dead. I put my trench coat and left Lunna had my head band.<br>\r\n I met Naruto and Sasuke.\"your late Gensu.\"Naruto grinned<br>\r\n \"your worse than Naruto.\"Sasuke smirked<br>\r\n \"Shut up Sasuke\" Naruto Yelled. I grabed their heads and hit them together.\"Ahh!\"<br>\r\n When  We started jumping from branch to branch.After 6 hours we reached the Border and set up camp in the woods. Naruto and Sasuke slept I sat on a tree branch kept watch I heard a sound I heard a twig break I sat up and listened</span></div></div>",
            "created":1292095920,
            "id":1012739,
            "title":"Find my old friend."
        },
        "15111":{
            "author_id":"therebelion",
            "author_name":"Colmillo",
            "choices":[
                "is Shintaro Inuzuka\" he said with a grin",
                "is Shintaro Inuzuka\" He said with a frown "
            ],
            "content":"<div class=\"\"><div> <span>I droped from the tree and reached for the kunai in my poket. The person did the same, it was a white cloaked  person with a white and red dog mask. We stood with eachothers knifes at our necks threatning our false moves would result in death \"Who are you?!\" a male voice yelled \"I'm Gensu curent shinobi of the hidden leaf village who are you?\" He quickly dashed back but close enough to let me see him take his mask off. It was a leaf shinobi with red facemarkings on his face clearly a Inuzuka \"My name...</span></div></div>",
            "created":1293240900,
            "id":1021962,
            "title":"It was a person"
        },
        "151111":{
            "author_id":"therebelion",
            "author_name":"Colmillo",
            "choices":[
                "jonin",
                "Anbu"
            ],
            "content":"<div class=\"\"><div> <span>\"What's your busines here?\" I said being a little confused \"Relax i'm just a escort sent by lady hokage\" We need no escort\" Lady hokage does not was two jinjurikis walking around without any back up. I understand that you have tamed the 5 tails but naruto is still very unstable to be set loose\" So if those were your orders why we're you sneaking around? why didn't you join us back at the village?\" I asked and he just bowed his head in shame \"Because i over slept\" That's a really sad excuse what rank are u?</span></div></div>",
            "created":1293242280,
            "id":1021968,
            "title":"is Shintaro Inuzuka\" he said with a grin"
        },
        "1511111":{
            "author_id":"therebelion",
            "author_name":"Colmillo",
            "choices":[
                "the next morning ",
                "later at night"
            ],
            "content":"<div class=\"\"><div> <span>\"Hahaha really jonin and still so out of line\" I laughted so hard i almost woke up Naruto and Sasuke\"Look bro no one asked for your dahm opinion okay, look let's just get some sleep and well move into enemy territory first we gotta go though the land of water\"he said finnaly getting serious \"Haiiro c'mere\" he said and right behind him appeared one of the biggest nindogs that looked like grey wolf. He layed down close to a tree and then Shintaro sat next to him with his cloak on him as a blanket over Hairo</span></div></div>",
            "created":1293260040,
            "id":1022062,
            "title":"jonin"
        },
        "15111111":{
            "author_id":"therebelion",
            "author_name":"Colmillo",
            "choices":[
                "\"I've been ordered to know everithing about you\"",
                "\"You need to cover up your tracks better kid\""
            ],
            "content":"<div class=\"\"><div> <span>In the morning I woke up to the smell of food. I fell asleep ontop of the tree where i was keeping watch at night. I fall feet first to the ground and I see shintaro cooking some fish next to a fire.\"how'd you sleep?Gensu aka Otomo...\" How the hell did he know my true name? I grabed the collar of his black shirt in anger and snarled \"who told you my true name?\" At that moment Hairo started to growl at me Shintarou has a plane face \"Chill Hairo\" He extends his hand over twards him and Hairo calms down...</span></div></div>",
            "created":1296247260,
            "id":1043724,
            "title":"the next morning "
        },
        "151111111":{
            "author_id":"therebelion",
            "author_name":"Colmillo",
            "choices":[
                "Shintaro leaves",
                "Shintaro stays"
            ],
            "content":"<div class=\"\"><div> <span>I looked in shock as to believe thr fifth hokage would have ordered this. Then he slaped my hand off his collarand looked me in the eyes and said. \"Look kid it's nothin personal she has to give those orders so the council will stop bugging her about the little stuff, I got total confidence on you and don't worry we'll find her i promise\" With that I began to feel a little better and began to cool down I never tend to loose my temper like that but for some reason today seemed odd. Then Naruto woke up...</span></div></div>",
            "created":1296506580,
            "id":1045357,
            "title":"\"I've been ordered to know everithing a..."
        },
        "1511111112":{
            "author_id":"therebelion",
            "author_name":"Colmillo",
            "choices":[
                "sasuke wakes up ",
                "some thing is coming i can sence it"
            ],
            "content":"<div class=\"\"><div> <span>Naruto woke up with a yawn out of the tent and rubbing his eyes \"Yo Gensu who are you talking to?... Hey Shintarou what are you doing here fleabag?\" He said with a lid up face \"You know each other\" I asked. They rushed at each other in a playful fight and then Naruto said\"He's kibas cousin, when i was still in the academy he took some of us for survival training in the land of wind\" It seemead a bit anoying traveling with someone so immature but i couldin't afford to loose my best friend, so i'll get over.</span></div></div>",
            "created":1302066240,
            "id":1082911,
            "title":"Shintaro stays"
        },
        "151112":{
            "author_id":"nakato",
            "author_name":"Kikato",
            "choices":[
                "Will he use he Sharingan and Hidden Move",
                "Keep it a Secret"
            ],
            "content":"<div class=\"\"><div> <span>Shintaro Frowns at Me While I still have my Kunai in My Hands then Shintaro Rushes Me.<br>\r\nShintaro easily get beat by me. Finally Naruto and Sasuke waking up. While still looking for Her.<br>\r\n\"Oh No I think he might be Trailing us\" Said Me \"Sasuke and Naruto Go Some where else just for Now\" said Me. Naruto didn't understand but Sasuke did. While Spliting Up Sasuke Activites His Sharingan the was at his 2 Tomoe and Sense Two people heading to me. I Quickly Notice and Sasuke comes Back to fight with me. In my mind: If I use my Hidden Move or my Dojutsu. Sasuke Would be like where did you get that Sharingan. But.....<br>\r\n</span></div></div>",
            "created":1579544820,
            "id":2776251,
            "title":"is Shintaro Inuzuka\" He said with a frown "
        },
        "152":{
            "author_id":"scorpiokun",
            "author_name":"Scorpio-kun",
            "choices":[
                "WHAT THE HELL HAPPENED WITH MY EDUCATION?THROWING THINGS AWAY RADOMLY!",
                "Meh...I am pretty clumsy from time to time, nothing new... ...I guess...><;?",
                "Bad feeling?Yea, I always get those hunches when I'm about to..."
            ],
            "content":"<div class=\"\"><div> <span>...a girl!Nyahahaha!!<br>\r\n<br>\r\n...now that was freaky =_=;, note to myself,don't EVER laugh like that AGAIN!<br>\r\n<br>\r\nAnyway, I'm ready!<br>\r\n<br>\r\nI turned away from my mirror, after having a last check of my outfit and gears that I might need.<br>\r\n<br>\r\nRushing off towards the entrance door, I swiftly stole some food out of the fridge, as usual not paying any attention of what I grabbed, and opened the door and with a last and a very agile wrist I locked the door right behind me.<br>\r\n<br>\r\nRunning of towards the training ground to do some last minute training before heading of to get me a mission, I checked what I stole from the fridge...<br>\r\n<br>\r\nWell...it could've been worse,<br>\r\n<br>\r\nI told myself checking my handpalm.<br>\r\n<br>\r\nAtleast it's a healthy vegetable-fruit thingy...and red and juicy =__=;, oh well...<br>\r\n<br>\r\n<br>\r\nI cleaned the tomato,a bit disappointed, on my sleeve and ate it like I would eat an apple.<br>\r\n<br>\r\nWhile I was happily sucking the juice out of my breakfast, I realized I made the wrong turn,<br>\r\n<br>\r\nCrap!I took Left!Baka!<br>\r\n<br>\r\nI threw away the left-overs of my tomato in...well...nothing it simply splashed somewhere on the ground, and took the right turn towards the training grounds...<br>\r\n<br>\r\nI did had a bad feeling...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1278257640,
            "id":911415,
            "title":"a girl"
        }
    },
    "info":{
        "author_id":"kickfacer",
        "author_name":"ULTIMEGA",
        "brief_description":"Use your imagination to create the ultimate Naruto episode",
        "created":1269472320,
        "description":"<td align=\"left\" class=\"norm\">Ever wanted to make your own Naruto story? Well, now you have that opportunity!<br>\r\nThis will is an interactive game where you decide what happens next in the world of Naruto.<br>\r\nNow, just to be clear, I have layed down a set of rules and guidelines that must be followed, and I will be very strict about them.<br>\r\n<br>\r\nAbsolutely no explicit (adult) content (i.e. sex, nudity, bondage, etc.). Only softcore is allowed in this field (i.e. characters wrapped in a towl)<br>\r\nYou can choose whatever character from the show to be your main character.<br>\r\nYou can make your own character, but they must be a ninja (you can make them any skill level you want).<br>\r\nIf you choose to, you can use characters from other anime or a video game. If so, that character must be able to fight.<br>\r\nYour chosen can either be good or evil; I don't care which.<br>\r\nBattles are encouraged, so don't be shy. (Just make sure you make it interesting. I don't want see 'I win and you lose' -none of that. I want badass.)<br>\r\nOnly mild vulgarity language-wise is allowed.<br>\r\nIf you choose to have a character die in your chapters, try to keep the gore level to a minimum.<br>\r\nNo less than 10 sentences to a chapter (I will delete if I see this- like I said: strict) However, there is no maximum sentence limit, but you must make it interesting.<br>\r\n<br>\r\nAnd finally,<br>\r\n<br>\r\nYou are not permitted to force the reader to go only one unless absolutely essential. Period.<br>\r\n<br>\r\nIf you have any questions on any of these rules, just messege me, and I'll answer them as soon as possible.<br>\r\n<br>\r\nThat about wraps it up. So be creative, have fun, and show me your ability.</td>",
        "id":1658360,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1579544820,
        "modified":1579544820,
        "pretty_title":"Create Your Own Naruto Adventure"
    }
}