{
    "chapters":{
        "1":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Listen to the Headmistress."
            ],
            "content":"<div class=\"\"><div> <span><i>(Future posts do not need to be nearly as long as this one; This post's length is simply to establish the setting :)    )</i><br>\r\n<br>\r\nPiper Frost opened the car door, and stepped out onto the lush green fields that welcomed her to Macro University; Her new home.<br>\r\n<br>\r\nPiper was a beautiful young woman at 19 years old. Her hair was a rare white color, which flowed down the back of her head at a cute medium length. Piper also had bright-blue eyes that shined in the afternoon sunlight. She was wearing a <b><span class=\"clteal\">*</span></b>light-blue T-Shirt, which contrasted cutely with her <b><span class=\"cblue\">*</span></b>dark-blue skirt. The young lady turned around to wave goodbye to the high school friend who gave her a ride, before walking forwards towards the Ceremony Hall in front of her.<br>\r\n<br>\r\nAs she walked, Piper breathed in the fall air, smiling; The breeze had the pleasant scent of <b><span class=\"cgreen\">*</span></b>nature to it, with a hint of apples coming from a nearby orchard. The young lady looked around her; The campus grounds were picture perfect, with modern buildings, soft-rolling hills, and lots of apple trees. A number of well-kept stone walkways circled the grounds, and led to a wide variety of newly-built buildings, which had modern architecture and huge glass windows. Piper felt that instead of being at a college, she was at a space center... or Google headquarters. A person could easily be lost in the beauty of the place... Which could put them in grave danger.<br>\r\n<br>\r\nPiper saw a group of five or so girls walking into the Ceremony Hall ahead of her. She quickly ran to catch up to them. As she entered the carpeted lobby inside, she saw around 200 girls hanging around, chatting about their summers or homes. Piper thought she saw an old friend of hers in the nearby corner, and was about to walk over to chat them up. However, she suddenly heard the booming voice of the school's headmistress. \"Hello, hello! Yes, greetings everyone! Please make your way into the auditorium!\"<br>\r\n<br>\r\nPiper quickly got swept along with the crowd. As she passed the grand staircase, she briefly saw a black-haired girl run down to rejoin the group, grinning. Piper thought she saw a small gray device in the girl's hand... something that looked similar to a ray gun. Given the theme of the school, Piper had a pretty good idea what it was... but before she could do anything, she found herself pushed along with the crowd of girls, soon sitting in a plush seat in the Auditorium.</span></div></div>",
            "created":1582606800,
            "id":2792948,
            "title":"Welcome to Macro University!"
        },
        "11":{
            "author_id":"superkirby2",
            "author_name":"SuperKirby2",
            "choices":[
                "Well, who’s Piper’s roommate?"
            ],
            "content":"<div class=\"\"><div> <span>Piper sat comfortably in her seat, near the back of the Auditorium. She and countless other college girls watched the headmistress of Macro University approach the microphone to deliver her newcomers’ speech.<br>\r\n<br>\r\n“Greetings, and welcome to Macro University! I am Headmistress Megan Macro. It’s a pleasure to meet every one of you new students today...”<br>\r\n<br>\r\nPretty much anything beyond that became distant gibberish to Piper, who was starting to feel rather drowsy. But toward the end of Headmistress Macro’s speech was a vital piece of info that perked the girl up again.<br>\r\n<br>\r\n“To find out your room assignment, please check the Dormitories bulletin board.”<br>\r\n<br>\r\nOnce the sermon concluded, Piper rushed out of the Auditorium and toward the Dormitories, eyeing the bulletin board with various notices posted on it. She glanced through the notifications and quickly discovered that she would have a roommate..!</span></div></div>",
            "created":1582606800,
            "id":2792959,
            "title":"Drowsing and Dorming"
        },
        "111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Head to the Dining Hall with Gwen (Pacifist Mainline)",
                "Search for the Black-Haired girl... So you can steal her gun (Pred Mainline)"
            ],
            "content":"<div class=\"\"><div> <span>(Posts can be much shorter than this, this is just the end of the intro! ^,^ )<br>\r\n<br>\r\nPiper eagerly ran over to the board, and quickly scanned for her own name. \"Frost, Frost, Frost...\" she said, as her eyes raced up and down. \"Oof!\" she said, as she was accidentally elbowed by some of the other girls who were also eagerly surrounding the board. \"Sorry...\" someone said. However, when Piper turned to look at the girl who bumped her, the girl disappeared before her very eyes! Piper blinked, in shock of course. Suddenly, out of the corner of her eye, she saw the black-haired girl from earlier dashing away, holding something... or rather, someone. Piper made a note to be careful, and to watch her back.<br>\r\n<br>\r\nThe white-haired protagonist of this story looked back at the board, and re-found her name. She was assigned room 211, with another name written next to hers: \"Gwen\". Piper hoped that this Gwen was safe to be around at least. She recalled back to the speech in the auditorium a few moments before; Headmistress Megan Macro had said that roommates were carefully chosen by the faculty, so that things were \"As safe as possible\". Piper hoped she was right.<br>\r\n<br>\r\nPiper walked with the massive crowd of students to the dormitories complex on the East side of campus. She made sure to stay close to the crowd, in case that black-haired girl or an upperclassman was waiting by the sides to 'ambush' weaker members of the pack. As the group moved across campus, Piper felt her own stomach growl; She suddenly remembered the shrunken girl that had disappeared earlier. Without thinking, Piper licked her lips, and salivated a little, before shaking her head and snapping out of it. She still hadn't made up her mind of whether she wanted to make friends at this school... or make meals.<br>\r\n<br>\r\n. . .<br>\r\n<br>\r\nA few minutes later, Piper was walking down the 2nd floor hallway as she scanned the room numbers. \"208, 209, 210... Aha, 211!\" Piper exclaimed, as she arrived at an open door. Inside, was a cute blond girl; She had pink highlights on her medium-short hair, and she was lying down on her belly reading a comic book. \"Oh, hey! You must be Piper!!\" the blond girl eagerly exclaimed, jumping up and running over to shake Piper's hand. \"I'm Gwen- Gwen Poole!\" the blond girl said. Her handshake was warm, and had an excited energy to it- Gwen had a sincere and friendly smile on her face. &lt;\"Maybe this will work out after all...!\"&gt; Piper thought to herself, as she greeted Gwen back. Piper saw that Gwen had already decorated her side of the room with a few superhero posters- There was one of Miles Morales Spider-Man, and one of the Avengers.<br>\r\n<br>\r\n\"Oh my gosh, we are going to <b>LOVE</b> it here! I stopped by the dining hall earlier, and they have... like, everything! And the Library has tons of comics too... I-I mean, my collection's better of course, but still! OH! And our class schedule is super light, we have \"Intro to Shrinking\" at 10:00 AM tomorrow together! Did I mention that the lake on the west side is beautiful? And that research complex in the northwest is totally spooky, I bet they perform all sorts of crazy and mind-bending experiments there... Hey, do you think they have any radioactive spiders there? Can I get Spider-Man powers?!? CAN I GET SPIDER MAN POWERS?!?\" Gwen gushed, getting really excited. <br>\r\n<br>\r\nPiper couldn't help but giggle from Gwen's cuteness. She was glad to have a roommate who she felt totally safe around... Maybe she really could survive this year without being... eaten. That reminded her.<br>\r\n<br>\r\nPiper explained to Gwen about the black-haired girl she saw earlier, warning Gwen to watch out for her. Gwen nodded, and listened intently. \"Huh... So she stole one of those shrinking guns early, huh? I heard there's quite a few versions of those guns, which have different shrink-features...\" Gwen mused. \"I bet that girl is totally, like, the supervillain of this story, and is plotting some massive plan to overthrow all we hold dear, and subjugate the world to her ideals... Neat. : 3 \" Gwen said causally. Piper was amazed; Her roommate had somehow taken her advice very seriously and very carelessly at the same time. Piper began to like her a lot.<br>\r\n<br>\r\nGwen leapt back onto her own bed. \"We better get some rest!! I heard tons of upperclassmen prey on newbies like us, so we need our ENERGY if we want to survive the first day!\" she said, before promptly turning over and falling into a deep sleep, snoring loudly. Piper grinned, and made up her own bed. Maybe Gwen had the right idea... In reality, this university was incredibly dangerous, with dozens of hungry girls waiting around every corner. Maybe taking things lightly like Gwen did really was for the best...! Piper brushed her teeth, and got into her own bed.<br>\r\n<br>\r\n. . .<br>\r\n<br>\r\nPiper woke up the next morning at 8:00 AM, rubbing her eyes sleepily. She saw Gwen by their sink brushing her teeth. Piper took a moment to think... They should probably grab some breakfast, so they should head over to the dining hall. Though... it would probably be quicker to steal a shrink ray and grab a meal \"On-The-Go\". Piper blinked- What was she thinking?! She couldn't just eat someone... All these girls are still real people, with their own lives! Still, she was very hungry, as she rubbed her growling tummy...<br>\r\n<br>\r\nIt seemed it was time. Time for Piper to decide who she wanted to be at Macro University. Would she make friends? ...Or make meals?</span></div></div>",
            "created":1582606800,
            "id":2792993,
            "title":"Well, who’s Piper’s roommate?"
        },
        "1111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Turn around to look at the attacker (Pacifist Mainline)",
                "Flee like crazy! Get the HECK out of there!"
            ],
            "content":"<div class=\"\"><div> <span>Piper sighed and smiled. She decided that it would be best if she took her time at Macro U to make lifelong friendships, and protect what mattered to her. Of course, she could still totally have some fun while she's at it...! Gwen seems chill and fun, maybe she'd be up for having some safe fun with the shrinking devices sometime? Who knows... but for now, Piper was proud of her choices, and decided to live out her time here to the fullest. \"Ppppppfffftttttt!\" Gwen blew into the sink inside their room; It sounded like she had finished brushing her teeth. Piper laughed along with Gwen's silliness; Despite all the danger surrounding them, having a fun friend like her made things all the easier. Even if she did have her... unique moments.<br>\r\n<br>\r\n. . .<br>\r\n<br>\r\nSeveral minutes later, Piper and Gwen were walking together down the stone pathway together, towards the primary dining hall. \"You'll LOVE it there. They have anything you could ever want... Ribs, Mac-And-Cheese, Pizza, Calzones, Pasta, Salads, Ice Cream, Burritos, Cake, Pudding, Bubble Gum, Fruit, Steak,...\". Gwen continued her list, as Piper had a confused expression on her face. \"...Bubble Gum? That's not generally something served at a buffet...\". Gwen shrugged. \"Eh, you know how there's that myth that if you swallow gum, it stays in your stomach for seven years? Maybe they figured they can have tines test if it's actually true...\" she giggled, skipping along.<br>\r\n<br>\r\n. . .<br>\r\n<br>\r\nPiper and Gwen sat down at a booth in the dining hall, and soon had dozens of scrumptious plates in front of them, filled with every dish imaginable. Piper ate in a polite and orderly fashion; Gwen just stuffed her face, grabbing things from every which way. \"Mmm!! Dis' tastes bettah than any tiny could!!\" Gwen cheered, before stuffing a hot-dog into her mouth and comping it up. \"Hotdogs, for breakfast?\" Piper asked her with a surprised look. Gwen gulped it down, bun and all \"Yeah! In case some strong girl attacks me, I need my energy so I can <b>beat her up!!</b>\" Gwen cheered, pulling her sleeve back and looking strong.<br>\r\n<br>\r\nThat got Piper thinking \"So you don't plan on eating anyone here? What brought you to Macro U then?\". Gwen gulped down her meal. \"Well, I'm still a vorarephile too, like most every girl here! I like the idea of being massaged around in a cutie's mouth... just in a safe way, y'know?\" she smiled. \"I figured this is a good way to learn about cool new techniques I can use! Not all shrinking needs to end in digesting someone ; )  \" she grinned. Piper smiled back. \"Yeah... that's a good way to look at it! I feel that way too, I want to... um, play it safe while I'm here.\" Gwen stuck her finger up to Piper's face, and winked at her. \"You've still gotta show those other girls that you're the boss, ya'hear? We're in the lioness's den here- Not everyone's going to be like us! Don't be afraid to fight back if they give you trouble!\". Piper looked down at her hands. \"I don't know, I've never really fought anyone before...\". Gwen slid over next to Piper, and bear-hugged her. \"Aww, don't worry, I'll keep my cute roommate safe! I'll protect ya'!\".<br>\r\n<br>\r\nSuddenly, Gwen got an unusual expression on her face<br>\r\n<br>\r\n ': 3<br>\r\n<br>\r\n\"O-O-Oops... I... uh, maybe having a burrito at breakfast wasn't a great idea...\" Gwen said, clutching her stomach. \"... GottaRunToTheBathroomI'llCatchYouLater!! '': 3  \" Gwen yelled, dashing towards the lavatories. Piper giggled a little bit, and continued eating. After a few minutes however, she felt a chill down her spine, like someone was watching her. She turned around, and...<br>\r\n<br>\r\n*ZAP!*<br>\r\n<br>\r\nPiper blacked out for two seconds; When she opened her eyes, she saw that she was still sitting on the booth seat in the dining center... Except it was absolutely massive, and she was an inch tall!! \"Hey look Abby, I my first catch!!! \" Piper heard someone say behind her; Someone <b>much</b> bigger than her. She didn't have much time to react...</span></div></div>",
            "created":1582693200,
            "id":2793522,
            "title":"Breakfast."
        },
        "11111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Inside a cute girl's mouth (Pacifist Mainline)"
            ],
            "content":"<div class=\"\"><div> <span>Piper turned around, and saw a tall blond girl standing over her, grinning. She had a shorter, chubbier girl next to her, who had black hair with bright green highlights (Thankfully not the black-haired girl Piper saw earlier).<br>\r\n<br>\r\nPiper tried to dash away, but the tall blond girl scooped her up. \"Aww, don't run off so soon, we've barely met yet~! : 3 \" she giggled. \"My name's Audrey\"! The blond introduced herself, sitting down in the booth with her black-haired friend, who grinned excitedly. \"But don't worry, I'm not going to be your host today- That privileged goes to my cute lil' roommate, Abby!\".<br>\r\n<br>\r\nAbby, the black-haired girl with green highlights, blushed a little as Audrey put Piper into her hands. \"Hold her tight Abby, don't let her get away!\" Audrey instructed. \" 'Kay!\" Abby smiled, looking down at Piper as if she was the most beautiful person in the world. \"Wow.... a Real tiny!!\". Audrey explained. \"Abby's not really a pred normally, but she's always dreamed of snacking on a tiny all the way back when we were in high school together. Anyhow, when we got here, I decided to help her catch one... Lucky you, being the meal of someone so cute~! ; )  \" Audrey smiled. The two of them were awfully lighthearted and nice, given that they were about to straight up eat someone.<br>\r\n<br>\r\n\"How'd you even get a ray gun?!\" Piper asked Audrey. \"They haven't even been distributed yet!\". Audrey put her hand behind the back of her head, looking embaressed. \"Oh, well... Apparently, there's this Black-Haired girl named Mary who's on some crazy conquest or something... I don't really know, but apparently she threw out a Tier-1 Ray Gun earlier today, and I was lucky enough to see where she tossed it and nab it!\" Audrey explained.<br>\r\n<br>\r\nAbby kept looking down at Piper with wonder in her eyes. \"Oh wow, can I eat her yet? How does it work?\". Audrey giggled. \"Just put her in your mouth, silly!\". Piper snapped back to reality. \"H-Hey! Y-You can't eat me, I'll die!\". Audrey slid over next to Abby, and cuddled her- It seemed they were more than just friends. \"Don't worry, we're not monsters like Mary- Abby here will digest your body, but she'll turn you into fat on her tummy! You'll still be able to talk to her and us... You can even help her with her schoolwork~!\". Piper sweated a lot. \"T-That's not much better!! I-I don't want to be pudge on her tummy!\"<br>\r\n<br>\r\n She was interrupted when Abby licked her; The short girl's saliva cascaded down Piper's neck. \"Oh, WOW! She tastes great!!\" Abby grinned. \"I'm gonna do it now!! Here goes Piper, thanks for being... like, the best meal ever!!\". \"WAIT, NO-!\" Piper yelled, as Abby tossed her into her waiting mouth. </span></div></div>",
            "created":1582779600,
            "id":2793818,
            "title":"Turn around to look at the attacker (Pacifist M..."
        },
        "111111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Deus Ex Machina (Pacifist Mainline)",
                "Your eyelids start to grow heavy..."
            ],
            "content":"<div class=\"\"><div> <span><b>(Pacifist Mainline)</b><br>\r\n<br>\r\nPiper landed on Abby’s squishy, red tongue. It was very warm and bouncy, almost as if a bounce house and a hot tub had a baby. Abby closed her lips, and playfully licked Piper’s face a few times. “Hehe, she tasted really great, Audrey!!”<br>\r\n<br>\r\nPiper blinked. \"Um... how the heck are you talking? I'm on your tongue...\". Abby put her finger to her lips. Without moving her mouth, she said \"That's a good question... I dunno...\". Audrey giggled, hugging Abby. \"Oh, that's because of the school-wide telepathy field! Headmaster Megan Macro mentioned in her speech yesterday that there's a weak telepathy beacon set up in the research center, that gives us all some very limited telepathy powers, even when out mouths are full! <b>It's effects are pretty short range though, so you can only talk with someone if you're inside their body...</b> Didn't the two of you pay attention at the seminar yesterday? ^,^' \".  Both Abby and Piper shook their heads. \"Wait a second...\" Piper said, \"How are YOU hearing me then, Audrey?\". Audrey smiled. \"<b>Normally, you can only use the telepathy beacon to talk with your host... But if you're really, really close with someone, your connection with them gets stronger</b>! Abby and I have known each other for years, so I can link to her, and hear you through her link.\". Piper sighed. \"That's... all really confusing. I'm totally going to forget all those detail later...\".<br>\r\n<br>\r\nPiper shook her head, as a wave of saliva washed over her head, drenching her white hair. \"W-Wait! I c-can't be talking with you two, you're trying to eat me!! Let me the heck out!!!\" Piper yelled, kicking the inside of Abby's cheeks. \"Hehe~! She tickles a lot in there! I wonder how she'll feel in my belly, Audrey!\" she laughed. Audrey smiled. \"Aww, don't gulp her down so fast, take time to enjoy her- She's your first catch!\". Piper's thoughts raced. She had to get out fast... Or else she's become a permanent guest of the short girl's body. &lt;\"Maybe... Maybe I can use that telepathic connection thing to reach Gwen?!\"&gt; she thought desperately, as Abby's tongue slid her body across her clean white teeth. Piper concentrated, as her legs and hips were shoved into a pool of creamy warm saliva. &lt;\"Come in Gwen... Gwen... C-Can you hear me? I-I really need your help!\"&gt;. Piper focused as hard as she could for a few seconds...<br>\r\n<br>\r\n<b>You failed to reach Gwen, you do not know her well enough yet</b><br>\r\n<br>\r\n\"Shoot!!\" Piper yelled, realizing that she didn't really... know much about Gwen yet. Plus, Gwen was probably still in the bathroom, which was way too far away. Suddenly, she felt herself pushed to the middle of Abby's mouth. The girl with the black hair and green highlights giggled \"<i>Over the teeth, past the gums...!</i>\" she sang, pushing Piper back. \"No, no, no, NO!\" Piper yelled, feeling herself sliding. \"<i><b>Look Out Stomach, Here She Comes~!</b></i>\"<br>\r\n<br>\r\n<b>GULP.</b><br>\r\n<br>\r\nPiper was quickly pushed down Abby's squishy esophagus. \"N-No!\" Piper panicked. The muscles kept massaging and pressing her down, almost like she was being pushed along by dozens of people inside a Mosh Pit... Except with way more saliva. Piper heard a steady and rhythmic beating to her side; She guessed it was Abby's heart. The beating rose higher and higher up, fading away, as...<br>\r\n<br>\r\n<b>PLOP!</b> Piper landed inside the cute girl's stomach, into a giant pool of stomach juices. All around her was Abby's breakfast, which comprised of... a lot of cakes and doughnuts. It seemed like someone had a sweet tooth. \"Hehe~! You feel GREAT in there! Can you wiggle around some more please? It tickles! ^,^ \" Abby cheered, rubbing her tummy from the outside. \"N-No way! Y-Your going to digest me! S-Spit me out, you brat!\" Piper yelled. Suddenly, she was knocked over as the stomach wall pushed her over; It seemed Abby (Or Audrey) was massaging her tummy. \"Oh right, I forgot!\" Abby laughed playfully. \"Time to digest you and turn you into tummy fat~! Don't worry, it won't hurt, and you'll stay alive; Plus, you'll be able to talk with me any time you want, you can even help me study for tests and stuff!\". Piper banged on the walls. \"Let me out, you dumb girl! I don't want to turn into belly fat!\". Piper felt the acids below her causing her skin to start tingling; She felt herself growing woozy.</span></div></div>",
            "created":1582779600,
            "id":2793890,
            "title":"Inside a cute girl's mouth"
        },
        "1111111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Go to class already! (Pacifist Mainline)"
            ],
            "content":"<div class=\"\"><div> <span><b>(Pacifist Mainline)</b><br>\r\n<br>\r\nSuddenly, Piper jolted as the world turned sideways around her. \"<span class=\"chotpink\">HYAH!!!!</span>\" she heard someone shout from outside. \"OW!!!\" Abby yelled, as she was knocked over onto the ground. The stomach juices sloshed around wildly; Piper found herself completely submerged for a few seconds, before being tossed around again, and landing in a pile of cake in the side of Abby's stomach. \"ABBY!\" she heard Audrey shout from outside.<br>\r\n<br>\r\n\"Piper! Piper, come in! Is that you?!?\" she heard Gwen's booming voice from outside. \"GWEN!\" Piper shouted, overjoyed. \"You came for me! Did you hear my telepathic message then?!?\". Gwen sounded confused. \"...Telepathic wuzzit? Oh, uh... When I came back I saw you were missing, and these two were standing right next to our table giggling, holding a ray gun. ...I'm smart enough to figure out what happened, you know : 3 \". Piper could help but laugh, she really needed Gwen's playfulness at a time like this.<br>\r\n<br>\r\n\"H-Hey, get away!\" she heard Audrey say from outside. Then, Piper heard a loud *SMACK*, followed by Audrey yelling \"F*CK!\"; It was Gwen punching Audrey in the face, knocking her down. \"These two really arn't that tough luckily... I already took the blond's ray gun. : 3 \" Gwen said from outside. \"Okay, good!\" Piper yelled. \"Get me out of here!\". Gwen felt Abby's body turn sideways again, as if Abby was being made to sit up again. She heard Abby's voice. \"W-What are you going to d-do??\". Gwen grinned. \"Time for you to spit my friend up, girlie.\". Suddenly, there was an intense push on Abby's stomach; It seemed Gwen was trying to make Abby quesy. \"W-Whoa! D-Don't do that, I a-ate a lot, Y-You're gonna make me...\"<br>\r\n<br>\r\nWhat happened next wasn't pretty. To spare the graphic details... A few seconds later, Piper was lying on the ground outside of Abby's body... along with all of the girl's breakfast.<br>\r\n<br>\r\nGwen quickly picked Piper up. Gwen was holding a shiny bronze-colored ray gun; The one Audrey had earlier. \"Gwen Poole, here to save the day!!\" she cheered. Piper looked around; Audrey was sitting on the floor looking mad but not doing anything; Abby was coughing a lot. Gwen looked down at them. \"You two can clean up this mess, this is all your fault. Don't mess with my friends again.\"<br>\r\n<br>\r\nGwen quickly walked over to the bathroom, and cleaned Piper off in the sink. \"Sorry that all happened... I didn't think anyone else had a ray gun yet!\" Gwen apologized. \"N-No... thanks for your help. : ) \" the tiny Piper smiled up at her. The two of them walked outside, and Gwen took Piper over to a nearby secluded garden area. \"So, from what I heard, this is a Tier-1 Ray Gun... It should be able to bring you back to normal size!\" she said. She set Piper down on the ground, and aimed carefully. \"P-Please be careful...\" Piper said, bracing herself. Gwen pulled the trigger, and Piper was hit with a blue light that filled her with an odd sensation; She was stretched and pulled every which way, until she was back at her normal height. Piper ran over to Gwen and hugged her, crying a little. \"I-I was so scared... thanks for your help Gwen.\". Gwen smiled. \"Don't worry, I'll always be there for you, we've gotta look out for each other in this bat-sh*t crazy place! How else will we survive? : 3 \" she laughed playfully.<br>\r\n<br>\r\nThey looked at the time, and saw that it was 9:40; Twenty minutes until their first class. They began to head down the walkways, so that they could make sure to get their survival equipment from first block. \"Oh, and by the way... You should have some way to protect yourself.\" Gwen said, turning to Piper. \"Here, take this; I'll be fine, I can just beat up anyone who gives me trouble. : 3 \". Gwen handed over the bronze Tier-1 raygun to Piper; She was officially armed now, and had the means to unshrink herself when needed! Of course, only when she is outside of someone's body. But still, she felt much safer with it. However, a chill ran down her back as she saw a name etched near the bottom of it- \"<span class=\"clred\">MARY</span>\". Right. Abby and Audrey had mentioned they found the gun discarded somewhere. It seemed they weren't the only two she had to watch out for.</span></div></div>",
            "created":1582779600,
            "id":2793905,
            "title":"Deus Ex Machina (Pacifist Mainline)"
        },
        "11111111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "The teacher walks in (Pacifist Mainline)"
            ],
            "content":"<div class=\"\"><div> <span><b>(Pacifist Mainline)</b><br>\r\n<br>\r\nPiper and Gwen casually walked along the pathway network at the center of campus (Location 8 on the map if you’re curious!). They were headed to their 10:00 AM, “Intro to Shrinking”. As they walked, they saw a wide variety of water fountains and pools made with a beautiful style of architecture. Lush ivy coated the side of many buildings, and there were numerous gardens scattered all around; The university’s campus truly was very beautiful.<br>\r\n<br>\r\nPiper looked down at the bronze Tier-1 Raygun that Gwen had given her. Piper had received the raygun from Gwen… who took it from Audrey… who had found it discarded by it’s… original owner. Piper’s right index finger slid along the letters etched into the sides of the gun: “M-A-R-Y”. Piper coughed. “So, uh… Whoever this ‘Mary’ is, she sounds pretty dangerous...”.<br>\r\n<br>\r\nGwen turned to her. “Right… you mentioned that she was the one you saw grabbing girls on the first day, right?”.<br>\r\n<br>\r\nPiper nodded. “Yeah… That blond girl, Audrey, also mentioned that Mary just threw away this gun… That Mary is on some sort of ‘conquest’ of the school...”.<br>\r\n<br>\r\nGwen gave her a confused look. “What, you mean like in that vore game, Shrink High?”.<br>\r\n<br>\r\nPiper shook her head. “I don’t really know… But I think whatever she’s planning, she’s probably one of the most dangerous girls at this school. She might even be stronger than some of the Upper Class girls.. We should watch our backs…”<br>\r\n<br>\r\nThey arrived at the Academic Complex (Location 6); It was absolutely huge!! Gwen and Piper found their room, with a few extra minutes to spare. Piper stopped by the bathroom; After all the stress and chaos from earlier, she had almost forgotten that she really needed to pee! She returned to the classroom, and sat down next to Gwen. There were about 20 girls in the class; She didn’t recognize a lot of them, but she spotted Audrey, who glared at Gwen (But didn’t do much more). Piper scanned around for Mary, who luckily wasn’t in her class block. However, there was also a new black haired girl next to Piper who winked at Piper; This girl had a big red streak in her black hair. Next to the red-streak girl was a brown-haired girl who… was fast asleep, snoring loudly.</span></div></div>",
            "created":1582779600,
            "id":2793971,
            "title":"Go to class already! (Pacifist Mainline)"
        },
        "111111111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Learn about the Rayguns (Pacifist Mainline)"
            ],
            "content":"<div class=\"\"><div> <span><b>(Pacifist Mainline)</b><br>\r\n<br>\r\nThe teacher walked in; She was... a very tall woman. There was no easy way to describe her. Her skin was a bright purple, and she had a huge black afro, that was in the shape of a...square? Her legs were huge, and she wore a bright pink chest-plate that had a star symbol on it; She also had dark-purple shoulder pads. Most notably, she was also wearing the coolest pair of shades Piper had ever seen; They were as reflective as mirrors, and looked like something out of an anime... except even bigger.<br>\r\n<br>\r\n\"Hello class.\" the woman said with a heavy British accent. She had a deep voice. \"My name is Garnet. And I am your homeroom teacher.\" Garnet nodded. \"It's my job to teach you how to stay alive at this school. If you pay attention...\" she said, putting a finger on her shades, \"...you might just survive the year.\"<br>\r\n<br>\r\nGarnet walked over to a giant box on her desk; It looked very heavy. She casually lifted it up, and tossed it down onto the floor in front of the rows of desks, like it was as light as a ruler. it landed with a huge *THUD*. Piper heard someone behind her say \"Finally, it's about time we got them!\".<br>\r\n<br>\r\nGarnet opened the box. \"Please walk up to the front of the class, and form a single file line. Each of you will be issued a Tier-1 Raygun.\" The girls excitedly clamored to the front of the room. They were all eager to arm themselves; Either for self-defense... or to hunt with. Piper was about to get up from her seat, when she noticed Garnet was standing right next to her, with a hand on her shoulder. \"Not you, Piper. Your raygun is already better than the one's distributed here\". Piper sat back down, confused. How did Garnet know her name? Or know about her gun? Or...<br>\r\n<br>\r\nFor the few minutes, the line in the front of the classroom moved forward, as more and more girls got equipped. Gwen grinned when she got hers; It was Bronze like Pipers, except... it had a black stripe across the center of it?<br>\r\n<br>\r\nOnce the class had calmed down and everyone was back in their seats, Garnet started talking again. \"Now, I will explain a few ground rules about this school, and how the guns work.\" she said. \"First things first... You will be safe inside any classroom, you have my word on this.\". Just as Garnet said that, a girl in the back of the class tried to shoot someone near her. However, the beam dissipated, and had no effect; The girl who was shot stayed her normal size, and angrily yelled \"Hey!!\"<br>\r\n<br>\r\nGarnet put her finger on her glasses, flashing a reflective light across the room. \"As you can see, all classrooms have a protective field in them that is controlled by the teacher's device. In other words, the teachers control all shrinking and unshrinking inside the classrooms. All classroom exercises will be 100% safe and reversible.\" she said. \"You can also trust all teachers 100%, we are strictly instructed to not consume any students without consent.\" she explained. <br>\r\n<br>\r\nGwen leaned over to Piper. \"Hey, it's good that classrooms are safe at least!\" she whispered. \"Maybe we can use class time to investigate what that Mary girl is planning?\"<br>\r\n<br>\r\nGarnet continued. \"It will be in your best interest to attend class and participate in our exercises; Your skills will improve, and so will your overall chances at survival. Be warned; this school is a deadly place. Less than 25% of students generally survive their time here, and for good reason. There are no protective fields outside of classrooms; Even in the hallways of the academic complex, one student can shoot another if they are not looking. So.. stay alert.\". Piper looked to her left at the brown haired girl, who was still snoring intensely; Her friend with the red streak in her hair had grabbed an extra gun for her, but... &lt;\"How the heck does that girl plan to survive her time here?!? She's definitely going to be one of the first to go...\"&gt; Piper thought.<br>\r\n<br>\r\n\"Now then...\" Garnet said, flashing the light from her shades. \"Let's explain how your ray-guns work.\"</span></div></div>",
            "created":1582779600,
            "id":2793991,
            "title":"Time for Class. (Pacifist Mainline)"
        },
        "1111111111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Battle Against a Tomboy (Pacifist Mainline)"
            ],
            "content":"<div class=\"\"><div> <span><b>(Pacifist Mainline)</b><br>\r\n<br>\r\nGarnet snapped her fingers, and a diagram was projected out of thin-air onto the front of the classroom. It was almost like magic. \"Now then... let's explain the Raygun Tier List.\"<br>\r\n<br>\r\n____________________________________________________________________________ ___________________________________________________________<br>\r\n|&gt;&gt;&gt;=======<b>Tier 0</b>==========<span class=\"cdorange\"><b>Tier 1</b></span>==========<span class=\"clgrey\"><b>Tier 2</b></span>==========<span class=\"cyellow\"><b>Tier 3</b></span>==========|==========<span class=\"clblue\"><b>Tier 4?</b></span>==========<b>Tier ?</b>=======&gt;&gt;&gt; . . .<br>\r\n|___________________________________________________________________________ ___________________________________________________________<br>\r\n<br>\r\nGarnet jumped into the lecture. \"Tier 0 Rayguns were only experimental, and were found to be unusable. A Tier 0 Raygun could be used to shrink down someone... But they can not revert anything back to a normal size. Thus, if you are shrunken while holding one, you have no means of turning yourself back to normal.\"<br>\r\n<br>\r\n(In an alternate predatory branch, Piper cursed, having been stuck with a useless Tier 0 Raygun)<br>\r\n<br>\r\n\"You all were given <span class=\"cdorange\">Tier 1</span> Rayguns.\" Garnet explained. \"Tier 1 Rayguns are the current default model; They can shrink others down to an inch tall, and they can also revert someone shrunken back to their normal size, given that they are not inside someone's body. So, if you find yourself shrunken, as long as you have your Raygun you can unshrink yourself... given that you are in a safe and open location, and have two minutes to charge it up. Additionally, Tier 1 Rayguns can protect their users: In simple terms, they come with a force field. You can sustain exactly <b>One </b> hit before your force field falls, and you are susceptible to attack. It's defense recharges after an hour, which is the same for all models. Stay very alert when your force field is down, because you can be shrunken at any time.\" Garnet warned them<br>\r\n<br>\r\nThe teacher continued. \"<span class=\"clgrey\">Tier 2</span> Rayguns are given to advanced students. They have all abilities of a Tier 1 Raygun, but with increased defensive capabilities: If someone has a Tier 2 Raygun, you need to shoot them a few times before their force field is depleted and you can shrink them. Having a Tier 2 Raygun makes you automatically much safer. Additionally, you can specify a particular shrinking height with this odel\"<br>\r\n<br>\r\n\"<span class=\"cyellow\">Tier 3</span> Rayguns are the standard model that Teachers use.\" Garnet explained. \"They have even better defense and offense than the Tier 2 model, and they can also <b>Enlarge</b> a person up to 50 feet tall, such as yourself. No students currently have a Tier 3 Raygun model... but the Headmistress is looking into making the available for upperclass students.\"<br>\r\n<br>\r\n\"Finally, the Research Department is also working on creating <span class=\"clblue\">Tier 4</span> and beyond models, which would be even more powerful. The Headmistress also possesses a superior model of Raygun. However, these are not items you will likely see anytime soon.\" Garnet finished. <br>\r\n<br>\r\n. . .<br>\r\n<br>\r\nGarnet explained a few other things that Piper already knew. The white-haired girl looked down at her own model of gun- She wondered why Garnet stopped her from grabbing the kind that everyone else got. Turning hers over on it's side, it said \"Tier 1\"...  so it was still the same Tier as Gwen or anyone else had. It was missing the black stripe from the other Tier 1's, but that seemed to be it... So... what was so unique about hers?<br>\r\n<br>\r\n\"Next...\" Garnet said, walking forward. \"It's time for everyone to practice their devices, and to learn about what to do if you are shrunk.\" she said. Everyone followed her into a side-room connected to their classroom; It was the size of an entire Gym! \"Everyone, please find a partner.\" Garnet said. Piper was about to walk over to Gwen, before Garnet said, \"...That is, someone who is not your roommate.\" Piper sighed, and turned to look for someone else. Suddenly, she saw the girl who winked at her earlier standing in front of her; The girl with the black hair with the red streak through it. She was grinning.<br>\r\n<br>\r\n\"Hey.\" the girl said. \"My name's Ryuko. Ryuko Matoi. Let's do this.\" she grinned, looking straight at Piper. Ryuko was very tomboyish, and seemed to have a fierce and confident personality... along with an huge dose of Edginess. Piper wasn't sure what to expect next, especially given that the activity would likely involve shrinking...<br>\r\n<br>\r\n\"Now then... I'll explain how this activity will work.\" Garnet said.</span></div></div>",
            "created":1582779600,
            "id":2794005,
            "title":"Rayguns Explained (Pacifist Mainline)"
        },
        "11111111111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "FIGHT! (Pacifist Mainline)"
            ],
            "content":"<div class=\"\"><div> <span><b>(Pacifist Mainline)</b><br>\r\n<br>\r\nPiper stepped onto a small two-sided court in the gym; The entire room was absolutely massive. She was quite impressed; This wasn’t even the school’s main gym facility, just an annex for classroom use… Where did the school get the money for all these gorgeous buildings? The gym had dozens of the small courts; They were shaped somewhat similarly to a volleyball or tennis court, but there was no net… Piper guessed that these courts were not used for conventional sports.<br>\r\n<br>\r\nRyuko stood at the opposite side of the court; She was grinning, and looked very confident. However, Ryuko looked down at her Raygun for a moment, and frowned- Something seemed to be troubling her. Ryuko shook her head, and looked back at Piper. “Hey!” Ryuko yelled from across the court. “Do you think this is some kind of battle or something, Piper?” she asked. Ryuko grinned excitedly. “I hate classes and all that other crap, but I’m pretty good at fights, they’re kind of my thing… I saved the world once two years ago.” she said, brushing aside some of her black hair. Piper saw an excited fire burning in Ryuko’s eyes; This girl seemed like the real deal, she was probably much stronger than Gwen even. However, despite Ryuko’s intimidating emo appearance, she didn’t strike Piper as a bad person… More like just someone who got fired up easily.<br>\r\n<br>\r\n“Wow, really?!” Piper asked, amazed. “What did you save the world from?”.<br>\r\n<br>\r\n“Clothing.” Ryuko answered simply, as if that explained everything. &lt;”O-Kay…”&gt; Piper thought to herself. &lt;”I guess everyone at this school is going to be either evil or crazy...”&gt;<br>\r\n<br>\r\nRyuko turned towards the court to her left, where her brown haired friend was. It seemed that other girl was set to have a battle with Gwen; However, the brown-haired girl still looked like she was half sleepwalking. “Hey, Mako!” Ryuko yelled over to the brown-haired girl. “You better win this match, I’ll take you out for Ice Cream later if you do!”.<br>\r\n<br>\r\nThe girl named Mako turned to Ryuko and giggled lightheartedly “Hehe~! Aww, that’s super nice of you Ryuko!” she smiled sweetly. Suddenly, the lights of the gym flashed pitch black; At first Piper thought it was due to something Garnet did, but suddenly, Mako was standing there in the center of the room, with a massive spotlight shining down on her. Piper thought she heard some kind of choir singing somewhere, just as Mako began an excited rant. <i>\"BUT WAIT, RYUKO! If I eat too much ice cream, it'll just go straight to my butt! If I get a huge butt, I'm not going to be able to run away from other girls, and I'm going to end up becoming some chick's snack! And if that happens, She'll digest me, and then she'll absorb the ice cream too, and then SHE will end up getting fat! Then, she'll be slowed down too much, and will get caught and eaten all the same... And then it'll just keep happening, until every girl keeps eating each other at this school, and keeps getting a huge butt, until only you're left to eat the last girl Ryuko! And then YOU will get a huge butt! I can't do that to you Ryuko!! If you get a huge butt, then your sailor uniform wouldn't fit any more, and you'll start wearing something else! And you'll forget how much you love wearing sailor uniforms Ryuko! I can't do this to you, Ryuko! I won't let you let me rob you of your memories of your precious uniform!!!\"</i> she sobbed, before striking a dramatic pose, just as the lights magically turned back on.<br>\r\n<br>\r\n\"Heh, alright.\" Ryuko laughed. It seemed she was used to these... rants. Suddenly, Mako's eyes lit up, \"...But wait...! If I eat low fat ice cream... I won't get a huge butt, and then the other girls wont get huge butts, and then Ryuko won't get a huge butt, and then...\" Mako pondered. \"Okay Ryuko, it's a deal!\" she said in a sing song voice.<br>\r\n<br>\r\n&lt;\"... 0.0\"&gt; Piper exclaimed. &lt;\"...Alright, they're both crazy then...\"&gt;<br>\r\n<br>\r\nGarnet reappeared after setting all the groups up. \"Okay, girls. This will be a practice exercise in using your weapons. When I yell 'Begin', you will need to use your Raygun to shrink your opponent. Remember that each of you can survive one hit safely; After that though, you are vulnerable.\" Garnet explained. \"As a reward, if you win, you can swallow your opponent if you like. However, you'll need to spit them back out before leaving class... And trust me...\" Garnet said, tapping her shades and flashing light across the room, \"I'll know if anyone doesn't.\"<br>\r\n<br>\r\nRyuko gripped her gun, and got down into a ready position, as if she was going to break into a sprint. \"Good luck.\" Ryuko grinned. \"But I'll be the one putting you in my belly, Piper &gt;: 3 \" the edgy girl declared.<br>\r\n<br>\r\n&lt;\"Ugh, why'd I have to get paired with the superwarrior girl?!\"&gt; Piper thought to herself, gripping her weapon unsteadily. &lt;\"I've got... like, no chance!!\"&gt;<br>\r\n<br>\r\nGarnet grinned in the center of the gym. She snapped her fingers, and suddenly, a large array of pillars and walls emerged around each court, almost like they were trapped inside of a maze \"Okay girls...\" Garnet grinned, \"Begin.\"</span></div></div>",
            "created":1582952400,
            "id":2794878,
            "title":"Ryuko and Mako (Pacifist Mainline)"
        },
        "111111111111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Ryuko shrinks Piper (Pacifist Mainline)",
                "Piper dodges, and...!"
            ],
            "content":"<div class=\"\"><div> <span>(Pacifist Mainline)<br>\r\n<br>\r\n\"Crap!!!\" Piper yelled, as she ducked behind one of the stone walls that emerged. &lt;\"Garnet could have WARNED us about that!!\"&gt; she thought quickly; The arena had turned into a maze... Much like the corridors of the school. At this moment, Piper was envious of Gwen; She'd probably already shrunken that Mako girl, and was likely sucking on her like a lollipop. Piper, on the other hand, had to take down some wild girl who looked like she could take down 10 girls at once!<br>\r\n<br>\r\nPiper saw movement in the corner of her eye; It was Ryuko, who was dashing around at superhuman speeds. &lt;\"Drat, she's FAST!\"&gt; Piper thought, as she quickly dodged over to another pillar to get out of the line of fire. Somehow, she was still alive; Ryuko could have taken the shot there... but didn't. Piper wondered why.<br>\r\n<br>\r\nPiper ran rapidly around several bends of the maze, hoping that she could lose Ryuko and have time to think up some sort of plan. However, her speed was no match for the edgy girl; Even after getting past three bends, Ryuko was still right on her tail, and was about to have her pinned. \"FINE! LET'S DO THIS!\" Piper shouted, turning around and taking aim at Ryuko; She fired her gun rapidly several times at Ryuko, who was on the opposite side of the straightaway. Ryuko quickly ducked to avoid the blasts, then drew her own weapon. Piper braced herself for defeat, and closed her eyes; She heard three shots from Ryuko's gun. However, Piper felt nothing; Ryuko was still standing there looking very frustrated, and all three shots had missed her somehow. Piper quickly dashed around the corner. <br>\r\n<br>\r\nPiper felt like her breath was running out; She couldn't keep this going much longer. She tried to hide behind a corner, and just as Ryuko passed, Piper fired a shot at the tomboy; It hit her directly in the back! \"Oh F*uck!!\" Ryuko yelled, turning around and shooting Piper point blank in the face, knocking her back; Their protective fields were both depleted now.<br>\r\n<br>\r\nPiper scrambled to get back up; Ryuko shot at her, but kept missing. &lt;\"Is she going easy on me...?\"&gt; Piper thought, confused, as she dashed around another corner. This time, she tried to route around a different way, to the center of the Maze. When she got to the open center area, she saw Ryuko standing on the opposite side, starring her down; It was time to finish this, one way or another.<br>\r\n<br>\r\nPiper and Ryuko both took aim at each other; Piper shot rapidly at Ryuko, who skillfully dodged each time, almost predicting Piper's every shot. After firing 10 shots, Piper's gun needed to cooldown for a second; She braced herself for Ryuko's attack; The girl with the black and red hair fired 9 shots directly at Piper, but somehow, every single one of them missed her, and skewed off to the side! Piper thought she heard Ryuko cursed again. \"Okay, screw it.\" Ryuko said. She dashed forward and simply punched Piper in the face, knocking her onto the ground. Ryuko stood over her, grinning. \"Sorry, I know that wasn't classy of me, I was out of options.\" she said, pointing her Raygun point-blank at Piper's face.<br>\r\n<br>\r\nRyuko pressed her finger on the trigger, and...</span></div></div>",
            "created":1582952400,
            "id":2794894,
            "title":"FIGHT! (Pacifist Mainline)"
        },
        "1111111111111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Get to the vore already!! (Pacifist Mainline)"
            ],
            "content":"<div class=\"\"><div> <span>(Pacifist Mainline)<br>\r\n<br>\r\nPiper felt herself in a daze; She sat up, and felt Ryuko picking her up gently by the back of her light-blue shirt. \"Um...\" Ryuko said, blushing a bit. \"You were... pretty good. A lot better than I was, I was garbage out there...\" she said, looking to the side.<br>\r\n<br>\r\nPiper looked up at Ryuko's giant face. \"What do you mean?\" Piper asked. \"I've never seen someone move so fast, I could barely hit you!\" she said.<br>\r\n<br>\r\n\"Yeah, um, about that...\" Ryuko said, her cheeks reddening. \"I sort of... have no aim. I don't do guns.\" she said, not looking Piper in the eye. Piper blinked. \"Er... you... what?\"<br>\r\n<br>\r\n\"I can't aim a gun, okay?!\" Ryuko snapped, irritated. \"S-Sorry, I didn't mean to yell.\" she apologized. \"It's just... um, really embarrassing for me, given my past and all...\".<br>\r\n<br>\r\nThis got Piper curious. \"Wait, if you don't use guns, how'd you save the world before? How did you fight?\" Piper asked.<br>\r\n<br>\r\nRyuko smirked. \"I used half of a giant Scissor.\"<br>\r\n<br>\r\n\". . .\" Piper responded. \"...You're just messing with me now, right?\"<br>\r\n<br>\r\n- - -<br>\r\n<br>\r\nRyuko looked a little concerned for Piper. \"S-Sorry for punching you earlier... I, um, I got a little over-excited back there...\" she said. Piper held the side of her face \"It stings a little, but it's not bad... I'm sure you didn't mean to, it's okay!\" she said up to Ryuko.<br>\r\n<br>\r\nThey talked a bit more, before Ryuko heard her own stomach rumble. The tomboy grinned. \"Well, a promise is a promise, I did say I'd eat you...\" she laughed a little. \"I mean, I don't have to if you really don't want me to...\"<br>\r\n<br>\r\nPiper smiled back at Ryuko. \"No, it's okay! You seem like a nice person Ryuko. I was swallowed earlier, but forcibly. It would probably be nicer to get to try it out in a safer and more friendly setting. :) \" Piper responded. <br>\r\n<br>\r\nRyuko grinned. \"Okay, then.\"</span></div></div>",
            "created":1582952400,
            "id":2794898,
            "title":"Ryuko shrinks Piper (Pacifist Mainline)"
        },
        "11111111111111":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "\"I saw someone acting odd\" explain to Gwen and follow the girl (Pacifist main)",
                "\"nothing, hey what do you think we should do with our free time?\""
            ],
            "content":"<div class=\"\"><div> <span>Ryuko held the sjrunken student over her face before lowering Piper feet first towards her waiting maw. As Piper was being slowly lowered she just watched as Ryuko's massive lips parted and her tongue slightly extend. Finally Piper's feet hit Ryuko's tongue and the larger girl slurped Piper's whole body into her mouth. As Piper slid between Ryuko's lips she was coated in saliva, it was warm and sticky and Piper was quickly soaked through. Piper knew she'd lost the fight and fully intended to just let Ryuko swallow her and get this over with, but as Ryuko's massive tongue began to push her around the cavernous maw it was really hard for Piper not to struggle or try to fight. After tasting Piper for only a short time Ryuko swallowed, as Piper was drawn down deeper into Ryuko's body she was glad that the larger student hadn't played with her for too long. Piper slid down Ryuko's esophagus and landed with a plop atop the remains of Ryuko's breakfast in her stomach. And so Piper settled in to wait, she really had no idea how much time was passing, she just sat in the driest place she could find and listened to the omnipresent sounds of Ryuko's body working away. Piper felt a twinge of concern as she thought about how some of those sounds were Ryuko's body digesting the pile of food she was sitting on, but she was sure Ryuko would let her out before her body moved on from the food to her.  After awhile Piper woke up, she hadn't realized that she'd fallen asleep, but she was now on the ground in the classroom rather than inside Ryuko. Looking up Piper saw Ryuko aiming her ray gun down at Piper, Piper flinched as Ryuko fired but then realized she was being restored to her normal height. \"Well\" Ryuko started as Piper checked over herself back at her normal size \"Thanks for the tasty snack, I wish you would've struggled a bit more.\"<br>\r\n\"Sorry I guess\" Piper was still getting herself sorted out \"How did I get out of your stomach? I don't remember what happened.\"<br>\r\n\"Oh, Garnet did a thing with her ray gun, I don't really get how it works since I don't remember the moment either, but the idea is that it's more pleasant for both of us than it normally would be if I would've just puked you up or something.\"<br>\r\n\"Oh, that seems good to have.\"<br>\r\n\"Yeah, don't want to have to vomit after every time you finish fooling around with a shrunken friend. Oh\" Ryuko's attention was caught by something over Piper's shoulder, Piper turned and saw Gwen growing Ryuko's friend back to normal size. \"Looks like the girl you came in with let Mako out, well class is pretty much over so I think we're going to head out.\"<br>\r\n\"Okay, have a good day, I guess I'll be seeing you two around\" Ryuko and her friend Mako joined the group of students getting ready to leave the room. Piper walked over to Gwen \"So, I guess you did better with your practice duel than I did.\"<br>\r\n\"I sure did\" Gwen beamed at Piper \"I still don't think I'll actually be eating many girls, but just the swallowing and playing with a tiny is a lot of fun.\"<br>\r\n\"I'm sure it is\" Piper responded feeling a bit dejected about messing up her first use of the shrink ray.<br>\r\n\"Aww, don't worry, hey, maybe once we're done for the day you and me could fool around with the ray guns a bit\" Gwen gave Piper a mischievous smile, Piper was slightly taken aback but nodded to Gwen.<br>\r\n Gwen and Piper joined the stream of girls leaving the classroom, just as the pair passed through the door Piper heard the teacher, Garnet, call out \"Remember girls, everyone who got swallowed during your practice rounds got let out, but any of you who lost your shield will still be recharging and anyone who catches you with your shield down won't be planning to let you go again.\" Piper and Gwen gave each other a look and made sure to be careful checking around corners as they left the building. Piper and Gwen made it safely out, it was fortunate that they'd been in the middle of the group, Piper could imagine that other hungry students might wait outside classes if they knew that the students coming out would be defenseless and would go for the first few. Still, Piper felt a little uneasy every time she noticed another student with a shrink ray out, even though none of them made a move against her. As Piper and Gwen left the building they looked around, they had a few hours before their next classes so they could do pretty much anything in the meantime. Piper was about to ask Gwen if she had any plans when she noticed someone. That dark haired girl who'd had a ray gun early walked by carrying a tiny victim in her hand, but Piper noticed that the tiny looked like she would be older than any of the college's students she'd seen so far. As Piper watched the dark haired girl glanced around, and then crept around the corner of one of the research buildings. Piper felt a bit suspicious, but she didn't really know if this kind of thing happened on campus much.<br>\r\n\"Hey Piper, what'cha looking at?\" Piper was snapped out of her thoughts by Gwen's question.<br>\r\n\"Oh...\"</span></div></div>",
            "created":1583125200,
            "id":2795477,
            "title":"Swallowed again"
        },
        "111111111111111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Heck No!! (Pacifist Mainline)",
                "Join Mary"
            ],
            "content":"<div class=\"\"><div> <span>\"I-I think I saw a girl nab someone!\" Piper explained. \"The Pred had dark hair... but it wasn't that Mary girl. I'm not sure who she was.\" Piper said, shaking her head.<br>\r\n<br>\r\nGwen nodded. \"Right. We'd better go see if we can help... Did you see which way she went?\" she asked, brushing some of her pink highlights back.<br>\r\n<br>\r\n\"She headed towards a garden complex near the center of campus. That way...\" Piper pointed. Both girls set off, at a hurried pace.<br>\r\n<br>\r\n. . .<br>\r\n<br>\r\nPiper and Gwen approached a secluded courtyard behind the 7-story Administration Building near the center of campus; It was actually pretty empty, since most girls were off at classes. \"Why the heck are there so many hidden areas on campus... Do they want stuff like this to happen?!\" Piper said aloud. \"Probably, yeah...\" Gwen said, as they passed under an archway of Ivy, deeper into the sheltered courtyard. \"The school basically encourages the students to eat one another... the headmistress Megan Macro's crazy smart, but she sure seems to have an odd sense of ethics.\" Gwen commented.<br>\r\n<br>\r\nThe rounded a corner of a bush maze. Piper hoped the girl they were looking for didn't enter it, but luckily Piper spotted the dark-haired girl ahead, sitting nearby a stone waterfall built into the side of the building. She seemed to be playing with something... inside of her mouth.<br>\r\n<br>\r\n\"Hey!\" Piper shouted, as she and Gwen approached the girl. Both Piper and Gwen had their guns drawn, and aimed. \"Let her g-\"<br>\r\n<br>\r\n<b>Gulp.</b><br>\r\n<br>\r\nThe dark-haired girl swallowed the girl inside her mouth, and grinned over at Piper and Gwen. \"What, you have a problem?\" she snickered.<br>\r\n<br>\r\nPiper blinked, before aiming her Raygun again, this time in a more intimidating position. \"W-Why would you do that?! You just ate someone!!\" Piper yelled.<br>\r\n<br>\r\nThe dark hair girl laughed. \"No, just I ate my lunch. Something I'm eating for nutrition doesn't get to be considered as a person, they're just my food.\"<br>\r\n<br>\r\nGwen stepped closer. \"You're messed up, you know that?\" she said, gritting her teeth. Gwen turned to Piper. \"We should shrink her, she can't draw her weapon before we both fire, and then we can-\"<br>\r\n<br>\r\n\"Oh, I wouldn't do that if I were you.\" the dark haired girl smirked, acting very casual. \"I've got protection.\"<br>\r\n<br>\r\nGwen inched closer. \"The 'heck is that supposed to mean? We've got you outnumbered!\" Gwen said, aiming almost point-blank at the girl.<br>\r\n<br>\r\nSuddenly, Piper and Gwen heard a new voice behind them. \"Heh, seems like someone woke up on the wrong side of bed today. Upset you haven't caught a tiny yet, 'Pinky?\" someone said to Gwen. Piper turned around, to see 5 girls emerging from the maze. At the front of their ranks was... Mary!!<br>\r\n<br>\r\nThe dark haired girl near the fountain laughed, as Mary's 4 helpers circled around Gwen and Piper, surrounding them. Mary grinned. \"You're not half bad, 'Pinky.\" she said to Gwen. \"You'd probably be able to scare a lot of the weaker girls with an attitude like that. I bet you're pretty good in a fight too.\" Mary said. Mary didn't even have her weapon drawn; She was completely in control of the situation. Mary turned to look at Piper. \"So, White-Hair, what can you do? Are you tough like your friend here? Or are you nothing more than someone's snack?\"<br>\r\n<br>\r\nPiper blinked. She tried to aim her weapon around, but there were too many of Mary's girls. \"W-What do you want, Mary? Are you here to eat us?!\" Piper said, trying to keep her cool.<br>\r\n<br>\r\nMary grinned again. \"Heh, seems my reputation proceeds me. If you know who I am, then you should know I'm not wasteful like that.\" she said.<br>\r\n<br>\r\n\"W-Wasteful?\" Gwen asked.<br>\r\n<br>\r\nMary nodded. \"That's right. You see, I have an important purpose at this school. I'm going to change the system... shake things up here, if you know what I mean.\" Mary smiled chaotically. \"But for that to happen, I need a little help from girls like you. I'm going to tear down the old ways to set a brand new order up... And if you join me, you can have everything you ever want when that happens. Join me, and you'll feast on all the girls you want every day; Later, I'll even grant you Rayguns more powerful than the teachers own. All I ask in return...\" she said, inching closer to piper. Mary put her hand around Piper's chin, and whispered in her ear, \"All I ask in return... is a little loyalty.\"<br>\r\n<br>\r\nPiper blinked, as Mary inched away, grinning. Piper noticed a shiny Tier-2 Raygun attached to Mary's belt. &lt;\"Where did she get that?!?\"&gt; Piper wondered. <br>\r\n<br>\r\nMary stood there, with her hands on her hips. \"So, do you think you have what it takes to join \"Mary's Order\"?\" she grinned.<br>\r\n<br>\r\nGwen spat on the ground. \"Heck no, you chicks are messed up! I'm not going to eat people for you!\".<br>\r\n<br>\r\nMary smiled, and turned to Piper. \"And you, White Hair? Think you have the guts to join me?\"</span></div></div>",
            "created":1583211600,
            "id":2796131,
            "title":"Follow the Girl (Pacifist Mainline)"
        },
        "1111111111111111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "A white fog dazes them all (Pacifist Mainline)"
            ],
            "content":"<div class=\"\"><div> <span>\"No way!!\" Piper shouted at Mary. \"Screw you, that's messed up!\"<br>\r\n<br>\r\n. . .<br>\r\n<br>\r\n<br>\r\n...Or, at least, that's what she wanted to yell. Piper understood the situation well; They were outnumbered 6-to-2. And both Piper and Mary had their shields down. She knew full well how this situation would end if she told Mary off. So instead, Piper decided to stall.<br>\r\n<br>\r\n\"I've heard of you Mary, but I've this 'Mary's Order' is new to me. What exactly are you... trying to do?\" Piper asked. She wasn't sure how long she could keep Mary talking for; She didn't get the feeling that Mary was a particularly patient person. \"I take it that you're after something particular that's at this school?\"<br>\r\n<br>\r\nMary looked at Piper smugly. \"So you're an intelligent one, huh? Most of these girls here just join without a second thought, they're just in it for the tinies.\" Mary chuckled. \"Fair enough.\"<br>\r\n<br>\r\nMary continued. \"I can't divulge everything to a newbie like you, of course. But I can tell you enough. This school... is more than it seems. The rayguns, the research department, Megan Macro... This place isn't a school, it's a Fish Tank.\"<br>\r\n<br>\r\nPiper blinked. \"A... fish tank?\". She repeated. Piper still had her Tier-1 Raygun behind her back, and had her finger on the trigger. Not like it did much good... The 6 other girls probably had fully-charged forcefields, and Piper could probably only get in one good shot if she tried anything... Piper racked her brain, trying to think of something to get her and Gwen out of this mess. \"The 'heck are you talking about?\" Gwen asked. Mary put her index finger up at Gwen, like someone would do to a child. \"Quiet, Pinky. The adults are having a conversation here.\"<br>\r\n<br>\r\nMary went on. \"Yes, a Fish Tank. One giant Fish Tank for Megan Macro to test her grand Experiment inside. The core of this school is the research department; They've been developing their Rayguns and the technology present here for a long time, much longer than this school has been around. As you probably know, our class is the 4th class to ever attend this university; It's pretty new.\" Mary said, putting her hands on her hips. \"That's because they recently started needing subjects to test their new toys out on. This entire University, and all its students, are nothing more than one big test simulation for their Raygun tech.\"<br>\r\n<br>\r\nBoth Gwen and Piper were very surprised. \"Y-You mean...\" Gwen said, \"...that we're being experimented on? We're like mice inside of a giant maze?\" Gwen asked.<br>\r\n<br>\r\nMary scoffed at her. \"Please, you didn't think anything was odd about this whole situation?\" she laughed. \"Of course you didn't, 'Pinky... You just got your acceptance letter with it's full tuition scholarship, and accepted without thinking twice.\". Gwen blinked. \"W-What do you mean? I won that scholarship, I ap...\"<br>\r\n<br>\r\nMary chuckled. \"Shut up, Pinkie. Every student here 'won' that scholarship one way or another. The acceptance letter told it was because of your 'exceptional talents'... Ha! The truth was, they were happy just to get more fodder for their little game they're playing here.\"<br>\r\n<br>\r\nPiper pressed forward with her questions. \"So... what's the point of it all then? What is the school trying to test?\". Mary turned back to her. \"For now, just their lower-tier Rayguns. They want to see how a population of vore girls reacts and behaves with their tech. The school is taking things at a boringly slow rate, if you ask me...\" Mary said. \"Eventually, they will probably want to start distributing their technology outside of the school, to increase their influence and resources. Megan Macro's basically obsessed with creating a vore-filled utopia, and wants to use her tech to paint the world in the way she wants to see it\"<br>\r\n<br>\r\nPiper's mind raced. Everything Mary was saying sounded really crazy, though given what this school was like, she couldn't help but feel that what Mary was saying was true. At the same time, Piper knew she couldn't keep Mary talking forever; She needed to find a way to get out of there, ASAP. She ran her finger over the sides of her gun... Earlier, Garnet had told Piper to keep her special Tier 1, but she still couldn't figure out what was unique about it. Piper kept trying to find a hidden switch, a tiny button, or... something that could help her out. Her finger slid over the trigger again, which was when she realized something; It had two notch settings, not just one. If she pulled it down all the way... She could potentially access a hidden feature of the raygun. \"So what then?\" Piper asked Mary. \"Megan Macro's trying to take over the world?\"<br>\r\n<br>\r\nMary laughed. \"She doesn't want to rule the world, she cares more about her research. All she wants is to alter society to match her ideals and fantasies.\" Mary said, inching closer to Piper. \"That's where she and I are different. You see, I don't think we should just change the world... I think we should own it. Girls like us are here because we're the rarest of rare in society; We're vore girls, and we're designed to be natural born predators, consuming the worthless masses of this planet.\" she grinned. \"The girls of 'Mary's Order' think it's time we take our place atop society, and use this school's technology to put us there.\"<br>\r\n<br>\r\nGwen starred in disbelief. \"Right... You're actually batsh*t crazy then.\"<br>\r\n<br>\r\nPiper pressed her luck, and tried to ask one final question. \"But the teachers and faculty have superior weapons to your own... And the entire research complex is heavily fortified. How do you expect to take over the school?\". Mary chuckled at Piper's question, as if it was a trivial matter. Piper's eyes narrowed. \"You're after something, aren't you? Some sort of... weapon. Is it some kind of Raygun?\"<br>\r\n<br>\r\nMary laughed. \"This school has darker secrets that just Rayguns.\"<br>\r\n<br>\r\nMary starred Piper down, hard. She looked a little irritated that she accidentally went on for so long. \"Okay, enough questions. Spill it- Are you with us or not?\" <br>\r\n<br>\r\nPiper sighed deeply, and pulled the trigger on her special Tier-1 Raygun, hard.</span></div></div>",
            "created":1583287980,
            "id":2796314,
            "title":"Secrets of the School (Pacifist Mainline)"
        },
        "11111111111111111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Let's get down to bussiness. (Pacifist Mainline)"
            ],
            "content":"<div class=\"\"><div> <span>It felt like a jolt of electricity surged through Piper's brain, as everything went white; A massive fog quickly shot out of her gun and surrounded them all. \"HEY!\" she heard Mary yell. Piper fuddled to her senses, and quickly grabbed Gwen's hand. \"Let's go!!!\"<br>\r\n<br>\r\nPiper's vision started to return to her as she shoved her way out of the circle of Mary's entourage. \"You B*TCH!!\" Mary yelled at Piper as she ran. \"You've got some nerve to use my own weapon against me!!\". Piper heard some of the girls behind her try to aim and fire their guns, but their triggers clicked blankly, not firing anything. Piper didn't wait around to see what happened, as she and Gwen dashed out of the garden, and ducked past several small academic buildings. \"What was that?!\" Gwen asked, sounding amazed. \"I-I'm not really sure!\" Piper said. \"It was like some sort of EMP... it stunned all their weapons for a minute... It was a hidden feature on my gun.\"<br>\r\n<br>\r\nThe two of them continued running, trying to reach the dormitories. Gwen gave a look of surprise, \"Wait a second... isn't that the gun I gave to you earlier? Didn't Mary have that one at some point?\" Gwen asked. \"Yeah, it was slightly different from the other Tier-1 guns... Maybe Mary stole this from a research center, making it an experimental version or something?\"<br>\r\n<br>\r\nThey reached their dormitory, and dashed back into their room, 211, tightly locking the door. \"Garnet told me to keep this version earlier... It was almost like she knew this was going to happen!\" Piper exclaimed. Gwen smiled. \"Hey, I guess that means at least some of the teachers are looking out for us then...\"<br>\r\n<br>\r\n\". . .\"<br>\r\n<br>\r\nAn awkward silence fell between the two of them; Mary had painted a dark picture earlier, but a lot of her words rang true. \"So, uh...\" Gwen said. \"This school's... just one giant experiment then?\"<br>\r\n<br>\r\nPiper looked down at her feet, avoiding eye contact. \"Mary could of been just playing with us... but yeah. More than likely, she was telling the truth.\"<br>\r\n<br>\r\nGwen laid down on her bed. \"Wow, uh... This is deep. A lot deeper than what I signed up for...\" Gwen said, exhaling deeply. \"So the teachers and faculty are just... testing us then? Trying to see what we're capable of?\" she asked, sitting up and looking at Piper. \"Does this mean... They expect us all to be preds, a-and eat each other?\"<br>\r\n<br>\r\nPiper looked over at her. \"I... I'm not really sure. Mary said that Megan Macro wants to create a 'Vore Utopia'... whatever that means...\". Piper looked at Gwen, who had tears in her eyes.<br>\r\n<br>\r\n\"I-I... um...\" Gwen said, looking down at her own hands. \"I-I don't belong here, then... What am I even doing? I like vore, b-but not like this... I-I can't go around eating girls!\" she said, shaking a little. \"Is... I-Is this what the school expects us to become? It wants us to become like Mary and her gang? A-Am I going to become like that?\". Piper walked over to Gwen's bed, and sat down next to her. Piper smiled. \"Of course not Gwen... Because you're a good person, like me. :) \" Piper smiled, holding Gwens hand. \"Sure, there may be people like Mary and her kind here... But there are also a lot of good girls here too, like you and me. Even that Ryuko and Mako earlier seemed pretty nice. If you ask me, it seems like Mary's the exception, not us.\"<br>\r\n<br>\r\nGwen sniffed, and smiled at Piper. \"...Thanks. :) \" she said, wiping some of her tears from her eyes. \"I... I guess your right. Maybe there's a reason why Megan Macro invited people like us here too... Maybe she wants to see what choices we make here as well.\"<br>\r\n<br>\r\nGwen looked down again. \"But Mary... She was really something else... She said she wanted to take over the school, and launch some sort of conquest...!\" Gwen said. \"I-I mean... that wouldn't be possible, right?\" Gwen asked Piper.<br>\r\n<br>\r\nPiper shook her head. \"I don't know... Mary sounded like she's after something in particular. Something in the research department... like a weapon.\" Piper said. She turned to Gwen, and looked her in the eye. \"We... We can't let Mary succeed, I have a really bad feeling about whatever she's looking for. She's going to probably keep growing her Order, and getting stronger and stronger Rayguns, until... she finds whatever that 'thing' is. I... I feel like I need to stop her somehow.\"<br>\r\n<br>\r\nGwen smiled, and hugged Piper. \"Then I'm with you too. All the way.\" she said. \"Let's figure this out together, Piper.\"<br>\r\n<br>\r\n\"Right. :) \" Piper smiled. The two of them stood up. \"First, we should figure out some sort of plan... We don't know much about what Mary's up to yet, and we need to figure out some way to stay safe from her army.\" Piper said, sighing. \"I wish we had some more help...\"<br>\r\n<br>\r\nSuddenly, Piper heard a knock on their door, which caused them both to jump. Gwen cautiously walked over, and looked through the peep hole on the door. \"Whoa, it's you?!\" Gwen said, before opening the door. \"Huh?\" Piper said, looking towards the doorway.<br>\r\n<br>\r\nIn stepped Ryuko and Mako. \"Hey there. ;) \" Ryuko grinned, as Gwen closed the door behind them. \"Ryuko!\" Piper said, surprised. \"H-How did you know where we lived?\". Ryuko shrugged. \"Garnet told us that you'd need help with something big later... and that we could find you at 211.\" the black-haired tomboy said. Ryuko grinned, wiping her red bang to the side. \"I'm always down for some action myself. And Mako here is... down for pretty much anything.\"<br>\r\n<br>\r\nMako walked over to Piper, and pointed her finger in Piper's face. \"Are you 'gonna make Ryuko save the world again? Because you better!! She's always cranky when she's not saving the world, and when she's cranky, she doesn't get enough sleep, and when she doesn't get enough sleep, she snores, and when she snores, she...\"<br>\r\n<br>\r\nRyuko's cheeks turned red. \"H-Hey! I don't snore!\"<br>\r\n<br>\r\nPiper couldn't help but giggle; It seemed that their plan to save the college was off to a very interesting start.</span></div></div>",
            "created":1583290560,
            "id":2796336,
            "title":"A Much Needed Talk (Pacifist Mainline)"
        },
        "1111111111111112":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "\"Do WHAT?!?\"",
                "\"Okay.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Okay... I'll join you.\" Piper said. Gwen looked at her with disbelief. \"Piper!!!\" Gwen yelled.<br>\r\n<br>\r\nMary walked up to Piper, starring at her face-to-face. \"Prove it.\"<br>\r\n<br>\r\nMary whipped out her silver Tier-2 Raygun in a swift motion, aimed it point-blank at Gwen, and shot her in the forehead. Gwen was knocked back onto the ground, and shrank to an inch tall. (Her shield was damaged earlier)<br>\r\n<br>\r\nPiper blinked, as Mary starred her down. \"Eat your friend, then.\" Mary said, grinning.</span></div></div>",
            "created":1583211600,
            "id":2796172,
            "title":"Join Mary"
        },
        "11111111111111121":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "content":"<div class=\"\"><div> <span>\"Do WHAT?!?\" Piper said, in clear surprise and shock.<br>\r\n<br>\r\nMary frowned. \"Wrong answer.\"<br>\r\n<br>\r\nPiper found herself starring down the barrel of Mary's Tier 2, and felt a jolt coarse through her forehead, as her entire body numbed for a moment. Quicker then she could react, Piper felt herself rising extremely quickly; She was in Mary's hand, and Gwen was next to her too.<br>\r\n<br>\r\n\"Watch carefully, girls;\" Mary said. \"This is how you take out the trash.\"<br>\r\n<br>\r\nMary shoved both of them into her mouth. \"Wait, NO!\" Piper tried to yell, as she was shoved onto Mary's tongue. She quickly felt a strong muscle contraction shove her around, and she lost her sense of direction, blacking out; A few seconds later, she realized she had been sliding down Mary's throat, and landed in a pool of stomach acid; She was inside Mary's stomach.<br>\r\n<br>\r\nPiper tried to stand up, but the acids made her feel extremely woozy; Something about Mary's stomach acids made them extremely potent, much more so that Abby or Ryuko's stomachs were earlier. Had Mary done something to make her stomach like this?<br>\r\n<br>\r\nPiper felt like she was going to pass out any second. \"G-Gwen!!! We need to-\". Piper felt her eyes close, and everything went black. <br>\r\n<br>\r\n. . .<br>\r\n<br>\r\n. . .<br>\r\n<br>\r\n<b>Piper... you died. You were churned away inside of Mary's stomach, reduced to a mere item in the black-haired girl's diet.</b></span></div></div>",
            "created":1583211600,
            "id":2796184,
            "title":"\"Do WHAT?!?\""
        },
        "11111111111111122":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Mary sends the others away to talk to Piper privately",
                "Mary has a task for her new order"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay\" Piper bent down and scooped Gwen up off the ground.<br>\r\n\"Piper what are you doing?\" Gwen frantically screamed. Piper didn't answer her miniaturized roommate, she just opened her mouth and began moving Gwen towards her mouth. Mary smirked and leaned in to watch while her gang shared their own cruel smiles with each other. Piper was struggling with herself in her head, she'd much rather be part of the team taking over the school than be eaten by them, but it also meant eating Gwen... It had been really easy to agree at first but now that she was actually holding the struggling and shrunken student and about to actually do it... She'd only known Gwen for a day, she didn't owe her anything, even if Gwen had saved her from being eaten earlier. But then the little blond hit Piper's tongue and all her doubts melted away, Piper eagerly quickly sucked Gwen through her lips and furiously licked her up and down. If she'd known that her roommate tasted this good then Piper would've eaten her as soon as she'd gotten the chance! Piper tossed Gwen around with her tongue and sucked every last bit of flavor out of her, before Piper tilted her head back and swallowed. This was Piper's first time actually getting to swallow someone and feeling Gwen struggle down her throat and into her stomach was just as amazing if not better than tasting the shrunken girl.  Piper wished she'd won her duel with Ryuko, although if she had then she might not have been willing to let the girl out afterwards. Piper shook herself out of the euphoria of focusing on Gwen's struggles inside her and looked back up at Mary, her boss now...</span></div></div>",
            "created":1583295960,
            "id":2796381,
            "title":"\"Okay.\""
        },
        "111111111111111222":{
            "author_id":"birichino",
            "author_name":"Birichino",
            "choices":[
                "Get Gwen out of her stomach",
                "Complete the mission (for Mary or herself)"
            ],
            "content":"<div class=\"\"><div> <span>\"Welcome to the team,\" Mary said approvingly, a smirk on her lips, \"and just in time for the next order of business. If we're going to really change things around here, I'm going to need a Tier-3 gun. Get one. One teacher has to be the weakest link, or perhaps you can work together on some plan, I don't care how. Whoever gets me a Tier-3 shall have first pick of prey, and my old Tier-2, as my right hand.\"<br>\r\n<br>\r\nThe other girls' eyes lit up with motivation, and they dispersed. Some were whispering to one another; others strode off alone. Piper felt herself salivate at the thought of eating more, and the idea of doing it right in front of the others -as their superior- made the thought even sweeter. Her hungry eyes met Mary's for a moment, and another thought crossed her mind: Why settle for second place? Her shield was depleted, so even alone, Mary stood so far above her, but with a Tier-3 gun in her hands, Piper could do anything. She could eat anyone. And making a snack out of Mary would likely put her entire crew in new hands...<br>\r\n<br>\r\nWith a coy smile at her new boss, Piper set off to...</span></div></div>",
            "created":1586416800,
            "id":2815982,
            "title":"Mary has a task for her new order"
        },
        "1111111111112":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Just Swallow Ryuko",
                "Tuck little Ryuko away and see if she could sneak the shrunken girl out"
            ],
            "content":"<div class=\"\"><div> <span>As the beam flashed from Ryuko's ray gun Piper jerked her head to the side, Piper heard the beam from Ryuko's gun fizzle out as it hit the ground where head at been a moment before, in the split second she had before Ryuko could fire again Piper squeezed the trigger of her own gun. The beam that shot from Piper's ray gun hit Ryuko square in her midsection and Piper watched as the girl who'd been standing over her shrunk down to just an inch tall. Piper smiled to herself as it hit her that she'd just won her first shrink ray shoot out, she sat up and scooped the shrunken Ryuko off the floor. \"Whew, that was a close one\" Piper said to Ryuko as she stood up.<br>\r\n\"Yeah... are you going to swallow me now?\" Ryuko asked as she looked up at Piper.<br>\r\n\"I mean if I didn't then I would've just been punched in the face for nothing\" Piper rubbed her sore cheek where she could still feel the sting where Ryuko had decked her.<br>\r\n\"Sorry about that, I just got a bit overexcited\"<br>\r\n\"Yeah, well from what I hear it'll worth it\" Piper raised Ryuko up to her mouth, but then she paused as a thought occurred to her. Garnet had said that they'd need to let out their partner after swallowing her, but... Piper wondered if she could walk out with little Ryuko if she didn't swallow her. Ryuko seemed nice and that would be a mean thing to do... but Piper kinda wanted to find out if she could do it. After pondering for a second Piper decided to...</span></div></div>",
            "created":1587451920,
            "id":2821983,
            "title":"Victory"
        },
        "1111112":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Give in and have some fun.",
                "Fight Abby more!"
            ],
            "content":"<div class=\"\"><div> <span>Piper tried banging on the sides of Abby's stomach a few more times; However, it had no effect except to tickle the black-haired girl with green highlights. Abby was slightly chubby too; Piper sighed, realizing that Abby's weight probably made her own attacks less effective. No matter how hard she tried to upset Abby's stomach from the inside, nothing worked.<br>\r\n<br>\r\nAbby giggled, rubbing her belly. \"Wow, I can feel her in there... It's kind of like I swallowed a small rock, except she's moving around!\" Abby said, lifting up her shirt a little bit. Audrey took her hand. \"Hey, we should probably get a move on, before her friend comes back.\" she said, as the two of them walked back to their own booth, cleaning up their plates. \"One sec-\" Abby said, grabbing one last cake and eating it. Blobs of icing and mushed-up cake fell on top of Piper. \"GROSS!\" the white haired girl yelled from inside of Abby's stomach. Audrey giggled as the two of them walked out of the dining center. \"You really should take it slower Abby, you're just going to add more pudge to your waisteline...\". Abby leaned over and kissed her tall blond girlfriend. \"Aww, don't give me that, you like me this way; I'm all the better for cuddling with a tummy like this~!\" . They both laughed, which shook Paige around inside.<br>\r\n<br>\r\nPiper tried to yell some more, but she kept getting knocked around by the cakes; The acid and heat was really getting to her, and she kept blacking out for a few split seconds at a time. She tried one more time to reach up, but then her arm dropped, as our protagonist fell unconscious.<br>\r\n<br>\r\n. . .<br>\r\n<br>\r\nLater, Piper... woke up. She was having trouble telling what was going on. The last thing she remembered was... Right, that jerk Abby ate her! Then...<br>\r\n<br>\r\nPiper blinked; She remembered that she blacked out inside of Abby's tummy. ...Where was she now? She tried looking around; Everything around her was... soft and squishy. \"Heyyy, you're finally awake~!\" she heard Abby's voice from above. \"You're a part of my tummy now!\". Piper looked around in shock; Sure enough, Abby was right; Piper was literally skin on Abby's belly now. She tried struggling and moving around, but that only caused Abby to giggle. \"Hehe~! That feels amazing!!\" Abby laughed. She moved her hand down, and lifted up her shirt, playfully poking the spot where Piper was. Then, Abby began to tickle her. \"H-Hey! S- hahaha... S-Stop! Hahhaha...\" Piper laughed uncontrollably. \"I'm not some toy for you to play with!!\" Piper grumbled up at Abby. \"Aww, don't be like that!\" Abby said, rubbing her tummy around.<br>\r\n<br>\r\nPiper tried to look around; She realized they were in the school library, in a secluded section. Abby was reading a romance novel. \"H-Hey, you've got to fix this!\" Piper demanded. \"I can't be stuck on your stomach like this!\". Abby rubbed her tummy lovingly, which caused her chub to wiggle around. \"Aww, but I don't want to lose my new friend! You're a part of me now!\" Abby smiled, sticking her finger into her belly button. Abby wasn't taking her seriously at all, and Piper was getting angry. \"Hey! I'm not your friend, you and that blond b*tch kidnapped me!!\" Piper yelled. Abby slapped the spot where Piper was. \"Hey! That's no way to talk about Audrey, she's my girlfriend!\" Abby said, sounding defensive.<br>\r\n<br>\r\nAbby leaned back in her chair. \"I don't have a class until later, but Audrey's in a class block for an hour... So we can take this time to play~!\" she said, giggling again. She brushed some of her black hair out of her eyes. \"So, what do you wanna do, Piper? : 3 \" she said in a lighthearted way.</span></div></div>",
            "created":1582779600,
            "id":2793981,
            "title":"Part Of A Tummy"
        },
        "11112":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Gwen, that's a relief ",
                "A stranger"
            ],
            "content":"<div class=\"\"><div> <span>The instant that Piper realized what was going on she leapt to her feet and took off running. \"Hey, where do you think you're going?\" Piper heard the same person as before shouting but Piper didn't bother to look back, she reached the edge of the seat and took a flying leap off of it. As Piper leapt she felt the whoosh of air as a hand swept down to grab her but barely missed. Piper hit the ground and avoided the worst of the impact due to her tiny size, she just kept running across the dining hall floor. As Piper raced across the floor she knew that a normal sized person would easily overtake her so she ran under as many tables and between as many legs as she could in the hopes that it would slow down whoever it was that had shrunk her. At Piper's new size the dining hall was incredibly massive, Piper would need to stop to rest before she could reach the exit or anything really. After running for as long as she could Piper stopped to catch her breath, she had stopped under a table with no one sitting at it to hopefully give her a little extra time in case someone made a grab for her. Just as Piper felt like she had caught her breath she felt a giant hand wrap around her from behind. Piper thrashed frantically but at her diminutive size she couldn't get away from her colossal captress, the aforementioned giantess had crouched to reach under the table and grab Piper but Piper couldn't see her face because the table was in the way. As Piper was pulled out from under the table she could see that she'd been grabbed by...</span></div></div>",
            "created":1582693200,
            "id":2793550,
            "title":"Flee like crazy! Get the HECK out of there!"
        },
        "111121":{
            "author_id":"jerectamalic",
            "author_name":"Jerec",
            "choices":[
                "Her stomach, you can eat some of her breakfast, even in class!",
                "Somewhere else."
            ],
            "content":"<div class=\"\"><div> <span>\"Gwen, thank goodness! I was worried someone was going to eat me!\" Piper explains to her gargantuan roommate. She looks around from her vantage point on Gwen's hand, the cheerful girl beaming at her. It frightens Piper a bit, seeing teeth as big as she is.<br>\r\n<br>\r\nGwen giggles a bit, walking back to the spot they were going to sit at. \"Well, I guess it'll be a bit different for breakfast. You're so tiny, a crumb could fill you up!\" She coos, clearly finding Piper's new state adorable. \"Hmm. I can't leave you here though, someone else might take you.\" She looks down at the shrunken girl on her palm. \"Where to put you?\" She asks rhetorically.</span></div></div>",
            "created":1582866000,
            "id":2794525,
            "title":"Gwen, that's a relief "
        },
        "1111212":{
            "author_id":"jerectamalic",
            "author_name":"Jerec",
            "choices":[
                "Sex organs, vagina or breasts.",
                "Waste organs, rectum or bladder."
            ],
            "content":"<div class=\"\"><div> <span>Gwen continues to look Piper over, getting up and walking to the bathroom. She picks a stall and locks the door, giggling as she thinks about her options. \"You know, you're so small I could probably put you in a lot of places.\" She says with a blush. \"You know, I always thought I would be the prey, but this is actually a kinda nice turn of events. Don't worry, I'll keep you nice and safe in my...\"</span></div></div>",
            "created":1582866000,
            "id":2794584,
            "title":"Somewhere else."
        },
        "11112121":{
            "author_id":"jerectamalic",
            "author_name":"Jerec",
            "choices":[
                "\"You'll be safe in my cooch!\"",
                "\"Hope you like milk.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Vagina or breasts?</span></div></span></div>",
            "created":1582866000,
            "id":2794585,
            "title":"Sex organs, vagina or breasts."
        },
        "111121211":{
            "author_id":"jerectamalic",
            "author_name":"Jerec",
            "choices":[
                "In the Classwomb.",
                "Skip to the end of the day back in the dormitories."
            ],
            "content":"<div class=\"\"><div> <span>Gwen says as she pulls up her skirt and pulls open her panties. She uses two fingers to spread herself and she coos. \"Oh yeah, she's ready for you.\" She lowers Piper down to the gaping, fleshy, wet hole leading deep into her roommate. \"Alright, make mommy happy.\" Piper is placed inside, and slips further in as Gwen angles herself. <br>\r\n<br>\r\nPiper gulps a little nervously, looking out into the bathroom framed by the tube of Gwen's vagina and her two fingers holding it open. The vaginal tube flexes from the stimulation and she can hear Gwen moaning. \"Deeper!\" She calls out tilting further and causing Piper to slide inside even deeper. She tries to grab and hold onto the fleshy walls, watching fearfully as the bright light at the entrance of the tunnel.<br>\r\n<br>\r\n\"Ah! Gwen stop!\" Piper yells as she slides deeper. Gwen doesn't hear, either through the schools telepathy field or from Piper herself, focused solely on the feeling of Piper going deeper. She slips her fingers out and and begins to stroke herself. Piper can only watch in horror as the light dims and the walls start to squeeze closer together. She's pulled deeper and deeper as the walls grip her. Luckily she's too small for the walls to crush her, but their grip on her is still real. Eventually she gets pulled through an even tighter ring and drops into a larger chamber. Instantly Piper knows where she is. \"This isn't good.\" She says, her words echoing through her roommate's womb.<br>\r\n<br>\r\nGwen gets up, straightening herself out, washing her hands and heading back into the dining hall for breakfast. \"Guess you're now my wombmate.\" Gwen giggles, patting her belly, feeling Piper tickle the inside of her womb as she moves around deep inside her. She grabs a nice large breakfast and heads off to class, not sure she'll let Piper back out.</span></div></div>",
            "created":1583211600,
            "id":2795903,
            "title":"\"You'll be safe in my cooch!\""
        },
        "1111212112":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Piper put it away and went to sleep, hopefully tommorow would be better",
                "Piper eyed her roommate, Gwen had enjoyed shrunken Piper, turnabout is fair play"
            ],
            "content":"<div class=\"\"><div> <span>And so began the rest of Piper's day, it was actually pretty boring just sitting inside of Gwen. Piper could feel the sway as Gwen walked and similar lurches whenever Gwen sat down or stood up but really couldn't tell what was happening in the outside world. Piper drifted off to sleep, she woke up at some point but really just spent the rest of the day drifting in and out of consciousness. Although at one point Piper was jolted from her slumber by a contraction of the room around her, and then another, and another. Slowly Piper was squeezed back out of Gwen. Piper slid out of Gwen's hand and into the giant, waiting hand of her roommate. Looking around Piper saw that she was in her and Gwen's room, based on the lack of sunlight coming through the window the day was long since over, and then Piper realized that not only had she slid into Gwen's hand, but that Gwen was also naked below the waste and lying on her own bed. Gwen lifted Piper up to her face \"So\" Gwen began \"I hope you had a good day in there, I have to say I was hoping you'd wiggle a bit more.\" Gwen gave Piper a small pout.<br>\r\n\"It was mostly boring, but still thanks for protecting me. I do wish you'd let me out sooner so that I wouldn't have to miss class and everything.\" Piper said, it was hard to focus while this close to her roommate's massive face, feeling Gwen's hot breath wash over her.<br>\r\n\"Sorry about that\" Gwen said a bit sheepishly \"I thought about trying to duck into a corner and let you out once they'd passed out the ray guns but I didn't have a great time. Still, when they passed out the ray guns I grabbed an extra one for you, plus we have most of the same classes so I'll just let you use my notes, here let me just get you back to your normal size.\" Gwen rolled out of bed and set Piper down on the floor, she then grabbed a ray gun out of her backpack and pointed it at Piper. As the blue beam from the gun washed over Piper she felt herself shoot back up to her normal height. \"There we go, I left yours on your bed\" Gwen pointed at Piper's bed where an identical ray gun was lying on the pillow. \"I'm actually kinda exhausted, talk to you tomorrow.\" Gwen rolled over and closed her eyes, Piper started getting ready for bed. Piper was sad that she missed pretty much her entire first day. Then as Piper had gotten changed and ready for bed she picked up her ray gun...</span></div></div>",
            "created":1583392740,
            "id":2796876,
            "title":"Skip to the end of the day back in the dormitor..."
        },
        "11112121122":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Gwen's curious, the two of them fool around",
                "Gwen is not in the mood, but with the current size difference Piper can choose"
            ],
            "content":"<div class=\"\"><div> <span>A mischievous smile spread across Piper's face as she pointed her new ray gun at her roommate and pulled the trigger, there was a satisfying zap and bolt of blue light that sprung from the tip of the gun and into Gwen's back. Piper watched in delight as her roommate dwindled before her, down to a height of only one inch. Gwen was fully awake now and was struggling in her bedding, Piper giggled as she reached down and scooped up her now tiny roommate. \"Hey\" Gwen shouted up at her \"You could've at least warned me first.\"<br>\r\nPiper couldn't stop the smile spreading across her face \"Sorry Gwen, I just had to know what it would be like.\" Piper  just couldn't get over how cute Gwen was at this size, especially when she put her hands on her hips and scowled up at her like Gwen was doing right now. \"C'mon Gwen, aren't you curious what it's like to be the smaller one?\"</span></div></div>",
            "created":1584360120,
            "id":2802274,
            "title":"Piper eyed her roommate, Gwen had enjoyed shrun..."
        },
        "111121212":{
            "author_id":"jerectamalic",
            "author_name":"Jerec",
            "choices":[
                "Life in a boob. It's bouncy, wet, warm, and tastes of milk.",
                "Breast exploration. How far can you go into the maze of milk."
            ],
            "content":"<div class=\"\"><div> <span>Gwen giggles a bit, looking at Piper in her hand. \"You know, you're so small, I wonder if...\" She starts as she lifts her shirt and pulls open one of the cups of her bra, revealing her large breast and nipple. With that hand she strokes it, slowly bringing the nipple to life as it erects to her touch. \"If you can fit in there, then you'd be safe and you wouldn't go hungry!\" She says happily. <br>\r\n<br>\r\nGwen brings the hand holding Piper up to her breast and cups it under her nipple, giving Piper an up close view of the now massive mammary. \"Go on, try to get in.\" She giggles, looking down at her tiny roommate. \"Who knows, you might like it enough to want to stay.\" She says, somewhat joking, sticking her tongue out a bit.<br>\r\n<br>\r\nBeing hard to argue with a person now many times your size, Piper shrugs and walks up to the nipple that dwarfs her in size. She finds a small entrance in the middle of the top and starts to push her way inside. \"Holy crap!\" Gwen exclaims with a gasp, causing Piper to pause in alarm. \"No, don't stop! Deeper!\" Her giant roommate commands in a sensual, almost pleading voice. \"You have no idea how... Oh!\" Gwen adds, moaning in pleasure as Piper pushes her arms deeper into the nipple. Looking around, Piper sees that Gwen's now free hand has departed the breast to attend to another portion in need of attention, as she can tell from Gwen's gasping moans and the rhythmic motions of her arm.<br>\r\n<br>\r\nGwen leans back in pleasure, accidentally helping Piper to progress deeper with gravity. Her world dims to just the light managing to shine through the skin of Gwen's nipple. She's in a thin narrow tube, slowly sliding deeper. She kicks and squirms trying to get in deeper, but progress is slow. She feels something press against her feet and push her in. Clearly Gwen wasn't liking how slow she was going and decided to help. The tube gets bigger and in the soft reddish, fleshy glow Piper finds herself in the hub of a vast series of tubes branching off deeper and deeper into the massive fleshy globe of a mammary gland she just entered.<br>\r\n<br>\r\n\"Oh! I can feel you in there! It's, mMMmm, so strange, and HmmMMMmm, sooo, Ooooh! So stimulating.\" Gwen's muffled voice sounds out with sensual moans and groans. Piper gets up and approaches one of the tubes, diving down it like a massive, living water slide. \"Ahh!\" Gwen cries as Piper slides deep down into the underboob, a pleasing tickle that spikes pleasure throughout her body, climaxing when Piper cones to a stop. <br>\r\n<br>\r\nThe girl in question looks around in this environment, a small roomsized fleshy orb with a puddle of off white fluid forming at the bottom, and more slowly seeping out of the walls. Remembering her anatomy courses, she realizes she's inside one of Gwen's many milk ducts. She finds herself partially glad that Gwen isn't a nursing mother and partially jealous after hearing just how turned on and quickly Gwen had a massive orgasm. \"Just so you know Gwen, when I get my shrink ray, it'll be my turn.\" Piper says out loud.<br>\r\n<br>\r\n\"I wouldn't have it any other way. You need to feel that.\" Gwen replies breathlessly, surprising Piper that her roommate can hear her. \"Alright, enjoy your stay. It's time to go to class.\" She adds, getting up and straightening herself out.</span></div></div>",
            "created":1583536920,
            "id":2797585,
            "title":"\"Hope you like milk.\""
        },
        "11112122":{
            "author_id":"jerectamalic",
            "author_name":"Jerec",
            "choices":[
                "\"It should be clean back there, I just went a little while ago.\"",
                "\"I hope you like swimming.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>In her rear or in the pee hole.</span></div></span></div>",
            "created":1582866000,
            "id":2794591,
            "title":"Waste organs, rectum or bladder."
        },
        "111121222":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Continue to Gwen's Bladder!"
            ],
            "content":"<div class=\"\"><div> <span>Gwen grinned. \"Hey, I have a cool idea...!\" she said, whispering her plan to Piper (It was actually quite scary, since her mouth was so close to Piper). But after Piper heard the details, she grinned excitedly. \"Go for it!\" she laughed. \"I... Uh, well, I actually wanted to try that at some point at this school!\"<br>\r\n<br>\r\nGwen smiled, brushing some of her pink highlights to the side. \"Okay, here goes!\" she said. She pulled her pants down, as well as her undies. She held Piper down below; Piper got a good look at her crotch; It looked like Grew had shaved recently, which made her cute lips very easy to see; From the outside Piper mostly saw the folds of skin, and the thin line that marked the entrance to Gwen's womb. Gwen put her other hand down below, and with two fingers she spread her lips, revealing her labia minora. \"So... what do you think? : 3 \" Gwen asked, moving Piper closer. Piper giggled. \"It's by far the best labia I've been inside, haha!\". They both laughed.<br>\r\n<br>\r\nPiper saw a small hole above Gwen's Vagina; Her urethra. Gwen gently pushed Piper's head up to it; Piper used her hands to spread the small ring open, wiggling inside the tight passageway, up towards Gwen's bladder.</span></div></div>",
            "created":1582952400,
            "id":2794753,
            "title":"A Friend's Urethera"
        },
        "111122":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "\"Just swallow you, afterall it's why we all chose to came here.\"",
                "\"Save you for later, let me just tuck you away for now.\""
            ],
            "content":"<div class=\"\"><div> <span>Piper looked up at who had pulled her out from her spot under the table, they looked to be about the same age as Piper but she'd never seen them before. The girl who'd grabbed her was a good six inches taller than Piper had been before she'd been shrunk and had red hair that was just a bit longer than shoulder length. As the giant girl looked down at Piper she said \"Ooh, white hair, I haven't seen that done so well before, how'd you get it like that?\"<br>\r\nAfter a second of futile struggling Piper actually stopped and decided to answer. \"I didn't do anything, it's natural.\"<br>\r\n\"Oh cool. Y'know, you're my first tiny, I haven't had a chance to grab one of those shrink rays yet so I got real lucky spotting you just wandering around on the floor.\" As she spoke the giant redhead moved Piper around in her grip to inspect her miniaturized body. \"What's your name?\"<br>\r\n\"I'm Piper, does this mean you're letting me go?\" Piper was hopeful, if this person cared to learn her name then she probably wasn't planning to eat her.<br>\r\n\"Well Piper, I'm Claire, and there's no way I'm going to let you go when I got lucky enough to catch you.\" Suddenly Claire raised Piper up to her mouth and licked her tongue across Piper's tiny body. Claire smiled at Piper's taste while Piper was sputtering and trying to wipe Claire's saliva off of her. \"You taste pretty good... But also I did just finish breakfast and I need to get to shrinking 101. Eh, I'll...\"</span></div></div>",
            "created":1582779600,
            "id":2793615,
            "title":"A stranger"
        },
        "1111221":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "moan in distress and clutch at her stomach",
                "giggle and pat her stomach"
            ],
            "content":"<div class=\"\"><div> <span>Piper opened her mouth to protest but was immedietly silenced as her head as thrust between Claire's lips, Claire's tongue immedietly rose and began licking all over  Piper's face causing her to sputter as she was coated in saliva. Claire slowly slurped the rest of Piper's body between her lips and into her mouth. Once Piper was fully inside Claire's mouth she tried to stand up, to struggle, to do anything really, but Claire's massive tongue effortlessly pushed Piper around as if she was any other piece of food. As Claire shifted Piper around in her mouth Piper heard the redhead moan in pleasure at Piper's taste, Claire was really enjoying her first tiny meal. Suddenly Piper felt herself drawn to the back of Claire's mouth and down into the giantess's esophagus. Piper was steadily kneaded downwards by the muscles of Claire's throat, it might have been pleasant if it wasn't for the fact that she was being eaten alive. Time stopped for Piper, by the time she plopped into Claire's stomach it might've been anywhere between seconds and hours as far as she was concerned. But now she'd been dumped into Claire's stomach. Piper had been expecting the stomach to be more spacious than Claire's throat had been, but like Claire said she'd just had lunch. It seemed Claire was a meat lover, Piper found herself squashed against the ceiling of a stomach she barely fit into, pressed against a mound of bacon, breakfast sausage, and other foodstuffs Piper couldn't identify. At first Piper was disheartened by the lack of space, but then she realized, if Claire was so full then maybe she'd vomit if Piper struggled enough. Piper hoped that at the very least the shear amount of food jammed in here with her would buy her a bit more time before Claire's stomach got to work on her. Well, Piper had heard that struggling prey was generally the best part for the predator but she might as well see if her struggles would get her anywhere. Piper punched and kicked, even scratched and bit at Claire's stomach walls in the hope of upsetting her. As Piper flew into a frenzy trying to escape she heard Claire...</span></div></div>",
            "created":1582866000,
            "id":2794179,
            "title":"\"Just swallow you, afterall it's why we..."
        },
        "11112211":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Piper edged away from Claire and took off running",
                "Claire's giant hand shot out and snatched Piper before she could make a getaway"
            ],
            "content":"<div class=\"\"><div> <span>\"Oof, okay, maybe eating her wasn't the best idea I've ever had.\" Piper felt hope wash over her as she heard Claire's distress, she was almost there, she just needed to keep giving Claire the biggest stomach ach possible. Piper attacked the walls of Claire's stomach with renewed vigor and was rewarded by hearing Claire groan again. Suddenly there was a massive slapping noise and the contents of Claire's stomach shook all around Piper as she heard the voice of her swallower \"Hey! Settle down in there... oh that was a bad idea...\" Piper had no intention of slowing or stopping and kept up her savage attack on Claire's stomach. Suddenly Piper felt herself and everything else in the stomach squeezed by a sudden contraction \"Oooooh... why\" Piper would feel kinda bad for causing Claire so much misery, if it wasn't for the fact that Claire had swallowed her. Another contraction, and another, and then Piper felt herself along with the other contents of Claire's stomach begin to move upwards, although that direction quickly became sideways as Claire doubled over. Piper felt herself move again along with Claire's breakfast and then she was out of the giantess! And then Claire hit the ground, her impact cushioned by landing on some unidentifiable piece of food that had also been violently expelled from Claire's body. Looking around she saw that she was directly in front of Claire's massive face, but Claire was paying her no attention. Claire had fallen to her hands and knees and was panting heavily just outside of the dining hall doors. A small crowd of onlookers had gathered while Claire had been vomiting. Piper could see the giantess was recovering, and even if Claire wouldn't feel like eating her anymore Piper wasn't so sure someone else in the crowd wouldn't grab her.</span></div></div>",
            "created":1583125200,
            "id":2795499,
            "title":"moan in distress and clutch at her stomach"
        },
        "1111222":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Piper starts struggling to escape Claire's cleavage",
                "Before the class starts Piper hears a familiar voice"
            ],
            "content":"<div class=\"\"><div> <span>\"I save you for later, let me just tuck you away in here until I'm feeling hungry\" As she spoke Claire pulled open the neckline of her green t-shirt, moved her hand holding Piper over her now exposed cleavage, and released our shrunken protagonist letting her tumble through the air and into the space between her breasts. Piper began trying to scramble up and out from between the giant pair of breasts she'd suddenly been dumped between but Claire released her neckline to snap shut and Piper found herself in a sort of twilight where just enough light was coming through Claire's shirt that Piper could see the pair of breasts she had tumbled into and gotten wedged between. Piper tried to hold on as she felt the lurch of Claire standing up but she really had nothing to hold onto as she was surrounded by smooth skin and she couldn't even reach out to Claire's bra at her size. Piper then felt as Claire took a step, and then another and another and another, Claire walking to her class violently bounced Piper up and down with every step the giant redhead took. Piper tried to struggle but she had been thoroughly reduced to impotence, maybe she would've been able to slowly make progress out of Claire's cleavage if her captress had been standing still but as things were Piper could barely think through the bouncing much less attempt an escape. Piper sat as still as she could and tried to keep from vomiting, she was able to notice that Claire left the dining hall and went into another building but Piper was in no condition to tell what building she was in now. Eventually the incessant bouncing stopped, Claire had sat down, Piper could hear the voices of other excited students. It seems Claire had reached her first class, intro to shrinking, Piper thought to herself about how if it hadn't been for bad luck then she'd be sitting in her intro to shrinking class right now. Well, Claire would hopefully be busy listening to the teacher of her first class instead of paying attention to Piper so now would probably be the best chance Piper would get to escape.</span></div></div>",
            "created":1582866000,
            "id":2794121,
            "title":"\"Save you for later, let me just tuck you a..."
        },
        "11112222":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "\"Come on Claire, we don't keep friends in our cleavage, unless they want it\"",
                "\"Alright, you can keep her for now. But try not to lose her or anything\""
            ],
            "content":"<div class=\"\"><div> <span>\"Oh hey Claire? I haven't seen you in ages!\" Piper froze mid way through her escape attempt, that was Gwen's voice! Piper's mind was racing trying to think of how to get Gwen's attention when suddenly everything went dark as something outside Claire's shirt blocked out the light and Piper suddenly felt Claire's boobs squeezing against her. Piper realized that Claire was hugging another girl and it soon became clear who she was hugging as Piper heard Claire's voice. <br>\r\n\"Hey Gwen, it really has been too long, how've you been? Have you been getting used to the school? Oh have you seen any of the shrink guns yet? I heard one girl got her hands on 2 different ones early.\" Piper felt the pressure ease as the two girls released each other from the hug.<br>\r\n\"I've been doing great\" Gwen responded \"And I've been settling in great, my roommate's pretty nice, although she up and vanished when I was in the bathroom at the dining hall. Ooh, maybe she did get involved with one of those rogue shrink rays and I'll have to go rescue her, that'd be pretty cool.\"<br>\r\n\"Speaking of shrinking rays, I haven't been able to get one but I did find a tiny girl just wandering around the dining hall, I guess she must've gotten away for whoever shrunk her, lucky me. I still have her too\"<br>\r\n\"Yeah?\"<br>\r\n\"Yeah, I figured that since I hadn't got a shrink ray yet I should hold onto her, plus she's got white hair which is pretty cool. She said it's natural, but I hadn't heard that that's a thing.\"<br>\r\n\"Wait, white hair?\" Piper's heart jumped in her chest, if Gwen and Claire were friends then maybe Gwen could get Claire to let her go.<br>\r\n\"Yeah, have you seen many people with white hair?\"<br>\r\n\"No, only one, Claire I think you found my roommate.\"<br>\r\n\"Oh, well that's a twist\" Gwen and Claire broke out laughing at that, Piper didn't get what was so funny. When the laughter died down Gwen spoke up.<br>\r\n\"Hey can I see her? She's pretty cool, you'll like her a lot when you get to know her.\"<br>\r\n\"I mean\" Piper could hear a hint of mischief in Claire's voice \"I already liked her when I gave her a lick\"<br>\r\n\"Oh Claire, you licked my roommate\" Piper heard the two giggle. \"Come one, get to know her, she's nice. Come one, show me where you've got her.\"<br>\r\n\"Alright...\" Piper saw Claire's massive hand grab the neckline of her shirt and pull it open, outside she saw Gwen's massive face lit from behind by the ceiling lights. Not that Piper could actually see outside she saw that Claire and Gwen were sitting in a classroom with a number of other students, Piper couldn't see much from her vantage point she did see something that neither Gwen nor Claire seemed to notice. That several of the other girls in the room had noticed Claire and Gwen, since the other students who'd noticed couldn't see Piper it looked to them like Gwen was just staring into Claire's cleavage. But then Gwen spoke and Piper's attention was drawn back to her now massive roommate.<br>\r\n\"Awww, Piper you look so cute like this! Don't worry we'll fix you once the shrinking rays get passed out, I'm pretty sure the ones first years get can unshrink you\" Piper had never been so happy to see hear anything in her life, but then Claire spoke up.<br>\r\n\"Do we really have to unshrink her? I think I like her at this size, and you said it yourself she's real cute like this.\" Claire bounced her chest a little bit, waving the shrunken Piper in front of Gwen's face.<br>\r\n\"Oh Claire...\" Piper was desperately hoping that she'd formed enough of a bond with Gwen that she'd convince Claire to let her go. While Piper had gotten the feeling that she wasn't really in danger of getting eaten she didn't like the idea of just being... kept, even if she was being kept by a friend of Gwen. Piper held her breath of Gwen finished...</span></div></div>",
            "created":1582866000,
            "id":2794151,
            "title":"Before the class starts Piper hears a familiar ..."
        },
        "111122222":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "What happens next?",
                "Piper pipes up with noise"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gwen relents, having a soft-spot for prey and she was feeling merciful for today.<br>\r\n<br>\r\nClaire nods, \"Alright Gwen, if that is what you wish...\"</span></div></span></div>",
            "created":1582866000,
            "id":2794183,
            "title":"\"Alright, you can keep her for now.\""
        },
        "1111222222":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "yes, they'd fix restore her size and then the three of them could hang out",
                "they could fix Piper, but they both kinda wanted to fool around with her first"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey!\" Piper calls up to the two of them \"you can't just keep me here!\"<br>\r\n\"Don't worry Piper, you and Claire are going to get along great\" Gwen beamed down at Piper \"We'll set you back to normal later.\"<br>\r\n\"Gwen! She was talking about eating me!\" Piper was frantic at the idea that she had lost her chance of rescue.<br>\r\n\"Well she didn't know you yet, Claire you won't eat her now right?\" Gwen looked back up from Claire's cleavage towards Claire's face.<br>\r\n\"Don't worry Piper, I won't eat you\" Claire smiled down at her, Piper was not reassured \"although if you'd want to try it sometime I'd be happy to, you taste really good.\" Piper was even less reassured after that. \"Ooh, class is starting, you behave yourself in there and we can talk more later\" and with that Claire and Gwen turned their attention to the teacher and Piper was left alone with Claire's breasts once again. Piper heard the class start but couldn't really tell what was happening as she couldn't really hear the teacher with any clarity. Honestly Piper was bored, she had to just sit in the semi-darkness of Claire's bust with nothing much to do. While Piper's faith in being saved by Gwen had been shaken she didn't want to try escaping since she didn't want to actually annoy Gwen if she tried escaping and failed, not to mention the fact that even if she escaped and fixed her size Gwen was still her roommate and she'd rather stay friends with her. And so Piper waited... and waited, it felt like forever but eventually the class did end and Claire stood up. Piper felt as Claire started walking, the bouncing made her almost miss the tedium of sitting during the class but at least now something was happening, even if Piper repeatedly needed to stop herself from vomiting. Piper was idly wondering what it would feel like if a tiny person puked in her cleavage when suddenly Claire's massive hand once again pulled back the neckline of her shirt. Looking out Piper could again see the giant faces of Claire and Gwen smiling down at her, it looked like they had found a secluded spot in a small room, Piper couldn't see much else but it didn't seem like anyone else was around. \"Aww I just can't get over how cute you are like this!\" Gwen exclaimed.<br>\r\n\"Well it's less fun like this for me. What happened in class?\" Piper knew that that was the class she should've been in with Gwen anyway so if she was going to learn what happened she needed these two to explain.<br>\r\n\"Well, it was pretty basic, we got an explanation of how the shrink rays work and the tier system they have and some people practiced a bit. Oh, also the teacher passed out the ray guns to each of us.\" Gwen explained.<br>\r\n\"Gwen grabbed an extra one for you, the teacher was fine with it, I think she might've known I had you in here\" Claire added and Gwen waved two of the ray guns in Piper's vision.<br>\r\n\"Okay\" Piper knew she was going to need more details on what Gwen had meant about tiers for the ray guns but that could wait \"So can you unshrink me now?\" Gwen and Claire exchanged a look and then explained to Piper...</span></div></div>",
            "created":1583125200,
            "id":2795505,
            "title":"Piper pipes up with noise"
        },
        "1112":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Enter Mary's room (Pred Mainline)",
                "This is a really bad idea, let's turn back... (Branch off)"
            ],
            "content":"<div class=\"\"><div> <span>Piper looked forward, with a chaotic look in her eyes. She grinned a little; She knew which route she wanted to take, and how she would spend her life at Macro U. She put her left index finger to her right wrist; She felt her pulse rising in excitement, with the thrill of the hunt...! First, she needed to arm herself. And she had a good idea of where to go.<br>\r\n<br>\r\nGwen waved to Piper as she left, and Piper nodded back at her. First, she had decided to ask around for information about the Black-Haired Girl; Right now, it seemed that was her best option to find a weapon. She walked down the 2nd floor hallway, and saw a few small groups of girls casually chatting. A lot of them looked very nervous; Piper guessed half of them wouldn't last the day.<br>\r\n<br>\r\n\"No, don't do it Carrie!\" Piper heard someone yell ahead of her. As she walked closer she saw two girls arguing. The girl who she guessed was named \"Carrie\" was crying. \"N-No! She ate my sister! I-I'm not going to let her get away with this!\" she cried, before running of up the flight of stairs near her room. Piper asked the other girl what was going on. \"Her sister got gulped down by Mary Halberd. From what I heard, Mary snuck off and stole an early model of one of the devices they use at this school... Huh? Black hair? Yeah, Mary has black hair\". That was all Piper needed to know. She referenced her the room listing, and saw that Mary's room was \"666\". That didn't bode well. Piper grinned- It was time to make a name for herself at this school.<br>\r\n<br>\r\n. . .<br>\r\n<br>\r\nShe arrived on the 6th floor of the dorm building, which seemed mostly empty. Carrie was standing in the middle of the hallway, still crying. \"I-I can't...\" she sobbed, looking at room 666. As Piper walked closer, she ignored Carrie, and saw that the door to Mary's room was propped open slightly. This could be her chance...</span></div></div>",
            "created":1582693200,
            "id":2793163,
            "title":"Search for the Black-Haired girl..."
        },
        "11121":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Fire. (Pred Mainline)",
                "I-I can't do this! (Branch off)"
            ],
            "content":"<div class=\"\"><div> <span>Piper entered Mary's room and... It was empty. No one was home. \"Well, that was anticlimactic.\" Piper said. She looked around the room- It looked like only one side of the room was occupied, Mary's side. The other half was... empty. Piper shuddered for a second, having an idea why.<br>\r\n<br>\r\nThe white-haired girl shook her head, and looked around. Mary's half was very neat and organized, but fairly sparse. However, on the desk, Piper spotted... The shrink-device Mary had been using yesterday!<br>\r\n<br>\r\nPiper grinned. This was too easy. (Unfortunately for her, it was).<br>\r\n<br>\r\n. . .<br>\r\n<br>\r\nPiper stepped out of the room, holding the shrink gun. \"I-It's empty? Carrie asked, as she looked at Piper who had just come out. Piper looked down at the gun she was holding; It was a pretty simple design, and only had a simple trigger on it. She figured that she had the general idea of how to use it. She looked over at Carrie, and grinned, licking her lips.<br>\r\n<br>\r\nPiper raised the gun, and pointed it at Carrie. Her finger slid over the trigger, and she rubber her tummy. \"W-What are you doing?!\" Carrie said, looking very alarmed.</span></div></div>",
            "created":1582693200,
            "id":2793168,
            "title":"Enter Mary's room (Pred Mainline)"
        },
        "111211":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Gulp. (Pred Mainline)",
                "I'm done, I just wanted to feel you in my mouth."
            ],
            "content":"<div class=\"\"><div> <span>\"<span class=\"clred\">Bang.</span>\" Piper mouthed, as she pulled the trigger. A jolt of blue electricity shot out of the gun at a high velocity, and hit Carrie in the chest. The impact knocked Carrie over backwards, causing her to fall onto her back on the carpeted floor. However, Carrie's petite brunet figure quickly shrank out of existence, almost as if the girl had not been there just a moment ago. Piper walked over, and picked up the terrified Carrie by the back of her shirt (It seemed the guns shrank clothing as well). The tiny brown-haired girl was about an inch tall, and was visibly shaking.<br>\r\n<br>\r\n\"N-No... P-Please d-don't...\" Carrie sobbed, as Piper brought the tiny girl close to her own face. Piper giggled a little bit, as her eyes flashed with an excited look. She opened her maw wide; It shined in the lights of the dormitory hallway, since she had accumulated a lot of saliva due to her hunger. \"Ahhh~\" Piper hummed playfully, as she positioned Carrie over her mouth, preparing to drop her in. \"NO, GOD NO! PLEASE! I DON'T WANT TO DIE, LET ME GO!\" Carrie screamed. \"Okay.\" Piper said, releasing the grip from her fingers, causing Carrie to fall directly into her mouth. &lt;\"People really should be more careful with their word choice...\"&gt; Piper thought, as she pushed Carrie around inside her mouth with her tongue. Carrie was covered with an enormous amount of saliva; Her clothes quickly became soaking wet. Piper felt Carrie stand up and start pounding on her own cheek, but then the tiny brunette quickly slipped and fell back down onto her stomach. Piper continued to slide the girl around, making it hard for her to get up or get a sense of direction.<br>\r\n<br>\r\n\"P-Please...\" Carrie begged feebly, one last time. \"I-I don't w-want to d-die...\"<br>\r\n<br>\r\nPiper pondered the situation for a moment.</span></div></div>",
            "created":1582693200,
            "id":2793250,
            "title":"Fire. (Pred Mainline)"
        },
        "1112111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Now you've done it... (Pred Mainline)"
            ],
            "content":"<div class=\"\"><div> <span><b>Gulp.</b><br>\r\n<br>\r\nPiper tilted her head back, causing the brunette girl to slide down the back of her tongue, into her esophagus. Carrie could feel the soft muscles pressing and massaging her body downwards- It would have actually felt pretty nice, if she had not known what was waiting for her inside Pipers body below. \"N-No...\" she sobbed, as she went down the point of no return. Piper smiled softly, and placed a finger on her lips, tracing the girl's path down her own throat. Piper's hand eventually made it's way to her tummy, which she massaged gently; She could feel Carrie's tiny body dropped into the organ, and felt her feebly pound on the walls of her stomach. Piper had officially become a predator.<br>\r\n<br>\r\nAnd now, she would become prey.<br>\r\n<br>\r\n*ZAP!* she heard behind her. She felt something painful and electric hit her on the back, and she blacked out for a split second. When she opened her eyes, she saw that she was kneeling on the carpeted floor... Except that each fiber was about as big as her left hand. \"N-No...\" she stuttered, realizing what happened.<br>\r\n<br>\r\nShe turned around, and saw a devilish grin behind her; It was the girl with the black hair. It was Mary. \"Someone's been snooping, I see~\" she grinned, as she aggressively scooped Piper off of the ground, bringing the tiny protagonist close to her massive face. Mary's eyes were bright green, and had a mischievous glint in them. \"I see you helped yourself to that Mark-0 Prototype Gun I stole yesterday... Wow, you really are <i>stupid</i>, thinking you're hot stuff with that broken piece of junk. You can't even unshrink yourself with it. My new toy, on the other hand...\" she said, waving around a silver-plated version of the ray gun, \"...Is a Mark-2 Gun. It's superior to that garbage in every way.\"<br>\r\n<br>\r\nMary burst out laughing. \"Hahaha! I would have shrunken you sooner, but it was priceless watching you shrink that brunette chick- You think you're tough just because you've got a gun in you're hand?\" she smirked. \"Let me tell you a secret- You're <b>Nothing</b>, runt. I've been gulping down dumb girls like you all my life, and here you think you've got your groove after you eat one sniffling brat.\"<br>\r\n<br>\r\nMary sneered. \"It's almost a shame to even bother eating you, I don't want your cluelessness having some sort of <i>effect</i> on my own superior brain... But whatever. I had to skip breakfast getting this new toy, so I guess you'll work. You should feel honored that you get to contribute to someone so superior and beautiful like me... Even if you'll just end up being fat on my ass. ...Whatever. Enjoy your final resting place, inside the body of the soon-to-be Empress of Macro University!\".<br>\r\n<br>\r\nMary opened her mouth wide. Piper narrowly broke her shirt free from Mary's hold, but she was ready, and grabbed Piper back with her left hand. \"Can it, twerp. In you go.\" she said, shoving Piper into her mouth and gulping her down her gullet. Paige was now on a one-way trip down into her captor's guts... It seemed the universe was set to make her pay for her sins.</span></div></div>",
            "created":1582693200,
            "id":2793272,
            "title":"Gulp. (Pred Mainline)"
        },
        "11121111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Enter the Intestines. (Pred Mainline)",
                "You can't lie to Laney like this... Find a way to spit Carrie up."
            ],
            "content":"<div class=\"\"><div> <span>Piper splashed down into the mushy waters of Mary’s stomach; The first thing that hit her was the intense heat. The air felt damp and heavy, almost like a sauna… Except much less clean. The second thing that hit her… was the smell. Piper instinctively brought her hand around her nose to mask the intense odor that was coming from Mary’s digestive system. The third thing that hit her… was the unpleasant tingling sensation coming from her own legs.<br>\r\n<br>\r\nPiper looked down, stepping away from where she was. She realized that her shins were submerged in the acid of Mary’s stomach. If it wasn’t for the already-intense moisture and heat, Piper would have started sweating. Looking around, she saw that Mary’s stomach was relatively empty; It turned out it was true that Mary hadn’t eaten yet that day. Which was probably lucky for Piper. However, the tingling feeling returned to her legs, causing the protagonist to jump; She felt waves and flashes of dizziness hit her, and realized that if she wasn’t careful, she would lose consciousness… permanently.<br>\r\n<br>\r\nAt first, Piper thought to use her gun. She tried to look for a reverse feature, or to use it on Mary, or… something. But it seemed that what Mary had said was true; The one she was holding really was an inferior model with few features. Even if she escaped, she’d need to… find some way to return to normal. Piper looked up at the pulsing walls at the top of Mary’s stomach. They were too high up, and even if she somehow managed to reach Mary’s esophagus, she would surely be gulped back down immediately.<br>\r\n<br>\r\nThe stomach shook as Mary’s body moved around; It sounded like she put a backpack or something on, as if she was heading to classes. Right. Classes. It seemed Piper never would get a chance to experience what this school was like. She felt her eyelids growing heavy…<br>\r\n<br>\r\nSuddenly, Mary’s guts rumbled from below Piper, causing her to snap back to reality. “...Right.” Piper thought. “The digestive system has two exits. Gross... but it’ll do.” she thought. She looked around, trying to find her jailer’s Pyloric Sphincter. Piper wasn’t sure if she could survive the trek or the acids below… but it was the only chance she had.<br>\r\n<br>\r\nSuddenly, as Piper fished around in the ‘waters’ of Mary’s stomach, her hand hit something solid. Something warm. Something… breathing.<br>\r\n<br>\r\nShe jumped back, as a girl in the corner of Mary’s stomach gasped for air and woke up. She was covered in Mary’s juices and looked like she had been here for much longer than was healthy. She had… brown hair. Piper realized this must be Carrie’s sister… Right, Carrie. Piper put her hand on her own stomach- She still felt Carrie’s small weight inside of it… but all movement had stopped. The same would happen to her if she didn’t get out of Mary soon.<br>\r\n<br>\r\nThe girl in front of her coughed. \"Blegh!! Ugh..... U-Um, how long was I out........?\" she asked, very dazed. Piper helped shake her out of it. \"You were swallowed by Mary. We both were. We need to get out of here, now.\".<br>\r\n<br>\r\n\"R-Right...\" the brunette girl said, feebly. \"I-I'm Laney...\". \"Piper.\" the protagonist responded. Piper addressed the situation. \"Okay Laney, I know you don't have a lot of energy, but we need to head downward immediately. We need to work together if we're going to survive\". \"S-Sure... l-lead the way...\" Laney said, still dazed, but starting to come to. \"M-My sister can help us r-return to normal...\"<br>\r\n<br>\r\nPiper felt a twinge of guilt; Laney had no idea that her sister was currently unconscious inside of Piper's stomach.</span></div></div>",
            "created":1582693200,
            "id":2793508,
            "title":"Now you've done it... (Pred Mainline)"
        },
        "111211111":{
            "author_id":"jerectamalic",
            "author_name":"Jerec",
            "choices":[
                "Deeper in the intestine. (Pred Mainline)",
                "A strange sensation. (Mary has become someone's prey.)"
            ],
            "content":"<div class=\"\"><div> <span>Piper leads Laney towards the entrance of the intestines, putting aside her guilt, for now they had to get to the safety of the currently inactive small intestine. The pair fight against the current caused by Mary walking, a current that would only get worse when her stomach kicked into digestive mode. The shallow pool of acid still currently being the only thing working at them. \"At least Mary didn't chew...\" She can't help but say out loud.<br>\r\n<br>\r\nLaney can't help but agree. \"The sphincter should be along the wall, opposite the way we... We came in.\" She says looking up towards the sphincter leading up to Mary's esophagus then following the curve of the stomach and seeing a large knot along the bottom of the stomach on a \"dry\" portion just above the end of the currently shallow Lake Mary. \"There it is, we've got to hurry! I hope we can get through!\" Laney exclaims, pointing towards it. <br>\r\n<br>\r\nThe two rush toward the exit, having an easier time now that Mary has apparently taken a seat in her class. With her stomach now settled and still waiting to really start the digestive process the two have an easier time. They wade up to the dry portion and climb up, feeling the stomach slowly push in on itself. \"Oh no!\" They both exclaim, the stomach clearly getting ready to start. With some luck the push is focused in the curve and it sends a wave of acid hurdling towards them, pushing them up onto the \"dry patch\" and receding as the stomach starts to push back out.<br>\r\n<br>\r\n\"Alright, we need to get out of here.\" Piper says, the two of them rushing to the sphincter. It seems, luckily in their case, that Mary has a digestive issue, causing her pyloric sphincter to be a little weak. The sphincter opens slightly as the stomach expands allowing them through into the small intestine. The two cough as they breathe in some slightly less rancid air. They rest for a moment to get their strength back, in the current safety of the long tube of an organ. <br>\r\n<br>\r\n\"We can't stay still for long.\" Laney starts, getting up and starting to walk deeper. \"If we're still here when it gets active, we'll never leave.\" She says somewhat grimly. She leads Piper deeper into the intestine, starting the long hike towards Mary's large intestine and actual safety. \"We have to get out of here, then find my sister so she can unshrink us!\" She says with determination.<br>\r\n<br>\r\nPiper feels Carrie start to move again, that along with Laney's guilt claw at her mind. \"Laney, um, I have a bit of a confession.\" She starts. \"Well, you see, I stole one of Mary's shrink rays and your sister was right there... I kinda, shrank and swallowed her.\" She explains, nearly tripping as Laney stops dead in her tracks. She doesn't even look back at her. \"Um, I can still feel her in my stomach, she's uh, moving around now...\" She says guiltily, if Laney turns around and punches her, she definitely deserves it.<br>\r\n<br>\r\nThe girl turns around, upset and yet exasperated at the news. \"Well, at least you told me.\" She says, letting her anger die. She grabs Piper and presses against her stomach, listening for her sister, giving Piper a slightly funny feeling as her boobs rest on Laney's head. \"Carrie! Big sis! Can you hear me!\" She calls, hoping to get her shrunken sister's attention. After a while of them talking Laney stands back up. \"Carrie's got her shrink ray. Swallow me so I can help her out of you, then we'll all be unshrunk when we get out.\" She says. \"Your stomach isn't active yet, so hurry!\" She exclaims, standing there, arms spread.<br>\r\n<br>\r\nPiper readies her shrink ray, pointing it at Laney and firing. She quickly rushes and grabs the girl, not tempting fate by letting her stand in the villi carpet for long. She looks at the tiny girl in her hand. \"Whatever happens, I want you to know that I'm sorry.\" She says before carefully putting the girl in her mouth and swallowing. \"Be safe.\" She says, before trudging deeper into Mary, all the while focusing on the two sensations in her stomach.</span></div></div>",
            "created":1582779600,
            "id":2793788,
            "title":"Enter the Intestines. (Pred Mainline)"
        },
        "1112111111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Enter the Colon (Pred Mainline)"
            ],
            "content":"<div class=\"\"><div> <span><b>(Pred Mainline)</b><br>\r\n<br>\r\n================<br>\r\n================<br>\r\n<br>\r\n<b>(Note; Moving forward, Laney and Carrie should stay alive and remain major characters in the Pred Storyline, forming an uneasy alliance with Piper in order for the three of them to stay alive!)</b><br>\r\n<br>\r\n(Also, this part is clean, and only features the small intestine!)<br>\r\n<br>\r\nPiper continued trudging through the fields of villi; They went on and on and on... it seemed there was no end to Mary's horrid digestive system. It was hard slogging through the small bowel, since Piper often had a hard time finding a stable footing on all of the villi; Mary also seemed to be walking around a good bit, which caused her body to jostle around from time to time, causing Piper to fall over. <br>\r\n<br>\r\nShe walked for what seemed like hours on end- And may very well have been. Piper could only assume that she had already missed all her classes for the day... She wondered what Gwen was thinking. Suddenly, she felt some movement within her own tummy; Putting her hand on her belly, Piper felt that Carrie and Laney had entered her own large intestine. At least the two of them were okay... She really had planned on digesting Carrie earlier. But after seeing Laney in that state... She just couldn't go through with it. She grimaced- She had turned soft. What had happened to all her bravado about coming here to make meals? Piper fixated her eyes firmly on the intestinal path in front of her. Once she got out of here, she really would digest the next person she ate... and no mater how long it took, she would make sure that Mary became a permanent resident of her gut.<br>\r\n<br>\r\nShe continued pushing through for the next half hour; Sometimes Mary's jostling stopped, and other times it resumed again. She wondered what the heck Mary was up to...<br>\r\n<br>\r\nPiper spotted Mary's Illeocycal valve up ahead; The entrance to her host's large intestine. Just as Piper was about to walk towards it, she felt movement inside her own body... near the backdoor. She exhaled, knowing what \"step\" came next. Seeing the... remains of Mary's own meals around her, Piper figured that this wasn't the worst place to do her own business. She pulled her pants down...<br>\r\n<br>\r\n. . .<br>\r\n<br>\r\nA few minutes later, she 'retrieved' Carrie and Laney, who were both very weak from their journey. Carrie started to get up, and used her Tier-1 Raygun to return Laney to normal size, then herself. Now, all three girls were the same size near the end of Mary's small intestine. <br>\r\n<br>\r\nThen, Carrie pointed her Raygun at Piper.<br>\r\n<br>\r\n\"You're going to burn in hell for what you did to me.\" she said, glaring at Piper. \"I hope you rot there... I'll grind you up under my heal to send you there myself.\" She was a totally different person from the crying girl Piper met earlier. These were the words of a girl who had been pushed beyond the edge of despair, and was still alive somehow... A girl who could only think of the pain that Piper had caused her. \"Carrie... D-Don't...\" Laney said.<br>\r\n<br>\r\nPiper was at too far a range to stop her; All she could do was accept her approaching oblivion. However, Carrie's movements were sluggish; She had expended too much energy escaping Piper's body. Before she could pull the trigger, Laney slapped the gun out of her hand. \"NO!\" Laney screamed, knocking her sister over. The Raygun dropped down and fired, but it's beam ricochet off of Mary's guts, and ended up hitting itself; It exploded in an electrical burst; The gun was totally scrapped. The three girls just stood there, panting.<br>\r\n<br>\r\nPiper looked at Laney. \"...Why did you do that?\" Piper asked her. \"You should hate me.\"<br>\r\n<br>\r\nLaney sniffed. \"I DO hate you. You're a big, stupid jerk who ate my f*cking sister!!\" Laney yelled at her. Carrie weakly looked over at Laney. \"B-But...\" Laney continued, sobbing. \"T-This isn't like you, Carrie.. Y-You scared me, acting like that... I-... I...\" Laney sobbed, falling to her knees. Carrie couldn't think of anything to say; All her tears had already been used up earlier. She just stood there, looking at Laney.<br>\r\n<br>\r\nA few minutes later, the three girls continued into the Large Intestine.<br>\r\n<br>\r\n<b>(Note; Moving forward, even after leaving Mary's body, Laney and Carrie should stay alive and remain major characters in the Pred Storyline, forming an uneasy alliance with Piper in order for the three of them to stay alive!)</b></span></div></div>",
            "created":1582866000,
            "id":2794134,
            "title":"In the Bowels (Pred Mainline)"
        },
        "11121111111":{
            "author_id":"jerectamalic",
            "author_name":"Jerec",
            "choices":[
                "Puts the shrink ray away, she's not going to be a monster. (Main Predline)",
                "Shrinks Piper, but decides to keep her safe, always wanted a pet."
            ],
            "content":"<div class=\"\"><div> <span>With Carrie's shrink ray destroyed, the group now has to hopefully find someone who does have one when they get out of Mary. \"We should find my roommate Gwen. She seems nice and will hopefully keep us safe.\" Piper suggests. Looking back at the two sisters, they nod in agreement, though it's easy to tell that their friendship is, to make the understatement of the year, rocky. Carrie still looks like she wishes she'd shrunk Piper. Laney also clearly isn't fond of her, but seems to be a little friendlier, obviously because Piper had saved her and had done the right thing.<br>\r\n<br>\r\n\"Alright, hold on a moment.\" Laney starts, pausing their progress in the much larger tunnel. \"Piper, give me your shrink ray.\" She says, holding out her hand. Piper begins to protest, but the girl cuts her off. \"Piper, I don't trust you with the shrink ray. You did the right thing and saved my sister and I, but at the same time, you are the reason Carrie needed to be saved. At the same time, I don't trust Carrie not to shrink you and get revenge, I can't blame her, but we need each other. Sorry, I just can't trust you yet, and there's a nagging thought at the back of my mind that you'll just eat us both later.\" Carrie wants to protest, but at the same time realizes that she can't trust herself either.<br>\r\n<br>\r\n'<i>So much for my spree...</i>' Piper thinks somewhat disappointedly, at the same time especially now that she's on the receiving end, she starts to wonder why she wanted to go on one to begin with. Taking someone's life, just for a piece of momentary pleasure, it would make her no better than the monster they're currently inside. Still, all that power in one little ray gun, it remained a temptation at the back of her mind. She sighs, pulling out the pistol shaped device and reluctantly hands it to Laney. \"A-alright. Here...\" Piper backs up, with her hands held up in surrender after Laney takes the gun. \"If you want to have some revenge... I'm at your mercy...\" She couldn't help but say, now feeling extremely vulnerable having handed over her source of power and only defense.<br>\r\n<br>\r\nLaney looks from Piper to the shrink ray, the temptation great. Even just holding the device made her feel powerful, present location aside, and Piper had nearly digested her sister. At the same time, Piper had saved her, though that could easily be out of self preservation and could've been planning to eat her too. However, she'd also told her the truth and allowed her to save her sister. All those thoughts permeate her mind as she continues to look between the device and Piper, the woman's eyes closed, not wanting to see her doom. Laney...</span></div></div>",
            "created":1582866000,
            "id":2794270,
            "title":"Enter the Colon (Pred Mainline)"
        },
        "111211111111":{
            "author_id":"celestemirror",
            "author_name":"CelestialMirror",
            "choices":[
                "Continue Forward (Pred Mainline)"
            ],
            "content":"<div class=\"\"><div> <span><b>(Pred Mainline)</b><br>\r\n<br>\r\nLaney tucked the gun away into the pocket of her jeans. \"Alright then... thank you.\" she said, looking at Piper. All three of them were very tired by this point; All Piper could do was nod. Laney continued \"If we want to survive this... We're going to need to work together. Even after we get out, we'll still be shrunken and vulnerable, at a school with hundreds of hungry girls... Even if we don't like it, we need to look out for each other if we want to get through this.\"<br>\r\n<br>\r\nCarrie looked at Laney, a few tears emerging from her eyes. \"I... u-um... I'm sorry.\" she said. Then she turned to Piper. \"I still hate you... but if it's what Laney wants, then I'll listen to her.\"<br>\r\n<br>\r\n\"Right.\" Piper responded. She still didn't feel very safe around Carrie. The group continued down their captor's gut.<br>\r\n<br>\r\n. . .<br>\r\n<br>\r\n<b>(Note: This next section has themes of scat, given that the girls are in a Large Intestine. If that's not your cup of tea, no worries! Just scroll down to the bottom and select the next chapter of the story, the story will become clean again once the girls leave Mary's body; No crucial plot details will happen inside Mary's colon!)</b><br>\r\n<br>\r\nThe three girls continued walking down Mary's large intestine. Looking around, Piper guessed that they were inside the Ascending Colon (The first part), given what she knew from highschool biology. Next would come the Transverse Colon (Horizontal part), the Descending Colon, then Mary's Rectum... &lt;\"Gross...\"&gt; Piper thought. She wasn't keen on being pushed out with the remains of Mary's food... There truly was no greater embarrassment than being pushed out with the waste products their megalomaniacal captor had to expel from her body. Still, they didn't have much choice.<br>\r\n<br>\r\n\"Ugh, this is so gross...\" Carrie said, holding her nose tightly. \"At least I was semi-unconscious for most of Piper's gut...\" she said, looking around at the large piles of poop that had begun to accumulate inside Mary's gut. \"And not like this is a compliment or anything, but at least your colon was 'emptier' Piper... This Mary looks like she eats way too much...\" she said, as they tried to maneuver around large amounts of Mary's poop, which was getting increasingly difficult the further in they went.<br>\r\n<br>\r\nLaney looked around. \"It's probably so full in here because she carb-loaded yesterday.\" she mused. \"Before she ate me, I heard something about her planning some reconnaissance over in the Research Department today... She probably ate a lot yesterday so that she could go a long time today without needing to eat.\" Laney explained. She looked around at the... contents of Mary's colon. \"I'm not thrilled about having to climb through Mary's poop either... But I guess it's better than getting digested int he stomach...\" she said, as they maneuvered over a large pile of feces. Piper climbed to the top and so did Laney, but Carrie was having trouble getting over; Piper reached down and grabbed Carrie's arm, helping her up. Piper's arm was still gross and covered in Mary's poop, but Carrie still managed to hold on without slipping; Piper was glad that she didn't have a mirror to see what her pure-white hair looked like right now. \"T-Thanks...\" Carrie muttered.<br>\r\n<br>\r\nSuddenly, some of the poop Paige was sitting on gave way, and both she and Carrie tumbled forward down the direction they were heading in, landing in another pile of Mary's poop. Carrie's right shoulder and arm got stuck in it, and she pulled herself out. \"This is GROSS! Ugh, I HATE this stupid b*itch!!!\" she yelled, kicking the wall of Mary's colon. Her kick didn't seem to have much affect, but it triggered a small peristalsis movement that pushed a lot of air through Mary's bowels, towards the exit. (Piper smirked, hoping that embaressed Mary). The burst of Mary's Gas knocked the three girls over; Carrie was none too pleased, \". . .\".<br>\r\n<br>\r\nCarrie stayed sitting in the poop for a little bit. \"I... I think I need a break for a few minutes...\" she said. Piper and Laney agreed; They were all still pretty weak. Laney and Carrie hadn't eaten anything all day, and Piper's only meals were now sitting in front of her, not being digested. \"Yeah...\" Piper said, sitting down next to the other two. \"Let's catch our breaths.\"<br>\r\n<br>\r\nCarrie tried to lean backwards, only to lean on some more of Mary's poop. \"This chick is nasty!! I hate her stupid body, there's nothing but her poop everywhere!!\" she fumed. Laney tried to calm her. \"Look Carrie, it's still just a normal human body, it's just how things work... There was a lot of poop inside Piper's body too, you were just lucky to be out enough that you didn't have to experience the gross part...\" she said, before blushing and turning to Piper, \"S-Sorry, I didn't mean any offense...\". Piper laughed weakly, \"Heh, none taken. I bet my poop wasn't too great either\". Laney and Piper laughed weakly.<br>\r\n<br>\r\nA few tears formed in the corners of Carrie's eyes. \"I-I know... I-It's not just that...\" she sniffed. At least she was less scary when she cried. \"It's just... everything, you know? It <b>doesn't</b> just magically end and get better when she poops us out... we're still going to be stuck like this. How will we survive if she flushed us down? What if she sees us? What if some other dumb girl steps on us? What if...\". Laney slid over and hugged her sister. \"Look, it's going to be okay...\" she said, holding her closely. \"I bet whatever happens, the three of us can figure it out if we stay together... We both survived Piper's gut, and we found each other... I'd say we're doing pretty good so far. : ) \" she smiled at Carrie. Carrie sniffed, and smiled back, \"Yeah... I guess you're right. Even if Mary's Large Intestine is filled with her gross poop, at least it's safer in here...\" she said, looking around.<br>\r\n<br>\r\nCarrie looked down at some of the poop the three girls were sitting on, and picked some of it up with her right hand (They were already very dirty at this point, so...). \"Ugh... her poop smells horrible... But I guess at least it's soft and warm, and not, like, painful or something.\" she said, laughing a bit before putting it back down. \"You said it's all pasta, right Laney?\" Carrie asked her sister. Laney nodded. \"Yeah, she probably binged at the buffet yesterday so that she could last longer on whatever mission she's on... All this poop is probably just digested noodles, after she digested all the nutrients from them, only leaving her smelly poop as remains to be pushed through her colon...\" Laney commented. Carrie giggled a little bit. \"Even though Mary's a psychotic b*tch, it's still kind of funny knowing that her body's still super gross and makes poop... Maybe someday I can embarrass her by telling her about her body's inner workings, heh. I guess everything that goes down her gullet ends up being mushed down, becoming her poop..\"<br>\r\n<br>\r\nThat made Piper think about something. \"Everything that goes down her gullet...\". She glanced around her at the piled of Mary's poop, and saw something sticking out of them... Something white. Something that looked like a bone... a human bone. Piper jerked her head back to the conversation, and pretended she didn't see it; She figured that wouldn't make Carrie or Laney feel any better.</span></div></div>",
            "created":1582866000,
            "id":2794297,
            "title":"The Depths of Mary (Pred Mainline)"
        },
        "1112111111111":{
            "author_id":"jerectamalic",
            "author_name":"Jerec",
            "choices":[
                "Heading to the end. (Main Predline)",
                "It's a safe but crappy existence here."
            ],
            "content":"<div class=\"\"><div> <span>Carrie and Laney continue to talk to each other, but their conversation goes unheard by Piper who's focus is now entirely on her discovery. A bone, a human bone, and the worst part, she knows exactly who it belonged to. The poor girl that was shrunk yesterday, that's all that is left of her. Piper went pale as she thought about what that meant, the girl's family wouldn't know what happened just that she disappeared and Mary clearly didn't think much of the girl besides as food, essentially nothing. The worst part, the part that dawned on Piper, she was going to do the exact same, she nearly had in fact, if it hadn't been for her guilt the same would've happened to Carrie. \"Excuse me a moment...\" She tells the two, rushing behind a portion of Mary's waste, collapsing to the \"floor\" and emptying her stomach. <br>\r\n<br>\r\nAfter a moment she returns to the other two, wiping her mouth as clean as she can get in this environment. Laney walks up and holds her up as she wobbles. \"Yeah, I'm having a hard time too. I hope this is the last time we see the inside of someone's butt. Carrie agrees, joining Laney in helping out Piper as they continue their journey to the exit. Piper nods along, keeping silent about what she'd seen, hoping that the one bone would be all they encountered.<br>\r\n<br>\r\nThey continue moving, getting closer and closer to the exit, only for the whole group to stumble upon the one thing Piper had been praying not to see. Carrie and Laney gasp, losing their grip on Piper, who collapses to the floor. In front of them, lay bare on the rectal floor, a skull. \"I-I heard a girl had gone missing the other day. D-do you think this is...\" Laney starts.<br>\r\n<br>\r\nThe sisters collapse next to Piper. \"Why would anyone do this?!\" Laney asks angrily. \"What did she do to Mary to deserve this?! What did I do?! Why would anyone want to do this?!\" Each question only making Piper flinch with guilt.<br>\r\n<br>\r\n\"I don't know...\" Piper whispers. \"Why did I? What was I thinking?\" She asks herself in guilt, not realizing the others can hear her.<br>\r\n<br>\r\nLaney sighs a bit, venting her anger as much as possible. \"It's okay Piper, at least you've turned around, unless you're a real good actor.\" She says, before helping the other two back up. \"Getting angry or giving up isn't going to bring her back, or get us out of here. So unless you guys want to live inside Mary's rump, I think we should move on.\"</span></div></div>",
            "created":1582866000,
            "id":2794374,
            "title":"Continue Forward (Pred Mainline)"
        },
        "11121111111111":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "went with Laney and Carrie (Pacifist mainline).",
                "Turned and began climbing Mary to get at her ray gun."
            ],
            "content":"<div class=\"\"><div> <span>The trio were all exhausted and disgusting at this point but they had finally reached the end of their journey. Luckily they hadn't been disturbed by Mary moving too much recently, Piper just hoped that somehow they could actually get out of Mary's rear end without her noticing. Lanie, Carrie, and Piper were able to squeeze out of the final sphincter by all working together and as a group they tumbled out into Mary's panties. And that was it! They were finally out! Although they didn't feel terribly out, they were all inside Mary's underwear. Mary seemed to be sitting in a chair so the girls had to wriggle forward to get out from under Mary's butt once they had actually gotten out of it. Next they traveled down Mary's pantleg. Mary's leg was resting at an angle while she sat so it was simple enough to just walk down and out the bottom. It was still unnerving walking down Mary's pantleg right next to the massive column of flesh that was her leg, Piper was worried since Mary didn't seem to have reacted. It's not impossible that Mary hadn't noticed their escape but Piper personally felt like she would've noticed a trio of shrunken students climbing all the way through her and out of her ass. When The three girls reached the bottom of Mary's pantleg and were able to step out onto the floor it became obvious why Mary hadn't done anything since their escape. Piper looked up and saw that they were in an unfamiliar room, and Mary was sitting asleep at this big wooden desk, her head propped up on her arm. Piper could see that on the desk Mary had both her fancy silvered ray gun, she'd called it tier 2 or something like that, and what appeared to be a pill bottle. \"Well that explains a lot\" Carrie said when she caught sight of the pill bottle. When Piper and Laney looked  at Carrie in confusion she elaborated \"Those pills, one of the random things the university has cranked out over the years. They make you hyper alert for a few hours but after a few hours... well\" Carrie gestured up at Mary's massive but fast asleep form. \"They also play hell with you insides, I guess that's why we were able to just walk our way out of her, normally it isn't so easy to escape once someone swallows you.\"<br>\r\n\"Well, guess she's not as good at this as she thought\" Piper felt some small satisfaction that knowing Mary wasn't infallible when it came to her hunting.<br>\r\n\"Hey, we're still tiny, we need to get unshrunk before celebrating\" Lanie broke into Piper's thoughts. \"I think we were in there for long enough that most of the school will have their ray guns, we should find someone to fix us.\"<br>\r\nPiper felt cheated that by getting swallowed she'd lost her chance at getting a proper ray gun instead of the old piece of junk she'd gotten from Mary, and she didn't even have that since Laney took it. \"My roommate Gwen would help us\" Piper offered.<br>\r\n\"Where would she be\" Carrie asked.<br>\r\n\"Well our room is on the 2nd floor of the dorm, I don't know where exactly she'd be but we can go there and wait.\" Piper was trying to think of anything she could that might be more helpful, she really had no idea how to get from here to her and Gwen's room.<br>\r\n\"That's not very helpful, we'd have to walk across the whole campus.\" Carrie was frowning and also clearly trying to think of somewhere to get help from.<br>\r\n\"We would? Do you know where we are then?\" Piper was grateful for having an older student with her, and with that thought she also felt a little more guilt over her earlier swallowing of Carrie.<br>\r\n\"Well I don't know exactly where we are, but I think we're in one of the research buildings\" Carrie looked around the room they were in, there were several other desks similar to the one Mary was asleep at, there wasn't any windows but there was a single door on the other side.<br>\r\n\"Well we aren't going to make any progress just standing her\" Laney said as she started walking towards the door \"C'mon, we'll just need to be careful if we find anyone we don't know.\" Carrie shrugged but clearly still wanted a better plan as she began to follow her sister. Piper started after them, then glanced over her shoulder at Mary asleep at the desk before she...</span></div></div>",
            "created":1582952400,
            "id":2794907,
            "title":"Heading to the end. (Main Predline)"
        },
        "111211111111111":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Try to steal the researcher's ray gun.(Pred mainline)",
                "Keep searching the building."
            ],
            "content":"<div class=\"\"><div> <span>After a moment Piper turned away from the drowsing giantess and followed after Carrie and Laney. After a minute of walking the shrunken trio reached the door, it was a tight squeeze but they were able to all squeeze under the door to the room and emerge into the hallway. The hallway had a cold, sterile look, white walls with cold electric lighting. Piper could see several doors along the hallway that looked more or less the same as the one she and the others had just crawled under. There was a T intersection in the hallway, the door Piper and the sisters had crawled under was the last one before the intersection. As Piper and her companions took in the surroundings they began to hear a tapping noise coming from around the corner, the noise got louder and louder and at about the same time all three of them heard that they were hearing the footsteps of someone coming down the hallway. The group backed up towards the door they'd come out of just as the giantess came around the corner. Piper looked up and saw a brunette girl, she had a shorter haircut and was wearing a tie-dyed t-shirt, she was carrying a purse but also had a white lab coat draped over one arm. The girl went to a door across the hall from the one Piper and the others were currently sheltering in, pulled a key out of her pocket, unlocked the door and went in. As soon as she was gone Piper, Carrie and Laney exchanged looks. \"Well, I'd guess she's a research assistant\" Carrie started.<br>\r\n\"You don't think she'd help us do you?\" Laney looked at her sister<br>\r\n\"Well...\" Carrie thought for a second \"I don't think it's worth risking getting eaten again.\"<br>\r\n\"I have an idea\" the sisters turned their attention to Piper \"We could try to get at her ray gun while she's not looking. Hopefully she'll be busy doing... I don't actually know, lab stuff. But my point is we could sneak in and get at her ray gun, unshrink ourselves, and then we're at least back to normal.\"<br>\r\n\"I'm not sure, it might just be safer to keep looking around the building, these labs are where the ray guns were made originally, some might be just unattended.\" Carrie offered. After a brief discussion the group decided to...</span></div></div>",
            "created":1583038800,
            "id":2795249,
            "title":"went with Laney and Carrie (Pacifist mainline)."
        },
        "1112111111111111":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Piper reached the purse. (Pred mainline)",
                "The researcher spotted one of the shrunken students out of the corner of her eye"
            ],
            "content":"<div class=\"\"><div> <span>\"I think it's worth a shot\" Laney supported Piper.<br>\r\n\"Alright, but lets be careful.\" After Carrie's closing remark the trio dashed across the hallway and slipped under the door. Inside the room was fairly similar to the hallway, they could see the girl had thrown her lab coat over a desk at one end of the room and set her purse down next to it, the giantess herself was at the opposite end with a fume hood, Piper couldn't see what she was doing with it and the fume hood looked like it was turned off. \"Well, if she's not keeping her ray gun in her pocket then she's probably left it in her purse.\" Carrie pointed at the purse.<br>\r\n\"Great, lets go\" Piper started towards the purse but stopped when Carrie didn't follow \"Come on, we don't know how long she'll be distracted for.\"<br>\r\n\"Well, if only one of us goes then it's less likely she'll see us, you go ahead and if the shrink ray is in there than wave for us to come after you.\" Carrie explained.<br>\r\n\"Fine then.\" Piper started across the floor and towards the unattended purse. Piper stayed as close to the wall as she could, and just prayed that the giant researcher wouldn't spot her.</span></div></div>",
            "created":1583038800,
            "id":2795255,
            "title":"Try to steal the researcher's ray gun.(Pred..."
        },
        "11121111111111111":{
            "author_id":"jerectamalic",
            "author_name":"Jerec",
            "choices":[
                "Asks them about their predicament. (Pred Mainline)",
                "Decides to play a game with them."
            ],
            "content":"<div class=\"\"><div> <span>Piper makes her way towards the purse, slowly taking her eye off the researcher as she goes. Eventually she makes it to the purse and begins to climb it, trying to get inside to the shrink ray. She reaches the opened top of the purse and pears inside, finding a sleek, shiny ray gun inside and from the looks of it, a model even more advanced than Molly's, maybe it was their lucky day. She looks to her friends and waves, getting them to come over. The group reunites and peers inside the purse. \"Wow, I've never seen that model.\" Carrie comments, staring with a noticeable amount of envy. The group slowly climbs inside the purse, coming up with a plan to use the ray.<br>\r\n<br>\r\nTheir plans are interrupted when the purse lurches and closes, trapping them inside. \"Oh no!\" Laney says. \"We should've been keeping an eye on her! What'll she do if she finds us?!\" She asks in fear. \"We barely survived Mary, I'm not ready to be eaten again!\"<br>\r\n<br>\r\nThe group huddles together, sharing Laney's apprehension. All they can do is wait and hope the researcher is nice. Slowly but surely the purse comes to a stop and opens. The group hide, watching the top to see what happens. A giant hand reaches inside, gripping the shrink ray. The group rushes and grabs hold, being carried out with the ray as it is taken out of the bag. A mistake on their part, they don't know why it's being taken out. Fortunately the ray is set on a table next to the purse and the researcher sits down, looking at something. \"Alright, now all we have to do is wait until she's not paying attention.\" Carrie says, the group sitting down in the shadow of the ray gun.<br>\r\n<br>\r\n\"Alright you three, come on out.\" The researcher suddenly speaks up. \"Don't be afraid, I won't hurt you.\" She adds, a hand playing with a lock of her blond hair. \"I'm Linda, a scientist using your universities labs for my research into the world of miniature robots.\" She says, getting closer to the table, and you girls are?\" <br>\r\n<br>\r\nThe group steps out with warranted apprehension, looking fearfully up at the scientist named Linda. \"I'm Piper, and these are Carrie and Laney.\" She says with a nervous gulp, introducing the group.<br>\r\n<br>\r\n\"Well you three, looks like you are off to a bad start of the year.\" Linda says, plucking up the group and carefully holding them in her palm. \"Well, don't worry, you can spend the night here, I'll take you to your dorm later.\" She looms the group over, thinking a bit.</span></div></div>",
            "created":1583211600,
            "id":2795912,
            "title":"Piper reached the purse. (Pred mainline)"
        },
        "111211111111111111":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Mary (pred mainline)",
                "Linda"
            ],
            "content":"<div class=\"\"><div> <span>\"So then, I'll be pulling an all nighter in here\" Linda spoke down to the tiny trio standing in her palm \"and since we'll be spending some time together how about you tell me how it was you all came to be in my purse.\" And so Piper, Carrie and Laney told the story of how  they'd all separately wound up in Mary's stomach, Piper did her best to gloss over the part where she had swallowed Carrie but she wasn't entirely able to avoid a few awkward glances with the sisters during that part of the retelling. Telling Linda the whole tale didn't take too long, and when they were finished Linda set them back down on the table.<br>\r\n\"Linda, one question\" Laney spoke up \"You have a ray gun right there, why don't you just grow us back to normal? Then we could all leave you to whatever it is you're doing and you wouldn't have to drop us off back at the dorm tomorrow.\"<br>\r\n\"Oh, well\" Linda grinned down at them \"Maybe I just like the idea of having the three of you around for the night\"<br>\r\n\"But you could just unshrink us and let us get on our way\" Piper added into the conversation.<br>\r\nLinda gave an exasperated sight \"We've clearly established that I could unshrink you, I believe we've also established that I'm not going to.\" Piper wasn't sure if the others two felt it, but she was pretty sure Linda wasn't going to be happy to discuss this further. Then Linda continued \"Now I'm going to be leave for a second, I'll be back in a few minutes, I recommend that you stay put, for your sake.\" Linda then got up, walked across the room and out the door. Piper, Laney, and Carrie looked at each other, and then all rushed to where Linda had left her fancy ray gun on the table.<br>\r\n\"I bet all three of us could use this thing if we worked together.\" Carrie said looking over the thing. Looking up at it, the gun was about six times as tall as any of the girls, it was currently pointed over the edge of the table, so they'd need to push it around to point it towards where one of them could stand on the table and then they'd need to pull the trigger. The three girls started pushing on the gun and they were slowly beginning to turn it so that they could use it on one of them when the heard the door handle jiggle and begin to turn. The girls froze as the door swung open and in walked... </span></div></div>",
            "created":1583387880,
            "id":2796863,
            "title":"Asks them about their predicament. (Pred Mainline)"
        },
        "1112111111111111111":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "took the chance to hide (pred mainline)",
                "got the sisters to help her position the ray gun to fire it at Mary"
            ],
            "content":"<div class=\"\"><div> <span>Piper couldn't believe her eyes as Mary walked in, could she never get away from this girl? Mary's eyes lit up as soon as she saw the ray gun sitting on the table and she practically ran across the room. When she got close enough Mary saw the three shrunken girls standing around the gun and exclaimed \"Oh good, an easy upgrade for my arsenal and a few free snacks. Wait a second...\" A look of recogniction passed over Mary's face, she didn't normally make a habit of remembering her snacks but she'd seen the three shrunken students so recently. As Mary paused for a moment in confusion the door opened once again looking past Mary Piper saw Linda enter the room, Linda opened her mouth to yell as soon as she saw Mary but before she could Mary had whipped around, drawn her tier 2 ray gun and fired. A blue bolt leapt from the tip of Mary's ray gun and struck Linda square in the chest, Linda quickly dwindled down to the same 1 inch size that Piper and the sisters had been stuck at. Mary smirked and strode over to the door, as Mary bent down to scoop up the shrunken scientist Piper...</span></div></div>",
            "created":1583388780,
            "id":2796864,
            "title":"Mary (pred mainline)"
        },
        "11121111111111111111":{
            "author_id":"jerectamalic",
            "author_name":"Jerec",
            "choices":[
                "Linda lets her go. (Pred Mainline)",
                "Linda shrinks Mary."
            ],
            "content":"<div class=\"\"><div> <span>Piper and friends rush to hide on the table, as she ducks behind cover she peers out to see Mary reach down to grab Linda only to see something that surprised the whole group including Mary. Linda suddenly returns to normal size, punching Mary in the process and snatching their fellow student's shrink ray. \"You didn't think I'd be unprotected in my lab do you? Especially after hearing about the recent thefts, hmm?\" Linda asks rhetorically, a smug smile on her face. She circles the surprised student, picking up her own shrink ray. \"I'll give your ray gun to your homeroom teacher, you can pick it up from her tomorrow.\" She informs her.<br>\r\n<br>\r\nMary looks at the researcher with wide eyes. \"You can't do that, I'll be defenseless!\" She shrieks, knowing just how many students would gladly get revenge on her for taking their friends.<br>\r\n<br>\r\n\"Then perhaps you should have thought of that before trying that on me. Now go, before I decide to reverse the situation you thought you had me in.\" Linda tells a very vulnerable looking Mary, licking her lips and patting her belly a bit. \"Mmm, you do look tasty though, and I am kind of hungry.\" She adds threateningly.</span></div></div>",
            "created":1583471760,
            "id":2797230,
            "title":"took the chance to hide (pred mainline)"
        },
        "111211111111111111111":{
            "author_id":"jerectamalic",
            "author_name":"Jerec",
            "choices":[
                "She takes the group to her dorm for the night. (Pred Mainline)",
                "Wants to know how they survived the trip."
            ],
            "content":"<div class=\"\"><div> <span>Mary looks around the room desperately, thinking of any way she can get her shrink ray back. \"You're still here, snack? I'll give you ten seconds and if you haven't left by then, you're mine.\" Linda threatens.<br>\r\n<br>\r\nMary looks at her both with fear and anger. \"Not without my shrink ray!\"<br>\r\n<br>\r\n\"One, two...\" Linda starts counting down, causing Mary to panic and quickly flee out the door. The researcher walks over and closes the door, locking it, and walks back to the table. She pulls up a chair and plops down on it. \"Alright, you three can come out now. She's gone.\" <br>\r\n<br>\r\n\"Y-yeah, she's gone, but how do we know you won't eat us?!\" Laney asks with a stutter. <br>\r\n<br>\r\n\"I guess you don't, but right now I'm not planning on it. However, I'm also currently one of the safest people for you to be with at the moment.\" The researcher replies. \"Being here on a research grant means I get quite a few perks. Besides the teachers and Macro herself, I'm practically untouchable. Access to all the latest in shrinking technology, for example.\" She holds up her arm, showing off a fancy bracelet. \"A re-growth bracelet that provides me with the ability to re-grow at will. I also have another device that provides extra defense from being shrunk, which I forgot to turn on.\" She says with a blush. \"Oh well, I'll just have to remember before I leave.\"<br>\r\n<br>\r\nThe trio hiding behind her purse stay put out of fear, only to find themselves being stared at. Linda peers down at them as she leans over the top of her purse. \"Hello again. Hmm, what to do with you three?\" She asks herself.</span></div></div>",
            "created":1583516700,
            "id":2797443,
            "title":"Linda lets her go. (Pred Mainline)"
        },
        "11121111111111112":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "\"starting to feel hungry\"",
                "\"In need of a new guinea pig\""
            ],
            "content":"<div class=\"\"><div> <span>As the research assistant worked she turned and caught sight of Piper creeping across the room, she didn't look directly at the shrunken student but walked back over towards her purse. As the giantess moved Piper pressed her back to the wall and froze, her heart beat wildly in her chest as the giant shadow passed over her. Just as Piper thought she'd been missed and the giantess would just walk past her the research assistant's hand shot out at incredible speed. Piper tried to dodge but really had nowhere to go as she was snatched up and raised to the giant girl's face. Piper tried to struggle against the hand holding her, she looked into the inquisitive eyes staring down at her.  \"Well what are you doing here\" the giantess spoke more to herself than Piper as she looked over the shrunken student. With her free hand the research assistant poked and prodded at Piper. Piper opened her mouth to try and answer the giantess's question but was cut off as the giantess kept speaking \"It's lucky that I found you, I was...\"</span></div></div>",
            "created":1583038800,
            "id":2795340,
            "title":"The researcher spotted one of the shrunken stud..."
        },
        "111211111111112":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Mary had opened her eyes, and was staring down at Piper",
                "Laney had climbed up Mary after her, with Carrie not far behind"
            ],
            "content":"<div class=\"\"><div> <span>Piper stopped, if she could just get Mary's ray gun then she could fix herself, fix the sisters if they bothered to stick around, and even get revenge on Mary. Piper walked back to Mary's foot and began the trek up Mary's leg. Going up was pretty similar to going down, It was nice not to have to walk next to the smooth, pale column that was Mary's leg since Piper was walking on top of Mary's leg rather than inside her pantleg, the only drawback was that she had some risk of falling off now, but Mary's leg was at a shallow enough angle that the climb was pretty easy. The walk up Mary's leg was much more pleasant than walking through Mary's insides had been, with that in mind the walk felt pleasant, just climbing in the clean air. Piper quickly reached Mary's lap, the easy part was over. To climb the rest of the way up to the desk with the ray gun on it Piper had to climb Mary's torso by gripping fistfuls of the expanse of fabric that was Mary's shirt. Piper was tiring, but determined, she pushed herself and made it up to Mary's shoulder, from there it was a simple matter to stroll down Mary's arm and onto the desk. She'd done it! Piper stepped off of Mary's arm and onto the desk where she walked up to the ray gun. Now Piper just had to think of how to use it, at her height of a single inch the ray gun was many times Mary's size. As Mary stood trying to think of how to unshrink herself, or maybe move the gun to shrink Mary she heard a sound from behind her. Spinning around Piper saw...</span></div></div>",
            "created":1583125200,
            "id":2795537,
            "title":"Turned and began climbing Mary to get at her ra..."
        },
        "1112111112":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Carrie shrinks Piper",
                "Carrie agrees not to take revenge until they're all safe."
            ],
            "content":"<div class=\"\"><div> <span>As Piper continued her slog through Mary's intestines she distracted herself from just how disgusting her current surroundings were by concentrating on the feeling of the pair of sisters she had wriggling around inside her own stomach. It was hard for Piper to tell what exactly was going on inside of her but she was pretty sure that Laney and Carrie had reached her own interstines by now and were probably in pretty much the same situation that she was. Piper had no idea how Mary managed to act normally in class with little people crawling around inside her, Piper felt like if she had to sit still with Carrie and Laney wiggling through her digestive tract then she'd burst out laughing from the tickling sensation of it. Hopefully The shrunken sisters would get to Piper's \"back door\" at around about the same time she got to Mary's and then Carrie could unshrink them. As Piper continued her putrid walk she kept thinking about how apparently Carrie has a better shrinking device then she does, hopefully Carrie wouldn't hold a grudge about the whole swallowing her thing. Piper was distracted from her musing as she felt gravity lurch, at first she just thought Mary must be getting up from her seat but then she felt herself tumbled all around Mary's intestines, what the heck was the predatory girl doing out there? Then the rapid lurching settled down, as Piper tried to get her bearings she heard a sound like an electric lighter and suddenly Mary's intestine began to close in around her, like it was shrinking, but then Piper then Piper felt a weird sensation and blacked out for a second. When Piper came to she realized that Mary's intestine looked like it was back to being the size that it had been, but also she had felt a similar sensation to the one she'd felt when Mary had shrunk her. It didn't take long for Piper to put two and two together, Mary must've also been shrunk and Piper had been shrunk even smaller inside her just like Carrie had been earlier. As Piper came to this realization the world lurched again and Piper was once more tumbled throughout Mary's intestines, it was hard to hear or see much while being shaken around like she was but Piper thought she could hear Mary yelling. When once again the world settled down Piper realized there another thing she could hear now, not only could she hear the sounds of Mary's body but she could also hear another set of even louder but otherwise similar sounds. Piper took a second to consider the ridiculousness of being swallowed and then having her predator suffer the same fate, and then she realized that it only got more ridiculous when considering the pair of even smaller girls that she'd swallowed. It was then that Mary realized she couldn't feel the shrunken sisters traveling inside her anymore, but she realized she could feel a pressure from inside her own ass,.We'll skip the more graphic details or what happened next. Piper then found herself holding both Lanie and Carrie in her cupped hand, with the lack of lighting in Mary's intestine Piper could just see the flash of blue as Carrie used her device to unshrink the two of them, Piper had to quickly move her hand to avoid having the two grow back to her size on top of her and wound up sprawled on the \"floor\" of Mary's intestine with the two standing over her. Piper was about to get back up when she saw Carrie pointing her shrink ray at her \"How about I get payback for you eating me now\" Carrie threatened and advanced on Piper with the shrinking ray.<br>\r\n\"Wait wait wait\" Piper cried out, her mind racing trying to think of a way out of this, she had her own shrink ray but if she shrank Carrie again then she'd be pretty much back where she started. So she figured her only chance was to convince Carrie that things were bad enough already that she shouldn't be worried about taking revenge right now. \"We're all still inside Mary and Mary got swallowed by someone else! Please at least wait until we're all out of this mess and then we can settle things.\" Carrie hesitated for a second and exchanged a quick glance with Laney, and then...</span></div></div>",
            "created":1582779600,
            "id":2794043,
            "title":"A strange sensation. (Mary has become someone..."
        },
        "11121111122":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "they knew Mary was the most dangerous student at school, betray her now",
                "they set off to escape yet another digestive tract"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, have it your way\" Carrie said as she lifted her shrink ray away from Piper who sighed in relief. A silence settled over the three girls, interrupted only by the various bodily noises of Mary's digestive tract.<br>\r\n\"Okay\" Laney stepped forward to break the tension \"Well, crawling our way out of Piper wasn't pleasant but now we know that that's definitely a thing we can do, so lets all get out of Mary, then we can all get out of whoever Mary's managed to get herself swallowed by.\" Piper and Carrie both nodded and the three girls set off to finish the trek through Mary. Luckily during all the commotion of Mary being swallowed Piper had tumbled close towards the end of Mary's intestines which meant that their trip was much shorter than it could've been. After several uneventful minutes of the trio walking in silence they reached the final sphincter that would release them, well release them from Mary anyway, Piper gave an involuntary sigh of exasperation when she remembered that they'd have to make this trek at least one more time, at least she hadn't had to make an earlier trek like the sisters had. The girls quickly discovered that while none of them were strong enough to push their way out of Mary's ass all three of them working together managed to force their way through, however disgusting the process was. When the girls forced themselves out they all tumbled in a tangle of arms and legs into a disgusting mass of fabric that they soon realized was Mary's panties which had been soaked through by the stomach juices of whoever Mary was inside of. Just as the girls came to this realization Mary pulled open her waistband and her massive, pale hand scooped Piper, Laney, and Carrie up in one smooth motion. Mary brought the shrunken trio up to her face \"What have you clowns been doing inside of me!?! If you hadn't distracted me then I wouldn't be in this mess.\"<br>\r\n\"Well excuse me bitch for not wanting to sit around and get digested.\" Laney yelled back at her. \"Who did you even manage to get swallowed by? I guess you're not as great at this as you thought you were.\"<br>\r\n\"Oh shut up\" Mary was visibly furious \"The stupid intro to shrinking teacher caught me trying to swipe her shrink ray.\" Mary huffed almost like a sulking child \"I only got caught because whatever you idiots were doing in my stomach kept distracting me.\"<br>\r\n\"Why would you think it's smart to risk being swallowed to get a shinier shrinking ray when you already have a better one than the other students?\" Piper asked incredulously.<br>\r\n\"Oh don't act like you can judge me, I knew you were an idiot from the moment I saw you pretending to be a big girl as soon as you got your hands on that dinky little tier zero. For your information the teachers' guns can more accurately choose what size you shrink someone to and can also grow someone bigger than normal.\" Mary seemed to take some satisfaction in how that news seemed to shock Piper and Laney, although Carrie seemed to have already known that. \"Now then, I need you to tell me how the hell you got out of my gut, unless you want to digest in here.\"<br>\r\n\"Yeah, we'd love to show you the way out, but not at this size\" Piper shouted up at Mary.<br>\r\n\"You're perfectly able to guide me out at that size\" Mary was frustrated by her lack of control of the situation and it showed on her face.<br>\r\n\"You're not in a great position to negotiate here, you might not think highly of us but we aren't gonna lead you out of this just for you to swallow us again.\"<br>\r\n\"Fine, just... fine.\" Mary released her grip on the three and Carrie was able to grow them with her shrink ray, they didn't have room to reach their full size in the stomach of whatever teacher they were in but it was a relief not to be bite sized for Mary anymore. \"Now then\" Mary began \"Lets all get out of this mess.\" Piper, Carrie and Laney all exchanged a silent look and...</span></div></div>",
            "created":1582866000,
            "id":2794160,
            "title":"Carrie agrees not to take revenge until they"
        },
        "1112112":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Keep Carrie, maybe as a pet, maybe as a snack for later",
                "Let Carrie go, although she didn't have a way to unshrink her"
            ],
            "content":"<div class=\"\"><div> <span>Piper reached into her mouth and pulled out her little victim \"It's all right, I don't really want to eat you right now, I just couldn't wait to get my first taste of a tiny.\" Carrie was still soaked in Piper's saliva but was visibly relived to hear that she wasn't going to be eaten.<br>\r\n\"So then... will you let me go?\" Piper thought for a second, she could let Carrie go, but then she'd need to catch a new tiny the next time she felt like tasting one or when she actually got hungry. After deliberating for a second Piper decided to...</span></div></div>",
            "created":1582779600,
            "id":2794044,
            "title":"I'm done, I just wanted to feel you in my m..."
        },
        "11121121":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "between her boobs",
                "into her panties"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh I'm not that wasteful, I might get hungry in a bit, although if you're good I might just keep you. Wouldn't you like that? To be my little pet, you'd be taken care of and wouldn't have to worry about anything anymore\" Piper cooed to Carrie who struggled and shrieked in Piper's grip but she had no hope of breaking free from Piper's grip. Piper's smile broadened \"Now I just need somewhere to keep you, where do you think would be a good spot... how about here?\" Piper lowered Carrie down to her breasts and pushed the shrunken girl against them \"I bet you'd be really warm if I kept you there, and I could feel you wriggle, although...\" Piper lowered Carrie even further, with her free hand Piper pulled open the waist band of her skirt and dangled Carrie over her open panties \"It would be really warm in there, and I bet you'd feel great wriggling down there, although maybe you'd feel a bit too good. Well then, what do you think?\" Piper didn't give Carrie a chance to answer before shoving her new toy...</span></div></div>",
            "created":1583125200,
            "id":2795511,
            "title":"Keep Carrie, maybe as a pet, maybe as a snack f..."
        },
        "111211211":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "continued down and out of the building",
                "turned and walked back to her room"
            ],
            "content":"<div class=\"\"><div> <span>Piper stuffed Carrie down the neckline of her shirt and into her cleavage, she took a second to settle her little captive between her breasts before happily setting off. Piper walked to the stairs and began walking down, she was very aware of how Carrie squirmed with every step she took and Piper couldn't help but smile with the knowledge. Piper was practically high on the feeling of control, she had one of the first ray guns that'd been released into the wild of the campus and had already gotten her first victim. As Piper walked down the stairs she came to the second floor landing, she could keep going down and out of the dorms to do whatever she wanted in the time she had left before her first class. Alternatively, Piper could go back to her room and have some real fun with her little shrinkee. After a moment's indecision Piper...</span></div></div>",
            "created":1584367860,
            "id":2802307,
            "title":"between her boobs"
        },
        "1112112112":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "invited Gwen to join in the fun",
                "the shrink ray in the other, two tinies are better than one"
            ],
            "content":"<div class=\"\"><div> <span>Piper stepped into the floor two hall and strode down to her room, she casually unlocked and entered the room. Stepping inside Piper saw that Gwen was going over her school supplies, Piper nodded to her and Gwen smiled and nodded back. Piper walked over to her bed and fished Carrie out of her cleavage, then an idea crossed Piper's mind. Piper glanced over her shoulder at her roommate who seemed to have gotten her supplies sorted. Piper turned towards Gwen with little Carrie in one hand and...</span></div></div>",
            "created":1584368100,
            "id":2802309,
            "title":"turned and walked back to her room"
        },
        "11121122":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "Go find Gwen",
                "Catch up with little Carrie"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm, I've got this now\" Piper brandished her shrink ray and Carrie flinched despite having already been shrunk \" if I ever need a shrunken snack I can get one pretty easily, I can let you go, have fun running around at that size, I bet you don't last a day.\" Piper laughed at her own last remark as she bent over and set the shrunken brunette on the ground. Carrie stood dazed on the floor for a second before racing off towards the stairs, Piper shook her head and wondered if Carrie would even make it down the stairs at her size. Piper considered what to do next, she had some time before class, she could go meet up with Gwen, maybe show off her shrink ray to the blonde, the thought of how Gwen would taste shrunken also crossed Piper's mind. She could also follow the adventures of shrunken Carrie, Piper had been dismissive of letting her first victim get away but not that she thought about it, it might be interesting to see what happens to a tiny once released into the wild, maybe she'd need to do more of that in the future. After a moment of consideration Piper went to...</span></div></div>",
            "created":1582866000,
            "id":2794162,
            "title":"Let Carrie go, although she didn't have a w..."
        },
        "11122":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "RUN",
                "go talk to Mary"
            ],
            "content":"<div class=\"\"><div> <span>Piper stopped, there was no way this was going to be that easy. Mary had already claimed several victims and Piper had no intention of joining the others in her stomach. Piper turned back and started to head towards the staircase, when she heard a shriek and a loud electric crackling noise. Spinning around Piper saw the dark haired girl Mary standing in the open doorway to her room, in one hand Mary was holding the grey shrinking gun, and in the other she was holding a shrunken and struggling Carrie. Mary looked up from her victim in her hand and made eye contact with Piper, and Mary smiled. Piper stood frozen like a deer in headlights, transfixed watching as Mary raised Carrie up to her open mouth. Piper could barely hear the shrunken girl's cries as Mary's lips enveloped Carrie and slurped her in, when Mary swallowed Piper watched the struggling bulge that had just recently been a college student slip down Mary's neck. Piper was jolted out of her trance when Mary called out to her \"I can tell you enjoyed the show, if you come over here I'll let you listen to her struggle inside me.\" Piper couldn't believe what she was hearing, then again she'd been planning to go nuts with the shrink ray herself if she could have gotten her hands on it... But being around Mary was already undoubtedly dangerous, being around her any longer than she needed to be could be just asking to be eaten. Piper knew she didn't have much time with Mary smiling at her and...</span></div></div>",
            "created":1582693200,
            "id":2793323,
            "title":"This is a really bad idea, let's turn back...."
        },
        "111221":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Steph decides to eat Piper",
                "Piper becomes friends with Steph"
            ],
            "content":"<div class=\"\"><div> <span>With a loud crash, Piper ran away from Mary and the shrinking ray until she reached the central dining hall... Where a large Asian female called Stephanie Tsunade was hogging the buffet table, Piper would watch as Stephanie Tsunade reached for a nearby black forest cake and started chowing down on it gluttonously. Stephanie Tsunade had pale and olive skin, dark black hair in a plaited ponytail, a rather pudgy body and large brown eyes, with a large nose. <br>\r\n<br>\r\nPiper could also hear that Steph seemed occupied with the food, until Steph met eye to eye with Piper.<br>\r\n\"Hungry,\" Steph stated, \"Need more food...\"</span></div></div>",
            "created":1582866000,
            "id":2794236,
            "title":"Run into Stephanie Tsunade"
        },
        "111222":{
            "author_id":"yarglebargle",
            "author_name":"Billis",
            "choices":[
                "take Mary's offer",
                "out! Get out now!"
            ],
            "content":"<div class=\"\"><div> <span>This was crazy, this girl was clearly dangerous, so then why, Piper thought to herself, was she walking towards Mary. Piper walked up to Mary, this was the first real good look she'd gotten at the predatory student, she looked like she was a bit older than Piper was but she couldn't tell how much, she was definitely taller than Piper, Mary had pale skin but her clothing was all black and skin tight. Mary smiled down at Piper and smiled \"That's right, come here, I won't bite... I prefer to feel my prey struggling inside me.\" Piper hesitated but Mary stepped forward \"Do you want to hear her struggling inside me?\" Mary didn't really give Piper time to respond as she reached out and put a hand on Piper's shoulder. Mary's grip was strong and she guided Piper down and pulled her head forward, pressing Piper's head towards Mary's belly, with her other hand Mary pulled up her shirt so that she could press Piper's ear to her warm, bare, stomach. Piper realized that just like that she'd been brought to her knees, but her attention was drawn to the tiny screams she could hear from inside Mary's stomach, Piper could even feel a little bit of Carrie kicking and punching the inside of Mary's stomach in a fruitless attempt to escape. \"I don't know what she's so upset about\" Mary cooed down to Piper \"she wanted to be with her little sister again, she should be thanking me for organizing such a nice reunion.\" Then Mary reached down with her fingers and turned Piper's face to look up into hers. \"I know why you came here, you wanted this\" In her other hand Mary held up the grey shrink ray \"now it just so happens that I have a shiny new one and don't need this old thing anymore. Now, I saw that predatory glint in your eyes, but at that important moment you walked away instead of going for your chance. Now, I've been thinking of getting a group together, and I think you might be able to be part of that, but I need you to prove that your little moment of weakness there was a one time thing. If you prove that you'll be more reliable, a real predator, well then, maybe I could let you have my spare. I just need you to do one thing to prove it, what do you say?\"</span></div></div>",
            "created":1582866000,
            "id":2794154,
            "title":"go talk to Mary"
        },
        "1112222":{
            "author_id":"jerectamalic",
            "author_name":"Jerec",
            "choices":[
                "Talks to the girls, they'll need to stick together.",
                "Decides to leave on her own, abandoning them."
            ],
            "content":"<div class=\"\"><div> <span>Piper struggles out of Mary's grip and rushes away from the psychopathic power seeker. Unfortunately, the one and only chance Mary gave her is up. Piper is struck by a bolt of energy, collapsing to the floor and finding the world a much bigger place. The ground quakes as Mary walks over and gently picks up her prize. About the only thing gentle about this Mary character. \"Well, you had your chance. You can join my prisoners, feel free to chat among yourselves as the fat on my boobs. Hmm... Though, I have to say, you look more like a butt girl. Either way, be glad that you're going to make part of me better.\" She says with a smirk. \"Down the hatch.\" <br>\r\n<br>\r\nMary holds Piper above her mouth, the maw gaping wide. Piper can see every detail, from the soft, shiny flesh to the polished marble boulders that are her teeth. The dangling uvula flexing up and down, the tongue wriggling in anticipation. \"Ahhh.\" Mary taunts, her tongue flattening and allowing Piper to gaze down her throat. She could swear she could hear the screams and shouts of the other girls, and now she is going to join them. Mary relaxes her grip and Piper plummets, falling into the woman's maw. She's battered as the tongue assaults her, getting her flavor as much as possible. Light shines in as the maw opens again, Piper greeted by the odd appearance of a smile from inside the mouth. \"Goodbye.\" She hears Mary say, the girl's voice echoing around her. The tongue tilts up, sliding Piper to the back of her mouth, then she hears the most terrifying sound. Glurk!<br>\r\n<br>\r\nDown the throat Piper is slowly propelled, guided by the peristalses from the muscular esophagus. She plops into the stomach, falling into a shallow lake of acid. She sees the two other girls who are also trapped, hitting and kicking one of the walls, desperate to cause some form of stomach discomfort. A slight burp echoes above them. \"Keep up the massage girls, it feels really good. It's almost too bad you'll be digested.\" Mary hums smugly from the outside, patting her belly.<br>\r\n<br>\r\nPiper looks around, seeing the two girls still desperately attacking the wall, then on the opposite side of the stomach the way further. Piper...</span></div></div>",
            "created":1582866000,
            "id":2794471,
            "title":"A familiar situation, with a twist."
        }
    },
    "info":{
        "author_id":"superkirby2",
        "author_name":"SuperKirby2",
        "brief_description":"At an all-girl college, avoid being shrunk and eaten by your classmates.",
        "created":1582679820,
        "description":"<td align=\"left\" class=\"norm\">You are Piper Frost, a 19-year-old young woman attending Macro University, an all-female college known for inventing a special device that can change the size of any life-form. Girls at Macro University often use this technology to shrink their classmates and swallow them whole. The popular claim is that this is done “for science”, but you have your suspicions about whether being swallowed is survivable...<br>\r\n<br>\r\nHere are the rules:<br>\r\n<br>\r\n1. Male characters are allowed, but only females can be preds.<br>\r\n<br>\r\n2. No same-size vore, hard vore, or gore. Digestion, discomfort, and unwillingness are fair game.<br>\r\n<br>\r\n3. The setting must remain on university grounds. However, characters may visit from off campus.<br>\r\n<br>\r\n4. Survival should be possible for any character, but still somewhat challenging.<br>\r\n<br>\r\n5. Piper can swallow tiny people or be shrunken and swallowed, depending on the situation.<br>\r\n<br>\r\n6. Here is a map of the Macro University campus. Feel free to add new locations if you want.<br>\r\n<br>\r\n_____________________<br>\r\n|,,,,,,,,,|,,,,,,,,,,,,,,,|,,,,,,,,,,,|<br>\r\n|,,,7,,,|,,,,,,,6,,,,,,|,,,,4,,,,,,|<br>\r\n|____|_ _______| ______|<br>\r\n|,,,,,,,|,,,,,,,8,,,,,,|,,,,,3,,,|<br>\r\n|,,,5,,|,,,,,,__,,,,,|_______|<br>\r\n|____|___|_1_|__|__2____|<br>\r\n<br>\r\n1: Ceremony Hall<br>\r\n2: Central Dining Hall (Buffet-Style)<br>\r\n3: Dormitories<br>\r\n4: Recreation Centers (Gyms, Pools, Et Cetera)<br>\r\n5: On-Campus Lake and Park Areas<br>\r\n6: Academic Complex (Classrooms)<br>\r\n7: Science/Research Department Buildings (Very dangerous)<br>\r\n8: General/Other Areas<br>\r\n<br>\r\nI think that covers everything, but if any changes are needed, this list of rules will be edited.<br>\r\n<br>\r\nThanks to CelestialMirror for thinking up the idea behind this interactive!</td>",
        "id":2214054,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1596422340,
        "modified":1596422340,
        "pretty_title":"Macro University"
    }
}