{
    "chapters":{
        "1":{
            "author_id":"switch1",
            "author_name":"switch1",
            "choices":[
                "Father in the Kitchen - with shrink ray",
                "Father in the Kitchen - just chatting",
                "Younger Brother Roland (18 years old) in living room",
                "Younger Brother Liam (13 years old) in Kitchen",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n“Alriiiight.” Jonathan’s brow is furrowed as he stares at his iPad screen, double-checking the information entered into the cabin reservation registry on the bright, white website. <br>\r\n<br>\r\n*Click*<br>\r\n<br>\r\nWith the press of his index finger on the iPad’s built in finger-print reader, the reservation was confirmed, and the funds scheduled to pull from Johnathan’s account the next day. He had been mulling over the chance to finally go out to the “Wild West” and experience the snow-capped mountains that separate the rest of the country from the Pacific Coast ever since he graduated. And graduated he did, just a month ago from an adequately well-known and respected university with a double major degree in bio-engineering and chemistry. <br>\r\n<br>\r\nLaughable really. What on Earth would he do with a double major in bio-engineering and chemistry? <br>\r\n<br>\r\n“Make me proud, he said. You’ll be just like me, he said.” Two smooth hands come up and cover the twenty-two-year old’s face as he rubs his eyes and shakes his head questioning the past four years he spent in school working for the education needed for job a that would make his father happy. He had hoped that some passion would bloom inside of him of the same desires. <br>\r\n<br>\r\nSure, he loved science. Johnathan spent his childhood sifting through the dirt in the backyard, studying the critters he found. On Tuesdays his class would line up to go to the library where he would check out a book about dinosaurs, space, or geography. On clear Saturday nights in late May he would stare up at the sky in wonderment and curiosity, dreaming of one day shooting through the stars and traveling to worlds beyond. So sure, Johnathan had a passion for science, but perhaps not a passion to live, breath, and be science. <br>\r\n<br>\r\nHis father on the other hand was a revered scientific gentleman in his field of nanotechnology and medicine. His knowledge and understanding of the concepts of the microscopic world and the human body combined into an engine of energy for which he used to pursue progressive studies. Most of them were for medical purposes such as the development of nanomedical procedures using microscopic robots to maneuver through the human body passageways performing roles beyond human capability. Amazing really. Perhaps not as amazing or as captivating as the studies held behind the wooden door to his home “office” emblazoned with a door plate reading: Dr. Otis Nebre. <br>\r\n<br>\r\nOf course, these descriptions of the secrets of the office were only given by Dr. Nebre himself, as no one else had been into that realm of the home. This obsession to build and create was exacerbated by the death of his wife five years ago, and the boys never again saw the father they had known from their early childhood. Johnathan’s brother Roland felt the brunt of that change, being held back the year following the tragic incident. Now eighteen years old, the teenager would also be celebrating a graduation had things not taken such a turn. <br>\r\n<br>\r\nLiving back at home was meant to be a temporary situation for Johnathan as he job-searched and got himself situated. He had landed an interview with a research company located on the East Coast after seeming to do well with an initial phone call. Things had changed while he was away at school, and in a strange way. For one, the wooden door that once was the family den was now locked as securely as possible, including the use of a numbered ID entry code. For two, Johnathan had spied three miniaturized objects throughout the house, with amazingly believable accuracy in their crafting. An example would be the tic tac sized marina boat that resembled his father’s old ‘second love’ which he would take out on the lake in the summer. <br>\r\n<br>\r\nJohnathan laughed to himself in the moment. “Now the bathtub is the lake.” <br>\r\n<br>\r\nLittle did he know that this was, in fact, that same lux boat that he would spend breezy afternoons on reading his science books as his family fished. The only difference was that it was now…SHRUNK. <br>\r\n<br>\r\nA specified ringtone goes off on his matching iPhone notifying him of an incoming email. Unlocking his phone with his thumb, the skinny, charming, brunette taps the square Gmail icon and finds the cabin confirmation he was expecting. He was finally free. <br>\r\n<br>\r\nHis daydreaming of road-tripping to Wyoming is interrupted by the sound of a bedroom door at the other end of the hall shutting loudly. It’s nine in the morning and his father is awake, clambering down the chilly stairs to brew some strong, black coffee. Johnathan has told no soul about this upcoming trip that is just four days away and he winces knowing that eventually he will have to confess he is leaving to find himself. His iPad clicks as the screen goes dark in lock-mode, he throws on some grey sweat shorts, and with a yawn formed from both tiredness and anxiety he opens his bedroom door.<br>\r\n<br>\r\nHe heads downstairs to visit with:<br>\r\n</span></div></div>",
            "created":1526366280,
            "id":2493369,
            "title":"Planning a Trip"
        },
        "12":{
            "author_id":"switch1",
            "author_name":"switch1",
            "choices":[
                "Father shrinks Johnathan to 2 inches tall",
                "Father shrinks Johnathan to 1 inch tall",
                "Father shrinks Johnathan to 1/2 inch tall ",
                "Father shrinks Johnathan to 1 millimeter tall",
                "More discussing, no shrinking"
            ],
            "content":"<div class=\"\"><div> <span>The smell of carpet cleaner meets Johnathan's nose as he steps out of his makeshift bedroom, gripping his iPhone as he types out a text message with his thumb. His words come out jumbled as the warm digit makes contact with multiple letters on the smartphone keyboard. His father was a sporadic clean freak and yesterday his mission was to clean the upstairs carpet...at least the hallway carpet. Johnathan's feet lightly thud on the soft, fibrous, tan flooring as he makes his way to the top of the stairs. The steps creak slightly, but not enough to wake his brother Roland nor to disrupt his father who was likely getting himself into a fight with the coffee maker. The lack of a coffee smell in the air suggested that his father had found himself distracted in some manner. <br>\r\n<br>\r\nAs the carpet ended and hardwood floor began at the landing of the stairway, Johnathan contemplated how he was going to bring up his trip to his sometimes aloof and intense father. It was in this moment that he heard a plastic clank come from the kitchen followed by his father's groggy cursing. Now was probably not the time for discussion of such wild west adventures, but if not now, then when?<br>\r\n<br>\r\nBeing away at college had allowed Johnathan to forget and escape some of the quirks of living at home, such as the sight of his father in plaid blue boxers and a plain white short-sleeved button up shirt missing all its buttons swaying with the middle-aged man as he moves across the kitchen. Otis, of course, didn't notice his son approaching the kitchen. Johnathan rolls his eyes at the spill of coffee grounds scattered all over the counter, his father half-haphazardly wiping this way and that, his moderately hairy beer belly sliding against the light granite. His face was tired, but firm and smooth. Wrinkles formed on the sides of his eyes from all the goofy smiling through the years past. His hair had begun to grey, both the considerable mop on his head and the fuzz covering his face. His wise hands work their way through the simplest of tasks as he reaches for the bag of dark coffee beans and scoops four table spoons into the grinder. Placing the lid on top he presses the button and holds as the machine screams and devours the beans until they are the dust of black gold he will soon be drinking. <br>\r\n<br>\r\nJohnathan takes this as his entry opportunity, rubbing his eyes purposely and making his way onto the shiny kitchen tile. His bare feet immediately register the chill of the slightly textured material beneath them and he awkwardly slides up to the island bar taking a seat on a black bar stool. He uses both thumbs to send out another text and then checks his bank app to view his funds. All there!<br>\r\n<br>\r\n\"There he is...\" Otis grumbles as he dumps the fresh coffee grounds into the reusable filter of his coffee maker. Water already filled the tank from his first attempt this morning at quenching his caffeine thirst. <br>\r\n<br>\r\n\"So, how's it feel being home, smart guy? Best in your class is what they said yesterday, right?\" Dr. Nebre taps the counter in anticipation of his cup o' Joe. <br>\r\n<br>\r\n\"No...Dad. That was a month ago. I had a 3.99 GPA. Still great, but not the best. Why are you so out of it lately?\" Johnathan squints his eyes making a face in the form of \"seriously\" towards his old man. <br>\r\n<br>\r\n\"I've been incredibly busy in my workshop, John. Look at me. Clearly, I'm a little bit of a mess, but the progress I'm making is fantastic. No one has done the things I have, but there is still so much to accomplish. I mean, nanotechnology is the future and all, yet so many are still so blind about this vision that could change the world.\" The greying, beer-bellied, toned forty-eight year old pours his coffee into a blue, polka dotted mug, bringing it up to his nose to breath in the awakening fumes. <br>\r\n<br>\r\n\"Speaking of which, I'm leaving in about an hour for a convention in Cleveland. It's last minute and I would've told you but I forgot. I'm glad you're here for the next two weeks though because your brother could use the company.\" He finally takes a sip of the steaming hot coffee.<br>\r\n<br>\r\n\"Welllll, actually I need to tell you something...I just reserved myself a cabin in the mountains in Wyoming. I leave in four days. I wanted to tell you and Roland, but I need to get out and think, breathe some, find myself.\" Johnathan holds his breath as his father just stares at him with no words. <br>\r\n<br>\r\n\"You're gonna have to cancel, son. Roland really needs you around right now and I have to leave for this business trip. You're home for a reason, he needs the time around someone who will hopefully motivate him again.\" The blue coffee mug continues steaming as his father shrugs. <br>\r\n<br>\r\n\"I can't cancel! I've saved up years for this. He's freakin' eighteen years old and can take care of himself. I don't care how down he is, I need this break to breathe. All I've done for the last four years is work at something that you want and not me!\"  The words were out before Johnathan could stop himself and he's sure the words were scarring for his father. Nevertheless, Dr. Nebre finished his coffee, rinsed out his mug, and crossed his arms. <br>\r\n<br>\r\n\"I've been working on a shrink ray. You know, a device that miniaturizes objects. It works, and it works well. I will be leaving in thirty minutes to a convention where I will showcase my abilities. While no actual demonstrations will be held, the actual device is just ten feet from you in that very workshop. You should be proud that you are even in the same house as it. As for Roland, I've made him my sort of assistant. He's been motivated and attempting to find himself. The room will of course be locked while I'm gone, but he will be able to tell you all about it. Cancel your trip. I need you to do this for me and your brother.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1526450760,
            "id":2493859,
            "title":"Father in the Kitchen - just chatting"
        },
        "121":{
            "author_id":"bejjinks",
            "author_name":"bejjinks",
            "choices":[
                "Jonathan climbs the seat",
                "They arrive at the hotel",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Just then, Otis gets a phone call. You only hear his end. \"What? . . . But we agreed. . . Yea alright.\" He hangs up the phone and walks past Jonathan to get something. He comes back and shrinks Jonathan to two inches.<br>\r\n<br>\r\nOtis says, \"Sorry son but they just called and said they need a demonstration after all. I don't have time to arrange any demonstration so you'll have to be it.\"<br>\r\n<br>\r\nHe grabs Jonathan and lifts him close to his face. \"What's that, I can barely hear you.\"<br>\r\n<br>\r\nJonathan screams about going on his trip to the mountains.<br>\r\n<br>\r\nOtis says, \"That might work into the plans.\" He walks to Jonathan's room where the mountain climbing gear is packed and ready to go. He shrinks it to match Jonathan's size. Before long, Jonathan finds himself in the passenger seat of the car with his camping gear as they head down the road to the convention.</span></div></div>",
            "created":1536049020,
            "id":2542617,
            "title":"Father shrinks Johnathan to 2 inches tall"
        },
        "125":{
            "author_id":"switch1",
            "author_name":"switch1",
            "choices":[
                "Car is shrunk to 4 inches long (Johnathan inside)",
                "Car is shrunk to 2 inches long (Johnathan inside)",
                "Car is shrunk to 2.5 millimeters long (Johnathan inside)"
            ],
            "content":"<div class=\"\"><div> <span>Johnathan watched as his now properly dressed father rolled his navy-blue suitcase to the front door over the hardwood floor. He couldn't stop thinking about the insanity his father had mentioned earlier in the form of a \"shrink ray.\" The college grad was convinced that his father was just bluffing for some reason, there had been mishaps in his inventions in the past and this was surely just another example of a talked-up failure. He turns towards the steps as he sees his father coming down the steps followed by his brother Roland.<br>\r\n<br>\r\nClearly having just woken up, Roland looked messy, his medium length blonde locks falling in pieces all over his head, his bangs swayed to the right. A former member of the school soccer team, Roland is in decent shape. His toned shoulders and pecs hug the white t-shirt that he is wearing, a hole located near his navel exposes the light fuzz of the blonde hairs that turn into darker, thicker brown hairs of the treasure trail. At 5 foot 9 he would be considered quite the catch, but his mood swings and depression make him more of an outcast. Add the fact that he quit the team, the only thing really going for him in life, and it can be understood why he is such a piece of work. His black gym shorts ride half way up his thighs which are tanned and toned from all the running and training. He gives Johnathan a smug look as he strides like a neanderthal into the kitchen, glutes bouncing in the running shorts. A cloud of BO follows behind him and briefly shrouds Johnathan in its midst. <br>\r\n<br>\r\n\"Alright, see you later boys. Remember, John, I need you to stay here.\" Otis opens the front door and pulls his suitcase with him turning around to shut the door behind him. A belch resonates from the kitchen as Roland fixes himself a piece of toast, pushing it into the toaster. His heavy steps slap on the tile floor as he make his way to the foyer where Johnathan is still standing. <br>\r\n<br>\r\n\"You know, I heard what you said earlier. How I'm going to keep you from your fucking trip to the mountains. Why'd you even come home? You know what it's like to live here with dad all by myself, in his shadow, and in your fucking shadow? No, you don't. So I don't give a shit if you go, but don't come back acting like this is your home and it's all about you. You don't know who you're messing with anymore.\" <br>\r\n<br>\r\n\"Oh please, stop with the boohoo shit Roland. You're not the only one around here who lost their mother and basically their father too. Stop giving me that. Why don't you try for once? Like, soccer. What happened with that? It's basically all you had going for you!\" Johnathan lets loose at his younger brother, their first sibling fight since being home. <br>\r\n<br>\r\n\"Because I didn't fucking feel like it anymore! I don't care about anything anymore. Why don't you just get out of here before you regret it.\" Roland's face is flushed red, his eyes red, fist clinched, but as Johnathan braces for more he watches as Roland gathers himself, bringing himself into a composed state, even attempting a grin. <br>\r\n<br>\r\n\"Been a while since we did that you know...a shouting match. When was that, Christmas? I'm sorry for losing my cool for a sec there Johnny. How about we hang today? Do something fun? I know you want to get out for a minute for some food, after that.\" Roland rubs his belly as if in symbolism of food. <br>\r\n<br>\r\n\"Yea, craziness, right? I'm sorry too. You've have a lot going on here, with dad being off the rocker a little bit and all. Not to mention all the brilliance. Text me your order and I'll grab you something to eat too. You can tell me about the project you've been helping Dad with...sounds INSANE. Ha!\" Johnathan slides his shoes on and play punches his slightly shorter brother in the toned arm before grabbing his car keys and walking out to his grey 2014 Ford Focus. Nothin' too special, but it gets him places. <br>\r\n<br>\r\n\"SO INSANE, Ha! Imma grab my phone and send you my order!\" Roland shouts from the front door as he rushes back inside to grab his phone. Or that's what he wants Johnathan to think.<br>\r\n<br>\r\nThe thing with Johnathan is that he is very predictable and a creature of habit. So Roland knows that his brother will sit in his car and fiddle with the radio until just the right song for the mood is on. He will check his reflection in the mirror, may even wipe down everything with a Lysol wipe as his car sits there in idle mode for a good five minutes giving Roland plenty of time to walk to Dr. Nebre's \"office\", punch in the code that he secretly memorized, and grab the portable shrink ray from the rack where it had been charging. Setting the size at approximately 4 inches, the former soccer player walks to the front door on a mission, peaking around the corner to see his brother inside the car hooking his bluetooth device to his ear. Placing his left hand around the front of the nozzle of sorts and his right hand on the grip, Roland pulls a trigger sending a blue wave of light towards the car, engulfing it. <br>\r\n<br>\r\n\"What the hell??\" From the inside of the car all Johnathan can see is electric blue and he doesn't know what the fuck is going on...</span></div></div>",
            "created":1526451000,
            "id":2493861,
            "title":"Triggered"
        },
        "1251":{
            "author_id":"switch1",
            "author_name":"switch1",
            "choices":[
                "Roland Shrinks the Car to 4 inches long"
            ],
            "content":"<div class=\"\"><div> <span>He remembers it like yesterday, the first time that he witnessed the technology in action. It was the fifth time that he had been allowed to enter the workshop which consisted of two computers set up around a middle island with a typical looking gun-device sitting in a rack on top. It’s a shiny silver color with a lime green strip slithering down the side of the tubal firing portion of the device that is shaped in a cylindrical manner. The device charges while in the port that is embedded into the rack, and, like everything else these days, is portable so you can have it on the go. In front of the island is an open elevator-like platform that raises up and down in a vertical manner. There is nothing special about it besides the fact that it looks like it has been recycled out of other metal objects before it: steel beams and a flat, patterned plane of sorts that is in the shape of a square that holds whatever is the subject of the shrinking. The juts rising out of the square resemble that of a tire, just more spread out and, of course, metal, not rubber. Nearly a knock off version of the shrink ray in that one movie, except much more modern and sleeker in appearance…and dad doesn’t eat cereal. <br>\r\n<br>\r\nRoland had left the workshop the first time feeling “shook” as the room used to have a much different purpose as their family den. While part of the space had indeed transformed into a lab of sorts, beyond the island and computers rested a living room set-up that appeared to have not been touched since the accident took their mother. It was a lot for a teen of seventeen to relive those memories for the first time, and in such a manner that was ready to take charge and write over them in the form of his father’s lab and his apprenticeship. This was not the family den any longer. Ugly goldenrod walls and mismatched furniture attempted to bring the room together; the charm brought the family together. Those nights watching shows late into the twilight or battling it out on Smash Bros, which even his mom would play, were now ghosts left behind. Now, he just apathetically watched on as his father gestured through his lecture and demonstration of the technology, painting a façade of awe and intrigue on his face for the old loon. <br>\r\n<br>\r\nWith the lighting up of the device and the gentle hum of the vents, that put-on began to melt into true interest and a fire of motivation began to burn inside of Roland. Perhaps this was something he could get into. Instead of his father focusing on Johnathan, the intent of passing on bounds of intellect and success, even some quirkiness, had finally been positioned on him. His father Otis moved around with purpose, typing in this, moving around that, positioning a glass vase onto the metal platform carefully. The idea was to try the miniaturization process with a fragile material first and gain understanding of the limits of the energy force he had developed, providing insights into how he could implement improvements in the technology. <br>\r\n<br>\r\n“Alright, son. I, am going, to shrink, this vase…but to what size?” Otis spoke in a rhythm layered with excitement and confidence at the experiment that was about to transpire. <br>\r\n<br>\r\n“Uhh. OH?! Are you asking me to decide?” Roland crossed his arms as if enclosing himself and hiding his insecurity and unsureness from this father. <br>\r\n<br>\r\n“Well, yea. Come look at this panel on the computer. You can adjust the size settings on here. There are some pre-set sizes, but the scale also runs in a continuous manner, meaning something technically can be shrunk to 1.546798 inches.” Otis runs his finger along the touch screen moving the scale arrow along different measurements. Roland’s eyes are nearly bulging out of their sockets. <br>\r\n<br>\r\n“Roland, relax. It’s just a cheap, floral vase. No biggie.” The man stares promisingly at his son. <br>\r\n<br>\r\n“Well, don’t we need some sort of shield in case it back-fires, and the vase explodes, sending glass shards flying at us??” Roland questions in complete seriousness. <br>\r\n<br>\r\nOtis rolls his eyes as he moves the scale down to seven inches in height, hovering his finger over the “Submit and Commence” key on the screen. He looks back at Roland for a final answer.<br>\r\n<br>\r\n“Ok, let’s try three inches instead? I have a dollar in my wallet that we can measure it up to afterwards.” Roland approaches the screen as Otis steps aside. He runs his smooth fingertip over the scale to three inches and winces as he submits the shrinking request which is verified by a short jingle of sound. <br>\r\n<br>\r\nDr. Nebre hurriedly moves and places the blue and white vase onto the platform as the hum of the invention begins to purr. The device itself begins to glow along the lime green lines and a stereotypical countdown begins on the computer screen with thirty seconds to go until showtime. The father stands next to his son in anticipation, Roland is more anxious than anything as an annoying robot voice counts down the time. “Five, four, three, two, one...Stay Clear. Shrinking commenced.” This voice feature is only incorporated when the device is docked. <br>\r\n<br>\r\nThe end of the shrink ray lights up electric blue and immediately fires a beam towards the three-foot-tall glass vase. No sound is emitted when the waves hit the decorative, floral vas, nor is any heat produced from the energy. Roland’s eyes grow big in shock as he watches the vase diminish in size right before him. He questioned the physics of what was taking place, but he knew he wouldn’t truly understand the science anyways, so he kept the curiosities to himself. Within just tens of seconds the beam retreats and the glowing of the device fades. The computer voice gives the ALL CLEAR and with that his father places the program into safety mode, just in case. <br>\r\n<br>\r\n“Well, that’s incredible son. No disruption of the glass material, it stayed intact. You have that dollar handy?” Otis had already made his way to the metal platform that sat just at high thigh height on Roland who approaches the area cautiously and nervously. <br>\r\n<br>\r\n“Yea, here you go…Oops!” *Clank* A penny drops from the teen’s pocket onto the platform, but his father waves it off and he leaves it be. He hands the dollar bill to his father whom placed one end to the surface of the metal and then stretched the bill vertically straight up. It was exactly double the height of the now three-inch vase. <br>\r\n<br>\r\n“Pretty incredible, isn’t it?” The older man beams in excitement, unable to hold back his enthusiasm. It is this fervor that leads to numerous other shrinkings with Roland present, including one where his father miniaturizes their older car to about a half an inch. Before this particular shrinking his father had been testing a capsule technology than can hold an object or perhaps even a person in it while shrunk. He measured oxygen levels inside the tic tac shaped pod and contemplated even using Roland as a test subject. <br>\r\n<br>\r\n“You know, I could shrink you down and have you get into the car and then place it into the capsule to be shrunk further down, just as a test, of course. Small enough to be injected into the bloodstream even.” Otis runs his fingers through his trimmed chin hair. He removes his pants standing in just his boxers and places his foot up on a stool. Roland observes his father’s quite toned thigh with moderate leg hair growing out of the paler skin. Otis pulls up his boxers a bit more exposing his upper thigh, taking a needle and practicing an injection into the thick muscle, searching for a vein. One of the computer monitors flashes a scene caught from a video captured through a camera attached to whatever had been implanted during the practice injection. <br>\r\n<br>\r\n“See, that could be you…journeying through my bloodstream.” Otis snickers as he catches Roland’s face, drained a bit of its color as he is clearly a bit freaked out. <br>\r\n<br>\r\n“Oh, hell no!” Roland glares at his father for the suggestion and leaves the workshop, but with more ideas than inhibitions. <br>\r\n<br>\r\n~<br>\r\n<br>\r\nThis flashback plays through Roland’s mind as he watches his brother’s Ford Focus begin to diminish in size, older brother included.<br>\r\nRoland lifted his finger immediately after it pressed down on the smooth trigger of the shrink ray. What had he just done? It’s true that he had become some sort of apprentice of his father, Dr. Nebre, but the miniaturization technology was still in its infancy and had never been used on a living being before. As with the many attempts before this one, the shrinking process lacks any sound or heat, but is incredibly bright in nature. The former soccer player glances around as he realizes he has just committed this experiment in broad daylight, but because it is only about 9:30 in the morning, most people are either at work or school. Keeping his positioning in the door frame, Roland waits for the shrinking to slow to a stop to avoid possibly entering into the beam of shrinking waves that are interacting with and transforming the car and Johnathan. The last thing he needs is to join his brother in this new miniaturized state. As the electric blue finally fades, Roland slowly steps out from the doorway and begins to make his way over to the pavement of the driveway where his brother’s car had been parked. In its place sits what looks like a very well-made model of the vehicle, except for the tiny horn going off as Roland’s barefoot lands on the slab in front of it. The foot itself is over two times the length of the sedan, toes wiggle on the hot pavement as Roland stands there trying to talk himself into picking up the shrunken car and finding out his brother’s fate.</span></div></div>",
            "created":1526713080,
            "id":2495160,
            "title":"Roland's Apprenticeship"
        },
        "12511":{
            "author_id":"switch1",
            "author_name":"switch1",
            "content":"<div class=\"\"><div> <span>Compressed…Suffocated…Paralyzed. An attempt to describe how Johnathan currently feels as he sits trapped amidst a blue haze that has surrounded his grey Ford Focus. Electric bright light reflects off the surfaces in the car highlighting everything in sight, except for anything outside of the vehicle. It was as if he were now surrounded by some sort of bubble made of out of sparks that had been dyed a neon blue raspberry color. He can’t move and feels as if he is magnetized to his seat. What confuses him is that the brightness doesn’t blind him, and the lack of a change of temperature does as well. He would expect from the scene in which he finds himself that he would feel like he’s burning in hell. And gravity? Nothing. It feels as if the car is free-floating in space. Perhaps that’s where he is, buried in a neutron star or some bull-shit universal object out in the middle of nowhere. Anything to keep him from his trip to the Rockies. <br>\r\n<br>\r\nJohnathan was relieved to feel the pressure gluing him to the driver’s seat begin to weaken, as well as the neon blue light that seemed to have formed a cocoon around his vehicle. He had no idea what the fuck was going on, nor where the strange blue energy had come from, but he had a feeling something was just not right. This was quickly confirmed for the college grad when he looked outside his windshield and saw the wooden garage door stretching up what appeared to be several hundreds of feet. The square decorative panels of the door were alone the size of small parking lots.<br>\r\n <br>\r\nOut of the driver’s side window Johnathan sees a landscape of grass with blades reaching up to what had to be six feet tall from his perspective. He imagined that walking through this grass would be similar to finding one’s way through a corn field, the stalks of the grass leaves thick and sturdy, drops of dew the size of footballs sliding to the ground. The oak tree out front stretched up to what had to be well over a thousand feet tall, rising high above into the air, seeming to reach for the sky with its bark covered arms. Individual leaves would be larger than Johnathan himself, perhaps capable of being used for the making of a tent if needed. Had he known this might be the last time in a long while he’d see the outside world he probably would have gotten out and taken in the fresh air of this massive scene. In this moment, though, he is entirely confused, not sure of how this has happened or why. <br>\r\n<br>\r\nA somewhat faint thud resonates through the vehicle from the ground below or that’s where it appears to come from as the keys in the ignition rattle slightly. Three seconds later another, more defined thud sends stronger vibrations through the car and Johnathan. About four more progressively larger and louder thuds follow, slightly shaking the car on the pavement before he glances to his right and sees a sight he never expected to see…his now towering younger brother, or at least his mid shins down to his gigantic bare feet. And huge he was. Johnathan panics and lays on the car horn hoping to call attention to himself and the car. Roland’s right foot lowers and lands to the left of the driver’s side sending a quake through the car just before his left foot lands and gives it one last rocking. Johnathan couldn’t believe his eyes, nor did he want to. How was Roland so big? Or the better question is why is he so small? <br>\r\n<br>\r\nIt felt like ages had passed and nothing had happened since Roland’s bare feet had been grounded mere inches from the car. To Johnathan the distance could more appropriately be measured in feet as the space from the front bumper to Roland’s big toe was a wide gap. The big toe itself, laying flat on the ground, rose in height to nearly hood level on the car and the toe nail was the height of the windshield pane of glass. The nail itself needed to be clipped, a slightly yellowing of the hard crust of the nail was apparent at Johnathan’s new size, but overall the rest of the nail seemed smooth. The rest of the toes were slightly lower in height as they moved away from the big toe, but each sported a toenail that was also large, tray-like in size. Stray blonde hairs grew out along the top of the foot, but they were in no way hairy, hobbit feet. The hairs appeared similar as in normal size, but more like a thin rope now that they were larger. These random hairs led to fuller growth starting at just above the ankle and running up the leg. Scared to move even a little bit in his seat, Johnathan’s line of vision stopped mid-shin where on Roland’s left leg ran a two-inch scar from an injury during a soccer game. <br>\r\n<br>\r\n“Oh shit, I am fucked. Should I drive? How will I get back to normal? The shrink ray! It couldn’t be, right? Who the fuck am I kidding, dad wasn’t lying.” Johnathan’s mind runs wild with thoughts as suddenly the light of the sun shining through the windshield is blocked out. A large thumb appears and presses against the passenger side of the car as three fingers grip the driver side making the metal frame creak. Suddenly, the car begins to lift and Johnathan closes his eyes. <br>\r\n</span></div></div>",
            "created":1526713200,
            "id":2495162,
            "title":"Roland Shrinks the Car to 4 inches long"
        },
        "14":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Liam shows Johnathan the shrink ray",
                "Liam show Johnathan the shrink ray and asks if he wants a demonstration",
                "Liam takes Johnathan to the lab and shrinks him as a prank",
                "Johnathan fools around with the shrink ray and shrinks Liam and himself",
                "Johnathan asks Liam to test the shrink ray on him for a real demonstration"
            ],
            "content":"<div class=\"\"><div> <span>In the past year or so, 13-year-old Liam had sprouted up like a garden weed, seeming to almost grow a few inches over night during some of his recent growth spurts.<br>\r\n<br>\r\nBeing away at college, Johnathan had failed to appreciate the rapidity of the changes as his youngest brother climbed into his teens. So, to the college student, his brother still looked like the gangly boy still a couple years shy of entering high school.<br>\r\n<br>\r\nHe entered the kitchen figuring he could ask Liam a few questions about the odd changes around the house. He still wanted to know more about why the family den was locked up in top-security manner, and the mystery of the tiny marina boat that Johnathan had held onto after finding it.<br>\r\n<br>\r\n<br>\r\nHe found Liam with his head in the fridge. “What’s up, squirt?” Johnathan asked, adopting an old nickname that he had applied often to both his younger brothers.<br>\r\n<br>\r\nLiam pulled back a head of shaggy brown hair and scowled.”Oh, hey, it’s just you.”<br>\r\n<br>\r\n“I’m excited to see you, too,” Johnathan said as he pulled out a chair from beneath the kitchen table and straddled it. “What you doing?”<br>\r\n<br>\r\n“Wanted to make myself a sandwich,” Liam answered as he continued to gather some cold-cut slices and crisp lettuce leaves. <br>\r\n<br>\r\n“Good idea,” Johnathan said. “Why don’t you make one for me, too?”<br>\r\n<br>\r\n“Because I am not your butler, maybe?” <br>\r\n<br>\r\n“Aww, don’t be like that, bro,” Johnathan said. <br>\r\n<br>\r\nLiam rolled his green eyes and walked to the counter where he had left two slices of bread on a plate. He applied the cold-cut slices and lettuce to the pieces of bread. “Forgot the freakin’ mayo,” he said and turned back to the fridge.<br>\r\n<br>\r\n“Freakin’?” Johnathan mimicked his younger sibling.<br>\r\n<br>\r\nLiam ignored him, thus missing Johnathan sweeping the unfinished sandwich off the plate and taking a couple of big bites while his brother had his head in the fridge rooting around for the jar of mayonnaise.<br>\r\n<br>\r\nHe turned in time to see Johnathan take a third bite from the sandwich. “I don’t really like mayo, anyway,” Johnathan said with a smirk that did little, at least in Liam’s estimation, to enhance his collegiate handsomeness. “Make yourself one, too.”<br>\r\n<br>\r\n“That was my freak…” He was about to say the word freakin’ again, but cut himself short. “That was my sandwich!”<br>\r\n<br>\r\n“Make another one, all right?” Johnathan said. “While you’re at it, what can you tell me about this?” Johnathan opened his fist and revealed the tic-tac sized boat. “And why is the den locked up tighter than Fort Knox?”<br>\r\n<br>\r\nLiam, still aggravated at being called squirt and having his sandwich brazenly stolen from beneath his nose, smiled. “You really want to know?”<br>\r\n<br>\r\nJohnathan finished off the sandwich. “Well, d’uh.”<br>\r\n<br>\r\n“It’s really interesting,” Liam said. “Dad’s had a breakthrough with his research.” </span></div></div>",
            "created":1526940960,
            "id":2496732,
            "title":"Liam"
        },
        "143":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Liam finds a pair of tweezers",
                "Liam tells his brother to climb onto his hand",
                "Liam pinches Johnathan between his fingertips"
            ],
            "content":"<div class=\"\"><div> <span>Again, and with exasperation creeping into his voice, Liam responded to the nearly inaudible squeaks coming from the tiny man standing on the floor.<br>\r\n<br>\r\n“Look! I said it was just a joke,” Liam said. “How could I know that dad’s freakin’ shrink ray would short-circuit?”<br>\r\n<br>\r\nJohnathan shouted more invective at his younger sibling, who towered over him in his black-and-white Adidas Superstars, denim shorts and a lime green Under Armour t-shirt. <br>\r\n<br>\r\nHe had lured his older brother to their father’s laboratory to prank him for the aggravation Johnathan had caused him by calling him squirt and brazenly stealing his sandwich from beneath his nose. He had meant to shrink him down to six inches tall, perhaps lord it over him for a few minutes, even take a few snapshots with his phone, but always with the intention of growing him back.<br>\r\n<br>\r\nOnly the prototype had malfunctioned. A power surge had caused the beam to reduce Johnathan to a mere quarter of an inch in size. That could easily have been fixed, but the surge burnt out the delicate circuits in the device. That fact had, so far, escaped the notice of his tiny sibling who kept insisting that Liam grow him back.<br>\r\n<br>\r\n“I think I should get you off the floor,” Liam said and shifted his feet.<br>\r\n<br>\r\nWatching the enormous footwear take on a gigantic life of their own, Johnathan reacted instinctively, screaming and throwing up his arms to try to block the nearest shoe from crashing down on him.<br>\r\n<br>\r\n“Doofus!” Johnathan squeaked after he realized the shoe was coming nowhere close to him. “Watch what you’re doing!”<br>\r\n<br>\r\nHe sighed and watched his colossal kid brother walk across the room. He took some comfort in the fact the shrink ray had also shrunk his clothes with him. <br>\r\n</span></div></div>",
            "created":1527694920,
            "id":2500718,
            "title":"Pranking big brother for a change"
        },
        "1431":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "One of Johnathan's buddies stop by to visit",
                "As soon as Liam departs, their father returns home",
                "Roland comes to the kitchen for a snack"
            ],
            "content":"<div class=\"\"><div> <span>Johnathan felt the return of his brother long before he saw the mountainous figure of the 13-year-old turning toward his direction of the floor. The tiles under the shrunken man’s feet shook with mild tremors that increased in their intensity with each step his brother took.<br>\r\n<br>\r\nFrom a distance, his brother consisted of amorphous blurs of brown and bright green. Johnathan was simply too small to bring his entire brother into focus. Besides, as the giant drew closer, the quarter-inch college student’s attention focused almost entirely on the youth’s sneakers, which looked as big as an ocean-going cruise ship.<br>\r\n<br>\r\nThe enormous shoes leaped like mighty cetaceans before crashing back to the floor. A dumbfounded Johnathan watched as Liam came closer and began to wonder if his “little” brother would remember to use some sensible caution being as he was so tiny.<br>\r\n<br>\r\nThankfully, Liam did remember him and began kneeling as he drew closer to the spot on the floor where he could just barely make out the tiny speck that was his older brother. From Johnathan’s perspective, however, the simple act of kneeling made his brother look like he might come crashing down atop him like some massive avalanche. <br>\r\n<br>\r\nAs he fought off the urge to turn and run, Johnathan noticed something else — a gleaming pair of metal tweezers held in Liam’s fingers.<br>\r\n<br>\r\n“Oh, no way in hell!” Johnathan exclaimed and, at that point, did turn and try to flee. He barely managed to scurry more than a few inches before he felt the metal pincers dig into his ribs as his brother deftly manipulated the tweezers to pluck his bug-sized sibling off the floor. <br>\r\n<br>\r\nJohnathan struggled to breathe as his brother maintained his grip on the tweezers as he carried him out of the laboratory and through the gigantic house.<br>\r\n<br>\r\n“Don’t squirm,” Liam cautioned. “Trust me. You don’t want me to drop you, bro.”<br>\r\n<br>\r\nJohnathan began to see stars and felt like he might black out just before Liam lowered him to the kitchen counter and released him at the very spot the encounter between the two brothers had begun that had led to Liam shrinking his older sibling.<br>\r\n<br>\r\nJohnathan rubbed his sore ribs beneath his shirt and complained. “Liam, you’ve got to be more careful,” he squeaked. “Where is Dad? He could fix this.”<br>\r\n<br>\r\nLiam had hoped that getting his brother off the floor might make it easier for them to communicate, but Johnathan’s voice had changed to a high pitch that made his tiny squeaks all but impossible to detect.<br>\r\n<br>\r\nHe stretched and reached above Jonathan, who gazed up at his brother’s truly monstrous form as the teenager reached into the cabinet.<br>\r\n<br>\r\nA few seconds later Liam dropped a simple inverted water glass over his brother, trapping him and cutting off his increasingly strident protests.<br>\r\n<br>\r\n“I’ll go find dad,” Liam said while looming over the upturned glass and gazing down at Johnathan’s bug-sized form.<br>\r\n<br>\r\n“Wait!” Johnathan pleaded. “Don’t leave me here.”<br>\r\n<br>\r\nIf his protest had been heard, it wasn’t acknowledged. Liam departed the kitchen, leaving his brother tiny and imprisoned beneath a simple water glass. <br>\r\n</span></div></div>",
            "created":1527707220,
            "id":2500780,
            "title":"Liam uses a pair of tweezers"
        },
        "14311":{
            "author_id":"small1",
            "author_name":"Small1",
            "choices":[
                "Dex hates bugs",
                "Dex notices something different about this bug"
            ],
            "content":"<div class=\"\"><div> <span>From the sole of his sneakers to the baseball cap atop his head, Johnathan’s buddy now looked more than 1,800 feet tall in comparison to the shrunken 22-year-old man.<br>\r\n<br>\r\n“Fuck! I can’t believe that’s Dex!” The tiny man ran to the towering barrier of glass and pounded his fists against the transparent surface while screaming his buddy’s name.<br>\r\n<br>\r\nIf he had taken the time to consider the full implications, he might not have tried so hard to get Dexter’s attention. He was not the brightest bulb in the carton and his friends also ribbed him remorselessly for his clumsy tendencies. But Johnathan has been stuck under the huge glass for an hour with no idea when his kid brother might return. With a view toward ending his confinement, the speck-sized man tried everything to get the attention of his giant friend. <br>\r\n<br>\r\n“Johnathan!” Dex shouted. “Anyone home?”<br>\r\n<br>\r\nInside the glass, Johnathan’s tiny shouting reverberated through the echo chamber of the cavernous space without ever penetrating into the wider world beyond the kitchen counter.<br>\r\n<br>\r\nAs the giant moved closer, the tiny college student felt the impressive tremors that put another strong suggestion of his friend’s new power and size.<br>\r\n<br>\r\n<br>\r\n“Just the thing,” Dex said unexpectedly as he moved a hand with shocking speed to whisk the glass off the counter. He flipped the glass and placed it beneath the sink’s faucet to fill the glass with water from the tap. He took a long drink, thirstily gulping down the liquid as he waited for any response from his shout outs to his buddy.<br>\r\n<br>\r\nA terrified Johnathan had hit the deck and curled himself into the fetal position on the countertop when Dexter’s hand had stretched out and grabbed the enormous water glass with shocking speed and precision. He needed a moment to recover and realize that he had not been rescued, although he had been accidentally released from his glass prison.<br>\r\n<br>\r\nHe gazed skyward and saw Dex tip the enormous gleaming glass toward his mouth. A river washed over the giant’s open lips and flowed swiftly down his throat as half the contents of the glass disappeared in a single gulp.<br>\r\n<br>\r\nThe tiny man heard the giant produce a satisfied “ahhh” that followed the drink. He took that instant as a time to renew his efforts at contact.<br>\r\n<br>\r\n“Dex, look down here,” Johnathan shouted. “I’m down here!”<br>\r\n<br>\r\nThe tiny man’s words carried no farther than the sound of an ant’s feet carry to a normal person’s ears as they scurry over a floor.<br>\r\n<br>\r\nHaving drawn as close to the edge of the countertop as he dares, the tiny man peers over the edge and sees a stomach-lurching drop that looks like a plunge of more than a thousand feet to the tile floor.<br>\r\n<br>\r\nA shadow overcomes him and he realizes that Dex has moved closer. He waves his thread-thin arms over his head. “Dex! Please! It’s me!” Johnathan exclaimed.<br>\r\n<br>\r\nDex, glancing in an uninterested manner around the kitchen, does notice something tiny and moving in rapid motions. “Fucking bug!” Dex exclaimed. <br>\r\n<br>\r\nHearing Dex mutter angrily about a “fucking bug,” the shrunken man’s eyes darted wildly, fearful of seeing any potential bug that would be bigger than him and a serious menace to someone his size. Seeing nothing, a second thought occurred to him.<br>\r\n<br>\r\nBy that point, Dex had moved into position and loomed over him. He glared down at him with dark eyes and a grimace etched across his massive face. <br>\r\n<br>\r\nJohnathan felt his blood chill and for the first time realized that, far from being a savior, his buddy could just as easily become his destroyer with one casual action.<br>\r\n<br>\r\n“No,” he screamed as he saw Dex raise his massive hand. “Don’t! I’m not a bug!”</span></div></div>",
            "created":1527799380,
            "id":2501284,
            "title":"Dex"
        }
    },
    "info":{
        "author_id":"switch1",
        "author_name":"switch1",
        "brief_description":"Johnathan just wanted an escape to the mountains. Being shrunk ruins that. ",
        "created":1526366160,
        "description":"<td align=\"left\" class=\"norm\">This is a male/male macrophilia interactive story about a 22-year-old college graduate named Johnathan who wants a break from responsibility and a chance to experience the mountains. Does he make it or not? <br>\r\n<br>\r\nShrinking is the nature of this interactive and any size two inches and below are acceptable. Preferred size is 1 millimeter. I look for detailed and accurate portrayal of size and the environment around the character. I also am looking forward to some unique circumstances. <br>\r\n<br>\r\nWhile this story will indeed have nudity, bodily fluids, bodily functions, I’m hoping to experience some adventure as well.<br>\r\n<br>\r\nUnderage giants are OK, but not in sexual situations. <br>\r\n<br>\r\nChapters should be no less than 500 words and will be reviewed. Thanks for posting and adding!! </td>",
        "id":2158112,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1536049020,
        "modified":1536049020,
        "pretty_title":"Just Wanted to Climb a Mountain"
    }
}