{
    "chapters":{
        "1":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "decided to enter on his own.",
                "took the bouncer up on his offer.",
                "was approached by another biker while deciding.",
                "has second thoughts and asks for his stuff back."
            ],
            "content":"<div class=\"\"><div> <span>The cool night did nothing to deter Bill from finding a new watering hole. He had just moved out to this small town to get away from his gold-digging ex and away from the fast-paced city life. He worked too hard for too many years and was going to enjoy his early retirement. <br>\r\n<br>\r\nTaking a leisurely drive around town Bill discovered what looked to be a biker bar on the outskirts. The plain-looking brick building had several motorcycles in the lot and a few men hanging around outside. After pulling into the parking lot, Bill could make out the sign dimly lit by flickering lights. Jotunheim. 'Interesting name,' he thought. The men hovering around a few of the bikes were large, much bigger than the shorter Bill. And while Bill was fit, he wasn't nearly as wide as some of the men either. Some were a more muscular stocky build, some were on the chubbier side, but all of them were large.<br>\r\n<br>\r\nThe men all eyed Bill as he climbed out of his pick-up truck. The leering bikers seemed strangely interested in him. Bill shivered, chilled by their hungry gazes more than the cool night air. Doing his best to ignore the stares, he walked up to the door. At the entrance was an immense man, presumably the bouncer. He had a wide, thick build. Bill figured he spent most of his off hours in the gym. The huge bouncer wasn't cut though, he went for mass, and he had a lot of it. Despite the night temperature, the bouncer wore only a leather vest, jeans, and heavy leather boots, as well as a gold chain with some kind of locket. The cool air didn't seem to perturb him at all. This put the bouncers wide, heavy, hairy pecs and gut on display. Red fur covered much of the large man's skin. His hair on his head was close-cropped and he had thick mutton chops on his cheeks, leaving the lip and chin bare except for a bit of stubble.<br>\r\n<br>\r\nThe bouncer gazed intently at Bill, though it looked more out of curiosity than hungry lust. The bouncer stood up and blocked Bill's path. The shorter man noticed with some trepidation that he only came up to the bottom of the bouncer's pecs.<br>\r\n<br>\r\n\"Hey there,\" came a deep rumbling voice as the bouncer spoke. \"I need to see your ID if you plan on entering Jotunheim.\" The burly redhead simply stood there with his arms crossed as Bill fished out his driver's license. The bouncer causally took the ID and glanced at the birthday, smiling.  Then unexpectedly he slipped the license inside his vest.<br>\r\n<br>\r\n\"Hey, what are you...\"<br>\r\n<br>\r\n\"Keys too. We won't have any drunk drivers leaving here.\"<br>\r\n<br>\r\n\"What? That ridiculous. No place does anything like that!\"<br>\r\n<br>\r\n\"Our place, our rules. If you want in, you give me your keys. You'll get them back along with your license when you leave Jotunheim.\" The bouncer smirked as he said that. \"Of course, once you step inside you might find it hard to leave.\" The hefty redhead placed a heavy hand on Bill's shoulder, almost as if he didn't want him to back out of going inside the bar. The men were hot and Bill's curiosity was growing, so he complied and fished out his keys from his pocket and handed them over. The bouncer took them and placed them in his own pocket.<br>\r\n<br>\r\n\"Now then, you're free to enter. However, if you're willing to wait, my shift ends in 20 minutes and I'd love to show you the place.\" Bill noticed the bouncer's eyes took on a bit of lust. \"Up to you.\"<br>\r\n<br>\r\nBill...</span></div></div>",
            "created":1375419600,
            "id":1639134,
            "title":"Entering Jotunheim"
        },
        "11":{
            "author_id":"shadowdragon21",
            "author_name":"ShadowDragon21",
            "choices":[
                "Go to the olde biker",
                "Go to the muscular biker",
                "Go to the fat biker",
                "Go to the biker couple",
                "Go explore the bar some"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm fine I'll go in on my own, but if you're willing to find me when your shift is over I wouldn't mind if you showed me around then.\" Bill tells the Boumcer as he starts to walk past him. \"Alright I'll remember that.\" The Bouncer says as he lets Bill in. As soon as Bill stepped inside the bar everything changed. The noises got louder and everything looked bigger than it should be. From the size it looked outside it shouldn't be this big on the inside. Wandering what happened Bill soon got his answer when he saw an old biker man pass by, the only problem though was that the man was huge compared to him. Bill had to crane his just to see part of the huge biker. Not thinking it was safe he ran towards the nearest table. As he looked around he noticed other giants and if he focused enough he could make out people his size with the giants. \"This must be a regular thing in the bar.\" Bill said aloud knowing the giants will most likely not be able to hear him. As he looked around he saw a lot of giants but not many tiny people. 'No wonder the bouncer asked me to wait I'm new and he would be able to have me and also as soon as we got in too.' Bill thought to himself as he started thinking it might've been better to take the Bouncer on his offer. Hearing the entrance open Bill turned around as he looked he saw two people enter one was a young guy who looked no older than 25 walk in and saw that he shrunk immediately and right behind was one of the huge bikers Bill saw outside who was much older looking than the shrunken young man, but as the biker walked in he didn't shrink at all he stayed huge. As Bill turned his attention to the young man, the young man didn't look scared he even looked excited to what was going to happen. Bill just stood there and watched as the biker crouched down and picked up the guy who came with him and he walked away. 'So I guess most people know about this place then.' Bill thinks as he starts wondering what to do himself. Being honest with himself he had no problems being the submissive one in a relationship that's how he ended up buying so much stuff for his last boyfriend. This time though he knew it was going to be different and he was already getting excited about what he was going to try to do. As Bill looked around he took notice of four guys, the old biker guy from earlier,a very muscular one sitting a table away, one that looked like he was more fat than muscle, and last one is actually a group of two bikers sitting next to each other one thing the all had in common though was that they were all really hairy that Bill could make out their hairs from where he stood. Even though these were the four he liked he could take a look around if he wanted too maybe find some different giants to go up to instead. In the end though Bill decided too...</span></div></div>",
            "created":1388638800,
            "id":1719627,
            "title":"decided to enter on his own."
        },
        "111":{
            "author_id":"shadowdragon21",
            "author_name":"ShadowDragon21",
            "choices":[
                "Get you out of your clothes",
                "Get out of the bar",
                "Mess around a bit for right now"
            ],
            "content":"<div class=\"\"><div> <span>Bill looked towards the older biker who passed by him earlier. Bill would be lying to himself if he said he didn't like men older him heck one of the reasons he came to this bar was because mos of the biker's are older than him. \"Retiring\" at a very early age left him with a lot of money to spend and not have to do anything. Making sure the coast was clear Bill made a dash for it to the table the older biker was at. As he got closer he noticed the biker already white hair, and he wasn't bald. He also noticed the biker had a horseshoe mustache too. As Bill made it to the older biker he got a good look at him. The biker was muscular but it was more noticeable on his arms since he had a beer belly you wouldn't be able to tell from looking at it. <br>\r\n<br>\r\nFeeling nervous approaching the giant man Bill takes a few deep breaths as he prepares himself. After a bit he takes his first steps as he nears the giant's boot. Not wanting to chicken out Bill starts to climb the biker's leg immediately knowing of he waited to much he would back out and miss the chance of a life time. After a bit of a climb Bill finally made it to the older biker's knee. Just as Bill was catching his breath though a huge hand came down and wrapped around him. As soon as he was brought up the hand released Bill onto the table. Looking up Bill saw the face of the man he was just climbing moments ago. \"Well what do I have here a little man climbing my leg I've been waiting for ya for a while runt ever since I saw you run under the table.\" The biker tells Bill as he looks at him staring at him. Bill a bit intimidated looks down and says \"Sorry for taking too long to get to you Sir by the way my name is Bill.\" \"Well it's alright that you took a bit at least you're with me now and I didn't have to go convince someone to come inside with me or hunt one of you down in the bar and since you told my your name I'll tell you mine it's Bryon Fields.\" Bryon tells you as his head moves in to inspect you his beer breath covering your body. \"No need to by scared Lil Billy don't I'm going to treat you good, so first thing we gotta do is...</span></div></div>",
            "created":1388898000,
            "id":1721922,
            "title":"The older biker"
        },
        "1111":{
            "author_id":"shadowdragon21",
            "author_name":"ShadowDragon21",
            "choices":[
                "Brings you up to his big chest",
                "Puts you down to his groin",
                "Decides to get you off"
            ],
            "content":"<div class=\"\"><div> <span>As Bryon told Bill to get out of his clothes he couldn't help but be surprised. \"You mean here and right now?\" Bill said worried the huge man might say yes. \"Yes right here, right now.\" Bryon answers him. Bill still worried about stripping in front of a giant man he just met was taken by surprised when out of nowhere he was grabbed by the giant man. \"You did know that a lot of people come here to be played with by giant men.\" Bryon tells you. It seemed you're suspicions were correct in that most people knew about possibly ending up shrunken, but to think some people came here knowing that they would shrink and be played with by giant men. As you were thinking about how that didn't sound so bad your pants were then stripped off by Bryon's huge fingers. \"Since you're not stripping yourself seems like I'll have to do it for you.\" Bryon tells you as he starts picking up your shirt. As your shirt is lifted off e reaches for your boxers. As soon as they are pulled down Bryon sees that you have an erection. \"Well well so Lil Billy is excited to play with me well lets get started.\" Bryon says as he...</span></div></div>",
            "created":1392181200,
            "id":1744610,
            "title":"Striped Naked"
        },
        "11113":{
            "author_id":"jestex",
            "author_name":"Jestex",
            "choices":[
                "order you both drinks",
                "take you somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>With a smirk on his slightly wrinkled face, Bryon lifts a single finger and gently flicks you on your chest, just hard enough to knock you off balance. You sit down gracelessly and gaze up at the giant with wide, startled eyes. His smirk has broadened into an eager grin. \"Just relax, now,\" he growls, almost purring. With just his fingertip, he pushes you down onto your back and holds you there against the bar, keeping you from moving even if you were trying to resist. Your heart is throbbing wildly, but you swear it stops for a moment when Bryon's other hand makes contact with your dick.<br>\r\n<br>\r\nHis thumb and index finger caress your cock slowly, careful not to damage the tiny, delicate organ. Each touch sends a shockwave of ecstasy through your body, electrifying your extremities and scrambling your already racing thoughts. Your breaths come in gasps, and your eyes are practically watering. Through the fog of euphoria, you vaguely wonder if it's appropriate to be jerked off like this in public, and you shift your gaze to look towards the nearest group of patrons. But if anyone is aware that a tiny man is receiving the biggest fingerjob of his life right there on the bar, they don't seem to care enough to pay any attention. You turn your head back to revel in the visage of the godly giant before you, drinking in the laugh lines around his eyes, the slight puffiness of his cheeks, the bushy but well-groomed beard, the gray and white fur beneath his unbuttoned shirt and vest. Holding these images in your mind, you close your eyes and ride the wave of pleasure for as long as your manhood can endure. Hardly a minute must have gone by before the telltale stirring in your groin begins, and a cry escapes your lips just as your cock erupts all over Bryon's fingertips.<br>\r\n<br>\r\nThe giant lets out a booming laugh and takes his hands away, leaving you panting and gasping for air on the bar while he licks his fingers clean. He watches you with a strangely protective twinkle in his eye as you catch your breath and finally sit up. Still in shock from what may have been the best orgasm of your life, you look up at the old biker and return his smile.<br>\r\n<br>\r\nBryon decides to...</span></div></div>",
            "created":1497401580,
            "id":2335406,
            "title":"Fingerjob from an Older Man"
        },
        "113":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "\"a little fun while I'm here.\"",
                "\"a new pet.\"",
                "\"you to find some other giant to bother.\""
            ],
            "content":"<div class=\"\"><div> <span>Bill found himself gazing at the the heavyset giant a couple tables away. The man was massive; he must have weighed over 300 pounds. He wasn't as solid as some of the other guys here, but he carried his weight well. The first thing Bill saw were the heavy black motorcycle boots. Extending up from there were the denim-clad cliffs that were the biker's legs. The tiny man saw a hairy paw resting on one of the thighs with a black leather wristband behind it. Beyond that was a chubby arm covered in thick dark hairs. It was hard for Bill to see more as the table was blocking much of the view. Bill tentatively approached the giant, unsure of how he would react to finding a little man. <br>\r\n<br>\r\nBill stuck to the wall as he made his way over to the giant's table. Huge boots were stomping everywhere, making it feel like there was a constant mild earthquake assaulting the bar. From the new perspective farther down the wall Bill could see more of the chubby giant. Continuing up his torso Bill noticed he was wearing an open black leather vest. The giant had no shirt underneath, though from the side he couldn't make out the chest very well, though the large furry gut was obvious. The giant had a massive beard, dense with coarse hairs. The giant had on a black Muir cap and a ring of dark hair along the sides and back. <br>\r\n<br>\r\nBill stood there mesmerized for a moment, lusting over this colossal biker. The tiny man saw the giant glance in his direction, then went back to his drink on the table. Did the giant see him? There was only one way to find out. Bill waited for a moment when his part of the floor was light on traffic and made a dash for the behemoth's table. Just as the little man arrived one of the giant's boots shifted and knocked him over. The huge foot started tapping on the ground; the heavy thuds made it difficult for Bill to get back up. <br>\r\n<br>\r\n\"Hey! I'm down here! Please don't step on me!\" Bill yelled up to the giant. The huge biker looked down quizzically, as if he might have heard something but wasn't quite sure. Not saying a word, the chubby bear reached down and scooped up the little man in a fist, only leaving Bill's head exposed. Bill was brought up before the giant's face as large brown eyes gazed at him with a penetrating stare, evaluating his new capture.<br>\r\n<br>\r\n\"Did you say something, little man?\"<br>\r\n<br>\r\nBill gulped nervously, thoroughly scared now that he was actually in the giant's hand. \"I...I said please don't step on me, sir.\"<br>\r\n<br>\r\n\"Better,\" the giant said in dismissive approval. \"What brings a lowly creature such as yourself over to my table, little man?\"<br>\r\n<br>\r\n\"I...I...I wanted to meet you, sir.\"<br>\r\n<br>\r\n\"Is that so? Well, here you are.\"<br>\r\n<br>\r\nBill kind of just stared in awe, a bit dumbfounded by his position before realizing he hadn't introduced himself.<br>\r\n<br>\r\n\"My name is Bill, sir.\"<br>\r\n<br>\r\n\"What do you want little man?\" The giant appeared to be somewhat irritated. \"Tell me before I drop you back on the floor for another giant to find.\"<br>\r\n<br>\r\n\"I...I don't know,\" the tiny man answered honestly. He just knew he was attracted to this dominant giant of a biker.<br>\r\n<br>\r\n\"Then why are you bothering me if you don't even know why you're here?\" The giant slowly swung his hand out over the side of the table. Bill knew the giant wasn't kidding about dropping him. Was the biker really going to drop him to his death?<br>\r\n<br>\r\n\"I just wanted to be with you!\" Bill yelled out in desperation.<br>\r\n<br>\r\n\"Hmf.\" The giant swung Bill back up in front of his face. \"That's a start. Now for what I want. I want...\"</span></div></div>",
            "created":1390366800,
            "id":1731612,
            "title":"Go to the fat biker"
        },
        "1132":{
            "author_id":"shadowdragon21",
            "author_name":"ShadowDragon21",
            "choices":[
                "Some fun\"",
                "To go home\"",
                "Put you someplace\""
            ],
            "content":"<div class=\"\"><div> <span>Bill was a bit surprised by what the giant said, but from the way he just told the giant that he wanted him was also shocking. \"What do you mean pet, not saying I don't want to if you want me to I can I just want to know.\" Bill said hoping he didn't sound as if he didn't want to be with the giant man. \"What I mean is you stay with me at all times even outside the bar and you listen to what I say when I say it and you're not allowed to go to another giant unless you have my okay.\" The chubby biker told Bill as he set onto the table. \"I can do that but what do you mean new?\" Bill asked wondering if he was in danger. \"My last pet was wondering around the bar last week when I was here and he wasn't back by the time I told him I was leaving so I left him here, I told him before I was going to leave him and that if he still wanted to stay with me he had to come to me and apologize next time I came but he hasn't so he's probably already with some other giant.\" The giant told you as his story relieved you of your worries. \"Now that I got a new pet I think it's time for...\"</span></div></div>",
            "created":1396069200,
            "id":1770091,
            "title":"\"a new pet.\""
        },
        "11322":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "The giant takes off with his new pet.",
                "The bouncer decides to join the fat biker before he takes off."
            ],
            "content":"<div class=\"\"><div> <span>\"us to go home.\" Without saying a word, the chubby biker dumped Bill into an inner vest pocket. The odor of sweat mixed with leather was overpowering; Bill had difficulty breathing in the tight, humid space. At least the vest itself was still open as the giant's belly was too large for it to be buttoned closed. This meant the air circulated a little bit as the biker walked over to meet with the bouncer.<br>\r\n<br>\r\n\"I believe you have something that belongs to me,\" Bill heard his owner declare to the bouncer without even so much as a hello.<br>\r\n<br>\r\n\"I know, sir, I was hoping to get him for myself.\" Bill was surprised to hear the huge bouncer sound so deferential as well as a bit dejected. The little man couldn't tell what was going on from inside the pocket, but he figured the bouncer was handing something over to his giant. <br>\r\n<br>\r\n\"You're always welcome to join in the fun.\"<br>\r\n<br>\r\n\"Yes, sir, I know. Thank you for the offer. I'll think about it.\"<br>\r\n<br>\r\n\"Someday I hope you do decide to take it. I understand why you haven't yet, but you're really missing out, son.\" Suddenly fingers invaded the tight space and fished Bill out of the pocket. The little man was dangled between the two giants. Bill gasped in awe upon seeing the furry red mountain of a man at this scale. \"Maybe this will be enough incentive for you.\"<br>\r\n<br>\r\nThe bouncer started to reach out but the chubby giant brought Bill back closer in towards his own body. \"No touching. If I didn't like you so much, I'd have you punished for breaching protocol, son. But I'd rather you come willingly.\" The giant then placed Bill back inside the stuffy vest pocket.<br>\r\n<br>\r\n\"Thank you, sir. I'm sorry I did that.\" <br>\r\n<br>\r\n\"Oh, don't thank me yet. Thank me after you pay me a visit.\" With that the chubby let out a cruel-sounding chuckle and exited the bar.<br>\r\n<br>\r\nBill heard the rumble of the bike engine.</span></div></div>",
            "created":1396501200,
            "id":1773096,
            "title":"To go home\""
        },
        "113222":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "The trio arrive home.",
                "Byron heads to a friend's house.",
                "Byron stops at a scenic location to play."
            ],
            "content":"<div class=\"\"><div> <span>\"Sir! Sir Byron! Please, wait.\" Bill and his master, apparently named Byron, heard over the roar of the engine. Byron turned the engine off and kicked the stand back down. The bouncer was standing at the threshold of the bar entrance, his locket dangling from his hand before him. The bouncer took a few steps back into the bar and waited. The chubby biker turned around and saw his new prey waiting for him inside the bar. \"Good boy,\" he mumbled, though it was audible to the tiny Bill. \"Looks like you'll have company, little pet.\" Byron dismounted from his bike and walked into the bar, standing before the beefy ginger bouncer. Byron simply held a hand out with the palm upturned.<br>\r\n<br>\r\nThe bouncer gently dropped the locket into Byron's hand. \"Good boy, Scott. I knew you'd see it my way. Of course, that'll be the last time someone uses your giant name.\" The bouncer quickly dwindled to a three inch version of himself, ankle-high to the now gigantic biker. \"Since you're no longer a giant.\" Byron pocketed the locket then reached down to pick up his newest pet. \"Let's go home, boy.\" Byron stuffed Scott into the same pocket as Bill, causing the confined space to become even more cramped.<br>\r\n<br>\r\n\"Why?\" Bill asked the new inmate.<br>\r\n<br>\r\n\"I wasn't supposed to touch another giant's property without permission. Everyone saw that. Master knew my status was undermined. Better to go willingly than have him force the issue as punishment. Besides, I still get you this way, little man.\" Scott smiled smugly, though it was hidden in the darkness of the pocket.<br>\r\n<br>\r\nThe pair of little men heard the bike engine roar to life again and felt themselves being taken away from Jotunheim.</span></div></div>",
            "created":1524710040,
            "id":2484483,
            "title":"The bouncer decides to join the fat biker befor..."
        },
        "11323":{
            "author_id":"campretro",
            "author_name":"campretro",
            "choices":[
                "Bill does as he's told",
                "Bill is stuck holding onto the cigarette as the giant picks it back up"
            ],
            "content":"<div class=\"\"><div> <span>\"... me to put you someplace... hmmm... where to put you...\"<br>\r\n<br>\r\nBill had no idea what the giant might do.  Part of him was filled with regret, uncertain if he'd made the right decision, the other part of him was excited.  <br>\r\n<br>\r\n\"Of course,\" said the giant, \"you can tend to my cigarette.\"<br>\r\n<br>\r\nThe giant placed Bill into a small black ashtray on the table.  Bill watched as the giant stuck a marlboro in his mouth and lit it, blowing all the smoke down on Bill.<br>\r\n<br>\r\n\"Keep this nice and ash-free,\" said the giant, placing the cigarette into the ashtray.</span></div></div>",
            "created":1446710760,
            "id":2057048,
            "title":"Put you someplace\""
        },
        "113232":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "The giant pushes Bill deeper into his beard",
                "The giant plucks Bill from his beard"
            ],
            "content":"<div class=\"\"><div> <span>Bill coughed and rubbed his eyes which were stung by the could of smoke wafting over his tiny body. The tray was full of ashes and Bill's feet became sooty. Not wanting to anger the giant after just becoming accepted, Bill dutifully walked over to the cigarette and put his arms around the stick. The cigarette was surprisingly heavy to the tiny man and Bill struggled to lift it up. Just as Bill lifted the end up in order to tap in clean, the giant picked it up to take another drag. Bill's arms were still around the cigarette as it was lifted up from the ashtray. The tiny man got the sinking feeling in the pit of his stomach as he shot up to the giant biker's mouth. <br>\r\n<br>\r\nThe giant pulled in some air through the cigarette and blasted Bill with hot smoke from his nostrils. The giant gently shook the cigarette while Bill was struggling and coughing, causing his new little pet to tumble off into the giant's thick beard. \"Not doing a good job so far, little man. Ash could've fallen into my beard, just like you have.\" Bill clung to the thick hairs, scared of falling from his perch.<br>\r\n<br>\r\nThe giant chuckled at his pet's predicament. \"Maybe it's better if I just leave you in my beard. You're not much good elsewhere. Or maybe I can find another use for you.\"</span></div></div>",
            "created":1481515020,
            "id":2248822,
            "title":"Bill is stuck holding onto the cigarette as the..."
        },
        "1133":{
            "author_id":"maxesmol2",
            "author_name":"maxesmol2",
            "choices":[
                "He tear my little body from the boot",
                "He walk to the bathroom ",
                "He walk out the bar"
            ],
            "content":"<div class=\"\"><div> <span>Then the huge biker drop me from the table to the floor, falling over the dirt and the huge leather boots stomping all around me. <br>\r\n<br>\r\nThen a huge black work boot kick me, but instead of being dropped away, the leather attached my little body against the tip of the boot, rigth in front of the toes, as if the boot was covered by a kind of glue. I've tried to look up, but the only thing that I could see was the dirty mechanic overall the giant was wearing, and a huge black with salt and pepper beard. The huge black forearms were uncovered as the giant kept his sleeves rolled up, revealing the dark skin; \"a chocolate giant\" I thought.<br>\r\n‎<br>\r\n\"Hey! Eddie! I think you finally caught something\" shooted the biker from the table, the one who drop me to the floor.<br>\r\n<br>\r\nThe giant black mechanic (Eddie) looked down to his dirty work boots, searching for his prize, and then he found me attached to the warm leather on the tip of the huge boot, trying to escape, but the sticky oil that was covering the boot was too strong for me to get free.<br>\r\n<br>\r\n\"Oh, what a little thing I have here\" said Eddie, and then...‎</span></div></div>",
            "created":1497374220,
            "id":2335175,
            "title":"\"you to find some other giant to bother.\""
        },
        "11331":{
            "author_id":"akatheguy",
            "author_name":"akatheguy",
            "choices":[
                "Eddie keeps you with him while he gets a drink, and gets to know you",
                "Eddie takes you home"
            ],
            "content":"<div class=\"\"><div> <span>\"mmm, look what the giants bought me this time!\" said Eddie, and you were enraptured by the bearded, magnificent black mechanic.<br>\r\n<br>\r\nYou were held fast between thumb and forefinger, effortlessly controlled as he surveyed your entire body with dark eyes. He looked happy to see you, at least...</span></div></div>",
            "created":1597812060,
            "id":2887764,
            "title":"Found by Eddie"
        },
        "113312":{
            "author_id":"akatheguy",
            "author_name":"akatheguy",
            "choices":[
                "Talk on the drive home",
                "Skip the drive, talk at home"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I only had one drink but this is all I wanted out of tonight,\" Eddie said with a grin. \"I'ma take you home before any of these other guys try and lay claim to you.\"<br>\r\n<br>\r\nYou were completely confused. \"Lay claim?\" you shouted, but Eddie couldn't hear you. Unlike the others, who all had motorbikes, it appeared Eddie drove a 4x4. You were dropped unceremoniously onto the driver's seat and yelled in anguish as the enormous ass of the 40-something black mechanic began to lower itself onto you, but it missed by quite a way. There you were, in the crevice between two enormously muscular legs, staring up at the gargantuan body of this mechanic. You had no idea what to do next, this had all happened so quickly.</span></div></div>",
            "created":1597812420,
            "id":2887766,
            "title":"Eddie takes you home"
        },
        "11332":{
            "author_id":"maxesmol2",
            "author_name":"maxesmol2",
            "choices":[
                "piss all over me",
                "stared to squat over me"
            ],
            "content":"<div class=\"\"><div> <span>Eddie standed there for a while, looking my little body trapped there, attached to the tip of his right boot.\"you need a little help?\" said Eddie, and then he started to stomp softly on the floor, shaking me from tip of his boot. Every stomp send a huge wave trought my body, but not enough to tear me from the sticky oil. <br>\r\n<br>\r\nEddie tried this for a while, standing there in the middle of the bar, and it didn't work, but I was felling a little dizzy for all the shaking. Eddie stopped his foot then, laughing at the low while he was scratching his crotch trought the fabric from the dirty overall.\"We will must try something else\". I could notice the long huge bulge falling to the right leg while Eddie keep scratching. <br>\r\n<br>\r\nThen Eddie stared to walk, very softly I coould say  from my point of view, he didn't want to lose his new prize, me, if he step too hard. It was not very clear for me where he was going, all that I could see from my point of veiw attached to the dirty workboot tip was the floor and the others giants footwear, but from time to time I could see a little man running around, without knowing if they was okey or not with their shrunken situation.<br>\r\n<br>\r\nFinally, a huge door appear in front of us and Eddie pushed it, and I could hear the water running from a WC, we were at the bathroom. I stared to feel a little nervious, being here with this huge black mechanic man.<br>\r\n<br>\r\n\"I'm Eddie little runt, but you can call me Master or Daddy Eddie\" he said, walking into a cubicle, while he started to unzip his huge overall, starting from his muscle thick neck, revealing that he was not wearing anything under it. I could see how the huge beard's hair get mixed with his thick hirsute chest hair, covering the most muscle pecs I ever see, and a great pack of abs equally covered by a thick coat of hair. ‎<br>\r\n<br>\r\n\"Hold on little runt, help is coming soon\" said Eddie, unzipping till the crotch area. I realized with fear that he was not wearing any underwear too. I saw his huge hand searching inside the overall, under the fabric I could notice his huge hand wielding the huge bulge, almos reaching the knee level, that long was Eddie's cock.<br>\r\n<br>\r\nThen, he started to pull out the huge phallus, which looked like a thick dark snake in his huge hand. I was paralyzed, the vision of that huge thing made me feel helpless, trapped in the dirt of the workboot of that dude who want to... do things with me and his long dong.<br>\r\n<br>\r\nThen, with a nauty smily on his face, he...‎</span></div></div>",
            "created":1497385260,
            "id":2335255,
            "title":"He walk to the bathroom "
        },
        "12":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "entered the bar.",
                "was approached by a biker.",
                "went around and entered through the side.",
                "tried to walk away back to town."
            ],
            "content":"<div class=\"\"><div> <span>Bill thought a moment about the offer. This guy was obviously interested in him, and he seemed less creepy than the other guys out here. Plus, the bouncer had his keys and license. It would probably serve him well to keep him happy. Of course the fact that Bill found the man hot weighed heavily into the decision.<br>\r\n<br>\r\n\"That sounds nice. But um...\" Bill looked around nervously and shivered slightly.<br>\r\n<br>\r\n\"What is it, little man?\"<br>\r\n<br>\r\n\"Well, it's a bit chilly, and 20 minutes is a long wait outside. Can I have my keys back?\" The shorter man didn't relish waiting out here out in the open, especially with the other bikers ogling him.<br>\r\n<br>\r\n\"You're not going anywhere.\" The bouncer reached out and pulled Bill's head right into the top of his furry gut. The bouncer rubbed Bill's head as a light growl rumbled through him. \"Yeah...you feel chilly now?\" The bouncer wrapped his other arm around Bill's back, pinning the smaller man to him.<br>\r\n<br>\r\nBill did feel warmer this close to the large redhead. No wonder he didn't need a shirt or jacket; his fur and mass kept him warm. \"No, um...\" Bill realized he didn't even know this guy's name. He tilted his head up towards the bouncer's face, searching for a name.<br>\r\n<br>\r\n\"Sir, little man. Just call me sir.\"<br>\r\n<br>\r\n\"No, sir.\"<br>\r\n<br>\r\n\"Good boy.\" The bouncer lowered his head and whispered down to the shorter man. \"Good boy. They know you're mine now. They won't bother you or they'll answer to me. Now you're just going to stay here next to me like a good little man. Prove to them you're a good little man and wait by me until my shift is over.\"<br>\r\n<br>\r\nWith nothing else to do and no means of escaping if he wanted, Bill quietly waited by the bouncer. The redhead would occasionally rub his hand up and down Bill's back or pull him in to kiss him deeply. The smaller man found himself starting to get turned on by the blatant foreplay. He could practically feel the seething jealousy from the other bikers outside. Still, none of them made a move while the bouncer was present. This was starting to turn into a good night out after all, despite the oddity of it.<br>\r\n<br>\r\nBefore long the 20 minutes had passed and the bouncer got up from his stool. \"Now be a good boy and give me a few minutes, then meet me inside. You got that little man?\"<br>\r\n<br>\r\nBill nodded in reply. \"Yes, sir.\"<br>\r\n<br>\r\nThe massive redhead simply stood up and walked away around the side, presumably to the employee entrance. He didn't even look back. While Bill stood outside waiting, the other men outside were glaring at him, some darkly. Obviously they weren't happy, not that Bill cared. He would be glad to get inside and away from them.<br>\r\n<br>\r\nBill...</span></div></div>",
            "created":1375506000,
            "id":1639204,
            "title":"took the bouncer up on his offer."
        },
        "121":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "encounters the bouncer, now a massive giant.",
                "encounters another giant patron.",
                "encounters a fellow little man."
            ],
            "content":"<div class=\"\"><div> <span>Bill opened the door and stepped inside the bar. He was totally unprepared for what he saw.<br>\r\n<br>\r\nThe place was enormous! It seemed to stretch on forever. Large wooden pillars led up to some kind of overhangs, supporting them. Loud voices boomed in laughter and barked out drink orders. Stepping further inside something definitely felt off. This place didn't look this large from the outside. Everything seemed too big. Bill looked around more and saw everything was impossibly large. The pillars and overhangs were chairs and tables. The loud voices were coming from colossal patrons scaled to the size of the furniture. Bill turned around to exit and found not a door, but a wall. Looking to the sides in search of an egress, he realized that the wall was the door, a gargantuan proportions similar to everything else in here.<br>\r\n<br>\r\nBill clung to the wall in fear. He inched over to the gap past the door frame; he didn't want to get smashed by the door if it opened. He also didn't want to get trampled by any of the gigantic patrons. Continuing to look for an exit, Bill...</span></div></div>",
            "created":1375506000,
            "id":1639212,
            "title":"entered the bar."
        },
        "1211":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "stood frozen as the bouncer lifted him from the floor.",
                "fled to hide behind a table leg.",
                "fled and ran into another patron."
            ],
            "content":"<div class=\"\"><div> <span>Bill stood there stunned, overwhelmed by the size of the man he just saw outside only minutes ago. Bill wasn't even as high as his ankle. He continued to gaze upward as the bouncer's body seemed to stretch further up and up. Bill had to back up some to even see up past the knees and he started to feel a bit dizzy from craning back so much.<br>\r\n<br>\r\nJust as the tiny man was mentally adjusting to the scale of the bouncer and everything else, he was shocked again when the redheaded giant crouched down and spoke. The giant leaned back on his haunches and let his arms rest on his knees.<br>\r\n<br>\r\n\"I see you found your way into Jotunheim, little man. Good boy. You like what you see?\" The bouncer smirked down at the tiny Bill, the giant's cock straining the crotch of his jeans. The growing bulge was not lost on the tiny man, especially as he could see that it dwarfed his own size; it was more than twice as long as his body now!<br>\r\n<br>\r\nBill swallowed hard; he was near panic. He continued to back away, unsure what to do or say. Everything was just so massive. The bouncer looked like a living mountain; he was too big to move like he did. <br>\r\n<br>\r\n\"Where are you going, little man? You just got here.\"<br>\r\n<br>\r\nBill watched as the giant moved his arm and slowly reached with an open hand towards him. The massive hand approaching him tipped Bill over the edge into panic. The tiny man...</span></div></div>",
            "created":1375851600,
            "id":1642462,
            "title":"encounters the bouncer, now a massive giant."
        },
        "12111":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "inside his vest",
                "inside his pants"
            ],
            "content":"<div class=\"\"><div> <span>The giant's massive hand slowly wrapped itself around the frightened visitor. The grip tightened a bit and Bill felt himself squeezed slightly as he was lifted from the floor. The giant's fist completely enveloped the little man. Bill felt himself rise slowly; the giant knew what to do to keep his new pet from getting sick in his hand.<br>\r\n<br>\r\nBill felt the fist open up and the little man cried in panic as he fell into the open palm of the other hand. The bearded face of the giant grinned down at him from on high.<br>\r\n<br>\r\n\"Mmm...you're even hotter now, boy. I like you like this. I think I might have to keep you.\" An extended finger reached into Bill's personal space and stroked the little man. <br>\r\n<br>\r\n\"No! What are you doing? Let me go!\" Bill begged, trying to squirm out from under the probing digit.<br>\r\n<br>\r\n\"I don't think you want me to let you go right now; it's a long drop down. Why don't you see for yourself.\" The finger stopped stroking and pushed to roll Bill over so he could see over the edge of the palm. Upon seeing how high up he was, Bill suddenly quieted down and huddled back into the giant's hand.<br>\r\n<br>\r\n\"That's a good boy. You'll be safe with me. Since my shift is over, I think I'll head on home. Now where to put you...\"</span></div></div>",
            "created":1380344400,
            "id":1671450,
            "title":"stood frozen as the bouncer lifted him from the..."
        },
        "121112":{
            "author_id":"shadowdragon21",
            "author_name":"ShadowDragon21",
            "choices":[
                "Bedroom",
                "Living Room"
            ],
            "content":"<div class=\"\"><div> <span>The Bouncer didn't even say anything as he lowered Bill down to his pants. As he pulled them forward with one hand with the other he tipped Bill in and let him fall. For Bill this was turning into a very scary experience. He wasn't even very old yet at all as he was able to get a very early retirement in his twenties by working hard and also among other stuff, but when he moved to this town he didn't  expect to become tiny and end up literally end up in the pants if another man. As Bill fell into the Bouncer pants he landed on a very stiff cock. To be Bill there was no denying that he was on the cock of a man who's real name he didn't even know. As he looked up he noticed that the Bouncer had closed his pants up and it wasn't long until he started walking. After a while of traveling Bill heard a door open and also the Bouncer say \"Ah it's good to be home now I think it's time to introduce my new little man to his new home.\" As the Bouncer open up his pant instead of grabbing Bill all he did was just take off his underwear with his pants. As Bill got used to the light he could make out that they were in the Bouncer's... </span></div></div>",
            "created":1388552400,
            "id":1718806,
            "title":"inside his pants"
        },
        "1211121":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "\"Yes, I do.\"",
                "\"I don't want to be a pet for the rest of my life.\""
            ],
            "content":"<div class=\"\"><div> <span>With the support of the giant bouncer's clothes pulling away, Bill quickly clung to the massive cock. Now that he could see, Bill tried to figure out where he was. A colossal bed was few dozen of feet away by the little man's perspective. An equally enormous dresser was off to the side, and a nightstand with a lamp and alarm clock was next to the vast expanse of the bed. As Bill was taking this all in it struck him that although he was no longer in the bar, he was still tiny. Did he really enter some world of giants like the bar's name suggested?<br>\r\n<br>\r\n\"Here, let me help you, boy.\" Before Bill could ponder further about his predicament, a huge hand descended and plucked him from the cock. Again the little man was lifted slowly up to the giant's face. The bouncer smirked down at his new little toy.<br>\r\n<br>\r\n\"So what do you think, boy? Like your new home?\"<br>\r\n<br>\r\n\"New home, sir?\"<br>\r\n<br>\r\n\"That's right, little man. You're my pet now, so you'll be living here from now on.\"<br>\r\n<br>\r\n\"Pet? But...\"<br>\r\n<br>\r\n\"But what, boy? That's what humans are here, pets. Did you not know that before entering Jotunheim?\" The giant laughed down at the little man in his hand. Bill grew increasingly worried. Was the bouncer really serious about all this?<br>\r\n<br>\r\n\"We're not in Jotunheim though. We left the bar. Why am I still small?\"<br>\r\n<br>\r\nThe giant roared in laughter this time. Bill cowered and covered his ears from the deep bellowing laugh. \"We left the bar, but little men can't leave Jotunheim. They can't open the door!\" The bouncer bellowed again. \"Not without help anyway, heh.\" The bouncer brought a huge finger to his little pet and rubbed his torso roughly, pushing his shirt around. \"Strip for me, boy. Pets don't need clothes.\"<br>\r\n<br>\r\n\"Y...yessir...\" When the bouncer lifted his finger Bill pulled his shirt off, exposing his lightly furred torso. The bouncer plucked the shirt from his hand as Bill continued to strip, each piece disappearing into the giant's maw after removal. Bill was frightened but also in awe at the sheer power displayed by the giant.<br>\r\n<br>\r\n\"I'm going to make myself comfortable.\" The giant laid back on the bed. Once settled, the bouncer released his little pet onto his chest. The chest hair was thigh-deep to the tiny Bill. Despite the little man's nudity, the heat radiating from the massive bouncer kept his pet warm. \"Make yourself comfortable, boy.\" A colossal digit pushed Bill from behind down into the chest hair. The giant stroked his pet's back and ass and he could feel the little man grow hard against his chest.<br>\r\n<br>\r\n\"Mmm...feels nice, doesn't it, boy?\"<br>\r\n<br>\r\n\"Yessir.\" Bill squirmed in pleasure, his body betraying him.<br>\r\n<br>\r\n\"You like being my pet, don't you, boy?\"<br>\r\n<br>\r\nBill hesitated. He didn't want to be stuck as a pet for the rest of his life, but he didn't want to anger the giant.<br>\r\n<br>\r\nThe bouncer picked up on the hesitation and withdrew his hand from his pet. \"Well? Do you?\"</span></div></div>",
            "created":1405054800,
            "id":1826174,
            "title":"Bedroom"
        },
        "12111212":{
            "author_id":"tinykitten",
            "author_name":"TinyKitten",
            "choices":[
                "\"We'll start slow, ease you into your new role\"",
                "\"You better be an obedient little guy. I'm a strict master.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Be a good pet and maybe I'll let you retire from pet-hood,\" the bouncer said. Bill gave a small nod, pressing himself a bit closer to his new master. The gentle stroking started up again, soothing Bill into a light sleep.<br>\r\n<br>\r\nBill later awoke, warm and secure. His front was still pressed firmly into the bouncer's hairy pecs. A hand rested on his back, making any movement impossible. Thankfully Bill didn't have to wait long before his master woke up as well.<br>\r\n<br>\r\n\"Sleep well?\" the bouncer asked.<br>\r\n<br>\r\n\"Yes sir,\" Bill agreed.<br>\r\n<br>\r\n\"Good boy,\" his master chuckled, stroking Bill's hair a couple times before he spoke again.</span></div></div>",
            "created":1500186420,
            "id":2354082,
            "title":"\"I don't want to be a pet for the rest ..."
        },
        "12113":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "it landed to the side.",
                "it landed on top of the terrorized tiny man."
            ],
            "content":"<div class=\"\"><div> <span>Bill's mind entered flight mode and he turned to run away from the colossal bouncer. He desperately scanned for an exit, but couldn't make out any human-size doors in the distance. Everything was so far away, it would take the little man forever to find an egress.<br>\r\n<br>\r\n\"You don't want to go that way, little man. It's not safe. Come back here, now, and you might live to see tomorrow.\" One direction Bill knew he had to run away from was the bass voice of the redheaded giant. Worried about one giant Bill wasn't paying attention and ran right into the booted foot of another giant. The little man bounced back and fell onto his back, stunned. <br>\r\n<br>\r\nWhile Bill was recovering from the crash, he saw the huge black boot shift. In Bill's pre-death vision, everything slowed as the boot rocked up into the air. As it started to lower...</span></div></div>",
            "created":1380171600,
            "id":1670435,
            "title":"fled and ran into another patron."
        },
        "121131":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "Scott declines.",
                "Scott really wants Bill and agrees."
            ],
            "content":"<div class=\"\"><div> <span>The boot landed with a thud just to the side of the frightened Bill. The impact knocked the little man over and stunned him as the titan above bent over to peer down past his gut. \"Well what do we have here? A visitor? Let me give you a hand.\"<br>\r\n<br>\r\nBill could only watch as the colossal biker bent over with an outstretched hand. He was a large, heavyset giant, with a large thick grey beard. Grey hair was on display on the giant's chest as the biker was only wearing a tank top with a black leather vest. Behind the calloused hands were black leather wristbands, and the giant's legs were clad in denim before ending at his booted feet. A black leather hat topped the bald head. Crystal blue eyes practically shone with delight as the giant snatched up the helpless little man from the floor.<br>\r\n<br>\r\nBill nearly got sick as he rocketed up as if he was on some crazy carnival ride. When it stopped, Bill was nauseated and dizzy. The hand opened so that Bill was laying in the giant's palm.<br>\r\n<br>\r\n\"You're a hot little man. Been a while since I've caught one. Most stick with the giant they meet outside. You're a brave little human to run off on your own. Or foolish!\" the older giant laughed. \"Tell you what, since it's so dangerous for you to be running about on your own, I'll keep you someplace safe,\" Bill's hopes got up before the giant added with a hearty laugh, \"as part of my collection!\"<br>\r\n<br>\r\n\"No, let me go! Put me down!\" Bill screamed, hoping someone would help him. He saw the giant bouncer approach the heavyset biker. <br>\r\n<br>\r\n\"Damn,\" the redheaded giant said. \"I was hoping to take him home with me.\" The bouncer knew the rules; possession was nine-tenths the law. That's what he got for toying with the little man. He loved the cat and mouse game but it always cost him the mouse.<br>\r\n<br>\r\n\"You know, Scott, you can always join him,\" the biker offered.</span></div></div>",
            "created":1380344400,
            "id":1671476,
            "title":"it landed to the side."
        },
        "1211311":{
            "author_id":"shadowdragon21",
            "author_name":"ShadowDragon21",
            "choices":[
                "Bill willingly strips himself",
                "Hank strips Bill"
            ],
            "content":"<div class=\"\"><div> <span>\"No can do Hank you know I like being the big not the other way around.\" Scott tells Hank as he looks at Bill before turning back around. \"Damn thought I could get him to crack with that one especially when he said he found a man he really liked.\" Hank said as he walked to a table with Bill in tow. 'So he must of really liked me, ah I'm such an idiot I should've just stayed with him at least I knew him slightly and now cause I ran I'm with some complete random stranger.' Bill thought as he kicked himself for being stupid. <br>\r\n<br>\r\nAs Hank made it to the table he set Bill down in front of him as he gave him a look through. \"Not a bad catch and I'm sure you'll get along nicely with all the other tiny men at home.\" Hank says while studying Bill. \"Wait a minute you can't take me home with you I have a life the police will notice I'm missing and go searching for me.\" Bill says hoping the giant biker will let him go after having his way. \"Te police know all about this place kid so when they find out you're missing they'll just think you came here to be shrunken and be kept by a biker end o story. Most of the town knows what happens here so only those that want to shrink or be a giant come here.\" Hank tells Bill. As Bill new reality sinks in he lays on his back as his life is now turned into him being a possession to a giant biker. As Bill layed there a giant hand came and started to take off Bill's pants. \"Hey what are you doing!\" Bill yells as he tries to pull up his pants to no avail as Hank pulls them completely off. \"I'm stripping you that's what I need to see the newest part of my collection naked since you're going to be naked from now on, so are you going to strip for your new master or will I have to strip for you.</span></div></div>",
            "created":1389070800,
            "id":1723471,
            "title":"Scott declines."
        },
        "1211312":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "Hank stuffs the bouncer inside his inner pocket with Bill.",
                "Hank shrinks the bouncer even more and adds him to his special collection."
            ],
            "content":"<div class=\"\"><div> <span>\"You can't be serious.\" Scott protested. \"I'm a giant. I can't just become part of your collection.\"<br>\r\n<br>\r\nThe biker stepped closer and brought a hand up to the bouncer's broad, meaty chest. Fingers ran up through the red fur as they sought out the locket hanging from the thick neck. The biker casually played with the adornment. \"Oh, yes you can. Face it; you're not a very good giant. You've never even captured a little man and my collection has dozens. You want this little man?\" The biker held up poor Bill in front of the bouncer's face, taunting him. \"You become MY little man.\" The older giant then stuffed the tiny visitor inside the inner pocket of his vest.<br>\r\n<br>\r\nThe biker noticed Scott's gaze flicker towards his vest as he stuffed his new pet inside. He closed his hand around the locket and pulled it out taut, not quite hard enough to break the chain but enough for it to dig into the bouncer's neck. Scott stood very still; he didn't want the chain to break and lose the locket. If that happened...<br>\r\n<br>\r\nThe older giant got real close and whispered into Scott's ear, \"I just might have to make him part of my special collection. I mean, if you don't want him...\"<br>\r\n<br>\r\nScott's eyes bulged and he stopped breathing for a moment. \"You don't have to do that, Hank...\"<br>\r\n<br>\r\n\"Sir. You're going to address me as Sir from now on.\"<br>\r\n<br>\r\n\"Yes, Sir.\" <br>\r\n<br>\r\n\"Good little man. I see you really want your new little friend. First things first, though.\" Hank gave the locket chain a slight tug. The bouncer gulped, knowing full well what relinquishing the locket would mean. But what choice did he have? No one ever saw nor heard from little men in Hank's special collection ever again. The bouncer reached up and unclasped the chain, letting the locket to free into the older biker's hand. The chain dangled loosely in Hank's fist.<br>\r\n<br>\r\nThe older giant wasted no time in claiming his new pet. Two in one day, and one of them a giant!<br>\r\n<br>\r\nThe bouncer's stomach lurched as it suddenly felt like it dropped out from under him. He got dizzy as his height rapidly diminished, causing the older man to shoot up into the sky. In a matter of moments, the former bouncer was only a few inches tall, gazing up at the colossal biker just as Bill had done only minutes ago. Hank loomed over the miniature bouncer for a few seconds before reaching down with a huge hand and snatching up the stunned little redhead.<br>\r\n<br>\r\nHank held the tiny bouncer up to his bearded face, smirking while peering intently at his new pet.<br>\r\n<br>\r\n\"Now, as promised, you will join your little friend.\"</span></div></div>",
            "created":1380690000,
            "id":1673092,
            "title":"Scott really wants Bill and agrees."
        },
        "12113122":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "Hank adds Bill to his special collection and heads home.",
                "Hank keeps Bill his current size and heads home.",
                "Hank loses interest in Bill now that he has Scott and lets Bill go."
            ],
            "content":"<div class=\"\"><div> <span>Scott stared at the enormous bearded face before him. He'd always been a big man; nothing could prepare him for being so small. He laid there, frozen in awe and fear. Hank would have been imposing to most normal-sized men. Now, to Scott, the biker's presence was overwhelming. The tiny bouncer never felt so subdued just by someone's presence. He suddenly regretted allowing himself to be shrunken by Hank. He would soon regret it even more.<br>\r\n<br>\r\nHank basked in his new capture, soaking in the fear and awe coming from the tiny man in his palm. Yes, capturing a giant was even more of a rush than what a normal little man gave. The biker would have to see if he could get any other giants to submit to becoming his pet. But for now, he had one giant-turned-pet to keep him occupied. It was certainly a special occasion. To celebrate his first-ever giant capture, he would make him part of his special collection.<br>\r\n<br>\r\nJust as Scott was starting to wrap his head around his new size, it changed on him. If the tiny bouncer thought he was small before, soon his initial shrunken size would be gigantic. The bouncer shrank again and the giant's palm expanded from a fleshy platform into a grooved football field.<br>\r\n<br>\r\nA deep chuckle rolled out of the giant biker. \"Seeing that taking a giant as a pet is such a special occasion, I think you should become part of my special collection.\" The biker stuck his hand into his pants and he gathered a bit of precum on his fingertip. Just the thought of owning the tiny bouncer was causing him to leak!<br>\r\n<br>\r\n\"Special collection? No... No!\" Scott now understood why no one ever saw or heard from people in the special collection; they were too small to find! And now he was going to become part of that collection. He looked around for somewhere to run, but up in the biker's palm, there was nowhere to go. As the tiny bouncer glanced around in panic, a colossal digit descended upon him. The finger was sticky and smelled strongly of musk and cum. The biker was using his own precum to adhere the tiny man to his finger.<br>\r\n<br>\r\nHank brought his finger up to his eye to get a better look at the twice-reduced former giant. A moan of arousal rumbled through the titanic biker. He could practically feel the panic of his new pet. \"Don't worry, little man, you know the magic of this place will keep you safe. Of course, you know I can't change your size unless I'm here, so I wouldn't try to escape, or you'll be stuck at that size for the rest of your life. And don't worry about your little friend. He'll join you in my special collection as well. In fact, I'll make sure he's even smaller than you so you can feel like you're still a giant to someone. That's if you can find him.\" The biker inserted his fingertip in his bushy grey beard. With a tiny nudge he deposited Scott into the dense beard. \"Welcome to your new home,\" the biker declared.<br>\r\n<br>\r\nScott got to his feet, standing on the new \"ground.\" Sure enough, the magic of Jotunheim made the beard his new home and the skin of the giant's face was \"down\" to him. Thick grey \"trees\" surrounded the tiny bouncer. Even if Scott tried to escape, he doubt he could find his way out of the dense jungle of a beard he was trapped in. Given Hank was his only chance of ever growing again, Scott was not inclined to try to leave. And the little man he wanted was going to be even smaller than he was! Yeah, he would get him, if Scott could ever find him.</span></div></div>",
            "created":1574989620,
            "id":2753188,
            "title":"Hank shrinks the bouncer even more and adds him..."
        },
        "1213":{
            "author_id":"shadowdragon21",
            "author_name":"ShadowDragon21",
            "choices":[
                "Go to the bouncer who he followed",
                "Follow Steve who seems experienced",
                "Go explore and find another giant(or get caught by one)"
            ],
            "content":"<div class=\"\"><div> <span>As Bill looked around he noticed a man around his height relieved at finding someone his size he ran to him. \"Hey can you help me!\" Bill yelled at the other man as he ran to him. Surprised by the yelling the smaller man turned around. As Bill made it to the man he started asking for help and telling him if he knew why he shrunk. \"Whoa slow down there buddy considering you're asking all these questions I'm guessing you're new to this town.\" The man told Bill. Bill surprised by the man all he could do was nod. \"Well ok good then lets go somewhere where we won't get grabbed so I can explain this to you. As the man took Bill to under a chair occupied by a giant he went into his explanation. \"Ok this bar is a male only bar, but it has some special properties where it shrinks most people and leaves others the same, one thing we noticed was those who didn't shrink are men who are already huge outside the bar, and also the very dominant men,\" The man started, \"While these stay the same size others are shrunk to very small sizes, and usually us tiny people are played with but we don't mind because for most of us that's the reason we come here for.\" The man continued but just as he was going to keep talking Bill interrupted him with a question. \"Is there a way to make sure you're a giant or a tiny person?\" \"Yeah there is but I don't really know the specifics myself since by default I'm a tiny and I like it that way so I stay my size.\" The man said as he answered Bill's question. \"So when I leave and the next time I come back I'll be tiny again?\" Bill asked. \"Yup but that's if you leave alone if you leave in the possession of a giant you'll stay you're tiny size even outside, but on the bright Is you can't die no matter what when you're tiny so you'll be okay if something happens to you.\" The man explained further. Scared by the idea of some random man just taking him home Bill was relieved by the fact that he would be alright no matter what happened though. \"So that should be mostly it by the way my name is Steve and also didn't you come in with someone?\" Steve asked as he introduced himself. \"My names Bill and I followed the Bouncer in but he told me to wait outside for a bit and when I come in I find myself tiny and scared.\" Bill answered as he looks around as sees the boots of many bikers. \"Oh that Bouncer probably went to clock out first seeing as they're not supposed to hog tinies while working, but that never stops some of them though, by the way is it that one over there?\" Steve tells Bill as he points to the Bouncer you came in with earlier as you notice he's seems to be looking for you. \"Yeah that's him.\" Bill replies. \"Well whether you go to him or not is up to you I'm going to find a giant to use me if you want you can even come with me.\" Steve tells Bill. As Bill thinks about his choices he decides to...</span></div></div>",
            "created":1388638800,
            "id":1719639,
            "title":"encounters a fellow little man."
        },
        "12131":{
            "author_id":"shadowdragon21",
            "author_name":"ShadowDragon21",
            "choices":[
                "In a table by himself",
                "A table with other giants"
            ],
            "content":"<div class=\"\"><div> <span>\"I think I'll go with the Bouncer I don't want him to look for me and end up finding out I left him.\" Bill said as he turned to run to the huge bouncer. \"Alright good luck and hope to see you again.\" Steve says as he turns the opposite direction and runs off. Bill took a couple of deep breaths before finally starting to run towards the bouncer. As Bill got close to him the bouncer noticed the tiny man running to him and chuckled. As Bill made it to the bouncer's boot he cocked his head back to look a him and was still surprised that he couldn't see past the giants gut. Bill didn't have to wait long before a hand came down for him. Bill didn't bother struggling as he was plucked up and brought up to the bouncer's face. \"So were you scared little man?\" He asked with a smile on his face. \"Of course I was, but then I met another tiny man and he told me all about this place so I'm fine for now.\" Bill said as he looked at the giants face. \"So he explained the whole thing?\" The bouncer asked Bill. \"Yes Sir he explained from some people stay regular others shrink, tinies can't die, if I leave myself I go back to normal, if I leave in the possession of a giant I stay small outside, and Steve explained some other things too.\" Bill answered as he sat down in the huge palm. \"Oh so it was Steve, I'll have to remember to make sure to give him an extra good time next time I play with him for doing the explaining for me.\" the bouncer said as he reached a hand down to his pants. \"So you know Steve, Sir?\" Bill asked as he tried to get a look at what the bouncer was doing but couldn't get a clear view. \"Almost everyone knows Steve, he goes around everywhere I'm surprised you saw him at all he's usually with some man all night and day and he only switches once a day and just call me Scott.\" Scott said as he brought his hand up. \"Doesn't he have a job or something.\" Bill asked as he noticed that Scott started heading for a table. \"Doesn't need one doesn't take much to feed a tiny and if you stay with a giant all the time you'll get fed and a place to sleep, there's also no entrance fee and no one questions when someone doesn't show up in this town since people know that some people like being tinies so much they hardly go back to normal.\" Scott explains as he sits at a tables. Bill looked around and noticed Scott sat..</span></div></div>",
            "created":1390021200,
            "id":1729276,
            "title":"Go to the bouncer who he followed"
        },
        "122":{
            "author_id":"mote",
            "author_name":"Mote",
            "choices":[
                "You were barely waist high to the giants within!",
                "You were nearly flattened by a house-sized boot!",
                "That boot could have crushed an entire mountain range, as if it were gravel!"
            ],
            "content":"<div class=\"\"><div> <span>A broad smile split the visage of the thickly muscled biker that approached you, his arms opened wide as he came in for an all too friendly hug, nearly lifting you off your feet.  \"OH, hell, don't you worry about these boys. They're just jealous that you managed to catch ol' red's eye, and on your first visit no less!  What's yer name, kiddo?\"<br>\r\n<br>\r\nYou were taken aback, staggering backwards as he was finally released from the overly familiar hug, looking up past the broad shelf of pectoral muscle that was at eye level at him as he stammered his name, feeling his cheeks flush already. \"It's uh. . . it's William, sir.  Bill to my friends.  And. . . you said that was 'Red'? The bouncer?\"<br>\r\n<br>\r\nAnother grin split the biker's face as he turned, draping an arm over your shoulders to guide you towards the door.  \"Oh. Oh, no. That's just what I call him.  If you was told to call him 'sir' you're better off doin' just that.  But don't worry.  I'll keep an eye out for ol' red until he's done clocking out.  Let's just get inside before you freeze out here or, worse yet, someone else snatches you up for playtime.\"<br>\r\n<br>\r\nSurely a newcomer to the bar wasn't that rare an occurrence that they'd be fighting over you like that.  Maybe it was just because it was so chilly tonight.  Or maybe your new 'friend' had already had one too many.<br>\r\n<br>\r\nYou can't help but chuckle under your breath at that, even as the door swings open.  Your momentary reprieve wiped away by the brilliant, overwhelming onslaught of colors and lights that washed over you as you were ushered through the doorway.  You half-expected a cacophony of noise, music and raucous laughter as the door opened, instead, utter silence met you, only your own heartbeat thudding in your ears as your vision slowly cleared.<br>\r\n<br>\r\nBut what lie before you now. . . it couldn't be right.  The building's interior stretched further and higher than should be possible, both in terms of common sense and the very laws of physics; you knew for a fact it wasn't this large on the outside!<br>\r\n<br>\r\nOne by one the people in the bar slowly turned to look in your direction, looming colossi each seated at the bar or milling on the dance floor, their attentions immediately drawn to the newcomer that had scampered through the door.  <br>\r\n<br>\r\nYou were about to back your way through the door when another figure appeared.   You gaped as a boot crashed down beside you, spinning on your heel to recover as your head whipped upwards to try to take in the form of your new biker friend who now loomed overhead as he grinned, his face mostly obscured now by that thick beard and the pecs that stretched his shirt far too thin.  \"Don' you worry, lil' Billy.  I promised I'd keep ya secure for Red an' that still stands.\"<br>\r\n<br>\r\nBut just how massive was this figure before you?</span></div></div>",
            "created":1516105200,
            "id":2441526,
            "title":"was approached by a biker."
        },
        "1223":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "Red arrives from the back.",
                "\"Though he'll have to find you first.\"",
                "\"But since I have you, maybe I can get someone in trade for you.\""
            ],
            "content":"<div class=\"\"><div> <span>Bill watched as a nearly planet-sized biker slowly crouched down and squinted to get a good look at the tiny speck on the floor. \"Damn, lil' Billy, you must like being tiny to end up this small. Even Red will be surprised at your true size.\"<br>\r\n<br>\r\nBill looked up in awe, hardly believing his own eyes, but every other sense confirmed what happened. Everything was colossal in size inside Jotunheim, unimaginably so. The giant biker's voice shocked Bill out of his reverie. \"What do you mean, true size?\"<br>\r\n<br>\r\n\"You're lucky that Jotunheim lets me hear tiny men like you, lil' Billy. Otherwise us giants wouldn't be able to hear someone so small. You're at your true size. Everyone has their own sense of their natural size in relation to us giants. You must love your giants at a truly colossal size. Of course, Red has some influence on this as well, having a sense of his own size compared to humans. Looks like you and ol' Red were made for each other. Good thing I decided to help you out. At your size Red may not have ever found you. Don't worry, ol' Buck here will keep safe for Red as promised.\"<br>\r\n<br>\r\nBuck gently scraped Bill up onto the tip of his index finger. The titan slow stood up and held his finger up to his eye. The orb was huge and its gaze somewhat unsettling. At least Bill didn't sense any malice; on the contrary, the giant seemed to exude amusement. \"So tiny... I'm jealous that Red claimed you first.\"</span></div></div>",
            "created":1524713640,
            "id":2484498,
            "title":"That boot could have crushed an entire mountain..."
        },
        "12232":{
            "author_id":"mote",
            "author_name":"Mote",
            "choices":[
                "I think a lil' hide an' seek is in order. Red can fish you outta my shorts.",
                "Like I said, Red likes 'em small.  Much, much smaller."
            ],
            "content":"<div class=\"\"><div> <span>A sly grin spread across Buck's handsome features as he inspected the tiny man that stood helpless on his fingertip, the view making your heart skip a beat or twelve as you staggered backwards, the heady scent of beer and cigar smoke assailing you as Buck spoke.<br>\r\n<br>\r\n\"Now me an' Red, we're good friends.  And I aim to give Red what he wants. . . but that don't mean I can't have a little fun first, am I right?\"   Buck laughed, giving you a wink.<br>\r\n<br>\r\n\"W-what did you have in mind?\" You asked, knowing that no matter the answer, you had little say in the subject.<br>\r\n<br>\r\n\"Well, Billy . . . </span></div></div>",
            "created":1554741420,
            "id":2642059,
            "title":"\"Though he'll have to find you first.\""
        },
        "122322":{
            "author_id":"mote",
            "author_name":"Mote",
            "choices":[
                "in his chest hair to settle in a darkened corner booth.",
                "in a shotglass to head to the bar.",
                "straight into his shorts to take to his home."
            ],
            "content":"<div class=\"\"><div> <span>Buck's bearded visage broke into a broad smile as he explained how, as the doorman, he had control of a slice of the bifrost that controlled the size of the visitors and that he could use that to alter your size further, an explanation that went over your head as the brilliant white light surged around you again.<br>\r\n<br>\r\nBuck had fingered a small geode keychain hanging from his belt with his free hand and you felt the world stretching out around you once more, forcing you to adjust your footing as the fingerprint you stood upon grew wider and wider, leaving you soon enough standing on a single ridge between two canyons, the titan's face filling the sky overhead as he boomed. <br>\r\n<br>\r\n\"Ah, Red, yer just in time.  I got a lil prize for you!\"<br>\r\n<br>\r\nThe bouncer grins, squinting at that speck of humanity, his bright green eyes having to focus on the smaller-than-a grain-of-sand shape on the other burly biker's finger, their combined breath and volume of their voices at this range threatening to send you flying.<br>\r\n<br>\r\n\"Well goddamn, the gods were kind, lookit this lil' bastard.  Thanks for keeping a eye on him, Buck. I'll take real good care.\"  Red laughed, extending  a hand for Buck to deposit you in before he tucked you away for a trip. . . </span></div></div>",
            "created":1562001120,
            "id":2681075,
            "title":"Like I said, Red likes 'em small.  Much, mu..."
        },
        "13":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "The biker pushes Bill in first, then follows after a moment. (Bill shrinks)",
                "They enter together. (Both shrink)",
                "The biker enters first and instructs Bill to follow after. (Biker shrinks)"
            ],
            "content":"<div class=\"\"><div> <span>While Bill was standing there deciding on whether to take the bouncer up on his offer, a heavy hand slapped onto Bill's shoulder and quickly snaked in front to pull him back. Bill felt himself collide with the torso of a larger man, presumably one of the bikers from the lot. A gruff, deep voice rumbled, \"Welcome to Jotunheim, little man.\" Bill tried to squirm free but a second arm came around front across the chest holding him firmly in place.<br>\r\n<br>\r\nThe bouncer smirked at the scene. \"Guess you got an offer you can't refuse. Maybe he'll let me play with you another time.\" The bouncer reached over and opened the door. It looked more like a barn than a bar; all Bill could see was wide wooden planks for a floor and tall wooden pillars. He couldn't believe the building could be so open on the inside. Where was the bar? Something huge came into view and left just as suddenly. It was a black pillar with a rubber bottom. It almost looked like a boot, but that couldn't be right. <br>\r\n<br>\r\n\"Let's go little man.\" The biker behind Bill herded him towards the door. </span></div></div>",
            "created":1387256400,
            "id":1709582,
            "title":"was approached by another biker while deciding."
        },
        "132":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "Mickey holds on becomes Big Jim's pet with Bill.",
                "Mickey slips out (follow Bill and Big Jim).",
                "Mickey slips out (follow Mickey and his new owner)."
            ],
            "content":"<div class=\"\"><div> <span>\"I've been waiting to get my hands on a little guy like you.\" The biker pushed Bill in through the threshold, but just as suddenly the biker felt himself pushed in as well. Bill felt the larger man bump into him and the both fell through the door onto the hardwood floor. Before the door slammed shut they heard the bouncer chuckling, \"Have fun, little men.\" The biker rolled himself off of Bill and onto his back. Bill groaned as he rolled over himself. He finally got a look at the stocky biker that came up behind him. He was stout though a bit shorter than Bill. The biker was wearing a white tank top and well-worn blue jeans with black motorcycle boots. Black bands adorned his wrists and a chain was around his neck. Just as they were both getting their bearings a giant hand came into view reaching to grasp them.<br>\r\n<br>\r\n\"No...\" the biker mumbled as he was being surrounded by fingers the size of tree trunks. \"No! I was supposed to be big!\" he shouted in panic.<br>\r\n<br>\r\nThe meaty, calloused giant hand scooped both the biker and Bill up and lifted them off the floor. The little men nearly got sick before the fleshy elevator ride stopped before a chest covered in white fur. A harness ring sat at the base of the valley between huge pecs over a firm hairy gut, holding together the black straps the ran under the giant's pecs and over his shoulders. \"Well, good things do come to those who wait. I didn't think I'd get two little men at the door.\"<br>\r\n<br>\r\nThe giant's voice drew the gaze of the little men upward. A bald head with bright blue eyes, a wide nose, and a dense bushy white beard was gazing back down at them. \"And a fine pair of little men you are. My name's Jim, but everyone calls me Big Jim. What're your names, little men?\"<br>\r\n<br>\r\n\"No, this is some kind of mistake. I'm not supposed to be a little man. He,\" the biker pointed at Bill, \"is supposed to be my little man.\"<br>\r\n<br>\r\n\"No mistake here, little man. It's finder's keepers here in Jotunheim. You may have been a big man in Midgard, but you're with the giants now. Now answer my question.\"<br>\r\n<br>\r\n\"Bill! My name is Bill,\" the frightened little man yelled out. The last thing he wanted was to get on this giant's bad side.<br>\r\n<br>\r\nThe giant's eyes looked over at Bill and he smiled briefly. He then brought his gaze back upon the biker. \"Your turn.\"<br>\r\n<br>\r\n\"No! Just let me go! I won't ever come back! Please!\" <br>\r\n<br>\r\nBill saw Big Jim frown though it was difficult to tell through the heavy facial hair. \"That's not a name. If you don't have one I'll have to give you one. I need something to call my new pet. Let's see...Mickey. Yeah, I like that. Well, now that introductions are done, let's get going. I can't wait to start playing with you.\"<br>\r\n<br>\r\n\"No, I'm not a pet! Please...please make me big again...\"<br>\r\n<br>\r\nBig Jim ignored the pleading and plucked Bill from his hand. The giant brought the little man to his chest and pushed him under one of the tight harness straps. \"Hang tight, little Bill.\" Big Jim  did the same with the stocky little biker in the opposite strap. The giant biker rubbed the little men before grabbing his vest and heading out from the bar. Bill looked around as he was brought along on this unusual carnival ride. Even though they had just left the bar, he and Mickey didn't return to their normal sizes. They were still tiny pinned against the giant's furry chest. The chest hair was deep and dense and the little men were nearly hidden by it, let alone the harness.<br>\r\n<br>\r\n\"Heading out already, Big Jim?\" The giant biker turned to face the bouncer. The redheaded giant looked huge before, but he was unbelievably massive now. Even scarier was when Bill realized the giant he was pinned against made the bouncer look small. The bouncer smirked down at the little men behind the harness straps.<br>\r\n<br>\r\n\"Yup. Going home to play with my new pets.\" The older giant stroked the two little men again. Mickey squirmed, trying to get away from the probing finger. The little man's efforts and the warmth of Big Jim's body were making him all sweaty. \"Help!\" the tiny biker yelled to the bouncer. \"Get me out of here!\"<br>\r\n<br>\r\n\"Feisty one your got there. Sure you can handle him?\" the bouncer joked.<br>\r\n<br>\r\n\"Little Mickey here? Yeah, he won't be no trouble. Just needs some training is all.\"<br>\r\n<br>\r\n\"Well, if you ever want someone to take him off your hands, you know where to find me.\" The bouncer leaned down in close. Even though he was the smaller giant of the two, he was still incredibly huge. The redhead inhaled deeply and snaked out his tongue to lick little Mickey. \"Mmm...wish I got a chance at you. Both of you.\" The giant bouncer's gaze shifted over to Bill. \"Take good care of your new pets. I hope you let me play with them sometime, Big Jim.\" The massive bouncer then shifted back up on his stool.<br>\r\n<br>\r\n\"I think that can be arranged sometime, Scott. See you around.\"<br>\r\n<br>\r\nEveryone gave Big Jim a wide berth as he walked to his bike. Bill imagined it was due to the giant's size, but he wondered if the others knew about him, too. As Big Jim raised his right arm to sling his vest on, the harness strap Mickey was under loosened a bit and the little man started slipping. Mickey had continued squirming, trying to free himself before being carried away from the bar. Now he was caught between a choice of slipping free and falling a long way or holding on for dear life and being stuck tiny with the giant biker.</span></div></div>",
            "created":1404536400,
            "id":1823265,
            "title":"They enter together. (Both shrink)"
        },
        "1322":{
            "author_id":"micron",
            "author_name":"micron",
            "choices":[
                "Big Jim makes dinner.",
                "Big Jim relaxes with a cigar.",
                "Big Jim gets ready for bed."
            ],
            "content":"<div class=\"\"><div> <span>Bill watched as Mickey struggled. At this point Bill wasn't sure if the other little man was struggling to get free or keep hold, but it became moot as gravity won and Mickey tumbled off of the giant's body. Bill couldn't see what happened to Mickey and Big Jim didn't seem to react at all to the loss of his second pet. Were they so insignificant that the giant didn't even notice? Bill shivered despite the warm space in which he was trapped. Bill could barely move but he grabbed some of the copious amounts of chest fur surrounding him.<br>\r\n<br>\r\nWith a deafening roar of the bike engine, Big Jim took off with his new prize. It had been a while since the giant had claimed some little men for his own and he was eager to play with his new toys. He had seen Mickey lurking around the bar before; that little man was one of the cowardly lot too afraid to journey into Jotunheim. Bill on the other hand looked to be new around here and Big Jim looked forward to his earnest reactions to this situation.<br>\r\n<br>\r\nBill wasn't sure how much time passed but eventually the bike stopped and the engine was turned off. He could feel Big Jim moving but with the vest blocking his view the little man couldn't tell where they were or where they were going. Bill heard the fumbling of keys and figured they must be at Big Jim's house. After the sound of the door opening, closing, and locking, the giant removed his vest and hung it on a wooden coat rack. <br>\r\n<br>\r\n\"We're home little men.\" One of Big Jim's large hands pulled Bill from his temporary prison but the giant felt the tug on his chest hair. \"Let go, little Billy. Big Jim's got you. Now for your little friend...\" The giant's voice trailed off as he searched under the other harness strap for his lost pet. \"Damn, little fucker must have slipped out. His loss.\"<br>\r\n<br>\r\nBill was chilled by the casual indifference the giant had towards his shrunken men. The shudder didn't go unnoticed by the giant.<br>\r\n<br>\r\n\"You cold, little Billy? Big Jim will warm you right up. Stay here for now and you'll be warm in no time.\" Big Jim pull out the front of his jeans and Bill could see the giant went commando as the giant deposited him into the crotch. The giant was hard and heat pulsated from the huge cock. \"There you go, little man. I'll get you out in a moment when I'm ready for you.\"<br>\r\n</span></div></div>",
            "created":1418274000,
            "id":1901189,
            "title":"Mickey slips out (follow Bill and Big Jim)."
        },
        "14":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "He falls and the bouncer disappears into the bar and the door closes. ",
                "He falls though the door and into the middle of a crowd of giants (Bill shrinks)",
                "He falls though the door and ends up in the bouncers hand.(Bill shrunken)",
                "Bill  sees little men walking around the floor. (Bill giant)",
                "Catches himself on the bouncers arm"
            ],
            "content":"<div class=\"\"><div> <span>Bill waits around for a bit. The stares from the other bikers, looking him up and down like he's on a menu, started to make him nervous. Bill gets up and decides that he has changed his mind about staying. He goes to approach the Bouncer to ask for his stuff back. At that same time the bouncer moves to the door to enter the bar. Bill runs to catch his attention before he goes in. Just as he's about to say something Bill trips on a loss board and falls forward. </span></div></div>",
            "created":1503271020,
            "id":2372131,
            "title":"has second thoughts and asks for his stuff back."
        }
    },
    "info":{
        "author_id":"micron",
        "author_name":"micron",
        "brief_description":"A man gets much more than he bargained for when visiting a new bar.",
        "created":1375331340,
        "description":"<td align=\"left\" class=\"norm\">Bill moved to a new town and was looking for a place to hang out and meet some guys. He saw motorcycles and large men hanging around outside of an unassuming brick building. A few flickering lights shone on the sign above the door proclaiming the establishment to be Jotunheim. Giant's Home. Bill had a good feeling about this place and decided to check it out.<br>\r\n<br>\r\n*****<br>\r\n<br>\r\nThis is a gay male macro story. I ask that it stays to men only, please. No women and no children (children being people less than 18 years of age).</td>",
        "id":1945654,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1597812420,
        "modified":1597812420,
        "pretty_title":"Jotunheim"
    }
}