{
    "chapters":{
        "1":{
            "author_id":"masterwriter1",
            "author_name":"Danube",
            "choices":[
                "The demon chooses Ashley.",
                "The demon chooses Katie.",
                "The demon chooses Sloane.",
                "The demon chooses Mary.",
                "Other."
            ],
            "content":"<div class=\"\"><div> <span>Katie walked up the driveway towards the old, abandoned house. Just looking at it made her shiver. \"Not scared, are you?\" said her best friend Ashley, tossing back her long black hair. \"Course not.\" lied Katie. Truth was, she was a bit scared. The house itself looked ominous, casting a dark shadow over them as they walked up the drive. It almost seemed to be looming over them. Then there was the stories. There were tales of how the people who had built the house had gone mad, and since that day it had been owned by nine consecutive families, all of which had been driven away by some great catastrophe. \"Are you girls OK\" Katie's boyfriend Todd called over his shoulder. \"We're fine, thanks\" Sloane said back, winking. Katie ground her teeth. She <i>hated</i> it when that blond bimbo flirted with her boyfriend, despite the fact that she already had two boys, Cole and Trevor, on the go already. Both of them now caught up with her and began whispering things in her ear. Ashley's boyfriend Peter rolled back his eyes \"Remind me who invited that bitch again.\" he moaned to Ashley. \"I told you, she invited herself. besides, she's the one with the key to the house.\" Ashley pointed out, then turned to wave to the last member of their party, the quite and nerdy Mary, who also happened to be her sister. \"Get a move on, Mary, or we'll lock you out!\" Mary quickly sped up, and they all went in through the door.<br>\r\nInside the hallway, despite the light coming in from outside(a light that was fading as the sun began to sink behind the horizon), It was dark, and naturally one of them (Katie was unsure exactly who) blundered into a hat stand, which toppled over crashed onto the floor. Ashley found the light switch, and they inspected the damage. \"Looks alright to me.\" declared Sloane \"come on, guys, lets take a look around!\" They dispersed through the house, unaware that the shock of the hat stand falling over had actually dislodged a wooden plank in the cellar, which had fallen and cracked open the casket containing the she-demon. The succubus laughed as it shot out of it's prison. \"Free at last\" it yelled as it flew through the house, homing in on the smell of the humans who had set it free. \"I shall reward them for releasing me!\" it laughed. \"I shall drain their life-forces one by one, and then I will be powerful enough to make the whole world beg at my feet. Now, who shall be my host body?\"</span></div></div>",
            "created":1301893200,
            "id":1081997,
            "title":"The begining."
        },
        "11":{
            "author_id":"sabrinadiamond",
            "author_name":"safire_diaz",
            "choices":[
                "Something happens",
                "Someone notices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The demon chooses Ashley and there would be a wooshing sensation as Ashley blinks and her eyes glow green...</span></div></span></div>",
            "created":1496644860,
            "id":2331294,
            "title":"The demon chooses Ashley"
        },
        "12":{
            "author_id":"kitner",
            "author_name":"funky",
            "choices":[
                "The succubus immediately seeks out Todd",
                "The succubus decides to dominate Katie mentally first",
                "The succubus fills Katie in about her history a bit first",
                "The succubus runs into someone else"
            ],
            "content":"<div class=\"\"><div> <span>Katie was scoping out the house trying to find a spot for just her and Todd, she had to keep 'that bitch' from distracting him from her. She opened a door that led to a broom closet, and started to feel as if something hot was creeping up her skin. She looked down to see a black shadow suddenly lunge up into her mouth and ears as she tried to scream, filling her throat and making it hard for her to even breathe let alone let out so much as a whimper.<br>\r\n<br>\r\nThe feeling of heat quickly reaches her tummy then spreads outwards, and Katie feels a strange presence between herself and her body as it starts to move on its own. Her eyes close and she bites her lower lip \"mmmmmmm...\" her body lightly moans as a hand gently rubs between her thighs. \"You have no idea how amazing it is to have a body again... \" her head cocks to the side as her eyes pop open, an feel something digging through her mind, stealing her memories \"... Katie is it? Well, don't you worry about that Slaone, I'll keep Toddy-boy thoroughly entertained.\" Her body started to laugh maniacally and Katie started to scream mentally as she realized just how bad things were about to get.</span></div></div>",
            "created":1311829200,
            "id":1156521,
            "title":"The demon chooses Katie."
        },
        "122":{
            "author_id":"kitner",
            "author_name":"funky",
            "choices":[
                "Now that that's taken care of... (Demoness POV)",
                "Still a shard left (Katie's POV)"
            ],
            "content":"<div class=\"\"><div> <span>\"What are you so worried about, I promise we'll have lots of fun.\" The demoness cooed to Katie. \"Just give in.\"<br>\r\n<br>\r\n<i>No! No-no-no-no-no-please no! just leave, please!</i> Katie gibbered mentally. She was terrified and horrified, but she was starting to get a hold of herself, and her resolve was starting to stiffen. The succubus could tell that there would be some difficulty, and the last thing she wanted was to get distracted as she re-gained her strength.<br>\r\n<br>\r\n\"Very well then, you don't want the easy way, then let me show you just what you'd be missing.\" The succubus closed the door behind her, reached up and turned on the light. Katie could see, hear, feel everything as the succubus began. She saw her dainty right hand dart down and stroke her thighs as her left popped open the top of her shirt. Her fingers began to knead her nipple expertly, eliciting soft moans slightly muffled by her teeth biting her lower lip. She didn't even notice as her right hand ceased its maneuvers to dart under her waistband, but did as the ministrations continued in a much more direct fashion.<br>\r\n<br>\r\nHer body started to shake from the exertions and her legs gave way as she landed upon her pert bottom. She neither noticed cared about the rough landing as her head bent and began mauling her free breast, she was in so much pleasure nothing mattered to her until she was finally hit by an earth shattering orgasm, far beyond anything she had ever before experienced, such was the succubi's skill. Her head lolled back, eyes closed as she basked in the afterglow, feeling it slowly drain away, until her head suddenly jerked back up with a smirk and cracked it's neck. Katie's mind seemingly gone, the only one remaining the demoness.</span></div></div>",
            "created":1312606800,
            "id":1162778,
            "title":"The succubus decides to dominate Katie mentally..."
        },
        "1221":{
            "author_id":"kitner",
            "author_name":"funky",
            "choices":[
                "The door opens to... (bedroom)",
                "The door opens to... (readers choice)"
            ],
            "content":"<div class=\"\"><div> <span>\"Now that that's taken care of...\" The succubus rose within Katie's body \"Lets see what I have to work with.\"<br>\r\n<br>\r\nShe tapped the wall in front of her and a door appeared, the outline spreading from her new fingertips until it solidified, completed. She opened the door and stepped through into her secret hide-away room, 20'x20' it contained a double-wide bed, a full wardrobe that was bigger on the inside then the outside, and a mirror wall. This room she could  access at any time, and the wardrobe magically transported the clothes onto her at her desire to aid in the seductive arts. She stepped up to the mirror and surveyed her new form. \"Not too shabby...\"<br>\r\n<br>\r\nShe looked Katie up and down, taking in the knowledge of this body, seeing what it looked like, and how to best accentuate it. She started at the feet tiny feet, covered in knee high black boots she could feel stretching up to her knees, which led to her new long, lithe legs that seemed to go on forever sheathed in blue boot-cut jeans that hugged her near perfect form with her pert little behind. Her gaze rose to the red fitted, form hugging button up shirt that showed her hourglass shape, but was in disarray due to her earlier exploits, revealing her C-cup breasts supported by a red satin bra. Her gaze rose further to encompass the face, its now wild deep brown hair that reached down the small of her back, the delicate features, the tiny lilted nose, the lush full lips, the once soft hazel eyes that now seemed cold and calculating. \"I can use this... but a few changes might be in order... Now let me see...\"<br>\r\n<br>\r\nShe briefly closed her eyes, and when she reopened them new clothes were on her to size up. The boots had grown to mid thigh, the jeans had turned into a blue ruffled denim mini-skirt, and the shirt had become a hot pink mid-drif tank-top that showed off her taut tummy and a good chunk of her cleavage. \"Hrmmm... something missing, not quite right...\" She closes her eyes contemplatively, trying to  figure it out, and opens them, walking out satisfied. She could feel the wind across her uncovered loins once more, and her freed bosom rocked with each step. It was time to find some men...</span></div></div>",
            "created":1312779600,
            "id":1164040,
            "title":"Sizing up the body"
        },
        "123":{
            "author_id":"theburger",
            "author_name":"ClockWerk",
            "choices":[
                "Demon Is ready to possess Katie"
            ],
            "content":"<div class=\"\"><div> <span>\"Before I fully remove your essence from this body,I like to explain to you my history you may ask any questions now\" \"W-who are you?\" \"Good question I used to be a girl called Amy,I was a priest at a church in Japan now,this church was special due to the fact that only women could priest there but there was a catch the women herself had to be a virgin,I was fine until a young man from another church which allowed non virgin males to be welcome,one day raped me.The women's could smell the sex that I carried that day  it wasn't until I reach the head priest when I became a outcast,she lead me to a door in which a ceremony had to begin in this ceremony she prayed to god to activate my consequences for my sins I watched in agony as I was kicked out by a magical force in the church then it suddenly began to vanish.I ran to my apartment that I was staying at the time then I came into my room bursting to tears when I noticed that my tong was a burning sensation I tried to get a cup of water but when I tried pouring water,the water turned into bitter sand I then realized that I was being manipulated by some strange source it wasn't until after that I thought that that my bladder started crying to be set free rushing into my restroom I was shocked to find that my pussy was gone then replaced as a male penis then I looked into the mirror I saw my face with green scales all over my body with a tail sticking out behind my ass it was then when the man that raped me came in,he came in a tuxedo when I grabbed onto his tie then yanked him to the wall,then I felt a urge like I wasn't my old self then I kissed him draining all of his life source.Then I became known for my horrendous  crimes in Japan,until a Japanese hero fought me enslaving me in a basket that was kept below this very old house.<br>\r\n<br>\r\nYour party awoken me for the first time in years,any more questions before I steal your sexy body for my own?\" \"Yes\" \"Go on with it girl while you doing so I'll be fondling these C cup breasts\" \"Why do you need me?\" \"I need your body as a host so I can store my energy while devouring souls,I can simply leave you anytime I want but your soul won't come back into it since it'll be infested with the demon playground\" \"I told you enough\"</span></div></div>",
            "created":1320624660,
            "id":1219137,
            "title":"The succubus fills Katie in about her history a..."
        },
        "13":{
            "author_id":"masterwriter1",
            "author_name":"Danube",
            "choices":[
                "The demoness explores her new body.",
                "Someone comes in."
            ],
            "content":"<div class=\"\"><div> <span>You go for Sloane, the sexy blonde double-timer.<br>\r\n<br>\r\nPredictably, Sloane has stopped in a bathroom to touch up on her make-up, while the others have gone ahead. She is gazing into the mirror and applying her scarlet lipstick, when she sees something flit across the mirror. She whips around, but there is no-one there. Idiot\" she mutters to herself. Then a shadow falls over her, and she looks up. The demoness is floating above her in the form of a black smoke, which seemed to be flowing almost liquid-like through the air. The demon's dark red eyes gaze down at her with glee, and as Sloane backs away, she hears the demon start to laugh. Sloane turns and runs, but the demon past her and blocks her way out of the door. She stops and looks for somewhere to run to, but there isn't anywhere. Then the demon speaks \"Don't worry Sloane. Soon, everything will be over, for you anyway. For me, this is only the beginning.\" Sloane opens her mouth to scream, and the demon pounces. The cloud of smoke suddenly shoots towards her and compresses itself down her throat. For Sloane, t feels as if she is drinking liquid fire. The heat of the demon passing down her throat is unbearable. Soon the cloud has all gone down into Sloane, and she can feel the heat of the demon's spirit moving inside her, coiled inside her belly. She tries to walk towards the door, but as soon as she tries to move, she feels the heat inside her chest suddenly expand outwards, and she falls over backwards. She feels the heat expanding down her legs, down her arms, into her breasts, and finally, into her head. She thrashes around on the floor for a long time in agony, but then she suddenly relaxes an falls into a deep sleep.<br>\r\nSloane wakes up to find herself standing at the mirror, just as she had been before the demon attacked. Thinking that it was all just a dream, he tries to move, but finds that she can't. Looking into the mirror, she eyes ha her eyes, once blue, have now turned red. Then she feels her mouth opening and her voice comes out except she isn't the one using it. \"Unfortunately Sloane, that wasn't a dream. I've just taken over your body, and a very nice one it is too\" She says, fondling Sloane's breasts. \"Stop that right now!\" Sloane yelled, except she only yelled inside her head. \"I don't think so\" said the demon through Sloane's own voice. \"In fact, I' quite like to inspect my new body properly.\"</span></div></div>",
            "created":1302152400,
            "id":1083953,
            "title":"The demon chooses Sloane."
        },
        "131":{
            "author_id":"theburger",
            "author_name":"ClockWerk",
            "choices":[
                "Demon is ready to possess her"
            ],
            "content":"<div class=\"\"><div> <span>\"Did you really believe that most people that once lived in this house weren't driven by some insane,catastrophic force?\" \"No\" \"Figures,look like you're only good for acrobatic exorcize,plus you have a wonderful full figured that gives off a seductive manner,it been a long and I repeat a very [B]Long[/B] time since I had a body this seductive\" \"Stop rambling about my beautiful body,what do you want with me!\" \"Oh it's quite simple dear,I'm a demon, a women to be correct that roamed this planet 200 years ago until I was double crossed by my true love.He simply stripped me of my human body then put me in that strange basket that lay beneath this horrible unbearable house,luckily your little secret party earth quaked my basket until it fell frontward thus releasing my spirit\" \"And why do you need me?\"I knew she was trembling as she spoke that with frighting fear, \"I simply need your body to walk the earth again,feeding off the life source of horrid individuals who bear some remembrance of my futile past\" I lay there as she kept blabbing about how evil and treacherous I was,pity girl.Losing my patient I fondle with the shirt causing the buttons to come off throwing the shirt into the pitch black corner I hear that pesky girl think again,\"Oh no,are you going to do what I think you'll do?\"I didn't respond as was busy at work untie her bra \"It been so long,I forgot how to untie a bra\"until finally it collapsed onto the cold wooden harden floor,two DD cup perky breasts were in my hands now to fondle,\"Damn it,these breasts are going to be so easy to get to erect!\" \"No,leave my tits alone,they're so beautiful when I hold them!\",\"To late girly they're now in my possession and soon will your entire body as well!!,haha\"Just saying these things made my new womb erupt with honest pleasure,I knew what would come next state Two of my plan. </span></div></div>",
            "created":1320469200,
            "id":1218270,
            "title":"The demoness explores her new body."
        },
        "132":{
            "author_id":"theburger",
            "author_name":"ClockWerk",
            "choices":[
                "The next arrival",
                "Leaving and heading to the nerby city."
            ],
            "content":"<div class=\"\"><div> <span>\"H-hello, anyone there?\" A voice said quietly, hoping not to disturb any spirits that lived inside of the house.<br>\r\n<br>\r\n\"Hmm, my first victim. This will be exciting.\" Sloane thought, as she silently approached her victim. With no time to spare, you begin to walk the hallway looking for the unsuspecting victim. \"H-hello, anyone else there?\" Sloane shouted in a frantic tone.<br>\r\n<br>\r\n\"Sloane, is that you baby! Don't worry, I'll kick who's ever ass is trying to hurt you.\" The footsteps begins to get louder as Todd begins to sprint, Todd continues to shout as he tries to find the location of his girlfriend.<br>\r\n<br>\r\n\"Almost there baby!\" Sloane shouted as she put on a crooked grin, she was excited to finally deprive the energy of these useless prime apes known as males. It was also a male that deprived her of her beautiful seductive form, well no more.<br>\r\n<br>\r\n\"I finally found you baby\" Todd says as he stops to take a quick breath, \"With all that running, it tired me out\" Todd once again said as he took a quick breath, it was clear that he was exhausted from finding his girlfriend. \"Mmm, you look rather fetching today honey\" Sloane begins to say as she rubbed her breasts up and down to seduce Todd, \"Whoa, you never down that to me babe\" Todd soon begins to fall on the floor, detaching her frail cheerleader outfit that showed off a lot of cleavage.<br>\r\n<br>\r\n\"Whoa babe, you never were <b>that</b> slutty!\" Todd begins to slowly raise in pitch as Sloane begins to move her curvy body around Todd's waist, causing him to grunt a bit.<br>\r\n<br>\r\n\"Babe, what the fuck are you doing to me?\" Todd begins to breath more heavily then before as Sloane begins wrapping around his bold and strong  body like a boa constructor, \"You foul males deserve this for destroying my women hood!\" Sloane begins to yell as she continued to squeeze him.<br>\r\n<br>\r\n\"Hold up babe, I never did anything!\" Todd gasped as he was slowly running out of air, \"Mmm, maybe so but you use these females as sex toys!\" Sloane begins to yell even harder as her pelvis begins to reach Todd's pelvis.<br>\r\n<br>\r\nFinally, Todd became nothing but a dead deprived corpse.</span></div></div>",
            "created":1339815300,
            "id":1360575,
            "title":"Someone comes in."
        },
        "14":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Sloane",
                "Katie",
                "Ashley",
                "Todd",
                "Cole"
            ],
            "content":"<div class=\"\"><div> <span>Free from your imprisonment you decided to look for a new body. After a little bit of searching you came across what looked to be a geeky girl all by herself. \"I don't see why I had to be dragged here.\" Mary said (she is a girl with black frizzled hair. She is wearing a big baggy blue hoodie that hides a lot of her upper body a black t-shirt and a pair of black flat heeled knee high boots hidden in a pair of grey baggy sweatpants she also is wearing a pair of glasses and a black headband.) \"Definitely not my first choice but I can work with this.\" you say as you approach her. \"I really get a bad feeling being here.\" Mary says. After a bit of planning you dive down Mary's mouth and she falls over as you possess her.\"Hmm you were hiding a lot under these all of these baggy clothes weren't you missy?\" you say with Mary's mouth as you get up. \"Why can't I control my body?!\" you hear Mary mentally scream in the back of your mind. \"That's because dear girl, I have claimed this body as my own.\" you say. \"Who are you?!\" you hear Mary scream. \"So you want to know who I am hmm? Well my name is not important but I guess I'll start at the beginning. Once upon a time I used to be a man. Not just any man mind you but a man who seduced and fucked every woman he came across. To me it was the best game in the world. Then one day I happen upon the most beautiful girl I had ever seen and naturally I tried to seduce her but she would have none of it. Day after day I would try and try but she would not budge. Eventually I started to get mad so one day I broke into her house raped her then I killed her. And eventually the police found out who killed her and I was sent to the Gallows and hung. After that comes the interesting part, I was sent to Hell and for my crimes against women everywhere I was sentenced to become a succubus: a female demon that feeds off of men's semen and life energy. So I was trapped in hell for what felt like an eternity drinking other demon's semen and getting raped by demon's twelve foot cocks that I started to enjoy it immensely even more than fucking women when all of a sudden I was thrown back into the human world.Turns out a group of men forced me into some woman and wanted me to fuck them. I did more than just that, I ate their life energy causing their souls to be thrown down to Hell. After that I went around eating more men's semen and life energy until some exorcist locked me up in this abandoned house, you and your friends release my from my imprisonment and here we are now.\" \"What does all that have to do with me?\" Mary says nervous. \"Well I am taking your body and absorbing your soul to have all your memories so I can know everything I need to about the future.\" \"You're going to do what?!\" Mary says panicking. \"Absorb your soul which means no heaven nor hell for you just nothingness.\" you say as you start the process. \"No, please don't!\" you hear Mary scream. As you absorb her soul you hear her scream fade away in the back of your mind until you hear silence as she is fully absorbed. \"So that is what the future is like huh, this is going to be fun!\" you say as you search through your new memories. \"But first I think it's time for a wardobe change.\" you say as you look at you new body's clothes. First you tighten all of your clothes to extreme levels to show off your curves. \" Oooh it always feels sooo good to wear tight clothes as a girl!\" you say as you feel immense pleasure from the tightness of the clothes. Next you shorten your hoodie and t-shirt's torso part so you constantly show off some midriff. Next you shorten your sweat pants and turn them into tight denim bootie shorts and you grow a retractable succubus tail with a head of a penis attached to the end so you can fuck women. \"I like these boots but the can be a little longer.\" You say as you grow them to mid thigh and add slight heels to them. \"Oh yeah,much better now to take care of these bad eyes.\" you say as you take off your glasses and crush them like paper with your superhuman strength. Next you morph your eyes making you be able to see and they change into pure black eyes with yellow slits for pupils.. \"Let's take care of this bad hairdo.\" You say as you straighten your hair. You proceed to walk away when you find a picture on the ground. It is a pucture of the old Mary with her friends. You laugh and proceed to burn it away with blue flames until it is nothing but ashes. \"I don't have all my powers back yet I figure I need to feed on some men but I still have my rainbow flames to protect my new permanent body.\" You say (Each color of flames has a unique trait Red flames can burn on anything even water. Orange flames is just a normal fire so it isn't so suspicious when people see in compared to the other flames. Yellow flames can cause attackers to freeze in place so they don't move while they burn alive. Green flames can only be put out by normal fire or no air. Blue flames which only burn away what you you want it to burn ie: clothing off a man and leave the man unharmed. Purple flames which fly around in the air. Pink flames which can survive even without any air. Brown flmes which turns any dirt or rocks it touches instantly into lava. White flames which burn 1 million times hotter than the sun. And only used for absolute extreme measures Black fire which never can be put out not even by you, you can only stop it's spread. Rainbow flames just using all of the previous ones mixed together except for the white and black ones. All but the black one can be put out by holy water. ) As you walk away to go find the others you happen across a mirror. \"Oh yeah my new main form might freak them out.\" you say \"Well I guess I can make old Mary my second disguise form.\" With that you transform into the original form with the baggy clothes. \"Truth be told I I think this form is a very cute with the glasses and everything but I'm always going to go back to my new succubus one.\" You then leave the room in search of other people to feed off of when you come across...</span></div></div>",
            "created":1496619900,
            "id":2331039,
            "title":"The demon chooses Mary."
        },
        "142":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Finish the job and go absorb Ashley",
                "You need a dick in you right now(go find one of the guys)",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>As you you walk around the old mansion you find the entrance door and weld it shut with green flames then put them out with your mind. \" There, now nobody can leave\" you say as you continue to look for someone. Eventually you come across Katie who was siting on a couch in what looked looked to be an old lounge area. (Katie is a brunette with soft hazel eyes wearing a red button up shirt, a pair of black knee high boots with a slight heel, and a pair of jeans.) As you walk up to her she notices you \"Oh, hi Mary have you seen Todd he said he was going to go to the bathroom and hasn't come back since.\" Katie says. \"N-no I h-haven't, sorry.\" you say trying to act like Mary. \"Well I just hope that Bimbo isn't trying to sink her nasty claws into him.\" Katie says sounding a bit upset. \"When I'm done with him you're going to wish it was Sloane who sunk her claws into him.\" you think to yourself. \"Well okay, why don't you come sit down, I always could use an ACTUAL friend to hang out with.\" Katie says as she pats the spot next to her. As you look at her sexy body deciding  what to do with her you sit down with her. \"Hmm if anybody here finds out who I really am and what I've done to Mary I'm going to need another disguise.\" you think to yourself  \"Ooh, I know! I'll just absorb Katie's body and soul and make her form my secondary disguise.\" You quickly grow out your tail and wrap it around her head and mouth. \"Mmmmmmmmm?!\" Katie screams but is muffled by your tail that she tries to get off her to no avail. \"Sorry sweetie.\" you say as you transform into your succubus form \"to make a long story short I absorbed your friend's soul and now I'm going to do the same to you.\" you say. You then widen the head of your tail and in a fraction of a second you unwrap your tail around Katie then cover her with the head of your tail cover her head. You then proceed to slowly suck her whole body into yours. \"Oooh, that feels so good.\" You say as you unzip your bootie shorts and start masterbating. When you fully absorb Katie you climax. All of a sudden you feel your succubus body change. When you turn around to see black demon wings sticking out of your hoodie. You also look up and see that you have grown demon horns above your headband.(they look like ram horns but black.) You also feel the inside of your body change. It removed all your organs except your reproductive organs and connected your vagina and your ass to your throat by a tube and that tube and your throat became an extremely tight vagina. \"It seems I'm back to full power.\" you say as you transform into Katie. (All your new powers: web sling out of your mouth,  so you can tie up anyone who might try to run away can also by used like fiberwire to cut anything you deem a threat. Imp summon, summons a three feet tall devil girl dressed in tight thigh high leather boots, a tight leather corset and long tight leather gloves, she absolutely obedient to you an will do whatever you want her to you can even possess her and she would still be a happy slave to you, and any dick put in her will magically fit inside her.  Possession, you can possess females while trapped in your host body. Dark Elemental Construction, look up Monster Girl Encyclopedia's Wikia and look for Ignis, Gnome, Undine, and Sylph the dark versions of those are what their corresponding elemental looks like and they can manipulate their element to a degree they will obey your every command and can possess them too. Shadow magic, where you can manipulate the shadows whether to use them to attack someone or to blind someone so you can get away. Invisibility, self explanatory. Male transformation, you can turn into your old human self for an extremely short period of time 1 min maximum you can only do this once a month. Summon a Demon sword, just a bunch of regular looking swords that can by only wielded by a demon. And finally Curse, which bad things happen to whoever you curse or bad things happen if someone interacts with the thing you cursed like this house you cursed years ago. Most of that is to protect yourself from Exorcists who try to extract you from your host and stuff you in some box hide you away in some location, Demon Hunters who just kill your host and send you back to Hell, Some random wacko with a dangerous weapon, and Angels.) As you examine your new form. \"Oooh Katie's body feels so good to rub and I just love this outfit she wore especially these boots.\" you say as you move your new legs side to side to get a full view of them. You then proceed to pull down your jeans and panties down grow out your penis tail and stick it up your vagina. After several minuties of hard deep thrusting you climax and retract your tail. After you clean your self up and pull back up your panties and jeans and straighten your clothes out, see Sloane walk in. ( she is a blonde with blue eyes wearing a tight white blouse that leaves little to the imagination, a tight blue skirt which also leaves little to the imagination, and black open toe wedge sandals.) \"Hey, I don't like asking you for anything but you seen Cole and Trevor they both wandered of in different directions and I can't find them.\" she says \"No I haven't\" you say waiting for the right moment to strike. \"Well I'll go look somewhere else maybe I can even find Todd.\" she says smirking at you while she turns around to go find them. When she has her back fully turned you do the same thing to her you did to Katie then turn into Sloane. \"She maybe a massive bitch but she has an excellent body and I just love her outfit as well.\" you say looking your newest form over. \"Oh, well, time to go back to being the lovable and shy Mary.\" you say as you transform back into Mary along with her baggy clothes. \"Whelp, I guess I'll go find one of the guys to fuck and go absorb Ashley while I'm at it.\" you say. As you leave the lounge you weld the door shut with your green flames. \"Don't want to leave any evidence I might have left behind findable.\" you say as you walk away.</span></div></div>",
            "created":1496638860,
            "id":2331255,
            "title":"Katie"
        },
        "1421":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Cole",
                "Trevor",
                "Todd"
            ],
            "content":"<div class=\"\"><div> <span>\"Wellp, I might as well find Ashley and add her to my collection, that'll give the boys a reason to stay so they can search for their women.\" you say as you search for Ashley you eventually find her in a bedroom siting on the bed texting. ( she is a black haired girl with green eyes just like Mary, she is wearing a dark green t shirt, a black leather jacket, a pair of beige pants, pink and white striped socks, and she had a pair brown knee high wedge boots on the ground next to her.)  \"Oh, hey Mary.\" Ashley says. \"Have you seen Katie around? I tried calling her but she did'nt answer.\" \"Y-yeah I saw her downstairs she was fine it pretty bad bad reception downstairs.\" you lie. \"Well, ok if you say so Mary.\" says trusting you. \" Why don't you take you shoes off hop on up here?\" Ashley says as she pats the spot on the bed next to her\" W-well ok.\" you say as you pull up your sweat pants and unzip your wrinkled boots and toss them off to the side and hop up onto the bed. A few minutes of relaxing later... \"I'm still worried you stay here I'm going to find Katie.\" Ashley says as she puts on her boots. You put your's on too. \"I can't let you do that Ashley.\"  you say as you run in front of her with superhuman speed. \"How did you...\" Ashley starts to say. Quickly you turn into your succubus form and do the same thing you did to Katie and Sloane. You a change and watch as your skin and tail turns into a pure red shade. (New powers time: summon hellhound, summons a loyal hellhound that only you and other demons can see. Electricity magic, stun or fry anyone with electricity you can also make it trail behind you when you run like The Flash and you can change it's color. Mist form, transform into a cloud of mist and go through cracks in walls and doors.) After you feel the changes have ended you transform into Ashley. \" Wow, she had a really good body and once again I love the way their outfit feels especially these tight boots.\" you say as you look over your newest form. All of a sudden Peter walks in \"Pretty creepy place huh Ashley.\" he says \" Yeah but now we got this room to ourselves.\" you say as you lock the door secretly welding it shut form outside the bedroom, get naked, and lie on the bed. \"Yeah we do don't we.\" he says as he gets undressed. When Peter is fully naked climes on top of you his giant fully erect penis looming over you. \" Ready when you are.\" You say staring at it. He then proceeds to thrust it into your vagina thrusting in and out. You moan as you clamp your vagina down on his penis so he can't escape. After several long thrusts you both begin to climax him shooting is cum all over the inside of your vagina. \"That felt really good but I'm not done yet.\" you say as your vagina sucks every drop of fluid from his body turning him into a pile of of dried skin and bones. \"Thanks for all that life energy, enjoy an eternity in Hell.\" you say as you reach into your vagina pull out some of his semen and eat it. \"Mm mm mm nothing tastes better than warm fresh semen.\" You promptly put back on Ashley's clothes. \"Hmm now that I'm done with him.\" you say looking at the dried up remains of Peter \"I guess I'll go back to being the innocent Mary again.\" you say as you feel your body and clothes change back into Mary's \"Now to go after the rest of the guys before I burn this place to the ground. You then try to open the door but you remember you you welded it shut \"Oh yeah, I was too busy seducing him I forgot I welded this shut so he couldn't run away.\" You say. You then turn into mist go through the crack under the door and then turn back into Mary.\"Now who to go after next?\" you say as you walk away from your freshest kill.</span></div></div>",
            "created":1496650020,
            "id":2331324,
            "title":"Finish the job and go absorb Ashley"
        },
        "14213":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Look for more female souls to absorb",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>As you walk around looking for the rest of the guys you happen to find Todd in another. You change into Katie before he sees you. \"Oh hi Katie I didn't see you there.\" he says \"Well now that that we are alone do you want to do it?\" you ask. \"Sure I would love to\" he says as he gets naked and lies down on the bed waiting for you. You strip down wearing nothing but your boots as you climb into the bed and hover over him. \"Are you ready?\" you ask. \"Yeah, I'm ready.\" he says as he flips you over and sticks his erect throbbing penis into you pumping it in and out. You moan as you clamp down on his penis and wrap your boot-clad legs around him so he can't leave. Eventually after a lot of constant pumping you both climax. After that you suck him dry, sending his soul to Hell like you did to Peter. You find some of Todd's cum on the bed so you pick it up put it in your mouth and swallow. \"Salty, just the way I like it!\" you say as you like your lips. \"Well let's get dressed.\" You say as you put Katie's clothes back on.  You find Trevor and Cole and you do the same with them in Sloane's form. Later after you've dried up Cole... \"Wellp, that was the last person here.\" you say as you transform into your succubus form. \"Well, I'm going to miss this place I sure have a lot of memories here. But there is a lot of evidence here of plenty of killings.\" you say looking back at Cole's dried remains. \"So as much as I like this place for this is the place I was first summoned, I'm afraid I'm going to have burn this place to the ground.\" With that you fly out the window and land in the front of the mansion. \"Hmm some Green flames should do the trick that way rain doesn't put it out.\" you say as you light the old mansion on fire. \"Hmm judging by the memories I got from everyone, no one would care if all these people suddenly went missing. That's good for me at least so I can keep these forms, but I do want collect a lot more.\" you say \"Well judging by their memories a the cosest town is twenty miles away so no one will see the fire.\" you say as the mansion has already burned away leaving nothing but a giant pile of ash. Wellp, I guess it's time to head into town and collect more forms. I'd pretty scary with my red skin and bat wings so I better head into town as one of the girls.\" With that you transform into Mary. \"Much better.\" you say as you look at yourself. \"Oh there's there car they drove here in.\" (It's a red SUV) You get in the car and find where the keys were and start the car and drive away. \"Look out world, here I come!\" you say as you drive away from what was once the mansion towards the town in search of new prey.</span></div></div>",
            "created":1496653980,
            "id":2331338,
            "title":"Todd"
        },
        "142131":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Go find some men and have them put their dicks in you",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>After several days of looking for more girls to absorb who nobody will notice went missing you find five girls Taylor( she is a rehead who wore a pink shirt jeans and a pair of black buckled boots when you absorbed her.) Stephanie( A brunette MILF who wore a thick cozy turtleneck sweater dress and black thigh high stiletto boots.) Her 7 year old daughter Lily (who wore a red button up coatdress, white tights and black boots) Megan( a blonde ditz who wore a black long sleeved tank top, black yoga pants, and knee high uggs.) And finally Jennifer( a brunette preppy rich girl who wore a black french beret, a red wool sweater and black skirt and black over-the-knee boots when you absorbed her.) After that you ponder what to do.</span></div></div>",
            "created":1496674620,
            "id":2331443,
            "title":"Look for more female souls to absorb"
        },
        "1421311":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Go look for some more people",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>As you were walking around at the middle of the night in Mary's form you happen upon a dive bar. \"Oooh maybe I can find some men who would love to take me home with them.\" As you approach the bar you see Mary in the reflection. \"Oh yeah I should probably do something about this look.\" With that you sneakily walk in to an abandoned alleyway. \"Hmm I know just who to pick.\" you say as you say as your body and clothes stretche out turning into Stephanie. \"Mm transforming into other people feels sooo goood!\" you say as when you fully transform into Stephanie you climax and cum all over your new panties. \"Mmm that felt good but I better dry these.\" you say. Your pussy then begins to suck in all your juices back into your vagina and travel up your tube to your mouth.\"Mmm delicious, but I'm even hungrier now so I better find some guy soon.\" you say as you head towards the bar. When you enter the bar you sit at the counter waiting for your prey to come for you. Eventually you see a young brunette man walk in and sit next. \"Hey bartender! I'll have two shots, one for me and one for the lady.\" he says motioning his head towards you.\"Hahaha what a rank amateur! But, I am hungry so I guess I'll humor him for a little bit.\"  You think to yourself.\" So good looking do you have a name?.\" he asks you \"Yeah, it's Stephanie.\" you say back to him.  \"So now that I got you that drink why don't you come over to my place.\" he says. \"Wow he is more of an amateur than I thought I almost feel bad for him. Almost.\" you think to yourself. \"Lead the way.\" you say as proceeds he leads you to his car and drives you to his apartment. When you both enter his apartment He tells you to wait outside his room and after a little bit he tells you to come in and look to see his fully erect penis is... tiny. You sigh as you get naked and do the same thing you did with the other men. (New power time: portal door summons a portal door that leads to  a one  bedroom apartment. The apartment as of the moment only has a couch and TV with every channel on the planet hooked up to it is a N64 with some games scattered next to it, a fridge stocked full of normal food [which you can still eat, it just for pleasure reasons not to actually feed on when you get hungry] and in the bedroom a bed and the coziest blanket you ever touched.) Afterwards as you put your clothes back on... \"Boy that guy was just full of let downs.\" you say as you zip your boots back up.\"Oh well, I guess I have to dispose of the remains.\" you say as you burn away his remains and throw the ash left behind in his garbage. As you leave you come across two girls, Rebecca( A Black Haired Native American wearing a black t-shirt, a denim jacket and denim skirt, and brown knee high fringed boots.) and Kim( a black haired asian wearing a black hoodie, white t-shirt, grey skirts, and open toe wedge sandals.) You quickly absorb them without anyone noticing.  \"Hmm I better  change my form just in case someone saw my enter with that guy.\" With that you trarnsform into Mary. \"Ahhh, I just love these clothes they're so roomy and cozy.\" you say as you hug yourself in your . \"I guess I should leave now.\" you say as you walk away lighting the apartment on fire with orange flames so no one is not so suspicious of some supernatural event happened just for your own amusement. You decide to leave this town and head out to the city a lot of miles away. \"I've always been a city girl anyways.\" you say as you drive off to the city.</span></div></div>",
            "created":1496716980,
            "id":2331799,
            "title":"Sexy fun time"
        },
        "14213111":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Next day",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>After driving to the city you decide to explore. \"Wow, so this is a city huh? It's huge!\" you think to yourself.. You then walk down an alleyway and summon your portal door go through it and close it back up with nobody seeing what is happen. \"It's been fun wearing your form Mary but I don't think you are much of a city girl.\" you say with that said you begin your transformation into Sloane. Your hair becomes un frizzled and turns blonde and your hairband disappears. Next your eyes changes color from green to blue as your glasses disappear. Next you feel your breasts expand a full size. After that your hoodie disappears and your shirt turns white and becomes a tight blouse that puts your cleavage on display. \"Mmm yeah I love this this shirt it really does make my tits look good.\" you say. Next your sweatpants shrink, merge together, and turn blue as they become a blue miniskirt. \"Mmm mm mm I love the way this skirt makes my as look\". you say as you look into your full body mirror. Next you feel your socks disappear as your boots shrink down while wedge heels rise turning them into wedge sandals finalizing your transformation into Sloane. \"These heels look so good on me, I really do like Sloane's form she is much more of a city girl look than Mary.\" you say as you look at yourself in the mirror. you then pull down your skirt and panties and start masturbating. After a lot of fingering you cum all ober your hand. You then proceed to eat your cum off your hand. \"Mmm delicious makes me want to go get some semen in me.\" you say as you snap your fingers, magically cleaning your self off. You then pull up your panties and skirt and leave your portable apartment without anybody seeing you. You wait until night and manage to absorb four more girls without anybody noticing their disappearance, Crystal ( a dirty blonde haired girl who wore a striped long sleeve dress with a brown leather belt wrapped around her waist an open blue vest and brown knee high boots.) April ( a black haired girl wore a pink and white scarf, anoversized light green wool sweater covering a white skirt white wool tights and black over the knee boots.) Olivia( she was a blonde haired girl whio had her hair tyed up in a bun she wore a black business suit and skirt with rectangle glasses with black 1 inch heeled boots) and Charlotte (an African American girl with long straight hair who wore a yellow dress and black gogo boots.) and after a long day of hunting and feeding, you go back to your portable apartment and kick off your wedge sandals, get in your bed, and go to sleep. THE NEXT DAY...</span></div></div>",
            "created":1496728140,
            "id":2331890,
            "title":"Go look for some more people out in the city"
        },
        "142131111":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Explore Hill Valley",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>The next day you get ready for your day of hunting more men and women you take a shower and get dressed. \"You know, Sloane is just not doing it for me today.\" You then feel your body body change as your tits shrink down a whole size. Next your blouse tightens and turns red as it turns into a button up shirt. Next your skirt lengthens and turns into denim and splits each half wrapping around a leg forming jeans. Next you feel your wedge heels lower into just a slight heel and the straps turn into black leather wrap around your feet, rise up and tighten forming boots. Next you feel your eyes change from blue to hazel and your hair changes from blonde to brunette. Finally your face changes as you finalize your transformation into Katie.\"Well let's take this body for a spin shall we?\" you say as you leave your portable apartment.as you leave into the night you come across two girls Alex( a brunette wearing a blue and white spotted t-shirt that shows midriff over a red and white spotted long sleeved shirt, a black minskirt, knee high red and white sock and black buckled boots. and Zoe( a girl with short black hair with pink highlights wearing a black t-shirt with a picture of a skull on it a dark grey hoodie and a pair of jeans with holes in them and a pair red knee high tennis shoes with white laces and a zipper in the back.) you quickly absorb them. As you turn to walk away you feel a sharp pain in the back of your head and black out. When you come to, you have a handkerchief tied around your mouth, your hands handcuffed behind the chair your torso is tied to, and your legs are tied to the legs of the chair. \"Hello, nice of you to wake up\" says the man sitting in a chair across from you. (He is a brunette wearing a leather jacket lined with what looks to be kevlar and black cargo pants with every pocket looking like they're going to burst with whatever is inside them, and a pair of black tennis shoes. It's clear to you he cares more about his style than his safety.) \"Since you can't speak I'll tell you what I want with you. You see I am a paranormal hunter trying to hunt down any proof of supernatural being and paranormal activity and find a way to put a stop to it. I have seatched everywhere on the planet  and I could never find any concrete evidence of supernatural beings until YOU came along. I saw you with my own eyes, change into a demon and eat those girls then change back but for some reason, my mind is telling me that those girls are still alive and off somewhere urging me not. I figure it is just a defense mechanism for yourself so everybody is forced not to care so you can have your meals. So that is why I cut myself so you will never leave my mind. At first I thought to turn you in for proof of a supernatural beings living in our world, but the more I thought about it to let monsters like you live in our world harming people is just too evil for me to let go. So, here's what you are going to do for me; you are going to tell me every thing you know then, I MIGHT let you go.\" He says as he removes the handkerchief tied around your mouth. \"I'm not going to tell you anything after all, that would just ruin the fun I'm going to have with you some other day.\" you say as you break your bonds and melt the handcuffs off. \"What the hell?!\" the guy says as he grabs his knife ready to stab you if you approach him. You then tie him up with your web. \"I'd love to stay and chat but I have to go.\" you say as you go up to him and kiss him on the cheek. \"Bye you say as you leave him tied up. \"Tell you what mister man; if you survive this and manage to capture me again, I'll you everything I know.\" you say as you light the abandoned building on fire with green flames. After that you find your car and drive off leaving the city and the Man behind. On your way you happen upon a playground with five little girls Lulu( an asian girl with long black hair with sunglasses laying on top of her head. She was wearing a purple scarf, a long sleeved sweater attached to a miniskirt, and black over-the-knee boots with a bow on the back of each of them.) Abby( a brunette green eyed girl with a ponytail wearing a brown pocketed vest over a white long sleeved shirt, a grey skirt, and black boots with white fur on the top.) Susy ( a brunette blue eyed girl in a pink dress and white knee high socks and black janes.) Anna( a girl with short blonde hair wearing a red headband, denim jacket, a black t-shirt, grey wool pants, and red tight rainboots with a bow on each ankle.) Grace (a dirty blonde haired girl with glasses wearing a denim overall dress, white shirt, and brown boots.) You quickly absorb them all without anyone looking. \"Need some lolis for those pedophiles.\" you say as you drive away. After a couple of hours of nonstop driving only taking a break to refill your SUV. you enter a new town. \"Huh, Hill Valley. that has a familiar ring to it.\" you say as you park your car in your magical garage hammerspace to explore the town. \"I should probably change just in case that guy ever shows up while I'm trying to have my fun.\" With that you quickly turn into Mary. \"This should do quite nicely.\" you say as you look yourself over. \"Wellp, time to go find some more people.\" you say as you wander into town.</span></div></div>",
            "created":1496797200,
            "id":2332250,
            "title":"Next day"
        },
        "1421311111":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "A woman",
                "A man"
            ],
            "content":"<div class=\"\"><div> <span>As you wander around you find an empty playground. Your boredom getting the better of you, you turn invisible so nobody will notice you transform. First you feel your tits and bra vanish without a trace. Next you feel your glasses disappear as your eyes can see without them now. Next you feel your pants tighten and turn white as they become tights. Next you feel your boots tighten as they lose their wrinkles and gain a slight heel. After that you feel your hoodie thicken as it turns into a childs button up coatdress. \"These child clothes are really tight on me.\" you say. Soon after you feel your body tighten as you shrink, you feel your hair tingle turning a frizzled black to a straight brown. Finally you feel your face change as you turn visible, completing your transformation into Lily. \"Yay, now I can go play!.\" you say, your child body influencing the way you try to act. You then proceed to get on the swingset and start swinging. After a lot of swinging and having fun in your child body, you are approached by...</span></div></div>",
            "created":1496811120,
            "id":2332362,
            "title":"Explore Hill Valley"
        },
        "14213111112":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Let's go up north (To a forest town)",
                "Farm time"
            ],
            "content":"<div class=\"\"><div> <span>As you are swinging on the playground you are aproached by an older man. \"Hey there little girl do you know where your mommy is?\" he says with a tone that clearly tells a demon like you he wants to rape you. \"No, I don't know where she is.\" you say, baiting him. \"Well, how about we go find her.\" he says as he lures you into his white van. \"Subtle.\" you think to yourself. As you climb in the back you notice that the walls are insulated and the windows are tinted, so nobody can hear or see you scream for help. You then watch as he closes and locks the back door and unzips his pants revealing a huge penis he then proceeds to rip off your red trench coat your black dress, and pulls down your white wool tights and underwear then sticks his dick into you thrusting in and out. You quickly laugh and clamp your vagina down so he can't move away. \"What the Fuck?!\" he says as he ties to pull out. You then transform into your demon form and suck him dry like all the others. After you unclamp and spit out the dust that was once his dick you feel a change your boots disappear as your legs transform into goat legs and hooves your demon horns grow longer and your fingersnails grow long sharp claws. (New powers time, SNAKES!: summon Devil snakes [Think red and black rattlesnakes with a knife like appendage instead of a rattle and 100% more venomous and 200% faster] indefinitely and as many as you want all 1000% loyal to whatever you say. STORAGE BODY: stuff whatever you want inside yourself it will all magically fit inside with no trace of being there without harming the inside of you ie; a blade, also you will be able to feel it wiggle inside of you if it is alive and you'll feel stuff squeezed inside of you if you have a lot in you. SUMMON INCUBUS MOTORCYCLE; just a normal looking black kawasaki motorcycle but it's sentient and there is a long metal penis on the seat to help secure yourself because it can reach the speed of sound. TIGHT SPACE: lets you squeeze through any tight space. And finally MONSTER TRANSFORM: transform into various demon creatures from Hell.) you then transform back into Lily. \"Hmm I need some extra protection in case this type of thing happens again.\" you say as you summon 10 snakes. \"Come on in boys!\" you say as you spread your legs opening a passage way. You then feel immense pleasure as one by one they wiggle in through your open vagina. \"Mmm I'm not full yet.\" you say as you say as you summon 40 more. You then watch as they all slither in at the same time causing your vagina to comically expand to fit inside. You then orgasm as the last one slithers in and your vagina then deflates back to normal Lily size. You then clamp you vagina shut so they don't fall out. You then feel tight as you feel the snakes spread throughout your body.  \"Hope you like it in there because your going to stay there for a long time.\" you say as you put your clothes back on. You then proceed to melt the lock and walk out unnoticed. After you made some distance away from the scene you set the engine on fire causing the causing the car to explode. \"Hmm what to do now?\" you say as you rub your belly, constantly feeling pleasure as the snakes constantly wiggle and move in you. \"First things first, I need to change out of this.\" you say as you look down.  You then feel your body and clothes stretch as you grow taller. You then feel your tights disappear without a trace. You then watch as your coat and dress merge together and become wool. You then feel your dress tighten and stretch as it becomes a green turtleneck sweater dress that shows off your curves. You then feel your boots tighten and stretch as they transform into stiletto thigh high boots. You then feel your chest and ass inflate and create DD-cups. After that you feel face change into Stephanie's. Then you watch as your skin starts to grow wrinkles and your breasts sag throwing your age into your early forties but still looking sexy as fuck. \"I can't let these sweater puppies sag.\" you say as you make your breasts constantly perky. You look yourself over rubbing your new breasts. \"Well, I guess it's time to go.\" you say as you summon your motorcycle. You then remove your panties and burn them away \"I'll never need those pesky things.\" You then hop onto your motorcycle and slide it's long penis into your vagina sending a wave of pleasure down your 'spine'. \"Time to go.\" you say which causes it to drive itself and carry you out of the town.</span></div></div>",
            "created":1498359900,
            "id":2342089,
            "title":"A man"
        },
        "142131111122":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "New Town",
                "New Town"
            ],
            "content":"<div class=\"\"><div> <span>As you are driving by you happen to notice a rather large farm, so you decide to stop there and look for anyone to feed off of. As you are walking around you happen to notice a girl walking by: Alice (a blue eyed redhead with pigtails, wearing a grey shirt, tight blue denim overalls, and black tight riding boots with a brown stripe on top.) You quickly absorb her before anyone notices. \"Well that was good but I better be on my way.\" you say as you drive off towards another town.</span></div></div>",
            "created":1498362840,
            "id":2342116,
            "title":"Farm time"
        },
        "1421311111221":{
            "author_id":"qwertyup",
            "author_name":"JonDough",
            "choices":[
                "Explore the school",
                "Explore the Mini-Mall"
            ],
            "content":"<div class=\"\"><div> <span>You continue to drive until you hit a new town, but before you enter it you desummon your motorcycle and put some panties on. \"Hmm I guess I'll change just for fun.\" You say. You then watch as all your wrinkles vanish then your tits shrink to a C-cup size. Your sweater then spits in two and changes creating a red wool sweater and a black skirt. You then watch as your boots shorten and lose their heels creating over the knee boots. You then watch as your hair braids itself a parts itself to the side as a beret appears on your head. Finally you feel your face change completing your transformation into Jennifer. \"Hmm I guess this'll do for now.\" you say as you walk into town.\"\"Hmm what to do now?\" you say as you expolre rhe town.</span></div></div>",
            "created":1498388760,
            "id":2342239,
            "title":"New Town"
        }
    },
    "info":{
        "author_id":"masterwriter1",
        "author_name":"Danube",
        "brief_description":"You are a demon who can possess humans. You've escaped from your prison and want some fun!",
        "created":1301953500,
        "description":"<td align=\"left\" class=\"norm\">You are a female demon, a succubus with an almost human form, who lured unsuspecting mortals and drained their life-force. 200 years ago, you were stripped of your physical body, trapped in a casket and hidden in the cellar of a mansion. Now some teenagers have broken into the house to have a secret party, and they have accidentally released your spirit. You now wish to take the body of one of the girls in the house and use it as your own. <br>\r\nAs a spirit, you have the power to possess humans, but you can only lie in a female body. You can also inhabit items, though not for very long. Once you have taken a body, you can then morph the body in any way that you want, and you can charm unsuspecting males into doing whatever you want. And after 200 years, you can't wait to have some fun with some human bodies.<br>\r\n<br>\r\nRules:Anything goes, but no gay/lesbian stuff, and not too much stuff. Feel free to invent characters. I will delete anything I deem to be inappropriate or irrelevant. Other than that, have fun and add lots!</td>",
        "id":1765126,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1498388760,
        "modified":1498388760,
        "pretty_title":"NIght of the Demon bodysnatcher."
    }
}