{
    "chapters":{
        "1":{
            "author_id":"kamaria",
            "author_name":"Kamaria",
            "choices":[
                "Shrink",
                "Grow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The type of story. Will the guys shrink or will the girls grow?</span></div></span></div>",
            "created":1088139600,
            "id":204643,
            "title":"Choosing the story type."
        },
        "11":{
            "author_id":"kamaria",
            "author_name":"Kamaria",
            "choices":[
                "Yusuke",
                "Kuwabara",
                "Kurama",
                "Hiei",
                "Other (minor character I missed?)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick your victim, and them go from there.</span></div></span></div>",
            "created":1088139600,
            "id":204644,
            "title":"The shrink victim"
        },
        "111":{
            "choices":[
                "Keiko",
                "a female demon"
            ],
            "content":"<div class=\"\"><div> <span>Yusuke,although popular to the people that watch his adventures,isn't very popular around his own allies and enemies. He is smart mouthed, violent, and loves to ditch school (reminds me of my youth), so he is intentionally going to be shrunk. <br>\r\n<br>\r\nQuestion is,by who?</span></div></div>",
            "created":1089349200,
            "id":206916,
            "title":"On purpose"
        },
        "1111":{
            "choices":[
                "Playful",
                "Serious"
            ],
            "content":"<div class=\"\"><div> <span>Yusuke didn't have any Spirit World missions, but he still ditched school and responsibility. Keiko was a bit concerned about this. What if he never had to go on a another mission and missed out on an education or something like that?<br>\r\n<br>\r\n\"I'm really concerned about Yusuke. Maybe if I kept him in line things would be easier.\" she said to herself,looking through her closet. Suddenly she found a little device she made in elementary school. You guessed it,a shrink gun.<br>\r\n<br>\r\n\"Maybe this'll work.\" she says to herself. Yusuke knocked on the door.<br>\r\n<br>\r\n\"Thats right. Hes taking me out today.\" she says, walking to the door. As soon as she opened it, she open fired,shrinking Yusuke down to a few inches tall.<br>\r\n<br>\r\n\"Now I know how Kuwabara felt when....hey! What gives Keiko!?\" Yusuke shouted.<br>\r\n<br>\r\nWhats her reaction to this entire situation?</span></div></div>",
            "created":1089349200,
            "id":206934,
            "title":"Science over Spirit"
        },
        "11111":{
            "author_id":"xkiba4lifex",
            "author_name":"Lover Of All Giantesses",
            "choices":[
                "She demands a Massage",
                "She plays some games",
                "She does something a bit more creative"
            ],
            "content":"<div class=\"\"><div> <span>To say Yusuke was caught off guard would be the understatement of the year. He was just going to take Keiko for a nice walk around town, something he couldn't care less about but Keiko wanted to do, so he begrudgly accepted.<br>\r\n<br>\r\nNow he's shrimp size, with a giant Keiko standing over him. Keiko just stared down at him, not believing her eyes. Seeing Yusuke, her long time friend so small stunned her a bit.<br>\r\n<br>\r\n“Hey! Earth To Keiko!” Yusuke said in a sour mood “Keiko get your head out of the clouds and answer me!”<br>\r\n<br>\r\n“Wow Yusuke, i almost didn't see you down there” Keiko said in a joking manner, after getting over the initial shock. She wore a smile on her face.<br>\r\n<br>\r\n“Keiko, why the hell did you shrink me!” Yusuke asked straight to the point. Keiko just turned her head and moved her brown hair out of the way from her ear.<br>\r\n<br>\r\n“What was that Yusuke, your gonna have to speak up. I cant here you from all the way up here” Keiko teased again.<br>\r\n<br>\r\n“Keiko!”<br>\r\n<br>\r\n“Oh your probably wondering why i shrunk you, right Yusuke” She said looking at him again “Well i shrunk you because, I'm sick of it Yusuke. You ditching school and ruining your future! Im here to put an end to it”<br>\r\n<br>\r\n“What!” Yusuke said a little surprised “You never gave a damn about it before”<br>\r\n<br>\r\n“Yes i did! You just wouldn't listen!” Keiko argued back, her voice being much louder “Thats why i did this”<br>\r\n<br>\r\n“You shrunk me down to Scold me!”<br>\r\n<br>\r\n“Well, at first but looking at you now. I think we can have some fun with you at that size” Keiko said with a sly smirk. Normally when they play, Yusuke is the one to tease her out of enjoyment. Always living up skirt and poking her bum. Now... now its Keiko’s time to have some fun “Now let me get you inside, before my Neighbours Cat comes and eats you”<br>\r\n<br>\r\nKeiko crouched down and with her free hand grabbed Yusuke. Yusuke of course tried to resist but there wasn't much he could do to Keiko at this size. Granted unless he wants to blast her with his Spirit Gun.<br>\r\n<br>\r\nKeiko brings Yusuke to her face smiling at him. Deciding to tease him a bit more Keiko said.“You know your a lot more manageable this size”<br>\r\n<br>\r\n“So what! We still going around town!” Yusuke snapped back as Keiko shook her head.<br>\r\n<br>\r\n“Not now. I doubt you'd be able to keep up with my pace. So i think we can just hang out in my room. And we can have fun, you know like we did when we were kids.” Keiko said “And maybe i can actually get you to listen for once”<br>\r\n<br>\r\nKeiko didn't even wait for his response as she lowered her hand and started walking up to her room. ideas racing through her mind about what to do with Yusuke. So many opportunities, and since she's in charge. She can take as much time as she wants doing it</span></div></div>",
            "created":1542627060,
            "id":2579521,
            "title":"Playful Keiko"
        },
        "11112":{
            "choices":[
                "Go for the holes to get out and yell at Keiko some more",
                "stay put and wait for her"
            ],
            "content":"<div class=\"\"><div> <span>Keiko looked at Yusuke and realized her mistake. <br>\r\n<br>\r\n\"Keiko what the hell did you do!\" Yusuke yelled trying ot keep the cursing to a minimum. His face was getting red.<br>\r\n<br>\r\n\"It's for your own good Yusuke. You need to go to school. You have no idea if you'll ever go on another Spirit Mission or not. Koenma is probably being nice enough to leave you alone for a while. Especially since the Dark Tournament just ended.\" She looked down at the boy she loved and sighed. <br>\r\n<br>\r\nShe picked him up off of the floor and put him on her dresser.<br>\r\n<br>\r\n\"You know what Keiko!\" Yusuke yelled trying to get Keiko's attention. \"I will never forgive you for this-\"<br>\r\n<br>\r\nHe was cut off by Keiko putting a syrafom cup over him. Their were two holes in the top. </span></div></div>",
            "created":1111899600,
            "id":241736,
            "title":"Intervention"
        },
        "111122":{
            "choices":[
                "\"So look what i did to my love, Girls.\"",
                "Oh,Yusuke, I got you some friends.\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well, I was already too tired to yell, so I decided to wait for Keiko to come back. \"Man this sucks.\" I said to myself. All of a sudden I heard Keiko coming back so I decided to do one thing: Play dead.<br>\r\nJust then Keiko said...</span></div></span></div>",
            "created":1140757200,
            "id":303466,
            "title":"Play Dead."
        },
        "1111222":{
            "author_id":"dprince",
            "author_name":"Dimension Prince",
            "choices":[
                "Keiko reappears with Botan, Shizuru, and Yukina",
                "They try to escape their imprisonment before Keiko comes back"
            ],
            "content":"<div class=\"\"><div> <span>Hearing Keiko's voice again was the last thing he needed. Yusuke did not really understand Keiko's motives for shrinking him nor did he even care. He wanted his usual freedom, deliquent style, while not on Spirit Detective duty. He could only watch from his glass imprisonment in the girl's room as he waited for his captor to come up. Whatever Keiko had in store for him, Yusuke was ready to deal with the news.<br>\r\n<br>\r\n\"Oh, Yusuke!\" Keiko's voice rang louder. <br>\r\n<br>\r\nGreat... What does she want now? Yusuke thought. <br>\r\n<br>\r\nKeiko returned upstairs, holding another reversed styrofoam cup in her hands with several tiny holes on its bottom and a tiny piece of cardboard covering its mouth, on top the pal of her hand. She opened the top of Yusuke's confinement and out came from her possession Kurama, Hiei, and even Kuwabara, shrunken down to Yusuke's diminutive size. The three allies landed near their friend with Kuwabara landing headfirst on the ground.<br>\r\n<br>\r\n\"I also shrunk your friends too,\" Keiko said, winking without a hint of remorse. <br>\r\n<br>\r\n\"Why in hell did you do that?!\" Yusuke shouted. Kurama rubbed his head, shaken from the ride while Hiei looked indifferently at the clumsy Kuwabara.<br>\r\n<br>\r\n\"Well, I orginally thought about keeping you small to keep you in order,\" Keiko explained. \"But this fun thought came to mind! While I do respect the four of you keeping order between the real world and the spirit world, I think that shrinking you guys will help you lighten up from all of it.\"<br>\r\n<br>\r\n\"Hmph, not my idea of lightening up,\" Hiei said, glaring at the giant girl. Behind his white headband, the dark light silhoutte of his Jagan lit up.<br>\r\n<br>\r\n\"Hiei, what are you doing?\" Kurama asked.<br>\r\n<br>\r\n\"Yusuke, I mean no offense to you or your girlfriend, but she made the biggest mistake of her life by messing with me like this,\" Hiei said, holding his right arm up. It looked as though he was going to summon the Dragon of the Darkness Flame to punish the giant Keiko.<br>\r\n<br>\r\n\"Hiei, you do realize that she used Botan's Mystic Whistle to draw you here after successfully deceiving Kuwabara and myself,\" Kurama said. \"She shot you first before you recovered from the whistle's call and escaped and we were easily prey to her.\"<br>\r\n<br>\r\n\"Yeah, which is why she's-ugh!\" Hiei shouted, falling on his knee. The black flames that surrounded his arm dissipated. \"Wh-where's... my dragon?!\"<br>\r\n<br>\r\nKurama looked at him ponderingly, taking out a blood red rose that he kept in his long red hair. Holding it in the air, he swung at it down, testing his theory on why Hiei's Darkness Dragon disappeared.<br>\r\n<br>\r\n\"Rose Whip!\" Kurama shouted. The rose did not extend into the throny whip he often used in battle. He remained the same, save it for a few red petals drifting off its head from the swing.<br>\r\n<br>\r\n\"Kurama?\" Yusuke asked.<br>\r\n<br>\r\n\"Just as I thought; our shurken state has weakened our spirit powers and abilities,\" Kurama explained. \"We can't use techniques to break free from here.\"<br>\r\n<br>\r\n\"And since I know you won't break out of here, I'll be back for the real fun,\" Keiko said, making a peace sign and winked. \"I can't believe I didn't think of this sooner! Be right back, boys!\"<br>\r\n<br>\r\nKeiko left her room, leaving the shrunken team to themselves. Whatever they had to break out was worthless now due to their shunken states. And who knew what Keiko would do to them as punishment if they were caught free.<br>\r\n<br>\r\n\"Well, this sucks,\" Hiei sad, lying on the glass wall. \"We've been captured by the detective's girlfriend and forced to be her playthings.\"<br>\r\n<br>\r\n\"Relax, Hiei,\" Kurama said, optimistic. \"I don't think Keiko would do anything bad at us.\"<br>\r\n<br>\r\n\"Maybe, but she's a smart girl,\" Yusuke said.<br>\r\n<br>\r\n\"You mean, she knows a way to torture us without... torturing us?\" Kuwabara asked.<br>\r\n<br>\r\n\"Don't think, Kuwabara, or whatever's left of your brain from your fall will melt,\" Hiei scoffed.<br>\r\n<br>\r\n\"You got something to say, even shorter shrimp?!\" Kuwabara shouted, all in front of Hiei's face.<br>\r\n<br>\r\n\"Guys, stop fighting!\" Yusuke shouted, pulling Kuwabara away.<br>\r\n<br>\r\n\"He's right,\" Kurama said. \"Let's at least try to escape before our captor comes back. We all know she's too nice to give us any horrible punishments.\"  </span></div></div>",
            "created":1231108440,
            "id":629127,
            "title":"Spirit Team Captured"
        },
        "11112221":{
            "author_id":"dprince",
            "author_name":"Dimension Prince",
            "choices":[
                "Each girl has her tiny captive massage her feet.",
                "They plan on a different group activity."
            ],
            "content":"<div class=\"\"><div> <span>\"There's got to be a major misunderstanding! I don't belong here!\" Kuwabara cried, slamming his fists upon the glass containment that trapped him and his allies within.<br>\r\n<br>\r\n\"Hmph, throwing a tandrum; why am I not surprised?\" Hiei scoffed, looking away from the approaching, enraged Kuwabara.<br>\r\n<br>\r\n\"You got something to say, shorter stack?!\" Kuwabara shouted, attempting to grab Hiei by his white scarf, but failed after forgetting about Hiei's swiftness. Hiei disappeared and reappeared next to Kuwabara, holding up his shrunken katana near his neck.<br>\r\n<br>\r\n\"I would never try that on me,\" Hiei adviced.<br>\r\n<br>\r\nKuwabara trembled, unable to fight back since his shrunken state had prevented the use of his own Spirit Sword. He relaxed when Hiei finally withdrew his sword.<br>\r\n<br>\r\n\"You guys should not be fighting,\" Kurama said.<br>\r\n<br>\r\n\"And instead, help us on getting out of here before Keiko comes back!\" Yusuke added. <br>\r\n<br>\r\nThe small team started to hear voices coming outside of Keiko's room. Familiar voices. They were higher-pitched and feminine. One thought races across the minds of the shrunken guys; their faces were appalled at the thought of it.<br>\r\n<br>\r\n\"Yusuke, this is your final warning,\" Hiei said, pointing at Yusuke. \"Your girlfriend is definitely going to 'get it' if she humiliates me like this again.\"<br>\r\n<br>\r\n\"Hiei, chill,\" Yusuke said. \"I still don't know why Keiko shrunk you guys when she only wanted me.\"<br>\r\n<br>\r\n\"Here they come!\" Kuwabara shouted, frantically pointing at the slightly ajar door. <br>\r\n<br>\r\nThe bedroom door opened up with Keiko leading, followed by the female friends she made since her discovery of Yusuke fighting supernatural creatures: Botan, the cheery Spirit World guide; Shizuru, Kuwabara's older sister; and even Yukina, an innocent ice maiden/apparition who was known as Hiei's sister to all but herself, Keiko, and Kuwabara.<br>\r\n<br>\r\n\"There they are, girls!\" Keiko pointed out the durable glass jar left on the table, containing Team Urameshi. \"I told you girls I've done.\"<br>\r\n<br>\r\n\"No way!\" Botan exclaimed, peering up close with Yukina on the tiny captives. \"You guys are cute for being small, not counting Hiei at his former height!\"<br>\r\n<br>\r\nHiei fumed, crossed his arms, and looked away from the two girls.<br>\r\n<br>\r\n\"Hey, Yukina!\" Kuwabara greeted, running up to Yukina's face, but collided with the transparent glass barrier that trapped him.<br>\r\n<br>\r\n\"Wow! So you've got Kazuma, Yusuke, Kurama, ... and Hiei,\" Yukina said, focusing her glimpse on him. She could not help but feel something for the one who secretly watched over her with his Jagan, making sure she was safe and happy.<br>\r\n<br>\r\n\"It doesn't surprise me that you got Kazuma, but how did you even get a hold of Kurama and Hiei?\" Shizuru asked, disposing her last cigarette.<br>\r\n<br>\r\n\"Simple: Kurama did not suspect me, of all people, to pull this kind of stunt and I stunned Hiei with the Mystic Whistle and shrunk him first before he got away,\" Keiko explained.<br>\r\n<br>\r\n\"Okay, so now what?\" Shizuru asked.<br>\r\n<br>\r\nKeiko picked up the jar holding Yusuke, Kuwabara, Kurama, and Hiei in with both hands, slowly opening the hole-tattered top. She unsealed the top and held it in front of the small group girls.<br>\r\n<br>\r\n\"How about we each take a boy to play and spend time with?\" Keiko suggested. \"Just don't pick Yusuke.\" <br>\r\n<br>\r\nBotan, Shizuru, and Yukina grinned, glancing at the jar while the guys made no attempts at escape. Yusuke glared back at the giant girls, Kurama paced about slowly upon their current predicament, Kuwabara was blowing kisses to Yukina, and Hiei sat at the corner.<br>\r\n<br>\r\n\"You sure it's okay by them?\" Yukina asked. <br>\r\n<br>\r\n\"We're not going to hurt them, we're just getting the advantage over these guys,\" Keiko said. \"They really need to lighten up in spite of all the fighting they do.\"<br>\r\n<br>\r\n\"Yukina! Pick me!\" Kuwabara shouted at the top of his lungs, hopping wildly for his love interest's attention. A hand swooped in and grabbed Kuwabara tightly. \"... Oh, man!\"<br>\r\n<br>\r\n\"Sorry, bro, but she's way out of your league,\" Shizuru said to her tiny brother in her grip.<br>\r\n<br>\r\n\"My turn!\" Botan exclaimed, looking upon the remaining choices. Yusuke was already taken by Keiko so the only choices for the perky guide were Kurama and Hiei. \"Hmm... I think I'll toy with Hiei!\" <br>\r\n<br>\r\nBotan reached down to get him, but then felt a stinging sensation on her index finger. She reeled her hand back, seeing a scratch on her finger with little blood slowly dripping out.<br>\r\n<br>\r\n\"Shrunken or not, I will not be made a fool!\" Hiei declared, sheathing his sword.<br>\r\n<br>\r\n\"Yukina, you can have him,\" Botan said, winking at the confused Ice Maiden.<br>\r\n<br>\r\n\"Uh, you sure he won't cut me?\" Yukina asked.<br>\r\n<br>\r\n\"Trust me! You two are practically the same kin!\" Botan exclaimed. Hiei glared at her, sending her a telepathic death message. By her body language, Botan turned away, shivering.<br>\r\n<br>\r\n\"Uh, okay,\" Yukina said. She reached into the jar to get Hiei. The latter looked at Kurama for advice, who could only shrug with a sheepish grin.<br>\r\n<br>\r\n... Only for her, Hiei thought. <br>\r\n<br>\r\nHiei accepted his fate into Yukina's large, soft hand, not wanting to offend her as much as he dislike be \"played\" with.<br>\r\n<br>\r\n\"So I guess that leaves Kurama with me then,\" Botan said, using her other hand to take him out while sucking on the small wound Hiei left for her. <br>\r\n<br>\r\n\"Well, ladies, we have our guys!\" Keiko exclaimed, taking out Yusuke and placing the empty jar back on the table. \"What shall we do with them as a group?\"  <br>\r\n<br>\r\n  <br>\r\n<br>\r\n  </span></div></div>",
            "created":1231378740,
            "id":630462,
            "title":"All Together"
        },
        "111122211":{
            "author_id":"tinylelouch",
            "author_name":"Lelouch",
            "choices":[
                "Kurama managed to come up with a plan.",
                "Botan interjects. \"It isn't fair only Shizuru had her feet kissed!!\""
            ],
            "content":"<div class=\"\"><div> <span>Each of the girls exchanged curious glances at the question; what could they agree on? No one spoke any ideas due to none coming to mind, Yukina was too pure to think of anything, Shizuru's ideas were too rough; the only people suited for coming up with something were Botan and Keiko, and they seemed to know it too. But even with this knowledge there were no ideas coming to mind.<br>\r\n<br>\r\nFinally ever so bluntly Shizuru muttered, \"How about we just have em give us a foot rub while we think this through?\" Everyone, shrinkees included turned to look at Shizuru as if she had the plague. But after a couple minutes Yukina smiled and nodded, \"Sounds like a good idea to me Shizuru. If they agree to it of course, I mean...I don't want to impose...\"<br>\r\n<br>\r\nBotan jumped in, \"Oh relax, they'd love to do it...not that they have a choice.\"<br>\r\n<br>\r\n\"Pardon?\"<br>\r\n<br>\r\n\"Oh nothing at all!\" <br>\r\n<br>\r\nWith three girls approving it everyone turned to Keiko, who appeared slightly nervous. She nodded, \"Well with all the yes' I don't wanna stand out. Sounds good to me.\" Every girl got close with their shrunken companion and held them close enough for all to hear. \"Do you guys agree?\" It was Yukina who bothered asking.<br>\r\n<br>\r\n\"Hell no! Little or not I ain't no masseuse.\"<br>\r\n<br>\r\n\"A real man doesn't submit like that! If it was Yukina maybe, but not for you sis!\"<br>\r\n<br>\r\n\"I would never even think of degrading myself to something such as massaging a foot, even if it is Yukina's.\"<br>\r\n<br>\r\n\"We'd love too!\"<br>\r\n<br>\r\n\"WHAT!?\" Yusuke, Kuwabara, and Hiei all looked at Kurama as if he had gone off the deep end; in fact, Hiei had his hand on his blade already.<br>\r\n<br>\r\nKurama smiled softly and gave a peaceful gesture, whispering words too low for the giantesses to hear. \"We have to play along, use your heads for a second.\" Clicking their respective tongues the rest of Team Urameshi fell silent; Kurama was as always, right.<br>\r\n<br>\r\n\"Sounds like they agree!\" Botan exclaimed.<br>\r\n<br>\r\n\"Then let's do this.\" Shizuru grinned.<br>\r\n<br>\r\nQuickly each girl removed their respective footwear and sat on the floor, in an X-Shaped pattern with Keiko across from Shizuru and Botan from Yukina. Their feet together seemed to wall the four who were at their soles. \"Get to it!\" Keiko mischievously winked.<br>\r\n<br>\r\nEach member of Team Urameshi looked at their companions barefeet with apprehension. Yusuke wasn't too happy with Keiko's feet, being ever so busy she had a fair amount of sweat and Yusuke wanted no part of that. Botan was in a similar boat so Kurama was more or less in the same situation. Hiei apparently lucked out, being an Ice Maiden Yukina had no sweat along her soles and her feet were as pure as she was. Poor Kuwabara drew the short straw, Shizuru's feet were as sweaty as both Keiko and Botan's feet combined and appeared very tense; right now Kuwabara wished his sister didn't excersise daily.<br>\r\n<br>\r\nKuwabara pointed to Hiei. \"Hey shorty! Only I deserve Yukina, I would show her feet the proper respect of a man. Hell I'd even kiss em to make her happy, but you...you don't deserve it. You two have nothing in common!!\" Yusuke and Kurama had to bite their lips not to laugh.<br>\r\n<br>\r\nBefore Hiei could respond a loud voice from behind Kuwabara spoke, \"Oh is that so lil bro? In that case I'm sure you'll do the same for your <i> Big </i> Sister. After all, we are family, and you would never trade me for some girl you're crushing on. Right?\"<br>\r\n<br>\r\n\"Y-Yes Mistr- Sister!\" Every girl (Except Yukina) looked at Shizuru almost fearfully, the shrunken men shook their heads at Kuwabara who had begun eagerly massaging to please his sister.<br>\r\n<br>\r\nKurama sighed, \"It may not be ideal but this helps us think too. I recommend we begin before they grow impatient.\" With no delay Kurama got to work as well. With a click of their tongues Hiei and Yusuke wordlessly did too.<br>\r\n<br>\r\nAfter a few moments it was clear how the massages were going; all we doing good but had very different effects. Yusuke was doing little more than barraging Keiko's feet with punches in an attempt to put enough force behind it; the end result being he was almost hitting <i> too </i> hard, he was doing a little bit more harm than good in the long run, but it felt sort of good. Being faster than holy hell Hiei was all over the place, in seconds he covered all of both of Yukina's feet, but he continued over and over so he could properly please his sister. Kurama massaged like he battled, like a tactician. He mentally evaluated the best spots and struck with precision, massaging almost as well as a professional. And again Kuwabara crapped out; because of his loud mouth he was forced to both kiss AND massage his sisters feet. And due to being forced to kiss, Kuwabara was unable to effectively massage, so he was doing little more than rubbing his hands into the squishy flesh of his sister as his lips made contact.<br>\r\n<br>\r\nThe results of each massage were clear on the girl's faces. Yukina and Botan appeared to be in heaven, smiling and even giggling occasionally. Keiko was smiling but every once in a while she'd make a small wincing sound. As for Shizuru....she had her eyes closed and her lips locked into a frown like she was a dominatrix....poor Kuwabara. All in all it could've been much worse, the feet of each girl wasn't that bad (Shizuru excluded.) and once the gang got into the massage they made sure to do it right. All the while Kurama was thinking up a plan and the others were leaving the plan to him.<br>\r\n<br>\r\nFinally they soon finished, Yusuke was panting, Kurama and Hiei had faint sweat on their brow, and Kuwabara was collapsed in exhaustion. And there was still more to come...</span></div></div>",
            "created":1271974440,
            "id":871868,
            "title":"Eight Feet, Four Tinies. Do the Math"
        },
        "11112222":{
            "choices":[
                "Keiko walks in.",
                "They start climbing down."
            ],
            "content":"<div class=\"\"><div> <span>\"So,\" Yusuke said, \"Anybody got an idea on how we're supposed to move this damn glass that's sitting over us?\" The team stared up at the glass above them, the four of them thinking the situation through.<br>\r\n<br>\r\nThough the others had thought of this plan, Kuwabara was the first to vocalize it. \"Why don't we just push the glass towards the edge of the dresser until it falls off?\" he stated proudly.<br>\r\n<br>\r\n\"Because, you idiot, then we would fall too. And, on top of that, we would probably be killed by the broken shards waiting for us at the bottom.\" Hiei stated calmly, angering Kuwabara.<br>\r\n<br>\r\n\"Well,\" said Kurama, \"If we were to push just enough over the edge to leave a gap we could squeeze through, we might be able to somehow climb down.\"<br>\r\n<br>\r\nThe team quickly agreed to this idea(no one could suggest anything better) and began the process of pushing the glass. They made a hole at the edge of Keiko's dresser just big enough for the pint-sized warriors to fit through.<br>\r\n<br>\r\n\"Well, any volunteers to go first?\" Yusuke asked jokingly.<br>\r\n<br>\r\n\"We should send the one that's most likely to fall first. How about the idiot?\" Hiei stated, glaring at Kuwabara.<br>\r\n<br>\r\n\"Shut up, you little shrimp!\" Kuwabara fired back.<br>\r\n<br>\r\n\"We don't have time for this,\" Yusuke protested, \"Keiko could be back any second!\"<br>\r\n</span></div></div>",
            "created":1249168200,
            "id":736684,
            "title":"They try to escape their imprisonment before Ke..."
        },
        "112":{
            "choices":[
                "A mysterious amulet he found",
                "Relapse in Rando's shrinking curse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What method would you like? I know a lot of people have different tastes in the cause of size change. Funny thing is,Kuwabara has already experienced the shrinking once before,so we can call him a veteran of this or something.</span></div></span></div>",
            "created":1088139600,
            "id":204664,
            "title":"Cause"
        },
        "1121":{
            "choices":[
                "Botan",
                "Keiko"
            ],
            "content":"<div class=\"\"><div> <span>Kuwabara was up to his vigilante antics as usual. If he saw a kitten in a tree he'd climb up and rescue it. Just the kind of guy he was.<br>\r\n<br>\r\n\"Urameshi ain't around today. Shame,and I had my ass kicking attitude....\" he was talking to himself when he heard a woman shriek in terror. He ran down to where the scream was and saw a teenaged gypsy girl being hassled by thugs.<br>\r\n<br>\r\n\"Looks like my attitude pays off!\" he shouted, running at the group and proceeding to layeth the smackdown on all of them. The girl walked over and bowed to him.<br>\r\n<br>\r\n\"Thank you kind one. I hope your journey ahead is filled with adventure.\" she said before walking off. On the ground she dropped an amulet. Kuwabara picked it up and walked to her,but it was enchanted with an anti-theif spell,causing him to shrink down.<br>\r\n<br>\r\n\"Not again.......\" he said to himself,looking around. Loud footsteps were heard as a girl was coming closer. Who was it?</span></div></div>",
            "created":1089262800,
            "id":206756,
            "title":"Even good deeds have a price"
        },
        "1122":{
            "author_id":"kamaria",
            "author_name":"Kamaria",
            "choices":[
                "3 inches (fixed size)",
                "3 inches and gradually shrinking from that point"
            ],
            "content":"<div class=\"\"><div> <span>During school, Kuwabara was taking a test. For some reason, he actually studied for it like that one time he had to get at least a 50 on it. But even though he was prepared, he still didn't feel alright.<br>\r\n<br>\r\nHe raised his hand. \"Uh...may I go to the bathroom!?\" he asked, clutching his stomach.<br>\r\n<br>\r\nThe teacher allowed him to go. Suddenly, he took off, running towards the bathroom. Then the shrinking began....what size is he?</span></div></div>",
            "created":1089003600,
            "id":206225,
            "title":"Kuwabara's sick"
        },
        "113":{
            "choices":[
                "Right away",
                "Timed effect"
            ],
            "content":"<div class=\"\"><div> <span>Kurama was doing a little community service for his earlier crimes. Aparently Koenma wasn't letting him off easy, even though he. His mission was to wipe out a team of rogue demons.<br>\r\n<br>\r\nThis was easy,too easy.<br>\r\n<br>\r\nOne of the demons was a beautiful sorceress named Azuma. She had a crush on Kurama (what self respecting female Yu Yu fan doesn't?) and wanted to defend herself as well as protect Kurama and keep him safe,so she used a shrinking spell on him to fulfill all three of those things.<br>\r\n<br>\r\n\"You'll be all mine Kurama!\" she thought to herself.<br>\r\n<br>\r\nDoes he shrink right before Azuma's eyes,or does the effect take a bit of time?</span></div></div>",
            "created":1089090000,
            "id":206329,
            "title":"Love by shrinking"
        },
        "1131":{
            "choices":[
                "Take him home",
                "Play with him"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kurama sensed something coming his way, but was unable to dodge the effect of the shrinking spell. Azuma smiled as she watched him diminish right before her very eyes.<br>\r\n<br>\r\nWhat does she do with him?</span></div></span></div>",
            "created":1117602000,
            "id":253677,
            "title":"Instant results"
        },
        "1132":{
            "author_id":"mysterysage",
            "author_name":"Midnight Writer",
            "choices":[
                "Yusuke and Botan enter.",
                "Kurama awakes to a still empty room."
            ],
            "content":"<div class=\"\"><div> <span>\"What have you done to me?\" Kurama asked as he recognized the sensation of having a spell cast upon him.<br>\r\n<br>\r\n\"You will find out soon enough.\" the demon smiled in response.<br>\r\n<br>\r\nBefore he had a chance to react, the sorceress vanished, leaving Kurama solo as the spell took affect.  Sighing in disconcerting thought, he began his walk back to town, but before he could reach his home, a terrible headache overtook him.  Too far from his place and still unaware of what the demon had done to him, the red rose decided that it'd be best not to be alone, should the spell render him vulnerable.  The closest place to him was Yusuke's, so he made his way to the spirit detective's house.<br>\r\n<br>\r\n\"Yusuke? Are you in here?\" Kurama had to grab hold of the door frame to Yusuke's room in order to keep from crippling to the floor as the headache began to engulf his senses, but try as he might, unconsciousness soon grasped him and he fell to the floor of the empty room.</span></div></div>",
            "created":1109653200,
            "id":238187,
            "title":"What's happening?"
        },
        "11321":{
            "author_id":"mysterysage",
            "author_name":"Midnight Writer",
            "choices":[
                "There's a new demon!",
                "Kurama hasn't reported back!"
            ],
            "content":"<div class=\"\"><div> <span>Kurama ran a hand through his hair to get it out of his face as he sat himself up.<br>\r\n<br>\r\n\"Where am I?\" he questioned as he tried to focus his dreary eyes on his unfamiliar surroundings.<br>\r\n<br>\r\n\"A transportation spell?\" but that thought immediately fled as a sound like continuous explosions filled his demon ears.  He turned around to find the cause and nearly stumbled back as a skyscraper sized Yusuke walked into the room, followed closely behind by Botan.<br>\r\n<br>\r\n\"This is important, Yusuke!\" Botan scolded as the Spirit Detective leaned against the bottom of his bed, folding his arms.<br>\r\n<br>\r\n\"I don't really give a rat's ass.  Today is my day off, and I intend to enjoy it.  So you can just tell Koenma to shove it.\" Yusuke complained, unaware that his teammate just narrowly avoided being knocked out by his simple action of crossing his feet.<br>\r\n<br>\r\nBotan wanted nothing to do with Yusuke's complaints and pulled out her communicator, setting the laptop like device on the bed, \"Tell him yourself!\"  Koenma's shouting, childlike face flashed onto the screen, \"Yusuke!!!\"</span></div></div>",
            "created":1109653200,
            "id":238190,
            "title":"Oh dear..."
        },
        "114":{
            "author_id":"mysterysage",
            "author_name":"Midnight Writer",
            "choices":[
                "Search for the demoness!",
                "Go see Koenma!"
            ],
            "content":"<div class=\"\"><div> <span>\"Are you sure this is the place?\" Yusuke asked as he looked around the circular clearing that his team had just stepped foot into.<br>\r\n<br>\r\n\"Yes,\" answered Botan, \"I'm positive that this is the place.  Koenma was very clear in his description.  The demon should be here.\"<br>\r\n<br>\r\nHiei, arms crossed, walked a few steps forward, \"Show yourself!\"  He heard no response and began to turn around, \"This is a waste of my time.  I'm leaving.\"  Before he could complete his first step, a flash of bright light shot from a tree opposite the team and surrounded Hiei, freezing him in place.<br>\r\n<br>\r\n\"You will be going nowhere, my dark little demon.\" came a soft, seductive voice from the tree.<br>\r\n<br>\r\nSuddenly, the light flashed brighter, then vanished, taking Hiei with it.<br>\r\n<br>\r\n\"Ahh!  Where'd he go?!\" Kuwabara shouted.<br>\r\n<br>\r\nYusuke clenched his fists as Botan held him back from charging at the unseen demon full force.<br>\r\n<br>\r\nKurama took a few steps forward, \"What have you done with him?\" he asked in his calm and collected voice.<br>\r\n<br>\r\n\"Oh come now, what fun would it be if I told you. I think I'll let you figure it out on your own.  I shall return when the time is right to seal your fates.\" and with a shimmy in the leaves, the demoness was gone.<br>\r\n<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br>\r\n<br>\r\nHiei shook his head as he began to prop himself up, \"What the hell just happened?\"<br>\r\n<br>\r\nHe stood up, brushing the dirt off his clothes and looked around, \"What the?!  Giant grass?\" <br>\r\n<br>\r\n'Kurama must be playing a trick on me...' he thought to himself.  He turned on his heels to curse the fox, \"KU...\" but was cut off as a giant object slammed down in front of him, knocking him on his ass.  Hiei shook it off and looked up to see what it was that had so easily knocked him to the ground, \"..rama...\"  He stared in complete amazement at the youkai that was now towering over him like a mountain.  He covered his ears as his teammate began to address the demoness.<br>\r\n<br>\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br>\r\n<br>\r\nKurama stood perfectly still waiting to make sure that the demoness had definitely left.  Kuwabara began to take a step toward Kurama, \"Don't move!\" he shouted at him, \"Though she thought she was hidden, I caught site of her eyes.  She kept glancing toward the ground.  I think Hiei's still here.  I can still sense him.\"<br>\r\n<br>\r\nBotan looked at him, a bit confused, \"Still here? Do you mean he's invisible?\"<br>\r\n<br>\r\n\"Perhaps, or more likely he's...\" Kuwabara cut Kurama off, \"he's been shrunk...\"<br>\r\n<br>\r\nKuwabara's face turned white as he remembered the torture he had gone through when Rando had shrunk him.<br>\r\n<br>\r\nKurama looked to the ground.  The grass was too high to see anything, so very slowly, he knelt down and cautiously placed his finger tips against the dirt.<br>\r\n<br>\r\nHiei dashed to the side to avoid the approaching tree-sized fingers, his heart pounding as he tried to get a grasp the fact that this was actually happening to him.<br>\r\n<br>\r\nKurama concentrated and the grass began to recede back into the ground, revealing the earth below.  He scanned the space before him and immediately stopped when his eyes locked on to the tiny demon staring up at him in disbelief.<br>\r\n<br>\r\n\"Hiei?\"  he asked as if he couldn't believe it was actually him.</span></div></div>",
            "created":1111726800,
            "id":241419,
            "title":"What the?!"
        },
        "1142":{
            "author_id":"mysterysage",
            "author_name":"Midnight Writer",
            "choices":[
                "Koenma answers! He's on his way!",
                "Ogre answers! Koenma's gone missing!"
            ],
            "content":"<div class=\"\"><div> <span>Yusuke made his way over to Kurama and leaned over his shoulder to look at the now minuscule Hiei, who was trying to regain his composure.  \"Well this is just great.  Now what?\"<br>\r\n<br>\r\nKuwabara kept his distance, unsure whether he should be horrified at the thought that this new demon could shrink him as Rando had done, or to laugh his ass off at the now even shorter ego-headed shrimp.<br>\r\n<br>\r\n\"Perhaps we should go see Koenma.  Maybe he knows a way to reverse it.\" Botan suggested.<br>\r\n<br>\r\n\"Yes,\" Kurama added, \"I think that's our best bet.\" He lowered a hand for Hiei to climb onto.<br>\r\n<br>\r\n\"Oh, no!  There's no way I'm letting you carry me!  And there's even less chance I'll let you take me to Koenma's!\"  Hiei folded his arms and began to walk away from Kurama.<br>\r\n<br>\r\nKurama sighed, \"Hiei, it's for the best.\"<br>\r\n<br>\r\n\"I don't really care.  You're...\" but his sentence was cut off when Kurama reached out and grabbed a hold of him.<br>\r\n<br>\r\n\"KURAMA!!!  Put me down this instant!  I will kill you for this!\"<br>\r\n<br>\r\nYusuke couldn't help but laugh at the struggling dragon, \"It's for your own good, so deal with it.\"<br>\r\n<br>\r\n\"I tell you what, Hiei,\" Kurama said, standing back up, \"we'll compromise.  We'll have Koenma come to us.\"<br>\r\n<br>\r\nHiei said nothing, inwardly trusting in Kurama and the rest of the team's judgment, but allowing the flames of rage to flash in his eyes at the whole situation.<br>\r\n<br>\r\nBack at Yusuke's place, Botan called to Koenma.</span></div></div>",
            "created":1111986000,
            "id":242061,
            "title":"KURAMA!!!"
        },
        "11421":{
            "author_id":"mysterysage",
            "author_name":"Midnight Writer",
            "choices":[
                "I do know a way!",
                "I have no idea!  <^^,,,"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, Koenma should be here soon.\" Botan stated as she came over and sat down on Yusuke's bed, next to Kuwabara.  Kurama had placed Hiei on top of a nearby desk, uncharacteristically clean for Yusuke.  Kurama figured it was due to the fact that it was void of any traces of homework.  He took a seat at the desk.  Yusuke leaned against the wall, awaiting Koenma's arrival.  They didn't have to wait long before he burst in the door in his teen form.<br>\r\n<br>\r\n\"What happened?  What was so important that you had to call me out here?\"  Koenma watched as everyone's eyes lead his to the desktop where miniture fuming demon sat, arms crossed.  Koenma stared in shock as he took a few steps closer to get a better look, before falling over, clutching his sides in a fit of laughter!<br>\r\n<br>\r\n\"That's it!!!\" Hiei drew his sword and began to charge at the giant rolling on the floor in hysterics.  Kurama noticed this and flung his hand out in front of his enraged comrade, earning himself a bloody finger as Hiei sliced his sword across it.<br>\r\n<br>\r\n\"Koenma, sir! Please!\" Botan scolded, as she walked over and picked up a protesting little demon, \"This is serious! Can you help him?\"<br>\r\n<br>\r\nKoenma choked back his laughter as he straightened himself up, \"Well actually...\"</span></div></div>",
            "created":1111986000,
            "id":242065,
            "title":"The Almighty Koenma"
        },
        "115":{
            "author_id":"chibichan",
            "author_name":"Chibichan",
            "choices":[
                "Sure why not!",
                "Pick another Yu Yu Hakusho character."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about two completly new characters who become victems of Yukina when they get lost in the frozen wastelands?</span></div></span></div>",
            "created":1113973200,
            "id":245906,
            "title":"Yukina and the strangers in the snow"
        },
        "1151":{
            "author_id":"chibichan",
            "author_name":"Chibichan",
            "choices":[
                "Jacob takes some berries first to make sure it's safe.",
                "They're starving! Dig in!"
            ],
            "content":"<div class=\"\"><div> <span>Through blinding snow they trudged on, unsure of where they were going. It had been almost a full day it seemed and night was coming soon. Blisteringly cold night.<br>\r\n<br>\r\nFinally, as the snow seemed it's worst, a vague figure appears in the distance. The two traveling companions, Jacob and Tina, looked at each other in surprise. Rushing forward though they felt exaustion taking it's toll. Before they could reach the myserious person, they collapsed in the fridged snow.<br>\r\n<br>\r\n*****<br>\r\n<br>\r\nJacob awoke in a small cold hut. A fire crackled slowly in the middle of the cluttered room and Tina was nestled close to him under a thick bear fur that served as a blanket on the bed he lay upon.<br>\r\n<br>\r\nThe place sure was cluttered. It looked like some kind of scribes home, maybe a writers workshop. Books were strewn all over, as were clothes and other various trinkets. A few cupboards and a dresser lined the walls of the dome shaped enclosure, a desk sitting between the two pieces of furnature.<br>\r\n<br>\r\nStrange little place to be out in the middle of the frozen wastelands.<br>\r\n<br>\r\nSuddenly Jacob heard the crunch of someone trodding across the snow outside. Tina stirred finally too and sat up, rubbing her eyes. Pushing aside a bright tapestry that covered the entrance way, a girl in a light green kimono walked in.<br>\r\n<br>\r\nHer long green hair fell straight behind her, almost like a tapestry itself, swaying as she walked. Her skin was light and soft as the snow, pale yet with a heathy radiance to it. Her head was down, eyes fixed on a bowl she was holding out of strange blue berries that neither Jacob nor Tina had seen before.<br>\r\n<br>\r\nStarving, the two exchanged glances. Obviously this must be their rescuer. Surely she wouldn't be tricking them. Would she?</span></div></div>",
            "created":1113973200,
            "id":245907,
            "title":"Yukina's guests"
        },
        "11511":{
            "author_id":"tinylelouch",
            "author_name":"Lelouch",
            "choices":[
                "I say lets play!",
                "Let's see how you like those berries!"
            ],
            "content":"<div class=\"\"><div> <span>Tina began extending her hand towards a berry when Jacob grabbed her wrist. \"I'll try one first, to be safe.\" He spoke in a manly tone that seemed somewhat cute.<br>\r\n<br>\r\nTina simply narrowed her eyes, \"You're just hungry.\" She muttered sarcastically at her friend.<br>\r\n<br>\r\n\"It's fine trust me.\" Their mysterious rescuer muttered in a quiet shrill voice.<br>\r\n<br>\r\n\"That's all the encouragement I need!\" Jacob piped up as he quickly tossed a mouthful of the strange berries into his mouth.<br>\r\n<br>\r\n\"Would you like one?\" Their rescuer asked, gesturing the bowl towards Tina. Tina eyed it suspicously, her instincts were telling her something was wrong.<br>\r\n<br>\r\n\"And what is your name again?\" She asked warily, nervously grabbing a small berry.<br>\r\n<br>\r\nTheir rescuer said her face to reveal a youthful girl who appeared as beautiful as the snow itself. \"I'm sorry, my name is Yukina.\" <br>\r\n<br>\r\n\"I'm Jacob.\" Jacob piped up, his mouth full of the odd berries.<br>\r\n<br>\r\n\"And I'm Tina\" Tina said, pretending to eat the berry she picked up.<br>\r\n<br>\r\n\"Tina and Jacob, those are nice names.\" Yukina noted with an innocent smile. <br>\r\n<br>\r\n\"I'm beginning to feel funny....what kind of berries are these?\" Jacob asked woozily.<br>\r\n<br>\r\nYukina giggled as if she was in on a joke. \"Let's just say they're special.\"<br>\r\n<br>\r\n\"What makes them special?\" Tina asked.<br>\r\n<br>\r\nYukina smiled at her, \"You'll see in about three seconds.\"<br>\r\n<br>\r\n\"Huh?\" Tina let out when Jacob let out a loud gasp.<br>\r\n<br>\r\nTina turned to her friend and let out an equally loud gasp, Jacob appeared to be shrinking! Ge had already reached half of his regular size, even standing up he reached Tina's waists, and she was still sitting! <br>\r\n<br>\r\nTina threateningly grabbed Yukina's kimono, \"What did you do to him!\" <br>\r\n<br>\r\nYukina looked at Tina as if something was amiss. \"You should be shrinking too...\" She muttered calmly.<br>\r\n<br>\r\n\"I won't because I didn't eat your damn berries!<br>\r\n<br>\r\n\"Uh Tina? Not that I don't like seeing you mad but can you help me out over here?!!?!\" Jacob shouted, he had finished shrinking and was now about two inches in height.<br>\r\n<br>\r\n\"Fix him!\" Tina threatened.<br>\r\n<br>\r\nYukina let out that girlish giggle again, \"Can't the effects are permanent. I must say though, I never played with a shrunken man with a partner before.\" She hinted.<br>\r\n<br>\r\nTina let out a gasp as she saw what Yukina was saying, looking at Jacob for a moment she could see a bunch of fun things to do but he was her friend.<br>\r\n<br>\r\n\"What do you say?\" Yukina asked with a smile. Tina bit her lip for a moment before saying,</span></div></div>",
            "created":1246822620,
            "id":719204,
            "title":"Jacob eats the berries"
        },
        "11512":{
            "author_id":"chibichan",
            "author_name":"Chibichan",
            "choices":[
                "Yukina decides to eat them up!",
                "She has other plans instead. Eating them would be like eating the berries."
            ],
            "content":"<div class=\"\"><div> <span>Not wanting to offend their guest, and wanting to seem greatful to the person who had rescued them, Jacob and Tina grabbed the bowl of berries and dug in.<br>\r\n<br>\r\nAs the two enjoy their first food in a long time, Tina finally takes a second to look up and ask, \"So what's your name?\"<br>\r\n<br>\r\nWith haunting slowness, the green haired girl raises her head and her eyes stare deep into Tina's. A cold fear races through the normally happy go lucky girl as their rescuer's eyes seem to penetrate right into her.<br>\r\n<br>\r\n\"Yukina,\" the rescuer says peacefully, \"Those berries will be your doom.\"<br>\r\n<br>\r\nSilently, Jacob takes a few seconds to understand the jolting calm statement and finally stops eating.<br>\r\n<br>\r\n\"What?\" Jacob asks, sure he must have heard her wrong.<br>\r\n<br>\r\nHowever, Tina chimes right in, \"Then why did you feed them to us? You're just joking right? A figure of speach?\" She laughs nervously.<br>\r\n<br>\r\nThe green haired Yukina tilts her head slightly, \"Oh, it's nothing really. No, not poison. I keep these things a secret from everyone else here who knows me. You are my prey. Humans have treated me badly at one time, so now, I treat them as merr food. Not even as people. You see, you've just consumed rare berries that when chilled in our cold climate make the person who eats them shrink. From all you've had, you two should become nothing more than an inch tall.\"</span></div></div>",
            "created":1113973200,
            "id":245909,
            "title":"Yukina's shrinking berries"
        },
        "115121":{
            "author_id":"webslingers",
            "author_name":"theman",
            "content":"<div class=\"\"><div> <span>\"I always enjoy a good meal, so i'll have you two!\" you could'nt believe her. you were going to die as lunch for yukina. she first plops tina in her mouth and plays with her. \"oh jacob, your friend is delicious!\" yukina says as she swallows without hesitation. \"now for the main dish.\" she says as she picks you up and starts sucking you like a lollipop. and all of a sudden she swallows you as you fall to the pit of her belly to be digested.</span></div></div>",
            "created":1199257080,
            "id":482200,
            "title":"in the belly of the beast"
        },
        "115122":{
            "author_id":"chibichan",
            "author_name":"Chibichan",
            "choices":[
                "They shrink and beg Yukina to spare them.",
                "They waste no time, the moment they're an inch tall they run!"
            ],
            "content":"<div class=\"\"><div> <span>\"What?\" Tina gasps, \"Really? I, don't want to be eaten though! Why are you doing this to us? We didn't hurt you!\"<br>\r\n<br>\r\n\"If it wasn't for me,\" Yukina smiles, happily and now even more frightening that she's cheered up, \"You two would be frozen to death. I just helped prolongue everything.\"<br>\r\n<br>\r\nJacob sat up crosslegged, \"Still, you can't just eat people! We have thoughts and feelings just like you. We were greatful you saved us!\"<br>\r\n<br>\r\nYukina shakes her head and giggles, \"Don't be sad. It's an honour to be chosen by me really.\" Her smile is haunting, her eyes closed as she grins with such joy, \"Sometimes I eat the people, but with you two that may be too dangerous. You've eaten so many of those berries, eating you may make me shrink! I guess I'll just have to do the other thing I enjoy.\"<br>\r\n<br>\r\nJacob crosses his arms, \"Really? What's that? You did save us and we'd be glad to do anything we could to make you happy. It's not like we can get home from here without your help.\"<br>\r\n<br>\r\nLaughing, Yukina sits down on the end of the bed, \"No, nothing really that you can do. It's just, nothing feels better than tiny mortal humans benieth my cold bare feet.\"<br>\r\n<br>\r\nGasping Tina moved back into Jacob, \"This is crazy! She's so sweet and innocent but really she's just got a killer instinct!\"<br>\r\n<br>\r\nAgain, the ice maiden Yukina laughs, her voice now a haunting sound to the two strangers that had come across her in the wastelands. She leaned in close to Tina and ran her fingers lightly through her chestnut brown hair, \"Don't speak so harshly of me. You should shrink any time now. You'll know it. It hits really quick, like a little head rush that suddenly consumes you all up. A blast like the cold winds of the arctic, rushing down on you, making you into my tiny prey.\" Shivering with anticipation she sees you squint suddenly in surprise as something stirs deep in you. \"It's starting!\"</span></div></div>",
            "created":1113973200,
            "id":245911,
            "title":"Yukina wants to feel them underfoot"
        },
        "1151221":{
            "author_id":"chibichan",
            "author_name":"Chibichan",
            "choices":[
                "Jacob joins Tina and runs off the bed.",
                "Jacob is stunned by Yukina and doesn't want to leave her."
            ],
            "content":"<div class=\"\"><div> <span>The process is incredibly quick and soon Tina and Jacob find themselves staring up at the impossibly huge Yukina from her bed.<br>\r\n<br>\r\n\"Wow,\" Tina gasps, looking around, then sadly looks up to Yukina, \"Is there no way we can get you to spare us?\"<br>\r\n<br>\r\nLooking up, Tina sees an incredible sight as Yukina stretches her smooth ivory white hands over to caress the tiny girl. Huge fingers closing over top of Tina as she shivers at the cool touch of the ice maiden, \"We could play a game.\"<br>\r\n<br>\r\nTina reaches out, her tiny hands touching the giant fingers around her, \"What kind of game?\"<br>\r\n<br>\r\n\"Well,\", Yukina lays down on her stomach, propping her head up with her hands in front of her tiny captives, \"I like chasing people down. It makes it more fun. Really teaches them what I went through. Never knowing if you really are doomed or not. Lets say if you can survive the night in my hut without me catching you, I'll let you go.\"<br>\r\n<br>\r\n\"That's alright, anything, even if it's a small chance will do. I really don't want to die at the hands, or feet, of the person who saved us,\" Tina gasped.<br>\r\n<br>\r\nShe pokes at Tina with her index finger, giggling as the miniature girl falls over. Jacob had just been sitting there the whole time, just blankly staring at the beautiful giant girl before them.<br>\r\n<br>\r\n\"Well lil one, you were done for anyway. I just thought I should get to have some fun instead of the icy cold getting to have you instead. You may like it! Besides the pain and all. My skin always smells of sweet flowers, and I'm very soft. I bet it feels good under my soft soles!\" Yukina says with such a large smile.<br>\r\n<br>\r\n\"I guess we best get running then!\" Tina yelps as she takes off, Jacob suddnely shocked as she almost leaves him behind.</span></div></div>",
            "created":1115096400,
            "id":248221,
            "title":"A game of cat and mouse"
        },
        "11512211":{
            "author_id":"chibichan",
            "author_name":"Chibichan",
            "choices":[
                "Tina wants to hide under the dresser.",
                "Jacob hides back under the bed."
            ],
            "content":"<div class=\"\"><div> <span>Jacob grabs Tina's hand and pulls you back, \"At least wait for me will ya?\"<br>\r\n<br>\r\nYukina grins down and laughs at her two little captives. To be fair, she picks them up in her incredibly soft hands, leaning over she gently places them on the floor at the foot of her bed and moves back to her pillows, \"Go ahead, I need to get ready anyway,\" With that she slips off her sandals and sits cross legged on the bed, pulling off her light green socks to reveal her pale bare feet.<br>\r\n<br>\r\n\"Come on let's go!\" Tina urges on, the most fearful of the giant girl. However, Tina's cheeks blush as she looks back to Jacob, \"She is cute though. Maybe she'll change her mind even if she does catch us.\"<br>\r\n<br>\r\nJacob looks at Tina confused, \"She wants to crush us like bugs!\"<br>\r\n<br>\r\n\"I don't think so. This isn't about revenge to her. I don't think,\" Tina softly says, running on.<br>\r\n<br>\r\nJacob ducks under a book as he goes running along and catches up to Tina, \"Where are we going to go? There are some dressers we can hide under, the bed is big, the fire pit in the middle of the room wont help though. The table wont either. If we hide in her clothes, she may walk on them though. It's too bad we dont still have our coats, we could sneak outside and just wait it out in the snow!\" Breathing heavy after his ramblings, Jacob looked up to Tina in panic.</span></div></div>",
            "created":1115096400,
            "id":248224,
            "title":"Where to hide from Yukina"
        },
        "115122111":{
            "author_id":"chibichan",
            "author_name":"Chibichan",
            "choices":[
                "They make a run for it!",
                "Tina and Jacob stay put and wait it out."
            ],
            "content":"<div class=\"\"><div> <span>\"We could hide under the dresser,\" Tina offers.<br>\r\n<br>\r\n\"I suppose so, this is tough!\" Jacob sighs as he runs along with his tiny companion. \"Do you think she'll actually look for us or do you suppose she'll just catch us if she sees us?\"<br>\r\n<br>\r\nTired of questions Tina just snaps back, \"I don't know!\"<br>\r\n<br>\r\nTina dives under the dresser and Jacob quickly followers her under. That's when they hear the ice maiden high above, \"Ready or not lil people! I'm coming to get you!\" With a thud she rolls off her bed and lands on her hands and knees on the floor.<br>\r\n<br>\r\n\"I guess under the bed would have been a bad choice,\" Jacob says in dispair as Yukina's massive head turns to look under the bed eagerly. Then she pouts and looks back out into the room, across her messy floor.<br>\r\n<br>\r\nTina and Jacob hide back against the far wall together, patiently hoping Yukina doesn't think to look under there.<br>\r\n<br>\r\nYukina pads a massive hand down on a shirt laying on the floor, \"Under, HERE? Nuh uh? Aww, maybe over near the end of the bed still. You'd be surprised, I think some people really do like me to do this though! My feet are soft as silk.\"<br>\r\n<br>\r\nFrom where the two tiny explorers are hiding, they can make out Yukina's huge form looking away from them and the upturned soles of her feet as she walks on her knees.<br>\r\n<br>\r\nJacob calmly looks to Tina, \"They dont look bad but still.\"<br>\r\n<br>\r\n\"Into feet? I don't blame you for saying that, but, I'd rather live, okay?\" Tina said grinning at her companion, \"If you're lucky maybe she'll let you be her royal foot massager,\" she said with a laugh.<br>\r\n<br>\r\n\"Well they do look pretty soft. Maybe we could live through anything she does! She looks it, but don't forget, she isnt human. Maybe their feet are padded enough that she can't crush us,\" Jacob tried again, his mind racing obviously with too much panic.<br>\r\n<br>\r\n\"There are only so many places you can hide little ones, where will you run?\" Yukina laughed, her loud voice high above.<br>\r\n<br>\r\n\"She's going to find us!\" Tina cried.<br>\r\n<br>\r\n\"She will soon enough! I dunno, maybe I should offer to give her a massage like you said,\" Jacob began to walk out but stopped suddenly when Tina grabbed him and threw him down.<br>\r\n<br>\r\n\"If we get you of here alive, you can give ME a massage,\" Tina snapped at him, \"For now, we gotta find a place to get to before she crawls over here and spots us! I don't know if there's anywhere reachable.\"<br>\r\n<br>\r\nTina looked over further along, \"We'd have to run under her desk to get to the cupboard where it looks like she keeps her food and cooking supplies. Thats a big open area to cross under. A big risk.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1115096400,
            "id":248229,
            "title":"Yukina crawls after her prey"
        },
        "1151221111":{
            "author_id":"tinylelouch",
            "author_name":"Lelouch",
            "choices":[
                "Can I please be your royal foot massager!",
                "Do whatever you want with me but leave Tina alone!"
            ],
            "content":"<div class=\"\"><div> <span>\"Then lets book it!\" Jacob spoke up as he grabbed onto Tina's wrist and started running across the massive plain that was Yukina's floor. <br>\r\n<br>\r\n\"I can run for myself!\" Tina shouted, pulling her wrist free and running ahead.<br>\r\n<br>\r\n\"Where are you little bugs?\" Yukina asked teasingly, looking underneath the cupboard that Tina and Jacob were just at. <br>\r\n<br>\r\n\"Good thing we left.\" Tina huffed, with Jacob close behind her.<br>\r\n<br>\r\n\"This is starting to not get fun......just come out. I promise I won't bite.\" Yukia pleaded.<br>\r\n<br>\r\n\"Yeah right, and I'm a princess,\" Tina muttered sarcastically, picking up her pace.<br>\r\n<br>\r\nIn a couple of minutes Tina sucessfully reached the cupboard, cheering aloud in her accomplishment.<br>\r\n<br>\r\n\"Yay we did it Jacob!.....Jacob?\" Tina looked around and saw she was alone at the cupboard. Breaking out in a cold sweat Tina flipped over and saw Jacob....in the middle of the floor, staring at Yukina's soles. <br>\r\n<br>\r\n\"Jacob what are you doing! Get over here!\" Tina screamed desperately. She may have as well been talking to a toy, Jacob stood perfectly still, transfixed at Yukina's beauty.<br>\r\n<br>\r\nYukina began to spin around. \"Oh bugs....when I find you....\" Yukina stopped as her eyes came onto Jacob, who was now staring at Yukina's giant face, what looked like drool on the side of his lip.<br>\r\n<br>\r\n\"Why hello bug boy, did you come out just for little ol me?\" Yukina giggled at her size joke. Jacob began stuttering, he wanted to say something.<br>\r\n<br>\r\n\"What is that idiot doing?\" Tina asked from her safe place.<br>\r\n<br>\r\n\"Umm...Yukina....\" Jacob stuttered, playing with his fingers nervously.<br>\r\n<br>\r\n\"Yes?\" Yukina asked curiously.<br>\r\n<br>\r\nJacob paused before saying....</span></div></div>",
            "created":1246849800,
            "id":719428,
            "title":"Tina's safe, Jacob's not"
        },
        "1151221112":{
            "author_id":"chibichan",
            "author_name":"Chibichan",
            "choices":[
                "Tina submits and does as she's asked.",
                "Tina growls back and bites Yukina."
            ],
            "content":"<div class=\"\"><div> <span>\"I think it's a better bet that we stay here,\" Tina says as they both scootch back against the wall of the hut.<br>\r\n<br>\r\nThey slide back together as thunderous scrambling can be heard from Yukina's position, \"Aww silly lil guys. It's obvious now. If I havnt already squished you under my knees under some clothes, your under this dresser. Or else I would have seen you under my desk.\" Yukina laughed lightly and ducked down, \"I bet you didnt even think to look at this! Her slender fingers suddenly wrap around a tiny bit of carpet that is under the dresser. <br>\r\n<br>\r\nThe two companions hearts sink as they realize they're both ducked down on the same bit of carpet shes grabbed and is pulling from under the dresser.<br>\r\n<br>\r\nWith wide eyes Tina stared down and slowly said to herself, \"That's just not good,\" then tries to bolt for it.<br>\r\n<br>\r\nJacob however is caught off guard and gets pulled right out. He looks back to Tina who almost make it away but Yukina quickly brings her left leg up, her slender bare calf coming out of her komono as her giant bare foot clamps down over her tiny body, holding her still.<br>\r\n<br>\r\n\"Silly girl, you're going to be the most fun. Its cute when they fight it,\" she giggles and gathers Jacob up in her hands.<br>\r\n<br>\r\nTina sruggled against the massive bare foot pinning her down, \"Let me go! I'll do anything!\"<br>\r\n<br>\r\nGiggling Yukina noted, \"You humans are so cute when you panic,\" as she sits up, \"I bet you'll do anything wont you? Even gross stuff. Would you kiss or lick my foot if I considered taking it off you?\"</span></div></div>",
            "created":1115096400,
            "id":248230,
            "title":"Pulling the carpet out from under them"
        },
        "11512211121":{
            "author_id":"chibichan",
            "author_name":"Chibichan",
            "choices":[
                "They go along with Yukina's idea.",
                "Forget that, who wants to be a tiny pet? They run for it!"
            ],
            "content":"<div class=\"\"><div> <span>Embarassed, Tina admits that she would do anything to get free from Yukina. Even lick or kiss her giant bare feet.<br>\r\n<br>\r\n\"Aww!\" Comes a shocked reply from the giant girl, she laughs a little, giggling still and looking down upon where Tina is trapped underfoot. \"This is so cute! Comon then, do it a little. They're not that gross. Just right where you are, under the ball of my foot.\"<br>\r\n<br>\r\nTina moans slightly and kisses the giant foot upon her gently. Not wanting to, she realizes Yukina was right about the softness. There's nothing gross about it, it's just embarrasing.<br>\r\n<br>\r\n\"Aww thats it, see? An ice maiden always has cool and dry skin, didn't even taste sweaty right?\" Yukina giggles a little, lifting her foot off Tina and putting Jacob down next to her, \"You two are pretty good sports. Either that or the guys just slow.\"<br>\r\n<br>\r\n\"So are you going to spare us?\" Tina asked hopefully.<br>\r\n<br>\r\n\"Aww I dunno,\" Yukina admits, \"You're so much fun to play with. I know something that is kinda gross though.\"<br>\r\n<br>\r\nYukina sits up, hugging her knees to her chest \"Comon over and massage between my big toe and the one next to it, both of you, pick a foot and get right in there!\" She grins down, \"Usually you tiny people are squished by now, you two are fun! Maybe I may keep you instead!\"</span></div></div>",
            "created":1115096400,
            "id":248232,
            "title":"Tina gives in and kisses Yukina's sole"
        },
        "115122111211":{
            "choices":[
                "Stay with Yukina and see what happens!",
                "Decide to leave and never come back!"
            ],
            "content":"<div class=\"\"><div> <span>Tina and Jacob did as Yukina asked them to do. They went in between her toes and began to lick and massage them hoping that Yukina will like it. Yukina watched in pleasure as Tina and Jacob squirm in between her toes. She watched Tina knowing that she was hating this and that Jacob was having a wonderful time. Yukina thought about when she was forced by humans to do whatever they told her to do and now she was in control. But she didn't want to force anyone to do something that they didn't want to do. That would make her as bad as the humans that imprisoned her. Yukina then grabbed Tina and Jacob who were still licking and massaging between her toes and sat them at the end of the bed. She told them that since they were nice and that they didn't try to run away from her that she would give them two choices. They could either stay with her and that she would be their friend or that they could leave and never come back. The choice is up to the two of you and before you answer I just want to say that I'm sorry that I treated you guys so unfairly and if you stay I will treat both of you with the respect you both deserve.</span></div></div>",
            "created":1117602000,
            "id":253623,
            "title":"Tina and Jacob's choice"
        },
        "1151221112111":{
            "choices":[
                "Give them the berries to make them grow to their normal sizes",
                "Decide that their lying and don't give them the berries to make them grow to"
            ],
            "content":"<div class=\"\"><div> <span>After much consideration Tina and Jacob decided to stay with Yukina. Yukina was so happy that they decided to stay with her. Since we decided to stay with you, can you please restore us to our normal sizes, Tina pleaded. Yukina thought about it, not knowing if they really wanted to stay with her or they were just lying so that when her back was turned they would leave. Yukina made up her mind and decided to...  </span></div></div>",
            "created":1117688400,
            "id":253858,
            "title":"Second Thoughts?"
        },
        "11512211121111":{
            "choices":[
                "he wants to stay at his current size.",
                "he wants to return to his normal size."
            ],
            "content":"<div class=\"\"><div> <span>Yukina thought of what Tina said and decided to make them grow back to their normal sizes. Yukina went to get the dry berries. First she gave Tina one and she ate it. After like couple of seconds, Tina grew back to her normal size. Next was Jacob's turn. Tina gave a berry to Jacob, but instead of eating it right away like Tina did, Jacob looked at the two beautiful girls and decides that</span></div></div>",
            "created":1118725200,
            "id":256411,
            "title":"Jacob's Choice"
        },
        "115122111211111":{
            "choices":[
                "Message Yukina's feet.",
                "Message Tina's feet."
            ],
            "content":"<div class=\"\"><div> <span>Jacob told Tina and Yukina that he wants to stay at his current size and be their foot slave. Tina and Yukina looked at Jacob with a confused look on their faces and they took the berry that Jacob had and placed it with the others. Since, I told you that if we ever get out of this mess, you can massage my feet, Tina said with a giggle. Or you can message my feet if you want, Yukina said also with a giggle. Jacob couldn't believe it, he was with two beautiful girls and now he can be their foot slave forever. Jacob couldn't decide who's feet to start with first. He had pleasure with Yukina's feet before, but now he can message his friend's feet without her getting mad. Who then should I start with.</span></div></div>",
            "created":1118811600,
            "id":256518,
            "title":"Jacob wants to be a foot slave"
        },
        "1151221112111111":{
            "author_id":"webslingers",
            "author_name":"theman",
            "choices":[
                "she accidentally steps on you",
                "she gets angry"
            ],
            "content":"<div class=\"\"><div> <span>You decide Tina can wait later for you to message her. You were in a trance by yukina's feet. you start by smelling the sweet scent of her feet. then you start messaging with your tongue. you start tickling her and find out she's ticklish. she starts moving her feet up and down rapidy...</span></div></div>",
            "created":1199256540,
            "id":482196,
            "title":"Messaging an ice goddess"
        },
        "1151221112111112":{
            "choices":[
                "I always wanted someone to play with my feet",
                "Can I play with your feet instead?"
            ],
            "content":"<div class=\"\"><div> <span>Jacob tells Yukina and Tina that he would go with Tina. Tina looks down at Jacob and says \"thank you for choosing me and now you will get what you wanted\". Yukina just sighs and looks at Tina saying \" you are so lucky\". Tina begins to take off her shoes and she places them on the floor next to the bed. Tina sat on the bed looking at her bare feet. Yukina looking at Tina's bare feet begins to smell something. Yukina asks Tina and Jacob if they smell something. Jacob just stared at just how big Tina's feet are and Tina tells Yukina that its just her feet. Tina tells Yukina sorry that her feet stink, but Yukina says that they smell nice. Tina with a confused look on her face says to Yukina that nobody every said that her feet smelled nice except for herself. Yukina asks Tina if see can get closer to them and Tina says it was o.k. Yukina got at the end of the bed and began to see how big they were and began to smell them. Yukina was getting aroused by this and asks Tina if she could play with her feet. Tina tells Yukina that Jacob was going to massage her feet. Yukina tells Tina to forget about Jacob and Jacob looks up and says what about me? Yukina reaches down and puts Jacob into a jar with air holes and places him on a shelf. Yukina walks back to Tina and asks again. Tina tells Yukina...</span></div></div>",
            "created":1129698000,
            "id":279680,
            "title":"Yukina likes Tina's feet"
        },
        "1152":{
            "author_id":"tinylelouch",
            "author_name":"Lelouch",
            "choices":[
                "Botan",
                "Yukina",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More shrinking choices.</span></div></span></div>",
            "created":1246821540,
            "id":719188,
            "title":"Pick another Yu Yu Hakusho character."
        },
        "12":{
            "author_id":"kamaria",
            "author_name":"Kamaria",
            "choices":[
                "Keiko",
                "Yukina",
                "Botan",
                "Shizuru",
                "Multiple GTS"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The girls go mega. Which one?</span></div></span></div>",
            "created":1088139600,
            "id":204645,
            "title":"Lucky girl"
        },
        "121":{
            "author_id":"tinylelouch",
            "author_name":"Lelouch",
            "choices":[
                "She grew to 50 feet",
                "She grew to 200 feet",
                "Bigger?"
            ],
            "content":"<div class=\"\"><div> <span>It was a relatively good day for the young Keiko Yukimura, she had just finished school for the day and was on her way home, her friend Yusuke Urameshi right next to her, begging her to go on a date.<br>\r\n<br>\r\n\"Come on Keiko! I'm sorry I stood you up last time! There was this huge ogre and-\" <br>\r\n<br>\r\n\"And you had to leave me alone at the movies I get it Yusuke!\" Keiko muttered in an upset tone. She held Yusuke's spirit beast Pu in her arms.<br>\r\n<br>\r\n\"Pu!\" The little spirit being piped up, upset at the twos fighting.<br>\r\n<br>\r\nYusuke smiled nervously at Keiko, trailing at her side. \"Come on!! I'll make it up to you tonight! We can-\"<br>\r\n<br>\r\n\"No\" Keiko cut him off.<br>\r\n<br>\r\n\"But we coul-\"<br>\r\n<br>\r\n\"No\"<br>\r\n<br>\r\n\"How ab-\"<br>\r\n<br>\r\n\"NO!\" Keiko screamed. <br>\r\n<br>\r\n\"Come on! I said I'm sorry! What can I do to make it up to ya?\" Yusuke begged.<br>\r\n<br>\r\nKeiko looked at Yusuke for a moment and smiled. \"Well I suppose we coul-\"<br>\r\n<br>\r\n\"Hey Yusuke!\" A loud girly voice piped up from above. Yusuke and Keiko looked up to see their friend Botan the Grim Reaper in her pink outfit riding a broom.<br>\r\n<br>\r\n\"We have a job for you!\" She called happily.<br>\r\n<br>\r\n\"Can't it wait?\" Yusuke asked angrily, his hand glowing with his energy.<br>\r\n<br>\r\n\"No it can't! We have recieved reports of a B rank demon near the center of town!\" Botan called, jumping onto the ground with Keiko and Yusuke.<br>\r\n<br>\r\nYusuke sighed and turned to Keiko. \"I'm sorry.\" he apologized before running off with Botan close behind him, Keiko left where she was fuming.<br>\r\n<br>\r\n\"God he makes me so mad!\" She mutter angrily, beginning to stomp her way home. Suddenly she felt an odd yet painful pulse radiate throughout her body.<br>\r\n<br>\r\n\"Not this again.\" She muttered, ever since Yusuke's return from the Dark Tournament Keiko had occasionally felt a shot of pain like this. She had asked Botan about it once and Botan explained it as the result of being around someone as powerful as Yusuke.<br>\r\n<br>\r\n\"You'll get used to it.\" She said confidently at the time, but this feeling was different from the rest Keiko had ever experienced. It felt...different as if it belonged to Keiko and wasn't just the result of Yusuke's energy.<br>\r\n<br>\r\nThe pain in Keiko subsided and was soon replaced with an odd feeling, not necessarily a bad one just odd. \"What's happening?\" Keiko asked aloud as she miraculously...began to grow!</span></div></div>",
            "created":1246908960,
            "id":719708,
            "title":"A fight with Yusuke"
        },
        "1213":{
            "author_id":"tinylelouch",
            "author_name":"Lelouch",
            "choices":[
                "500 feet!",
                "2000 Feet!!!",
                "Make her a Giga Giantess!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bigger huh? How bigger?</span></div></span></div>",
            "created":1246910760,
            "id":719720,
            "title":"Bigger?"
        },
        "12131":{
            "author_id":"tinylelouch",
            "author_name":"Lelouch",
            "choices":[
                "Keiko is horrified at what she did",
                "Keiko kinda liked crushing people"
            ],
            "content":"<div class=\"\"><div> <span>\"What's happening?\" Keiko shrieked as her body expanded to a total of ten feet in height, her clothes stretched to their limits. Pu flew out of Keiko arms and flew away, presumably to get help.<br>\r\n<br>\r\n\"Am I...growing?\"  Keiko asked aloud as she now reached fifteen feet, a loud ripping noise from below told Keiko her shoes and socks were now destroyed. People began gathering around the amazon sized giantess, murmuring to themselves.<br>\r\n<br>\r\n\"Quit staring at me!\" Keiko shrieked, slapping her hand against the crowd and actually swiping them all away, she was now thirty feet tall.<br>\r\n<br>\r\n\"When is this going to stop?!\" Keiko screamed as she placed a hand on the top of a small building, her clothes had large tears everywhere in them at this point. Keiko's bare feet were the size of small cars now.<br>\r\n<br>\r\nAn on coming car didn't see the growing giantess until it was too late, with a horrific sounding screech the car swerved to its side and slammed into Keiko's ankle. <br>\r\n<br>\r\n\"Ow!\" The giantess yelled, feeling as if she had been punched in the ankle. Another series of ripping noises told Keiko her skirt was gone and her azure panties stretched to their limits. Keiko had now approached fifty feet in height and was still going.<br>\r\n<br>\r\nLooking nervously down at the town Keiko shuffled her feet in an attempt to avoid crushing anyone but her left foot found its way onto a car and caused Keiko to fall. <br>\r\n<br>\r\n\"Ahh!!\" She screamed as she fell back, she could hear the terrified shrieks of people getting crushed under her massive frame. With her head on the street Keiko kept growing, her body was becoming to big for the street to hold her so buildings began to get forcefully pushed aside by her body.<br>\r\n<br>\r\nYet another loud rip caused Keiko to look down, her top had come off and her bra didn't look like it would last.  <br>\r\n<br>\r\n\"Stop staring at me!\" Keiko pleaded to the random citizens who could see her, she began to raise herself back up only to see she was now big enough to be seen by the entire town. She rivaled the tallest buildings and showed no signs of stopping her growth. <br>\r\n<br>\r\nA loud pop was heard as Keiko's top literally burst from its hems leaving her chest exposed. <br>\r\n<br>\r\nBlushing wildly Keiko shrieked and grabbed a nearby skyscraped, literally tearing it in half and using the part she ripped off as a cover for her chest. The feeling within Keiko didn't subside, in fact in continued to grow until Keiko felt her body would burst, This next growth would top all of her last ones.<br>\r\n<br>\r\nWith a loud moan that held a mixture of terror and pleasure Keiko's body began to expand once more, crushing several buildings beneath her growing feet. Keiko's forced her eyes shut, hoping it was all just a horrible dream but she opened them eventually and to her relief she seemed to have stopped growing; to her horror she was now at least 200 feet tall.<br>\r\n<br>\r\nLooking down Keiko saw that she was completely exposed, the building she held gave way to her increasing size and strength. By her feet were people half the size of her toes who were just staring at her.....assets.<br>\r\n<br>\r\n\"Don't stare at me!\" She screamed as she raised a foot and stepped over them all with it, crushing their frail bodies beneath her bare sole. Raising her foot Keiko gasped as she saw small splats of blood where the people were, examining her sole she saw blood oozing all over her foot. The last thing those people would ever remember was the smell and feeling of Keiko's bare foot.</span></div></div>",
            "created":1246912140,
            "id":719731,
            "title":"Keiko's growth"
        },
        "122":{
            "choices":[
                "During the tournament",
                "After the tournament"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What season do you want this to be? Yukina will still grow,and a lot of stuff will happen, but this will effect the storyline of everything.</span></div></span></div>",
            "created":1089003600,
            "id":206233,
            "title":"Storyline"
        },
        "1221":{
            "choices":[
                "Now",
                "Later"
            ],
            "content":"<div class=\"\"><div> <span>All was on the line in this tournament. Yukina, along with her friends,had just arrived to see what was going on. Suddenly,a street vendor walked up to her,opening his trenchcoat. The coat was lined up and down with magic artifacts.<br>\r\n<br>\r\n\"Wow! Souveniers!\" they said,looking at everything. One of them caught Yukina's eye,a beautiful platinum necklace with a light blue crystal on it.<br>\r\n<br>\r\n\"Ahh. You like? I am running a special on it. 2000 gil.\" the vendor said.<br>\r\n<br>\r\n\"Whats gil?\" Keiko asked.<br>\r\n<br>\r\n\"Universal spirit and demon world money. The exchange rate is the same as yen.\" Yukina said, buying the necklace. Turns out it is a Crystal Ice artifact,and since shes an ice person,its gonna have size and magic powers,making her into the ice goddess.<br>\r\n<br>\r\nDoes she try it on now,or will she wait for Kuwabara to finish his fight?</span></div></div>",
            "created":1089003600,
            "id":206238,
            "title":"Street Vendor"
        },
        "12211":{
            "author_id":"pokeroker",
            "author_name":"Poke",
            "choices":[
                "She continues to watch the tournament",
                "Find that vendor!!"
            ],
            "content":"<div class=\"\"><div> <span>Once wearing the necklace, the necklace emits a icy blue glow and starts to melt into Yukina's body!<br>\r\n<br>\r\n\"What the...?\" Yukina asks, confused. Yukina starts to feel an awkward sensation, making her uneasy. However, the feeling starts to ebb away and Yukina feels as active and rejuvenated as ever. She starts to feel energy running down her legs, hips and more importantly, her chest area. <br>\r\n<br>\r\nWith every second, her legs and arms begin extending and her breasts start to expand. She is growing taller, bustier and sexier too! Her clothes are becoming tighter and her breasts begin to fill. Shocked at the growth, she starts to panic, trying to find a way to stop the growth. <br>\r\n<br>\r\nAlas, all her efforts are futile and her breasts start to cause wear and tears at her clothes. Slowly but surely, Yukina is evolving into an amazon and her clothes are stretched to transparency. She tried to find the street vendor has disappeared! What will she do now?</span></div></div>",
            "created":1370271840,
            "id":1603034,
            "title":"Now"
        },
        "12212":{
            "choices":[
                "Yusuke",
                "Toguro"
            ],
            "content":"<div class=\"\"><div> <span>Yukina didn't want to interupt the battle,so she decided to wait til later. Backstage,when she was about to get to her seat, Sakyo walked up to her.<br>\r\n<br>\r\n\"Who are you?\" she asked.<br>\r\n<br>\r\n\"That is not the question you should be asking.\" he responded in a soft tone.<br>\r\n<br>\r\n\"What do you want?\" she asked again.<br>\r\n<br>\r\n\"I want you to assist Toguro in his fight against Yusuke. Win by any means necessary.\" he demanded in the same tone of voice.<br>\r\n<br>\r\n\"But why?\"<br>\r\n<br>\r\n\"If you don't,your little friend Kazuma will be hanged in front of you.\" he said,making her gasp.<br>\r\n<br>\r\n<br>\r\nYusuke and Toguro were exchanging blows. Yukina didn't understand why she had to interfere,but alas she had no choice. Toguro did a massive powerbomb which seemed to have knocked Yusuke out cold.<br>\r\n<br>\r\n\"You don't know what it is to be a champion. I'm the best in the world. I came here for you!\" Toguro shouted,well,tried to shout. The guys voice is lower than Steven Segal's.<br>\r\n<br>\r\nThe next thing the two fighters saw was a gigantic Yukina step into the arena. Who does she attack?</span></div></div>",
            "created":1090904400,
            "id":209406,
            "title":"Assistance from the outside"
        },
        "122121":{
            "choices":[
                "Genkai's spirit gives Yusuke his second wind",
                "Hiei steps in"
            ],
            "content":"<div class=\"\"><div> <span>\"Forgive me Yusuke.....\" she said as she formed an icicle in her hand and shot it at him,the spear going right into his shoulder. <br>\r\n<br>\r\n\"Yukina....\" Kuwabara was in shock,but that was nothing compared to the suprise Hiei felt. Not even Toguro understood,but he decided to capitalize on it.<br>\r\n<br>\r\n\"It was not wise to pick a fight with the dirtiest players in the game. Game over,Urameshi....\" Toguro said as he picked poor Yusuke up and did a spinebuster that caused the ground to split.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1090904400,
            "id":209408,
            "title":"Capitalize the event"
        },
        "1221211":{
            "choices":[
                "Toguro",
                "Yukina"
            ],
            "content":"<div class=\"\"><div> <span>Yusuke felt a power rush and he got up, his fists glowing blue.<br>\r\n<br>\r\n\"Thanks Genkai....wherever you are\" he said as he looked at his two opponents. As tough as Toguro is, Yukina might pose more of a threat.<br>\r\n<br>\r\nWho should he fight first?</span></div></div>",
            "created":1109480400,
            "id":237943,
            "title":"2 on 1"
        },
        "1221212":{
            "choices":[
                "Tell Yukina the truth....you know what I mean",
                "Layeth the smackdown on Toguro"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hiei had to take responsibility for all this,so he stepped into the arena and took off his headband. There was something he had to do,something that the people who watch the show want.<br>\r\n<br>\r\nAnd that is....?</span></div></span></div>",
            "created":1090904400,
            "id":209410,
            "title":"Hiei's turn"
        },
        "123":{
            "author_id":"somedude248",
            "author_name":"somedude",
            "choices":[
                "It doesn't affect her right away, so Botan continues her job",
                "It does affect her right away, creating panic"
            ],
            "content":"<div class=\"\"><div> <span>The list didn't seem that long.  At least Botan thought as much as she flew over the city.  The rest period between assisting Yusuke with his duties as Spirit Detective had her catching up with her primary job, Grim Reaper.<br>\r\n<br>\r\nHer last assignment also seemed simple enough.  It was to help a scientist cross over.  He was going to die in a big explosion.  Of course, if she knew what he was working with, she might have decided to come back later.<br>\r\n<br>\r\nThe building where the man lived, convintely close to the school where Yusuke attened, was burning to the ground.  Inside, a man was laughing, oblivious to the fires around him.<br>\r\n<br>\r\n\"I've done it!  I've created the matter changing formula!  Soon I will control...\"<br>\r\n<br>\r\nThe man's screams were drowned out as the building went up in a huge explosion, sending the chemical flying everywhere.<br>\r\n<br>\r\nLanding right all over Botan as she landed to find the spirit.<br>\r\n<br>\r\n\"Oh, this is just gross!\" shouted Botan as she was splashed in the chemical.  \"I should have taken the day off!\"<br>\r\n<br>\r\nOf course, unknown to Botan, the chemical was designed to change sizes.  The specific batch she was splashed with expands matter...</span></div></div>",
            "created":1088658000,
            "id":205544,
            "title":"Work hazards"
        },
        "1231":{
            "choices":[
                "Visit Yusuke",
                "Return to Koenma"
            ],
            "content":"<div class=\"\"><div> <span>Although it did put some stains on her clothes, she didn't feel much from it,yet at least. Suddenly,her shoes felt tight,so out of instinct she took them off. The chemicals hit her from the ankles up,so the rest of the clothes will grow with her.<br>\r\n<br>\r\n\"This is not my day....\" she sighed, wondering what to do next. She will continuely grow throughout the day,but at a slow pace.</span></div></div>",
            "created":1089349200,
            "id":206903,
            "title":"Slowed effect"
        },
        "12312":{
            "choices":[
                "\"Your next assignment is....\"",
                "\"You seem taller? Did you get new shoes or something?\""
            ],
            "content":"<div class=\"\"><div> <span>Botan thought it was nothing and decided to return to Spirit World for her next assignment. She did notice things were a bit lower than usual. The thing that really got her was that when she got to Ogre, his eyes were level with her chin when they were once the same size.<br>\r\n<br>\r\n\"Reporting for duty sir!\" Botan said in her cheerful tone. <br>\r\n<br>\r\nWhats Koenma's reaction?</span></div></div>",
            "created":1090731600,
            "id":209055,
            "title":"Reporting back"
        },
        "1232":{
            "choices":[
                "Yusuke",
                "Koenma"
            ],
            "content":"<div class=\"\"><div> <span>Luck was not on Botan's side today as she quickly grew to about 50ft tall. One good side is that her clothes and oar grew with her,so she could continue her job. Problem is,she finally looks scary to humans. <br>\r\n<br>\r\n\"This....isn't something you see everyday.\" was all she could say as she looked down at the surroundings below. Everyone looked up in wonder and fear.<br>\r\n<br>\r\n\"Yusuke said the Grim Reaper is supposed to scare people,but I'm not sure if this is what he meant.\" she said,trying to look optimistic. She has two paths from here. One is to return to Spirit World and let Koenma help her. Or,if she wants to avoid getting yelled at,she can find Yusuke.</span></div></div>",
            "created":1088658000,
            "id":205564,
            "title":"Fear the Reaper?"
        },
        "12321":{
            "author_id":"somedude248",
            "author_name":"somedude",
            "choices":[
                "Her trip goes as planned",
                "Helicopters intercept her midway..."
            ],
            "content":"<div class=\"\"><div> <span>The thought of returning to Spirit World to ask for help croseed Botan's mind for about 4 seconds before she vizualised Koenma's reaction.<br>\r\n<br>\r\n\"WHAT HAVE YOU DONE?!  DO YOU HAVE ANY IDEA HOW MUCH TROUBLE I'M GOING TO BE IN WITH A 50 FOOT TALL REAPER?!\"  The added visuals of panicked demons and a very angry King Yemma did little to help.<br>\r\n<br>\r\nShe quickly decided visiting Koenma would not be the smart thing to do now.  The closest person to her right now was Yusuke, so she decided visiting him might be a start.<br>\r\n<br>\r\nQuickly taking to the air to avoid the panicked citizens, she hurridely flew towards Yusuke's house.<br>\r\n<br>\r\n\"I just hope I don't scare him to death when I finally do get there,\" she thought.</span></div></div>",
            "created":1089608400,
            "id":207346,
            "title":"Avoiding punishment"
        },
        "123211":{
            "author_name":"Nobody's Special",
            "choices":[
                "Botan tries to gentlily nudge Yusuke awake.",
                "Too late Kieko's come looking for Yusuke."
            ],
            "content":"<div class=\"\"><div> <span>Botan had already flown most of the way to Yusuke's school without any problems, until it suddenly dawned on her that it was going to be very difficult to contact him without blowing his cover as spirit detective. For a moment she imagined him yelling, \"Well what do you want me to do about it?\" Which made her have second thoughts until she thought about what Koenma would do instead.<br>\r\n<br>\r\nAs stealthily as she could, which still got her spotted by hundreds of people, she came to the lowest possible hover she could over the school's roof. Luckily Yusuke was there as usual, taking a nap.<br>\r\n<br>\r\nWith a sigh of relief she tried to decide how to wake him up before anyone else came up here.</span></div></div>",
            "created":1109480400,
            "id":237940,
            "title":"As planned?"
        },
        "1232111":{
            "author_id":"somedude248",
            "author_name":"somedude",
            "choices":[
                "He listens",
                "He freaks out"
            ],
            "content":"<div class=\"\"><div> <span>No one seemed to be entering the room at the moment, so Botan quickly moved her finger through the window to nudge Yusuke awake, hoping that he wouldn't be surprised.<br>\r\n<br>\r\n\"Come on Yusuke, look, I wouldn't wake you up but this is important...\"<br>\r\n<br>\r\nYusuke moved to and fro on his bed, but aside from the occasional piece of unintelligable mumbling, stayed silent.<br>\r\n<br>\r\nBotan continued this for the next minute till she realized that simple nudging wasn't going to do the job.  Pressing her finger into Yusuke's chest, she hoped that he would be feel the shock and awaken.  Sure enough, it worked.<br>\r\n<br>\r\n\"Huh?  What's going on?\"  Yusuke quickly attempted to push the finger off of him before he realized just what it was.  Turning to the window, he saw the familiar face of Botan in a not-so-familair poistion, worry.<br>\r\n<br>\r\n\"Yusuke, can we talk?\"</span></div></div>",
            "created":1110085200,
            "id":238627,
            "title":"Wakey wakey..."
        },
        "12321112":{
            "choices":[
                "Where they first meet Genkai",
                "Some isolated location"
            ],
            "content":"<div class=\"\"><div> <span>\"AAAAHH! Uff.\" he says as he falls over the bed. Botan justs gives out a small giggle. Yusuke gets up quickly. \"Botan. What the hell happened?\"<br>\r\n<br>\r\n\"Well I was doing me job when a scientist splashed me with something and the next thing I know I'm 50ft. tall. So I came to you to see if you can help me.\"<br>\r\n<br>\r\nYusuke walk to the window and sat there. He started thinking on how to help her.\"Hm. How am I going suppose to help you? I can't think of anything.\" Botan then looks down in disappointment.\"Perfect she does something can't stand.\" he thinks. \"Is there any item you can use?\" She thinks for a moment.<br>\r\n<br>\r\n\"No.\" she says.<br>\r\n<br>\r\n\"Come think Yusuke think.\" he told himself quietly. \"Did you already talk to Koenma?\"<br>\r\n<br>\r\n\"Uh yes. Yes I did.\" she said lying.<br>\r\n<br>\r\n\"Perhaps we should talk to the others besides Kuwabura. Maybe they help um us I guess.\"<br>\r\n<br>\r\n\"Okay then.\" she said smiling to Yusuke.<br>\r\n<br>\r\n\"Botan hide!\"<br>\r\n<br>\r\n\"Why?\"<br>\r\n<br>\r\n\"Someone's come into my room.\" Then at nick of time she hid before Yusuke's mother came in.<br>\r\n<br>\r\n\"Yusuke. Who were where you talking to?\"<br>\r\n<br>\r\n\"Great she heard me.\" he thought.\"No one. There no here. Look around for yourself.\" She headed for the window looked around to see no one. Then she shrugged and left.<br>\r\n<br>\r\n\"Phew.\" He ran to the window. \"Botan.\"<br>\r\n<br>\r\n\"What?\" Yusuke looked up to see Botan staring at him.<br>\r\n<br>\r\n\"Okay there you are. I'm going to get dressed then we'll leave. Alright?\"<br>\r\n<br>\r\n\"Okay just hurry up?\"<br>\r\n<br>\r\n\"So any idea's where to meet up at?\"</span></div></div>",
            "created":1167454800,
            "id":369539,
            "title":"Yusuke helps(Or trys to)"
        },
        "123212":{
            "choices":[
                "Agree and land",
                "Fly past them"
            ],
            "content":"<div class=\"\"><div> <span>Botan flew through the skies,but she was already noticed. News and police helicopters flew all around her,curious and confused.<br>\r\n<br>\r\n\"Miss giant?! We would like to ask you a few questions! You will not be harmed!\" came a shout from the news copter. <br>\r\n<br>\r\n\"What should I do? I like attention,but what if this gets out of hand?\" Botan thought to herself. Maybe she can become a celebrity,maybe not. <br>\r\n<br>\r\nIts all up to you.</span></div></div>",
            "created":1089608400,
            "id":207352,
            "title":"Chance of a lifetime"
        },
        "12322":{
            "author_id":"magitekmayhem",
            "author_name":"MagitekMayhem",
            "choices":[
                "She Calls for Him",
                "She Trys Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Botan decided to head back to Spirit World. <br>\r\n\"I might get in trouble, but Koenma is sure to know of something that can help me.\" <br>\r\nShe quickly flew across the border connecting Spirit World with the Human World and flew down the River Styx. In a matter of moments she was at Koenma's palace. She landed and found that she was too big to get in.<br>\r\n\"Oh dear, this is a problem.\" She said trying to think of how to get to Koenma.</span></div></div>",
            "created":1089349200,
            "id":206893,
            "title":"In Spirit World..."
        },
        "124":{
            "choices":[
                "A birthday gift from Kuwabara (On accident)",
                "A love present from Sakyo (On purpose)"
            ],
            "content":"<div class=\"\"><div> <span>A minor character in the storyline,but a cute one nontheless,so she gets to grow in this one. It can either be an accident,or on purpose,depending on the storyline you choose. The theme here is a magic piece of jewelery that causes growth to the user</span></div></div>",
            "created":1090731600,
            "id":209056,
            "title":"Gifts of growth"
        },
        "125":{
            "author_id":"kozan-wolf",
            "author_name":"Kozan",
            "choices":[
                "Koto",
                "Juri",
                "Others/Multiple"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I noticed a few girls missing from the list. so here are a few more choices </span></div></span></div>",
            "created":1397237580,
            "id":1776880,
            "title":"Multiple GTS/Others"
        }
    },
    "info":{
        "author_id":"kamaria",
        "author_name":"Kamaria",
        "brief_description":"YYH Girls grow big, or guys get small. Please make additions!",
        "created":1088192760,
        "description":"<td align=\"left\" class=\"norm\">Girls from Yu Yu Hakusho grow into the sky, or guys shrink down to the ground. Please add chapters. Many stories die because of lack of additions. I'll add a few myself, but don't rely on me. You, the readers, need to contribute too!<br>\r\n<br>\r\nThe rules: Please try to keep sex stuff to a minimum. Also, keep the girls in-character. They're all pretty much good natured, but they might be destructive, however only in certain circumstances, such as if they're angered.<br>\r\n<br>\r\nI will give GPs to the first 3 chapter adders. They have to be good, moderately sized chapters. All of them really should be.<br>\r\n<br>\r\n(Holy heck, I had to retype this whole thing because I had too long of a description.)</td>",
        "id":861501,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1542627060,
        "modified":1542627060,
        "pretty_title":"Yu Yu Hakusho: GTS Style"
    }
}