{
    "chapters":{
        "1":{
            "author_id":"dustindemon",
            "author_name":"Dustin",
            "choices":[
                "Jen Masterson",
                "Caitlin Cooke",
                "Nikki Wong",
                "Starr",
                "More?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which girl do you want to mess with?</span></div></span></div>",
            "created":1295758800,
            "id":1040495,
            "title":"THE BEGINNING"
        },
        "11":{
            "choices":[
                "She mutates into a creature.",
                "She grows bigger and muscular.",
                "She begins to spin around and creates twisters.",
                "She changed into a liquid-version of herself.",
                "Other changes."
            ],
            "content":"<div class=\"\"><div> <span>Jen was in a typical slow as sludge day at work. Normally, the Penalty Box would be crowded with sports-obsessed customers or local wannabes trying to buy some expensive gear to falsify advertise their athletic potential. Not today though. The last customer to make an appearance was 2 hours ago.<br>\r\n<br>\r\n\"Man, could this day move any slower?\" the red-haired sports sales associate complained. Unlike her friends, Jen never got fired from her job at the Penalty Box and to anyone's amazement, she could put up with her drill sergeant like boss's less than friendly orders.<br>\r\n<br>\r\nWe could all use that resilience. Anyway, she was about to walk out to meet up with her friends at the Big Squeeze. Before she could step out the door, she was halted by an all too common, \"Masterson!\" \"Yes, sir?\" she asked.<br>\r\n<br>\r\n\"Working hours aren't over yet.\" he said, \"I need you to go around the back to bring in something important.\" \"Important? Like what?\" she asked. \"Just some new energy drinks our store made a contract to sell. Three boxes are out back.\" he said.<br>\r\n<br>\r\nFollowing her boss's orders, Jen went to deliver the boxes of energy drinks into the store. If it weren't for the trolley cart, she wouldn't have been able to push them inside. It took a good 10 minutes to push each one inside the store, but she got it done.<br>\r\n<br>\r\n\"These are energy drinks? They feel more like anvils.\" she groaned as she parked the last one. Then she looked on the ground. One of the energy drinks was on the ground. \"I know I shouldn't drink one of our products, but I am thirsty.\" she said.<br>\r\n<br>\r\nOpening it up, she drank it down. To her surprise, it was orange-pineapple flavor. As she finished her first gulp, she groaned as she felt herself changing.</span></div></div>",
            "created":1295845200,
            "id":1041189,
            "title":"Slow Day at the Penalty Box."
        },
        "111":{
            "choices":[
                "mole-like creature.",
                "sponge-like beast.",
                "other changes."
            ],
            "content":"<div class=\"\"><div> <span>\"Man, my whole body hurts!\" she cried. She quivered as her whole body experienced a horrific pain. It felt like she was breaking one of her arms or legs countless times over. Her bones snapped and cracked as her torso and back twisted and bent in awkward positions. One painful snap made her torso and back look like a W. She let out a shrill cry of agony as it finished Most people seeing this type of action would figure her spine would morph beyond medical repair. To Jen's surprise, her spine was still standing strong.<br>\r\n<br>\r\nBut she was worried more about the rest of her body. \"What's happening to me?!\" she hollered in fear. Before she knew it, she was transforming into a...</span></div></div>",
            "created":1295845200,
            "id":1041239,
            "title":"Jen Changes into a..."
        },
        "1111":{
            "choices":[
                "she grew hungry.",
                "she grew bigger and fatter.",
                "she began to dig into the floor."
            ],
            "content":"<div class=\"\"><div> <span>As her body began to relax from the painful snapping of her skeleton, Jen thought it was over. She couldn't be anymore wrong. \"That's a strong energy drink.\" she said, \"Thought my spine was gonna snap!\" Suddenly, she felt her nose transforming! It bent backwards as it buried deeper into her face. Soon tiny, tentacle-like limbs began to sprout. \"My nose!\" she cried.<br>\r\n<br>\r\nThen with a violent tear, a long tail burst from the bottom of her jeans. The tentacles grew bigger and longer as soon, her hands grew into massive, pink paws with claws growing sharper by the minute! Then her back hunched up as it tore her jacket off; now giving her a hunchback physique. Before long, her entire body was sprouting black hairs which grew to cover her body.<br>\r\n<br>\r\nHer face stayed mostly the same; but her blue eyes were now black, empty ones. Her hair grew wilder and it grew into a mane like that of a lion's.<br>\r\n<br>\r\n\"What happened to me?\" she asked herself. She was now a human/mole monster that stood twice as tall as before. In fact, she was taller than her boss! As she looked in the mirror, she screamed, \"Oh my God! Is that me? I'm a monster!\"<br>\r\n<br>\r\nAs she barely contained the thought of her being a monster,...</span></div></div>",
            "created":1295845200,
            "id":1041242,
            "title":"Jen the Molester."
        },
        "1112":{
            "choices":[
                "Big Squeeze.",
                "supply of energy drinks.",
                "nearest water fountain."
            ],
            "content":"<div class=\"\"><div> <span>She gasped in horror as her skin began to morph. The smoothness of her skin was being transformed into a more bumpy, ridged texture. \"And I thought acne was bad!\" she cried as she watched her skin becoming more ridged. What occurred next baffled Jen completely. \"My fingers!\" she called out. She watched her fingers, even her palms becoming more square-shaped!<br>\r\n<br>\r\n\"This can't be happening. THIS CAN NOT BE HAPPENING!!\" she screamed. What happened was the most agonizing change of them all! She groaned as her skin was stretching and pulsing! \"It feels like I've eaten mushrooms!\" she said. At least, her allergy to mushrooms only gives her a nasty case of bathroom habits.<br>\r\n<br>\r\nGasping sharply, she froze as she found holes forming in her every own skin! They started it out small. Then they grew bigger! Some reached the size of cups!<br>\r\n<br>\r\nWhen it was over, Jen had become a sponge girl! \"I looks so WEIRD!!\" she cried. Then a powerful thirst began to overpower her. Licking her spongy lips, she said, \"Must..have..something to DRINK!!\" she screamed. Without second-thinking, she ran towards the...</span></div></div>",
            "created":1296450000,
            "id":1045340,
            "title":"Sponge-Jen Scared-Pants."
        },
        "1113":{
            "choices":[
                "A spider/human hybrid.",
                "A giant soccer ball with a face.",
                "Others."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other things could she transform into?</span></div></span></div>",
            "created":1296018000,
            "id":1042548,
            "title":"other changes."
        },
        "11132":{
            "author_id":"dustindemon",
            "author_name":"Dustin",
            "choices":[
                "Find Caitlin. She'd know what to do.",
                "Get something to eat. She was sudenly VERY hungry."
            ],
            "content":"<div class=\"\"><div> <span>Jen dropped to her knees, clutching her gut. \"Hnnnghhhh, what's..... HAPPENING...\" Her stomach slowly started to inflate outward. It started out as a tiny, wobbling belly, slowly expanding out into her lap. At least, for the first few seconds. After that, in the blink of an eye, her stomach grew outward into a giant sphere, until her torso was just a giant ball. Her work uniform burst into shreds off of her body, leaving her as a giant, naked ball.<br>\r\n<br>\r\n\"GHNNAHHH.....\" Jen's eyes rolled into the back of her head. It was unlike anything she had ever felt before! All feeling in her hands and feet disappeared before they broke off entirely, falling to the floor. She gently rocket back and forth on the ground. She could feel every inch of her skin becoming rough. A strange, but familiar pattern started to cover her body. Black and white pentagons popped up all over her body. All Jen could do is slightly flail her head around, her brown hair flying around. \"Hello?! Can someone HELP ME?!\" she called out, but to avail. She felt her neck getting sucked down into her body. \"Help! HEEELP!\" Jen cried, feeling like she was sinking into a huge vat of quicksand. Her neck was swallowed up by her round torso, followed by her mouth, her nose,  her eyes, and finally, her entire head was swallowed up. She was a motionless, 5 foot tall soccer ball.<br>\r\n<br>\r\nAfter a couple minutes, the giant soccer ball started to rumble before two eyes, and a large mouth grew out of the side. \"Ugh, THAT'S better...\" Jen said, slowly spinning around. \"Oooookaaaay, so I'm a soccer ball now? I... GUESS that's kind of cool...\" Underneath her face, a nice, big pair of boobs grew outward.<br>\r\n<br>\r\nJen decided to...</span></div></div>",
            "created":1301720400,
            "id":1080613,
            "title":"Kick the Jen!"
        },
        "111322":{
            "choices":[
                "turned right and began eating people.",
                "banked left and headed towards an eatery."
            ],
            "content":"<div class=\"\"><div> <span>Jen decided to get something to eat as her body growled with food. \"OWWHH...I'M so HUNGRY.\" Jen complained, \"But I can't just leave work.\" Suddenly, she felt like she was turning over on her back! \"Wait! I'M MOVING!!! AAHHHH!!!!\" Jen screamed as she started to roll out of the store.<br>\r\n<br>\r\n\"GET OUT OF THE WAY!!!\" Jen screamed to onlooking customers, \"I CAN'T STOP!!!\" People screamed as the five foot tall soccer ball rolled their way. Some people got out of the way. Others were brutally mowed down and crushed. \"BLECH!!!\" Jen said as she spat out their blood, \"Actually blood DID taste pretty good...\"<br>\r\n<br>\r\nAs she kept rolling, she...</span></div></div>",
            "created":1302930000,
            "id":1089212,
            "title":"Food on the Roll."
        },
        "115":{
            "author_id":"ageregressmlp",
            "author_name":"MLPAgeRegress",
            "choices":[
                "sure",
                "No, something else",
                "Definitely no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about age regression into a baby?</span></div></span></div>",
            "created":1402030800,
            "id":1808162,
            "title":"How about?"
        },
        "1151":{
            "author_id":"ageregressmlp",
            "author_name":"MLPAgeRegress",
            "choices":[
                "It was open",
                "It was closed"
            ],
            "content":"<div class=\"\"><div> <span>Jen didn't feel all that different. She just put the drink back and finished her job. Though, she started to notice near the end of her shift that her body was smaller. Her clothes felt heavier. Luckily her voice was still noticeable, but she needed to find a bathroom and fast. <br>\r\n<br>\r\nThe day was finishing up though, so the mall was fortunately empty. She ran as fast as she could, making herself easily noticeable. Her two close friends, Nikki and Caitlin, noticed her and her size. Caitlin volunteered to find out what was up, though Jen didn't see or notice her friends.<br>\r\n<br>\r\nShe suddenly got to the bathroom mirror, and noticed how young she was; about 12 at this point. She also noticed that her body was regressing. She immediately connected it to the earlier drink, but she didn't know what to do. Her emotions started getting to her, which sped up the regressing processing. She noticed faster regression, which only made her cry worse. By the time Caitlin arrived Jen was about three years old. Caitlin called for her, but didn't hear a response. She slowly opened the door, hearing a crying sound on the other end. She was astonished, \"J-Jen?!\"<br>\r\n<br>\r\nHearing her friend's voice, Jen continued to cry. However, the regressing process soon stopped when she was only 1. Caitlin picked her up, and rocked her back and fourth. \"It-its alright Jen. I'm sure we can, somehow, fix this?\" Caitlin soon realized, she'd need diapers and baby supplies. She rushed over to the nearest mall baby store hoping it was still open. </span></div></div>",
            "created":1402030800,
            "id":1808173,
            "title":"sure"
        },
        "1153":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Yes...",
                "She develops a foot fetish for all feet...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She becomes a shemale, with insatiable lust.</span></div></span></div>",
            "created":1507957200,
            "id":2401172,
            "title":"She grows a cock"
        },
        "11533":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "yeah",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>does one of her friend's head become her butt?</span></div></span></div>",
            "created":1552798800,
            "id":2631401,
            "title":"Other..."
        },
        "12":{
            "author_id":"dustindemon",
            "author_name":"Dustin",
            "choices":[
                "Her breasts and butt started to expand!",
                "She started to mutate into something else...",
                "She got super gassy",
                "Her body parts started falling off!",
                "She became EXTREMELY hungry!"
            ],
            "content":"<div class=\"\"><div> <span>\"Just another boring day at the Big Squeeze....\"<br>\r\n<br>\r\nCaitlin sighed, rolling a lemon left to right, left to right. She hasn't had a single customer all day. \"It should be a crime having to work when it's THIS slow...\" she sighed to herself, tapping her finger tips against the counter. \"All those sales.... all those OUTFITS... and I'm stuck here in this boring lemon!\" She was going to go CRAZY if she had to be here much longer! To make matters worse, all her friends just happened to be busy today. Jen was slammed at the Penalty Box, Nikki was stuck at the Khaki Barn, and the guys were all seeing a movie. \"It'd figure EVERYONE is busy when I need them!\" she frowned. \"Ugh, that is IT! I am NOT going to sit here and let everyone ELSE snatch up MY cute outfits!\" she slammed her fist down on the counter. She folded  her arms, pouting to herself, until her eyes caught something.... glowing?<br>\r\n<br>\r\n\"Ooooh....\" she picked up the glowing carton. \"New mix?\" She identified the labels, looking them over. \"Hmmm, experimental drink mix... Wonder if it's any good!\" the perky blonde said. She dumped the glowing green powder into a blender with some water and ice, blending it up into a nice, thick glowing smoothie. \"Well, here's to boredom!\" she smirked, taking a sip of her drink. \"Mmmmm.... that's not bad!\" She took another sip... and another, and another, until she was chugging down the entire drink! \"Mmmmm! We have to get this flavor more often...<br>\r\n<br>\r\nBUURRRAAARRRRRPPPTTTTT!!!<br>\r\n<br>\r\nOops! Hehehee, excuse ME!\" she giggled, wiping her mouth. Almost immediately, her stomach started to churn and gurgle. \"Nnnnghh... what... what's going ON?!\" She clutched her slightly bloated stomach, unaware of the BIGGER changes happening to her body...<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1295758800,
            "id":1040506,
            "title":"Caitlin Cooke"
        },
        "121":{
            "choices":[
                "She drinks more of the mystery lemonade.",
                "She shows her friends.",
                "She continues growing."
            ],
            "content":"<div class=\"\"><div> <span>\"What was in that stuff? And why do my clothes feel tighter than usual?\" Caitlin wondered.<br>\r\n<br>\r\nShe sat down and saw that her boobs were growing. Then, she noticed that she was rising up and noticed that her butt was growing as well.<br>\r\n<br>\r\nSNAP!<br>\r\n<br>\r\nCaitlin blushed when her bra snapped and her C-Cup breasts bounced a little while being held back by her t-shirt. She also noticed her butt cheeks grew and were the sizes of volleyballs.<br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1322974800,
            "id":1234335,
            "title":"Her breasts and butt started to expand!"
        },
        "1211":{
            "choices":[
                "Jen comes looking ",
                "New employee "
            ],
            "content":"<div class=\"\"><div> <span>Caitlin's body continues to expand as her clothes burst from her body. She begins to sweat and the panic starts to sink in. Her ass was now huge and firm, the size if beach balls. <br>\r\n<br>\r\n\"Oh god what's Happening to me!\" The dumb blonde screamed as her her thighs hips and stomach began to swell up like her ass and tits had done. People walked by normally as they always had. <br>\r\n<br>\r\nCaitlin's neck began to swell, limiting the mobility of her head. With the last few movements of her arms, she frantically grabbed and her expanding body in a feeble attempt to save herself. Her skin felt firm and rough. Her clothes began to stretch and soon her shirt, bra, jeans and panties all gave way almost simultaneously, bursting into shreds.<br>\r\n<br>\r\n\"Heeeeeeeeeeeelp me!!!\" Screamed the naked girl, as she fell from her feet into giant ass/back (as it all seemed to be fusing into one round mass. Yellow tears streaked down Caitlin's face as she wailed and breathed heavy muffled breaths like that of a pugs. \" somebody please!\" She screamed but no one heard. Caitlin's skin began to shift to a yellow colour and her face lost it's natural blush.  Her pussy and breasts began to leak as she cried and wailed. Sour yellow liquid poured from nearly every Hole in her body. She rolled back and forth helplessly as her mind began to feel less complex and more airy. <br>\r\n<br>\r\nIt was then when it finally dawned on the poor girl what exactly was happening to her.<br>\r\n<br>\r\n\"I'm turning into a lemon!\" She shrieked as her fear level reached it's peak.  \"Aaaaaaaaaaaaaaah\" she wailed and wailed as she became rounder and rounder. Her arms and legs slowly fused into her body and she lost then forever. Her body began to shrink as it reached its optimum lemon shape. All the remained of Caitlin the human was a lemon with a head and a vagina. <br>\r\n<br>\r\nSuddenly Caitlin's screams were muted. Her mouth grew shut and became one with the lemon as her hair fell out and head fused inwards. Her pussy came more lemon juice the more she was scared and it was really flowing now. She was alone with her thoughts now. They ceased to be about the big picture now. Caitlin's brain was devolving into lemony pulp. All she thought now were simple phrases. <br>\r\n<br>\r\n<br>\r\n\"What's happening?!\"<br>\r\n\"Somebody help me\"<br>\r\n\"Someone please\"<br>\r\n\"I'll be made into juice!\"<br>\r\n\"They're going to juice me!\"<br>\r\n\"Don't juice me\"<br>\r\n\"I don't want to be a lemon\"<br>\r\n\"I don't want to be a lemon\"<br>\r\n\"Me don't want to be a lemon\"<br>\r\n\"Me don't want to be lemon\"<br>\r\n\"Me don't want be lemon\"<br>\r\n<br>\r\nShe was really terrified now. She squirted one last squirt as the little lemon orgasmed on the store counter top. Dropping wet and covered in juice, her eyes welled up with lemon juice and she began to cry, and slowly her eyes sealed shut.<br>\r\n<br>\r\nAll that remained of Caitlin was a slowly degrading, basic nerve net inside her and her twitching pussy that still leaked profusely.<br>\r\n<br>\r\nSuddenly her thoughts began to change as her mind faded away.<br>\r\n<br>\r\n\"Me want be lemon...\" A last few neurone sparks went through the net.<br>\r\n<br>\r\n\"Me want be lemon.\" Her pussy began to wetten.<br>\r\n\"Me want be lemon!\"  She began coming lemon juice again.<br>\r\n\"Me want be lemon!\"<br>\r\n\"Me be lemon!\"<br>\r\n\"Me be lemon!\"<br>\r\n\"Me be lemon!\"<br>\r\n\"Juice me\"<br>\r\n\"Juice me\"<br>\r\n\"Juice me!\"<br>\r\n\"Juice me!\"<br>\r\n\"Juice me!\"<br>\r\n\"Juice me!\"<br>\r\n\"Juice me!\"<br>\r\n\"Juice me!\"<br>\r\n\"Me lemon!\"<br>\r\n\"Me lemon!\"<br>\r\n\"Juice Lemon!\"<br>\r\n\"Juice...\"<br>\r\n\"Me... \"<br>\r\n\"Lemon\"<br>\r\n<br>\r\nAnd with that Caitlin Cooke was gone. Replaced by a lemon almond hundreds of others. Waiting to be juiced.. Waiting for some mall attendee to notice the lemon juice and the tattered clothes. Waiting to be juiced like just another fruit in the bunch.</span></div></div>",
            "created":1399525200,
            "id":1793341,
            "title":"She drinks more of the mystery lemonade."
        },
        "1213":{
            "choices":[
                "Her personality changes.",
                "Her friends come back.",
                "A customer comes."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Caitlin started moaning as ass stopped growing and her breasts grew until they were FF-cups.<br>\r\n<br>\r\nThe pain then stopped. She then decided to hide in the lemon until her friends came.<br>\r\n<br>\r\nWhat happens next?</span></div></span></div>",
            "created":1325048400,
            "id":1248245,
            "title":"Caitlin Continues to Grow and Transform"
        },
        "12131":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "A bisexual nymphomaniac",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As Caitlin waited something strange began to occur her worries about her strange transformation took a backseat to new thoughts and a new personality.<br>\r\n<br>\r\nSpecifically</span></div></span></div>",
            "created":1367470800,
            "id":1583141,
            "title":"Her personality changes."
        },
        "121311":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Caitlin goes after a guy.",
                "Caitlin goes after a girl."
            ],
            "content":"<div class=\"\"><div> <span>This mental transformation had a remarkably calming effect on Caitlin panic being replaced by lust. She stood up straight and observed herself, and new endowments strain to her clothing a great deal and while it was certainly sexy it was uncomfortable.<br>\r\n\"I have to go shopping, something nice and low cut.\" Caitlin pondered. <br>\r\nAt this point the pangs of lust became more acute.<br>\r\n\"But first things first finding someone to screw.\"</span></div></div>",
            "created":1375506000,
            "id":1639244,
            "title":"A bisexual nymphomaniac"
        },
        "1213112":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Jen Masterson",
                "Nikki Wong/someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who did she go after?</span></div></span></div>",
            "created":1399870800,
            "id":1795499,
            "title":"Caitlin goes after a girl."
        },
        "12131122":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Nikki",
                "Another girl..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, do we want Nikki, or perhaps someone else?</span></div></span></div>",
            "created":1586190960,
            "id":2814308,
            "title":"Nikki Wong/someone else."
        },
        "122":{
            "choices":[
                "producing spikes, ridged skin and prickly back hair.",
                "changing into a yellow, slimy blob.",
                "other changes."
            ],
            "content":"<div class=\"\"><div> <span>Letting loose with another loud...<br>\r\n<br>\r\nBUUURRRPPPPTTT!!<br>\r\n<br>\r\nthe brisk blond watched as a small cloud of yellow gas was expelled from her mouth! It lasted for a record-breaking two minutes! \"Ew! THAT came from ME?!!\" she screamed as she watched her gas cloud float off.<br>\r\n<br>\r\n\"Stupid new lemon mix!\" she exclaimed. Just as she was about to slam her fist into the counter again, her porky belly began to gurgle and rock like pink pudding on a plate. Even worse, the larger, more noticeable changes to her active body were about to reveal themselves.<br>\r\n<br>\r\nLooking at herself, Caitlin gasped as sharply as possible as her body began...</span></div></div>",
            "created":1295758800,
            "id":1040864,
            "title":"The Perky Blonde Mutates into..."
        },
        "1222":{
            "choices":[
                "hungry.",
                "scared out of her mind!",
                "amazed at her new form!"
            ],
            "content":"<div class=\"\"><div> <span>Looking at herself, Caitlin gasped as sharply as possible as her body began turn yellow! \"Oh my God! I'm turning YELLOW!!\" she cried. She could only watch in complete disbelief as the pigments on her skin turned into a bright yellow. Once it finished, she was as yellow as a lemon!<br>\r\n<br>\r\n\"At least now I'll have skin to match my hair color.\" she said as she tried to relax herself. But she shrilly gasped at what happened next. Her skin began to drip onto the floor in the form of raindrops! It started with only a few. Then it sped up to dozens of yellow drops landing on the floor!<br>\r\n<br>\r\n\"I'm MELTING!!\" she screamed. All of the raining caused her body to shrink and liquefy into a puddle of yellow goop. \"SOMEBODY HELP ME!!\" she cried desperately as her face melted away. All that was left of Caitlin was a massive yellow pile of slime that squished along the floor.<br>\r\n<br>\r\nSuddenly, it began to grow and morph! Like a basement flooded with rainwater, the Big Squeeze stand was up to its counter in yellow goo. Yet it was still growing! Reaching up and up, it stood twice the Big Squeeze stand's height as it morphed into a more familiar shape.<br>\r\n<br>\r\nThe top of the giant blob was the face of a woman emerging. It began with the eyes. Soon the nose and finally, her mouth. Caitlin's face managed to completely reform. \"Oh my God! I'm a...a...A BLOB!!\" she spoke in a gurgling voice. Her voice was still forming back to its original sound from the morphing.<br>\r\n<br>\r\nAs she gazed around the store, Caitlin was...</span></div></div>",
            "created":1295931600,
            "id":1042133,
            "title":"Caitlin the Lemon Blob."
        },
        "12221":{
            "author_id":"dustindemon",
            "author_name":"Dustin",
            "choices":[
                "find something else to eat.",
                "Find one of her friends."
            ],
            "content":"<div class=\"\"><div> <span>Caitlin's bubbling yellow form made sickening, gurgling noises, thick yellow bubbles rising up from her body. She felt an intense hunger fill her entire gelatinous form. \"Mmm, I haven't eaten anything all day.... Oh, what am I DOING!? I shouldn't be thinking about food when I'm... I'm a- a SHAPELESS BLOB!\" she sobbed big, gloopy tears that were absorbed back into her body. \"HOW can I buy clothes when I can't even WEAR them?!\" <br>\r\n<br>\r\nAgain, her entire boy groaned out with a loud 'GRRRRRRGGLLORRG!' She had to get SOMETHING to eat. but how could she move without any legs? Luckily for her, it was pretty easy. Her gloopy, dripping body slowly crawled along the ground, leaving a thick, smelly trail of yellow slime. The poor blonde (well.. would be blonde, if she had any hair left) sniffed. \"I'm a hideous FREAK!\" she sobbed, \"I won't ever be able to face my friends AGAIN!\" She hadn't even noticed that she had crawled right over a large table, now floating inside her jelly-like body. She gasped. \"OH MY GOD!\" she screamed as she felt the table slowly bob up and down. \"GET IT O-ooohhh mmmmmmmm!\" She smiled, \"That tastes pretty GOOD~\" The blob let out a loud, bubbling belch. \"Oops... hee hee! Excuse me!\" She giggled. She felt different. Like her worries had been washed away. Maybe a nice meal was all she needed. <br>\r\n<br>\r\nIn a matter of minutes, the table had been completely broken down into particles. \"That wasn't half bad!\" Caitlin giggled cutely. Her shapeless body rumbled.... \"H-hey! What's going o-OOAHH!\" she shrieked as her body bloated out into a bigger size. \"What the... I'm BIGGER?! Oh no, I'm so BIG and FAT and- HEY!\" An excited grin crossed her face.<br>\r\n<br>\r\nCaitlin decided to...</span></div></div>",
            "created":1295931600,
            "id":1042298,
            "title":"Time for a snack!"
        },
        "122211":{
            "choices":[
                "she bursts out of the store!",
                "she hungered for other things."
            ],
            "content":"<div class=\"\"><div> <span>Caitlin decided to find something else to eat. \"Maybe being bigger won't be so bad after all. And if the table tasted good...\" she purred. In a flash, the former blond gained an idea. Moving her amorphous body like a slug, she began to ooze towards her favorite clothes store. Leaving a slimy, yellow trail of her own goop behind, she said embarrassingly, \"Boy, the janitor's going to have a field day cleaning up my goop.\"<br>\r\n<br>\r\nThe janitor wasn't the only one would who be shocked by her trail. Everyone that came into her gelatinous path had faces of complete disbelief and shock as she slurped by. \"Excuse me...pardon me...Lemon blob coming through.\" she said, \"Oh, I hope that wasn't someone who knew into my body.\" Luckily, it wasn't.<br>\r\n<br>\r\nMaking it to the clothes store, Caitlin was disappointed by the door's size. \"Dang...I forgot how small this door was.\" she said. Looking at herself, she said, \"Duh. I'm made of slime.\" She wasn't an expert in chemistry. However, she did remember seeing the Blob (1988) when she was little. Even though it scared the hell out of her, she was amazed how the Blob could squeeze into the tightest of spaces.<br>\r\n<br>\r\n\"Okay. Movie magic, don't let me down now.\" she said as she prepared to enter the store. Squeezing her head through the door, she grunted and groaned as she moved as best as she could. \"Uuuugghhh! Come on, body...Don't fail me...\" she said. Customers inside were screaming as the blob entered the store. \"No, no. It's okay. Just continue shopping.\" she told the customers.<br>\r\n<br>\r\nThen with a loud squishy...<br>\r\n<br>\r\nPOOOOOPPPPPP!!<br>\r\n<br>\r\nShe managed to bleed her shapeless body into the store. As soon as she entered, several customers ran out of the store screaming.<br>\r\n<br>\r\n\"OHH! Look at all these PRETTY CLOTHES!\" she squealed in delight, \"THIS is SSSOOOOO worth getting out of work for!!\" \"Sorry.\" said one of the Clones, \"I don't believe we have anything in your size.\" \"Oh, I won't be wearing them.\" Caitlin gurgled, \"I'LL BE EATING THEM!!\" The clone just gasped.<br>\r\n<br>\r\nThat's pretty much all she could do. Caitlin soon helped herself to all of the newest, most stylish trends. Slipping and sliding all over the store, the giant lemon mass began devouring all of the clothes she could absorb. \"Mmmmmm! These clothes taste SO YUMMY!!\" she replied, \"This is SO MUCH BETTER than wearing THEM!\"<br>\r\n<br>\r\nGrowing bigger and bigger as she continued eating, Caitlin soon began to fill up the store. The only time she stopped eating was when...</span></div></div>",
            "created":1296018000,
            "id":1042629,
            "title":"Caitlin's New Use for Dresses."
        },
        "1222112":{
            "author_id":"sonic411",
            "author_name":"SonicV",
            "choices":[
                "Hungry for people, Caitlin slithers after them",
                "Caitlin devours the entire Khaki Barn, and Nikki meets up with the others"
            ],
            "content":"<div class=\"\"><div> <span>A thought hit Caitlin when she finally took notice of the straggling customers that had shaken out of being frozen stiff and ran screaming like the rest. While the rest customers ran off though, she noticed that the clones remained. Kirsten and Chrissy were holding each other as they stood shaking behind the counter, jaws on the floor as they stared at the inhuman monster that had eaten a good chunk of their inventory, while Kristen was too scared to move, even though she was right next to Caitlin. It got the ditzy blond blob thinking, and then focusing, while the Clones watched in awe as she managed to form arms out of her transparent body. Granted, they were only yellow stubs, but that was all Caitlin needed to snatch Kristen, who screamed as she saw that thing coming at her.<br>\r\n<br>\r\n“ENOUGH WITH THE SCREA…ming?” an angry Nikki suddenly felt her rage replaced by fear and awe. She had been hiding in her changing room as usual, believing today to be the worst day of her life since on top of the usual Clone squeals, they seemed to have gotten everyone in the store shrieking. Her ears had actually been ringing so badly, that she hadn’t heard Caitlin exclaiming about how yummy the clothes were. Now however, she got to see her friend in all her blobby glory.<br>\r\n<br>\r\n“CAITLIN???!!!!!” the monster formerly known as that heard the familiar voice, and turned her head and smiled at the person who had recognized her. “Oh hi Nikki,” she waved her free hand stub at her friend, who just went even more slack jawed that the blob really did turn out to be Caitlin. Said blob then added “can you hang on for a sec? I’m still eating.”<br>\r\n<br>\r\n“Huh?” that statement finally shook Nikki out of her stupor, but that unfortunately meant that she now saw just how different Caitlin really was. Looking again, she gasped as she saw a bunch of the Crappy Barn’s outfits floating inside of her friend. Rubbing her eyes, she then looked up to see a struggling clone in the blob’s grasp “Kristen?”<br>\r\n<br>\r\nHeld by the thick, yellow gunk enveloped around her shoulders and chest, she screamed as she felt the stuff quickly flowing up her neck and over her head! Her screams became gargled as everyone who was human gasped, while Caitlin licked her lips. A thick and sickening slurp was heard as she pulled the rest of the helpless clone threw her arm stub and into her body.<br>\r\n<br>\r\nEveryone watched as Kristen panicked as she was drowning in lemon blob. Everything around her was liquid, but thick as well, and she was wasting a lot of air by screaming. “NO!!!” Kirsten wanted to save her, but Chrissy held her back stating “Kirsten, she’ll eat you to!” Nikki meanwhile felt like she was ready to break down from all this crazy she had to take in all at once, but nothing topped what they all saw next.<br>\r\n<br>\r\nThey watched as all of the clothes inside Caitlin began sizzling as every thread dissolved before their very eyes. Kristen’s clothes were no exception as the suffocating blob was soon rendered naked. She was fading fast, but what sprung her back to life was a stinging sensation on her butt. Feeling back there, she screamed anew as she felt her skin dissolving!<br>\r\n<br>\r\nCaitlin pulled the girl into the center of her massive body and so deep inside her, her form was only visible as a dark silhouette. That was a blessing to those on the outside as they saw the terrified shape of the Clone dissolve into nothing. Her arms became handless stubs before those began to disappear and one of her legs was soon entirely gone before the side of her stomach began losing huge chunks. She screamed the whole time, even when all they could see was the dark outline of her head, until with one final bubbly cry for help, she was gone. Kirsten burst into tears while Chrissy held her and tried holding back her own. Caitlin meanwhile oozed out some of her body in the form of a fat gut, rubbing it with her arm stubs “BUUUUUUUUUURRRRRRRRRRRRRRRRRRRRP!!! Ahh, that was great.”<br>\r\n<br>\r\nCaitlin, the most look and weight obsessed yet still decent person that she knew, was now a giant blob that was happy to eat everything in sight, including people; Nikki couldn’t make this up even if she tried. Once Caitlin bawled over a pudgy belly she got from eating too much chocolate, but now her whole body was this massive blob, and she didn’t even excuse herself for burping this time. Nikki was still trying to wrap her head around all this, when all of a sudden, the blob’s body started rumbling and Caitlin looked down to see her slightly human features vanishing into her true shapeless form except her head and then watched herself growing wider and bigger once again. That was a good enough reason for Nikki to get out of there.<br>\r\n<br>\r\n“RUN!!!” she shouted, heading for the door while she still could. Chrissy and Kirsten took her advice and jumped over the counter, now screaming their heads off with their arms in the air as they followed her. The still growing Caitlin looked back, saw them leaving, and said “Hey wait a minute, don’t go. I’m still hungry!”<br>\r\n</span></div></div>",
            "created":1301547600,
            "id":1079408,
            "title":"One clone, down the hatch"
        },
        "12221121":{
            "author_id":"krustyfan",
            "author_name":"Sojaxx",
            "choices":[
                "Hide inside the Big Squeeze",
                "Run into the Bathroom",
                "Just keep running "
            ],
            "content":"<div class=\"\"><div> <span>Caitlin had never realized or even considered how tasty people were. The clone she ate was remarkably delicious and her clothes were like condiments to a hot dog. Not mention so much more filling. She wanted to see if it was just a fluke or not but everyone was fleeing the store in droves. While they were smaller than her they were also much faster. <br>\r\n<br>\r\n\"Stop! Come back! I just want a lick,\" she plead, unaware of how bad that sounded. She scooped up three people and tossed them into her gelatinous maw savoring their decadent taste. Much like Kristin they cried out in panic as their clothes and bodies dissolved like antacids. That part didn't matter to Caitlin, she was just pleased with the flavors and the growth she gained from that. With a sinister grin, she gave chase after the shoppers grabbing as many as she could with no sympathy for them or Nikki. <br>\r\n<br>\r\nSpeaking of, her friend was terrified and baffled by her normally sweet, well-intentioned friend. How did she go from boy crazy to man eating? Why was she a naked blob? Nikki didn't dwell on the matter for too long focusing instead of outrunning her. Or at least the people slower than her. She felt bad but there was nothing she could do but run. Try as she might, Caitlin's belches were getting louder and she was nearing her purple headed friend. <br>\r\n<br>\r\nUp ahead was the food court. The perfect distraction and opportunity to hide from the ravenous blob, if she chose wisely. The only business not packed with food was Caitlin's booth. Nikki weighed her options while Caitlin's sloppy bubbling grew louder. </span></div></div>",
            "created":1556849280,
            "id":2654126,
            "title":"Hungry for people, Caitlin slithers after them"
        },
        "122211211":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Caitlin gives up and looks somewhere else",
                "Caitlin finds Nikki",
                "Nikki accidentally touches the strange lemonade from earlier..."
            ],
            "content":"<div class=\"\"><div> <span>Nikki was getting tired, so she had no choice but to try and hide. She chose the Big Squeeze, as it's operator was currently 'out to lunch' and just jumped in, doing her best to be as quiet as possible so Caitlin wouldn't notice her.<br>\r\n<br>\r\nMeanwhile, Caitlin was momentarily distracted eating three teenage girls, and thus lost sight of Nikki. \"Hmm, where'd she go?\" Caitlin said, looking around. \"I thought I just saw her...\"<br>\r\n<br>\r\nCaitlin looked all around the food court for her friend, while eating any food from the restaurants she happened to pass by. Though what she considered 'food' was very loosely defined, as she ate cooked food, raw dough, plates, counters, and of course all the poor saps who were serving that food. As she did this, Caitlin grew larger and larger, her body now the size of an RV!<br>\r\n<br>\r\nEventually she passed by her old work place, the Big Squeeze. Nikki was sweating bullets at this point, it was either stay stone silent or get eaten by one of your best friends. She heard loud sliding and bubbling up above the counter as Caitlin looked around...</span></div></div>",
            "created":1556850660,
            "id":2654152,
            "title":"Hide inside the Big Squeeze"
        },
        "1222112113":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Nikki became a blob just like Caitlin!",
                "Nikki now had superpowers!",
                "Something else entirely..."
            ],
            "content":"<div class=\"\"><div> <span>Nikki stayed absolutely silent while hiding inside the Big Squeeze. She could hear Caitlin sloppily devouring everything around her, so she knew it was only a matter of time before Caitlin found her and ate her.<br>\r\n<br>\r\nAs she slightly adjusted herself, Nikki felt her finger touch a small amount of liquid next to an empty pitcher...<br>\r\n<br>\r\nCaitlin had just finished cleaning out the food court, giving her huge bubbling belly a rub.<br>\r\n<br>\r\nBRAAAAAAAAAAAAPPP!!!<br>\r\n<br>\r\n“Mmm, that was so good...” Caitlin said. “I can’t believe I’ve never done this before. I love eating so much, and being so big...”<br>\r\n<br>\r\nCaitlin began to moan sensually as she continued to rub her jiggly body, feeling so horny right now. She wished she had her vagina right now, she wanted to masturbate so badly...<br>\r\n<br>\r\nJust then, Caitlin heard some strange noises coming from one direction. This snapped her out of her lusty haze, making her curious as to what that sound was. She heard it coming from her old work place, the Big Squeeze, and decided to investigate. When she got there, something quite surprising happened...</span></div></div>",
            "created":1589953680,
            "id":2838340,
            "title":"Nikki accidentally touches the strange lemonade..."
        },
        "12221122":{
            "choices":[
                "people running and shrieking!",
                "a loud slurping noises!"
            ],
            "content":"<div class=\"\"><div> <span>The terrified swarm of Khaki Barn patrons including Kirsten and Chrissy sprinted for their lives out of their favorite shopping store. Their screams of terror caused other onlookers to wonder what was the problem. Nikki managed to break off from the crowd and headed for the nearest empty corner. She was breathing heavily at everything she had witnessed. \"What happened to Caitlin?\" she asked herself. She still couldn't wrap her head around how that shapeless creature that was her friend. Not to mention she devoured one of the clones and didn't mind growing even larger. That wasn't the Caitlin she knew. \"Gotta find the guys and Jen.\" she said, \"They won't believe this.\" So she ran off to find her friends. <br>\r\n<br>\r\n\"All right.\" Ron the Rent-a-Cop said as he stormed, \"What's all of the....GOOD GOD!!!\" When Ron gets frightened, that's never a good sign. Soon everyone who stood outside the Khaki Barn gasped in sheer disbelief as something big, yellow and gelatinous began to push against the windows. Tiny cracks started forming as the massive blob inside was increasing in girth. Gallons of it began to spill out of the open doors, making bubbly squishing and slurping noises as it slid across the floor.<br>\r\n<br>\r\n\"What in Good God's name is this stuff?\" Ron said as he peered closer at it. \"Don't touch it!\" Kirsten screamed. \"Yeah! That monster ate Kristen!\" Chrissy whined as she began to sob again. \"Monster, huh?\" Ron said, \"I'll be the judge on that.\" Ron touched the slime. Suddenly, he yelled as the substance burned the flesh off his hand! \"Still calls for bigger measures.\" he said.<br>\r\n<br>\r\nInside, Caitlin was busy adjusting to her growth. She actually loved feeling herself expanding. \"MMMMM!!! This feels SOOOO GREAT!!!\" she said, \"I want to get BIGGER!!\" The blond blob looked around. But all of the customers including her friend Nikki were out of the store. \"Too bad all of those little treats left while I was growing.\" she pouted. Suddenly, an idea sparkled inside her amorphous head. \"Kirsten was pretty tasty and I DID grow pretty large after eating her.\" she said, \"But if I ate THE ENTIRE STORE?! I COULD BECOME SO HUGE!!\" She squealed happily. Other thoughts popped in her head as she thought about how much bigger she could get. She could devour the mall, her town; even all of Canada if she wanted to!<br>\r\n<br>\r\n\"Oh! I better get started!\" she giggled in hunger. Using her entire body as a mouth, she began to feast on everything the store had left. The shelves; the counters; the dressing rooms. Everything the Khaki Barn had that was bolted down or not was sucked inside Caitlin's jelly-like body. \"SO TASTY!!\" she said as she enjoyed feeling the wood and metal objects dissolve into her body. Their nutrients caused her yellow, shapeless figure to expand larger and wider.<br>\r\n<br>\r\nOutside, people gasped as the slime continued to flow out into the unsuspecting shopping center. The Barn's helpless window finally cracked open as gallons of lemon ooze poured out! The glass had been swallowed up by Caitlin's body in a matter of seconds. \"Mmm! Glass tastes wonderful!\" she said. As her growth spiked even more, the walls outside of the Khaki Barn were soon mowed down! People ran and screamed as the yellow slime blob continued feeding on the materials her destruction brought her. In only minutes, Caitlin had replaced the Khaki Barn! All of that eating has caused her to become 50 feet tall and 70 feet wide!<br>\r\n<br>\r\n\"That was SO MUCH FUN!\" she said, \"But now I'm hungry. Luckily, the mall has more snacks!\" People screamed as Caitlin used her arms like whips to round them up! More and more meat was added to her body! Her growth was still continuing!<br>\r\n<br>\r\nNikki managed to get to Caitlin job where she saw a crowd of hungry customers shouting, \"We want drinks!\" \"Nikki!\" Jonesy said, \"Where's Caitlin?\" \"Yeah. She should be serving drinks.\" Jen said. \"Guys. Caitlin...She's...\" She was about to tell the others what she experienced when suddenly they heard...</span></div></div>",
            "created":1308114000,
            "id":1126966,
            "title":"The Khaki Barn Becomes the Main Course."
        },
        "122211222":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "She doesn't care and gobbles them up right there!",
                "She decides to let them go."
            ],
            "content":"<div class=\"\"><div> <span>\"Guys. Caitlin...She's...\" She was about to tell the others what she experienced when suddenly they heard loud, slurping noises. It was hard to hear over the sounds of people screaming, but it seemed to get louder as the screaming seemed to be dying down. Most of them were confused by this, but Nikki immediately knew the horrors of what was going on. Caitlin was eating people, and getting bigger and bigger.<br>\r\n<br>\r\n\"What the heck is that?\" Jen said.<br>\r\n<br>\r\n\"It's Caitlin!\" Nikki said. \"She's become some kind of mutant blob-thing and now she's eating everything!\"<br>\r\n<br>\r\n\"What? What kind of story is that!?\" Jonsey said. \"You really expect us to-\"<br>\r\n<br>\r\nJust then the people's screaming had been completely silenced, replaced by the loud, slurping noises. They looked on and saw a gigantic blob of yellow ooze coming towards them! Soon it came to a stop, and then they heard a sound that they would not have expected to come from this thing in a million years.<br>\r\n<br>\r\n\"Hey guys, what's up?\" Caitlin said to her friends below.<br>\r\n<br>\r\n\"CAITLIN!?\" They all yelled in surprise.<br>\r\n<br>\r\n\"Dude, you're like a giant thing of Jell-O!\" Jude said.<br>\r\n<br>\r\n\"Thanks, I've been eating well.\" Caitlin said. \"Speaking of...\"<br>\r\n<br>\r\nCaitlin surrounded her friends with two of her arm stubs, ready to make meals of them.<br>\r\n<br>\r\n\"Wait! You don't want to do this!\" Nikki said, trying to appeal to Caitlin's human side, whatever was left of it.<br>\r\n<br>\r\n\"I'm pretty sure I do.\" Caitlin said, her body gurgling with hunger.<br>\r\n<br>\r\n\"Caitlin, we're your friends!\" Wyatt said, getting the idea of what Nikki was doing. \"Whatever's going on with you, we can help you get through it!\"<br>\r\n<br>\r\n\"Yeah, and we can't help you if we're digested!\" Jonsey said.<br>\r\n<br>\r\n\"Please, let us go!\" Jen said.<br>\r\n<br>\r\nCaitlin just stood there for a while and thought to herself. Everyone grew increasingly nervous as the lemon-blob stood still, doing nothing.<br>\r\n<br>\r\n\"Dude, the suspense is killing me...\" Jude said.<br>\r\n<br>\r\n\"Better that than her!\" Jen said.<br>\r\n<br>\r\nCaitlin continued to think to herself...</span></div></div>",
            "created":1325826000,
            "id":1253276,
            "title":"Caitlin's next meal?"
        },
        "1222112221":{
            "choices":[
                "She stays and sees what else she can do.",
                "She leaves the mall to find more meals."
            ],
            "content":"<div class=\"\"><div> <span>\"Who cares, I'm starving.\" Caitlin swallowed her friends whole. They screamed as they were digested in her slime. Their clothes were destroyed in seconds and soon they dissolved with them. Noramlly, Caitlin would be remorseful, but now she just considered their deaths another delicious meal that made her bigger and sexier. Their screams were silenced by the gurgling of her gut and a loud belch she released after digesting them. Caitlin was no longer concerned with becoming human anymore, all she wanted to do was get bigger. <br>\r\n<br>\r\n\"Hmmm, that had to be my best meal yet.\" said Caitlin. \"Time to move on.\"<br>\r\n<br>\r\nCaitlin moved on to the food court and began to envelop all the frightened victims. None of them had a chance because Caitlin was growing so big she was halfway to reaching the ceiling of the mall. She devoured every single person, piece of food, furniture, and equipment in the food court. They were all so delicious and fattening. With each meal she consumed, Caitlin grew bigger. She was becoming rounder and thicker as she felt gas build up inside her. She opened her mouth to release the built-up gas, but instead it came out her ther end. <br>\r\n<br>\r\nPFFFFFFFFFRRRRRRRRRRRRRTTTTTT!<br>\r\n<br>\r\nCaitlin blushed when she farted for the first time in her new form. She giggled a little as she felt the lower part of her body jiggle. \"Hee hee, that tickled. I didn't even think I had a butt. Do I?\"<br>\r\n<br>\r\nCaitlin assumed that only her head was the only thing that remained from her human body. She turned around and noticed that since her feeding frenzy, her body managed to form an ass behind her. Only unlike her human butt, this one was huge even for her. Caitlin rubbed her new butt and purred a little as she stroked it. She gave it a small smack and watched it jiggle like jello and giggled like a child playing with a new toy. \"Hey, I wonder if I can make some other parts of my old body?\" Caitlin wondered. While she did enjoy her new form, she missed some of the features she had that made her a woman. She closed her eyes and concentrated on the body part she wanted and when she opened her eyes she got more than she expected.<br>\r\n<br>\r\n\"Oh my god! They're perfect!\" Caitlin exclaimed. Caitlin grinned at what she had done. She managed to successfully form two supple breasts before her that her size would be the equivalent of a human girl's DD-cup. She brushed her fingers against them and let out a lustful moan. Her breasts were much more fun than her new butt, although she did enjoy the feeling of farting. <br>\r\n<br>\r\n\"Oh wow, I can't believe I'm actually doing this. I wonder what else I can do?\"<br>\r\n<br>\r\nGrrrgrgrglrglrglrl!<br>\r\n<br>\r\nHer gut growled again and reminded Caitlin of eating. \"Oh darn my endless hunger! What am I going to do? I can't stay in this mall too long or else they'll do what they did in the movie and send the army after me. Plus this place is running low on food. Yet I still want to see what kind of powers I have.\" Caitlin wasn't sure what to do and thought of what to do. Her hunger was growing and her urge to touch her body parts grew too.</span></div></div>",
            "created":1353214800,
            "id":1470551,
            "title":"She doesn't care and gobbles them up right ..."
        },
        "12221122211":{
            "author_id":"kamenmaster",
            "author_name":"kamenmaster",
            "choices":[
                "undergo mitosis and split into three blobs two of which were Nikki and Jen",
                "Grow two more heads one being Nikki the other being Jen"
            ],
            "content":"<div class=\"\"><div> <span>Despite her impressive hunger, Caitlin was super eager to figure out what other amazingly unusual things her new body was able to do. So pushing her need to absorb matter to the back of her mind she starts to concentrate on her bodies other abilities.<br>\r\n<br>\r\nHours pass and Caitlin manages to figure out a number of unusual things about her new physicality. She was a lot like a jiggly blob of clay, and was able to change her shape in a variety of interesting ways. In the past hour she's curled herself into a ball and rolled around for a few moments, flattened herself into a giant puddle, and even managed to mold herself into balloon animal like shapes, including a hippo, and elephant, and a giraffe. Giggling like a school girl all the way.<br>\r\n<br>\r\nBut when it was all said and done she was all alone, so she gave off a lonely sigh.<br>\r\n<br>\r\n\"Huh, here I am able to do all these fantastic things and I've got nobody to share with, maybe I was a bit hasty to eat my friends, I wish that at least Nikki and Jen were still here, then we could have all kinds of fun.\"<br>\r\n<br>\r\nThen to her surprise her body starts to bubble and gurgle more violently then ever before, at first she thought that maybe her hunger was getting really uncontrollable, but at the same time something about this felt different.<br>\r\n<br>\r\nSurely enough she was about to</span></div></div>",
            "created":1357275600,
            "id":1502082,
            "title":"She stays and sees what else she can do."
        },
        "122211222111":{
            "choices":[
                "Follow Caitlin and Nikki ",
                "Follow Jen"
            ],
            "content":"<div class=\"\"><div> <span>Caitlin groaned as she felt her body split itself. She felt herself get smaller as three equally sized blobs seperated from her. She felt a massive load lifted from her body. Caitlin was both relieved and disappointed. Suddenly, the blobs began to transform. One of them turned violet and the turned red. Each blob began to form a pair of bulbous breasts and jiggly butts the same size as Caitlin's with large arms. Finally, heads began to form one each blob; the violet one's head resembling Nikki's and the red one's looking like Jen's. Caitlin couldn't believe what had occured or how she did it, but the transformation was amazing. The blobs' eyes opened and they blinked as if they were waking up.<br>\r\n<br>\r\n\"Ugh, what happened?\" Jen moaned. <br>\r\n<br>\r\n\"I swear if Jonesy is pulling a prank...\" Nikki stiopped when she gasped and noticed her body. Jen followed short but she released an ear shattering scream. <br>\r\n<br>\r\n\"AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH! What happened to us?!\" Jen shrieked.<br>\r\n<br>\r\n\"Oh my gosh.\" Caitlin gasped. \"You're alive.\"<br>\r\n<br>\r\nAt this point Jen and Nikki realized Caitlin was there and remembered that she had eaten them like popcorn. Jen was glaring angrily at Caitlin while Nikki was still examining her body. <br>\r\n<br>\r\n\"Caitlin! How could you eat us?\" Jen scolded.<br>\r\n<br>\r\n\"I couldn't help it. You guys looked so yummy. I didn't know what I was thinking.\" Caitlin said.<br>\r\n<br>\r\n\"Are you kidding? What kind of explaination is that?\" <br>\r\n<br>\r\n\"I don't know, I'm feeling kind of hungry myself.\" Nikki added.<br>\r\n<br>\r\nJen looked at Nikki in disbelief as the purple blob admired her new ass. \"Wait, are you enjoying this?\"<br>\r\n<br>\r\n\"Honestly, yeah.\" Nikki admitted. \"I mean check out how huge my boobs are.\"<br>\r\n<br>\r\n\"But we're fat blobs! Not to mention Caitlin ate us!\"<br>\r\n<br>\r\n\"Actually it wasn't that bad after being digested. This feels pretty good.\" <br>\r\n<br>\r\n\"Oh I'm so glad you're not mad at me Nikki. I was so worried.\" Caitlin said.<br>\r\n<br>\r\n\"It's cool. Are you feeling hungry?\"<br>\r\n<br>\r\n\"Yeah, but don't worry. The menu is endless.\"<br>\r\n<br>\r\n\"Great. Lead the way, Blobzilla.\" Nikki said as she slapped Caitlin's ass and watched it jiggle. Caitlin giggled as she let out a fart. Jen just glared angrily at them and went to try and find someone who could help her get back to normal. </span></div></div>",
            "created":1357448400,
            "id":1503380,
            "title":"undergo mitosis and split into three blobs two ..."
        },
        "1222112221111":{
            "author_id":"kamenmaster",
            "author_name":"kamenmaster",
            "choices":[
                "Follow Caitlin and Nikki as they explore their powers",
                "See if Jen is any closer to finding a 'cure'"
            ],
            "content":"<div class=\"\"><div> <span>As the yellow and violet blobs slither away from Jen, Caitlin goes into the story of how they ended up where they are now.<br>\r\n<br>\r\n\"So you drank some weird lemon drink mix and the next thing you knew you were this?\"<br>\r\n<br>\r\nNikki asked while gestureing to Caitlin's blob body.<br>\r\n<br>\r\n\"Yeah, I'm not entirely sure how it worked and I was pretty freaked out at first, but now that I've had some time to adjust it's actually pretty cool.\"<br>\r\n<br>\r\nThen Caitlin's 'stomach' rumbles.<br>\r\n<br>\r\n\"Oh, give me a second.\"<br>\r\n<br>\r\nCaitlin then reaches out and rips a nearby parking meter out of the cement, which she then gobbles up like a churro.<br>\r\n<br>\r\n\"Oh, wow that's so cool, so, we can eat anything?\"<br>\r\n<br>\r\n\"Gulp. Yep anything and everything, or atleast everything I've eaten so far.\"<br>\r\n<br>\r\n\"Okay let me try.\"<br>\r\n<br>\r\nNikki looks around until she finds a very appitizing looking hubcap that was abandoned some time ago. She picks it up with her jelatin hands, and stuffs it in her face, her mouth streatching wide enough to swallow it whole.<br>\r\n<br>\r\n\"Wow, Nikki you're a natural! It took me way longer to figure out I coult stretch my mouth like that.\"<br>\r\n<br>\r\n\"Thanks, but if your right I'm just tapping the tip of the ice burg of my blob powers, do you think you could show me?\"<br>\r\n<br>\r\n\"Nikki, you should know you don't have to ask me for anything.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1360558800,
            "id":1530354,
            "title":"Th yellow master and the violet apprintace"
        },
        "12221122211111":{
            "choices":[
                "Managed to alter her body",
                "Ended up making a copy of herself instead."
            ],
            "content":"<div class=\"\"><div> <span>Word quickly spread about the unstoppable blobs running amuck and the people ran in terror. Caitlin and Nikki were still devouring basically everything in sight  but didn't bother going after the people trying to escape. They were contempt with eating trees, chunks of buildings, and abandoned cars. Though that didn't mean that they wouldn't grab a civilian or a car with people still in it. Nikki was learning quickly how to use her powers and was coming a natural, and Caitlin noticed. She was spending more time staring at her purple friend than eating. Nikki swallowed a school bus in one gulp, nearly deep throating it, when she noticed that Caitlin had stopped eating. \"What's the matter Caitlin? Did you finally get full?\"<br>\r\n<br>\r\nCaitlin broke out of her trance and blushed out of embarrassment. \"Oh no, not even close. It's just that I never really noticed how good you look now that you've filled out.\" Caitlin admitted in regards to Nikki's large gelatinous gut, bubble butt, and sedan sized breasts. Not to mention her hips were wider than the streets. If it wasn't for the fact that were made of goo, Nikki would have been stuck. <br>\r\n<br>\r\n\"You think so? I mean its nice but it could use some improvements. Too bad I can't-\" Nikki stopped and realized something. \"Hey wait, if we're made of goo, can we change our bodies in any way we want?\" Caitlin thought about it for a moment and shrugged. \"I don't know. I guess I've been too busy eating to see what else I can do.\"<br>\r\n<br>\r\n\"Well let me see if I can do anything.\" Nikki closed her eyes and focused on tried to morph her body into the image she had in her mind. Nikki's body started to wobble and Caitlin gasped as her friend....</span></div></div>",
            "created":1414126800,
            "id":1876911,
            "title":"Follow Caitlin and Nikki as they explore their ..."
        },
        "122211222111111":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Nikki was growing something long and phallic below...",
                "Something else entirely..."
            ],
            "content":"<div class=\"\"><div> <span>Nikki had her eyes closed, while her entire gellatinous body was wiggling and jiggling. Caitlin watched her friend with a mixture of arousal and curiosity, wondering just what her purple friend had in mind for her body.<br>\r\n<br>\r\n\"Come on...\" Nikki said, biting her lower lip. \"Almost...\"<br>\r\n<br>\r\nSuddenly...</span></div></div>",
            "created":1416805200,
            "id":1893338,
            "title":"Managed to alter her body"
        },
        "1222112221111111":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Nikki eats things with her new cock!",
                "Nikki plunges her cock between Caitlin’s buttcheeks!",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>Nikki’s body continued to wiggle and jiggle as she made herself change once again. Suddenly, part of the goop below her vast stomach began to stretch out, soon growing into something long and thick that made Caitlin’s eyes go wide.<br>\r\n<br>\r\nAfter much growing, Nikki had finally given herself an absolutely humongous penis! Despite Nikki’s huge belly, the cock still stuck out very far in the front of her. Nikki looked down and smiled, happy about the change she gave herself.<br>\r\n<br>\r\n“Oh yes, this is awesome!” Nikki said, wiggling her hips and causing her cock to wave around like a flagpole.<br>\r\n<br>\r\n“Wow, Nikki.” Caitlin said. “It looks beautiful.”<br>\r\n<br>\r\n“I’ve always wanted a nice, huge cock of my own.” Nikki said. “My body is perfect now...”<br>\r\n<br>\r\n“Come on, we know it can always be better.” Caitlin said. “We’ll just keep eating so our big, sexy bodies can keep getting bigger and sexier.”<br>\r\n<br>\r\n“Like you really need to say that.” Nikki said. “Let’s have some fun...”</span></div></div>",
            "created":1589954640,
            "id":2838345,
            "title":"Nikki was growing something long and phallic..."
        },
        "1222112221111112":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Her breasts and butt grow larger",
                "more tentacle-arms grow out of her body",
                "something else weird..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What will Nikki do?</span></div></span></div>",
            "created":1556773200,
            "id":2654099,
            "title":"Something else entirely..."
        },
        "12221122212":{
            "author_id":"krustyfan",
            "author_name":"Sojaxx",
            "choices":[
                "The Beach",
                "Downtown",
                "The Forest"
            ],
            "content":"<div class=\"\"><div> <span>Caitlin easily smashed her way through the mall walls and got outside. The parking lot was in complete disarray. Every shopper was making a break for their cars but in their hurry they were jamming the roads and crashing into one another. Unfazed by the chaos she was creating, Caitlin was drooling staring at the smorgasbord of people and vehicles. \"Come to mama!\"<br>\r\n<br>\r\nShe slithered through the rubble absorbing the chunks of wall and bushes she slid through and adding to them her bulk. Her new breasts wobbled like a pair of weather balloons made of flan and her cheeks bounced slapping together as she moved. Bending over and raising her ass in the air, she opened her maw and gobbled down a row of cars with and without people struggling to get away in time. Her bloated behind spewed lemony gusts of gas that drowned put the screams of her victims and the honking of the cars.<br>\r\n<br>\r\nThe former part timer licked her lips and raised her head for a moment dragging her new breasts along the ground. More meals got trapped in her new endowments and dissolved just like everyone else. Only this time she noticed that only her boobs grew that time, as opposed to entire her form. \"Ooooooh, I didn't know they could do that! I wonder....\" she mused, tapping her chin as an idea brewed in her brain and another gas blast brewed in her stomach.<br>\r\n<br>\r\nAiming her ass at the swarms of civilians who gave up and chose to run on foot, she grunted and unleashed a FFFFFFLLRLRRRRRRRRPRPRPRPRPRPRPRPRPTTTT! A hazy fog of flatulence filled the lot and burned the eyes and noses of everyone caught in it. Which allowed Caitlin to back up her dump truck of an ass, although each cheeks was far greater than a dump truck, and slammed her keister down on a group snagging over a dozen in each mound. In less than a minute they added to her rump and expanded much to her delight.<br>\r\n<br>\r\nBefore she could savor her discovery, she noticed the lanes clearing and people were clearing out faster than she expected. Rather than chase the ones already on their way to the freeway, the blob settled for finishing up the remaining trucks and cars farthest away. Mixing up between oozing over them, swallowing them, and shoving them into her breasts or up her ass, Caitlin continued to balloon to even larger sizes. Slowly she became taller than the mall itself and almost wide enough to fill up a lot. A thick fog of gas surrounded the mall with her nauseating aroma. Anyone left alive was knocked out by the stench but Caitlin barely noticed the smell.<br>\r\n<br>\r\n\"Yuuuuuuuuuuum, best meal yet. Still, a growing girl like me needs something bigger than this.\" By now everything around her was like a mint. She needed larger morsels to quench her appetite and a new venue to dine at. Leaving behind the remains of the mall, Caitlin made her way towards....</span></div></div>",
            "created":1556950320,
            "id":2654680,
            "title":"Parking Lot Platter"
        },
        "122211222122":{
            "author_id":"mariomaster88",
            "author_name":"marioman",
            "choices":[
                "Caitlin devours the entire city!",
                "The army is called on Caitlin!"
            ],
            "content":"<div class=\"\"><div> <span>Caitlin oozed along the road, swallowing up it and anything unfortunate enough to get in her way, be it cars, trucks, or people. Caitlin didn't care, they were all too delicious to ignore. Soon she came across downtown, and looked upon all the tall buildings filled with yummy looking tiny morsels.<br>\r\n<br>\r\n\"Hmm, the city sure looks tasty today.\" Caitlin said, licking her lips.<br>\r\n<br>\r\nCaitlin then proceeded to devour everything in sight once again. Entire crowds of people were swallowed like popcorn, cars like a candy coating for them. Many of them tried to run, but there was no escaping Caitlin's hunger, as she would simply reach out a tentacle and swallow them through it, their nutrients adding to her colossal body mass. Caitlin was just too big to escape.<br>\r\n<br>\r\nSoon, Caitlin noticed a bunch of people hiding in a nearby office building, them figuring that she couldn't get inside. \"Oh, those snacks are trying to hide. Hmm, I'd better get creative...\"<br>\r\n<br>\r\nFrom another building, the people hiding inside looked on in horror. Caitlin had oozed herself around the building's base, which slowly began to shrink. As Caitlin ate more of the building, she grew and grew, her sides squishing into other nearby structures. Soon the building was gone, and in it's place a gigantic yellow blob who stood over 150 feet tall and 300 feet wide!<br>\r\n<br>\r\nEven the buildings were no match for Caitlin's hunger.</span></div></div>",
            "created":1559022000,
            "id":2665168,
            "title":"Downtown Dining"
        },
        "122212":{
            "author_id":"dustindemon",
            "author_name":"Dustin",
            "choices":[
                "Jen",
                "Nikki"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmmm... I wonder if Nikki or Jen have any tips for me... If anyone can help me, they can!\" <br>\r\n<br>\r\nShe slowly slid across the ground, her stinky yellow trail bubbling behind her. Her yellow blob body sucked up  everything in her path: empty soda cans, books, half eaten cheeseburgers, she could've sworn she even absorbed a shoe! Everything that got sucked into her body quickly disintegrated inside of her. URRARRP! BRUUURPPT! AAAUURRRP!! she belched out giant, sloshy bubbles. \"Sorry, excuse me... sorry, sorry, I can't really control it...\" she smiled nervously to the onlooking public, all staring in horror at the monster that used to be Caitlin. \"I hope I didn't suck up that little boy back there...\"<br>\r\n<br>\r\nAfter about 15 minutes of gurgling and crawling, she finally found...</span></div></div>",
            "created":1295931600,
            "id":1042304,
            "title":"Find one of her friends."
        },
        "1222122":{
            "author_id":"krustyfan",
            "author_name":"Sojaxx",
            "choices":[
                "Country music (She gets bimbofied, and craves beer)",
                "Pop and Hip Hop (She grows a massive booty)",
                "Heavy metal (She gets aggressive and destructive)"
            ],
            "content":"<div class=\"\"><div> <span>She spotted her heading inside Spin This listening to some music. Caitlin slithered over absorbing anything that didn't move out of her way in time. \"Hey Nikki! Check me Uuuurrrraaapp! Ooh I should really do something about my gas.\" Ignoring the more crucial problem she was dealing with, apparently Nikki didn't hear her since she had headphones on. While it would have been easy to smash the window and grab her, Caitlin didn't want to startle her friend. So she went through the front of the music store like a normal person would.<br>\r\n<br>\r\nShe had to duck to avoid hitting her head on the sign, which for her meant retracting her face into her goopy body like a turtle. Caitlin didn't see where she was going and absorbed a customer without realizing it. Sensing she pulled something tasty into her body, she instinctively dissolved what was in her including her victim. At that point everyone fled for their lives to avoid a similar fate at the lemony slinker.<br>\r\n<br>\r\nOnce she reformed her face, Caitlin continued towards the headphone rack ignoring the screams of everyone below. The CD's they dropped were soon ingested and digested each with a unique taste to them. Classical music was like refined wine and caviar, J-pop tasted super sugary,  and jazz was like root beer. Curious and getting hungry tasting the tunes, she grabbed handfuls of discs from the different aisles and sampled the different music until she found one that was her definitive favorite. <br>\r\n<br>\r\nBy the time Nikki finally took off he headphones, she finally saw the towering monster gobbling down tables and dozens of CD's gradually growing even larger. More importantly, she was also changing too. Her body and personality were starting to match the genre of music she was indulging in. Which happened to be.... </span></div></div>",
            "created":1556847780,
            "id":2654103,
            "title":"Musical Tastes"
        },
        "1223":{
            "author_id":"kamenmaster",
            "author_name":"kamenmaster",
            "choices":[
                "anntenae",
                "eye stalks",
                "Horns"
            ],
            "content":"<div class=\"\"><div> <span>The pain in Caitlin's stomach seemed to move to her head she massaged her temples trying to stave the massive amount of pain in her skull but with each passing second the pressure seems to mount, more and more.<br>\r\n<br>\r\n\"Oh, that'll teach me to eat anything non-organic.\"<br>\r\n<br>\r\nThe pain just continues each moment seeming like an eternity until finally there are two quick pops and the pain goes away. Caitlin sighs in relief.<br>\r\n<br>\r\n\"Ahh, much better.\"<br>\r\n<br>\r\nThen she makes the mistake of trying to run her hand through her hair, and is stopped part way by two protrusions. In a panic she grabbs a small compact mirror to get a better look, and to her shock Caitlin had grown a pair of...</span></div></div>",
            "created":1359349200,
            "id":1518953,
            "title":"other changes."
        },
        "12231":{
            "author_id":"kamenmaster",
            "author_name":"kamenmaster",
            "choices":[
                "a termite queen that immediately starts laying eggs",
                "a very hungry catipillar girl"
            ],
            "content":"<div class=\"\"><div> <span>Caitlin just staires and staires at the antennae on her head, to stunned to even freak out. She carefully reaches up and toutches one of the antennae and sure enough it gives little twitch, it was real. Caitlin takes a deep breath to prepair to scream her lungs out but that planned scream turns into a pained groan as the agony in her stomach returns with a vengance.<br>\r\n<br>\r\nCaitlin doubles over and falls to floor, in to much pain to make a sound, other than tiny whimpers.<br>\r\n<br>\r\n\"Nikki, Jen help!\"<br>\r\n<br>\r\nThere is an intense burning sensation under her skin as her body changes from the the inside out.Organs rearange her skelliton is disolved and the materials are reperpoused into an exoskelition.<br>\r\n<br>\r\nThe pain is so intense Caitlin blacks in and out, then after what seemed like an eternity the pain fades away. Caitlin slowly but surely regains her presense of mind, just enough to start picking herself up. Once back on her feet she took a deep breath and started to look herself over and to her horror she'd become</span></div></div>",
            "created":1359435600,
            "id":1519732,
            "title":"anntenae"
        },
        "12232":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Two?",
                "More..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How many eye stalks?</span></div></span></div>",
            "created":1434862800,
            "id":1996892,
            "title":"eye stalks"
        },
        "12233":{
            "choices":[
                "She turned into a succubus. ",
                "She transformed into an anthro bull"
            ],
            "content":"<div class=\"\"><div> <span>Caitlin covered her mouth to keep herself from screaming. On her forehead were two protruding horns. She tried covering them with her hands but they poked her and barely covered them. Caitlin had no how this could have possibly happen, but decided to duck behind the counter and closed the top of the Big Squeeze before anyone else saw her. <br>\r\n<br>\r\n\"How did this happen? What kind of freaky lemonade is this?\" Caitlin wondered. \"I gotta do something before- hrgh!\" Caitlin grunted as she felt another burst of pain run through her body. Her skin began to change, a tail sprouted from her backside, her feet turned into hooves, and she began to grow taller. Once the pain had passed, Caitlin realized that she was no longer human. <br>\r\n<br>\r\n\"Great, how am I going to leave here without being spotted?\" Caitlin worried. </span></div></div>",
            "created":1359349200,
            "id":1519059,
            "title":"Horns"
        },
        "122332":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Yes...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>With her changes she has gained extra equipment down below  with extreme list added on, and soon she'll stop caring.</span></div></span></div>",
            "created":1507957200,
            "id":2401173,
            "title":"She transformed into an anthro bull"
        },
        "123":{
            "choices":[
                "Burp",
                "Fart",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Caitlin clutched her stomach as it rumbled.<br>\r\n<br>\r\n\"Oh, something tells me that was some bad lemonade.\" groaned Caitlin. Suddenly, she let loose a huge, stinky....</span></div></span></div>",
            "created":1322974800,
            "id":1234331,
            "title":"She got super gassy"
        },
        "1231":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Embarrassed she looks for some price private to try and lead out her gas.",
                "Strangely she enjoyed her Burp and wanted to keep belching.",
                "She turned around to see someone she knew had seen her belch."
            ],
            "content":"<div class=\"\"><div> <span>BBBBBBBBBBBBBBBBBBBBBBBBBBBBBUUUUUUUUUUUUUUUUUUUUUUUURRRRRRRRRRRRRRRRRRRRRRRRRRR PPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPP!!!!<br>\r\nCaitlin let off the loudest belch she had ever heard anyone make made worse by the sent of rotten lemons tainting her breath. Clutching at her stomach she felt she still felt she had a lot of gas left.</span></div></div>",
            "created":1399438800,
            "id":1792922,
            "title":"Burp"
        },
        "124":{
            "choices":[
                "form new bodies; now there were 6 Caitlins!",
                "sprouted tentacles!",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>\"I feel so...so numb.\" the active teenage shopaholic replied as she touched her fore-head. She could feel her body beginning to lose feeling. Then in a flash....<br>\r\n<br>\r\nher head fell off! \"AAAHHH!!!\" she screamed as her head fell to the floor. Fortunately, she was okay. If by okay, she's now a dissembled head, rolling on the floor in desperation!<br>\r\n<br>\r\n\"Ok. This is not GOOD!\" she shrilly screamed as she rolled along the ground. Then she gaped with her eyes and mouth wide open as the rest of her body fell apart! Like a aging statue made of clay, Caitlin's body collapsed to the ground in pieces. Her arms, legs, etc lied motionless on the ground.<br>\r\n<br>\r\n\"Great. Now I know how one of my old dolls must have felt. Could this get any worse?\" she absent-minded spoke out-loud. Like a bad nightmare going from strange to stranger, Caitlin watched as her head along with the rest of her body began to...</span></div></div>",
            "created":1295758800,
            "id":1040874,
            "title":"Her Body Parts are Falling Off!"
        },
        "1243":{
            "choices":[
                "Turn into lemons ",
                "Grow nipples ",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To the young girls horror, her body parts began to...</span></div></span></div>",
            "created":1399438800,
            "id":1793080,
            "title":"something else."
        },
        "12433":{
            "author_id":"firstlastname",
            "author_name":"firstlastname",
            "choices":[
                "Re-attached themselves the wrong way",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Caitlin begun to freak out as her body parts...</span></div></span></div>",
            "created":1484370000,
            "id":2263497,
            "title":"Other"
        },
        "13":{
            "choices":[
                "began to mutate into a monster.",
                "felt her skin becoming metallic.",
                "unleashed giant burps and farts.",
                "her breasts and butt grew bigger.",
                "other changes."
            ],
            "content":"<div class=\"\"><div> <span>For the past weeks, Nikki and Jonesy have been at uneasy odds in their relationship. None of their friends knew the exact reason why their relationship is grinding against the rocks lately.<br>\r\n<br>\r\nHanging out in the movie theater by herself, Nikki was watching the latest slasher flick, \"Summer Camp Massacre 2: The Harvest Season.\" \"Finally, some blood and guts to get my mind off of Jonesy.\" she said. Digging into her bag of popcorn, she said, \"Let's hope this new butter Jude gave me tastes better than the theater popcorn.\"<br>\r\n<br>\r\nPouring it onto her popcorn, Nikki soon dined on her popcorn. Then she felt a sudden change. Her body growled as massive gurgling noises grew louder.<br>\r\n<br>\r\n\"Ugh! What's happening to me?!\" she screamed at the same time a girl on the screen said it.<br>\r\n<br>\r\nSoon, she...</span></div></div>",
            "created":1295931600,
            "id":1042103,
            "title":"Relationship in the Rocks."
        },
        "131":{
            "choices":[
                "a Chinese dragon girl.",
                "a demonic entity.",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>Soon, she gasped as her body was beginning to mutate into something unnatural. Like her own inner beast was finally revealing itself to her in a physical form. What type of creature the rebel girl was changing into will be shown soon enough.<br>\r\n<br>\r\nAs she groaned with the ever-growing changes becoming more powerful, she clutched her sore stomach. It was beginning to swell larger. \"What's happening to me?!\" she asked.<br>\r\n<br>\r\nBefore she knew it, she was becoming...</span></div></div>",
            "created":1295931600,
            "id":1042141,
            "title":"began to mutate into a monster."
        },
        "1312":{
            "author_id":"dustindemon",
            "author_name":"Dustin",
            "choices":[
                "One of her friends!",
                "Some food!",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>Nikki fell to her knees, clutching her gut. She had no idea what was happening to her body. It couldn't have been that popcorn, could it? <br>\r\n<br>\r\nHer skin started itching... BURNING, really. Nikki clenched her eyes tight, unaware that her skin was changing into a dull, faded purple. \"What's going... ONNNN?!\" her voice roared out in a slightly lower tone. Her teeth  extended out, each one about two inches long and sharp as knives. Nikki groaned and writhed as the changes in her body continued. Her purple skin grew rough and hard, similar to a lizard. Her fingernails grew out into white, sharp claws, capable of ripping through anything she desired. Two small, black horns grew out of her forehead, stopping when they reached about 4 inches. Her muscles throbbed, expanding out until she was about three times as big as she had been.<br>\r\n<br>\r\n\"Hey, keep it down, I'm tryin' to watch here!\" someone behind her yelled, kicking the back of her seat. Nikki's eyes shot open. They were a deep, blood red with narrow black slits.  She threw her head upwards, open her mouth and with a mighty roar, shot out a powerful beam of energy out of her mouth.... rendering her victim into a pile of ash and two smoking shoes.<br>\r\n<br>\r\nThe theater was empty within seconds.<br>\r\n<br>\r\nNikki looked down at her.... remarkably different body. Her face and hair were still normal (for the most part), but other than that, she hardly looked like herself! She clutched her breasts in each hand. \"Mmmmmnnnghh..... THAT'S the stuff...\" she growled as her breasts grew bigger... and bigger.... until her white  top ripped right in half! Just above Nikki's butt, a small nub grew out of  her spine. It grew out longer and longer until it formed a 4 foot long, pointed tail. It whipped around, slashing the chairs below her. Wait.. .below her? She was hovering up in the air, flapping her purple/red wings. Her transformation was complete. Nikki was an evil, powerful demon woman, with mayhem and destruction on her mind.<br>\r\n<br>\r\n\"Now THIS is more LIKE it...\" she said with her hands glowing a  bright red. \"Guess I'll go show off my new improved bod to everyone...\" With a monstrous cackle, she went flying out the door to find...</span></div></div>",
            "created":1296018000,
            "id":1042433,
            "title":"a demonic entity."
        },
        "13122":{
            "choices":[
                "the mall's ferris wheel.",
                "the mall's roof."
            ],
            "content":"<div class=\"\"><div> <span>As she soared through the door, she bashed through it without even slowing down. In fact, she felt nothing from the impact! Being her first time being airborne, the experience was proving to be the most memorable moment in her life yet. Throughout her life, she always dreamed of having people and the very ground underneath her. She cackled monstrously to celebrate her new joy. Her monstrous purple/red wings stretched at least 12 feet from tip to tip; the sun above shined through their fleshy membranes.<br>\r\n<br>\r\nPeople throughout the mall; customers, mall staff, etc stared up towards the air with emotions of terror and hysteria. Casting her new satanic silhouette upon everyone on the ground, Nikki's flight soon provoked everyone into a panic. People ran and screamed as she came closer. Bearing her fangs, she grimaced in pleasure at their fear for her. \"That's right. You should be scared.\" she said coldly.<br>\r\n<br>\r\nDescending lower to the ground, her wings began to produce hurricane-like winds; blowing everything and everyone in their path away. Trash cans, benches, even people were blown around like pieces of garbage in a storm. Grinning at her destruction, she said, \"Now this is the stuff.\"<br>\r\n<br>\r\nSuddenly, her rock-like abs growled as low and sinisterly as her deepened voice. \"All this destruction is making me hungry.\" she said, \"Time to find something to snack on.\"<br>\r\n<br>\r\nSearching for a meal, she banked to her left towards the food courts. The clones were having a small lunch when suddenly, Nikki's shadow covered them. Then she landed on their table! Crushing with her bare feet, the demonic teenager said, \"What a rush.\"<br>\r\n<br>\r\n\"Hey. That was our table!\" one of the clones whined. Fixing her snake-like eyes on the whiner, Nikki bared her teeth slowly. Then she unleashed the mightiest roar she made all day! The clone fainted from the sheer volume of her roar. Turning towards the other two, they said, \"Here! Take our lunch!\"<br>\r\n<br>\r\nSwatting their food aside, she said, \"I want something with more (licks her lips) meat.\" \"Are you calling us FAT!!\" one of them screamed. Grabbing her with her hand, Nikki snarled, \"I'll call you stupid if you'd better prefer it.\" Nikki couldn't fully grasp the feeling of her new strength. She could break the bitchy blond's neck with one quick twist if she desired. But what fun would that be?<br>\r\n<br>\r\nWith her distracted, the one clone managed to run away. Holding her firmly in her one hand, she focused back towards the clone who was knocked out cold by her roar. Using her tail like an octopus tentacle, she wrapped around the clone and lifted her off the ground. \"Now for...\" she said. Looking around, she roared in rage as the third clone was nowhere to be found.<br>\r\n<br>\r\n\"Fine. I love to play hide and seek.\" she grinned. Taking to the air, she began to hunt down the escaped clone. The clone ran for her life. Panting as she ran, she stopped to take a breather. Suddenly, she screamed as something sharp and scaly grabbed her shoulders. \"Thought you could give me the slip?\" Nikki asked. Like a hawk snatching a rat, she used the eagle-like talons on her feet to ensnare the third clone.<br>\r\n<br>\r\nFlying for the best eating spot, Nikki chose...</span></div></div>",
            "created":1296018000,
            "id":1042518,
            "title":"Nikki's Monstrous Hunger."
        },
        "1313":{
            "choices":[
                "A sludge blob.",
                "A T. Rex.",
                "other changes."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or how about these?</span></div></span></div>",
            "created":1296018000,
            "id":1042549,
            "title":"something else."
        },
        "13132":{
            "choices":[
                "food (people).",
                "destruction!"
            ],
            "content":"<div class=\"\"><div> <span>Nikki pushed back against her seat, grinding her teeth while clutching her head. The pain was so intense; it was no possible way to ignore it. What was causing her so much discomfort all of a sudden? Could it have been the sauce Jude gave her?<br>\r\n<br>\r\nForcing her eyes shut, Nikki shuttered as the pain worsened; unaware that she was growing! Reaching 10 feet tall in only two minutes, people yelled at her for blocking the screen. \"Hey, Jumbo! Quit blocking the screen!\" yelled a man. Clutching her fists while grinding her teeth, she failed to notice them getting sharper and more cone-shaped. \"Don't...yell...at...MMEEEEE!!!\" she roared. Her monstrous bellow was so loud, she not only sent the people in the back row flying! She caused the wall to crumble and the movie projector to stop!<br>\r\n<br>\r\nPeople ran and screamed as Nikki continued growing larger. Her clothes tore to bits as her size-changing continued. Her size wasn't the only thing changing. Her scale began to morph into an almost alligator-like hide as it became darker in tone. She even began to sport stripes on her back.<br>\r\n<br>\r\nThen the most painful changes occurred. She felt her face stretching forward as her teeth grew larger. A large, reptilian tail sprouted from her underside. Once her fingers and thumbs merged into two, they grew longer as her nails turned into sharp, white claws. Her toes became bird-like.<br>\r\n<br>\r\nWhen it was finished, Nikki was now a T. Rex! She roared to announce the world of her new status as one of the most powerful creatures ever to walk the Earth! \"I feel so POWERFUL!!!\" she roared. Soon, the teenage predator was hungry for...</span></div></div>",
            "created":1296018000,
            "id":1042556,
            "title":"Nikkisaurus Rex."
        },
        "131321":{
            "content":"<div class=\"\"><div> <span>people, and she started to devour all the people in sight. She kept eating and eating till she could not eat any more. After she had finished eating she went to find a nice cave to live in, but she didn't want just any cave, she wanted a cave that she have room to move around in. So eventually she found the cave that she wanted and moved in to it. After she had moved into the cave she began to change back into a sixteen year old girl. over the night she was changing back to her human form. So when she woke up in the morning she realized that she was a normal girl again. Then Nikki said \"what happened yesterday I was a T-Rex now I'm back to being a human\", but what she didn't know was once you turn into the T-Rex you will turn into one every night. Nikki soon found this out after she found some girls clothes on the side of the side and went to the library in her hometown. She looked up the curse of the T-Rex and what she found was crazy the results were telling her that every night she would transform into a T-Rex. So the following night she transformed into a...</span></div></div>",
            "created":1358917200,
            "id":1515144,
            "title":"The hunger "
        },
        "131322":{
            "author_id":"krustyfan",
            "author_name":"Sojaxx",
            "choices":[
                "The Food Court",
                "The Khaki Barn"
            ],
            "content":"<div class=\"\"><div> <span>Overcome by a sudden anger, Nikki flies into a blind rage. As theater goers run for their lives, Nikki crushes the seats beneath her enormous feet and uses her tail to tear the screen. The projector aims right at her eyes, disorienting and angering her further. She blindly charges at thw booth and bashes her way through the wall. She chomps down on the projector, mashing it with her new dagger-like teeth, and swallowing the hunk of junk in one gulp. <br>\r\n<br>\r\nStill blinded, she swings her tail around and tries to exit the theater. She ends up smashing her way into the adjacent theater, scaring the crap out of everyone there. Their screams delight her and she randomly starts biting at the floor hoping to snag some victims. Nikki misses but she does swallow some seats with bubblegum still stuck underneath and abandoned bags of popcorn. <br>\r\n<br>\r\n\"Yeah! Run for your pathetic life, cowards!\" She shouts, as her vision returns. Once Nikki can see clearly, she bashes through another set of walls until she makes it to the lobby. By now the entire theater is being evacuated, dozens if not hundreds running for their lives. Nikki marches through the hall, smacking her tail into the walls leaving cracks and huge holes. She had no idea this kind of power could feel so good.<br>\r\n<br>\r\nShe charges toward the concession stand and takes advantage of all the free food. Unfortunately, her arms aren't long enough to reach the candy and drinks. Growling softly, she lets out a deafening roar and rips the popcorn machine out with her teeth and chews it up. She then bites through the display case and eats entire boxes of candy and ice cream bars without bothering to unwrap them. She belches crudely a few times during her feast, unfazed by what she eats.<br>\r\n<br>\r\nEventually she grows bored and desires something new to destroy and satiate her hunger for destruction, and food. She storms out of the movie theater and heads straight to....</span></div></div>",
            "created":1553230800,
            "id":2633504,
            "title":"destruction!"
        },
        "13133":{
            "choices":[
                "YES!!",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a scorpion girl?</span></div></span></div>",
            "created":1305262800,
            "id":1105276,
            "title":"other changes."
        },
        "131331":{
            "choices":[
                "hungry for food.",
                "dying to wreck havoc."
            ],
            "content":"<div class=\"\"><div> <span>Nikki's eyes opened widely as she groaned loudly from her changes. \"Urgh! Why do I hurt so badly?!\" she asked herself in agony. Suddenly, the pupils in her eyes vanished as the white substance turned almond-colored black! Soon a smaller pair of black eyes sprouted from underneath her eyes!<br>\r\n<br>\r\nThe pain grew so intense, that Nikki soon collapsed to the ground on her stomach! Her skin soon began to transformation into a thick coat of exoskeleton armor that matched her hair color! The muscles in her arms began to increase in size. Soon they were twice their normal size. Suddenly, her hands began to fuse and morph into massive claws!<br>\r\n<br>\r\nSnapping loudly, they sounded like a garbage truck filling up its compactor. \"Hey! We're trying to watch the movie!\" yelled a customer. Enraged by the comment, Nikki slowly got up. The customer along with others gasped in horror as Nikki bent closer. Her black, pupil-less eyes stared at her victims with not one slight sense of emotion. As she smiled, they shuttered as her neck began to grow longer. Her neck muscles surged and stretched until her neck was three times its normal size!<br>\r\n<br>\r\nStaring her foes, she opened her mouth. Not only did her teeth grow a bit sharper but where her tongue used to be were two pincers! Her victims began to move slowly as drool came from her maw. But before they could run, they heard a frightening, bursting sound! From out of her pants was a massive tail that grew to match her height; equipped with a deadly stinger!<br>\r\n<br>\r\nWith a vicious snarl, Nikki attacked! Striking the man dead-on in his chest, the man gasped as gallons of deadly venom surged into his body! He soon coughed up blood as Nikki brought him closer to her face. With an evil smirk, Nikki tossed him aside! She threw him so hard, he smashed into the movie screen!<br>\r\n<br>\r\nAs Nikki marveled her new body, she groaned as her legs began to split in half! Soon, she had four legs that ripped out of her pants! Using her claws to rip her shirt off, she purred as her breasts became double D size and she had an eight pack.<br>\r\n<br>\r\n\"Now this is a body.\" Nikki said, \"Time to show it off.\" Marching through the room, her legs tore through the chairs like toothpicks! Punching the door down, she soon found herself in a helpless mall. Soon the scorpion girl was...</span></div></div>",
            "created":1305262800,
            "id":1105282,
            "title":"Nikki the Scorpion Girl."
        },
        "132":{
            "choices":[
                "becomes a cyborg.",
                "becomes a blob of metal slime.",
                "becomes a death machine!"
            ],
            "content":"<div class=\"\"><div> <span>Soon, she gasped as her skin turned into a dark shade of gray. Even worse, it was getting heavier! She collapsed onto the floor due to her skin's new weight! \"UGH!\" she said. \"I feel like I was gained 200 pounds!\" she said. She struggled to get back onto her feet. Miraculously, she soon gained enough strength to stood upright. \"I feel so heavy.\" she said as she wobbled along the floor.<br>\r\n<br>\r\nThen all of her hair started falling out! \"My hair!\" she said. Not that she was ever a hair fanatic, but this wasn't right. Exiting the theater, she found herself near into an appliance store called Allan's A-List Appliances.<br>\r\n<br>\r\n\"Mmm. Metal. Wait, did I just say that?\" she said. She uncontrollably wandered into the store. Developing a bizarre form of Pica, she began to dine on the appliances! \"Must have metal!\" she hollered as she tore apart box after box. Computers, toasters, DVD players, I-Pods, microwaves, a paper shredder or two. Every type of appliance she ate down without even second-thinking. Customers and bystanders watched as Nikki continued her bizarre feast.<br>\r\n<br>\r\nSoon after consuming so much metal, she...</span></div></div>",
            "created":1296018000,
            "id":1042570,
            "title":"A True Metal-Head."
        },
        "1321":{
            "choices":[
                "was hungry again.",
                "met the Clones.",
                "saw one of her friends."
            ],
            "content":"<div class=\"\"><div> <span>Soon after consuming so much metal, she felt her body changing again. Her normal brown eyes changed into lifeless, black pupils that scanned the store. Her fingers and toes changed into knives, wires and gears. Her shoulders sported microwaves and laptops on top of them. She could even felt a paper shredder taking room into her stomach!<br>\r\n<br>\r\nWhen it was over, Nikki became a cyborg built from different appliances. \"Cool. Perfect Metal look.\" she said.<br>\r\n<br>\r\n\"Hey you! Give back my appliances, you freak!\" screamed the manager. \"I don't think so.\" she said. Grabbing him, he yelled, \"Hey, what are you...\" He suddenly gasped as she opened up her stomach which had a massive paper shredder inside her! \"No wait!\" he pleaded.<br>\r\n<br>\r\nBut it was no use. Nikki shoved him inside her stomach. He screamed as he body was shredded to pieces. Blood flew everywhere as the screams died down. Shoving the rest of his body inside her, Nikki grunted as she grind his corpse up like a milkshake. Then she farted out the blood, destroyed bones and shredded organs.<br>\r\n<br>\r\n\"Consider yourself shredded.\" she said. Going out of the store, she...</span></div></div>",
            "created":1296018000,
            "id":1042576,
            "title":"Cybernetic Nikki."
        },
        "133":{
            "author_id":"watcher200",
            "author_name":"watcher200",
            "choices":[
                "The gas went away",
                "The running caused the gas to grow",
                "Nikki went behind a building and let the fart go"
            ],
            "content":"<div class=\"\"><div> <span>She feels a gas bubble going towards her mouth. She unleashes a massive BURRRRRRAP!. Nikki covered her mouth,i guess jude's butter doesn't agree with me. Suddenly nikki felt a huge fart coming in. Quickly she grabbed all her stuff and ran out the mall. On her way home...</span></div></div>",
            "created":1308286800,
            "id":1128161,
            "title":"unleashed giant burps and farts."
        },
        "1331":{
            "choices":[
                "Get slob habits and crave Jude's butter. ",
                "Transform into an animal. ",
                "Nothing"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She managed to hold it in the entire night. As she slept, she the gad inside her shrank and affected her body. She started to...</span></div></span></div>",
            "created":1313557200,
            "id":1169881,
            "title":"The gas went away"
        },
        "13311":{
            "choices":[
                "She gets gassy and hungry",
                "She turns into a motorcycle. "
            ],
            "content":"<div class=\"\"><div> <span>The next morning, Nicki was relieved that she didn't gave to fart really bad. She went downstairs to get some cereal, but when she started eating it, it was good. It didn't taste different, but she was expecting something more. She tried to think what happened. The only thing she did was have Jude's butter. <br>\r\n<br>\r\nShe froze and realized that she needed more of it. She wasn't a hundred percent sure, so she slurped the rest of her cereal, let out a huge belch Bllluuuuuuuup! <br>\r\n<br>\r\nAt the mall, Nicki saw Jude at the fountain. She confronted him and asked \"Jude, I need more of that butter.\" she let a fart loose and Jude smiled. \"Ooooh, you like it huh? Yeah I know. Isn't it great? Here ya go.\" He handed More of it and she quickly grabbed it. \"My advice: Try it with coffee.\"<br>\r\n<br>\r\nNicki took Jude's advice and put his butter in her coffee. She drank a huge swig...<br>\r\n<br>\r\nBbbbbbbbbbuuuuuuuuuuuuuuuuuuuuuuuuurrrrrrrrrrrrrrrppppppppp!!!!!!!!!!!!!!!!&lt; br /&gt;\r\n<br>\r\nNicki's face reddened as she tan to the Cacki Barn. She had to admit, her coffee was better. Later that day....</span></div></div>",
            "created":1313557200,
            "id":1169883,
            "title":"Get slob habits and crave Jude's butter. "
        },
        "1332":{
            "author_id":"watcher200",
            "author_name":"watcher200",
            "choices":[
                "Nikki's gas became worse",
                "Gas would build up at the wrong times",
                "Nikki's gas became harder to hold in"
            ],
            "content":"<div class=\"\"><div> <span>Unfortunatly the running caused the gas to grow, nikki's stomach was bloated with gas. Ohhhhh, nikki groaned, this gas is killing me damn it jude nikki said. Nikki couldn't take the gas anymore while walking nikki noticed an abandoned building across the street. That be the perfect place to let this gas go. She walked across the street and went inside the building. Finally nikki said as she slightly bent over and grunted. PRRRRRRRBBBBBBBBBBBBT! the fart echoed through the hollow building, ahhhhhhhh nikki sighed in relief finally that came out i didn't know how long i could've held that in for she said as she walked out the building. Unfortunatly the next few days. </span></div></div>",
            "created":1308286800,
            "id":1128174,
            "title":"The running caused the gas to grow"
        },
        "13322":{
            "author_id":"watcher200",
            "author_name":"watcher200",
            "choices":[
                "Night Gas ",
                "Morning Gas"
            ],
            "content":"<div class=\"\"><div> <span>The next day nikki was working at the crappy barn(not really working) when a fart started to brew in her stomach. Oh damn nikki said as she clutched her stomach this one gonna be big. Luckily one of the changing rooms were empty, nikki slowly walked towards it still clutching her stomach. She closed the door behind her, how i'm i gonna hide this fart. Luckily next to her was a pile of clothes she forgot to fold. She sat on the pile of clothes and grunted. A muffled PRRRRRRRRBBBT came out onto the pile of clothes. Another PRRRRRRRRBBBT came out as a what seemed to be an endless barrage of farts. One final PRRRT came out, ahhh nikki sighed that feels so much better. She peeked out the changing room door and saw that no one noticed her she quickly ran towards the counter and worked(not really working at the counter ) as usual.  </span></div></div>",
            "created":1308373200,
            "id":1128625,
            "title":"Gas would build up at the wrong times"
        },
        "133222":{
            "choices":[
                "the clones notice the clothes reek.",
                "Nicki craps herself while farting in the clothes pile."
            ],
            "content":"<div class=\"\"><div> <span>The next morning, Nicki went into work as she clutched her stomach. The clones didn't notice as she made her way to the counter. She let out a sigh of relief as she clutched her stomach. All night long her stomach had been churning as she felt her gas build up within her. Her stomach gurgled as she could feel the gas get closer to being blasted.<br>\r\n<br>\r\n\"Hng! I can't take this much longer.\" grunted Nicki. <br>\r\n<br>\r\nShe grabbed a pile of clothes that she was supposed to fold to fart in just like yesterday. She rushed into a changing room and threw the pile of clothes down. She quickly sat down on the pile and sighed as she let one rip.<br>\r\n<br>\r\nPPPPPPPPPPPPPPPPPHHBBBBBBBBBBBBBBBBBBBBBBBTTTTT!T!<br>\r\n<br>\r\n\"Oh finally! I thought I thought this would never come.\" moaned Nicki.<br>\r\n<br>\r\nSuddenly, a girl entered the booth next to Nicki. Nicki started to worry that someone would notice her farting. <br>\r\n<br>\r\n\"Yes! I got that the last pair!\" said the other girl. Nicki scowled as she recognized the voice. It was Tricia, Caitlin's ex-bestfriend and one of the brattiest teens she knew. As she started thinking badly about Tricia, Nicki let out a fart that was loud.<br>\r\n<br>\r\nPPPPPPPPPPPPPPBBBBBBBBBBBBBBBBBBBBBBBBRRRRRRRRRRRRRRRRRRRRRRRRRRRRRTTTTTTTTT TTTT!!!!!!!<br>\r\n<br>\r\n\"*Sniff* Ewww! Who did that?\" Tricia said aloud. Nicki smiled miscieviously as she came up with a sinister idea. Since Tricia couldn't find out who she was, she could gross her out. Nicki moved her butt away from pile of clothes and farted in the direction of Tricia's booth.<br>\r\n<br>\r\nPPPPPPPPPPPPPHHHHHHBBBBBT!!<br>\r\n<br>\r\n\"Oh god, that's disgusting. Knock it off!\" ordered Tricia. Nicki could hear Tricia's nasally voice as she covered her nose. She let out one last fart as Tricia left in disgust.<br>\r\n<br>\r\n\"You gross freak.\" Tricia stormed off leaving Nicki to roll on the floor laughing. For once, their was an upside to her gas. The next day...</span></div></div>",
            "created":1344834000,
            "id":1403615,
            "title":"Morning Gas"
        },
        "1333":{
            "choices":[
                "enter her nose.",
                "trap her inside it.",
                "form into a gassy version of Nikki."
            ],
            "content":"<div class=\"\"><div> <span>On her way home, she felt the gas getting more severe. \"Ugh! This gas is killing me.\" she groaned as the gaseous waste product inside her body only grew worse. The gurgling, groaning noises bellowed louder. Some sounded like someone popping a paper-bag filled with air.<br>\r\n<br>\r\n\"Got to...get this gas out.\" she panted as she clutched herself. To her luck, she sighted an empty building. \"Perfect.\" she said before moaning. Walking the best she could, she positioned herself behind it.<br>\r\n<br>\r\nGroaning, the gas began to grow less painful as it could finally be unleashed. \"Come on. Come on!\" she grunted! She even pushed her butt out to help. Soon, the night air was intruded by a loud PPPFFFFFTTTTT!!!!!<br>\r\n<br>\r\nThis wasn't a small fart either. The gas continued to air out of Nikki's gas-hole in the form of an ever-expanding mist. The mist grew bigger as more fumes escaped from Nikki's tortured bowels. After three minutes, she had created enough gasy to form a cloud as big as two blimps!<br>\r\n<br>\r\n\"Oh man.\" she said as she saw her gas orb, \"Jude's going to hear about this.\" Just as she thought it was over, the gas began to...</span></div></div>",
            "created":1308286800,
            "id":1128204,
            "title":"Letting Loose the Poot Horn."
        },
        "13333":{
            "choices":[
                "entered her mouth and nose!",
                "grabbed and absorbed Nikki!"
            ],
            "content":"<div class=\"\"><div> <span>Just as she thought it was over, the gas began to swirl into a ball. <br>\r\n<br>\r\n\"What the Hell?\" she asked as she watched the bizarre occurrence taking place above her.<br>\r\n<br>\r\nPacked into a ball, the vapor began to take form as it stretched out. To Nikki's disbelief, the ball of foul-smelling gas began to form tiny stubs. From those stubs formed massive hands that were as big as herself. A giant orb-shape began to develop. Soon it had changed into a head. It even form its top and side parts to resemble her hair. Black eyes and mouth opened up.<br>\r\n<br>\r\nSoon the gas had swelled down and began to even out its body. It stood as tall as 7 Nikkis sitting on their shoulders. Standing in front of Nikki was a giant, gas-version of herself! She startled as it looked down at her. It even smiled.<br>\r\n<br>\r\nBefore she could run, the gas giantess then...</span></div></div>",
            "created":1308286800,
            "id":1128213,
            "title":"Nikki's Gassy Clone."
        },
        "133331":{
            "choices":[
                "Caitlin",
                "Jen"
            ],
            "content":"<div class=\"\"><div> <span>The giantess lurches forward and dissipates into a cloud that seeped into Nikki's mouth and nose. She fell to her hands and knees gagging on the stench making her eyes water. Her fear soon to pleasure. Her belly began to fill up like a balloon, and so were her breasts and ass. The gas giantess was filling up the teen and literally clouding her mind. All Nikki could think about was breaking wind and making others live like her. <br>\r\n<br>\r\nWhen the creature was done Nikki was massive. Her belly was bigger than her body, her breasts were wobbling f-cups, and her butt cheeks were like two overinflated balloons. She grinned and let a roaring burp followed by a ten second long fart. She gave her breasts a squeeze and a  puff of gas spewed out. She wanted to get classier, smell worse, and fill other girls with gas. She decided to start with Nikki's friends. <br>\r\n<br>\r\nShe started with.....</span></div></div>",
            "created":1424494800,
            "id":1938207,
            "title":"entered her mouth and nose!"
        },
        "133332":{
            "choices":[
                "She takes control of the gas giantess",
                "The giantess solidifies and forms a tangible human body"
            ],
            "content":"<div class=\"\"><div> <span>Nikkei was grabbed by the giant gas girl and pushed right into her foggy body. She could barely breathe the foul odor nor could she believe that she made this. She found herself blacking out and losing consciousness. Her body loses tangibility and she dissipates into nothing. As soon as it's finished the giantess undergoes a change</span></div></div>",
            "created":1424581200,
            "id":1938221,
            "title":"grabbed and absorbed Nikki!"
        },
        "134":{
            "author_id":"krustyfan",
            "author_name":"Sojaxx",
            "choices":[
                "They continue to grow larger than she planned",
                "She also starts growing multiple breasts and butts ",
                "Her breasts and butt begin to form faces"
            ],
            "content":"<div class=\"\"><div> <span>Her entire body starts to tingle, especially around her chest and rear. She looks down and gasps as she notices her shirt being pushed out and feels her butt push against the chair arms. Her first thought is that something in that butter must be making her hallucinate. Once Nikki places a hand on her chest, she can actually feel her flesh expanding and going up a cup size. If that's not enough her growing ass is experiencing some discomfort from the wedgie her panties riding up her crack.<br>\r\n<br>\r\nNikkie could have stood up and left while she still could but she's too stunned to make any sudden movements. She gives her breasts a tentative squeeze to make sure that this is real and just barely manages to hold in a gasp at how good it feels. \"Damn Jude. Butter that makes my breast bigger and more sensitive? Not sure if I should kick his ass or give him a complimentary grope.\" She reaches behind her shirt and undoes her bra freeing her breasts from unnecessary chafing. Luckily for her the couple in room above her is busy playing tonsil hockey so they don't notice her playing with herself.<br>\r\n<br>\r\nShe gingerly squeezes and caresses her expanding flesh holding in her moans of pleasure. Having lost all interest in the movie, she explores her new endowments as they reach F cups and start to stretch her shirt to the limits. Nikki didn't even care about her butt at the moment as it fills out her seat. Her panties rip and snap while her pants struggle to contain her gluteus maximus.<br>\r\n<br>\r\n\"Oh forget the movie, I need find someplace more private to enjoy this.\" Nikki tries to stand up but gets stopped partway. Looking down, she notices her ass is wedged tight in the chair and has stopped growing. Turning back around, she also notices her breasts also ceased expansion. While its nice to see that she won't have to leave the theater with ruined clothes, Nikki is now stuck. Calling for help is out of the question. Last thing she needs is to make a scene. Besides, she is still aiming to have some alone time with her new bits.<br>\r\n<br>\r\n\"Just my luck. Maybe I will just kick Jude's ass. Stupid butter.\" Suddenly, Nikki gets an idea. She grabs the popcorn bag and grabs a handful of the buttery popcorn. \"Sayyy, maybe a few more handfuls will get me out.\" It's a risky plan but with a bonus of making her breasts even bigger. To Nikki, that's all she cares about right now. She shovels the last of the popcorn down and tosses the bag on the ground as she hears the familiar growl from before. Only this time she smiles ready to get another boost in her bust.<br>\r\n<br>\r\nAs expected, her breasts and butt do start to expand. However....</span></div></div>",
            "created":1552798800,
            "id":2631394,
            "title":"her breasts and butt grew bigger."
        },
        "135":{
            "choices":[
                "She grows another head.",
                "She inflates into a bubble.",
                "Other changes."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other changes might she be experiencing?</span></div></span></div>",
            "created":1295931600,
            "id":1042271,
            "title":"Other changes."
        },
        "1351":{
            "author_id":"firstlastname",
            "author_name":"firstlastname",
            "choices":[
                "Next to her original head",
                "Replaces her boobs?!",
                "Replaces her vagina or something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But where on her body, and who?</span></div></span></div>",
            "created":1484370000,
            "id":2263504,
            "title":"She grows another head."
        },
        "13512":{
            "author_id":"firstlastname",
            "author_name":"firstlastname",
            "choices":[
                "Yes they do",
                "Other characters"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do Caitlin and Jen's heads replace Nikki's boobs?</span></div></span></div>",
            "created":1484370000,
            "id":2263505,
            "title":"Replaces her boobs?!"
        },
        "135121":{
            "author_id":"firstlastname",
            "author_name":"firstlastname",
            "choices":[
                "Reality Change (What bodies?)",
                "Or there's a rational explanation for all this"
            ],
            "content":"<div class=\"\"><div> <span>Nikki loved sleeping face-down. In fact, her breasts were the best cushion sometimes, especially when she slouches on a table. Today though, her breasts felt particularly firm as she was dozing off...<br>\r\n<br>\r\nShe was awoken to her best friends' arguing, Caitlin and Jen. She knew they weren't always gonna get along, but this was getting plain inconsiderate. Nikki grunted as she dragged herself up, beating back the grogginess. \"Can you sissies take your arguing somewhere else? PLEASE!...Uh?\" She didn't spot the girls at her table, or even nearby for that matter. At least, until a voice came from her chest.<br>\r\n<br>\r\n\"About time, geez!\" what sounded like Jen came from her right boob.<br>\r\n<br>\r\n\"Did the table leave a mark on my forehead?\" Caitlin asked from her left one.<br>\r\n<br>\r\n\"EEP!\" N almost fell back seeing her those two - or their heads, rather - in place of her rack. She had to still be dreaming, right? She thought to ask the obvious: \"Wait...if you two are my knockers, what happened to your bodies?!\"</span></div></div>",
            "created":1491454800,
            "id":2300903,
            "title":"Yes they do"
        },
        "1351211":{
            "author_id":"dustindemon",
            "author_name":"Dustin",
            "choices":[
                "Caitlin and Jen are hungry!",
                "Something WEIRDER?"
            ],
            "content":"<div class=\"\"><div> <span>Caitlin and Jen looked at each other, confused looks on their faces.<br>\r\n<br>\r\n\"Uhhhh.... bodies?\" Jen asked.<br>\r\n<br>\r\n\"Nikki, are you feeling okay? Maybe you should get a glass of water...\" Neither Caitlin nor Jen had any idea what Nikki was talking about. They had always been her juggs! <br>\r\n<br>\r\n\"You mean, you- I- Okay, you've GOT to be joking around...\" Nikki tried her best to rationalize what had happened. She pulled out her phone and flipped through the pictures, her eyes getting wider as she looked. To her surprise, every single picture in her phone had Caitlin and Jen's smiling heads attached to her chest! \"But... I, I don't... you're telling me that you two have ALWAYS been my boobs?! Like, forever?!\"<br>\r\n<br>\r\n\"Duh, silly!\" Caitlin giggled, both head hooters jiggling around.<br>\r\n<br>\r\n\"But then how do you work at the Lemon?\" Nikki turned her head, greeted with a bizarre sight... there was Caitlin's body, with some other girl's head attached! <br>\r\n<br>\r\n\"Work at the LEMON?! As if!\"  Caitlin scoffed, \"I wouldn't be caught DEAD working there! And even if I did, it's a little hard to do any work without a body!\"<br>\r\n<br>\r\nNikki put her hand to her forehead. There's NO way this could be real. Just yesterday she, Jen, and Caitlin were hanging out all day! They weren't boobs THEN, were they?<br>\r\n<br>\r\n\"Oooh, there's that cute guy, the one I was telling you about!\" Caitlin squealed, bouncing against Nikki's chest, snapping her back to this new reality.<br>\r\n<br>\r\nJust then...</span></div></div>",
            "created":1492059600,
            "id":2304692,
            "title":"Reality Change (What bodies?)"
        },
        "13512111":{
            "choices":[
                "Jen and Caitlin are grateful Nikki shared her food",
                "Jen and Caitlin are upset that they haven't been fed sooner"
            ],
            "content":"<div class=\"\"><div> <span>Nikki spots the cute guy Caitlin mentioned realizing that she is technically topless right now in the middle of the mall. She covers up her chest with her hands. Nikki gets up and dashes away before he notices her forgetting that Jen and Caitlin are her breasts.<br>\r\n<br>\r\n\"Wha the ell!\" Jen shouts, though the hand is muffling her voice.<br>\r\n<br>\r\n\"Get yo handsh aww!\" Caitlin pleads as she shakes frantically. The movement caused by the two remind Nikki that her breasts are alive now, and her friends' no less. They slip out of her grip and once free, gasp for air. It's going to take a while for Nikki to adjust to this new life of hers. It would help if she could get some answers but she has nowhere to start and has bigger, booby issues on her plate.<br>\r\n<br>\r\n\"Sorry girls, I panicked back there. Are you alright?\" Nikki asks with concern.<br>\r\n<br>\r\nJen looks up at the girl she is attached to and glares at her. \"You nearly suffocated us! What's with you today?\"<br>\r\n<br>\r\n\"It's my fault, I know you don't like it when I try to set you up with guys but he was sooooo cute. I had a good feeling about him too, his hands looked soft and gentle.\" Caitlin muses, imagining being caressed and kissed for a stud like him. At least her friends are acting like their normal selves. Still all of this information and new sensations is getting overwhelming.<br>\r\n<br>\r\n\"Okay I'm sorry. I'm just a little confused. You can fill me in on what's been going on while I get us some food.\" She could use something to soothe the headache her breasts have been giving her plus it is almost lunch time. Neither of them question it but are very surprised to hear her say \"we\". She takes them to get some fast food and gets something for the three of them. She got herself a burger and onion rings with a diet coke, and for Jen and Caitlin she got them each an order of fries and a milkshake.<br>\r\n<br>\r\nNikki bites into her burger hoping that the comfort food will make things a little better. It keeps her from wondering Jonesy will think when he sees her, or if he will even bat an eye. From the sound of it Nikki having living boobs isn't a big deal. Looking around it appears that no one is even giving her a second look. The teen bites into the burger again and some kitchen spills out and on to the table. She grabs a napkin to wipe it off and sees that Caitlin and Jen haven't touched their food. \"Uh girls? You going to eat or what?\"<br>\r\n<br>\r\nThe look up at her like it was the strangest question she could have asked. \"Wait, this is for us? But...you never let us eat.\" Caitlin says astonished as she stares hungrily at the food.<br>\r\n<br>\r\n\"Yeah. You said we couldn't cause your back couldn't take it.\" Nikki notes a little irritation in Jen's voice but doesn't pay it any heed.<br>\r\n<br>\r\n\"Look I don't know anything about why you're on my boobs. I have a lot to ask but I want us to eat first, alright?\" She sighs, getting annoyed by all this. By now the pair have picked up that Nikki lost her memories or something. They're almost as confused as she is but right now they are more focused on the food before them. Caitlin is the first to lurch forward and wrap her lips around the straw and suck on the milkshake. Jen waits first and watches Caitlin react, a happy grin growing as she sucks down more. The red head cautiously tries the fries and slowly digs in.<br>\r\n<br>\r\nNikki almost drops her burger when her breasts lunge forward. It's like holding back two hungry dogs on leashes but with her chest. They eat as if this is their first meal in ages, tugging at her just to get closer to their food. \"Geez, you two must be starving. Wait huh?!\" While looking down she swears that Caitlin and Jen have gotten bigger slightly. It might be her imagination though. She can shivers sensing the icy milkshake being slurped by her friends. They stop to respond and swallow what is in their mouth. Apparently,</span></div></div>",
            "created":1503464400,
            "id":2373786,
            "title":"Caitlin and Jen are hungry!"
        },
        "135121111":{
            "choices":[
                "Nikki makes it to the Khaki Barn",
                "Nikki stops for more food "
            ],
            "content":"<div class=\"\"><div> <span>She might be mistaken but it almost looks like Caitlin is crying tears of joy. The food is good but it's not that good. \"Oh thank you Nikki, thank you thank you thank you!\" Caitlin thanks. She bounces with delight with a bit more intensity than before. She lets out a cute burp that silences her blushing face. \"Excuse me.\"<br>\r\n <br>\r\n\"Yeah Nikki, you never let us eat anything. What's going on?\" Jen asks. While she enjoys her treat, it is a little unusual for Nikki to treat them with food.<br>\r\n<br>\r\n\"That's what I want to know. I don't care what it seems like, but you weren't my breasts the other day. I had normal boobs, you two had bodies, and we hang out here with the guys. Now everything is completely different. If you two can give me some answers, I'll feed you two more often. Deal?\" Nikki asks.<br>\r\n<br>\r\nThe two breast friends exchange a puzzled look unsure if they believe what Nikki told them. According to their memories they've been her breasts forever, but now all of a sudden she's forgotten everything. They're skeptical but she deserves to know what's going on. \"Well...alright, but let's finish eating first.\"<br>\r\n<br>\r\nCaitlin nods and chows down on the rest of her fries and slurps down her shake. Jen copies her eating method even if it does look sloppy. Nikki is almost concerned with how ravenous they're eating and wonders how little she actually fed them. Once they gulp down the last of their food, Caitlin is the first to respond. \"Oh that hit the spot. I wish we could eat this good everyday.\"<br>\r\n<br>\r\n\"Seriously? That's hardly lunch? Don't I usually treat you better?\"<br>\r\n<br>\r\n\"Yeah but you never feed us. Every time you do we get bigger.\" Jen answers, licking some salt on her cheek while she can.<br>\r\n<br>\r\n\"Wait seriously? So you guys are bigger now?\" Nikki doubts her chest could be that much bigger from that meager meal. She cups her boobs and feels them to see if there really is any change. They feel a little fuller than before but the change isn't too noticeable yet. Jen and Caitlin start giggling which confuses Nikki even further.<br>\r\n<br>\r\n\"Sto-stop that. It tickles!\" Caitlin chuckles, causing her to wobble along with Jen. Nikki lets go and tries to remember not to do that again. Though it does feel nice to have huge boobs to grab. <br>\r\n<br>\r\nJen's laughter dies down and she continues explaining. \"Yeah, we found out years ago when you showed up in preschool with a B cup. Since then you and your parents have made sure we barely get a bite to eat. We're lucky to get crumbs or sauce stains.\"<br>\r\n<br>\r\n\"That's terrible. Alright look, if you help me figure out how to get you two your own bodies again I'll let you eat whenever you want. How's that work out?\"<br>\r\n<br>\r\n\"Wait really!?!\" Caitlin exclaims. \"Yesyesyesyesyes!\" Caitlin squeals, heaving and jiggling like crazy. Jen just smiles slightly and agrees as well. Nikki then stands up and starts walking.<br>\r\n<br>\r\n\"Glad to hear it. Speaking of work, I should probably head to the Khaki Barn. I still work there right?\" Her friends nod, swaying and bouncing slightly. \"This is going to take some getting used to. Try not to move too much.\" She heads over to her dreaded job, remarkably without any issue standing up straight with her huge hooters. Hopefully she can find some answers soon and get things back to normal.</span></div></div>",
            "created":1503637200,
            "id":2374330,
            "title":"Jen and Caitlin are grateful Nikki shared her food"
        },
        "135122":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "let's do it",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just curious, but how about something similar to the previous option only instead of Jen and Catlin's heads becoming Nikki's boobs, their heads could become Nikki's butt cheeks? </span></div></span></div>",
            "created":1492146000,
            "id":2304911,
            "title":"Other characters"
        },
        "13513":{
            "author_id":"firstlastname",
            "author_name":"firstlastname",
            "choices":[
                "Let's go with that",
                "Maybe something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Replaces her hands?</span></div></span></div>",
            "created":1541134800,
            "id":2572040,
            "title":"Replaces her vagina or something else"
        },
        "1352":{
            "choices":[
                "inflated larger.",
                "changed into a giantess.",
                "changed into a blimp."
            ],
            "content":"<div class=\"\"><div> <span>\"I feel so...gassy.\" she said. Suddenly, the whole theater shook with disgust by the sound and eruption of one giant....<br>\r\n<br>\r\nBBBEEEELLLCCCHHHHHH!!!<br>\r\n<br>\r\nSoon a cloud of gas filled the entire room. Exiting Nikki's mouth at an alarming rate, its yellow form was large enough to fill an entire blimp. People were coughing and screaming as its horrific aroma. Rushing to get out of the theater, people were coughing and falling. One guy said, \"THE HORROR! THE HOOORRRROORRRR!!!\" as he was gagging from the deadly fumes.<br>\r\n<br>\r\nBut inside the theater, Nikki was immune to the deadly stink. \"Mmm. This isn't so bad. I've smelt the boys after they farted.\" she said.<br>\r\n<br>\r\nSuddenly, she felt her body inflating! As it inflated, it also began to become more spherical! \"Whoa! How's going on?!\" she asked. Within minutes, her torso disappeared as her face began to travel down. \"Man! This hurts!\" she said as her face stretched further down and wider.<br>\r\n<br>\r\nThen her arms and legs were sucked into her body! Floating in the air, she was now a bubble girl! \"Ok. This is weird.\" she said. She was 10 feet across and 5 feet around.<br>\r\n<br>\r\nFloating around the theater, she soon found her way towards the door. Squeezing in as hard as she could, she managed to pop out of the theater. Flying higher, she soon...</span></div></div>",
            "created":1295931600,
            "id":1042281,
            "title":"Nikki the Bubble."
        },
        "13521":{
            "author_id":"kamenmaster",
            "author_name":"kamenmaster",
            "choices":[
                "Pops, becoming a humanoid gas creature",
                "splits in two, then four then more creating a swarm of hive minded bubbles"
            ],
            "content":"<div class=\"\"><div> <span>Nikki slowly rose through the air gently buffeted by the passing winds.<br>\r\n<br>\r\n\"You, know there's something really relaxing about this whole floating thing.\"<br>\r\n<br>\r\nAs Nikki rose higher and higher the air pressure around her began to decrease as it is known to do at higher altitudes, and like all balloons that climb up the air inside her body started to expand making her grow.<br>\r\n<br>\r\n\"Oh, oh, wow that feels good.\"<br>\r\n<br>\r\nNikki closes her eyes and revels in the erotic sensations that come from her growing, and the breeze that flowed around her. Then as she started to reach a certain hight, she felt the air, or whatever it was in her body start to rumble and she.</span></div></div>",
            "created":1379998800,
            "id":1669142,
            "title":"Up through the atmosphere"
        },
        "1353":{
            "author_id":"deadipool",
            "author_name":"Rhian Folly",
            "choices":[
                "1''",
                "5\"",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Nikki began to notice her frame is not filling her top as it did a moment before.  He shoulders slipped through her neck hole of her shirt with her bra sliding off with her shirt exposing her bare Chest.  As she stood to attempt to escape from her tiny fate when she was pinned down by the sudden weight of her necklace pinning her under its sudden immense weight.  When she stopped shrinking she was________.<br>\r\n<br>\r\nSuddenly Jude burst into her house glass vial in hand. Jude, placed Nikki in the vial and plucked her under ware in his backpack and her other cloths she was wearing in a duffle bag. Jude placed her in a side compartment of the bag where she saw her friends inside similar vials. Jen and Caitlin were trembling at Jude's imprisionment of them.  </span></div></div>",
            "created":1333688400,
            "id":1310266,
            "title":"Shrinking test 1 2 3"
        },
        "13533":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "continue",
                "another transformation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do you really want to go with shrinking, or should Nikki go through another transformation?</span></div></span></div>",
            "created":1484370000,
            "id":2263537,
            "title":"Readers choice"
        },
        "135332":{
            "author_id":"thegunslingerx",
            "author_name":"TheGunSlingerX",
            "choices":[
                "Yes...",
                "Other..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Nikki becomes a shemale.</span></div></span></div>",
            "created":1507957200,
            "id":2401174,
            "title":"She grows a cock"
        },
        "1353321":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she keep her vagina?</span></div></span></div>",
            "created":1586199240,
            "id":2814364,
            "title":"Nikki’s Wang"
        },
        "13533211":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And does she also grow balls?</span></div></span></div>",
            "created":1586199600,
            "id":2814367,
            "title":"Futanari"
        },
        "135332111":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Yes, uncut dicks look weird!",
                "No, why would it grow uncircumcised?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Almost the last question, does it grow circumcised or not?</span></div></span></div>",
            "created":1586199780,
            "id":2814369,
            "title":"Full Package "
        },
        "1353321111":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Normal ",
                "BIG"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Last question before we get into the real story, is it normal sized, or above average?</span></div></span></div>",
            "created":1586199900,
            "id":2814371,
            "title":"Yes, uncut dicks look weird!"
        },
        "1353321112":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Just a normal sized dick",
                "Large. She’s gonna have a “hard” time hiding it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Last question before we get into the real story, is it normal sized, or above average?</span></div></span></div>",
            "created":1586200020,
            "id":2814372,
            "title":"No, why would it grow uncircumcised?"
        },
        "1353322":{
            "author_id":"kameron94",
            "author_name":"Kameron",
            "choices":[
                "Age regression",
                "Age progression",
                "Another transformation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What other transformations does Nikki go through?</span></div></span></div>",
            "created":1586198040,
            "id":2814352,
            "title":"Other..."
        },
        "13533221":{
            "author_id":"supreme123",
            "author_name":"Cardinal Priest",
            "choices":[
                "1 year old.",
                "5 years old",
                "Other ages."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How young does she become?</span></div></span></div>",
            "created":1586265300,
            "id":2814877,
            "title":"Age regression"
        },
        "15":{
            "author_id":"dustindemon",
            "author_name":"Dustin",
            "choices":[
                "The Clones",
                "Tricia",
                "Nikki's Mom",
                "Yummy Mummy",
                "More?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which girl would you like to mess with?</span></div></span></div>",
            "created":1295758800,
            "id":1040497,
            "title":"More?"
        },
        "155":{
            "author_id":"dustindemon",
            "author_name":"Dustin",
            "choices":[
                "Julie",
                "Courtney",
                "More?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which girl?</span></div></span></div>",
            "created":1295758800,
            "id":1040498,
            "title":"More?"
        },
        "1553":{
            "author_id":"firstlastname",
            "author_name":"firstlastname",
            "choices":[
                "The more, the merrier",
                "Maybe just two of them",
                "One at a time"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Would you like to mess with our three main females at once?</span></div></span></div>",
            "created":1483592400,
            "id":2259554,
            "title":"More?"
        },
        "15531":{
            "author_id":"firstlastname",
            "author_name":"firstlastname",
            "choices":[
                "Mix-n-Match the girls",
                "Something different"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps the girls find their body parts swapping and morphing in the most extreme ways?</span></div></span></div>",
            "created":1484370000,
            "id":2263496,
            "title":"Now which storyline shall we take?"
        },
        "155312":{
            "choices":[
                "Switching bodies.",
                "Something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps the girls find themselves into each other's bodies?</span></div></span></div>",
            "created":1487998800,
            "id":2282117,
            "title":"Something different"
        },
        "1553121":{
            "choices":[
                "a mirror (only two girl swap).",
                "a plasma ball (all three girl swap)."
            ],
            "content":"<div class=\"\"><div> <span>Jenn and Nikki were already sitting at the Squeeze where they were waiting for Caitlin.<br>\r\n<br>\r\n\"Ugh, when will she come? It's more than ten minutes she texted us to come here.\" Nikki grumbled.<br>\r\n<br>\r\n\"I know right. She probably went shopping and wants to show us what she bought.\" Jenn commented.<br>\r\n<br>\r\n\"In that case, I'd better go. I can't stand it.\" Nikki said standing up. At that moment Caitlin finally arrived. Both Jenn and Nikki were confused. Normally Caitlin would not have long enough arms to carry shopping bags and here she had only one bag.<br>\r\n<br>\r\n\"I'm here. Sorry it took so long. I didn't know whether to buy it or not and in the end decided to buy it. Isn't it lovely?\" Caitlin said pulling the object from the bag.<br>\r\n<br>\r\n\"It's...nice.\" Jenn said tactfully. <br>\r\n<br>\r\n\"What is it actually?\" Nikki asked. <br>\r\n<br>\r\n\"Oh you're so silly, it's...</span></div></div>",
            "created":1497675600,
            "id":2337769,
            "title":"Switching bodies."
        },
        "15531211":{
            "choices":[
                "Jen volunteers to help Caitlin.",
                "Nikki volunteers to help Caitlin.",
                "Jen and Nikki both volunteer."
            ],
            "content":"<div class=\"\"><div> <span>It was a mirror. A small gold two-sided mirror embedded with strange lines. Looking at the mirror Jenn and Nikki both felt an uneasiness coming over them, like the beginning of a bad movie. <br>\r\n<br>\r\n\"Wow, um Caitlin are you sure this is something you wanted?\" Jenn asked politely.<br>\r\n<br>\r\n\"Yes, well, the boy behind the counter was really cute, so I decided to buy it. He said it would change my life forever. Iee, can you believe it?\" <br>\r\n<br>\r\n\"Not at all.\" Nikki said sarcastically rolling her eyes.<br>\r\n<br>\r\n\"So what does it do?\" Jenn asked looking at it from the distance.<br>\r\n<br>\r\n\"Well, Chen said two people would need to look at the mirror opposite from each other. So who wants to?\" Caitlin asked her two friends?</span></div></div>",
            "created":1553317200,
            "id":2633687,
            "title":"a mirror of change"
        }
    },
    "info":{
        "author_id":"dustindemon",
        "author_name":"Dustin",
        "brief_description":"Mess with the 6Teen girls!",
        "created":1295778720,
        "description":"<td align=\"left\" class=\"norm\">The girls from 6teen undergo some STRAAAANGE transformations! Setting and used characters can be whatever you want. They can turn into animals, inanimate objects, alien creatures, they can be inflated, basically anything can happen. Want a girl to eat another girl? GO FOR IT! Want a girl to become a brand new planet? YOU GOT IT BOY. A few rules, though:<br>\r\n<br>\r\n- No male TF.<br>\r\n- No gender bending into males.<br>\r\n- No werewolf TF. No offense to people that like it, I just find it boring and overdone.<br>\r\n- No crossovers with other shows<br>\r\n- Please try to write at least a paragraph. I hate when stories have, like, three words in a chapter.</td>",
        "id":1744499,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1589954640,
        "modified":1589954640,
        "pretty_title":"6teen Transformation Story"
    }
}