{
    "chapters":{
        "1":{
            "author_id":"furrygrappler",
            "author_name":"FurryGrappler",
            "choices":[
                "Roy, scrawny colt, age 11",
                "Amanda, curveless lemur, age 8"
            ],
            "content":"<div class=\"\"><div> <span>          You're nervous as you tie on your wrestling mask. You were apprehensive when you were approached after school one day by a tall sexy dragoness in tight revealing clothes and asked if you would like to be beat up, but then she gave you $500 in advance in exchange for a promise to show up at this abandoned warehouse, empty except for some boxes stacked to enclose a small ring made simply of some poles and rough rope. You aren't alone, however. There are big males with ripped physiques and lovely females with large breasts packed into tight wrestling clothes, a leering audience surrounding the wring, other kids like you wearing masks to protect their identities, and the dragoness who hired you standing in the middle of the ring, wearing daisy dukes and a striped tip that showed her entire cleavage. She may be dressed like a ref, but she has made it clear beforehand that she is not going to be helping you.<br>\r\n<br>\r\n          The dragoness motions you to the ring; you are going to be in the first match for the night. As you walk to the ring, you see one of the audience lean back to look at your butt, then turn to his partner and make a thrusting motion with his hips while his buddy cackles. You feel extremely uncorftable as you climb into the ring, wondering what you have gotten yourself into.<br>\r\n<br>\r\n          Who are you?<br>\r\n </span></div></div>",
            "created":1295154000,
            "id":1036281,
            "title":"Fresh meat"
        },
        "11":{
            "author_id":"furrygrappler",
            "author_name":"FurryGrappler",
            "choices":[
                "Speed, a ripped lion, with white tight shorts with a bulge between his legs",
                "Felicia, cat, tits bigger than your head, in a matte black rubber one-piece"
            ],
            "content":"<div class=\"\"><div> <span>          You're a thin horse, brown with white blotches, and dark hair that almost rests on your shoulders. You are gangly, leftovers from a recent growth spurt, and you find them a little difficult to manage, so you are a bit clumsy. Since you are a colt, the dragoness thought it would be cute to put you in a pair of blue long tights with tassels running all the way down the legs, with a mask with more tassels to match the tights. Your wiry narrow chest is naked, with a flat belly and just a wint of muscle on your chest.<br>\r\n<br>\r\n          As you enter the ring and take your corner, the dragoness approaches you. Her hips sway widely as she walks up to you and stand toe to toe with you. Since she is very tall, your face only comes up to her bare washboard abs, and as you look up you can barely see her face behind her swollen breasts, but you can see just enough to recognize the hungry look on her face, and it ties your stomach into a knot, a pain which you curiously don't mind at all. She gets onto her knees so she can look you in the eye, but your eyes are looking down her deep cleavage. You barely notice as she spreads her arms out to grab the ropes, as you just watch as she displays her breasts proudly to you, turning and swaying them slowly. Suddenly, her breasts crash against your chest, and you are forced into the corner pole. Your mouth opens to catch a breath, but all that it meets it her mouth pressed against it violently. You squirm as you feel the unpadded pole press into your back, her breasts pressing the air from your lungs, and her claws hands grasping your butt painfully. You hear whoops and claps as your and her lips pull apart with a pop.<br>\r\n<br>\r\n          \"Be a good boy,\" The dragoness coos in your ear, \"and we will finish this after the show.\"<br>\r\n<br>\r\n          The dragoness gets up and walks back to the center of the ring with that same swaying gait and motions your opponent to come to the ring.<br>\r\n<br>\r\n          Your opponent is...<br>\r\n </span></div></div>",
            "created":1295240400,
            "id":1036812,
            "title":"The Littlest Cowboy"
        },
        "111":{
            "author_id":"furrygrappler",
            "author_name":"FurryGrappler",
            "choices":[
                "Snatches you up his his muscular arms and crushes you.",
                "Grabs you by your hair and punches you in the belly."
            ],
            "content":"<div class=\"\"><div> <span>          The lion entering the ring has big rippling muscles. He is not build like a beast, but every muscle in his chest, broad shoulders, and arms are clearly defined, tensing with each movement. He is dark furred with a black stringy mane, and he has a handsome face even in its expressionless, only sometimes betraying a look of some self-satisfaction. However, the most obvious thing about him, protruding even more than his square angular pectorals, is a bulge in his white lycra wrestling shorts, resting prominently between his legs, bouncing around with each step. You can't take your eyes off of it; you've never seen something like this on a man before.<br>\r\n<br>\r\n          The dragoness calls you both to the center of the ring. As you stand before the lion, you can see that he is not quite as tall as the dragoness, but still much taller than you. As he looks down at you, you begin to feel something not unlike what you felt when the dragoness was kissing you earlier, a dull ache like a tummy ache, but instead in your groin, and you hate it...or do you?<br>\r\n<br>\r\n          \"I want a nice dirty fight,\" says the dragoness to you both, \"Try to protect yourselves at all time, but no shame if you cant. Keep it in the ring, but sometimes accidents happen. The fight when I feel like it is finished.\"<br>\r\n<br>\r\n          The dragoness signals for a bell to be rung, when Speed suddenly...</span></div></div>",
            "created":1299387600,
            "id":1065718,
            "title":"Speed, a ripped lion, with white tight shorts w..."
        },
        "1111":{
            "author_id":"fabian4evr",
            "author_name":"fabian4evr",
            "choices":[
                "Start with a tongue bath to my mouth.",
                "Squeeze and demand a submission."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> I'm pulled against the furry chest and prepare for the squeeze...and you</span></div></span></div>",
            "created":1301029200,
            "id":1075756,
            "title":"Snatches you up his his muscular arms and crush..."
        },
        "11111":{
            "author_id":"beatdown",
            "author_name":"Braun Beatdown",
            "choices":[
                "A pair of handcuffs?",
                "A pair of brass knuckles?!"
            ],
            "content":"<div class=\"\"><div> <span>You squeal out in pain as his arms crush you against his chest. Speed takes advantage of your open mouth to... plunge his tongue into your mouth? What the hell is going on? His hot tasting muscle wraps around your petite tongue and coats it in his overpowering saliva. You choke and gag and writhe in his arms to get yourself free but you simply can't.<br>\r\n<br>\r\nYou're trapped for the whole of his unpleasant, humiliating make-out until he releases you. Your cheeks flush and you've never felt more humiliated in your life, but your stomach is still filling with that strange, warm feeling. The crowd has changed from cheering to whistling lewdly and calling out disgusting things.<br>\r\n<br>\r\nYour eyes dart down to the lion's hand, he's reaching into his shorts for...</span></div></div>",
            "created":1358830800,
            "id":1514137,
            "title":"Kissing a foe?"
        },
        "111111":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Bring the pain",
                "More humiliation",
                "Finish you"
            ],
            "content":"<div class=\"\"><div> <span>You see him take out a pair of handcuffs from his shorts. While you were focusing on those, he took his other hand and grabbed your wrist, he turned you around, twisting your arm behind you, and cuffs that wrist. He drags you, kicking and screaming, over to one of the turnbuckles. He forces you to sit down, positioning your arms so that when he cuffed your other wrist, your hands couldn't move above the lower rope of the wrestling arena. You can only flail your legs as you try to wrench yourself free of those handcuffs. Speed stood up at full height, crossing his arms, and you never felt smaller than you did right there. Meanwhile, the crowd is cheering, pleading for Speed to punish you one way or another. <br>\r\n\"Sit on him!\"<br>\r\n\"Smack him!\"<br>\r\n\"Step on him!\" <br>\r\n\"Lick him all over!\" Those were some of the cheers that you heard from the crowd. Speed squatted down such that he was he was eye level with you, and you saw him lick his lips. You audibly gulp, keeping your mouth shut anticipating the next attack. He bends down to your chest, and runs his tongue across your nipples. You gasp at the sensation. Speed then hits you with another kiss, much to your dismay(?). He exits your mouth, trailing his tongue along your cheek and across your sensitive neck. This causes the crowd to cheer and you to kick more violently than before, too bad none of your kicks do anything to him. You can't even attack his groin. The way he's bending, he's blocking view of his weak spot. And even then, he positioned his legs just right to stop any attacks from you down there. He finishes his licking by planting two hard kisses on your neck, one for either side, resulting in decently sized hickeys. Following the encounter, that groin head ache feeling was only getting worse. <br>\r\nHe stands upright, forming fists and placing them on his hips. He then places his hands on either rope meeting at the turnbuckle, and spreads your legs apart with his legs. <br>\r\n\"No, please!\" you beg. He doesn't care. He lifts a leg, and slams it down between your legs. You howl in pain, while the crowd cheers. Speed grinds the upper half of his foot into your groin. With his foot, he messes with your groin such that his foot was resting on the under side of it. He slides his foot back and forth on your groin, applying enough pressure to make it hurt like hell, but something about it only increased the groin headache feeling further, while you cried.<br>\r\nHe takes his foot off of your groin, the turns around, his butt now facing you. With his tail, he moves your head such that you were forced to stare at his butt as it lowered onto your face. You screamed, but were met with his smelly backside. He grinds into you and the turnbuckle, then proceeded to thrust his butt into your face, smashing the back of your head against the turnbuckle. He wraps his tail around the back of your head, and pulls you as hard as he can into his butt. You hear a grumbling from his belly, and you instantly realize what he's going to do. You shake harder than before, kicking and flailing, but your struggles do nothing to stop the inevitable.<br>\r\n*PRRRRRRRRRRRRRRT<br>\r\nA hot wind blasts across your face, carrying with it the stench of cheese and sulfur. You hear the crowd laughing hysterically as he farts right on you. He unwraps his tail and presses his ass, and you, against the turnbuckle, grinding the smell into you. <br>\r\n*PRT<br>\r\n*PRRRT<br>\r\nHe lets out smaller farts as he grinds into you. After that torment, he walks away from the turnbuckle, leaving you gasping for any fresh air you can. Unfortunately, the stench clung to the hair around your face. You're staring down at the canvas in front of you, when you see Speed walk into view. You look up and see him holding his bulge, a rare smile spread across his lips. With a swing of his hips, his bulge smacks you across the face, issuing whoops from the crowd. He smacks you with his appendage again. Then again. Then again. Then he centers your head, and places his groin over your snout, slowly, sensually humping your face. You can only pathetically kick in protest as the musk of his groin, in combination with his previous gas, coagulates into your nostrils. Meanwhile, the crowd is eating this punishment up. He finally seems to show mercy when he gets off of you. Of course, there's no mercy here. You're still stuck to the turnbuckle, he wants to do something else to you.</span></div></div>",
            "created":1466139600,
            "id":2165550,
            "title":"A pair of handcuffs?"
        },
        "1111113":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Go to the next match as Roy",
                "Follow another set of fighters"
            ],
            "content":"<div class=\"\"><div> <span>Speedy decided he's held off enough. He wants to take you home, ASAP. He kneels down again, you looking up, completely defeated. He puts a hand under your chin, cranes your head upwards, and began to lean in close. You couldn't fight as he planted his lips against yours. You couldn't fight as his tongue wormed through your lips and wrestled against your own. You couldn't fight as Speedy twisted his head so he could kiss you more deeply.<br>\r\n<br>\r\nAs he forcibly kissed you, you felt your air supply slowly run out. Speedy was going to choke you out with a long kiss, and you could do nothing about it. It felt like he mingled his saliva with yours for hours, and you were on the brink of blacking out. And... you're out.<br>\r\n<br>\r\nYour body went limp as you went unconscious. Finally, Speedy took his lips off of you, and let your head flop downwards. With that, the dragoness decided to call it match. If the toy of the match wasn't gonna fight anymore, what were they going to do? Toss his body around like a ragdoll? There were more toys to play with tonight.<br>\r\n<br>\r\nSpeedy unlocked the handcuffs around you and held you bridal style while the dragoness walked towards you.<br>\r\n<br>\r\n\"This one's comin' with me,\" Speedy said, halting the dragoness. She shrugged, and Speedy walked out of the ring as the crowd cheered. Speedy was heading right for a changing room, you in his arms.</span></div></div>",
            "created":1487912400,
            "id":2281867,
            "title":"Finish you"
        },
        "11111131":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Arnold, a muscular german shephard that's very \"friendly\"",
                "Maria, a grope-y octopus lady"
            ],
            "content":"<div class=\"\"><div> <span>You can't even remember how you were talked into coming back here. After the kind of stuff Speedy did to you, you were positive you would never come back here. And yet, that money...<br>\r\n<br>\r\nYou were wearing the same outfit from your last time, except a design was stitched into the mask to make it look like there was always lipstick around your mouth. As you made your way to the arena, you heard the crowd whooping and lewdly whistling as you approached. You were sure it was more to see you get messed up.<br>\r\n<br>\r\nYou crawled under one of the ropes, and you saw the dragoness, wearing the same, flirtatious grin she did the night before. You got to your corner, not wanting to disappoint her. Though, she was starting to get a little too close to you. You felt her tail slither between your legs, and tried to reach down and stop her. However, she held you wrists as her tail felt around your pelvic area. <br>\r\n<br>\r\n\"Now, that brute didn't break our toy, did he?\" she asked as she checked your lower half. You kept struggling in her grip, but she eventually let go, leaving you all flustered. Meanwhile, your opponent approached.</span></div></div>",
            "created":1491638880,
            "id":2301625,
            "title":"Go to the next match as Roy"
        },
        "111111312":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "...wrapped a tentacle around your neck",
                "....grabbed your legs and arms",
                "...caught you between her legs"
            ],
            "content":"<div class=\"\"><div> <span>From beyond the ropes, you saw a strange figure walking towards the ring. The curviness, especially around the chest, told you that the opponent is female. Their flesh appeared slick with some sort of liquid, and looked like it'd be extremely slippery. She also had not one, not two, but three sets of arms. You had no idea what she was, until she got under the lights of the ring. You saw that your opponent had coral red skin, which glittered under the lights of the ring. She wore a dark purple two-piece bikini, which clung to her tightly. You could see the bumps under her top, and the camel toe formed by her panties. She was also extraordinarily slim, and looked like she could move without worrying about bones. Furthermore, her six arms were dotted with suction cups that were decorated with dark purple lipstick. It looked like you were approached by an octopus lady.<br>\r\n<br>\r\n\"What a catch, ladies and gentlemen!\" the dragoness said. \"Our lucky little opponent has gotten himself a prime spot in front of our favorite octopus, Maria! You have a thing for girls with tentacles?\" You blushed at her suggestion. Maria, meanwhile, looked down at you with a mischievous glint in her eyes. \"Alright, Maria, show this twerp what it's like in the shark tank.\" With that, the dragoness sauntered off, and Maria licked her lips as her eyes traced your body. \"And... begin!\" And, with that, Maria...</span></div></div>",
            "created":1503255180,
            "id":2372046,
            "title":"Maria, a grope-y octopus lady"
        },
        "1111113122":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "She keeps flexing her tentacles on your body",
                "She pulls her suciton cups off of you",
                "She stretches out your body"
            ],
            "content":"<div class=\"\"><div> <span>The bell's ring hadn't left your ears when you suddenly felt a crushing pressure around your waist and legs. That lady slithered right up to you faster than you would've ever been able to counter, and she lashed out a few tentacles just as quickly. Two of them were wrapped around your midsection, and were keeping your arms pinned to your side. And you felt two more tentacles wrap around each of your ankles. Suddenly, the tentacles around your ankles lashed upwards, yanking you off of the ground, and suddenly eye-to-eye with the octopus lady. When you were so close to her, you were suddenly aware of the smell of salt water, and you couldn't help but notice how...hypnotic those eyes were. She seemed to bear an orange sclera with green eyes. And those eyes seemed to beckon you towards her. Before you could even scream, you felt her lips press against your forehead. Her kiss was downright heavenly right now, it seemed to radiate with this strange caring you weren't expecting.<br>\r\n<br>\r\nThen, just as quickly as it began, with a pop, she pulled her lips off of you, leaving behind purple lipstick. You saw her reach for you again, and you were expecting a nice, warm feeling. Instead, you the tentacles around your midsection pull, but not without some resistance from those suction cups. You almost felt like they were teeth clamping on your skin, begging to keep a grip on whatever part of you they could. But, with enough pulling, several pops rang out over the ring as she pried her own tentacles off of you, and you were positive some of your fur was sucked off of you. Curious, you looked at your midsection, and, sure enough, bits of your fur were missing. However, what you didn't expect to see were purple circles where the suction cups pulled on you. Had she... had she put makeup on her suction cups?<br>\r\n<br>\r\nYou weren't able to ponder this further, for she wrapped two tentacles around your wrists, and spread them. She held you overhead, making sure you were facing the ground. She licked her lips, her eyes telling you that she had some terrible idea in mind.<br>\r\n<br>\r\n\"Mmm, such a small, tasty body, just the right size for a big, strong gal like me~\" she cooed. \"You can scream all you want, tot. You're in a feeding frenzy, and I'm hungry!\" With that, her remaining tentacles shot up at you. The tips of them started at your chest, curled around your stomach, and between your legs. The bizarre wetness and stickiness of her suction cups left such a bizarre feeling through your body. It felt good in a weird way, kind like a bunch of lips were pressed against various points of your body. At the same time, you knew how much it'd hurt when/if she wanted to take those off of you. She seemed to notice the discomfort this position was bringing you, as indicated by her smile, growing with acknowledgement. She flexed her tentacles outwards, then inwards, out then in, out then in... She seemed to put the parts near your groin special attention, as they hungrily caressed your groin. To your horror, you felt something growing below the belt. You knew how shameful this was, especially since a lady had a perfect view of it. Worse still, that seemed to encourage her efforts. Once she noticed you grew, she instead had her tentacles flex in a wave formation, undulating at your groin, pulling on your bulge, then undulating over the rest of your torso. She kept up this process, squeezing and rubbing the bulge between your legs, licking her lips as she did so.<br>\r\n<br>\r\nYou were terrified. There was no good outcome. Either she'll keep you in this position and keep on doing this weird thing with you, or she'll pull her suction cups off of you as painfully as possible, like before.<br>\r\n</span></div></div>",
            "created":1516524360,
            "id":2443315,
            "title":"....grabbed your legs and arms"
        },
        "11111131223":{
            "author_id":"furrygrappler",
            "author_name":"FurryGrappler",
            "choices":[
                "She lays you out and pins you",
                "She switches to strangulation."
            ],
            "content":"<div class=\"\"><div> <span>With a twirl, Maria drapes your scrawny body across her shoulders. She gyrates herself at the audience as she slipped her tentacles around your neck and your ankles, using you as a prop in an exotic dance. Her hips twisted around, and her pendulous breasts swung back and forth. Gracefully, her erotic display turned into a submission hold as she begins to wrap your spine around her neck. She tried to turn you into a scarf, bending you until your ears brush your heels. As she inflicted agony upon you, she became increasingly excited. You screamed; she gasped in pleasure.<br>\r\n<br>\r\nShe release the hold and against lifted your body into the air. The sexy dance continued, dangling you above her head with two of her tentacles while the rest either flared out like the tail feathers of a peacock or slid over herself, around her hips, over her belly, in between her legs, down her substantial cleavage. She continued to grope herself as she kneels down and brought you down across her bent kneel. The pain came again as she bent you. She back arched as she stretched you out across her thigh, and her tentacles slathered around her upturned breasts and pulled at the top, as if they had their own thirst to satisfy.</span></div></div>",
            "created":1516907280,
            "id":2444798,
            "title":"She stretches out your body"
        },
        "111111313":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "...Mr. Belle grabbed the sides of your head",
                "...Mrs. Belle tugged at your heartstrings",
                "...Mr. and Mrs. Belle team up on you"
            ],
            "content":"<div class=\"\"><div> <span>\"Looks like you gathered some fans~\" the dragoness cooed, barely above a whisper, as she whispered into your ear. She pulled her head away from you and began to address the crowd.  \"Dear fans, we have a <i>very</i> special request for tonight!\" You could swear you saw her pat one of her back pockets, stuffing a few loose dollars deeper into it. \"A doting couple, Mr. and Mrs. Belle, wanted to personally show our lovely little fighter how big fans they are!\" She motioned opposite you, and sure enough, you saw two people marching towards the ring.<br>\r\n<br>\r\nThe man stood at 6' 10'', and seemed unusually buff for a rabbit. He looked like he could rip a watermelon in two with his hands alone. He appeared to be oiled up. Furthermore, he wore nothing but a red G-string, which showed off a bulge the size of your snout. As he marched towards you, he cracked his knuckles and twisted his head either way, emitting a pop-ing noise.<br>\r\n<br>\r\nThe woman stood at 6'8'', and looked like she spent the entire week cycling. Her legs were long and looked powerful, powerful enough to crush a watermelon with a single flex. Her face was covered in makeup. Eye shadow, blush, and cherry-red lipstick adorned her face She just wore a red bathing suit, which clung to her figure tightly, You could see every curve and muscle through her suit. You could even see a wedgie between her legs. Her breasts looked like they could also punch you into a knockout.<br>\r\n<br>\r\nYou couldn't understand why, but you felt a strange throbbing between your legs. You crossed your legs, hoping nobody would notice. The two hopped over the ropes and into the ring, and posed to the crowd, the man flexing and the woman running her hands over her curves. You felt yourself blush harder. You felt as hot as the other night, when the dragoness smooched you and Speedy showed up. The crowd cheered and whooped as the two posed, and the pair eventually stopped. The two marched up to either side of you, and looked down at you. They both seemed to carry a feeling in their stare. Not necessarily hungry for you, but something close to it.<br>\r\n<br>\r\nBefore you could consider the strange stares any further, the bell rang, and...</span></div></div>",
            "created":1494338940,
            "id":2316891,
            "title":"A double teaming rabbit couple"
        },
        "11111132":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Timmy, an 8 year old spotted kitty wearing a boy scout uniform",
                "Becky, an 11 year old fox dressed up like a cowgirl "
            ],
            "content":"<div class=\"\"><div> <span>You began having second thoughts after you saw Roy get wrapped up in a crushing bearhug, and whatever confidence you could've mustered disappeared as the match descended into Speedy carrying the colt off. You tried to leave before the dragoness called the match, but the rhino guard prevented you from going anywhere. After Speedy walked off, the dragoness motioned towards the rhino, signaling for him to move you into the arena.<br>\r\n<br>\r\nWho are you?</span></div></div>",
            "created":1487912400,
            "id":2281880,
            "title":"Follow another set of fighters"
        },
        "111111321":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Anubis, a male jackal boasting a flail and short tunic",
                "Sabrina, a female panther dressed in a skimpy nurse outfit"
            ],
            "content":"<div class=\"\"><div> <span>You're only 3'10'', counting your ears, and you had a spotted tail as long as one of his arms. You were forced to wear a vest most would find on a boy scout, though it's patches may not have been quiet appropriate for them (featuring: a silhouette of someone on all fours sticking their butt out, a silhouette of someone with a patch of lipstick on their cheeks, a silhouette of someone's legs poking out from under a bigger silhouette's butt, etc.). You wore a leather domino mask, probably to show off more of your timid face. Unfortunately, you were given no pants, forced to wear a pair of green underwear, the butt and groin of which poking out from under your vest.<br>\r\n<br>\r\nComing into the match, you weren't told a thing about what was going on in here, but seeing how that lion manhandled that colt made you decide no money was worth this. You tried to dart back, but the rhino kept his hands on you and scooted you towards the ring. You couldn't even hope to fight off his comparatively-titanic strength as he moved you towards the dragoness. When you got close enough, you realized there was no running. You tried to slide between the ropes, shaking as you felt the many eyes looking you up and down. <br>\r\n<br>\r\nYou got into the ring, visibly shaking before the towering dragoness, who smiled a smile that chilled you to your core. You felt your insides tying up in knots as she grinned at you. Her tail went behind you, and knocked you over onto your hands and knees. You heard her chuckle.<br>\r\n<br>\r\n\"Already presenting, twerp?\" you heard her taunt. The crowd cheered and whistled lewdly upon seeing you in such a compromising position. You felt your face burn up, and you started to get back on your legs, only to feel the dragoness sit on your back, keeping you on your fours. You squealed as you felt one of her fingers trace around your butt. \"You're gonna make a lot of people happy tonight, slut. Including me~\" She got off of you, and you got up to your feet. You felt like your face was on fire right now. The dragoness walked in front of you, making sure you were looking right at her defined butt, as she motioned for some other wrestler to come in.</span></div></div>",
            "created":1488171600,
            "id":2283076,
            "title":"Timmy, an 8 year old spotted kitty wearing a bo..."
        },
        "1111113211":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "He gives you a taste of Hell",
                "He gives you a taste of Heaven"
            ],
            "content":"<div class=\"\"><div> <span>Looking past the dragoness, the sight you spied left you gasping. Outside of the ring was a tower of a man. He must've been at least 8 feet tall. His fur was night black, though it did nothing to hide his rippling muscles. Someone could probably light a match on his abs! His biceps were bigger than your head, and his thighs could smash coconuts. In one hand, he had a flail as long as a yard stick. He wore eyeliner and an Egyptian tunic (specifically the skirt part) that ran down to just above his knees.<br>\r\n<br>\r\nHe climbed over the ropes, \"accidentally\" giving you a peek at his sandstone-colored thong, fantastic ass, and bulge three times the size of your fist. He marched over to you, batting the edge of his flail against the palm of his other hand.<br>\r\n<br>\r\n\"Fellow connoisseurs! Welcome to judgment day! On this day, our judge, Anubis, has come!\" the dragoness shouted as she motioned towards the jackal. The crowd cheered as Anubis maintained his stone-faced expression, batting the edge of the flail against his palm. \"And, here for judgment, Timmy!\" the dragoness declared, motioning towards you. The crowd began to erupt in a single chant...<br>\r\n<br>\r\n\"GIVE HIM HELL! GIVE HIM HELL! GIVE HIM HELL!\" the crowd chanted. They repeated the chant, and you quaked in place. You didn't know what that meant, but you were terrified. Anubis' piercing gaze did nothing to help. <br>\r\n<br>\r\n\"You're little face alone makes me want to send you to Hell,\" Anubis growled at you with a gravely voice. You audibly gulped with fear.</span></div></div>",
            "created":1488344400,
            "id":2284011,
            "title":"Anubis, a male jackal boasting a flail and shor..."
        },
        "11111132111":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Anubis keeps giving you Hell.",
                "Anubis shows you a bit of Heaven.",
                "Anubis gets some audience participation"
            ],
            "content":"<div class=\"\"><div> <span>The instant the bell rang, you felt a sharp pain across your face. Anubis smacked his flail across your face. He followed up with another smack in the reverse direction, smacking you the other way. You stumbled back in pain, grasping both of your stinging cheeks. While you were stumbling back, Anubis marched up to you, and kicked you right in the nose. You stumbled over your feet and fell on your back.<br>\r\n<br>\r\nYour vision went blurry for a moment, and cleared up in time for you to see Anubis standing over you. He lifted a foot over your face, and stomped down on you. You cried out as you felt your self sandwiched between the mat and his foot. He grinded into you, the crowd cheering on.<br>\r\n<br>\r\n\"HELL! HELL! HELL! HELL!\" the crowd cheered. Anubis' foot lifted up, and smashed into you once more. You cried out in pain. He lifted again, and stomped down again. He repeated, and each time he lifted his foot, you cried out for help. And each time, you were met with a crushing pain on your face. Tears poured from your eyes, and you swear you felt blood pour from your nose. You had no clue when the torment would stop.</span></div></div>",
            "created":1493999040,
            "id":2315208,
            "title":"He gives you a taste of Hell"
        },
        "111111321111":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Anubis swung again",
                "Anubis shows you some of Heaven",
                "Anubis stopped swinging, but you aren't out of Hell yet"
            ],
            "content":"<div class=\"\"><div> <span>Anubis grabbed you be the collar and lifted you up off your feet. You gagged as you felt you strained to breathe. He dropped his flail and grabbed an ankle, and spread it, leaving the crowd cheering and hollering. You heard further cheers for \"Hell.\" You felt your heart sink into your stomach at the realization of what Anubis was about to do to you. You looked over your shoulder at Anubis' unflinching face, silently begging for mercy. Anubis' face didn't show any change.<br>\r\n<br>\r\nHe lifted you up in the air, and slammed you onto his knee, and you instantly felt a flaming pain between your legs. You cried out in sheer agony at the pain. For a moment, it felt like you had split in two. Ho let go of you, and let you flop in front of him onto your chest. You clutched between your legs, gasping for air and crying. While you were bawling your eyes out, you heard the crowd cheering at the display of brutality. However, the sound of Anubis picking up the flail assured you that it wasn't over.<br>\r\n<br>\r\nYou tried to crawl away, but the jackal planted a foot between your shoulders, keeping you pinned in place. You tried to crawl out from underneath, but he kept up enough pressure to make sure you were going nowhere. You heard the crowd's cheering grow even louder. Behind you, despite the cheering, you could here some wolf whistling. You didn't know why, but in addition to the tears, you felt your cheeks burn up with embarrassment. Anubis adjust himself such that your rear was underneath his tunic, and he lifted his arm, ready to give you a thrashing you'll never forget.<br>\r\n<br>\r\nHe brought the flail down, and you instantly felt the pain of a lash on your rump. You squealed out in pain, more tears crawling down your cheeks. Your bottom was on fire. The crowd cheered at your pained squeals. Anubis lifted his arm again, and smashed it down on your rear again. And again, you squealed. <br>\r\n<br>\r\n\"Stop! Please!\" you pleaded. As Anubis lifted his arm again, you wondered whether he didn't hear you, or he just didn't care. Nobody else at this crazy club seemed to. Anubis brought down the flail again, sending forth another wave of piercing pain. You began to beg, plead for him to stop after that strike, and you were crying like mad. This time, Anubis seemed to stop for a moment. Your tears stopped for a slight moment, but you knew not to expect it to be over just yet.</span></div></div>",
            "created":1496379720,
            "id":2329538,
            "title":"Anubis keeps giving you Hell."
        },
        "1111113211112":{
            "author_id":"christ10",
            "author_name":"kiba",
            "choices":[
                "Submit (happy ending)",
                "Don't submit (he'll continue hell with a bearhug)"
            ],
            "content":"<div class=\"\"><div> <span>At first anubis is enjoying himself giving you hell,<br>\r\nBut as he takes a short break to oversee his handiwork he can't help but to look at your small frame curling into a ball.<br>\r\nGetting an idea he pick you up in his muscular arms, squeezing you firmly, but gently in a bearhug while kneeling down, you sitting on his large leg.<br>\r\nYou try in vain to break free, tears still fresh in your eyes, but you're simply no match against anubis' mighty body.<br>\r\nGiving up, you surrender yourself to another hell only to feel the jackals lips against yours and a large paw sliding in unber your shorts, grabbing and fondling your balls and dick, getting it hard within seconds.<br>\r\nBeing to weak to resist, you stay calm accepting the fact that anubis is degrading you for all to see...<br>\r\n\"I have a little offer for you little cub: submit to me, be my servant, my pet, my wrestling toy to do with as I see fit.<br>\r\nIn return for your loyalty I will provide, love and protect you as a good master...<br>\r\nOr We could always go back to the match, I'm just getting started giving you hell...<br>\r\nSo, what will it be?\"</span></div></div>",
            "created":1503336240,
            "id":2372452,
            "title":"A different judgement..."
        },
        "11111132111121":{
            "author_id":"christ10",
            "author_name":"kiba",
            "choices":[
                "Happily ever after"
            ],
            "content":"<div class=\"\"><div> <span>As you wiper out your weak surrender, you start crying in fear and shame, bringing laughter from the crowd.<br>\r\nThis in turn actually angers you new master.<br>\r\n\"QUIET. I WILL ACCEPT ANY DISRESPECT TOWARDS MY PET. AT LEAST HE HAD THE COURAGE TO ENTER THE RING,  WHICH IS MORE THAN I CAN SAY OF YOU!\".<br>\r\nWith that roar, the crowd goes silent, and anubis returns to the task at hand, stroking you off while whispering sweet nothings into your ear.<br>\r\nAfter a short while, you moan out as climax finally hits, releasing strings of white seed across the stage.<br>\r\n\"Such a good boy\". Anubis cooes into you ear. \"Now only one thing remains...\"</span></div></div>",
            "created":1505222640,
            "id":2384662,
            "title":"Submit (happy ending)"
        },
        "1111113212":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "She gives you a \"physical examination\"",
                "She teases you a little more"
            ],
            "content":"<div class=\"\"><div> <span>You peeked around the dragoness' hips and spotted who she was motioning towards. And the sight tied up your insides even more. Sauntering towards the ring was a panther, standing at 6'10''. She wore a nurse's outfit that clung to her body tightly. You could see the exact shape of her hips, the curvature of her stomach, and her nipples poking against the outfit. The top of her dress wrapped around just above her nipples, and the bottom wrapped around the upper part of her thighs, just high enough to show off her backside. Poking above the upper hole of her dress was a red bra, and poking beneath the lower part of her dress was a red thong. She wore cherry red lipstick, eye-liner darker than her black fur, and a bit of bluish blush. She was also carrying a purse with the red cross on it.<br>\r\n<br>\r\nShe got to the ropes, marching like she were there to show off instead of fight. She lifted a leg over the top rope, stretching it as far up as she could. She turned over to bow towards the audience, giving you a full view of her backside. You felt a funny feeling between your legs, and crossed one of your legs over the other. She turned around and sauntered towards you as the dragoness stepped away. <br>\r\n<br>\r\n\"Ladies and gentlemen, introducing the Clinic Cutie, the gal that'll make the last sleep feel like heaven, Sabrina!\" the dragoness shouted as she motioned towards the towering panther. \"And standing as her patient, the kitty cutie himself, Timmy!\" the dragoness shouted as she motioned towards you. You heard lots of cheering and chanting for Sabrina, who was eating all of it up. You, meanwhile, could only shake and quiver in her presence as she looked down on you with her green eyes, which you could barely see past her tits bigger than your head.<br>\r\n<br>\r\n\"Is your leg alright?\" Sabrina cooed out to you in an angelic voice. <br>\r\n<br>\r\n\"Wha-?\" you began to stammer out. You looked down, and remembered you crossed your legs. \"I-I'm fine.\"<br>\r\n<br>\r\n\"Hm...\" Sabrina hummed in false curiosity. \"You require a <i>thorough</i> examination,\" she said, coming closer. You tried to back away, but the panther put a hand on your shoulder, making you quiver even more. \"Now, be a good boy, and I'll make sure you get a <i>very</i> sweet treat.\"</span></div></div>",
            "created":1488258000,
            "id":2283529,
            "title":"Sabrina, a female panther dressed in a skimpy n..."
        },
        "11111132122":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "She has something more painful in mind",
                "She smooches you",
                "She has another idea in mind for you"
            ],
            "content":"<div class=\"\"><div> <span>You shuddered, not sure whether or not you liked this, though you felt like your groin was going to break your underwear. You shook off her hand and stumbled back, still trying to cover up your groin. You looked over, and still saw that smirk on Sabrina's face.<br>\r\n<br>\r\n\"Are you sure you're alright?\" the panther said, sauntering over to you. As you tried to back up, you tripped over yourself, flopping onto the mat. Sabrina quickly threw herself on top of you, pinning your shoulders down. Her breasts were hanging inches over your face, and you saw her lick her lips while keeping up that sultry look she had. You were too nervous to say anything. Sabrina reached down, grabbed one of your wrists, and brought your hand up to one of her breasts, making you feel up her massive bosom.<br>\r\n<br>\r\n\"Enjoying yourself?\" Sabrina asked in a flirty tone. You were sweating buckets, and you were sure your groin couldn't possibly get any harder. The panther leaned forward, burying you underneath her humongous breasts. She rubbed her chest left and right over you, and you blushed hard. You wanted to try and push her away, but you were nervous about touching her body. <br>\r\n<br>\r\n\"Goodness, you're burning up!\" she said, feigning shock. She brought her breasts off of you, exposing your embarrassed face to the crowd, who was whooping and hollering at the display in front of them. You saw her face starting to lean close.<br>\r\n<br>\r\nCloser... closer... closer...</span></div></div>",
            "created":1488996360,
            "id":2286573,
            "title":"She teases you a little more"
        },
        "111111322":{
            "author_id":"furrygrappler",
            "author_name":"FurryGrappler",
            "choices":[
                "A seriously sexy stallion with an entourage of doting mares",
                "It's a battle royale with...other kids?...and a bunch of adults outside the ring"
            ],
            "content":"<div class=\"\"><div> <span>You felt very vulnerable in your costume. It was an elegant get-up, a halter-top, a French-cut thong, and a wrestling mask of iridescent purple velvet, and black leather hat, vest, and chaps. Your clothes covered up a lot, except for the \"right\" spots. The thong also rode up your butt and was uncomfortable. You obediently made your way to the ring, because you saw what happened to the kids who resisted, but when you stepped onto the apron of the ring to enter the ropes, you ran face-first into the dragoness's bountiful bosom. You look up her, into a face full of a hunger you didn't understand. You wondered what you were doing wrong.<br>\r\n<br>\r\nThe dragoness pointed a long white finger tipped with a gold-painted claw towards the ground, then spun it around, signaling you turn around. You obeyed, turning to face a sea of eyes glittering in the dark outside the ring. The dragoness pressed her breasts into the back of your head, then gently took your arms. She guided your arms onto the ropes, spreading them out, and then her mouth tickled your ear. The dragoness whispered instructions to you through very hot breath.<br>\r\n<br>\r\n\"Show them what you got, girl,\" she said, \"spread those legs out, stick out your hips, and give them a twirl.\"<br>\r\n<br>\r\nYour heart was racing. You had no idea what was going on, but you daren't be insubordinate. You displayed your barely clothed nethers to the crowd, and you could see those eyes began to congregate together. You could make out the faces of some in that front row; a gaggle of male faces and one female face, all wearing that terrifying lustful expression the dragoness had.<br>\r\n<br>\r\n\"They want you, you little slut,\" The dragoness cooed. \"They want to bury their muzzles into that little cunt of yours. Too bad, because you're mine after the show. That thing you're doing now? I'm going to be doing it on your little face.\"<br>\r\n<br>\r\nYour heart sank into your groin. What have you gotten yourself into?</span></div></div>",
            "created":1487998800,
            "id":2282114,
            "title":"Becky, an 11 year old fox dressed up like a cow..."
        },
        "1111113221":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Cecil immediately went for the first attack",
                "Cecil's entourage grappeled with you"
            ],
            "content":"<div class=\"\"><div> <span>You turned around, and saw a crew of giant, costumed wrestlers approaching the ring. A crew? Wasn't it supposed to be one-on-one? How's that fair?<br>\r\n<br>\r\nLeading the crew was a mighty Clydesdale stallion. He had chocolate brown fur, and muscles to put most body builders to shame. He wore a pair of blue shorts with glittery star patterns on the sides. It seemed to be thin enough to fully show off all of his assets, from his extreme muscles to his firm buttocks to his apple-sized bulge. He wore nothing else, for better to show off his muscles that'd put any body builder to shame. Following him were 4 mares doting over him, staring at him dreamily. They looked practically identical to each other, save for their clothing. One wore a pink tank top and pink booty shorts. One wore lacy stockings, a black skirt, and a black lacy bra. One wore a red two-piece bikini. And one wore a Chinese outfit that showed off a lot of thigh and had a significant boob window. They all stared on dreamily at the stallion.<br>\r\n<br>\r\n\"Fellow patrons, tonight, we feature the predator: Cecil and his sluts!\" the dragoness boomed, motioning towards the horses. \"And taking the role of prey, our very own Becky!\" she said, motioning towards you. The crowd was cheering so loudly, you couldn't even hear the perverted suggestions of the crowd. You looked at Cecil with fear, shaking in place as he smirked at you.<br>\r\n<br>\r\n\"Ready for a little horse-ridin'?,\" Cecil taunted, his voice dripping with lust.</span></div></div>",
            "created":1488085200,
            "id":2282433,
            "title":"A seriously sexy stallion with an entourage of ..."
        },
        "11111132211":{
            "author_id":"furrygrappler",
            "author_name":"FurryGrappler",
            "choices":[
                "He drops you across his shoulders for a backbreaker",
                "He throws you across the ring."
            ],
            "content":"<div class=\"\"><div> <span>Cecil struts up to you, his powerful, thick thighs jostling with each step. He stops in front of you, and begins to display himself at you, He flexes his biceps and his pets. His muscles, oiled up beforehand to make them glisten, undulated with each movement. You didn't know why, but you actually liked seeing it, so much that you forgot that he was going to hurt you.<br>\r\n<br>\r\nThe bell rang, and Cecil grabbed you by the hair. You were snapped out of your trance, but when you tried to scream, Cecil's other hand wrapped around your muzzle. He roughly yanked you around to look at his mares, who were all visibly excited to see you in the same in ring as their man, waiting to watch him beat you up and kind of wishing they were in your place.<br>\r\n<br>\r\nCecil rasped in your ear with a voice breaking with primal urging. \"Like my herd, little brat? They love to watch me tear up little toys like you. It gets them wet. Tell me, brat, which one do you think is the hottest.\"<br>\r\n<br>\r\nYou didn't even have an idea what he meant by \"hottest,\" but you examined them. As you made our evaluation, you noticed that you could see their nipples poking through their flimsy shirts. After taking a moment, you gingerly pointed at the mare in the black bra and skirt.<br>\r\n<br>\r\n\"Yeah, she gets me hard too. After I knock you out, I'm going to hump her on top of you.\"<br>\r\n<br>\r\nYou suddenly flew up towards the ceiling. Cecil had grabbed you between the legs and hoisted you aloft, displaying his superior strength to his mares. The mares looked up at you with wide smiles and covering their mouths to giggle, eager for the violence to start.</span></div></div>",
            "created":1488085200,
            "id":2282581,
            "title":"Cecil immediately went for the first attack"
        },
        "111111322111":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "He starts to beat on you",
                "He gets a little frisky",
                "His entourage wants a piece of you"
            ],
            "content":"<div class=\"\"><div> <span>You were placed parallel to the his shoulders, and you began to worry what was in store for you. He wrapped his arms around your legs and your arms, leapt upwards, and crouched down when he landed, bending you roughly against his shoulders. You screamed out as your body bent like it wasn't meant to bend. The entourage were looking on dreamily, while Cecil grinned widely. He leapt up again, and bent you over his shoulders again. He then climbed up to the corner pole, you still over her shoulder, and then jumped, delivering a monstrous backbreaker.<br>\r\n<br>\r\nHe threw his shoulders to the side, tossing your writhing form to the mat. You kicked out weakly, trying to get to your feet, but you hurt too much. You watched Cecil walk over to you, towering over you, his terrifying smile glaring at you. You feared for what was next.</span></div></div>",
            "created":1488515400,
            "id":2284401,
            "title":"He drops you across his shoulders for a backbre..."
        },
        "1111113221113":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "...the mare in black shoves the one in red off",
                "...the mare in red wrestles the one in black off",
                "...Cecil calls both of them off"
            ],
            "content":"<div class=\"\"><div> <span>You were terrified. This tower of muscle easily overpowered you, and you were terrified of what else he'd do to you, You crawled away while Cecill threateningly stomped towards you, wearing a terrifying, hungry grin. However, you felt someone grab under your arms and pull you towards the ropes of the ring. Your vision was suddenly filled with the face of the horse wearing black. She wore an expression very similar to Cecil.<br>\r\n<br>\r\n\"So, y'like this, don't ya?\" she asked, cupping a breast with one hand. You were too terrified to answer back. The look on that woman's face made you feel funny, almost enamored. But if they enjoyed watching Cecil beat on you like that, you can't imagine what she'd want to do with you. \"Then why don't we get to know each other?\" With that, she positioned her black-clad rack in front of your muzzle, giving you a mere moment to contemplate what she was going to do. Her cleavage crashed down on your muzzle, and your entire face was swallowed up between them.<br>\r\n<br>\r\nYou screamed out and wildly kicked your legs. You tried to lift them up to the lady's shoulders to try and pull her off, but her sheer weight made that to hard for you. Worse yet, the mare wrapped her arms around your ankles, keeping your legs hoisted up to almost parallel with your body. It began to hurt, straining to keep your legs like this, but a dark chuckle from her made you shiver.<br>\r\n<br>\r\n\"Thanks for showing off for us, runt,\" she began. \"You're giving everyone a <i>great</i> view of that derriere of yours.\" To emphasize her point, she traced one of her fingers from your barely clothed crotch down to between your thighs. You shivered and thrashed about even more. You weren't surer what was worse, how she touched you, or your depleting air supply. It was starting to feel like it was burning up in her bosom.<br>\r\n<br>\r\n\"Hey! You can't keep that piece to yourself!\" you barely heard one of the mares say. The one in red huffed at the one on top of you, hands on her hips. <br>\r\n<br>\r\n\"Well too bad, she was interested in me, not you,\" the mare on top of you shot back.<br>\r\n<br>\r\n\"She just needs to get to no me better. Then she'd rather play with me!\" you heard the other mare say. She then began to try and push the mare above you off. However, the mare in black shoulder bashed the mare in red away. However, she returned and tried to shove her off again. Then...</span></div></div>",
            "created":1503249660,
            "id":2372022,
            "title":"His entourage wants a piece of you"
        },
        "11112":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "He makes the crushing feel worse",
                "Flip you so your butt is in the air while your face is in his junk",
                "Different position"
            ],
            "content":"<div class=\"\"><div> <span>Speed contracts his arms, crushing you against his massive pectorals.<br>\r\n\"Ahhh!\" you scream at the pain. There's a split second of relief, only for him to squeeze you to his chest again, coaxing another scream from you. He repeats this process. In the meantime, writhe in his grip, trying to wiggle out of his arms, kicking and flailing. You aren't getting anywhere. He's too muscular, any attack on him deflects off of his muscles, any wriggling may as not exist within his arms. He is still applying and relieving the pressure as he begins to talk to you.<br>\r\n\"You know you're stuck, you may as well give up.\" He says.<br>\r\n\"O-okay, I give, I give!\" you shout out towards the dragoness. The dragoness stares at you, then stifles a chuckle.<br>\r\n\"I say when the match is over. Not you, not muscle boy here, just me.\" Speed turns his attention back to you.<br>\r\n\"Too bad, you and I have a little more personal time together,\" he snarls, issuing an audible gulp from you.</span></div></div>",
            "created":1466312400,
            "id":2166696,
            "title":"Squeeze and demand a submission."
        },
        "111122":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Play with your butt",
                "Slam you onto the canvas",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You fear for your life, believing you're in for the squeezing of a life time. To your surprise, your world is suddenly turned upside down, literally. He flips you over, and next thing you know, you're inches away from his prominent bulge. He then moves his legs around your head, pulling you closer to his groin.<br>\r\n\"MMMMF!\" you scream, muffled by his groin. Meanwhile, Speed's been eyeing your backside and groin. He leans in, sniffing all over your swimsuit area. As his breath washes over your backside, you feel that tummy ache feeling on your groin get even worse. At this, Speed buries his nose between your legs, not sniffing this time, he was inhaling your scent. This sensation was driving you crazy, and you weren't even sure if you hated it. Suddenly, Speed's bulge grows against you, jabbing harder at your face than before. If it weren't for the thin cloth over his bulge, you'd be kissing his groin right now. \"MMMMMMFFFMMMMMMMF!\" you try to scream again, kicking in the air and worthlessly punching his thighs. <br>\r\n\"Quit acting, we know you're enjoying this,\" Speed tells you. While you were struggling in his grip, he noticed the effects of your apparent groin tummy ache poking into his chest. He bends his head down, delivering a kiss to a very inappropriately, yet clothed, spot.<br>\r\n\"MMMMMMFFFFF!\" you struggle harder than ever before, feeling so warm yet still feeling a chill run down your spine, and the crowd's cheering all the while, some whistling interspersed in the noise. Speed then gyrates his hips slowly, rolling his bulge across your face in a circular motion. He gyrates until he positions his bulge to lay on your chin, his nether regions pressed up against your lips. He kisses that inappropriate part again.  </span></div></div>",
            "created":1466398800,
            "id":2167070,
            "title":"Flip you so your butt is in the air while your ..."
        },
        "1112":{
            "author_id":"beatdown",
            "author_name":"Braun Beatdown",
            "choices":[
                "Move into a more painful grapple",
                "Move to a more humiliating hold",
                "Finish you."
            ],
            "content":"<div class=\"\"><div> <span>The sound of the bell had just barely hit your ear before you're lifted off the ground, a rush of pain running through your head. You struggle, but it's clear Speed has you just where he wants you: hoisted in the air by your short mane with one claw. You flail and try to bat him away, but he draws up his free paw and slams it into your chest.<br>\r\n<br>\r\nThen again, and again, and again. He pummels your chest, smacking into your ribs over and over again until you swore you could taste metallic blood in your mouth. He lifts you up higher, then pivots and slams you into the mat hard enough to bounce you up a couple times. You settle into the canvas, clutching your stomach and rolling just a little. Just when you've finally caught your breath, Speed leaps off the ropes behind you and delivers a crushing elbow drop that he chains into a grapple.<br>\r\n<br>\r\nHe's got your arms above your head, sitting on your legs with his muscular legs wrapped around you and his knees pressing into your back. A fraction of his strength is more than enough to agonizingly stretch you. He does this a few times over, then releases your arms to....</span></div></div>",
            "created":1358830800,
            "id":1514111,
            "title":"A brutal start"
        },
        "11122":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "More lap dance on your face",
                "Beating",
                "He gets off of your face"
            ],
            "content":"<div class=\"\"><div> <span>He flips you over so you were face up. The next thing you see is his shorts clad butt hanging over your face. He throws his legs out from underneath him, landing butt first on your tiny face. He grinds his ass on your face. You plant your hands on either cheek, trying to push him off of him.<br>\r\n\"Didn't know you swung that way,\" Speed taunts. He grabs both of your hands, pulling them up to his sides. \"Unfortunately, I don't appreciate someone getting fresh with me. I'M supposed to lead. How about I show you what happens when you take my roll&gt;\" He roughly grinds to one side. Then the other. Then the other. Then slams his but downwards on your face. The crowd is going wild over his butt dancing on your face. You can only cry. You try to yank your arms out of his grip, but Speed has an iron grip on you. You try to squirm out from under him, but he has you pinned down good. He then pushes his butt into your face harder than before, and you feel his butt cheeks starting to vibrate. \"Uh oh, I can feel my dinner starting to come back for revenge~\" Speed chuckles at your predicament. You here the crowd chanting \"Do it, do it, do it!\" You kick and struggle harder than before, only to take Speed's next attack full force.<br>\r\n*BRRRRAAAAPT<br>\r\nA terrible fart trumpets out of his ass and all over your face. He meticulously grinds his ass back and forth, grinding the stench into your face. He then stops moving his butt a bit, leaving you to fear what was coming next.</span></div></div>",
            "created":1466053200,
            "id":2165255,
            "title":"Move to a more humiliating hold"
        },
        "11123":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Go on to the next match as Roy",
                "Play as someone else"
            ],
            "content":"<div class=\"\"><div> <span>He turns you over, and the next thing you see, to your horror, is his open armpit descending onto your face. You try to crawl away, but it's for not. You're nose's struck by the sweaty musk of his armpit. He closes his arm around you, trapping you in hi armpit. You struggle against his grip as the crowd laughs at your predicament. As his horrible smell smothers you, you're struggling dies down, until eventually, you lose consciousness in his armpit.<br>\r\n<br>\r\nWhen you wake up next, you're on a bed, confused. You look over to the side and see the dragoness looking at you with a sultry look as she licks her lips.<br>\r\n<br>\r\n\"You took you're sweet time, boy,\" she says. You then realize one of her arms are draped across your chest, pinning you to the bed, despite your struggles. She chuckles. \"C'mon, didn't you want to finish what we started, cutie?\"<br>\r\n<br>\r\n\"S...Speed?\" you say. As you see her expression harden, you wonder why was that the first thing you said.<br>\r\n<br>\r\n\"Speed? Why's Speed on your mind when all of this...\" she runs her hand down her side, highlighting the curve of her breasts, hips, and rear. \"...is in front of you?\" You struggle even more under her. \"What has he done for you that I haven't?\" You see her eyes widen as a jolt of realization shoots through her mind. \"Oh... it isn't just the body you want.\" She positions herself so she's leaning over you, both hands by your hands, her breasts hanging over your head. You whimper in fear. \"You want someone to brutalize you.\" You're eyes widen in fear just as she crashes her breasts on top of you. You scream into them, only for her to roughly rock herself back and forth, pounding the sides of your head with her jugs. You're pretty sure she's bruising you with her technique. She finishes her multiple strikes with a downward thrusts, causing her breasts to shake to the side and clap around your face, causing you to scream in pain. <br>\r\n<br>\r\nShe pulls herself off you, seeing your sniffling, crying, bruised face. She chuckles.<br>\r\n<br>\r\n\"Now, am I on your mind?\" You can only sniffle in response. She places a finger on your chin and leans your head in such a way that she can look you in the eye. \"Don't tell me you're at your limit now, dear. The night's only started.\" She did... things to you. Things you wouldn't dare mention to anyone else.</span></div></div>",
            "created":1471928400,
            "id":2200283,
            "title":"Finish you."
        },
        "111231":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "...two muscular pumas (Sven and Michael) wearing zebra stirped shorts ",
                "...Renee, a kick happy rabbit wearing a red bikini"
            ],
            "content":"<div class=\"\"><div> <span>You had to take another deal. You had to make $500 again, and, though you didn't want to go back there, you had no choice. You were dressed up like you were before, except now your mask was re-sewn in such a way that it looks like you have a black eye. It was meant to be a permanent reminder of your previous defeat. As you approached, male and female audience members alike blew lewd whistles at you, a few making thrusting motions towards you, to your embarrassment. But the one that made you the most uncomfortable was the dragoness standing in the arena, looking at you with a sultry look.<br>\r\n<br>\r\nYou climbed into the arena, begrudgingly, hoping the dragoness would just leave you alone. When you got to your corner, she grinned at you, brandishing a lewd grin. She then put her microphone up to her mouth.<br>\r\n<br>\r\n\"Ladies and gentlemen! You wanted your favorite cowboy back. Well here he is! In this corner, we have our favorite little loser! Roy!\" she announced. You heard the crowd boo, and you heard some of them cheer to see you squashed and squeezed by whoever would fight you next. \"And in this corner...\" You looked towards the other corner, and saw... </span></div></div>",
            "created":1480222800,
            "id":2242737,
            "title":"Go on to the next match as Roy"
        },
        "1112311":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Sven grapples you for a humiliating experience ",
                "Michael tackles you down for a painful experience",
                "The two tackle you down together"
            ],
            "content":"<div class=\"\"><div> <span>You look on in horror as two pumas approach. The two climb into the arena. Those pumas weren't as buff as the lion you had to deal with earlier, but there muscles still intimidated you. The two had nice firm butts, arms as thick as logs, and firm pecs. The two seemed like perfect replicas of each other, except for their constricting shorts. They each had zebra stripe shorts, except one had white with black stripes, and the other had black with white stripes. The one wearing the white with black stripes was called Sven. The one wearing the black with white stripes was called Michael. The two looked down at you hungrily.<br>\r\n<br>\r\n\"W-wait. T-two of them?\" you stammered out. \"B-but I'm just one guy!\" The dragoness snickered at your distress.<br>\r\n<br>\r\n\"If you can't take the heat, stay out of the kitchen,\" she taunted. \"Besides, these two are your biggest fans.\" You shied away as the two approached you, seeming to try and coil around you like some sort of snake. \"Ever since they saw you deal with Speed, they wanted to take a crack at you themselves. How could you possibly deny them that?\" The two were standing on either side of you, you realizing you were level with their groins. They each squatted down to be eye level with you. You were blushing up a storm as they got closer and closer to you.<br>\r\n<br>\r\n\"Don't worry,\" Sven said as he stroked your cheek. \"I wouldn't hurt you. Unless you want me to.\" The other puma grabbed your other cheek and pulled you towards him.<br>\r\n<br>\r\n\"You won't have to ask me to hurt that pretty face,\" Michael said. The two were to close to you. You were so scared about what they could do.</span></div></div>",
            "created":1480222800,
            "id":2242830,
            "title":"...two muscular pumas (Sven and Michael) wearin..."
        },
        "11123111":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Sven continues to torment the little cub",
                "Michael wants a turn with the little cub now"
            ],
            "content":"<div class=\"\"><div> <span>You yelped as the buff panther grabs at you and purrs over you as he presses you up against his groin. He then gives your face a few licks, causing you to groan and squirm in his paws. Before you could do anything, he then slams you onto your back and shows off his covered rear to the cub.<br>\r\n<br>\r\n\"Hope you like what your seeing little one\" Sven would say before he squats down and starts to rub his covered butt up against your face. You groan a bit as a rank smell hits you as the buff feline kept rubbing his rear against you. Eventually, you hear a faint rumble before the feline grunts and lets out a rancid fart over your face. The feline sighs as he goes back to grinding your face against his covered rump, occasionally letting out one nasty fart after another as he keeps grinding his butt over your face.</span></div></div>",
            "created":1480741200,
            "id":2245093,
            "title":"Sven grapples you for a humiliating experience...."
        },
        "111231111":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "...Michael comes from behind to completely encase you",
                "...Sven goes for a different method",
                "...you struggled out of his grasp"
            ],
            "content":"<div class=\"\"><div> <span>After the horrid blast beat you, you weren't sure how much you could take. Before another blast hit you, Sven got up, and you took the time to quickly breathe in any fresh air you could. But you couldn't get any fresh air for long. He grabbed you by the hips, lifted you upside down, and held you up against him, your face going straight for his groin. When you got close enough, Sven wrapped his legs around your face, pulling you up close to his terrifying bulge. You heard him chuckle as you shook and thrashed in his humiliating grasp.<br>\r\n<br>\r\n\"Yeah, keep trying,\" Sven taunted. \"I love it when my opponents squirm like this.\" He started to rub his groin against your face, which prompted to make you thrash even more. Then...</span></div></div>",
            "created":1480741200,
            "id":2245098,
            "title":"Sven continues to torment the little cub"
        },
        "1112311111":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "The two felines keep tormenting you",
                "One of them grabs you and slams you down!"
            ],
            "content":"<div class=\"\"><div> <span>You groan and keep trying to paw away at the feline's covered bulge as you were still recovering from the stench from earlier. Before you could start slipping away, you felt something press up behind your head, making you gulp and look up, noticing the other feline was pressing his bulge against the back of your head. You blush and struggle more as you have both bulges rub up against you now, feeling a little bit of sweat as well as feeling the bulge push up against your head. You let out a muffled groan as you feel both of the felines chuckle at you as try to get out from between both of the growing bulges...</span></div></div>",
            "created":1480741200,
            "id":2245117,
            "title":"Michael comes from behind to completely encase you"
        },
        "11123111112":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "...Sven's face",
                "...Michael's fist",
                "...two butts"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>All of a sudden, Sven took his arms off of you, leaving you with Michael. He lifted you up, before slamming your back onto the wrestling mat. Your vision went blurry from the slam. After regaining your senses, the next thing you saw was...</span></div></span></div>",
            "created":1480741200,
            "id":2245126,
            "title":"One of them grabs you and slams you down!"
        },
        "111231111123":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "One of them gets up finally and attacks you again!",
                "The two continues to torment you with stench!"
            ],
            "content":"<div class=\"\"><div> <span>You woke up to see both of the covered butts sitting over your face, causing you to panic and push up against the two. You then get blasted by two horrid farts as the felines start to unload onto you. You cringe deeply and keep pushing the rear ends as you start to weaken more as you hear the two above you chuckle at your predicament. The farts continue to fill up around you and you keep pushing the butts off, trying to get some fresh air into you as the thick fumes keep filling up around you.</span></div></div>",
            "created":1480741200,
            "id":2245133,
            "title":"...two butts!!!"
        },
        "1112311111232":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "The two maintain the cycle",
                "The two go for a different tactic",
                "You struggled out of their grip"
            ],
            "content":"<div class=\"\"><div> <span>Michael got off of you, and you thought you could finally get a break. Except this just gave way for a horrible double tame. Sven sat fully over your face, and Michael was poised right near your stomach. He punched you in the stomach, leaving you winded. Then, as if planned, Sven farted. You couldn't not breathe, on account of Michael leaving you winded. After you begrudgingly sniffed up the fumes, Michael punched you in the stomach again, and Sven farted on you again. You realized the pattern that was going on. If you couldn't escape, you were doomed to a horrible cycle.</span></div></div>",
            "created":1480741200,
            "id":2245138,
            "title":"The two continues to torment you with stench!"
        },
        "11123111112323":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "The cub goes for an attack on a feline",
                "The feline catches him off guard and torments him again!"
            ],
            "content":"<div class=\"\"><div> <span>Despite the horrible stench that keeps filling up around you, you somehow managed to slip out of their grip and crawl towards one of the turnbuckles. The felines look over at the cub in shock and chuckles again before one of them gets up and starts to head over to the weakened cub. The cub then notices the feline getting closer and tries to slip away from keep, trying to take in some fresh air while also trying to get rid of the stench off of him.<br>\r\n<br>\r\nThe cub needs to come up with a plan before he becomes a kitty toy again!</span></div></div>",
            "created":1480741200,
            "id":2245143,
            "title":"You struggled out of their grip!"
        },
        "111231111123232":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Sven",
                "Michael"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Gotcha!\" the puma shouted as he wrapped around you. Which puma caught you?</span></div></span></div>",
            "created":1480741200,
            "id":2245163,
            "title":"The feline catches him off guard and torments h..."
        },
        "1112311111232321":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "The feline continues to torment the cub",
                "The cub manages to break away from the feline again"
            ],
            "content":"<div class=\"\"><div> <span>It was Sven, and he seems to have you in his arms. He pulls you into his arms and up against his sweaty chest as he starts to make out with you. You whimper at this and try to struggle away as the smelly and sweaty feline keeps making out with you as he keeps rubbing yourself up against his chest and bulge. The other feline chuckles and rubs on his own bulge as he keeps watching his twin brother make out with a struggling cub.<br>\r\n<br>\r\nThe cub pushes hard against the bulge, trying to get himself away from the sweaty feline.</span></div></div>",
            "created":1480741200,
            "id":2245171,
            "title":"Sven!"
        },
        "11123111112323212":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "...Sven got his hands back on you",
                "...Michael got his hands on you",
                "...the two get their hands on you"
            ],
            "content":"<div class=\"\"><div> <span>While Sven made out with you, you heard the crowd cheer, whoop, and shout rude names at you. You needed to get out, ASAP. You struggled, craned, and tried to escape. After much worming and squirming, you made Sven lose his grip on you. You tried to run away from the two, while the crowd booed at you. Eventually...</span></div></div>",
            "created":1480741200,
            "id":2245225,
            "title":"The cub manages to break away from the feline a..."
        },
        "111231111123232121":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "Sven gets more intimate and smelly with the cub",
                "Michael wants a turn with the little cub now"
            ],
            "content":"<div class=\"\"><div> <span>You yelp as the Puma from before grabbed a hold of you again and started making back out with you, forcing you against his sweaty body again. You groan and try again to push away from the sweaty feline as you push against his sweaty stomach and bulge. A rank smell hits on you as the feline holds you closer to him as his brother got up closer and watches the two, rubbing his own bulge again as he watches.</span></div></div>",
            "created":1480741200,
            "id":2245232,
            "title":"Sven got his hands back on you"
        },
        "1112311111232321212":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Sven pulled Michael away from you",
                "Michael hurts you more",
                "The two double team you"
            ],
            "content":"<div class=\"\"><div> <span>\"You've been hoggin' him long enough!\" Michael shouted. He yanked you out of Sven's grip, holding you close to his body. <br>\r\n<br>\r\n\"I wasn't done!\" Sven shouted as he tried to tackle Michael. The puma holding you dipped out of the way, causing his partner to tackle empty air. He roughly slammed you onto the floor before dropping his full weight onto your stomach. You gasped out, and Michael stuffed a finger in your open mouth, forcing it open. He adjusted himself such that he could roughly kiss you himself. His kissing session was a lot rougher and more painful than Sven's. You were squirming and kicking at this, and Sven was close by. </span></div></div>",
            "created":1480741200,
            "id":2245242,
            "title":"Michael wants a turn with the little cub now"
        },
        "11123111112323212123":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "The two felines keep tormenting you",
                "You manage to slip out from between the two"
            ],
            "content":"<div class=\"\"><div> <span>You attempt to get away from both of the felines, only to feel the other feline get up behind you and start to lick up against the back of your ears. You moan over Michael's tongue as you felt both of the sweaty felines rub up against you, pushing their sweaty chests and bulges against you as your stuck in place, trying to get away as the two keep making out over you roughly.<br>\r\n<br>\r\nYou groan as the two tighten up more on you as you feel a lot more sweat drop onto you while feeling the bulges squish up against you painfully.</span></div></div>",
            "created":1480741200,
            "id":2245250,
            "title":"The two double team you"
        },
        "111231111123232121231":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "They make you pass out",
                "They go for another attack",
                "You struggle out"
            ],
            "content":"<div class=\"\"><div> <span>The two stop licking you. For a moment, you thought you were finally safe. Only to be proven wrong when the two move you around, putting your head between Sven's legs. He held you in place, and you saw Michael line up his bulge with you. You could only scream as you watched him descend into you. You were trapped between the two pumas' groins, and they did not want it to stop there. The two squeezed together as hard as possible, making sure the sent of their groins was all you were smelling, if you ever got a chance to breathe at all.<br>\r\n<br>\r\nThey were trying to smother you!</span></div></div>",
            "created":1480741200,
            "id":2245292,
            "title":"The two felines keep tormenting you"
        },
        "1112311111232321212311":{
            "author_id":"rossthefox",
            "author_name":"Rossthefox",
            "choices":[
                "The two felines were still near you",
                "A new opponent is in the ring with you!"
            ],
            "content":"<div class=\"\"><div> <span>You continue to keep pushing up against the bulges of the felines as the smell keeps filling up around you, making you squirm harder. Eventually, you start to weaken up and started to squirm less and less with the felines. Soon you black out as the feline's bulges push up against your face as you start to black out.<br>\r\n<br>\r\nWhenever you wake back up, you were back in the ring and after looking around for a bit...</span></div></div>",
            "created":1480741200,
            "id":2245315,
            "title":"They make you pass out"
        },
        "111232":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Ron, a 10 year old squirrel boy in a green leotard",
                "Sabrina, a 12 year old raccoon dressed like a maid"
            ],
            "content":"<div class=\"\"><div> <span>You looked on in fear as the young horse was brutalized in front of the crowd. Tiny guys like you were going up against giant super-beings like these? No thanks! You tried to run away, only for a rhinoceros to grab you by the arm and yanked you towards the arena. He lifted you overhead, and tossed you onto the arena.<br>\r\n<br>\r\nBefore you're opponent is revealed, who are you? </span></div></div>",
            "created":1485666000,
            "id":2270657,
            "title":"Play as someone else"
        },
        "1112321":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Stevie, a fat, brown-short wearing pig seemingly 10 time your size",
                "Sheera, a leather-wearing gazelle with a butt bigger than your head"
            ],
            "content":"<div class=\"\"><div> <span>You scrambled onto your hands and knees and lifted yourself up, unintentionally showing your wedgie to the crowd. You're a thin squirrel boy dressed in a rubbery green leotard, shining under the lights. You wore a yellow-green mask with lipstick kiss patterns on the cheeks. You wanted to get far away from the arena, but the dragoness tail kept you in place. She leaned back to look at your rear, and you could hear her lick her lips. She leaned close to your ear.<br>\r\n<br>\r\n\"Why don't you see me after the match,\" she whispered in a sultry tone, her breath tickling you and making you freeze up. \"Roy won't have to know~\" She chuckled and walked to the center of the arena, about to reveal your opponent.<br>\r\n<br>\r\nWho is your opponent?</span></div></div>",
            "created":1485666000,
            "id":2270659,
            "title":"Ron, a 10 year old squirrel boy in a green leotard"
        },
        "11123212":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Sheera immediately began to kick",
                "Sheera starts by \"playing\" with you",
                "Sheera moves to smother you"
            ],
            "content":"<div class=\"\"><div> <span>The dragoness motioned towards the other corner, revealing a terrifying sight for you. On the other side of the arena was a gazelle, who easily tripled you in terms of height. She was wearing no boots, perhaps for better to stomp on some poor sap with her hooves, and on her torso, there were just a punch of brown leather straps wrapped around her chest, shoulders, and back. The straps covered up her nipples, but they were thing enough to show off a bit of areola. She wore a brown leather jacket over her, which seemed to only cover her shoulders and back. Some more leather straps covered her groin, but simply wrapped around her buttocks. Speaking of, probably her most striking feature was her butt, which you figured could easily swallow up your head. Her fur was orange and white, everything from her butt to under her chin was white, while the rest was orange. She also had short horns on the top of her head. She glared down at you like one would glare at trash.<br>\r\n<br>\r\n\"In this corner, we have, Sheera!\" the dragonesses declared, motioning towards the gazelle, who was leaning back on her corner. The crowd cheered at her announcement, sure that this lady would put on a good show for them. \"And in this corner, we heave, new to the circuit, our cute little Ron!\" the dragoness declared as she motioned towards you. The crowd booed, and you heard a few of them say \"Feed 'im some hoof!\" You winced at the hostility, and were even more determined to run. <br>\r\n<br>\r\nThe dragoness walked back to your side and motioned you over to the center of the ring. You wanted to stay far away from her, but the dragoness wasn't letting you get away with that. She planted a hand on your shoulder and started to move you towards Sheera, who still wore that unhappy expression. You two were positioned three feet away from each other when the dragoness left the ring. She hit the bell, and the match was on. </span></div></div>",
            "created":1487826000,
            "id":2281240,
            "title":"Sheera, a leather-wearing gazelle with a butt b..."
        },
        "111232121":{
            "author_id":"furrygrappler",
            "author_name":"FurryGrappler",
            "choices":[
                "She tramples you",
                "She sits you up in the corner and gives you a stinkface."
            ],
            "content":"<div class=\"\"><div> <span>The bell's ring barely left your ears when a blow in your side sent you flying. You tumbled as you hit the ground, spinning wildly before you stopped under the ropes. Your chest was frozen in agony, unable to expand and draw in breath from a flash of pain in your ribs. Your mouth hung open is a silent scream.<br>\r\n<br>\r\nThe gazelle turned away from you, her long legs elegantly swinging around. She slid out of her jacket slowly, sensuously, drawing a bevy of whistles and whoops from the crowd. Tossing her clothing aside, Sheera turned back to you and approached, making deliberately long strides toward your unmoving body tangled in the ropes. You couldn't even will yourself to help as Sheera spread her legs to stoop down and grab you by the hair. Wordlessly, she stood you up. She was deceptively strong, effortlessly propping you up in the corner. Sheera stooped over again, and put her breasts against your crotch. Despite your pain, you suddenly felt your heart beating in your shorts as she dragged her bosom from your groin, up your stomach, over your chest, and onto your face. Your vision goes dark as Sheera's breast blind you and pin you against the corner. You thought it was fantastic...until something big thrust into your belly.<br>\r\n<br>\r\nSheera had driven her knee into your stomach. As she trapped you against the corner, your face wedged tightly into her cleavage, her big legs snapped into your body repeatedly. The blows were hard and forceful, so that the entire ring shook with each impact. She kept hitting you until geysers of your saliva were spurting out from between her tits, and then it got worse. Sheena stepped back and started delivering full length kicks, straight kicks, hook kicks, side kicks, axe kicks. She hit you in the belly, the chest, the face, and between your legs. It was all happening so fast, and with such precision and grace, that your brain took three more kicks to tell you where the first one even hit you.<br>\r\n<br>\r\nA hoof pressed into your throat. It was a common move to choke someone in the corner with your foot, but where most wrestlers needed the ropes to steady themselves, Sheera didn't need them. Her sense of control over her body was so perfect that she simply stood on one leg as she strangled you with the other, and that actually made it worse because she was putting all her weight into her choke. You gagged as you were lifted off of the ground, your own feet flailing as you weere held aloft. Right when you were beginning to black, you noticed that your groin had exploded, not with pain, but with fantastic pleasure, and your trunked began to feel wet, hot, and slick.<br>\r\n<br>\r\nYou saw Sheera look down at your crotch. \"So, that's what you are into, you gross little brat,\" she sneered. You had no idea what she was talking about, but you didn't have long to wonder before both of her feet slammed you between your flat pecs in a drop kick. She gracefully flipped backwards onto her feet, and you collapse in a heap in your corner. You want her feet slide towards you, unable to see anything else as she towers over you.<br>\r\n<br>\r\n\"Let me show you what I am into,\" she said.</span></div></div>",
            "created":1487826000,
            "id":2281359,
            "title":"Sheera immediately began to kick"
        },
        "1112321211":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "She roughly headbutts you",
                "She's feeling a little more merciful",
                "You try to get away from her"
            ],
            "content":"<div class=\"\"><div> <span>While you were sprawled out, Sheera wasted no time in getting to work on you. She quickly slammed her slate-like hoof onto the wet spot in your trunks, immediately forcing you to cry out in pain. She then stood on that one foot, forcing all of her weight against your groin. You continued to cry and whimper in pain, and the crowd ate up your distress. Sheera swung her foot forward, and stomped onto your chest hard. You thought for a moment your ribs might've broken from the stomp.<br>\r\n<br>\r\nShe got off of your groin and stood on you chest. She stomped in place, repeatedly bashing your chest while you grit your teeth in response. She stopped stomping on your chest for a moment, only to stomp on your face. She repeated a few moments, and you were sure you were started to taste something metallic. She gave you one final stomp before gracefully back flipping off of you. After that, you parted your lips a bit, letting a tooth fall out. You weren't sure if you could stand after her assault. You tried to get up using your arms as leverage, but your chest hurt too much.<br>\r\n<br>\r\n\"God, it's like you can't even stand without me,\" Sheera muttered, venom dripping from her voice. She grabbed you by the throat and sharply got you onto your feet, paying no mind to your squeals of agony as she stood you up. You reached for your chest and tried to rub the pain away, but the slightest touch only made it hurt more. Sheera turned your head such that you were looking into her eyes.</span></div></div>",
            "created":1488085200,
            "id":2282751,
            "title":"She tramples you"
        },
        "1112321212":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "You endured more of her stinkface",
                "She leaves the corner, using her glutes to drag you with her",
                "She got off of your face "
            ],
            "content":"<div class=\"\"><div> <span>You weren't sure what to focus on more: the writhing pain in your chest, the slick feeling in your pants, or Sheera towering over you. She grabbed you by the shoulder and hoisted you onto your butt, positioning your back against the corner pole. She put a hand under your chin and held hoisted your head upwards to look up at her. You could only watch as she turned around, and your view was obscured by her ginormous butt. She hoisted her tail upwards, leaned back, and sat against the corner, sandwiching you between her and the pole. She kept leaning back until your head was firmly swallowed up by her ass.<br>\r\n<br>\r\nBefore you could stop her, she started rocking her hips side to side, rubbing all over you. The crowd cheered as Sheera ground against your face. You reached up to try, in vain, to push her butt away, but Sheera grabbed your wrists and pulled them far to the sides. You were completely helpless as Sheera ground into you, and the crowd loved it. You weakly kicked your legs and tried to get some footing, but Sheera's efforts kept you in check. <br>\r\n<br>\r\nIt wasn't long until you felt yourself beginning to black out. You couldn't catch a lick of oxygen as the gazelle rubbed against you. </span></div></div>",
            "created":1487826000,
            "id":2281401,
            "title":"She sits you up in the corner and gives you a s..."
        },
        "1112322":{
            "author_id":"furrygrappler",
            "author_name":"FurryGrappler",
            "choices":[
                "A sinewy female cobra referred to only as \"The Strangler.\" ",
                "The rhino bouncer wants a bigger piece of you."
            ],
            "content":"<div class=\"\"><div> <span>Barely cracking five-feet tall, your willowy frame is adorned by a black and white frilly French maid's costume. The top was a small bodice that exposed your taut belly, and would have supported and displayed an impressive cleavage if only you had the breasts to fill it out.  Your skirt was shirt, just enough to cover your butt and not nearly enough to cover the garters holding up a pair of white stockings embracing your legs. You also wore a mask to match the outfit, almost like a gala mask that was black, lined with a white lace, and let a luxurious waterfall of hair, dyed bloody red for the fight, fall around your shoulders.<br>\r\n<br>\r\nThe dragoness leaned back on the ropes to examine you, peering at you over her overripe bosom. You could see two points growing under her stripped referee's top from the end of each bulbous breast. \"You wear that well,\" she cooed at you in a thick, low voice that caused your legs to go cold. \"I have half a mind to just wrestle you myself. I would love to feel you squirm underneath me.\"<br>\r\n<br>\r\nYou scamper backwards into the ropes. People could actually see your heart race, the lace around your neckline shuddering with each beat. The dragoness's demeanor, words, and tone of voice terrified you. You thought she might kill you by the force of her presence, yet, in the back of your mind, if she did come over, strutting those strong legs toward you to do you harm, you don't think you would want to stop her. Your beating heart began to feel a little sick as the dragoness turned around, deliberately displaying her large, round butt saran-wrapped in daisy dukes at you as she called in your opponent.</span></div></div>",
            "created":1486098000,
            "id":2272920,
            "title":"Sabrina, a 12 year old raccoon dressed like a maid"
        },
        "11123221":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "She immdietaly wrapped around you",
                "She steamrolled over you",
                "She slammed breast first upon you",
                "She slammed rear first upon you"
            ],
            "content":"<div class=\"\"><div> <span>Outside the ring, you saw a freaky figure approach. You saw a very snake-like appearance from her waist down, a ruby-red tail covered in scales, with black rings dotting the back of it. Strange thing about the tail, despite her lower half being just a tail, you swear you could see the curvature of a pair of hips and a sizeable rump approximately where her rump'd be if she had legs instead of the tail. If she had normal legs, that backside could easily hoist you up by the snout if she simply clamed her glutes around your muzzle. There didn't appear to be any anus, just the curves for a rear. Above her waistline, she had a more humanoid upperhalf, a torso covered in red scales sporting a pair of arms. They appeared fairly muscle-y, and sported a pair of sharp nails painted black, which appeared to be about an inch long on each finger.<br>\r\n<br>\r\nSoon, the cobra appeared at her corner, and stood up, revealing her front. Her underside sported scales of a lighter shade of red, as well as a sizable bust that could completely envelop your head if she leaned down upon you. Each breast was held back by a sky-blue bra, which almost appeared thin enough for you to see the flesh hidden beneath the bra. Each fabric is held up by a gold colored string, which wrap over and under her shoulder, attaching it back to her bra. And above the breasts, you saw a snake-like head, which boasts a predatory gaze, though something about this predatory gaze didn't feel like they were hungry for food. You couldn't quite tell what they were hungry for, though. A set of snake-frills hung from the sides of her head, making her appear even bigger than she really was. And she was still pretty big. Her tail was thicker than you were big, her torso was also pretty muscular and large enough to fit the tail, and, counting her tail, she'd probably be 6.5 times as long as you are tall.<br>\r\n<br>\r\n\"Ladies and gentlemen! Introducing tonight's match, we have the snake vs. its mousy little prey!\" the dragoness began. \"It's 'The Strangler' vs. our dear maid here!\" As she spoke, she motioned to the snake and to you respectively. \"Will our cleaning critter make it out alive? Or will she be only another rat to fall to The Strangler's gallows?\" She suddenly leaned in real close to you, and spoke only loud enough for you to hear. \"Y'know, I heard a snake can eat a raccoon,\" she teased. Unbeknownst to you, actual eating wasn't allowed her, though you still felt your heartbeat double in time.<br>\r\n<br>\r\nWith that final taunt, the dragoness stepped out of the ring, and you were left trembling before the giant snake in front of you. You were so scared, you let out a \"yip\" in shock when the bell suddenly rang out, signaling the start of the match.</span></div></div>",
            "created":1521967260,
            "id":2469289,
            "title":"A sinewy female cobra referred to only as \"..."
        },
        "11123222":{
            "author_id":"furrygrappler",
            "author_name":"FurryGrappler",
            "choices":[
                "He likes to bodyslam",
                "He likes to punch."
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, boss, I wanna have this one.\"<br>\r\n<br>\r\nThe voice of the rhino who had intercepted when you had tried to flee came from behind you from outside the ring. He had been eyeballing your tail while the dragoness was lusting after you, and he was liking what he was seeing.<br>\r\n<br>\r\n\"Really, Brutus? Thought you liked your toys a bit older,\" the dragoness retorted, not looking away from you.<br>\r\n<br>\r\n\"Yeah, but I have a thing for French maids, and this brat is pushing all my buttons.\"<br>\r\n<br>\r\n\"Sure, have at her. I like seeing you work.\"<br>\r\n<br>\r\n\"Move, bitch,\" Brutus barked at you. You scrambled away from the ropes until you collided with the dragoness. The dragoness grabbed you by the shoulders, keeping you in place as the big rhino loomed into the ring. He was seven feet tall, four feet wide, and arms and legs as thick as your body. Brutus peeled off a wifebeater, revealing his pecs as two thick, glistening slabs of meat. He had a gut, but it didn't jiggle as he removed his shirt, because it was not fat, but muscle. Brutus swung his arms, his pectorals undulating with indescribable power.<br>\r\n<br>\r\n\"He's going to hurt you, babe, and I'm going to love every minute of it,\" the dragoness cooed in your ear before shoving you at Brutus. You trip over your feet, causing you to face plant into the brick wall pretending to be Brutus's belly. You fall to your knees in front of Brutus, and you look up at him to see his slamming a fist as big as a cinder block into his other hand.<br>\r\n<br>\r\n\"I prefer my bitches with big tits, but you'll do,\" he growled through an evil smile. \"I'll show you why.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1486184400,
            "id":2273349,
            "title":"The rhino bouncer wants a bigger piece of you."
        },
        "112":{
            "author_id":"beatdown",
            "author_name":"Braun Beatdown",
            "choices":[
                "A no-holds barred beatdown",
                "Tug on your heartstrings some more",
                "Smother torture."
            ],
            "content":"<div class=\"\"><div> <span>You lay your eyes on your opponent and find your stomach tumbling again. The anthro cat Felicia stands easily two heads higher than your scrawny form and her curves make her look more at home on the runway than on the canvas. The wad of latex rubber stretched over her body in the shape of a one-piece swimsuit served only to accentuate her already un-missable hourglass figure and was tight enough to show off her erect nipples through the top, which she was happily circling with one claw while she eyed you. The vicious dragon added a special, erotic twinge to her name when she announced her as your opponent. <br>\r\n<br>\r\n\"And in other corner, we've got our little cowboy Roy! Isn't he adorable? Isn't he Felicia?\"<br>\r\n<br>\r\nYour opponent looks you up and down before she chains an excited hiss into a mad fit of laughter, and she's soon joined by the rest of the warehouse; they're all laughing at how pathetic you are compared to Felicia. Despite your horror at the sight of this gorgeously vicious vixen, the ref forces you closer with a slap of her thick draconic tail. You stumble forward into the blinding lights and the overwhelming laughter at that. <br>\r\n<br>\r\nBefore you can adequately get your bearings, the sound of the bell bounces through your rattled little brain and you're pounced on by Felecia. Her titanic funbags smash against your face like a pair of lead weights and send you sprawling backwards on your hooves into the ropes, where she quickly pins you with one claw on your throat. <br>\r\n<br>\r\n\"We're going to have fun,\" she hisses in your ear, \"and it's gonna be a hell of a show.\"<br>\r\n<br>\r\nWhile you buck and cry and try to break her iron grip, she takes the opportunity to snap at your neck with her cherry-red painted lips. She plants a hard kiss on your tender throat, sucking as hard as she can until she's left a sizable hickey. All the while, all this stimulation is driving your confused body and mind wild. Your heart is beating a mile a minute, your stomach is twisted like a pretzel and worst of all you're not even sure if you don't like it.<br>\r\n<br>\r\nFelecia <i>knows </i> she does, though.\"Now let's get started....\"</span></div></div>",
            "created":1353819600,
            "id":1475394,
            "title":"A Kitty She Ain't"
        },
        "1121":{
            "author_id":"beatdown",
            "author_name":"Braun Beatdown",
            "choices":[
                "She keeps wailing on you, remorselessly.",
                "She switches to using her tits to humiliate you",
                "Audience participation?"
            ],
            "content":"<div class=\"\"><div> <span>A perfectly pedicured white paw flicks upward, you try to follow it, but you can't keep up and you're unable to block it as it flies between your legs and knocks your tiny grapes into your throat. The force of her groin kick actually lifts you up off the ground, where she effortlessly holds you on one leg, before quickly switching and kicking you with the other. She flicks back and forth, kicking you with a total of five nut-busting kicks before dropping you. <br>\r\n<br>\r\n\"Oops, I think I gelded him,\" Felicia laughs. The cheering grows louder.<br>\r\n<br>\r\nAgony overwhelms your body and nausea fills stomach, you're unable to stop yourself from puking all over the map. Felicia's  paw presses against your head, pushing it into your pile of vomit and smearing your muzzle into it before she delivers a hard right kick into the side of your head, sending you tumbling towards the ropes.<br>\r\n<br>\r\nCheering rings in your hears, accompanied by the low, hissing laugh of Felicia as she approaches you. You bring yourself up to your knees, still clutching your battered balls, before she grabs you by your shoulders and forces you, belly first into the pole. Using her long arms to hold you down, she repeatedly smashes her knee into your ass until you could feel your tailbone throbbing. <br>\r\n<br>\r\nShe leans in, putting her chin on your shoulder and whispers, \"Don't lose that spunk yet cowboy, we've still got plenty left to do for the show...\"</span></div></div>",
            "created":1358830800,
            "id":1514119,
            "title":"A no-holds barred beatdown"
        },
        "11213":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "You escape",
                "You're subjected to more audience participation",
                "Felicia pulls you back in the arena"
            ],
            "content":"<div class=\"\"><div> <span>She flips you such that your head was upside down and your butt was hanging in the air. You were still facing the audience when she picked you up and hanged you on the other side of the nearby wires. Your head was left crooked on the edge of the wrestling arena.<br>\r\n\"Hey everyone, check out this cute little butt,\" Felicia said to some nearby crowd members. You watch a giddy leopard girl skip up to you. Her groin is level with your face and her head was lever with your stomach, but she was staring up at your butt. \"Lemme help you there~\" Felicia stretches your legs down so far, she was now eye level with your butt, you howl in pain, feeling like your tailbone's going to split. The leopard girl gripped each butt cheek, kneading them as if she were kneading dough, stirring that same confused feeling in you. She then buried her nose into your asshole, motor boating your rear, causing you to keep trying to flail out of Felicia's grasp, resulting in a fit of laughter from the crowd. The leopard pulls herself out from between your cheeks, giving your ass a smack.<br>\r\nBefore you can recover from the strange feeling, you see a horse approach, wearing shorts way too small for him. You were eye level with his extreme bulge, and the horse was level with the underside of the third wire, looking down at your butt. Felicia offers the horse your legs so he can play with you a bit.<br>\r\n\"Naw, I want his face right there,\" he says to your confusion and horror. Felicia adjusts your legs so only your butt is brought up to his level while you stayed level with his groin. The horse grabs the top wire, and hops up so his bulge was resting on the edge of the arena, stuffing it in your face.<br>\r\n\"MMMMM!\" you scream, muffled by the horse's musky groin. He convulses, apparently tickled by your shouting. He brings his face to one of your butt cheeks, biting one of them. You squirm even more, unintentionally grinding yourself against the groin. One moment, his groin would be blocking your air flow, the next you'd be breathing in his toxic groin sweat. After biting your ass, he leaves a trail of kisses across your cheeks, sticking his nose between your cheeks and sniffing (causing another stirring in your stomach). He pulls his face away from your butt, rhythmically dry humping your face. You hear cheering interspersed with the laughter of the crowd. The horse turns around, and lets out a quick fart to your face, leaving you gagging. You don't know how much more of this you can handle. You keep trying to wrench yourself from Felicia's hold.</span></div></div>",
            "created":1466053200,
            "id":2165363,
            "title":"Audience participation?"
        },
        "1122":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Flips you over, leaving your back face up",
                "Painful stomping",
                "Hoists you into the air"
            ],
            "content":"<div class=\"\"><div> <span>Felicia moves her hands to pin down your wrists. She moves her head down to your chest, planting more kisses, causing you to struggle even as hard as you could, not that you could get anywhere with her pinning down your arms and laying down on your lower half.<br>\r\n\"Look at 'im squirm!\" You hear the dragoness shout over the lewd whistles of the crowd. Lipstick is smeared under your collar bone, next to your left shoulder, under your chest, between your chests. She then moved to one of your nipples, \"nibbling\" on it with her lips, opening and closing them around your nipples. This issued oohs and ahhs from the crowd as well as whooping. Meanwhile, your breathing sped up, your already twisted stomach twisted more and more, and you feel like you're losing your breath to her. After she finishes nibbling, she brings her face up to your face, deeply kissing you on the lips, leaving you screaming into her mouth.<br>\r\nShe then gets up, placing a foot on your chest, and another foot on your stomach. She licks her lips. You try to lift her foot off of you chest, but she only applies more pressure at your attempts. She steps off, moving over to your legs, taking each one in hand, leaving your groin exposed to her.<br>\r\n\"Please...\" you barely squeak out between breaths. Felicia instead lifts a foot, and plants it on your groin, issuing a scream from you. She then rubs her foot back and forth, causing pain and, to again your confused body and mind, pleasure. The smile and Felicia grows still.</span></div></div>",
            "created":1466053200,
            "id":2165248,
            "title":"Tug on your heartstrings some more"
        },
        "1123":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Make out session",
                "Breast play",
                "Stuck in the suit"
            ],
            "content":"<div class=\"\"><div> <span>She then places a hand on the back of your head, and shoves you between her breasts, you screaming into her cleavage. She takes both of her hands, grabs a jug, and squeezes them together. She proceeds to grind her breasts together on your head, with you trying to pull your head out all the while. She stops squeezing on your head for a bit, places a hand on your back and around your butt. Just as you find yourself about to pass out, your yanked out of her breasts and brought up such that your groin was level with her face. <br>\r\n\"Eep!\" you squeak out as you feel her prod your pants covered tail hole with the hand on your butt. Again, you weren't sure if you didn't like it. While she fingered you, she moved her hand on your back to the strip of rubber supporting her breasts. She pulls it away from her, placing your legs down her suit first. She slowly slid you downwards until your head was just above her breasts. She releases the strap with a snap, and you were trapped between her breasts, partially trapped in her one piece, much to your... dismay?<br>\r\n\"Don't give me that look baby~\" she says. Her hands were on either breast, them squeezing together being the only thing stopping you from falling into her musky, sweat filled suit. \"You and I both know you love this.\" She slowly spreads her breasts apart, causing you to fall further. She stopped you such that only everything above your eyes were peaking out of her melons. \"But which do you love more? Receiving a personal massage from my breasts? Getting stuck in my sweaty suit? Or did you really like when I kissed you?\" She licks her lips. You hear the crowd chanting. Some wanted more kissing. More wanted to see you chewed up by her breasts. And just as many wanted you sniffing her musk.</span></div></div>",
            "created":1466053200,
            "id":2165481,
            "title":"Smother torture."
        },
        "11233":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Slides her tail into the suit for a bit of fun",
                "More pain",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>She leans forward, puckering her lips, shutting her eyes. You don't now why you wanted it, but you didn't want to fight. You... wanted her to kiss you? <br>\r\n\"Oops~\" she says, a playful tone in her voice, as she spreads her breasts apart. You slide down between her breasts and into her suit. The tightness of her suit forced your face against her sweaty stomach, smothering you in her musky sweat. You flail about from within her suit, Felicia stroking from the back of your head to the bottom of your butt, taking special care sliding her finger down you butt crack. The sensation forces you to squirm more, unintentionally grinding yourself into her sweaty stomach. Before you realize it, she leaps up and belly flops onto the canvas, slamming you against the mat and her full weight on top of you. You scream as much as you can from the pain of the slam. She adds on to the pain, rolling left and right, and all over you. After a bit of rolling, she repeatedly bounces her body on top of you, crushing your nose with her stomach, you helpless to do anything about it. You can't do anything in their, but she can do anything she wants to you. What'll she do now though?</span></div></div>",
            "created":1466917200,
            "id":2171347,
            "title":"Stuck in the suit"
        },
        "12":{
            "author_id":"furrygrappler",
            "author_name":"FurryGrappler",
            "choices":[
                "A big fat bear in a singlet that doesn't contain his gut",
                "A pair of amazonian deep-chested big cats"
            ],
            "content":"<div class=\"\"><div> <span>          You barely crack 4 feet, coming up only to the waists of most of the wrestlers here, and you have a long tail that almost drags on the ground. You have barely any idea how to tie your own shoes, much less wrestle, but the boss told you that just let the bigger wrestlers do all the work. You are given a girl scout costume to wear, though the skirt is shorter and tighter than usual, a simple green mask with a pair of holes to free your brown pigtails.<br>\r\n<br>\r\n          You're not even big enough to climb through the ropes, so you have to crawl under the ropes, blissfully unaware that doing so lets your white panties peek out from your short skirt. You clamber to your feet and walk up to the dragoness in the center of the ring, who greets you with a sneer. She grabs her breasts and holds them up, letting them drop with a bounce and saying \"This is what a real woman looks like, and before the night is out, you'll know what one feels like too.\"<br>\r\n<br>\r\n          She turns around, making good care to let her firm shapely ass hover just an inch from your face, and directs your opponent to come. Climbing into the ring is...</span></div></div>",
            "created":1295326800,
            "id":1037886,
            "title":"Amanda, curveless lemur, age 8"
        },
        "121":{
            "author_id":"volcblaze",
            "author_name":"Volcblaze",
            "choices":[
                "He uses his weight. (Smashing and Throwing you around the ring)",
                "He uses his skill. (Using grabs and holds to break you)",
                "He uses his strength. (He's just brutally pounding you into the ring)"
            ],
            "content":"<div class=\"\"><div> <span>Now entering the ring is a large bear both in height and size. He has a large gut which could easily eclipse your entire petite form which can barely be contained in his singlet. Along with the large gut the bear also has arms as thick as trees. His dark brown fur is messy and unkempt. He also seems to also give off a very pungent smell and have to wonder if he's ever taken a shower.<br>\r\n<br>\r\nBoth you and the bear are called to the center of the ring. As you stand before the bear you crane your neck to look up at the bear, who stared down at you with a kind of look you are not familiar with. He licked his lips a few times before looked down at the dragoness. \"Hey, when I'm done playing with her I get keep her right? I could use a little toy when I'm bored,\" The bear said as he pointed to you.<br>\r\n<br>\r\n\"Of course you can! But you'll have to put on a good show to earn the right.\" You can hardly believe what your your hearing. Are they seriously thinking of letting the bear keep you as some kind of toy. \"Now if your ready then you can start at any time.\" The Dragoness left the ring leaving you to face the mountain of a bear.<br>\r\n<br>\r\n\"Hehe, Get ready kid! Cause this is gonna be a long and painful, 'Match',\" The bear said cracking his knuckles. \"Try and not break too much...\"</span></div></div>",
            "created":1409115600,
            "id":1848334,
            "title":"Mountain of a Bear"
        },
        "1211":{
            "author_id":"cheese111",
            "author_name":"cheese111",
            "choices":[
                "He uses you as a chair. (sits on you)",
                "He uses you as a rag. (rubs you into his sweatiest places)",
                "He uses you as an example. (unleash the mother of all bearhugs)"
            ],
            "content":"<div class=\"\"><div> <span>The bear's deep voice didn't inspire much confidence. He sounded like he barely had enough active brain cells to string together a sentence. And his fighting style was about to reflect this. He lumbered towards you, stomping heavily on the mat to shake it. He stands towering before you, raising his arms. The bear then jumps forward, his hefty gut quickly casting a shadow over you.<br>\r\n<br>\r\n<i>BOOM!</i><br>\r\n<br>\r\nYou are utterly engulfed by the heavy gut, which now crushes you into the mat. To your relief the weight soon lifts. Your head still spins from the impact but you can hear a distinct laughter from the bear. Before you find your feet again one of his huge footpads comes into view. With the same meteoric speed it slams down on you. You scream in pure agony as the bear stomps you into the mat. He leans down to see how you're faring. You're certain that you'll be bruised from head to toe all over tomorrow, but apparently that doesn't satisfy your opponent yet. He rams a large fist in your gut, making you choke on your own screams for a moment. You then feel his large hand wrap around your neck as he lifts you up. Would this be the end of it? Was he presenting you to the dragoness so she could end this torture?<br>\r\n<br>\r\nYou found yourself flying towards the turnbuckle, slamming into it with a loud smack. With a cruel smirk the bear walks over to you and picks you up again. You receive another devastating blow to the gut before he sends you soaring across the ring. This time you hit the ropes, which mercilessly fling you back at your opponent. He leans back catches you with his big gut. You desperately hold on to his singlet, but it's of little value. he simply lets himself fall forward. You scramble to the side as best you can, but you're buried up to your neck between his fat gut and the mat. This time he holds position a bit longer, really letting the oppressive weight sink in. You want to shriek in pain, but there's simply no air in your lungs to do so with. When the bear goes up again, you go with him, plastered to his singlet with his pungent sweat slowly leaking through. His deep laughter filled the air again. He wasn't done with you yet.</span></div></div>",
            "created":1491648600,
            "id":2301662,
            "title":"He uses his weight. (Smashing and Throwing you ..."
        },
        "122":{
            "author_id":"furrygrappler",
            "author_name":"FurryGrappler",
            "choices":[
                "It's a 2 on 1 handcap match",
                "It's a different, special kind of match"
            ],
            "content":"<div class=\"\"><div> <span>          Two huge females, taller than even the boss and much more muscular and buxom, climb over the ropes. One is a tigress, with an elegant hourglass shape wrapped in a leather bikini, the top completely covered in silver studs, still fairly feminine and beautiful, while the other, even bigger than the other, is a lioness with a mean ever-present glare, built more like a brute than be bodybuilding tigress, the only sure hint of womanhood being her heavy rack. The lioness wears rather plain greenish-brown tights, except for a large hole cut crudely, like with a pair of cheap scissors, into the front of her top to expose her cleavage so widely that one could see an areola peaking out on her left side.<br>\r\n<br>\r\n          What is your fate against these mountains of muscle?</span></div></div>",
            "created":1295499600,
            "id":1039093,
            "title":"Titaness Towers"
        },
        "1221":{
            "choices":[
                "Beat her down relentlessly.",
                "Experiment with her flexibility.",
                "Play around for the Audience."
            ],
            "content":"<div class=\"\"><div> <span>The two of them walk towards the center of the ring, their heights allowing them to get there in a few steps despite the rings' size. The boss beckoned you closer and you soon found yourself trying to sprint your way to the center. Upon reaching the center and being able to get an accurate size comparison between the two of them and you, your hopes don't get much higher. Compared to the boss alone, you come up barely eye to eye with her waist, maybe even a bit lower. With the tigress alone however, you are just barely eye to eye with her knee, maybe even less considering her knees were bent a little bit. Then there was the lioness whom could nearly step on you...you were about halfway to her knee...and you were pretty sure not as thick. She then had the two sides seperate a little bit, backing up a good distance but not close to the ropes.<br>\r\n<br>\r\n\"Alright, listen here,\" Yelled the boss. \"This is going to be a fun little match. A 2-on-1 handicap match. These two lovely towers of women against this frail little girl. This one's for the pure entertainment factor, bets not recommended. Anything goes really, fight how you like, use whatever you please, just no killing. Why kill what can recover and be beaten all over again? Beat her, play with her, torture her, etc. And one more thing, knock outs don't end the match. Tap outs don't end the match. Begging or incapacitation don't end the match. Even crippling or otherwise doesn't end the match. I end the match whenever.\" The, by this point, relatively medium sized dragoness announced. You were really quaking already as the two near-giants were grinning and looking to each other.<br>\r\n<br>\r\n\"Well then, since I believe you all understand the rules and no one seems to have the guts to stand up about them,\" The boss said as she shot you a look that said you more-so couldn't say anything. \"Let this match, Begin!\" The dragoness backed off out of the ring as a bell sounded and everything as the tigress and lioness both started off running in your direction. The tigress easily got to you first and punted you with a harsh kick to the stomach. She kicked you hard enough to send you flying into the arena ropes with caught you and bounced you back into the ring a bit before being tackled and crushed against the ropes when the lioness ran and back rushed you, jumping and leaning her whole body weight against the ropes with you underneath. She jumped off the ropes, you going flying a bit too but the tigress easily and happily caught you with one hand, holding you by the leg in the air before simply kneeing you in the gut, painfully knocking every last molecule of air out of you, to pass the short time before the lioness got back.<br>\r\n<br>\r\n\"Hey Liana, show me a little trick, here!\" The tigress yelled to the lioness she identified as Liana as she threw you into the air, flipping a bit but mostly upside down as Liana waited to time it just right before jumping into the air and bringing her legs up to cross with yours upside down, your face looking 'down' to see her crotch and ass as she dropped to the ground with you, essentially dropping herself on top of you in mid air. The impact as you not only landed in your head and shoulders, but for a moment, Liana's wait, or at least the weight of her legs, helped slam you into the ground and crush your torso vertically, all while nearly dislocating your legs. You fall limp, already thrashed as you fall onto your back, trying to unblur your vision. However, it's wishful thinking to think you'll get that time as Liana quickly lifts herself, and her large and tightly fit rear, over your still head on the ground. As well as most of your torso. Without a second of delay, she dropped herself and her SEVERAL hundreds of pounds on your body, and the sweaty smell...<br>\r\n<br>\r\n\"How was that Teresa?\" Liana yelled to the now also named Teresa. \"Not bad, but don't kill it.\" Teresa yelled back to Liana. That was when the boss spoke up from through the ropes. \"Hey, when I said no killing, I didn't mean you had to really worry about it. From the get go we had her drugged secretly from the get go to be impossibly flexible and resilient. A.K.A. She will be damn near impossible to actually kill. It's still possible, but it's really unlikely. Look, she's flattening a bit underneath you! Haha!\" The boss laughed as, looking at you, indeed you were half your previous width. The two huge wrestlers grinned even wider at this, realizing the near limitless boundaries presented to them. Now they could 'really' put on an all out abuse show for the audience!<br>\r\n<br>\r\nThey decide to...</span></div></div>",
            "created":1340427600,
            "id":1365436,
            "title":"It's a 2 on 1 handcap match"
        },
        "12212":{
            "author_id":"beatdown",
            "author_name":"Braun Beatdown",
            "choices":[
                "They get back to the beatings",
                "Liana has an interesting idea..."
            ],
            "content":"<div class=\"\"><div> <span>Liana and Teresa exchange a devious smile, before the Lioness grabs you and gives you a pull, stretching you like a wimpy wad of taffy. She slams your flattened form on the mat a few times, then picks you up  and twirls you into a tightly-wound coil like a wet towel. She widens her stance and pulls you between her legs, using you like a sweat rag to floss out the pungent excretions between her thighs, laughing while she does. <br>\r\n<br>\r\n\"Hey Liana, give me a good one!\" Teresa says, pushing out her shapely rear for her partner to see. Liana smiles and pulls you out, winding you even tighter, until you look like a rope with a head. She flicks you out with a snap and you bounce off Teresa's tight ass like a rattail. The Tigress squeals in delight, \"Again! Again!\"<br>\r\n<br>\r\nShe bounces you again, and again, but on the fourth time, the unimaginable happens and you manage to get stuck in the ass of her uniform. Teresa laughs and squeeeeezes her ass around you before grabbing you and pulling you out of the front of her shorts, taking her time to grind you against her muskiest regions before pulling you out. You're absolutely soaked in their disgusting sweat and in unbelievable agony from the stretching and pulling, but now...</span></div></div>",
            "created":1358830800,
            "id":1514113,
            "title":"Rubberiffic"
        },
        "1222":{
            "author_id":"furrygrappler",
            "author_name":"FurryGrappler",
            "choices":[
                "They turn on each other, wanting to make the other unable to intervene",
                "They gang up on you first so you don't get away."
            ],
            "content":"<div class=\"\"><div> <span>          The dragoness announces your opponents' names, the Tigress being Destina, and the Lioness being Eartha, and says that you will be in a special match with them.<br>\r\n<br>\r\n          \"We call this new match,\" she says, \"A 'Smother Race.' The winner of this match will be the one who manages to smother out the cub wrestler before her opponent. Smother outs can only be done with the wrestler's own body, be it with the hands, breasts, belly, genitals, butt, feet, or any other body part. Smother outs with outside objects do not count. If a smother out occurs with an outside object, or if the cub wrestler is otherwise rendered unconcious except by legal smother out, she will be revived, and the match will continue. If by the extremely unlikely event that the cub wrestler defeats <i>both </i>contenders by legal smother out, then she will be the winner. Ring the bell, please.\"<br>\r\n<br>\r\n          The two amazons grin toothily at you as the bell echoes throughout the warehouse.</span></div></div>",
            "created":1295499600,
            "id":1039108,
            "title":"The Smother Race"
        },
        "12221":{
            "author_id":"furrygrappler",
            "author_name":"FurryGrappler",
            "choices":[
                "You keep watching them try to overcome each other.",
                "You try to sneak away...and get caught by the ref."
            ],
            "content":"<div class=\"\"><div> <span>As the bell rings the women face off against each other. They wasted no time as they clashed together, their arms entangled, their huge muscular bodies twisted and strained as they vied for the opportunity to use you as a toy. The crowd leaned on the barricade, cheering for their favorite champion, as they often don't get to see anything resembling a fair fight in this show, though they anticipated the end more they are enjoying the fight. Both you and the ref had to scamper out of the way more than once as the fighters pushed each other out of the ring, but otherwise you can help to stand and stare as the two elegant monsters tried to decommission the other. However, when Earth managed to pin Destina on the ropes and bring her forearm across her face, the smack, loud enough to be heard outside, snapped you out of your trance.<br>\r\n<br>\r\nYou decide on a course of action.</span></div></div>",
            "created":1323579600,
            "id":1238286,
            "title":"They turn on each other, wanting to make the ot..."
        },
        "12222":{
            "author_id":"beatdown",
            "author_name":"Braun Beatdown",
            "choices":[
                "Continue your career as Amanda",
                "Take on a new wrestler."
            ],
            "content":"<div class=\"\"><div> <span>Before you could even begin to comprehend your situation, the tigress's slender leg slips out underneath your legs, sweeps to the left to knock you off balance and then swings upward into your underdeveloped crotch. You squeal in agony as your unprepared ladyparts are pulverized by the muscular kick, but your scream is quickly muffled by the titanic titties of the lioness. She wastes no time in stuffing your face into her enormous cleavage to snuff you out.<br>\r\n<br>\r\nDesperate for air after your muffled screaming fit, you futilely suck at the flesh in front of you, managing only to choke on the thin layer of sweat that your captor has developed from standing in the bright stage lights out on the canvas. You hear her deep-throated laughter all around you as it resonates from her muscular chest and your struggles begin to dim. Just when you nip at the sweet taste of unconsciousness, you're thrown from her dark breasts and onto the floor of the ring, nearly blinded from looking up at the overhead lights.<br>\r\n<br>\r\nOf course, you only get a brief look at them before they're eclipsed by the fat rump of the tigress descending on you. She drops from her standing height(More than enough to create a massive impact on your soft face) and makes sure to wriggle back and forth to grind your face into her barely-covered ass crack. As you struggle, breathless, you hear a low cackle above you before the tigress whispers,<br>\r\n<br>\r\n\"Zebra always disagrees with my digestion...\"<br>\r\n<br>\r\nA chill runs down your spine just before her tail hikes up and a hot gust of air is blown out with the sound of a thunderous tuba. In your foolish, air-deprived state you suck in as much air as you can, not realizing that the air is nothing but the fetid stink of rotten meat, sulfur and pure, horrific methane. Your lungs revolt and you find yourself even more breathless. You hang on by a thread and make it just long enough for the Tigress to lift her stinking ass off you (but not before giving you another, short whiff. Aftershocks of her earlier outburst). You struggle to your knees, but you only suck in a few gasps of breathable air before you're hoisted up once more. <br>\r\n<br>\r\nThe Tigress has you between her claws and lifts you up to see the Lioness pulling open the arm of her top and lifting one buff arm to give you a view of her sweaty, furry armpit. You open your mouth to scream, but all you get of fit is a mouthful of oniony sweat and hair. The Tigress lets you go and the Lioness clamps her arm down to keep you pinned in the stinking hotbox of her pit. The odor is horrendous, less utterly fetid but more cloying and acidic than the Tigress's rotten meat gas. Uniquely horrible, is how you'd describe it if you weren't about to pass out from lack of air.<br>\r\n<br>\r\nIn fact....<br>\r\n<br>\r\nThat's it. You're out. You go limp and the Lioness senses it. She lifts her arm and lets you drop to the ground with a dull, dead thud. You're still alive, unfortunately, in fact you're just barely lucid enough to hear the two complaining.<br>\r\n<br>\r\n\"Aww, she's even weaker than I thought!\"<br>\r\n<br>\r\n\"I say we take her back to my place...\"<br>\r\n<br>\r\nYou drift off into the darkness...</span></div></div>",
            "created":1353819600,
            "id":1475419,
            "title":"A Record-setting Defeat"
        },
        "122222":{
            "author_id":"beatdown",
            "author_name":"Braun Beatdown",
            "choices":[
                "Deli, a fat rhino boy (10)",
                "Twist, an awkward ponygirl (12)"
            ],
            "content":"<div class=\"\"><div> <span>You couldn't believe what you had just witnessed that poor girl had been beaten within an inch of her life and now those two freakwomen are dragging her off to do heaven-knows-what! You have to get out of here, you absolutely have to. You try to turn back but you only manage to push past the other kid wrestlers before reaching the stands, full of much larger, much scarier furries that would not abide your attempts to escape. You shrink backwards and shuffle back into the crowd. You attempt to blend in, but your attempt to struggle out had drawn the guard's attention.<br>\r\n<br>\r\nOne of them, a fat rhino, grabs you by the shoulder, \"You. You look like you're getting restless. How about you head out next? I'll bump you up to the front of the line, I'm just that kinda guy!\"<br>\r\n<br>\r\nHis breath is rancid enough to singe your eyebrows off, and his laugh is enough to nearly make you wet yourself. You're shoved forward towards the ring and as the stage lights focus in on you, the announcer bellows out your introduction.<br>\r\n<br>\r\nYou are...</span></div></div>",
            "created":1353819600,
            "id":1475428,
            "title":"A different PoV"
        },
        "1222221":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "Babar, the titanic elephant with a grin as big as Deli's body",
                "Haily, the big bottomed hippo"
            ],
            "content":"<div class=\"\"><div> <span>\"Deli, the titanic tub o' lard!\" the announcer introduces you as.<br>\r\nYou're a fat, stout rhino boy, with a gray body and a horn poking 3 inches out of your nose. You were forced to wear tight rubbery shorts, red lines running around the brim, leg holes, and down either side. Within the space outlined by the red is a yellow color. Furthermore, you're wearing a domino mask with a red outline and red around the eye holes and yellow on the inside of the mask. The dragoness stomps up to you, you noticing your ears only made it up to the bottom of her leg joints. You shakily stare upwards at the \"referee,\" her staring down at you. She lifts a leg, and stomps it down on your back, slamming you belly first onto the canvas.<br>\r\n\"Look at this little fat ass!\" she shouted to the crowd, using her tail to slap said ass at the word \"fat\" and \"ass.\" You squirm under her foot. She gets off of you, allowing you to get up, rubbing your stinging backside.<br>\r\nThe announcer continues \"And in this corner, we have-\"</span></div></div>",
            "created":1466139600,
            "id":2165705,
            "title":"Deli, a fat rhino boy (10)"
        },
        "12222212":{
            "author_id":"nobody495",
            "author_name":"nobody495",
            "choices":[
                "She ran at you for a grab",
                "She jumped up to slam on you",
                "She came in for a belly bump",
                "She stamped upon you"
            ],
            "content":"<div class=\"\"><div> <span>You were left rubbing your pained rump, upset at the display that dragoness put you through. However, you heard some stomping from far off as the new opponent began to approach. You could swear the ring was shaking from her steps, to the point where you grabbed one of the wires lining the ring to try and keep yourself up. You saw the woman, and gasped at the new challenger. They were a hippo, an already ginormous creature, but even bigger compared to the ones you've seen. You'd barely measure up to under her belly!<br>\r\n<br>\r\nIt cannot be underestimated how giant she was. She put the max in gluteus maximus. She could easily eclipse your tiny body with her whole backside! A horrifying thought crossed your mind, thinking of how you just might disappear if she were to sit down wrong. She wore a pure black suit, though it seemed funny. It cut off around the legs and arms, exposing her entire arms and thick legs. Though that wasn't the funny part, the funny part were the holes in her dress. There was one over her bust, spread open to reveal her cleavage, with several strings between the edges, looking like a sort of net. When she pulled herself over the ropes, you saw a similar hole over her butt, a wide hole exposing her crack and a similar mesh of strings set up like a net. You also saw a few other straps around her butt, two on the upper part of either cheek, and two on the lower part of either cheek. You began to notice similar loops on her bust.<br>\r\n<br>\r\n\"Welcome, the jailor herself, Haily!\" the dragoness said, ushering forth a loud cheer. You shivered, thinking about what they meant by \"jailor.\" Was it at all involved with those loops or that net mesh? <br>\r\n<br>\r\n\"Oh, remember when that cat kid got his hand caught in her net?\" you heard someone in the crowd say. That answered one of your riddles. The \"jailor\" got to her corner, and glared down at you.<br>\r\n<br>\r\n\"How bad a boy are you?\" she asked in a stern tone. You looked up at her, worried, too scared to speak up. She then shrugged. \"No answer? You must've done something pretty bad. I promise an extra long sentence.\" You felt your legs shake, terrified at what her nets and loops could do to you. Then, you heard a bell ring.<br>\r\n</span></div></div>",
            "created":1540697460,
            "id":2569550,
            "title":"Haily, the big bottomed hippo"
        }
    },
    "info":{
        "author_id":"furrygrappler",
        "author_name":"FurryGrappler",
        "brief_description":"Play the part of a young cub as he or she gets squashed by bigger adult wrestlers.",
        "created":1295160480,
        "description":"<td align=\"left\" class=\"norm\">          You are a young cub, and you are in for a long night. You are being sent into the ring to face off against a much bigger adult wrestler in an underground, unregulated match to be struck slammed, thrown, flattened, stretched, and smothered for the entertainment of a small but well-paying audience.<br>\r\n<br>\r\nAs you add to this brutality, remember these simple rules:<br>\r\n          * No actual sex, but be as shameless as you please up to that.<br>\r\n          * No nudity, except for a shirt getting ripped off occasionally<br>\r\n          * No gore, vore, or death. Everyone walks away from this fight, though you walk more slowly.</td>",
        "id":1742252,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1540697460,
        "modified":1540697460,
        "pretty_title":"Beaten Cub"
    }
}