{
    "chapters":{
        "1":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Hannah and Shari",
                "Amy",
                "Tiffany",
                "Ms Darwin",
                "More options"
            ],
            "content":"<div class=\"\"><div> <span>You are 18 years old and a few months off graduating from High school. Your parents moved interstate when your dad got offered a new job however you stayed behind because it would disrupt your final semester. <br>\r\n<br>\r\nAt the moment you are living in a two bedroom apartment with your twenty five year old cousin, Hannah and her best friend, Shari. You currently have Hannah's room, while Hannah is sharing a bed with Shari. Things have gotten a little rocky since you've been there as you've stepped on Shari's toes numerous times and have accidentally seen both girls naked more than once. This has lead to shameful thoughts about both women.<br>\r\n<br>\r\nYou've recently started dating a quiet goth like girl, Amy, you met in the library when studying. She's very reserved and you've both been taking it slow.<br>\r\n<br>\r\nYour biggest enemy at school is Tiffany, a very popular and attractive girl. You earned her ire back in grade school when you had a crush on her even before puberty kicked in. Only being a young boy you went about things the wrong way and embarrassed her when you tried to express your feelings. Feelings that haven't quite gone away.<br>\r\n<br>\r\nYour Biology Teacher, Ms Darwin, is a woman in her 30s. She's been your teacher for the last two years and has taught you everything you know about biology. She is quite attractive and you've had the odd wet dream about her here and there. Before Amy came along you did develop a crush on her.<br>\r\n<br>\r\nOne of these women is hiding a secret that you're about to find out. So Who's a Witch?</span></div></div>",
            "created":1552366800,
            "id":2629284,
            "title":"Who's a Witch?"
        },
        "11":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "They've only just gained their powers and want to try them out",
                "You accidentally discover their secret",
                "One of them uses magic on you to make living with you more bearable",
                "Someone they've altered comes knocking on the door",
                "More options"
            ],
            "content":"<div class=\"\"><div> <span>Living in the small single bathroom and two bedroom apartment hasn't been easy for you or your hosts. However Hannah was the only one in a position to take you in while you finished your schooling. As it was going to be a longish stay you were given Hannah's bed while she bunked with Shari. Though Hannah's room was still very much hers and you were living out of a suitcase on her floor.<br>\r\n<br>\r\nBoth girls were party girls and often spent the weekends out clubbing or visiting house parties and this was the only time you had the apartment to yourself. You enjoyed the peace and quiet, until the two of them came home drunk, usually both with guys in tow, forcing you on the couch those nights. Though there were also the nights that neither of them would come home, those nights were the best.<br>\r\n<br>\r\nThe bathroom situation is what caused most of the issues in the house as you'd accidentally leave the toilet seat up, a force of habit you've had for years, or would accidentally pee a bit on the floor or the back of the toilet seat. Then there was the shower, when you'd be busting but one of the girls were occupying the bathroom. The worst thing was the bathroom door didn't have a lock and sometimes after partying so late, you were asleep before they came home, so thinking they were still out you've entered the bathroom and caught them getting changed or topless in front of the mirror. Hannah was surprisingly chill about it, covering herself when you made the mistake and teasing you about it later. Shari on the other hand was more angry about her privacy being invaded.<br>\r\n<br>\r\nIt was going to be a long few months for all three of you. Especially you as little did you know Shari and Hannah were witches and they were about to change your life forever.</span></div></div>",
            "created":1563253200,
            "id":2687543,
            "title":"Hannah and Shari"
        },
        "111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Shari casts a spell on you",
                "Shari casts a spell on Hannah",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh Em Gee!\" You heard Shari scream in disbelief as you were getting ready for school in Hannah's room. \"It actually works.\"<br>\r\n<br>\r\n\"I know, this is so cool, we should by things when we're drunk more often,\" Hannah replied, she was just as excited as Shari was.<br>\r\n<br>\r\nThe curiosity got the better of you and you let your room to see what was going on. In the living space, Hannah was sitting cross legged, floating a foot off the ground, while Shari read from a book.<br>\r\n<br>\r\n\"Hey, cuz. Check it out, we bought this magic book last night. Turns out magic is real.\" Hannah explained as you just stood their with your mother wide opened.<br>\r\n<br>\r\n\"I think you broke him,\" Shari commented, breaking her concentration, causing Hannah to fall on her ass.<br>\r\n<br>\r\n\"Ouch...\" Hannah stood up, rubbing her butt. \"You okay Marcus?\"<br>\r\n<br>\r\nYou blinked and shook your head and opened your eyes again. \"This is a trick right, it has to be.\"<br>\r\n<br>\r\n\"Yeah a magic trick dumbass...\" Shari flipped through the book. She then stopped on a page and gave you a wicked smile. \"Hey Hannah, I don't think Marcus believes us, should we give him a first hand experience?\"</span></div></div>",
            "created":1582779600,
            "id":2793753,
            "title":"Fresh Witches"
        },
        "1111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You change genders",
                "You feel a strange feeling in your pants",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Shari flicked through the spell book and smile at you as she found the perfect spell. \"Oh, I'm totally trying this one out on you Marcus,\" Shari chuckled as she began to read from the book, with her arm aimed at you.<br>\r\n<br>\r\nYou felt a strange tingle as your skin shivered but besides that nothing happened. \"I knew this was fake,\" you say, even though you aren't sure how Hannah was floating a second ago.<br>\r\n<br>\r\n\"Remember what the lady said, Shari. We need to cast spells together,\" Hannah walked over to Shari and looked at the book. \"Now what are you trying to do to my cousin?\" Hannah looked at the spell Shari wanted to cast. \"Really you want to do that to him?\"<br>\r\n<br>\r\n\"It's for just a bit of fun, I promise,\" Shari assured Hannah.<br>\r\n<br>\r\n\"Okay...\" Hannah began to read the spell with Shari, this time you do feel that it had an effect and a second later you...<br>\r\n</span></div></div>",
            "created":1583038800,
            "id":2795030,
            "title":"Shari casts a spell on you"
        },
        "11111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You go shopping",
                "You go to school",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You felt a strong pain in your groin as the Hannah and Shari hit you with a blast of energy. It's like you suffered a kick to the balls and when you touched the area you felt your genitals begin to reshape as they began to reshape and your testicles went internal. Everything else was painful too, as your pelvis began to widen and your hips grew more narrow. You felt your face shift briefly as you watched your hands grow more petite. Your chest began to swell as two mounds of flesh grew beneath your nipples. It was over in a few seconds but it felt a lot longer than that and when you finally caught your breath, you were no longer a man.<br>\r\n<br>\r\n\"Oh wow, 'she' looks a lot like you,\" Shari commented to Hannah on your new appearance.<br>\r\n<br>\r\n\"Wh...what?\" you weren't used to your new voice as your Adams apple had faded and you lost your masculine voice. You sat up, feeling the shift on your chest. One hand patted your crotch, feeling the outline of a vulva while another hand reached up to your chest.<br>\r\n<br>\r\n\"Typical, they always go for the breasts....\" Shari rolled her eyes.<br>\r\n<br>\r\n\"What do you mean 'they' this is the first time we've seen something like this done,\" Hannah said confused.<br>\r\n<br>\r\n\"In movies and TV shows when people change genders or swap bodies, the men always touch the breasts...\" Shari elaborated. \"Though given the result I don't think your cousin will be the last person we do this to.\"<br>\r\n<br>\r\n\"Perhaps not,\" Hannah said with a gleeful smile.<br>\r\n<br>\r\nYou looked back up at them in bewilderment. \"You two are actually witches?\"<br>\r\n<br>\r\n\"I guess we are...\" Shari and Hannah said in unison.<br>\r\n<br>\r\n\"Well change me back,\" you pleaded<br>\r\n<br>\r\n\"Come on Marcus, you've been given a unique opportunity here, why not explore it for a bit. You know we can change you back at any time,\" Hannah put her hand on your shoulder. \"Just lets see where the day takes you and we'll talk about changing you back later.\"<br>\r\n<br>\r\nShari said nothing on that front and you were worried that she might chose for you to stay as you are. \"You know Marcus is probably the wrong name for her, let's go with Marcia instead.\"<br>\r\n<br>\r\nYou weren't fond of them calling you a different name but it made sense for them to do so. You also knew when Hannah wanted to do something she considered fun it never worked when you tried to talk her out of it. For now you were stuck as you were and the day had only just begun as...</span></div></div>",
            "created":1591678800,
            "id":2848573,
            "title":"Gender Swap"
        },
        "111112":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Tiffany wants to be friends",
                "You meet up with Amy",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Aren't you going to be late to school, Marcia?\" Shari asked emphasizing the name she had given you. \"Education is important you know...\"<br>\r\n<br>\r\nYou looked down at your body, you were still in your pajamas, only now your breasts pushed against the top, making the buttons tighter. You had no clothes in this form and even if you did the school wouldn't recognize you as a student. \"I can't go like this, I have nothing to wear!\"<br>\r\n<br>\r\n\"Oh is that your problem?\" Hannah grabbed your hand and dragged you to her room. She went through her closet a pulled out a pair of jeans, some underwear and shirt for you to wear. \"This stuff should fit...\" Hannah sizes you up. \"If it doesn't, I'll make sure it does.\"<br>\r\n<br>\r\nYou sigh as you get undressed and catch yourself in the mirror. \"There's no time for that, you're going to be late.\" Hannah snaps you out of it as she grabs her spare bra and begins to help you put it on. \"You are cute though.\" You put everything else on and go to leave, when Hannah stops you again. \"Your hair's a mess and you aren't wearing makeup.\"<br>\r\n<br>\r\nYou sigh as she takes you to the bathroom where see and Shari fix you up to their liking. They gave you light makeup, rather than something bold and your hair was left loose for now, flowing freely over your shoulders. It was weird to have this much hair and to have makeup on your skin.<br>\r\n<br>\r\n\"So, what do I tell them when I get to school?\" You try one last time to have them let you out of this.<br>\r\n<br>\r\nShari hands you your student ID, which now says Marcia. \"There, you've got ID and as an added bonus while this is on you, no one will question if you're new or not. They won't know you were Marcus though.\"<br>\r\n<br>\r\nHannah looked over at the clock, they had kept you too long, there was no way you'd make it in time now. You breathed a sigh of relief, you didn't particularly want to go to school as a woman.<br>\r\n<br>\r\nHannah and Shari only saw this as an opportunity to try more magic as they cast a teleportation spell that made you appear in the school grounds. You were now too early.<br>\r\n<br>\r\nYou get looks from some of the students, as you were an unfamiliar face but no one questions you directly about it, not even the teachers. You wander the halls wondering what to do before the first class.</span></div></div>",
            "created":1598504400,
            "id":2892380,
            "title":"Go to School"
        },
        "11112":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You have a vulva",
                "Your penis is dettached",
                "You have nothing"
            ],
            "content":"<div class=\"\"><div> <span>\"I can't believe you got me to try that spell on my cousin, Shari.\" Hannah's face was red with embarrassment but she also couldn't help but find the situation funny.<br>\r\n<br>\r\n\"I'm surprised you agreed to do it,\" Shari responded, while giving you an evil grin.<br>\r\n<br>\r\n\"So am I, but it did seem pretty funny and we can always undo it.\"<br>\r\n<br>\r\nYou looked at the two of them confused. \"What did you do to me?\" You asked as you felt a tingling sensation in your crotch. \"What did you two do?!\" Realized where they targeted the spell.<br>\r\n<br>\r\n\"Go check in the bathroom,\" Shari instructed. \"We'll wait.\"<br>\r\n<br>\r\n\"Are you sure that wasn't too mean?\" Hannah asked Shari. \"We'll fix it after he see's it right?\"<br>\r\n<br>\r\nYou headed to the bathroom and stood in front of the mirror, you pulled down your pants and underwear to find...</span></div></div>",
            "created":1583038800,
            "id":2795040,
            "title":"You feel a strange feeling in your pants"
        },
        "111121":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "No, he can stay like that",
                "Fine, but whenever I decide to mess with him you need to help",
                "Let's change him further"
            ],
            "content":"<div class=\"\"><div> <span>You look at the mirror and down at the actual thing, you can't believe it. Your penis and testicles are completely gone and instead you have a quite predominate vulva. You had seen some imagines online before, some of those were shaved and close to the body, your new mount was as hairy as before and the mound stuck out a fair distance. Your new labia was also sticking out.<br>\r\n<br>\r\n\"What have you done to me!\" You scream.<br>\r\n<br>\r\nShari and Hannah entered the bathroom quickly, to see the result of their work.<br>\r\n<br>\r\n\"Oh that's an impressive cunt,\" Shari mocked. \"At least now we don't need to worry about you leaving the toilet seat up.\"<br>\r\n<br>\r\nHannah turned to Shari. \"I thought you only wanted to mess with him, we've done that. Now let's undo the spell.\"<br>\r\n<br>\r\nShari, looked at you, your vulva and then back at Hannah. She smile and said....</span></div></div>",
            "created":1583038800,
            "id":2795049,
            "title":"You have a vulva"
        },
        "1111211":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Let's make that an official contract",
                "Give up your claim to the spellbook",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>\"What?!\" You and Hannah scream in unison.<br>\r\n<br>\r\n\"You can't leave me like this,\" you pleaded as you looked down at your new genitals.<br>\r\n<br>\r\n\"I only agreed to do this as a joke,\" Hannah added. \"We've had our fun now, let's undo it.\"<br>\r\n<br>\r\n\"I don't want to,\" Shari stated. \"I like him better this way.\"<br>\r\n<br>\r\nHannah stormed out of the room and came back with the spellbook a few seconds later. \"If you aren't going to undo it I will,\" Hannah chanted the counter spell but it didn't work.<br>\r\n<br>\r\nShari laughed at her attempt. \"We did this together, Hannah, we can only undo it together. So he's staying like that until I decide otherwise.\"<br>\r\n<br>\r\n\"Shari, this joke it getting old, we can't leave Marcus like this. I agree that leaving the toilet seat up is annoying but this is going too far. I only agreed to do the spell because I thought it'd be funny but the fun is over.\"<br>\r\n<br>\r\nShari turned and looked at Hannah with serious eyes. \"Oh this isn't a joke Hannah. While he's under this roof he's staying like that, maybe I'll keep him that way forever, depending on how you two react from now on. I'm sick of him living here, I'm sick of sharing a bed with you, heck I found this magic book now I need to share that with you too. So from now on you both do as I say otherwise Marcus can keep his cunt forever.\" Hannah saw a darkness in Shari's eyes.<br>\r\n<br>\r\n\"Please, Shari this isn't you...\" Hannah grabbed her friend. \"If you undo this, I'll do anything you want.\"<br>\r\n<br>\r\nThis caused Shari to pause for a moment as she looked over at you and Hannah and then down at the book.</span></div></div>",
            "created":1583038800,
            "id":2795061,
            "title":"No, he can stay like that"
        },
        "11112111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "I want you to accept that Marcus should have a vulva.",
                "I want you to do a new contract where you agree to do whatever I want",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay,\" Shari commented. \"You want your cousin to have his dick back, we can put it in writing. You'll do whatever I want.\"<br>\r\n<br>\r\n\"I'll do anything, you want. Not whatever,\" Hannah clarified. \"Anything means you get to ask me one thing.\"<br>\r\n<br>\r\n\"Okay fine,\" Shari agreed as she flicked to the front of the spell book. \"It's going to be a magical contract though.\"<br>\r\n<br>\r\n\"So you agree to give Marcus back his dick and then you can ask me to do anything,\" Hannah clarified.<br>\r\n<br>\r\n\"Yes those are the terms,\" Shari found the page for the spell and the began to enact it. They linked their fingers and chanted the magic words.<br>\r\n<br>\r\nYou watched them do this from the bathroom and a second later your penis was restored. You lifted up your pants and came out to the living area.<br>\r\n<br>\r\n\"Okay now for my terms....\" Shari said with a smile. </span></div></div>",
            "created":1583038800,
            "id":2795064,
            "title":"Let's make that an official contract"
        },
        "111121111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You try to plead with Hannah",
                "You talk to Shari",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait what?!\" You approached Shari. \"That's cheating, you can't ask her to do that!\"<br>\r\n<br>\r\n\"Sure I can, she said she'd do anything. Now I get my way and you get a vulva and Hannah doesn't hate me for it. Just be thankful this will be the last transformation she'll let me do on you.\"<br>\r\n<br>\r\n\"She's right Marcus, after Shari refused to give your dick back after a prank spell, I'm never going to let her cast another spell on you. But she's right, you should have a vulva.\"<br>\r\n<br>\r\nYou didn't have time to plead with them before they cast the spell on you again, taking away your penis. \"I can't believe you made her do this to me again...\" you yelled at Shari.<br>\r\n<br>\r\n\"Oh it gets better, see I was going to give your dick back, when you moved out but now I can't,\" Shari gave a wicked smile.<br>\r\n<br>\r\n\"What?! Why can't you, you and Hannah can just reverse the spell again!\"<br>\r\n<br>\r\n\"Yeah we could, but now Hannah thinks you should stay that way, so she's never going to want to help reverse this. So enjoy having a cunt, like us,\" Shari laughed.<br>\r\n<br>\r\n\"Is this true?\" You asked Hannah, looking betrayed.<br>\r\n<br>\r\n\"That was the term of our agreement, you should have a vulva, not a dick. You're my cousin and I love you, so I'm only doing what's best for you.\"<br>\r\n<br>\r\nYou cursed Shari, she found the perfect work around, to get what she wanted, while also getting Hannah back on side with her. You didn't know what you should do next.</span></div></div>",
            "created":1583038800,
            "id":2795068,
            "title":"Marcus should have a vulva."
        },
        "1111211111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You stop complaining",
                "You keep pushing it"
            ],
            "content":"<div class=\"\"><div> <span>\"Come on, Hannah. You know this is wrong, you can't let Shari do this to me..\" You plead with Hannah. You lower your pants at expose yourself to Hannah. \"You can't tell me this is right.\"<br>\r\n<br>\r\n\"No it's not right, exposing yourself is very gross,\" Hannah said before looking away. \"I don't get what's so bad, Shari and I have a vulva.\"<br>\r\n<br>\r\n\"Yes but you're meant to, I'm a a man, I'm meant to have a dick...\" you get down on your knees and beg Hannah.<br>\r\n<br>\r\n\"Oh give it a rest, Marcus. Is this all you're going to do, whine the entire time?\" Shari asked.<br>\r\n<br>\r\n\"If that's what it'll take to get my dick back then yes. I'm going to keep hounding you about it,\" you snap at Shari.<br>\r\n<br>\r\n\"If that's the case,\" Shari turned to Hannah. \"I know you said no more spells on your cousin but if he doesn't stop complaining about his vulva, can you help me make him shut up about it?\"<br>\r\n<br>\r\nHannah paused for a moment and looked over at you. \"He is getting annoying isn't he...\" Hannah admitted. \"Okay, I will allow that.\"<br>\r\n<br>\r\nShari gave you a smirk. \"She's on my side now, Marcus. Get used to the damn thing or else.\"</span></div></div>",
            "created":1583038800,
            "id":2795089,
            "title":"You try to plead with Hannah"
        },
        "11112111112":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You aren't allowed to complain about it",
                "You are made to accept it",
                "You lose your mouth."
            ],
            "content":"<div class=\"\"><div> <span>\"No I'm not going to drop this,\" You cry. \"Hannah only finds this acceptable because you made her. If you didn't she'd still be pushing for you to give me back my penis. You cheated the contract,\" you cry.<br>\r\n<br>\r\n\"He's not dropping it Hannah,\" Shari ignores you as she goes for the spell book. \"Ah how about we do use this on him?\" Shari finds a spell, though she's not sure if Hannah will go for it.<br>\r\n<br>\r\nHannah looked at what she had in mind and agreed.</span></div></div>",
            "created":1583038800,
            "id":2795090,
            "title":"You keep pushing it"
        },
        "111121111123":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "He's right, I'm not going to agree to giving it back",
                "I promise, you can have it back",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Your lips fused together as well as your teeth, your tongue vanished as well as your voice box. You cannot utter a single word or sound.<br>\r\n<br>\r\n\"I know this was mean, Marcus and I said I wasn't going to allow Shari to do anymore mean things, but you kept pushing this whole vulva thing,\" Hannah said in a sad tone. \"Until you learn to live with your new genitals, I'm afraid you're not going to be allowed to talk either.<br>\r\n<br>\r\nYou point to Shari with an angry look in your eyes. You pull out your phone and type the message. 'What's to say she's even going to let you give my mouth back?'<br>\r\n<br>\r\nShari smiled as she read the message.</span></div></div>",
            "created":1583038800,
            "id":2795092,
            "title":"You lose your mouth."
        },
        "1111211111232":{
            "author_id":"secretgoat",
            "author_name":"Ralsei",
            "choices":[
                "You wait for the period ",
                "You try to have fun with your new vagina ",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span><b>Original</b><br>\r\nShe says “I promise, you can have it back and your penis” you are surprise and your cousins is too but Is forced into agree with her. She cast a spell giving your mouth back. She says “I will give you back your penis if you Experience One or two of these four things. 1. Have sex with a guy. 2.get pregnant. 3. Give birth. 4. Experience A period and handle it your own way without using tampons or pads. Your period is coming in a few days so have fun with your vagina until then there are lots of new things you can do with it. Or you could speed things up and go find a guy. But those are the terms of the agreement and Hannah agrees right?” And she just nods<br>\r\n<br>\r\n<b>Edit by the author</b><br>\r\n<br>\r\n\"That was for a little bit of fun,\" Shari smiles at you before she turns towards Hannah. \"Okay we can give him his mouth back... and I'm feeling generous, you can have your dick back too on a certain condition.\" Your lips reform as your mouth reforms.<br>\r\n<br>\r\n\"But I don't want him to have it back...\" Hannah counters. \"We agreed he should keep it forever,\" she only agreed to that because of the contract.<br>\r\n<br>\r\n\"Yes we did, but I can release you from that contract and I'll only do that if you do one or two of these things. You could have sex with a guy, that would be fun considering you're a virgin so losing your virginity to a man sounds like fun. I've given you the full reproductive system too so you could always get pregnant. Actually it'd be amusing to see you give birth too and of course as you now have the full equipment of a woman, you should experience going through a period. Though as the first man to have a period I think it'd be rather unfair on all the women of the past if you can just use modern necessities so when you do go on your period, which is only a few days away, I don't want you using any tampons or pads. So those are the four things, have sex with a guy, get pregnant, give birth or experience an unassisted period. If you do that I'll release Hannah from her contract and we can restore your precious little manhood. Though now you've got an out, why not have fun with it while you have it. If you want to get rid of it as soon as possible, go have sex with a guy.\"<br>\r\n<br>\r\n\"Hanna you can't let her do this to me!\" You cry.<br>\r\n<br>\r\n\"I'm not, like I said. I'm happy for you to stay this way but if you want Shari to release me from my contract I guess that's the only way. Though I do think getting pregnant is going a little too far. But a period... that's natural. You're going to experience that anyway.\"<br>\r\n<br>\r\n\"I'll even help you out if you want to have sex with a guy, or if you want to get pregnant without a guy. Just point someone out, you want to have sex with and I'll make it happen. Or if you want to undergo IVF.\"<br>\r\n<br>\r\nThe period would be the easiest thing to get out of the way so would having sex with a guy. Still the second one risked the other 2 options. You also considered their point about playing with your new body part.</span></div></div>",
            "created":1598763600,
            "id":2894422,
            "title":"I promise, you can have it back"
        },
        "11112111112321":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "People notice your period",
                "You manage to get to the bathroom in secret",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You could not get used to having a vulva, no matter how hard you tried. So for the rest of the weekend you tried to pretend it wasn't there. Though you got the nasty reminder every time you used the toilet. Shari was delighted that the seat was being left down now.<br>\r\n<br>\r\nIt was now Monday and you were in Biology class, learning about the reproductive system of all things, which gave you a constant reminder that yours had been switched. You sat uncomfortably, your stomach churned and it felt like you ate something bad. Your shirt was irritating your shirt and you felt a headache coming on. It made it extremely hard to concentrate in class.<br>\r\n<br>\r\nYou knew what this was straight away, your period had started in the middle of class, surrounded by people that would make fun of you. You imagined Tiffany would have a field day if she discovered what Shari did to you.<br>\r\n<br>\r\nYou asked Ms Darwin if you could go to the toilet, hoping to go unnoticed. Ms Darwin nods and you get up....</span></div></div>",
            "created":1602850740,
            "id":2922783,
            "title":"First Period"
        },
        "1111211112":{
            "author_id":"poisonmushroom",
            "author_name":"Poison",
            "choices":[
                "But...   (.)(.)",
                "Put your tail between your legs and retreat for the day",
                "You choose?"
            ],
            "content":"<div class=\"\"><div> <span>\"Please Shari.... You just can't leave me like this!\"<br>\r\n<br>\r\nShari quickly closed the distance between her and Marcus breathing deeply as she pointed a finger in his face<br>\r\n<br>\r\n'Listen good to me you little fuk... You've made things hell since we took you in here. You piss on the toilet seat and floor like a dog,leave the seat up just for starters!  <br>\r\n   So what you have a cunt now like the rest of us... Now you have to squat to piss big fuk'n deal get used to it. Who knows you may have to squat for along time...at least as long as you're here you are! <br>\r\n   Now you're going to cry like a little girl because your panties are in a bunch over this! .... I'll promise you this, if you don't shut that dick sucker of yours and you say another word to me you're going to need to get a whole new wardrobe and student ID on Monday Marcia!  <br>\r\n  GOT IT!\"<br>\r\n<br>\r\n   With the end of her rant her pointing finger retreated but quickly returned with her other fingers to smack him on the forehead before biting her lower lip and giving him adequate time to choose his fate!<br>\r\n  Marcus squinted his eyes a bit as Shari layed into him her hot minty  breath beating on his face. <br>\r\n  He truly felt so small standing there as this girl lashed him with her words...it was plain embarssing for a guy to say the least. Could he still claim that? ...Actually he was more of a very flat chested manish girl now if you wanted to get technical.<br>\r\n     ( -.-).......ooO0<br>\r\n   <br>\r\n</span></div></div>",
            "created":1602858660,
            "id":2922834,
            "title":"You talk to Shari"
        },
        "11112111121":{
            "author_id":"poisonmushroom",
            "author_name":"Poison",
            "choices":[
                "ch..ch..changes, time and faces change!",
                "follow Shari and Hanna...",
                "you choose?"
            ],
            "content":"<div class=\"\"><div> <span>  \"But...\"<br>\r\n   <br>\r\n   That was enough for Shari to hear and Hanna just shook her head like 'why' to Marcus as Shari's finger pointed to Marcus's face. He eyes focused on Hanna's twirling pink finger nail just inches from his face as her finger wiggled in circles and she began to speak in a methodical evil voice focusing her stare on Marcus.<br>\r\n<br>\r\n  \"tout tout and strewn about, your life's all in dismay,<br>\r\n   Your manly clout no more in doubt, a females role you'll take,<br>\r\n   With silks and satin's, cottons and lace pretty bra's and panties to shape your fate<br>\r\n   A woman's burden upon your chest you'll join those girls with Double D cup breasts<br>\r\n   Soft and firm new warm flesh forming,another cup size every morning<br>\r\n   Just 5 days to feel your fate,and proudly bear their burdensome weight <br>\r\n   You're curvy shape will leave no doubts,top or bottom are equally round <br>\r\n   Your warm moist slit between thick thighs,gone from them all manly signs<br>\r\n   Thick pink lips and fleshy folds,your menstrual track when your eggs get old<br>\r\n   In your middle a woman's womb,awaits a seed to start to bloom<br>\r\n   And seal forever these feminine changes at motherhood and will only multiply at magic changes!<br>\r\n   So mote it be..... so mote it be.....  say it with me Marcia.   third times the charm<br>\r\n   SO MOTE IT BE!<br>\r\n<br>\r\n  In a sort of hypnotic state, Marcus even spoke along with Shari the final words to the spell cast over him like she asked. Sealing his own fate and even protecting it with a magic seal to double his changes at any attempt to use magic to change him!<br>\r\n  Shari then snapped her fingers in front of Marcus as he blinked in confusion a few times before focusing on where he was. He still looked confused as he tried to get his senses back only recalling some of her words here and there but not making sense of any of it.<br>\r\n  A evil smirk was all Shari showed as she crossed her arms over her chest triumphantly trying to hold back her laughter.<br>\r\n<br>\r\n  \"You obviously wanted it, now you got it Marcia!  hopefully things will change around here now.   ...  oh and if i catch you wearing any of my bra's or dresses let's just say you won't be close to my size anymore girlfriend\"<br>\r\n<br>\r\n  \"I don't have plans of wearing yours, Hanna's or anyone elses bras or dresses Shari just change me!\"<br>\r\n<br>\r\n  Mmmmm   ok...  what did i tell you before about running that cock sucker of yours to me?   just be patient...you're going to change alright... don't forget to make that appointment for your new ID!   lololol \"<br>\r\n<br>\r\n  Marcus looked kind of bewildered as Shari spun on her heel turning to leave as she made a quick winning sort of gesture with her arm saying nothing else... she knew it would be 5 days tops for everything to finish. Hanna just made a heavy sigh as she followed Shari to get ready to go out for the night. Marcus was totally unaware but things were already beginning to change.He might just notice the extra padding already on his ass cheeks when he sits down but the puffy budding nipples were easy to spot!<br>\r\n<br>\r\n</span></div></div>",
            "created":1602899640,
            "id":2923170,
            "title":"But...   (.)(.)"
        },
        "111121111211":{
            "author_id":"poisonmushroom",
            "author_name":"Poison",
            "choices":[
                "4th morning since Shari cast her spell!",
                "Follow Shari and Hanna for a bit",
                "You choose?"
            ],
            "content":"<div class=\"\"><div> <span>Saturday and Sunday seemed to pass quicker then normal and Marcus did nothing that weekend but dwell on Shari...and avoid her.<br>\r\n   She could be such a bitch if she didn't get her way and it was obvious Marcus had pushed the wrong buttons with her putting him on her shit list. If it wasn't for Hanna she'd of done much worse to him besides what she did.<br>\r\n  But sure enough like Shari said Ms Darwin was his first class and she was the one to crush him that day when she asked him to stay after class.<br>\r\n<br>\r\n\"How's things been going at home Marcus?.. Come sit here..\"<br>\r\n<br>\r\nMs Darwin tapped the desk closest to hers with her long nails drawing his attention away from her cleavage that always seemed able to hold his attention better.<br>\r\n<br>\r\n\"I've noticed some things different with you lately.... You know there's nothing wrong with that.... Everyone changes as they grow up ....\"<br>\r\n<br>\r\n   Sitting on the edge of her desk she crossed her legs in that short dress and leaned forward more giving Marcus a great view down the top of her dress right to one of her black lace bras<br>\r\n  He swallowed softly normally having a serious woody going on when he had talks with her but this time he didn't and the lack of his manhood only made him feel more squeamish with her talk.<br>\r\nGlancing down to his own chest he'd pull at the front of his shirt thinking maybe she noticed the ace bandage he had wrapped around him pressing his developing breasts flatter.<br>\r\n<br>\r\n \"  Do you understand what I'm saying to you Marcus?\"<br>\r\n<br>\r\nMs Darwin gave him that sexy smile she had reaching out to brush his hair differently in front to the side making several passes with her fingers until she was satisfied with the new more feminine look.<br>\r\n   What was it with women Marcus thought can they smell other females or something? Even binding his chest wasnt enough to hide from her.<br>\r\n  Signaling she was basically done with her chat for now with a soft sigh Ms Darwin took out her lip gloss and applied some rolling her lips and finishing with..<br>\r\n<br>\r\n\"You should also get a new student ID made this week...have them call me if they give you any problems....ok\"<br>\r\n<br>\r\nWith that she stood brushing her dress smooth then placing her hand on Marcus's shoulder looking down on him. <br>\r\nWith a reassuring squeeze then sliding down to the center of his back she scratched it lightly back and forth across the bandages then ended with a few pats.<br>\r\n<br>\r\n\"Let me know how things go...and tell Hanna I said hey...\"<br>\r\n<br>\r\n\"Ugh... \"Shari! He thought why did she have to do this...now Ms Darwin knew! And soon the rest of the school when he gets a new ID with a red background instead of blue! <br>\r\n<br>\r\n\"God I hate Shari.... I wish she'd eat a bag of dicks and leave me alone\" <br>\r\n<br>\r\nMarcus couldn't help but mutter his frustration with Shari as he stood feeling so defeated but also turned to look at the chair he was just sitting in to see it's empty hard surface.<br>\r\n  It wasn't until then that he began to notice the squishy new feeling when he set down....it almost felt like he was sitting on a thin cushion but his glance confirmed the chair was empty.<br>\r\n  That was the least of his worries as he went to his next class.! </span></div></div>",
            "created":1603115040,
            "id":2924649,
            "title":"ch..ch..changes, time and faces change!"
        },
        "1111211112111":{
            "author_id":"poisonmushroom",
            "author_name":"Poison",
            "choices":[
                "Amy shapes Marcus/Maria's new image",
                "Shari and Hanna...more magic",
                "You choose?"
            ],
            "content":"<div class=\"\"><div> <span>The 4th morning things started out bad for Marcus.the bandage wasn't binding things enough...he panicked trying on other clothes then their school uniform.<br>\r\n  Maybe it was him but he knew it was getting impossible to keep these breasts under wraps...how much bigger were they going to get.<br>\r\n  Just then a knock came to the apartment door.Shari was closest as she peeked out their peep hole seeing another witch maybe? She opened the door hanging on it as she curiously sized up the girl.<br>\r\n<br>\r\n\"Is Marcus ... Does Marcus live here?\"<br>\r\n<br>\r\n\" um....yea.   She's here\"<br>\r\n<br>\r\nShari yelled into the apartment as she swung the door open more for the girl to enter. Amy looked puzzled for a second by Sharis use of pronouns but entered none the less.<br>\r\n  <br>\r\n\" She's. In there\"<br>\r\n<br>\r\nShe gestured to the bathroom matter of factly with a smile...Amy sheepishly looked in as Marcus was attempting to rewrap the binder around himself/herself.<br>\r\n<br>\r\n\"Marcus......\"<br>\r\n<br>\r\nHe froze hearing Amy's voice as she looked confused.... <br>\r\n<br>\r\n\"You're a girl Marcus!.... \"<br>\r\n<br>\r\n Amy looked stunned to say the least not knowing why Marcus hid that he was really a girl to her.There was a lot of explaining going on but none ever mentioning Shari and Hanna being witches and doing this.<br>\r\n   Amy took it as Marcus unhappy being a girl so he was Marcus instead of Marcia. She didn't know what to really do but she did know that girl or not the person she had just started seeing she really liked.<br>\r\n  Most seen Amy as strange being a  goth girl.Shari's try at freaking her out actually did the opposite.Although deceived by Marcus she seen it as more innocent of not wanting to be who she was.<br>\r\n  Things ended with Amy taking off the bandage wrapping Marcus and being surprised at just how developed he was.<br>\r\n  Some dark mauve lip stick and black eye liner then some barettes and a few spritzes of perfume and Marcus found himself being drug off to school as the new goth girlfriend of Amy!<br>\r\n  They had lots of talking to do after this none of which Marcus was looking forward to and the questions and stares he'd be getting were going to be so humiliating.<br>\r\n  The only other option was Shari is a witch and did this to me!  They'd really look at him like he...she was crazy then and I think Shari also knew this.<br>\r\nIt wasn't until Marcus passed Ms Darwin in the hall that even she did a double take at the new goth girl Amy was dragging around until she realised it was Marcus!<br>\r\n  She covered her mouth with her hand as she smiled ear to ear thinking how cute Marcus really was and surprised at just how much she hid watching her young boobs bounce like crazy not being bound.<br>\r\nWhen marcuses eyes met Ms Darwin's it was a good thing that his balls were gone because it would of felt like they were being ripped off if he had any looking like this in front of her!<br>\r\n  Ms Darwin mouthing \"I'm proud of you\" in only her sexy sort of way to Marcus made him feel 2\" tall with his tail between his legs.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1603121880,
            "id":2924720,
            "title":"4th morning since Shari cast her spell!"
        },
        "11112111121112":{
            "author_id":"poisonmushroom",
            "author_name":"Poison",
            "choices":[
                "Time too start acting and dressing right",
                "Talk to Hanna alone for some magical help",
                "You choose?"
            ],
            "content":"<div class=\"\"><div> <span>Ms Darwin had some concerns about the changed Marcus/Marcia as she called Hanna to meet with her that next day knowing she was technically his closest guardian. <br>\r\n  Had Shari not put this spell on him things might have gone unnoticed with just a vagina. In her anger she made sure to bind this spell to him with more magic. He...she was now stuck as a girl forever! Even magic couldn't help but to make it worse!<br>\r\n   Shari seen it as no big deal \"so what now he has a cunt \" he acts like he had one anyhow. As a young developing girl Marcus was now what he used to dream about. <br>\r\n   He was also what other boys were now beginning to notice and talk about let alone dream about. Most seen him as some confused goth chick now that was acting like a boy!<br>\r\n  Even though he had spent years at this school as just another boy eyes were quickly seeing something different in just the last few days and believing more in what they saw now then before.<br>\r\n  Even in gym wearing boys shorts his thick thighs and wiggling ass were impossible to hide from teenage boys eyes..did I forget breasts...no and neither did they without a binding Marcus would have no problem filling out even Ms Darwin's bras<br>\r\n  This was also the reason for her asking Hanna to come in...now that Marcia was out she needed to start dressing.ladylike because of the attention boys were suddenly giving...<br>\r\n  Not all good either some calling Marcus a dyke now and being with Amy didn't make matters any better most seeing goth's as freaks also..Amy was actually very accepting of the female Marcus<br>\r\n  Losing your man card was making it hard for Marcus and being given a girls card as replacement just wasnt the same!<br>\r\n   Crossing through the park to get to the school Shari couldn't help herself as some young men whistled then yelled \"sluts\" to her and Hanna.<br>\r\n<br>\r\n\"Respect...something they need Hanna don't you hate it when they think they're going to hump your leg but we're the sluts\"<br>\r\n<br>\r\nWith that Shari was the first to turn and point to them as they suddenly looked down at their feet....<br>\r\n  Now rooting into the ground they couldn't move as they're legs began to swell and turn woody as bark formed.splitting their clothes off to fall loosely on the ground.<br>\r\n  As the wood spread up stretching  their body and limbs into real limbs their movements slowed stopping completely as they turned into dogwood trees.<br>\r\n  Lucky for them they were now rooted in a well walked part of the park. This would be important for their fates because in order to be freed from their woody states they had to be pissed on 666 times.<br>\r\n   Dogs or human it didn't matter but they were still sure to be there for well over a year and have plenty time to think.<br>\r\nIn no time Hanna and Shari were walking in ms Darwin's room.<br>\r\n<br>\r\n\"Its good to see you Hanna...and Shari..both of you look good.  I'm sure you know why I asked you in.. We need to help your cousin adjust...<br>\r\n  You know now that she wants to be a girl again. She's actually a little more developed then I realized.\"<br>\r\n<br>\r\nMs Darwin shook her head referring to Marcus's body as she went on<br>\r\n<br>\r\n\"I really think if you got her some fitted white shirts to wear with the girls skirts it would be best. For girls like us with big breasts they make buttoning so much nicer without popping open as much.\"<br>\r\n<br>\r\nHanna smiled nodding but it was Shari to speak up<br>\r\n<br>\r\n\" Yes Marcia is going to be a big girl like her cousin...believe me we'll take care of her... We've all been through it\" <br>\r\n<br>\r\n\"If you like you can check her out early today and get things done...from her schedule she's in gym now if you want to get her\" <br>\r\n<br>\r\nShari was quick to speak up enjoying every minute of what she caused for poor Marcus<br>\r\n  <br>\r\n\"Yes...let's surprise her\"<br>\r\n<br>\r\nAs Hanna and Shari walked the halls to the gym they were getting plenty of looks from especially the boys as they chatted louder then they should have been.<br>\r\n<br>\r\n\"Omg MS Darwin is a hottie now, no wonder Marcus was getting a hard on about her...was...  Lol \"<br>\r\n<br>\r\nShari gave Hanna a poke realising the joke she made about Marcus just before they got to the gym standing on their toes to look through the windows high on the wooden doors<br>\r\n<br>\r\n\"I don't see Marcus Shari\"<br>\r\n<br>\r\n\"There she is,right there see....that one with the big ass wait till she turns around she's talking to that girl who came to the apartment\"<br>\r\n<br>\r\n\"OMG...that is him... But he looks so cute in those shorts though!<br>\r\n<br>\r\nMarcus was more then aware of the changes on him but knew he was powerless to stop them now. At this point there's no way he'd piss off Shari or try an test her again.<br>\r\n  She's already shown just how ruthless she can be if mad!  This magic stuff was really going to her head...but what could be done?<br>\r\n  </span></div></div>",
            "created":1603130100,
            "id":2924799,
            "title":"Shari and Hanna...more magic"
        },
        "111121113":{
            "author_id":"secretgoat",
            "author_name":"Ralsei",
            "choices":[
                "She automatically does the deed",
                "She has to agree to those terms first "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“Marcus has to get huge DD boobs and wide hips and a very fat butt until I say so. And you will want it And really like to change until I say you don’t.”</span></div></span></div>",
            "created":1598763600,
            "id":2894426,
            "title":"Something else"
        },
        "112":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Hannah and Shari see you with their book",
                "The book has a protection spell on it",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Hannah and Shari were out for the night, clubbing like they usually did on the weekend. While you were home on your laptop, doing a school assignment. You needed to print something out to continue your work. Hannah mentioned having a printer, though she said it was was stored away because they didn't have the space or used it enough to keep it out all the time. You were told that if you ever needed it to ask her to get it for you but she wasn't at home and you needed it now.<br>\r\n<br>\r\nYou sent a text asking where the printer was and when you didn't get a response, So you tried calling her and she didn't pick up. You waited for five minutes before trying to find the printer yourself.<br>\r\n<br>\r\nThe reason you had to ask is because it belonged to Shari and so it was in her room. You really needed to get this done now so there was no time to wait for a response so you entered Shari's room without permission, she would kill you if she knew, especially because you were going through her things. But with any luck, you'd have it set up and print out what you needed, without her ever knowing.<br>\r\n<br>\r\nYou went to her closet and found the printer on a shelf, though it what was next to it grabbed your attention. It was an old leather bound book decorated in gems. You felt a power radiating from it and it seemed to be calling to you. You ignore the printer and reach for the book instead.</span></div></div>",
            "created":1592197200,
            "id":2851682,
            "title":"You accidentally discover their secret"
        },
        "1122":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Hannah and Shari",
                "You",
                "All three of you"
            ],
            "content":"<div class=\"\"><div> <span>The book feels cold to the touch, yet if also weight nothing. The cover is blank, besides the the glowing red circular gem on the front. The book seems to be whispering to you, asking for you to open it, begging for you to read it. You are in its thrall and so you open it and begin reading.<br>\r\n<br>\r\nThe first page is a contract, it mentions gaining supernatural powers under the condition you keep them silent and you transform one person a week, there's other writing there but you can't read it. The next page is a list of names of everyone who has signed the contract. All but two names are crossed out, indicating their contracts have ended. The two at the bottom read, Hannah and Shari.<br>\r\n<br>\r\n\"He's got the book!\" you are interrupted by Hannah's voice. She sounds horrified.<br>\r\n<br>\r\n\"Does this mean what I think it means?\" Shari asked.<br>\r\n<br>\r\nThe book closes itself and the the red gem glows brighter, it floats into the middle of the room and releases a spell as it punishes the violators, it punishes...</span></div></div>",
            "created":1592283600,
            "id":2852173,
            "title":"Don't mess with the book"
        },
        "11221":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Old Hags",
                "Animals",
                "Objects"
            ],
            "content":"<div class=\"\"><div> <span>In the contract signed with blood, a contract neither Shari or Hannah read to its fullest, it mentioned what would happen if someone else discovered and opened the book. First of all their contract was now terminated and their names crossed out. Secondly they would be changed in a painful way. Their lives would never be the same.<br>\r\n<br>\r\nThe book levitated into the air and the gem aimed at both Hannah and Shari, two beams of red energy hit them, and began reshaping their bodies. You tried to help them but the beam sent you flying backwards. You could only watch in horror, feeling responsible for what was about to happen.<br>\r\n<br>\r\nThe two girls were transformed into...</span></div></div>",
            "created":1598504400,
            "id":2892368,
            "title":"Contract over"
        },
        "112212":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Familiars",
                "Pests",
                "Livestock"
            ],
            "content":"<div class=\"\"><div> <span>Under penalty of discovery, witches were contracted to lose their human form. They would spend the rest of their days as animals. Though 'the rest of their days' could vary significantly. Sometimes they would keep their human lifespan. Other times they'd take on the lifespan of the animal they became. In some rare cases they could be made immortal.<br>\r\n<br>\r\nWhen a witch gets transformed by the book, there's usually a particular purpose in mind, either for usefulness or a severe punishment. <br>\r\n<br>\r\nThey could become familiars, where they could still communicate with magic users and themselves.<br>\r\n<br>\r\nThey could become pests, such as flies and cockroaches, this was especially horrible when given either the short lifespan or long lifespan.<br>\r\n<br>\r\nThey could also become live stock, either to be butchered for meat, bred or if they were lucky produce milk or eggs.<br>\r\n<br>\r\nAfter scanning Hannah and Shari, the book decide that it was best that they became....</span></div></div>",
            "created":1598763600,
            "id":2894453,
            "title":"Animals"
        },
        "113":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Shrunk",
                "Turned into a Mannequin",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Let me do it please...\" Shari was begging Hannah about something as you got home from school. \"You know I can't do it without you...\"<br>\r\n<br>\r\n\"And I told you, he was off limits...\" Hannah replied in a way that this wasn't the first time they've had this discussion. \"I also don't trust you to help me change him back.\"<br>\r\n<br>\r\n\"Oh, that's not fair, when haven't I....\" Shari paused. \"He's home.\"<br>\r\n<br>\r\nHannah and Shari often had the odd conversation like this, they'd be talking about you or a guy or something else. A few things would get mentioned like change and transform but then they'd stop when they knew you were around. You tried asking Hannah about it once but she never gave you an answer and so you learnt to ignore the conversation. Nothing usually came from them anyway, whatever Shari wanted to do involving you, Hannah would shut down.<br>\r\n<br>\r\nThough tonight would be different. You were laying in bed after studying all night, it was easy to focus because Hannah and Shari had been out to the clubs again.<br>\r\n<br>\r\n\"Come on, Hannah, don't you want your bed back?\" You heard Shari say as they got back in the door.<br>\r\n<br>\r\n\"I do...\" Hannah's words were a little slurred and she was stumbling over them. Hannah was drunk. This wouldn't usually be too bad, except sometimes she'd climb into the bed with you. Though Shari didn't sound drunk at all and when you mixed a sober Shari with a drunk Hannah, Hannah would usually do whatever Shari suggested.<br>\r\n<br>\r\n\"So let me change him and we can both have our own beds....\" Shari suggested.<br>\r\n<br>\r\n\"Okay...\" Hannah agreed to it this time, just wanting to go to bed and to have Shari stop talking.<br>\r\n<br>\r\nThey both entered Hannah's room and see that you're there. You pretend to be asleep though. They begin to chant some weird phrase and a moment later you are....</span></div></div>",
            "created":1592456400,
            "id":2853446,
            "title":"Three People 2 beds"
        },
        "114":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "A pregnant man",
                "An attractive woman",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>This was one of the few times you managed to get some peace and quiet. It was Friday after school, which meant Hannah and Shari were out clubbing, giving the small apartment to yourself. It also meant that when they came back things weren't going to be peaceful as they usually came back drunk or with a guy, if they even came back at all.<br>\r\n<br>\r\nWhile you found it peaceful, you couldn't relax just yet as you had to get your homework done and this was the best time to do it and concentrate at the same time. You were just finishing up with your biology homework when you heard a knock on the door.<br>\r\n<br>\r\nIt wasn't a polite knock either, whoever was out there wanted to get your attention straight away. It was most likely the landlord or something, seeing as people needed to be buzzed in.<br>\r\n<br>\r\n\"I'm coming,\" you yelled as you put away your school work and opened the door.<br>\r\n<br>\r\nWhen you opened the door you were surprised to see....</span></div></div>",
            "created":1582779600,
            "id":2793650,
            "title":"A Strange Knock on the Door"
        },
        "1141":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Hannah",
                "Shari",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You opened the door to see a man in his early twenties, already starting to go bald, and with a large stomach standing in the door. <br>\r\n<br>\r\n\"Look I'm sorry okay, I'll use protection next time... just please undo this curse...\" the man began to cry. \"I don't want to have a baby...\" He then looked up and noticed he wasn't talking who he thought he was.<br>\r\n<br>\r\nYou looked down and noticed that his 'gut' was too low for it to be fat and his belly button was sticking out. The man wasn't fat he was pregnant.<br>\r\n<br>\r\n\"You're a guy...\" he stated like you shouldn't be. \"I don't know if you're the broad that did this or just another one of their victims. Either way can you let me in...\"<br>\r\n<br>\r\nYou hesitated for a second but while you were confused, you were also curious about this pregnant man standing in the door way and how Hannah or Shari might be involved, you also didn't want to make a scene so you stepped aside without saying a word.<br>\r\n<br>\r\n\"So were you the lady I slept with?\" He asked.<br>\r\n<br>\r\n\"What? No...!\" you retorted.<br>\r\n<br>\r\n\"Calm down, was just making sure,\" he waved his hands in the air before waddling over to the couch and sitting down. \"If she could do this,\" he waved his hands over his gut. \"Then she could probably turn herself into a man or a woman... did I sleep with a man?\"<br>\r\n<br>\r\n\"What is going on? Who are you and how are you pregnant?\" You finally asked.<br>\r\n<br>\r\n\"This is going to sound crazy, but the chick that lives here, has magic or something... I hooked up with her about six months ago, one night stand sort of deal, you know how it is. I didn't use protection, I never do. Anyway a couple of months after that night, I started getting sick and put on weight. At least I thought that's what was happening. By the time I figured out what was happening my dick was gone and I had a cunt. Anyway I traced the woman back here, hoping she could undo this... I can't give birth, I'm a man.\"<br>\r\n<br>\r\nYou didn't know what to say or think. Were Hannah and Shari really capable of this and if so which one did it?</span></div></div>",
            "created":1591851600,
            "id":2849984,
            "title":"A pregnant man"
        },
        "1142":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You try to explain that there's a misunderstanding.",
                "You aren't going to turn down free sex.",
                "Hannah and Shari come home."
            ],
            "content":"<div class=\"\"><div> <span>The woman looked at you for a moment, confused as she barged in and shut the door for privacy. Even though she looked pretty, her hair was a mess, she was wearing men's clothing that swum on her and she wasn't wearing a bra.<br>\r\n<br>\r\n\"Fix this, now!\" The woman snapped as she waved her hands over her body. You weren't sure what you were meant to be fixing though, she was a mess after all.<br>\r\n<br>\r\n\"I... I don't understand. Who are you, what are you doing here?\" You asked.<br>\r\n<br>\r\n\"I'm here because, you did this to me, now undo it!\" She was losing her patience.<br>\r\n<br>\r\n\"What exactly am I meant to be fixing?\" You tried to keep a normal tone, to see if you could calm this crazy woman down.<br>\r\n<br>\r\nShe just glared at you with angry eyes. \"Fine, I'll play your game. I want you to turn me back into a man... there I said it.\"<br>\r\n<br>\r\n\"Um...\" you were dumbfounded, you didn't even know what to say to that.<br>\r\n<br>\r\n\"Don't play dumb, you did this to me, I know you did. Now you're pretending to be a man so you can play dumb. I looked at your ID when you were in the shower, I know this is your address. Pretending to be a man, after you turned me into a woman isn't going to trick me.\"<br>\r\n<br>\r\n\"Um, I've always been a man....\" You didn't know what else to say in response to that.<br>\r\n<br>\r\n\"Wait, I fucked a man last night?!\" She screamed at you. \"This is some twisted fucking shit. Let me guess, you lure me in as a girl, have sex, turn me into one just so you can fuck me in your original body?\" She surmised. \"Fine you twisted fuck, if that's what it takes for you to change me back, I'll do it.\"<br>\r\n<br>\r\nYou stood there frozen for a moment, this lady was clearly on drugs. You watched as she stripped until she was completely naked. \"Let's get this over with.\"</span></div></div>",
            "created":1582779600,
            "id":2793654,
            "title":"An attractive woman"
        },
        "12":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She messes with you",
                "She uses it for self improvement",
                "She takes care of all your bullies",
                "Turns out she's the jealous type",
                "More options"
            ],
            "content":"<div class=\"\"><div> <span>You've known Amy for a number of years and she's in several of your classes, though while you sit in the front of the classroom, so the teacher can catch anything Tiffany's lackeys do to you easier. Amy has always sat in the back. You've never really heard her talk or speak up in class and she's never given an oral presentation.<br>\r\n<br>\r\nShe never interacted with you in the past and you never saw a need to approach her. It was just luck that one day when you were in the library, she couldn't reach a book on the higher shelves and you managed to help her. \"Thanks,\" she said quietly. \"The Librarian is always putting these books out of my reach, I don't think she likes me reading them.\" After that you two struck up a conversation and spoke every lunch break. It was only last week she decided she wanted you two to be a couple, though you hadn't actually gone on a date or anything yet.<br>\r\n<br>\r\nWhen you entered the library today, Amy didn't acknowledge you straight away, this was common on some days when she was too focused on a book. Today's book just so happened a black leather grimoire with blood red jewels on the cover. The book didn't have a title and had a dark aura about it. You ignored it for now as you sat down next to Amy.<br>\r\n<br>\r\nAmy turned to face you, revealing a devilish smile. \"Marcus!\" She exclaimed with more excitement than you've ever heard from her before and the first time ever she got a 'ssh' from the librarian. \"You'll never guess what I found... a spell book. Can you believe it? A real life spell book.\" she didn't even wait for you to give an answer. <br>\r\n<br>\r\n\"Cool,\" you had grown to appreciate Amy's interest in the occult. \"It's really well detailed, that's for sure, but I doubt it's a...\"<br>\r\n<br>\r\nAmy raised her hand. \"I thought you'd doubt it's really magical. Let me prove it to you.\" Amy placed a pen in the center of the table and begun reading from the book. Her words made no sense but there was static in the air as all the hairs on your body began to rise and a light flickered overhead. You were with the light for a moment you failed to see the pen begin to float in the air.<br>\r\n<br>\r\n\"Marcus, look.\" Amy grabbed your attention, however she lost concentration of her spell and you only saw the pen float in the air for a brief moment, before it went flying across the library.<br>\r\n<br>\r\n\"No way!\" You exclaimed as you tried to grab the book to have a look at it yourself. As soon as you came in contact with it though, you felt burning heat in your finger tips and quickly pulled away. It wasn't enough for you to cry out in pain but it hurt nonetheless. You then looked at your hand and saw your finger tips were red raw.<br>\r\n<br>\r\n\"Sorry Marcus, I should've warned you\" Amy held your hand and waved her other over it, muttering something which soothed the pain. \"The first thing I did with this book was put a ward on it, no one but me can touch it or read it.\"<br>\r\n<br>\r\n\"Smart,\" you praised with a tone of slight disappointment as you looked at your healed hand. \"So now that you've got this thing, what are you going to do with it?\"</span></div></div>",
            "created":1563253200,
            "id":2687589,
            "title":"Amy"
        },
        "121":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Detaches your dick",
                "Turns you into a frog",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm going to use it on you,\" Amy stated with a playful smile. \"Some of these spells are good to try like the levitating pen thing, but a lot are meant to be used on other people. Your the only person I know, so I figured you'd make for a good test subject. Using magic on a random person would be mean.\"<br>\r\n<br>\r\n\"You could always use it on Tiffany...\" You half joked, not sure if you wanted to be Amy's test subject for magic.<br>\r\n<br>\r\n\"I have no grudge against Tiffany but I'm willing to help you get your revenge on her. Though it's going to cost you a spell,\" Amy teased. It was the first time she had shown this much emotion, she was really coming alive and enjoying whatever she had planned in her head.<br>\r\n<br>\r\n\"Fine, one small spell...\" you surrendered.<br>\r\n<br>\r\n\"Oh no, we're not going small. I'm a witch now, I need to do something a real witch would do...\" Amy didn't even give you a chance as she started casting a spell, this one required more energy which caused the whole library go dark for a minute. Amy...<br>\r\n<br>\r\n</span></div></div>",
            "created":1591851600,
            "id":2849566,
            "title":"She messes with you"
        },
        "123":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "All the bullies become a copy of Tiffany",
                "It's a mass body swap spell",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>\"I've seen how everyone treats you, especially those who are close to Tiffany. Also I have heard rumors of what made her hate you in the first place but you were a kid, you didn't understand,\" Amy says with a smile. \"So I think I'm going to have to teach everyone who's messed with you a lesson.\"<br>\r\n<br>\r\nYou give Amy an awkward smile, you appreciate the effort she's about to go through for you, however there's an uneasiness with what she said. You don't know how powerful she is and what she might do to everyone for your sake. Though a level of morbid curiosity was excited to see what Amy had in store for your tormentors.<br>\r\n<br>\r\n\"Don't do anything too terrible,\" you ask her.<br>\r\n<br>\r\n\"Don't worry they'll live,\" Amy promises, it isn't much comfort as, at least in media, there's still a lot of nasty spells that meet those parameters. A large chunk of the school could be toads or bugs and they'd still be alive.<br>\r\n<br>\r\n\"Now lets see...\" Amy flicks through the spell book. \"Yes this is perfect.\"<br>\r\n<br>\r\nThe spell Amy plans to cast is a unique one, one that will have interesting results.</span></div></div>",
            "created":1563426000,
            "id":2688792,
            "title":"She takes care of all your bullies"
        },
        "1231":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "It works as intended as the School gains 30 more Tiffany's",
                "Amy is a little sloppy with the wording, causing more people to become Tiffany",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>\"Why that spell?\" you ask puzzled as Amy reveals her plan for a mass duplication spell.<br>\r\n<br>\r\n\"It's mostly harmless and there's no better way to mess with Tiffany or her lackeys. Tiffany will no longer be unique and just be one of many with her appearance while, some of the jocks will be turned to women. Though I'm sure some of her other friends wouldn't mind having a body like hers.\"<br>\r\n<br>\r\n\"So they'll just look like her? They wont have her personality?\" You ask a little hesitant. The idea of more than one physical copy of Tiffany does excite you, but you wouldn't be able to deal with more than one of her personality wise.<br>\r\n<br>\r\n\"I wouldn't do that to you, though that could really mess her up even more, if they all thought they were the original. It's just going to be a physical change, nothing mental.\"<br>\r\n<br>\r\nYou feel a bit of guilt when Amy explains that. She was able to take away Tiffany's privacy completely and change the lives of a lot of people. All for your sake. \"Are you sure about this? I mean isn't this going a little too far? This would destroy Tiffany and a few of the people you change.\"<br>\r\n<br>\r\n\"And?\" Amy asks without a care as she begins to cast the spell.</span></div></div>",
            "created":1563426000,
            "id":2689055,
            "title":"All the bullies become a copy of Tiffany"
        },
        "12312":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You get caught up in the spell",
                "Everyone get caught up in the spell",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>It's no use, Amy wants to cast this spell and she's going to do it with or without your blessing. So you can only hope what she does doesn't have too much of a negative impact of those involved.<br>\r\n<br>\r\nShe begins saying the words of the spell as the lights in the library flicker like before, however this time they blow, leaving the two of you in complete darkness besides the slight glow of the magic book.<br>\r\n<br>\r\n\"There now everyone who's ever been mean, teased or tormented you will become a copy of Tiffany,\" Amy informs you as she closes the book.<br>\r\n<br>\r\n\"Wait what? I thought you said only Tiffany's lackeys will be affected.\"<br>\r\n<br>\r\n\"This was easier to cast and it punishes everyone that's ever been mean to my man,\" Amy says as she pinches your cheek.<br>\r\n<br>\r\n\"Amy, please tell me the wording you used...\" you realize the bigger impact her spell might have.<br>\r\n<br>\r\n\"Like I said, anyone who's teased, tormented or been mean to you.\"<br>\r\n<br>\r\n\"Amy... teased and torment could be in a jest, which includes my family. Mean, certainly includes Hannah and her roommate. I've said mean things about myself, does that mean I'm going to become Tiffany too? And what about you, you've teased me.\"<br>\r\n<br>\r\n\"Yeah, though I was stirring you, I wasn't trying to be mean,\" Amy countered.<br>\r\n<br>\r\n\"Which is what I said, this is magic it might've not known your intentions.\"<br>\r\n<br>\r\nAmy goes silent as she realizes what she's done.</span></div></div>",
            "created":1563944400,
            "id":2691382,
            "title":"Amy is a little sloppy with the wording"
        },
        "1233":{
            "author_id":"sirusblue",
            "author_name":"ChikenLegs",
            "choices":[
                "Suprise ! as Tiffany hate Amy",
                "Tiffany is transfered to another body",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry Marcus, It seems my power couldn't affect many people. So, I may I just cast a spell only on Tiffany.\" Said Amy as she remembers her own limitation. Despite her bragging, it seems Amy is just a newbie. This brought a sigh of relief to you as she wasn't as powerful you thought she might be. Well, at least the school is safe.<br>\r\n<br>\r\n\"So, I will try to cast a spell to make Tiffany's soul to live in the body of the people she hates.\" Said Amy with a grin as she flips the book page to the spell she wanted. She really excited to test out her power.<br>\r\n<br>\r\n\"Amy, I don't know if you realize or not, but I'm one of the people she hates too and it was to a staggering degree.\" Said you to the excited Amy. Your word pours a bucket of cold water to Amy's excitement as her smile fade and her shoulder fall in dejection.<br>\r\n<br>\r\n\"Maybe try another spell which doesn't include me as the victim.\" Said you as you console Amy with a smile. Amy rise back up by this as she remembers a variant of the same spell, but target only female. Amy flip her spellbook and found the spell she looking for. She read that this spell will make the target's soul to inhabit the woman she despises .<i>Should be good enough as Marcus isn't woman</i>.</span></div></div>",
            "created":1598677200,
            "id":2893993,
            "title":"Amy isn't powerful enough"
        },
        "12331":{
            "author_id":"sirusblue",
            "author_name":"ChikenLegs",
            "choices":[
                "Tiffanay has possess Amy",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Amy chanted the spell chant and for a few moments the spellbook glow. After Amy stopped chanting the glow dimmed until it disappears. You panic as this glow might be too conspicuous inside the library. You were afraid that someone would notice this anomaly.<br>\r\n<br>\r\nTo your relief, no one seems to notice you and Amy. They either too busy with their book or just plain ignorant. You sigh a relief. Your eye then turns to look at the book that stopped glowing and Amy again. You cast a curious look at the book as it seems that it really was magical.<br>\r\n<br>\r\nAmy squealed in happiness as she thought or felt that her spell was a success indicated by the glowing book. \"Marcus I think I succeed in casting this spell,\" said Amy with happy tone.<br>\r\n<br>\r\n\"So, what spell did you cast?.\" Said you as with a curious look.<br>\r\n<br>\r\n\"It was the same spell, like the one I said, but this time it more gender-specific. Don't know why they made this kind of spell. Now Tiffany will still live in the body she hates, but it was female.\" said Amy as she bragged about the spell and the fact she could cast a magic spell. She smiles proudly and puffed her huge chest. For a sec that distracts you as you focused at her jiggling boobs.<br>\r\n<br>\r\n\"Wait, so Tiffany will live as who exactly? and what exactly did you mean by Tiffany living inside other bodies?.\" Said you as you were still confused by the vague description.<br>\r\n<br>\r\n\"I don't know, I just the spell description and never actual tried it before. Guess we just wai-.\" Said Amy as she cut off mid-sentence. Her eye turned into a blank look as she suddenly became silent. She just stood there staring vacantly.<br>\r\n<br>\r\n\"Amy? Amy? what's wrong ?.\" Said you as you waved your hand in front of her face. She didn't respond or blink. You grab her shoulders and shook her body. As you shook her, she suddenly comes to.<br>\r\n<br>\r\n\"Stop it. Don't touch me. Where am I ? who are you ?.\" Said Amy as she back away from you while hugging her body. Her voice contains confusion as she looks around her surrounding. Her gesture seems like she really was confused.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1598677200,
            "id":2894347,
            "title":"Suprise ! as Tiffany hate Amy"
        },
        "124":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Have you seen any of them naked?",
                "Do you think any of them are prettier than me?",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"How about a truth spell?\" Amy asked looking you in the eye.<br>\r\n<br>\r\n\"Um, you mean on me?\" You replied uncomfortable with the idea.<br>\r\n<br>\r\n\"Sure why not? It should be alright if you don't have anything to hide,\" Amy was already flicking through the book and came across the page.<br>\r\n<br>\r\n\"Okay, I guess...\" you shift nervously as Amy casts the spell.<br>\r\n<br>\r\n\"Let's start with something simple... do you love me?\" Amy asked with a happy smile.<br>\r\n<br>\r\n\"We haven't known each other for long, but I care about you and want to be with you, I wouldn't say I love you just yet, however I'm confident as we build our relationship in a positive way, I will love you,\" your admitted. Though given the look on Amy's face it wasn't the answer she was looking for.<br>\r\n<br>\r\n\"I guess that's fine...\" she said disappointed. \"So you don't love me yet but you have a crush on me?\"<br>\r\n<br>\r\n\"Yes,\" you say without hesitation.<br>\r\n<br>\r\nAmy gave you a pleasant smile as she bit her lip and played with her short hair. \"Do you have a crush on anyone else?\" She asked playfully and you wish she hadn't asked you that.<br>\r\n<br>\r\n\"Yes,\" you admitted trying to advert your gaze from her.<br>\r\n<br>\r\nAmy's mood soured instantly as she gave you an angry look. \"Who?\" she asked coldly.<br>\r\n<br>\r\n\"Hannah, Shari, Tiffany and Ms Darwin,\" you blurt out hoping no one else heard you.<br>\r\n<br>\r\n\"The biology teacher and your bully?\" Amy tilted her head confused. \"Who are the other two?\"<br>\r\n<br>\r\n\"Hannah is my cousin and Shari is her roommate,\" you covered your mouth embarrassed by the admission you had a crush on your cousin.<br>\r\n<br>\r\n\"You have a crush on your cousin?!\" Amy said it loud enough that a couple of heads turned, though that was more at Amy's outburst rather than the words she said.<br>\r\n<br>\r\n\"It's a physical crush, they all are. You're the one who I care about on more than a superficial level.\" While Amy was asking you questions, you were still about to add your own truths.<br>\r\n<br>\r\nThat comment calmed her for a second, though she still wasn't pleased. You could tell she was thinking something when she asked you a question you didn't want to answer.</span></div></div>",
            "created":1582779600,
            "id":2793719,
            "title":"Turns out she's the jealous type"
        },
        "13":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Meet up with Amy",
                "Go home",
                "Go to your next class",
                "Go to the bathroom",
                "More options"
            ],
            "content":"<div class=\"\"><div> <span>You have know Tiffany longer than any other student in the school, she was your first crush and when you were younger you were determined to have her be your girlfriend. Of course you went about that in the worst possible way and now she hates your guts. You don't blame her though, what you did was very stupid and you still feel the shame of it.<br>\r\n<br>\r\nYou were eight years old and started to find the idea of a girlfriend appealing. Tiffany caught your attention instantly, with her bold blue eyes and strawberry blonde hair tied up in a ponytail, a style she still prefers. You heard a rumor on the playground about how if you were the first boy to see a girl's naughty parts she had to be your girlfriend. That was enough for eight year old you and you went up and pulled down Tiffany's skirt and underwear giving you a clear look. You were so certain she'd have to be your girlfriend now but all it got you was a slap across the face, a week suspension (expulsion was on the table however the excuse boys will be boys and the fact you were a well behaved student, saved you), a terrible nickname that suck with you for many years and an enemy for life.<br>\r\n<br>\r\nStill the sight of Tiffany's privates never left your mind and she had only grown more stunning as the years went by. Of course you learnt long ago to avoid even glancing in her direction. She had grown to be quite influential over the years and if she even caught you looking her way, you'd find yourself being tripped over at lunch time, getting shoved to the ground, your possession getting stolen and much much more. It was never Tiffany directly though she was too smart for that.<br>\r\n<br>\r\nOver the past few month though, things seem to have gotten better, the random attacks have stopped and she seems to be tolerating your existence. While she hasn't really spoken to you, other then in class when required, people who used to ignore you at her behest have been a bit more chatty.<br>\r\n<br>\r\nYou didn't know if this was because you were adults now, because you were moving and would soon be out of her life, or if she was trying to get you to lower your guard for one final act of revenge.<br>\r\n<br>\r\n---------------------------------------------------------------------------- --------------<br>\r\n<br>\r\n\"How's it going Marcus?\" Tiffany came out of no where as she lent against the locker next to yours. She ignored your shocked reaction and continued talking as if everything was fine. \"You wouldn't believe what I've been up to on my summer break.\" She stepped forward and whispered into your ear. \"I've been studying magic and I'm now a witch.\"<br>\r\n<br>\r\n\"I'm sorry what?\" You questioned as you took a step backwards. \"You're a witch???\" This had to be a prank.<br>\r\n<br>\r\n\"Ssh, not so loud\" she covered your mouth. \"Anyway I wanted you to be the first to know,\" her pleasant expression grew somber as she looked at you with the same look she has given you over the years. \"That way when your life becomes a living hell you'll know it was me,\" she said with a cold and harsh expression. \"Anyway fun talking to you, bye!\" She went back to her chipper self and walked off.<br>\r\n<br>\r\nFiguring Tiffany was just finding new ways to torment you, you brush it off and continue with your day.</span></div></div>",
            "created":1557723600,
            "id":2659312,
            "title":"Tiffany"
        },
        "131":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Amy begins to transform",
                "You do something to Amy",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>It was the start of lunch and so you decided to go meet up with Amy, she was of course in the library as usual, sitting in her usual corner. She didn't usually eat during lunch and preferred to spend her free periods alone. You used to visit the library to get away from Tiffany's minions and that's how you first met Amy.<br>\r\n<br>\r\n\"What are you reading today?\" you asked Amy as you sat down, sneaking a bite to eat. You weren't meant to eat in the library but you hadn't been caught yet.<br>\r\n<br>\r\nAmy put the book down and gave you a slight smile. \"A history of the plagues,\" Amy replied as she went back to reading.<br>\r\n<br>\r\nWhen you first met Amy, you would've thought she was reading it for a school assignment or study but now you knew those where the types of books she liked to read. Once you had finished eating, Amy reached down and grabbed the fantasy book you were half way through and passed it over to you.<br>\r\n<br>\r\nThis was how you spent your breaks, just sitting in the library, reading in silence with Amy. Occasionally you'd talk about the subject of the book when it was finished or other interests.<br>\r\n<br>\r\n\"So Tiffany spoke to me earlier,\" you informed Amy, she put down the book and looked over to you, not saying a word. \"Yeah at first she seemed nice but then she told me she was a witch and threatened to destroy my life.\"<br>\r\n<br>\r\n\"Interesting, did she tell you anything else about being a witch?\" Amy was generally interested now. Not about the interaction with Tiffany but more so the witchcraft.<br>\r\n<br>\r\n\"Well she said she had to study it, also it only took her summer break to become one, so it doesn't seem to take too long to learn.\" You didn't believe in that sort of stuff but you knew Amy did.<br>\r\n<br>\r\n\"That or she has a natural talent, hmm, I wonder what type of witchcraft she studied, I've tried a few but they've never really panned out.\"<br>\r\n<br>\r\n\"I guess you're going to have to ask her that. Besides I hope she was lying, I mean Tiffany with magic, that's the last thing I need.\"<br>\r\n<br>\r\n\"I suppose you're right, I mean she'd probably turn you into a toad or something. That's what I'd do if I were a witch, only I'd turn you back, she probably wouldn't\" Amy went back to reading her book.<br>\r\n<br>\r\n\"Thanks for that thought,\" you roll your eyes and for a brief second you thought you caught a glimpse of Tiffany.</span></div></div>",
            "created":1557723600,
            "id":2659517,
            "title":"Meet up with Amy"
        },
        "1311":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She turns into a mouse",
                "She turns into a worm",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>You look over to see where you thought you saw Tiffany but there's no one there, only you and Amy are in the library. You feel a strange energy in the air, it's electric but also dark and foreboding, like the dark and quiet atmosphere before a storm. <br>\r\n<br>\r\nYou look over to Amy who shivers and puts her book down. She goes to say something before she starts to convulse. You rush over to her and try to comfort her as her body begins to shift before your very eyes.</span></div></div>",
            "created":1557810000,
            "id":2659607,
            "title":"Amy begins to transform"
        },
        "13113":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Amy becomes the subject of the book she was reading",
                "Amy becomes a toad.",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>You hold Amy close, and try to call for help but your voice escapes you. However you're no longer alone, standing in front of you is Tiffany.<br>\r\n<br>\r\n\"She's cute, or was cute.\" Tiffany said looking down at Amy. \"A shame really, took think she could've lived a full life if she hadn't met you. Keep that in mind as she loses her humanity just for knowing you. This is your fault.\"</span></div></div>",
            "created":1557810000,
            "id":2659615,
            "title":"Tiffany appears"
        },
        "131131":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Tiffany leaves you to wallow in grief",
                "Tiffany messes with you some more",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>Amy's entire body becomes a black liquid and flies towards the pages of the book she was reading.<br>\r\n<br>\r\n\"What did you do!\" You cry out, your voice returning.<br>\r\n<br>\r\n\"Calm down, I knew she likes to read so I made her the subject of that book she was reading, she now lives within those pages, experiencing what the characters feel.\" Tiffany picked up the book and read the title. \"Oh...\" she paused. \"Well I guess she wishes she was reading a different kind of book. That's too bad for her.\"<br>\r\n<br>\r\nTiffany throws you the book and it opens to a page with images of the Black Plague, everyone in the image is now a copy of Amy, with various symptoms. You can't help yourself as you flick through other pages, with small pox, Spanish flu and varies other viruses and diseases, every single image of a person has been changed to Amy.<br>\r\n<br>\r\n\"I wouldn't want to be in her position, experiencing all that pain. Even if I were to pull her out of the book she'd surely be scarred for life.\"<br>\r\n<br>\r\n\"Why...?\" You close the book, unable to stand seeing Amy in such pain. \"Why would you do this to her.\"<br>\r\n<br>\r\n\"Because of you, I told you I was going to make your life a living hell. I just neglected to tell you that might involve making your loved ones suffer. Your entire life and everyone in it are mine now.\"</span></div></div>",
            "created":1557810000,
            "id":2659619,
            "title":"The book of Amy"
        },
        "131133":{
            "author_id":"poisonmushroom",
            "author_name":"Poison",
            "choices":[
                "Your turn!",
                "Make a break for it before things get worse",
                "You choose?"
            ],
            "content":"<div class=\"\"><div> <span>You held Amy close until you felt a strange feeling on your face.you loosened your grip around her leaning back some to see she was soon covered in hair.<br>\r\n  No bare skin was visible as your grip loosened even more dropping your arms from around her totally now as they fell helplessly to your sides as you stood in shock starting at her new form..<br>\r\n   Suddenly a hairy hand reached to hold yours as it began to make a howling sound looking at you then Tiffany.<br>\r\n  Your mouth hung open in shock not knowing what to do now as the large gibbons monkey 🐵 now stood there in Amy's clothes hanging loosely on it. It looked between the two of you in confusion and only blinked before releasing your hand as it shook its long arms howling and grunting!</span></div></div>",
            "created":1602133200,
            "id":2917583,
            "title":"More Options"
        },
        "1312":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "I need to see yours so we're officially Boyfriend and Girlfriend",
                "I'm in love with Tiffany and I'll do anything she wants me to",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>\"Did I ever tell you why Tiffany hates me so much?\" You asked out of nowhere.<br>\r\n<br>\r\nAmy put down the book and looked over to you, \"No, I don't believe you had.\"<br>\r\n<br>\r\n\"It's stupid really, see when I was a kid, I thought to get a girl to be your girlfriend you had to see her genitals. So I pulled down Tiffany's skirt to see hers.\"<br>\r\n<br>\r\n\"Why are you telling me this?\" Amy asked shocked and a little upset.<br>\r\n<br>\r\n\"Because....\"</span></div></div>",
            "created":1557982800,
            "id":2660629,
            "title":"You do something to Amy"
        },
        "13121":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She agrees",
                "She refuses",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>\"What?\" Amy couldn't believe what you had just asked her to do. A part of you couldn't either, however you wanted to see Amy's genitals and if she didn't show you them you were through.<br>\r\n<br>\r\n\"I want to see your vagina.\" You reaffirm.<br>\r\n<br>\r\n\"Like right now? And you're being serious?\"<br>\r\n<br>\r\n\"No one's around, I mean this is as private as you can get.\"<br>\r\n<br>\r\nAmy eyed you off for a moment thinking about your request. She was taken back by it and very much unsure.<br>\r\n<br>\r\n\"Please...\" you beg her.</span></div></div>",
            "created":1558155600,
            "id":2661150,
            "title":"Show me"
        },
        "132":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You begin to change",
                "Something happens to Hannah or Shari",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The rest of the school day was uneventful as you met up with Amy and finished off your classes. Tiffany and all her lackeys had left you alone, besides from the stares and 'polite' waves. She was up to something any you knew it. Though it was now the end of the day and it was time to head back to the crappy apartment building, your cousin called home.<br>\r\n<br>\r\nIt took you a bus, then a train, then another bus to get home. By then it was almost five, if you made it on time. Being a Friday night, Hannah and Shari would be leaving for the night. You'd usually be home for an hour before they left. Hannah would still get ready in her room though and you would sometimes think they had already left and walk in on her as she was getting dressed. Though now you learnt to knock.<br>\r\n<br>\r\nYou took the stairs, not only because you were sitting most of the trip home, but also to give the girls more time to get ready. You unlocked the apartment door and saw their handbags were on the bench. Both of them were still home.<br>\r\n<br>\r\nYou drop down on the couch and catch your breath. The shower didn't seem to be running and both doors were shut so you weren't sure where Hannah and Shari were or what state they were in.<br>\r\n<br>\r\n\"Living hell.... I'm a Witch....' A chill ran up your spine as you heard Tiffany's words, in your head.</span></div></div>",
            "created":1592456400,
            "id":2853161,
            "title":"At home"
        },
        "1321":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "An Object",
                "An Animal",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As you felt the chill go up your spine, you found yourself unable to move. You tried to speak but no words came out. Your mind was racing in fear, not because you believed Tiffany but because you thought you were suffering some kind of medical episode. It was like your entire brain had shut off but you were still aware. You couldn't even feel your heartbeat or breathing.<br>\r\n<br>\r\nThe chill grew into a bubble around your entire body, one that shimmered with a green tinge. You only realized it was actually Tiffany or something else doing this to you, when your clothes disintegrated before your eyes, leaving you frozen and naked in the living room.<br>\r\n<br>\r\nThat's when the real change began as your body began to contort and reshape itself. You were turning into a...</span></div></div>",
            "created":1602687480,
            "id":2921318,
            "title":"You begin to change"
        },
        "1323":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She makes you steal their vulvas",
                "She makes you take off their heads",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You heard a knock on the door and as Hannah and Shari are busy, you go to answer it. You wish you hadn't as standing in the door is Tiffany. She doesn't wait for you to respond as she barges into the small apartment, closing the door behind her. \"So this is where you live, I was surprised when I went to your old house and no one was there,\" she sat down on the small couch and looked around, she noticed the two handbags. \"So you're not alone,\" she comments as the bags fly towards her, confirming her previous claim that she's a witch.<br>\r\n<br>\r\nYou're speechless and are too scared to move as she looked through the bags for the purses and found the IDs. \"So you're living here with you sister? No cousin.. and her friend,\" she is able to determine. \"Wait, Hannah, isn't that the person you claimed told you to do that thing to me?\" Tiffany's curiosity turned to anger as you felt a charge of electricity in the air. The bathroom door blew open and Hannah was dragged out of the room, her hair wet and half naked. She had put on her panties but her breasts were still exposed.<br>\r\n<br>\r\nHannah squealed as she was pulled out magically, then screamed when she saw you and Tiffany, she tried to cover herself up but her arms didn't move. It was then you realized that you couldn't move because Tiffany wouldn't let you.<br>\r\n<br>\r\n\"What's going on out hear?\" Shari asked as she stepped out of her room, she was fully dressed but her hair was still messy and she didn't have makeup on. Her mouth shut as she was dragged across the floor, until she was standing next to Hannah.<br>\r\n<br>\r\n\"I came to punish, Marcus,\" Tiffany informs them. \"However it seems like you're just as guilty...\" she accused Hannah. \"It was you that told him to pull down my pants wasn't it?\"<br>\r\n<br>\r\nHannah found herself able to speak again. \"What's going on? Who is this? What's she talking about... I didn't tell Marcus to do anything like... oh, you're the girl he did it to... I'm so sorry, I didn't think he'd actually do it....\" Hannah's memory of the bad advice she told you all those years ago returned. Hannah went silent again as Tiffany had heard enough, she also sensed she was thinking about Shari as well.<br>\r\n<br>\r\n\"So it was your idea,\" Tiffany spat at Shari. \"I guess I came to the right place after all.\"<br>\r\n<br>\r\nShe allowed Tiffany to defend herself. \"What are you talking about? What's going on?\" it was probably the first time you heard Shari panic. Though unlike Hannah, she seemed clueless.<br>\r\n<br>\r\n\"Let me remind you,\" Tiffany said as you were forced to approach Shari. You grabbed her skirt and pulled it and her panties down. You were then frozen again, forced to look at her crotch. \"Remember now?\"<br>\r\n<br>\r\nShari was able to talk again but she wasn't able to moved to block you from staring at her. \"You mean, Marcus actually did it? I knew he was a creep,\" Shari shut up again.<br>\r\n<br>\r\n\"I don't care what you think about him,\" Tiffany walked over to Shari, standing just behind you. \"What matters is you're the reason he did that to me, so you must pay as well.\"<br>\r\n<br>\r\nTiffany raised her hand, causing you to stand up. \"Marcus, how about you punish them?\"</span></div></div>",
            "created":1598331600,
            "id":2891188,
            "title":"Tiffany comes to visit"
        },
        "13231":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You alter their breasts",
                "You remove your dick",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"You know what to do, Marcus,\" Tiffany waits on the couch.<br>\r\n<br>\r\nYou had control of your body again and you had been given mental instructions on what you had to do to Hannah and Shari. Tiffany wanted you to do this yourself, though you knew if you didn't do it, all three of you would something something worse.<br>\r\n<br>\r\nYou looked away as you grabbed, Shari's vulva by the sides and gave it a hard tug, it came off her body, leaving her with nothing but smooth skin. You quickly put it down on the coffee table and walked over to Hannah.<br>\r\n<br>\r\nTiffany didn't force you to pull her skirt down this time. So you actively chose to do it. You felt bad stripping Hannah completely. You grabbed her privates and pulled them off as quickly as you could. You placed it next to Shari's and froze in place again.<br>\r\n<br>\r\n\"Very good,\" Tiffany smiled as she looked down at the Hannah and Shari's vulva's inspecting them. You weren't sure what she was going to do with them now, or you for that matter, you still hadn't received your punishment yet.</span></div></div>",
            "created":1598418000,
            "id":2891714,
            "title":"Stolen Vulvas"
        },
        "132311":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She wants you to remove all their features",
                "You leave with Tiffany",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"You know...\" Tiffany began as she picked up Shari's vulva with her thumb and index finger, letting it dangle in the air. \"Under the rules you gave Marcus, that would make you two his girlfriends now,\" she teased before placing it back down. \"Though I'm not sure that applies when you're no longer female.\"<br>\r\n<br>\r\nYou couldn't help but think if that was the only cause for that rule not to work, Tiffany would be your girlfriends. \"Maybe I will be,\" whispered in your ear with a smile. \"Though we aren't quite finished removing status as women,\" she grabbed you by the chin and directed your head towards Hannah's chest. \"You know what you have to do.\"<br>\r\n<br>\r\nYou could feel yourself able to move again, and Tiffany gave you a look of impatience, if you didn't do this you would be in bigger trouble. Hannah was wearing a tank top so all you had to do was lower the straps and pull it down further. You then reached behind her hair and unclasped her bra. You then lowered it and looked at her naked chest.<br>\r\n<br>\r\nYou gulped, this wasn't the first time you had seen her breasts, but it was only for a split second half the time and you certainly hadn't touched them before, now you were expected to remove them. You grabbed them with one hand each and squeezed, causing Hannah to wince. You gave them a hard tug and then dropped them, not expecting the sudden shift in weight. You looked down and saw Hannah's breasts on the floor.<br>\r\n<br>\r\nYou left them there for now and then proceeded to do the same thing to Shari. A part of you was turned on by this but it was drowned out by the horror of what you were doing to them and what Tiffany might decide to do to you.<br>\r\n<br>\r\nTiffany was delighted with the misery she had made you inflict, she didn't even need to give you a mental image or force your hand this time. For your rewards she didn't freeze you in place again.<br>\r\n<br>\r\n\"Excellent work, Marcus...\" Tiffany said as she placed her hand on Hannah's flat chest. \"Bag them up, while I decide what to do next,\" she nodded to the breasts on the ground. She placed her hand on Hannah's face and wiped away a tear. \"Don't worry, I'll take good care of them...\"<br>\r\n<br>\r\nTiffany stood back as you grabbed a bag to scoop the four breasts into. She looked down at you and then back over to Hannah and Shari, wondering what to do next.</span></div></div>",
            "created":1601787600,
            "id":2914824,
            "title":"Further Alterations"
        },
        "1323111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You get into trouble for not calling her",
                "You take a guess that because it's Friday, Tiffany will want to go out somewhere",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I don't know....\" Tiffany said, giving your work a look over. \"They are still so pretty, they could still pass as women,\" she turned to you and grinned. \"Fix it,\" Tiffany pointed towards Hannah.<br>\r\n<br>\r\nThis time she wasn't as clear on her instructions, but given that, besides their general body shape, the only other thing that allowed them to pass for women were their faces and hair.<br>\r\n<br>\r\n\"I'm sorry...\" you said, crying as you grabbed Hannah's brown locks and gave it a tug. It fell off like a wig. You pinched the top of her forehead, and pulled her face clean off. leaving her with nothing but her ears. You went over and did the same thing to Shari.<br>\r\n<br>\r\nYou placed their motionless faces on the coffee table facing straight up. They looked unnerving, devoid of emotion and just staring into nothing. Their heads were now completely smooth and egg shaped besides their ears.<br>\r\n<br>\r\nTiffany gave you a glance and you knew you had to remove those as well. You pinched the top of each ear and pulled them away. They weren't going to be able to have any life like this and you still weren't done. Tiffany cleared her throat, showing she was displeased that you were still missing something. You wondered what it could be when you noticed the nail polish on Shari's hands. Tiffany wanted you to remove anything that currently expressed their status as women.<br>\r\n<br>\r\nYou carefully laid them back on the ground, removed their clothes, and then pulled off their hands and feet.<br>\r\n<br>\r\n\"Very good,\" Tiffany gave you a kiss on the cheek. \"Maybe I misjudged you, you are certainly able to anticipate what I want. I like that in a guy. This has been fun, we should do it again sometime.\" She looked over at the featureless bodies and waited.<br>\r\n<br>\r\nTiffany wasn't going to do anything to you, you realized. She had just made you do her dirty work. She didn't even 'tell' you what to do for the last change.<br>\r\n<br>\r\n\"Don't make me say it...\" Tiffany crossed her arms waiting for you to do something. This was going to be more difficult than you thought. Tiffany had seemingly decided to spare you as her new boyfriend but now you were required to anticipate what she wanted without her saying a word. You also had a feeling if you messed up it wouldn't end well for you.<br>\r\n<br>\r\nAt least this time she gave you a clue, she had asked you to bag up the breasts, so you figured she wanted the rest bagged up as well. You had all Hannah and Shari's parts in two separate bags ready to go. Still Tiffany wasn't satisfied and you wondered what a 'boyfriend' would do. She had said it had been fun, so she wanted to go, as you guessed as her boyfriend, you should see her out.<br>\r\n<br>\r\nYou opened up the apartment door and grabbed the two bags, you escorted Tiffany down to the street when she finally took the bags off you.<br>\r\n<br>\r\n\"See you later,\" you said. She nodded, seemingly satisfied. She turned away and walked off with all that made Hannah and Shari.<br>\r\n<br>\r\nWhen Tiffany was out of your sight, you rushed back up to the apartment. Hannah and Shari were no longer frozen, though it didn't do them any good. All they could do was crawl around and flail their limbs. You wondered what was going through their minds and you weren't sure how to help them in this state.<br>\r\n<br>\r\nTiffany seemingly hated you but you were fine and instead, Hannah and Shari had paid for your sins, even if they had a part in it. The worst part was, she made you put them in this state.<br>\r\n<br>\r\nYou wondered what you were going to do about Tiffany. You were now hers to play with and one false move could put you in a similar situation to them. You just needed to keep Tiffany happy, that was easier said than done though, as you didn't know what she could possibly want.</span></div></div>",
            "created":1601787600,
            "id":2914831,
            "title":"Nulled"
        },
        "13231112":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Dinner",
                "We go to a club",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You weren't certain if this was a good idea or not, however you couldn't risk Tiffany getting angry if you didn't ask. You also didn't want to be alone with Hannah and Shari in their current conditions. They were now sitting in the living room, cuddling up to each other. On occasion they would move their arm and touch the other one with their wrist stump, just to let them know they were still there and still alive. You couldn't imagine what they were going through and you hoped you'd never find out.<br>\r\n<br>\r\nYou opened up your phone and saw that Tiffany's number had been added to your contacts. You sent a 'Hey' and held your breath.<br>\r\n<br>\r\nYou got a 'Hey' back into no time at all.<br>\r\n<br>\r\n'I know we just saw each other earlier, but it's Friday night, did you want to go out somewhere?'<br>\r\n<br>\r\n'Like a date?'<br>\r\n<br>\r\nShe didn't add anything to that question and you could feel the seconds counting down for you to answer. The problem was you didn't know how to answer that. If you said yes and she didn't want to it could spell trouble but if you said no it could be just as bad. You weren't even game to answer it with another question.<br>\r\n<br>\r\n'Yes'<br>\r\n<br>\r\nYou thought that was the safest answer.<br>\r\n<br>\r\n'Okay'<br>\r\n<br>\r\nShe replied though once again it was all one sided. Tiffany was toying with you, she was waiting for you to mess up and punish you for it, you knew it and that was torture. You were walking blind into a minefield. What's worse is Tiffany could just as easily be displeased with any answer. You were on borrowed time and you knew it. You just wondered how many people she'd take down around you first.<br>\r\n<br>\r\nYou hadn't done this before either, so you had to suggest the time and venue and hope whatever you picked, she'd let you get away with.<br>\r\n<br>\r\n'How about....</span></div></div>",
            "created":1601787600,
            "id":2914855,
            "title":"Date Night"
        },
        "132311121":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Kiss her",
                "Don't Kiss her",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You didn't want to be too careless with what you asked Tiffany to do, so you invited her out to dinner. You found a cheap enough place that you could afford it, while also not being super cheap. You told her the venue and time, she agreed to both. <br>\r\n<br>\r\nYou hopped into the shower and cleaned yourself up, you didn't want anything looking out of place that she could punish you for. You got dressed in the nicest collar shirt you could fine and put on some nice pants. You agreed to meet Tiffany at the Restaurant, which was only in walking distance for you.<br>\r\n<br>\r\nAs soon as you laid eyes on Tiffany, you realized your mistake. She stood outside the restaurant, only she didn't have her original face. Tiffany was wearing Hannah's face, you were about to go on a date while she looked like your cousin.<br>\r\n<br>\r\n\"You look lovely...\" you tried not to stare or draw attention to your displeasure as you surveyed her for other changes. The other major thing you noticed was how, much like the edges of her face, didn't quite match the skin tone of the rest of her body, neither did her breasts. She didn't say anything to you for praising her looks and instead walked beside you.<br>\r\n<br>\r\n\"Did you bring my ID?\" She asked with her original voice. You realized you fell for her first trap. She had taking Hannah and Shari's faces, so of course she would want their IDs as well.<br>\r\n<br>\r\n\"I forgot... sorry.\" You clenched up defensively, preparing for the worst.<br>\r\n<br>\r\n\"It's fine,\" she said annoyed though lucky for you, she didn't change you.<br>\r\n<br>\r\nYou wondered what game she was playing, when a man tripped and bumped into her. She looked over at you waiting for you to do something. Instead of punishing you, she had given you someone to punish on her behalf.<br>\r\n<br>\r\nShe looked at you waiting and you knew you had to do something, but what? What did Tiffany want you to do. You thought about how people often asked if someone was blind when they ran into each other and as soon as you thought about that, you watched the man's eyes go milky white.<br>\r\n<br>\r\n\"I can't see!\" he exclaimed as he stumbled around, you kept walking, trying you best to ignore him.<br>\r\n<br>\r\n\"That was a freebie,\" Tiffany informed you. \"Next time you need to actually take his eyes. In fact I'll be nice and let you know this. If you touch someone, anything you imagine them turning into, they will turn into.\"<br>\r\n<br>\r\nOf course that information came at a cost as now the person in front of you was walking slow, and you knew this was both Tiffany's doing and that she wouldn't tolerate it. You put your hand on their shoulder to say something, when all of a sudden they turned into a snail. You didn't even mean to do it, you just thought about how snails are slow.<br>\r\n<br>\r\nYou kicked the confused snail out of the way, so that Tiffany wouldn't step on it. Not to save their life but to give her one less thing to be annoyed at.<br>\r\n<br>\r\nThat was four people's lives you had changed for her sake and you knew it would be more. You counted your blessings as you were seated straight away, meaning you wouldn't have to punish the front of house staff over something trivial.<br>\r\n<br>\r\nYou sat down at the table and looked through the menu, noticing that Tiffany wasn't doing the same. It looks like you were ordering for her, luckily she currently had Hannah's tongue so you knew what she'd like. You ordered your food and to give her one less thing to have an issue with, you started some small talk. Fortunately for you, Tiffany accepted all the topics you brought up and was more than happy to engage.<br>\r\n<br>\r\nIf it weren't for her wearing your cousin's face and what she made you do, you would've actually found this night to be pleasant. Things were going smoothly until your food arrive and one of Tiffany's hairs landed on her plate. You sighed internally as you stood up and touched the waitress on the shoulder.<br>\r\n<br>\r\n\"Excuse me, but there's a hair in my...\" you looked at Tiffany wondering how she'd like to be addressed. \"Girlfriend's food.\" She gave you a polite smile.<br>\r\n<br>\r\nThis was not going to work out well for the waitress, Tiffany would want to see her punished for this, even though it was one of her hairs. She looked at the food with some skepticism and looked at Tiffany.<br>\r\n<br>\r\n\"I'm sorry but its your girlfriend's hair, I can't do anything about that...\" the waitress said as calmly as she could.<br>\r\n<br>\r\n\"Not good enough,\" you knew Tiffany wouldn't accept that answer.<br>\r\n<br>\r\n\"I know what you're trying to pull and it won't work. It's clearly one of her hairs, so you why don't you sit back down and enjoy your meal or I'm going to have to ask you to leave,\" to her credit the waitress was being very calm about this. Unfortunately for her, that was the wrong answer.<br>\r\n<br>\r\nYou grabbed her arm and the thought of a naked mole rat came to mind. Because of the hair loss and because it would be considered a pest.<br>\r\n<br>\r\nYou stood back as the waitress's form began to change and her clothes disappeared, where there was a waitress a second ago, there was now a hairless and scared rodent. Someone screamed and soon the poor mole rat was being chased out onto the streets.<br>\r\n<br>\r\nYou sat back down and looked at Tiffany's plate. Instead of risking another person, you just switched your plates instead, it was the same meal, you and Hannah equally enjoyed it. You froze as you realized what you had done, you could've just done that in the first place, now that waitress's life was over because of you.<br>\r\n<br>\r\nTiffany looked up from her food and gave you a wicked grin. This was how Tiffany intended to punish you, by turning you into someone that destroys lives.<br>\r\n<br>\r\nYou might've destroyed the waitress's life but yo at least got a free meal out of it, you and the other patrons didn't need to pay. Just another person you had affected.<br>\r\n<br>\r\n\"Thanks for the entertaining evening,\" Tiffany smiled. \"I can't wait to do it again.\"<br>\r\n<br>\r\nShe then positioned herself for you to kiss her on the lips. This was the first trap she had given you. On one hand she was currently wearing your cousin's face, so kissing her meant kissing Hannah, not only that, you suspected Tiffany would take offense to you kissing another woman, regardless if she was behind it or not. Then you could also get into trouble for not kissing her, after your date.</span></div></div>",
            "created":1601787600,
            "id":2914876,
            "title":"Out for Dinner"
        },
        "133":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You accidentally call Ms Darwin, mum",
                "Someone gets turned into a frog",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Your next class happens to be your favourite, biology. Unfortunately Tiffany is also in this class as well, though so is Amy and of course Ms Darwin.<br>\r\n<br>\r\nYou took your usual seat at the front of the classroom, which enabled you to admire Ms Darwin more and allow her to catch when someone was messing with you. Amy sat besides you and just buried her head into her work. She hadn't noticed how you look at Ms Darwin or if she did, she didn't care.<br>\r\n<br>\r\nYou felt someone tap your shoulder and you saw one of Tiffany's friends hand you a note. 'Ready for some fun?' it asked. You eyed Tiffany in the back row who just gave you a mischievous grin and a tiny wave. You brush it off for now and continue with your work.</span></div></div>",
            "created":1578459600,
            "id":2771289,
            "title":"Go to your next class"
        },
        "1331":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Unbirthing Marcus",
                "Splicing my genes with Marcus",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You continued the lesson as usual, listening to Ms Darwin explain the reproduction cycle, as you occasionally read something from the text book. You felt a compulsion to raise your hand, even though you had nothing to say.<br>\r\n<br>\r\n\"Excuse me, mum?\" You say causing the whole class to laugh. You put down your arm and cover your mouth in embarrassment, you didn't mean to say that at all.<br>\r\n<br>\r\n\"Hey, hey...\" Ms Darwin raises hand for the class to be silent. \"It's okay Marcus, I can be your mum if you want me to be.\" Now it is Ms Darwin's eyes that go wide as she said something she didn't mean. \"In fact, since we're on the topic of reproduction, why don't we run a little experiment.\"<br>\r\n<br>\r\nThe whole class was silent as you got off your seat and walked to the front of the class.<br>\r\n<br>\r\n\"I'm going to make Marcus my child and I'll do that by...\"</span></div></div>",
            "created":1582520400,
            "id":2792087,
            "title":"You accidentally call Ms Darwin, mum"
        },
        "13311":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Ms Darwin keeps going",
                "Tiffany leaves the both of you like that",
                "The lesson is over, you'll resume being unbirthed on Monday"
            ],
            "content":"<div class=\"\"><div> <span>\"You're going to what?!\" You yelled in disbelief. \"I didn't mean to call you mum, you can't do this... you literally can't.\"<br>\r\n<br>\r\n\"Not scientifically, no. But with magic I can. Even though this is a science class and has no place for magic, I'm going to make an exception as this relates to our current topic,\" Ms Darwin might've been saying the words but by looking at her eyes, you could tell she was as terrified of this as you were. \"Now strip down, I'm not going to have a fully clothed baby.\"<br>\r\n<br>\r\nMs Darwin had already taken off her skirt and was pulling down her panties. Before you felt the need to completely undress. You stood in front of the whole class, as naked as the day you were born, which is ironic as you were about to be unborn.<br>\r\n<br>\r\nThe whole class stood there in silence, they couldn't believe what was happening, nor could they take their eyes off it.<br>\r\n<br>\r\nMs Darwin laid down in front of her desk, as she spread her legs out wide, revealing her vagina to you. \"Okay I just need to dilate a bit and then I'll be ready for you.\" She said as she took some rapid breaths. Her belly began to enlarge as a small cord snaked its way out off her vagina. \"Can you please attach that to your belly button?\" She asked.<br>\r\n<br>\r\nYou didn't want to but you grabbed the fleshy cord and made it touch your belly. Instantly your belly button reformed as the umbilical cord attached to you.<br>\r\n<br>\r\n\"Okay good, now you are going to go feet first. It's dangerous for a baby to be born feet first, so we're doing the opposite as you're unbirthed.\"<br>\r\n<br>\r\nYou didn't think it would work but you managed to slip both feet into Ms Darwin's vagina, and once they were in there was no getting them out.<br>\r\n<br>\r\nThe cord started to retract and you began to slide up into Ms Darwin. The effort was a hug strain on Ms Darwin and she began to scream and sweat, taking deep breaths as you slid deeper into her vagina. Reverse labor was just as hard if not harder than regular labor.<br>\r\n<br>\r\nYou could still feel your body as you went into Ms Darwin, but now it just felt smaller, you weren't sure if you were turning into a baby or just shrinking. You watched as your groin touched Ms Darwin's. You fantasized about having sex with Ms Darwin a few times, though you never imagined your penis would ever touch the inside of her vagina, especially not like this. You kept going until only your head was poking out of her vagina.<br>\r\n<br>\r\n\"Hold it there, for a moment,\" Tiffany said as she looked at Ms Darwin's pregnant belly and your head neck deep into her vagina. \"This looks so fucking funny,\" she took a photo. \"You know I'm tempted to have you two stay like that forever.\"<br>\r\n<br>\r\nTiffany ponders it for a moment before...</span></div></div>",
            "created":1582606800,
            "id":2792571,
            "title":"Unbirthing Marcus"
        },
        "133111":{
            "author_id":"poisonmushroom",
            "author_name":"Poison",
            "choices":[
                "Just another egg in the mix?",
                "8 months to start over in diapers again?",
                "You choose?"
            ],
            "content":"<div class=\"\"><div> <span>Listening to Tiffany go on knowing the power she had over you now was sickening. The view that you had of her. Towering over you now looking up from the floor from between Ms Darwin's legs was more then humiliating.<br>\r\n   You suddenly knew your fate as Tiffany smiled waving buh bye and with a pop you felt her vagina tighten up as it and the cord pulled you up into the sack you'd now be in for the next 8 month's.<br>\r\n  Reduced to the size of a small potato that's exactly what you felt like by not being able to see anything but only hear muffled things,just feeling a warm fluid around you....<br>\r\n  As Ms Darwin got back to her feet after the demonstration you felt as helpless as a turd sloshing around in a toilet bowl... <br>\r\n   You had no idea what else Tiffany had planned but you knew if this was your prison for the next few months you still had years after that to get back to where you were.... <br>\r\n   Stuck in a dark womb for awhile you'll have plenty of time to think of things like your gender is now back up in the air...who knows this second time around you may just be a good girl and not a bad boy!<br>\r\n</span></div></div>",
            "created":1602133200,
            "id":2917514,
            "title":"Ms Darwin keeps going"
        },
        "1332":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You get turned into a frog",
                "Amy gets turned into a frog",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>You continue through the class for the next few moments uninterrupted and Ms Darwin leaves the room for a second, giving Tiffany time to approach your desk. <br>\r\n<br>\r\n\"You know, Marcus. I've been wondering how to use my new found powers,\" she says leaning over your desk.<br>\r\n<br>\r\n\"Go away, Tiffany,\" Amy looks up at her with an annoyed expression.<br>\r\n<br>\r\n\"I will, in a second, I'm just deciding on which one of you I should turn into a frog. I know it'd cliche for a witch to do that but we're in biology so it suits. Of course I could always turn someone else into a frog and leave you two as you are for now.\"</span></div></div>",
            "created":1578459600,
            "id":2771294,
            "title":"Someone gets turned into a frog"
        },
        "13322":{
            "author_id":"poisonmushroom",
            "author_name":"Poison",
            "choices":[
                "Not a full princess YET! Kiss a frog too!",
                "Miss Marcus isn't finished yet!",
                "You choose?"
            ],
            "content":"<div class=\"\"><div> <span>Tiffany stood straight up crossing her arms over her chest as she smirked. Suddenly uncrossing them she twisted her slender fingers and she spoke a few strange words as everyone's eyes widened not sure what she had just done.<br>\r\n  It handn't become evident until Amy opened her mouth to speak and a sort of high pitched croak was all that came out. A confused look on her face she tried again only to get the same results but a deepening croak.<br>\r\n    Marcus looked at Amy's darkening skin...her slender arms had turned a dark shiny green as was the rest of her exposed skin he could see. Her panicked croaks turning deeper and deeper it was the only thing that let him know she was still there as her body shrunk quick becoming buried in her clothing.<br>\r\n  Marcus squatted down carefully moving her clothes until he seen a large lump moving in her panties.Carefully lifting them up a large dark green bull frog flopped out falling into her empty bra totally filling one of its large cups!<br>\r\n  Scooping the bra up with his other hand he held the bull frog up lifting it close to his face to see if Amy was really this frog.<br>\r\n  Tiffany laughed a menacing cackle as she taunted Marcus..<br>\r\n<br>\r\n\"Oh my...what do you have there princess?...  Looks like a big ole bullfrog to me.\"<br>\r\n<br>\r\nThe frog quickly replied with a loud deep croaking as it wiggled in the bra cup.<br>\r\n<br>\r\n\"Are you planning to kiss that wretched thing Marcus?.... lol. You know only a princess can turn that thing back into a prince.... lol\"<br>\r\n<br>\r\nBefore it even registered to anyone else Tiffany wiggled her fingers and spoke more unknown words before them. It probably wasn't evident at first even to Marcus until Tiffany spoke again.<br>\r\n<br>\r\n\"You might want to hold onto those.... I think you're going to need them more then your prince there!... lol\"<br>\r\n<br>\r\nWith that Tiffany snapped her fingers and spun to leave the room.It wasn't until then that everything began to make sense. Marcus looked down at the big male bull frog wiggling around in the bra cup then to the panties in his other hand.<br>\r\n   Still in shock looking at the big green frog he was oblivious to the changes that were already beginning on him.. That sick churning feeling that felt like tentacles moving in his stomach was more then nerves. Miss Darwin had just come back into the room as Marcus looked to the door then suddenly down to his crotch thinking of Tiffany when he felt or didn't feel what she had done to him.<br>\r\n  A serious look of shock on his face he stooped to gather the rest of Amy's clothes and his things before stuffing his frog prince into his back pack and rushed out past a confused Miss Darwin.<br>\r\n   Marcus ran to the closest bathroom locking himself in a stall as he dropped his pants to confirm what he had feared. He now had a vagina!!!  <br>\r\n   Now he knew what Tiffany meant by her crack earlier as he stood there holding a now bullfrog Amy. He couldn't help but think about Amy and what she was going through. Was she aware of what she was now?  He was still himself besides having a vagina he thought And was she serious about how to change Amy back? <br>\r\n   <br>\r\n  <br>\r\n<br>\r\n</span></div></div>",
            "created":1602133200,
            "id":2917479,
            "title":"Amy gets turned into a frog"
        },
        "133222":{
            "author_id":"poisonmushroom",
            "author_name":"Poison",
            "choices":[
                "Princess Marcus and Prince Amy ?",
                "Both glad to be back to almost their own self",
                "You choose?"
            ],
            "content":"<div class=\"\"><div> <span>Things had just taken a serious turn for the worse.Tiffany held onto her anger all these years and the story she fed Marcus about being a witch was suddenly becoming crystal clear.<br>\r\n  Witches were ugly wore black pointed hats and rode brooms they didn't drive a silver BMW like Tiffany! Marcus couldn't help but feel vulnerable in Tiffany's presence now as he continued to study the woman's vagina he now had between his thick thighs.<br>\r\n  He felt squeamish just touching it lightly to confirm he wasn't seeing things it was really his now. A sickening feeling followed by butterflies and Marcus pulled his pants back up not really wanting to see IT anymore then he had to. He tried his best not to think about living life now with....IT.  <br>\r\n  This was going to be a hard kick in his bal......his vagina... if she decided to leave him this way and judging by the looks of Amy now ,Tiffany had no problems with anything she was doing.<br>\r\n  Marcus carefully lifted Amy from the bra cup he carried her in to hold her up in front of his face its long green legs dangling. The bull frogs dark empty eyes seemed to hold no feelings or humanity. Marcus wondered if Amy was looking back at him thinking the same about her fate as it began to croak rythmatically.<br>\r\n  Scared of running into Tiffany again he knew he had to get Amy home and in a safe place first as he packed things up in the stall. <br>\r\n   Looking down his groin muscles contacted but he felt nothing familiar he only felt shamed now.. Other then that what Tiffany did to him wasn't as visible as what she did to Amy.<br>\r\n  Quietly opening the door Marcus made a dash for the courtyard grabbing his bike and got home asap.<br>\r\n  Once Marcus got home Amy found a safe place in an empty fish tank on the dresser while he changed into running shorts and a black muscle shirt. Marcus looked at himself in the mirror turning at different angles then rolled up a pair of socks and stuffed them into his shorts as he grabbed his groin to adjust them.<br>\r\n  Probably only he noticed what was missing in his shorts now as I doubt others would unless his shorts were pulled down to reveal a his now smooth crotch....either way he decided to leave the socks where they were as he focused back on Amy taking her out of the tank. <br>\r\n  Marcus held the bullfrog up talking to it like it understood him...<br>\r\n<br>\r\n\"I have no idea what to do for you Amy... I love you! \" <br>\r\n<br>\r\nWith that said he leaned forward and kissed the bullfrog squarely on its mouth...with in a few seconds the frog began wiggling in his hands then started swelling and stretching until he couldn't hold it anymore in his hands dropping it on his bed as it continued to flail about.<br>\r\n   It wasn't until he leapt to his feet and looked down at a naked Amy on his bed that he realized she wasn't the only thing to change!<br>\r\n  The jostling jolt Marcus felt was now very obvious as he had to look over them to see Amy on his bed. He now had a pair of beautiful D maybe DD cup breasts bouncing on his chest.<br>\r\n  Amy still looked like Amy for the most part as she rolled over to face Marcus besides the rather well endowed penis that came flopping over that now hung between her legs! The fact that she had small to no breasts now was totally missed by the upstaging penis flopping around that came to land with a slap on her inner thigh.<br>\r\n   They both stared at each other like deer caught in the headlights not knowing who should start or even what to say! <br>\r\n   </span></div></div>",
            "created":1602255480,
            "id":2918065,
            "title":"Miss Marcus isn't finished yet!"
        },
        "134":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Boy's Bathroom",
                "Girl's Bathroom"
            ],
            "content":"<div class=\"\"><div> <span>It was the start of break when you ran into Tiffany and before you went to eat you needed to go to the toilet. You always dreaded going to the toilet at school as it was a good ambush spot for Tiffany's lackeys to catch you unaware. However with Tiffany backing off lately it has been safe to go again.<br>\r\n<br>\r\nOf course now Tiffany had threatened you again you were once again unsure of your safety. Though she had to be messing with you, after all if she really was a witch, why not do something to you when she spoke to you earlier or out of no where. It was an idle threat meant to get into your head.<br>\r\n<br>\r\nYou weren't going to fall for it, you told yourself as you entered the...</span></div></div>",
            "created":1558242000,
            "id":2661458,
            "title":"Go to the bathroom"
        },
        "1342":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You don't have a dick so why would you use the men's bathroom?",
                "I've got a surprise for you waiting in the cublicals.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>You open the door and realize you made a mistake when you see Tiffany and two of her friends standing there. You try to leave unnoticed buy Tiffany spots you.<br>\r\n<br>\r\n\"Where are you going?\" She asked as she and her friends turned around to face you. You couldn't believe what you saw both of Tiffany's friends no longer had mouths, instead their face had smooth skin where their lips should be. She was being honest when she told you she was a witch.<br>\r\n<br>\r\n\"Sorry... wrong bathroom.\" You trie to back out though you couldn't seem to.<br>\r\n<br>\r\n\"No, you're in the right bathroom,\" Tiffany smiled as she spotted you looking over at her friends. \"Don't worry about those two, they thought they spoke out of term so had to be taught a lesson.\" Both girls looked at you with sad eyes, but they stood their ground by Tiffany's side. \"Now about the reason you're in here.\"</span></div></div>",
            "created":1558414800,
            "id":2662128,
            "title":"Girl's Bathroom"
        },
        "13421":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You're completely blank",
                "You have a vulva",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I don't see why you would go into the men's bathroom, that's for people with dicks after all and we both know you don't have one,\" Tiffany says as you feel a weird sensation in your crotch.<br>\r\n<br>\r\nYou ignore if for now and return your attention to Tiffany. \"Again with these dickless comments, you've been saying that forever, try to come up with something more original.\"<br>\r\n<br>\r\n\"Oh but it's true now,\" Tiffany smiled as she grabbed her friend by under the chin, to remind you what she took away from them. \"If I can do this, surely I can do something about your dick too.\"<br>\r\n<br>\r\nPanic set in and you looked down at your crotch and saw it was flatter than it should've been. \"What did you do?\"<br>\r\n<br>\r\n\"That's a good question, let's find out together. Girls, pull down his pants.\"</span></div></div>",
            "created":1578459600,
            "id":2771024,
            "title":"You don't have a dick"
        },
        "134211":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "\"No\"",
                "\"Sit on the toilet and see what happens\"",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Maybe you aren't meant to be in the girl's room either,\" Tiffany mused as you looked down at the smooth skin between your legs. You didn't even have pubic hair, making you look like how a doll looks.<br>\r\n<br>\r\nWhat made things worse is you still needed to go to the toilet, more so in fact. You wanted to snap and yell at Tiffany but such an action could get you into more trouble. \"Please give it back Tiffany....\"<br>\r\n<br>\r\n\"Hmm, no.\" Tiffany said straight up. \"This is fun, I can't wait to show the whole world that you're dickless.\"<br>\r\n<br>\r\n\"I'm busting to go to the toilet though, you've given me no means to relieve myself,\" you try a different approach.<br>\r\n<br>\r\n\"You're right I haven't,\" Tiffany confirmed.<br>\r\n<br>\r\n\"Are you going to at least let me go then?\"</span></div></div>",
            "created":1578459600,
            "id":2771295,
            "title":"You're completely blank"
        },
        "1342112":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You have indeed copied her vulva",
                "She is blank",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I did a curse, not sure how exactly it works, why don't you sit on that stall and see what happens,\" Tiffany instructs.<br>\r\n<br>\r\nYou obey her commands but she doesn't let you shut the door for privacy. You feel your flesh reshape and you look down to see you have a vulva, with blonde pubic hairs. You pay little attention to it as you relieve yourself.<br>\r\n<br>\r\n\"Interesting, it looks like you've got a copy of the last person to use that toilet's genitals,\" Tiffany observes as her friend's eyes go wide. \"Oh yeah, that was you wasn't it, well lets see then, lower your skirt and I might give you back your mouth.\"<br>\r\n<br>\r\nYou watch as her friend strips down in front of you and you see...</span></div></div>",
            "created":1578459600,
            "id":2771297,
            "title":"Sit on the toilet"
        },
        "13421122":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She was still blank",
                "She now had your dick",
                "She had her vulva back"
            ],
            "content":"<div class=\"\"><div> <span>You look at Tiffany's friend's crotch and see it is completely blank, like yours was a moment ago. You look down at the vulva you now had and back over to her, both your eyes go wide.<br>\r\n<br>\r\n\"Hmm, I guess he steals them when he goes to the toilet then,\" Tiffany remarks with a smile. \"As promised,\" she waved her hand and her friend's mouth grew back.<br>\r\n<br>\r\n\"What the fuck Tiffany?!\" She screamed. \"You've always told us what a creep Marcus is and now you've given him my vagina!\"<br>\r\n<br>\r\nTiffany shrugged. \"I just cast the curse, I didn't know how it was going to work.\"<br>\r\n<br>\r\n\"I don't care, I want my vagina back!\"<br>\r\n<br>\r\nTiffany, looked at you and her friend's crotch. \"I actually don't know if that's possible. Marcus steals from whoever used the toilet last, I'm just not sure if you can get yours back.\" Tiffany eyed off her other friend. \"Vicky, use that toilet, we're going to experiment further.\"<br>\r\n<br>\r\nVicky shook her head, unable to say no. Tiffany pointed to her crotch and Vicky started to do a little dance as her bladder instantly filled. Vicky shook her head again, as she struggled to hold on, she then realized it was better just to wet herself. She tried to relax but relief didn't come.<br>\r\n<br>\r\n\"Sorry, Vicky. I knew you'd try that. You can only relieve yourself if you use the toilet.\"<br>\r\n<br>\r\nVicky gave Tiffany the finger as she entered the stall, you heard urine splashing into the toilet at a fast pace then the toilet flushed. Vicky left and gave you a dirty stare as you entered the stall and sat down.<br>\r\n<br>\r\nYour Vulva reshaped itself and the pubic hairs disappeared (Vicky waxed apparently). You stood up and left the stall. All eyes were now on Tiffany's other friend....</span></div></div>",
            "created":1582606800,
            "id":2792551,
            "title":"She is blank"
        },
        "134211221":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Nothing happens",
                "She grows your dick",
                "She gets her Vulva back"
            ],
            "content":"<div class=\"\"><div> <span>\"Tiffany!\" Her friend cried as she saw no improvement with her own genitals. The fact they hadn't returned made Vicky alarmed as well.<br>\r\n<br>\r\n\"It's alright, we haven't tried everything yet,\" Tiffany assured her as she made her friend bust to go to the toilet again. \"See if that restores it.\"<br>\r\n<br>\r\n\"You bitch,\" her friend snapped as she felt the need to go to the toilet. She entered the stall and shut the door. You, Vicky and Tiffany waited outside, listening closely.</span></div></div>",
            "created":1582606800,
            "id":2792552,
            "title":"She was still blank"
        },
        "1342112213":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She gets back her vulva, you go back to having nothing",
                "Nothing happens, she must wait until you swap with someone else.",
                "You begin to go"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh thank goodness,\" Tiffany's friend cries out as you hear the flow of urine. She came out of the stall with a look of relief, embarrassment and anger. \"If you do anything like that again...\" She didn't get to finish as her body reformed into a small wiener dog.<br>\r\n<br>\r\n\"That's for calling me a bitch,\" Tiffany responded. \"Now, are we all done here?\"<br>\r\n<br>\r\nThe dog barked and growled at Tiffany, while you hung your head down in shame and fear. Tiffany had already altered your life permanently and she wasn't afraid to turn her own friends into test subjects or animals.<br>\r\n<br>\r\nVicky tapped Tiffany on the shoulder and pointed to her crotch.<br>\r\n<br>\r\n\"Oh good point, we don't know at what stage Marcus can return his stolen genitals,\" Tiffany made Vicky need to use the toilet again.</span></div></div>",
            "created":1582606800,
            "id":2792553,
            "title":"She gets her Vulva back"
        },
        "13421122133":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You are only allowed to use the lady's room from now on.",
                "You are have to use the bathroom of whatever gender your genitals are.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As Vicky sits on the toilet, you feel a warm liquid running down your leg. Tiffany cracks up laughing.<br>\r\n<br>\r\n\"Oh, my god Vicky... This is great. Keep going,\" Tiffany instructs.<br>\r\n<br>\r\nVicky is confused to why she doesn't have her vulva back but she's at least glad that she feels relief. She finishes 'going' to the bathroom and then is mortified when she sees you with a wet puddle at his feet.<br>\r\n<br>\r\n\"You made him piss his pants,\" Tiffany grabbed Vicky excitedly. Vicky just looked at you with sorrowful eyes. \"This is great, he's going to swap with so many people that'll still need to use the toilet and he won't know when they are going to go.\" <br>\r\n<br>\r\nTiffany walked by you as she left you there standing in Vicky's piss. \"Vicky don't forget the dog,\" she instructed. Vicky nodded and picked up their friend before following Tiffany towards the door.<br>\r\n<br>\r\nTiffany paused for a moment and turned back towards you. \"Oh and Marcus, one more thing about this curse...\"</span></div></div>",
            "created":1582606800,
            "id":2792557,
            "title":"You begin to go"
        },
        "13422":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She makes you swap bodies with one of them",
                "She gets rid of all your genitals.",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>Tiffany gave a wicked smile as four of the cubical doors opened. You blushed for a second seeing the four naked women standing there but then were mortified when you realized who they were. Standing in front of you, were Hannah, Shari, Amy and Ms Darwin. All of them stood completely still with their arms by their side and a blank face. However their eyes showed the fear and embarrassment of their current situation.<br>\r\n<br>\r\nYou went to say something, but turned to face the women as you put your hands at your side, assuming the same neutral position they did and a second later your clothes also vanished, leaving you naked in front of all seven women.<br>\r\n<br>\r\n\"Take it all in, pervert.\" Tiffany said as she stood behind you, putting her hands on your shoulders. \"These four women's lives are about to change for the worst just because you took an interest in them sexually.\"<br>\r\n<br>\r\nYour eyes faced Hannah and you saw hers widen with shock. Fortunately for you, they couldn't see each other, so your personal shame about Hannah was only revealed to her and her alone.<br>\r\n<br>\r\n\"Let's see, we have Ms Darwin... your teacher. I did notice you paid a lot of attention in biology, but to have a crush on the teacher?\" You flinched once more as Tiffany started naming them. \"Amy your girlfriend, who is by far the least attractive woman in this room.\" That was more aimed at Amy than you. \"Shari your cousin's best friend, I'd admit she's hot. I don't blame you for having a crush on her.\" If you weren't already magically frozen, that comment would've made you stop moving, she knew who Shari and Hannah were. \"And most surprising of all, your own cousin, Hannah.\"<br>\r\n<br>\r\nTiffany took a step back and let the names as well as the purpose of why they were chosen sink in. Now all four of the women knew who you had physically admired and they knew one of them was your cousin. Amy was most hurt by that revelation, while Shari showed disgust. Ms Darwin's eyes showed a hint of surprise.<br>\r\n<br>\r\n\"Now, what to do with you all?\" Tiffany asked herself.</span></div></div>",
            "created":1562907600,
            "id":2685652,
            "title":"Surprise in the Cubicals"
        },
        "134222":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Tiffany replaces them.",
                "Tiffany removes more parts.",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>You fill a slight tingle in your crotch but are unable to look down to see what just happened, instead you can only look forwards and the others and that alone told you what Tiffany did. You watched as the pubic hair of Ms Darwin and Amy receded into their bodies, Shari and Hannah were already clean shaven. As the lips of their genitals fused as the gentle mound receded into their bodies. Leaving all four women sexless and given how they were looking at you, you assumed Tiffany did the same to you.<br>\r\n<br>\r\nYou wondered if they knew if theirs had been taken as well or if they thought Tiffany just targeted you. While horrified your dick and the girl's vulvas were gone, you couldn't help but feel some relief that you weren't as exposed as you were before and you could see some relief in your cousin's eyes as she no longer had to look at that part. Shari showed delight, Ms Darwin showed curiosity and Amy showed fear and sadness.<br>\r\n<br>\r\nTiffany walked in front of you and looked at you directly in the eyes and for the first time you could tell how soulless they had become, she had gained this immense power but the cost had been her very soul. She also looked like she had aged a few years. \"Oh how long I've wanted to do that to you,\" she taunted. Though she didn't seem like she was quite done yet.<br>\r\n<br>\r\nAll the women finally stepped out of the cubical and you turn around. You were now flanked by Amy and Ms Darwin one side and Hannah and Shari the other side. Though Tiffany made it so it was Ms Darwin and Shari that were directly next to you. All of you now faced the Bathroom sinks and more importantly the mirrors, so that everyone could see their missing genitals.</span></div></div>",
            "created":1562907600,
            "id":2685682,
            "title":"She gets rid of all your genitals."
        },
        "1342221":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She turns half of you into genitals",
                "She gives everyone the opposite set",
                "She conjures a chance wheel"
            ],
            "content":"<div class=\"\"><div> <span>\"Don't worry, you'll get them back in a second,\" Tiffany promised with a smile as everyone, including you, were now staring at their blank crotch. \"Or at least some of you might and I can't promise you it'll be the same as before.\"<br>\r\n<br>\r\nShe then made you reach down and touch the blank smooth skin, feeling the void she had magically created. Having your hands rest on top of your crotch. She then had you turn back around and face the cubicals.<br>\r\n<br>\r\n\"Now how should I do this?\" She asked as she paced in front of you all.</span></div></div>",
            "created":1562907600,
            "id":2685693,
            "title":"Tiffany replaces them."
        },
        "13422211":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You get a set of genitals again",
                "You become a set of genitals",
                "You get a prime number and Tiffany decides your fate later."
            ],
            "content":"<div class=\"\"><div> <span>\"The good news is two of you will be getting a set of genitals back,\" Tiffany said with a smile. \"The bad news is, two of you will be losing your humanity.\" She paused as she counted how many people there were. \"Hmm, that leaves one person spare. Would it be more fair to just keep them as you are now, or would that not be far on those who lose their humanity. I guess I'll decide that at the end.\" <br>\r\n<br>\r\nShe then walked in front of you. \"I guess you're up first. Marcus.\" She pulled out her phone and opened a random number generator. \"Odd number you become the replacement, even you get a replacement, prime number you become the spare.\"<br>\r\n<br>\r\nShe clicked the app and showed you the result.</span></div></div>",
            "created":1562907600,
            "id":2685700,
            "title":"She turns half of you into genitals"
        },
        "134222111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Hannah",
                "Amy",
                "Shari or Ms Darwin"
            ],
            "content":"<div class=\"\"><div> <span>\"Aww Twenty-Six\" Tiffany was genuinely disappointed. Though you knew she could've altered the result regardless. \"No matter, you're still going to pay in the end\" Instead of giving the next person the same option as you, she brings you in front of the four women and smiles.<br>\r\n<br>\r\n\"Pick one,\" Tiffany commanded and you felt your mouth come under your control again.<br>\r\n<br>\r\nYou weren't exactly what you were picking them for, whether or not they'd become your dick or if they'd be the other safe person. Given the cruel game Tiffany was playing it could've been either one. This also meant that what happened next would be your fault, if they all didn't consider it your fault already.</span></div></div>",
            "created":1562907600,
            "id":2685704,
            "title":"You get a set of genitals again"
        },
        "1342221111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Hannah becomes your genitals (the most likely result)",
                "Hannah gets a prime number and is safe",
                "Hannah got a 2"
            ],
            "content":"<div class=\"\"><div> <span>\"Hannah,\" you said, hoping it'd be the other survivor. Out of everyone there she was family and the person you cared for the most. Sure you were dating Amy but that was a fresh relationship, one that probably was doomed to fail after this ordeal so if you could save anyone of them it was going to be Hannah. Of course you could've doomed your cousins to a life time attached to your crotch as well.<br>\r\n<br>\r\nHannah walked forward until she was face to face with you, her bare breasts almost touching your chest. Given how close she got, you wondered if Tiffany was about to make her a permanent part of your body, but then she just walked beside you and turned around as Tiffany got her number generator again.<br>\r\n<br>\r\n\"A prime number and you remain human, odds you become your cousin's dick, even you become your cousin's vulva,\" You gulped at that part, it didn't even occur to you that she'd give you a vulva instead, though you should've expected it. \"Get a two and you are the spare.\"<br>\r\n<br>\r\nHannah's chances were rigged to become your genitals as you had expected and you wondered if Tiffany would've given a different set of conditions had you chosen someone else. The number generator was half for you too as you now had a 50/50 shot in the likelihood Hannah became your genitals, to end up with a vulva.<br>\r\n<br>\r\nYou were both allowed to breath a deep breath as Tiffany pressed the number generator.</span></div></div>",
            "created":1562907600,
            "id":2685706,
            "title":"Hannah"
        },
        "13422211111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Hannah becomes your penis",
                "Hannah becomes your vulva",
                "Tiffany waits until the end before revealing it."
            ],
            "content":"<div class=\"\"><div> <span>\"Well it looks like you two will be spending a lot of time together,\" Tiffany taunted hiding the number from you. Of course you knew that meant Hannah was about to become a part of your body. Tiffany had rigged the odds to the point Hannah had to be extremely lucky to get anything else.<br>\r\n<br>\r\nStill you couldn't help but wonder what Hannah felt about her fate or about the whole situation in general. Tiffany had shown her the number and you figured you wouldn't know until she had been attached to you.</span></div></div>",
            "created":1562994000,
            "id":2686036,
            "title":"Hannah becomes your genitals"
        },
        "13422211112":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You get Amy as a vulva",
                "You get Shari as a vulva",
                "You get a dick"
            ],
            "content":"<div class=\"\"><div> <span>\"Five Hundred and three\" Tiffany read allowed, mostly aiming the result at the other three. You and Hannah were allowed to move again as you gave each other a hug. Clearly she was happy she wasn't getting turned into your genitals. Though she backed off quickly once she realized her bare breasts were actually touching you.<br>\r\n<br>\r\n\"That's all I needed, to decide the two victims,\" Tiffany said as she marched Amy and Shari forward. \"Though I still need to decide who gets what.\" You knew that she mean not only if you got Shari or Amy as your genitals but whether or not you got a dick or vulva from them as well.<br>\r\n<br>\r\nAs for Ms Darwin, her head fell off her body and her body shrank to a couple of inches. One of Tiffany's friends picked up Ms Darwin's head, while the other one picked up her body and placed it in the toilet. Ms Darwin's eyes went wide opened as the toilet began to flush, sending the teacher's body down into the sewers. \"Don't worry I'm not going to barbecue you,\" Tiffany promised as her head was loaded into a backpack.<br>\r\n<br>\r\nShe then returned her attention to you and Hannah. \"This is so hard, do I give you the person you're closer to or the opposite...\" Tiffany complained. \"I also need to decide what to give you both as well...\"</span></div></div>",
            "created":1562907600,
            "id":2685709,
            "title":"Hannah gets a prime number and is safe"
        },
        "134222111121":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Hannah has a dick",
                "Hannah has a vulva",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>\"Screw it, closest person it is.\" Tiffany says as Amy plants her face into your crotch and and begins to merge with you. It is uncomfortable for you both as Amy is given back control of her body as soon as her face gets fused to your crotch, you fall on your ass as her body begins to struggle and her army and legs flail against the inevitable. It only takes a few seconds but it's painful as hell, both emotionally and physically as all that remains of Amy is tuft of her hair, which has now become your new pubic hair and a small mound.<br>\r\n<br>\r\nYou're on the floor with your legs spread open, watching the mound reshape. You aren't surprised as a line splits down the middle and Amy finishes transforming into your new vulva. You resist the urge to touch your new genitals as you stand up and turn to face Hannah, wondering what Shari got turned into.</span></div></div>",
            "created":1562907600,
            "id":2685711,
            "title":"You get Amy as a vulva"
        },
        "1342221111211":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Tiffany encourages you to have sex with Hannah",
                "Tiffany leaves the two of you naked in the school bathroom",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>You turn to face Hannah and see her lying on the floor next to you. She's panting as she stares at her crotch. You follow her gaze and you aren't surprised to see the dick between your cousin's legs. It's much bigger than what yours was, with a large set of testicles to go along with it. It was uncircumcised, unlike yours and much like how you now had Amy's black hair, Hannah's bush matched Shari's lighter brown hair.<br>\r\n<br>\r\nLike you Hannah was resisting the urge to touch her new genitals, as she got up off the ground, letting the new appendage hang loose. She looked over at you but didn't say a word, though you could see the sorrow in her eyes. Having control of her body again, she crossed her arms over her chest. Not that it helped much, she was still left exposed for far too long in front of you both.<br>\r\n<br>\r\nTiffany looked delighted to see he handy work, though she didn't seem to notice the toll it took on her own body. Her blonde hair had lost some of it's vibrant color and had thinned out a bit. She had crows feet at the side of her eyes and larger nasolabial folds. What she had just done to you had cost her physically as she aged about ten years.<br>\r\n<br>\r\n'Good' you though as you wondered what she had in store for you next.</span></div></div>",
            "created":1562907600,
            "id":2685976,
            "title":"Hannah has a dick"
        },
        "13422211112111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You and Hannah both agree",
                "You and Hannah both refuse",
                "One of you refuses while the other agrees."
            ],
            "content":"<div class=\"\"><div> <span>\"Why so hesitant to examine your new equipment?\" Tiffany asked both you and Hannah. \"In fact you're both experienced with each other's new set so why don't you help each other to explore,\" Tiffany said with a sly smile as you knew exactly what she was asking you to do.<br>\r\n<br>\r\nYou gave a side wards glance over to Hannah, who had the equal look of disgust you had. \"You want us to have sex with each other?\" Hannah spoke up, with anger in her voice.<br>\r\n<br>\r\nTiffany shook her head. \"If I wanted that I could just make you do it. What I want is for you to both want to do it.\"<br>\r\n<br>\r\n\"We're never going to want to do it!\" You snapped, making sure to emphasize the 'we' remembering how Tiffany selected Hannah as one of the victims. You just liked how her body looked and you had accidentally seen her naked a few times, you didn't have romantic feelings for your her.<br>\r\n<br>\r\n\"I wouldn't say never,\" Tiffany commented. \"I mean yeah you're cousins and given your taste in women, I don't think you'd want to be fucked by a dick. However I didn't mean I wanted you to want it on a sexual level but more a 'let's get this over with' type of deal. As such if you do it, I promise I will never use my powers on either of you again.\"<br>\r\n<br>\r\n\"But then we'd be stuck like this\" Hannah protested as she gestured towards her dick. \"Which is what you want...\" she realized.<br>\r\n<br>\r\n\"Correct, but look at it this way, I could do way worse to you at and moment so living with the wrong genitals as well as the embarrassment is just the price you have to pay.\"<br>\r\n<br>\r\nYou and Hannah face each other, wondering if this is a thing you're both willing to do. It means you'd be stuck as you are now but you'd also be safe from further changes by Tiffany and you were sure she'd think of other nasty surprises for you in the future. The other question was the impact this would have on Amy and Shari, you weren't sure if they were aware of everything going on down there, and you'd also be sentencing them to a life as genitals as well. Of course there was no promises that Tiffany would ever return them to normal.</span></div></div>",
            "created":1562907600,
            "id":2686000,
            "title":"Tiffany encourages you to have sex with Hannah"
        },
        "134222111121111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Tiffany is still there",
                "The bathroom becomes a bustle of activity from other students.",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>\"We've seen what she is and what she's willing to do,\" Hannah concludes. \"If we want to be safe we've got no choice.\"<br>\r\n<br>\r\n\"We'll be stuck like this...\" you remind Hannah of her own words. \"We'll have the opposite genitals for the rest of our lives. Shari and Amy will be stuck as they are now,\" you made the cons known. \"But given what she's done to us, how we were only spared because of a lucky number, one she tipped the scales so much you're lucky you're not in Amy's position, I have to agree. She's not going to change them back and if she did we'd then be transformed, I know how Tiffany works.\"<br>\r\n<br>\r\n\"Let's get this over with then,\" Hannah took the lead and dragged you into a cubical and shut the door. If you were going to do this, you were going to have some privacy. \"Normally when I do this the guy is behind me, so I guess I need to be behind you.\" Hannah turned you around and placed positioned your hands on the door as she held them there with her own hands. \"I can't believe I'm about to do this.\"<br>\r\n<br>\r\nYou were glad you didn't have to face Hannah, but you felt her brushing up against you, her breasts against your back, you felt the tip of her dick slide into your new vagina as she began to thrust and moan. You bit your lips as Shari began to penetrate you and Amy.<br>\r\n<br>\r\n\"I want one of you to climax.\" Tiffany said on the other side of the door, \"otherwise it doesn't count.\"<br>\r\n<br>\r\nYou ignored her as you Hannah began to thrust, harder and harder. Until finally Shari ejaculated, sending the warm gooey liquid further into your body. When Hannah withdrew, Amy was left wet, leaking a small amount of fluid, warm and sensitive. You can't say you enjoyed the experience but Hannah was in a rush to get it over with she wasn't going focus on you enjoying the experience. She lowered her hands freeing yours and passed you a piece of toilet paper. You quickly wiped Amy, causing irritation and through the paper in the toilet.<br>\r\n<br>\r\nYou froze for a moment, unable to look Hannah in the eyes but unable to look away as you both stood there in an uncomfortable silence. You then unlatch the door and go peak out.</span></div></div>",
            "created":1562994000,
            "id":2686135,
            "title":"You and Hannah both agree"
        },
        "1342221111211111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Tiffany swaps your minds around.",
                "Tiffany threatens your family if you don't keep having sex.",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>\"You are disgusting, Marcus. Having sex with your cousin in the girls bathroom,\" Tiffany teased as she took a photo of you two. \"You know Shari and Amy are still aware, they can hear and feel everything. So they felt you use them and they know you chose to have them remain that way.\"<br>\r\n<br>\r\n\"That's not our fault,\" Hannah interjected, stepping out of the cubical. \"You could've turned us into anything and they would've also been a part of that change.\"<br>\r\n<br>\r\nTiffany eyed off Hannah and smiled. \"Possibly, or I could've changed them back before turning you into something else. You didn't want me to change you anymore and by asking for that, your friend is now your dick. I hope you like it.\"<br>\r\n<br>\r\n\"So what happens now? Are you going to give us our clothes back at least?\" You asked still remaining in the cubical, you felt so dirty and ashamed and Amy was still a little tender.<br>\r\n<br>\r\n\"I hadn't really thought about what to do next, I'm sure I'll think of something, but I can't promise you'll like it.\"</span></div></div>",
            "created":1577509200,
            "id":2765629,
            "title":"Tiffany is still there"
        },
        "13422211112111112":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You refuse to go through anymore of this.",
                "You have sex again",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm a witch of my word, I will not alter your forms any further. I might've gone a bit too far in asking you two to have sex.... which is why you'll keep doing it, at least once a week,\" Tiffany gave a wicked grin. \"Also from now on you're to face each other while doing it.\"<br>\r\n<br>\r\n\"But we agreed to your terms!\" Hannah snapped.<br>\r\n<br>\r\n\"That was to keep you two safe, I made no promises in regards to your family members, you two are to keep this cousins with benefits going otherwise your parents, friends and everyone you love will feel my wrath.\" Tiffany glared into Hannah's eyes. \"You know how horrible I can be, so if you don't want your mother as your anus or something, you'll do as I tell you to.\" Tiffany threatened as she turned around to leave.<br>\r\n<br>\r\n\"Wait you can't leave us naked in here....\" Hannah pleaded as she tried to come to terms with what Tiffany threatened.<br>\r\n<br>\r\n\"I can, but I won't, though it's going to cost you another round with Marcus.\"</span></div></div>",
            "created":1577509200,
            "id":2765689,
            "title":"Tiffany threatens your family"
        },
        "134222111121111122":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "This was the last time",
                "You have to protect your family",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>You sigh as Hannah drags you back into the cubical, she pushes you against the wall as she begins to imagine things to get aroused. \"Come on Shari work with me here!\" she snapped at her limp dick as she shook it.<br>\r\n<br>\r\n\"I'll accept oral,\" Tiffany said through the door. \"Only rule is one of you needs to climax.\"<br>\r\n<br>\r\n\"I'm not doing that,\" you say as you look down at Shari.<br>\r\n<br>\r\n\"It's fine, I know how to get things stimulated,\" Hannah was clearly annoyed as she began to play with one of her breasts with one hand and her dick with the other.<br>\r\n<br>\r\nSeeing Hannah play with her breast made you a little excited, even though you knew it was wrong. Within about a minute you were both ready for round two.<br>\r\n<br>\r\nLike last time, Hannah took the lead, and you looked at her in the eyes as she began to thrust. You felt her breasts press up against your skin as you tried not to look. Again you feel Hannah cum inside you and as soon as she does, she backs off and you use the toilet paper to clean yourselves off.<br>\r\n<br>\r\nYou are rewarded by your clothes, phones and other belongings appearing on the toilet seat. Hannah grabs her stuff and moves to the cubical next to you. You both get dressed and see that Tiffany is gone. You make for a hasty retreat out of the bathroom.<br>\r\n<br>\r\n\"So...\" You don't know where to begin with Hannah. \"What are we going to do?\"</span></div></div>",
            "created":1577509200,
            "id":2765694,
            "title":"You have sex again"
        },
        "134222112":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You become Hannah's",
                "You become Shari's",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>Tiffany shows your number is 305 but doesn't tell the others the result. Your life as a person was over and soon you would be fused with the crotch of one of the women you admired. Of course you weren't sure whose you'd become just yet.<br>\r\n<br>\r\nHad you stand facing the women as she walked behind them and held up her phone with a coin flipping app, standing behind Hannah first as she showed you it landing on heads. You weren't sure if that was good or bad until she moved behind Shari who also got heads as well. Continuing down the line she flipped the coin for Amy and Ms Darwin, both of which landed on tails.</span></div></div>",
            "created":1562994000,
            "id":2686039,
            "title":"You become a set of genitals"
        },
        "1342221122":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You become Shari's vulva",
                "You become Shari's dick"
            ],
            "content":"<div class=\"\"><div> <span>With Amy and Ms Darwin getting tails, Tiffany returned to Hannah and Shari. It turned out heads was the bad result. She stood behind Hannah once more and flipped the coin yet again, this time it landed on tails. Meaning you were about to be spending the rest of your life attached to Shari.<br>\r\n<br>\r\nOut of all the people, Shari was probably the worst choice. She was a party girl, so was Hannah for that matter and you knew they both slept around a lot. Only if you were attached to Hannah she would probably show restraint and might've ended that life style for your sake. Shari on the other hand most likely wouldn't.<br>\r\n<br>\r\nYou walked towards Shari and stopped right in front of her. Of course she didn't know if that meant she was about to become your genitals or you were about to become hers. Either way her eyes showed a level of disgust. Which only grew stronger as you involuntarily groped her breasts.<br>\r\n<br>\r\nTiffany gave you a knowing smile as she didn't say anything about why you did that. 'Great another reason for her to hate me' you thought as your eyes locked with Shari's.<br>\r\n<br>\r\nYou then gave Shari a passionate kiss before bending down until you face was lined up with her crotch. You gave her another wet kiss in her crotch but this time your lips fused with her flesh.<br>\r\n<br>\r\n Instinct kicked in as you tried to pull away from Shari's unmoving body but instead you were drawn in closure as your entire face fused with her flesh. Unable to see you began to push her legs with your arms but still she didn't budge and still you were drawn in closer. Now your head was completely merged with Shari and as your shoulders move forward your are fell to your side. The last that anyone saw of you was your legs as they kicked the air as they were drawn into Shari's body.<br>\r\n<br>\r\nYou were still able to think and feel but your other senses had dulled as you found yourself a tiny mound on Shari's crotch waiting to take form.</span></div></div>",
            "created":1562994000,
            "id":2686045,
            "title":"You become Shari's"
        },
        "13422211221":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Continue with Marcus",
                "Find out what happened with the others",
                "End the story."
            ],
            "content":"<div class=\"\"><div> <span>Even though you lost your senses and your body had been absorbed completely, you still had a sense of the former you. Currently you assumed the fetal position as the mound on Shari's body, though that quickly began to change as you twisted until your mouth, still internal, rested against the exterior side of her body.<br>\r\n<br>\r\nYou the began to stretch inwards as your legs and feet bent. Your feet formed into ovaries as your legs became the Fallopian tubes. Your stomach all the way to your butt opened into a round and wide chamber, forming the uterus as your upper torso and much of your head were reshaped into her vagina. Your nose shifted elsewhere as a cord attached from behind and it became one nostril as it became a part of Shari's urinary system, making you glad you could no longer smell. Finally your mouth altered it's orientation as your lips opened, forming Shari's new Vulva.<br>\r\n<br>\r\nYou weren't just her genitals like Tiffany made it sound like you'd be, you were Shari's entire reproductive system and you could feel everything.</span></div></div>",
            "created":1562994000,
            "id":2686046,
            "title":"You become Shari's vulva"
        },
        "134222112213":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "content":"<div class=\"\"><div> <span>Life as Shari's reproduction system was a horrible existence, it was filled with pleasure and pain but it was mostly pain. First every time she went to the toilet it felt like water was pouring out through your nose, which was always uncomfortable. Then there were the dicks that constantly filled your throat, some were tight and pushed deep that they hurt, while others didn't do anything for you. Sometimes you'd feel rubber, sometimes you'd feel flesh. Sometimes, when they touched the clitoris, you're not sure what part of you became that, you found yourself enjoying it. There were also the times when you'd feel a tongue licking you or fingers touching and going inside you instead. There were also the toys that Shari had, you liked the vibrators the most but the standard dildos were irritating at times. There were also the infections you contracted a few times that made everything so much worse.<br>\r\n<br>\r\nOf course that was all just the front of house part of Shari's system and you went deeper than that. Once a month when Shari was on her period, life was absolute hell for you. You felt all the pain she did and then some but that wasn't the worst thing you felt as Shari had five kids all up. Five times where you were stretched beyond your limits, three of which you had come out of your mouth waiting for hours of pain. Shari might've taken pain killers during these moments but they never affected you. Then there were the two that were cut from you, which lead to a painful recovery. As well as those five, there were also the kids that didn't make it, there were only two of they also caused a great deal of pain. After the fifth child, Shari had her tubes tied and it felt like you had lost a part of yourself, you were now an amputee in Shari's body.<br>\r\n<br>\r\nOther than that you didn't know much about Shari's life. She had slept around a lot, given the different shapes of the dicks but for a while, there was one dick that was consistent so she must've settled down eventually though after her third child there was a different dick, that one didn't last as long and then there were a couple of more after that when eventually they stopped all together. That's all you knew about Shari's personal life and that was just based off the dicks you had. You didn't know if Hannah and her were still friends. In fact you didn't know if Hannah was still human or if she had ended up in the same position as you. If she had made it, it meant Amy hadn't so either way one of the people you loved was in a similar position to you.<br>\r\n<br>\r\nGiven the years you were stuck in this form, which was longer than what you had ever been human for, you thought you'd eventually forget your life and that your brain would eventually shut down. Of course this was never the case, not even when you stopped getting runny noses or feeling Shari's touch all together. Even after Shari had died you continued to live on. Not on her body, otherwise you'd have rotted away but shortly after the runny noses had stopped you felt yourself being removed from Shari's body and placed in some cool liquid. Now that's the only feeling you knew, being submerged in this cool liquid and that's how you stayed for the rest of eternity.</span></div></div>",
            "created":1562994000,
            "id":2686061,
            "title":"Forever with Shari"
        },
        "134223":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She turns them into creepy crawlies",
                "She shrinks you all",
                "More Options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Just remember ladies, before I alter you, this is all Marcus' fault, just because he objectified your bodies,\" Tiffany reminded them once more before she cast her wicked spell.</span></div></span></div>",
            "created":1566536400,
            "id":2706541,
            "title":"More Options"
        },
        "1342232":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She squishes someone",
                "She and her friends leave.",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>Vertigo suddenly hits you as the entire world is enlarged as you are shrunk to the size of an ant. The tile you're standing on is now bigger by comparison than the bathroom when you were at full size and the naked women that were only a few feet away are now out of sight.<br>\r\n<br>\r\nTiffany is still standing behind you and her shadow makes it feel like night time. All you can see of her though is her giant shoes, now the size of large hills and her legs that reach skyward, you couldn't even see the top of them. In the distance though, you could make out her friends though now they seemed a lot more blurry and you couldn't quite make out their faces.<br>\r\n<br>\r\nThe ground shook and a loud clap of thunder rang through your ears as Tiffany stepped forward, allowing the light on the wall shine on you. You could hear her speaking but couldn't make out the words as they were too loud for your tiny ears. You imagined she was taunting you or explaining the next part of her plan, as she now stood between you and the other women.</span></div></div>",
            "created":1566536400,
            "id":2706557,
            "title":"She shrinks you all"
        },
        "13422323":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You are picked up and put into a container with everyone else.",
                "She takes off her panties and squats over you",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>What ever Tiffany said, it wasn't to you, it was to her friends as they were now on the move, one was now right on top of you, while the other followed Tiffany out of the bathroom.<br>\r\n<br>\r\nYou wondered what Tiffany had said as you're blown back by the gust of wind, caused by the door closing.</span></div></div>",
            "created":1566536400,
            "id":2706559,
            "title":"More Options"
        },
        "134223232":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "The end",
                "Continue with one of the other women",
                "Continue with Tiffany or her friends."
            ],
            "content":"<div class=\"\"><div> <span>Tiffany's friend is positioned over head though you can't make out what she's doing until it's too late. Her knees bend and that's where you catch the first glimpse of her panties being lowered until they are right over you, like a large tent. She raises one foot to step out of them, and lowers it again, knocking you over in the process. You are now staring straight up, looking at the panty filled sky. Though that view changes as her other foot raises and descends and the panties are removed from sight. Now the sky is filled with her vulva and anus.<br>\r\n<br>\r\nWhat's worse is they are getting closer, as she bends down right on top of you. There's an impact of yellow liquid that drops from the sky and lands right next to you, spraying you with a stinging pain from the speed and pressure. You barely have time to comprehend what's coming next as the waterfall if urine crushes you underneath.<br>\r\n<br>\r\nYour bones are broken and mangled as you go blind from the salty liquid. You're fully submerged as you drift through the tsunami of piss. Your collapsed lungs fill up and you take your final breaths in the lake sized puddle on the bathroom floor.</span></div></div>",
            "created":1566536400,
            "id":2706564,
            "title":"She takes off her panties and squats over you"
        },
        "1342232321":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "content":"<div class=\"\"><div> <span>Your tiny corpse is left in the giant puddle as the other tiny women were left in the bathroom, which now felt like the size of a town to them. They tried to make their way to the door but the puddle was in the way, so they had to take the long way round. They didn't see your body as they made their escape.<br>\r\n<br>\r\nUnfortunately they didn't get to the exit before the janitor was called into the bathroom to clean up the mess. He saw what he thought were bugs and in his boredom, dropped the mop directly on them. Ms Darwin was crushed instantly, while Shari and Hannah hung onto the the rope. Amy was pushed into the puddle of piss and her body broken.<br>\r\n<br>\r\nHannah and Shari held out, as the ropes became saturated so did they. They were bruised and sore but they survived the initial wave. They clung to the mop, as it was lifted into the air. Hannah jumped to her death when she saw they were about to be dunked into the bucket, while Shari was drowned in the soapy clean water.<br>\r\n<br>\r\nNo one would know what became of you or them.</span></div></div>",
            "created":1577509200,
            "id":2765587,
            "title":"The end"
        },
        "13423":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She doesn't do anything else, as exposing yourself is enough.",
                "It's time to flush you down the toilet",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>You looked at Tiffany confused, she knew you'd enter the girl's bathroom by mistake? That wasn't it, she could do more than that. <br>\r\n<br>\r\n\"Oh yes, I made you come in here, it's so easy for me to control your mind, check this out,\" Tiffany confirmed.<br>\r\n<br>\r\nWithout her saying another word, you pulled your pants down, exposing your dick to the three girls. You looked down at your dick as you saw your pants on the floor, you wanted to pick them up and cover yourself but your arms stayed by your side.<br>\r\n<br>\r\n\"Hmm, it's a little on the smaller side,\" Tiffany commented. \"And no this doesn't make us even for what you did to me, I mean it might, if I had pulled down your underwear but you're the one who just exposed yourself to us.\" Tiffany took a step towards you until she was right up in your face. \"Now it's time to make you pay.\"</span></div></div>",
            "created":1558414800,
            "id":2662133,
            "title":"Deeper trouble"
        },
        "134232":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Turning into a turd",
                "Liquidfying into piss",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Tiffany made you walk into an empty cubicle, with your pants still around your ankles. When you got into the cubicle though, you completely undressed yourself and stepped into the toilet bowl, bare foot. You struggled to turn around as you faced Tiffany, while the other girls stood watch.<br>\r\n<br>\r\n\"Please...\" You begged. \"I have a family, I have a girlfriend... I know you hate me for what I did to you all those years ago but this, I don't deserve this...\" Tears rolled down your face as you pleaded for your life. \"I'll do anything, just don't flush me down the toilet.\"<br>\r\n<br>\r\n\"Okay,\" Tiffany paused for a moment giving you a chance to come up with something different. \"What will you do instead?\"<br>\r\n<br>\r\nYou breathed a sigh of relief, this was your chance to save yourself. \"For years you've never been the one to punish me directly,\" your mind raced with terror as your heart beat grew faster, these weren't your words, these were hers. She had given you a second chance, one that she controls. \"So why should this be any different, I walked into the bathroom, I stripped in front of you, I'm the one that stepped into the toilet. So don't you flush me down the toilet, get one of your friends to do it instead.\"<br>\r\n<br>\r\n\"Fine...\" Tiffany played along with what she was making you tell her. \"Though you can't be flushed like that anyway, you're too big, I'm going to need to change you first.\"<br>\r\n<br>\r\nYou then change by<br>\r\n</span></div></div>",
            "created":1558414800,
            "id":2662143,
            "title":"It's time to flush you down the toilet"
        },
        "1342321":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Someone comes looking for you",
                "Continue with Tiffany as she abuses her powers",
                "The End"
            ],
            "content":"<div class=\"\"><div> <span>You barely let out a screw as your entire body shifted, turning int a long and thick brown log. You were now floating in the water of the toilet looking up at Tiffany and one of her friends.<br>\r\n<br>\r\n\"You stink,\" Tiffany was disgusted by the sight of you. \"As promised, I'm not going to be the one to flush you,\" she turned towards her friend. \"You do the honors and maybe you can have your mouth back.\"<br>\r\n<br>\r\nYou watched as Tiffany's friend reached for the flush button, giving you a look with her sad eyes, she pressed the button and a wall of water came crashing down around you, submerging you and sending you through the pipes and down into the sewer.</span></div></div>",
            "created":1558414800,
            "id":2662207,
            "title":"Turning into a turd"
        },
        "13423213":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "content":"<div class=\"\"><div> <span>You drifted for hours among the filth of the sewer, joined by vomit, piss and shit, all surrounding you in this horrible final stages of your life. Chunks of you had already broken off as you got smaller and smaller.<br>\r\n<br>\r\nYour final thoughts wondered how Tiffany could be such a cruel and vile person to do this to another living being and how your loved ones would miss you, not knowing what happened to you. They would never get closure, for them you were there one day and gone the next.</span></div></div>",
            "created":1558414800,
            "id":2662209,
            "title":"The End"
        },
        "135":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You have weird and vivid dreams",
                "You wake up in Tiffany's house",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The rest of your day continued relatively smoothly, none of Tiffany's lackey's bothered you and when you got home, Hannah and Shari had already left. You enjoyed a quiet night in, working on your school work then winding down playing games.<br>\r\n<br>\r\nNothing seemed out of the ordinary so far and so you assume Tiffany was bluffing about her so called powers. It was a stupid comment to make, she could've at least came up with something more believable like she hired a hitman to kill you.<br>\r\n<br>\r\nYou were feeling rather tired and decided to go to bed early. You settle into bed and close your eyes....</span></div></div>",
            "created":1602426960,
            "id":2919057,
            "title":"Calm before the storm"
        },
        "14":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She has a wild class project today",
                "She has a insane assignment to hand out",
                "She wants to see someone after class",
                "You feel a weird sensation",
                "More options"
            ],
            "content":"<div class=\"\"><div> <span>Ms Darwin, or Laura was easily you favourite teacher at school. She's friendly, caring and fun. None of her lessons were boring as she always made the more boring classes into fun activities. It also didn't help that she was rather attractive too, only barely in her thirties she still had a strong look of youth about her. Being a high school teacher, she was often moderately dressed and usually had her hair up in a bun. Though you had caught her out in public a few times where she wore clothes that showed some cleavage as well as the rest of her curves and with her hair down. Seeing her like this just made you feel more attracted to her.<br>\r\n<br>\r\nWhile you have started to date Amy, your romantic relationship is nonexistent at this stage and appearance wise you don't find her attractive as Ms Darwin. In fact out of all the women you've found attractive so far, Tiffany is probably the most attractive with Ms Darwin coming in second and Shari coming in third. Shamefully you found Hannah to be more attractive than Amy.<br>\r\n<br>\r\nAs much as you liked biology, at least the teacher, you weren't all that good at the subject or you subconsciously tried to be bad at it as you didn't really pick things up in class and it wasn't until you spoke to Ms Darwin privately you understood it better. Still you got Bs in the subject. Biology was one of the few classes you shared with both Tiffany and Amy as well.<br>\r\n<br>\r\nWhat made Biology more enjoyable was that it was usually the last subject on Friday, so it helped getting a good start to you weekend.<br>\r\n<br>\r\nOne thing you didn't know however this Biology session would be a strange one, as Ms Darwin was a witch and today she planned to use her powers.</span></div></div>",
            "created":1563426000,
            "id":2688788,
            "title":"Ms Darwin"
        },
        "141":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Her 'body swap machine'",
                "Magic scalpels ",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Ms Darwin had come from a long line of magic users, however her mother never taught her and focused on teaching her daughter to pursue the sciences instead. It wasn't until her mother died that she discovered the truth about magic and that she was capable of becoming a witch. Ms Darwin had studied magic, like she had with any other subject and she was glad that she did. She learnt magic came at a cost, either to one's soul or it took a physical toll, which is what had killed her mother.<br>\r\n<br>\r\nShe didn't care as much about her soul, but she didn't want to become old and withered. Though she had learnt that it was less taxing on someone if she cast spells on objects instead of directly casting them on people. She wanted to actually play with her magic rather than letting it go to waste.<br>\r\n<br>\r\nHer Friday afternoon class would be the perfect opportunity to try experimenting. She enchanted the classroom doors so only she could open the door and started the lesson. Today she would be playing with... </span></div></div>",
            "created":1591246800,
            "id":2845631,
            "title":"She has a wild class project today"
        },
        "1412":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "One person would be cut open",
                "A male and female would be cut open",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>When coming up with something fun to try, she observed the anatomy doll set up in the class room. She had had dreams of that thing coming to life and removing its bloodless organs, so she thought that might be fun to try with her students.<br>\r\n<br>\r\nHer scalpels had been enchanted to be able to cut things open without damage. Anything removed would become immune to damage and any cut could be resealed. She had only tested it briefly on herself, cutting off her hand before reattaching it, but she hadn't tried swapping her hands to see if that were possible.<br>\r\n<br>\r\nShe decided she'd be handing these scalpels out to her students and conducting a live autopsy. She knew full well that her students would likely abuse them but she didn't care.<br>\r\n<br>\r\nAll she had to decide was who would be cut up.</span></div></div>",
            "created":1591419600,
            "id":2846589,
            "title":"Magic scalpels "
        },
        "14122":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Amy",
                "Tiffany",
                "Herself"
            ],
            "content":"<div class=\"\"><div> <span>If Ms Darwin was going to give an anatomy lesson by performing an autopsy on one of her students, she figured it'd be best to do two at the same time, one male and one female.<br>\r\n<br>\r\nFor the male she had already chosen that would be you. She knew you admired her and preferred a more hands on education. She hadn't decided who her other victim was yet as she got the class to rearrange the room until there were two long tables left in the center of the room.<br>\r\n<br>\r\n\"Marcus, please strip and lay on the table,\" Ms Darwin said, shocking you and everyone else in the room. You didn't comply at first and the rest of the class wondered if this was some sort of joke. \"Marcus...\" Ms Darwin's voice changed, it sounded more alluring and you would do anything for her. \"Now please...\"<br>\r\n<br>\r\nYou nodded as you took off your shirt and kicked off your shoes, you pulled down your pants and took your socks off, you were about to lay on the table with just your underwear on, already feeling rather exposed. <br>\r\n<br>\r\n\"All of it Marcus,\" Ms Darwin stated, the class was in an uproar now, wondering what was going on. A couple of students tried to open the door to report Ms Darwin for inappropriate behavior. Tiffany smiled wickedly though she didn't actually want to see you naked. Amy looked on, fascinated by what was happening.<br>\r\n<br>\r\n\"Calm down class, this is just a normal lesson,\" Ms Darwin raised her hand, calming everyone as you stood in front of them, completely naked. You hopped on the table and laid down. \"Hands to the side, and remain completely still,\" she ordered you. You looked up at the roof unable to move wondering what was going on.<br>\r\n<br>\r\nMs Darwin stood over you with a scalpel in her hand and smiled. \"Remain calm, Marcus, no harm will come to you,\" she said as she put the blade in you chest and cut all the way down to your belly button. All you felt was the cold metal go down your body but nothing else. \"Alright class, scalpels are on the table over there, however before we continue, we need to examine a woman as well.\"<br>\r\n<br>\r\nMs Darwin thought for a moment then decided the other person would be...</span></div></div>",
            "created":1591678800,
            "id":2848404,
            "title":"A male and female would be cut open"
        },
        "142":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Pregnancy Assingment",
                "Gender Assingment",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Ms Darwin hated her job, she loved the sciences but she was never quite smart enough to pursue the career she wanted, so she became a teacher instead. She was put in charge of biology which to her was the most boring of the three and she would've preferred to teach chemistry or physics instead, as they allowed for more exciting experiments.<br>\r\n<br>\r\nIt was less about the sciences though and more about the students, most of them never really engaged and the main student she had that did, did so because he admired how she looked, he'd find excuses to get one on one time with her. She wouldn't mind as much if he was getting As but he still didn't fully grasp it enough.<br>\r\n<br>\r\nShe was currently teaching them the most pointless subject to teach young adults, reproduction. Either her students still didn't have the maturity to not make jokes or they had already partaken in the act. She wanted to spice things up a little.<br>\r\n<br>\r\nShe would get her wish, when her mother died and she discovered her family secret, that she was from a line of witches and it had been kept from her. For good reason as she soon learnt.<br>\r\n<br>\r\nStill the temptation was too strong not to use magic in her school work and she figured it would be the best way to teach her students, she decided that her Friday afternoon class would be given an extra credit assignment... she was going to hand out a....</span></div></div>",
            "created":1591419600,
            "id":2846585,
            "title":"She has a insane assignment to hand out"
        },
        "1421":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You had a vagina",
                "You still had your dick",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>With her new found powers, Ms Darwin decided to make things interesting. She was going to hand out a fun weekend assignment for her whole class. It would be easy enough to get away with, she was the last lesson they'd have on Friday, though it wouldn't be until Tuesday before she undid what she was about to do.<br>\r\n<br>\r\nShe had talked about pregnancy and the development cycle before but now she would ensure her students could experience first hand. Ms Darwin considered school to be a safe learning environment so she figured it would be best to teach her students what it's like without the life changing impact that went along with it. <br>\r\n<br>\r\nShe had a devious smile as she thought about handing this assignment out. It would be unfair only to give this assignment to the girls. In fact the boys probably needed this more, they needed to know what it felt like to be pregnant so they wouldn't be so reckless with their sexual pursuits.<br>\r\n<br>\r\n<b><div align=\"center\">* * * * *</div></b><br>\r\n<br>\r\nYou entered the classroom and sat down at your spot, which as always was at the front of the class, so Ms Darwin could catch whatever Tiffany's goons had planned. Amy was at the back like usual, avoiding eye contact with everyone. Tiffany say in the middle so she could interact with as many people as possible.<br>\r\n<br>\r\nYou were looking forward to learning something new today but Ms Darwin just went over pregnancy, trimesters and such over again before giving you a pop quiz.<br>\r\n<br>\r\n\"Alright class, now that we've gone through the refresher and you've tested your knowledge. It's time for the practical aspect, I'm giving you a weekend assignment that will be handed in first thing Tuesday,\" Ms Darwin seemed more lively today though she also seemed distracted as she looked at something under her desk.<br>\r\n<br>\r\nYou were wondering what she meant by a practical assignment for reproduction, you wondered if it was one of those baby dolls you had seen in movies or one of those pregnancy suits, though there didn't seem to be anything to suggest either of those things. You heard the others students talking, they were all just as confused as you were.<br>\r\n<br>\r\nYour attention returned to Ms Darwin as you heard her chanting some weird language, though being science class she was probably just saying technical terms. The lights in the room flickered and you felt an electrical charge hit your groin and settle in near your belly. You felt a pressure building and you felt like you were going to be sick but it soon subsided. Everyone else in the class also seemed to have the same reaction.<br>\r\n<br>\r\n\"You will be learning about pregnancy first hand,\" Ms Darwin said as you rubbed your belly. \"Over the weekend you will go through the three trimesters and come Tuesday you will feel what it's like to go into labor. Don't worry, though, there's no actual baby.\"<br>\r\n<br>\r\n\"You're crazy!\" One of Tiffany's lackeys yelled, though she seemed quite unsettled.<br>\r\n<br>\r\n\"Don't believe me, I don't care, it doesn't change anything. You can take this assignment up with your parents or guardians too, though keep in mind if I could do something like this for educational purposes, what might I do if I get mad...\" Ms Darwin threatened. \"Class dismissed.\"<br>\r\n<br>\r\nIt was still about half an hour before school was meant to end but Ms Darwin was finished with her 'lesson'. You saw people were slow to get up, and some still touched their bellies. They didn't want to believe what Ms Darwin had done, how could they, it was impossible. But the feeling in your lower belly told you that this was real.<br>\r\n<br>\r\nThough if that were the case, you were male how were you pregnant. You focused not on your belly but your groin, with less people in the class you slipped your hand down your pants and found...</span></div></div>",
            "created":1598590800,
            "id":2893555,
            "title":"Pregnancy Assingment"
        },
        "143":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You",
                "Tiffany",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Ms Darwin knew you were having a rough time lately. She had been your teacher for 2 years and had seen how the other students would harass you. She knew it was Tiffany giving the orders, though when she punished Tiffany for it but she never did anything directly in front of a teacher that would count as 'actionable'. She had given Tiffany detention in the past but that just lead to her getting a strongly worded letter from Tiffany's parents and had the principal reprimand her.<br>\r\n<br>\r\nNow that she got her powers, the principal and parents wouldn't stop her from dealing out punishments. She could even be more creative in her punishments. A simple detention wouldn't dissuade a bad student, instead she could do something more impactful or longer lasting.<br>\r\n<br>\r\nShe also loved experimenting and experimenting with magic, especially on others, had an appeal to it. It would be less hassle to get a student or two alone to help her with this. Her mind went to you and Tiffany. You usually wanted to see her after class just to get a better understanding of the lesson, while Tiffany was a terrible student and one that Ms Darwin had not been allowed to properly discipline.<br>\r\n<br>\r\nIt was a Friday afternoon and the last class before the end of school, so she'd have plenty of time to do whatever she wanted before their absence was noticed.<br>\r\n<br>\r\nIt was only 5 more minutes until the bell rang and her students would leave before she decided that ______ would see her after class.</span></div></div>",
            "created":1602306900,
            "id":2918358,
            "title":"See me after class"
        },
        "1431":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "What you think of me",
                "Tiffany",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Marcus,\" Ms Darwin said suddenly, almost startling you. \"Can you please see me after class?\" You didn't have time to respond as the bell rang and the class was dismissed. You stayed behind, wondering what this was about. \"Thank you for staying,\" she said as she tidied up her desk.<br>\r\n<br>\r\n\"I usually do anyway,\" you quip as you usually hang around waiting for Tiffany's gang to leave before braving the halls.<br>\r\n<br>\r\nShe walked over to your desk and pulled up a chair. \"I guess you do,\" she acknowledges as she sits in front of you. \"Though it's not your work I want to discuss,\" she informs you as she swept some of her hair back behind her ear. \"I've noticed you seem down more than usual. Half the class picks on you or tries to distract you from your work but that's not the only thing.\"<br>\r\n<br>\r\n\"My parents recently moved, so I've been sharing a small apartment with my cousin and her friend... it's been challenging,\" you nod.<br>\r\n<br>\r\n\"Ah...\" Ms Darwin examined you in a way that made you feel a little uncomfortable. \"The reason why I wanted you stay behind is because there's something I want to discuss with you, about myself.\"<br>\r\n<br>\r\nThis confused you, students didn't get asked to stay behind to discuss their lives.<br>\r\n<br>\r\n\"But before I tell you what it is I wanted to discuss...\"</span></div></div>",
            "created":1602318660,
            "id":2918418,
            "title":"A meeting with Ms Darwin"
        },
        "14311":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She makes you her pet",
                "She comes up with a way for you to be together",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I've noticed you seem to pay a lot of attention to me, though it's not until we're alone that you seem to grasp the work better,\" Ms Darwin smiled in an almost flirtatious manner. \"Why is that?\"<br>\r\n<br>\r\n\"I don't know, you're a pretty good teacher I guess,\" you diverted your eyes as your cheeks grew warm, you couldn't tell her the real answer.<br>\r\n<br>\r\n\"Come now Marcus...\" she reached towards you, almost touching your hand. \"We both know it's more than that. I just need you to be honest with me so I can be honest with you.\"<br>\r\n<br>\r\nYou looked down at her hand and then looked her in the eyes again, you bit your lip in contemplation. Honestly what was the harm in admitting you had a crush on your teacher, you wondered. Other than it being embarrassing and people teasing you about it. You already had a hard enough time as it was.<br>\r\n<br>\r\n\"Like I said, you're a good teacher and the other students, they distract me.\"<br>\r\n<br>\r\n\"Tsk, tsk, tsk,\" Ms Darwin shook her head as she reached up for her bun and let her hair loose, she then unbuttoned the top of her blouse, showing a little bit of cleavage. If any other teacher saw this, you knew she'd be fired on the spot. \"I guess you leave me no choice but to cast a truth spell.\"<br>\r\n<br>\r\nYou looked at her dumbfounded but that was more with how she took on a more relaxed appearance rather than the mention of a spell. You were glad there was a desk in the way, hiding your growing erection.<br>\r\n<br>\r\n\"Do you have a crush on me?\" She asked more directly this time.<br>\r\n<br>\r\n\"Yes,\" you offer with no resistance. That made her smile wickedly.<br>\r\n<br>\r\n\"Have you had any naughty thoughts about me?\" She asked playing with her hair.<br>\r\n<br>\r\n\"I've had several wet dreams, where you give me an private lesson in anatomy,\" you confess.<br>\r\n<br>\r\n\"And you wish that I would give you these lessons in real life?\" She reached for another one of her buttons.<br>\r\n<br>\r\n\"Yes...\"<br>\r\n<br>\r\n\"Thank you for your honesty,\" she buttoned the top of her blouse again and stood up. She looked semiprofessional now that her hair was down. \"It's my turn to be honest with you,\" she turned back towards you. \"My mother recently died and well it turns out she was keeping a secret from me. I'm a witch.\"<br>\r\n<br>\r\nNow you knew Ms Darwin was toying with you, there was no such thing as magic, but then why did you admit to the things you just did. You would've gotten up and left if it hadn't been for your awkward boner.<br>\r\n<br>\r\n\"I kept you after class because in all honesty, I want to experiment with my powers and you're a nobody. You're a sad and lonely boy. No one will miss you if your gone, so you're the perfect plaything,\" she gave you a sinister look. \"Though I must admit that your affection for me is amusing and flattering, so maybe I'll act on that instead....\"</span></div></div>",
            "created":1602326400,
            "id":2918480,
            "title":"Feelings for Ms Darwin"
        },
        "143111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She shrinks you",
                "She turns you into a mouse",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"You mentioned you were living in a small apartment right? With two other people?\" Ms Darwin changed the subject.<br>\r\n<br>\r\n\"Yes, it's only two bedrooms. I'm sleeping in my cousin's bed while they share the bed with their friend\" you felt the spell still working on you.<br>\r\n<br>\r\n\"So it's like a cage and you're an inconvenience for them?\" Ms Darwin's eyes light up as the end of her hair began to float upwards.<br>\r\n<br>\r\n\"I guess...\" you didn't actually know how to answer that but a part of you told you that was true.<br>\r\n<br>\r\n\"So if I told your cousin I re-homed you, she would be fine with that?\" You felt the hairs on your arms begin to rise as the lights in the room flickered. You didn't like how Ms Darwin phrased that question.<br>\r\n<br>\r\n\"If she knew I was in a safe environment,\" you were able to get out, hoping that that would stop Ms Darwin from doing anything to terrible.<br>\r\n<br>\r\n\"Then it's decided then, you'll be my pet,\" you felt a electric pressure surround you as it began to squeeze. \"Don't worry I'll take good care of you.\"<br>\r\n<br>\r\nMs Darwin aimed her hand towards you and you felt your body begin to change.</span></div></div>",
            "created":1602327480,
            "id":2918483,
            "title":"Teacher's Pet"
        },
        "1431111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She puts you in her bra",
                "She puts you in her purse",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The energy pushing against your skin as you feel like you're being crushed. Your shoes and socks fall off as your legs retract through your pants. Your shirt suddenly becomes way too large, so does your underwear and for a few seconds you float in midair before falling down into your briefs as your shirt falls on top of you.<br>\r\n<br>\r\nYou're buried in your smelling underwear, which is resting on top of your chair. You're careful not to move as one false step could make you fall and now you were tiny, it could kill you. You're smothered even more as your clothes are picked up in a pile then placed down on the floor.<br>\r\n<br>\r\nYour shirt lifts off the pile and you see a hand taller than you reach and grab you. Ms Darwin lifts you up and places you on your desk. You feel so exposed being only two inches tall and naked.<br>\r\n<br>\r\n\"Aren't you just adorable,\" Ms Darwin coos as she bends over to examine you. \"You're going to make a fine pet.\" Her words come out like a strong wind. She picked you up again, though this time your hands were between her grip and your penis. \"Now let's find somewhere to store you while I take you to your new home.\"</span></div></div>",
            "created":1602341820,
            "id":2918566,
            "title":"Mini Marcus"
        },
        "14311111":{
            "author_id":"poisonmushroom",
            "author_name":"Poison",
            "choices":[
                "Ms Darwin plays with her new pet and rules?",
                "You try to escape your first chance?",
                "you choose?"
            ],
            "content":"<div class=\"\"><div> <span>Looking side to side for any prying eyes an a place to put you, her hair slid lightly around her breasts as Ms Darwin glanced down with a grin. Leaning forward her slender finger that seemed huge to you now poked into her blouse pulling it out a bit before her other hand let you slide out gently dropping between her full breasts.<br>\r\n  Her hands now empty she pinched the top of her bra cups and gave a few bounces settling you good between her soft mounds you so lusted after in her bra. You suddenly felt trapped from all sides as her soft flesh seemed to stick well to your naked skin not letting you move much. As she gathered her things to leave every jostle seemed to get a new grip around you holding you from moving much at all.<br>\r\n   The only settling thing was the sweet flowery smell that you loved so much about her perfume that seemed to make your ordeal a bit more bearable but from inside Ms Darwins bra like this was never part of it.. Another button buttoned on her blouse and all you could see now was occasional shadows through the material as you squirmed to work your way up out of her cleavage.<br>\r\n   Ms Darwin obviously felt this and knew what you were up to as she squeezed her arms against the sides of her boobs making her cleavage deeper and tighter before releasing them...also a bit harder to breathe as the two of them pushed up briefly covering your face before she replied to your attempt in a firm voice.<br>\r\n<br>\r\n\"Behave pet....we're nearly to your new home\"<br>\r\n<br>\r\nIt seemed like an eternity that you were in her bra the heat and moisture building between her breasts that kept you cuddled tightly.It wasn't until you heard a few doors shutting that you knew you must be close to where she was taking you. Soon this was very evident as suddenly you could see bright lights...closing your eyes until they adjusted more, the cool air was refreshing as she unbuttoned her blouse tossing it on a chair. She never spoke to you the entire way only to tell you to behave once and even now seemed to ignore you as she prepared things.<br>\r\n  You only got an occasional glimpse from between those ample boobs and seen reflections of her now in just her bra and panties as she seems to finish for the moment sighing then sitting down as a wave of flesh from her boobs briefly covered your head then long strands of her hair dangled to rest on you as you looked up and thought about trying to use them like a rope to pull yourself out of your prison!</span></div></div>",
            "created":1602432060,
            "id":2919099,
            "title":"She puts you in her bra"
        },
        "144":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "A part of you is missing",
                "You are turned into something",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Ms Darwin seemed to be glowing today and you weren't able to take your eyes off of her. She spoke like a siren when they lured men to their deaths, causing you to cling to her every word. While you were paying attention to Ms Darwin however, you were paying the wrong kind of attention, you didn't take in anything she was saying, you were just being soothed by her voice. Your eyes also lingered where they shouldn't, her cleavage when she faced towards the class and her butt when she wrote something on the board.<br>\r\n<br>\r\nThe entire world drowned out, until it was just you and Ms Darwin. She half turned to face you, after writing something and you watched as her clothes stripped away, leaving her naked in front of you. You were one hundred percent sure you were day dreaming now as the rest of the class was a white voice, except for you, your desk and the naked teacher.<br>\r\n<br>\r\n\"My, I didn't know you felt like that about me,\" Ms Darwin's voice said in your head, as she turned around fully, ignoring the fact she was naked. She was giving you a comforting smile, though that's not where your attention was drawn to. \"We should do something about this, it's inappropriate after all.\" As she said that her clothes reappeared and the world returned to normal, you felt something different about yourself though.</span></div></div>",
            "created":1578114000,
            "id":2769071,
            "title":"You feel a weird sensation"
        },
        "1441":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Your heart",
                "Your genitals",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You didn't feel whole anymore and your lust for Ms Darwin faded. You stared at Ms Darwin, now able to hear the lesson she was actually teaching, and your eyes focused on her face. She seemed to be looking at you directly as she talked, giving you a sympathetic smile and with sorrow in her eyes.<br>\r\n<br>\r\n\"Are you okay, Marcus?\" Ms Darwin asked aloud, causing the class to turn towards you.<br>\r\n<br>\r\n\"I'm fine,\" you lied. You were not fine, but you didn't know what was wrong with you and you didn't want everyone else to figure it out before you did.<br>\r\n<br>\r\nLittle did you know Ms Darwin had taken...</span></div></div>",
            "created":1578114000,
            "id":2769072,
            "title":"A part of you is missing"
        },
        "14411":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You go to your heart",
                "You speak to Ms Darwin",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Are you sure now?\" She inquired further. \"You look a little pale.\"<br>\r\n<br>\r\nWhen she said that you noticed you were whiter than usual, not only that you felt cold. You also noticed that your heart didn't seem to be beating anymore. You would've panicked but without your heart it was impossible to do so. \"I said I'm fine\" you said coldly as you returned to your work. You paused for a moment when you noticed the anatomy doll in the corner of the room appeared to have an organic heart, it was also now beating.<br>\r\n<br>\r\n\"As long as you're sure,\" Ms Darwin gave a sly smile as she returned to the lesson.<br>\r\n<br>\r\nYou were no longer distracted by Ms Darwin, instead now you were distracted by your heart in the anatomy doll. You couldn't seem to take your eye off it, though you didn't feel emotional about it being there.<br>\r\n<br>\r\n\"Hmmphmm\" Ms Darwin made a noise as she stood between you and the Anatomy Doll. \"Get back to work please.\" You looked at the board and noticed you were meant to be going through your text book and taking notes. You got to work straight away and kept going until the end of class.</span></div></div>",
            "created":1578114000,
            "id":2769074,
            "title":"Your heart"
        },
        "15":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Shari",
                "Hannah",
                "Hannah, Shari, Amy, Tiffany and Ms Darwin",
                "Someone with a grudge.",
                "More options"
            ],
            "content":"<div class=\"\"><div> <span>Shari wasn't too happy with the Hannah's arrangement to have you stay with them, especially when it's only a two bedroom apartment and Hannah loves to cause trouble with her so called pranks. So only one of them having powers could create a different kind of chaos not seen with them both having powers.<br>\r\n<br>\r\nAll the women being witches will mean trouble for you as some might desire to punish, some might decide to prank or some might want you all to themselves. You will certainly struggle as they fight for control of your life.<br>\r\n<br>\r\nYou have been found guilty by association as a witch you do not know seeks vengeance against one of the women in your life. It's going to be hard to avoid the crossfire as spells and curses go flying.</span></div></div>",
            "created":1557637200,
            "id":2658775,
            "title":"More options"
        },
        "151":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Marcus will be punished anytime he does something wrong",
                "Three people are too many for this apartment",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Ever since you moved in Shari has wanted you gone. She hated how her personal space had been completely taken up by Hannah and how you often, though accidentally invaded her privacy.<br>\r\n<br>\r\nShari had a Mediterranean heritage, though you weren't sure from where. She had straight sandy brown hair that reached her shoulders, tanned skin and hazel eyes. She had a petite build and was only around five feet tall. Shari had a lot of attitude and took crap from no one, except for Hannah. As far as tormentors go, she was on par with Tiffany, only she targeted you because you were a nuisance not because she hated you.<br>\r\n<br>\r\nTo catch a break from the apartment, Shari would sometime visit her grandmother over the weekend. She didn't complain or bad mouth you or the situation but her grandmother knew something was up. Her grandmother revealed to Shari her knowledge of witchcraft, though she herself wasn't a witch, people in her family had been. She warned Shari that going down this path would have terrible consequences.<br>\r\n<br>\r\nShari was curious and didn't want to pass up the chance to have real power, so she figured consequences be damned and became a witch.<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- ---------<br>\r\n<br>\r\nIt was Sunday afternoon and Shari had just gotten back from her grandmother's house. She looked tired and worn out though mostly around the eyes. Her smile is drew your attention though, she had a wicked grin when she walked in the door, it was rather unsettling.<br>\r\n<br>\r\nHannah hugged Shari, even though it had been two days, she still missed her friend. She noticed Shari's face. \"Is everything alright?\" Hannah asked confused. \"You look like someone died but at the same time look like you just won the lotto.\"<br>\r\n<br>\r\n\"The old me is dead,\" Shari said coldly as she stepped away from Hannah's embrace and walked between the two of you. \"And in exchange, I can now do whatever I want.\" Shari looked at you, her eyes suddenly came alive. \"First things first....\"</span></div></div>",
            "created":1583470800,
            "id":2797649,
            "title":"Shari"
        },
        "1512":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She transforms you",
                "She transforms Hannah",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm sick of sharing my bed,\" Shari stated looking at Hannah. \"I know Marcus has no where to go but I want my bed to myself again.\"<br>\r\n<br>\r\n\"Shari, I know it's been annoying, it has for me too,\" Hannah tried to assure her friend. \"It's too much to ask for someone to sleep on the couch, it's too short, it'll be extremely uncomfortable, even if we took in turns. We've discussed this.\" Hannah's mouth sealed shut.<br>\r\n<br>\r\n\"Quiet, Hannah, I'm thinking,\" Shari's hand gesture signaled for her to shut up. Hannah's eyes went wide as she touched where her lips should've been. \"My grandmother taught me magic, she said it'd cost me but I feel better than ever,\" Shari explained. \"You have no idea how much silencing you excites me...\" Shari turned to you and squeezed her hand in your direction. You were no longer able to move and could barely breathe. \"You know, I was going to get change you into something that didn't require a bed but using magic like this is exhilarating and I'm now tempted to keep you as my plaything and turn Hannah into something instead.\"<br>\r\n<br>\r\nShari restored Hannah's mouth by relaxing the gesture.<br>\r\n<br>\r\n\"Shari, please, this isn't you...\" Hannah begged.<br>\r\n<br>\r\nShari shivered. \"Oooh that begging, it's like an orgasm... I wish my grandmother had taught me magic sooner.\" Shari squeezed her hand in Hannah's direction and then brought both her hands together. You and Hannah slide across the room until you were both next to each other. \"Now let me think...\"</span></div></div>",
            "created":1583557200,
            "id":2797769,
            "title":"Three people are too many for this apartment"
        },
        "152":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She tells you about her new found powers",
                "She decides to cast a spell on you while you're sleeping",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Hannah was your only cousin on your mother's side. She was mischievous and wild spirit. When you were growing up, Hannah often acted as your baby sitter, which is why you were living with her now. She always loved to mess with you, a couple of times she had made you play dress up and she even did your nails and gave you make up. She's the one who told you about the thing that got you into trouble with Tiffany, though you never told your parents it was her.<br>\r\n<br>\r\nShe had long chocolate brown hair that flowed down her back and over her shoulders. She had slightly darker skin than you and bright green eyes. She was reasonably skinny, though her belly was starting to get bigger with all the drinking and partying she did. You weren't sure if she took any drugs but you wouldn't be surprised if she did.<br>\r\n<br>\r\nLiving with her had been a challenge. She often forgot you had her bed and would occasionally come home drunk and collapse next to you. If she had come home at all. She also liked to pull minor pranks on both you and Shari, which you'd often get the blame for, not helping with that relationship at all.<br>\r\n<br>\r\nStill you couldn't help but look up to and admire Hannah, though a lot of that comes back to your childhood. She had taught you so much (most of it bad) and had a lot of fun with you (a lot of the times at your expense). You'd do anything for Hannah, all she had to do was ask, a shame she stopped asking as she got older.<br>\r\n<br>\r\nThough there was something about Hannah than neither you or Shari knew. It was only something that happened recently, Hannah had been partying one night and met the wrong man. Shari had met someone that night and left Hannah alone. Hannah was saved by a strange woman, who decided to teach Hannah magic so she could protect herself in the future. Hannah was now a witch and she was going to use her powers to have some fun.</span></div></div>",
            "created":1583298000,
            "id":2796478,
            "title":"Hannah"
        },
        "1521":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She casts a spell on you",
                "She casts a spell on herself",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>It was Sunday morning and you were just getting out of bed. You weren't sure if Hannah or Shari were home as you hadn't heard either of them come in last night and usually they were pretty loud when returning home. You didn't mind when they didn't come back though, it brought you some very rare peace and quiet at least for a couple of hours.<br>\r\n<br>\r\nYou stepped out into the main area of the apartment and was surprised to see Hannah sitting at the table with a cockroach under a glass in front of her. She seemed to be lost in thought, she didn't even hear you and you quickly noticed how messy she was.<br>\r\n<br>\r\nHer hair was a mess and seemed to have some small debris in it, her red dress was torn at the bottom and her shoulder strap was broken. She was missing a shoe and the other shoe had a broken heel. Her dress was also very dirty. \"Is everything alright?\" you asked as you walked onto the other side of the table, her make up was runny and you tried not to look down at her cleavage as with one of her boobs were almost hanging out. \"Did you need me to call the police?\" You asked, surmising what might've happened.<br>\r\n<br>\r\n\"No, no..\" Hannah said in a calm voice. \"It's alright, nothing happened and the person who did this has been punished.\" She looked up at you, she seemed to be fine though her eyes looked more empty. \"Though if you wanted to do something for me, you could squish this bug. I can't work up the courage to do it.\" You shrugged and squished the bug without a second thought. \"Thanks Marcus, you're the best.\" Hannah got up off the chair and went to the bathroom to clean herself up, while you discarded the bug's remains. <br>\r\n<br>\r\nThirty minutes later Hannah returned to the dining room looking rather refreshed. \"So you'll never believe what happened last night,\" she said in a more energetic and playful mood. \"I was taught real magic...\"<br>\r\n<br>\r\n\"Um... are you sure you're alright?\" You asked worried for Hannah's well being.<br>\r\n<br>\r\n\"I'm fine, in fact let me show you something I can do...\"</span></div></div>",
            "created":1591160400,
            "id":2845245,
            "title":"She tells you about her new found powers"
        },
        "153":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "We'll all take in turns",
                "The Majority rules",
                "No killing"
            ],
            "content":"<div class=\"\"><div> <span>Across town in an old ran down library the five women met. Ms Darwin, Amy and Tiffany had all received summons by the school librarian, while Hannah and Shari were asked by a customer where they worked.<br>\r\n<br>\r\n\"Ms Darwin?\" Amy asked as she saw her teacher. \"What are you doing here?\"<br>\r\n<br>\r\n\"Oh, you're here...?\" Tiffany spat at Amy, not impressed to see the girlfriend of your mortal enemy.<br>\r\n<br>\r\n\"It appears we all got an invite here,\" Ms Darwin observed.<br>\r\n<br>\r\nAn old door creaked as two older women stepped through the door marked employees only. \"Good the five of you are here,\" the school librarian greeted the women. It was only then that Ms Darwin, Amy and Tiffany noticed Hannah and Shari standing in the corner.<br>\r\n<br>\r\nThe five of them followed the women to the back room, where there was an old dusty book, embedded with gems laying on an alter. \"For three hundred years our coven has stood, we are the last survivors, we have chosen the five of you to be our successors and so we grant you our power.\" The two old women grabbed a knife and cut open their hands, placing the palm on the largest gem on the book. The gem started to glow as two women turned to dust. The room lit up with a red glow as the five remaining people were filled with energy.<br>\r\n<br>\r\n\"What was that...?\" Shari asked as the dust of the other too faded completely.<br>\r\n<br>\r\n\"I think we're witches or something...\" Amy looked at her hands feeling the energies flow through them.<br>\r\n<br>\r\n\"Oh this is going to be so fun. Don't get too attached to Marcus, Amy...\" Tiffany warned with a wicked smile.<br>\r\n<br>\r\nHannah paused at the mention of your name and waited to see how the conversation unfolded.<br>\r\n<br>\r\n\"You do anything to him, Tiffany and I'll turn your friends into toads...\" Amy shot back.<br>\r\n<br>\r\n\"Girls!\" Ms Darwin snapped. \"Neither of you will be transforming anyone on school grounds while I'm around.\"<br>\r\n<br>\r\n\"Could you even stop us?\" Tiffany genuinely inquired. \"I mean I don't think we can cast spells on each other but could you honestly stop me from turning Marcus into a bug and squishing him?\"<br>\r\n<br>\r\n\"Well no... I don't think so but if I see either of you transforming anyone like that and I'll give you permanent detention.\" Ms Darwin threatened both of them.<br>\r\n<br>\r\n\"Wait, you're that Tiffany?\" Hannah asked finally speaking up. She knew enough to decide they were talking about you.<br>\r\n<br>\r\n\"What do you mean that Tiffany?\" she shot back.<br>\r\n<br>\r\n\"Wait are they talking about your cousin?\" Shari realized.<br>\r\n<br>\r\n\"You're Marcus' cousin?\" Tiffany asked. \"You're not the one who told him to do what he did are you?\" Tiffany gave Hannah a death glare. She tried to cast a spell on Hannah but it didn't work. \"Damn, I was right...\"<br>\r\n<br>\r\n\"What did you just try to do to me?\" Hannah asked as she took a step towards Tiffany.<br>\r\n<br>\r\nShari held Hannah back for a second. \"Wait, so this is the girl that, Marcus did the thing to?\" Shari clarified. She stepped away from Hannah and joined Tiffany. \"I'm with her. Maybe not the squishing part but your cousin is a creep, I'd love to teach him a lesson or two.\"<br>\r\n<br>\r\nAmy walked over to Hannah, joining her side. She was ready to protect you or at least punish those who messed with you.<br>\r\n<br>\r\n\"Now, girls...\" Ms Darwin stepped between the two groups. \"We've just become a coven and we're already fighting, over a boy no less.\" She took the roll of mediator. \"We're a family now, so we're going to resolve this. When it comes to casting spells on Marcus...\"</span></div></div>",
            "created":1591246800,
            "id":2845555,
            "title":"The Coven"
        },
        "1532":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You must agree with me on the first choice",
                "You must say yes and no an equal amount of times.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"There are five of us so let us make a contract, for any spell to work on Marcus, three of us must agree to it,\" Ms Darwin offered, knowing full well she would often be the deciding factor. Two camps had already formed.<br>\r\n<br>\r\n\"No way,\" Tiffany refused those conditions. \"I'd rather do what I want to him whenever.\"<br>\r\n<br>\r\n\"And if you do, your friends will pay,\" Amy countered.<br>\r\n<br>\r\n\"We're working out solutions here, girls...\" Ms Darwin reminded them. \"We'll add the majority rules circumstance for changing anyone we know and love, everyone else is fair game.\" Ms Darwin offered as a way to protect against retaliation.<br>\r\n<br>\r\n\"I still don't get to have the fun I want though,\" Tiffany crossed her arms.<br>\r\n<br>\r\n\"Killing my cousin isn't fun!\" Hannah snapped.<br>\r\n<br>\r\n\"But turning him into a bug would be...\" Shari mused. \"Not our fault what might happen to him after that.\"<br>\r\n<br>\r\n\"This is why we need to agree,\" Ms Darwin snapped. \"Look, I'm not going to say no to every little wicked idea,\" she informed Tiffany and Shari. She then turned to Hannah and Amy. \"I also promise that I'll make sure whatever the idea is is safe and revertible. In all honesty, while he is one of my better students, I don't really care either way.\"<br>\r\n<br>\r\n\"Whatever we decide we'll be bound by it,\" Amy said, flicking through the first pages of the book. \"We can't change our minds later. So I trust Ms Darwin and will agree to the majority rules term.\"<br>\r\n<br>\r\n\"If we're bound by it, then I have some conditions if Ms Darwin is going to be the decider the majority of the time,\" Tiffany offered.<br>\r\n<br>\r\n\"What is it...?\" Ms Darwin asked happy to be getting somewhere</span></div></div>",
            "created":1591246800,
            "id":2845584,
            "title":"The Majority rules"
        },
        "154":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Someone in the appartment building doesn't seem to like Hannah and Shari",
                "Amy has an ex girlfriend she failed to mention.",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>Your life is about to change, not because of your actions but the actions of those around you. You might only witness the witch's curse, dealing with the aftermath or you might be used as ammunition in the witch's revenge.<br>\r\n<br>\r\nHannah and Shari can be obnoxious at times as they were party girls, they loved to drink and listen to loud music and neither of them knew when to shut up. This has caused some issues with a few neighbors and it's possible that one of them might be a witch.<br>\r\n<br>\r\nWhen you first started dating Amy, you knew she was bisexual, what you didn't know is there was a girl she dated before you. This was a few years ago before Amy moved to town.</span></div></div>",
            "created":1557637200,
            "id":2658776,
            "title":"Someone with a grudge."
        },
        "1541":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Old ladies",
                "Dogs",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You were in Hannah's room trying to concentrate on your school work, which was rather difficult as Hannah and Shari were having a two person party. They had started with a few drinks then they turned up the music, now they were dancing around the small apartment. You never liked it when they did this and preferred when they went out to party.<br>\r\n<br>\r\n\"Finally...\" you said relieved as the music stopped and the thumps of the girls dancing had settled down.<br>\r\n<br>\r\n\"I'll get it!\" Hannah screamed a little too loud as she opened the front door, which you could now hear someone was pounding on it. \"Oh hey.. it's the old hag from down stairs. How's the old country... Mrs Bart....\"<br>\r\n<br>\r\n\"It's Bartkiewicz!\" You could hear the old woman spitting the words. \"You two girls are being too loud...\" her heavy accent made her a little hard to understand. \"I warned you, what would happen if you angered me again... no more warnings...\"<br>\r\n<br>\r\n\"Oh yeah.. you said you'd cast a spell on us or something....\" Hannah said to Shari.<br>\r\n<br>\r\n\"Well Mrs Bart... go right ahead. Cast your little spell...\" Shari mused.<br>\r\n<br>\r\n\"It's Bartkiewicz and you will regret that...\" the old woman's voice was even more spiteful. Hannah and Shari continued to tease her, when the lights started to flicker. You heard them scream as Mrs Bartkiewicz laughed.<br>\r\n<br>\r\nYou came out of the room and discovered that Hannah and Shari were now...</span></div></div>",
            "created":1591160400,
            "id":2845189,
            "title":"The old lady down stairs"
        },
        "15411":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Young again",
                "Exactly the same",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You entered the main room of the apartment and couldn't believe your eyes. There were two old ladies wearing Hannah and Shari's clothes. One even looked like your grandmother.<br>\r\n<br>\r\nThey were quite old too, they were in their eighties at least. Their hair which which used to be rich and filled with volume was now thin and completely white. Their breasts sagged as their skin hung loose from their bodies. What used to be well shaped asses now looked deflated.<br>\r\n<br>\r\n\"What did you do...?\" Hannah asked though you could barely understand her as she had no teeth. Shari bumbled around as she could barely see.<br>\r\n<br>\r\n\"Your days of youth are over...\" Mrs Bartkiewicz said.<br>\r\n<br>\r\n\"What was that?\" Hannah asked for clarification even though she was standing right in front of the witch.<br>\r\n<br>\r\n\"I said, you're old ladies now...\" Mrs Bartkiewicz yelled louder.<br>\r\n<br>\r\nYou looked over to the old hag and saw that she was..</span></div></div>",
            "created":1591160400,
            "id":2845195,
            "title":"Old ladies"
        },
        "154111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You stay in the apartment",
                "You go with Mrs Bartkiewicz",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh it's the cousin,\" Mrs Bartkiewicz gave you the same polite wave she had always given you. Though now she looked drop dead gorgeous. She was now the same age as you as she had drained Shari and Hannah's youth and given it to her. \"Sorry for disturbing you.\"<br>\r\n<br>\r\n\"What did you do...?\" You asked, knowing full well what had happened but you still couldn't believe it.<br>\r\n<br>\r\n\"Something I should've done ages ago,\" she smirked as she entered the apartment, closing the door behind her. \"Do not beg for them, I will not undo this,\" she warned.<br>\r\n<br>\r\n\"But you stole their lives...\" the girls probably only had a good ten years of life left in them, given their current state.<br>\r\n<br>\r\n\"It was not much to steal anyway, I've seen plenty of girls like them, they party and party and waste their lives. So they weren't using them.\"<br>\r\n<br>\r\n\"But... she's my cousin.\"<br>\r\n<br>\r\n\"I said no begging,\" she warned again. \"Unless you want to end up like them.\"<br>\r\n<br>\r\n\"What's going to happen to them now?\" You changed the subject not wanting your youth stolen as well.<br>\r\n<br>\r\n\"You can take care of them or send them to nursing home, I don't care,\" Mrs Bartkiewicz said flatly. \"Though before you decide what to do, I'm feeling young and on top of the world, you will come party with me, yes?\"</span></div></div>",
            "created":1591160400,
            "id":2845199,
            "title":"Young again"
        },
        "15412":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You keep pressing the issue and get turned into a dog yourself",
                "You contact someone to take the dogs",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You saw two tiny dogs barking Mrs Bartkiewicz, or more so yapping. Hannah and Shari had been turned into chihuahuas. They looked almost identical and so you weren't sure which was which.<br>\r\n<br>\r\n\"No dogs in the building,\" Mrs Bartkiewicz says when she sees you. \"This is an animal free apartment, your little bitches need to go,\" she said with a wicked smile. \"Get rid of them this instant!\" She slammed the door and left. Hannah and Shari's tails were between their legs and they were shaking, they didn't know what to do.<br>\r\n<br>\r\nYou looked at the two shaking dogs in disbelief, it was impossible to believe that they were actually Shari and Hannah but they had indeed been turned into dogs and Mrs Bartkiewicz wanted them gone. You hesitated for a split second as you looked down at the dogs and over to the door. You couldn't let her leave them like this or at the very least you couldn't get rid of them.<br>\r\n<br>\r\nYou opened the front door and chased after Mrs Bartkiewicz as she made it to the elevator and grabbed onto her arm. \"Please Mrs Bartkiewicz....\" you knew you didn't say her name right but you knew better than to call her Mrs Bart. \"You can't leave my cousin like that...\" Shari either but for now your main concern was the safety of Hannah.<br>\r\n<br>\r\nMrs Bartkiewicz turned to face you, not impressed that you were holding onto her arm. \"Too bad, she and her friend are staying like that, now unless you want to join them, let me go.\" You quickly released her arm.<br>\r\n<br>\r\n\"Yes but they are human, to treat them like dogs is...\"<br>\r\n<br>\r\n\"They are dogs!\" she interrupted you. \"Dogs don't live in this apartment.\"<br>\r\n<br>\r\n\"But I can't just get rid of them... I don't know where to send them...\" you pleaded.<br>\r\n<br>\r\n\"Not my problem, I warned them plenty of times to change their ways... they did no listen, so now they must go.\" She stepped into the elevator. \"Find a place for them to go now! Before you get kicked out for having dogs.\" The elevator door began to close, leaving you only seconds to act</span></div></div>",
            "created":1591160400,
            "id":2845228,
            "title":"Dogs"
        },
        "1543":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Tiffany's enemy",
                "A former student",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>Tiffany's rise to popularity and general attitude has made her many enemies, only one of them just so happens to be a witch. It's common knowledge Tiffany doesn't like you, in fact she seems to despise you, so what better way to make Tiffany suffer by involving you in some way.<br>\r\n<br>\r\nWhile you love Ms Darwin, not everyone does. She can be kind to students like you, those who pay attention to her 'lessons' but she can be harsh on those who muck around and don't pay attention. Of course then there's the fact that you're not the only student to form a crush on her and that has upset their girlfriends. So what happens when a witch returns to school with a grudge against Ms Darwin and notices your infatuation?</span></div></div>",
            "created":1557637200,
            "id":2658786,
            "title":"More Options"
        },
        "155":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "A Stranger is the Witch",
                "You're the Witch / Warlock",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>Sometimes you don't know who could be a witch or what they might do with there powers. In this case it's someone you've never interacted with before and they decide to use their powers on you or one of the other characters for seemingly no reason at all.<br>\r\n<br>\r\nWarlocks are also a thing though they are extremely rare, still who knows you might somehow become one. It's unknown as to why warlocks are rare though, some say it's because the things that grant powers prefer to give it to women, others say the powers are given equally and it just turn the men into women. Either way you're going to find out when you're given the power to change the world around you.</span></div></div>",
            "created":1577077200,
            "id":2763853,
            "title":"More options"
        },
        "1552":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "It comes when you are scolded by Shari",
                "It comes when you go to Biology",
                "Another time"
            ],
            "content":"<div class=\"\"><div> <span>You've had a pretty lousy day today. It first started off with Shari having a go at you over something trivial this time, something about accidentally taking her food, which you're pretty sure was on your cousin's shelf in the fridge. <br>\r\n<br>\r\nBecause of that you were late to getting the bus and got to school late, which made you miss the start of your Biology exam. Thankfully Ms Darwin gave you a second chance to do it, though you were given less time and missed out on your lunch break. <br>\r\n<br>\r\nAs you missed out on your lunch break you didn't get to meet up with Amy. She seemed pretty angry at you when you tried to apologize later, though she didn't say why. Though from the evil smile you got from Tiffany, she clearly had something to do with it. <br>\r\n<br>\r\nWhen you got home at the end of the day, you wanted to lay down and went straight to Hannah's room, only she was in there getting changed, and once again you saw her topless. This lead to yet another berating.<br>\r\n<br>\r\nOnce Hannah was dressed and had gone out for the evening, you finally laid down on the bed and closed your eyes, wishing you could start the day over again.<br>\r\n<br>\r\n'Very well...' you heard something in your mind say. 'I will see you at some point earlier today.'<br>\r\n<br>\r\nYou didn't say anything to the voice, thinking it was your overactive imagination getting the better of you.<br>\r\n<br>\r\nWhen you woke up a sense of déjà vu washed over you, you could've sworn yesterday was Friday, though today was Friday. You also got the sense that you had an important meeting today, though you couldn't remember where or when it would take place. You thought it might've had something to do with your biology exam, but that wasn't it.<br>\r\n<br>\r\nLittle did you know there was an entity watching you, as you were forced to repeat the day as you did before, the only difference was you'd be meeting this entity at some point during the day where you had a bad interaction.</span></div></div>",
            "created":1577163600,
            "id":2763896,
            "title":"Gaining powers"
        },
        "15521":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You say yes",
                "You say no",
                "You ask for more information"
            ],
            "content":"<div class=\"\"><div> <span>\"Did you grab my last chocolate bar?\" Shari accused you as you finished swallowing. She grabbed you by the wrist and dragged you over to the fridge. \"How many times do I need to tell you, this is my shelf and that's yours and Hannah's!\"<br>\r\n<br>\r\nYou saw the shelves she was pointing at and while you did just eat a chocolate bar it wasn't on the shelf she claimed was hers. \"But I...\"<br>\r\n<br>\r\n\"No buts... I'm sick of this arrangement, I'm sick of you...\" She began to ramble on. You noticed the time and headed for the door. \"I'm not done talking to yet!\" Shair grabbed your arm again. \"You don't respect boundaries, you don't respect that this is our home. Would it kill you to knock when entering the bathroom, or to put down the toilet seat?\" She was now rambling about previous issues. \"You're nothing but a pest and the sooner you're gone the better.\"<br>\r\n<br>\r\n'Please stop talking... I'm going to be late,' you thought to yourself as everything went dark, except for you and Shari. You were both in some kind of void with no light. Though she was frozen in place.<br>\r\n<br>\r\n\"Hello Marcus,\" a voice said from behind you and when you turned around you saw a figure with a crimson robe. Shadow covered their face and the robes hid their body shape, you couldn't tell if this was a man or woman speaking to you either. \"I told you we'd meet today.\"<br>\r\n<br>\r\n\"Who... are you... what do you want?\" You asked out loud but your mouth didn't move.<br>\r\n<br>\r\n\"It doesn't matter who I am, just what I'm going to offer you. I've noticed something interesting about you Marcus, you are surrounded by women you find attractive and they all treat you quite poorly.\"<br>\r\n<br>\r\n\"Amy and Hannah aren't like...\" the figure raised its hand to silence you.<br>\r\n<br>\r\n\"Hannah yells at you just as much as this one and complains about you behind your back. If she could, she'd get rid of you just as quickly. And Amy, she's not your girlfriend, in fact you're barely friends. If I let this day go on like it was supposed to, you two wouldn't be together by the end.\" You saw a brief memory of Amy giving you the cold shoulder.<br>\r\n<br>\r\n\"So what do you want with me then?\" You asked.<br>\r\n<br>\r\n\"It's not what I want with you, it's what I want to give you. I am going to offer you the power to change reality by altering those around you. With this power no one will dare mess with you again.\" The entity reached for your shoulder with a gloved hand. \"What say you, boy?\"</span></div></div>",
            "created":1577336400,
            "id":2764733,
            "title":"Scolded by Shari"
        },
        "155211":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You have to be a woman",
                "Shari gets the power as well",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Yes, give me this power....\" you say almost hypnotized as the thoughts of what you could do rush through your head.<br>\r\n<br>\r\nThe entity laughed. \"You humans never say no to power do you?\" It asked rhetorically. \"As I promised this power is yours, however like all things there is a catch.\"<br>\r\n<br>\r\nYou frown for a moment,  you knew this was too good to be true. \"Of course there is... I don't suppose it's too late to say no.\"<br>\r\n<br>\r\n\"It is actually, you wanted the power so now you need to live with the consequences, it's not that bad though, it's only....\"</span></div></div>",
            "created":1577336400,
            "id":2764735,
            "title":"You say yes"
        },
        "1552111":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Shari notices your change",
                "Shari thinks this is normal",
                "Shari is now a black cat"
            ],
            "content":"<div class=\"\"><div> <span>\"I do not create warlocks, I create witches,\" the entity tells you as you feel your body begin to change. <br>\r\n<br>\r\nIt feels like you were kicked in the groin at full force as your testicles retreat into your body and your genitals change into the female reproductive system. Your bones crack as your hips widen and your features change. You feel the mounds of flesh growing from your chest as you lose your facial hair and the rest of you body hair thins out on your arm and legs, while leaving your back and chest. The hair on your head stays the same length though.<br>\r\n<br>\r\n\"What did you do to me?\" You ask in a voice that sounds close to your mother's as you stand up and investigate the changes.<br>\r\n<br>\r\n\"I have turned you into a witch,\" the entity states. \"You now have the power to change people as you desire and the knowledge to cast curses, hexes and brew potions.\" It stated plainly. \"Though now your soul is damned but you now have the means to live longer and even be resurrected. Careful with the spells you cast though, vile magic tends to reflect outwardly.\"<br>\r\n<br>\r\nWith that warning the entity was gone and time resumed.</span></div></div>",
            "created":1577336400,
            "id":2764765,
            "title":"You have to be a woman"
        },
        "1552113":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You take the book",
                "You took the stone",
                "You signed the contract"
            ],
            "content":"<div class=\"\"><div> <span>\"All power must have a source,\" the entity tells you. \"To be a witch or warlock is no different. Though since I am a generous being I am going to give you a choice for what your power source will be.\"<br>\r\n<br>\r\nThe entity made a table appear before you and on it were three items, a book, a clear gemstone and a parchment. \"I can give you this spell book, its pages are limited and so too will the spells you can cast. Also if the book were to fall into the wrong hands, you would lose access to it,\" the entity explained as it gestured at the box.<br>\r\n<br>\r\n\"This is a soul stone, it'll give you the powers you asked for at the cost of a soul. Souls don't last long on the mortal plane though and so a hundred years is its limits, take away the current age of the soul. Every spell cast will take away one year. You will also stop aging while it is in your possession, as the soul in the stone will age instead.\" While you couldn't see the entity's eyes you knew it was glancing at Shari. \"To take this one requires an immediate sacrifice.\"<br>\r\n<br>\r\nIt then looked down at the parchment. \"This one is simple, you sign your soul over to me, you have the powers to do as you like but you must also do what I like. This will give you the most amount of power.\" You knew the entity wasn't telling you everything about that option.<br>\r\n<br>\r\n\"What if I don't like the sounds of either one of these?\" You inquired.<br>\r\n<br>\r\n\"You have already agreed to take the power so you must choose, if you do not, I will chose for you,\" as the entity said that you felt your hand move towards the table.<br>\r\n<br>\r\nYou fought for control over it and won, though only because the entity let you. You had no choice now, you'd have to pick one of these either by your choice or the entity's.</span></div></div>",
            "created":1577336400,
            "id":2764751,
            "title":"Power isn't unlimited"
        },
        "155212":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "The entity traps you in a time loop",
                "The entity gives Shari the power instead",
                "Nothing happens, the Entity never bothers you again."
            ],
            "content":"<div class=\"\"><div> <span>\"No, I'm not going to fall for this, it has to be a trick,\" you tell the entity.<br>\r\n<br>\r\nYou felt the entity give you a wicked grin. \"That was smart, but also foolish,\" it stated with amusement. \"Power always comes at a cost, so you have avoided paying the toll. However I have power and by refusing me, you risked suffering my wrath. For now though, I am amused and I shall respect your choice and leave.\"<br>\r\n<br>\r\nThe world grew light again and Shari unfroze. She blinked for a second, as she was sure something strange just happened. \"What are you still doing here? I told you to leave.\"<br>\r\n<br>\r\nYou headed for the door, wondering if you made the right choice and if you'll see the entity again.</span></div></div>",
            "created":1577336400,
            "id":2764759,
            "title":"You say no"
        },
        "1552121":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "You are forced to live the day as it happened.",
                "You can make different choices.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You weren't aware of the first time you experienced this day, besides from the memory flash the Entity had shown you of you and Amy. You didn't know what had lead to that until you experienced it again.<br>\r\n<br>\r\nThe day played out as it did before, you are late to school, you miss out on lunch trying to catch up on your biology exam, you didn't meet up with Amy, Amy ignores you, Tiffany seems to be behind it.<br>\r\n<br>\r\nYou catch Hannah half dressed, even though her room was yours at the moment. You fall asleep and wake up the next day.<br>\r\n<br>\r\nOnly when you wake up the date on your phone hadn't changed. Only the time.<br>\r\n<br>\r\nThis time you were aware of the repeating day and...</span></div></div>",
            "created":1592110800,
            "id":2851045,
            "title":"The entity traps you in a time loop"
        },
        "15521211":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "After three hundred and sixty-five repeats, the entity returns",
                "You're still in the timeloop ten years later and you've gotten older.",
                "It never comes"
            ],
            "content":"<div class=\"\"><div> <span>You walk out to the fridge, hungry for food. You find the chocolate bar, on Hannah's shelf. While you tell yourself not to grab it, something forces you to anyway.<br>\r\n<br>\r\nOnce again Shari yells at you for eating her food, though you know you're right this time. It was on Hannah's shelf. You play a back seat to your own body as you can't help but to react the day you did before. You get to school late, you miss your Biology exam and do it during your lunch break.<br>\r\n<br>\r\nWhen you see Amy, she's angry at you and Tiffany is delighted. You go back home and find Hannah topless. You go to sleep and repeat the day again and again... and again...<br>\r\n<br>\r\nYou've gone through this day so many times, you can repeat every word you heard in your head. After that you turn your focus too how many steps you take. You are a prisoner in your own head repeating the day again and again.<br>\r\n<br>\r\nYou wish for release from this torment...</span></div></div>",
            "created":1592110800,
            "id":2851047,
            "title":"You are forced to live the day as it happened."
        },
        "155212113":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Now the enitity returns",
                "The time loop ends",
                "It's permanent"
            ],
            "content":"<div class=\"\"><div> <span>You live the same day over and over again for the rest of eternity. To keep your mind active you begin to take note of different details. You learn every breath you took that day, every step you took, everyone you saw. The amount of words spoken, the hairs on you Shari's hair. Every small and tiny detail, you know off by heart.<br>\r\n<br>\r\nOver a thousand years you live this day, you can't even remember your mother's faces anymore. You even forget all the details about your cousin, Tiffany, Shari and others outside the event of the day. You forget everyone and everything that's not in this day. All relationships forgotten. <br>\r\n<br>\r\nYou now hate Shari for yelling at the wrong thing. You hate your Biology teacher for making you miss lunch, you hate Amy for giving you the cold shoulder and you don't even know who Tiffany is. Hannah you forgot was your cousin and so you only focused on the excitement of seeing her topless before she yells at you too.<br>\r\n<br>\r\nIf the time loop were to end now, you would be broken beyond repair</span></div></div>",
            "created":1592110800,
            "id":2851084,
            "title":"It never comes"
        },
        "1552121131":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Trap her in a loop",
                "Transform her",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Now that you have forgotten your old life completely and developed grudges against those you encounter during this day on repeat, the entity finally returns to you.<br>\r\n<br>\r\n\"Ready to accept my gift now? You've already paid the price,\" it tells you as you get up in the morning.<br>\r\n<br>\r\nYou froze unable to process your daily routine of a thousand years has been interrupted by this being. It waited patiently until you were ready. \"What powers?\" You ask, speaking your own words for the first time in forever. You almost forgot you had to actually tell your body to talk.<br>\r\n<br>\r\n\"The powers to do anything you want. I offered them to you, several life times ago but you refused. Now I make the offer once more. Will you accept.\"<br>\r\n<br>\r\nYou had been trapped for so long it was nice to be free and now you could get back at those people you always encounter. There was an easy answer to this question. \"Yes, give me the power.\"<br>\r\n<br>\r\n\"I thought you'd say that,\" the entity smiles and vanishes.<br>\r\n<br>\r\nYou stood there for a moment, then remembered you had to walk. After spending a thousand years living this day it was hard to break the habit so you went to the fridge and grabbed the chocolate. Like always Shari comes up to you and starts yelling. This time however you are able to do something.</span></div></div>",
            "created":1592110800,
            "id":2851096,
            "title":"Now the enitity returns"
        },
        "15521211311":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "There were people to punish at school",
                "See what happens if you mess with Shari while she's stuck in this loop.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Did you grab my last chocolate bar? How many times do I need to tell you, this is my shelf and that's yours and Hannah's! No buts... I'm sick of this arrangement, I'm sick of you... I'm not done talking to you yet! You don't respect boundaries, you don't respect that this is our home. Would it kill you to knock when entering the bathroom, or to put down the toilet seat? You're nothing but a pest and the sooner you're gone the better.\" Shari repeated what she had just yelled at you. You waved your hands in front of her eyes, not sure if she was still in there or not. <br>\r\n<br>\r\n\"Did you grab my last chocolate bar? How many times do I need to tell you, this is my shelf and that's yours and Hannah's! No buts... I'm sick of this arrangement, I'm sick of you... I'm not done talking to you yet! You don't respect boundaries, you don't respect that this is our home. Would it kill you to knock when entering the bathroom, or to put down the toilet seat? You're nothing but a pest and the sooner you're gone the better.\" She didn't care repeated standing in the same spot, making the same gestures but this time you were across the room and she was talking to no one.<br>\r\n<br>\r\nOnce she was finished she started again. These were the only words you had heard her say for a thousand years, so it was only fitting that she was stuck saying them until you chose otherwise.<br>\r\n<br>\r\nYou looked at the clock and saw that you were later than you had ever been to getting to school. You memorized the bus schedule so you knew when the buses would come, you should still be able to make the same one you always caught, though you always did that, maybe it was time for something different.</span></div></div>",
            "created":1592110800,
            "id":2851099,
            "title":"Trap her in a loop"
        },
        "155212113112":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Keep her in the loop",
                "Release her",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You decided you had had enough of school and this woman was the one that angered you the most, she's the one that wanted you gone and called you a pest.<br>\r\n<br>\r\nSo you decided to see how strong the loop she was in, was. You found some duct tape and put it over her mouth. She continued saying the words though now it was muffled. You found you could also move her from the spot and she wouldn't walk back. You pulled down her skirt and panties, yet she still did nothing. You felt her breasts, she didn't care. You cut her hair with scissors until it was a complete mess. You walked her into the bathroom, spread make up all over her face and then lifted up the toilet seat before setting her down.<br>\r\n<br>\r\nYou felt so good messing with her, having control of your life, while having someone experience what you went through was amazing. You wondered what she was thinking being trapped like that. You could no longer remember when you begged for release.</span></div></div>",
            "created":1592110800,
            "id":2851102,
            "title":"Messing with Shari"
        },
        "1552121133":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "content":"<div class=\"\"><div> <span>You are permanently stuck in this day, it never ends, not even after a million years. By that time though your brain is long dead and you're stuck on auto pilot.<br>\r\n<br>\r\n\"You should've taken me up on my offer...\" the entity whispers in your ear but you do not understand the words, not any more.</span></div></div>",
            "created":1592110800,
            "id":2851088,
            "title":"The End"
        },
        "1552122":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Turn you into a bug",
                "Leave you as you are for now",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You go to leave the house but pause for a moment, you feel the same sensation of talking to the entity you did a moment before, only this time it doesn't come to you. You turn around to face Shari and her eyes say it all, she was granted the powers you refused.<br>\r\n<br>\r\n\"On second thought Marcus, why don't you stay home from school and we have a little chat.\" Shari gestured to the table and you found yourself walking over and sitting down. \"The entity told me it offered you powers and you rejected them, that's the only reason you aren't a cockroach right now,\" Shari stated outright. \"If you had accepted them I'd be at your mercy so the fact you didn't take them, shows I might be wrong about you.\"<br>\r\n<br>\r\nYou looked Shari in the eyes as she sat down next to you, you had a brief flash in your mind at you towering over her as a bug as she pleaded internally for you to change her back.<br>\r\n<br>\r\n\"I don't think that's what you would've done to me, maybe you would've wanted me to stop yelling at you,\" she continued your eyes were both locked together as neither of you blinked. She was in your head and you were giving her what she wanted to see. You watched as in the vision where you had powers her mouth vanished as her eyes went wide in fear. \"That's what I thought, so I'm mouthless unable able to talk, is there anything else you might've done or would've you just gone to school and left me like that.\"<br>\r\n<br>\r\nYou were desperately trying to imagine you going to school but Shari forced the vision to what she might've done in your shoes as you made her clothes disappear. \"Of course that's what you would've done, you are a pervert after all.\" The vision of you approached Shari with a lustful look as the mouthless version of her cowered from you. \"I don't think you want me to see anymore of this.\" The vision faded and your eyes unlocked. Though being forced to imagine you lusting over Shari like that aroused you.<br>\r\n<br>\r\n\"I knew you were a pervert,\" she said looking at your crotch. It deflated as your dick appeared on the table. Shari paid no attention to the detached genitals and instead focused on your eyes again. \"So what's the worst thing you've done?\"<br>\r\n<br>\r\nYou saw yourself pulling down an adult Tiffany's panties at school and informing her, she was your girlfriend now. \"This is the girl you've been having problems with isn't it, no wonder she hates you,\" Shari taunted. \"Though if you had accepted the powers what would've you done?\" You had a vision of you and Tiffany walking down the hall with her arm wrapped around yours, outwardly she was happy to be with you but her eyes were filled with sorrow and fear.<br>\r\n<br>\r\n\"So you would've used it to control people, yet you didn't take them,\" Shari was surprised and that hurt you a little, that's not who you wanted to be. \"Now lets look at your other transgressions.\"<br>\r\n<br>\r\nYou saw yourself walking to the fridge, ready to leave for home, you opened the door and grabbed the chocolate bar from Shari's shelf. You knew this was wrong, but Shari was putting what she wanted to see into your mind. \"A blatant thief,\" Shari accused. As you saw yourself taking things you didn't even touch, going back to even before you moved in. You figured it must've been Hannah stealing Shari's food but she was happy to blame you.<br>\r\n<br>\r\nThe visions changed  without a word as you opened the door to the bathroom on several occasions when the girls were in there, either getting dressed or were in the shower, your memories showed you doing this on purpose. You also saw every time you left the toilet seat up or peed on the floor. Then you saw yourself doing something you didn't remember, you opened the door to Hannah's room while she was completely naked. You stood there admiring her for a moment before she noticed you and demanded you get out, while cursing your existence.<br>\r\n<br>\r\n\"What would've you done with Hannah, had you taken the powers?\" Shari asked. In your mind, you imagined Hannah becoming a nudist and teasing you with her body, knowing you weren't going to do anything. \"So Hannah thinks she's teasing you but you're actually enjoying it. You are a sicko,\" Shari states. \"However, because you did not do these things I should show you leniency....\" Shari pondered what she was going to do with you and decided to...</span></div></div>",
            "created":1577336400,
            "id":2764789,
            "title":"The entity gives Shari the power instead"
        },
        "15521221":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Fly",
                "Cockroach",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm going to allow you to stay in the apartment,\" Shari stated as she stood up. \"Though your appearance will reflect how I feel about you. Don't worry I promise not to squish you or anything. I can't say the same for Hannah though.\"<br>\r\n<br>\r\nYou felt a strange energy hit you as it reshaped your body, painfully. You shrunk into your clothes as you grew an extra pair of limbs. Your skin hardened as you grew an exoskeleton.<br>\r\n<br>\r\nYou found yourself in your underwear and scurried for the light, when you emerged you discovered Shari had turned you into a...</span></div></div>",
            "created":1577422800,
            "id":2765522,
            "title":"Turn you into a bug"
        },
        "155212211":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Shari strips",
                "Tiffany appears in the room",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You crawled on the floor for a moment as you tried to adjust to your housefly body. Your mind seemed to be intact and you adjusted seeing through your compound eyes. Instincts seemed to take over as you flew up to the table and landed next to your dick.<br>\r\n<br>\r\nShari seemed to be moving slowly and when she talked it was loud, slow and distorted. She seemed to notice this and made adjustments. \"Ha, this form suits you so much better. Now the only food of mine you'll be eating is what I put in the trash,\" she teased as she slapped her hand down next to you, showing she could end you at any moment. \"I don't need to share a bed with Hannah anymore and you won't leave the toilet seat up. Of course you could still walk... or should I say fly on me naked but you'll just be a fly on the wall, so I'll let you have that one, especially since you don't have this,\" Shari picked up your dick. \"I'm still not sure what I'm going to do with this but I'm sure I'll work something out. In the meantime I think we should celebrate this occasion with a little bit of fun.\"<br>\r\n<br>\r\nYou walked along the table, helpless to what Shari had planned. You now regretted not taking the powers when you had the chance.</span></div></div>",
            "created":1577422800,
            "id":2765526,
            "title":"Fly"
        },
        "1552122112":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Turned Tiffany into a spider",
                "Gave your dick to Tiffany",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Where am I...?\" Tiffany blinked. \"How did I get here?\" She looked around the apartment. \"Who are you?\" She asked Shari.<br>\r\n<br>\r\n\"I'm a friend of Marcus' cousin, he's been staying with us,\" Shari stated as she gestured to the chair with your clothes still on it. \"Please take a seat.\"<br>\r\n<br>\r\n\"Marcus? That creep put you up to this?\" Tiffany refused to budge as she looked around in confusion. \"How did you even bring me here?\"<br>\r\n<br>\r\n\"I'm a witch now, thanks to Marcus and no he didn't put me up to this. I hate that little pervert as much as you do, that's why you're here. I'm going have you play a little game,\" Shari gestured for her to sit once more. \"See that fly on the table, that's Marcus.\"<br>\r\n<br>\r\nTiffany looked down at you with conflicting thoughts, she was happy to hear you were a fly but skeptical that what she had just been told was true. \"Really?\" she went to squash you but Shari stopped her.<br>\r\n<br>\r\n\"Not yet,\" Shari said one more time. \"I said I want you to play a game. I don't want you to kill him outright.\"<br>\r\n<br>\r\n\"I'm listening,\" Tiffany finally brushed your clothes off the seat and sat down, before trapping you beneath her hands.<br>\r\n<br>\r\n\"Good,\" Shari joined her at the table. \"Though you aren't going to like this game,\" Shari gave Tiffany a wicked grin before she...</span></div></div>",
            "created":1577422800,
            "id":2765529,
            "title":"Tiffany appears in the room"
        },
        "15521221121":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "She lets things play out.",
                "She turns Hannah into something that eats spiders.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You managed to get a brief look at Tiffany as she began to change, the first change was losing her hands and her arms turning into long and hairy sticks. She also grew six more eyes and fangs, then she shrunk out of your view. Shari moved up off the table and bent down, giving you a good view of her cleavage. She reached into Tiffany's clothes and grabbed a spider twice the size of you, placing it down next to your body.<br>\r\n<br>\r\n\"Now this is the game,\" Shari stated, freezing you both in place as she explained it. \"If you want to be human again, Tiffany, you must trap and consume Marcus.\" She told Tiffany as she lent down on the table, to get as close to your eye levels as possible. \"Marcus you just need to live longer than Tiffany or die of old age if you want to be human again.\"<br>\r\n<br>\r\nShari stood up again and resumed time. You quickly flew away before Tiffany could pounce at you, wondering how you were going to survive this long.<br>\r\n<br>\r\n\"Oh one more thing, if either of you leave the apartment, neither of you are getting changed back.\"<br>\r\n<br>\r\nShari smiled as she watched you two go on the move and wondered if she should do anything else to make this game more fun.</span></div></div>",
            "created":1577422800,
            "id":2765533,
            "title":"Turned Tiffany into a spider"
        },
        "155212211211":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "choices":[
                "Tiffany catches you",
                "Hannah squishes Tiffany",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>You flew as far away from the living area as possible, and entered Hannah's room. You'd be safe here for now but because the door was locked, Tiffany could set a trap if you decided to leave. You couldn't believe Shari's twisted mind to have you play this so called game which meant certain death for one of you but now you were playing it, you had to find a way to win.<br>\r\n<br>\r\nOld age or getting Tiffany killed were the only options for you as Shari didn't explain the rules of starvation, your guess was that'd leave you dead and Tiffany stuck as a spider. Of course you could always leave and make that your fates anyway but it was better to aim to become human again.<br>\r\n<br>\r\nHannah was your only hope of survival, she didn't know what Shari had done so she'd see Tiffany as a random spider and you as a random fly. Of course the spider would be the thing she'd want dead the most but if you played things wrong, she might kill you and once again that would leave Tiffany stuck as she was.<br>\r\n<br>\r\nYou could also just give up and let Tiffany win, as you were mostly dead anyway and your plans came with risks that lead to death anyway. So sacrificing yourself would be the only way to ensure one of you became human again.<br>\r\n<br>\r\nStill there were a couple of chances to ensure that you'd be the one that got their humanity restored so you were going to risk them. If you failed, Tiffany would at least still get to live.<br>\r\n<br>\r\nIn the end you decided on a plan that would get either of you restored no matter who lost. Though this meant one of you had to die. You would use yourself as bait to lure Tiffany into a location where Hannah would see her. Seeing both you and Tiffany would make Hannah prioritize killing Tiffany.</span></div></div>",
            "created":1577422800,
            "id":2765541,
            "title":"She lets things play out."
        },
        "1552123":{
            "author_id":"hobbitking90",
            "author_name":"Hobbitking",
            "content":"<div class=\"\"><div> <span>You refused the entity and your life continued as normal. Besides from the encounter in the morning, you repeat the day as before, you are late to school, need to do your exam at lunch, Amy breaks up with you and you know it has something to do with Tiffany. You get yelled at by Hannah for walking into her room and seeing her topless, even though she gave the room to you.<br>\r\n<br>\r\nYou end up being completely alone at school with no one to talk to, you failed your Biology exam and Hannah wants you to leave the apartment.<br>\r\n<br>\r\nIn the end you agree to move in with your parents early. It interrupts your schooling and end up needing to repeat your final year at a different school. Still with Tiffany out of your life, school give you no major drama.<br>\r\n<br>\r\nYou live out the rest of your life but always look back at that day and wonder if it was a dream and if not what would've changed if you said yes to gaining powers.</span></div></div>",
            "created":1577336400,
            "id":2764762,
            "title":"The End"
        }
    },
    "info":{
        "author_id":"hobbitking90",
        "author_name":"Hobbitking",
        "brief_description":"Someone in your life is a Witch.",
        "created":1552392180,
        "description":"<td align=\"left\" class=\"norm\">I created this item as I like witches as an antagonist for transformations, they can be cruel and uncaring or playful and mean spirited. I am someone with a lot of ideas and find many branching ideas in my head, which is why I created it as an interactive. Sometimes I have an idea of a different outcome though don't always know where it'll lead so I do encourage people to add to this story.<br>\r\n<br>\r\nThis story is about a young man finding out a woman in his life is a witch. This discovery leads to an interesting turn of events as he is subjected to all sorts of charms and transformations.<br>\r\n<br>\r\nThe witches in this story don't have unlimited power and aren't limited to women, so there might be a few warlocks running around. Their powers aren't unlimited as there's a power source that gives them their abilities, this can be multiple things, from a spell book to a magic gem or making a deal with a powerful entity, using these powers can come with draw backs however, like rapid aging or their soul being dammed. A witch can also share a power source with another witch, this too can come with draw backs.<br>\r\n<br>\r\nThe types of transformations seen in this story can be animals, inanimate objects, gender changes, body swaps, body modifications, age manipulation, petrification. Other spells such as time manipulation and enthrallment as well as anything else you'd expect from a witch is fine.<br>\r\n<br>\r\n<b>Rules</b><br>\r\nDeath of any of the characters are fine, there's some nasty magic out there after all. Though that doesn't mean the story has to end, new victims can be discovered and some witches can reverse death with the right spells.<br>\r\n<br>\r\nWhen dealing with characters under the age of 18, be mindful how you treat them, I will not tolerate any nudity or sex and these chapters will be deleted. I'd rather not have anyone under age but that does remove the ability for age regression and some times witches can be mean to children.<br>\r\n<br>\r\nBe mindful of other people when writing, leaving as many options available as possible. If you can only add two paths I'd rather you do 'more options' as the second choice allowing for others to add their own ideas. On that note be careful how long you make your chapters, they shouldn't be too short however they should also leave room for choice. So don't write too many transformations or actions in a single chapter where another choice was available.<br>\r\n<br>\r\nI am impulsive and do change my mind often so do except to see the occasional change in the structure of the interactive or some of my additions being edited. I will try not to delete chapters and if an idea I thought of gets taken I will use the more options or edit the choices so both out ideas for that choice can be expressed. (On that note, if anyone wanted to add to a particular option that was taken feel free to repeat that choice with your own idea).</td>",
        "id":2185183,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603130100,
        "modified":1603130100,
        "pretty_title":"Life's a Witch"
    }
}