{
    "chapters":{
        "1":{
            "author_id":"mystereyman",
            "author_name":"Mister E",
            "choices":[
                "She grows to 20ft tall and burps",
                "She Belches",
                "She goes back to the real world with a bad case of gas.",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Alice woke suddenly in wonderland, she was alone in a strange place, all around her were mushrooms of different sizes and different shades of green. <br>\r\n\"strange\" she said, \"usually I just drift in but this feels different.\" Then she noticed the smell, the mushrooms smelled horrible, she wrinkled her nose in disgust. <br>\r\n\"eugh! these things are ripe!\" she said, poking one. <br>\r\n<br>\r\nA few hours went by and Alice found herself unable to escape, she couldn't get out of the strange mushroom glade. \"I suppose If I ate one I might grow large enough to escape but I don't know I can handle the smell!\" she said to herself.<br>\r\n<br>\r\nAnother hour of searching went by, 'Oh well, what do I have to lose' she thought, grabbing one of the smallest mushrooms she could find she took a small bite from it...</span></div></div>",
            "created":1325174040,
            "id":1248596,
            "title":"Awakening"
        },
        "12":{
            "author_id":"announcer",
            "author_name":"Announcer",
            "choices":[
                "...But she liked it.",
                "...But it seemed to be of help.",
                "...And then someone appeared.",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>Much to Alice's surprise, the mushroom did not taste quite as bad as it smelled -- in fact, it was nearly tolerable. But as she swallowed the single bite from the tiny, light green cap, she couldn't feel anything happening. \"Wonderful,\" she thought to herself, \"I think I have to eat the whole thing.\" With her eyes beginning to water from the horrid stench of the surrounding mushrooms, she pinched her nose shut and popped the rest of the mushroom into her mouth, chewing it carefully and then swallowing. She was relieved to find that the flavor seemed to improve when she could block out the smell, even if it did give the rubbery fungus a cardboard-like taste.<br>\r\n<br>\r\nAs it traveled down her throat and hit her stomach, Alice could immediately feel that something about the mushroom was beginning to disagree with her body. Feeling slightly nauseated and with her stomach rumbling and groaning loudly, she clutched at her abdomen. Something was happening inside her, but she couldn't tell what; it didn't feel like she was going to throw up, and she certainly didn't need to use the bathroom, but she still felt that something was certainly not normal. Moving over towards a large stone, she sat down, hoping that something would happen and that she could escape. But her stomach kept rumbling, and she began to feel a strange pressure in her gut, traveling up her throat.<br>\r\n<br>\r\nSitting on the stone and leaning back slightly, Alice placed a hand on her chest, opened her mouth, and let out a small burp. \"Urp!\" It was quick, and not very loud, but the pressure remained inside her, and it was followed almost immediately by another, bigger one. \"Uuurrrp!\" Finally, twisting her face slightly, Alice gave a heavy, rolling belch that seemed to erupt from her throat with the volume and tone of a drunken sailor, \"UUUUUURRRRRPP!\"<br>\r\n<br>\r\nThe pressure in her stomach had eased up after this impressive eructation, and Alice breathed heavily, surprised at what had just happened. This was a strange effect for mushrooms to have in Wonderland...</span></div></div>",
            "created":1325586300,
            "id":1251588,
            "title":"Agaricus Eructus"
        },
        "123":{
            "author_id":"mystereyman",
            "author_name":"Mister E",
            "choices":[
                "She takes her revenge using the power of the mushrooms",
                "Something more imaginative"
            ],
            "content":"<div class=\"\"><div> <span>With a bang, through the mushrooms came the doormouse, small, cute and demented. <br>\r\n\"Alice!\" It cried \"its been too long.\"<br>\r\n\"not long enough in my book\" Alice said striding over to it<br>\r\n\"oh come on we must put that unpleasantness behind us\" <br>\r\n\"I still want revenge *urp*\" as she spoke a belch slipped out and she saw the doormouse wrinkle his nose in disgust, \"and I think I know how to get it!\" she said suddenly grabbing the doormouse,<br>\r\n\"Alice what are you doing\" the doormouse asked as Alice slowly raised it towards her mouth.</span></div></div>",
            "created":1334706060,
            "id":1317822,
            "title":"...And then someone appeared."
        },
        "1231":{
            "author_id":"mystereyman",
            "author_name":"Mister E",
            "choices":[
                "give the cat the same treatment",
                "talk to it"
            ],
            "content":"<div class=\"\"><div> <span>She held him tightly in her hand now right in front of her mouth, then MMMMRRRRRRRRPPPPPP, her cheeks swelled up as she belched then breathed the heavy mushroom stench all over the trapped doormouse on her hand who began to cough. <br>\r\n\"Please Alice no more! I can't- BUUUUUUUUUUUURRRRRPPPPP<br>\r\nShe cut him off by belching loudly on him once more, the stench leaving her mouth as a dense greeny-brown cloud. The smell knocked the doormouse out cold. <br>\r\n\"Well, that probably wasn't ladylike but it felt damn good!\"<br>\r\n\"I'll bet it did.\" said the Cheshire Cat, who had been watching her the whole time.</span></div></div>",
            "created":1334706420,
            "id":1317836,
            "title":"She takes her revenge using the power of the mu..."
        },
        "14":{
            "author_id":"announcer",
            "author_name":"Announcer",
            "choices":[
                "She falls asleep.",
                "Her warped vision reveals an exit.",
                "She shrinks!",
                "The glade begins to change around her.",
                "Something else?"
            ],
            "content":"<div class=\"\"><div> <span>Biting gingerly into the acrid mushroom, Alice nearly gagged at the foul, rotten taste that the rubbery fungus held. Swallowing it with watering eyes, she grimaced, \"Ugh! They taste just like they smell...\" She set the remainder of the nasty mushroom down and waited for a moment, hoping the effect would take hold soon. Sure enough, within a few moments she felt a strange sensation washing over her body. Her vision began to warp and waver, blurring and flashing into brilliant clarity again, all the while with colors and shapes dancing across everything she saw. Her surroundings seemed to spin slowly, dizzying her and causing her to stumble, and finally she feels it happening...</span></div></div>",
            "created":1325246880,
            "id":1249159,
            "title":"something else"
        },
        "141":{
            "author_id":"announcer",
            "author_name":"Announcer",
            "choices":[
                "At the Mad Hatter's Tea Table.",
                "In the court of the Queen of Hearts.",
                "Elsewhere?"
            ],
            "content":"<div class=\"\"><div> <span>A sudden drowziness overtook her. As the dizziness faded, so too did Alice's vision; everything fell into darkness, and she slowly sank to the ground, unable to keep her eyes open. Laying her head on the grass, she drifts into a deep sleep...<br>\r\n<br>\r\nWhere does she wake up?</span></div></div>",
            "created":1325247240,
            "id":1249162,
            "title":"Sleep Takes Her"
        },
        "145":{
            "author_id":"bloxxerstudios",
            "author_name":"Bloxxer",
            "choices":[
                "Eat more mushrooms?",
                "Finds something else?"
            ],
            "content":"<div class=\"\"><div> <span>With a big pump, and falling flat onto the ground, Alice's vision resumed to normal, and she was left with a dizzying stand point. She slowly adjusted herself, and nothing was altered in her, besides the horrible rubbery taste of the mushroom she consumed, nothing seemed off. She shuffled and sat up, rubbing her eyes, and feeling a particularly bizarre feeling inside her. She gave a small groan as she gripped her stomach, the source of the bizarre feeling creeping up inside her. <br>\r\n<br>\r\nEventuslly, a small little belch came through her mouth, as she felt her stomach feel filled and heavy. It was un-noticed by her, but her stomach had puffed out and softened a bit, along with the rest of her body growing a bir of weight, but to Alice, she still had the feeling of pressure despite fulfillment. Another few belches came out her mouth, and some gas came out her rear, she was quite a bit gassier... but every moment, her stomach and body filled out more and more, until eventually....<br>\r\n<br>\r\n\"<b>URRRRRRRRRP!</b>\" came a triumphant belch from Alice. The pressure in her left, and she finally felt much better! Of course her body was now quite a bit... bigger. She had begun to grow a double chin, and a rather chubby stomach stood. Her thighs had thickened, and her arms plush. Of course, Alice hadn't noticed this...<br>\r\n<br>\r\nBut now,she was filled with an empty feeling... hunger? What could she do??</span></div></div>",
            "created":1474033740,
            "id":2210837,
            "title":"Something else?"
        }
    },
    "info":{
        "author_id":"mystereyman",
        "author_name":"Mister E",
        "brief_description":"burping fantasy fun",
        "created":1325173320,
        "description":"<td align=\"left\" class=\"norm\">Any vore is allowed(as long as it ends up with belch)<br>\r\nGiantess is allowed<br>\r\nShrinking is allowed(but no sitting,squishing stuff like that)<br>\r\nWeight Gain of any sort is allowed(as long there is belching)<br>\r\nYou get the point, anything with belching.<br>\r\n<br>\r\nNO MEN BELCHING OR ANY OF THE STUFF ABOVE(men can only be eaten)<br>\r\n<br>\r\nOther than that I don't care whats in the story.</td>",
        "id":1836419,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1474033740,
        "modified":1474033740,
        "pretty_title":"American McGee Alice Burping (vore wg)"
    }
}