{
    "chapters":{
        "1":{
            "author_id":"darkcaesar",
            "author_name":"Wataru-kun",
            "choices":[
                "Mall",
                "Swimming Pool",
                "Hotel",
                "College",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>You are Jake Walter, who is the almost richest person in the world. You can buy anything that you want but you feel that it doesn't amuse you. Then you have an idea of creating another company. But this company is your dream company, because all of your other company has already been successful until now and you keeps getting money from that but not an amusement. You decided that your dream company to be company which is full of busty and sexy women.<br>\r\n<br>\r\nAs you search the internet what kind of company that suits you best, you came across an interesting drug website. They sell their new invention of drugs and it called \"Controlling Sperm\" medicine. You feel that medicine is some kind of interesting something. Then you see the description of the drug:<br>\r\n<br>\r\n- If you ejaculate your sperm into a body of a woman you can control them as you wish<br>\r\n- The woman that you ejaculated at will not get pregnant<br>\r\n- The duration of mind controlling is how many sperm you ejaculate inside the woman body times day<br>\r\n- If the duration is up, the woman can take over her mind again<br>\r\n- If you ejaculate (orgasm) inside of a woman many times, the duration will be increased<br>\r\n- The duration of your mind controlling sperm is FOREVER<br>\r\n<br>\r\nAs you have seen the effects of the drug, you decided to buy the drug. Even though it's price is really expensive, you still decide to buy it because you have lots of money!<br>\r\n<br>\r\nNext week, the drug came and you tried it. You feel a tingling sensation from your body. Your body feels really hot and suddenly your cock gets erected although you're not feeling horny. After a while, your body feels normal again. Then you decided to try this to someone. <br>\r\n<br>\r\nWhere do you want to go now?<br>\r\n</span></div></div>",
            "created":1290350100,
            "id":998184,
            "title":"Bored as Millionaire"
        },
        "11":{
            "author_id":"darkcaesar",
            "author_name":"Wataru-kun",
            "choices":[
                "Sexy Blonde",
                "Big-breasted Brunette",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>You get up from your chair and take your jacket and car keys. You decided to go to Mall to find some girls because many beautiful and sexy girls hanging around the mall. You feel really excited by just imagining those things. You also imagine what job will they get when they're fully under your control. You can't wait imagining those things as you now feeling really horny. Then after a while you arrive at the mall. You park the car and you saw a blonde with ponytail that has just get out from her car, she has C-cup breast then you saw another person which is brunette with D-cup breast that comes out from the mall. You are feeling really excited about this and you just happens to flirt with..</span></div></div>",
            "created":1290351000,
            "id":998189,
            "title":"Mall"
        }
    },
    "info":{
        "author_id":"darkcaesar",
        "author_name":"Wataru-kun",
        "brief_description":"See what you can do as millionaire!",
        "created":1290348540,
        "description":"<td align=\"left\" class=\"norm\">You are Jake Walter, a young millionaire that bored at his life. You can buy all that you want but you notices that you want some more. Then it's all up to you guys. The stories starts when Jake wants to create his own dream company and he found a website that sell an interesting drug.<br>\r\n<br>\r\nFeel free to add more chapters!<br>\r\n<br>\r\nRules:<br>\r\n1. No gay scene, lesbian is fine<br>\r\n2. No killing Jake or anything violent<br>\r\n3. Sex scene is fine</td>",
        "id":1726275,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1290351000,
        "modified":1290351000,
        "pretty_title":"Millionaire Stories"
    }
}