{
    "chapters":{
        "1":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Adam ",
                "Maria ",
                "Chelsea ",
                "Katherine",
                "Mason"
            ],
            "content":"<div class=\"\"><div> <span>    One Night during the winter a family of five was driving on the icy roads heading towards they're usual vacation spot. That family was the Kelp family. Adam Kelp was the father and the driver of the vehicle. It had been awhile since he got a vacation.  As they continued driving down the street. Adam heard police sirens and pulled over at a corner. He then saw the car the police were chasing and the police not far behind. The unmarked black car then drifted at the turn. Hitting Adams car just enough to knock it off the road and into the lake. Thankfully everyone managed to survive. What Adam didn't know, was that chemicals were being illegally dumped into they lake. These chemicals would change each family member in a different way giving them superpowers. The only question is who would be the first to discover there powers? <br>\r\n<br>\r\n<br>\r\n<br>\r\n(Note: This basically chooses which Character the story will focus on. The Majority of the time.)</span></div></div>",
            "created":1357275600,
            "id":1501642,
            "title":"The Accident"
        },
        "11":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Super Strength",
                "Telepathy",
                "Pyrokinesis",
                "Become Super Intelligent",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>   Adam soon discovers that he has...</span></div></span></div>",
            "created":1357275600,
            "id":1501644,
            "title":"Adam "
        },
        "111":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "After Breakfast",
                "After Work",
                "Before He Leaves For Work"
            ],
            "content":"<div class=\"\"><div> <span>      As Adam woke up to prepare for work, he felt a bit different then usual. At first he thought about ignoring that unusual feeling.  He even ignored to some extent as he got up out of the bed and headed directly towards the shower, he broke the door off his hinges and mistook it for just a bit of bad luck.<br>\r\n<br>\r\n <i>\"Great, the house is starting to fall apart.\"</i> Adam thought as he looked at the now unhinged door.<br>\r\n<br>\r\n    He then went into the shower without breaking anything. As he exited the bathroom and entered back into his bedroom with nothing but a towel on him, Adam unexpectedly broke the door of the bathroom off it's hinges as well. This got him a bit suspicious of what was going on but he had still thought it was just his run of the mill bad luck.<br>\r\n<br>\r\n  \"Just what I need another door to fix, why do these doors keep breaking apart so easily?\" Adam asked himself.<br>\r\n<br>\r\n  Adam went into the bedroom and got his work clothes on. Luckily for him he didn't manage to break any of the drawers while moving them. Once he was dressed he went out into the kitchen and poured himself a cup of coffee. He had yet to figure out that he now had Super strength. He would eventually find out, but how long would that take him?</span></div></div>",
            "created":1386947640,
            "id":1707091,
            "title":"Big and Strong Adam!"
        },
        "112":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "A 6 inch Tall Chelsea",
                "Lots of Water in Katherine's room",
                "A Speedy Mason reading Katherine's Diary"
            ],
            "content":"<div class=\"\"><div> <span> A few days after the accident. Adam woke up to his usual morning. Only to find that he was hearing strange thoughts in his head. As the morning continued, he discovered that those thoughts weren't his. He then went to his wife Maria. \"Maria, I think something happened to me.\" He said. \" Why do you say that? \" She asked.  He then quickly responds. \"I keep hearing things in my head, and I think they are other people's thoughts.\"  Maria then asked. \" Really, then will you try to read mine?\" Adam nodded and agreed. He concentrated on the thoughts of his wife Maria. <i>\"Take out the trash, Adam.\"</i>  That's the thought that was on the surface at that time. \"Alright I'll take out the trash.\"  Maria was surprised that he got it right. Adam went and took out the trash, while Maria discovered her own power. \"Adam, Come quick!\" She yelled. \"What is it Maria?\" He asked. \" I just discovered I have a power too!\"  He looked at his wife as she demonstrated by lifting spoons in the air. \"That's impressive, but why don't you try something heavier?\" He asked. She then responded. She then tried for something heavier, Adams favorite chair. Maria struggled with it. But only managed an inch off the ground before she was exhausted. \"That's all I can do with the chair it's too exhausting.  Adam do you think if we developed powers then do you think our kids might have too?\"  Adam and  Maria soon hear a scream from one of the kids...when they go to the room they find..</span></div></div>",
            "created":1357275600,
            "id":1501690,
            "title":"Telepathy"
        },
        "1121":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Continue with Adam's POV",
                "Continue with Maria's POV",
                "Continue with Chelsea's POV"
            ],
            "content":"<div class=\"\"><div> <span>  Adam and Maria rushed into Chelsea's room. Only to notice that she was much smaller then usual. \" Mom? Dad? How did you two get so big, How did everyone get so big?\" Chelsea asked. \" It's not us that's big...you've shrunk.\"  Chelsea then began to panic. \"That's not possible I can't shrink I need to be my normal size! \" Don't worry, maybe if you concentrate, you'll be back to normal size. \" Adam said. \"I'll try, but first dad. You need to get out of my room. \" Adam took the hint and left the room. \" This is going to make me a freak isn't it?\" Chelsea asked. \"You're not a freak, you're my daughter and a loving one at that.\" Maria responded. \"Why do you think that concentrating will help?\" She asked.<br>\r\n<br>\r\n  Maria then responded. \"It seems to help me and your father.\" Chelsea then concentrated herself on making herself bigger. She then grew from her six inch size to twelve feet. Which caused her to hit her head on the ceiling. \"OUCH! Oops, I think I made myself a bit too big.\"  Chelsea then concentrated and after a few minutes was finally back to her normal size. \"Mom, you said concentrating helps you and dad. Are you saying that...\" Maria then interrupts. \" We have abilities to although mine and your fathers seem to be more mental. I can lift objects with my mind, and Adam has the ability to read minds. \"What about Katherine or Mason do they have any powers?\" Chelsea asked. \"We don't know yet.\" Maria answered. Chelsea by now was calm and finally getting dressed before she left her room. \" Adam then asked Chelsea as she came out of her room. \"How are you feeling?\" Chelsea quickly responded. \"I'm fine, but dad since you can read minds, mind if I ask you something?\" Chelsea asked. \"Sure.\" Adam responded. \" Could you not read my mind unless you have my permission?\" She asked. Adam then responded. \"I'll try, it may be hard at first.\"  Chelsea nodded as she said. \"Thanks, Dad.\" <br>\r\n<br>\r\n   \"Adam if Chelsea has a power it's quite possible that Katherine and Mason have one as well.\" Maria said. \" I think you're right, but we wont know what to do until we know what powers they have.\" Adam responded.  Adam then looked at the time and noticed it was time for him to leave. \" I've got to go to work Honey, I'll see you in the afternoon.\" Adam then gave Maria a kiss and went to work.</span></div></div>",
            "created":1363150800,
            "id":1549267,
            "title":"A 6 inch Tall Chelsea"
        },
        "115":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Super Speed",
                "Teleportation",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Didn't Like those choices? Then What Power does he discover?</span></div></span></div>",
            "created":1357275600,
            "id":1501653,
            "title":"More Choices"
        },
        "1153":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                " He Can Fly!",
                "Make Machines Come Alive!",
                "More Please"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Here's some other choices you could have for Adam.</span></div></span></div>",
            "created":1366520400,
            "id":1576237,
            "title":"Other."
        },
        "12":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Telekinesis",
                "Telepathy",
                "Super Strength",
                "Super Speed",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maria Discovers that she has...</span></div></span></div>",
            "created":1357275600,
            "id":1501645,
            "title":"Maria "
        },
        "121":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Katherine and Mason Fighting",
                "Chelsea calling For her",
                "Adam, surprising her."
            ],
            "content":"<div class=\"\"><div> <span>    Maria woke up from her bed early in the morning before her husband had even gotten up. She went to the bathroom and took a shower. As she took her shower she began to reach for the soap and that was the first time she noticed it. Anything and every little thing she desired to reach and touch. Just thinking about it caused it to float right towards her. <br>\r\n<br>\r\n <i> \"Is this really happening?\" </i>She thought to herself. Maria decided that she needed to test it out a bit more. So she tried to imagine brushing her teeth, despite breakfast hasn't even been prepared yet.  Maria wasn't an idiot and she now knew that somehow she could lift objects with her mind. She wasn't exactly excited about the idea, I mean if she had powers what if her kids had got them too, and decided to do something dangerous. She wouldn't be much of a mother if she let them do that.  <br>\r\n<br>\r\n   After Maria was done in the bathroom and had gotten out of the shower. She then tried lifting Adam's favorite chair with her mind, but much to her disappointment it was just too much for her and she felt completely exhausted just trying to do this.  It wouldn't be too long before she would be able to notice her kids, or even her husband might have powers. For now she decided to keep it a secret from her family. <br>\r\n<br>\r\n  As Maria was preparing breakfast she heard....</span></div></div>",
            "created":1441723500,
            "id":2031790,
            "title":"Telekinesis"
        },
        "125":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Increased Intelligence",
                "Size Change Abilities",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Didn't like those choices? That what power did Maria discover that she has?</span></div></span></div>",
            "created":1357275600,
            "id":1501655,
            "title":"More Choices"
        },
        "1252":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Return to Normal Size!",
                "Grew an Inch!",
                "Grew Twice her Normal Size!"
            ],
            "content":"<div class=\"\"><div> <span>      It had been a full week since the car went into the lake. As Maria slowly got out of bed she looked around and found something wasn't quite right. The bed was incredibly huge to her! <i>\"How did the bed get this big?\"</i> She thought. As she pondered and looked around her surroundings she discovered her husband Adam still sleeping. Once she saw Adam she knew that somehow she had shrunk. Maria had decided to take a chance and went and crawled up on Adam. \"Adam Wake up!\" She yelled. <br>\r\n<br>\r\n   Fortunately for her Adam woke up with relative ease. \"Is it morning already Honey?\" Adam asked.  Maria then nodded \"Yes, but I think I have a rather big problem.\"  She exclaimed. It finally sank in Adam's head that somehow his wife was much smaller than him.<br>\r\n<br>\r\n   \"Maria?! How did you get so small?\" He asked. \"That's what I'd like to know, I just woke up like this today.\" She then continued. \"Do you have anything you can measure me with?\" Adam nodded. \"I believe I have a ruler in here somewhere I'll go get it.\" Adam then took off pajamas and went to his dresser and put on some of his clothes. Once he was dressed he went and searched the room for a ruler, when he finally found a ruler he put it up on the dresser as his wife Maria stood next to it. \"Well it seems your two inches tall.\" Adam said.  \"What?! Two inches How am I going to get the kids to take me seriously with this kind of problem. If only I was bigger!\" Maria yelled. <br>\r\n<br>\r\n    Once she stated her desire to become bigger she suddenly feels a strange sensation all over her body. She didn't know it then but she activated her power and caused herself too....</span></div></div>",
            "created":1373346000,
            "id":1625386,
            "title":"A Big Bed?!"
        },
        "12523":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Reduce her height by 3 feet",
                "Increase her Height by 3 feet"
            ],
            "content":"<div class=\"\"><div> <span>   As Maria concentrated with all she can and felt the tingling sensation all over her body she managed to grow. She continued to grow until she was 10 feet and 2 inches tall.  \"Oops I think I overdid it Adam.\" She said looking down at her husband who now looked much smaller to her.<br>\r\n<br>\r\n \"Over did it is right! I think you just went from being small to being double your original height!\"  Adam said looking at his wife in amazement.<br>\r\n<br>\r\n  \"Well at least this way the kid will definitely listen now.\" She said.<br>\r\n<br>\r\n \"Maria can you change back to your normal height.\" Adam asked. <br>\r\n<br>\r\n Maria then tried to concentrate again hoping to use her power again to reduce her original size. As she concentrate she manages too....</span></div></div>",
            "created":1386046800,
            "id":1702555,
            "title":"Grew Twice her Normal Size!"
        },
        "125231":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "The Amount of Gravity in her Room",
                "Her Bed into Solid Gold!"
            ],
            "content":"<div class=\"\"><div> <span>    Reduce her height by 3 feet which makes her around seven feet and two inches tall. After using her power that much early on Maria feels completely exhausted.  \"I guess this will have to do Honey.\" She says.<br>\r\n<br>\r\n  \"Can you try one more time? Your still not your correct size.\" Adam requests.<br>\r\n<br>\r\n  \"No, I am far too tired to try anymore, besides at least this way I can finally get clothes on and the kids will listen to me.\" Maria responds.<br>\r\n<br>\r\n  Adam nods and lets his wife get dressed. It took awhile but she did finally manage to find something that would fit her at least in her current size. <i>\" It's kind of fun, being the tallest person, just wish I had more clothes to fit my change in size.\"</i> Maria thought.<br>\r\n<br>\r\n   After she managed to get dressed she began cooking for her family. Her Eldest daughter Chelsea was the first to wake up. Chelsea was quite surprised when she saw her mother suddenly two feet bigger then her. \"What happened to you mom?\" She asked.<br>\r\n<br>\r\n \"Don't worry about it much, I woke up small, but when I tried to get back to normal size I ended up a bit too tall.\" Maria answered.<br>\r\n<br>\r\n  \"How did you do that? That's not a thing normal people do.\" Chelsea asked.<br>\r\n<br>\r\n \"I don't exactly know how I became able to change my size, I just know I am but right now I'm too exhausted to change back.\" She replied.<br>\r\n<br>\r\n   Mason Overheard Chelsea and his mother talk about her sudden burst in size. His reaction was quite different from Chelsea's however. \"Awesome Mom!  Are you going to become a Superhero with your size abilities?\" He asked eagerly awaiting an answer from his mother.<br>\r\n<br>\r\n  \"I don't know, that seems too dangerous I think.\" Maria answered.<br>\r\n<br>\r\n  \"Don't worry Mason who knows, perhaps will discover we have powers soon as well.\" Adam suggested.<br>\r\n<br>\r\n  \"Dear! Don't go putting ideas in his head.\" Maria answered. Adam then waved goodbye and gave his wife a peck on the cheek before leaving for work. Ten minutes later Chelsea and Mason then headed for the school bus. The only people left in the house were her and her youngest daughter Katherine.<br>\r\n<br>\r\n   When Maria heard a sudden scream from her daughters room. As she rushed to look at her, She realized that her youngest daughter was the second to realize her power. As Maria looked she saw that her daughter had changed....</span></div></div>",
            "created":1386555780,
            "id":1705143,
            "title":"Close Enough"
        },
        "1252311":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "No! You Will Go to School Today",
                "Yes You can Stay Home"
            ],
            "content":"<div class=\"\"><div> <span>    The amount of gravity in her room. It had changed so much that as soon as Maria entered the room she found herself being lifted off the ground.  \"Mom! Help me!\" She yelled anxiously. <br>\r\n<br>\r\n  \"Katherine listen to me closely you are the one doing this, do you know how this happened?\" Maria asked. Her daughter Katherine had more questions but right now, she was distracted by the fact that she was in fact responsible for her and her mother floating in the air. As well as many of her other belongings.<br>\r\n<br>\r\n   \"I don't know I was just dreaming about space and the next thing I woke up when I hit my head on the ceiling.\" Katherine answered. <br>\r\n<br>\r\n  \"Try thinking about earth and maybe you'll go back to the ground.\" Maria suggested. Katherine then tried her hardest to think about the earth and slowly descending from the ground. They both slowly descended to the ground. Katherine was thankful that her feet were once again touching the ground, but she also felt extremely worn out. <br>\r\n<br>\r\n\"I just got up and I'm already exhausted.\" She said.<br>\r\n<br>\r\n Her mother nodded, \"It was the same for me too, once I used my powers a bit I was completely exhausted from using them.\"  <br>\r\n<br>\r\n Katherine looked at her mother and then finally noticed how big she was compared to her. \" You do look bigger, So does this mean I get to skip school today?\" <br>\r\n<br>\r\n Maria then said....</span></div></div>",
            "created":1397081100,
            "id":1776130,
            "title":"Defying Gravity"
        },
        "12523112":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Have the two Chelsea's talk it out.",
                "Talk to both Chelsea's"
            ],
            "content":"<div class=\"\"><div> <span>  \" Yes, Katherine you can stay home from school today at least until you have some control over your powers. However because of that, this means you'll have to work extra hard tomorrow!\" She told Katherine.<br>\r\n<br>\r\n   Katherine was excited with joy that she got to stay home, but Maria was more worried about her powers affecting others in a negative manner and didn't exactly want her family to become some sort of government test subjects.  With her home at least she can rest and practice her powers a bit more. <br>\r\n<br>\r\n    The rest of her kids and her husband Adam had already went to school so the two of them stayed at home and whenever Katherine thought she was going to have a relaxing day at home just sitting there and doing nothing. Maria would often call on her to help her out with various chores much to her displeasure. The rest of the day went by without little trouble. <br>\r\n<br>\r\n   The first to come home was Chelsea and she looked a bit disoriented and unsure of herself. Which for Maria seemed a bit unusual to her. \"Chelsea what's the matter?\"  Maria asked.<br>\r\n<br>\r\n  \" I feel kind of funny. It's kind of strange but I'm not sure if it's a good thing or a bad thing.\" Chelsea said.<br>\r\n<br>\r\n  \" I'm sure it will be okay, if you get some rest anything unusual happen to you today?\" Maria asked.<br>\r\n<br>\r\n  \" Well now that you mention it I did notice something strange but I thought I might be hallucinating.\"<br>\r\n<br>\r\n   \" What could you have possibly saw that could make you think you were hallucinating Chelsea please tell me.\" <br>\r\n<br>\r\n    \" I saw myself walking around but how could that be? When I was in class?\" Chelsea asked. Maria had somewhat of an Idea of what could have transpired but her suspicions were soon to be discovered as she saw another Chelsea knocking on the door at home.  She went to the door and opened the door as she saw the other Chelsea. She then knew that her daughter wasn't hallucinating about seeing herself she just had somehow created a duplicate of herself!<br>\r\n<br>\r\n   \" Greetings Chelsea, I think I know what might of happened to you two. Come on in.\"  Maria said.<br>\r\n<br>\r\n  \" Yeah, Whatever can we just get this over with I've got lots to do.\" Chelsea said. Maria soon discovered that this Chelsea wasn't just a duplicate but also a part of Chelsea's own personality had been split from her as well. Now all she had to do was figure out how to be able to get them back to being one. Which could prove more difficult than finding them. Thankfully being a mother Maria decided the best way to deal with this situation was to..</span></div></div>",
            "created":1454341680,
            "id":2097735,
            "title":" A Sensible Choice."
        },
        "1253":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Slime Powers?",
                "Empathy",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Didn't like those choices then how about Slime powers for the mother, or would you prefer something like Empathy?</span></div></span></div>",
            "created":1366520400,
            "id":1576234,
            "title":"Other"
        },
        "13":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Invisibility",
                "Shape Shifting Abilities",
                "Super Strength",
                "Size change Abilities",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span> Chelsea Kelp wakes up after the accident to discover that she has....</span></div></span></div>",
            "created":1357275600,
            "id":1501648,
            "title":"Chelsea "
        },
        "131":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Became Completely Invisible and Couldn't turn it off!",
                "Discovered she could make objects invisible as well.",
                "Made her hands and feet visible, but her other body parts were now invisible!"
            ],
            "content":"<div class=\"\"><div> <span>     Chelsea woke up from her slumber in her bed, She was the oldest of the Kelp family and also was the one who always had to be the responsible one, but every now and then Chelsea felt that she too would like to be irresponsible once in awhile. As she woke up and began to get dressed  she was shocked too see that her hands and feet were disappearing yet she was still able to move and she didn't feel like she didn't have hands. She then quickly realized that her hands and feet were invisible. She was amazed and terrified at this new ability she had. She began to concentrate in attempt to control the ability so that her hands would return to her vision again, However instead of turning it off she...</span></div></div>",
            "created":1480608060,
            "id":2244404,
            "title":"Invisibility"
        },
        "133":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Lifting the Silverware with her mind.",
                "Become Partially invisible.",
                "Run incredibly Fast."
            ],
            "content":"<div class=\"\"><div> <span>   It was just a few days after the car had knocked them into the lake. Thanks to that car they missed there entire vacation. Chelsea then got up to her alarm clock. She went to turn it off, but instead of turning She smashed it to pieces. She then got up and noticed her handiwork. <i>\"Did I do that? But How?</i> She thought. She wasn't exactly sure of how to control her new strength. She tried very carefully not to damage any more of her belongings. Unfortunately she has little success, luckily she manages to get dress without harming her clothes. Chelsea then walks to the Kitchen where her mom was preparing breakfast. It was then that she noticed she wasn't the only one who woke up with powers as she saw her Mom.. </span></div></div>",
            "created":1357275600,
            "id":1501672,
            "title":"Super Strength"
        },
        "1331":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Adam her Father",
                "Katherine her Little sister",
                "Mason her younger Brother"
            ],
            "content":"<div class=\"\"><div> <span>     Lifting the Silverware with her mind. Chelsea at first couldn't believe it at first, that is until she remembered the fact that she had Super strength. This meant for her that everyone in her family could wake up and find themselves with a super power. \"Mom?\" Chelsea asked. <br>\r\n<br>\r\n  Her mother was startled and dropped her concentration causing the silverware she was lifting with her mind to fall on the ground. \"Chelsea!, You startled me, you didn't see did you?\" She asked. <br>\r\n<br>\r\n \"I did see you putting away the silverware without touching it, but I have  a power as well..it's more physical though.\" Chelsea told her mother.<br>\r\n<br>\r\n  \"What is your power Chelsea?\" She asked.<br>\r\n<br>\r\n Chelsea went and lifted the couch with rather ease, to show her mother. Her Mother was surprised and amazed at Chelsea strength. The fact that both her and her daughter had a power meant that her Husband, Mason and Katherine could potentially have a power as well. \" I have Super Strength, I showed it to you because it's easier then just explaining it.\"<br>\r\n<br>\r\nChelsea mother then nodded. \" I see, and I have telekinetic abilities although I can't lift a couch or anything heavy with them. It seems that the more I use my powers the more exhausted I become. \"<br>\r\n<br>\r\n\" You think Katherine, dad and Mason might have a power as well? Chelsea asks. <br>\r\n<br>\r\n \"I do, thought I don't know what kind of power they would have, it could be anything as far as I know.\" She said. <br>\r\n<br>\r\n The next person to discover there power was....</span></div></div>",
            "created":1397082120,
            "id":1776141,
            "title":"Telekinetic Mother"
        },
        "135":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Super Speed",
                "Teleportation",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Don't like those choices then What power does she have?</span></div></span></div>",
            "created":1357275600,
            "id":1501656,
            "title":"More Choices"
        },
        "1353":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Animal Powers with Physical Change Please!",
                "Animal Powers withou physical appearance Change.",
                "Sorry, Not interested in Anthro Something Else."
            ],
            "content":"<div class=\"\"><div> <span> Here's one of the powers they can get that I have yet to think. How about she has changed into some sort of anthromorphic state to where she still resembles a human in some ways but looks more like an animal, with obvious physical changes to her appearance? She still can do whatever that animal can do. So which one would you prefer Animal powers with Physical appearance change, or Without her physical appearance changing?</span></div></div>",
            "created":1513981020,
            "id":2431514,
            "title":"An Anthromorphic Change"
        },
        "13531":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Feathers like a Bird",
                "Fur like a Lion",
                " Scales like a dragon?!"
            ],
            "content":"<div class=\"\"><div> <span>  When Chelsea woke up she felt quite different then she had before. However she did know that after the accident were her family was nearly killed by the man who caused them to fall in to the lake s he had constantly felt pain in her body as if something inside it was moving around. She hated that pain but for the most part she could ignore it. The real pain however began last night as she felt her whole body and shifted and somehow changed. Little did she know that she was going through the final phase of her change that night. When the pain she kept feeling for weeks finally ended she was relieved. However just as she woke up she found something odd upon her bed.<br>\r\n<br>\r\n   Not only was it unusual thing for her to see on her bed, but she found in her sheets to be rather too hot for comfort. Which made her want to get up even faster. It was when she looked in the mirror on her bedroom vanity that she realized that despite her human shape form she had...<br>\r\n</span></div></div>",
            "created":1514075580,
            "id":2431894,
            "title":"Not Just Powers She Recieved."
        },
        "14":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Super Speed",
                "Regenerative Abilities",
                "Healing Abilities",
                "Ability to Stop Time",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Katherine Kelp wakes up after the accident only to discover that she has....</span></div></span></div>",
            "created":1357275600,
            "id":1501649,
            "title":"Katherine"
        },
        "145":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Super Strength",
                "Telekinesis",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Not Satisfied with those choices, then What power did Katherine discover that she had?</span></div></span></div>",
            "created":1357275600,
            "id":1501661,
            "title":"More Choices"
        },
        "1451":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Superspeed",
                "Shapeshifting",
                "I'll tell you after school."
            ],
            "content":"<div class=\"\"><div> <span>    As Katherine got up to her alarm, she raised her hand to hit the snooze button. Only much to her surprise she ended up smashing her alarm to pieces. \"How did I do that?\" She asked herself concerned. She went with her usual routine for the morning. Took out some clothes and then went to the shower. Once she was finished with the shower she dried herself off. Soon as she was dressed, her mother had yelled. \"Time to eat.\"  Katherine then headed towards the kitchen. \" What's for breakfast today mom?\" Her mother then replied. \"Today we're having pancakes.\"  Katherine then complained. \"Mom! Can't we have something less fattening?!\" <br>\r\n<br>\r\n   \"This was what your brother wanted for breakfast and it was his turn to pick today.\" She replied. \"If Mason keeps picking foods like this  I'm going to look like a blimp!\" Katherine said. <br>\r\n<br>\r\n      Her Mother then responded to Katherine. \" You look fine Katherine, a few pancakes wont hurt you.\"  Katherine then mumbled as she began to eat her breakfast. \"Mom, I need a new alarm clock.\" Katherine said. \"I'm sure your alarm clocks working fine, why would you need a new one?\" Katherine's mother asked. \" Well, when I woke up this morning I kind of broke it.\"  Katherine's Mother then gave Katherine that certain mother's glare she usually got when she was in trouble. \"What do you mean broke?\" She asked. \" I didn't mean to break it, I was trying to hit the snooze button as usual. Then it just smashed into pieces from the impact from my hand.\" Her Mother from looking at her knew she was telling the truth and then asked. \" Would you mind trying something for me Katherine? I'd like to confirm something?\" Katherine then responded. \"Sure, What do you want me to do?\"  <br>\r\n<br>\r\n     \"I want you to try to lift the couch.\" She said. \"Why?\" Katherine asked. Katherine's mother then responded. \" Just try to, but don't strain yourself.  Katherine decided to amuse herself and try. She went and used her knees to try and lift up the couch. Only much to her surprise she found out extremely easy to lift. To Katherine the couch was as light as a feather. \"How is it possible, this couch is way too light!\" Katherine then gave her mother a stare back. \"You're not pulling a prank on me are you?\"  She then responded. \" No Katherine, I'm not it appears light to you because you've gained super strength.\" Katherine then quickly asked. \"How did I gain that?\" Her mother soon replied. \"I'm not sure, but you're not alone I've also gained an ability.\" Katherine then put down the couch and asked. \"What ability have you gained?\"  Her mother then responded. \"I've gained....</span></div></div>",
            "created":1363150800,
            "id":1549255,
            "title":"Super Strength"
        },
        "14512":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "At School",
                "Later at Home"
            ],
            "content":"<div class=\"\"><div> <span>    \".... Shape-shifting powers Katherine.\"  Katherine then asked. \"Can you show it too me?\" Her mom just nodded and smiled.<br>\r\n\"Sure, but I'm not exactly good at it yet, so I may make a few mistakes.\" Katherine's mother then began to use her shape-shifting powers to show Katherine, as she changed into Katherine, except she looked six years old.  \"That's amazing, but why did you change to my six year old self?\" Her mother then gave a slight smile as she began to change back. \"I just thought of how cute you were, when you were that age.\"  <br>\r\n<br>\r\n<br>\r\n     Katherine put her dish in the dishwasher and then began leaving for school, before she left she decided to ask her mom one last question. \"Does anyone else have a power like yours or mine?\" Her Mother then answered. \" If by exact power, no I don't know any one. I do know that Mason has a power, but I don't know about your father or sister yet. Katherine was about to ask another question, however her mom interrupted her before she could even say anything. \" You Should head off to school now, I don't want you to be late. Will all have a talk later, when everyone is home. \" Katherine then nodded and headed straight for school.</span></div></div>",
            "created":1366520400,
            "id":1576231,
            "title":"The Transforming Mother!"
        },
        "145122":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Her Father",
                "Her Mother"
            ],
            "content":"<div class=\"\"><div> <span>    Katherine went to school and nothing eventful happened. Fortunately she was able to hide her new found strength from the people at school, it wasn't until she came back home. \"How was your day at school?\" her Mother asked. \"It was okay.\" She responded. Katherine then looked towards the living room where Mason, Chelsea, and her father were waiting. \" Is something going on?\" Katherine asked.<br>\r\n<br>\r\n  Her mother then responded, \" You remember what we discussed early today Katherine?\" Katherine nodded as her mother continued to speak. \"I've already demonstrated my power, and I told you Mason has one as well, but I've also discovered that every one of us has a power and each one is different.\"  Katherine then looked at her father sitting and waiting. \"So, what kind of power does dad have?\" She asked.<br>\r\n<br>\r\n  Katherine mother quickly answered..\"Your father can fly, but he's not really that good at it.\" Then her father spoke. \"Not good at it, come on, I would've been flying circles around you if it wasn't for the roof.\" He said.  \"What about Mason's power you said he already had one?\"  Katherine nodded. \"Mason power is Super Speed, As for your older sister Chelsea she can change her size.\"  <br>\r\n<br>\r\n  \"So everyone has a different power, but why exactly were you waiting for me to tell me this?\" Katherine asked. Her mother then quickly answered. \"Your father has some crazy idea for us to use our powers to fight crime, I'm against the idea, your father is for it, Mason agrees with your father and Chelsea agrees with me.\"  She then understood why everyone was waiting for her to come home. \"Then that means I'm going to be the tie breaker?\" She asked. \"Yes, do you want to try your fathers idea or try to continue to have a normal life?\" <br>\r\n<br>\r\nKatherine then decided to side with...</span></div></div>",
            "created":1385701200,
            "id":1700438,
            "title":"Later at Home"
        },
        "1451222":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "It's Positive",
                "It's Negative"
            ],
            "content":"<div class=\"\"><div> <span>   Her Mother due to one specific reason. \"I think it would be best if we don't go out and become Superheroes, mainly because we just recently got our powers and I doubt we could do much with them.\" Her Father had a surprised looked, and her brother Mason simply began to pout.<br>\r\n<br>\r\n \"What?! That's nonsense Katherine, I'm sure all of us are ready to go right now!\" Her father said.<br>\r\n<br>\r\n \"Honey, You and I both now that Katherine has made the most responsible decision by choosing to hide our powers.\" Katherine's Mother told her father.<br>\r\n<br>\r\n  \"She Just sided with you because your all girls! What a disappointment!\" Mason Exclaimed.<br>\r\n<br>\r\n   \"Mason you know very well, that we only just recently discovered our abilities. It would be best if we explore them and see there potential and there limits. Otherwise we may just end up in a situation that could be extremely bad. I for one do enjoy my power. I just don't have complete control over it which makes it very difficult for us to use your idea.\" Chelsea lectured Mason.<br>\r\n<br>\r\n  \"Well, you two were out voted and chose me as a tie breaker, which means we should hide our powers from public view. That way none of us would be labeled as freaks.\" Katherine said with a determined expression. Her father walked towards Katherine and gave her a hug.<br>\r\n<br>\r\n  \"Just cause we have powers now doesn't make us freaks Katherine.\" He said.<br>\r\n<br>\r\n  \"You just say that because all you care about is becoming a Superhero family! But I didn't want to be as strong as I am!\" Katherine yelled.<br>\r\n<br>\r\n  \" You expect us to go out and save people we hardly even now just because we have powers now? That's Lame we should hide them as much as we can until we find out what caused it. So we can figure out if there is a way to get rid of them!\" Katherine said as she pushed her father away from her. Everyone was surprised by seeing her strength the first time with the exception of her mother who had already seen it.<br>\r\n<br>\r\n  As her father came flying towards the wall as the result of Katherine's strength she went and rushed towards her father with a worried look on her face. \"Dad Are you alright? You're not hurt too bad are you? Please be alright. Come on Dad answer me please?\"  She asked.<br>\r\n<br>\r\n Katherine father after the initial shock wore off he smiled before passing out. her mother then quickly called the hospital and the entire family went to the hospital. Everyone one waited anxiously for the doctors response and hoping for the best. But would the doctors news be positive?</span></div></div>",
            "created":1385960400,
            "id":1701935,
            "title":"Katherine Viewpoint"
        },
        "14512221":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "The Doctor is Fooled",
                "This Doctor is No Fool!"
            ],
            "content":"<div class=\"\"><div> <span>    When the door to her fathers hospital room finally opened. Katherine was anxiously hanging on the doctors every last word as he began to speak.  \"Your father will live, but I do have some questions to ask you all. That is if you don't mind answering them.<br>\r\n<br>\r\n  \"We don't mind Doctor.\" Katherine's mother said confidently.<br>\r\n<br>\r\n \"Very well, Mrs. Kelp do you know exactly how your husbands got these injuries.\"  The Doctor asked Katherine's mother.<br>\r\n<br>\r\n  \"He was working on moving the satellite to a place where it would get better reception. It was shortly after that when he slipped off the roof and hit the sidewalk on his back. We all came worried about what happened to him and his daughter Chelsea quickly called 911 shortly after.\" Her Mother lied.<br>\r\n<br>\r\n  \"The wounds on his body do suggest he could of fell from that, but according to our X-rays Mr. Kelp has some big wounds in the front of his body which are even worst then the ones in the back.\" The Doctor told Katherine's mother. Shortly after that Katherine decided to add to her mother's little lie.<br>\r\n<br>\r\n  \"That's because he hit a tree as he was falling, It didn't look like he was hurt at that time but when he fell he flipped over towards his back. Dad tried to tough it out because Mason and him usually play Superhero a lot and he probably didn't want to concern him too much until he fell.\" Katherine told the doctor.<br>\r\n<br>\r\n  \"I Think I get the picture now, Mr. Kelp was out on top of the roof adjusting a satellite, when suddenly he slipped and fell into a tree. Then his youngest daughter and son saw him there pretending to act alright. Until the tree branch snapped and caused him to flip over onto his back. This is when his eldest daughter saw him and then called 911. Which brings us to where we are at currently.\" The Doctor explained repeating the story Katherine and her mother had just told.<br>\r\n<br>\r\n   \"But I thought it was Katherine's New found Super power that hurt daddy?\" Mason asked with a confused look on his face.<br>\r\n<br>\r\n   Katherine brow began to sweat as she began to shake nervously from Mason's response. \"Mason you know that Super powers don't exist for real.\" <br>\r\n<br>\r\n  Mason  crossed his arms as he looked sharply at his Sister Katherine. \"Liar! You know your power knocked dad into the roof and caused him to be hurt!' Mason exclaimed bluntly.  Katherine began to worry that the doctor would believe Mason more then her or her mother. Will the doctor believe her or will he believe Mason and discover the truth?</span></div></div>",
            "created":1385960400,
            "id":1702216,
            "title":"Discovered Already?"
        },
        "145122212":{
            "choices":[
                "I have experience treating superhumans",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"That would explain the injuries,\" says the doctor nonchalantly. <br>\r\n<br>\r\n\"You don't honestly believe Mason do you?\" asks Katherine's mother nervously. <br>\r\n<br>\r\n\"Yeah, it's totally crazy,\" says Katherine with a nervous smile.<br>\r\n<br>\r\n\"No it's not,\" says Mason as he sticks his tongue out at Katherine.<br>\r\n<br>\r\n\"I do believe him,\" says the doctor, \"because when we did a blood test on your father, we detected an anomaly I recognized.\" <br>\r\n<br>\r\n\"WHAT?\" asks Katherine and her mom in shock.<br>\r\n<br>\r\nThe doctor nods and says........</span></div></div>",
            "created":1385960400,
            "id":1702249,
            "title":"This Doctor is No Fool!"
        },
        "1451222121":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "I Do have a suggestion",
                "I don't but I know someone who does."
            ],
            "content":"<div class=\"\"><div> <span>   \"I have experience in treating Super humans. It certainly does bring back memories.\" The Doctor said.<br>\r\n<br>\r\n Mason then gave the doctor a slightly curious look. \"You mean there are other people with powers like us?\" He asked the doctor.<br>\r\n<br>\r\n   The Doctor then leaned down so he would be close to Mason height and then spoke. \"When I was young I fell in love with a girl who just happened to have quite some strange rumors about her. At first I was too nervous to even get close to her. Then one day when I saw her alone and crying I went and asked her to tell me her problems.\"<br>\r\n<br>\r\n \"Doctor before we go strolling down memory lane, could you at least tell us your name?\" Chelsea asked the doctor interrupting his story.<br>\r\n<br>\r\n  \"Oh I guess I should do that. My full name is Kyle Fudge. So you can call me Dr. Fudge. Dr. Fudge responded to Chelsea's interruption.<br>\r\n<br>\r\n  \"Mason, Why did you have to go and blow our cover anyways?\" Katherine whispered to Mason.<br>\r\n<br>\r\n  Mason then looked to Katherine and gave her another raspberry with his tongue before answering. \"Because it's wrong to lie!\" He exclaimed.<br>\r\n<br>\r\n   Her Mother then simply shrugged her shoulders and was no longer nervous no that there cover. \" Well I can't argue with that. Now Dr. Fudge would you mind resuming your story?\" She asked.<br>\r\n<br>\r\n \"Very well.\" He responded as he began to continue his Story. \" As you can expect at first she didn't console to me in the slightest, even used almost every excuse she had at her disposal to convince me that nothing was wrong. Eventually I discovered her power on my own her ability to bring her drawings to life was the most astounding thing I had ever seen!\" <br>\r\n<br>\r\n  \" That's an awesome power!\" Mason exclaimed excitedly.<br>\r\n<br>\r\n   Dr. Fudge then continued to tell a story with an obviously captive audience. \" I though so too. In fact I often wondered why she didn't use it more often. When She finally heard I knew about her power she began to talk to me more and I did my best to console her. Unfortunately as I became more immersed in her world I found there were others out there just like her, but with different abilities. One day I thought that perhaps she should get together with these people and use her powers to fight evil. Her thoughts weren't exactly the same as mine though.\"<br>\r\n<br>\r\n  \"Let me guess she didn't want to use her power to fight evil. But you tried to convince her anyways am I right?\" Katherine asked Dr. Fudge.<br>\r\n<br>\r\n  \"That's precisely it.\" Dr. Fudge responded to Katherine question.<br>\r\n<br>\r\n  \"What she told me was that everything that she creates is alive and she couldn't just let them risk there lives like that. Her Drawings were like children to her.\" Dr. Fudge said.<br>\r\n<br>\r\n   \"I wouldn't like the thought of losing my children at all, which is why I am against any fighting crime business in the first place.\" Katherine's mother said.<br>\r\n<br>\r\n   \"Eventually I convinced her which proved to be my most fatal mistake. It was several months before I heard from her only to learn that one of her drawings she used to fight a criminal organization bent on creating the most powerful super villain ever seen had killed one of her drawings she had brought to life.\" Dr. Fudge said.<br>\r\n<br>\r\n \"What does that have to do with this story?\" Mason asked.<br>\r\n<br>\r\n  \"I'm getting to that.\" Dr. Fudge quickly responded. \" What I didn't know was that when a drawing of hers gets shot in the heart. She also got shot in the heart it was the weakness of her power. I was infuriated with myself for not realizing just how important those drawings of hers really were. After that trauma I decided to become a doctor so I would be able to save lives. I even ran to some of the people with powers again and when I did I studied them thoroughly and even offered to become there personal doctor so that there identities would be kept a secret.\"<br>\r\n<br>\r\n  \"I get it now, you recognized that anomaly from all of your other patients.\" Katherine's mother guessed correctly.<br>\r\n<br>\r\n   The doctor nodded. \"That is correct, now I believe I have your trust now right.\" he asked.<br>\r\n<br>\r\n \"Yes!\" Mason, Katherine, Chelsea and  their mother responded.<br>\r\n<br>\r\n \"Very good, now would you mind telling me what powers each of you have?\" Dr. Fudge asked.<br>\r\n<br>\r\n \"I can run Super Fast!\" Mason exclaimed first.<br>\r\n<br>\r\n \"I believe what my power is called is something along the lines of Shape Shifting.\" Katherine's mother said.<br>\r\n<br>\r\n \"Well my power isn't all too great just yet, all I can do is change my size, but my current practice I can only reduce myself to half my current height, or enlarge myself to double my height.\" Chelsea said.<br>\r\n<br>\r\n  Katherine took a quick look at the doctor before explaining her power. \"What's to explain about my power? Super Strength that nearly killed dad just cause I disagreed with his idea. I hate my power I want to be normal, not some freak!\"<br>\r\n<br>\r\n  \"You should try to enjoy your power.\" Dr. Fudge said to Katherine.<br>\r\n<br>\r\n \"Enjoy being so strong that I nearly kill everyone I ever like! Ha! I would be better off without it!\" Katherine exclaimed.<br>\r\n<br>\r\n \"I don't know about that Katherine, but perhaps there might be a way that Dr. Fudge knows that might help you control you strength a bit better.\" Her Mother suggest.<br>\r\n<br>\r\n \"Fine.\" Katherine mutters before turning towards Dr. Fudge. \"Do you really know of  a way you can help me?\" She asks.<br>\r\n<br>\r\n The Doctor responds....</span></div></div>",
            "created":1385960400,
            "id":1702395,
            "title":"The Doctors Experience"
        },
        "14512221212":{
            "choices":[
                "Yes please, if he can help me control this, the better!",
                "No, I just want to be rid of this power!"
            ],
            "content":"<div class=\"\"><div> <span>\"I don't but I know someone who does,\" says Dr. Fudge, \"he is one of the people I encountered cause of my friend and he has super strength himself, last I checked, he could lift up a tank and throw it across a football field.\" <br>\r\n<br>\r\n\"WHOA!\" says Mason, \"Katherine can do that?\" <br>\r\n<br>\r\n\"Would have to get her strength tested but maybe,\" says Dr. Fudge as he looks at Katherine, \"would you like me to call him?<br>\r\n<br>\r\n<br>\r\nKatherine looks at the doctor and says......</span></div></div>",
            "created":1386046800,
            "id":1702444,
            "title":"I don't but I know someone who does."
        },
        "145122212121":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Her Recent Crush",
                "Someone from Her School"
            ],
            "content":"<div class=\"\"><div> <span>   \"Yes please if he can help me control this then the better chance I wont put lives at risk.\" Katherine says to Dr. Fudge.<br>\r\n<br>\r\n  \"I thought you wanted get rid of your power Katherine?\" Mason asks.<br>\r\n<br>\r\n \"I do want to get rid of it, but I don't think the Doctor knows a way to get rid of it.\" Katherine replied to Mason.<br>\r\n<br>\r\n  \" Your assumption is correct, I don't know of anyone who can get rid of your power, but at least this way it'll help you learn about it more and perhaps even appreciate as well.\" Dr. Fudge said.<br>\r\n<br>\r\n  \"I know I appreciate my power, if it wasn't for my power I'd never be able to always fit and the latest and coolest clothes.\" Chelsea said.<br>\r\n<br>\r\n \"That's what you use  your power for Chelsea? To fit the latest styles?\" Their mother asked.<br>\r\n<br>\r\n \" Of course, All that matters in this world is fitting in and Standing out. My power to change my size allows me to do both! It's the best Super power ever!\" Chelsea confidently responded.<br>\r\n<br>\r\n Katherine then grunted and turned her attention towards her sister. \"If you liked your power so much then why did you side with us, when dad was suggesting his Super Hero idea?\" She asked her sister.<br>\r\n<br>\r\n \"Simple, One is because right now we aren't ready like you said, and the second reason is because we barely know about our powers. We know what they can do and that there perhaps getting stronger each and everyday. Except we just found ourselves with these powers, so it's too soon to just go out and play vigilante. Not to mention not in style right now either.\" Chelsea responded.<br>\r\n<br>\r\n Their mother was watching there father while they were discussing about recent events that happened to them. As she watched him she noticed that he finally began to open his eyes. \" Quiet Everyone, your father is waking up.\" She said.<br>\r\n<br>\r\n Their father moaned and smiled jokingly as he woke up. \"Ugh..Get the number of the bus that hit me Maria?\" he asked.<br>\r\n<br>\r\n  \"Adam! You know that's not what happened.\"  Maria said.<br>\r\n<br>\r\n \"Now that your awake Mr. Kelp. It may be hard to understand but you will have to stay here a few days before you are allowed to be released.\" Dr. Fudge said.<br>\r\n<br>\r\n  Katherine was relieved after hearing her father speak. It meant that he was alive and well and she was glad for that. Her Sister and brother were also relieved. Dr.Fudge did a few more test on there father now that he was awake. Once he was finished with his test he once again turned towards Katherine's direction.<br>\r\n<br>\r\n \"I've called the person I know and told them of your address, he will help you with your strength.\" Dr. Fudge said.<br>\r\n<br>\r\n \"Can you at least tell me his name?\" Katherine asked.<br>\r\n<br>\r\n \"He prefers to keep his identity a secret. I only told him yours because you want his help. He will come to your house tomorrow.\" Dr. Fudge said.<br>\r\n<br>\r\n \"Alright, I'll see him tomorrow then.\" Katherine said. The family then left the hospital everyone except their father Adam. Who would be staying a few days to rest up from his injuries.  The Drive home was quiet and uneventful. When they finally arrived home it was dinner time and they ate then went to sleep. <br>\r\n<br>\r\n  The next day was a Saturday so no school was necessary and everyone was at home. Katherine woke up earlier then everyone else when she heard the door bell ring at five o'clock in the morning. She went and answered the door in her pajama's. \"Who is it?\" She asked while half asleep.<br>\r\n<br>\r\n  \"Are you Katherine Kelp?\" the man asked.<br>\r\n<br>\r\n \"Shouldn't you give me your name first?\" Katherine responded.<br>\r\n<br>\r\n \"Very well, Call me Sydney and this here is my twelve year old son Steven.\" Sydney said.<br>\r\n<br>\r\n \"I'm Katherine.\" Katherine said. As she looked at his son Steven, Katherine had noticed that he was...</span></div></div>",
            "created":1386046800,
            "id":1702543,
            "title":"Katherine's Answer"
        },
        "1451222121212":{
            "choices":[
                "Stretches his arms.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, I've seen you around school,\" says Katherine in surprise. <br>\r\n<br>\r\n\"And I've seen you around too,\" says Steven, \"so my dad tells me you got super strength.\"<br>\r\n<br>\r\nAh yeah,\" says Katherine, \"do you got a power?\" <br>\r\n<br>\r\n\"Yes he does,\" says Sydney, \"the anomaly that grants people superpowers is often passed down to one's children though differently.\" <br>\r\n<br>\r\n\"Differently?\" asks Katherine, \"so Steven has a different power?\"<br>\r\n<br>\r\n\"Yes I do,\" says Steven, \"wanna see?\" <br>\r\n<br>\r\n\"Sure,\" says Katherine as Steven walks into the house and......</span></div></div>",
            "created":1386046800,
            "id":1702738,
            "title":"Someone from Her School"
        },
        "14512221212121":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Sydney is Stronger",
                "Katherine is Far Stronger than Sydney"
            ],
            "content":"<div class=\"\"><div> <span>   He stretches his arms all the way back to the back door to the house before reeling them in. Katherine was a bit amazed by Steven's power. Granted it was the first time she had seen this kind of power. Once Steven's arms were back to normal length he turned his attention towards Katherine and asked her. \"What do you think?\" <br>\r\n<br>\r\n \"It's very impressive. I'm guessing it comes in handy as well.\" Katherine Answered.<br>\r\n<br>\r\n  \"It can be handy for hard to reach places, but like all powers it has it's limits.\"  Steven said.<br>\r\n<br>\r\n \"Which brings us to why we are here today. We wont do too much today just to discover how strong you really are Katherine.\"  Sydney said.<br>\r\n<br>\r\n \"How are we going to that?\" Katherine asks.<br>\r\n<br>\r\n \"Simple first by lifting objects, and then a little game of tug of war.\" Sydney responded.<br>\r\n<br>\r\n \"Fine the heaviest object I know I lifted so far is a couch.\" Katherine said. <br>\r\n<br>\r\n \"Very well then, Why don't you try the family car now?\" Sydney asked Katherine. Katherine nodded and then went outside and attempted to pick up the family car. Much to her amazement she was able to easily lift the car with only one hand! Unfortunately doing such a stunt caused her to lose balance in holding the car causing it to flip upside down.  <br>\r\n<br>\r\n   \"Oops.\" Katherine said looking at the now crushed car.<br>\r\n<br>\r\n  \"Your strength is amazing Katherine, but let this be a lesson to you. When picking up objects make sure you can keep them well balanced. \" Sydney said.<br>\r\n<br>\r\n  \"I'll try can we go to the tug of war thing now? Though with my strength wouldn't the rope break?\" Katherine asked.<br>\r\n<br>\r\n   \"No, this rope was specially made so that both of us could tug at one side to discover exactly how strong you are.\" Sydney responded.  Sydney then set up the special rope and each stood at one side. <br>\r\n<br>\r\n  \"What exactly will we discover doing this?\" Katherine asked Sydney.<br>\r\n<br>\r\n  \"We will discover if your Super Strength is stronger than mine.\" Sydney responded. Both Katherine and Sydney grabbed one side of the rope with Steven in the middle. Steven gave the signal for both of them to pull as hard as they could.  For awhile it looked like there strength was equal. In the end however it turned out that...</span></div></div>",
            "created":1386046800,
            "id":1702815,
            "title":"The Elastic Kid"
        },
        "145122212121211":{
            "choices":[
                "Another member of the Kelp family comes out to find out what the noise is",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>\"My dad wins,\" says Steven after Sydney managed to pull Katherine over to him.<br>\r\n<br>\r\n\"Wow,\" says Katherine as she looks at Sydney.<br>\r\n<br>\r\n\"You're stronger than I was at your age,\" says Sydney, \"when I was your age, I could only lift a car with both my hands.\" <br>\r\n<br>\r\n\"Wow, how did you get stronger?\" asks Katherine.<br>\r\n<br>\r\n\"Over time, working out and training,\" says Sydney with a nod.<br>\r\n<br>\r\n\"Okay, so what now?\" asks Katherine as......</span></div></div>",
            "created":1386046800,
            "id":1702824,
            "title":"Sydney is Stronger"
        },
        "1451222121212111":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Tried to Ask Her out But Failed",
                "Asked what her Super Power was"
            ],
            "content":"<div class=\"\"><div> <span> Her Older sister Chelsea come outside to see what all the noise was about. Chelsea first got dressed and put on a white blouse with a matching Skirt on. She then put a on a Crescent moon necklaces with blue gems embedded in it. Once she was finished with that she put on a pair of socks and a pair of black open toed shoes. She then went outside the front yard curious to what the big noise outside was.<br>\r\n<br>\r\n  As Steven saw Chelsea come out of the door he began to slightly blush and staggered as he talked. \"He-Hello did we Wake you up?\" He asked nervously.<br>\r\n<br>\r\n  \"Not by much, I was already up when I heard a loud sound..that sounded like a car getting smashed or something like that.\" Chelsea said. <br>\r\n<br>\r\n   Katherine then went and noticed Kevin's nervousness around her sister.  Katherine took a good look at her sister and something was a bit off today from usual. As she inspected her closer she realized that her sister had unconsciously used her power and was about one foot taller than normal. \" Sorry about the car, I kind of underestimated balancing it.\" Katherine said.<br>\r\n<br>\r\nChelsea still unaware that she was a foot taller then usual spoke to Katherine. \"It's fine, Just do me a favor and when I get a car. Please don't do anything to it.\" Chelsea said as she looked around and noticed Kevin and her father who were also in the area.<br>\r\n<br>\r\n  \"This is my son Steven, and I'm Sydney I came here to help your sister understand her power.\" Sydney said.<br>\r\n<br>\r\n \"I Know about it, but what is your son doing here? Surely he wouldn't be needed for a simple training exercise. Correct?\" Chelsea asked.<br>\r\n<br>\r\n  \"I'm aware, but I think it would be better for her to have someone around her own age here, So she can enjoy it more and have someone to talk to once finished with today's training.\" Sydney replied.<br>\r\n<br>\r\n Katherine had a surprised look on her face when she heard that the training would be more then just one day of training. \"Wait! You mean this isn't a one time training deal and then I'm off on my own thing?\"  She asked.<br>\r\n<br>\r\n Sydney looked at Katherine and gave her a stern look before speaking. \"No it isn't, Your at a time where your strength could be far more stronger just by the next day. So It's necessary for you to keep training until it becomes a normal routine for you.\" <br>\r\n<br>\r\n  \"But that's not what I wanted.\" Katherine whined.<br>\r\n<br>\r\n \"Tough it out then! It may not be what you wanted but it is what you need.\" Sydney said.<br>\r\n<br>\r\n  \"You're names Chelsea right?\" Steven asked nervously.<br>\r\n<br>\r\n \"Yes it is.\" Chelsea answered.<br>\r\n<br>\r\n Steven then....</span></div></div>",
            "created":1386213180,
            "id":1703389,
            "title":"Sisterly Concern."
        },
        "14512221212121111":{
            "choices":[
                "But I'm sure Katherine would like to go.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"So ah Chelsea,\" says Steven with a blush, \"you want to go to the mall sometime for a bit to eat?\" <br>\r\n<br>\r\n\"Are you asking me out?\" asks Chelsea in shock. <br>\r\n<br>\r\n\"Maybe,\" says Steven, \"well?\" <br>\r\n<br>\r\n\"Sorry but I don't date younger guys,\" says Chelsea as she looks at Katherine and smirks, she than says.......</span></div></div>",
            "created":1386220140,
            "id":1703480,
            "title":"Tried to Ask Her out But Failed"
        },
        "145122212121211112":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Don't Hurt Me!",
                "Evil Witch Begone!"
            ],
            "content":"<div class=\"\"><div> <span> \"You could ask my younger sister though, that is if you like her.\"  Chelsea says while giving a little wink towards Katherine.<br>\r\n<br>\r\n  \"Why would I do that? She's not as beautiful as you are.\" Steven replied.<br>\r\n<br>\r\n Katherine looked at Steven and then yelled. \"What do you mean I'm not beautiful?\"<br>\r\n<br>\r\n \"Err..I didn't mean that your not beautiful it just that you pale when compared to your Sister.\" Kevin nervously replied.<br>\r\n<br>\r\n  Katherine then went and took a deep breath of air before she spoke again. \"Fine, I'm not interested anyways.\"<br>\r\n<br>\r\n \"Neither am I. I may have been rejected but I'll still get your sister to like me!\" Steven Exclaimed.<br>\r\n<br>\r\n Chelsea was amused by Katherine and Steven's conversation and began laughing. As She laughed her height unexpectedly shrunk herself by three feet. Katherine,Sydney and Steven all watched as her sister height suddenly became much closer to her little brother Mason's. The Clothes she was wearing unfortunately didn't shrink with her and now were too big for her to wear. <br>\r\n<br>\r\n \"Chelsea, you changed size again.\" Katherine said.<br>\r\n<br>\r\n Chelsea looked and noticed her over sized clothes before responding. As she looked her face turned red and had an embarrassed expression. \"Great, it happened again. I'm sorry you had to sea this Katherine.\" She said.<br>\r\n<br>\r\n \"What exactly happened again?\" Katherine asked.<br>\r\n<br>\r\n\" We'll you see my power to change my size from what I know so far is based upon my emotions. But unfortunately I don't know which emotions make me smaller or bigger yet. Apparently however when ever I begin to laugh I seem to shrink.\" Chelsea said.<br>\r\n<br>\r\n \"I guess I'm not the only one having trouble with my power.\" Katherine said.<br>\r\n<br>\r\n  \"It does give me an idea though, but first I believe we should take our leave now, morning practices are now over. Come meet us in the park this afternoon alright Katherine?\" Sydney asked.<br>\r\n<br>\r\n Katherine nods. \"Alright I will,  but wouldn't the park kind of be a bit too public?\" She asks.<br>\r\n<br>\r\n \"Don't worry we're don with powers today, this afternoons lessons well let's just say it's going to be a bit of a surprise. Steven you can't come this time.\" Sydney said.<br>\r\n<br>\r\n \"What? Why not?\" Steven asked his father.<br>\r\n<br>\r\n \" I want some one on one with Katherine.\" Sydney responded.<br>\r\n<br>\r\n \"Okay, I can understand that.\" Steven said.<br>\r\n<br>\r\n   With Katherine's morning lessons now done, she goes and takes a shower and gets a quick change of clothes. Steven and Sydney then head on home. The rest of the morning goes a bit more easier for Katherine.  Even though Mason is up he doesn't seem to bother Katherine which to her seem to be unusual. Katherine curious to know why Mason hasn't exactly bothered her decides to bother him a bit.<br>\r\n<br>\r\n  \"Hello, Mason how are you doing?\" Katherine asks as she gently pats him on his head. Katherine was shocked as Mason then tells her...</span></div></div>",
            "created":1386344700,
            "id":1704030,
            "title":"Something else"
        },
        "1451222121212111121":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Mother",
                "Older Sister"
            ],
            "content":"<div class=\"\"><div> <span>   \"Don't Hurt Me!\" Mason yells in fear. Katherine sighed and shook her head as well as removing any part of her body away from Mason. She then got on one her knees, until she was about down to his height before then speaking to him.<br>\r\n<br>\r\n  \"Mason! I'm not going to hurt you, what makes you say that?\" She asked him in about as a calm of a matter as she could have.<br>\r\n<br>\r\n  \"B-But you hurt Daddy, and we don't get along that much so you'd go after me next!\" Mason Cried. Mason then ran  away from Katherine. Katherine then rushed after him until she found him in his room with the door locked. She knew with her strength she could easily break down the door. However she knew if she did that she would only be proving Mason right. She then carefully knocked on his door.<br>\r\n<br>\r\n\" Mason listen, what happened with dad, wasn't something I meant to do...\" Katherine tried to explain it as best as she could without scaring him. \"...It was an accident and it happened cause I don't have control of my strength.\"<br>\r\n<br>\r\nMason kept the door shut, but he did respond to Katherine's explanation. \"Liar! You are a Bad Sister!\" Bad!\" <br>\r\n<br>\r\n Katherine was frustrated by what Mason said, but she knew she couldn't talk him out of it so she decided to seek advice from her...</span></div></div>",
            "created":1397083680,
            "id":1776149,
            "title":"The \"Bad\" Sister"
        },
        "14512221212121111211":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Chelsea With Problems of her Own",
                "A burglar? Trying to rob them."
            ],
            "content":"<div class=\"\"><div> <span>  Mother, she didn't seem to know what to do. Nor did she want Mason to simply be afraid of her all his life. She went into the Kitchen where her mother was cooking dinner. \"Mom Can you help me with something?\" She asked. <br>\r\n<br>\r\n  \"Sure Sweetie what is it you need help with?\" She replied. <br>\r\n<br>\r\n\"Mason is afraid of me, cause of what I did to dad I want to help him get over it, but he wont come out of his room when I call him.\" Katherine told her mother. Her Mother knew this could become a problem eventually, but she also knew that it would be best if you waited a bit longer rather than rush things for a quick patch up.<br>\r\n<br>\r\n  \"All you have to do is wait, there is nothing you can do right now especially if he is still afraid of you.\"  She told Katherine.<br>\r\n<br>\r\n  \"Mom! I don't want Mason to be afraid of me for the rest of my life! I rather fix this now rather than later!\" Katherine exclaimed.<br>\r\n<br>\r\n\"Sweetie, these things take time, and it would be a much better idea for you to wait for you father to get home, before trying to explain things. You don't want to rush these things.\" She told Katherine in a stern voice. <br>\r\n<br>\r\n\" Fine!\" Katherine said. Once she was finished talking with her mother she went to her room and waited until dinner would finally be ready. However she was surprised to find that her room was occupied by....</span></div></div>",
            "created":1417876380,
            "id":1898429,
            "title":"   Mother's Advice."
        },
        "1453":{
            "choices":[
                "Elasticity ",
                "Her body became clay like."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What power did Katherine get?</span></div></span></div>",
            "created":1385442000,
            "id":1699210,
            "title":"More Choices"
        },
        "15":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Telepathy",
                "Super Strength",
                "Super Speed",
                "Mind Control Abilities",
                "Other Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mason Kelp wakes up after the accident to discover that he has...</span></div></span></div>",
            "created":1357275600,
            "id":1501652,
            "title":"Mason"
        },
        "152":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Mom and Dad",
                "One of his Sisters",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>     As Mason slowly began to rise up from his bed. He felt strangely different, he couldn't quite put his finger on what it was though. <br>\r\n<i>\" I feel a bit weird this morning,  wonder why?\"</i> Mason thought to himself.  Mason shrugged off his thought's for now and then began his normal routine. He got up out of bed, took off his pajamas and put on himself a blue shirt, with blue jean short's.  He then went and looked for his socks.  The Search took him awhile, but eventually he found his pair of socks, stuck under the wheel on the frame of his bed.  Normally when this happened Mason would get his father to lift the bed so he could get the socks.  This time he decided to try for himself for once, just to see if he could do it. <br>\r\n<br>\r\n<br>\r\n   Mason then went and picked up the frame of the bed with both mattresses still on them. He was amazed and somewhat proud of what he did. Being  the smallest and youngest of the siblings, he was often the one with very little strength compared to the rest of his family. <i>\"Wait until dad hears what I did!\"</i> Mason thought to himself. Once he grabbed his socks and put on his shoes, Mason went out towards the Kitchen where he saw...<br>\r\n</span></div></div>",
            "created":1366520400,
            "id":1576220,
            "title":"Possibly the Strongest Kid"
        },
        "1522":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Chelsea",
                "Katherine"
            ],
            "content":"<div class=\"\"><div> <span>   One of his sister's he wasn't exactly sure which one it was yet. He walked a bit further until he was close enough to hear them, but not enough to be spotted. Unfortunately that meant that he couldn't see which one of his sisters was talking. As he listened in on the conversation he found it a bit weird.<br>\r\n<br>\r\n  \"I can't believe this is happening to me!\"  He heard a woman's voice. <br>\r\n<br>\r\n \"You Can't believe it! That's stupid you know it's true. I am you and you are me.\" He heard the other voice which sounded similar to the first voice.<br>\r\n<br>\r\n  It was then that Mason realized that his sister must of discovered a power of her own as well. Eager to find out about it he goes into the kitchen and to take a look. Mason is surprised when he sees an exact duplicate of his sister...</span></div></div>",
            "created":1386554220,
            "id":1705124,
            "title":"Seeing Double?"
        },
        "155":{
            "author_id":"silvernights",
            "author_name":"Jeary",
            "choices":[
                "Telekinesis",
                "Kinetic Absorbtion",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Not Satisfied with those choices then what powers did Mason discover he had?</span></div></span></div>",
            "created":1357275600,
            "id":1501662,
            "title":"Other Choices"
        }
    },
    "info":{
        "author_id":"silvernights",
        "author_name":"Jeary",
        "brief_description":"A Family on Vacation gets knocked off a road and into a lake that gives them Superpowers.",
        "created":1357314540,
        "description":"<td align=\"left\" class=\"norm\"><div align=\"center\"><u><b>Basic Plot</b></u></div><br>\r\n<br>\r\n  The Basic Plot of this interactive is very simple. One day during the winter the Kelp family were taking there usual vacation. As they drove they heard police sirens and pulled to the side of the road. The car the police were chasing continued to evade the police and tried drifting pass the corner, where the Kelp family were stationed. The car while drifting hit the Kelp family car and it slipped off the road and into a lake. Fortunately no one from the Kelp family was hurt from the fall or the bump. What the Kelp family didn't know was that the lake was full of illegally dumped chemicals that would change them forever. In Short the chemicals of the lake gave each member of the family a Superpower. <br>\r\n<br>\r\n<u><b><div align=\"center\">Characters:</div></b></u><br>\r\n<br>\r\n  Each Member gains a superpower and you get to choose which power they get. Now it's time to introduce each member of the Kelp family.<br>\r\n<br>\r\n<b>Adam Kelp</b><br>\r\nAge: 43<br>\r\nHeight: 6' 2\" inches.<br>\r\nWeight: 190 lbs.<br>\r\nHair Color: Light Brown<br>\r\nEye Color: Blue<br>\r\nOccupation: Architect<br>\r\nBrief Description:  Adam Kelp is the Father of two daughters and one son, He is happily married with his wife. He was the one driving before the car fell into the lake. It was thanks to his quick reactions that his family was able to escape the incident unharmed.<br>\r\n<br>\r\n<b>Maria Kelp</b><br>\r\nAge:35<br>\r\nHeight: 5' 1\" inches<br>\r\nWeight: Don't Ask<br>\r\nHair Color: Blond<br>\r\nEye Color:  Hazel Blue<br>\r\nOccupation: Mother of Three Children<br>\r\nBrief Description: Maria Kelp is the wife of Adam Kelp, and mother of there children. She doesn't have a job mostly cause she tends to be taking care of the children most of the time. She was in the passenger seat, before the car fell into the lake.<br>\r\n<br>\r\n<b>Chelsea Kelp</b><br>\r\nAge: 16<br>\r\nHeight: 5' 4\" inches<br>\r\nWeight: 100 lbs<br>\r\nHair Color: Auburn Brown<br>\r\nEye Color: Green<br>\r\nOccupation: High School Student<br>\r\nBrief Description: Chelsea is the Eldest of Adam and Maria's children. As the oldest she didn't get away with much when she was a kid and is the most responsible of there children. She can tend to be a bit too bossy when asked to babysit her siblings though.<br>\r\n<br>\r\n<b>Katherine Kelp</b><br>\r\nAge: 12<br>\r\nHeight: 4' 5\" inches<br>\r\nWeight: 60 lbs<br>\r\nHair Color: Honey Blond<br>\r\nEye Color: Brown<br>\r\nOccupation: Junior High School Student( Some places refer Middle school as Junior High rather than Middle School.)<br>\r\nBrief Description: Katherine is the Second Oldest child, She is usually shy, and is often compared to her Older Sister Chelsea. Her relationship with her younger brother however is not the greatest. Mostly cause he constantly tries to invade her privacy and read her diary without her permission.<br>\r\n<br>\r\n<b>Mason Kelp</b><br>\r\nAge: 6<br>\r\nHeight: 3'3\" inches<br>\r\nWeight: 45 lbs<br>\r\nHair Color: Blond<br>\r\nEye Color: Blue<br>\r\nOccupation: Elementary School Student<br>\r\nBrief Description: Mason is the youngest of the children. He is often invading his Sister's privacy and annoying to them to know end in that. Despite that he has a close relationship with his Father and the Eldest sister. He tends to have a temper when someone tells a dumb blond joke though. Especially when it's about his sister Katherine.<br>\r\n<br>\r\nNote: More Characters May be added later if necessary. Right now it's just getting started so it's not really necessary.<br>\r\n<br>\r\n<u><b><div align=\"center\">The Rules:</div></b></u><br>\r\n<br>\r\nWith the main characters out of the way it finally comes down to the rules of the interactive. Don't worry they aren't too complex.<br>\r\n<br>\r\nRule 1: Each Family member must have a different power.<br>\r\nRule 2: If a family member is going to become Evil, make it reasonable.<br>\r\nRule 3: There Powers will grow as they use them.  <br>\r\nRule 4: They are not Omnipotent. In Short even with there powers they still have limits.<br>\r\nRule 5: Yes, they can gain new powers as there power grows. Just keep in mind Rule 1 when giving new powers.<br>\r\nRule 6:  No underage Sex. This doesn't mean the kids can't have relationships though.<br>\r\nRule 7: Have Fun Writing or Reading.<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":1911704,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1514075580,
        "modified":1514075580,
        "pretty_title":"The Kelp Family"
    }
}