{
    "chapters":{
        "1":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Man Wanting To Be Transformed",
                "Woman Wanting To Be Transformed",
                "Man Wanting To Transform Someone",
                "Woman Wanting To Transform Someone",
                "More Choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After the app finished downloading, you were ecstatic. You opened it up, and started to register an account as a</span></div></span></div>",
            "created":1576386000,
            "id":2760111,
            "title":"The App"
        },
        "11":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "19 Year Old Woman With Dyed Hair In Cosplay",
                "22 Year Old Sorority Sister",
                "30 Year Old Businesswoman",
                "32 Vice Principal Of Your Old High School",
                "45 Year Old Cougar With Huge Breasts"
            ],
            "content":"<div class=\"\"><div> <span>Your name was John, and you were ready to transform. You had been thinking about it for a long time, and it was finally the time that you were going to join in on the craze. Your older brother was telling you about his experience with his former teacher on there, being transformed into her dildo for a month, and you decided you wanted some similar thrills.<br>\r\n<br>\r\n Looking at the options, you decided to view the wish list of a</span></div></div>",
            "created":1576386000,
            "id":2760119,
            "title":"Man Seeking Woman To Change Him"
        },
        "111":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "A Six Inch Person, She Wanted a Shrunken Friend",
                "A Leotard For A Catwoman Costume",
                "A Nose Piercing",
                "Some Flip Flops",
                "A Realistic Sex Doll Version of Yourself"
            ],
            "content":"<div class=\"\"><div> <span>You looked at the girl with dyed blue hair and glasses, and decided that this young, nerdy girl might be a good match for you. She was wearing a Wonder Woman costume, standing at a convention of some sort in the profile, so you assumed she went to those kinds of things for fun. Clicking on the name under her photo, Amy, you were brought to a biography of the woman.<br>\r\n<br>\r\n She described herself as a nerd, and backed up your assumption that she went to conventions on different things quite often. She stated that she wanted company, often finding herself lonely, and that this was the best way of going about that. Below her self description there was a list of things that she wanted a man or woman transformed into, and looking over it you decided to pick</span></div></div>",
            "created":1576818000,
            "id":2762164,
            "title":"Nerdy Match"
        },
        "1111":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "\"In My Cleavage\"",
                "\"In Your Cage\"",
                "\"With The Others\"",
                "\"In My Fridge\""
            ],
            "content":"<div class=\"\"><div> <span>After picking the shrunken man option, you could do nothing but wait for the woman to hit you back with a response. Soon, she did, and you got an address to meet her at that night, apparently she didn't want any more time to pass before she had herself a tiny companion. You spent the rest of the day dreaming about what it was going to be like, looking out at the world once it was a lot larger than you.<br>\r\n<br>\r\n Soon, it became time to meet up with Amy, and you followed the navigation on your car to her apartment building on the other side of town. Getting out,  you made your way through the lobby, and up the elevator to the eighth floor where she lived. Finding her specific door, you knocked lightly, only for it to open almost immediately to the face of the pretty young woman. She wore glasses, her hair now dyed pink instead of the blue it was in the photos.<br>\r\n<br>\r\n \"You must be John!\" She says happily, before giving you a hug. This off put you slightly, but you embraced the woman nonetheless, before she broke it off and escorted you into her home. There was collections of all things nerdy around, different figurines from Star Wars, various video games and comic books lined the walls. \"Please sit down.\" She said, motioning for the couch in front of her television. You followed her instruction, sitting and waiting for further instructions.<br>\r\n<br>\r\n  \"So why did you want a shrunken person, if I may ask?\" You questioned the woman, interested in her reasoning.<br>\r\n<br>\r\n  \"Well, I've been kind of lonely recently, and nobody just wants to hang out with me, so I decided to spice it up a little bit on the app and ask for a little friend instead. It worked!\" She sheepishly said, with you shrugging it off. \"Now I have the app ready for my final confirmation, and if you would be so nice as to-\" You held up your phone and nodded in affirmation. She smiled as she opened her app and you did the same, both pressing the confirmation button.<br>\r\n<br>\r\n In an instant, you were transformed, painlessly, and now sitting on the couch cushion that was twelve times bigger. You looked up, staring at the woman in disbelief to her now giant size, or rather your tiny stature.<br>\r\n<br>\r\n \"It worked!\" She boomed over you, before the gigantic fingers on her hand plucked you from the cushion. She set you in her palm and brought you face to face, you staring at her billboard sized eyes. \"Now where will I put you?\" She says, before announcing she'll put you</span></div></div>",
            "created":1576818000,
            "id":2762186,
            "title":"Amy's Shrunken Friend"
        },
        "11113":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "You Learned Amy Likes To Roleplay",
                "Amy Has Another Victim Knocking At The Door",
                "Amy Prepares You All For A Convention"
            ],
            "content":"<div class=\"\"><div> <span>\"What do you mean others?!\" You cry out to your giantess, before she laughs.<br>\r\n<br>\r\n\"Oh, yeah, I forgot to tell you. I don't really need someone to keep me company, I'm a collector so to speak. I get you guys off of transformation tinder and then I add you to my collection. There's a big market for tiny collectibles after all, we trade at conventions all the time! Action figures and the like are kind of out of date at this point, so we dress up some people we catch online and deal them around. I already have the perfect outfit for you!\" She explained, much to your dismay.<br>\r\n<br>\r\n You had walked straight into this woman's trap, destined to be nothing more than something for her to display with a sense of pride, and it was all due to your lack of foresight that you stood here in her palm. She walked you through her apartment, before opening a door that was closed when you arrived, soon revealing it was to block your vision from the wall of shrunken people in her room, all of which were separated into glass cages which resembled more of a display case than anything else, divided by franchise of what doll costume she had slipped onto them.<br>\r\n<br>\r\n She sat down at a desk sitting next to the wall of people, and set you down on the cold wooden surface as she dug around in a few boxes as to find what outfit she would dress you up in. You looked at the wall, and nearly all of them were complacent with their place, minus a woman in the case labeled as 'Marvel Heroes' dressed up like Captain Marvel, who was banging on the wall in an attempt to get help from the obviously careless woman. Amy sat up after hearing one of the squeals the miniature woman let out, and got up to confront the shrunken woman.<br>\r\n<br>\r\n Reaching into the display case, she grabbed the woman, who fought tooth and nail against the clutches of Amy, but it was hopeless as the giant took her doll costume off, leaving the woman butt naked in the grip of the titan. <br>\r\n<br>\r\n \"Let this be a warning against acting up, I prefer my collection to be quiet.\" She said, before opening her mouth and dropping the screaming woman onto her tongue. She closed her lips after drawing her into her mouth, and swished her against the walls of her mouth as to show that she was still alive. Before long, she opened her mouth to show that the once feisty woman was now crying in defeat, sticking her tongue out to display her, before gulping the still living woman down her throat.<br>\r\n<br>\r\n Without saying another word, she slipped back into the chair and continued to dig through her costume stash. You waited, now a lot more timid from the display of power she had just given the crowd, not wanting to end up in the grumbling stomach where that poor woman now awaited her digestion into a body part of Amy. The giant bursted back up, her face looming over you as you felt the warm breath pour over your face.<br>\r\n<br>\r\n \"I told you I had a good costume for you!\" She cried, before bringing up a Batman outfit she no doubt pulled off of an action figure a while back. Without warning, her fingernails dug into the street clothes that you had worn into the place, tearing them off of your body with little effort given. You sat in your boxers as the fingernail of the giant gently pried even those off of you, leaving you bare naked and exposed to the elements. You were then pulled through the Batman outfit she had prepared for you, and sooner than later you were standing around dressed like a miniature Batman.<br>\r\n<br>\r\n  \"Perfect! You'll complete my DC collection!\" She yelped, happy at what she had done to you. You could do nothing but stand completely still as she snatched you and brought you to a container full of shrunken people dressed up like superheroes with the same terrified look on their face. You were dropped next to a woman dressed as Supergirl, and Amy walked away. <br>\r\n<br>\r\n Now that you were in the cage,</span></div></div>",
            "created":1576818000,
            "id":2762249,
            "title":"Others?!"
        },
        "114":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Dog",
                "Horse",
                "Pig"
            ],
            "content":"<div class=\"\"><div> <span>Picking your former Vice Principal was as risky as it was hot. Ms. Ishihara, was as straight-edged as they come. To students and faculty who followed the rules, she was kind, compassionate, and helpful.<br>\r\n<br>\r\nUnfortunately for you, you had <i>not</i> been one of those students. You and your friends were pranksters, messing with the diminutive woman whenever a chance presented itself. These pranks ranked from as harmless as taping her keys to the underside of her desk to as annoying as slipping a LOT of laxatives into her morning coffee and watching her squirm. The worst had been during an assemble: your friend ran up on stage as she was mid-speech, grabbed the waistline of her pencil-skirt and tugged down. It was tight, though, so he pulled even harder, ripping down her skirt AND panties. With her ass and snatch exposed, she turned and gave your buddy a swift, hard kick in the dick and an expulsion a few hours later.<br>\r\n<br>\r\nEntrusting your existence to someone who likely despised you only made it hotter, in your mind. Clicking down her list wish, you were shocked: the stuffy educator was *really* into animals: dogs, horses, and a load of farm animals. You never really considered becoming an animal, but change is change, right?<br>\r\n<br>\r\nAs you clicked one of the options, you couldn't help but hope she would remember you, if only to make things more interesting.<br>\r\nYou chose...</span></div></div>",
            "created":1576645200,
            "id":2761347,
            "title":"Remembering Ms. Ishihara"
        },
        "1141":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "You were transformed into a large dog and Ishihara was eager to screw",
                "You were transformed into a puppy and Ishihara wanted to play",
                "It's a trap! She transformed you into something else for revenge!"
            ],
            "content":"<div class=\"\"><div> <span>You decided to keep it simple with a dog. Turning into a horse was more dangerous than you'd like for your old vice principal, and turning into a pig was more dangerous <i>for yourself</i>. Stories of transformied people getting eating was bad enough, but you could very well end up sold to some farm or slaughterhouse. <br>\r\n<br>\r\nThankfully, it seemed Ms. Ishihara was as eager to start as you were; it only took a few minutes for her to respond to your wish list application. Further, she had even offered to meet tonight! A bit surprising, considering she was working the next day, but its not like regular hookups took more than a few hours, right? Her apartment wasn't that far from yours either, so after a shower and shave you popped out the door and made your way over. A mixture of fright and excitement made your heart begin to pound like a drum as you entered her building and arrived at her doorstep. <br>\r\n<br>\r\nThe door opened before you could even knock. Standing before you was the woman you had not seen for a few years, though the difference in her casual wear made it almost like meeting a new person. In place of her plain blouse and long skirt was a simple tank-top and a pair of shorts that showed her curves more readily. Her deadly wide hips were definitely more apparent and your eyes lingered on them as she spoke.<br>\r\n<br>\r\n\"You must John, right? I'm Sarah, come in,\" she said plainly.<br>\r\n<br>\r\n\"Yes Ma'a-, I mean, Ms. Ishiha-, Sarah. Sarah,\" you sputtered back.<br>\r\n<br>\r\nOne of her well-plucked eyebrows raised as she motioned you in. A selection of alcoholic beverages and some wine glasses had been set out, along with some moody music playing. <br>\r\n<br>\r\n\"Feel free to have a drink or two. Some guys like it better when they're drunk. I'm going to go change. Give your final consent on the app so I can activate the change while I'm doing that,\" she ordered.<br>\r\n<br>\r\nYou did just that, giving her permission to change you to her liking as you took shot after shot, trying to calm your nerves. Right as you went to take your third, you felt a crack of thunder rip through you. The change had begun, and...<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1576645200,
            "id":2761356,
            "title":"Ms. Ishihara's Guest"
        },
        "11413":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Cockroach",
                "Mouse ",
                "A Sock"
            ],
            "content":"<div class=\"\"><div> <span>The change is instant, painless, and not at all disorienting. With your mind as clear as it is, you can tell something is very, very wrong. You had agreed to become her dog, yet you were much smaller than any dog should be; you found yourself dwarfed by the table, its leg standing over you like an ancient Greek column. You even tried to move your body, but had trouble. Either your muscular system had changed drastically or you were simply immobile.<br>\r\n<br>\r\nBefore you could try and move more, Ms. Ishihara stepped back into the room. She had changed into a sheer negligee and a pair of stilettos. For the first time in your life, you could see her making a sincere grin. Her eyes were fixed on you.<br>\r\n<br>\r\n\"Well John, after making the first four years of my professional life a <i>living hell</i>, culminating in the most embarrassing two minutes of my life, an embarrassing two minutes that almost got me FIRED, you decided to come her and give yourself to me? Why? How <i>stupid</i> could you be?\"<br>\r\n<br>\r\nShe approached your frozen form, stabbing her heels into the carpet. You still couldn't move, but now it was from fear. Her titanic black shoes drew closer and closer, slamming louder and louder as they approached. They came to a stop only a few inches away from what you assumed to be your head as Ms. Ishihara's door alarm began to ring.<br>\r\n<br>\r\n\"Oh, the other match is here early. Sorry John, I'm done with you. I'm going to have some fun with an actual human, not a...\"</span></div></div>",
            "created":1576645200,
            "id":2761362,
            "title":"Ms. Ishihara's Trap!"
        },
        "114131":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Smash you like I do to other bugs",
                "Let you out like I do to other bugs",
                "Stick you in the tank in my bedroom"
            ],
            "content":"<div class=\"\"><div> <span>\"Not a cockroach,\" she said.<br>\r\n<br>\r\nThe revelation kick-started something inside your brain as your muscles moved your new body. All three sets of legs moved independently, which was a huge pain to maneuver, but that didn't really matter. Ms. Ishihara was still in control.<br>\r\n<br>\r\n\"I can't have my match think I live in a dirty apartment, you know? I have to deal with you.\"<br>\r\n<br>\r\nHer voice sounded consolatory, but her eyes were screaming a mix of malice and excitement.<br>\r\n<br>\r\n\"I guess I'll just have to...\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1576645200,
            "id":2761363,
            "title":"Transformed into a 'roach"
        },
        "1141311":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "content":"<div class=\"\"><div> <span>\"I guess I'll just have to smash you like I do to other bugs. Sorry John, but then again, I guess bugs don't really have names, do they?\"<br>\r\n<br>\r\nShe didn't wait for a response before she lifted her left foot high into the air. Not that you would have answered; you would have begged for your life. Screamed for mercy. But cockroaches don't have the vocal cords to speak. As her stiletto's shadow loomed overhead, you realized just how useless of a bug you really were. Hell, you were worse than your average bug. Bugs could actually USE their damn le-\"<br>\r\n<br>\r\nYour thoughts were cut off as Ms. Ishihara slammed her foot onto your helpless form, exploding it like an overripe melon. Your exoskeleton was flattened and your body reduced to a gooey mush. She slammed so hard the picture frames on the desk nearby tumbled over and the man downstairs woke up from his sleep. <br>\r\n<br>\r\nHearing the satisfying crunch of victory, your former Vice Principal dug her foot deeper into, rubbing what was left of you into the carpet. It would be harder to clean, but it was too good a feeling to pass up. Her crotch started to quiver as her own excitement mirrored yours from not ten minutes ago. Legs quaking, she went an invited her guest in, offering him the same drinks she had to you.<br>\r\n<br>\r\nThe man, notice the small stain on the floor, politely pointed it out.<br>\r\n<br>\r\n\"Oh, don't worry,\" Ms. Ishihara said, \"It was just a bug.\"</span></div></div>",
            "created":1576645200,
            "id":2761364,
            "title":"A Smashing End"
        },
        "1141313":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Do the Smart Thing and Stay Still",
                "Do the Smart Thing and Try to Escape",
                "Nothing as Ms. Ishihara's Moans and Cries Awaken Izzy"
            ],
            "content":"<div class=\"\"><div> <span>\"I guess I'll just have to stick you in the tank in my bedroom\", she said, bending down over your immobile form. She grabbed an empty glass and magazine from the table and slid them beneath you, trapping you in a prison of glass. Helpless, you were carried to her back bedroom to a tank outfitted with a heat lamp and packed with sand and fake logs. With a flick of her wrist your brown, wriggly body tumbled in and landed upon the warm ground.<br>\r\n<br>\r\n\"Try not to move too much,\" she advised. \"Izzy's usually asleep now, but if she wakes up she'll probably eat you. I'll come back for you once my dates over\".<br>\r\n<br>\r\nMs. Ishihara hurried out of the room, leaving you to ponder your next move. Was it even smart to make a move? The thin twigs you now called legs were finally starting to respond, but it was a risky endeavor.<br>\r\n<br>\r\nTo make matters worse, your captor came back a few moments later leading a Great Dane by a leash. The dog's knotted member was at full attention as she bent over the bed, hiking up her lingerie to expose her ass to him. The animal wasted no time in respond as he mounted her wide backside and plunged his swollen member into her. Ishihara let off a gasp of shock and pleasure as her companion's pumping began.<br>\r\n<br>\r\nDeep breaths and pleasured squeeks were all she could manage, but strangely enough your old Vice Principal kept her eyes focused solely on you. Her gaze never left your buggy figure as her and her partner kept at it. Trying to ignore their throws of passion, you decided to...</span></div></div>",
            "created":1577163600,
            "id":2764163,
            "title":"Ms. Ishihara's prisoner"
        },
        "11413131":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Mouse",
                "Yourself, But Small",
                "A Living Gingerbread Man"
            ],
            "content":"<div class=\"\"><div> <span>For the first time in your life you decide to listen to your former Vice Principal and, shockingly, it went well. You managed to avoid getting devoured and all it cost was fifteen minutes of watching Ms. Ishihara get railed by a dog. <br>\r\n<br>\r\nHer inter-species encounter came to an end before long and few taps on her phone later and the dog was turned back into a man. With a parting kiss she sent him out of the room (and the apartment, presumably) leaving the two of you alone again. Her hair a mess and her mascara running, she stumbled limp over to your prison and placed her ass on the edge of the table holding it. Leaning over the open top, she began to speak, but you were more focus on her gigantic ass and the thick white semen dripping out of it.<br>\r\n<br>\r\n\"Good job, roach. You actually managed to listen to me for once,\" she congratulated. \"Keep this up and I <i>may</i> just return you to normal. For now, though, you've at least proven you're better than a mindless bug.\"<br>\r\n<br>\r\nShe lifted up her phone yet again and opened the app. <br>\r\n<br>\r\n\"You've been promoted to...\"</span></div></div>",
            "created":1577250000,
            "id":2764242,
            "title":"Still and Safe"
        },
        "11413132":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Change Ishihara",
                "Change her partner",
                "Change them both"
            ],
            "content":"<div class=\"\"><div> <span>You were well aware that Ishihara wasn't going to let you go easy, if at all. Getting to a phone and changing back was your only way out of this mess.<br>\r\n<br>\r\nHer staring left little opportunity for escape, but as the canine's thrusts got harder and harder your captor's attention was pulled further and further away. In act of true roleplay, the dog firmly bit into the back of her neck as he plunged his knot in deeper than ever. She screamed in ecstasy, eyes held shut.<br>\r\n<br>\r\nIt was your best chance. Focusing as best you could, you managed to scramble your new legs across the sand and towards a decorative rock. Climbing to the top, you readied your legs and jumped with more force than you thought possible. You quite literally fly out of the cage as wings fluttery on your back, guiding and gliding you safely to the base of her bed. With two giants thrusting harder than before, you make it to the two phones sitting beside the bed.<br>\r\n<br>\r\nThe phones are unlocked, making your job all the easier. You punch in the command to undo and soon enough your back to normal, nude albeit. The two above fail to notice you; Ishihara is close to climax, judging by her moans.<br>\r\nWith both devices at your command, your see a real opportunity. Ms. Ishihara's profile could be modified, allowing you to humiliate her yourself. On the other hand, you could change her partner in someway, turning this pleasure into torture.<br>\r\n<br>\r\n  </span></div></div>",
            "created":1581776580,
            "id":2787597,
            "title":"Human and in Control"
        },
        "1143":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "A PIg, She Wanted To Bang",
                "Bacon, She Knew Who You Were",
                "A Vibrator, She Didn't Actually Want A Pig",
                "A Pig Girl, Obedient To Her Command"
            ],
            "content":"<div class=\"\"><div> <span>After matching with your former Vice Principal, you had to admit you were a little bit nervous, but now that you saw she wanted something as weird as a pig, you lost any shield of unease which might have held you back, deciding this would be a hell of a story.<br>\r\n <br>\r\n You talked to Ms Ishihara over the chat feature, and it seemed she was clueless about who you truly were. One thing lead to another, and sooner than you knew it you were in the car outside of her large house in the suburbs. You were anxious that was for sure. What was going to happen to you? What did it feel like to be transformed? Why is everyone doing it? You shook it off, opening the door and heading for the front door.<br>\r\n<br>\r\n After a few knocks, you were greeted by the much more casually dressed former staff member of your high school. She sported a smile and a low cut shirt, along with shorts displaying her middle aged thick ass.<br>\r\n<br>\r\n \"You must be John!\" She opened, hugging you. \"Make your way inside, I'll transform you then, don't want the neighbors thinking I'm weird.\" She laughed, shutting the door behind you. As you settled down in her living room, she brought out the app. \"I'm doing it now!\" She exclaimed, as you soon transformed into <br>\r\n</span></div></div>",
            "created":1579933860,
            "id":2778094,
            "title":"Pigging Out With The VP"
        },
        "115":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Transformed him into more liquer ",
                "Aged him into dust",
                "Fattened him well into immobility"
            ],
            "content":"<div class=\"\"><div> <span>Lizzie was her name, a fact your nearly missed due to her provocative profile pic. The blonde was sporting an absolutely massive pair of jugs; J-cups, if her bio was to be believe. Real, natural, and Pre-Transformation Tinder. A quick run through of her photo album seemed to confirm this, judging from a few photos dating back to her twenties. They had been a bit smaller back then, but still large enough to dwarf most other girls.<br>\r\n<br>\r\nEven better that her rack was her wishlist: \"Whatever you want ;)\".<br>\r\n<br>\r\nShe seemed a lot more open than the others on this site, but you supposed that made sense; with the proliferation of transformation tech, Lizzie's hefty bosom was becoming more and more common. She wasn't so special anymore. And perhaps for that reason she responded almost instantly to your match, inviting you over that very night.<br>\r\n<br>\r\nYou couldn't say no and a few hours later there you were, standing in Lizzie's living room. The woman herself was seated on the couch, wearing a simple pair of pink pajamas. She was sipping on a bourbon and judging from her speech, already a bit drunk.<br>\r\n<br>\r\n\"So, I was thinking,\" you said, \"maybe we could start with a dildo thing and move from there?\"<br>\r\n<br>\r\n\"Thaaaaanks for coming,\" she sputtered out, \"buuuuut I lied. We're gonna be doing something else, cutie\".<br>\r\n<br>\r\nBefore you could protest, Lizzie pulled her phone from her lap and tapped something into the program. Suddenly, a flash, and you lost consciousness.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nYou awoke sometime later, shrunken and sitting with about twenty other men on top of a dresser. Stripped down completely, you instinctively covered your junk as a booming voice laughed above.<br>\r\n<br>\r\n\"Puhleeesh, I've alreaaady seen yer little stuff, little man,\" Lizzie laughed.<br>\r\n<br>\r\nOne of the other men, far angrier than you, jumped up and started screaming his head off. He launched all sorts of insults at your captor, attacking her weight, her drunkenness, and age, among other things. As you might expect, she didn't take it well.<br>\r\n<br>\r\n\"We were gunna have ffffun, idiot, but since you c'mplain soooo much...\" she said as she...</span></div></div>",
            "created":1577682000,
            "id":2767262,
            "title":"Lizzie the Cougar"
        },
        "1151":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Scale her tits",
                "Touch her uvula without falling in",
                "Play Hide and Seek"
            ],
            "content":"<div class=\"\"><div> <span>Plucking the helpless man between her dagger-like nails, the giant woman dragged him over to a pair of shot glasses sitting on the next counter. He landed softly on the glass, his light weight preventing any real damage, but found himself unable to escape; the glass was simply too sheer to surface. <br>\r\n<br>\r\n”Wellll, I dont really caaaare what you think, but ssssince you are soooo obssessed with my drinking, how's 'bout you help?\" she joked as she entered another transformation into her phone.<br>\r\n<br>\r\nThe man, desperately pounding against his glass prison, melted away in an instant. Like an ice cube tossed into a deep-frier, his human form dissolved away, breaking down into a caramel-colored liquid. No trace of the man was left and even the liquor he had become was soon disappeared down Lizzie's gullet. With a deep breath, she swallowed, sending him down to be with whatever else she had been drinking.<br>\r\n<br>\r\n\"Oh fuck,\" she said between coughs, \"he was bitter assss hell! I'm glad he ain't gonna be in our game.\"<br>\r\n<br>\r\nThe game, Lizzie would go on to describe, was simple: they were all competing to be transformed back to normal. Each round, they'd have to complete a certain task, and the biggest loser would be subject to a humiliating punishment. The other losers would be as well, but less so. This usually involved transformation, but not always so.<br>\r\n<br>\r\nThe men were a mixture of horrified and angered, with you more in the first category. How you felt didnt really matter, though, as Lizzie declared your first challenge. You were to...</span></div></div>",
            "created":1577757300,
            "id":2767267,
            "title":"Drunk On Power"
        },
        "11512":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Succeeded!",
                "Slipped and Fell!",
                "Attempted to Strike at One of Her Cavities!"
            ],
            "content":"<div class=\"\"><div> <span>With a ringmaster's gusto, Lizzie announced the first game.<br>\r\n<br>\r\n\"We're gunna play a liiiitle game called cave explorer! You guys are gunna climb into my mouth and try 'n touch my uvula. Sounds easy?<br>\r\nWell think again, 'cuz I'mma be movin' my tongue and jaw and stuff. If y'all aren't careful you gonna fall doooooown! And for those of ya who get swallowed, don't worry, I prepared!\"<br>\r\n<br>\r\nLizzie took a deep breath arched her back, pushing her tummy as far out as it could go. You were too distracted to notice before, but it was a lot more... bloated than it had been when you first arrived. Her fingers dug into it, making no progress at all: her stomach was stuffed and as hard as a rock.<br>\r\n<br>\r\n\"Before you guyz all woke up I chugged like four cartons of this heavy cream, which was liiiiike 10,000 calories? Plus all the booze I've been knockin' back! So like, I'm gunna put on a few pounds, but its okay, 'cuz it ALWAYS goes to my boobs. And since I took it already, anyone who falls down is gonna go straight to my chest! Talk about a happy endin', right?!\"<br>\r\n<br>\r\nYour heart was pounding just thinking about such an end, but Lizzie's expression was one of true triumph. This dumb bimbo really thought she was doing you all a favor. The sincerity of her smile only made you more and more nervous as she bent down, placing her lower lip level to your platform. Opening her maw as wide as she could, a wave of boozy breath washed over you. It was enough to make you vomit, but you held on.<br>\r\n<br>\r\nA man toward the back pushed his way through the crowd, stepped past the puddle of drool and climbed in to that wet cavern. No one could see what was going on from your spot, but a few tense moments later and her emerged, sticky and wet.<br>\r\n<br>\r\n\"Gooooood job!\" Lizzie announced, \"now who's next? Y'all should hurry, 'cuz I play with my food when I get bored...\"<br>\r\n<br>\r\nThe next few men went, each completing their goal, and it wasn't until the fifth man that someone finally fell. A horrified shriek echoed from Lizzie's mouth, followed immediately by an exaggerated gulp. The last you'd see of the man was of a throat bulge going down, down, down.<br>\r\nLizzie, every the joke-ster, followed up with a well timed burp.<br>\r\n<br>\r\nSeeing a man meet such a horrific end should have paralyzed you, but instead you found yourself motivated to get it over with. You were the next to go, and as it turned out, you... </span></div></div>",
            "created":1577937780,
            "id":2768083,
            "title":"Lizzie's First Challenge"
        },
        "115121":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "1v1",
                "Her Pleasure",
                "Cook Off",
                "Fabulous",
                "Ass Trek"
            ],
            "content":"<div class=\"\"><div> <span>You peered into the cavern of the this deceitful woman's mouth, looking at the wet tongue that served as a carpet to the hallway of her jaw, extended for her tiny challengers. Lizzie held a smile despite her split lips, drunkenly looking down at you as you started your run into the cave.<br>\r\n<br>\r\n You pressed down on the wooden surface of the platform you were set on, and grew faster and faster before you made your way into the abyss. It was humid, with your bare feet pressing down against the moist floor, soaking your lower body with spit, before your upper body soon became wet as well due to the dripping saliva from the roof of her mouth.<br>\r\n<br>\r\n The uvula was in sight as the MILF sat as still as she could, and you jumped up to try and reach it. You slapped it with one hand before falling back onto the ground, but you couldn't land cleanly due to the slick nature of her tongue. Your feet slipped, and you fell onto your belly as the tongue of the woman started to lift up. You were now sliding at an increasing rate down the throat, but managed to get a hand to grab the soft muscle of her tongue.<br>\r\n<br>\r\n Miraculously, you were able to stand back up and sprint out Lizzie's mouth, jumping in between a small gap in her lips before rolling onto the wooden platform, back to safety. The giantess now had her eyes shut as she released a large gulp, surprised she didn't send you down to her belly do inevitably digest into breasts. Opening her eyes, she peered down at you, still soaked in her spit and smiled.<br>\r\n<br>\r\n \"That was quite a performance.\" She laughed, tipsily standing up before letting the final few tinies commence their journey. The first man jumped into her mouth, expecting to complete the challenge with ease, but as soon as he lay foot on her tongue, the giantess slammed her teeth shut, sending the man to his death with a single swallow.<br>\r\n<br>\r\n \"Oops.\" She giggled, before the rest of the tiny contenders went through with the challenge. By the end of it, half of the contenders were already eliminated, Lizzie rubbing her stomach before giving off a burp, much to the dismay of you and your comrades, the stench of booze being let off right in your faces, surely a hint of human in there somewhere.<br>\r\n<br>\r\n \"Ok.\" Lizzie started. \"Alright guys, the next challenge has been decided.\" She giggled, stumbling back and forward. \"You guys are gonna\" She then announced the next challenge to be<br>\r\n<br>\r\n 1. 1v1 - You are all split into two, and come up with a transformation for your partner. The most creative idea wins, and the loser is transformed.<br>\r\n<br>\r\n2. Her Pleasure - First to make her orgasm is the winner, the losers will be punished.<br>\r\n<br>\r\n3. Cook Off - Lizzie makes you all fight over a pot of boiling water, full of ingredients for a tiny man stew.<br>\r\n<br>\r\n4. Fabulous - There is a fashion show with doll's clothing, loser is transformed into actual clothes.<br>\r\n<br>\r\n5. Ass Trek - Whoever makes it furthest in her asshole wins, last place is transformed into anal beads.<br>\r\n</span></div></div>",
            "created":1578202440,
            "id":2769471,
            "title":"Moving On"
        },
        "1151215":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Nobody, You Won!",
                "One Guy, Second Place ",
                "Everyone, you were in Last Place"
            ],
            "content":"<div class=\"\"><div> <span>Without saying anything else, an idea clearly came into Lizzie's mind, and she gathered all of the remaining contestants in this game that she had orchestrated. You were sitting in the palm of her hand looking at your right and left, seeing all the other men that were unfortunate enough to be tricked by this monster of a MILF, as she walked into her bathroom, and set all of you down on top of the closed toilet bowl.<br>\r\n<br>\r\n \"Ok guys, so this one might get messy.\" She laughed, the only one in the room doing so, given the threat of death or even worse. \"So, let me get out of these and I'll explain it.\" She said, before stripping everything south of her belly button off of her body. You all stared at her well kept vagina, amazed at it's beauty. She must have noticed, because she stepped in saying \"Oh, don't you guys get the wrong idea. You're not going in there. This game is simple, whoever makes it the deepest will be done with the game entirely, the rest of you not so much.<br>\r\n<br>\r\n Confused, you all looked around for what she meant by going the deepest, but it was soon answered as she turned around and got onto her knees, giving everyone on top of the bowl a great look at the massive at normal size ass that was spread open, the pulsing anus being set right on top of the bowl for everyone to get inside. After a quick second of looking around in fear, you were the first to decide that you needed to win. Without hesitation, you started to run towards the asshole, and stuck your entire head and torso inside of her.<br>\r\n<br>\r\n It smelled like ass, which was a given, mainly to the fact that you were inside of an asshole, but you kept crawling through the slimy intestinal tracts of Lizzie, where you saw by the light that came in every once and a while that a new challenger had entered the arena, and was going for first in the colon of the cougar.<br>\r\n<br>\r\n  It was hot, wet and smelly, but you fought nonetheless. There was no way that you were going to end up as nothing but fat on this woman, or something that she might pull out of her sex toy drawer when she was feeling frisky. Then, she blew a whistle of some sort, nothing that was crazy, but you could hear it from inside of her.<br>\r\n<br>\r\n She then reached her fingers into her ass, and started pulling out tiny men one by one. There was nothing you could do but sit and wait as she eventually got to you, and threw you with the rest. The only question was, who was in front of you?</span></div></div>",
            "created":1581811800,
            "id":2787897,
            "title":"Ass Trek"
        },
        "12":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "21 Year Old Shy Looking Girl",
                "26 Year Old Chubby Woman",
                "31 Year Old Housewife",
                "35 Year Old Stripper",
                "49 Year Old Nurse"
            ],
            "content":"<div class=\"\"><div> <span>Your name was Holly, and you were a young woman who had forever desired to be transformed into the possession of another woman, and today being your eighteenth birthday presented an opportunity to finally live out the wish. Since discovering transformation was a thing, you would pleasure yourself to it and it's related content online, but now the chance to become an object was here, and transformation tinder was finally downloaded to your phone.<br>\r\n<br>\r\n You decided to browse the wish list of a</span></div></div>",
            "created":1576386000,
            "id":2760122,
            "title":"Woman Wanting To Be Transformed"
        },
        "122":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Thong, This Woman Needed Some Clothes",
                "Gummy Bear, Give Into Her Sweet Tooth",
                "Vibrator, Satisfy Abby's Womanly Needs",
                "Cat, Abby Needed An Obedient Pet",
                "IPhone? This Woman Was Looking For a Free Phone!"
            ],
            "content":"<div class=\"\"><div> <span>Catching your eye was a brunette woman in her mid twenties, with quite a bit of pudge on her body. You wouldn't describe her as fat, but she was by no means skinny compared to the average woman. You had no problem with that, so you decided to browse what this woman named Abby wanted.<br>\r\n<br>\r\n On her profile, she described herself as your prototypical woman in her twenties, working from home as a blogger for a food related website. She did say that she mainly used the app to get people to change themselves into different kinds of food, but gave away that she was willing to transform people into other things besides food. <br>\r\n<br>\r\n You browsed her wishlist, and decided to transform into a</span></div></div>",
            "created":1576818000,
            "id":2762293,
            "title":"What Does The Chubby Woman Want?"
        },
        "123":{
            "author_id":"tj1987",
            "author_name":"AlittleDisturbed",
            "choices":[
                "Shrunk to an inch tall, Gloria wants to be a goddess. ",
                "A vibrator, Gloria needs real pleasure for once. ",
                "A pair of sandals, Gloria wants to walk all over you. ",
                "An ant, Gloria wants to gawk at you in an ant farm",
                "A bottle of beer, Gloria wants to send you through her body"
            ],
            "content":"<div class=\"\"><div> <span>The profile of a housewife named Gloria caught your attention. Scrolling through her pictures you saw she was little chubby, but far from fat. She was a brunette with blue eyes, a row of freckles across her nose. You thought she was very cute. <br>\r\n<br>\r\nHer bio said that she was bored in her marriage and wanted someone to have fun with. She enjoyed the idea of being dominant, something she rarely got to be in her daily life. She wanted someone she could have total control over. <br>\r\n<br>\r\nYou're excited to have found exactly who you want to own you. You scan quickly through her wish list and decide that you like to be.....</span></div></div>",
            "created":1586306460,
            "id":2815166,
            "title":"31 Year Old Housewife"
        },
        "1231":{
            "author_id":"tj1987",
            "author_name":"AlittleDisturbed",
            "choices":[
                "Let's start with you kissing my toes.\"",
                "How about I squash you like a bug.\"",
                "You join my husband and I for some fun.\" "
            ],
            "content":"<div class=\"\"><div> <span>As soon as you matched on the app Gloria send you an address for a motel. You didn't hesitate to drive there to meet her. You practically job up the stairs to her room and knock on the door. <br>\r\n<br>\r\n\"It's open.\" A smooth feminine voice calls out. <br>\r\n<br>\r\nYou push the door open to see Gloria sitting on the edge of the bed. She was even more beautiful in person. Her dark hair framing her round face. Piercing blue eyes staring into you soul. She was dressed casually in a gray camisole, with denim shorts that fit her figure well. <br>\r\n<br>\r\n You scanned down her shapely legs to her bare feet. You could only describe them as perfect. Her slender toes were painted a bright coral. She flexed her feet intentionally casually, causing you to blush. <br>\r\n<br>\r\n\"You must be Holly.\" She said in an angelic voice, without standing from her seat.  <br>\r\n<br>\r\n\"Y-y-yeah. I'm very excited. Sorry.\" You quickly stammer out. <br>\r\n<br>\r\nShe laughed, and flashed and adorable smile at you. \"It's okay. I'm glad you excited to be a tiny toy.\" She said as she raised her cell phone. \"So, if you're ready,  please hit confirm.\" <br>\r\n<br>\r\nYou shakily pull out your phone, and open the app. With a deep breathe you press confirm. instant your body dwindled down to a mere one inch height. <br>\r\n<br>\r\nGloria finally stood, looking down at you with a beaming smile. \"Amazing. Thank you.\" She said taking a step towards you. <br>\r\n<br>\r\nEven with her massive bare feet coming closer and closer to you, you didn't move. You just stared at every inch of her and tried to take in just how much a goddess she was compared to your tiny self. <br>\r\n<br>\r\nShe stopped with her toes directly in front of you. \"So little girl, where she we start first ?\" Gloria asked. <br>\r\n<br>\r\nTapping her chin for a moment she finally answered. \"Ah, I know......</span></div></div>",
            "created":1586477640,
            "id":2816363,
            "title":"Shrunk to an inch tall, Gloria wants to be a go..."
        },
        "12312":{
            "author_id":"tj1987",
            "author_name":"AlittleDisturbed",
            "choices":[
                "Eat you. ",
                "Abandon you here. ",
                "Sell you to a hooker"
            ],
            "content":"<div class=\"\"><div> <span>At first you thought Gloria was joking around. Until she raised her perfect barefoot above you. You were granted an amazing view of her shapely sole. It was free of callouses, and wrinkled as she scrunched it. <br>\r\n<br>\r\nAs it lowered down towards you your survival instincts took over your body. Before you realized it you were running. Gloria's enormous foot slammed down right where you were standing. You stumble backwards and fall down from the impact. <br>\r\n<br>\r\n\"What the fuck do you think you're doing little bug?!\" Gloria growled out, and angelic voice gone. \"You're mine. I own you. If I want to splatter your pathetic body under my foot I will.\" <br>\r\n<br>\r\nDespite her trying to stomp on you, you're upset that you angered Gloria. You agreed to be shrunk and used by her however she wanted. Feeling bad you pushed to your feet and walk over to her wiggling toes. <br>\r\n<br>\r\nYou lay down in front of her and wait for her foot to raise. She looks down at you with a raised eyebrow. Bringing her foot into the air above you she stomps down with force. <br>\r\n<br>\r\nTo your shock you're still alive. Had she chosen not to crush you under her foot ? \"You're not getting off that easy. You don't deserve to be squashed by my foot!\" She growls down at you. <br>\r\n<br>\r\n\"Instead, I'm going to....</span></div></div>",
            "created":1586562780,
            "id":2816904,
            "title":"How about I squash you like a bug.\""
        },
        "123122":{
            "author_id":"tj1987",
            "author_name":"AlittleDisturbed",
            "choices":[
                "The cleaning lady. ",
                "Your mom",
                "Your best friend Megan"
            ],
            "content":"<div class=\"\"><div> <span>You stare up in shock as Gloria gathers her belongings and stomps off towards the door. \"You shouldn't have come here if you weren't fully committed. Good luck with your pathetic new life Holly.\" She sake coldly before slamming the door behind her. <br>\r\n<br>\r\nIn an instant there was only silence. You couldn't believe how poorly this turned out. You wanted to be owned by a beautiful woman, to be her possession. \"Way to fucking go Holly!\"  You said, cursing yourself. <br>\r\n<br>\r\nStuck at an inch tall you had no idea what to do. The only person in the world that knew you were here just abandoned you. You phone suddenly vibrates, and you realize it shrunk with you. You quickly snatch it from your pocket. <br>\r\n<br>\r\nThe vibration was a notification from the app. Gloria had given you a negative rating. You groaned and tried to decide who it was best to call for help. <br>\r\n<br>\r\nYou tried to call your mom, but your signal was too weak. You tried texting but it didn't go through. Eventually you realize the wifi is working and you send quick messages to several people. You couldn't afford to risk relying on a singles person. <br>\r\n<br>\r\nBefore anyone can reply your phone dies. you want to cry. \"Un-fucking-belivable!\" You scream before shoving your phone back in your pocket. <br>\r\n<br>\r\nThankfully you included the motel address in your messages. With no other options you wait to see who, if anyone shows up to rescue you. <br>\r\n<br>\r\nAfter thirty minutes the door know starts to turn. Excitedly you stand and rush forward. As the door swings open you see....<br>\r\n<br>\r\n</span></div></div>",
            "created":1586831640,
            "id":2818502,
            "title":"Abandon you here. "
        },
        "1231221":{
            "author_id":"tj1987",
            "author_name":"AlittleDisturbed",
            "choices":[
                "Keep youas a tiny foot slave. ",
                "Give you to her granddaughter. ",
                "Return you to your Mom. "
            ],
            "content":"<div class=\"\"><div> <span>Unfortunately you did not recognize the woman entering the room. She is a chubby Hispanic woman, in her late 50's. Her graying hair pulled back out of her round face. Her feet clad in well worn leather sandals. <br>\r\n<br>\r\nAs the woman moves into the room you see her maid's cart outside. You figure she must be one of the motel's cleaning staff. She was moving directly towards the bed, and you. <br>\r\n<br>\r\nYou barely manage to dive out of the way of her foot as it falls. You see it is nothing like Gloria's perfect foot. Instead it is rough, unkempt, with short, meaty toes. Without question not a foot you want to be crushed by. <br>\r\n<br>\r\nBy time you recover the woman has stripped the bed of linens. You watch as she turns back towards the door. You push to your feet and run to avoid her feet. As the giantess stops you realize your efforts may have caught her attention. <br>\r\n<br>\r\nLooking back you see her eyes scanning the ground, her brows knit together in confusion. Unsure if you should run or stop, you hesitate. In that moment she locks onto you. \"Insecto.\" You hear her groan. <br>\r\n<br>\r\nShe dumps the linen on the ground before stomping over towards you. You run, but she can cover so much more ground. Her sandal clad foot falls in front of you. The smell of leather, and sweat waft into the air  <br>\r\n<br>\r\nYou scurry backwards only for her foot to sweep sideways. The impact sends you tumbling across the carpet. She's back on you quickly, her foot raised in the air. <br>\r\n<br>\r\n\"Stop! Please! I'm human!\" You scream. <br>\r\n<br>\r\nShe suddenly hesitates. Lowering her foot she looks closer before reaching for you. Her rough, calloused hand plucks you up effortlessly. Looking down at you in her palm she decides to......</span></div></div>",
            "created":1587432840,
            "id":2821872,
            "title":"The cleaning lady. "
        },
        "13":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "A Latina Girl Who Wanted To Be A Shrunken Person (Weird)",
                "Some Slutty Girl Who Wanted To Be A Pocket Pussy",
                "A Punk Girl Wanting To Be A Cock Ring",
                "A Fat Girl Wanting To Be a Marshmallow ",
                "An Arabic Woman Wanting To Be A Living Sex Doll"
            ],
            "content":"<div class=\"\"><div> <span>You were Rick, a twenty three year old stockbroker, and you had just gotten convinced by some friends from work to download the app. One of them was telling you about a girl who spent time as his underwear, and it felt like he had someone hugging his nuts all day, so you thought you'd get in on that action. <br>\r\n<br>\r\n Looking down at the women who wanted to transform, you decided on</span></div></div>",
            "created":1576472400,
            "id":2760194,
            "title":"Man Wanting To Transform Someone"
        },
        "134":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "Making her animate and playing with her",
                "Eating her (promise be damned)",
                "Feed her to someone or something else (Not technically a betrayal)"
            ],
            "content":"<div class=\"\"><div> <span>Looking past the pocket pussies and sex doll requests, you found your attention drawn to a rather peculiar request: marshmallow. The requester was a girl half as wide as she was tall and a face softened with fat. Claire was her name, and according to her bio she was a former track athelete who had been coaxed into becoming a gainer by her former boyfriend. She loved how soft her body was and figured the only way to get it even softer was through a full-body transformation. <br>\r\n<br>\r\nYou weren't quite sure why that grabbed your attention, but one swipe and a few days later and there she was in your apartment, ready for a change. Following the instructions on the app, you were able to work your way through the settings with ease; with a single press, Claire would be reduce to nothing more than a squishy ball of white fluff. There were other options (such as changing the size of the marshmallow, whether Claire could feel or not, etc.) but to start you decided it best to keep it simple.<br>\r\n<br>\r\nWith the rotund girl standing in your camera's sights, you pressed the button. In a blink of an eye she was gone, nothing left but a pile of clothes and a marshmallow small enough to fit in your hand. As you picked it up, her only request echoed in your head: \"You can do whatever, but please don't eat me!\".<br>\r\n<br>\r\nYou pulled at the stuff, stretching its rectangular shape into a thin string before smushing it back down into a hard little ball. Could she feel this? Did it hurt or was it pleasant?<br>\r\n<br>\r\nThose and other questions passed through your mind. Ultimately, though, you got bored pretty quick before...</span></div></div>",
            "created":1576558800,
            "id":2761017,
            "title":"Marshmallow Girl"
        },
        "1342":{
            "author_id":"learngerman",
            "author_name":"LGV",
            "choices":[
                "The Latina Who Wanted To Shrink",
                "An Asian Who Wanted To Be Utterly Dominated",
                "A Med-Student Who Wanted To Become A Bimbo"
            ],
            "content":"<div class=\"\"><div> <span>The more your rubbed the little white mass between your fingers and palms the less you saw it as alive. Even if Claire's consciousness was there (you didn't remember disabling her thoughts) she was by all accounts nothing more than a thing at this point. A ball of sugar and who knew what else. The blubberball you had matched with was no more; in her place was this thing.<br>\r\n<br>\r\nPerhaps that's why you found it so easy to break your promise. You tossed the marshmallow in your mouth, rolling it around your tongue and mashing it a bit between your molars. It soon lost its shape, sticking to your teeth and breaking up into each small pieces. With a saliva-filled gulp you brought the remains down, sending what was Claire to be digested by your gut. The girl wasn't even filling; at her size, she likely didn't even exceed ten calories.<br>\r\n<br>\r\nSlumping onto your couch, you slipped one hand into your pants, tending to the stiffy you had sprung. You had never expected domination to be so fun. Wanting more, you used your other free hand to reopen the app and start a search anew for a partner. The girls from earlier were mostly gone, but one remained among the new choices: the weird latina girl. Ultimately, you chose...</span></div></div>",
            "created":1576645200,
            "id":2761023,
            "title":"Marshmallow Snack"
        },
        "14":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Your Coworker! She Wants to Be a Bra!",
                "An Innocent Looking 18 Year Old Girl Wanting to Be a Tongue Stud",
                "Your Own Aunt, Wanting To Be a Vibrator",
                "Some Creepy Guy Wanting to Be a Shoe",
                "A Drunk Looking College Guy with only the words 'six inches' Typed"
            ],
            "content":"<div class=\"\"><div> <span>You were Julie, a twenty eight year old waitress, and you couldn't wait to own somebody. One of your coworkers had gone on a leave while they were being transformed, and you thought that you might be able to find them on the site, but now you could go for any of the people who wanted to be something.<br>\r\n<br>\r\n You look at the options, and decide to pick yourself up</span></div></div>",
            "created":1576472400,
            "id":2760196,
            "title":"Woman Wanting To Transform Someone"
        },
        "141":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Bra, Like You Agreed",
                "Barbie Doll Version Of Herself",
                "Cigarette",
                "Butt Plug",
                "Cucumber"
            ],
            "content":"<div class=\"\"><div> <span>You immediately jumped to action when you saw the woman who made you download this very app in the first place. It was none other than your fellow waitress Mia, and she had herself listed as wanting to become nothing but a bra, something you were willing to entertain. Luckily she was down to let you be the one transforming her, and in no time you had both agreed to meet up at your apartment.<br>\r\n<br>\r\n You changed into nicer clothing, jeans to wear around your waist and a tank top to expose the cleavage that Mia thought she was soon to be wrapped around, a little teaser for her. The clock seemed to linger, taking forever to tick as you contemplated the scenario that was about to go down.<br>\r\n<br>\r\n Just then, you heard a knocking on your front door, to which you sprung up, shaking off any jitters you may have had. When you opened the door, there was a gorgeous young woman, surely at least five years younger than you. She was on the chubbier side, but her beautiful brunette hair and wide hips made her still quite a catch for most men.<br>\r\n<br>\r\n \"Julie! I never expected to see you on the app.\" She said, hugging you firmly, catching a good look at your open cleavage.<br>\r\n<br>\r\n \"Oh, well you know, never count anyone out on something as fun as this.\" You responded, giggling a little bit at her unawareness that she was the reason you had set this up in the first place.<br>\r\n<br>\r\n \"Well let me know when you want to get started. I can't wait to get wrapped around those tits!\" Mia said laughing. You shut the door as she walked further into your home, before you pulled out your phone and opened up the app. When you opened it, you realized that there was a place for you to enter anything for her to transform into instead of just the bra she had wanted to be.<br>\r\n<br>\r\n Thinking over it for a second, you pressed keys on your phone until Mia transformed from a gorgeous woman, into a</span></div></div>",
            "created":1577946720,
            "id":2768133,
            "title":"Familiar Face"
        },
        "1413":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "A Man Wanting To Become A Statue Of Some Sort",
                "An Older Woman Who Thought This Was A Dating App",
                "A Man Flaunting His Wealth, Wanting To Be Dominated",
                "A Shy Asian Girl, Wanting To Become Food",
                "A Nerdy Looking Guy, Wanting To Be With A Woman "
            ],
            "content":"<div class=\"\"><div> <span>Deciding you needed a smoke, you set it so that objects would retain their ability to communicate with their new owners, and quickly pressed down on the transform button. The excited coworker standing in front of you was soon dwindled down into a little white cigarette, screaming in fear as she realized she wasn't a bra.<br>\r\n<br>\r\n \"What did you make me? We agreed on a bra!\" Mia screamed in fear. You bent down and grabbed the small piece of nicotine delivery before holding her up to a mirror on the wall. \"A cigarette?! Really!? What do you want with a- Oh no, no. You can't smoke me!\" She protested, to which you remained silent and walked towards the window.<br>\r\n<br>\r\n You grabbed a lighter and watched as the tip burned, the poor girl screaming in pain as you took a slow draw of smoke which must have been her soul. You continued with her, until the once screaming woman was nothing but a little butt, her entire body now spread out to who knows where with the wind carrying the smoke like it did.<br>\r\n<br>\r\n You felt good, although that was probably just the nicotine, and you wanted to transform someone else. Looking online, you found</span></div></div>",
            "created":1579921680,
            "id":2778041,
            "title":"Cigarette"
        },
        "14132":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "A Mindless Slave",
                "A Fairy",
                "A Barbie Sized Version of Herself",
                "A Vibrator",
                "A Living Photograph"
            ],
            "content":"<div class=\"\"><div> <span>You continued to browse your options, scrolling for pages before an account caught your eye. She was a busty mature woman named Jessica, listing herself as the nickname Jess, and 45 years old. She was gorgeous, and apparently she must have downloaded the wrong app by accident. Seeing an opportunity for another cruel transformation, you instantly hit up the cougar.<br>\r\n<br>\r\n Within an hour, you had successfully seduced the woman to her home under the pretenses of them just having casual sex, but your mind ran with ideas on what to do with this woman unaware she was driving to your house in order to become something other than her normal self. It wasn't long before the message 'Pulling Up' ran on your phone screen, and sure enough, a nice looking BMW pulled up in your driveway.<br>\r\n<br>\r\n Ready for your guest, as soon as Jess knocked on the door, you pulled it open, seeing the blonde beauty in her full glory. She was a couple inches taller than you, and her breasts seemed even larger in real life, almost tearing out of her tightly fit shirt. She grinned, before she started to talk to you.<br>\r\n<br>\r\n \"Hey! You must be Julie!\" She said with a slight southern drawl.<br>\r\n<br>\r\n \"Yeah! And you're Jen?\" You asked the beautiful brunette who was standing in your doorway.<br>\r\n<br>\r\n \"Yeah! Can I come in?\" She asked.<br>\r\n <br>\r\n \"Of course, just follow me!\" You said, motioning for the woman to take after you. She shut the door, and you walked her into the living room of the home, before sitting down on a chair, her doing the same on a couch directly across from you.<br>\r\n<br>\r\n \"So, let's cut to the chase. Where do you want to get started?' She asked. Laughing, you opened the app, and with the transformation distance now set to positive, you decided to change her into </span></div></div>",
            "created":1584251220,
            "id":2801678,
            "title":"Naive MILF"
        },
        "15":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "An Undecided Man, Not Knowing Whether to Transform Or Be Transformed",
                "An Undecided Woman, Not Knowing Whether to Transform Or Be Transformed",
                "A Hacker Man, Able To Transform Anyone, Teleporting Them To Him",
                "A Hacker Woman, Able to Transform Anyone, Teleporting Them To Her",
                "Somebody Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who are you when you're setting up an account?</span></div></span></div>",
            "created":1577944260,
            "id":2768128,
            "title":"More People"
        }
    },
    "info":{
        "author_id":"the1swagking",
        "author_name":"The1SwagKing",
        "brief_description":"A revival of an interactive I deleted a while back.",
        "created":1576463400,
        "description":"<td align=\"left\" class=\"norm\">In the not too distant future, transformation technology has been cracked by a team working for the dating app Tinder. After developing a separate app, they introduced it to the world to widespread praise, soon the app was on nearly every man and woman's phone and transforming was the norm in day to day life. The way the app worked was the person wanting to be transformed would either set what they wanted to change into to their profile, or search over those looking for transformed individuals 'wish lists' where they listed out items that they wanted.<br>\r\n<br>\r\nIntense lobbying from the app lead to pretty much no liability on their behalf when it came to  users not returning the people turned objects so the risk in becoming something was great, but nevertheless people both young and old flocked online to the new trend. There were cruel people out there who loved more than anything else trapping people into objects and keeping them forever, or even those out there who had developed a taste for food made out of transformed people, due to the invulnerability of the objects, only transferring their conscious to some place on the consumer's body.<br>\r\n<br>\r\n In this world, almost anything could happen, and you are a participating member of this new society forged on the backbone of Transformation Tinder.<br>\r\n<br>\r\n<div align=\"center\">Rules</div><br>\r\n1. No Children.<br>\r\n2. No Toilet, Once Devoured Food Is Absorbed And Continues As A Body Part<br>\r\n3. No Gay Stuff</td>",
        "id":2207950,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1587432840,
        "modified":1587432840,
        "pretty_title":"Transformation Tinder"
    }
}