{
    "chapters":{
        "1":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "choice 1",
                "choice 2",
                "choice 3",
                "choice 4",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>You are a gay man who has in his computer full of pictures of American footballers, because you dream of their uniforms and that your fantasies are just for the imagination, you are very shy so are you realized your dream is in talking about it or are you going to have an accident that will make your dream come true without having a choice?<br>\r\n<br>\r\nHere is the uniform of the team that you will meet.<br>\r\n<br>\r\n<br>\r\n<span class=\"cteal\"><u><b>choice 1:</b></u></span> <a rel=\"nofollow\" href=\"https://urlz.fr/8ad4\" target=\"_blank\">https://urlz.fr/8ad4</a> (blue uniform)<br>\r\n<br>\r\n<span class=\"cteal\"><u><b>choice 2:</b></u></span> <a rel=\"nofollow\" href=\"https://urlz.fr/8ucA\" target=\"_blank\">https://urlz.fr/8ucA</a> (black uniform)<br>\r\n<br>\r\n<span class=\"cteal\"><u><b>choice 3:</b></u></span> <a rel=\"nofollow\" href=\"https://urlz.fr/arvU\" target=\"_blank\">https://urlz.fr/arvU</a> (blue uniform)<br>\r\n<br>\r\n<span class=\"cteal\"><u><b>choice 4:</b></u></span> <a rel=\"nofollow\" href=\"https://urlz.fr/8ucO\" target=\"_blank\">https://urlz.fr/8ucO</a> (dark blue &amp; gold uniform)</span></div></div>",
            "created":1545195600,
            "id":2590790,
            "title":"beginning"
        },
        "11":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "armpit size",
                "cleft size (buttocks)",
                "leg size",
                "pecs size",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You have chosen the team wearing the pro bowl 2009 (nfl) uniform.<br>\r\n<br>\r\nBut what size do you do?</span></div></span></div>",
            "created":1545195600,
            "id":2590801,
            "title":"choice 1"
        },
        "112":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "a blue buttock",
                "a white buttock",
                "white shoulder pad",
                "red shoulder pad",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you made the size smaller than a slot (buttock), unfortunately for you you fall from the sky in full match so no player will pay attention to you. When all of a sudden a shadow comes on you when you look up you see ...</span></div></span></div>",
            "created":1571085360,
            "id":2732886,
            "title":"cleft size (buttocks)"
        },
        "12":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "he plays a little",
                "he calls other footballer",
                "it tests the paste function",
                "he forces you to massage him (you are above his uniform)",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>you lived alone no one came to your house which allows you to hang on the wall full of photo but the majority of the photos were American footballers of the team panthers in black <a rel=\"nofollow\" href=\"https://urlz.fr/8ucA\" target=\"_blank\">https://urlz.fr/8ucA</a><br>\r\nyou even had a diary in your living room that talks about all you love about panthers and their black uniforms that you were so shy that you've never seen in real life.<br>\r\n<br>\r\none day your door is ringing, you will open worried, because you have not ordered anything and saw that no one comes you did not know why when you open the door you have eyes wide open because in front of you with a football player panthers in his uniform black without a helmet, you wonder why he's ringing at your house and why he's in his uniform.<br>\r\nthe footballer says \"Hello, I'm a football player on the Panthers' team, we raise money to help subsidize the work to keep the stadium in good shape, I'm wearing my match uniform to prove to you that I'm good 'team' panthers' \"<br>\r\n<br>\r\nyou answer him begging and drool \"HH-Hello, yes of course I go to get my wallet, meanwhile install you in the living room\" then you go looking for your wallet in your room all you remember to what it looks like, when you take your wallet you remember that in the living room he had pictures of his team with his uniform is that he also had your diary open, you run quickly to see him before he reads your journal when you arrive in the living room you drop the wallet on the ground, because the footballer has your journal in hand.<br>\r\n<br>\r\nthe footballer says \"is good, I see you like it, you will be a good slave\"<br>\r\n<br>\r\nyou did not have time to answer that the footballer takes out his phone and a green flash goes on you, because what nobody is, all the footballers have a secret application slave with this application they can shrink anyone except football person (coach and employee included in the ban) and after he had several buttons<br>\r\n<br>\r\nhe can control all of his slave, movement, actions (kissing, sniffing etc), he has a GPS to find out where his slave is.<br>\r\n<br>\r\nhe had three extra buttons<br>\r\n<br>\r\ninvisible / solo: this button makes you invisible nobody has your master can see you hear you and feel you.<br>\r\n<br>\r\nshare: your master little added the id of another footballer to share you, of course your master has all power, the second will be invisible and control, but you will be visible only for him and your master.<br>\r\n<br>\r\nstick / take off: he can place you anywhere and when he clicks stick the applique asks him to confirm the place and then you stick without being able to move and without anything that holds you until you click on take off (example he puts you against his trousers buttocks, he sticks it valid trousers then he lets go and you will be sticking against his pants and nothing can take you off or make you move to that presses on take off)<br>\r\n<br>\r\nthe application works with the recognition, so you will not be able to use it alone the owner of the phone can use it, he has 2 problems with this application:<br>\r\n<br>\r\nwhen it has more battery or when the phone and completely extinguished, in these two cases you will be free of your movements it will not control you anymore, but you will keep your size. at this moment he has 2 actions when he reignites<br>\r\n<br>\r\nyou have stayed close to him: he will have to make a gesture or offer you something (it can be free or leave you someday without doing anything, be careful if he frees you another footballer can use his laptop and be your new master.<br>\r\n<br>\r\nyou have run away: he will have to make you the worst punishment (he can ask another footballer to punish you)<br>\r\n<br>\r\n<br>\r\nwhat does he do first?</span></div></div>",
            "created":1561551060,
            "id":2678750,
            "title":"choice 2"
        },
        "13":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "the sadistic coach, he recognized you and explains what will happen",
                "a footballer panthers, he wants to play with the bug (because for him you're a b",
                "an employee (male housekeeper, etc)",
                "an opposing footballer (he had come to spy on)",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>by looking for pictures on the panthers team, you come across the coach's email, you knew that the coach could accept or refuse and also that the players do all that the coach tells them, you say good I have nothing to lose it's just an email you take your courage and you write it<br>\r\n<br>\r\n\"Hello,<br>\r\nI introduce myself,  my name is Quentin, I am gay with several fetishes that I would like to realize if possible with your help.<br>\r\nhere I love the blue uniform panters here is an illustration <a rel=\"nofollow\" href=\"https://urlz.fr/arvU\" target=\"_blank\">https://urlz.fr/arvU</a> , I would like to see what happens if a panther in uniform plate me when I wear no protection, and why not too a double sandwich-style sandwich two footballers in uniform and me between them without protection, I also want them to make me facesitting (in uniform) with  farts, but also that locks my nose in their uniform armpit and well else.<br>\r\n<br>\r\n\"you send the mail then in the afternoon you receive an answer\" hello quentin, I received your email, thank you for your affection to our team is our uniforms, that's why I'd like to realize your fetishes, I invite you on Wednesday in our private stadium, as you could know this private stadium is in a remote place so that it will only my players me and you, no one can see us and all that happens in this stage remains in this stadium which means that I and my team will not talk about you outside the stadium, when you come my team will be in their uniform on the ground practicing, so I invite you to wait in the locker room\"<br>\r\n<br>\r\nthen on Wednesday you go to your appointment even if that day it was very hot, because this heat you say you probably the coach will cancel, because he will not work these footballers during this heat, arrive at the stadium you notice that the coach had likewise trained the players, he had to be sadistic, because he was trying to drag them to the sun with their blue uniform that you had put in joint-piece, you go as he tells you, in the cloakroom inside, it was good, because he had the air conditioner and when you come back in the locker room you feel dizzy and then you faint.<br>\r\n<br>\r\nwhen you wake up you look around you and you notice that you were still in the locker room but that everyone was giant, so you know that you shrank and then someone comes in and lifts you up.<br>\r\n<br>\r\nbut who is it?</span></div></div>",
            "created":1561526460,
            "id":2678648,
            "title":"choice 3"
        },
        "131":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "he calls all footballers",
                "he calls the footballer who smells the worst armpits",
                "he calls the footballer who can unleash the worst farts",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>you recognize the face of the coach is he tells you with an evil smile \"hello you, you must be quentin\"<br>\r\n\"Hello, yes it's me, what's going on?\"<br>\r\nthe coach laughs then says to you \"I made you a little surprise, I see you do not like it but these not serious, yes it's me who made your facts shrink it will be much more fun to do what you asked me besides being narrowed, I made you intuable which means that it is impossible for you to die or faint, but you can even be crushed is suffers, just every time your body is reforming afterwards and you will remain conscious even if you are crushing or suffocating, I have a lot of plans for you and like you saw my players training outside and yes they are forced to do all that I tell them and I can tell you they are angry and normally he attacks the 'Waterboy' but this time I did not come to make them even more angry and for those who burst on you \"<br>\r\nthen the coach goes on the field and calls ....</span></div></div>",
            "created":1561528320,
            "id":2678659,
            "title":"the sadistic coach, he recognized you and expla..."
        },
        "1313":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "Ted to remorse so he fart gently",
                "does not care about you, wants to relieve himself, drops a lot of horrible fart",
                "Ted tightens the buttocks (crushes you) and then releases fart",
                "Ted rebels getting up(the sweat of the pants is like a glue, you stay stuck)",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>you were in the coach's hand while he was going on the field where all the players were training, their uniform was clean except for the sweat drying due to the heat, once the coach arrived near the bench, he said \"Ted Ginn Jr come to see me \"then you see the footballer with the number 19 <a rel=\"nofollow\" href=\"https://urlz.fr/aE7j\" target=\"_blank\">https://urlz.fr/aE7j</a> who approaches a pace a little strange as if he had a stomach ache and ted told the coach\" s 't the coach, can I let go fart because it makes me very painful belly \"the coach smiles and says\" You will soon be able to let go, here is quentin \"he shows you to Ted and the coach continues\" I will put it on the bench while I hold it you will sit on it but just before you are completely seated, I withdraw my hand to avoid being blocked so it will be blocked under your buttocks without being able to move and at that moment you will be able to let you go, so go for it because it will be the only time you can do it \"then the coach puts you on the low back u bench you could not move because he was holding you to the bench and then you see the ted pants approaching you, you could even see the sweaty trace of those buttocks and then when your face starts to touch his pants the coach removes his hand and ted sat down quickly, you were stuck between these buttocks and could not move except breathe it already feels horrible due to sweat.</span></div></div>",
            "created":1569708960,
            "id":2724775,
            "title":"he calls the footballer who can unleash the fart"
        },
        "13132":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "Ted goes play with you stick to his pants",
                "Ted standing loose a last fart that sends you into the air",
                "you stayed stuck on the bench",
                "the coach took you",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>you feel the hot sweat of his ass on his pants and you were lucky he had his pants that separate you, at first you tell yourself that ted is not going to do it, but ted had too much stomach pain for worry about you first let go of a little fart that was too much for you yelling at you the horrible smell, and at the moment you yell ted loose the valves and make a huge fart that lasts 1 minute the smell should have been you to kill, but since you can neither die nor faint, you were suffering, you could even hear ted cried for relief.<br>\r\n<br>\r\nTed had finished letting go of all those farts when he got up, you were</span></div></div>",
            "created":1571079720,
            "id":2732848,
            "title":"drops a lot of horrible fart"
        },
        "131324":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "the coach offers you to be inserted in the ass of ted",
                "the coach offers you to sew you in ted pants (outside) for the day",
                "the coach suggests you to be under ted's buttocks during the meal",
                "the coach suggests that you tell ted about it",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>you were on the bench still filled with his ass sweat which is also called \"swamp ass\" and wax residue; you did not have time to do anything whatever the coach takes you again in this hand and tells you \"so how it was this experience\" he gives you a sly smile because he thinks that for you this bad experience but in reality, it certainly smelled very bad, you certainly suffered, certe felt his sweaty sweat is yes the wax was a powerful hurricane that smells too strong but you had to love, you answer \"well it's true that his sweat smells bad and his wax which was a putrid hurricane which could normally kill me, I suffered but I liked to say I would like to stay longer \"the coach was surprised by your answer but he said\" you know there he just made room so he has more and more this not the worst I already felt worse than that, at home, to tell you the worst is the little ones because this one who was long was like a small pomegranate but when it releases small they are much more powerful and more fragrant as u no nuclear bomb \"<br>\r\nyou were surprised that this wax was nothing compared to anything else and that it could let go of the smaller ones which were more horrible, you will like time to continue you said \"hum too bad I can't have them\" then the coach said \"you know it is 11:00 am he has been playing since 6:00 am this morning and they are going to play until 9:00 pm, they will have a meal break on this same bench, but they will not be able to change this until this evening \"you are looking at the bench and you already imagine it is hot but at 12h the sun and the heat and worse and the bench is not sheltered then the coach continues to say \"if you want I have something to offer you\" you were all ears and answered \"I listen to you \"</span></div></div>",
            "created":1578922740,
            "id":2773176,
            "title":"the coach took you"
        },
        "14":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "you did not have time, you find yourself under the buttocks (uniform) of the foo",
                "you jump left and you find yourself inside a uniform (its owner gets dressed)",
                "you jump right and hit you against the thigh (he considers you a bug)",
                "you escaped the footballer's buttocks, but he propelled you into the air",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>you walk quietly in the street, you had put on your mobile an alert if it had new photo of footballer when all you blow your mobile phone this food rang and vibrate, you look and you see that this tone alert when you open you see the picture of the footballers 'notre dame' <a rel=\"nofollow\" href=\"https://urlz.fr/8ucO\" target=\"_blank\">https://urlz.fr/8ucO</a> he was cute and beautiful in their uniforms you download the photo to keep it in your phone when you get back into someone what makes you loose your phone. Enervate you say \"fucked, watch what you did I'll break my phone\"<br>\r\nthe guy in front of you this angry \"is an excuse it is you who do not look in front of you, who look at your phone and I'm the offender, well see what is more important than look or have put them feet \"then the strange man takes the phone and see the picture he tells you\" like that, you prefer to see footballers instead of watching where you go, is well you came across the wrong person I am a magician is for you to punish you will be narrowed, with the impossible to die or to faint and you will always be with these players, that is to say when they finish with their uniform you will be tp in the future when they will put back their uniforms and it will be will be impossible to escape from these players. \" then you start running, but you are quickly frozen by the magician, he approaches you and he casts his spell and then a second after you find yourself on a giant bench, you were in the locker room of footballers 'notre dame' has on your left he had uniforms on the bench (the owner of this uniform is bad and will soon put it), on your right he had a footballer already in uniform sitting and in front of you a footballer in uniform ready to sit on you.<br>\r\n<br>\r\nWhat are you doing?</span></div></div>",
            "created":1561530300,
            "id":2678666,
            "title":"choice 4"
        },
        "15":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "choice 1",
                "choice 2",
                "choice 3",
                "choice 4",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Here is the uniform of the team that you will meet.<br>\r\n<br>\r\n<br>\r\n<span class=\"cteal\"><u><b>choice 1:</b></u></span> <a rel=\"nofollow\" href=\"https://urlz.fr/8udg\" target=\"_blank\">https://urlz.fr/8udg</a> (white uniform)<br>\r\n<br>\r\n<span class=\"cteal\"><u><b>choice 2:</b></u></span> <a rel=\"nofollow\" href=\"https://urlz.fr/8udk\" target=\"_blank\">https://urlz.fr/8udk</a> (red uniform)<br>\r\n<br>\r\n<span class=\"cteal\"><u><b>choice 3:</b></u></span> <a rel=\"nofollow\" href=\"https://urlz.fr/8uds\" target=\"_blank\">https://urlz.fr/8uds</a> (green uniform)<br>\r\n<br>\r\n<span class=\"cteal\"><u><b>choice 4:</b></u></span> <a rel=\"nofollow\" href=\"https://tinyurl.com/ye2dcg5f\" target=\"_blank\">https://tinyurl.com/ye2dcg5f</a> (purple uniform)</span></div></div>",
            "created":1545195600,
            "id":2590791,
            "title":"other"
        },
        "154":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "garrett bradbury",
                "Kirk Cousins",
                "Danielle Hunter",
                "Alexander Mattison",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>you were gay is you like to see the american football uniform except that you watch it on tv or by photo, you never get too close<br>\r\none day while you are watching photos of a football player a lightning bolt strikes you, when you wake up you were lying on a soft surface then you start to look around you at the beginning you do not recognize until you understand that you were shrinking this which allows you to see that you were in a football locker room and you see that the hard ground was the seat of a chair you receive the logo which is the Viking team because each player with a personal locker and in front of the locker he had a personal chair <a rel=\"nofollow\" href=\"https://tinyurl.com/yg6xo4de\" target=\"_blank\">https://tinyurl.com/yg6xo4de</a><br>\r\n<br>\r\nyou didn’t have time to react as you endured noise and suddenly you see the viking in their full uniform returned some were swimming because it was summer and the temperatures were high<br>\r\nyou wanted to get out of the chair because you know that it belongs to one of the players but when you go to move the chair this pulls back what makes you fall back (your back against the cushion ) when you look up you see a purlpe fabric coming down on you, you understood that it was the buttocks in uniform.<br>\r\ndue to the heat wave, he had to authorize a half time a little longer the time for some player to wash this and put on a new uniform and others who want to stay like that can rest this can, but just before the footballer this dish completely seated on you, you can see its number on the back which was ...<br>\r\n<br>\r\n______________________________________________________________<br>\r\n<br>\r\ngarrett bradbury: poste center <a rel=\"nofollow\" href=\"https://tinyurl.com/ydqfc7s8\" target=\"_blank\">https://tinyurl.com/ydqfc7s8</a> : is often with the quaterback because most of the time the quaterback puts his hand on his buttocks, are quaterback allows him to have the swamp ass but also if he wants fart while the quaterback and behind or by hand in his ass he allows it to fart because he does not want the center to have a stomach ache by holding it back.<br>\r\n<br>\r\n<br>\r\nKirk Cousins: number 8 quaterback <a rel=\"nofollow\" href=\"https://tinyurl.com/yjrgz9os\" target=\"_blank\">https://tinyurl.com/yjrgz9os</a> : love his team is all made to make him feel comfortable so it does not bother to touch sweat or smell of fart on it hand, has become accustomed to this tackle but also he likes to welcome or punish in a particular way (this dish sitting on the person's face to force him to feel his pentalon and drops him full of fart).<br>\r\n<br>\r\nDanielle Hunter: Defensive end <a rel=\"nofollow\" href=\"https://tinyurl.com/yj25l28k\" target=\"_blank\">https://tinyurl.com/yj25l28k</a> : he is muscular, this is often found on the ground and very often when he does an action his pentalon can find this crush between these buttocks which squeezes (very muscular buttock).<br>\r\n<br>\r\nAlexander Mattison: Running back <a rel=\"nofollow\" href=\"https://tinyurl.com/yf39r9b3\" target=\"_blank\">https://tinyurl.com/yf39r9b3</a> : a faceur is a tyrant whether his team or his opponent, if he notices that you are rocking his ass it doesn't bother him for fart (very smelly fart that destabilizes ),  during mid-temp he loves to torture his team or the fans because if during mid-temp a fan asks him for an autograph he does it in a special way (he invites him into the locker room and tortures him in any way possible with his uniform, he is merciless he can even crush a fan by tacking him very hard with his uniform while the fan has no uniform or protection) for this he is often put away and only the unconscious fan who does not know too much what have.<br>\r\n<br>\r\n<br>\r\n(little info on the photos of the players they all have different uniforms but in history they held it complete purple that in the match vicking vs saints 2020)</span></div></div>",
            "created":1578353040,
            "id":2770309,
            "title":"choice 4"
        },
        "155":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "choice 1",
                "choice 2",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here is the uniform of the team that you will meet.<br>\r\n<br>\r\n<br>\r\n<span class=\"cteal\"><u><b>choice 1:</b></u></span> <a rel=\"nofollow\" href=\"https://tinyurl.com/y4etkf5e\" target=\"_blank\">https://tinyurl.com/y4etkf5e</a> (blue &amp; white uniform)<br>\r\n<br>\r\n<span class=\"cteal\"><u><b>choice 2:</b></u></span> <a rel=\"nofollow\" href=\"https://urlz.fr/aDRw\" target=\"_blank\">https://urlz.fr/aDRw</a> (flashy green uniform)</span></div></span></div>",
            "created":1545195600,
            "id":2590793,
            "title":"other"
        },
        "1551":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "tied to Jonathan Stewart's pants buttocks, he fartes on you",
                "Odell Beckham Jr.'s, attached to the t-shirt above the shoulder pad",
                "harry carson, attached to the glove (outside) in the hand",
                "Kenny Phillips, attached on the sock (outside) under foot in the shoe",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>a light makes you suddenly fall asleep when you wake up you notice that you were attached to a big fabric a little special you did not know yet or because you were still in the gas when you hear people speak very loudly like Giants you notice that you were on ....<br>\r\n<br>\r\n<br>\r\nJonathan Stewart pants: <a rel=\"nofollow\" href=\"https://youtu.be/VG_P4xAqWEQ\" target=\"_blank\">https://youtu.be/VG_P4xAqWEQ</a><br>\r\n<br>\r\nOdell Beckham Jr.'s : <a rel=\"nofollow\" href=\"https://tinyurl.com/y4fnl7he\" target=\"_blank\">https://tinyurl.com/y4fnl7he</a><br>\r\n<br>\r\nharry carson: <a rel=\"nofollow\" href=\"https://tinyurl.com/y4xxvdf6\" target=\"_blank\">https://tinyurl.com/y4xxvdf6</a><br>\r\n<br>\r\nKenny Phillips: <a rel=\"nofollow\" href=\"https://tinyurl.com/y6j67j84\" target=\"_blank\">https://tinyurl.com/y6j67j84</a></span></div></div>",
            "created":1571091780,
            "id":2732915,
            "title":"choice 1"
        },
        "1553":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "choice 1",
                "choice 2",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here is the uniform of the team that you will meet.<br>\r\n<br>\r\n<br>\r\n<span class=\"cteal\"><u><b>choice 1:</b></u></span> <a rel=\"nofollow\" href=\"https://urlz.fr/8uf2\" target=\"_blank\">https://urlz.fr/8uf2</a> (silvers uniform)<br>\r\n<br>\r\n<span class=\"cteal\"><u><b>choice 2:</b></u></span> <a rel=\"nofollow\" href=\"https://urlz.fr/aDRA\" target=\"_blank\">https://urlz.fr/aDRA</a> (gold uniform)</span></div></span></div>",
            "created":1545195600,
            "id":2590813,
            "title":"other"
        },
        "15531":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "number 4",
                "number 21",
                "number 55",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>when you arrived, he was in full match.<br>\r\nyou fell from the sky and then landed on one of the uniforms (uniform exterior) (uniform slivers).<br>\r\n<br>\r\non whom do you fall and where?<br>\r\n<br>\r\n<span class=\"clred\"><b><u>Dak Prescott with number 4</u></b></span> <a rel=\"nofollow\" href=\"https://urlz.fr/aDYh\" target=\"_blank\">https://urlz.fr/aDYh</a> on his shoulder pads (uniform exterior) or inside his hand.<br>\r\n<br>\r\n<b><u><span class=\"clred\">Ezekiel Elliott with number 21</span></u></b> <a rel=\"nofollow\" href=\"https://urlz.fr/8vmf\" target=\"_blank\">https://urlz.fr/8vmf</a> on these buttocks or on the crack (outside uniform).<br>\r\n<br>\r\n<b><u><span class=\"clred\">Edgar Jones with the number 55</span></u></b> <a rel=\"nofollow\" href=\"https://urlz.fr/8vmk\" target=\"_blank\">https://urlz.fr/8vmk</a> you have fallen on the bench (your back against the bench so face to the sky) and then Edgar Jones will sit on you or between the thighs against  groin protection of Edgar Jones. <a rel=\"nofollow\" href=\"https://urlz.fr/8vmQ\" target=\"_blank\">https://urlz.fr/8vmQ</a></span></div></div>",
            "created":1545454800,
            "id":2591841,
            "title":"choice 1"
        },
        "155312":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "on the cheek of the buttocks (above the pants)",
                "on the crack (above the pants)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so you fell on Ezekiel Elliott but on what?</span></div></span></div>",
            "created":1545499020,
            "id":2591975,
            "title":"number 21"
        },
        "1553121":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "big slap on the left cheek ",
                "Ezekiel Elliott gets tackled ",
                "Ezekiel Elliott gets tackled in a group ",
                "Ezekiel Elliott spanks against helmet"
            ],
            "content":"<div class=\"\"><div> <span>you fell from the sky when you managed to grab a silver fabric. When you looked up, you saw that you were clutching pants american football of muscular left cheek Ezekiel Elliott's.<br>\r\n<br>\r\nbut what happens after?<br>\r\n<br>\r\n<u><b><span class=\"clred\">choice 1:</span></b></u> big slap on the left cheek <br>\r\n<br>\r\nDak Prescott puts a big slap on the left cheek of Ezekiel Elliott and crushes you against the cheek.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://urlz.fr/8vu3\" target=\"_blank\">https://urlz.fr/8vu3</a><br>\r\n<br>\r\n<br>\r\n<br>\r\n<u><b><span class=\"clred\">choice 2:</span></b></u> Ezekiel Elliott gets tackled <br>\r\n<br>\r\n(you are crushing between the cheek and the ground).<br>\r\n<br>\r\n<u><b><span class=\"clred\">choice 3:</span></b></u> Ezekiel Elliott gets tackled in a group <br>\r\n(you are crushed between the cheek and a group of players).<br>\r\n<br>\r\n<u><b><span class=\"clred\">choice 4:</span></b></u> Ezekiel Elliott spanks against helmet <br>\r\n(you are crushing between the cheek and the helmet of an enemy player).<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://urlz.fr/8vuc\" target=\"_blank\">https://urlz.fr/8vuc</a></span></div></div>",
            "created":1545500160,
            "id":2591982,
            "title":"on the cheek of the buttocks (above the pants)"
        },
        "155313":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "against the pants under the crack",
                "between the thighs",
                "against groin protection of Edgar Jones",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>you woke up you looked around you you noticed you were lying on a bench and then you continued looking and you see Edgar Jones with the number 55 ready of you you did not move, because you like the sight of the fact that you always wanted to see the loan uniforms. Then one moment Edgar leans over you started to understand that he's going to sit where you are, you tried to say something, it's too late<br>\r\nBOOM<br>\r\n  when you open your eyes you were ....</span></div></div>",
            "created":1549378260,
            "id":2613307,
            "title":"number 55"
        },
        "1553131":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "Edgar unleashes a big monster fart stinky that you suction",
                "Edgar is sitting up again, so you're stuck with your mouth wide open",
                "Edgar gets up (you stick to his pants)",
                "Edgar gets up (you stay on the bench)",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>you find yourself between these buttocks against his pants and thankfully because you knew that your face was close to his rectum but his pants separate him, only the pants to hide all the light but also the air that is that at the end of a minute you run out of air, you start to really run out of air when Edgar puts it to lean forward, which frees your head but when you take a deep breath ...</span></div></div>",
            "created":1569680280,
            "id":2724596,
            "title":"against the pants under the crack"
        },
        "15531311":{
            "author_id":"demon57740",
            "author_name":"demon",
            "choices":[
                "Edgar tightens the buttocks very hard (he crushes you)",
                "edgar believe he's sitting on an insect (he sees you)",
                "edgar stomach ache (burst of fart)",
                "edgar must go to the field (the sweat of the pants makes you stick to the pants)",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>when you take a deep breath Edgar drops a huge fart, even if the fart was mixed up you were in pain and then you did not have time to do anything because Edgar is sitting back but this time your head was not glued to the trousers, because your head was locked in a bubble of air that the pants had kept, but you think at first that it's air except when you breathe you understand that it was a bubble of fart except that it was pure fart he had no air mixing what was worse.</span></div></div>",
            "created":1570223640,
            "id":2728034,
            "title":"Edgar unleashes a big monster fart stinky that ..."
        }
    },
    "info":{
        "author_id":"demon57740",
        "author_name":"demon",
        "brief_description":"teleport to world that lives for american football, you be slave (without uniform for you)",
        "created":1541777580,
        "description":"<td align=\"left\" class=\"norm\">hello so I created this interactive because I am a French (gay) who fantasizes about American football uniforms and the smell that smells.<br>\r\n<br>\r\nso in this interactive everything is about football (american football), you would become a player's slave, he only has football players and you in this world so everyone except you will be in uniform all the time (choose uniform). he wears the match uniform even outside the field or even when he sleeps they are almost 24 hours in their uniform.<br>\r\n<br>\r\nyou have become immotelle, this means no death or fainting but you continue to suffer and your body reacts like a normal human without having blood (crushing, flattening, bone breaker, etc. but after a while you regain form ).<br>\r\nfootballers because he will have only footballers, will be mean to you because for them, you are a shabby with whom he can play.<br>\r\n<br>\r\nyou are not a footballer so you will be naked or shirtless, of course footballers can play a football match with you as an opponent (you were not allowed to be dressed).<br>\r\n<br>\r\n<u><span class=\"clred\"><div align=\"center\"><b>Rules</b></div></span></u><br>\r\n<br>\r\n<span class=\"cblue\">No women,<br>\r\n<br>\r\npermission to play with your height (you could be of normal size or be shrunk by footballers, forbidden for you to be taller than a footballer)<br>\r\n<br>\r\nNo death (even the footballer can not die),<br>\r\n<br>\r\nNo fainting for you,<br>\r\n<br>\r\nAllow sex (all characters are at least 18 years old because these age for French to be major),<br>\r\n<br>\r\nAll fetichism are allow,<br>\r\n<br>\r\n<br>\r\nthe action can be in the street, in a room, on the football field, etc (It is therefore a question of allowing the footballers to wear the uniform in the place where they wish),</span><br>\r\n<br>\r\n<b><span class=\"cviolet\">I remind you that this story is about American football, smells, crushed and STINK</span></b><br>\r\n<br>\r\n<u><span class=\"clblue\">I will be delighted that the readers participate in writing. for all requests<br>\r\n</span></u><br>\r\n</td>",
        "id":2174220,
        "image_url":"https://www.writing.com/main/images/action/display/ver/1600131963/item_id/2174220.jpeg",
        "last_full_update":1600135560,
        "modified":1600135560,
        "pretty_title":"slave of footballs STINK"
    }
}