{
    "chapters":{
        "1":{
            "author_id":"luckykid77",
            "author_name":"K.D.P",
            "choices":[
                "Take a path into the Reeds...",
                "Take the path into the swampy forest...",
                "Take the path leading to a quicksand bog..."
            ],
            "content":"<div class=\"\"><div> <span>A girl wakes up from unconsciousness in a dark dismal swamp, she can't remember what happened, but she is all alone. She wore what seem to be a lace-frilled dress, the high collar /w open front on her dress was soft around her delicate looking neck, her long gown skirt flow elegant like the wind, but the girl notices that she is all numb around her body, and her eyes have become an eerily pale color along with all of her still beautiful skin, but she notices that she stinks of rotting flesh and manages to burp and fart frequently and not be embarrassed about it.<br>\r\n<br>\r\nAs she tries to stand up out of the swampy mud, she realises it, she has become an undead, but her mind is still her own and she is still beautiful, but she has lost her memory, and she doesn't know where she is... Her quest begins as she tries to find her memory, find her way, and find out how she died, her only clue was a scar on the side of her neck, but she believes there's more than just that...<br>\r\n<br>\r\n<br>\r\nWhat should she do, first? </span></div></div>",
            "created":1253941200,
            "id":766000,
            "title":"The lonely Zombie"
        },
        "11":{
            "author_id":"luckykid77",
            "author_name":"K.D.P",
            "choices":[
                "She tries to help the woman, hoping she doesn't kill her...",
                "Leave her in fear that she might kill her..."
            ],
            "content":"<div class=\"\"><div> <span>The young girl crawls out to the reeds, her feet made a squelching sound with each step she took.  Suddenly out in the distance she sees a Mage woman stuck waist-deep in a sticky mud pit, and buy closer inspection, the zombie finds out that the Mage was a slayer. Slayers are said to kill certain Mythical creatures such as dragons, demons, vampires, and zombies. The girl thougt that she musn't make contact with her, but she couldn't leave the woman there to drown in the muck. What should the girl do?</span></div></div>",
            "created":1253941200,
            "id":766286,
            "title":"Take a path into the Reeds..."
        },
        "111":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "She realizes that the girl is telling the truth, and tries to calm her down.",
                "She follows the girl's expectations and attacks her.",
                "She turns tail and runs away. (she was just an amateur slayer)"
            ],
            "content":"<div class=\"\"><div> <span>Despite knowing the dangers of making contact with a slayer, the zombie girl couldn't just bring herself to let the helpless woman die. Thinking fast, she grabs a nearby vine and yells out to the woman.<br>\r\n<br>\r\n\"Here! Grab onto this!\"<br>\r\n<br>\r\nShe then tosses the vine to the woman, who immediately grabs onto it and uses it to pull herself out of the quicksand. As she gets out of the sandy trap, the woman thanks the girl for rescuing her.<br>\r\n<br>\r\n\"Thanks for the save, Miss. I was in a real fix there. Might I ask why you were out here in the middle of a swamp though?\"<br>\r\n<br>\r\n\"Well... Ummm... I was... Uhhh...\"<br>\r\n<br>\r\nThe zombie girl shuffled through her mind for an excuse that she could use. The woman hadn't gotten a close enough look at her yet to notice what she was, so the girl wanted to try and keep her true identity hidden if possible. This plan was quickly shattered, however, as she heard the woman let out a gasp of shock.<br>\r\n<br>\r\n\"Y-you're a zombie?!\"<br>\r\n<br>\r\nThe girl quickly panicked.<br>\r\n<br>\r\n\"P-please don't hurt me! I don't mean you any harm, honest!\"<br>\r\n<br>\r\nShe then curled into a ball in anticipation of some form of attack.<br>\r\n<br>\r\n<br>\r\nHow will the slayer woman react now?<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1303881180,
            "id":1095272,
            "title":"What doesn't kill you... Can't be all that bad!"
        },
        "1111":{
            "author_id":"tom12",
            "author_name":"Bigguy",
            "choices":[
                "she try's to tell the girl that she won't harm her.",
                "Or dus she just put her arm around the girl and wait it out."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Oh, I didn't mean to scare you, it's just that...\" she was starting to say but the girl said\"p p p-please don't kill me I I I d d didn't h h-harm a-anyone\" as she sobed.<br>\r\n<br>\r\n<br>\r\nWhat dus the woman do </span></div></span></div>",
            "created":1309452480,
            "id":1137819,
            "title":"The truth..."
        },
        "11112":{
            "author_id":"sweetace2211",
            "author_name":"AceSweet2211",
            "choices":[
                "Back home. Said Liz",
                "To the city said Liz"
            ],
            "content":"<div class=\"\"><div> <span>The slayer, realizing that words are useless to someone in this state of panic, wraps an arm around the girl and lays there with her. Upon gentle contact, the girl was surprised at the fact that a slayer, a person trained to kill things like her, was actually showing her mercy. After around.... say 2-5 minutes, the girl had finally calmed down but still lay there in a sort of daze, still wondering why the woman had decided to stay with her. <br>\r\n<br>\r\nThe woman noticed a calmness come across the zombie girl she was now laying with and tried to speak with her. \"It's ok, I am not going to harm you. Now what do you say to us getting out of the dirt here huh? The girl obliged and began to stand up. \"Why didn't you just kill me here? Isn't that like, your job?\" The girl asked. \"You remind me of my daughter. She was uhhh *cough* killed by a vampire one night playing out to late...\" The woman replied.  \"Do you have a name?\" The woman asked. \"Not one that I can remember. I just woke up over there without any memories.\" The girl replied. \"I'll just call you Kate for now then. Is that okay?\" Kate nodded at this. \"Kate... Kate... Kate... okay, I think I will remember that now. Speaking of names, what is yours?\" Kate asked. \"Elizabeth but people mainly call me Liz.\" Liz replied. \"Liz... Liz... Liz. Ok, got it.\" Kate said with with a concentrated tone to her voice and a funny expression on her face.<br>\r\n<br>\r\n\"Come on, I was just on my way......\"</span></div></div>",
            "created":1461991500,
            "id":2141057,
            "title":"Calm...Calm..."
        },
        "112":{
            "author_id":"luckykid77",
            "author_name":"K.D.P",
            "choices":[
                "Help her anyway..."
            ],
            "content":"<div class=\"\"><div> <span>The girl was afraid that she might slay her and decides to leave, but when she was about to leave, the mage suddenly sees her and call out to her...  \"Don't Move!\" The Slayer Mage called to her... \"I see you trying to walk away!\"  Her voice was like purely played violins, her mage robes were soft, laced and high collared like the zombie girl dress, and the breastplate she wore means that she was strong hearted... The zombie girl whimpers in fear that she might slay her... \"I see, You're a zombie, but I can see that your mind is still your own, but still if value your afterlife, you will help me get of the foul-smelling mudpit!\" She yelled  \"You'll have to find something to get me out, I dropped my wand and it sunk into this foul mud...\"</span></div></div>",
            "created":1254286800,
            "id":768511,
            "title":"Change of Heart"
        },
        "1121":{
            "author_id":"summitgamer",
            "author_name":"Summit",
            "choices":[
                "the mage thanks her and they camp nearby for the night",
                "the slayer is still skepticle about the zombie girl and attacks"
            ],
            "content":"<div class=\"\"><div> <span>She turned around to look back at the slayer and seeing her face looking sincere about not ending her afterlife before she could find the answers she was looking for. The girl looked around and found a long branch that was a little ways in front of her. she walked up to it and found that it should be way to heavy for her to lift because of its size, she decided to save the slayers life she would have to at least try to lift this branch. She reached down and got a sturdy grip on it and lifted up. Expecting it to be heavy she put too much power it to lifting it and nearly fell backwards. She thought apparently zombies have super strength because this branch is way too big for a normal girl with her muscles to lift. <br>\r\n<br>\r\nWith the branch in hand she rushed back to the mage only to find that she was much deeper than before and though she is sinking faster I best hurry. She swung the branch down so the mage could grab on.<br>\r\n<br>\r\nThe girl quickly yelled “hurry grab on tight and I will pull you out.”<br>\r\n<br>\r\nThe mage looked surprised that the zombie actually came back to help her. But grabbed on as tight as she could to the branch for how much leeway the mud gave her.<br>\r\n<br>\r\nThe girl started to pull the mage out of the mud, and within a couple of minutes succeeded at dragging her to land. And then …<br>\r\n</span></div></div>",
            "created":1300345860,
            "id":1071587,
            "title":"Help her anyway..."
        },
        "11211":{
            "author_id":"summitgamer",
            "author_name":"Summit",
            "choices":[
                "something attacks them during the night",
                "the next morning/ something else"
            ],
            "content":"<div class=\"\"><div> <span>Once the mage was out of the water she collapsed onto the ground her body covered all the way to her neck with mud. She coughed a couple of times before getting back to her feet and looking at you. Her eyes looked like they were expecting you to turn on her any moment and attack her, and her body language said the same thing.<br>\r\n<br>\r\nShe then spoke “Thank you for saving me, had you not come around here I would have surely died a slow death. I am tired so I think I will find a spot to set up camp.....and was wondering if you would like to join me?”<br>\r\n<br>\r\nThe girl was scared by the mage thinking that the mage would kill her when she slept, just because she saved this Mage does not make her any less of a slayer. The mage noticed the look on the zombie girls face and said “ you saved my life, and as I said earlier my wand is down in that mud and I have no desire to go down and get it......How about this, I will make an promise to you that unless you give me just cause I will not attack you. Does that sound fair to you?”<br>\r\n<br>\r\nthe zombie thought about that deal, still a little scared of the slayer but feeling a deep loneliness inside her she nodded in agreement.<br>\r\n<br>\r\nAfter the mage rested for a couple of minutes they began walking through the swamp together. The mage began asking questions about the zombie girl that she couldn't answer because of the lack of memory. But the she assumed it was manly to ease the tension between them.<br>\r\n<br>\r\nFinally after a short walk they came to a clearing. The trees provided good shade from the sun and there was soft grass for them to relax on. The mage asked her to go collect some logs for a fire as she went to dig a hole for the fire pit.<br>\r\n<br>\r\nThe girl was gone for 15 minutes looking for as many logs as she could carry. When she returned the mage had finished digging the fire pit and was working on a big shelter for the two of them out of tree branches.<br>\r\n<br>\r\nOnce the shelter was complete they started a fire and sat around it trying to think of how to get the zombie girls memories back.</span></div></div>",
            "created":1319574240,
            "id":1212827,
            "title":"the mage thanks her and they camp nearby for th..."
        },
        "112111":{
            "author_id":"luckykid77",
            "author_name":"K.D.P",
            "choices":[
                "Bandits attack them And they have to fight.",
                "A horde of hobgoblins raiders attack."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sudden they sense something, They hear rustling from some nearby bushes, they're not alone...</span></div></span></div>",
            "created":1401934560,
            "id":1807276,
            "title":"What Lurks in the shadows?"
        },
        "11212":{
            "choices":[
                "Come back in another Zombie's corpse.",
                "Come back again, mended together once more"
            ],
            "content":"<div class=\"\"><div> <span>The Mage slices your arms off with a concealed blade from her wrist. You don't even feel a thing, as the limbs with slightly green tinted skin hit the ground. You look down and realize your arms have been cut off, but before you can beg for your life your head rolls off of your shoulders, having also been sliced by the Mage. <br>\r\n<br>\r\nYou sorta feel the 'thud' of your head hitting the ground, and looking up, you see your body, both headless and armless, frantically moving about having no idea what to do. The Mage summons a powerful fire from the swamp, and it consumes your poor helpless body, and both of your arms. She then takes out a staff, and stamps your forhead with it, after which, you fade into unconscious blackness. <br>\r\n<br>\r\nThe Mage puts your head into a sac and dumps it back in the swamp, and promptly carries on her day. <br>\r\n<br>\r\nYou never found out who killed you. You never even found out how you died. Do you have friends or family who miss you? Does anyone even notice that you are gone? Is anyone looking for you? Does anyone even care? <br>\r\n<br>\r\nAll of these questions went through your mind as you faded out.</span></div></div>",
            "created":1324702200,
            "id":1245570,
            "title":"Re-Dead."
        },
        "12":{
            "author_id":"luckykid77",
            "author_name":"K.D.P",
            "choices":[
                "Grab the axe"
            ],
            "content":"<div class=\"\"><div> <span>The Undead girl approaches a slightly brighter part of the swamp with a forest clearing. The mud sucked at her thighs, making it harder for her to go on, so she managed climb onto a huge rock to take a break, out in the distance she could see a rotten axe embedded in a old tree stump, the zombie girl farts in curiousity and thought that she could probably use to defend herself from the harsh beasts that might dwell in the swamps...</span></div></div>",
            "created":1263013200,
            "id":818043,
            "title":"Take the path into the swampy forest..."
        },
        "121":{
            "author_id":"luckykid77",
            "author_name":"K.D.P",
            "choices":[
                "Look for shelter...",
                "Check her legs..."
            ],
            "content":"<div class=\"\"><div> <span>As the young zombie girl tries to reach for the axe, she pulls hard on it until it pops out of the stump, then as she's cleaned the moss from the axe she sees a small name engraved on the handle. It makes out the name, \"Geneviève\".  Suddenly, from seeing the name, she starts to dizzy and passes out... then she starts having a flashback....<br>\r\n<br>\r\n<br>\r\n\"Geneviève, I've made you a favorite meal to bring for your lunch\"<br>\r\n<br>\r\n\"Yes Mother,  thank you....\"<br>\r\n<br>\r\nThen the memory fades....<br>\r\n<br>\r\nAs the girl comes to again, she realizes that the name \"Geneviève\" was familiar to her, In Fact... That is her name!!! But then, as soon as she was trying it regain her bearings she feels something slimy around her legs....</span></div></div>",
            "created":1278824400,
            "id":915846,
            "title":"Grab the axe"
        },
        "1211":{
            "author_id":"sonio",
            "author_name":"Sonio",
            "choices":[
                "A cave.",
                "A burrow.",
                "A nearby village."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The girl let go of whatever was trying to grab her. Then she tried to find shelter and found...</span></div></span></div>",
            "created":1290963180,
            "id":1003382,
            "title":"Look for shelter..."
        },
        "12111":{
            "author_id":"luckykid77",
            "author_name":"K.D.P",
            "choices":[
                "Greet the werebats",
                "Hide from the werebats "
            ],
            "content":"<div class=\"\"><div> <span>The girl approaches a cave, and as she enters she can smell a faint stench emanating from it, and she must be careful, because there is what seems to be bat droppings which are deep in some places. Suddenly, she hears female voices in the distance, they're faint and seem to sound like that they're speaking in third person...  The girl follows the voices and she where they came from, in the distance she sees a flock of female werebats, It seems that their all talking (and arguing) about what's the best position when having sex with men, they all had their eyes hiding behind their hair, and although they're sadistic, cowardly, and outcasting, they have an intrest in the undead and the occult, but the girl fears that they might think she's tresspasing and become furious with her even though she's undead... <br>\r\n<br>\r\nShould she greet them anyway, or keep away from them...</span></div></div>",
            "created":1291602720,
            "id":1009223,
            "title":"A cave of Werebats"
        },
        "121112":{
            "author_id":"luckykid77",
            "author_name":"K.D.P",
            "choices":[
                "Investigate the voices..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The girl takes her chances and hide behind the rock. Suddenly, she starts hearing an indistinct conversation up ahead, she hears the werebats up ahead, but also, she hears two normal female voices up ahead... </span></div></span></div>",
            "created":1300274880,
            "id":1071180,
            "title":"From behind the stalagmites..."
        },
        "1211121":{
            "author_id":"luckykid77",
            "author_name":"K.D.P",
            "choices":[
                "She sneaks her way through and escape in confusion of the battle...",
                "Her rotten flatulence gives her away and she is spotted.."
            ],
            "content":"<div class=\"\"><div> <span>In the distance she makes out a couple of werebats, but she also makes out 2 strange women with red skin and beige uniforms, one of them had a long red horn on her forehead and had bright sky-blue hair, the other had two small and short horns, and spring-green hair. The hiding zombie makes out that they're 2 demons conversating with the werebats...<br>\r\n<br>\r\n<br>\r\n<br>\r\nThe werebats squeak angrily at them...<br>\r\n<br>\r\n<br>\r\n\"...Check bounced? Are you sure? This doesn't apply in our rrruules... Although the past years have been slow...\" The blue haired demon replied to them. \"I'm pretty sure we can...\"<br>\r\n<br>\r\nThe werebats interrupt with angry hissing... but then the green-haired demon showed a closed jar of scarabs.  \"Scarabs? Freshly imported from cursed pyramids of Egypt, for you eat and dine on?...\" Said the demon with green hair...<br>\r\n<br>\r\nOne of the werebats approach the scarab beetles in her hand and examines them closely.  Seconds pass in the standoff, until the werebat turns away for a second, but when she turns back, quicker than she pulled out the jar of scarabs, the green-haired demon pulls out a glowing black and yellow pistol in front of the werebat and shoots her point-blank in the face, the werebat falls to the dirty cave floor... dead...<br>\r\n<br>\r\nAs it turns out the two demons were the demon sisters, Scanty and Kneesocks. The other werebats get very mad at what they did, and swoop down to fight the 2 demons. The undead girl know that this could mean trouble, but it could also mean even worse if she's spotted...<br>\r\n<br>\r\n</span></div></div>",
            "created":1300336320,
            "id":1071532,
            "title":"A bad deal..."
        },
        "12111212":{
            "author_id":"jonikari",
            "author_name":"jonikari",
            "choices":[
                "Geneviève's path is blocked before she can leave.",
                "Geneviève manages to leave the cave."
            ],
            "content":"<div class=\"\"><div> <span>Geneviève realizes the demon girls are bad company and tries to back off, but as soon as she turns her rear towards the demons, rotten gas she didn't notice coming erupts from her rear loudly. Realizing her potentially fetal mistake, Geneviève decides hiding isn't an option anymore, and starts to run back toward the cave exit without looking back.<br>\r\n<br>\r\nDoes the zombie girl make it out alright?</span></div></div>",
            "created":1470590040,
            "id":2192400,
            "title":"Her rotten flatulence gives her away and she is..."
        },
        "121112121":{
            "author_id":"luckykid77",
            "author_name":"K.D.P",
            "choices":[
                "Using her new super strength Genevieve unblocks the cave and escapes!",
                "The two Demons catch up to her! Who knows what fate they have in store for her!"
            ],
            "content":"<div class=\"\"><div> <span>In the heat of the moment, Genevieve panics and tries to find her way out of the cave avoiding the deep bat guano. She finds but the exits caves in from the violent fighting between the werebats and the Demons Sisters and Genevieve runs and smacks herself into the blockage breaking a few rocks with her body...Genevieve finds that her zombification has given her super strength and she decides to clear the cave-in.<br>\r\n<br>\r\nThe Demons Sisters notices that they have an unwanted visit after they have killed off the angry avenging werebats.</span></div></div>",
            "created":1473762900,
            "id":2209693,
            "title":"Unfound Strength!"
        },
        "12113":{
            "author_id":"luckykid77",
            "author_name":"K.D.P",
            "choices":[
                "A village of living humans, but they weren't aware of her undead state.",
                "A village of various beastfolk..."
            ],
            "content":"<div class=\"\"><div> <span>The undead zombie girl amazingly swims for miles through the deadly swamp of the woodlands, she realized that she's able to somehow swim through the deadly quicksand without sinking into it.<br>\r\n<br>\r\nShe then can see a village up ahead. The girl can see people, but can't get close enough to see their faces. When she finally makes it to the village, she see's that it's...</span></div></div>",
            "created":1390882980,
            "id":1734198,
            "title":"A nearby village."
        },
        "1212":{
            "author_id":"luckykid77",
            "author_name":"K.D.P",
            "choices":[
                "She win the fight the giant plant by killing it.",
                "She get's eaten (but doesn't die again)",
                "Something or someone comes to her aid..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She turns around to see a giant carnivorous plant-like creature that's to size of a pine tree! It grabs her by the legs and picks her up, but she cuts herself free with her axe, and she begins to fight the creature...</span></div></span></div>",
            "created":1343860980,
            "id":1395609,
            "title":"Check her legs..."
        },
        "13":{
            "choices":[
                "Throw herself into the quicksand out of remorse for the deer",
                "Jump into the quicksand to see if there is anything more satisfying in there",
                "Continue on to a road",
                "Find a source of water"
            ],
            "content":"<div class=\"\"><div> <span>As she begins her journey she begins to feel a sharp, yet indistinct pain in the pit of her stomach, it was hunger.  Suddenly a scent filled her nose that sent a euphoric sensation though out her body.  It was the scent of fresh live meat with blood still beating its way through it.  Instantly she knew which direction it was in and sprinted towards it.  She rammed it, knocking it over.  She recognized it as a deer as it struggled for dominance.  Despite the fight it put up she soon wrestled it to the ground and began ripping it apart.  She dug her hands into it's body and tore out large chunks of flesh.  Shoving pieces into her mouth she realized what she was doing.  <br>\r\n<br>\r\n       * * * *<br>\r\n<br>\r\n\"But mom! I don't want to go to the zoo,\" young ominous voice complained.<br>\r\n<br>\r\n\"Honey, all of your friends are going.  Don't you want to go see them?\" This voice is older, maybe late twenties.  It has a sweet and serene sound to it that somehow put the girl to ease.<br>\r\n<br>\r\n\"Okay.\"<br>\r\n<br>\r\nFlashes of kids at a party, wearing hats and eating cake.  Suddenly a flash of a deer giving birth to a new faun. Crying.<br>\r\n<br>\r\n       * * * *<br>\r\n<br>\r\nBlood dripping down her chin she remembers that it was a birthday party when she was six. Her friend, the name still escapes her, wanted to have her birthday party at a zoo and a deer gave birth maybe thirty feet from where the party was.  All of the children ran over to watch it while their parents discouraged such a notion.  She finds herself no longer satisfied with what she was eating.  She continued walking and found herself at a quicksand bog.  She decides to...</span></div></div>",
            "created":1253941200,
            "id":766233,
            "title":"The Hunger"
        }
    },
    "info":{
        "author_id":"luckykid77",
        "author_name":"K.D.P",
        "brief_description":"The poor undead must quest to find out how she died...",
        "created":1253942520,
        "description":"<td align=\"left\" class=\"norm\">This poor young little girl wakes up out of unconsciousness in a swamp only to find out that she has just come back from the dead as a zombie, but her mind is still her own and she has lost some of her memory. She must find her way out of the swamps, regain her lost memory, and must figure out how she died...<br>\r\n<br>\r\n<br>\r\n<b><span class=\"cgreen\">The things this interactive may contain:</span></b><br>\r\nViolence/Blood/Gore<br>\r\n<br>\r\nFarting/Burping<br>\r\n<br>\r\nSmell fetish (mostly decomposition odors and farting)<br>\r\n<br>\r\nAnimal scat<br>\r\n<br>\r\nQuicksand sinking<br>\r\n<br>\r\nLoli (As long as it doesn't lead to loli sex or any other gruesome ends)<br>\r\n<br>\r\n<b><span class=\"clred\">The things this interactive may NOT contain:</span></b><br>\r\n<br>\r\nLoli Sex<br>\r\n<br>\r\nExcess Nudity<br>\r\n<br>\r\nHuman Scat</td>",
        "id":1602752,
        "image_url":"https://www.writing.com/main/images/action/display/ver/1594301390/item_id/1602752.png",
        "last_full_update":1594304940,
        "modified":1594304940,
        "pretty_title":"The Lonely Zombie girl"
    }
}