{
    "chapters":{
        "1":{
            "author_id":"rbm5",
            "author_name":"RBM5",
            "choices":[
                "Sally ",
                "Rouge",
                "Vanilla",
                "Whisper",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>The story began at Tails’ lab within the Mystic Ruins as he was finishing his latest invention that would make him seem irresistible to any woman who would hear his voice as he was coming around that age in which he started to find women attractive but not old enough to gained the experience to know how to properly ask them out thus he resorted to this shortcut. “Now just one more twist...” The fox told himself as he tightened one last screw. “Perfect now to fire it up!” The fox ran over to a large red button on the side of the device that filled a corner of the place and simply clicked it with his index finger causing the machine to release a glowing green liquid that filled up an empty cup Tails set up earlier to catch it all. “Now to see how well it works...” The fox took the cup and chugged it’s contents nearly puking as he did so, to say it tasted horrible would be an understatement. “Ugggghh...this better work...” Tails now truly had to test the results as he pulled out his Miles Electric and went to call Sally Acorn whom was holding a meeting with several female heroes.<br>\r\n<br>\r\n“Now that we have discussed the key threats of Mobius and their current statuses we can discuss smaller issues.” Sally had called the meeting primarily to discuss any issues heroes from around the globe had and figure out how to solve them together with the princess leaving it up to Nicole who was chosen however knowing of this Tails had actually hacked the AI companion so that said selected people were all women as Rouge was there for Team Dark, Sally and Bunnie for the Freedom Fighters, Barby Koala for the Downunda Freedom Fighters, Wave from the Babylonian Rogues, Tangle and Whisper for small factions of rebel groups, and Vanilla the Rabbit as a voice for the every day Mobian who wouldn’t be able to fight against foes like Eggman. “Well your highness if I may some of the young male heroes like Tails have been showing some odd behavior as of late...” Vanilla mentioned as Sally was about to ask about said behavior her Miles Electric she had placed in the middle of the table they all sat at started ringing with Tails on the other end. “Seems we can ask Tails about how he has been acting right now, Nicole place answer it as well as put him on speaker so we can all hear him.” That is exactly what the fox and AI were hoping for as Tails suddenly covered the screen and spoke, “I’m not interrupting anything important am I?” The fox spoke with some slyness to his voice but made sure to make it sound polite however as if the concoction didn’t work he didn’t want Sally to be angry at him. Once the women heard him speak however something clicked within their heads as they now not only thought Tails was the most attractive thing ever but some even started to drool. “Oh nothing is as important as you...” Since she was being addressed to the princess couldn’t help but answer. “Great can one of you come over to my place in the Mystic Ruins? Thanks!” With that said Tails signed off leaving the women ticked, “Wow how rude can that brat act? Thinking he can speak to any of us like that just because he’s handsome!” Rouge scoffed as Vanilla continued with the topic she spoke of earlier, “This is what I was trying to say earlier he’s starting to become quite naughty as of late...” The word ‘naughty’ hung up with all the women as they all came to the conclusion that they needed to teach him a lesson but in a way that would meet their current perversion as each formulated their own plan as they came together to decide which girl would accept Tails’ ‘request’.</span></div></div>",
            "created":1601074020,
            "id":2909919,
            "title":"The beginning "
        },
        "12":{
            "author_id":"coolzebra",
            "author_name":"Dreamsage",
            "choices":[
                "seduce him then knock him out to get to the second phase of her plan",
                "Play it along and see where it leads",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Rouge got up annoyed and started to walk away. The girls noticed this and look at her. \"Your going there Rouge?\"Sally said curious. Rouge looks at her with a pissed off look. \"Of course i am! Im gonna teach that brat of a fox a lesson for talking to us like that\"She said. \"Good luck Rouge\"Vanilla said in her calm yet worrying tone. Rouge scoffs \"I dont need luck\"she said before flying away.<br>\r\n<br>\r\nMeanwhile Tails was preparing his place for the female that decided to arrive. He had a smug grin as he did so. \"Finally i will have some action\"he thought.<br>\r\n<br>\r\nRouge eventually reached his place and banging on the door* \"Tails open up!\"Rouge said. She was tapping her shoe on the ground until the door opened revealing tails. \"Rouge what a surprise!\"Tails said amazed. Rouge slightly flinched as his voice felt rather smooth and rather made him be more handsome. However she shook off the feeling as best she could and needed an excuse on how to make him believe that he was in control of the situation</span></div></div>",
            "created":1601182740,
            "id":2910749,
            "title":"Rouge"
        },
        "15":{
            "author_id":"rbm5",
            "author_name":"RBM5",
            "choices":[
                "Wave",
                "Barby",
                "Tangle",
                "Bunnie",
                "They convince someone outside of the group to go"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Select one</span></div></span></div>",
            "created":1601074140,
            "id":2909920,
            "title":"Someone else"
        },
        "155":{
            "author_id":"rbm5",
            "author_name":"RBM5",
            "choices":[
                "Amy",
                "Julie-Su ",
                "Jewel",
                "Sticks ",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The women agreed that if anyone of them went they felt like they would end up having sex with him rather than teach him any lesson so they decided to ask a female friend outside of the group to talk with him but who answers the request?</span></div></span></div>",
            "created":1604115660,
            "id":2932010,
            "title":"They convince someone outside of the group to go"
        }
    },
    "info":{
        "author_id":"coolzebra",
        "author_name":"Dreamsage",
        "brief_description":"Tails stopped making pranks on the females of Mobius and they are getting their paybacm",
        "created":1600633800,
        "description":"<td align=\"left\" class=\"norm\"> The females of Mobius have had it with Tails. He thinks he can get away from the many things he did to them or told them. They are getting their payback and they knew one way on how to get it.</td>",
        "id":2232834,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604115660,
        "modified":1604115660,
        "pretty_title":"Payback on Tails"
    }
}