{
    "chapters":{
        "1":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Jasmine",
                "Haylee",
                "Brianna",
                "Baylee",
                "More options"
            ],
            "content":"<div class=\"\"><div> <span>You just showed up for your first day at your new school, you're a sophomore in high school and so far everything was going good.<br>\r\n<br>\r\nIt was nearing the end of the day and you were about to walk out of the school gym when all of a sudden you feel a sharp pain in the back of your head then everything goes black.<br>\r\n<br>\r\nWhen you finally came to you were in a locker room and see...</span></div></div>",
            "created":1545022800,
            "id":2590250,
            "title":"First Day"
        },
        "11":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "She makes you smell her socks",
                "She makes you smell her shoes",
                "She makes you lick her socks",
                "She makes you lick the insoles of her shoes",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>You see Jasmine sitting there she has dark brown hair and a fit body. She's looking at you with a big smile. You try to speak out but realize that your mouth has been taped shut.<br>\r\n<br>\r\n\"Aww, are you scared? Don't worry I'll take good care of you.\" She says as she sets her shoes on your shoulders. You can smell a faint odor, but can't quite make out what it is. You see she is wearing black athletic socks that look quite wet. \"As long as you be a good slave. Look around this is your new home now. You may even end up coming home with me.\" She says. You start getting scared and start to struggle. \"Oh are you ready to start?\" She says. You look at her confused and she responds by starting to untie her shoe laces.<br>\r\n<br>\r\n(This is a picture of her shoes <a rel=\"nofollow\" href=\"http://www.shoezoo.com/media/catalog/product/cache/1/image/8f516e588696e43446cb4318f9ddd697/724979_007-large2.jpg\" target=\"_blank\">http://www.shoezoo.com/media/catalog/pro...</a> )</span></div></div>",
            "created":1545022800,
            "id":2590256,
            "title":"Jasmine"
        },
        "111":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Smell my bare feet ",
                "Lick and suck my socks clean",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>( these are the socks she's wearing <a rel=\"nofollow\" href=\"https://i5.walmartimages.com/asr/aa1d3cf9-5c7b-41cb-afee-634223e9f84d_1.10702f0d3d1021e47833f64ac2325fe5.jpeg?odnHeight=450&amp;odnWidth=450&amp;odnBg=ffffff\" target=\"_blank\">https://i5.walmartimages.com/asr/aa1d3cf...</a>)<br>\r\n<br>\r\nYou look on in horror as she pulls one shoe off. Her socked foot slides out of,the shoe with a disqusting *squelch* sound. Immediately her foot stench fills the room and you finally know what that stench you smelled earlier was.... It was this girls feet!!! \"Damn these are ripe! That's what 2 months of wear will do to a girls socks.\" She says.<br>\r\n<br>\r\nShe looks back at you and says \"Are you ready slave. This is going to be the worst thing you've ever smelled.\" She slowly starts moving her socked foot towards your face. All you can do is look on in horror. As it got closer the smell intensified and you can swear you see sweat dripping off her feet.<br>\r\n<br>\r\nHer foot finally makes touchdown on your face with her toes covering your nose forcing you to breath in the foul stench of her feet. You start to move your head from side to side in an attempt to get her foot off your face but it's no use. So you try to hold your breath. Her response to this is \"Go ahead, you'll have to breath some time, and when you do it will be a biiig breath of smelly feet.\" 'Oh shit', you thought. 'She's right there's no use', so you breath in her feet some more and start to cry. \"You better get used to this because this is what everyday is going to be like for you.\" She said. <br>\r\n<br>\r\nAs you sit there sniffing her toes she starts to rub her sweaty sock all over your face spreading her foot sweat everywhere. Just when you thought you were getting used to the smell, she takes off her other shoe and the smell in its entirety is renewed as she plants her other socked foot onto your face. She rubs it all over forcing your nose to explore every nick and cranny of her sweaty sock. She even made you smell between her socked toes. All she could do was laugh as you smelled her feet. \"So it's been about 2 hours, are you ready for something different?\" All you could do was mmph into the tape that was around your head. \"Ok I guess you can....<br>\r\n<br>\r\n</span></div></div>",
            "created":1545103440,
            "id":2590274,
            "title":"She makes you smell her socks"
        },
        "1111":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Gonna go back to my place\"",
                "Gonna put you to bed for today\"",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>Smell my bare feet.\" She says as she reaches down and starts peeling off one of her socks. She seems to be having some trouble so you already know that they are VERY sweaty. Once she finally got the first sock off she draped it over your shoulder and went to take off her other sock. You could feel the sweat soaking into your shirt.<br>\r\n<br>\r\nOnce she got the other sock off you notice the smell. SOMEHOW IT GOT WORSE!!! You look in horror as she lifts both her feet up. They were covered in sweat and dirt. She had sock lint in between her toes not to mention a lot of toe jam. \"I can tell you're excited to have these on your face. So why give you one at a time when I can give you both!\" 'Mmphh', you say through your gag. \"Ok ok I won't make you wait any longer. Aren't I the best!\". With these words she planted both of her reeking feet on your face and started to rub them all over.<br>\r\n<br>\r\nShe seemed to really like rubbing your nose all over her feet, making you smell every inch. She expeccially likes putting your nose in between her grimy toes, , and making sure you take deep breaths. \"Ahhh, it feels so good to have someone sniffing your feet. I hope you're enjoying this as much as I am.\" Mmph \"I'll take that as a 'yes'\".<br>\r\n<br>\r\nShe moves her feet around on your face until she finds a position she's comfortable in and then leans back in her chair. She chose to put your nose in between her toes and put her other foot in your hair. After another hour of smelling this girls toes she finally takes her feet off your face and says.<br>\r\n<br>\r\n\"Alright slave we're.....</span></div></div>",
            "created":1545179760,
            "id":2590558,
            "title":"Smelling Jasmine's bare feet"
        },
        "11111":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Her mom waiting to have her feet sniffed.",
                "The rest of the girls ready to torture your nose.",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>gonna go back to my place.\" She says. She unties your legs but keeps your hands tied. Then puts a collar around your neck and walks you out of the school. Thankfully everyone in the school had left at this point. So you weren't completely embarrassed. She shoves you into the back of her car and gets in the drivers seat. \"Hope you don't mind, but I like to drive barefoot.\" She says as she takes her shoes and socks off again, filling the car with her horrid stench. \"Oh and to keep you busy.\" She rips the tape off your mouth and holds her socks to your lips. \"Open wide! This is so you have something to do on the drive home!\". Reluctantly you open your mouth.<br>\r\n<br>\r\nShe shoves the socks and puts more tape over your mouth. Now you're forced to sit in the back of her car and suck on her dirty, sweaty, crusty socks. The taste is indescribable. Its a mix of dirt, sweat, and just all around grossness. You want to puke but you can't due to the tape covering your mouth. All you can do is sit there and suck on her socks the whole ride home.<br>\r\n<br>\r\nShe pulls up to her house and forces you out and walks you up to the front door. \"Are you ready slave? Because you're in for a surprise!<br>\r\n<br>\r\nShe opens up the door and you see...</span></div></div>",
            "created":1545336840,
            "id":2591308,
            "title":"Back to Jasmines"
        },
        "111111":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Smell both our bare feet?\"",
                "Lick our bare feet?\"",
                "Lick my socks clean?\""
            ],
            "content":"<div class=\"\"><div> <span>(This is her moms socks <a rel=\"nofollow\" href=\"https://www.socks4life.com/media/catalog/product/cache/1/image/9df78eab33525d08d6e5fb8d27136e95/C/9/C9PRPHT_9.jpg\" target=\"_blank\">https://www.socks4life.com/media/catalog...</a> )<br>\r\n<br>\r\nAs she opens the door your nose is filled a familiar smell. The smell of sweaty feet. \"Slave, meet my mom. She has really smelly feet, probably worse than mine.\" Says Jasmine. \"Hi there, Jasmine told me to come home and take my shoes off because she had a surprise.\" Says her mom. <br>\r\n<br>\r\n\"So... How'd you like my daughters feet?\" How could she even ask that question, scratch that how was she ok with her daughter forcing a random person to smell her feet. \"You're about to find out where she got her stink from\" says her mom. <br>\r\n<br>\r\nOnce she said that Jasmine forced you to the ground in front of her mom and her mom planted both socked feet on your face and started rubbing them all over. \"I work 10 hours a day, so when I come home I don't usually have time to wash my clothes let alone my feet. So my socks haven't been washed for about 3 months. Hope you like them.\"<br>\r\n<br>\r\nAll you could do was sit there and smell this woman's sweaty dirty socks. You didn't think feet could smell worse than Jasmine's but this woman proved you wrong. They made you take deep breaths of her socked toes burning your lungs with each breath.<br>\r\n<br>\r\n\"Now how would you like to....</span></div></div>",
            "created":1546153680,
            "id":2595910,
            "title":"Her mom waiting to have her feet sniffed."
        },
        "1111111":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "In Jasmines room",
                "Shrunken",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>...smell our bare feet.” <br>\r\n<br>\r\n“Good idea mom! Alright slave take off my moms socks while I get these sweaty shoes off” Jasmine tells you.<br>\r\nYou immediately start to take off her moms socks afraid of what she might do if you don’t listen.<br>\r\n<br>\r\nAs you peel her socks off the smell gets 10x worse. Then it gets worse again when Jasmine puts her feet up on the table. Jasmines feet have gotten really sweaty again in the time that you’ve been smelling her moms socks.<br>\r\n<br>\r\n“Sniff” they both say as Jasmine yanks on your leash and forced your face into their sweaty smelly feet. They rub your nose all over their feet, in between all toes, up and down their arches. Eventually the smell gets to you and you pass out when you wake up you’re </span></div></div>",
            "created":1566096720,
            "id":2704090,
            "title":"Sweaty feet sniffing"
        },
        "11111111":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Her dirty sweaty smelly socks that look nastier than ever",
                "Her bare sweaty dirty soles",
                "Actual food that has been smushed and smothered by her feet"
            ],
            "content":"<div class=\"\"><div> <span>You wake up with your hands tied to the foot of what you assume is jasmines bed. Your mouth is still taped but the nastiness that was jasmines socks is no longer there.<br>\r\n<br>\r\nJust as you were about too rip off the tape Jasmine walks into the room and you immediately stopped what you were doing out of fear. “No it’s ok foot bitch you can take the tape off” she says. You weren’t fond of the new nickname but at least she was letting you take the tape off.<br>\r\n<br>\r\nAs she walks over to sit on her bed you notice she seems very sweaty. “So I went out for a run to get your dinner, it took a couple hours to get ready but it got ready nonetheless” she says as she sets a plate in front of you. “Oh did I not tell you? I prepared your food which means it’s in these things” she says excitedly while swinging her shoe covered feet up onto the plate.<br>\r\n<br>\r\n“Go ahead and take them off” so you do as she says and your horrified to see</span></div></div>",
            "created":1567466340,
            "id":2712471,
            "title":"It’s dinner time"
        },
        "111111111":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Skip to when she gets back",
                "The grueling sock cleansing process",
                "Readers choice "
            ],
            "content":"<div class=\"\"><div> <span>“Alright get to eating” she says while smiling. “I know you want to sit there and enjoy the aroma of your dinner but you need to start clea- eating your food. It’s very nutritious and if you eat it all I’ll bring you some water!” Out of desperation for water you start to lick up and down her disqusting socks. It’s the worst thing you’ve ever tasted. It’s indescribable how horrible her socks taste. You can feel the grossness of all the dirt, dried sweat, and sock lint stick to your tounge while you’re licking. The worst part is that you have to swallow everything otherwise you may not get water.<br>\r\n<br>\r\n“Maybe try sucking the toes, there’s a lot of yummy stuff around the toe of the socks” so you do. <br>\r\n<br>\r\n“Welp I’ve got to go basketball practice, since you did so good at cleaning the socks you can clean the insides of them.” As she says this she takes her socks off and turns them inside out them stuffs them into your mouth then tapes it shut. “You clean those and I’ll bring you water once I get back” although it sucks to have these horrible socks in your mouth you have to clean them if you want a chance at getting water.<br>\r\n</span></div></div>",
            "created":1567487760,
            "id":2712643,
            "title":"Sock lint dinner"
        },
        "1111111111":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Start drinking",
                "I’m not drinking that crap (punishment)",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>*SEVERAL HOURS LATER*<br>\r\n<br>\r\nYou hear the door swing open to see its Jasmine carrying a big bowl of iced water. She walks over to you and sits the bowl in front of you. “Don’t start drinking yet give me a minute” she grabs a chair and places it in front of the bowl.<br>\r\n<br>\r\n“So I was thinking about giving you a bottle of just foot sweat instead of water but I’m not that evil. Instead I’m just going to do this” as she says that she pulls out a bag of socks “These are the girls basketball team socks, I told them I would clean their socks but I think they would add a great flavor to your water right now.” She drops all the socks into the water. The water turns murky because of the sweat and dirt that’s now been mixed into it.<br>\r\n<br>\r\n“Oh there’s one more thing” oh god please no more! “So since you were cleaning my socks during the practice I had to practice sockless which means my feet are hot sweaty dirty and HOT! So seeing as how this bowl is the closest thing I can get to cooling them off.” She pulls off her shoes and turns them upside down over the bowl as all of the sweat that pooled inside them poured into the bowl. Right after she plunges her feet into the water. “Ahhh that feels amazing, oh right the tape.” She reaches over and rips the tape off your mouth and takes her socks to inspect them. <br>\r\n<br>\r\n“Wow I’d dint expect you to actually get them clean, glad I can rely on you for later occasions! Anyways you should start drinking the water you wanted. Here maybe this will help.” She places a straw between her toes. “Enjoy, Foot Slave.”</span></div></div>",
            "created":1567563780,
            "id":2713082,
            "title":"WATER!!!"
        },
        "11111111111":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Suck it out of those dirty socks",
                "Drinking it like a dog",
                "Lick it off my feet"
            ],
            "content":"<div class=\"\"><div> <span>Since you had just been sucking on her sweat soaked socks you thought this couldn’t be that bad. Oh how wrong you were. As soon as you took a sip from the straw in between her toes you instantly recoiled. You forgot there were other people sweaty dirty socks in the bowl which gives the foot sweat water a different taste than your captors foot sweat.<br>\r\n<br>\r\n“By the way, I want none of this water wasted so you better drink it all up.” So you put your mouth to the straw and start drinking only to find that the bottom of the straw was being blocked by one of the gross socks in the bowl. So you try to move the straw somewhere else in the bowl when Jasmine stops you and says “That straw needs to stay between my toes, it doesn’t matter which pair of toes it just needs to be between my toes.” <br>\r\n<br>\r\nYou put the straw back between her toes and start drinking. Right as you take your first sip you feel sock lint that was in between her toes enter your mouth and go down your throat. You see her smile and chuckle to herself. So you decided to try and get on her good side and switched the straw to all her toes and sucked the sock lint from them. <br>\r\n<br>\r\nUnaware to you she was filming the whole thing and fought you purposely sucking the sock lint from her toes. So she decided to find out how far she could take it knowing full well she would never treat you any better ever.”Hey foot slave I want you too drink the rest of,the water by...</span></div></div>",
            "created":1570079820,
            "id":2727187,
            "title":"Start drinking"
        },
        "111111111111":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "The next day at school",
                "You woke up shrunk",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>As soon as she said this a look of horror washed over your face. She picks up one of the socks with her toes and holds it up to your face. It’s like you can feel the terrible smell coming off both her feet and the sock.<br>\r\n<br>\r\n“Get sucking” she tells you. Not wanting to be punished you grab the drenched sock and put it up to your mouth. You touch the dirty sock to your tongue and almost immediately pulled it away. The taste was so bad. There was a lot of dirt on the sock and the added foot sweat water didn’t help.<br>\r\n<br>\r\nShe gives you an angry glare so you quickly got back to sucking. Several hours passed and you drank the whole bowl of water. Cleaning all the socks in the process.<br>\r\n<br>\r\nAfter you finished she didn’t say a word to you. She just put tape over your mouth, tied your hands behind her back, then finally she tied her shoe over your nose and went to sleep.</span></div></div>",
            "created":1570231080,
            "id":2728082,
            "title":"Suck it out of those dirty socks"
        },
        "1111111111111":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "First period",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>After a long sleepless night you were woken up by Jasmine pulling her shoe off your face and putting her socked foot into it. <br>\r\n<br>\r\n“Time to go to school. I think today will be a good day. I told my teammates to wear their smelliest socks. I also changed your classes so you now only have 7 out of 8 classes. In your 8th period you will be tied up in the girls locker room while we get our feet smelly during athletics.” <br>\r\n<br>\r\nBREAKFAST<br>\r\n<br>\r\nWhen you and Jasmine sit down at a table she pushes you onto the ground and sits a plate in front of you. “You sit on the ground, hey Haylee come over here with those smelly socks of yours.” She yells. “Oh my god! Is that the guy you had drinking the sock water last night?!” Haylee said.<br>\r\n<br>\r\nA look of horror spread across your face, she recorded that?! “Oh my god you’re going to love the breakfast I’m giving you today!” She says excitedly as she takes her shoes off and reveals her giant smelly dirty white crew socks. They have a strong smell but they aren’t as bad as Jasmines feet.<br>\r\n<br>\r\nHaylee brings her socked feet up to your face and plants her absolutely disgusting socks right onto your nose. \"Start smelling my amazing socks\" You decide to just give up and start taking deep inhales of her dirty socks barely being able to stop yourself from gagging each time. \"Holy shit this feel great!\" says Haylee. \"I know right, its amazing!\" Jasmine said. \"Now I think that you should start eating off of and cleaning these dirty socks!\" says Haylee. Jasmine kicks you and tells you too start licking Haylees socks.<br>\r\n<br>\r\nReluctantly you stick out your tongue and run it up her sweaty socked sole. The taste hits your taste buds like a train. It was pure torture licking up and down these socks. It feels like its been hours since you've started licking this girls dirty socks. in reality its only been 15 minutes. Then something snaps you back to the present. The bell is finally ringing an Haylee is putting her shoes back on. Before you can get onto your feet you feel a leash snap onto the collar around your neck. \"You have first period with me so keep remembering that smell and taste\" says Haylee. Then she yanks you up and walks you down the halls to your first class of the day. This is going to be a very long day. <br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1571721780,
            "id":2736625,
            "title":"The next day at school"
        },
        "11111111111111":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "2nd period",
                "Readers Choice",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n(What her socks would look like <a rel=\"nofollow\" href=\"https://www.instagram.com/p/B4fLDbmoG_A/?igshid=j8dgqvbunoii\" target=\"_blank\">https://www.instagram.com/p/B4fLDbmoG_A/...</a> )<br>\r\n<br>\r\nShe pulls you into your first period. Math. Once you walk in, she pulls you to the back of the class and sits you on the ground in front of a desk, which she proceeded to sit in. Almost immediately the teacher starts the lesson. You decided to make the most of your situation and tried to listen to the teacher and take notes. Haylee had other plans. She slipped both her shoes off and placed her giant socked feet on your face. You probably weren't going to get to learn much.<br>\r\n<br>\r\nDuring the lesson she rubbed her soles all over you face, especially around the nose area. Some of the dirt and sock lint from her socks wiped off onto your face. The smell was just as bad as you remember it. Indescribable. \"That's right foot boy, keep smelling. Actually smell deeper.\" She whispered to you.<br>\r\n<br>\r\nOther students around her started to take notice of the scent and turned to ask Haylee if she could put her shoes back on. Just as they were about to say something they noticed what she was doing to you. Some started laughing, and some just looked in horror. They thought the smell was bad from where they were, but nothing could compare to how you felt, being right under them.<br>\r\n<br>\r\n\"People are starting to notice. Start licking my socks, foot bitch.\" She whispered to you. At first you resisted but she kicked you in the balls. You decided it was best to just listen. So you stuck out your tongue and took your first lick. Somehow it tasted worst than it did at breakfast. You kept licking, getting more and more dirt off of the sock each time. Other students just watched and laughed. Some of the other girls were asking Haylee if they could get their feet sniffed. She denied.... this time.<br>\r\n<br>\r\nIn an attempt to embarrass you even more she said more loudly \"Start sucking my socked toes!\". You stopped licking her soles and put her right foots toes in your mouth. You started sucking. You started crying from the humiliation. She decided to take it a step further and put her left foots toes over your nose. Forcing you to smell and taste her feet. <br>\r\n<br>\r\n\"Whats going on back there?\" the teacher yelled. Haylee didn't even seem fazed by this, she kept her feet right where they were. \"Nothing miss, just having some fun with the new kid.\" Haylee responded. \"All right, sounds good. Now then, I want everyone to have this paper turned in by Monday.\" How did she not notice this was torture. Or maybe she did and just decided it was none of her business.<br>\r\n<br>\r\n\"There are still 15 minutes left in class foot bitch. Get to work cleaning these socks.\" Haylee said. You started to lick her soles again and continued to suck on her toes. You cleaned off a good amount of dirt, and sock lint. You sucked all over her feet to get the sweat out of her socks. <br>\r\n<br>\r\nWhen the bell rang she pulled you up and walked you to second period.</span></div></div>",
            "created":1579325160,
            "id":2775068,
            "title":"First period"
        },
        "15":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Bailey",
                "More girls",
                "You wake up shrunken"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More options</span></div></span></div>",
            "created":1545022800,
            "id":2590251,
            "title":"More options"
        },
        "152":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Katelyn",
                "Jenna",
                "Alaina"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The new ones</span></div></span></div>",
            "created":1570158360,
            "id":2727694,
            "title":"More girls"
        },
        "153":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Jasmine",
                "Haylee",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You get up and look around and think to yourself \"why is everything so big?!?!\" When a someone comes in the room<br>\r\n<br>\r\n<br>\r\nWho came in?</span></div></span></div>",
            "created":1545022800,
            "id":2590264,
            "title":"You wake up shrunken"
        },
        "1531":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she know you're there?</span></div></span></div>",
            "created":1545022800,
            "id":2590266,
            "title":"Jasmine"
        },
        "1532":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Yes ",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she know you're there?</span></div></span></div>",
            "created":1545022800,
            "id":2590267,
            "title":"Haylee"
        },
        "1533":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Brianna",
                "All 5 girls",
                "More girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You see...</span></div></span></div>",
            "created":1545022800,
            "id":2590265,
            "title":"More choices"
        },
        "15331":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does she know you're there?</span></div></span></div>",
            "created":1545022800,
            "id":2590268,
            "title":"Brianna"
        },
        "15332":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Yes ",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do they know you're there?</span></div></span></div>",
            "created":1545022800,
            "id":2590269,
            "title":"All 5 girls"
        },
        "15333":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Katelyn",
                "Alaina",
                "More options "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More girls</span></div></span></div>",
            "created":1571269860,
            "id":2733982,
            "title":"More girls"
        },
        "153333":{
            "author_id":"justen4450",
            "author_name":"Justen4450",
            "choices":[
                "Jenna",
                "Readers choice",
                "Readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Last one promise</span></div></span></div>",
            "created":1571269920,
            "id":2733984,
            "title":"More options "
        }
    },
    "info":{
        "author_id":"justen4450",
        "author_name":"Coolguy123764",
        "brief_description":"Will give points for good chapters",
        "created":1545095220,
        "description":"<td align=\"left\" class=\"norm\">You just transferred to your new school..... But some of the girls decide to make you their new slave.<br>\r\n<br>\r\nAll girls in the story are 18 and fictional<br>\r\n<br>\r\nUsed to be a foot story but i want people to add so nearly anything goes now.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nRULES!<br>\r\nNo scat.<br>\r\nThe character can not like anything that happens to him.<br>\r\n<br>\r\n<br>\r\nOther than that have fun!<br>\r\n<br>\r\nCharacters!<br>\r\n<br>\r\nJasmine - Short, small boobs, small ass, and has big feet for her size. She does cross country, basketball, cheerleading and track so her feet sweat a lot, her feet always smell, rarely washes her socks. Has lots of different shoes that she loves to make you smell. Loves to have her socks and feet sniffed and worshiped by you. She also likes making you sniff her friends socks and shoes.<br>\r\n<br>\r\nBrianna - Short, medium boobs, small ass. Jasmine's cousin, plays basketball, rarely washes socks, loves to have her socks feet and boobs  worshiped. She loves humiliating you in any way she can<br>\r\n<br>\r\nHaylee - Tall, small boobs, small ass. Jasmine's best friend, plays basketball so her feet sweat a lot, loves to have her socks and ass sniffed and worshiped. When shes on her own she like to fart. She will also help Jasmine torture you with feet.<br>\r\n<br>\r\nBaylee - Short, Cheerleader, isn't in athletics but finds ways to keep her feet and socks smelly, rarely washes socks, loves to have her socks and feet sniffed and worshiped. Will help Jasmine torture you with feet. Likes all kinds<br>\r\n<br>\r\nBailey - Tall, big boobs, big ass. cheerleader, plays basketball so her feet sweat a lot, likes to torture using her ass and boobs, loves being worshiped.<br>\r\n<br>\r\n<br>\r\nNEW GIRLS!!!!<br>\r\n<br>\r\nKatelyn - Medium size, she does cheerleading, track, softball, soccer. She wears white socks. When she’s not doing sports she wears slides with the same socks she wears for the 4 sports she does. Sometimes when she’s outside she takes off her slides and walks with only socks on or barefoot. Her socks are always dirty. They have a very sweaty earthy smell on her socks and feet. She loves to have her socks and feet worshiped.<br>\r\n<br>\r\nJenna - Tall, Cheerleading, track, softball. Unless she’s required too she doesn’t wear socks. So at practices for her sports she wears her shoes barefoot. At games she wears 1 pair of socks for all sports. She loves for people to smell her farts and her armpits after a good workout.<br>\r\n<br>\r\nAlaina - Tall, Cross country runner, Track, Softball. She wears white nike crew socks. Every time she gets done with a run her shoes always have sweat just pooled inside them. Her socks drip with sweat after a long run.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":2177683,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1579325160,
        "modified":1579325160,
        "pretty_title":"High School Girls Feet Ass and Boobs"
    }
}