{
    "chapters":{
        "1":{
            "author_id":"phoenixdeath",
            "author_name":"darkflame8",
            "choices":[
                "The Captains",
                "The Vice-Captains",
                "The Special Operatives"
            ],
            "content":"<div class=\"\"><div> <span>The selections are broken into The Captains, The Vice-Captains and the Special Operatives in the Human world.<br>\r\n<br>\r\nI should also point out that the girls can't grow higher than 120 metres (400 ft) tall.<br>\r\n<br>\r\nEDIT: because of a certain person who shall remain nameless I shall point this out. Rukia and Yoruichi are in the Special Operatives who assitst Ichigo. DO NOT create useless branches that have been already covered by another branch. If I see anything like this I will delete the chapter. Read the rules before you jump in.</span></div></div>",
            "created":1230784200,
            "id":629765,
            "title":"It begins"
        },
        "11":{
            "author_id":"phoenixdeath",
            "author_name":"darkflame8",
            "choices":[
                "Soi Fon",
                "Retsu Unohana"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are the most powerful women of the Soul Society</span></div></span></div>",
            "created":1230784440,
            "id":627268,
            "title":"The Captains"
        },
        "12":{
            "author_id":"phoenixdeath",
            "author_name":"darkflame8",
            "choices":[
                "Rangiku Matsumoto",
                "Momo Hinamori",
                "Isane Kotetsu",
                "Nanao Ise",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Next in Line</span></div></span></div>",
            "created":1230784620,
            "id":627270,
            "title":"The Vice-Captains"
        },
        "121":{
            "choices":[
                "Rangiku meets up with her captain",
                "Rangiku finds another strange bottle",
                "Something elses happens"
            ],
            "content":"<div class=\"\"><div> <span>Rangiku was drinking like she always in her room and as she continued enjoying her short break,she noticed a strange bottle. She picked it up and stared at it for a few seconds. She looked on the table and noticed it was the last bottle. She wasn't really that drunk... yet,but just drunk enough not to make a good choice. She drank down the whole bottle and she let out a sound of pleasure. \"Man,that last bottle was great,although it tasted a bit different than normal. Oh well,it was still a fine last drink.\" said Rangiku happly. <br>\r\n<br>\r\nAs she stood up,she almost fell over. She giggled a little and corrected her posture. She left the room and as she walked down the hall,she began to feel a little odd. Suddenly her soul reaper uniform began to get a bit snugger around her hips and breasts. Rangiku's breasts started to expand a bit and she noticed that. She cupped her large breasts with her hands and she could feel them growing between her fingers!! \"Holy cow,my boobs are getting bigger!! Oh this is great,im becoming a even hotter woman.\" Rangiku said with total pleasure in her voice.<br>\r\n<br>\r\nBut this exciment wasn't going to last long. Soon rangiku's breasts stopped growing and her whole body started to inch upward. Rangiku gained 5 inches on her full height in just little more than 5 seconds!!! Her height growth didn't last that long,but it wasn't over yet either.</span></div></div>",
            "created":1231025040,
            "id":628664,
            "title":"Rangiku's last drink"
        },
        "1211":{
            "choices":[
                "She flirts a little",
                "She's too surprised to think straight",
                "She gets up but he's stuck"
            ],
            "content":"<div class=\"\"><div> <span>Rangiku stumpled down the hallway not because she was drunk from all the drinking but because her new height took some getting used to. Just when she thought she had gotten the hang of it she trips over...something, and falls flat on her face.<br>\r\n<br>\r\n\"Hey, that's weird. It feels like I'm on something, but that can't be; this hallway has always been empty.\"<br>\r\n<br>\r\n\"Rangiku get off of me!\" she heard a muffled order.<br>\r\n<br>\r\nIt was then she realized what she must be on top of was her cute little captain. She couldn't help but blush because her size (and bust size) had buried Hitsugaya deep into her cleavage. Not that this was something new to her, she tended to do it to me five times a week, but now he was completely swallowed by her boobs.<br>\r\n<br>\r\n\"Oh! Captain...\"</span></div></div>",
            "created":1278812700,
            "id":915464,
            "title":"Rangiku meets up with her captain"
        },
        "1212":{
            "choices":[
                "Rangiku tries to escape the cramped hallway",
                "Rangiku starts to grow again"
            ],
            "content":"<div class=\"\"><div> <span>Rangiku was so joyed with her new even larger breasts. She was so happy with the enhancements. She wanted to show them off to her captain. She walked out of her room and down the hallway she happly went. But as she was going to go and enter the next set of halls,she noticed a bottle sitting on the floor. She walked up to it and picked it up. She examine it and noticed it was the same bottle that made her breasts grow. \"Oh no way!! It's another one of those bottles that made my breasts grow.\" Rangiku said with pure joy.<br>\r\n<br>\r\nShe quickly uncorked it,and chugged the whole thing down till there was only a drop left in it. \"Even bigger breasts,here they come.\" Rangiku said with eagerness. Not even a second passed before she started to notice the changes beginning. Rangiku was so excited,but her excitement quickly faded away. Her breasts weren't growing any bigger. \"All man,why aren't they growing!!?\" said Rangiku. But to her surprise,she felt her butt getting a tad bit bigger and the rest of her body inching upwards!! \"Wait...am I getting taller!!?\" Rangiku said in fear. She watched as the floor rose further and further away from her,and the walls beside her grow closer and closer to her sides. Soon rangiku could feel her whole soul reaper uniform starting to become extremely tight on her whole body. The pant's legs of her uniform stretched up her long beautiful legs.<br>\r\n<br>\r\nHer sleeves started to grow tighter around her arms and they're splitting apart as they were being pulled up her arms. Then the bottle's juices,began to take effect again in her breasts,soon her breasts began to start expanding again!! The opening were her breasts are,was beginning to show more and more cleavage. Then suddenly Rangiku felt a sharp pain on the top of her head. She looked up and saw it was the ceiling!! \"Wha...what? Is that the ceiling!?\" Rangiku said totally shocked. Rangiku's soul reaper outfit was torn a bit,but ti still was in good enough condition for clothing. Rangiku was starting to regret ever drinking that second bottle,or even the first one to be honest.<br>\r\n<br>\r\nWhat happens next to her?<br>\r\n</span></div></div>",
            "created":1231028760,
            "id":628675,
            "title":"Another strange bottle?"
        },
        "125":{
            "author_id":"phoenixdeath",
            "author_name":"darkflame8",
            "choices":[
                "Yachiru Kusajishi",
                "Nemu Kurotsuchi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The other vice-captains</span></div></span></div>",
            "created":1230784740,
            "id":627272,
            "title":"The Others"
        },
        "13":{
            "author_id":"phoenixdeath",
            "author_name":"darkflame8",
            "choices":[
                "Yoruichi",
                "Rukia",
                "Kūkaku Shiba (though not in the human world she still assists the living)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>These are the Female Operatives assisting those of the living world.</span></div></span></div>",
            "created":1230784980,
            "id":627275,
            "title":"The Special Operatives"
        },
        "132":{
            "author_id":"roman921",
            "author_name":"roman921",
            "choices":[
                "An unusual late growth spurt",
                "A defected soul candy",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How is Rukia gonna to grow?</span></div></span></div>",
            "created":1411933320,
            "id":1863361,
            "title":"Rukia"
        },
        "1321":{
            "author_id":"roman921",
            "author_name":"roman921",
            "choices":[
                "1-2 inches (slow growth)",
                "3-4 inches (slightly fast growth)",
                "5-6 inches (fast growth)"
            ],
            "content":"<div class=\"\"><div> <span>Rukia was enjoying her afternoon off at Kurosaki home. She was by herself while Ichigo was busy doing errands and his father took the girls to the park. Rukia was just laying on her bed in her closet room when she felt a strange tenderness in her chest. \"Huh? That's weird, I've never really felt this feeling before.\" Rukia then had tingling sensation throughout her body, mostly in her legs. How much is she going to grow?</span></div></div>",
            "created":1411952100,
            "id":1863532,
            "title":"An unusual late growth spurt"
        }
    },
    "info":{
        "author_id":"phoenixdeath",
        "author_name":"darkflame8",
        "brief_description":"The women of the Soul Society GROW.",
        "created":1230783840,
        "description":"<td align=\"left\" class=\"norm\">This Interactive is about the growth of the women of Soul Society. There are several rules that must be followed.<br>\r\n<br>\r\n1. Correct grammar and spelling. I will be lenient for simple typo's that could happen.<br>\r\n2. Write atleast more than one paragraph<br>\r\n3. NO male giants<br>\r\n4. NO stupid plots going off in random directions, this includes crossovers, this is strictly the Bleach Universe.<br>\r\n5. Keep the giantessses to their original mindset<br>\r\n6. NO original characters<br>\r\n7. The Girls CANNOT grow for absolutely no reason. There must be a reason behind the growth.<br>\r\n<br>\r\nI will allow:<br>\r\nGentle Giantesses (this is prefered)<br>\r\nAccidental vore<br>\r\nNudity<br>\r\nAccidental destruction<br>\r\n<br>\r\nI will NOT allow:<br>\r\nMassive Destruction<br>\r\nAnything to do with Feet<br>\r\nSCAT<br>\r\n<br>\r\nI will delete posts that do not follow the rules<br>\r\n<br>\r\nOne last thing.<br>\r\nI'm making it so that only the female Captains and seated officers can grow. (Yoruichi and Rukia can grow aswell) This means that Orihime, Tatsuki or any other girl of the living world CANNOT grow.<br>\r\n<br>\r\n</td>",
        "id":1510682,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1411952100,
        "modified":1411952100,
        "pretty_title":"Soul Society GTS"
    }
}