{
    "chapters":{
        "1":{
            "author_id":"groribe",
            "author_name":"Hello, Writing.com",
            "choices":[
                "Spongebob (duh!)",
                "Patrick (Twist)",
                "Krabs (Double Twist)",
                "Plankton (WTF?!)",
                "Who else from this show?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who do you think did it.</span></div></span></div>",
            "created":1284348840,
            "id":955874,
            "title":"Who is it?"
        },
        "11":{
            "author_id":"groribe",
            "author_name":"Hello, Writing.com",
            "choices":[
                "1 baby",
                "2 baby",
                "triplets",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How Many Baby(ies)</span></div></span></div>",
            "created":1284416100,
            "id":956225,
            "title":"Spongebob Squarepants is a Dad"
        },
        "112":{
            "choices":[
                "Yes ",
                "No, becuase he doesn't care that the babies are his",
                "Yes of course"
            ],
            "content":"<div class=\"\"><div> <span>\"Sandy! Are you home?\" <br>\r\nIt was Spongebob. I hadn't spoken to him since three months ago when I found out i was pregnant. The baby is his.<br>\r\n\"Go away Spongebob! I don't want you here!\"<br>\r\n\"But I want to see you! I want to know whats going on. Why havn't you been speaking to me?\"<br>\r\nJust then my twin brother, Randy, walks in the door. I run and hug him, I havn't seen him in a year.<br>\r\n\"I came to see how you were doing after I heard the news.\"<br>\r\n\"Thanks, your an awesome brother.\"<br>\r\nSpongebob leaves and I'm glad. Today I'm going to find out if I'm having a boy or a girl...well technically the doctor is coming here...since I cant breathe underwater. I'm actually kind of excited to have a baby. It gets kind of lonely around here since all my family lives in Texas. Just in the middle of thinking about it the doctor comes in. He does the test and has me look at the screen. And then the best news of all comes: Twins. The doctor leaves and just in time too. I know its not a very good idea but I need to tell Spongebob. I don't really know when or how to tell him. I guess I could invite him over or we could meet at his place. I've never been good at telling people this kind of stuff.<br>\r\n\"Randy, I'm gonna go tell Spongebob the news, I'll get something for dinner while I'm out\"<br>\r\n\"I'll be here. Goodluck\"<br>\r\n<b>Later at Spongebobs</b>: \"Spongebob, I need to tell you something.\"<br>\r\n\"What is it Sandy?\"<br>\r\n\"I don't know how to say this but... I'm pregnant, Spongebob\"<br>\r\n\"Whos the father?\"<br>\r\n\"You are\"<br>\r\n\"I am?\"<br>\r\n\"yes\"<br>\r\n\"Oh...\"<br>\r\n\"yeah...\" <br>\r\n\"well o... bye Sandy\"<br>\r\n\"bye, Spongebob\"<br>\r\nWell it could have been harder..<br>\r\nWill Sponge bob ask Sandy to Marry him?</span></div></div>",
            "created":1299989220,
            "id":1069426,
            "title":"Big Suprise"
        },
        "1121":{
            "author_id":"groribe",
            "author_name":"Hello, Writing.com",
            "choices":[
                "2 weeks later",
                "3 month later"
            ],
            "content":"<div class=\"\"><div> <span>3 days after Songebob got the new that Sandy is pregnant with his childs, Spongebob ask Sandy on a date. \"Sure, Spongebob, Where should we meet and what time?\" Said Sandy. \"At the Krusty Krabs, at 5 pm.\" Said Spongebob. \"The babies and I will be there.\" Said Sandy as she hung up.<br>\r\n*Krusty Krab, 4:59 p.m., Sandy arrives and get the reserved table for party of two and sat down*<br>\r\nSpongebob says \"Want to talk?\" Sandy replies \"Sure.\"<br>\r\n*45 minutes later*<br>\r\n\"I have to tell you something, Sandy.\" Said Spongebob. \"What is it?\" Said Sandy. *Spongebob went on the floor and kneel and says the most famous words in marriage*<br>\r\n\"Sandy, Will you marry me?\" says Spongebob.<br>\r\n\"Yes!\" Sandy says.<br>\r\n*They make out*</span></div></div>",
            "created":1306797960,
            "id":1116485,
            "title":"Sandy Cheeks, will you marry me?"
        },
        "114":{
            "choices":[
                "yes"
            ],
            "content":"<div class=\"\"><div> <span>It has been 5 weeks since I took a paternity test to find who the father of my baby is and it is spongebob and we are havin 8 kids and 3 monthes along. i have to find a way to tell him<br>\r\nfour monthes later<br>\r\nring ring ring ring spongebob's phone was ringing <br>\r\nhello said spongebob<br>\r\nspongebob it is sandy come over as soon as you can.<br>\r\nand before spongebob could say something sandy hung up.<br>\r\n<br>\r\n1 WEEK LATER<br>\r\n<br>\r\nspongebob i love you says sandy they share a kiss then she smacks him.<br>\r\n<br>\r\nwhen he finds out will he marry her?</span></div></div>",
            "created":1313206440,
            "id":1167154,
            "title":"octuplets"
        },
        "13":{
            "author_id":"ladymiranda",
            "author_name":"Amanda",
            "choices":[
                "She goes home with him."
            ],
            "content":"<div class=\"\"><div> <span>That night when Spongebob did stand-up comedy and ridiculed Sandy Cheeks in front of everybody in Bikini Bottom, he made Sandy cry. Mr. Krabs saw her after the show, trying to empty her tears from her oxygen tank. \"Argh,\" he said, \"What be the matter with you dear?\"<br>\r\n\"Spongebob got everybody laughin' at me. Said 'how many squirrels does it take to screw in a lightbulb?' and all that stuff.\" <br>\r\n\"And you let that numbskull get to you, did ye?\"<br>\r\nSandy slipped her paw into her suit and wiped her eyes. \"Well...\"<br>\r\nMr. Krabs wrapped his claw around her. \"Tis alright me Love. Don't beat yourself up over the lad. Here, why don't ye come home with me. You're clearly not set for going home alone, pondering what Spongebob's put in ye head.\"<br>\r\n\"I don't know...\"<br>\r\n\"Aw, come on. Please?\"<br>\r\n</span></div></div>",
            "created":1306822140,
            "id":1116712,
            "title":"Mr. Krabs"
        },
        "131":{
            "author_id":"ladymiranda",
            "author_name":"Amanda",
            "choices":[
                "Big red hands..."
            ],
            "content":"<div class=\"\"><div> <span>Mr. Krab's anchor-shaped house was freshly painted. Sandy marveled at the many paintings and knick knacks sorted among his walls. <br>\r\n\"Like what ye see?\" <br>\r\nSandy nodded. <br>\r\n\"Would ye like something to drink, my dear?\"<br>\r\n\"Soda pop would be alright.\"<br>\r\nMr. Krabs went to the kitchen and poured her a glass of Cola. From the kitchen doorway, he spied on her in the living room. He liked the way her suit fit snuggly on her tail. She was not looking in his direction, so he slipped a roofy into her drink.<br>\r\n\"Here ye are,\" he said, watching her closely as she opened a compartment in her suit, pulled it up to take a sip.<br>\r\nIn just a short while, Sandy was feeling very strange.</span></div></div>",
            "created":1306822560,
            "id":1116715,
            "title":"She goes home with him."
        },
        "1311":{
            "author_id":"ladymiranda",
            "author_name":"Amanda",
            "choices":[
                "Ewwww....but how long does it take for a crab seed to grow?",
                "Mr. Krabs lays her in her own bed. ",
                "Sandy wakes up in the arms of Mr. Krabs."
            ],
            "content":"<div class=\"\"><div> <span>Sandy was on a water bed. Her oxygen tank rested beside her face, and she had her bubble on her head (to Mr. Krabs displeasure--he was craving a taste of her furry little lips.) Mr. Krabs removed her suit to expose those purple bra and panties he'd seen her wear that time she told Spongebob she could breathe underwater and she didn't need the suit. He'd been dying to see those little panties again. All the money in the world that passed between his red claws could not amount to the satisfaction he was feeling as this moment as Sandy drifted in and out of consciousness.<br>\r\nHe stroked her furry body with his cool red hands. He laughed at the thought of Larry the Lobster just wishing he could feel what Mr. Krabs had right now! Everyone knew Larry was the chick magnet...he had ripped abs of great lobster proportions. And of course, Mr. Krabs was old. He had multiple chins and saggy skin. Oh the horror he would feel if anybody every saw him without his clothes!<br>\r\n\"Stop it!\" He forced himself to say. \"Don't talk about yeself that way! This here's a beautiful lady. She is waiting for ye.\"<br>\r\nSo Mr. Krabs kissed all over Sandy and made love to her for .0823 seconds. (That's like an all-time record for old crabby men.) <br>\r\nUnfortunately for Sandy, those minuscule seconds were just long enough to spurt into her furry body a little crab seed.</span></div></div>",
            "created":1306823280,
            "id":1116720,
            "title":"Big red hands..."
        },
        "14":{
            "choices":[
                "ABOTION",
                "abortion with good twist",
                "go on",
                "scream at plankton"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>dude you picked this? wtf. anyway she went to  a doctor mr.krabs(double wtf ) and he said you pregnant with 8,000,000,888 plankton babies</span></div></span></div>",
            "created":1295719500,
            "id":1040035,
            "title":"Plankton (WTF?!)"
        },
        "15":{
            "author_id":"fieldhockjock",
            "author_name":"Cherry Blossom",
            "choices":[
                "Sandy plays back night in her mind",
                "Squidward goes to see her",
                "Your choice"
            ],
            "content":"<div class=\"\"><div> <span>Squidward was always jealous of spongebob and patrick. They got to see sandy all the time and they didn't think anything of it. He wanted what they had, and everything they did bothered him because of that. She was intelligent like himself, and brave enough to live in a habitat so different from her own. When he saw her at that party last night, he knew it was his chance to really talk to her. What he didn't count on was her getting so drunk that all she wanted to do was... well she's pregnant now, right?</span></div></div>",
            "created":1300495320,
            "id":1072303,
            "title":"Who else from this show?"
        },
        "153":{
            "author_id":"skyeyes",
            "author_name":"Neveah White",
            "choices":[
                "Sandy agree's to ride.",
                "She politely says no.",
                "She rudely says no (prefferred just saying)."
            ],
            "content":"<div class=\"\"><div> <span>Squidward, embarressed beyond belief, pretended that night never happened. What was worse-in Squidward's eyes- was that Sandy was too drunk to remember anyway. But then Sandy notices how sluggish she was getting and she could tell something was wrong. <br>\r\nShe was going to go see a doctor when Squidward drove up beside her.<br>\r\n\"Need a ride?\" He asked in his usual nassaly tone.<br>\r\n<br>\r\nWhat happens now?</span></div></div>",
            "created":1306815840,
            "id":1116663,
            "title":"Your choice"
        }
    },
    "info":{
        "author_id":"groribe",
        "author_name":"Hello, Writing.com",
        "brief_description":"Sandy's pregnant, who do you think is the father",
        "created":1284348600,
        "description":"<td align=\"left\" class=\"norm\">Sandy wake up and felt like vomiting and she did. She couldn't remember what happen last night. She took a pregnancy test and it is positive. Who is the father of sandy cheeks child or childs.</td>",
        "id":1707504,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1313206440,
        "modified":1313206440,
        "pretty_title":"Sandy Cheeks is Pregnant"
    }
}