{
    "chapters":{
        "1":{
            "author_id":"judasfm",
            "author_name":"JudasFm",
            "choices":[
                "Arrent decides to try and wake up some of the other people",
                "Arrent decides to leave",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Light.<br>\r\n<br>\r\nA lot of light.<br>\r\n<br>\r\n<i>Too</i> much light, in fact.<br>\r\n<br>\r\nKatherine Arrent, seventeen years old, red-haired, grey-eyed and known to both friends and family by her surname only, forced her eyes open and winced as the harsh rays of a ceiling bulb speared through them.<br>\r\n<br>\r\n<i>How did I get here?</i><br>\r\n<br>\r\nShe was in what looked like a glass tube, with condensation rapidly forming on the inside, and she was also bitterly cold.  From what little she could see of herself, she was still wearing the same clothes she'd worn to go clubbing; a tight crop top with equally tight jeans and boots.<br>\r\n<br>\r\nCarefully, she reached out and pushed at the lid above her.  It gave instantly and she managed to sit up, looking around.<br>\r\n<br>\r\nThe room she was in was bare of all furniture save a desk in one corner and a chair next to it.  Bewildered, Arrent swung both legs over the edge of the tube and got to her feet, swaying rather alarmingly and catching hold of the tube to steady herself.<br>\r\n<br>\r\nDid she have anything?  Money, ID, <i>anything</i> that could help her?  Reaching down with the hand that wasn't gripping the pod, Arrent rummaged carefully in her pockets, finally discovering a folded piece of paper in one of the back ones.  Half relieved, half dreading the possibility that it would be useless, she pulled it out and studied it.<br>\r\n<br>\r\nIt was written in English and some other strange language that Arrent had never seen before.<br>\r\n<br>\r\n<i>Subject's full name: Unknown<br>\r\nOfficial designation: \"Red\"<br>\r\nTreatment status: Successful<br>\r\nHealth: Fair.  Severe muscular atrophy.  Subject shows positive response to standard rebuilding.<br>\r\nPod number: 5</i><br>\r\n<br>\r\nArrent looked over her shoulder at the pod and frowned as she caught sight of the large number five that had been stencilled onto it.<br>\r\n<br>\r\n<i>What...I don't understand.  What is this place?  And just who put this into my jeans, anyway?</i><br>\r\n<br>\r\nNaturally sarcastic, with a personality that verged on pure arrogance at times, Arrent was a black belt in Tae Kwon Do and did body combat in her spare time.  Feeling vulnerable was new to her, and she didn't much like it.<br>\r\n<br>\r\nThere was no date on the report, no name; in fact, nothing to give her a handle on who had written it or when.  Frowning, she picked it up and turned it over in case more had been written on the back.  There was nothing.<br>\r\n<br>\r\n\"Where am I?\" she said aloud, or tried to; talking was agony and she noticed for the first time how thirsty she was.<br>\r\n<br>\r\nStudying the room properly for the first time, she noticed four other pods on the floor, all sealed, all occupied, all radiating outwards from the same central console as had been attached to hers.  Two doors, both in opposite walls, led out of the room, and both had a horribly locked look to them.<br>\r\n<br>\r\n<i>Well, I can probably get through them without too much trouble</i>.<br>\r\n<br>\r\nArrent sat down suddenly, dizzy.  Where was she, and what had happened?  She vaguely remembered something about getting ready to go clubbing with her friends and then...nothing.<br>\r\n<br>\r\nThe sound of heavy footsteps approaching one of the doors jerked her back to reality and she struggled to her feet, instincts telling her to get out.<br>\r\n<br>\r\n<i>Right.  I'll find someone to talk to, but I'll do it on my terms, not theirs.</i> Besides, there was something in the footsteps...Arrent didn't trust them.  Better to confront the owner when she was recovered and had her wits about her.<br>\r\n<br>\r\nThe reflection of light off another tube checked her as she turned to go, and she glanced at it.<br>\r\n<br>\r\n<i>Maybe I should open them up and let the people out...who's to say the people out there are friendly? I could do with allies in this place...</i><br>\r\n<br>\r\nAlmost immediately, something else inside her whispered, <i>Sure.  And how do you know they're even going to be allies?  By the time they've come to and you've managed to tell them we have to leave, whoever's out there will be in even if they have to knock through the walls.  Get out now, while the going's good</i>.<br>\r\n<br>\r\nArrent hesitated, torn.</span></div></div>",
            "created":1147928400,
            "id":319369,
            "title":"Land of the Living"
        },
        "11":{
            "author_name":"Wired",
            "choices":[
                "Wait there",
                "Leave with the man",
                "Check up on the young girl",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>          Arrent took a breath and swiftly headed for Pod 4. A brief peer inside showed her a well built man in possibly his early thirties. It was difficult to tell however due to the frost covering the inside of the tube in thick layers. Her hands reached up and knocked the lid off.<br>\r\n<br>\r\n          White cold air billowed out immediately dropping the temperature in the room. Arrent gave a little shiver and hurried onto the next Pod. The moment she knocked that lid off (inside there appeared to be a young girl) a harsh voice barked from the other side of the room.<br>\r\n<br>\r\n          \"Yuriek un teh...!\"<br>\r\n<br>\r\n          Arrent swung arround to see a balding man in a white doctors suit. His face was a three way mixture of shock, anger and fascination. He took a wary step forward, then hastily retreated again as the man from Pod 4 clambered out shakilly. The man let out a deep grunt and hit the floor. <br>\r\n<br>\r\n          \"Hey what...euchhh...\" The man stopped talking as it was too much for his throat to handle.<br>\r\n<br>\r\n          \"Ah. Eenklish is it noo? Well vary well yoo stay here whilst I get.. surgeons? Doctors? Unbrigad...\" Mumbled the Doctor and he turned off. The newly awakened man gave a shake of the head as if to say 'Nuh uh I'm not staying here'.</span></div></div>",
            "created":1148360400,
            "id":320360,
            "title":"Awakening"
        },
        "111":{
            "author_id":"kiwiangel",
            "author_name":"Puditat",
            "choices":[
                "She puts Mr. Four back in the pod",
                "She exits the room",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Arrent wanted to do anything, but wait for the strange fellow to return. It was all too scary, too confusing. Scanning the room for another exit, she found it solidly boxed in.<br>\r\n<br>\r\nA strangled gasp from the floor reminded her of Pod Four's inhabitant, slouching on the floor like one of her friends after too much fun at the club. The girl in the other pod had not yet opened her eyes, so she left her and went to the man. She stood over him with a watchful expression, trying to size up his potential as an ally.<br>\r\n<br>\r\n\"...ld...ld,\" he choked out. <br>\r\n<br>\r\nArrent struggled to make out what he was saying, but his voice rasped too heavily on the sounds.<br>\r\n<br>\r\nThe man lifted a weak arm and crossed it over his chest. Again he repeated, \"...ld.\"<br>\r\n<br>\r\nArrent understood him finally. The man was cold. His lips an unnatural shade of blueberry, and his eyes pleaded for warmth because his voice could not. She looked around the room a second time, her gaze latching upon the solitary desk. She strode to the small, metal desk and flung open its drawers, clanging and echoing overloud in the clinical room. It took only a few minutes to discover there was nothing in it which could help assist them. <br>\r\n<br>\r\nArrent sighed -- the man needed heat. She couldn't spare any thought that his predicament was her fault, that he would be fine if she'd left him where he was. <i>This is survival...my surivival!</i> she told herself firmly.<br>\r\n<br>\r\n\"Well there's nothing here to warm you up,\" she told Mr. Four, a harsh, defensive edge to her tone. <br>\r\n<br>\r\nHis eyes shifted away from Arrent, and she followed his gaze out through the open door where the strange doctor went. What she might find out there still scared her, but was there any other option? Her eyes strayed back to the man's vacated pod. <i>I wonder...</i><br>\r\n<br>\r\n</span></div></div>",
            "created":1200891600,
            "id":489384,
            "title":"Unfrozen"
        },
        "112":{
            "author_id":"judasfm",
            "author_name":"JudasFm",
            "choices":[
                "They try and find their way out",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Arrent stared at the newly awakened man, then at the direction the other man in the white suit had taken. <br>\r\n<br>\r\n\"You okay?\" she said hoarsely. <br>\r\n<br>\r\nHe looked up at her groggily. <br>\r\n<br>\r\n\"Throat,\" he whispered.  \"Hurts.  Thirsty.\" <br>\r\n<br>\r\nArrent nodded understanding, her own throat not about to take much more talking without some form of liquid. <br>\r\n<br>\r\n\"Who are you?\" <br>\r\n<br>\r\nHe coughed, tried to spit and failed, then managed to push himself to his feet, swaying alarmingly before Arrent caught his arm. <br>\r\n<br>\r\n\"Mike.  Mike Fisher.  You?\"<br>\r\n<br>\r\n\"Arrent.\"  Arrent coughed a few times, looking around.  There had to be something...<br>\r\n<br>\r\nThere!  That was it!  There was a sink in one corner of the room, and Arrent crossed over and turned the tap on, ducking her head under the flow of water and gulping down a few mouthfuls, then waiting.  She didn't know the state of her stomach just yet, and wasn't about to overwhelm it.<br>\r\n<br>\r\nSeeing Mike now kneeling on the floor, apparently too weak to stand unaided, Arrent filled a nearby mug with water and carried it over to him.<br>\r\n<br>\r\n\"Here.\"<br>\r\n<br>\r\nFor a minute Mike just looked at it as though he'd never seen water before, then he managed to grab it - spilling most of the contents - and drink thirstily before offering it to Arrent.<br>\r\n<br>\r\n\"Thanks.\" She took a mouthful, then passed it back, mind working furiously.  \"That <i>yuriek un teh</i>...what did it mean?\" she wondered aloud.<br>\r\n<br>\r\n\"Who knows?\" Mike took another swallow of the water, then upended the mug and finished it.  \"Didn't sound too happy when he said it though.\"<br>\r\n<br>\r\n\"Well, at least they speak English.\"  Arrent's face twisted in a wry grimace as she added, \"Or 'Eenklish'.\"<br>\r\n<br>\r\nMike looked away.  \"Yeah, but I don't like the idea of waiting around for that doctor or surgeon.\"<br>\r\n<br>\r\nArrent scrutinised him carefully.  Her own instincts were also telling her to get out.  In her life, she listened a lot to her instincts, but she wasn't used to other people sharing them.<br>\r\n<br>\r\n\"Me neither,\" she admitted finally.  \"Can you walk?\"<br>\r\n<br>\r\n\"I can hobble.\"<br>\r\n<br>\r\n\"Close enough.\"  Arrent looped his arm around her shoulders and managed to support him.  She'd been incredibly athletic before...well, whatever had happened, and although she wasn't as fit as she'd been before, she was strong enough to support him.  \"C'mon.  I think our white-coated acquaintance left the door unlocked.  Let's go.\"<br>\r\n<br>\r\nMike glanced over his shoulder.  \"Wait, what about the others?\"<br>\r\n<br>\r\n\"Not our problem, Mike.\"  Arrent knew how it must sound, but it was the truth.  \"They might not be able to walk much.  I can support you, but not all them as well.\"  She shook her head.  \"Look, maybe we can come back.  But right now, I think we have to get out of here and if you want to stay with these people, fine.  But I'm going.\"  She paused, partly for dramatic effect and partly for breath.  \"Are you coming?\"<br>\r\n<br>\r\nMike hesitated, then nodded once.  \"Yeah.  Yeah, let's go.\"<br>\r\n<br>\r\n\"Great.\"  Arrent headed out of the door, somewhat relieved of Mike's weight by the fact that he was doing a lot of the walking by himself and seemed to need her more for balance than actual physical support.<br>\r\n<br>\r\nThey left the room, entering a corridor that was black all around, lit from above by white bulbs placed at varying intervals.<br>\r\n<br>\r\n\"Nice place,\" Mike commented.<br>\r\n<br>\r\n\"Nice like a morgue,\" Arrent muttered, not quite under her breath.  \"D'you think you could hobble a little faster?  I might not have wanted to be caught in that room but I <i>really</i> don't want to be caught outside it.\"<br>\r\n<br>\r\nThey reached a swinging door and Arrent pushed it open with one hand.  <br>\r\n<br>\r\n\"Now what?\" Mike grated through clenched teeth as soon as they were through.  Looking at him, Arrent noticed for the first time that he didn't look particularly healthy.<br>\r\n<br>\r\nThen she looked up at the intersection and understood the reason for his irritation.  It wasn't just one intersection either; she could make out others up ahead and peering down one of the off-corridors she noticed more branches.<br>\r\n<br>\r\n<i>Oh man, how on earth are we going to get out of this place?</i></span></div></div>",
            "created":1148360400,
            "id":320380,
            "title":"Out of the Frying Pan..."
        },
        "1121":{
            "choices":[
                "Make a break for it.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Arrent and Mike stood still for a moment, looking around at the labyrinth before them.  \"I guess splitting up is out of the question,\" said Arrent, half-jokingly, noting Mike's physical condition.<br>\r\n<br>\r\n\"This isn't exactly the right time to be a little smart ass,\" Mike said.<br>\r\n<br>\r\nA flare of anger shot through Arrent's being at the word \"little\".  She had never thought herself and young or little.  She had always been on top in her own mind.  Now, she was beginning to think this Mike might not be worth her efforts.  \"Little?\" she challenged him.  \"You think I'm so little, well let me....\"  Her words were interrupted by the sound of footsteps.  She shortened her thought: \"Strike one,\" she said, trying to sound as threatening as possible.  <br>\r\n<br>\r\nHer mind automatically shifted to escape mode.  She took hold of Mike and the pair began hobbling off in any direction.  Suddenly, Mike exclaimed \"There!\"  He was pointing to a door a little ways off.  As quickly as possible, they ducked into it and shut it behind them.  This was the best possible move they could have made.  They now stood inside a vast control room with monitors everywhere.<br>\r\n<br>\r\n\"One of these has got to show us the exit,\" said Arrent.<br>\r\n<br>\r\n\"Yeah, but first I need a breather,\" said Mike, obviously winded.  He plopped down on the floor with his back against the door.  \"Oh yeah, by the way, what the hell did you mean when you said 'strike one?'\"<br>\r\n<br>\r\nArrent glared at him.  \"You pissed me off once.  If it happens two more times, I'm dropping you wherever we might me and high-tailing it.\"<br>\r\n<br>\r\n\"Makes me think I shouldn't trust you at all,\" Mike shot back.<br>\r\n<br>\r\n\"You have no choice,\" Arrent reminded him.  \"You can barely walk.  Without my help you'd be back in the freezer with the other veggies.\"<br>\r\n<br>\r\n\"You're a tough little thing, aren't you?\" Mike remarked.<br>\r\n<br>\r\nArrent fumed.  \"Will you stop calling me little?!\"  Suddenly her anger was interrupted once more by footsteps outside the door.  Thinking quickly, she turned her attention to the monitor.  Luckily, there was only one person on any of the monitors.  Arrent watch the monitor showing a woman doctor walking down a hallway.  She now knew where they were.  Now, she hoped the the woman was leaving.  Sure enough, as the woman disappeared from view on one monitor, she appeared on another, and then another, and then another.  This happened until finally the woman appeared near the exit.  This doctor had unknowingly given them their escape route.  Cautious joy flickered within Arrent.  She scrambled to remember as much as she could.  \"Mike,\" she said, turning to him, \"I think I can remember where that woman went.  We should make a break for it now.  It might be our only shot.\"</span></div></div>",
            "created":1149397200,
            "id":322614,
            "title":"A Stroke of Luck"
        },
        "11211":{
            "choices":[
                "Stay and battle it out",
                "Try and run"
            ],
            "content":"<div class=\"\"><div> <span>Mike nodded and Arrent quickly threw his arm over her shoulder. They went to the door slowly and looked out. No one. <br>\r\n<br>\r\n\"Alright, c'mon,\" Arrent said and they surged forward. <br>\r\n<br>\r\nThe pressure of being found was hitching on Arrent harshly. If they were found, what would happen? What would these people do to her and who were they?<br>\r\n<br>\r\nQuestions seem to jet through Arrent's mind as they stumbled down the hall as quietly and as quickly as their waking bodies would allow them too. <br>\r\n<br>\r\nSuddenly they stopped as a noise from a connecting hallway reached their ears.<br>\r\n<br>\r\n\"The girl and the man have escaped!\" a woman's voice exclaimed. \"What are we going to do? We can't have them running loose so the government can find them and use them!\"<br>\r\n<br>\r\n\"Hush, Mirell,\" a man's voice came. \"I will send some men to retrieve them at once and we can head back to Earth.\"<br>\r\n<br>\r\n\"Without the money?\" the woman, Mirell, demanded. <br>\r\n<br>\r\n\"Of course not,\" the man said. \"The people of Lior are pathetic and stupid under the rule of a tyrant regime. They will yield to whatever we want.\"<br>\r\n<br>\r\nMirell sighed, echoing across the ground. \"This is too dangerous...\"<br>\r\n<br>\r\n\"Don't say that,\" the man replied and the sound of their kissing caught Mike and Arrent's ears.<br>\r\n<br>\r\nArrent locked eyes with Mike and urged him on, slowly. He looked hesitant but followed wearily.<br>\r\n<br>\r\nThey stopped at the hall and Arrent slid against it and twisted to look. A woman with dark brown hair, straighter then a pencil stood wrapped in the hold a a gruff, large man. The two were kissing fiercely, hands everywhere.<br>\r\n<br>\r\nArrent shook her head in disgust and turned back to look at Mike. She whispered, \"We need to go.\"<br>\r\n<br>\r\nHe raised a brow and jerked his head toward the pair. Arrent rolled her eyes. \"They're distracted.\"<br>\r\n<br>\r\nWith that the two hobbled forward slowly.<br>\r\n<br>\r\nSuddenly the man looked up. \"There they are!\" </span></div></div>",
            "created":1150606800,
            "id":518152,
            "title":"Getting Out"
        },
        "112111":{
            "author_id":"judasfm",
            "author_name":"JudasFm",
            "choices":[
                "The woman agrees to help",
                "Arrent and Mike decide to risk it on their own"
            ],
            "content":"<div class=\"\"><div> <span>Dumping Mike to the floor rather unceremoniously, Arrent stepped forward, hands out to the side, a temptingly easy target.<br>\r\n<br>\r\n\"We want to get out.  Let us go and we'll leave peacefully.  Nobody will know who helped us, Mirell.\"  She placed a slight emphasis on the woman's name in the hopes that she'd pick it up.<br>\r\n<br>\r\nGlancing at her partner, Mirell shot out a few sentences in the harsh, guttural language that Arrent had heard before.  Smiling slightly, the man stepped forward, every muscle betraying a confidence of easy victory.<br>\r\n<br>\r\nArrent kept her own expression carefully bland, giving nothing away.  There was no margin for error here; she'd have to strike fast and as hard as she could.  Better too much than not enough.  And it was clear from the way the man moved that he'd had no training in how to use his strength.<br>\r\n<br>\r\n\"Last chance,\" Arrent said calmly.<br>\r\n<br>\r\n\"Are you nuts?\" That was Mike, who Arrent had all but forgotten in the focus of the moment.  \"He'll flatten you with one hand!\"<br>\r\n<br>\r\nArrent didn't bother answering; instead she just waited as the man lumbered towards her and offered no resistance as he reached out for her.<br>\r\n<br>\r\nAs soon as his fingers closed about her arm, she yanked free, seized his wrist and twisted it around in a goose lock, wrenching the man's arm up behind his back with as much strength as she could muster.  There was an audible <i>crack</i>, like someone putting their foot through a rotten log, and Arrent released him and backed off, mind whirling.<br>\r\n<br>\r\n<i>Oh man...I didn't mean to take it that far</i>!<br>\r\n<br>\r\nGlancing at the woman, who was now staring at her partner's broken arm with a mixture of shock and revulsion, Arrent tried to look as though she'd intended this all along and raised an eyebrow, the expression saying, <i>Well?  What now?</i></span></div></div>",
            "created":1207803600,
            "id":518156,
            "title":"Stay and battle it out"
        },
        "113":{
            "choices":[
                "go left and hope to find a way out",
                "go through the ventilation shaft and pray you dont get caught"
            ],
            "content":"<div class=\"\"><div> <span>well now what do i do? I'm always getting into trouble. but the more people they have to chase , the less interested they will be in me.<br>\r\n<br>\r\nArrent opened the other pod with relative ease and glanced down the corridor in which the doctor had gone. there were three choices ... left, right, or up through the ventilation shaft.  voices were coming closer from the right, so she knew time was running out. what would she do?<br>\r\n<br>\r\n</span></div></div>",
            "created":1148446800,
            "id":320565,
            "title":"choices"
        },
        "1131":{
            "author_id":"canisdraco",
            "author_name":"Aluna Wolf",
            "choices":[
                "Run to the door",
                "Climb into one of the cages that nothing came out of"
            ],
            "content":"<div class=\"\"><div> <span>Arrent walked down the corridor and went left. She endedup in a long hallway lined with doors. As she started off down the hallway, one of the doors near the end opend and two men wearing lab coats walked out. When they saw her, one man yelled and chased after her while the other man followed, muttering something into a walkie talkie. Arrent panicked and wrenched open the door on her right and ran inside, slamming the door behind her. The man who had the walkie talkie stopped at the door and spoke to his boss on his walkie talkie. <br>\r\nHe said, \"She's in the A-Room, sir.\"<br>\r\nHis boss responed, \"Good. Let's see how tough she is. Send in our most deadly.\"<br>\r\n\"Yes sir.\"<br>\r\n<br>\r\nMeanwhile, Arrent looked around the room. There were cages lining the walls, all of them empty. There was a doorway at the far end of the room. As she started walking towards the door, the cages flew open and hundreds of poisonous snakes and spiders started coming out of them.<br>\r\n\"What am I supposed to do now?\" she wondered.</span></div></div>",
            "created":1220158800,
            "id":576809,
            "title":"The A-Room"
        },
        "1132":{
            "author_id":"freeverse24",
            "author_name":"freeverse",
            "choices":[
                "Continue Down the Ventilation Shaft.",
                "Go Back and Help the Young Girl."
            ],
            "content":"<div class=\"\"><div> <span>Arrent realized that she was running out of time.  Knowing there would be less detection, she chose to go into the ventilation system.  How can I reach the grate?  There were no tables or chairs in the room.<br>\r\n<br>\r\nI have no time for this.  Arrent bent at the knees and thrust herself up-ward.  The thrust carried Arrent upwards and straight through the  grate and into the ventilation air way.  At that same time the young girl stumbled from the pod and fell to the floor.<br>\r\n<br>\r\nNow in the ventilation shaft, Arrent stared in <br>\r\ndisbelief.  What have they done to me?  She had cleared a fifteen feet jump straight up, and crashed through a grate without gaining one scratch or straining one limb.<br>\r\n<br>\r\nAs the doctors or the scientist or whatever they were rushed in, they grabbed the young girl from the floor.<br>\r\nArrent saw the girl struggle with her assaulters, she turned and began down the ventilation shaft, but she<br>\r\nstopped.  What should I do?<br>\r\n<br>\r\n</span></div></div>",
            "created":1149483600,
            "id":322640,
            "title":"Destiny"
        },
        "11322":{
            "author_id":"xtinkxisxlovex",
            "author_name":"xtinkerbellxisxlove",
            "choices":[
                "the ventilation shaft starts to crumble...",
                "poisonous gas begins misting into the shaft..."
            ],
            "content":"<div class=\"\"><div> <span>As Arrent started downt the ventalation shaft, she heard a terrified scream, obviously the girl was loosing her battle. Arrent paused, struggling with her growing sense of self-preservation and her moral need to help the girl.<br>\r\n<br>\r\nShe continued to go back and forth until she heard another scream, this time more urgent. Finally, she made up her mind to head back and help the girl fight. She figured with the new abilities these foreign freaks seemed to have given her, she might do some good. <br>\r\n<br>\r\nBut she never got the chance because...</span></div></div>",
            "created":1149483600,
            "id":322754,
            "title":"Unexepected"
        },
        "113221":{
            "choices":[
                "Escape while the guards are momentarily distracted.",
                "Save little girl,who claimes to be  \"sister.\""
            ],
            "content":"<div class=\"\"><div> <span>...the the ventilation shaft started to crumble.Not now,I think.Was this a trap?But I didn't have time to think any longer because within in seconds I had been thrown to the ground when the shaft caterpulted wildly,chunks of metal escaped from beneath me as I slid forward at a rapid decline as the shaft fell off it's hinges.There I was,surrounded by a group of foriegn looking scientists or whatever they were, staring at me,frozen in shock at my spontanious arrival.I million ideas of possible self defence came to mind.The young girl was amoungst them still,now at th door,her eyes filled with questions.I had a plan. I would creat a diversion that would,I hoped,get myself and that girl out of this freak zone.The only catch was;could she speak english?Whatever I thought.I'd take the risk that noone else could speak fluently,or was just dumb struck.I looked at the girl.Run,I mouthed. She noded conspicously.I was relieved.She ran. The scientists exchanged glances and yelled some unidentidiable words, distracted by her.I ran,merely missing the frantic grasps of the strange forieng men in lab coats.What ever they had done to me-I was fast. I ran out the door,I flanking the girl.I clued out that she had as much idea as where she was going as I was cause she kept looking back at me. We passed long corridors;empty corridors.Odd. I could here echos of the same foriegn voices.They were getting louder.Dammit.There were twonmen who each grabbed the girl and I,there grasps were firm.I swung around like a lunatic,trying to escape the arms wrapped tight around me.The younger girl began to mimick me.Usless.They lead us,rather dragged us,into a room,no,more like a cell.They locked us in.Then they walked out,smiling wickedly a they left.I turned,the cell was quite depressing;evrything was made out of either cement of cinderblock and the light hanging from the cieling was barely doing it's job.There were two bed that looked rater uncomfortale. The girl sat,puffing loudly on one of the beds.I was so thirsty.<br>\r\n\"What are we gonna do now,Kath?\"asked the little girl, staring up at me expectingly.Her eyes searching mine. I stared at her in bemusment.<br>\r\n\"How-\" I paused for a second, in midst of my qyestion to the sound of heavy footsteps.<br>\r\n\"I'm your sister,\"she claimed,as though it were the most obvouse thing in the world.<br>\r\nI almost fell off the bed;not that I had the time,the same gaurds from before walked in.They had guns. One them grabbed the girl.She bit his arm. The other gaurde rushed over,trying to get her off the other gaurd as she hung on tight,teeth clenched into the guys arm.I had a choice. Take the safe roote;escape while the gaurds are distracted and the door to the cell's momentarily wide open.Or save this girl;this girl,who claimes to be my sister.</span></div></div>",
            "created":1294290000,
            "id":1030107,
            "title":"the ventilation shaft starts to crumble..."
        },
        "1132212":{
            "choices":[
                "in a room with our hands above us",
                "stapped to the ceiling"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>we both fought them off when one of them sneaks from behind us and knocked us out cold.<br>\r\n<br>\r\nWe woke up...</span></div></span></div>",
            "created":1307250000,
            "id":1120416,
            "title":"Save little girl,who claimes to be  \"sister..."
        },
        "114":{
            "author_id":"silvergage",
            "author_name":"Silver Gage",
            "choices":[
                "Run through the door",
                "Jump down the shoot"
            ],
            "content":"<div class=\"\"><div> <span>Arrent looked around, three more pods stood on the other side of the large room. The man stood close, clearing his throwt and trying to warm himself up. A small slip of paper was folded in his hand. He looked over at Arrent then at the other pods, as they took a step towards the other pods they could hear voices echoing down the halls behind the pods. <br>\r\nThe man looked back over at her, and pointed to the exit on their left, he obvoisly did not yet trust his voice, but he managed to croak out a name \"Jason,\" it came out no more than a whisper.<br>\r\n\"Arrent, Kathrine actualy but dont call me that.\" She smiled some. Looking at him, he was no where near the thirty years she had originaly guessed, now that he had thawed out he looked no older than 23. If the lights in the hall where the voices were comming from hadnt turned on then she might have lingered on the possibility. She ducked behind his pod pulling at his arm so he would follow as she let her knees hit the floor. <br>\r\n\"We have to get out,\" She whispered, looking around the room again. IF they ran now they had time to either jump down the laundry shoot-or what at least looked like one, it was far to big, as it would fit both of them through. The other option was out the door to their left. Either way they didnt know what lay before them. She stood up and ran, his hand still cluched in hers.</span></div></div>",
            "created":1150866000,
            "id":325756,
            "title":"Voices"
        },
        "12":{
            "author_name":"Wired",
            "choices":[
                "Make a break for it",
                "Try to sneak quietly out",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span><i>Right, I'm oughta here. I'm not going to stay in this place a minute longer.</i><br>\r\n<br>\r\nThe footsteps approaching were getting loader and were almost to the room Arrent was occupying. She looked at the doors. There were no handles or bars, or anything that would swiftly open these doors and let her escape. To the side of the door there were little keypads that obviously required a correct code. Well no chance of cracking that within the next 5 seconds.<br>\r\n<br>\r\nSwiftly Arrent ducked behind the desk being the only object (save the pods) that she could hide behind. The footsteps stopped. There was a sharp beep and a hissing sound meaning only that one of the doors had been opened. Arrent resisted the urge to see who had entered and pressed herself closer to the desk as the footsteps entered the room. <br>\r\n<br>\r\nThe steps made a sharp clipping sound as they walked. <i>Probably a woman in high heels</i> Arrent figured. And it was confirmed by a mumbling husky female voice. Arrent peered round the desk for a peek. It was definately a woman, her back was to her showing off mid-length pastel green hair. Whether it was dyed or not was difficult to tell. The woman was mumbling in a strange language and peering into a Pod. Thankfully not Arrents.<br>\r\n<br>\r\n<i>Okay, time to escape I should think.</i> She shimmied round the edge of the desk and looked at the door. Wide open. Beckoning. Maybe if she ran...<br>\r\n<br>\r\nBut then again the woman might here and raise an alarm or something. Who knew what these people were up to? Yet if she tried to leave quietly the woman might turn around before she made it out. <br>\r\n</span></div></div>",
            "created":1148446800,
            "id":320493,
            "title":"Cat and Mouse"
        },
        "122":{
            "author_name":"Bosch",
            "choices":[
                "Go for a door",
                "Hide behind a column"
            ],
            "content":"<div class=\"\"><div> <span><i>It's now or never Arrent! But I can't risk being spotted. I mustn't make a sound.</i><br>\r\n<br>\r\nArrent realised that if she were to make a break for it, there was a high chance that the green-haired woman would see her and there would be trouble. She slowly made her way past the woman as she was mumbling these weird words: \"Eeeego don de ish perff sine loerr.\" <br>\r\n<br>\r\n<i>Some weird language she's speaking. I have to find out where I am.</i><br>\r\n<br>\r\nWith that, Arrent made it past the door that was opened by the green-dye lady; her walk so slow and steady you would have thought she was on a tightrope. Sweat was travelling down the side of Arrent's cheeks; she wasn't aware of how tense the situation was. <br>\r\n<br>\r\n<i>Just need to get away from danger. Stay away from danger Arrent!</i><br>\r\n<br>\r\nPast the electronic door were rows of columns. Identical to one another. And many doors on the left and right of the long corridor she came across. Also identical. Yet there were no signs or anything at all to tell her where to go. All of a sudden she could hear those high heels once more, but it was coming in her direction! What will she do?? <br>\r\n  </span></div></div>",
            "created":1148533200,
            "id":320635,
            "title":"Slow and Steady"
        },
        "1221":{
            "author_name":"Wired",
            "choices":[
                "Get out the room asap not caring if you run into someone",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Arrent headed for the nearest door. This one had a door handle, must not be a particuarly important room. She drove through it and closed the door silently behind her just as the woman emerged from the previous room. Arrent held her breath until the clipping sounds of the high heels had passed. She released her breath noisilly and opened her eyes.<br>\r\n<br>\r\nShe saw, zilch. Utter blackness. She gropped the wall behind her warilly. She edged around the room feeling the wall. <i>There's gotta be a light switch or something...</i> Eventually her hand felt something smooth and flat that stuck out slightly. Lights blazed around the room. Arrent had to shut her eyes. She cracked one eye open, the switch in front of her wasn't like a normal switch. It was made from white metal, and had a square of neon-blue horixontal lines in the middle. Perhaps it was touch sensitive? Something weird at any rate.<br>\r\n<br>\r\nArrent turned around to survey the rest of the room. What she saw made her feel, somewhat sick.<br>\r\n<br>\r\nShe was in what appeared to a mortuary (or morgue). There were several dead bodies lying on white metal tables, completely naked except small strips of cloth to cover the extremities. Some of the deceased weren't even human. But she turned away not wanted to examine them. <br>\r\n<br>\r\nHowever being dead they were attached to small computers by their sides. Thin cables were connected to their toes, fingers and heads.<br>\r\n<br>\r\n<i>Euch, this is horrible. I'm getting out of here.</i><br>\r\n<br>\r\nHowever one of the small computers started beeping. The screen flashed blue on and off. She the fingers of a dead person twitching.</span></div></div>",
            "created":1148533200,
            "id":320637,
            "title":"Dead, deceased but not buried"
        },
        "12212":{
            "author_id":"pheasantquill",
            "author_name":"Pensive_Pigeon",
            "choices":[
                "Use the map to  attempt an escape.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Arrent froze, every muscle in her body tensing. All she could do for the moment was to stare fixated on the surreal event unfolding in front of her. The flashing screen and twitching body increased in speed and intensity, reaching a spasmodic crescendo. Then, stillness.<br>\r\n<br>\r\nA long breath she had not been aware of holding escaped her lips as she tried to collect herself. \"Well that was nothing out of the ordinary\" she said, reverting- as was her habit in unnerving circumstances- to her protective layer of sarcasm. Then, just as she was preparing to bolt from the room she noticed a piece of paper lined with a script of some sort protruding from a slot below the screen.<br>\r\n<br>\r\n\"What the hell am I doing?!\" She asked herself as she inched to wards the computer. However, the need to make sense of her predicament urged her forward. 'Maybe the paper holds some clues' she thought. Gingerly, she tore the paper from its slot and examined it. <br>\r\n           <br>\r\n           <i>They have us. Don't let them take<br>\r\n           you. Escape. Alert the others.</i><br>\r\n<br>\r\nBelow the message lay what seemed to be a map of the inside a building with a dotted line leading from one point to another until it reached the outside of the map. Suddenly, Arrents stomach turned to ice as she noticed that the dead figure on the table was staring with glazed eyes at her.<br>\r\n<br>\r\nStuffing the paper into her pocket, Arrent fled from the room, running until she collapsed panting at the bottom of a collum. \"This is too weird\" she said as she took the paper from her pocket. Arrent was under no illusions, She new that the map was of her surroundings and that somehow the dead or dead-like person had communicated to her a way out. She sat pondering her choices. 'Well,' she thought 'I did want to get out of this place. But do I want to take the advice of that dead...ish guy?' She grimaced, \"Gotta love my options\".   <br>\r\n                  </span></div></div>",
            "created":1149138000,
            "id":321961,
            "title":"Offerings from the dead."
        },
        "122121":{
            "author_id":"bigboi14",
            "author_name":"MrMuggles",
            "choices":[
                "The control room",
                "the exit"
            ],
            "content":"<div class=\"\"><div> <span>Arrent pulls the scrumpled map from her pocket and unflods it. The map smells of fresh ink and is creased down the middle. Arrent exmaines it and manages to work out her location. Looking at the other rooms, she notices a small symbol that she assumes represents an exit sign. She also sees a room saying \"control room\" on it. \"Perhaps I could find something out there,\" she thinks to herself. She stands up and, placing the map back in her pocket, she heads for...</span></div></div>",
            "created":1220158800,
            "id":576779,
            "title":"Use the map to  attempt an escape."
        },
        "1221211":{
            "author_id":"bigboi14",
            "author_name":"MrMuggles",
            "choices":[
                "Turn and run away",
                "Step out and surrender"
            ],
            "content":"<div class=\"\"><div> <span>Katherine steps out from behind the column and heads down a corridor toward the control room. As she walks she begins to hear voices ahead. Slowing down, she begins walking forward at a crouch. The voices get louder and louder until she is outside an open door. Light spills from it into the dark corridor and she peeks through the entrance into the room. Inside she sees several men armed with guns and wearing padded armour adorned with the symbol of a circle with eight arrows pointing in different directions. The room is filled with computers, all of them humming loudly. A woman is hunched over one of them, her back to the door. She turns from the console she was working on, walks to another and begins tapping furiously on the keyboard. She wears slick, thin-rimmed glasses and has short cropped blue hair. As Katherine watches, one of the soldiers sees her crouching outside and shouts in the same language Kath had heard the green-haired woman speak earlier. \"Oh great,\" Katherine thinks to herself, \"this day is turning out real well isn't it?!\"<br>\r\nThe man raises his weapon and shouts again. Katherine decides to...</span></div></div>",
            "created":1220158800,
            "id":576780,
            "title":"The control room"
        },
        "12212112":{
            "author_id":"bigboi14",
            "author_name":"MrMuggles",
            "choices":[
                "\"Well done, you caught me red-handed\"",
                "\"This is all a misunderstanding\""
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I personally don't want to die again...\" thinks Arrent as she steps out of the shadows and places her hands above her head. The man who had seen her walks forward and grabs her roughly by the neck and leads her to the woman, who is bent yet again over one of the computers as if nothing had happened. She turns around and examines Arrent carefully. Up close, Katherine sees how beautiful the woman is, her skin smooth and pale like porcelin, her green eyes deep and lustrous, sparkling with a hidden intelligence.<br>\r\n<br>\r\n\"I see we have an intruder. And a pretty one at that!\" the woman said in a cold voice that although unexpected suited her smooth, icy looks perfectly. She grasped Arrent's chin and twists her head left and right, taking in every detail of her face. <br>\r\n<br>\r\n\"How did you get in, girl?\" the woman sneered. \"A member of the rebellion, eh? Sent to spy on us?\" <br>\r\n<br>\r\n\"What should I do?\" Arrent thought desperately to herself. \"Maybe this is just a misunderstanding... if I told the truth maybe she could help me! But then again, maybe this is a trick... maybe she knows already!\"<br>\r\n<br>\r\nArrent opens her mouth and says...  </span></div></div>",
            "created":1220331600,
            "id":577659,
            "title":"Captured"
        },
        "122121122":{
            "author_id":"bigboi14",
            "author_name":"MrMuggles",
            "choices":[
                "Pushes the guard down the staircase",
                "Thinks better of her plan and grabs a railing to steady herself"
            ],
            "content":"<div class=\"\"><div> <span>\"This all just a misunderstanding,\" Arrent said, only just managing to stop her voice cracking. \"I woke up inside one of those capsules! I don't know anything about the rebellion, I swear!\"<br>\r\n\"Really? And why should I believe you?\" asked the blue haired woman, her beautiful green eyes boring into Arrent's head like a drill.<br>\r\n\"I..\" Arrent tried to come up with a reply, but before she could do so the woman released her grip and threw Arrent into the clutches of a tall guardsman. <br>\r\n\"Sergeant, escort this girl to our HQ and have her interrogated.\" the woman ordered, and then turned to smile at Arrent. \"Spy or not,\" she said, her words seemingly drawing the heat from the air,\" we will soon find out. You should have given me a straighter answer, whelp!\" <br>\r\nArrent gathered her saliva and spat, straight at the woman'f face. Taken by surprise, the woman yelled in revulsion and swiftly drew a pure white handkerchief, seemingly from nowhere, to remove the horrid substance. In one step she was before Arrent and slapped her across the face with a force that was surprisingly large despite her lean frame. <br>\r\n\"You foul animal!\" the woman snarled, withdrawing her hand back to her side and flicking the handkerchief into a small bin in the corner.<br>\r\n\"I thought I told you to take her away!\" she shouted at the guard, who recoiled lest he recieve a similar punishment. <br>\r\n\"Yes ma'am, of course,\" he replied, \"sorry ma'am.\" He quickly turned and guided Arrent from the room. <br>\r\n<br>\r\nArrent was led through a long maze of poorly pit corridors until finally they began ascending a steep flight of steps. As they climbed ever upward, Arrent realised that she may be able escape. Arrent pretends to stumble, then reaches out and...</span></div></div>",
            "created":1223010000,
            "id":590429,
            "title":"Interrogation"
        },
        "1221212":{
            "author_id":"bigboi14",
            "author_name":"MrMuggles",
            "choices":[
                "Tells her to keep down",
                "Knocks her out"
            ],
            "content":"<div class=\"\"><div> <span>Arrent steps out from behind the column and, ignoring a dark corridor ahead of her turns right and continues down the hall towards the exit. Suddenly a door opens behind her. Turning, Arrent sees the green-haired woman she saw earlier. Before she can hide the woman sees her and begins shouting into a small device in her hand. \"Great. Now I have to run!\" Arrent thinks as she breaks out into a sprint. She finally reaches the door on the map, but sees it is not much of a \"door\" at all. It is a large barred metal gateway. She runs toward it and tries to get a grip on the bars. She hears footsteps coming towards her, and people shouting. Finally, she manages to haul herself over the gate and drops to the floor, barely noticing the painful thud as her legs impact with the ground. Running up a large ramp, she emerges into daylight and squints at the sudden brightness.  <br>\r\n<br>\r\n A car suddenly pulls up in front of her. It floats above the ground and appears heavily armoured and adorned with a strange symbol of a circle with arrows pointing in different directions. A man wearing padded armour with the same symbol leans out of the side gesturing for Arrent to get in. Confused and scared, Arrent gets in the car and it roars away. The man turns towards Arrent and...</span></div></div>",
            "created":1220158800,
            "id":576783,
            "title":"the exit"
        },
        "12212121":{
            "author_id":"genius0312",
            "author_name":"cerial",
            "choices":[
                "Opens the door and bolts from the car",
                "The man says something and Arrent sits back in her seat"
            ],
            "content":"<div class=\"\"><div> <span>Arrent ducks her head down into the recess between the seats and then looks up at the man.<br>\r\n\"I was surprised that you made it out of there on your own. That place has claimed more then a few selected candidates.<br>\r\n\"Selected for what?\"Arrent asked without thinking.<br>\r\n\"For the resistance of course. What are you right off the line?The Man said sarcastically.<br>\r\nArrent Gives the man a questionable look\"I...I Jus..\"<br>\r\nThe man looks back at Arrent with a confident look\"Don't worry kid. Everything will be explained once we get underground. Were safe now, just sit back and enjoy the ride.\"<br>\r\nArrent sat in the seat. As the man came upon a congested corner the door handle caught her eye. A realization came across Arrent\"I don't know who this is. Where he is taking me. Or, for that matter what will happen when we arrive.\"<br>\r\nArrent's mind seemed to focus on the door handle before Arrent...</span></div></div>",
            "created":1220418000,
            "id":578120,
            "title":"Tells her to keep down"
        },
        "122122":{
            "author_id":"darkone4000",
            "author_name":"Exar",
            "choices":[
                "The Drone Speaks to Her",
                "The Drone Sounds an Alarm"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, what now?\" Arrent said aloud.<br>\r\n<br>\r\nShe began reaching for the map in her pocket, but something caught her attention first.  It was a quiet buzzing sound, almost like an RC car.  Glancing from behind the pillar she spotted it; a small, two wheeled machine.  It was no more than a foot in length and it seemed to be wandering around randomly, like whoever or whatever was controlling it didn't really know where they should be going.  Arrent was still staring at the drone in confusion when it finally turned to face her.  She ducked behind the pillar, but it was too late.  The drone came zipping over to her and soon she was in full view of it.  She just stared wide-eyed at it, knowing it was probably a security drone and she was as good as caught. </span></div></div>",
            "created":1449896400,
            "id":2073788,
            "title":"Eyes on the Ground"
        },
        "1221221":{
            "author_id":"darkone4000",
            "author_name":"Exar",
            "choices":[
                "Another Explosion, Much Closer this Time.",
                "One of the Guards Opens the Closet"
            ],
            "content":"<div class=\"\"><div> <span>She was still staring at it when it spoke to her.<br>\r\n<br>\r\n\"You are Katherine Arrent are you not?\" a quiet, man's voice asked from the drone.<br>\r\n<br>\r\n\"Uh, yes.\" she replied, not sure what this strange drone wanted from her.<br>\r\n<br>\r\n\"Good. Hold your current position, help is on its way very soon.\" the drone continued.<br>\r\n<br>\r\n\"How can I trust you?  What if you're a security drone?\" she asked.<br>\r\n<br>\r\n\"If this was a security drone it would have sounded an alarm already.  Besides, this facility doesn't use wheeled drones.\"<br>\r\n<br>\r\n\"Ok, but how soon is 'very soon.'  I don't know how much longer I can stay hidden.\" Arrent asked.<br>\r\n<br>\r\n\"Count to four.\" the drone said.<br>\r\n<br>\r\n\"1, 2. 3, 4.  What was the point of-\"<br>\r\n<br>\r\nArrent was cut off by the sound of an explosion in the distance.  Alarms blared, and a voice came over the intercom speaking some language Arrent had never heard of.<br>\r\n<br>\r\n\"Does that answer your question?\" the drone said.  \"A security dispatch is coming this way, follow the drone.\"<br>\r\n<br>\r\nArrent followed the small machine through a nearby door, which was a supply closet of some sort.  Peeking out through the keyhole, she saw about a half dozen soldiers in white and blue armor take up positions in the corridor.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1450414800,
            "id":2076275,
            "title":"The Drone Speaks to Her"
        },
        "1222":{
            "choices":[
                "Respond to Saura's plea.",
                "Stay hidden and silent."
            ],
            "content":"<div class=\"\"><div> <span>Arrent decided to play it as safe as possible, so she hid behind a nearby columns.  The footsteps drew nearer.  The green-haired women was soon in the center of the room.  Arrent kept her back firmly pressed against the column.<br>\r\n<br>\r\nThere was a moment of silence.  And then, the woman spoke.  \"Number Five?  Are you in here?\"  Her accent sounded like a cross between German and Scottish.  Arrent didn't care.  She was just suprised and a little relieved to hear English.  Even so, she stayed deadly quiet, waiting to hear more.<br>\r\n<br>\r\n\"I'm not here to hurt you,\" said the woman.  \"My name is Saura LeDonne.  I am a doctor.  I was the one who allowed you to escape.\"<br>\r\n<br>\r\nArrent was surprised, but still remained quiet, keeping in mind the possibility that this could be a trap.<br>\r\n<br>\r\n\"Please come to me,\" Saura pleaded.  \"I need your help.\"<br>\r\n<br>\r\nThe urgency in Saura's voice seemed sincere to Arrent, but she was still a little weary.  She wanted to believe this woman, but could she?</span></div></div>",
            "created":1149397200,
            "id":322623,
            "title":"Dr. LeDonne"
        },
        "12221":{
            "choices":[
                "Agree to help Saura.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>\"Number Five,\" Saura said, \"please answer.  I know you are here.\"  Arrent could hear her beginning to walk once more.<br>\r\n<br>\r\nArrent's instincts were telling her to take this woman's bait.  She always trusted her instincts.  They had almost never steered her wrong.  One thing was for certain: if she was going to interact with this woman, Arrent wanted to make it clear she was not going lightly.  \"Stop where you are.  I'm armed,\" she said, hoping her bluff would work.<br>\r\n<br>\r\nThe footsteps stopped.  \"I doubt that,\" said Saura, \"but I will respect your wishes.  Perhaps you would like to show me where you are.\"<br>\r\n<br>\r\n\"Not until I get some answers,\" Arrent said.  She was trying to sound as tough as possible.<br>\r\n<br>\r\n\"To receive answers, you must first ask questions,\" Saura said, a hint of sarcasm in her voice.<br>\r\n<br>\r\nArrent respected this, but it annoyed her all the same.  No way in well was she relinquishing what little power she had.  \"Alright then,\" she began, \"where am I?\"<br>\r\n<br>\r\n\"You are in world known as Akkhen.  More specifically you are at Blanksturn Laboratories in the city of Lioret, which is the capital of a small sector called Lior.\"<br>\r\n<br>\r\nArrent was shocked.  She didn't know what to believe.  All she could do was continue to ask questions.  \"How did I get here?\"<br>\r\n<br>\r\n\"You, and others who had been placed in cryogenics pods, were moved here when you were discovered in an underground depot somewhere on planet earth.  It's believe that you were first frozen about ten thousand years ago.\"<br>\r\n<br>\r\nArrent was caught off guard.  She took in the magnitude of that statement.  It meant that everyone she had ever cared about was long dead.  She was alone.  She didn't even stop to consider whether or not it was true.  She decided the only way to distract herself was to ask more questions.  \"Why did you let me out?\"  She said this in a way that was almost accusatory.<br>\r\n<br>\r\n\"Because I need your help.\"<br>\r\n<br>\r\n\"And what the hell does that mean?\"<br>\r\n<br>\r\n\"This matter is very complicated.  It involves more than I can explain to you now.\"<br>\r\n<br>\r\n\"Then give me the condensed version.\"<br>\r\n<br>\r\nArrent could hear Saura take a breath and then pause, as if searching for the words to say.  \"This world, Akkhen, has fallen under the terrible harsh regime of President Shumar.  He kills all who dare to think freely.  The people all live in fear.\"<br>\r\n<br>\r\n\"And how am I supposed to change that?\"<br>\r\n<br>\r\n\"Of course you cannot do it alone,\" said Saura, \"but you are not the only person of you kind.  Myself and a team of three other doctors have been periodically awakening young people of about your age.  Our hope is that you will band together and help the people rise up and overthrow Shumar's regime.\"<br>\r\n<br>\r\nArrent was silent.  Could it be?  \"There are others?\" she asked.<br>\r\n<br>\r\n\"Yes,\" said Saura.  \"Many others.  Just like you.  You're not alone.  Will you help us?\"<br>\r\n<br>\r\nArrent tried to absorb everything she had just heard.  Could all of this be true?  She was so confused?  What did her instincts have to say about this?</span></div></div>",
            "created":1149483600,
            "id":322627,
            "title":"The Regime of President Shumar"
        },
        "122211":{
            "author_id":"judasfm",
            "author_name":"JudasFm",
            "choices":[
                "Arrent follows Saura",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Just like me?\" Arrent said, in an attempt to buy time.  \"You mean I'm not the only seventeen year old from Earth who's been cryogenically frozen for ten thousand years?\"<br>\r\n<br>\r\nShe sensed, rather than saw, the woman's disgruntled expression and smiled slightly.<br>\r\n<br>\r\n\"I think you know what I mean, Number Five.\"<br>\r\n<br>\r\n\"Actually, no.  All I <i>know</i> is that when I went out it was two thousand and six and now it's...what?  Twelve thousand and six?\"<br>\r\n<br>\r\n\"Five thousand nineteen in the Akkhenian calendar.\"  Now Saura sounded different, a kind of irritation combined with...fear?  \"Will you come out now?\"<br>\r\n<br>\r\nArrent hesitated, then thought <i>Why not</i> and stepped out, staring the woman boldly in the face.<br>\r\n<br>\r\n\"So what you're basically asking me to do is to try and rise up and overthrow the regime of a guy I've never heard of on a planet that didn't even exist when I was back home?\"  She shook her head.  \"That's a hell of a thing to lay on a girl.  And just what's stopping me from going straight to this President Sugar-\"<br>\r\n<br>\r\n\"Shumar.\"<br>\r\n<br>\r\n\"-Shumar and blowing the whistle on all of you?\"<br>\r\n<br>\r\nMuch to Arrent's surprise, Saura laughed.<br>\r\n<br>\r\n\"Oh yes?  And what will you tell him?  That people are talking of rebellion and revolution?\" She shook her head.  \"He already knows that.  President Shumar is not a stupid man.  If you couldn't tell him anything new, you would be executed.\"<br>\r\n<br>\r\nArrent took a step forward, then another.  Saura didn't try and back away; it was clearly not an attack.<br>\r\n<br>\r\n\"We have others,\" she repeated.  \"Some of them are willing to join, others not so much.  We revive and recruit from all over this place in the hopes that one will be able to actually get these people together.\"<br>\r\n<br>\r\n\"Right...\" Arrent shook her head, fighting to make sense of this.  \"So...the people you said are like me, they're <i>not</i> rebels?\"<br>\r\n<br>\r\n\"Oh, they are,\" Saura said, \"but they lack...direction.\"<br>\r\n<br>\r\n\"Great.  So why'd you pick perfect strangers?\"<br>\r\n<br>\r\nSaura spread her hands to the side.  \"Because you and others in your situation have nobody who will miss you.  Others have tried and have failed, mostly due to their fear for the families.  Shumar has his own methods of maintaining law and order.\"<br>\r\n<br>\r\n<i>I've gone insane</i>.  The thought kept reverberating in Arrent's mind over and over again.  <i>I've gone mad.  I'm listening to a grass-haired woman tell me she wants me to join if not form a rebellion against a dictator...yep, I've lost it.</i><br>\r\n<br>\r\n\"Let me guess,\" she said aloud.  \"The kind of methods that involve camouflage-clad soldiers kicking down your door in the dead of night and sneaking you out never to be seen again.\"<br>\r\n<br>\r\n\"The standard uniform is black with body armour and they kick down doors at all times of the day or night, but otherwise you are more or less correct,\" Saura said complacently.  \"Listen, I can help you.  We can provide you with accommodation - these days, there are plenty of empty apartments in Lioret,\" she added, a slight cloud coming into her eyes.  \"All you have to do is agree to at least <i>try</i> to help.\"<br>\r\n<br>\r\nArrent stared at her, slightly dazed at the speed with which her world had been flipped upside-down.<br>\r\n<br>\r\n\"Do I have a choice?\"<br>\r\n<br>\r\nSaura regarded her for a few seconds before saying candidly, \"Not really.\"<br>\r\n<br>\r\n\"What about the other people here?\" Arrent waved a hand at the pods.<br>\r\n<br>\r\n\"We have no time to revive them now.  We have already talked for too long.\"  Saura opened the door and turned to beckon Arrent forward.  \"Come.  Follow me.\"</span></div></div>",
            "created":1149483600,
            "id":322663,
            "title":"Potential Rebellion"
        },
        "1222111":{
            "choices":[
                "Ask him to stay.",
                "Let him go.  You should study, anyway."
            ],
            "content":"<div class=\"\"><div> <span>Arrent decided that her only option was to trust Saura.  After all, what did she have to lose?  Maybe, if Saura was telling the truth, something positive could come from this.<br>\r\n<br>\r\nSaura lead Arrent through a dark corridor.  \"Where are we going?\"<br>\r\n<br>\r\n\"I'm taking you to an apartment that's already been set up,\" said Saura.  \"It's not much, but we hope you'll be able to find some comfort.  Maybe you could even sleep.\"<br>\r\n<br>\r\n\"Thanks, but after ten thousand years, I'm wide awake.\"<br>\r\n<br>\r\nSaura gave a half smile.  \"Fair enough.  This evening, you'll receive a visitor.  We'll be sending you some books on the Akkhenian language and way of life.  We think it would be best if your tried to assimilate yourself as much as possible.\"<br>\r\n<br>\r\n\"Yeah, sure,\" said Arrent, sarcastically.  She wasn't terribly thrilled to hear this.<br>\r\n<br>\r\nSaura heard the tone in her voice.  \"Of course the choice is yours, but we think it would work to your advantage if you gave it a try.  Anyway, of course you shouldn't open the door for just anyone.  Is there a code phrase you'd like us to use?  We'll make sure to send you someone who speaks English.\"<br>\r\n<br>\r\nArrent thought for a moment.  \"Yeah,\" she said, finally.  \"How about 'complete insanity?'\"<br>\r\n<br>\r\nSaura gave a sigh.  \"Very well.\"<br>\r\n<br>\r\nThey continued their journey.  When they finally reached the exit, Arrent was instructed to get into a strange looking vehicle.  She figured it was some kind of taxi, because Saura said something to the driver in Akkhenian.  Before they drove off, Saura turned back to Arrent and said, \"Your apartment will be number 508.  Can you remember that?\"  Arrent nodded and they sped off.  <br>\r\n<br>\r\nSoon, they stopped at an apartment building.  As soon as Arrent exited the vehicle, the driver took off.  <i>Whatever</i>, she thought.  She entered the building and soon found her apartment, Number 508.  It was only one room and a bathroom.  There was a kitchen area, a bed and a lamp.  That was it.  <i>Great</i>, she thought.  She flopped down on the bed and immediate realized what a bad decision that was.  Instead of being soft, the matress was lumpy and uncomfortable.  \"Oh, this is going to be interesting,\" she said aloud.  Before she new it, however, she had fallen asleep.  Moving even the slightest bit after ten thousand years had taken a lot out of her.<br>\r\n<br>\r\nHours later, she was awakened suddenly by a knock at the door.  She was unsure of what to do at first, but it slowly came back to her.  \"Who's there?\" she asked.<br>\r\n<br>\r\n\"Complete insanity,\" said a voice.<br>\r\n<br>\r\n\"My new best friend,\" she said to herself.  She moved to the door and open it.  Before her stood a very handsome young man who couldn't have been older than twenty.  He had long blonde hair that went down to his shoulders and piercing ice blue eyes.  He was carrying a stack of books.  \"Hi,\" said Arrent.<br>\r\n<br>\r\n\"Hi,\" said the young man.  \"Um....  Here.\"  He handed her the books.<br>\r\n<br>\r\n\"Uh, thanks,\" said Arrent.  The young man seemed nervous.  Arrent was prepared to let him go, but something about him made her wish he’d stay. <i>I could use the company</i>, she thought.</span></div></div>",
            "created":1149483600,
            "id":322728,
            "title":"Apartment 508"
        },
        "12221111":{
            "choices":[
                "Back off and ask questions",
                "Kiss him"
            ],
            "content":"<div class=\"\"><div> <span>Arrent didn't want to be alone in this place. Quite frankly it was creepy. And maybe this man could tell her more about what was going on. <br>\r\n<br>\r\nArrent came back to reality, suddenly realizing she had been standing there day-dreaming for quite a while. She watched as the young man walked, almost glided, down the stairs.<br>\r\n<br>\r\n\"No, wait.\" she shouted. \"Uh.. do you want to come in? I could do with some help..\" <br>\r\n<br>\r\nArrent glanced down at the books. It wasn't an English alphabet, she wasn't even sure there was an alphabet. She really would need some help. She looked up and those piercing blue eyes were looking back at her. She jerked back surprised.<br>\r\n<br>\r\nArrent opened the door and showed him inside. She sat down on the bed with the books on her lap and looked up at the man sheepishly. So far he hadn't said much to her. Maybe he didn't speak much English or maybe he was just the silent type. Either way he seemed like a man of mystery. <br>\r\n<br>\r\n\"So, can I ask you your name, or do I always have to refer to you as 'complete insanity'?\" She smiled, feeling a bit happier to have some company. Good looking company at that!<br>\r\n<br>\r\n\"Tako Mi Naruto\" He replied. \"That's Akkhenian for \"My name is Naruto. Your first lesson.\"<br>\r\n<br>\r\nArrent smiled. The language didn't seem that difficult. Maybe she could learn to speak it without having to learn the strange alphabet, or whatever it was called here. Arrent began to wonder about Naruto. He was strange. His body oozed confidence yet he came across timid and shy. <br>\r\n<br>\r\nNaruto lent forward, his red lips glistened under the light. His long blond hair flowed around his shoulders as his lips got closer to hers. <br>\r\n<br>\r\nArrent tried to think clearly. She had only known this man for a few minutes. Was this a trap? She was unsure of what to do.</span></div></div>",
            "created":1207717200,
            "id":518131,
            "title":"Ask him to stay."
        },
        "122211111":{
            "author_id":"judasfm",
            "author_name":"JudasFm",
            "choices":[
                "Open the door and take a chance",
                "Don't open the door.  Better safe than sorry"
            ],
            "content":"<div class=\"\"><div> <span>Carefully (and with a certain amount of reluctance) Arrent put a hand on Naruto's chest.<br>\r\n<br>\r\n\"No.  Not yet.\"<br>\r\n<br>\r\nNaruto leaned back again, half irritated, half understanding.<br>\r\n<br>\r\n\"Right.  Fine.  Yeah.  You're right; we should stay focused.\"  He gestured towards the books.  \"How are you managing with those?\"<br>\r\n<br>\r\nArrent's grimace was enough to answer that question and Naruto laughed.<br>\r\n<br>\r\n\"Yeah, I know; the English translations are a little dry.\"<br>\r\n<br>\r\nArrent twirled a strand of red hair around one finger as she replied, \"Maybe you could summarise them for me?\"<br>\r\n<br>\r\n\"If I do, do I get that kiss?\" Naruto's lips quirked slightly as he asked, but there was a serious expression in his eyes.<br>\r\n<br>\r\nArrent favoured him with a grin.  \"Maybe.  <i>If</i> you answer my questions.  What do people use for money on this world?\"<br>\r\n<br>\r\n\"Creds, half creds and quarter creds.  The last two are known as halves and quarters.  All three of them are coins; there are no notes on Akkhen.\"  Naruto pulled a handful of change out of his pocket and held it out.  \"Like this.\"<br>\r\n<br>\r\nArrent glanced at the currency.  The creds were flat, silver coloured metal coins, with the halves and quarters being just that.  Curious, she picked up a cred and turned it over.  Instead of the normal heads and tails she was used to seeing on Earth currency, this was two-headed.  Both sides showed the same man, one side in profile, the other face on.<br>\r\n<br>\r\n\"Let me guess,\" Arrent said rhetorically, handing the coin back.  \"President Shumar?\"<br>\r\n<br>\r\nNaruto nodded.  \"Yes.  The halves and quarters used to show his most trusted captains, but these were phased out after their assassinations.  Now there is only Shumar.  Keep it,\" he added in reference to the cred.  \"Money is always useful, especially in a place like this.  Next question?\"<br>\r\n<br>\r\n\"Are you single?\" That hadn't been what Arrent had meant to say and she covered up hastily.  \"I mean...alone.  Single and...alone.  I mean...are you and Saura the only ones in this whole little organisation?\"<br>\r\n<br>\r\nNaruto chuckled.  \"Calling it an organisation is giving it more credit than it deserves.  There are many of us scattered all over the world, each acting individually and as covertly as possible.  Nobody is willing to step up to the plate and put anything more structured together.\"<br>\r\n<br>\r\n\"And you're looking to me for that?\" Arrent was sceptical.<br>\r\n<br>\r\n\"You are the third we have revived.\"<br>\r\n<br>\r\n\"What happened to the other two?\"<br>\r\n<br>\r\nNaruto smiled.  \"You're quick, Arrent.\"<br>\r\n<br>\r\n\"Yeah, great.  What happened to the other two?\"<br>\r\n<br>\r\nNaruto stood abruptly.  \"I shouldn't stay much longer.  Visitors are extremely rare here; most people do their socialising outside since...well, I shouldn't.\"<br>\r\n<br>\r\n\"Naruto!\"<br>\r\n<br>\r\nThe young man froze in the process of reaching for the door handle and glanced over his shoulder.  Arrent stood up slowly, staring him down.<br>\r\n<br>\r\n\"What happened to the other two?\"<br>\r\n<br>\r\nFor a long moment, Naruto looked as though he was fighting not to throw up.  Eventually he managed, \"They died.  Arrent, I <i>have</i> to go!  Don't open the door to anyone who doesn't give you the password, no matter what they say to you.  I'll come back in a few days.  Try and get started on some of those books.\"<br>\r\n<br>\r\nYanking the door open, he fled through it before Arrent could call him back.  Judging from the noise of retching outside, he got there just in time.<br>\r\n<br>\r\nHalf scared, half fuming - was she supposed to stay cooped up in this little bedsit <i>forever</i>? - Arrent sat down on the bed and opened one of the books irritably.<br>\r\n<br>\r\nThere was a loud knock on the door.  Mindful of Naruto's instructions, Arrent crossed over to it and said, \"Who's there?\"<br>\r\n<br>\r\n\"Completed sanity.\"<br>\r\n<br>\r\nThe password was wrong, but the voice was heavily accented.  Maybe the person was a friend but had simply mispronounced the key phrase.  Then again, maybe the authorities had overheard and mispronounced it and it was a trap.<br>\r\n<br>\r\nAs Arrent hesitated, there was another loud banging on the door and the voice repeated more insistently, \"Completed sanity!\"<br>\r\n<br>\r\nArrent stood there, torn, not knowing what to do.</span></div></div>",
            "created":1207803600,
            "id":518151,
            "title":"Back off and ask questions"
        },
        "1222111111":{
            "author_id":"bigboi14",
            "author_name":"MrMuggles",
            "choices":[
                "Front Door",
                "Kitchen Space"
            ],
            "content":"<div class=\"\"><div> <span>Reluctantly, Arrent slowly pulled open the door, her feet arranged in her fighting stance just in case. Outside the door stood a man. He had black hair and tanned skin, with thick stubble covering the area around his mouth. He was tall and thick-set, wearing a scruffy, stained shirt and baggy jeans. Backing away from the door, Arrent spoke.<br>\r\n<br>\r\n\"Who are you?\" she stammered, awed by the man's physical presence.<br>\r\n\"I am Carlos.\" he replied in a thick accent that resembled Greek. \"Saura has ordered me to guard you from the authorities.\" <br>\r\n\"Oh...\" said Arrent, who let herself become at ease. \"Saura must have really trusted this guy to let him guard me.\" she thought to herself. \"Not that I need guarding\" she said to herself. \"Oh damn, I said that out loud!\" she thought again. She looked up at the man, who was smiling at her.<br>\r\n\"You seem pretty sure of yourself, Miss Katherine,\" he said, somewhat skeptically. \"Do you have any fighting skills?\"<br>\r\n\"Yes actually!\" piped up Arrent, who unbeknowst to herself was going slightly red. \"I'm a black belt at Tae Kwon Do!\"<br>\r\n\"Tae Kwon Do?\" replied Carlos, still smiling with amusement. \"I've never heard of that. I wonder if you aren't just making it up, Miss Katherine?\"<br>\r\nArrent was very annoyed now. \"Of course I'm not making it up! And don't call me Miss Katherine! It's Arrent!\"<br>\r\n\"Very well, Miss Arrent. But now, I must be going. Talking within private places is restricted unless under surveillance. I'll be next door if you need me.\"<br>\r\nSo saying, Carlos left the room and closed the door.<br>\r\nArrent turned away and threw herself onto the bed. A spring jarred into her stomach and she keeled over, moaning. \"Good move, Arrent!\" she thought to herself. Standing up, she moved over to the... </span></div></div>",
            "created":1220331600,
            "id":577672,
            "title":"Meeting Carlos"
        },
        "12221112":{
            "author_id":"judasfm",
            "author_name":"JudasFm",
            "choices":[
                "Answer the phone",
                "Don't answer it"
            ],
            "content":"<div class=\"\"><div> <span>Arrent was half tempted to let him in, then thought better of it.  She had to take a look at those books and she wanted some time by herself to try and think about things and come to terms with what had happened.  Another ten thousand years should do the trick.<br>\r\n<br>\r\n\"Thanks,\" she repeated and closed the door as politely as she could, sat down on the bed, opened the first one somewhere near the beginning and started to read.<br>\r\n<br>\r\n<i>H and KKH often indicate the correct syllable to stress for proper pronunciation; it is the syllable prior to the H and directly after the KKH.  Thus, the planetary name Akkhen is pronounced a-KEN, with the A serving as a schwa vowel.  Similarly, the word <b>talhi</b> (meaning beautiful, as well as being a popular girl's name on Akkhen in its own right) is pronounced exactly the same way as the English word 'tally'.  The diphthongs</i><br>\r\n<br>\r\nArrent shut the book with a grimace and put it back on the pile.  Languages weren't her thing, and especially not when the textbooks were so dull and heavy going.  Picking up the next one, she decided to give it a try.<br>\r\n<br>\r\n<i>monetary values are entirely calculated in creds, which may then be subdivided into quarter or half creds.  In many places and in private dealings, money is not the only means of trading; they operate on an exchange of goods or services.  In financial terms, the current interest rate is</i><br>\r\n<br>\r\nThis one went on the pile as well, and Arrent picked up the third.<br>\r\n<br>\r\n<i>no sign of abating.  Males and females are considered equal on Akkhen, which serves as home to four sentient races, including humans.  These other three are the Strirl - flightless avians with exceedingly long legs and long necks that occasionally agree to transport humans for a fee - the Vsarin - best described as a dark green and more delicate version of the ancient dinosaur known as a Utahraptor, only without the killing claw - and the Katuns.  Nothing is known about this last race except they are immensely strong, capable of withstanding vast amounts of damage and guard various roads demanding licences from all who pass.  Nobody knows what they mean by 'licence'.  The penalty for failing to produce one seems to be death, easily avoided if in a motor vehicle or with a Strirl, but on foot a Katun will outrun a human.  There is nothing on record of a Katun challenging a Vsarin, however.  The three non-human races appear less affected by President Shumar's reign; he seems more interested in his own kind than others.</i><br>\r\n<br>\r\nThis book wasn't as lucky as its predecessors; it was slammed shut, thrown across the room and through the door into the bathroom, where it hit the wall and bounced into the bathtub.<br>\r\n<br>\r\nArrent crossed over to the window and looked down at the street below, then up at the rest of the city, feeling very lost.<br>\r\n<br>\r\nShe stood there for a good few minutes, then whirled and prowled through into the kitchen, opening cupboards.  Most were empty, but one contained what looked like a small television and another an old-fashioned telephone.<br>\r\n<br>\r\n<i>Just how many people from the past do they get here?</i> Arrent wondered.  Surely Akkhen had progressed beyond the dial phones?<br>\r\n<br>\r\nBoth of them looked like they were plugged in.  Well, that was something to be thankful for.  Arrent pushed the button to turn on the TV, taking care to lower the volume first.  She didn't know how soundproofed her walls were and the last thing she wanted was her neighbours complaining about the noise level; life was already complicated enough.<br>\r\n<br>\r\nA few seconds later, she turned the TV off again; all the channels were broadcasting in Akkhenian.<br>\r\n<br>\r\n<i>So now what?  Am I supposed to wait here until Saura or that blond guy remembers my existence or what?</i><br>\r\n<br>\r\nAs if in answer, the phone rang.</span></div></div>",
            "created":1149570000,
            "id":322836,
            "title":"Home Sour Home"
        },
        "122211121":{
            "choices":[
                "Escape.",
                "Surrender."
            ],
            "content":"<div class=\"\"><div> <span>Arrent took a second to recover from being startled.  She didn't expect the phone to ring.  What now?  She took a moment to consider her options.  <i>No one but Saura knows I'm here</i>, she thought.  <i>It must be her.</i>  She answered the phone.  \"Hello?\"<br>\r\n<br>\r\nAnother surprise.  It was not Saura.  It was silence.  The caller hung up right away.  Arrent put the phone down.  Whoever that was had left her with a terrible feeling.  She sensed that something was very wrong.<br>\r\n<br>\r\nMoments later, there was a loud bang at the door.  Arrent could hear a man's voice yelling in Akkhenian.  She stood frozen, just listening, afraid to move.  Another male voice mumbled something.  Arrent could pick out the word \"English\" in his sentence.  The first male voice spoke again.  \"Open!  You are arrested!  We've found your plan!\"  His English was just good enough to deliver those terrifying words.<br>\r\n<br>\r\n<i>Damn</i>, Arrent thought.  What was she going to do now?  She looked around.  There was a window through which she could escape.  Should she risk it?  Or would she be forced to surrender?</span></div></div>",
            "created":1149570000,
            "id":325047,
            "title":"Caught!"
        },
        "1222111211":{
            "choices":[
                "Go to the address.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Arrent snapped into survival mode.  She was not about to be taken in.  She climbed out the window, and to her extreme relief she was greeted by a fire escape.  She ran down the steps until she hit the ground and then, for good measure took off running again, in any direction as long as it was away.  Finally, when she was sure she wasn't being followed, she collapsed, gasping.<br>\r\n<br>\r\n<i>What now, Arrent?</i> she asked herself.  She decided she had to find Saura, but where?  The only place she knew of where Saura might be was Blanksturn Laboratories.  But how would she get there?<br>\r\n<br>\r\nHer answer came in the form of footsteps behind her.  She spun around and marveled at what she saw.  It appeared to be a bird, but it was the size of a horse.  Arrent was shocked at first, but soon remembered what she had read in her books: <i>the Strirl - flightless avians with exceedingly long legs and long necks that occasionally agree to transport humans for a fee.</i>  At first she was relieved, but she soon realized that she had nothing on her to pay the fee.  <i>Damn</i>, she thought.  It seemed her only shot was gone.<br>\r\n<br>\r\nSuddenly, the Strirl flopped to the ground with a loud wail.  It was obviously in pain.  Arrent noticed a wound on it's wing that appeared to be bleeding.  Always the quick thinker, she took her opportunity.  She approached the beast slowly, reaching out her hand to stroke it into calmness.  To bandage the wound, she tore off a piece of her shirt and tied it around the creature's wing.  The wailing ceased and within minutes he was on the bird's back, heading for Blanksturn Labs.<br>\r\n<br>\r\nOnce there, she remembered where to find the pod room, but she was not prepared for what awaited her there.  In the center of the floor was a pool of what appeared to be blood, with a trail of it leading out to another room.  Arrent already knew what she would find, but she followed it anyway.  It lead to an office in shambles.  On the floor was Saura, near death.  She was bleeding profusely from a wound in her chest.  \"Arrent,\" she whispered.  \"I tried... call you....  Desk.\"  Those were her last words.  She exhaled heavily and that was it.  Saura was dead.<br>\r\n<br>\r\nArrent didn't have time to mourn.  She now felt completely screwed.  What had Saura left her on the desk?  Maybe it would help her.<br>\r\n<br>\r\nOn the desk was a blood-stained peice of paper on which was written an address and the word \"Safety.\"  What was Arrent going to do?</span></div></div>",
            "created":1149570000,
            "id":322914,
            "title":"An Unexpected Turn of Events"
        },
        "12221112111":{
            "author_id":"judasfm",
            "author_name":"JudasFm",
            "choices":[
                "Talk to the Vsarin",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Arrent suddenly felt very young, and very vulnerable.  With Saura's death, and the only other human she'd spoken to having vanished, she was stranded on her own in an alien world ruled by someone who now - apparently - wanted her arrested.<br>\r\n<br>\r\nShe looked at the paper again.<br>\r\n<br>\r\n<i>Sky<br>\r\n3321 Navekh<br>\r\nKiyett</i><br>\r\n<br>\r\n<i>Well, it's not like I got anywhere else to go,</i> Arrent thought grimly as she headed outside.  To her surprise, the Strirl had waited for her.<br>\r\n<br>\r\nAn even greater surprise came when the bird spoke.  Arrent knew it had understood her by the simple fact that it had taken her where she needed to go, but she was unprepared for it to talk.<br>\r\n<br>\r\n\"Spik little Inglis.\"  The Strirl's voice was clearer than Arrent had expected; it was like a parrot's, only without the underlying roughness.  \"Where now?\"<br>\r\n<br>\r\n\"You know the way to...uh...\" Arrent glanced at the paper again.  \"3321 Navekh?\"<br>\r\n<br>\r\n\"Not know.\"<br>\r\n<br>\r\n\"Damn,\" Arrent muttered, then looked back down at the address.  \"How about Kiyett?\"<br>\r\n<br>\r\n\"Kiyett know.  Vsarin city.  Far.  Eight day.\"<br>\r\n<br>\r\nArrent's jaw dropped.  \"Eight <i>days</i>?  Oh man, you gotta be kidding.\"<br>\r\n<br>\r\n\"Not kid.  Eight day.  Fifteen day not Strirl.\"<br>\r\n<br>\r\nArrent could well believe this (when she'd had time to mentally translated it); the Strirl could probably get there a lot faster than she could.<br>\r\n<br>\r\nShe hesitated, then shook her head.  \"Look, I can't pay you-\"<br>\r\n<br>\r\n\"No pay.  Good wing.\"  The Strirl turned its long neck towards the bandage and back to Arrent again.  \"Carry...name what?\"<br>\r\n<br>\r\n\"What?  Oh, uh, Arrent.\"<br>\r\n<br>\r\n\"Carry Arrent to Kiyett.  Then go.\"<br>\r\n<br>\r\nThis situation was far from ideal as far as Arrent was concerned - suppose she needed to make a quick exit? - but she nodded agreement anyway and clambered onto the Strirl.  Time enough to work things out with the avian later.<br>\r\n<br>\r\nShe got the shock of her life as soon as they left Lioret; the hard road soon degenerated into a dirt track and the Strirl picked up the pace so rapidly Arrent was almost left behind.  Clinging tightly with knees, feet, hands and just about anything else she could use to anchor herself to the avian's back short of teeth, Arrent lay flat on her belly, buried her face in the bird's back and closed her eyes.  It seemed like the most comfortable position for both of them just then.<br>\r\n<br>\r\nThe journey passed in relative peace and quiet.  There was a slight altercation with a creature that looked like it had been pummelled out of wet green clay (presumably a Katun, unless there was another race that book hadn't mentioned, Arrent thought) but by the time either had registered the other's presence, Arrent was well clear.<br>\r\n<br>\r\nBy the time Kiyett was visible on the horizon, Arrent had become comfortable and adept enough at balancing on a Strirl to sit up and look around as the countryside flashed by.  She had no idea how fast they were going.<br>\r\n<br>\r\nThere was no sign of pollution or vehicles anywhere, and Arrent supposed all cars were in the cities, amusing herself for the rest of the journey by wondering what kind of car a Vsarin might drive.<br>\r\n<br>\r\nAbout half a mile from the outskirts the Strirl came to a halt so suddenly that Arrent was almost flung over its head.<br>\r\n<br>\r\n\"Jeez, you wanna <i>warn</i> me when you're gonna do that?\"<br>\r\n<br>\r\n\"Not go further.  Go now.\"<br>\r\n<br>\r\nArrent wondered briefly if there was any way to stop the Strirl from abandoning her, then dismissed the idea.  It was already doing far more than it owed her, at least to her mind.<br>\r\n<br>\r\n\"Yeah, okay.  Where will you go?\"<br>\r\n<br>\r\n\"Home.  To family.  To brother.\"<br>\r\n<br>\r\n\"Your...\" Arrent stared.  \"You have a family?  Parents?\"<br>\r\n<br>\r\n\"Parents dead.  Live with older brother.\"  Before Arrent had a chance to answer this, the Strirl had turned and bounded off.<br>\r\n<br>\r\n\"Well...thanks!\" Arrent shouted after the bird, who was already too far away to hear.<br>\r\n<br>\r\nTurning away, she walked into Kiyett.<br>\r\n<br>\r\nShe didn't know what she'd expected from a Vsarin city, but it wasn't what she saw.  The buildings had a greater variety of colour than she'd seen in Lioret, and the roads were still hard packed dirt, but asides from that it was the same as a human city.  There were even humans and Strirls walking around, mingling with the Vsarin populace.  The Vsarin themselves were pretty much as the book had described, with the exception of the colour; while most were varying shades of dark green, others were brown, tan, black and occasionally even white.<br>\r\n<br>\r\nFeeling more at home with another human than a Vsarin, Arrent walked up to the nearest woman and coughed awkwardly.<br>\r\n<br>\r\n\"Excuse me, I'm looking for 3321 Navekh.  You know where it is?\"<br>\r\n<br>\r\nThe woman gave her a funny look and moved away, eyeing her much as she would a time bomb.<br>\r\n<br>\r\n\"Guess not,\" Arrent muttered.  Raising her voice, she added, \"What about Sky?  That mean anything to you?\"<br>\r\n<br>\r\nNo response, except a quickening of the retreat.  The same thing happened with the next few people Arrent asked, and the one Vsarin, and the two Strirl.<br>\r\n<br>\r\nIt wasn't until she wandered into an alley that she got her answers, and then they weren't exactly delivered in an ideal manner.<br>\r\n<br>\r\nShe'd gone down the alley because she thought she'd heard someone, and it wasn't until the Vsarin stepped out behind her, cutting off her escape, that she realised just who that someone had been.<br>\r\n<br>\r\nThe Vsarin stared arrogantly at her.  Dark green all over, lacking the crest which Arrent had already learned was already found on males, but with the same two-inch long claws...claws that were now a bare centimetre from Arrent's throat.<br>\r\n<br>\r\n\"I hear you're looking for Sky.\"  The female's voice was low, drawing the vowels out and hissing the s.<br>\r\n<br>\r\nEven with her extremely limited experience, Arrent knew better than to struggle.  Those claws were no laughing matter.<br>\r\n<br>\r\n\"I'm looking for 3321 Navekh.  Sky's my...my uncle.  He told me to come visit him.\"<br>\r\n<br>\r\nVsarin didn't have eyebrows to raise, but the female still managed to convey the same expression with a shift of her forehead.  \"Indeed?  She has never mentioned having a niece before, much less a change of sex.\"<br>\r\n<br>\r\nOops.  Arrent cringed and kicked herself.<br>\r\n<br>\r\n\"You know her?\"<br>\r\n<br>\r\n\"I might.  But take my advice, human.  Sky lives alone.  She doesn't like visitors, and she doesn't like people trying to find her.\"<br>\r\n<br>\r\nPutting as much sarcasm and toughness into her voice as she could muster, Arrent retorted, \"Then today's not going to be her day, is it?\"<br>\r\n<br>\r\nNow the talons were brushing against her throat.<br>\r\n<br>\r\n\"Sky will see no one at her home.  Tell me why she would make an exception for you, human.\"<br>\r\n<br>\r\nArrent risked a shrug.  \"I don't know.  All I know is that I was sent to find her.  I...her name and address is the only lead I have.\"<br>\r\n<br>\r\n\"Indeed,\" the Vsarin said again.  Now the other set of claws were resting on that part of Arrent's stomach that had been exposed when she'd ripped her t-shirt up to doctor the Strirl.  \"And exactly who gave you this <i>lead</i>?\"<br>\r\n<br>\r\nArrent wondered if she should lie, then decided against it.  Saura was dead, after all; they couldn't kill her <i>again</i>.<br>\r\n<br>\r\n\"Her name was Saura...Saura...\" Arrent struggled to remember the woman's last name.  \"Saura LeDonne.  She gave me the name and address before she died.\"<br>\r\n<br>\r\nWhatever her assailant had been expecting, it clearly wasn't that; the Vsarin's eyes widened for the briefest instant.<br>\r\n<br>\r\n\"Saura's dead?\"<br>\r\n<br>\r\n\"Yeah.  She's dead, she was the only possible ally I had in this hell of a planet and now she's lying in a pool of her own blood in Blanksturn Labs.  My friend and I have been travelling for over a week to get here and if you know Sky, you tell her from me that if she wants to have a home left, she better think about letting me in because my patience is about to go!\" Arrent paused for breath and wondered briefly what the hell she'd just done.<br>\r\n<br>\r\nThe Vsarin continued staring at her for a few minutes, and Arrent would be prepared to swear it was unsure of something, then abruptly the creature whirled and raced off, leaving her in the alley alone.<br>\r\n<br>\r\nIt was more by luck than judgment that Arrent finally found a house on the outskirts of the north part of Kiyett with the nameplate Navekh fastened to the solid black gates.  Feeling a slight amount of trepidation - whoever lived here must be pretty rich or important if the size of the property was anything to go by - Arrent reached out and pushed the button on the side.<br>\r\n<br>\r\nIt wasn't a doorbell as she had originally thought, or even an intercom (which would have been her second guess); instead a panel slid up to reveal a numbered keypad.<br>\r\n<br>\r\nArrent hesitated.  The chances of guessing it were literally millions to one, and if she got it wrong, who knew what kind of futuristic defences this place had?<br>\r\n<br>\r\nGlancing up at the sky, she saw it was starting to get dark.  She'd have to do something quickly.  Maybe she'd misread the address.<br>\r\n<br>\r\nArrent studied the paper again, then looked back up at the pad and inspiration struck.<br>\r\n<br>\r\n\"Oh man, how could I be so stupid?\"  She shook her head.  <br>\r\n<br>\r\n<i>Three three two one...it's not an address, it's an access code</i>!<br>\r\n<br>\r\nReaching out with a hand that shook slightly, she tapped in the four numbers and wasn't sure if she was elated or terrified when the gates slid open.<br>\r\n<br>\r\nAs she came face to face with the Vsarin female who had almost sliced her up in that alley, however, terror won by a landslide.</span></div></div>",
            "created":1150434000,
            "id":324736,
            "title":"Follow the Hard-Packed Dirt Road..."
        },
        "13":{
            "choices":[
                "The woman leaves",
                "Arrent opens her pod and jumps out",
                "Arrent 'plays dead'",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Unsure about the place she was in, and certain she couldn't break through the tightly locked doors, Arrent climbed back into her pod and pulled the lid closed.<br>\r\n   She heard a key sliding into a lock and tried to regulate her breathing. The door opend and out of the corner of her eye, Arrent watched a beautiful woman with tawny orange hair that swept around her body slowly enter. She was dressed in a white robe and her peircing cold blue eyes seemed to see through everything.<br>\r\n   Oh Man! Arrent thought. She sure dosen't look human, I must be dreaming!<br>\r\n   The woman slowly walked from pod to pod, starting at one and working her way to Arrent's own.<br>\r\n   I'm Dreaming, I must be dreaming!<br>\r\n   The woman continued around the room, her white gown and incredably long hair swishing back and forth as she did.<br>\r\n   Arrent watched her look in each pod, open some, leave others closed. The woman left the fourth pod and headed for Arrent's</span></div></div>",
            "created":1147928400,
            "id":319379,
            "title":"A strange creature"
        },
        "131":{
            "author_id":"helenzhang",
            "author_name":"Helen",
            "choices":[
                "Arrent immediately get up and decides to follow that robot woman",
                "Arrent suddenly felt tired...and fell asleep"
            ],
            "content":"<div class=\"\"><div> <span>The woman came over to her pod.<br>\r\nArrent froze and eyed the woman silently. At that instant, Arrent finally saw her piercing eyes clearly. It was clear blue, and although it seemed penetrating and manipulating, it drifts into a faraway place. <br>\r\nArrent gasped. That woman was a robot.<br>\r\nBut no time for surprises. Her pod was closed by the robot. The robot woman lift her massive hair and went away. <br>\r\nThoughts ran through Arrent's mind quickly. Is the pod locked? Is the robot going to come back and check on her again? And why is that woman a robot? And why am I stuck here again? <br>\r\nI better act quickly...  <br>\r\n</span></div></div>",
            "created":1150347600,
            "id":324540,
            "title":"The woman...is a robot! And she left...."
        },
        "1312":{
            "author_id":"violete_eve",
            "author_name":"Violete Eve",
            "choices":[
                "Arrent wakes up, strapped to some sort of examining table.",
                "Arrent wakes up, finding outside, a man of about her age waiting for her",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Arrent yawned, suddenly feeling overcome with tiredness.  She snapped her eyes back open.<br>\r\n<i>I'm not tired, I have to go follow that robot-woman!</i> she thought. Her brain disagreed. Her eyes drooped and she settled back into her pod, which felt like a pillow-top bed. <br>\r\nHer dreams were blank, as she couldn't remember anything before going to the club.<br>\r\nShe couldn't remember any friends, family, anyone at all.<br>\r\nShe suddenly felt like she needed to open her eyes, although she was scared of what was going to come next...</span></div></div>",
            "created":1234674000,
            "id":647564,
            "title":"Arrent suddenly felt tired...and fell asleep"
        },
        "132":{
            "author_id":"beaushaffer",
            "author_name":"Beau Shaffer",
            "choices":[
                "Will Arrent release the others and interrogate the Nurse?",
                "Run and come back later for the others when she's stronger?"
            ],
            "content":"<div class=\"\"><div> <span>\tSomething changed.  Worry and anxiety slowly left her mind and was replaced by frustration.  Who put me here?  Who is this lady?  Where’s my friends?!  A cold quiet anger filled Arrents already cold body and it was time something changed.  Arrent waited patiently with one eye barley peeking to let just a blur of a picture through.  The woman was getting closer.  Clarity struck, and pressed the issue of her weakend state.  Bits of doubt trickled by her mind, but this coldness, this harsh reality that something bad has happened and she is not with her friends or family even all things familiar were gone.  The sight of the woman pushed the fear away long enough for the anger to come back.  One chance.  Gotta make it count.<br>\r\n  The woman was standing in front of the pod.  Movement of papers could be heard as she flipped through her charts.  Eyes flicking from page to page seeming to devour the knowledge inside.  Low deep thuds began to echo in the pod.  Are those footsteps of another coming?  No, her heart was pounding and she feared it might give her away.  She screamed in her mind, “Now, do it NOW!”  Thrusting all her weight into the pod lid she flung it open and knocked the woman stumbling backwards.  Not missing a step of unwasted motion as she learned from hours of practice, she grabbed at the woman’s hip and rolled her weight lifting the woman off the floor and into the pod.  Sliding the pin into place locking her inside.  That lady is definitely real and this is no dream.  Heart pounding Arrent starred back into the darkest black eyes of the woman.  Surprise seeming to show on every inch of her… almost human face.  Her face had sharper features than a normal person with points even at the ears.  Arrent scanned the woman for weapons, afterwards deciding that this was just a nurse of some kind.  Something was off place though, the womans demeanor was absent of fear.  This lady must have been waiting for her to wake up.  Or she knew others would soon be coming.  Feeling the woman posed no threat from inside the pod she studied her more closely.  A crocked smile appeared as she realized that the woman might never have thought she’d be inside of one of those pods.  “Now how do you like them apples missy?” Arrent said with victory in her tone.  Her smile faded into a look of deep thought.  Fatigue striking at the same moment.  She hadn’t thought of what to do past this point.  It was one in a hundred that it even worked but what now?  Arrent scanned the room.  Her eyes taking it all in as her mind was finally ready to accept it.  Time for thinking is over.  Odd how what seemed hours ago the biggest decision was what to wear, and where to hang out.  <br>\r\n</span></div></div>",
            "created":1178946000,
            "id":407257,
            "title":"Time's Up!"
        },
        "133":{
            "author_id":"judasfm",
            "author_name":"JudasFm",
            "choices":[
                "Arrent tries to communicate",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Heart thudding painfully in her chest, Arrent lay still, eyes closed.  She didn't know what this woman wanted - if she even was a woman; Arrent still didn't think she looked fully human - but she wasn't sure she wanted to find out either.<br>\r\n<br>\r\n<i>Then what are you hanging around here for?</i> something inside her screamed.  <i>She left the door unlocked; get out and run!</i><br>\r\n<br>\r\nArrent considered this, then dismissed it.  She didn't know if she could outrun this person, especially in her condition.<br>\r\n<br>\r\nHer pod clicked open and Arrent had to force herself to keep breathing normally, something made harder by her being unable to see what was going on (and man, it was <i>cold</i>!  Didn't this place at least have central heating?)<br>\r\n<br>\r\nThe lid lifted slowly, then the woman uttered a sharp exclamation and let it drop again.<br>\r\n<br>\r\n<i>What's wrong?</i> Arrent wondered frantically.  Maybe she should look...no.  No, that would be stupid.<br>\r\n<br>\r\nAfter two or three minutes had gone by, the temptation became too great and Arrent cracked open one eye the barest slit.<br>\r\n<br>\r\nThe woman was standing there, looking from the pod to-<br>\r\n<br>\r\n<i>The paper</i>! Arrent realised.  She'd been in such a hurry to hide in the pod, she'd dropped it.<br>\r\n<br>\r\n<i>She must have known it was in my jeans...which either means she put it there or she knows who did.  And that means she might be able to give me a few answers.</i><br>\r\n<br>\r\nCarefully, moving delicately - the last thing she wanted was for this person to see her as a threat and shoot her or something - Arrent pushed the lid up and sat upright.  She did it in much the same way as a vampire might sit up in his or her coffin, and got much the same reaction as well; the woman physically jumped and backed away, looking tense.<br>\r\n<br>\r\nFor a few minutes they just stared at each other, then the woman spoke.<br>\r\n<br>\r\n\"<i>Akhi na taverrel</i>?\"<br>\r\n<br>\r\nArrent hesitated.  The stranger didn't look or sound hostile, she was more...wary.  Yeah, that was it.  Wary.<br>\r\n<br>\r\n\"<i>Akhi na taverrel</i>?\" the woman repeated, this time slowly and distinctly, as one would address a foreigner.<br>\r\n<br>\r\nArrent shook her head, shrugging to indicate incomprehension.  It seemed to work; the woman looked away with a frustrated look on her face.<br>\r\n<br>\r\n<i>Great,</i> Arrent thought grimly.  <i>Now what?</i></span></div></div>",
            "created":1147928400,
            "id":319382,
            "title":"Discovered"
        },
        "1331":{
            "choices":[
                "Suddenly Arrent realized what she was asking about",
                "Arrent couldn't figure out what she was trying to say"
            ],
            "content":"<div class=\"\"><div> <span>\"Ummm...  Do...you...speak...english?\"  Arrent asked as if she were talking to a three year old.  <br>\r\n\"I...speak...little...english.\" She said as slowly as Arrent had.  \"How...\" She stopped and thought for a second, as if she didn't know what to say, or how to say it.  \"How...did...\"  Arrent thought about what the woman might have been trying to ask her.  </span></div></div>",
            "created":1150779600,
            "id":325396,
            "title":"English"
        },
        "134":{
            "choices":[
                "Come to life.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>The woman seemed to sense that there was something different about Arrent's pod.  Slowly, she reached over.  Arrent was frozen with worry.  Just as the woman was about to touch her pod, the door opened.  Into the room, there came a tall, dark-haired man.<br>\r\n<br>\r\n\"Tanya,\" said the man firmly.  \"What are you doing in here?  This isn't part of the tour.\"<br>\r\n<br>\r\nTanya turned.  \"Oh, I know, Ken, but it's clear that the really neat stuff is in the labs that don't want you to see.  Look.\"  She indicated Arrent's pod.  \"This girl was from our planet.  She must have lived thousands and thousangs of years ago.\"<br>\r\n<br>\r\nArrent was confused.  Our planet?  Thousands of years ago?  Where was she?  What was going on?<br>\r\n<br>\r\n\"Are you having fun so far?\" asked Ken, more romantically than before.<br>\r\n<br>\r\n\"Oh yes,\" said Tanya.  \"I never want this honeymoon to end.  We'll have so many stories to tell the folks back on Earth.\"<br>\r\n<br>\r\n<i>Earth?!</i>  Arrent was even more confused.  She was very tempted to spring to life and demand some kind of explanation from these people.  <i>What the hell is going on here?!</i> she wondered.</span></div></div>",
            "created":1149742800,
            "id":323118,
            "title":"Tourists"
        }
    },
    "info":{
        "author_id":"judasfm",
        "author_name":"JudasFm",
        "brief_description":"Interactive story. A girl is awoken after having been cryogenically frozen for 10000 years",
        "created":1147954320,
        "description":"<td align=\"left\" class=\"norm\">Katherine Arrent (who likes to go by her surname rather than her first one) is seventeen years old and was on her way home from a nightclub when she was hit by a car, suffering near-critical injuries. There was no treatment available, but a new form of cryogenic freezing had just been developed, and Arrent's parents agreed to have their daughter frozen until a treatment was developed. Arrent was moved down into the heavily secured underground depot, where there were already a few other bodies. Unfortunately the hospital (along with the rest of the city) was bombed two days later in a terrorist attack, and nobody knew about the depot until much later when an archaelogical team accidentally found it. The frozen bodies were moved to the nearest place (in this case a world called Akkhen) and left there to be examined later.<br>\r\n<br>\r\nAkkhen is a huge world. The small part of it that Arrent is on is called Lior, with the capital city being Lioret. Its unpolluted exterior belies the truth; it's under the rule of a harsh totalitarian regime. Inhabitants speak Akkhenian and varying degrees of English, from fluent to none. The question is, will Arrent's choices lead her to forming a rebellion, or joining the government? Or will she simply find a way off Akkhen at the earliest opportunity? The choice is yours.<br>\r\n<br>\r\nThere are no real rules for this except to please bear in mind the 13+ rating.<br>\r\n<br>\r\nWhen adding the choices at the bottom, I would like one of them to be along the lines of 'Something else', but granted this only leaves you one other choice to play around with, I'm not going to make it obligatory.  If I find any chapters with only ONE choice given, however, I will add the second 'Something else' choice.<br>\r\n<br>\r\nIf a chapter breaks the rule about graphic or profane content, or if the spelling and grammar are both incorrect, I will edit it.  Otherwise, I won't interfere <img style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/smile.png\" alt=\"*Smile*\" class=\"emoteZ\" title=\"Smile\" border=\"0\" width=\"15\" height=\"15\"></td>",
        "id":1107485,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1450480560,
        "modified":1450480560,
        "pretty_title":"Hero or Villain"
    }
}