{
    "chapters":{
        "1":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "Divahar (Armenian all female band). ",
                "Mallika Sunderamurthy (Vocalist of Abnormality)",
                "Alissa White Gluz. (Vocalist of Arch Enemy)",
                "Lacey Sturm  (Flyleaf) ",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who’s the goddess or goddesses? </span></div></span></div>",
            "created":1578718800,
            "id":2772362,
            "title":"Which female goddess? "
        },
        "11":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "On Dev Divahar’s sandal ",
                "Climbing Dev Divahar’s boot ",
                "Shrunk while mountain climbing with Dev. ",
                "Shrunk in your car as the band stands over you ",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you? </span></div></span></div>",
            "created":1580101200,
            "id":2779365,
            "title":"Divahar (Armenian all female band). "
        },
        "111":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "David's body is crushed underfoot",
                "David is trapped under Dev's massive foot",
                "David managed to roll out of the way of Dev's sole"
            ],
            "content":"<div class=\"\"><div> <span>After an hour of struggling through crushing pressure and strength-sapping heat, David thrust one hand upward into fresh air and struggled for a handhold he could drag himself up using! His fingers gripped into the thick edge they found, giving the exhausted man enough leverage to finally pull himself up, through the tight crevice, and into the blinding light above! “F-Fuck! It’s like she has those glued to her ass!” he exclaimed, his whole body shaking from an ear-splitting sound he had already been bested by, blood running from his burst eardrums. Instead, the roaring around him was just a dull throbbing in his ears. He didn’t care. Those cheers weren’t for him. They were for her….<br>\r\n<br>\r\n“THANK YOU EVERYONE! BUT WE’RE NOT DONE YET!” her voice thundered through the speakers, drawing an even louder scream from the crowd. The world shifted once again and David knew he had only seconds to act. <br>\r\n<br>\r\nPraying, David pulled his full body through the crevice and began plummeting past the black pillar toward the wooden floorboards far below. Looking back, he could see his prison far overhead: the back-right pocket of Dev’s tight-fitting pants. Part of David wished he’d just splatter against the stage rather than survive like this, a mite of a man. His gaze shifted back to the floor and Dev’s looming sandal…that shifted. His eyes went wide and he braced for impa-<br>\r\n<br>\r\nTHUMP!...THWACK!<br>\r\n<br>\r\nAching all over, David cursed and struggled to stand up only to fall back on his ass again. Who the hell could have guessed Dev’s fucking foot would get in the way! Bouncing off the pale flesh had tormented him twice…not only did it break his fall, but even his little body managed to tickle Dev enough. He could feel her eyes glance down. Their gaze brought an oppressive weight as they locked on his crumpled form to the left of her sandal. He needed to move. NOW!  <br>\r\n<br>\r\n\tThe first note of the band’s next song rang out, forcing David’s giant captor to focus again on the cheering crowd in front of her. David thought this was his chance, but he should have known that the metal band’s frontwoman wasn’t going to let him go without a fight. A dark shadow grew over David as he timidly looked over his shoulder and saw the lifting slab of rubber that was Dev’s sandal. If she couldn’t keep him, she’d crush him. Anything was fine so long as no one discovered him. There were always more people to shrink down if she could keep the secret. David screamed, his body taking over as his brain froze in fear. Scrambling forward, David just barely managed to throw himself forward as Dev stamped down in time with the first guitar riff of this set!<br>\r\n<br>\r\n\tBABOOOOOOOOOM!<br>\r\n<br>\r\n\tDust blew up all around David, along with a buffeting gust of wind that knocked him on his face. Looking back desperately over his shoulder, he could feel fear clutch his heart as Dev slowly began grinding her sandal back and forth, trying to snuff out the life she thought was beneath it. <br>\r\n<br>\r\n\t“Oh f-fuck! This bitch is crazy!” David whimpered, feeling dampness in his pants as he slowly tried to crawl away from the wall of rubber. <br>\r\n<br>\r\n\tHer eyes shot down again and narrowed. This time she didn’t stomp, her foot lifted ever-so-slightly, dust falling from it like the rubble of a building. With a quick step, she moved her foot well over his body and stepped down. Trapped. David found himself trapped between Dev’s two massive sandals! Slowly, her right foot began dragging along the ground, trying to make sure he had nowhere to run, nowhere to hide. Dev wasn’t here to play cat and mouse; she was here to put on a show and remind a bug that he was her property….<br>\r\n<br>\r\n\tStaying here and waiting was asking for death, it was like watching a fucking rash compactor coming together…from the perspective of the trash! If she was going to crush him, David wasn’t planning to make things this easy for Dev. Turning, he began desperately feeling along the rubber instep of her sandal, hoping to find a groove or imperfection that he could use to climb higher. It might be dangerous, but getting over her foot would let him run again…and she couldn’t follow too much more without drawing attention to him. Either he’d get free of her by himself or someone would see and rescue him. Either way, all he had to do was climb over this fucking sandal! Finally, David found the kind of rough material he needed to scale the side of her sandal. Gripping onto the rough edges and grooves worn into the side of Dev’s sandal, David began climbing toward its insole; the pale wall of flesh; and, hopefully, freedom from this nightmare.  <br>\r\n<br>\r\n\tGRRRRRRRRRN….<br>\r\n<br>\r\n\tDev’s mind was racing as she continued trying to drag her feet together and get through this song. If they found the tiny creep on stage right now, then they might find the others. They’d know about all the little ones she’d played with in the past and…well, it was something she’d really like to avoid. Shrinking down this venue and her band were an option, but she prayed it would remain remote….<br>\r\n<br>\r\n\tDavid groaned, his muscles aching after escaping from her pants, falling to the floor, and almost getting crushed underfoot twice now. He didn’t know how much longer he could struggle like this, but as his hand finally slapped against the damp leather insole of Dev’s sandal, he found his umpteenth second wind of the day! Pulling himself up and rolling onto Dev’s insole, David looked at the pale wall of flesh, wrapped in stocking and swallowed nervously. In the panic earlier, he hadn’t really tried to see just how big the colossal woman he was trying to escape from was (and it wasn’t like he could gauge it when pressed against her ass). Taking his firth breath in a while, he could see that she’d made him absolutely miniscule. He could see dead skin on her foot’s arch; he could see the fraying edges of her stocking; he could hear the groaning strain of her insole under her weight; he could practically taste her perspiration on his tongue; he could see what he was compared to her…nothing. Less than that. He wasn’t even a bug, just a mite. And to make matters worse, as David was struck by his pathetic situation, Dev adjusted her stance…her ankle rolled a little…and David found himself tumbling into the darkness of her foot’s arch and the wrinkled ceiling of her sweaty sole….<br>\r\n<br>\r\n\tTHOOOM….<br>\r\n</span></div></div>",
            "created":1584853200,
            "id":2805335,
            "title":"Closer Than Front Row...."
        },
        "115":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "Dev grows gigantic and doesn't realize...",
                "Dev grows gigantic and is aware of her situation...",
                "More Options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other Dev options?</span></div></span></div>",
            "created":1583470800,
            "id":2797578,
            "title":"More Dev! "
        },
        "1152":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "The tickle in Dev's nose gets too strong... she sneezes...",
                "Dev goes on the hunt for a dildo stand-in....",
                "Dev sees a news crew reporting on her in the distance....",
                "Dev grows bigger in her Excitement! ",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>Pulling into the parking lot, Julie was practically bouncing in her car to Dev’s music, pre-gamming the concert so she didn’t blow her whole budget at the venue’s bar. As the music pounded and drinks spilled down her gullet, Julie cranked up the music and literally began bouncing in her car. She wasn’t sure if it was because she’d poured too heavy or because she was so excited, but Julie could have sworn she felt her whole car shaking with her! Her phone buzzed from friends asking if she was alright; they were inside the venue and seemed concerned…Julie figured it was because she still hadn’t gone inside. Without texting them back, Julie killed the engine and kicked open the door to her car, flask in hand. Taking another deep swig, she jumped out and giggled while slumping against the neighboring car. She threw her door closed and just enjoyed the night air on her skin. Looking up, she felt confused. “W-Where the fuck ish the moon?” Julie asked. It hadn’t been cloudy tonight, yet all she could see overhead was darkne-<br>\r\n<br>\r\nBABOOOOOOOOOOOOOOOOOOOOOOOOOOM…….<br>\r\n<br>\r\n\tDev felt her pale cheeks flush red and slowly slid a hand between her legs, rubbing at the tight fabric of her pants as the sensation of crushing metal and buckling asphalt managed to make it through her sandal to her soft soles (<a rel=\"nofollow\" href=\"https://scontent-iad3-1.xx.fbcdn.net/v/t31.0-8/412193_378992992139620_1431705315_o.jpg?_nc_cat=106&amp;_nc_sid=e007fa&amp;_nc_ohc=p17wAKzGh8kAX_SCJLn&amp;_nc_ht=scontent-iad3-1.xx&amp;oh=839c633e5e9d865b78d73f7e4b2f0437&amp;oe=5EA85B85\" target=\"_blank\">https://scontent-iad3-1.xx.fbcdn.net/v/t...</a>). Part of her wished she had done that barefoot, but there was always another parking lot on this stupid city that would be waiting for her foot to fall on it. Biting her bottom lip, Dev wordlessly looked down at her sandal and began grinding it back and forth. She had no clue how many people were in that parking lot, but it had been packed. At least a couple? Fuck, she hoped one of them looked up before she stepped down on their worthless little face! A soft moan escaped Dev’s lips as the power surge she was feeling raced through her body like electricity. Her gaze slowly lowered to see the small black building she had been schedule to play at tonight. Dozens of sweaty bodies were crammed into its walls, all waiting for her. Well…they were about to get more than they bargained for. Grinding her foot a little more, she tapped her sandal on the ground and delighted in the damage she saw that caused to the surrounding buildings! Windows cracked and facades crumbles in the wake of the Dev-quake. Shifting her eyes back to the building, Dev saw some of her little fans coming out to see the damage. Her eyes went wider when she saw the venue apparently had a tarp roof that it was pulling back to appease her panicked audience. <br>\r\n<br>\r\n\t“Showtime~” she whispered, already feeling hot again as she imagined the view from inside the venue. After several tremors that would have doubtlessly caused a panic, the roof slowly pulled back to reveal pale moonlight…and Dev, staring down at them like some ancient, dark goddess, come to wreak havoc. Her ears picked up the faint echo of a panicked choir of screaming. She was wet…enough foreplay, time to do what she came here for. <br>\r\n<br>\r\n\tSquatting over the venue, Dev knew that all eyes were on her…though she was clueless that the horrified onlookers could already smell her excitement; it served to terrify them even more. Planting her hands on either side of the building, Dev couldn’t help but laugh as she felt the fragile buildings crumbling against her palms. She’d broken gingerbread houses with more structural integrity. Some little ones looked like they were trying to run through the front, causing Dev to just roll her eyes (<a rel=\"nofollow\" href=\"https://sun9-50.userapi.com/c621704/v621704362/56aca/y72uSUxWmhU.jpg?ava=1\" target=\"_blank\">https://sun9-50.userapi.com/c621704/v621...</a>). With a flick of her finger, she caved in the front and back entrances to the venue before brushing her hair back behind her ear. Looking down at the tiny people like a cat eyeing cornered mice, Dev cooed, “WELCOME TO THE SHOW, BUGS~ THERE’S BEEN A CHANGE IN THE LINEUP TONIGHT…YOU LUCKY ONES ARE GOING TO GET A PRIVATE SHOW~ FEEL FREE TO THANK ME.” <br>\r\n<br>\r\n\t Inside the venue, the terrified onlookers began pushing and shoving, looking for an exit that didn’t exist as their gothic-themed goddess overhead loomed menacingly. Screams grew as a second moan managed to sneak past Dev’s lips, shaking everyone to the bone and threatening to burst eardrums. <br>\r\n<br>\r\n\t“FUCK…I CAN’T TAKE IT ANYMORE~” Dev purred, leaning in closer. Her face now took up the entire sky…her flushed cheeks told the crowd all they needed to know: the more frightened they became, the hotter Dev was going to get (<a rel=\"nofollow\" href=\"https://i.ytimg.com/vi/4s_KSewezGo/hqdefault.jpg\" target=\"_blank\">https://i.ytimg.com/vi/4s_KSewezGo/hqdef...</a>). This wasn’t an extermination; they didn’t deserve that kind of recognition. This was playtime, and Dev’s dedicated audience had become her unwilling playthings. Dev’s overwhelming presence was driving some people mad, screaming and begging to wake up from their nightmare. As if in response, Dev bit her bottom lip hard enough to almost draw blood before bringing her face in closer. The little ones could hear the crumbling of masonry as one of Dev’s fingers appeared and pushed against a nostril, closing it. People realized too late what was going on as Dev inhaled deeply…dragging more than a dozen people from the venue and snorting them like a party drug many had partaken in before the show. Their screams were drowned out in the roar of Dev’s snorting, but the giggling and groaning from Dev let everyone know that the unlucky ones were fighting for their lives deep in her nose…and losing…<br>\r\n<br>\r\n\t“OOOOOOH~ THEY’RE STILL GOING? AMAZING~” Dev moaned, not caring whether her voice deafened every one of her toys. They didn’t need their ears to scream or struggle. Speaking of struggling, Dev thought that snorting some tiny fans would have just been silly, maybe make her sneeze. She was dead wrong. <br>\r\n<br>\r\nInstead, it felt like she’d taken a hit of a powerful aphrodisiac! Groaning, Dev leaned back, plopping her tight ass into the middle of the parking-lot (and the neighboring buildings) that had been demolished under her sandals. She leaned her head back, the tingles and tickles from her victim’s struggling acting like a bolt of lightning running right to her libido! <br>\r\n<br>\r\n\tDeep inside Dev’s left nostril, the dozen or so tiny fans were each engaged in their own life-or-death struggle. The shifting of the world as Dev leaned back and crashed on her ass had made their situations go straight from bad to worse. One unlucky fan had been clinging onto a nose-hair, but when Dev plopped down, she found herself falling…falling…falling…until he head found itself getting caught in a bit of mucus on a hair; it acted like a noose, instantly snapping her neck and leaving her limp body flopping until it was swallowed by the gooey matter coating the walls of this cavern. A second one had been sucked clean back through Dev’s nose and found themselves in pitch-black darkness trying to climb the slick walls of her nasal cavity. As Dev leaned her head back, the tiny man rolled backwards and found himself sliding slowly down the back of Dev’s throat. Others were struggling to drag their way out from a glob of snot, or clinging to nose hairs, or drowning in her mucus if they were supremely unlucky. Each struggle though tickled Dev’s nose hairs; each tickle sent a small shock through her body; and knowing what was causing those tickles, each one just made Dev inch closer and closer to grabbing the nearest sturdy object to masturbate with…<br>\r\n</span></div></div>",
            "created":1585458000,
            "id":2809947,
            "title":"Nothing Like Sex, Drugs, and Giantesses"
        },
        "12":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "Tied to her flip flop thong ",
                "In her food at the venue ",
                "She’s giant performing for a tiny crowd ",
                "She’s giant and unaware of the venue ",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you starting? </span></div></span></div>",
            "created":1578718800,
            "id":2772447,
            "title":"Mallika Sunderamurthy (Vocalist of Abnormality)"
        },
        "125":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "Shrunk behind her bar as she bar tends ",
                "In her drink at the bar ",
                "Inside her sneaker she’s about to wear ",
                "she Trapped you on the floor Drain as she works ",
                "More "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about any of these? </span></div></span></div>",
            "created":1588734780,
            "id":2830936,
            "title":"More Mallika options "
        },
        "13":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "On stage shrunk near her mic stand ",
                "On her food tray ",
                "She’s giant arriving at the tiny concert ",
                "She shrunk the venue ",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where do we begin? </span></div></span></div>",
            "created":1578805200,
            "id":2772678,
            "title":"Alissa White Gluz. (Vocalist of Arch Enemy)"
        },
        "135":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "In her sneaker during a concert ",
                "She put you in her sock at the meet greet ",
                "On her sandal ",
                "In her hair ",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where else are you?</span></div></span></div>",
            "created":1580360400,
            "id":2780674,
            "title":"More Alissa choices "
        },
        "14":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "On stage shrunk while filming ",
                "In her tourbus shrunk ",
                "Lacey is giant ",
                "Shrunk at her merch booth ",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you?</span></div></span></div>",
            "created":1579410000,
            "id":2775640,
            "title":"Lacey Sturm  (Flyleaf) "
        },
        "142":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "In her cereal ",
                "On her doormat ",
                "At her pile of shoes ",
                "Climbing her head ",
                "More "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where in her bus are you?</span></div></span></div>",
            "created":1585544400,
            "id":2810528,
            "title":"In her tourbus shrunk "
        },
        "144":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "You and her booth shrunk ",
                "On the table as she signs merch ",
                "Stuck on her shoelaces ",
                "Climbing her Toms ",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you?</span></div></span></div>",
            "created":1587766920,
            "id":2823950,
            "title":"Shrunk at her merch booth "
        },
        "1441":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "Lacey saw the smashed remains of the booth...",
                "Kat was smaller than she thought, Lacey saw nothing...",
                "Kat stays wedged in the treads as Lacey walks around ",
                "She sees you! ",
                "She takes off her shoe and you fall in "
            ],
            "content":"<div class=\"\"><div> <span>“Huh…it…did I get the place wrong?” Lacey asked, checking the map on her phone again and spinning around to see if she could identify some landmarks. Nope. She was on the right part of the venue and all the shit that should have been around her merch booth was all correct. “Fuck…I mean…Kat’s the one setting up tonight. She normally does it right,” Lacey sighed, flicking the map away and scrolling through her contact list to see if she’d remembered to save Kat’s number in her phone. Finding the number, she pressed it and held the phone to her ear as the dial tone began to sound. Nearby, the phone began to ring…but Lacey wouldn’t hear it. Afterall, Kat’s phone wasn’t as big as Lacey’s anymore…nor was Kat. Shivering, Lacey’s merch booth salesperson looked up at the headliner looming over her like a downtown skyscraper…with feet….<br>\r\n<br>\r\n\tTHOOOOOM….<br>\r\n<br>\r\n\tKat screamed, ducking behind the merch booth as Lacey’s left foot slammed down a few inches away from her hiding spot, kicking up a cloud of dust and debris that rained down on her like a landmine had just gone off! Peeking out from under the booth’s tablecloth, Kat felt her heart leap into her chest. About 10 yards in front of her was a wall of white rubber that stood at least 7 feet high. The top row had a series of thick black ropes weaving in and out of the material, linking the rubber rampart to a massive sail of black canvas that was peppered with bits of dust and debris that clung to the woven material like remnants of grapeshot lodged in a castle’s wall. Higher still, Kat saw as the fabric gave way to pale flesh; veins stood out like blue waterslide tubes and Lacey’s ankle cast its own shadow that swallowed the booth in its darkness. Kat had always liked Toms in the past; they were comfy and cute. Lacey’s pair gave off an entirely different feeling now; from her position on the ground, the cute flats now looked like an imposing fortress…and Kat was the unfortunate soul who now had to launch a lone assault on its wall (<a rel=\"nofollow\" href=\"https://m.facebook.com/LaceySturm81/photos/a.297219620387709/2498458943597088/?type=3&amp;source=54&amp;ref=page_internal\" target=\"_blank\">https://m.facebook.com/LaceySturm81/phot...</a>). Whimpering, Kat could only stare as Lacey squatted down and her own phone’s ringing stopped; from her eyes rolling, it was clear she’d been sent to voicemail. One chance to contact the giantess who’s mere presence dominated her world, and Kat had let it slip by. <br>\r\n<br>\r\n\t“L-Lacey?” Kay managed to squeak, her voice cracking as the wall of Lacey’s foot groaned from her shifting weight. “L-Lacey! Lacey, oh fuck, please! I’m here! I-I’m down here!” Kat began to scream, her voice gaining strength with every word. Still, even when she began shouting at the top of her lungs, Kat’s voice didn’t even make Lacey twitch in response. <br>\r\n<br>\r\n\tGRRRRRRRRRN….<br>\r\n<br>\r\n\tThe tiny woman’s eyes shot back down to see the white, rubber portion of the Toms had moved…closer? To Kat’s horror, Lacey slowly began rising to her full height once more. In a matter of moments, Lacey was once again taller than the Empire State Building and stretching higher. Rising onto her tip-toes, Lacey sighed and shifted her stance. Kat pissed herself as the dirty sole of Lacey’s Toms replaced her sky…and began to fall. “F-Fuck! Fuck, fuck, fuck! Not like this! I-I’m not gonna die like this! L-Laaaaaaaaceeeee-”<br>\r\n<br>\r\n\tBABOOOOOOOOOOOOOOOOOOOOOOOOOOOOOM….<br>\r\n<br>\r\n\tThere was no more booth. It had crunched under the ball of Lacey’s foot, shattering into a mess of splintered wood, twisted metal, smashed shot-glasses, and crushed coffee cups. T-shirts, sweaters, and other clothing that had been piled high were flattened into a messy mass of fabric, sliced to bits by the tiny pebbles that had been lodged in the underside of her footwear. Everything that had been caught by the unforgiving rubber sole of Lacey’s flats was flattened. Everything. Panting and sobbing in relief, Kat saw that she had managed to scrape by the fraction of an inch that separated her continued existence as a person… from her potential death as a greasy smear on Lacey’s sole. Although she was bug-sized, Kat was alive. At least for now. But if she didn’t move soon, another twist of Lacey’s foot might spell the end of her. <br>\r\n<br>\r\n\tKat couldn’t afford to wait and plan her next move. There was one place nearby where she would be least likely to get stepped on…and that was on Lacey’s foot itself. Looking up at the instep of Lacey’s left foot, Kat knew that this was stupid, but staying still was even dumber. Running forward, she leaped at the rubber wall and began scrambling up the small imperfections. “J-Just need…to…reach…the…fabric,” she groaned, struggling to find hand and footholds on the thick material. Maybe it was because she was so tiny or maybe it was because of the adrenaline running through her system, but Kat managed to scramble up the wall and grabbed hold of the black stitching with an iron grip. That was one step down. Unfortunately, Lacey looked like she was about to take another step.<br>\r\n<br>\r\n\tTHOOOOM….<br>\r\n<br>\r\n\tWith her stretch over, Lacey allowed her heels to come back down onto the tile floor (nearly shaking Kat off her precarious hold in the process). Stowing her phone back in her pocket, Lacey was about to move when she felt something under her foot. Something…dusty? It was slight, but her foot just seemed to shift. Lacey remembered that this venue had a very special security system; anyone in an unauthorized area  was warned and, if they didn’t vacate the area, shrunken. It had been designed to stop people from stealing and running since you needed to be found and restored to your normal height. Lacey had thought that the system was turned off for them…but the slight sensation of something crunching under the thing rubber sole of her Toms made Lacey begin to break out in a nervous sweat. <br>\r\n<br>\r\n\t“Oh no…nonononono…. Not Kat,” Lacey whined, looking around and finding a nearby table she could plop herself down on top of. Slowly lifting her left foot, Lacey began bouncing toward the table on her right foot, cursing under her breath and praying that Kat just flaked on them.  <br>\r\n<br>\r\n\tTHOOOM!<br>\r\n<br>\r\n\t“S-Shit!” <br>\r\n<br>\r\n\tTHOOOM!<br>\r\n<br>\r\n\t“Nononono!”<br>\r\n<br>\r\n\tTHOOOM!<br>\r\n<br>\r\n\t“L-Lacey! Please!” Kat whined, her fingers burning as each of the giantess’ bounces toward the table threatened to doom the shrunken woman to a bone-shattering freefall. It seemed like Lacey had gotten the picture of what was going on, but her attempts to be careful were going to kill Kat at this rate! Digging deep, the tiny woman dug her hands into the black ropes even further, causing her fingers and knuckles to scream out in pain as each hop threatened to push them beyond their limits. If the pressure had increased on a single finger much more, then Kat knew they’d snap. Broken hands couldn’t help her climb the giant singer. It was a race against time. Would Kat’s hands last till Lacey made it to a seat? Or would she lose her grip and splatter on the dirty tile floor below?<br>\r\n<br>\r\n\tTHOOOM!<br>\r\n<br>\r\n\t“Please, please, please let me be wrong,” Lacey whined as she made it to the table and turned around, planting her butt on the surface and hoisting herself up. Legs crossed, the giant woman paused, almost too afraid to see what debris might be clinging to the sole of her left foot (<a rel=\"nofollow\" href=\"https://ibb.co/xs9PPL8\" target=\"_blank\">https://ibb.co/xs9PPL8</a>). What if? Lacey felt her cheeks growing red at the thought. Poor Kat. Down there. Calling for her, screaming for help. Did she really? Closing her eyes tight, Lacey swallowed audibly and grabbed her foot, pulling it closer for a look. <br>\r\n</span></div></div>",
            "created":1588825740,
            "id":2831563,
            "title":"If You Break It, You Bought It"
        },
        "15":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "Melissa Bonny ",
                "Ariana Grande ",
                "Kehlani. (Not metal but awesome )",
                "Nuki (Daria Stavorich p)",
                "More "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More singers to choose </span></div></span></div>",
            "created":1578891600,
            "id":2773427,
            "title":"More women "
        },
        "151":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "Shrunk backstage as she arrives ",
                "In the port o Potty as she arrives there ",
                "On her merch table ",
                "She’s giant at the concert ",
                "More "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you? </span></div></span></div>",
            "created":1579064400,
            "id":2774095,
            "title":"Melissa Bonny "
        },
        "152":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "In her Starbucks coffee ",
                "In her Uggs",
                "Climbing her Crocs ",
                "She shrunk you at a protest ",
                "More "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you? </span></div></span></div>",
            "created":1594390860,
            "id":2865382,
            "title":"Ariana Grande "
        },
        "1521":{
            "author_id":"kokobeen",
            "author_name":"unkown7",
            "choices":[
                "Climb out ",
                "Stay in the shoe",
                "Hayley starts putting it on!"
            ],
            "content":"<div class=\"\"><div> <span>You slowly sat up, rubbing your head in confusion. What was going on? The last thing you remember...your friend told you that he had a genius way to sneak you onto the tour bus of Hayley Williams. You managed to sneak onboard, he gave you some weird drink...and that's the last thing you remember. <br>\r\n<br>\r\nBut now you were in an unfamiliar location. It was dark, moist, and had a heavy smell in the air. It looked like you were in some kind of dark tunnel, and there was a beam of light up ahead. You started walking towards it...and gasped as you finally saw your surroundings. <br>\r\n<br>\r\nYou were inside a shoe! Somehow, your friend shrunk you and planted you inside this shoe...which means...this shoe belonged to Hayley! Despite the situation, it was a bit exciting to know that you actually made it onto her tour bus! <br>\r\n<br>\r\nNow...what to do? </span></div></div>",
            "created":1585371600,
            "id":2809147,
            "title":"Inside her vans shoes "
        },
        "153":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "On stage shrunk as she sings ",
                "On her person as she’s Out doing things ",
                "At a protest ",
                "Kehlani is giant at the venue ",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you? </span></div></span></div>",
            "created":1582434000,
            "id":2791813,
            "title":"Kehlani. (Not metal but awesome )"
        },
        "1532":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "In her chewing gum ",
                "In her sneaker treads",
                "On her sandal ",
                "In her pocket ",
                "More "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you at? </span></div></span></div>",
            "created":1597459320,
            "id":2885752,
            "title":"On her person as she’s Out doing things "
        },
        "1533":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "Kehlani sneezes and changes masks ",
                "She sees more cops to shrink ",
                "She shrinks some looters ",
                "She inadvertently shrinks random people and things ",
                "More "
            ],
            "content":"<div class=\"\"><div> <span>Kehlani could hear the chanting echo in her ears; she’d only been a block away when the two pigs showed up in her path. Two plump, pink, pale officers stood in heavy equipment and glared at Kehlani menacingly. The taller of the two stepped forward, reaching down for the nightstick he kep on his hip as he spat, “Curfew was set for 3pm today, miss. You’re currently violating that so we’ll be taking you in.”<br>\r\n<br>\r\nKehlani could already feel her blood boiling as her mask his the vicious sneer painted across her face. “Don’t fuck with me, bitches. I’m exercising my fucking rights here, get out of the fucking way!”<br>\r\n<br>\r\nThe cops looked at each other and snickered as the tall one began advancing forward even faster; his friend leaned against their car, all too happy to watch as his partner took out his nightstick and reached for a can of pepper-spray. “She’s resisting, put her down,” the short one said as the man before Kehlani took a swing at her with his club! She just barely managed to back away in time for the weapon to miss her face. “Come on! Spray the bitch!”<br>\r\n<br>\r\n“I’m trying!” the first one said, fumbling for the can.<br>\r\n<br>\r\n“Fuck you,” Kehlani spat. “My turn, fucker!” Whipping a small bottle out of her pocket, Kehlani pressed down as a blue spray hit the cop in front of her right in the eyes. The other gasped and charged forward, getting his own blast in the face. Unlike their spray though, this didn’t sting the eyes and choke the lungs. It had a…slightly different effect. Rubbing at their eyes, both cops would eventually notice that they didn’t see the woman they’d cornered in front of them anymore. Nor the street they’d been on! It looked more like some kind of thick, rubbery wall…and…<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://hypelifemagazine.com/wp-content/uploads/2020/02/Kehlani-New-Song-Valentines-Day-Shameful-Addresses-Her-Split-From-YG.jpg\" target=\"_blank\">https://hypelifemagazine.com/wp-content/...</a><br>\r\n<br>\r\n“What. The. Fuck?” the first one said, his chest getting tight as he saw the rubber wall leading to canvas, then mocha skin, and a pant leg that seemed to extend forever into the sky… until he saw Kehlani’s massive face as she pulled back her mask. The sky-scraper-sized woman raised her middle finger and spat at the ground, the wad splashing down just to the first officer’s right (almost swallowing him up in the process) as her gaze burned into the two cops’ souls.  She didn’t even blink as she growled, “OINK, OINK, MOTHERFUCKERS…” <br>\r\n<br>\r\nThe first cop struggled to his feet, flipping over in a puddle that he instantly regretted touching…he’d laughed earlier when he “tested” his spray on the ground…now he was in the puddle. Gasping, he turned and looked over his shoulder to see Kehlani’s eyes on his partner. Maybe she hadn’t seen?! Struggling to his feet, he stirred up the liquid and felt as the chemicals made their way through his nose and mouth. His eyes began to burn and water…and he quickly began coughing a lung up! Struggling to breath, the tiny cop looked up and felt his bowels empty as he noticed Kehlani’s gaze had shifted down to him. “Oh…oh fuck, fuck, fuck, fuck!” he screamed, turning to run even as tears and snot streamed down his face….<br>\r\n<br>\r\nBABOOOOOOM!...<br>\r\n<br>\r\n“NO, NO, NO…IT’S AFTER CURFEW, YOU CAN’T JUST LEAVE. EVEN THOUGH LITTLE PIGGIES LOVE TO GO ‘WEE, WEE, WEE’ ALL THE WAY HOME~” Kehlani whispered, lightly resting her sneaker on top of the struggling man who’d tried to club and spray her only moment ago     <a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/56/f4/ff/56f4ffb039293c120ea7e7d8ef8b13e8.png\" target=\"_blank\">https://i.pinimg.com/originals/56/f4/ff/...</a><br>\r\n   “I COULD CRUSH YOU, LIL PIGGY. IT WOULDN’T EVEN BE FUCKING HARD…” she said, pressing down more until the tiny cop had his face fully submerged in the pepper spray… “COME ON, LIL PIGGY…WEREN’T YOU GONNA PUT ME IN MY PLACE OR SOME OTHER MACHO CRAP? NOW YOU CAN’T EVEN MOVE A LITTLE FOOT ON YOUR BACK?”<br>\r\n<br>\r\nThe officer under her foot thrashed for a few more seconds, struggling in vain to push the weight of Kehlani’s sneaker off his back to no avail. Between the chemicals and crushing force on his back, the first little piggy wasn’t able to hold out for long before he took in a deep breath…inhaling an entire lung-full of the chemical which caused him to seize as his body attempted to purge the liquid from his lungs in vain…. It was a painful, drawn-out death that Kehlani didn’t even notice. As soon as the first little pig disappeared underfoot, her eyes shifted back to his little friend. <br>\r\n<br>\r\n“COME HERE, LIL PIG,” Kehlani whispered, bending down a little more as she reached out and quickly scooped the frieghtened little cop up in her hand. She could feel the fat fuck tumbling in her grasp, smacking into the pads of her fingers and nails as he went from scared of getting picked up to terrified of being let go! He found himself hovering above the ground and zipping toward the curb when he noticed Kehlani’s foot planed right past the drop in a small pool of spray…. His eyes searched desperately for his friend as he tried climbing across her fingers for a better look when the air around him shook with Kehlani’s chuckle. “WHAT’S WRONG? LIL PIGGY MISSES HIS LIL PIGGY FRIEND?” He saw as her foot against the curb slowly began to press down and got a sinking feeling in his stomach.<br>\r\n<br>\r\nTurning, he was about to say something when the sound hit his ears….<br>\r\n<br>\r\nCRRRRRRRRRRNCH~<br>\r\n<br>\r\nSlowly, the second cop turned around and felt his stomach knotting up in terror as a small pool of red liquid began seeping out from under Kehlani’s sneaker…mixing with the clear pepper spray residue on the filthy street below.<br>\r\n<br>\r\n“WHAT’S THE MATTER, LIL PIG? ACAB. ALL COPS ARE BUGS, YOU LITTLE FUCKER…”<br>\r\n<br>\r\nThe officer began to cry like a baby as he called up at the giantess, “P-Please! He was the r-real problem! I’m one of the good ones! I-I kneeled with the protesters yesterday and everything!”<br>\r\n<br>\r\n“I THINK YOU TOLD HIM…’SPRAY THE BITCH’ RIGHT?”<br>\r\n<br>\r\nHe looked pale as a sheet.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"https://tenor.com/view/kehlani-kehlani-ashley-parrish-slay-chewing-gum-so-cute-gif-16501069.\" target=\"_blank\">https://tenor.com/view/kehlani-kehlani-a...</a> ”DONT WORRY,” Kehlani said as she lifted him to her face and smirked<br>\r\n   “I’M NOT GONNA CRUSH YOU LIKE YOUR LITTLE FRIEND, PIGGY~ BUT YOUR FRIEND ALREADY GOT IN TROUBLE WITH PEPPER SPRAY AND YOU DON’T HAVE A MASK…I GUESS I CAN GIVE YOU A FIGHTING CHANCE; WE’LL SHARE MINE~,” Kehalni said, shifting her mask back so it was in front of her face. Pulling it open by her nose, she lifted the cop over the dark, humid space occupied by her nose and mouth as she giggled, “DON’T GET LOST, LIL PIGGY…IF YOU NEED SOMEONE TO HELP YOU…TRY CALLING 911~” and dropped him inside…. Kehlani could feel as the terrified little pig rolled down the front of her mask and smashed into her bottom lip. She spat at him a little, knocking him back against the wall of her mask…and didn’t feel him again. Between the humidity in the mask, his small statute, and the bit of spit, he was plastered against the mask wall, stuck staring at the deep, dark, abyss of Kehalni’s mouth in front of him as the singer brushed herself off and set off toward the protesters one street over…not even pausing as her foot crushed their minimized cop car along the way….</span></div></div>",
            "created":1591664460,
            "id":2848298,
            "title":"No Justice no Peace! "
        },
        "1535":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "Grabbing food on a rare day off",
                "Growing giant in the city",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where is Kehlani?</span></div></span></div>",
            "created":1598727000,
            "id":2894046,
            "title":"More"
        },
        "15351":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "The cashier returns to find only Kehlani waiting for her",
                "No one comes back and Kehlani decides to investigate",
                "Switch to Karen’s perspective ",
                "More customers come in ",
                "More"
            ],
            "content":"<div class=\"\"><div> <span>It was another 90-something degree day, the sun beating down on Kehlani as the artist tried relaxing a little on one of her rare days off. Walking around the city for a bit seemed like such a good idea, but between the heat and the social-distancing guidelines in place, it seemed more like her home was a ghost town. She’d been walking for a while now and could feel herself getting light-headed in the sun…she needed a break…and lunch. Looking down the street she was on, Kehlani could see a few things that made her mouth water, but only one actually had an open door. The place was one of those old-school pizza joints you’d find in any major city; to Kehlani’s growling stomach though, it might as well have been a gourmet institution. Continuing down the street, Kehlani turned her head away from a news van that seemed to be doing a piece on the state of the community and the closed businesses. Day’s off meant no interviews, not about her music and definitely not some local news B.S. on the state of the economy. The only thing on Kehlani’s mind was filling her stomach… at least, it was until she entered the pizza place and heard the yelling….<br>\r\n<br>\r\n“Are you a fucking moron?!” a middle-aged Karen screamed at the cashier. “This isn’t what I ordered! Get me what I fucking ordered!”<br>\r\n<br>\r\nThe cashier looked like a college freshman on her first job…and on the verge of tears as she stammered, “But ma’am!”<br>\r\n<br>\r\n“NO BUTS!” the Karen screamed, her face getting as red as the sauce for the pizza. Kehlani could feel her stomach twisting…she’d been treated like shit by women like this before…it wasn’t going to be over any time soon. For a moment she thought of just leaving to find food somewhere else when the woman reached across the counter and slapped the cashier in the face, fuming, “Get me someone who’s in charge! NOW!”<br>\r\nThe cashier swallowed a sob and turned around, running into the back to try and get someone or just to cry as Karen turned and glared at Kehlani, spitting, “Who the fuck are you staring at, bitch?!” Kehlani could feel a fire light in her stomach as any sense of hesitation she might have had completely vanished. Her lack of response only served to make the Karen angrier as the rude woman stepped closer, spitting, “You got something you want to say?!” <br>\r\n<br>\r\n“No,” Khelani said, cooly, pulling a small bottle from her pocket that looked like breath spray. She held it up to the woman’s face and gave one little spritz into her eyes.<br>\r\n<br>\r\nThe woman screamed, stumbling backwards as she hissed, “FUCK! YOU LITTLE CU-”<br>\r\n<br>\r\n\tSilence. <br>\r\n<br>\r\n\tHeaving a sigh of relief, Kehlani stepped up to the counter and waited, placing her little bottle down on the glass and just enjoying the peace and quiet…. Down between her slides, Karen was just starting to get her bearings…and realized just how badly she’d fucked up. Reduced to a fraction of an inch tall, the middle-aged woman looked at the vast expanse of dirty linoleum tile and felt sick to her stomach. Slowly, she turned to look to her left and right, seeing the warehouse-sized feet flanking her. “Y-You! H-Help! Someone call the police! Call an ambulance! Arrest this woman!” she screamed, pointing up at the living skyscraper that wasn’t even bothering to glance down in her direction. No one was there to listen to her…but all Karen knew how to do was to whine, cry, and throw a tantrum till she got her way. Today, all that had accomplished was getting her shrunken down so that she resembled the pest she’d always been. Just another bug on the floor of a building. Just another nuisance to be reduced to an unremarkable stain….<br>\r\n\t<br>\r\nKaren looked and saw Kehlani’s massive heels poking out of the end of her slides, her feet clad in tight black socks that stretched high into the sky. Swallowing nervously, some part of Karen’s brain told her that shouting wasn’t going to solve her problem as long as she stayed on the floor. If she could reach this bitch’s ear though…oh god there’d be hell to pay! The tiny woman began running toward Kehlani’s right foot, determined to get onto her slides and start scaling her socks. As far as she was concerned, it was a flawless plan. What could go wrong?...<br>\r\n</span></div></div>",
            "created":1598733900,
            "id":2894105,
            "title":"No Rest for the Wicked"
        },
        "153511":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "Kehlani goes outside to finish the job and shrink the van",
                "Kehlani decides to see if anyone in back overheard the commotion",
                "A customer came out of the bathroom and saw..",
                "A worker throws out the pizza ",
                "More "
            ],
            "content":"<div class=\"\"><div> <span>After another minute or two, Kehlani could finally hear someone coming back. The cashier from earlier pushed through the door to the back, her eyes still red from crying as she mumbled, “M-Ma’am, I’m sorry b-but…”<br>\r\n<br>\r\n“Don’t worry, honey, that bitch is gone,” Kehlani said with a small smile, the bottle still in her hand. <br>\r\n<br>\r\nThe look of sheer relief on the cashier’s face made Kehlani feel like she’d made the right choice getting rid of the bitchy woman. Things had been rough enough the last few months without entitled people making everything worse. She hoped she’d already crushed the bitch while walking up, but she wasn’t going to check…Karen was now smaller than an ant, what could she do anyway? Kehlani’s stomach growled again as she remembered why she’d come into this store in the first place. Looking down at the counter, she saw what Karen had been yelling about: two delicious looking slices of pepperoni pizza! “Can I have these?” Kehlani asked the cashier.<br>\r\n<br>\r\n“W-We could get you something fresher!” the student offered, looking grateful.<br>\r\n<br>\r\n“It looks fine to me,” Kehlani said with a small laugh and a smile. “How much?”<br>\r\n<br>\r\nThe cashier smiled, “Normally we’re doing $5 for two slices, but I think $2 works”<br>\r\n<br>\r\nKehlani giggled, “I’m about that life.” Right, she needed her wallet. Putting the spray-bottle down on the counter. As she took her hand off the bottle, the artist didn’t notice how hard she pressed down on the top…or how easily the bottle sprayed when pressed. Instead, Kehlani turned her attention to her pocket-book, not noticing yet that the front of this place had gotten eerily quiet again…or that the TV crew that had been filming earlier had also decided to take a lunch break. <br>\r\n<br>\r\nGrabbing the two bucks from her pocketbook, Kehlani turned back around only to see that there was no one there. Groaning, she shoved the money into the tip jar and whispered under her breath, “Shit…my bad…” Instead of looking for the girl she was sure had just been shrunken down though, Kehlani just grabbed the two slices of pizza. Even if the pizza was a little cold now, her stomach just needed something in it! If Kehlani had taken a moment to examine either slice, she might have noticed that the cashier was currently stranded in the middle of a warm piece of pepperoni, holding onto it like a massive life-raft in a sea of sizzling cheese. The girl was bawling her eyes out, shouting up to the woman grabbing hold of the plates. She was begging for Kehlani to just look down at her, begging her mom or manager or god for help. For a moment, she thought she got her wish as the door to the pizza place opened and Kehlani put the slices down. Her heart sank though as she saw the giantess’ colossal hand slowly moving to grab the small spray-bottle that had done this to her…the new customers were in danger….<br>\r\n<br>\r\nSpinning around on the ball of her foot (much to Karen’s horror), Kehlani saw the cameraman and reporter from earlier looking at her with wide eyes. She knew that look. It was the same look she’d seen the first time she used the spray. She’d been caught! Her eyes jumped to the camera and for a moment a little relief hit as she saw no red light flashing at her. “Nothing personal,” she said, grabbing the bottle and holding it up at the pair that had entered like she was holding a loaded weapon. “If I get busted with this shit, it’s going to be such a pain in the ass,” Kehlani said, trying to give the terrified pair some explanation before they joined the world of insects at her feet….<br>\r\n<br>\r\n\tThe reporter was only able to get a few words out before Kehlani squirted her, simply stammering, “H-Hang on, we ju-” A spray of liquid burst from the bottle, getting her and the cameraman behind her. Kehlani blinked and the pair were gone…only, this time she actually turned her head to the floor. She didn’t know if a camera would even work in that condition, but she wasn’t willing to take chances. Squatting low, the giantess slowly began surveying the tile, looking for something either on the off-white tiles or hiding in the grout. Humming, she sighed, “Come out, come out, wherever you are…make it easier on yourselves…” Karen she hadn’t minded shrinking down, but the cashier and these two were just unfortunate, Kehlani thought. It was also a waste of the spray, though this definitely wasn’t her only bottle. Just as her mind began to wander, the giantess’ eyes caught some movement at the edge of her field of vision. Her eyes locked on the fleeing little specks and a small smile spread across her face. If they were running, it meant they weren’t filming…only one thing left to do….<br>\r\n<br>\r\n\tDown on the ground, Andrew and Melinda were sprinting for their lives across one of the flat tiles, trying desperately to make for the grout trenches so they could hide! They had to get out, they had to try and make it back to the va-<br>\r\n<br>\r\n\t“THERE YOU ARE…SORRY ‘BOUT THIS,” Kehlani’s voice thundered, shaking the pair down to their bones as a dark shadow suddenly fell over them, swallowing everything in a swath of nightfall as Kehlani’s body blocked the florescent lights overhead. <br>\r\n<br>\r\n\tTHOOOM….<br>\r\n<br>\r\n\t“Just keep running!” Melinda screamed, kicking off her heels as she sprinted past Andrew. The fucking grout was still so far ahead!<br>\r\n<br>\r\n\tAndrew was panting, still carrying the camera on his shoulder like he’d always been trained. “M-Mel! She’s getting closer!”<br>\r\n<br>\r\n\tMelinda roared, “Drop the fucking camera! Run! I’m not dying like this! Not today, dammit!”<br>\r\n<br>\r\n\tThe shadows were growing darker…darker…darker… The pair could hear the wind whipping around them and heard the roar of something heavy falling out of the sky. This is what it must have been like at the scene of the Hindenburg crash! Or the fall of the Tower of Babble! Or….<br>\r\n<br>\r\n\tTHOOOOOOOOOOOOOOOOOOOOOOOOOOOOM….<br>\r\n<br>\r\n\t“There we go,” Kehlani sighed, planting her left foot on top of the fleeing specks and slowly grinding her foot back and forth. Lifting it off for a moment, she was relieves to see tiny red flecks on the tile. As she stood back up, she giggled seeing that the mess wasn’t even visible if you weren’t looking for it. That was one problem out of the way. Looking at the van waiting outside, Kehlani readjusted her grip on the spray. Just one last pest and then she could finally eat her damned pizza….<br>\r\n</span></div></div>",
            "created":1598741760,
            "id":2894176,
            "title":"Misfire..."
        },
        "154":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "You shrunk while sitting next to her on a bus ",
                "She shrunk you for annoying her ",
                "The venue shrunk ",
                "Daria is giant ",
                "More "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What’s the situation? </span></div></span></div>",
            "created":1584162000,
            "id":2801414,
            "title":"Nuki (Daria Stavorich) "
        },
        "1542":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "On her flip flop as she’s on a bus ",
                "In her water bottle ",
                "In her food ",
                "In her boot treads ",
                "More "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you at?</span></div></span></div>",
            "created":1584162000,
            "id":2801488,
            "title":"She shrunk you for annoying her "
        },
        "15421":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "Managed to hang on and continued crawling off the flip-flop...",
                "Were thrown backwards toward Nuki's flexing toes...",
                "Got pinned under her arch ",
                "Got pinned under her heel ",
                "More "
            ],
            "content":"<div class=\"\"><div> <span>“Hey,” you said, cheeks flushing red as you leaned over to Nuki for the umpteenth time this bus ride, “can…can I ask for your number?” You heard an audible sigh and felt your insides twist as Nuki’s dark eyes turned and looked you over with a heart-stopping mix of annoyance and disgust (<a rel=\"nofollow\" href=\"https://lh3.googleusercontent.com/proxy/BOJfcxXpZY4Ri3eItZtT2PZfrOdkilZ6Vmor46jJch3OzxBu4VRMbhp8evGk7LYhulm4guEL-URcg-AMpuxw8XtGrMSTdGzq1zltrHDpOYtulFY\" target=\"_blank\">https://lh3.googleusercontent.com/proxy/...</a>). “Y-You don’t have to!” you start saying, desperate to salvage some chance at getting closer to one of your all-time favorite musicians. “I can…if you’ve got an email, facebook, discord or something, we could keep talking there instead!” The others on the bus turned away, too embarrassed to keep watching this slow-motion train-wreck as the driver began slowing down for the upcoming stop. “I-I think getting your number might be e-”<br>\r\n<br>\r\n“If I kiss you,” Nuki said, her eyes glaring daggers at you, “will you shut the fuck up and let me get back to my music?”<br>\r\n<br>\r\nThe air left your lungs as your eyes locked on her dark lips and your face flushed bright red.<br>\r\n<br>\r\n“I’ll take that as a yes…freak,” Nuki said, rolling her eyes as she licked her lips and slowly began to lean in. You could hear your heart hammering in your chest and closed your eyes, slowly and awkwardly puckering your lips as you waited for her lips to meet yours. You could feel her warm breath on your face…but no kiss. Instead, she leaned in closer, her breath in your ear as she whispered, “Yeah right, loser~” You felt a pinch in your arm and thought you might throw up as your head felt like it was suddenly splitting open and every inch of your body was in unimaginable pain! Then…nothing, just cold air around you as the sound of the bus door opening and people pushing past each other boomed in your ears like it was broadcast over the loudspeakers….<br>\r\n<br>\r\n\tBefore you could figure out what was going on, something big was moving your way…and quickly! The ground shuddered. You fell to your ass. Tremors continued getting worse as you struggled to stand up. Your eyes opened to a vertigo-inducing display of massive bodies milling around like annoyed skyscrapers. Snapping your head to the side, you felt sick as Nuki’s hand reached toward you…larger than your home and not nearly as friendly-looking (<a rel=\"nofollow\" href=\"https://i.pinimg.com/736x/57/46/66/574666e9405a8b22daf603a710dd6cc8.jpg\" target=\"_blank\">https://i.pinimg.com/736x/57/46/66/57466...</a>).  You could see the pale pillars of flesh that were here fingers and acted on instinct, trying to roll out of the way. It was pointless. Nuki easily pinched your pathetic body between her digits and didn’t even bother lifting you to her face to gloat. Instead, she dragged you across the seat and leaned forward, making you think for a moment she might just let your body slam into the floor of the bus. <br>\r\n<br>\r\n\t“You wanted to be closer, right?” she whispered venomously as your eyes caught sight of her pale, right foot slowly sliding out of her flip-flop. <br>\r\n<br>\r\n\tYou began to panic as you saw the foam foundation with a clear imprint of Nuki’s bare foot waiting for you. Turning to look up at the massive head of dreadlocks, dark make-up, and pale skin, you began to babble and beg for mercy…. Nuki paused, her large, dark eyes turning to stare at you for a moment. “P-Please! I promise, if you make me big, I’ll leave you alone!” Her fingers suddenly squeezed tighter, threatening to snap your ribs like dry twigs as she wrinkled her nose.<br>\r\n<br>\r\n\t“So, you only wanna talk when I don’t want you to…but as soon as it’s not fun for you, you’re ready to leave? No way, fucker. You’re getting what you asked for,” Nuki whispered, suddenly letting go of your body and smirking as you tumbled to the abandoned, wet foam of her flip-flop below….<br>\r\n<br>\r\n\tTHUMP!<br>\r\n<br>\r\n\tYou almost passed out as your body slammed into the indent left by the ball of her foot. A few centimeters to the north or south and the blush foam would have cushioned your fall, something Nuki clearly didn’t want as she giggled overhead. Pain surged through your body as you flipped onto your back and prepared to beg one more time. No such luck. Nuki winked as she pulled on her headphones and looked out the bus window…you were officially beneath her notice. At least, her head wasn’t going to pay attention to you. Her toes were another matter. You felt the entire flip-flop shudder as Nuki’s bare toes drummed against the heel of her footwear. Each pale digit was bigger than your car…and like a deer-in-headlights, you could do nothing as they began moving toward you (<a rel=\"nofollow\" href=\"https://i1.wp.com/n1s1.starhit.ru/a3/5c/52/a35c52f65bedb564598b31ca4e062ce1/600x600_0_817083c3310b240d7ad48660898bdff3@600x600_0xc0a8399a_15328040441478011766.jpeg\" target=\"_blank\">https://i1.wp.com/n1s1.starhit.ru/a3/5c/...</a>).... Whether it was a car slamming into a deer or toes hitting a bug, small things tended to do badly when their bigger counterparts hit into them. If you didn’t get off of this flip-flop now, then you were positive that Nuki would end your life.<br>\r\n\t<br>\r\nFlipping onto your stomach, you grimaced as your senses were overwhelmed with the scent of foot-sweat that had soaked into Nuki’s massive flip-flop. It has been a hot day outside and the foam you were crawling across had been more than lightly coated in her perspiration. Your clothing quickly became heavy with it. Your mouth and nose were forced to endure the scent and taste as each tremor from her tapping toes caused your head to smack into the foam. Looking over your shoulder, your heart jumped into your throat…the pale toes were at the thong of the flip-flop and gently wiggling, pulling the foam up in jerking motions. Grabbing the spongey material, you…<br>\r\n</span></div></div>",
            "created":1584248400,
            "id":2801931,
            "title":"Why You Should Not Bug People On The Bus..."
        },
        "154212":{
            "author_id":"alinagoth",
            "author_name":"Alina",
            "choices":[
                "You come off of her toe, but slide deeper under her foot...",
                "Nuki takes notice of the \"bug\" stuck to her toes... "
            ],
            "content":"<div class=\"\"><div> <span>The front of Nuki’s slick, foam her flip-flop continued to tilt into the air as the giantess’ colossal digits As the grasping pads pulled you closer, you managed to sneak a glance up at the woman who had put you in this situation, praying that she’d say this was just a joke and let you go. Instead, you saw a massive, pale face smirk down at you without a hint of remorse as Nuki casually chewed on her thumb-nail (<a rel=\"nofollow\" href=\"https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcQjLEw-Krb_PxxPmfFyxp3bX3G0gQqDPYpLBSLJRQZi-8KYLK3B&amp;usqp=CAU\" target=\"_blank\">https://encrypted-tbn0.gstatic.com/image...</a>). You were just another piece of filth on the floor of this bus that had been lucky enough to get this close to her feet…that was what Nuki’s gaze was telling you. And before you could formulate a response, the massive toes pulled into position, swallowing you under their slick, hot, heavy pads…. <br>\r\n<br>\r\n\t“P-Please! N-No!” you screamed, one of the giant digits slamming down into the middle of your back and squeezing the air from your lungs. Just as quickly as it had smashed into you, the digit lifted, pulling you into the air with it!<br>\r\n<br>\r\n\tTHUMP!<br>\r\n<br>\r\n\t“F-Fu-”<br>\r\n<br>\r\n\tTHUMP!<br>\r\n<br>\r\n\t“Help m-”<br>\r\n<br>\r\n\tTHUMP!<br>\r\n<br>\r\nWithout even meaning to, the giant woman had just used her middle toe to knock the crap out of your tiny body. Nuki had a tune in her head that wouldn’t leave her alone; with each toe-tap she unknowingly made, Nuki birthed a new bruise on your body and pushed your ribcage closer to shattering like a painful pinata. You felt your stomach lurch as her toes rose for a fifth tap. Looking down at the imprint her digit had worn into the massive flip-flop from several uses, you couldn’t help but whimper. At least if she were mocking you, it would have meant you mattered somehow. Right now, you weren’t worth talking to or looking at. You were dirt. Stuck to her toe. Already free-falling to be suplexed against the damp foam of her flip-flop one more.<br>\r\n<br>\r\nTHUMP….<br>\r\n</span></div></div>",
            "created":1588816680,
            "id":2831498,
            "title":"Nuki's Domineering Digits"
        },
        "155":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Simone Simons (Vocalist of Epica)",
                "Floor Jansen (Vocalist of Nightwish)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about someone from these symphonic metal bands?</span></div></span></div>",
            "created":1578978000,
            "id":2773918,
            "title":"Something Symphonic"
        },
        "1553":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Brittany Slayes (Singer of Unleash the Archers)",
                "Noora Louhimo (Singer of Battle Beast)",
                "Other",
                "Tatiana Shmaylyuk  (Singer of Jinjer) ",
                "Hayley Williams "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about a power metal singer?</span></div></span></div>",
            "created":1578978000,
            "id":2773920,
            "title":"Something Powerful"
        },
        "15531":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "You are shrunk backstage with her!",
                "You are shrunk while she is onstage!",
                "She grows into a giantess at a concert!",
                "Shrunk at a random encounter ",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Prepare to be tiny around the Canadian metal goddess!  What happened?<br>\r\n<br>\r\nReference:  <a rel=\"nofollow\" href=\"https://studiosol-a.akamaihd.net/uploadfile/letras/fotos/7/0/5/7/7057eb3a6fdb0a4f8e2c3ca3eefadf9f.jpg\" target=\"_blank\">https://studiosol-a.akamaihd.net/uploadf...</a> </span></div></span></div>",
            "created":1584162000,
            "id":2801420,
            "title":"Brittany Slayes"
        },
        "155315":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "Taped to her sandal ",
                "In her boot treads ",
                "In a plane she shrunk ",
                "Sneaking in her car ",
                "More "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where else are you? </span></div></span></div>",
            "created":1597339500,
            "id":2885100,
            "title":"More  Britaney Slayes "
        },
        "15533":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Sharon Den Adel (singer of Within Temptation)",
                "Anneke Van Giersbergen (singer of The Gathering)",
                "Someplace else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lots of great metal singers from the Netherlands.  How about these?</span></div></span></div>",
            "created":1579150800,
            "id":2774532,
            "title":"Someone Dutch"
        },
        "155333":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Christina Scabbia (singer of Lacuna Coil)",
                "Allessia Scolletti (singer of Temperance) ",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some hot singers from Italy.  How about these?</span></div></span></div>",
            "created":1579150800,
            "id":2774534,
            "title":"Someone Italian"
        },
        "1553333":{
            "author_id":"patnewworld",
            "author_name":"ReducedExpectations",
            "choices":[
                "Nita Strauss",
                "Orianthi",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Looking for someone besides a singer?  How about...</span></div></span></div>",
            "created":1582261200,
            "id":2790830,
            "title":"How about a guitarist?"
        },
        "15533333":{
            "author_id":"jjuenger",
            "author_name":"jjuenger",
            "choices":[
                "Lzzy Hale",
                "Taylor Momsen",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I'm going to present two choices that I'm surprised no one else has yet thought of: Lzzy Hale of Halestorm, or Taylor Momsen of The Pretty Reckless.</span></div></span></div>",
            "created":1594503840,
            "id":2866370,
            "title":"Two Others"
        },
        "15534":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "Climbing her sneaker ",
                "Taped to her sandal ",
                "In her food ",
                "She’s giant at a venue! ",
                "More "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you? </span></div></span></div>",
            "created":1598286960,
            "id":2890679,
            "title":"Tatiana Shmaylyuk  (Singer of Jinjer) "
        },
        "15535":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "She shrunk you for messing up her order (her assistant) ",
                "Stuck to her welcome mat ",
                "In her food she ordered online ",
                "Hayley is gigantic ",
                "More "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you? </span></div></span></div>",
            "created":1599270600,
            "id":2897714,
            "title":"Hayley Williams "
        },
        "155351":{
            "author_id":"bloodrayne",
            "author_name":"Blood",
            "choices":[
                "In her chewing gum ",
                "In your car she shrank as a souvenir ",
                "In her vans slip ons ",
                "In her hand as she starts a meeting ",
                "Others "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where are you currently? </span></div></span></div>",
            "created":1605139200,
            "id":2938629,
            "title":"She shrunk you for messing up her order (her as..."
        }
    },
    "info":{
        "author_id":"bloodrayne",
        "author_name":"Blood",
        "brief_description":"Get shrunk near the hottest females in music ",
        "created":1578775260,
        "description":"<td align=\"left\" class=\"norm\">Get shrunk by or find giant heavy metal female singers.  Anything goes!  Pics will be added. Points will be given for good adds. </td>",
        "id":2210041,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1605139200,
        "modified":1605139200,
        "pretty_title":"Heavy Metal Goddesses "
    }
}