{
    "chapters":{
        "1":{
            "author_id":"pinoyknight8",
            "author_name":"TheSoullessOne",
            "choices":[
                "Goku",
                "Vegeta",
                "Trunks",
                "Gohan",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will be swapped?</span></div></span></div>",
            "created":1267160400,
            "id":842956,
            "title":"The swappers"
        },
        "11":{
            "choices":[
                "Ginyu",
                "Bulma",
                "Burter"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will Goku swap with?</span></div></span></div>",
            "created":1272603600,
            "id":875881,
            "title":"Goku"
        },
        "111":{
            "choices":[
                "Goku clutches his chest and writhers in pain",
                "Goku flies after Ginyu slowly",
                "Gohan comes passing by and decide whether Ginyu's power works witth you or not.."
            ],
            "content":"<div class=\"\"><div> <span>Goku was walking along the countryside one day, when Ginyu swooped down \"I'm sick of this body again! I want yours, it was so good looking and strong!\" <br>\r\n<br>\r\nWithout warning Ginyu stripped off all of his clothes and blasted them, he punched a hole in the two sides of his chest and yelled \"CHANGE!!!\", a bright beam sped out of Ginyu's mouth and shot into Goku's, and when the dust settled, they had switched bodies.<br>\r\n<br>\r\n\"Wha...What!?\" Goku looked at new purple hands and black fingernails. \"This can't be happening, this body is so ugly! I look like an emo, even my toenails are black!!<br>\r\n<br>\r\nWithout any words, Ginyu shot off in his new body.</span></div></div>",
            "created":1272603600,
            "id":875887,
            "title":"Ginyu"
        },
        "1111":{
            "choices":[
                "Bulma passes by, stops to help you and try and swap with her, if the power works",
                "You examine your body some more...",
                "You collapse and blackout due to the unbearable pain"
            ],
            "content":"<div class=\"\"><div> <span>Goku feels even more painful than he did last time he was in Ginyu's body, this time there was two holes in his chest. He felt the blood rush out of the two places where his nipples should have been but were now replaced by holes with outpouring blood. Goku managed to examine his new body, and found that Ginyu naked wasn't something which could attract Chi Chi, and could even scare Gohan, even though he was all grown up.<br>\r\n<br>\r\nGinyu had obviously stripped and destroyed his clothes so that it would be harder for Goku to catch up to him, if he ever does at all...One thing Goku hated about Ginyu was that this body was huge and bulky, moving felt like having two tonnes on concrete on his back, Ginyu must have really been juicing. <br>\r\n<br>\r\nThere was also no hair anywhere at all on this body, Goku felt his head, looked at his armpits and legs and everywhere else, and there was not an inch of hair anywhere at all on his body. His fingernails and toenails were black, like emo-style, but these were natural. Veins were excessive all over his head. And Ginyu's feet were huge, and his muscles bulged like there was no tomorrow. His horns were long and black. <br>\r\n<br>\r\nAnd last but not least, his dick. It was long, about 7/8 inches (when not erect) and Goku decided that he might like this body after all, even though it does have two holes and its naked and may not attrack the ladies, although, the dick might...</span></div></div>",
            "created":1272690000,
            "id":876349,
            "title":"Exmination time..."
        },
        "11111":{
            "author_id":"shenron31",
            "author_name":"Shenron31",
            "choices":[
                "Goku “ Bulma “ races to Gohan and Krillin",
                "Goku “ Bulma “ tests his new ‘assests’"
            ],
            "content":"<div class=\"\"><div> <span>When Bulma passes by on her capsule bike, Goku decides to change with her in order to get to Krillin and Gohan and tell them about Ginyu. <br>\r\n<br>\r\nHe does the body swap on Bulma and it works, “ Sorry Bulma, I’ll wish you back after this is all over.”</span></div></div>",
            "created":1593205140,
            "id":2857223,
            "title":"Bulma passes by, stops to help you and try and ..."
        },
        "1112":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Freiza's minions (basically some idiot revied him *King Cold* cough.)",
                "Some of Goku's friends",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Goku slowly flew after Ginyu.<br>\r\n<br>\r\n\"Dang it if only my body wasn't so bulky...\"he thought<br>\r\n<br>\r\n\"Hey Ginyu!\" somene said. Goku turned around to see__________.</span></div></span></div>",
            "created":1305003600,
            "id":1103910,
            "title":"Goku flies after Ginyu slowly"
        },
        "11121":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Heal up, and go to your *Ginyu's* room",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Captin that sayin did a huge one on you dind't he.\" the minion said. \"listen we'll patch you up real good okay.\"<br>\r\n<br>\r\nBefore goku could protest he was flying with the minion carring him. \"Well this is a bind....What do I do?\" he thought to himeself as they arrived on the space ship.</span></div></div>",
            "created":1305003600,
            "id":1103915,
            "title":"Freiza's minions (basically some idiot revi..."
        },
        "111211":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Examine 'your' body more",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>\" Doctor! Doctor Ginyu's been hurt!\" the minion screamed.<br>\r\n<br>\r\nthe doctor came rushing to them and rushed them to the healing chamber.<br>\r\n<br>\r\n\"Your lucky that Friza is out looking for the dragon balls Ginyu otherwise you would be dead.\"the doctor sneered at him.<br>\r\n<br>\r\n\"this is bad.\"Goku thought. \"If Freiza finds the dragon balls the world will be in danger.\"<br>\r\n<br>\r\nAfter 20 minutes of Healing the doctor realesed him.<br>\r\n<br>\r\n\"Okay your all healed up Captin.\" he said. \"and for pete sake go to your room and cover your self!\"<br>\r\n<br>\r\nGoku reluctantly obeyed because he knew running around nude wouldn't help. He walked down the hall recieving cat calls from the crew. Finally he found Ginyu's room, and to his surprise the room had training equipment scttered across the room. Now that he thought about it he didn't really know Ginyu that much. Goku walked over to closet and found sayin armour, and the sayin cheast plate that had the Ginyu emblem on it.<br>\r\n<br>\r\n\"Do I really have to put this on?\" He muttered to himself. He slipped into the sayin armour witch literally snapped against the skin making it skin tight, and slipped on the cheast plate. he looked to find a full lenth mirror where the bed was.<br>\r\n<br>\r\n\"He must like to dee his beatiful face every morning.\" Goku though sarcastically. When he looked in his new 'refelction' he found Ginyu standing there in full glory even with that sadistic smirk.</span></div></div>",
            "created":1305003600,
            "id":1103928,
            "title":"Heal up, and go to your *Ginyu's* room"
        },
        "1112112":{
            "author_id":"lmdw2",
            "author_name":"LMDW ",
            "choices":[
                "Text your new body and find what happened",
                "Go to save your friends "
            ],
            "content":"<div class=\"\"><div> <span>Just then as he was watching Ginyu in his glory. Goku could hear on the coms: “ Lord Frieza has come back all units must go to see him”. This might be my chance if I can get to frieza and do to him what Ginyu did to me then the universe is safe. Goku thought to himself. Come on body don’t fail me now. Goku went to see frieza but didn’t find him alone as he was with all of his guards including the ressurrected zarbon and dodoria. Damnit with this guys I won’t be able to switch’ I need to wait for a better opportunity to present itself. Goku could hear as frieza was giving his speech of killing those annoying monkeys and how he will become inmortal and kill them all. Geez this guy has some anger issues. But he seems tired perhaps I can use this to my advantage. He waited until it was night to go into friezas comparment sneakily to perform the change. His body was giving up as Ginyu injured himself heavily to kill him. Come on just a few more steps’<br>\r\nAs Goku arrived friezas chamber he saw his sleeping looking up to the sky in his final form. Thanks for that frieza it might have been annoying trying to transform and all’. Goku then thought of everyone who was depending on him on making it. If I don’t do this everyone dies, Gohan, Chichi, Krillin, Bulma and Vegeta. Come on Goku you can do this’. He thought as he said. “CHANGE NOW”. He said as frieza was beggining to open his eyes. Oh no not now. He thought as frieza was awoken and wanted answers. “ Ginyu explain yourself this inst” But he was caught off sentence as the beam reached his mouth as his soul was separated from his body as was Gokus. “ You blasted monkey I should have know it was you. What so primitive you decided to steal my perfect body. It would be futile as not even Ginyu could do it” Frieza said as he was fighting back the body swap. No Frieza I won’t lose this everyone is counting on me”. Goku said as he launched himself towards frieza to fight. Blast where lanched attacks were countered but no one outside of them could hear it. After some minutes both were rough up. This is over Goku you cannot win when I get back in my body you will be extermiented”. That’s where your wrong frieza cause we always find a way KAMEHAMEHA” Goku instant transmisión in the back of frieza sending him flying into Ginyus body’s. Now to get into his fast before he wakes up’ Gokus spirit flew into friezas body instantly and merged with it. Now I can definetly feel the changes already he said as he took control of friezas body. “ You disgusting monkey who do you Think you are to do this to me”. I already told you frieza I’m Son Goku and now your reign of terror is over”. He said this as he blasted frieza into obscurity. He then walked into a mirror to watch himself. Well no this is definatmy different. No bulging muscles no clothes I think but the power level is definitely higher than ginyus. Now what to do now?</span></div></div>",
            "created":1568534040,
            "id":2718429,
            "title":"other"
        },
        "11122":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Vegeta",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who found him?????<br>\r\n<br>\r\nVegeta, or other</span></div></span></div>",
            "created":1305003600,
            "id":1103913,
            "title":"Some of Goku's friends"
        },
        "111221":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Get even!!!",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>\"So you came back freak.\" Vegeta said smirking<br>\r\n<br>\r\n\"Wait Vegeta its me Goku!\" He screamed before vegeta could do anything.<br>\r\n<br>\r\nVegeta just stared at goku for a long time before bursting out laughing.<br>\r\n<br>\r\n\"Its not funny you prick!\" Goku Shouted<br>\r\n<br>\r\n\"this will be a perfect chance to get even with Kakorot.\" Vegeta thought. \"or I could use that body to get even eith those monsters.\" (A/N Goten, and Trunks)</span></div></div>",
            "created":1305003600,
            "id":1103933,
            "title":"Vegeta"
        },
        "112":{
            "author_id":"lazarus495",
            "author_name":"Lazarus ",
            "choices":[
                "Tell Vageta ",
                "Keep it a secret"
            ],
            "content":"<div class=\"\"><div> <span>Goku wakes in a unfermiler room a bit of blue bangs dangle in front of his eyes he walks to a mirror and sees his old friend Bulma <br>\r\n<br>\r\n\"What happened im  in bullma body Chi-Chi is not gonna be happy with this\"<br>\r\n<br>\r\nVageta walks into the room <br>\r\n<br>\r\n\"Bulma im done training make me my meal woman\"<br>\r\n<br>\r\nWhat should Goku do</span></div></div>",
            "created":1517555340,
            "id":2448223,
            "title":"Bulma"
        },
        "113":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Burter",
                "Vegeta",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Really? Well here's more options in case you don't want burter.</span></div></span></div>",
            "created":1294290000,
            "id":1030356,
            "title":"Burter"
        },
        "1131":{
            "choices":[
                "The beam hits Goku",
                "The beam hits Jeice as Goku escapes his grasp"
            ],
            "content":"<div class=\"\"><div> <span>Goku, Burter and Jeice were all having their match on Namek when suddenly, Burter gave Jeice his scouter: “Well... this guy’s fast, even faster than me!” Jeice responded: “Oh I see what you’re doin’! You wanna use the Captain’s technique, got it!” Jeice soon started attacking Goku and eventually got a good grip on him: “Doit now Burter!” Burter smirked and nodded: “Thanks bro” he began reaching out both of his hands and holding them steady and then opening his mouth: “CHANGE NOW!!!” The purple beam of light was coming in the direction of Goku and Jeice... what’s going to happen!?</span></div></div>",
            "created":1569761100,
            "id":2725176,
            "title":"Burter"
        },
        "1132":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Goku swapped with Scoter Vegeta (Sayin Saga)",
                "He was on Namek (Ginyu/ Freza saga)",
                "more"
            ],
            "content":"<div class=\"\"><div> <span>Trunks looked at the stars with promise. He wished his father was Goku but that would never happen. he stood thereoutside his window, and  said \"Starlight star bright i wish my dad was goku.\" He continued to stare untill finally he went to sleep.<br>\r\n<br>\r\nLater Goku was going to bed in Chi Chi's house when  he felt a gush of wind hit his face. He closed his eyes for a bit but when he opened his eyes he was......</span></div></div>",
            "created":1294290000,
            "id":1030363,
            "title":"Vegeta"
        },
        "11323":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Android saga",
                "MORE"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well......</span></div></span></div>",
            "created":1294290000,
            "id":1030364,
            "title":"more"
        },
        "113232":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Buu Saga",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Picky.....</span></div></span></div>",
            "created":1294290000,
            "id":1030365,
            "title":"MORE"
        },
        "1132322":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "GT saga (Baby Vegeta, Super android 17, Dark Dragon Ball saga)",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>WHATTTTTT!!!!!!</span></div></span></div>",
            "created":1294290000,
            "id":1030367,
            "title":"other"
        },
        "11323222":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Gravity Room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>................      ..................<br>\r\n<br>\r\n.....................................</span></div></span></div>",
            "created":1294290000,
            "id":1030371,
            "title":"other"
        },
        "113232221":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Himself  (Life swap)",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>He was in the Gravity room! Goku looked around dazed <br>\r\n<br>\r\n\"what the heck\" but soon after he said that he covered his mouth. That was Vegeta's voice. He Notced he was wearing Vegeta's Gloves as well. his eyes hestintly looked down ,and saw that he was in a blue spandex suit that Vegeta normally wear! <br>\r\n<br>\r\nHe rushed to the bathroom to see.....</span></div></div>",
            "created":1294290000,
            "id":1030379,
            "title":"Gravity Room"
        },
        "1132322212":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Vegeta",
                "other. just kiding its the same as option 1 only a diffrent story"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>he saw.....</span></div></span></div>",
            "created":1294290000,
            "id":1030383,
            "title":"other"
        },
        "1133":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Jeice (space australlin dude)",
                "Turles (evil goku)",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's some!!</span></div></span></div>",
            "created":1294290000,
            "id":1030384,
            "title":"other"
        },
        "11333":{
            "author_id":"true.switcher",
            "author_name":"KingHearts",
            "choices":[
                "Raditz(The brotherly change)  ",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The brothers have a transformation</span></div></span></div>",
            "created":1294290000,
            "id":1030387,
            "title":"other"
        },
        "113332":{
            "author_id":"kidstir123",
            "author_name":"Pen",
            "choices":[
                "Broly",
                "Frieeza"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about some of these characters?</span></div></span></div>",
            "created":1496379600,
            "id":2329899,
            "title":"other"
        },
        "1133322":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "Yes, this is my choice",
                "No, choose someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this really your choice, or do you want Goku to swap bodies with someone else?</span></div></span></div>",
            "created":1508734800,
            "id":2405345,
            "title":"Hang on!"
        },
        "11333222":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "Go for it, although it's not quite what they mean by 'a second childhood'...",
                "No, it's some other character that Goku will swap bodies with"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else could Goku swap bodies with? Maybe Goku somehow ends up swapping bodies with his own youngest son, the 6-year old Goten, giving both father and son a unique insight into each other's lives?</span></div></span></div>",
            "created":1508734800,
            "id":2405386,
            "title":"From father to youngest son and vice versa?"
        },
        "113332221":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "A malfunctioning new invention from Capsule Corp",
                "A wish upon the Dragon Balls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Goku and Goten end up swapping bodies?</span></div></span></div>",
            "created":1508734800,
            "id":2405389,
            "title":"How does it happen?"
        },
        "1133322212":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "Go with this scenario",
                "Go with a different scenario"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Why would Goku and Goten use the Dragon Balls to swap bodies with each other? Maybe Goku wanted to be a kid again, while Goten was impatient waiting to be a grown-up?</span></div></span></div>",
            "created":1508734800,
            "id":2405390,
            "title":"Why would they wish swap bodies?"
        },
        "11333222122":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "Go with this scenario",
                "Go with a different scenario"
            ],
            "content":"<div class=\"\"><div> <span>What other reason could Goku and Goten have to use the Dragon Balls to swap bodies with each other? Perhaps Goten and Goku had an argument over whose life was toughest, (Goten's with all his schoolwork, or Goku's with fighting monsters/ aliens, ect.), causing them to use the Dragon Balls to swap bodies, so they could find out the answer?</span></div></div>",
            "created":1508734800,
            "id":2405392,
            "title":"An argument?"
        },
        "113332221222":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "Go with this scenario",
                "Go with a different scenario"
            ],
            "content":"<div class=\"\"><div> <span>Why else could Goku and Goten want to use the Dragon Balls to swap bodies with each other?<br>\r\nMaybe this is why: Goten wants to participate in one of the Martial Arts Tournaments, but finds out that he is too young to participate; so to help him out, Goku decides to use the Dragon Balls to swap their bodies temporarily, allowing Goten to battle in the tournament in his father's body, while Goku-in-Goten cheers for him from the spectators seats.<br>\r\n<br>\r\nHowever, Goten-in-Goku is not exactly used to being in his father's older, stronger and bigger body, (how can he; he's only 6 years old), so Goku has to first teach Goten how to fight like him and how to control his new strength; a task easier said than done, since Goten keeps falling over in his father's body, because he is not used to the new hight-and-depth perceptions that his father's body gives him.<br>\r\nAlso, because of his father's body's much larger size and longer limbs, Goten keeps tripping and getting dizzy, so he first has to get used to his father's body, before any combat training begins.</span></div></div>",
            "created":1508734800,
            "id":2405419,
            "title":"A tournament, but Goten is too young for it?"
        },
        "113332222":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "Now, that sounds like it could get interesting. Go for it!",
                "No! Go with some other choice!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps Goku ends up swapping bodies with the 7-year old Trunks, the son of his greatest rival, Vegeta, which could end up being very awkward for both Goku and Trunks?</span></div></span></div>",
            "created":1510462800,
            "id":2414372,
            "title":"A son to his rival?"
        },
        "1133322221":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "A wish using the Dragonballs",
                "A malfuctioning new invention from Capsule Corp"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Goku and Trunks end up swapping bodies?</span></div></span></div>",
            "created":1516078800,
            "id":2441616,
            "title":"Now, that sounds like it could get interesting...."
        },
        "11333222211":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "Go with this scenario",
                "Go with a different scenario"
            ],
            "content":"<div class=\"\"><div> <span>Why would Goku and Trunks want to use the Dragon Balls to swap bodies with each other? Maybe Trunks wants to show Goku the (slightly) more caring side of his father, vegita; so he persuades Goku to use the Dragon Balls to swap their bodies for a few days, without any of their friends knowing about it?</span></div></div>",
            "created":1516078800,
            "id":2441619,
            "title":"A wish using the Dragonballs"
        },
        "1133322222":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "Yes! Goku swaps bodies with an animal!",
                "No! Goku swaps bodies with a Dragon Ball character!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe, instead of swaping bodies with a Dragon Ball character, Goku will instead swap bodies with an animal?</span></div></span></div>",
            "created":1517239560,
            "id":2446408,
            "title":"Goku, the.... animal?"
        },
        "11333222221":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "A domesticated animal",
                "A wild/zoo animal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of animal will Goku swap bodies with; a domesticated animal (like cats, dogs, horses, ect), or a wild/zoo animal?</span></div></span></div>",
            "created":1517239680,
            "id":2446409,
            "title":"Yes! Goku swaps bodies with an animal!"
        },
        "11333222222":{
            "author_id":"kidstir123",
            "author_name":"Pen",
            "choices":[
                "Launch",
                "Android 18",
                "Videl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Other dragon ball character?</span></div></span></div>",
            "created":1574225760,
            "id":2749033,
            "title":"No! Goku swaps bodies with a Dragon Ball charac..."
        },
        "12":{
            "author_id":"supermeta64",
            "author_name":"supermeta64",
            "choices":[
                "Choatzu",
                "Goten",
                "Goku",
                "Trunks",
                "Piccolo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will Vegeta swap with?</span></div></span></div>",
            "created":1289970000,
            "id":995561,
            "title":"Vegeta"
        },
        "121":{
            "author_id":"supermeta64",
            "author_name":"supermeta64",
            "choices":[
                "The fight!!!",
                "Change Back"
            ],
            "content":"<div class=\"\"><div> <span>You see Vegeta training to become a Super Saiyan five when Choatzu is watching wishing he would be as strong as Vegeta. So Choatzu goes to someone named Jagoon who is Dende's kid and Jagoon tells Choatzu that he can grant wishes but if he grants more than five he will die. So Choatzu asks to be as strong as Vegeta. So Jagoon grants the wish, but it goes wrong. So when Vegeta wakes up he says \"Huh where am I\". So he gets up and looks in the mirror then screams in a wierd squelish voice. So Vegeta goes to Capsule Corperation and finds Choatzu felling how strong his muscles are. So Vegeta says give me back my body so Choatzu says in Vegeta's voice \"what are you talking about Choatzu get out\". Vegeta says \"what do you mean that is my body give it back\". Then Choatzu says \"How about we fight for it\".</span></div></div>",
            "created":1289970000,
            "id":995571,
            "title":"The Change!!!"
        },
        "122":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "Kid Goten",
                "Teen Goten",
                "Adult Goten"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, so Vegeta is going to swap bodies with his biggest rival's son, Goten, but which Goten is it?</span></div></span></div>",
            "created":1510462800,
            "id":2414345,
            "title":"Goten"
        },
        "1221":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "A wish using the Dragonballs",
                "A malfuctioning new invention from Capsule Corp",
                "Some other way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, so how exactly does the adult Vegeta and the 6-year old Goten swap bodies with each other?</span></div></span></div>",
            "created":1510462800,
            "id":2414350,
            "title":"Kid Goten"
        },
        "124":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "Kid Trunks",
                "Teen Trunks",
                "Future Trunks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, so Vegeta is going to swap bodies with his own son, Trunks, but which Trunks are we talking about?</span></div></span></div>",
            "created":1510462800,
            "id":2414341,
            "title":"Trunks"
        },
        "1241":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "A wish using the Dragonballs",
                "A malfuctioning new invention from Capsule Corp",
                "Some other way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, so how exactly does the adult Vegeta and the 7-year old Trunks swap bodies with each other?</span></div></span></div>",
            "created":1517202000,
            "id":2446404,
            "title":"Kid Trunks"
        },
        "125":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "Piccolo",
                "Gohan",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are more characters that Vegita can swap bodies with, you know! So, let's try this again; who else could he swap bodies with?</span></div></span></div>",
            "created":1510462800,
            "id":2414246,
            "title":"Hey, wait a minute!!!"
        },
        "13":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "His best friend, Goten",
                "His own father, Vegeta",
                "His best friend Goten's father, Goku",
                "His best friend Goten's big brother, Gohan",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, so kid Trunks is the one who will swap bodies with someone, but who is it he will swap with?</span></div></span></div>",
            "created":1504414800,
            "id":2379276,
            "title":"Kid Trunks"
        },
        "135":{
            "author_id":"greenlanter",
            "author_name":"green writer",
            "choices":[
                "chichi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>chichi could be a possibility </span></div></span></div>",
            "created":1508648400,
            "id":2404799,
            "title":"More options"
        },
        "1351":{
            "author_id":"greenlanter",
            "author_name":"green writer",
            "choices":[
                "eatting breakfast nothing intresting happness",
                "chichi makes a fuss"
            ],
            "content":"<div class=\"\"><div> <span>trunks was thinking about chichi when he thought about who to swap using his new technique he had learned this attack from when krillin and goku were drunk talking about a purple guy who became a frog trunks didn't bother with the legalistic of their claim all he new was he that he wanted to prank the shit out of goten and being his mom would do it so the next morning trunks went to goku and chichi's she was easy to find she was out doing laundry he breast looked huge her ass was swollen her lips her covered in bright red lipstick trunks went behind her and quietly said \"change now \" as her said that a yellow light came out of his mouth and went into chichi's ass trunk had passed out as it happened when he opened his eyes he looked down to see he was in chichi's body trunks looked at his body which was passed out he then said to himself \"huh where did chichi go \" only to hear chichi's voice in his head  \" TRUNKS WHAT HAVE YOU DONE WHEN THIS IS FIXED I'M CALLING YOUR MOTHER \" trunks looked down to see his or chichi ass moving with everything he could hear her say trunks face went into chichi's usually shocked face (incase you don't know what it looks like<a rel=\"nofollow\" href=\"https://vignette3.wikia.nocookie.net/dragonball/images/4/47/Chi_Chi_Surprised_Sig.JPG/revision/latest?cb=20120107034129\" target=\"_blank\">https://vignette3.wikia.nocookie.net/dra...</a>) \"what's wrong why do you have that look on my face \" said chichi   \"um chichi you've become your ass \" said trunks trying to hide his shock chichi screamed \" WHAT!\" just then goku came out looked at trunks and gave his or now her ass a smack chichi jiggled violently \" oh god no I think I'm gonna be sick \" she screamed with genuine fear in her internal voice goku the gave a sniff \" woo breakfast is done come on chichi lets eat \" trunks just said \"I'll be in in a sec\" chichi then said \" there is no way in hell you are sitting on me to eat in my stolen body \"  trunks the said \" well not all stolen you still have your ass \" trunks then started to walk while chichi screamed \"no stop I said STOP\" trunks just said \" shut up if anyone heard us we're screwed \" </span></div></div>",
            "created":1508648400,
            "id":2404958,
            "title":"chichi"
        },
        "13511":{
            "author_id":"greenlanter",
            "author_name":"green writer",
            "choices":[
                "was goku naked wanting anal ",
                "was goku stripping for her "
            ],
            "content":"<div class=\"\"><div> <span>trunks walk in still not used to her new centre of gravity goku walked up to her and kissed her straight  on the lips chichi voice screamed at trunks \" don't you dare pull away I will not have you ruin my marriage oh goku I spent all day making myself look attractive for you then this brat steals my body and leave me as my ass \" goku then reached his hand to trunks ass or chichi and did a quick and hard slap chichi shook violently trunks said \" um goku dear do you not think we should ya know um eat \" goku pulls her into a deep hug \"great idea chichi\" he says like a child as he sat down trunks slowly walked to anther seat and just as she pulled out the chair she could here chichi say \" don't you dare do it trunks if you sit on me-\" before she could finish moaning trunks sat down chichi tried to say too say \" trunks vegeta briefs how dare you sit on me I will punish you so bad when this is undone \" but all it came out as was mumbles as they ate trunks saw something terrifying her body got up and started to fly home before trunks could question what had just happened goku said \" hey chichi look over here \" what trunks saw next was horrifying goku was     </span></div></div>",
            "created":1508734800,
            "id":2405333,
            "title":"eatting breakfast nothing intresting happness"
        },
        "135111":{
            "author_id":"greenlanter",
            "author_name":"green writer",
            "choices":[
                "does she have a shower ",
                "does goku stop he from having a shower "
            ],
            "content":"<div class=\"\"><div> <span>trunks looked at the naked saiyan in front of her with a complete look of terror and fear goku then powered up to super saiyan 1 goku then said \" chichi you know want this delinquent to ram in you back door \"chichi then said \" oh goku you remember what I wanted to do wait he gonna fuck our ass which is me trunks you have to run\" trunks said in her head \"chichi I cant he too fast he will literally catch me in a second \"   trunks then  saw goku raise two fingers too his forehead and goku teleported away he then reappeared behind her his dick fully erect chichi screamed in trunks head \" trunks - trunks please p- please don't let him do this\" as she stopped goku then pushed trunks over the table then he  grabbed trunks or chichi's dress (incase you don't know what it looks like  <a rel=\"nofollow\" href=\"https://vignette.wikia.nocookie.net/dragonball/images/5/5c/ChiChiEp109.png/revision/latest/scale-to-width-down/150?cb=20110901221756\" target=\"_blank\">https://vignette.wikia.nocookie.net/drag...</a>) and ripped it off of her body showing she was in some black lingerie (ok think this put with chichi's head on it  <a rel=\"nofollow\" href=\"https://i.pinimg.com/originals/a6/e4/1e/a6e41ef7bca3bdf3db7bb17703125d63.jpg\" target=\"_blank\">https://i.pinimg.com/originals/a6/e4/1e/...</a>) he then pulled down her black panties and rammed his dick right in her asshole trunks and chichi both moaned chichi then said albeit a bit muffled \"trunks listen to me you have to hold on goku will be reach his climax in 10 minutes\" trunks then said in her head \" what 10 minutes of being anal impaled\" chichi then said \" hey how do you think I feel he is fucking you over the table through me\" goku's hand went down to her pussy he then inserted his fingers into her pussy he then started playing with her clit and with his other hand he played and squeezed her tit after 3 minutes of this goku pulled out a chair and sat down he as he sat trunks was pulled down on his lap trunks could then feel goku's dick in her stomach chichi tried again to offer trunks advice of what to do but she could speak only mumble seven minutes latter goku came in side of her trunks was moaning as goku pulled out of her chichi  then said \" trunks are you ok \"  but before she could answer goku had grabbed her  and forced it down making her give him a blow job four minutes latter goku let her head up so she could breathe trunks left the room immediately running to the bathroom so she could wash up as she did she could taste goku cum in her mouth and feel it leaking out of her and chichi' s shared asshole trunks looked in the at the hot and flushed chichi and turn on the tap to get the taste of cum out of her mouth she looked at the shower    </span></div></div>",
            "created":1508821200,
            "id":2405817,
            "title":"was goku naked wanting anal "
        },
        "13512":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "I want to continue this storyline",
                "I want to choose a different character"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are other characters than Chichi that Kid Trunks could swap bodies with; so, do you want to continue this storyline, or do you want a different character for Kid Trunks to swap bodies with?</span></div></span></div>",
            "created":1508734800,
            "id":2405367,
            "title":"Wait a minute!!!!"
        },
        "135122":{
            "author_id":"mrmasterplan",
            "author_name":"MrMasterplan",
            "choices":[
                "Well, this could be an interesting experience for both Kid and Future Trunks...",
                "No way! That's just too crazy! Next choice!"
            ],
            "content":"<div class=\"\"><div> <span>Here's an interesting choice; maybe Kid Trunks will somehow end up swapping bodies with his own future self, Future Trunks, transporting Kid Trunks' mind into the future, into his older self's grown-up body and transporting Future Trunks' mind into the past, into his younger self's 7-year old body?</span></div></div>",
            "created":1508734800,
            "id":2405375,
            "title":"I want to choose a different character"
        },
        "1351222":{
            "author_id":"thenameishere",
            "author_name":"IHaveAname",
            "choices":[
                "Yes",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Could he swap bodies with Bulma?</span></div></span></div>",
            "created":1544849460,
            "id":2589274,
            "title":"Bulma?"
        },
        "14":{
            "author_id":"pinoyknight8",
            "author_name":"TheSoullessOne",
            "choices":[
                "Videl",
                "ChiChi",
                "Goku",
                "Bulma",
                "Bulla"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>...with who?</span></div></span></div>",
            "created":1267246800,
            "id":843152,
            "title":"Gohan"
        },
        "141":{
            "author_id":"pinoyknight8",
            "author_name":"TheSoullessOne",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Crime continued in the world.\"This looks like a job for Great Saiyaman 1!\" Gohan shouted as he felt a dark Ki aura in Kami's lookout. \"Ugh do we really have to Gohan? I mean it's 1 in the morning. I don't like the costumes too. There just silly.\" Videl whimpered. \"You don't have to come but ill signal you if I need help and why did you become great Saiyaman 2 if you didn't want too?\" Gohan said. \"I did it for you Gohan! I do a lot for you! You want to know why I cut my hair so short?! I did it because you told me you didn't like it long! And I'm not coming with you! I don't care if janemba or hirudegarn, or Cell, or Frieza, or the saiyans come here as apes to kill us all! I wouldn't even care if Buu comes back to turn everyone into chocolate again and eat them!\" Videl Shouted. \"Hey I never asked you to become great Saiyaman 2 or cut your hair!\" Gohan yelled. Videl calmed down. \" I'm sorry Gohan. I didn't mean to yell at you. It's just that I don't want to fight villains right now. But even though I don't want to I'm still coming to make sure you're safe. Plus I can contact the police.\"Ok let's Go!\" Gohan says.</span></div></div>",
            "created":1267246800,
            "id":843166,
            "title":"Videl"
        },
        "1411":{
            "author_id":"pinoyknight8",
            "author_name":"TheSoullessOne",
            "choices":[
                "continue(The swap)"
            ],
            "content":"<div class=\"\"><div> <span>Gohan and Videl with the police came to Kami's lookout. Broly had returned. Goten secretly followed Gohan. Broly noticed Goten and thought he was Goku. \"KAKAROT! I... WILL... DESTROY.......KAKAROT!\" Broly said. \"What's a Kakarot? Is it a food? Ugh! It sounds horrible!\" Goten shouted ruining his cover. \"Goten get out! Broly is too dangerous  for just us! I need to contact Dad from Other World! Kakarot is Dad by the way.\" Gohan said. Broly started to fire Ki blasts. It hit the watches off of Gohan and Videl and they slowly turned back to normal. They quickly put back on there watches. Or they think so. They picked up the wrong watches.</span></div></div>",
            "created":1267246800,
            "id":843169,
            "title":"the battle"
        },
        "14111":{
            "author_id":"pinoyknight8",
            "author_name":"TheSoullessOne",
            "choices":[
                "Go to Bulma for help."
            ],
            "content":"<div class=\"\"><div> <span>Each of their watches had their DNA signatures. Out dispensed there suits though. The correct suits but wrong watches. Their watches started to modify their DNA to the others. Basically they slowly changed into each other. Nobody knew though. Goku flew down and the battle began.\"Quick he's down! Gohan! Goten! Come here lets launch the family Kamehameha! KA-ME-HA-ME-HAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA! Broly had been defeated. Gohan and Videl went back home and slept for hours and hours. About one day. Gohan woke up early at night. \"Yawn! man it's 3 AM.\"Gohan muttered in an unusually feminine voice. \"GOHAN! GOHAN WAKE UP!\" Yelled a voice that sounded  like his. Gohan got up. he was looking straight at himself. \"Huh why am I looking at myself! Why does my voice sound so feminine?\" Gohan yelled. \"Gohan you idiot look at your self\" Videl shouted. He wasn't looking at himself. He was looking at Videl's body.\"Why am I you Videl? why are you me?\" Gohan said. \"I don't know. WAIT! When broly knocked off our watches there was smoke-Videl was cut off. \"I did that. I set off a smoke bomb so nobody knew who we are.\" Gohan said. \"Well that caused us to pick up the wrong watches. Each of our watches has our DNA signature. So we were slowly turned into each other!\" Videl said. \"Wow. I would expect this from Bulma but not you. Where did you learn all of this?\" Gohan said. \"I took all AP classes in Orange Star High.\" Videl said.</span></div></div>",
            "created":1267246800,
            "id":843179,
            "title":"continue(The swap)"
        },
        "142":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "he was fully transformed",
                " he had boobs and a vagina",
                "he had chichis hair"
            ],
            "content":"<div class=\"\"><div> <span>chichi was making gohan study for hours on end  she went into his room to make sure he woudnt get up to mischief  gohan was really annoyed at his mom  and wished he could be in charge he begain to feel funny and suddenly went  to sleep and when he awoke</span></div></div>",
            "created":1301720400,
            "id":1080724,
            "title":"ChiChi"
        },
        "1421":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "punish chichi",
                "tell her its a dream",
                "she demands an explanation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>gohan couldnt beleive it he had swapped bodies with his mom his wish had come true he saw his body laying on the floor mom must have my body he thaught <br>\r\nhe wondered what to do now that he was the adult his mom will probably get real mad</span></div></span></div>",
            "created":1301720400,
            "id":1080725,
            "title":"he was fully transformed"
        },
        "14211":{
            "author_id":"greenlanter",
            "author_name":"green writer",
            "choices":[
                "chichi figures out what going on ",
                "gohan pov"
            ],
            "content":"<div class=\"\"><div> <span>\"GOHAN WHY ARE YOU NOT STUDEING \" he screamed with all his might chichi said \" gohan I'm not gohan I'm chichi \" gohan said \" oh right very funny mister but look at me I'm chichi with this sexy body now I am your mother and you will do what I say am I understood \" chichi backed down not knowing what was going on and said \" yes mom \" gohan left the room laughing at what had happened he then looked at what he was wearing and thought \"ugh how does she stand these tight clothes \"  </span></div></div>",
            "created":1499403600,
            "id":2349168,
            "title":"sweet reveage "
        },
        "142111":{
            "author_id":"shenron31",
            "author_name":"Shenron31",
            "choices":[
                "Confront Gohan",
                "Gohan Pov"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>“ What is happening Chi Chi said, it was like I was looking at my own body”<br>\r\n<br>\r\n“ Wait a second if I am in Gohan’s body then he must be in....”<br>\r\n<br>\r\n“ Oh I am gonna punish that kid.”</span></div></span></div>",
            "created":1593219420,
            "id":2857314,
            "title":"chichi figures out what going on "
        },
        "144":{
            "author_id":"pokeman37",
            "author_name":"Jayden",
            "choices":[
                "You help out bulma",
                "You deny her request"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>One day (Teen)Gohan is studying when Bulma comes to visit him. Gohan:Hi bulma<br>\r\nBulma:Hi gohan I want to test out a new invention and I thought I could only trust you with it,will you help me out?</span></div></span></div>",
            "created":1583119320,
            "id":2795391,
            "title":"Bulma"
        },
        "1441":{
            "author_id":"pokeman37",
            "author_name":"Jayden",
            "choices":[
                "Chi Chi comes back at that moment",
                "Gohan and bulma switch bodies",
                "Gohan and Bulma are stuck as each other"
            ],
            "content":"<div class=\"\"><div> <span>Gohan:Sure Bulma anything to help you out!<br>\r\nBulma:Thanks Gohan I knew you would say yes,you see my machine is a body swap remote,and I wanna see if it works.<br>\r\nGohan:So you decided to use me for it?<br>\r\nBulma:Yes<br>\r\nGohan:Ok go for it and I what a small break from studying,just switch us back when mom comes back.<br>\r\nBulma:Ok 3,2,1,GO!</span></div></div>",
            "created":1583119680,
            "id":2795395,
            "title":"You help out bulma"
        },
        "14411":{
            "author_id":"pokeman37",
            "author_name":"Jayden",
            "choices":[
                "You make up lie",
                "You tell chi chi everything"
            ],
            "content":"<div class=\"\"><div> <span>Gohan:Woah,it feels weird being a girl,Bulma are you ok?<br>\r\nBulma:Don't worry,I'm fine gohan.It sure is better then being a frog.<br>\r\nGohan and Bulma laugh remembering what happened in the namek saga.<br>\r\nAs they are laughing chi chi comes home.<br>\r\nChi Chi:Oh hi bulma(Gohan),didn't think you would visit me today.<br>\r\nGohan(now in bulmas body):Um,chi chi,I have to tell you something<br>\r\nChi Chi\"What is it Bulma<br>\r\nGohan:Well you see,</span></div></div>",
            "created":1583120100,
            "id":2795398,
            "title":"Chi Chi comes back at that moment"
        },
        "15":{
            "author_id":"pinoyknight8",
            "author_name":"TheSoullessOne",
            "choices":[
                "roshi",
                "krillen",
                "picollo",
                "hercule/mr. satan",
                "switch to girls"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>more guys.</span></div></span></div>",
            "created":1267160400,
            "id":842957,
            "title":"more"
        },
        "151":{
            "author_id":"borou",
            "author_name":"Borou",
            "choices":[
                "C18",
                "Bulna",
                "Kale"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>with who is roshi going to swap?</span></div></span></div>",
            "created":1590367980,
            "id":2840572,
            "title":"choose your waifu"
        },
        "152":{
            "author_id":"hakaze",
            "author_name":"hakaze",
            "choices":[
                "Android 18",
                "Bulma",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who should Krillin switch with?</span></div></span></div>",
            "created":1593463080,
            "id":2858655,
            "title":"krillen"
        },
        "155":{
            "author_id":"adventurefox1",
            "author_name":"AdventureFox 1",
            "choices":[
                "Bulma",
                "Chi-Chi"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want to posees...</span></div></span></div>",
            "created":1506056400,
            "id":2389793,
            "title":"switch to girls"
        },
        "1551":{
            "author_id":"sharpclaw",
            "author_name":"lie",
            "choices":[
                "Vegeta",
                "Somebody else "
            ],
            "content":"<div class=\"\"><div> <span>After the events of the majin Buu saga at capsule Corp <br>\r\n<br>\r\n<br>\r\n“Bulma it’s your job to watch the kids and be the stay at home mom” said Vegetable<br>\r\n<br>\r\n“Why? I’m one of the smartest people in the world and it’d be a waste” <br>\r\n<br>\r\n“Because you’re a woman and weak, plus your maternal instincts make you naturally suited woman” <br>\r\n<br>\r\nFrustrated bulma stormed out. “This is not how I want to live my life.” “I wish I had the power so I can use my brain for other things “ <br>\r\n<br>\r\nJust last week Goku told me I had to kiss elder kai tomorrow because he saved the earth she thought. <br>\r\n<br>\r\nWait maybe elder kai can help me <br>\r\n<br>\r\nWhen bulma visited elder kai she agreed to give him a kiss if he gave him something which let her increase her power over Vegeta. <br>\r\n<br>\r\nElder Kai gave her special potara ear rings which swapped the bodies of the users permantly. <br>\r\n<br>\r\nPerfect she though as she puckered up and gave elder kai the last kiss she ever would as a woman. <br>\r\n<br>\r\nShe had already planned to use the earrings to swap with...</span></div></div>",
            "created":1535417460,
            "id":2539797,
            "title":"Bulma"
        }
    },
    "info":{
        "author_id":"pinoyknight8",
        "author_name":"TheSoullessOne",
        "brief_description":"Characters from Dragonball switch bodies.You decide how.",
        "created":1267235340,
        "description":"<td align=\"left\" class=\"norm\">                      OH NO! Dragonball Z characters are switching bodies!<br>\r\n                      No gay/lesbian stuff or possesion stuff OK because its not really a body swap if its possesion.<br>\r\n                      No sex or deaths allowed.<br>\r\n                      Add sub characters like zarbon,bardock, and roshi.<br>\r\n                      Have fun and remember the rules! Check all characters before swapping.</td>",
        "id":1650042,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1593463080,
        "modified":1593463080,
        "pretty_title":"dragonball Z body swap"
    }
}