{
    "chapters":{
        "1":{
            "author_id":"mercutio",
            "author_name":"M.E",
            "choices":[
                "All your mom's friends"
            ],
            "content":"<div class=\"\"><div> <span>You were having a great time hanging out with your friends until the worst came. You were walking past the arcade until you stopped and read the sign on the window and it says \" Who is not the wuss that would try out the new virtual console?\" \"I'm going to try it out\" you say. So you walk into the arcade and put a dollar into the machine and you start playing. \" See, its just a regular ga-\" You past out on the arcade floor.<br>\r\n<br>\r\nLater on, you woke up but something wrong. You have shrunk! And not only that, but your not in the arcade anymore, but in someone's house. The furniture and smell looked fimiliar to you and just then someone walks into the front door and you see that it is...</span></div></div>",
            "created":1214974800,
            "id":563950,
            "title":"A weird way to start"
        },
        "11":{
            "author_id":"mercutio",
            "author_name":"M.E",
            "choices":[
                "You broke free",
                "Your doomed"
            ],
            "content":"<div class=\"\"><div> <span>You realised it was a party with all the food, drinks, games, and lots more. They were coming straight to you! You quickly ran from them until you were stuck in gum that was attached to the floor. It looked like it was the end for you until you saw yourself alive and you saw in front of you 4 pairs of big feet and you saw them sitting on the couch. Jena had high heels on, Daphne had sandles, missy had  sneakers, and mary also had high heels. In front of you was missy. \"Ok girls, this is a party and if shoes are killing you, take them off.\" Uh-oh, you couldn't handle four old ladies taking off they're smelly, wrinkled, feet. Everyone took off their shoes except missy. \"What's wrong missy?\" \"I can't take off my shoes. you guys know about my terrible foot odor\" \"Ah, who's going to notice. just take them off and relax.\" \"Noooooooooo\" you screamed as you saw her take off her shoes and you could have died. But it was too late when she took off her socks and threw them on you. All you could see was pink. All became worse when she was about to put her right foot on top of you. You had to get out of the gum or you'll be stuck to her smelly foot.</span></div></div>",
            "created":1217608920,
            "id":563966,
            "title":"All your mom's friends"
        },
        "111":{
            "author_id":"archaic",
            "author_name":"shadow",
            "choices":[
                "Jenna and Daphne's feet",
                "Missy and Mary's feet"
            ],
            "content":"<div class=\"\"><div> <span>Struggling hard in the sticky mass, you are able to just get out when the giant foot fell right next to you. The smell even from here was something fierce and you were so relieved not to be stuck under it. Looking up past the four huge sets of feet, you saw your mother's friends chatting.<br>\r\n\"I can't believe she got to go on vacation! Shes so lucky. Plus I hear that she was able to leave her annoying son behind too.\" Daphne said angrily as she pumps her wrinkled foot up and down. You have no idea who she is talking about, but considering your past relationship with her, you can only imagine she is talking about your family and you. This is only confirmed when Jena spoke.<br>\r\n\"Hes not really that bad.. I mean sure he messes with me, and I would love to get him back, but he doesn't really mean anything malicious. <br>\r\nNot wanting to listen to any more of this conversation and risk getting caught, you make your way under the couch where you will start to make a plan. But to get there you must run through the stinky feet and not get caught. Swallowing hard you decide to run between..<br>\r\n</span></div></div>",
            "created":1221323700,
            "id":581555,
            "title":"You broke free"
        },
        "1111":{
            "author_id":"archaic",
            "author_name":"shadow",
            "choices":[
                "Jenna",
                "Daphne",
                "Missy"
            ],
            "content":"<div class=\"\"><div> <span>Not wanting to go near the extremely smelly feet of Missy, you make a dash to the couch between Daphne and Jenna's feet. At first this appeared to be a smart move as they're feet stank less, although Jenna did have some funk to her feet, but you would soon find this to be a mistake. During a rather heated part of the conversation Daphne once again lifted her foot and stomped it down on the ground when you were right next to it. The vibration on the ground caused you to stumble and crash into both Daphne's foot and Jenna's huge toes. <br>\r\n\"EEEK\" Daphne let out a yelp of surprise as Jenna looked down to see what was at her toes. When you look up you can see four giant faces looking down at you. Jenna had on a smile as she knew this was her chance to get you back for all those times you messed with her, Daphne scowled but then grinned realizing the power she had over you, Mary looked at you dumbfound and Missy only laughed at what happened. This was not good! Getting up you try to run but a huge hand comes down and gets you. When you look at the face of your captive you realize its...</span></div></div>",
            "created":1221324180,
            "id":581558,
            "title":"Bad luck"
        },
        "11111":{
            "author_id":"archaic",
            "author_name":"shadow",
            "choices":[
                "kissing my butt",
                "Showing your loyalty and climbing in Missy's mouth"
            ],
            "content":"<div class=\"\"><div> <span>Jenna's enormous smiling mouth is right in front of your face and her breath washed over you. You could tell it was her simply due to the color of her lipstick and the yellowish tint to her teeth. <br>\r\n\"Well now girls look who we have here. Its funny we were just talking about you little man, and then suddenly poof! You appear here and only at a couple inches tall to boot. Well now isn't this a kick!\" Jenna laughs as a cascade of breath washes over your diminutive form in her fist. <br>\r\n\"Oh we can have so much fun with this pest can't we girls. He can be our own little slave and do whatever we wish.\" Daphne said with smirk as she flicked your head softly.<br>\r\n\"Yeah this is awesome.... I've never felt such power as I do looking at him in your hand Jenna.\" Missy laughed as she approached and gave your head a kiss. \"Hes so small I bet he can fit in our mouths easy.<br>\r\n\"But if we do that he may die. Besides Jenna, didn't he always tell you to kiss his ass. Perhaps what he really wanted was to kiss yours. Now that you're practically a goddess to him, you should give him what he wants eh.\" Mary finally spoke, but it wasn't in your favor. Its true Jenna always had a nice butt, but you never imagined having to kiss it when it was so much bigger than you.<br>\r\n\"Hehe I guess you're right Mary. So little guy are you ready to begin worshiping your 4 big bad goddesses. You can begin by\"</span></div></div>",
            "created":1221324780,
            "id":581561,
            "title":"Jenna has you"
        },
        "111111":{
            "author_id":"archaic",
            "author_name":"shadow",
            "choices":[
                "She leaves you be",
                "She puts you in her butt crack."
            ],
            "content":"<div class=\"\"><div> <span>\"Kiss my butt little man. I know you always looked at it, and to show you just how merciful I am I'll let you get a taste of it. Missy can you hold him for a minute as I just do something?\" Jenna spoke your judgment and you swallowed hard after hearing it. As Jenna dropped you out of her hand and into Missy's. As Jenna left the room, you saw Missy smile down at you before secretly licking your entire body. You were now drenched in her stinky saliva, and you knew why even before she whispered it to you.<br>\r\n<br>\r\n\"With my spit all over you, you are sure to stick to your goddess's butt cheek like a good little man. Oh by the way, you tasted pretty good.\" Missy giggled a bit before Daphne and Mary looked at her strangely.<br>\r\n<br>\r\n\"Whats so funny Ms. Giggly.\" Daphne inquired with a strange look on her face.<br>\r\n<br>\r\n\"Oh nothing, he just tickles my palm a bit.\" Missy answered this as Jenna came back into the room wearing nothing but her bra and thong panties.<br>\r\n<br>\r\n\"Well now ladies, I figure a goddess should show off her beauty eh?\" Jenna laughed and laid down on the couch. \"Ok put him on my ass so he can get to kissing it.\" Missy approached Jenna's large back side and pushed your body into it. The soft mounds of flesh sank under the force of Missy's hand and your body. It actually wasn't that bad at all as the butt cheek was very warm and soft. When the hand left your body, you realized just how evil Missy was as you came to the conclusion that you actually weren't in the middle of the cheek, but rather very near the thong.<br>\r\n<br>\r\n\"Wow Missy any more and he would be in Jenna's ass crack.\" Mary observed with a sarcastic tone. <br>\r\n<br>\r\n\"Yeah its a shame he's not. I mean he's such an asshole to Jenna I feel as though being near her hole is simply poetic justice. I mean, this way he will kiss her ass and take in her fumes if she wanted.\" Daphne had to just chime in with that advice. You started to kiss and lick Jenna's ass furiously in hope that she will take mercy on you.<br>\r\n<br>\r\n\"Oh I can actually feel him submitting so maybe that wont be necessary Daphne. Although... it could be fun.\" Jenna bit her lip as she thought about what to do. </span></div></div>",
            "created":1221326220,
            "id":581571,
            "title":"Butt kissing"
        },
        "11112":{
            "author_id":"archaic",
            "author_name":"shadow",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>You try to squirm in the tight fist that holds you, but realize its only getting tighter. When you open your eyes you can see why. Daphne's huge eyes are right in front of you until you are lowered to her soft looking lips. Of course, what comes out of these lips is not as soft.<br>\r\n\"What the hell are you doing here you little runt? Come to bother me some more or something. You know I always hated you, and yet you still approached me when your only a few inches tall. Well that's not going to work for me so here's whats going to happen. From now on I am your goddess, and my three friends shall all be your mistresses. You are to do whatever I say, and then whatever they say. Got it?\"<br>\r\nYou cower in fear as you hear your mother's friends all laughing in glee. You cant help but notice just how powerless you are right now, and you really hate having the idea that Daphne is your goddess. Still you nod your head and avert your eyes away from the smiling lips of Daphne.<br>\r\n<br>\r\n\"Well now Daph, that was certainly a display of power.\" Missy said he she looked over what little of you popped out from the fist. \"So what are you going to do first?\"<br>\r\n<br>\r\n\"I'm going to see how much this bug can take the only way I know how.\" Daphne lifted her foot as she dropped you to the ground. You land with a crunch, but don't die. When you look up all you can see if the giant sole of Daphne come and step on you. You try to push it up, but its useless.</span></div></div>",
            "created":1221325320,
            "id":581566,
            "title":"Daphne, your new goddess"
        },
        "111121":{
            "author_id":"archaic",
            "author_name":"shadow",
            "choices":[
                "Missy tortures you",
                "Daphne tortures you"
            ],
            "content":"<div class=\"\"><div> <span>Daphne's smelly sole continues to push down on you and the pressure builds up. You feel like you are going to pop and there is no sign of her lifting her foot up. You move your hands from her sole to her toes as you grab onto the big and middle toe just to get more comfortable. You can hear Daphne's wicked laughter, but you can only see through the small gap between her index toe and her big toe. This was a hellish experience for sure.<br>\r\n<br>\r\nThen it happened. Daphne stopped laughing and just gasped in surprise when she saw your body flatten like clay. Whatever shrunk you has made you pliable and quite possibly immortal. While this seems like a blessing, the fact that you are under the stinky foot, the fact that you wont die from this, and the fact that Daphne is now staring down at her foot with a wicked lust all point to a horrible future for you.<br>\r\n<br>\r\n\"Well now ladies, it appears that we can do whatever we want to this bug. Lets have some fun shall we! First however I just want him to know his place a little better.\" Daphne lifts up her foot and you quickly regain your shape, but you are not granted a sight you want to see. Instead you can hear some rather disgusting noises and look up to see Daphne spit out a large loogie on your small body. Covered in phlegm and saliva, Daphne stamps her foot down on you over and over again as the other girls look in a mixture of horro and intrigue.<br>\r\n<br>\r\n\"Wow I would love to torture him a bit!\" Missy giggled as she looked down at the sight.<br>\r\n<br>\r\n\"Hrmm maybe, but I am having too much fun with this. However, I am having way too much fun with torturing this little creep right now. But all this stomping is making me a bit gassy, perhaps I should show this piece of shit my 'inner' feelings.\" Daphne blurted this out as Mary and Jenna just stared at the two ladies in awe.</span></div></div>",
            "created":1222232100,
            "id":586525,
            "title":"Squished like clay"
        },
        "1111211":{
            "choices":[
                "puts her socks and shoes back on with you inside...",
                "puts her shoes on with no socks with you inside.."
            ],
            "content":"<div class=\"\"><div> <span>\"Its my turn,you can have him later\"  Missy says.<br>\r\n<br>\r\nYou cower in fear as you know where this is headed.  The smell of her feet assaults you nostrils even from several feet away, but it only gets worse as she walks towards you.<br>\r\n<br>\r\n\"A little bug likes you belongs at the feet of your superiors\" she says as she raises her stinky foot over you.<br>\r\n<br>\r\n\"Come worship your masters, little bug\" she says as she lowers her foot on you.<br>\r\n<br>\r\nWith no regard for you, she presses her sole down roughly and you immediately begin to flatten out.  Twisting her foot backs and forth your flattened form get forced into her stinky crevices in her wrinkled skin and toes.  You were literally forming a second skin under her feet.  What's worse is the incredible stink was all over you now.  Nowhere could your senses avoid it.<br>\r\n<br>\r\n\"My goodness Miss.  We want to torture the little guy not kill him.  No one can survive that stink\" Daphne says pinching her nose.<br>\r\n<br>\r\n\"Oh I think our little toy can, can't you dear\" she says, pressing down even harder.  \"In fact, I'll show you ladies\"<br>\r\n<br>\r\nWith that she....</span></div></div>",
            "created":1322936820,
            "id":1233940,
            "title":"Missy tortures you"
        },
        "11112112":{
            "choices":[
                "They go dancing",
                "Mary tries to intervene on your behalf."
            ],
            "content":"<div class=\"\"><div> <span>You try everything you can to break free of Missy's foot, but to no avail as darkness closes in from all sides.  You thouhg nothing could smell worse than her foot until your back hit the leather inside her shoe.  Almost instantly the temperature rose 30 degrees and and the humidity was unreal.  All around you sweat began to pour like a leaky faucet.  The acrid salty taste was enough to make you puke.<br>\r\nOutside the shoe the girls were having a laugh.<br>\r\n<br>\r\n\"My goodness Missy, why not be merciful and just kill him\"  Daphne giggled.<br>\r\n<br>\r\n\"Oh no, I have plans for this little guy\"  she mused.  \"He feels so good in there, like a gel insole\"<br>\r\n<br>\r\n\"How bout some fun girls\" Daphne says...\" I know, lets go out dancing\"<br>\r\n<br>\r\n\"Sounds great to me\"  Missy says as she twists her foot on her insole.<br>\r\n<br>\r\n</span></div></div>",
            "created":1333662600,
            "id":1309865,
            "title":"puts her shoes on with no socks with you inside.."
        },
        "111121121":{
            "choices":[
                "You peel off of her foot.",
                "You remain plstered to her sole."
            ],
            "content":"<div class=\"\"><div> <span>\"Dancing it is\"  Daphne says as she pops out of her seat, putting her full weight on you.<br>\r\n<br>\r\nWith each step is felt as though a mountain was being dropped on you.  The pain was unbearable,  yet no matter how many steps she took, you just kept on going.  You didn't pass out from pain, you didn't die, you just sat there, stuck to her foot in unimaginable pain.<br>\r\n<br>\r\nYou did get a reprieve on the drive to the club, but it was short lived as Daphne hit the dance floor. Once again the pain was incredible, and whats worse, the temperature felt like it shot up another 100 degrees.  What was once a sauna now felt like a volcano.  And if that wasn't bad enough, the smell just got worse and worse.<br>\r\n<br>\r\n\"Please... oh please just let me pass out... PLEASE!!!!\" you prayed.  But there would be no answer to your prayers this day.  The pain, heat and stink just continued relentlessly.<br>\r\n<br>\r\nThen, after what seemed like an eternity it stopped.  <br>\r\n<br>\r\n\"She must have sat down\" you thought.<br>\r\n<br>\r\nAfter what seemed like forever in darkness, light started filling all around you and a cool breeze quickly dropped the temperature.  Daphne had slipped her shoe off it appears to cool down.  Was this mercy or just ignorance?<br>\r\nDidn't matter to you, it was a temporary stay from the hell you had just experienced.<br>\r\n<br>\r\nWhat happens now?</span></div></div>",
            "created":1335637080,
            "id":1324299,
            "title":"They go dancing"
        },
        "1111212":{
            "author_id":"xkiba4lifex",
            "author_name":"Lover Of All Giantesses",
            "choices":[
                "She eats him",
                "She just toys with him"
            ],
            "content":"<div class=\"\"><div> <span>\"Sorry Missy, you can have your fun with him later. Now is my time with him\" Daphne said as she reached down to the battered heap that you were. Her fingers roughly grab you as your lifted up to her face. Daphne sees that your body was dirty a bit, most likely from her foot that stomped you. You try to wiggle out of her fingers but that proved futile as all it did was cause Daphne to laugh at you.<br>\r\n<br>\r\n\"Look at this girls. He can't even move one of my fingers. What a weakling\" Daphne said as all four of the girls laughed at you, destroying your masculinity.<br>\r\n<br>\r\n\"But being a weakling doesn't mean that your useless. If you know your place, then you'll make a great servent.\" Daphne said \"But it's obvious you need to be punished first, figure out who's in charge here.\"<br>\r\n<br>\r\n\"just let me go!\" you shout up at her.<br>\r\n<br>\r\n\"Fine, if you want\" Daphne said simply as she brought you over her mouth. She opened her sexy lips and revealed the inside of her mouth and slimy serpent that dwells within.<br>\r\n<br>\r\n\"What're you doing? You say to her.<br>\r\n<br>\r\n\"Doing what you want, let you go\" and with that proclamation, Daphne let you go as you fall directly in her mouth. The rest of the girls watch in shock as you disappeared from their sight.<br>\r\n<br>\r\nFor you it was terrifying, her tongue caught you but it wasn't welcomes. As she started to throw you around with her tongue. It wrapping around you and pushing you all around.<br>\r\n<br>\r\n\"She's not going to eat him, right?\" Mary said worried about your well being.<br>\r\n<br>\r\n\"I don't know, one half of me wants her to just get rid of him, while the other half wants her not to, so I can get my chance with him\" Missy said.<br>\r\n<br>\r\n\"I think we all want a chance with him\" Jena said.<br>\r\n<br>\r\nWhat does Daphne do?</span></div></div>",
            "created":1523453400,
            "id":2478363,
            "title":"In Daphne's Mouth"
        },
        "1112":{
            "author_id":"archaic",
            "author_name":"shadow",
            "choices":[
                "you get seen",
                " you are forced to smell her shoes and sucks, but you're not seen"
            ],
            "content":"<div class=\"\"><div> <span>Looking at your options you can tell that its best just to run straight into the couch as opposed to moving to the side to run in between Daphne and Jenna. Besides, you know how much Daphne hates you, so being as far away from her is the best thing that you can do. Swallowing a mix of saliva and fear, you charge head on in between the pair of giant feet and almost gag on the stench coming off of Jenna's foot. It was so strong that it was like you were running into an invisible wall! Pushing through however, you are able to make it under the couch only to continue suffering the strong smell of feet. It was clear that you weren't the only one to notice the smell however as two seconds later a couple of the ladies started to giggle.<br>\r\n<br>\r\n\"Oh god Jenna, your feet really do stink. I feel bad for any bugs that you step on with those things. I mean as if getting killed by a foot wasn't bad enough, they have to suffer the stench before being taken out of their mercy!\" <br>\r\n<br>\r\n\"Yeah I mean please just throw those things under the couch so the smell doesn't get to us.\"<br>\r\n<br>\r\n\"hahaha I guess you have a good point.\"<br>\r\n<br>\r\nYou instinctively knew you were in trouble as the huge pair of feet in front of you plants hard onto the ground and the couch rattles a bit. In the distance you can see Jenna's hands grab her shoes and socks and watch as she bends lower to put them under the couch. Within seconds you see the largest face in your life, but does she see you?</span></div></div>",
            "created":1221612780,
            "id":583359,
            "title":"Missy and Mary's feet"
        },
        "11122":{
            "author_id":"icesnake177",
            "author_name":"snake",
            "choices":[
                "Leave the couch",
                "stay and take the smell"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Luckey for you none of the women saw you run under the couch, but when you saw Jenna's shoes appear you wanted to leave but if you left you might get seen.</span></div></span></div>",
            "created":1222234200,
            "id":586533,
            "title":" you are forced to smell her shoes and sucks, b..."
        },
        "111221":{
            "author_id":"icesnake177",
            "author_name":"snake",
            "choices":[
                "You were stuck to the pussy side",
                "You were stuck to the ass side"
            ],
            "content":"<div class=\"\"><div> <span>you couldn't take the smell anymore and decided to leave, but as soon as you see light. It was covered by a jena's panties falling toward you. You tried to run but the giant panties landed on you before you could move. \"Hey thanks for the clothes Missy but where did you throw my thong.\" You started to worry and tried to get out but you got stuck to the fabric. \"aw, there they are.\" Jena said as she lifted the thong and started to put it on. </span></div></div>",
            "created":1222234560,
            "id":586535,
            "title":"Leave the couch"
        },
        "1112211":{
            "author_id":"icesnake177",
            "author_name":"snake",
            "choices":[
                "you try to get out of her pussy",
                "Jena decides to leave and have Fun at home"
            ],
            "content":"<div class=\"\"><div> <span>Next thing you see is a giant pussy's lips coming toward you. \"There back on\" jena said. Then Daphne goes behind jena and pulls the thong higher up.\"Hey stop\" Jena screamed, \"Why\" Daphne said with a laugh. \"there that how a thong is supposted to look like.\" Daphne said.  When daphne pulled the thong in the air it caused you to lose you grip on the fabric and be pushed head first into the hungery pussy. \"When it does feel SO good.\" Jena said with a moan. </span></div></div>",
            "created":1222234980,
            "id":586541,
            "title":"You were stuck to the pussy side"
        }
    },
    "info":{
        "author_id":"mercutio",
        "author_name":"M.E",
        "brief_description":"Jerry loved messing with his friend's moms. now the mom's will be messing with him!",
        "created":1215020220,
        "description":"<td align=\"left\" class=\"norm\">All of the mom's family went to a vacation without her for some reason.<br>\r\n<br>\r\nJena- 38, you always mess with her<br>\r\n<br>\r\nDaphne- 36, hates you so much<br>\r\n<br>\r\nmary- 40, don't knows how she feels about you<br>\r\n<br>\r\nmissy- 35, she doesn't like you that much<br>\r\n<br>\r\nput whatever you want just add and have fun!</td>",
        "id":1446100,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1523453400,
        "modified":1523453400,
        "pretty_title":"Shrunk with your mom's friends"
    }
}