{
    "chapters":{
        "1":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Left?",
                "Right?"
            ],
            "content":"<div class=\"\"><div> <span>          You stumble away from the clearing, sweeping branches away with your paws as you make your way deeper into the still forest. Still, at present that is.<br>\r\n<br>\r\n          You continue through the undergrowth seemingly alone as you treck through the rampant growth of decaying plants and fallen trees. A lone owl hoots above you, all that keeps you company in this desolate place as you continue your lonesome journey through the twilight hours.<br>\r\n          The moon sparkles of your prison uniform, helping to illuminate your path somewhat, and you as well.<br>\r\n          Suddenly you find you've come across an old dirt track, disused for many a bye gone year of course but at least there are tracks. There are slight grooves to the sides and animal prints in the middle. Where they came from is something you dont know, nor most likely something you will ever know if you dont keep moving.<br>\r\n          These are the tracks that could lead to your escape or to you being fat on a succubus' thighs. Choose wisely...<br>\r\n<br>\r\n<br>\r\nWhich way do you go?</span></div></div>",
            "created":1110510660,
            "id":310299,
            "title":"Choices"
        },
        "11":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Try and steal the bow",
                "Introduce yourself from afar"
            ],
            "content":"<div class=\"\"><div> <span>          Left? Left? Who does that? What were you thinking man/woman/herm? Gods, some people. Ohh well. Can't go back now can we?<br>\r\n<br>\r\n<br>\r\nYou walk down to the left, bating at the insects that are circling the small puddle of water on the floor. Strange that as there seems no place for the water to have come from. You stoop down to look at it closer and notice it's surface is not clear but instead a murky brown colour...congealed blood, perhaps days or maybe even hours old? You dotn want to find either what caused this wound or who survived it, assuming they did of course. As you continue quickly along the path you hear a stream burbling in the distance and walk towards it. The air is deadly calm here and your fur prickles up from the aura of the area.<br>\r\n<br>\r\nAs you turn the corner you see a small maiden sitting by the stream, slowly brushing her hair as her skin sparkles ever so brightly in the moonlight. Her pointed ears and the bow nearby tell you she is an elf or, at any rate, a halfling and most definately not a person to try and take on in a fight unless you are either foolhardy, lucky or have a deathwish.<br>\r\n<br>\r\nMind you that bow would be a very useful acquisition in this forest if anything your inmates said about this place can be trusted. Nothing like a weapon or maybe a bartering tool to have for later.<br>\r\n<br>\r\nDo you?</span></div></div>",
            "created":1110430800,
            "id":270182,
            "title":"Should I or shouldn't I?"
        },
        "111":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Defensive",
                "Offensive"
            ],
            "content":"<div class=\"\"><div> <span>Obviously you weren't in jail for one of the 'smart' crimes such as fraud.<br>\r\n<br>\r\nYou tiptoe up to the tree stump as quiet as you can, wincing with each step as you crack the dried twigs and fallen branches on the floor. Just as you place your hand around the bow you see a silver dagger in between your fingertips, not touching the skin though as the throw was well aimed. It was a warnign shot you gather, seing as how it flew so fast and silently.<br>\r\n<br>\r\n\"Kindly remove your hand from my bow or you will find another dagger sticking from your spine. I don't take kindly to thieves so explain yourself at once!...or face the consequences\" Her harsh tone spilled out into the cold night air, frost seeming to spew from her mouth as her eyes stared at your cowering form.<br>\r\n<br>\r\nWhilst you may be stupid for attempting to steal from an elf [what were you thinking?] you are bright enough to do as you are told and so slowly move your paw away from her property.<br>\r\n<br>\r\nYou even take a step back and to the side before facing her once more and standing fully upright to the elven lady.<br>\r\n<br>\r\nWhen you speak your tone of voice is...</span></div></div>",
            "created":1110517200,
            "id":270201,
            "title":"No really, are you that stupid?"
        },
        "1112":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Try to wriggle free regardless",
                "Act calm and rational"
            ],
            "content":"<div class=\"\"><div> <span> Before you speak the Elf is already beside you, picking up her dagger and holding it in her hand. <br>\r\n<br>\r\n\"What made you think you could steal from an Elf? Do you even have a brain inside there or is it just a hollow space? Shall we find out?\" She says before raising her fist. You see it rush towards you and ,faster than you can block, she ends up smacking you around the head with the hilt of the dagger, knocking you out before she steps away.<br>\r\n<br>\r\nYou awake many hours later judging by the lighter sky to find yourself upside down, feet tied above you as you sway from side to side in the gently chill breeze of the early morning<br>\r\n<br>\r\n\"So the thief awakes does he?\" Comes a much gentler voice than from last night.<br>\r\n<br>\r\n\"He does indeed. Can I come down now?\" You ask with a gentle voice, seing as the whole world of sound causes burnt pennies to be your tongues only taste.<br>\r\n<br>\r\n\"Are you sure you want to? Check the ground beneath you. Here let me help actually\" She says with a grin as she pushes you with her bow. As you swing you can see a small pit below you containing what looks like a pixie, except she seems to be eying you up with a bit more curiosity than you'd like.<br>\r\n<br>\r\n\"This is my friend Anabelle. Anabelle likes to eat things. Luckily I've a pact with her clan that anyone I say is safe is not to be eaten by her. Very few people have escaped from her intestinal tract as anything other than warm lumps. <br>\r\n<br>\r\nSo what's it going to be....</span></div></div>",
            "created":1110862800,
            "id":270210,
            "title":"That was stupid of you..."
        },
        "11121":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "content":"<div class=\"\"><div> <span>*You try to wriggle yourself free infront of the Elf*<br>\r\n<br>\r\n\"Wow...you really are stupid aren't you? I'm right here and you are trying to escape right before me. Sheesh!\"<br>\r\n<br>\r\n\"Ohh shut up already!\" You snap at her as you fail to untie yourself. The craftsmanship behind the knots far to strong for you to break.<br>\r\n<br>\r\n\"Such a mouth on the boy. Shame Anabelle has a much bigger one. I feel like I'm doing the world a favour by removing your genes from the pool. Enjoy your trip through Anabelle dear, I know she will.\"<br>\r\n<br>\r\nWith a cackle from the Elf she pulls out her bow, quivers an arrow and shoots through the rope holding you. The rope untwines, each strand spiraling around each other until you see it break. You look downwards to see the open maw of Anabelle beneath you. The last view your eyes will see before you plummet right into her stomach.<br>\r\n<br>\r\nMinutes later you wake up though, you sort of wish you hadn't. Your body is surounded by the digestive enzymes of the Pixie which start to slowly eat away at your flesh. All you can do now is wriggle about in her tummy in hopes of finding a way out.<br>\r\n<br>\r\nUnfortunately though, it seems that Anabelle has had a healthy diet and undigested matter was to be found. It wouldn't be long before the acids eat completely through your skin, the best you can do is simply try and keep your head above the acidic pool. Though as you soon find out, you can't do this when the level of liquid inside rises around you.<br>\r\n<br>\r\nWeakened and defeated, you lay as a mere shell of the once proud fur you were; the enzymes having reduced you to a nicely nutritionaly balanced soup. Skunk's have such a flavour to them afterall.<br>\r\n<br>\r\nSuddenly, there is a shift in the liquid, a downward pull that sucks your remains under. If there was a chance of getting out, it was gone now. Once more Lady Luck smiles at you and gives you a firm kick between the legs since now, you're on your way through the small intestines, the enzymes there finishing the job from the stomach as you float along the twisting and winding path. <br>\r\n<br>\r\nYou dont spend long in there though as after an hour or so you pass out again.<br>\r\n<br>\r\nThe trip through her intestines does your figure much help. You are now much slimmer than before though of course you wouldn't know that being as you are now a steaming lump of fecal matter.<br>\r\n<br>\r\nTHE END</span></div></div>",
            "created":1110937380,
            "id":310424,
            "title":"Strike three"
        },
        "112":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "I'd rather not say...",
                "What's it to you?"
            ],
            "content":"<div class=\"\"><div> <span> \"Erm..hi there\" You say as you slowly walk out from behind the trees, having your arms raised to show you are no threat to her.<br>\r\n          You Slowly walk from behind the outgrown and moss covered branches to show yourself to her fully, your tattered clothing lose on your body and your matted fur showing you've been running or at least something in the forest around you.<br>\r\n<br>\r\n          She smiles and looks up at you, raising her hand to the bow which disapears, only to reapear in her hand. You note that an arrow is suddenly in place in her bow but the string not drawn back...yet. You look on in shock at that level of magic, being a begginer mage yourself it is quite the impressive feat to see someone of much greater calliber magic use it without any seeming strain on mind or body.<br>\r\n<br>\r\nYou bow down low, laying down on the floor before her with your arms stretched out far to either side, making it a bit more special to show your subservience as you figure it won't hurt to add a little more to the normal greeting.<br>\r\n<br>\r\nShe walks over to you and taps your shoulder with the bow, signalling that she has accepted you as subserviant to her.<br>\r\n<br>\r\n\"Arise unknown mage and tell me your name.\" She says as she steps back from you, her emerald cloak billowing in a sudden gust of chill wind that makes her look around.<br>\r\n<br>\r\nYou nod and rise slowly as the pointed tip of her bow remains close to your neck still.<br>\r\n<br>\r\n\"I am Nixs, a cindermage\" You say with a soft voice, head down low and humble, your arms sweeping down to each side before you slowly make your way to an uprooted tree trunk and sit down, eyes on her as she sits down on the earth, forming a small seat as before.<br>\r\n<br>\r\nShe tries her hardest not to laugh at the mention of your rank which brings a begrudging look from you to her<br>\r\n\"Sorry. Couldn't resist, what with that being the lowest rank of any mage and all. I appologise. So what brings you here Nixs, and more importantly what brings you <i>here?</i>\"</span></div></div>",
            "created":1110862800,
            "id":270317,
            "title":"A friend perhaps?"
        },
        "1121":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Lucky for you she's a nice elf"
            ],
            "content":"<div class=\"\"><div> <span>          She nods as she sees your hesitation to answer her seemingly simple question.<br>\r\n<br>\r\n\"No need to say anything. I can just read it from you instead\" She says flippantly before waving her hand towards you. Her eyes close and you see white runes tattood on her eyelids. Except they aren't really there, they are just a manifestation of her magic.<br>\r\n<br>\r\n          You feel a coolness spreading from one side of your head to the other. You try to fight it, feeling the coolness making differenbt routes through you as you fend off each strike.<br>\r\n           \"Please\" You say, feeling your body go weak. \"Please...stop\" Your body begins to feel numb and you start to falter, body wobbling a little. Your vision goes cloudy and you feel muscles tensing before you find yourself on the ground suddenly. You blink a few times, trying to look around as you see her rush over to you. Her mouth opens but you hear nothing. Then it all goes black.</span></div></div>",
            "created":1110919260,
            "id":311364,
            "title":"It's like brainfreeze but so much worse"
        },
        "11211":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Run away!"
            ],
            "content":"<div class=\"\"><div> <span>You groan deeply as you wake up, rubbing your head and grimacing as the surroundings seem to be trying to cause you physical pain as if you wronged them. The light is too loud. That is how back a headache you have.<br>\r\n<br>\r\nYou lay back down on the cool earth. You lay there as you try not to take in your surroundings for the time being.<br>\r\n<br>\r\n\"Nixs?\" You hear her call you<br>\r\n<br>\r\n\"Yes?\" You say wearily as you hear her footsteps move towards you. A heard of elephants would be quieter in your current state.<br>\r\n<br>\r\n\"Thank the lord and lady. I'm so sorry.\" She says as she holds you to her chest, soft breasts pressing against you, a soft murr coming from you. You feel her lips press to your forehead and instantly the pain goes away.<br>\r\n<br>\r\n\"S'alright now.\" You say, not really wanting to move since her touch is so nice. You roll onto your side, using your paws to get a free touch of her bosom and to use as a pillow.<br>\r\n<br>\r\nShe chuckles and pulls your hands back away from your face. You see her hands are red with almost blister like scars running across them like veins.<br>\r\n<br>\r\n\"I see we both paid a price for underestimating each other.\" You both say at the same time, causing each other to laugh.<br>\r\n<br>\r\nSuddenly you hear a loud roar from the forests, trees crashing to add to the noise as it moves closer to the two of you.<br>\r\n<br>\r\n\"I think we had better get out of here you say to her\"<br>\r\n<br>\r\nShe says nothing however and pulls you up before grimacing with pain. She see this and run over to her satchel, picking up her bow and reaching for her sword.<br>\r\n<br>\r\n\"Wait don't touch the sword\" she screams at you as your paw envelops the grip.<br>\r\n<br>\r\nYou return to her with the sword in hand, offering it to her.<br>\r\n<br>\r\n\"Didn't know you were so possessive of your sword. Sorry\"<br>\r\n<br>\r\n\"It's not that it's..well you shouldn't have been able to pick it up without getting hurt. No time to explain more. Come on let's move it\"<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1110921720,
            "id":311366,
            "title":"Was it good for you?"
        },
        "112111":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Climb up into the treetops",
                "Crawl under the roots"
            ],
            "content":"<div class=\"\"><div> <span>As the two of you hot foot it out of there, heads turning back every so often, the elf looks over you.<br>\r\n<br>\r\n\"My sword is imbued with elven magic, only the elves and few others can hold it. If you can hold it then it means two things. Or one of them rather\"<br>\r\n<br>\r\n\"Ohh, what are they?\" You say as you bat a branch away from your face, the sounds of being pursued getting ever closer as the two of you run for possibly your lives.<br>\r\n<br>\r\n\"Either you are elfish or the one who cast this spell is in trouble.\" <br>\r\n<br>\r\n\"Who's that then?\" You ask.<br>\r\n<br>\r\n\"My father...Look I'm sorry. How would you feel if something that you were used to working no longer worked or that your own father was in mortal peril? Either way I have to investigate. Sorry I cant help run away with you but I have to do this\"<br>\r\n<br>\r\nYou were far too out of breath to ask her what it was that was chasing you and she was far to quick to abandon you. Before you knew it you were alone again. Well, apart from the thing chasing you that is.<br>\r\n<br>\r\nThe sounds of the pursuer were getting closer. You didn't have much stamina left. Cross country was not your strong point. Hell nothing involving running was. You figure your only chance would be to hide. Up ahead was a tree with dense folliage and a tangle of covered roots...<br>\r\n</span></div></div>",
            "created":1143936060,
            "id":311369,
            "title":"Hide and seek"
        },
        "1121111":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Enter the creature"
            ],
            "content":"<div class=\"\"><div> <span>Running may not have been your star performance but you did have some muscle in your arms from those work outs in the gym at the jail. Not enough to go ewww at but a nice toned shape. Shame about the rest of you though.<br>\r\n<br>\r\nYou stop abruptly at the base of the tree and look for a way to hoist you up. The branches look sturdy enough you think to yourself as you find suitable ones to hoist yourself up with.<br>\r\n<br>\r\nWith surprising quickness you find yourself over halfway up the tree. You try to control your breathing as you rest there against the trunk of the tree, clutching at your chest as you take deep breaths and trying to be quiet.<br>\r\n<br>\r\nNot too long after you see the creature aproach...</span></div></div>",
            "created":1143867600,
            "id":310072,
            "title":"Moving on up"
        },
        "11211111":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "She looks up into the tree folliage.",
                "She looks in the base of the tree."
            ],
            "content":"<div class=\"\"><div> <span>           Standing before you is one eyeful of scales. A slender and rather attractive anthro snake. Her body, though thin, is curvacious at the hips, and feminine enough to avoid a mix-up of gender. Her tail  is her dominant feature. Roughly the same length as her you can see it could cause some serious damage if needs be.<br>\r\n<br>\r\n          Though she lacks the endowments of a normal mammal, mainly that of breasts you can quite clearly see that nature gave her something else instead. Her arms. There are six of them at present, when she first entered you could swear she only had the normal two.<br>\r\n          Though there are six of them, you assume that they can be morphed back into her body, as most proberly her legs. Thinking about this you realise this would allow her to assume the form of a feral Rattlesnake, a nearly nearly 15 feet long one at that.<br>\r\n          Her atire is rather odd. Odd given the given surroundings but not elsewhere. She was dressed in a pair of Black Leather pants, a tight midriff-baring halter-top of the same material, and a pair of kinky and sexy four-inch heels. Who's to say she couldn't be fashion conscious out here?<br>\r\n<br>\r\n          You notice her stop. Her tongue flicks out in the air as she tastes it, her head looking around before fixing on the tree ahead of her. The tree you were currently in.<br>\r\n<br>\r\n          \"I smell something big.\" She says, savouring the taste as she eyes the trunk where you had climbed up moments before.<br>\r\n          \"Never smelt it before around here. I wonder what it is. Maybe a meal or a companion...or maybe both?\" She giggles to herself as she steps slowly towards the tree you are in.</span></div></div>",
            "created":1144029600,
            "id":310428,
            "title":"Camina"
        },
        "112111111":{
            "author_id":"belltrigger",
            "author_name":"brushfire ",
            "choices":[
                "you climb down",
                "you say nothing "
            ],
            "content":"<div class=\"\"><div> <span>Suddenly she looks in your general direction. You think to yourself \"oh crap she is on to you\". You clutch the branches you where on tightly, stop moving, and even started holding your breath in hope that not spot you. But your attempt at hiding from snake girl fails when she looks right at you and says \"I know your are up there come down here , don't make me have to come up there\". The jig is up what do you do?</span></div></div>",
            "created":1466586480,
            "id":2168450,
            "title":"She looks up into the tree folliage."
        },
        "1121112":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Enter the creature"
            ],
            "content":"<div class=\"\"><div> <span>           You quickly get down on all fours and scurry into the undergrowth of the tree. You must have looked a sight to any onlooker. Hopefully there weren't any of course.<br>\r\n{indent]The smell of moss and lichen is heavy in the air around you as you crawl on your belly to get below the gnarled roots of the aged tree above you. You can see the grooves of where insects have eaten through the bark from the inside.<br>\r\n           After you are snuggly nestled up in your new abode, for the time being that is, you see something come into view...</span></div></div>",
            "created":1144105800,
            "id":310434,
            "title":"Roots manuever"
        },
        "11211121":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "She checks the tree branches",
                "She looks in the base of the tree."
            ],
            "content":"<div class=\"\"><div> <span>Standing before you is one eyeful of scales. A slender and rather attractive anthro snake. Her body, though thin, is curvacious at the hips, and feminine enough to avoid a mix-up of gender. Her tail is her dominant feature. Roughly the same length as her you can see it could cause some serious damage if needs be.<br>\r\n<br>\r\n         Though she lacks the endowments of a normal mammal, mainly that of breasts you can quite clearly see that nature gave her something else instead. Her arms. There are six of them at present, when she first entered you could swear she only had the normal two.<br>\r\n         Though there are six of them, you assume that they can be morphed back into her body, as most proberly her legs. Thinking about this you realise this would allow her to assume the form of a feral Rattlesnake, a nearly nearly 15 feet long one at that.<br>\r\n         Her atire is rather odd. Odd given the given surroundings but not elsewhere. She was dressed in a pair of Black Leather pants, a tight midriff-baring halter-top of the same material, and a pair of kinky and sexy four-inch heels. Who's to say she couldn't be fashion conscious out here?<br>\r\n<br>\r\n         You notice her stop. Her tongue flicks out in the air as she tastes it, her head looking around before fixing on the tree ahead of her. The tree you were currently in.<br>\r\n<br>\r\n         \"I smell something big.\" She says, savouring the taste as she eyes the trunk where you had climbed up moments before.<br>\r\n         \"Never smelt it before around here. I wonder what it is. Maybe a meal or a companion...or maybe both?\" She giggles to herself as she steps slowly towards the tree you are in.</span></div></div>",
            "created":1144105860,
            "id":310435,
            "title":"Camina"
        },
        "1122":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Take her weapons and run",
                "Check to see if she's okay"
            ],
            "content":"<div class=\"\"><div> <span>\"What's it to you?\" You say as you move backwards slightly, only causing her to advance.<br>\r\n<br>\r\n\"Why the hostility? How do i know you weren't only trying to steal my bow?\"<br>\r\n<br>\r\nShe says as she prods your chest with her finger.<br>\r\n<br>\r\n\"I bet you were weren't you? Going to get those grimmy hands on my finely crafted Elven bow. Looking to sell it or just to have? Boast about it to your friends?\"<br>\r\n<br>\r\nShe prods you again and again as you step backwards, getting more and more irate as she does before you finally lose your temper and punch her. She falls to the ground, laying there motionless.</span></div></div>",
            "created":1110862800,
            "id":240191,
            "title":"You hit a girl?"
        },
        "11222":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "To Anabelle"
            ],
            "content":"<div class=\"\"><div> <span>\"Ohh fuck I hit a girl?\" You say as you realise what you've done.<br>\r\n\"Ohh shit, ohh fuck, ohh fuckity shit fuck\" You exclaim as you use your colourful language to explain the situation to any readers out there.<br>\r\n<br>\r\nCollecting yourself you check to see that she's still breathing and breathe a sigh of relief. You turn her over to see she has a thick line of scarlet running across her brow.<br>\r\n<br>\r\nYou start to swear but instead get some water from her canteen along with her bag. Bringing the two over you rest her head on your lap and search for anything of use she may have in there. <br>\r\n<br>\r\nYou find nothing and so search your pockets. Inside you find some coins and a handkerchief. You take the handkerchief and douse the tip in water before wiping away the wound.<br>\r\n<br>\r\nShe winces underneath you and opens her eyes<br>\r\n<br>\r\n\"Don't move yet. I need to clear this wound first before you beat the crap out of me.\"<br>\r\n<br>\r\nSurprisingly she does as told  and before long the bleeding has stopped. You place the handkerchief back in your pocket before replacing the lid on her canteen for her.<br>\r\n<br>\r\n\"Am I allowed to kick the crap out of you now?\"<br>\r\nShe says, no tone to her voice as you let her get up, sitting down on the ground.<br>\r\n<br>\r\n\"Only fair, all things considered\" you reply as you close your eyes, awaiting the Elven fury to be released upon you.<br>\r\n<br>\r\n\"All things considered you can stop cowering skunk.\" She says as she offers you a hand, you take it and lift yourself up before wiping away the dirt from your clothes.<br>\r\n<br>\r\nShe smiles and swiftly brings her knee to your groin as she hold you upright as your face crumples with pain. Your hands reach to cup what's left of your reproductive organs as she removes her knee, you fall to the ground on your knees, haunched over as you try not to cry.<br>\r\n<br>\r\n\"That's for looking in my bag. <i> This </i>\" She says as she lifts you onto your feet and plants a kiss to your lips \"...is for not running off. You aren't a coward after all and even though you bested me in a fight you stayed after it was won. I shall accompany you until I meet my friend Anabelle. She's a pixie\" She smiles at you before kissing you on the forehead and picking up her items.</span></div></div>",
            "created":1110862800,
            "id":240197,
            "title":"Always be nice to the ladies"
        },
        "112221":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Friend",
                "Foe"
            ],
            "content":"<div class=\"\"><div> <span>The two of you walk along the old worn out road, telling each other snippets about your own past whilst with holding other parts of your stories.<br>\r\n<br>\r\nIt's gets dark soon and you hear the sound of baying wolves in the distance. As it gets darker you could swear things are lurking in the shadows of the forest.<br>\r\n<br>\r\n\"Jean...I wont lie to you but I'm absolutely shiting myself at what's out there.\" <br>\r\n<br>\r\nYou hold up your hand above you and it glows fiercely in the night. Rustling can be heard as things scarper away from you. You hold it out ahead of you and turn around to illuminate the whole area to make sure nothing is there.<br>\r\n<br>\r\n\"Lord and lady what are you?\" She says as you lower your hand so as to stop blinding her.<br>\r\n<br>\r\n\"I'm Nixs. Trainee mage and ex convict. Escapee rather. Last time I used that was for something I'm not proud of. People got hurt..let's leave it at that.\"<br>\r\n<br>\r\nShe nods and the two of you continue in silence along the path.<br>\r\n<br>\r\n\"Nixs, you look tired.\"<br>\r\n<br>\r\n\"Magic drains the body and the mind\" You smile weakly at her as your hand begins to flicker. You sigh as the light goes out and you fall to the ground, exhausted.<br>\r\n<br>\r\nYou hear a rusting and stretch your hand out,weak beam illuminating the being that emerges before you collapse on the floor.</span></div></div>",
            "created":1110862800,
            "id":240201,
            "title":"Friend or foe?"
        },
        "1122211":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Given a special kind of wakeup"
            ],
            "content":"<div class=\"\"><div> <span>You lay asleep,unaware of your surroundings until you hear a feint shout from outside<br>\r\n<br>\r\n\"Spit him out this instant\" <br>\r\n<br>\r\nYou awake to find yourself cosy and warm before being flung from this state as you are suddenly surrounded by light again.<br>\r\n<br>\r\n\"I can't believe you tried to eat him!\"<br>\r\n<br>\r\n\"Eat? Whuh?\" You say as you are still disorientated.<br>\r\n<br>\r\n\"I wanted to eat him cos he looked so cute\" You see the pixie pout.<br>\r\n<br>\r\nYou stare up at her before falling back to sleep again, snoring peacefully as the two giggle at your morning glory.</span></div></div>",
            "created":1110862800,
            "id":240204,
            "title":"Two of you, one of me..."
        },
        "12":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Run away from the situation as fast as you can",
                "Stay where you are and whistle back a tune you learnt on the inside"
            ],
            "content":"<div class=\"\"><div> <span>Ahh right. such a good way to go. Well unless it turns into oncoming traffic then you should go another way. Right it is and right you go.<br>\r\n<br>\r\nYou turn right at the crossroad, walking along on your merry way as you whistle to yourself to keep your morale up. High notes, low notes and everything in between. What a masterful little skunk whistler you are. If only your music teacher could see you now, from behind those prison bars he's stuck behind for reasons we wont go into.<br>\r\n<br>\r\nAfter a while of whistling you stop, bored of the tune or just being warry or your surroundings maybe? As you carry on, something catches your eyes under the rays of the silver moonlight. You walk closer to it before bending down to look at the something in the tracks.<br>\r\n<br>\r\nYou pick it up and run it through your fingers. It looks like a gold medallion but rather strangely it has no blemishes, no mud or anything. Rather odd as it was half burried in the mud.<br>\r\n<br>\r\nYou take it, and after giving it a good looking over consider it to not only be rather fetching but also think it looks mighty valuable. A golden circle with rubies embedded in it at three, six, nine and twelve o' clock is something someone would most likely look for it if they knew it was lost.<br>\r\n<br>\r\nYou continue your trail but as you do you hear someone whistling your own tune back at you. You pick it up in the distance and know you are safe, at least for now but still you freeze, panic stricken as you look around. You can't tell who or possibly what is following you.<br>\r\n<br>\r\nThinking quickly you decide the best course of action is for you to...</span></div></div>",
            "created":1110517200,
            "id":270185,
            "title":"You do know how to whistle right?"
        },
        "121":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "When you awake..."
            ],
            "content":"<div class=\"\"><div> <span>You do as any other person would when a stranger begins whistling and get the hell away from your local area.<br>\r\n<br>\r\nYou make with the swift movement of those legs of yours, running along the path as you check behind you every so often to see if anyone is behind you.<br>\r\n<br>\r\nYou soon find yourself out of breath however. Unfit thing you are. Your legs seem to turn to lead, your speed quickly dwindling. Finally you give up, collapsing to your knees. Only then do you feel something moving inside you. You look up to see the feet of someone aproaching. <br>\r\n           Unfortunately for them your body has reacted violently to your sudden exercise. Heaving hard as you upchuck all over the boots of the person who stands before you.<br>\r\n           Once you are finished giving their boots a new coating you wipe your mouth on your sleeve. You look up as you roll onto your back, breathing deeply as you look at the creature before you. You look over the form before you. A vision of beauty and curves. You know what she is from the stories in the prison.<br>\r\n<br>\r\nA succubus.<br>\r\n<br>\r\nShe smiles down at you as she walks away from the pile of your stomachs contents before looking down at her feet.<br>\r\n<br>\r\n\"Ohh. Eww! Ewwww! That's so gross\" She says before flicking of her boots to one side and sitting down on a rock as she looks over you with an annoyed look on her face. Her hand moves swiftly and you feel something prick your arm. You lay down as another wave of nausea washes over you...<br>\r\n</span></div></div>",
            "created":1110585300,
            "id":310448,
            "title":"Exercise is bad for you"
        },
        "1211":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "Submit",
                "Fight"
            ],
            "content":"<div class=\"\"><div> <span>When you awake you find the succubus using your tail to clean her boots to a lovely shine.<br>\r\n<br>\r\n\"Ohh you're awake now? Excellent\" She seems almost like a teenager who received her first credit card as she walks on over to your naked form. You think to yourself and remember that you weren't naked before you were drugged.<br>\r\n<br>\r\nShe smiles at you sweetly before kneeling down over you. She then straddles your hips as she rocks hers softly against you, stroking along your shoulders with her fingertips as she teases your member into life below her.<br>\r\n<br>\r\nShe giggles and presses her skimpy thong to one side as she unbuttons the clasp for it, releasing it to the floor before letting that length of yours slide against her.<br>\r\n<br>\r\nShe grins down at you as her inner walls accept you, gently massaging your skunkhood, arousing and yet more of a relaxing motion as she leans down to kiss you softly on the forehead<br>\r\n<br>\r\n\"Now, now my little skunk. What should I do with you? *She grins as she takes your head in her hands and licks over your lips before letting her tongue slip inside your mouth. You can feel something amiss, like a magic being used on you.</span></div></div>",
            "created":1110588060,
            "id":310453,
            "title":"Fight or fuck?"
        },
        "12111":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "You",
                "Her..well sort of"
            ],
            "content":"<div class=\"\"><div> <span>[An hour os so later].......<br>\r\n<br>\r\nShe whimpers and moans, closing her eyes and relaxing as you slam hard and deep into her, making her stretch open more. She gasps softly as she feels the tip of your shaft start to slide through her cervix, all the juices inside her making it so easy for you to get as deep as you want to* \"Please....fuck me, sir....fill me with cum...\"<br>\r\n<br>\r\nYou bury your mouth to hers as she takes you on your back, breaking through into that womb of hers as she thrusts harder and faster. Her insides moulding to your inner most desires. You barely have time to register this as your loins practically explode within her, splashing the insides with your thick sticky come as she hilts herself fully atop of you. Your thick member pulsing away as it delivers more and more fertile seed straight into her whilst her lips press ever so tightly to yours<br>\r\n<br>\r\nShe moans softly, her velvet insides milking your shaft and squeezing all the cum she can from it, feeling the hot goo splashing into her womb. She trembles a bit, her own orgasm hitting her after a few minutes of furious riding your pleasure overdosed body, and purrs loudly, looking down at you as she rests her head on your chest* <br>\r\n<br>\r\n**********************<br>\r\n<br>\r\n\"I think it's time for a meal, don't you hot stuff?\" She says after a while, your body still aching from the great sex.<br>\r\n<br>\r\n\"Sure. What's to eat?\"</span></div></div>",
            "created":1110923220,
            "id":310457,
            "title":"How can anything this good be bad?"
        },
        "121111":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "All the way through [Digestion and more]"
            ],
            "content":"<div class=\"\"><div> <span>You silly *She giggles as she rocks her hips agaisnt you for a bit before pulling a can of spray cream from out of nowhere.<br>\r\n<br>\r\nShe puts the nozzle in your mouth, holding the can so you can control the flow <br>\r\n<br>\r\n\"All right, here goes\" <br>\r\n<br>\r\nTriggering the can, she giggles as whipped cream starts flowing into you. Her hand stroking over your chest as her spell continues to captivate you still<br>\r\n<br>\r\nYou clamp your maw around the nozzle as it just sprays right on down into your throat, paws holding onto the can as you feel yourself slowly bloating up. After a few more seconds she pulls your head away and grins down at you as she removes her hips from yours.<br>\r\n<br>\r\nShe smiles, nudging your legs appart as she moves the can between them<br>\r\n<br>\r\n\"Mmm, you look cute like that,...now, spread those legs and lift them up, you're not full yet\"<br>\r\n<br>\r\nShe laughs as you try to speak but are far too full, your movemnts making your legs spread for her anyways as you can only imagine what she is about to do next.<br>\r\n<br>\r\nShe presses the tip of the nozzle against your tailhole, using the whipped cream on it as lube to push it into you, depressing the button to trigger it once its in, the jet of cool whipped cream fillin you up.<br>\r\n<br>\r\n\"Mmm, just like a twinkie, full of cream.\"<br>\r\n<br>\r\nYou let out a light whimper at the coolness before feeling your bowels stretching out from the cream. You shivers for a while as you becomes full up with something that really shouldn't be in there.<br>\r\n<br>\r\nAfter a few seconds though you pop of the end of the seemingly never ending dispenser of cream, a small amount escaping from your tail hole as you lays there completely defensesless.<br>\r\n<br>\r\nShe giggles with delight, tossing the can of whipped cream to one side, and picks you up, craddling you in her arms as she nuzzles you<br>\r\n<br>\r\n\"Mmm, you look so yummy\" She licks her lips, grinning.<br>\r\n<br>\r\n<br>\r\n\"Best shrink you first though\" She says and raises you up, opening her mouth as she guides you to it.<br>\r\n<br>\r\nAs you are lifted up you are squeezed gently, cream oozes out from you. You can hardly do anything to complain about being eaten by this sexy woman as she did take good care of you beforehand, that and you can't speak. You look on, swinging from side to side as her open maw awaits you*<br>\r\n<br>\r\nShe slowly lowers you, feet first, into her mouth, churrring softly as her tongue slips up your legs, brushing between them and up over your crotch as she guides you in, swallowing slightly as her throat opens up, letting you begin to enter.<br>\r\n<br>\r\nYou churrs softly, the warmth welcome as you slowly slide over that tongue of hers, feet wiggle as they slide into the back of her throat, the muscles tickling your little tootsies like no ones business.<br>\r\n<br>\r\nYour hips passing over her tongue and down her throat illicit a soft moan of dubious pleasure from her, her tongue wrapping around your chest, and flicking up to carress your cheek gently. She shifts about, straightening her throat more so you slide down easier, letting go as gravity and her throat muscles take over, pulling you inside.<br>\r\n<br>\r\nShe moans as you slip down further, rubbing the bulge in her stomach as you settle in there. She leans back on the rock where she had straddled you previously, smiling softly as she picks up the can of whipped cream, shooting some into her mouth and swallowing*<br>\r\n<br>\r\n\"Mmm,, where's the cream filling indeed\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1110862800,
            "id":240154,
            "title":"Fat on a succubus' thighs"
        },
        "1211111":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "content":"<div class=\"\"><div> <span>You splash down inside her stomach, bobbing around in the liquid until the cream hits you and  forms an island of cream in her belly, awaiting her stomach's actions as you lay there in a comatose state.<br>\r\n<br>\r\nShe burps softly and giggles before taking a small nap, feeling her body slowly break you down, the bulge in her stomach lessening as she slowly processes you through. A few hours later, she gets up, wincing a bit, and heads off away from her rock.<br>\r\n<br>\r\nShe hurriedly squats down, relaxing as she lets out a low moan of relief, feeling the pressure inside her lessen as a combo of some remains of you and a bit of whipped cream slip from her.  <br>\r\n<br>\r\nChurring a bit, unaware of one of her fingers slipping between her legs to rub across her slit, she reminisces about your taste, and the feeling of your cream-filled body slipping into her throat.</span></div></div>",
            "created":1110926460,
            "id":310458,
            "title":"She wishes she could have that again"
        },
        "12112":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "choices":[
                "She lets you go",
                "She decides to keep you"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n\"Well you could let me go miss\" You say with all the charm you can muster, a sweet smile on your face.\"Not that the present situation is all too bad, you are quite beautiful and all but I'm not into casual sex..well not usually\" You say, blushing a little.<br>\r\n<br>\r\n\"Scared of something bad coming out of the woods to get you my little skunk?\" She says, rolling the s like a snake as she strokes a finger down around your side. \"You don't need to worry about them because I'm already here. Now relax of you'll be horrible to digest afterwards\"<br>\r\n<br>\r\n\"Digest? Erm..no thanks\" You say, beginning to wriggle out from beneath her. Her hands hold you down, pressing forcefully on your chest as she grinds her hips against yours. The juices seem to make your member tingle, numbing it and also making it hot at the same time.<br>\r\n<br>\r\nYou cant pay attention all too well but then you notice a piece of black string hanging around her neck. Your mind flashes back to the trinket you picked up.<br>\r\n\"How about a trade then?\"<br>\r\n<br>\r\n\"A trade? What would you have that you could trade with me little man...well not so little in one area\" She giggles.<br>\r\n<br>\r\n\"Your necklace. I found the part that attaches to it before you found me. I'll trade it for my life. Deal?\" You say to her, your paws stroking up along her sides, reaching back down to cup her backside and pull her down towards you.\"<br>\r\n<br>\r\nThe mere mention of the fact you found it puts her guard down, so much so that when you pull her forwards, she topples over. Her lips find yours as you roll her over onto her back, her magic having taken full effect on you now as your hips seem to meld with hers.<br>\r\n<br>\r\nA blissful embrace,<br>\r\nthe love making passionate.<br>\r\nYou don't pull out.<br>\r\n<br>\r\nThe two of you cuddle after that little foray into sin, falling asleep in each others embrace. Come morning you find her combing her hair. You get up and walk on over to her and give her a hug.<br>\r\n<br>\r\nShe giggles, slightly taken aback by the affection from the skunk and turns around to give you a quick belly scritch. You promptly show her the trinket you found and she claps with glee before taking it from you.<br>\r\n<br>\r\n\"So am I free to go then?\"<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1143988500,
            "id":310171,
            "title":"Because she's worth it"
        },
        "122":{
            "author_id":"nixs",
            "author_name":"Nixs",
            "content":"<div class=\"\"><div> <span>The tune sounds familiar to you. You know you had heard it recently but couldn't remember exactly where. You clkeared your throat as you stood your ground for a moment.<br>\r\n<br>\r\nYou whistle back in the darkness. Silence. You whistle again and hear footsteps coming towards you. You step back to the middle of the road as their pace quickens and just as you are about to turn and run you see a duo of prison guards. The take one look at you and train their weapons on you.<br>\r\n<br>\r\n\"Awww fuck!\" You say as you see them. Cursing your luck as you lift your hands. A pointed gun is a nice incentive to stop you from running afterall. They're gentle with you as they put the handcuffs.<br>\r\n<br>\r\n\"Congratulations buddy. This is the furthest anyone's got. Unlucky though. At least you got to enjoy freedom for a bit....\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1143938940,
            "id":310166,
            "title":"Busted!"
        }
    },
    "info":{
        "author_id":"nixs",
        "author_name":"Nixs",
        "brief_description":"Can you make it through the Forest of Deceit? Use your wits to make it through.",
        "created":1110509820,
        "description":"<td align=\"left\" class=\"norm\">Until just recently you were a 'guest' at the highest security prison the country had to offer. Razor wire fences, watch towers and high stone walls were your constant companions. <br>\r\n<br>\r\nHaving just escaped from the prison you made a mad dash to the forest before the guards could reach you.<br>\r\n<br>\r\n<br>\r\n\"Fuck that\" One of the guards chasing you says as he sees you disapear into the undergrowth.<br>\r\n<br>\r\n\"I hear you man. I dont want to die either. Good luck in there. He's going to need it\"<br>\r\n<br>\r\nThe two laugh on as they turn around. You watch them walk of and the spotlights search back along the forests edge. You can't go back, only forward... into the Forest of Deceit.<br>\r\n<br>\r\n****************************************************<br>\r\n<br>\r\nPremise is simple. Try and make it through the forest. How you do this is up to you.<br>\r\n<br>\r\nTry and keep it akin to how the story is and please at least try and write so people can read it. Feel free to add a gay or a herm angle if you want, I don't mind. No fur bashing please. We all have kinks so why be a hypocrite?<br>\r\n<br>\r\nTis a work in progress obviously :)<br>\r\n<br>\r\n<br>\r\nOhh and have fun ;)<br>\r\n</td>",
        "id":947998,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1466586480,
        "modified":1466586480,
        "pretty_title":"The Forest of Deceit"
    }
}