{
    "chapters":{
        "1":{
            "author_id":"nero43",
            "author_name":"Nero",
            "choices":[
                "Shrinking",
                "Giantess"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To begin with, what kind of story would you like?</span></div></span></div>",
            "created":1379134800,
            "id":1663140,
            "title":"At the Beginning."
        },
        "11":{
            "author_id":"nero43",
            "author_name":"Nero",
            "choices":[
                "Kristen Bell herself?",
                "The P.I. Veronica Mars?",
                "Or perhaps the playful and sadictive Elle Bishop from Heroes?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Since this is all about Kristen, let's add a couple of her Characters into this.<br>\r\nWhich version of Kristen Bell makes you hers?</span></div></span></div>",
            "created":1379134800,
            "id":1663141,
            "title":"Which Kristen Shrinks you?"
        },
        "111":{
            "author_id":"spider2624",
            "author_name":"Spider2624",
            "choices":[
                "1",
                "3",
                "5"
            ],
            "content":"<div class=\"\"><div> <span>You happened to be doing an internship around the Disney Studio’s. As you walked around you ended up stumbling into the set for Frozen 2! Walking around backstage for a bit you found yourself snooping toward the Trailers for the voice actors. Just as you walk out toward them, Kristen Bell steps out of hers and makes eye contact with you. “Hey, are you lost buddy?” she says with her beautiful smile. “uhh, no, sorry I was just wandering around, I’ll leave.” Kristen looks at you with a concerned face, “It’s ok come here for a sec I have something to show you!” Confused, you walk over to her trailer and she lets you in, all with a big smile on her face, shes so friendly! Kristen asks, “so nobody know’s your over here?”<br>\r\nYou respond with a simple “No M’am I was just looking around.” Kristen smiles again and then utters out, “mmmmmm, perfect.” She sits you down and then reaches into her desk for some device that you can’t recognize. She turns and looks at you asking, “1,3, or 5?” confused you let out the first thing that comes to mind.</span></div></div>",
            "created":1573151040,
            "id":2743572,
            "title":"Kristen Bell herself?"
        },
        "1112":{
            "author_id":"spider2624",
            "author_name":"Spider2624",
            "choices":[
                "Toy",
                "Lunch"
            ],
            "content":"<div class=\"\"><div> <span>“Perfect! 3 inches it is!” she says, pointing the device at you and pressing the button there is a large flash and a buzzing noise. you close your eyes in fear and when you open them you notice Kristen’s perfect body towering over you. You sit in fear as she reaches down and wraps her warm fingers around you, pulling your tiny figure up to her face. she smiles and exhales deeply, her warm breath giving you the chills as it washes over you. “How do you like it?” she asks. still unaware as to what exactly happened you stammer out nothing but mumbles. Noticing you struggling she just goes ahead and answers your questions for you. “You’re gonna be my new toy!” she says happily, “I shrunk you down to 3 Inches, like you asked for and now I get to play with you forever!” You think your dreaming, there is no way that this is reality. suddenly there is a knock on the door, Kristen panicks, “crap, where can I put you” she says under her breath, suddenly she just tosses you into her mouth like a piece of candy as the door opens. you land onto her warm, wet tongue face first as she licks you all over and moves you around her mouth. The smell inside is incredible, smelling surprisingly good, almost like strawberry as you are coated in her thick saliva. Whoever was outside has started talking to Kristen, she just answers very quickly with short responses trying to not giveaway the fact that you are sitting inside her cheek in a puddle of her spit. The person ends up leaving as you hear the door close, her tongue moves around, picking you up and bringing you to the front of her mouth where you feel her fingers grab you and pull you out between her soft, warm lips. a long, thick trail of saliva drips off of you as you are pulled out and brought to her eyes. “that was close,” she says “but in all honesty, you tasted pretty good.” a shiver goes up your spine as she said those words. “Don’t worry, I don’t think i’ll ever be greedy enough to fully eat you, but you might be spending a lot of time in my mouth.” You start crying instinctively out of fear and dread. She looks at you with sadness and gives you a big warm kiss as her soft lips press against your whole body, “no, no don’t cry, its okay i’ll be super gentle, you can just live in my mouth, its really soft and warm!” “no this is bullshit!” you yell, “what did I do wrong why me!” Kristen looks at you frowning now, “hey your lucky im being patient with you, otherwise maybe i’ll just swallow you whole.” she says lifting you up over her head, she opens her mouth wide and says “ahhhhhhhhh.” you smell her hot breath again as she lowers you closer and closer, you try to wiggle free but can’t. All you can do is stare into her wet, pink, throat. Kristen pulls you to the outside of her throat and presses you against it as she gulps loudly. a small bulge in her throat against you as it moves down. She brings you to her face again and says, “next time, thats you going into my gut if you aren’t careful.” you look into her eyes, terrified. “Now that you understand your choices,” she continues, “What will it be, My toy, or my lunch?”</span></div></div>",
            "created":1573153020,
            "id":2743583,
            "title":"3"
        },
        "11122":{
            "author_id":"spider2624",
            "author_name":"Spider2624",
            "content":"<div class=\"\"><div> <span>“No way! I’m not going to be either this is bullshit!” you yell. Kristen looks at you sternly and then says, “well, if you aren’t going to behave then you know where you’re headed,” she says while rubbing her stomach. “you’re bluffing, theres no way you eat me.” Kristen doesn’t say anything, she just smiles and suddenly her grip gets a bit tighter as she brings me to her mouth and licks me. Her huge wet tongue slides all over me as she just slobbers on me. I try to wiggle and move but she just keeps going, her tongue pressing against my body as it is bigger than I am. Lick after Lick her soft tongue continues to press against me, my clothes completely soaked in her saliva as she begins to suck on me like a popsicle. Shoving me headfirst into her mouth letting her tongue cover every spot on my body and slowly sliding me back out sucking off the excess spit from me. she moans slightly as she licks me forcefully again, her tongue so warm and soft I almost begin to enjoy it as it slides over me. Kristen pulls me away from her face to look me up and down, “I’m gonna enjoy this” she says with a big smile and with that Kristen holds me up over her head and slowly lowers me into her mouth. Her tongue extends out to catch me as i look directly down her throat. Kristen drops me on her tongue and curls it around me as she pulls me into her mouth and shuts it. Closed in darkness again I get ragdolled around by her tongue and finally her head tilts back and I slide toward her throat along with a pool of slobber. i try to grab on to something but I’m so soaked in her spit I slip off everything. Feet first I slide into her throat and her tongue presses me further inside as she loudly gulps trying to force me down. halfway in her throat all I can see is her slimy tongue as it presses into my face one last time, shoving me deeper into her throat while simultaneously swallowing and I am squeezed down the tight tube that is her throat. slowly massaged deeper into her body, I hear her outside as she sighs and moans in pleasure as she traces me going down her throat. after a few seconds I begin to squeeze out into her stomach. Little by little I spill out into her gut filled with her breakfast, I look around at the stomach walls moving around me. Kristen pats her tummy and says “enjoy your new home buddy!” I roll around for a little bit and decide to accept that this is where i’m staying, I close my eyes covered in spit and old food of Kristen Bell and realize that I am her snack. I lay in the dark stomach and hear a loud belch from Kristen as my surroundings shake. <br>\r\nI am Kristen Bell’s little snack, as I happily sit in her tummy.</span></div></div>",
            "created":1573154580,
            "id":2743588,
            "title":"Lunch"
        },
        "112":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "6 Inches",
                "3 Inches",
                "1 Inch"
            ],
            "content":"<div class=\"\"><div> <span>As you enter the P.I.'s office you feel something go up your spine, you shrug it off hoping it was nothing bad. <br>\r\n<br>\r\nVeronica walked out of her office and saw you and smiled. <br>\r\n<br>\r\n\"Hi Aaron.\" She said. <br>\r\n<br>\r\nYou were speechless as you saw Veronica, she was the most beautiful you ever saw.<br>\r\n<br>\r\n\"H-h-h-h-h-hi.\" You stutter. <br>\r\n<br>\r\n\"Something wrong?\" She asked.<br>\r\n<br>\r\n\"N-n-n-n-n-n-n-n-nothings wrong.\" You stutter again. \"Why did you want to see me?\"<br>\r\n<br>\r\n\"I was wondering if you could help me with something?\" She asks. <br>\r\n<br>\r\n\"Sure,\" You said. <br>\r\n<br>\r\n\"I found this strange device in a guys lab when I busted him.\" She said. \"I was hoping you could take a look at it, I heard from someone that you were good with technology.\" <br>\r\n<br>\r\n\"Yeah I am,\" You said. \"I'll have a look.\"<br>\r\n<br>\r\nVeronica hands you the device and you start to study it. It was the strangest thing you have ever seen, it has wires sticking out of the side and strange lights sticking out the side, it looked like was wasn't even finished. <br>\r\n<br>\r\n\"What can you make of it?\" She asks.<br>\r\n<br>\r\n\"It looks like it isn't finished,\" You said. \"A few wires need the be connected before it can work.\"<br>\r\n<br>\r\n\"Can you wire it up so we can see what it does? Veronica asked.<br>\r\n<br>\r\n\"I don't know,\" You said. \"It looks like it could be dangerous.\"<br>\r\n<br>\r\n\"Please,\" Veronica said. <br>\r\n<br>\r\n\"Alright.\" You said. <br>\r\n<br>\r\nYou conect the wires and the device lights up. <br>\r\n<br>\r\n\"It's ready.\" You said. <br>\r\n<br>\r\n\"Great.\" Veronica said grabbing the device. <br>\r\n<br>\r\n\"What are you doing?\" You asked.<br>\r\n<br>\r\n\"Testing it.\" She said. \"Now stand out of the way before I hit you.\"<br>\r\n<br>\r\nBefore you could say anything Veronica shot the device at you and you body went into shock, you had no idea what was happening. You felt your clothes getting bigger. You look up at Veronica and she was shocked, she didn't know what she had done. Veronica started tower over you as you shrink.<br>\r\n<br>\r\n\"What's happening to me?\" You cried. <br>\r\n<br>\r\n\"I don't know.\" Veronica said. <br>\r\n<br>\r\n<br>\r\nHow tall are you?</span></div></div>",
            "created":1453093200,
            "id":2090820,
            "title":"The Device"
        },
        "1121":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "\"You can keep me\"",
                "\"Change me back\"",
                "\"I don't know\""
            ],
            "content":"<div class=\"\"><div> <span>You throw your giant clothes of your body at look up at the giantess. She was beautiful and you were left speechless. <br>\r\n<br>\r\n\"Holy shit.\" Veronica said. <br>\r\n<br>\r\n\"Help me,\" You said.<br>\r\n<br>\r\nVeronica bent down and wrapped her giant fingers around your tiny body. You shiver as her fingers touch your bare skin. She raises you in the air and holds you by her face. <br>\r\n<br>\r\n\"Your the size of a doll,\" Veronica said. <br>\r\n<br>\r\nHer warm breath hit your chest and you got goosebumps. <br>\r\n<br>\r\n\"Veronica please,\" You beg. \"You need to help me.\" <br>\r\n<br>\r\nVeronica placed her giant finger on your head and started to stoke your hair. <br>\r\n<br>\r\n\"Your so cute,\" Veronica said. <br>\r\n<br>\r\n\"Thanks,\" You blush, <br>\r\n<br>\r\n\"I just want to keep you all to myself.\" Veronica said. <br>\r\n<br>\r\n\"Veronica please help me.\" You said. \"This is serious,\" <br>\r\n<br>\r\n\"I know I should be taking this more serious,\" Veronica said. <br>\r\n<br>\r\nVeronica walked over to her desk and sat down on her chair. Veronica placed you on her desk. <br>\r\n<br>\r\n\"I'm going through a bad time and I just want to have someone there.\" She said. <br>\r\n<br>\r\n\"I'm sorry.\" You said.<br>\r\n<br>\r\n\"Just say what you want to do and I will do it.\" Veronica said.<br>\r\n<br>\r\nYou sigh and look up at the giantess. What did you say Veronica?</span></div></div>",
            "created":1457735520,
            "id":2116041,
            "title":"6 Inches Tall"
        },
        "11212":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "Someone Walks in",
                "Veronica finishes her work"
            ],
            "content":"<div class=\"\"><div> <span>\"You have to change me back.\" You say. \"I can't live like this.\" <br>\r\n<br>\r\nVeronica sighs and gives you a sad look.<br>\r\n<br>\r\n\"Too bad Barbie.\" She says. \"You are in my office and you will listen to me. You are going to be my new pet whether you like it or not.\"<br>\r\n<br>\r\n\"You can't...\" You cry.<br>\r\n<br>\r\n\"And why not.\" She cuts you off. \"What will you do? Kick my ass? Call the police? You can't do anything to me because if you haven't realised you are only six inches tall.\"<br>\r\n<br>\r\nYour mouth goes dry as you realise how right she is. You could yell and scream all you want no one will take you seriously. A single tear runs down your check. Veronica wips the tear off you check with her giant finger and leans in.<br>\r\n<br>\r\n\"Don't worry little man,\" she whispers. \"I'll take good care of you.\"<br>\r\n<br>\r\nVeronica kisses your face and you couldn't help but smile.<br>\r\n<br>\r\n\"You're so cute.\" She says. \"But first we need to set some rules.\"<br>\r\n<br>\r\n\"Okay.\" You said looking up at the giant beautiful goddess.<br>\r\n<br>\r\n\"You are my pet so you can only answer to me and only me. You shall address me as goddess, giantess or sexy do I make myself clear?\"<br>\r\n<br>\r\n\"Yes goddess.\" You say.<br>\r\n<br>\r\n\"Good boy.\" She says. \"I know you won't let me down.\"<br>\r\n<br>\r\nYou are scared out of your mind but you are glad that Veronica is keeping you safe.<br>\r\n<br>\r\n\"Now keep quiet while I finish my work.\" Veronica says.<br>\r\n<br>\r\nVeronica picks you up and places you on top of a stack of papers. She gives you a smile and carries on with her work. You sigh and stare at the blonde goddess. <br>\r\n<br>\r\nWhat happens next</span></div></div>",
            "created":1459645740,
            "id":2126777,
            "title":"New Pet"
        },
        "112121":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "Take you out",
                "Leave you in there"
            ],
            "content":"<div class=\"\"><div> <span>There was a knock at the door and Veronica jumps up in fright.<br>\r\n<br>\r\n\"Give me a minute.\" Veronica says as she wraps her giant fingers around you.<br>\r\n<br>\r\nVeronica brings you to her face and gives you a confused look.<br>\r\n<br>\r\n\"Where am I going to put you.\" Veronica says.<br>\r\n<br>\r\nVeronica looks down and gives you a smile. <br>\r\n<br>\r\n\"I've got the perfect place.\" Veronica says.<br>\r\n<br>\r\nVeronica brings you behind her back and she grabs the waist band of her pants and panties. You look down and get and erection as soon as you see her soft peach ass. Veronica let's you go and you slide down her black panties. You land face first into her cheek and quickly pull yourself back. You look up and see the back of Veronica's head with her long blonde hair hanging past her shoulders. She let's go of the waist band and you are forced into her cheek. <br>\r\n<br>\r\n\"I want you to please me while I talk to this person.\" Veronica says as she presses you into her cheek more. \"Come in.\"<br>\r\n<br>\r\nYou hear the door open but after that you can't hear anything after that. The amount of flesh on you is making it impossible for you to hear. You do what Veronica asks so you don't get on her bad side. You try to rub her cheek with her hands but it was a struggle to move. You put some of the flesh in your mouth and begin to suck on it. You hear a soft moan from Veronica as you carry on. You turn your head to the side and see crack right next to you. You try to move over to it but Veronica sits down and traps you on her cheek. You try to move but Veronica rolls you around in her ass. This was a strange feeling for you because she was hurting you and at the same time it felt great. Being in her ass is turning you on. You feel Veronica stand up and assume that the person has left. <br>\r\n<br>\r\nWhat does Veronica do?</span></div></div>",
            "created":1459651260,
            "id":2126823,
            "title":"Someone Walks in"
        },
        "1121211":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "Veronica goes home",
                "Veronica keeps working"
            ],
            "content":"<div class=\"\"><div> <span>You feel Veronica pull the waist band of her pants and panties away. You are still stuck on her cheek and you feel a light breaze on your back. Veronica wraps her giant fingers around you and peel you off her cheek. She placed you on her desk in front of her and sat down. She leaned in and smiled. <br>\r\n<br>\r\n\"You did a great job.\" She says.<br>\r\n<br>\r\n\"Thanks,\" you smile. <br>\r\n<br>\r\n\"How would you like me to return the favor.\" She smiles.<br>\r\n<br>\r\n\"Um, sure.\" You blush. \"What are you going to do?\"<br>\r\n<br>\r\n\"What do you think genius.\" She says.<br>\r\n<br>\r\nShe blows you a kiss And you get goosebumps from her warm breath. Veronica wraps her fingers around you and raises you in the air. She grabs your foot and slips off your shoe. She grabs your other shoe and slips it off. She slips you socks off and drops them beside her. She slides your shorts off and places them beside her. She places you back on her desk and smiles. A huge smile creeps on her face as she sees your erection through your underwear. She places her giant finger on your crotch and slides your underwear down your legs.<br>\r\n<br>\r\n\"Its so tiny.\" She laughed.<br>\r\n<br>\r\nYou turn red of embarrassment and look down. This is the first time you have exposed yourself to a woman. <br>\r\n<br>\r\n\"But it looks like it would be huge if you were normal sized.\" Veronica says trying to apologize.<br>\r\n<br>\r\n\"Thanks,\" you sigh.<br>\r\n<br>\r\n\"I'm sorry,\" Veronica says. \"I didn't mean to upset you it just slipped out.\" <br>\r\n<br>\r\n\"I know,\" you sigh.<br>\r\n<br>\r\n\"Don't worry,\" she says. \"I bet it tastes great.\"<br>\r\n<br>\r\nBoth you and Veronica smile. Veronica leans in and you can feel her warm breath on your body. You quickly throw your shirt off and lean back. You couldn't beleive you were going to get a blow job. Veronica kisses your thy and you shiver. Veronica slowly makes her way up to your crouch and you place your hands on her forehead. Your erection swells up and Veronica slips it in her mouth. You moan as she begins to suck on your penis. It doesn't take you long before you to orgasim and Veronica slides her tongue over your penis. She pulls back and smiles. You lay back on the desk and try to catch tour breath back. <br>\r\n<br>\r\n\"I was right.\" She said. \"Your penis tastes great.\"<br>\r\n<br>\r\n\"Thanks goddess.\" You smile.<br>\r\n<br>\r\n\"How did you like that.\" She says.<br>\r\n<br>\r\n\"That was amazing.\" You say.<br>\r\n<br>\r\n\"I'm glad you liked it.\" She says.<br>\r\n<br>\r\nWhat happens now...</span></div></div>",
            "created":1459663860,
            "id":2126908,
            "title":"A little fun"
        },
        "11212111":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "Alone",
                "With someone"
            ],
            "content":"<div class=\"\"><div> <span>Veronica looks down and smiles at you. <br>\r\n<br>\r\n\"Let's go home.\" She says.<br>\r\n<br>\r\nVeronica picks up your clothes and places them in the rubbish bin.<br>\r\n<br>\r\n\"What are you doing?\" You cry.<br>\r\n<br>\r\n\"Have you ever seen pets with clothes on?\" She says.<br>\r\n<br>\r\n\"No, but.....\"<br>\r\n<br>\r\n\"Exactly.\" She intrupts.<br>\r\n<br>\r\nVeronica picks up her bag and places it next to you. She unzips it and wraps her fingers around you. You get goosebumps as her fingers touch your bare skin. She lifts you up and places you in her bag. You try to stand up but you keep falling over her nail polish and lipstick tubes. <br>\r\n<br>\r\n\"Stop squirming and you will stop falling over.\" She says. <br>\r\n<br>\r\nYou sit down on the bottom of the bag. Veronica zips the bag up with a giggle. She throws the bag over her shoulder and you are sent flying into the other side of the bag. The lipstick tune hits you in the back and you fall over in pain. You lay there rubbing your back hoping nothing could get worse. <br>\r\n<br>\r\nAfter a few minutes of walking you hear Veronica unlock her car. She throws the bag on the passenger seat and you land on her phone. You roll around in pain. Veronica's phone lights up with a loud noise that is almost deafening at your size. Veronica unzips the bag and reaches in for her phone. She picks you up out of the bag along with the phone. Veronica gives you a smile as she places you back in the bag. You sit there in silence waiting for Veronica. <br>\r\n<br>\r\n\"Let's go.\" She say dropping Ber phone in her bag.<br>\r\n<br>\r\nYou dive out of the way as it nearly misses you. You lay down on the bottom of the bag trying to calm down from the shock. Veronica turns the car on and drives home. <br>\r\n<br>\r\nAfter the drive Veronica stops the car and lifts up her bag. She throws the bag over her shoulder and her phone lands on top of you. You shove her phone of you and try to pull yourself away from it but you end up hitting your head on the lipstick tube. You sigh and grab your head.<br>\r\n<br>\r\nVeronica walks inside and places the bag on the bench. She reaches into the bag and wraps her giant fingers around you. She brings you up to her face with a smile. <br>\r\n<br>\r\n\"How did you like the trip?\" She asks.<br>\r\n<br>\r\n\"Terrible.\" You says.<br>\r\n<br>\r\n\"Poor Barbie.\" She says. <br>\r\n<br>\r\n\"Don't call me that.\" You says.<br>\r\n<br>\r\n\"I can call you what ever I want Barbie.\" She teases. <br>\r\n<br>\r\nVeronica places you in her bag and walks off. You stay quiet and hear her open the hallway cupboard. She pulls something out and places it on the bench next to the bag.<br>\r\n<br>\r\n\"I'm glad I've still got this.\" She says pulling you out of her bag.<br>\r\n<br>\r\nYou look down and see a small cage. A cage that looks like it has been used for mice.<br>\r\n<br>\r\n\"Your new home.\" Veronica says. <br>\r\n<br>\r\nVeronica lifts the roof of the cage and and places you inside. You look around and realise that the only thing in here is a sheet of old newspaper. The cage isn't even that big. It pretty much the size of a shoe box. Veronica locks the cage shut and kneels down in front of you.<br>\r\n<br>\r\n\"I am going out with some friends so I want be back until later.\" She says. \"Have fun.\"<br>\r\n<br>\r\nBefore you can say anything Veronica picks up her bag and head out the door. You lye down on the bottomof the cage and try to get some sleep.<br>\r\n<br>\r\nYou are woken up by the sound of the door being unlock. Veronica walks in and she is....</span></div></div>",
            "created":1459682580,
            "id":2126993,
            "title":"Home Time"
        },
        "112121111":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "Have some fun",
                "Go to bed "
            ],
            "content":"<div class=\"\"><div> <span>Veronica staggers inside and she heads over to the bench. She dumps her bag on the floor and sits down on the stool in front of you. You look up at and you know something is wrong. Her eyes are read and you can see her make up in a mess on her face.<br>\r\n<br>\r\n\"What's wrong.\" You ask. <br>\r\n<br>\r\n\"Nothing, I'm fine.\" She lies while removing the make up from her face.<br>\r\n<br>\r\n\"I know something is wrong,\" you say. \"Tell me.\" <br>\r\n<br>\r\n\"I said I'm fine.\" She snapped.<br>\r\n<br>\r\nYou stay quiet and look up at the blonde goddess. Veronica looks down at you and bits her lip. You smile at her and she sighs. She unlocks the cage. She reaches into the cage and you raise your arms in air as she wraps her giant fingers around you. She takes you out of the cage and places the cage on the floor. Veronica places her giant finger on your head and strokes your hair. <br>\r\n<br>\r\n\"I'm sorry I snapped at you.\" Veronica says.<br>\r\n<br>\r\n\"That's alright,\" you say. \"Do you want to talk about it?\"<br>\r\n<br>\r\n\"Sure,\" she sighs. \"My life is one big mess after another. My best friend dies, my fiends leave me, my mother leaves me and most of my boyfriends turn into ass holes.\" <br>\r\n<br>\r\nVeronica drops you on the bench and bursts into tears. <br>\r\n<br>\r\n\"Come here.\" You try say to comfort her. <br>\r\n<br>\r\nVeronica places her head on the bench next to you and keeps crying. You walk over to her and place you hands on her forehead and rub it.<br>\r\n<br>\r\n\"Its alright Veronica,\" you say. \"You have so much things to look forward to later on in life. All the shit is now behind you and it can't get any worse from here. You will find somone in life who was be an ass hole to you, youn deserve better.\" <br>\r\n<br>\r\n\"Thanks Barbie.\" Veronica says. <br>\r\n<br>\r\n\"Its Aaron.\" You say. <br>\r\n<br>\r\n\"Sorry Aaron.\" She says wiping her tears from her eyes. <br>\r\n<br>\r\n\"Your girlfriend is a luckly girl.\" Veronica says.<br>\r\n<br>\r\n\"I don't have a girlfriend.\" You say. \"And I never had one.\"<br>\r\n<br>\r\n\"Bull shit,\" Veronica says sitting up. \"I bet all the girls are wanting you.\"<br>\r\n<br>\r\n\"No,\" you blush. \"I'm very shy when it comes to girls.\" <br>\r\n<br>\r\n\"You are talking to me and I am a girl.\" She says.<br>\r\n<br>\r\n\"You know what I mean,\" you say. \"I have trouble asking girls out.\" <br>\r\n<br>\r\n\"Well to me you are amazing.\" Veronica smiles as she leans in. <br>\r\n<br>\r\nVeronica places her giant pink lips on you face and gives you a kiss. She slowly leans back gives you a smile. Veronica looks down at your crotch and bites her lip. You look down and realise your erection is sticking up in the air.<br>\r\n<br>\r\n<br>\r\nWhat does Veronica do with you.</span></div></div>",
            "created":1459768560,
            "id":2127469,
            "title":"The Talk"
        },
        "1121211112":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "Later that Night",
                "The Next Morning"
            ],
            "content":"<div class=\"\"><div> <span>\"Shall we go to bed?\" Veronica asks. <br>\r\n<br>\r\n\"I'm not really tired.\" You say.<br>\r\n<br>\r\n\"That's not what I mean.\" Veronica giggles.<br>\r\n<br>\r\n\"Oh,\" You say as you put two and two together. \"I'd love to.\"<br>\r\n<br>\r\nVeronica reaches out and wraps her giant fingers around your tiny body. You shiver as Veronica's soft skin makes contact with your skin. She raises you in the air and steps off the stool. Thoughts start going through your head as you two start heading to the bedroom. Veronica walks into the bedroom and places you in the middle of the bed. She leans in and places her face right in front of you.<br>\r\n<br>\r\n\"I think it's only fair for me to take off my clothes,\" She says. \"Don't you?\"<br>\r\n<br>\r\n\"I-I-I-I-I g-guess.\" You stutter. <br>\r\n<br>\r\nVeronica pulls away and stands in front of you. She runs her hands down her stomach and grabs the bottom of her shirt. She pulls her shirt up over her head and drops it on the floor next to her. You smile as you see her nice round breasts being held up by her pink bra. Veronica gives you a smiles and runs her hands across her smooth stomach. She grabs onto her pants and slides them down her legs. She throws her pants to the side and gives you a sexy pose. <br>\r\n<br>\r\n\"You like?\" She asks.<br>\r\n<br>\r\n\"I love,\" You say.<br>\r\n<br>\r\nVeronica unclips her bra and lets it drop to the ground. You instantly get hard as you see the greatest pair of tits you have ever seen in your life. Veronica slips her panties off and you droll as you see her freshly shaven pussy. Veronica was the most beautiful girl you have ever seen. <br>\r\n<br>\r\n\"Let's get started.\" She says. <br>\r\n<br>\r\nVeronica lays down next to you and wraps her giant fingers around you. She places you between her breasts and giggles. You are standing between two mountains of flesh.<br>\r\n<br>\r\n\"Play with them little man.\" She demands.<br>\r\n<br>\r\nYou turn to her left breast and drape yourself over it. You erection stands up more as you can feel the heat of her breast on her body. You run your hands across her breast and slowly make you way up to her nipple. You place you hands on her nipple and it is rock hard. You grab a hold of her nipple and give it a squeeze. You hear her moan and you keep squeezing it. You place you mouth on her nipple and try to bite it. Veronica cries out and grabs other nipple and begins to squeeze it. Veronica stops and wraps her fingers around you. She places you on her face with your penis in her mouth. Your chest is on her nose and you place your hands on her cheeks. You looks down and stare into her beautiful eyes. Her lips tighten around your penis and she begins to suck. You start to moan as Veronica runs her tongue glides over you penis. You cry out and cum in her mouth. You lay there trying to catch breath back and a though crosses your mind. <br>\r\n<br>\r\n\"Use me as a dildo,\" You say. \"I know you want to.\"<br>\r\n<br>\r\nYou feel Veronica smile and she wraps her fingers around you. She raises you in the air and you get a great look over her body. She guides you down her beautiful breasts and past her smooth stomach. She places you between her legs and you get an amazing view of her pussy. You get closer and closer until your head touches her lips. Veronica forces you in and you can feel her whole body shake. You are up to her waist but Veronica wraps her fingers around your legs and starts to force you in and out like a dildo. Juices start to full her pussy and most of it is forced in your mouth. You try to scream but it keeps getting worse, your lungs start to full up and you can't breathe. You want to escape but at the same time you want to please the goddess. Veronica starts to speed up and she starts screaming. As she starts to orgasm she pulls you out of her pussy and drops you between her thys. You hear Veronica try to catch her breath back but all you can think about is your survival. You start coughing and spitting all of the juices out of you. Veronica wraps her fingers around you and places you on her bare stomach. You lay on your back trying to catch her breath back.<br>\r\n<br>\r\n\"That was amazing.\" She says. <br>\r\n<br>\r\nVeronica places her giant finger on your chest and begins to rub in circles. It felt amazing for you.<br>\r\n<br>\r\n\"Thanks,\" You say.<br>\r\n<br>\r\n\"Your welcome.\" She says. <br>\r\n<br>\r\nBoth of you lay there in lay there in silence. <br>\r\n<br>\r\n\"I would love to keep chatting little man but I have work tomorrow.\" Veronica says.<br>\r\n<br>\r\nVeronica wraps her fingers around you and places you on the pillow next to hers. She pulls the covers up to her chest and turns to you. <br>\r\n<br>\r\n\"Goodnight little man.\" She says as she kisses your tiny face.<br>\r\n<br>\r\n\"Goodnight.\" You say.<br>\r\n<br>\r\nVeronica reaches over and turns the light off. You lay there trying to get to sleep. </span></div></div>",
            "created":1460714220,
            "id":2133318,
            "title":"Bedroom Fun"
        },
        "113":{
            "author_id":"iambeowulf",
            "author_name":"iambeowulf",
            "choices":[
                "Ellie",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So, do you wanna do Elle or someone else?</span></div></span></div>",
            "created":1457747880,
            "id":2116120,
            "title":"Elle Bishop or others?"
        },
        "1132":{
            "author_id":"iambeowulf",
            "author_name":"iambeowulf",
            "choices":[
                "Sure! I like Frozen!",
                "Nah, someone else!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Anna from Frozen?</span></div></span></div>",
            "created":1457747940,
            "id":2116121,
            "title":"More choices"
        },
        "11322":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "hell yeah",
                "no thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Sarah Marshal from forgetting Sarah Marshal?</span></div></span></div>",
            "created":1459651440,
            "id":2126825,
            "title":"Nah, someone else!"
        },
        "113222":{
            "author_id":"triplestories",
            "author_name":"Triplestories",
            "choices":[
                "yes please",
                "no thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Leigh London from the lifeguard</span></div></span></div>",
            "created":1459651620,
            "id":2126827,
            "title":"Another choice"
        },
        "12":{
            "author_id":"nero43",
            "author_name":"Nero",
            "choices":[
                "Just Kristen Bell?",
                "Veronica Mars comes looking?",
                "Elle Bishop grows?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kristen Bell grows and comes looking for you!<br>\r\nBut which version of Kristen should that be?</span></div></span></div>",
            "created":1379134800,
            "id":1663143,
            "title":"Giantess Kristen?"
        },
        "121":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "She drops you either in her bra or underwear",
                "Puts you at her feet and makes you massage them ",
                "Simply takes you with her as she goes sightseeing around the world"
            ],
            "content":"<div class=\"\"><div> <span>So you're just walking around on a isolated street of the Big Apple itself when you hear loud BOOM,BOOM,BOOM footsteps and looked up confused to see a massive woman,a very pretty woman around 50 or 60 feet of height staring down at you at first you have no idea who she is then it is only when she speaks that you realize who she is \"Hey there cutie I've been looking all over for you and finally I've found you at last!\" You shaking with fear didn't like what she just said or why a famous sexy actress like Kristen Bell who somehow grew to a titanic size would be looking for you of all people but you knew you weren't about to stick around to see what she might do to you so you started to run in the opposite direction and of course Kristen getting a annoyed look on her face immediately began to slowly follow you,her every footsteps caused a minor tremor that shook everything within a 5 mile radius \"Hey get back here I didn't say you could leave we're not done yet!\" You managed to yell back as you ran dodging falling debris as she carelessly trampled cars and brushed aside apartment buildings with her hands \"Lady I don't even know you!\" But she didn't reply to this only continued to playfully stomp after you while you were soon running out of breath and room as she had you cornered literally in a back-alley way of all places Kristen smiled happily as she bent down \"You gave me quite the run around little guy but now its time for some fun.....\" As she gently grabbed hold of you you tried to break her tight grip but couldn't muster the strength to do so she slowly brought you up to her huge billboard sized face fearfully asking \"What are you going to do to me?\" The giantess merely smiled \"Don't be scared no harm will come to you I only want to have a little fun with a adorable tiny like yourself now what shall we do first?\" She ponders outloud </span></div></div>",
            "created":1460497020,
            "id":2131958,
            "title":"Just Kristen Bell?"
        }
    },
    "info":{
        "author_id":"nero43",
        "author_name":"Nero",
        "brief_description":"Kristen Bell shrinks you down and keeps you as her Pet.",
        "created":1379212620,
        "description":"<td align=\"left\" class=\"norm\">I have been reading and adding to Interactives here for years now and have yet to see any GTS Interactive with the lovely Kristen Bell in it.<br>\r\nSo I decided to start my own Interactive about her.<br>\r\n<br>\r\nThis interactive will be pretty specific so I'd prefer only the following added to it, anything else will be removed:<br>\r\n- nothing toilet related,<br>\r\n- Only Soft Vore, no other Vore of any kind. Soft Vore highly encouraged/<br>\r\n- No Male Giants and no making the Main Character normal sized.<br>\r\n- Feet related stuff is fine<br>\r\n- No unbirthing or anything like that. Maily just Vore and Feet stuff.<br>\r\n- Other Female Celebrities can be added, but Aaron really belongs to Kristen.<br>\r\n<br>\r\nThe Main Character of this story is:<br>\r\n<br>\r\nAaron O'Connell<br>\r\n26 Years Old<br>\r\nShort Brown Hair<br>\r\nBlue Eyes<br>\r\nMedium Build<br>\r\n<br>\r\n75GPs rewarded for any reviews!!</td>",
        "id":1953005,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1573154580,
        "modified":1573154580,
        "pretty_title":"Shrunk down by Kristen Bell"
    }
}