{
    "chapters":{
        "1":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "Christina",
                "Shylee",
                "Savanna",
                "Briann"
            ],
            "content":"<div class=\"\"><div> <span>Christina- she is 2 and a half and weights 70lbs. she eats as much as she can and loves her belly. The weight is spread all over her but most goes to her belly<br>\r\n<br>\r\nShylee- she is also 2 and a half and weights 69 pounds- she will scream and yell if she does not get food. eats till she is full but does not take long for her to get hungry again.<br>\r\n<br>\r\nSavanna- she is 4 and weights 104lbs-  if she is not allowed food then she will take it and hide- loves to see how much she can eat.<br>\r\n<br>\r\nBriann- she is 15 months and weights 55lbs- on this one the mother feeds her whatever she wants so there is no chose of wether or not she is allowed. sometimes mom feeds her even when she is full and likes to she off her daughts belly.<br>\r\n<br>\r\nNow you can pick a girl and after that pich wether the mom wants her to be fatter or does not care how much she weights biut is not trying to make her fatter</span></div></div>",
            "created":1281243600,
            "id":932429,
            "title":"The girls"
        },
        "11":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "Wants hher fatter",
                "does not care"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does the parents want to make her fatter or just dont care?</span></div></span></div>",
            "created":1281243600,
            "id":932430,
            "title":"Christina"
        },
        "111":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "waffels",
                "pancakes",
                "Cakes?"
            ],
            "content":"<div class=\"\"><div> <span>\"Wake up  my fat bellied daughter\" said Christinas mom (Mabel<br>\r\n<br>\r\n\"Hey mommy, breakfast\" asked Chrstina<br>\r\n<br>\r\n\"Yes there food down stairs\" said Mabel<br>\r\n<br>\r\nchristina was not obsesed with food. she could go with out it for a while, it was her mom that fed her so much. But the girl even if she was not hungry she would eat, for two reasons.<br>\r\n<br>\r\nFirst, she knew her mom was proud of her and wanted her to be even bigger<br>\r\n<br>\r\nSecond, she liked being fat and loved to play with a full tummy.<br>\r\n<br>\r\nSo any time she was offered food she would take it without even knowing what it was. if she was not offered food then she could wait for a while without it but if it got longer than 5 hours then she would start to get mad.<br>\r\n<br>\r\n\"Eat as much a you can\" said Mabel<br>\r\n<br>\r\n\"Dont worry mommy, this will all be in my fat tummy\" siad Christina patting her big belly<br>\r\n<br>\r\nShe sat down and started to eat her first plate of...</span></div></div>",
            "created":1281330000,
            "id":932908,
            "title":"Wants hher fatter"
        },
        "1112":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "try to finish",
                "tell her mom its to much",
                "somethin else"
            ],
            "content":"<div class=\"\"><div> <span>Pancakes. there were a stack of 8 drinched in syrup and butter. They looked like they would tip over but after 15 minutes they were gone. and Christina started on her second plate. her belly was a little bigger because of the first round and after she was hlaf way through the second she started to feel pretty full but she wanted to finish them. she liked the feeling of have such a full belly, it made it feel even bigger.<br>\r\n<br>\r\n\"Come on honey,  hurry up\" said Mabel<br>\r\n<br>\r\n\"I am, im just taking a second to feel how big my belly is getting\" said Christina rubbing her belly which she lifted up her shirt so her mom could see<br>\r\n<br>\r\nWould ypu like me to rub it while you eat\" aske dher mom<br>\r\n<br>\r\nSure\" said christina with a smile<br>\r\n<br>\r\nShe loved to have her belly rubbed expasaly when she was being stuffed. afetr 20 more minutes she finished.<br>\r\nBut when her mom saw this she got up and made another plate and put it in front of christina. This one had 10 instead of 8. She did not think she could eat it but did not want to say any thing because she wants to make her mother proud but her belly was now so big and full that it pushed up her shirt and strained the alastic and her pants.<br>\r\n<br>\r\nWhat sould she do</span></div></div>",
            "created":1281330000,
            "id":933211,
            "title":"pancakes"
        },
        "11121":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "she can",
                "she cant"
            ],
            "content":"<div class=\"\"><div> <span>\"well, i guess I can at least eat some of it\" thought Christina<br>\r\n<br>\r\nMabel came over and started to rub her gorged daughters tummy. It was warm and smooth. She could tell she was full&gt;<br>\r\nChristina just kept forcing the food down her own throat. Her belly hurt a little more with each bite but she wanted to make her mom proud and if she finished she would be pretty proud of herself to.<br>\r\n<br>\r\n\"Your doing such a good job\" said Mabel looking at Christina with a smile<br>\r\n<br>\r\nChristina did not respond, she was to focused.<br>\r\nFinaly and hour later the sene is # empty plates on a table,  and a very fat stuffed little girl with her mother rubbing her huge exposed tummy. Mabel had never seen such a huge belly before on such a young girl.<br>\r\n<br>\r\n\"Want to go to the couch\" asked Mabel nicely<br>\r\n<br>\r\n\"I dont think I can walk, so stuffed\" said chirstina<br>\r\n<br>\r\nWell lets try</span></div></div>",
            "created":1281502800,
            "id":934174,
            "title":"fattest baby belly ever"
        },
        "111211":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "she has a dream",
                "skip to waking up and get fed"
            ],
            "content":"<div class=\"\"><div> <span>She stood up and took a couple steps in a waddle form. she started to breath harder because of the great pressure in her filled to the brim tummy. every step she took towards the couch you could hear her belly sloshing from all the food and drink already digesting. Mabel could not have been happyer. she was helping her already obese baby to the couch with a huge stuffed belly that she was about to get to rub.<br>\r\n<br>\r\n\"My belly hurts but it also feels so good\" said Christina holding her middle<br>\r\n<br>\r\n\"I am sure\" said Mabel kind of out of it imaging how much fatter her daughter would get if she kept eating like this<br>\r\n<br>\r\nThey got to the couch and Mabel helped heve Christina on the couch witch sank in a few inches from the weight of the big little girl. Mabel started to rub the big dome that was placed in front of her. it was so hard and even shiny from the skin being streched.<br>\r\n<br>\r\nAfter half an hour Mabel noticed that she had fallen asleep and decided to let her rest and digest.</span></div></div>",
            "created":1281502800,
            "id":934539,
            "title":"she can"
        },
        "1112112":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "Mcdonalds",
                "Burger king"
            ],
            "content":"<div class=\"\"><div> <span>3 hours later Christina woke up to Mabel shaking her.<br>\r\n<br>\r\n\"Its time for dinner, we are going out\" said Mabel excitedly<br>\r\n<br>\r\n\"Were are we going\" asked Christina still a little asleep<br>\r\n<br>\r\n\"Where ever you want\"</span></div></div>",
            "created":1281762000,
            "id":936193,
            "title":"skip to waking up and get fed"
        },
        "11121122":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "yes I can",
                "No im to hungry"
            ],
            "content":"<div class=\"\"><div> <span>\"Burger King\" said Christina<br>\r\n<br>\r\n\"Ok you got it\" said her Mabel<br>\r\n<br>\r\nThey got into the car and went to Burger King and when they got there there was a huge line going out the door. They wanted to know what as going on so they went around to the counter and asked a clerk.<br>\r\n<br>\r\n\"Hey, what is this huge line for\" asked Mabel<br>\r\n<br>\r\n\"It is for the King Challenge, eat 10 of our new King burgers and winn free food for a year from this Burger King.<br>\r\n<br>\r\n\"Well,Christina, can you wait in line and take the challenge?</span></div></div>",
            "created":1282194000,
            "id":939085,
            "title":"Burger king"
        },
        "111211221":{
            "author_id":"skiddler",
            "author_name":"dracojane",
            "choices":[
                "mabel orders the same again",
                "they go home"
            ],
            "content":"<div class=\"\"><div> <span>woww that sounds like fun mummy. ok then join the line.<br>\r\n<br>\r\n10 minutes later the challenge began and christina started shoving the burgers down her throat as her proud mother watched from the seats as her daughters already huge belly continued to expand. within 20 minutes christina had finished the ten king burgers and let out a massive belch. to signal shed finished.<br>\r\n<br>\r\nher mother then ran up and gave her duaghter a hug. im so proud of you my little piglet we can stay here as long as you want. good becuase im not even the smallest bit full. good girl now what do you want. um gimme 2 of everything. ok. <br>\r\n<br>\r\nmabel went up and orderd one of every thing then got 5 assintants to caryy the trays of food over to the pot belly christina<br>\r\n<br>\r\nafter an hour christina had finished her 2 of everything meal and sat rubbing her huge tummy that which had torn apart her shirt and shorts and was left in just her underwear.</span></div></div>",
            "created":1288587600,
            "id":984716,
            "title":"yes I can"
        },
        "1112112212":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "A nice woman offers to help",
                "somethingn else"
            ],
            "content":"<div class=\"\"><div> <span>Mabel could tell her daughter was overly stuffed from the huge amount of food she had consumed in the past hours. Her belly had never been bigger. Christina just sat there a little dazed with her hands slowly rubing her belly. Mabel could not help but smile at how cute she looked. However she had to snap ut of it because she was getting alot of bad looks from people for letting, or making, her daughter eat so much after already being overweight.<br>\r\n<br>\r\n\"come on Christina,we got to go home\" said Mabel<br>\r\n<br>\r\n\"O...burp..k Mommy\" said Christina,trying to get up<br>\r\n<br>\r\nHer mom noticed that her daughter was not making any progress getting out of the seat so she helped her get of and stand up. Christina nearly fell forward from the weight of her gorged tummy. Mabel cought her though before she did and was able to help her waddle to the car. When she got there she thought of anoher problem. How was she going to get her into the car? She was to heavy to lift at this moment and She was to short to crawl in.<br>\r\n<br>\r\nThe only thing she could think of to do was at least try to left her. <br>\r\n<br>\r\n\"Ok Christina, grab on to the seat and pull while I push\"<br>\r\n<br>\r\nChristina did and so did Mabel but with no use. She was just to much more heavyer to lift,or push. Mabel just looked at her toddler. She was kinda proud that she had gotten so stuffed and big that she could not even get in the car. But now she had to come up with a way to fix this problem.luckly</span></div></div>",
            "created":1299992400,
            "id":1069762,
            "title":"they go home"
        },
        "11121122121":{
            "author_id":"jt3455",
            "author_name":"Jt3345",
            "choices":[
                "Chubby 60",
                "Fat 170"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A woman named Erica offered to help Mabel to lift Christina into the car. Mabel said yes so they both secessfuly lifted Christina into the car and they also meet Erica's doughter named Allison. She is also two and she weights.</span></div></span></div>",
            "created":1467601500,
            "id":2175027,
            "title":"A nice woman offers to help"
        },
        "112":{
            "author_id":"sagepsypris",
            "author_name":"TheSage",
            "choices":[
                "Fixes a big snack to be eaten",
                "Fixes a small snack to be eaten",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>     \"Honey,\" Johnathan looked as his wife, Madison, who was in the kitchen preparing a snack for their daughter, Christina, as she often did at this time.  Being as how Christina was a growing girl, being the tender age of two, she often didn't know exactly how much food she needed at any one given time.  Not that her parents minded much about that seeing as how they were never worried about her eating to much.<br>\r\n<br>\r\n     \"Yes darling?\" she looked over from her apple slice cutting to give her attention to him.<br>\r\n<br>\r\n     \"Do you thing our daughter is growing a bit,\" he hesitated when he went to say his next few words, \"Quickly?\" he asked averting his gaze from he loving wife to his growing daughter as Christina, who was sitting on the floor playing with some dolls, was gently jiggling.  Her extra pounds that caressed her small child form was showing signs of shake, her belly being the biggest thing on after  that was her cute little hips and butt, giving her good cushion to sit on.<br>\r\n<br>\r\n     \"I don't think so darling,\" she smiles and finished preparing the slices for the apple sauce she was making her daughter.  \"she is a growing girl and she will grow out of it.\"<br>\r\n<br>\r\n     \"True I guess,\" he went back to looking as his wife.<br>\r\n<br>\r\n     \"And besides would it be such a bad thing if she was a little on the plump side?\" she perked up at the thought of seeing if her daughter would grow into a plump little princess if she was given the ability to do so.<br>\r\n<br>\r\n     \"Well if is what she wants to do then i wont stop her if you wont,\"<br>\r\n<br>\r\n     \"Wonderful, then it is settled we will let our little girl be the girl she wants to be if she wants.\"  Madison went back to preparing the snack for little Christina</span></div></div>",
            "created":1488992220,
            "id":2286551,
            "title":"does not care"
        },
        "1121":{
            "author_id":"drifterboy88",
            "author_name":"Drifter boy",
            "choices":[
                "Why don’t you take a nap ",
                "Why don’t we go to the pool",
                "Let’s watch a movie "
            ],
            "content":"<div class=\"\"><div> <span>Madison decided to make an apple pie for Christina. She did the classic cinnamon stuff and all that. And after a few hours the pie was done. She called Christina in and showed her the pie. Christina jumped for joy, causing her entire body to jiggle. She and her mother laughed and Christina sat down and started eating. In about 30 minutes she had eaten the whole pie. Her mother then said,</span></div></div>",
            "created":1556859120,
            "id":2654216,
            "title":"Fixes a big snack to be eaten"
        },
        "11212":{
            "author_id":"drifterboy88",
            "author_name":"Drifter boy",
            "choices":[
                "75 lbs",
                "100 lbs"
            ],
            "content":"<div class=\"\"><div> <span>Christina thought that the idea was great. She immediately went to get her favorite bikini out of her room. When she put it on she noticed that it was tighter than last time she wore it. She then saw how big her belly is. She loved it.<br>\r\n<br>\r\nAs she came down the steps her mom saw how much her belly jiggled. She then decided that Christina needed a new bikini. So she measured her.<br>\r\n<br>\r\nWhen she stepped on the scale it read,</span></div></div>",
            "created":1556868300,
            "id":2654258,
            "title":"Why don’t we go to the pool"
        },
        "12":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "want her fatter",
                "just dont care",
                "another girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now are her parents trying to make her fatter or just dont Care?</span></div></span></div>",
            "created":1281243600,
            "id":932431,
            "title":"Shylee"
        },
        "121":{
            "author_id":"drifterboy88",
            "author_name":"Drifter boy",
            "choices":[
                "She wanted more ",
                "Her shirt ripped ",
                "She was full"
            ],
            "content":"<div class=\"\"><div> <span>Shylee woke up one morning and felt her belly. She thought it felt amazing. As she went down stairs she smelled her favorite breakfast food, bacon. She saw her mother cooking. She said “mommy feel my fat belly “ her mother agreed it felt great. She told Shylee to start eating to make it bigger. <br>\r\n<br>\r\nAfter 4 plates of bacon </span></div></div>",
            "created":1554960600,
            "id":2643357,
            "title":"want her fatter"
        },
        "122":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Pancakes",
                "Waffles",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Shylee slowly wake up. She did't want too wake up. She wanted to get back in her dream. It had been such a fun dream. A land made of food, and she started eating small things like tables and chairs. After that the couch, later cars and finally whole houses and city's were devoured by her huge appetite. Too bad it was all a dream. <br>\r\n<br>\r\nShylee had one special hobby in life... eating. As long if she could eat or was full Shylee was all right. However she had a problem with sharing. Well she could share stuff but she could't share food. That was Shylee's biggest weakness. But she was happy when she was eating so she kept eating a lot of the time. <br>\r\nMaybe you wonder what did her mother thought of her. Did't she cared that her daughter was so fat. The answer was: No. Her mother always thought that happiness was the most important thing for a kid. Shylee was happy when she was eating. As long id Shylee was happy her mother did't cared.<br>\r\nNow of course someone asks: \"Where's the father?\"<br>\r\nAnswer is: He's captain on a boat and is hardly at home. If he's home he does't really pay  much attention to her. Shylee knew her babysitters better then she knew her own father. Sounds kind of sad does't it. Her father wanted a boy. Someone who could follow in his footsteps. But now he had a girl. A fat girl. <br>\r\nBut her mother loved her and she had a few friends. Some other kids from friends from her mother. She also had a big belly. That was thanks to all her eating. She did't mind it. She liked her big belly. Something that showed how much she loved eating. She was happy she was fat. She wanted to be fat and she wanted to eat so it was a perfect combination.<br>\r\n<br>\r\nShylee crawled back under her blanket and closed her eyes again. she did't wanted to wake up. However she knew her mother would wake her up any second. <br>\r\nA loud rumble came from her belly. She was pretty hungry. She wanted some food. No not some food. A lot of food. But she hated it to leave her warm bed. If Shylee could do a wish then it would be stay in bed and get fed. That seemed her perfect.<br>\r\n<br>\r\n\"Honey are you awake?\" She heard her mother.<br>\r\n<br>\r\nShylee went sitting up straight when she heard the sound of her mother. <br>\r\n<br>\r\n\"Ah you're up. I guess you're hungry.\"<br>\r\n<br>\r\n\"Hungry mommy! Want food! Want Food!\"  <br>\r\n   <br>\r\n\"Of course Shylee. Take it easy. We will get some breakfast. She picked Shylee out of bed and took her downstairs. Straight too the kitchen. Her mother knew she could better feed Shylee as soon if was possible then she was fine. If she did't Shylee would throw a tantrum. She did't want that too happen. Especially this early. Besides she wanted too make Shylee happy and the only thing that made her happy was food. Even while only three of the five buttons on her shirt remained. The other two popped of to make room for Shylee's fat belly.<br>\r\nHer mother started preparing...<br>\r\n   </span></div></div>",
            "created":1297227600,
            "id":1050643,
            "title":"Meet Shylee"
        },
        "1222":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "im full",
                "I want more",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Her mom was making wafles. It was one of Shylee's favorite things to eat in the mornings,aside from almost anything else. her mom remembered when she started eat real food,like waffles, her mom didnt know how much was enough to fill her up and make her happy. So she just kept feeding her until she stoped asking for more. The magic number was 10. It took ten waffles to fill this back then little girl up. So because she wasnt huge then you could tell a size increase in her tummy. It got pretty round.<br>\r\n<br>\r\nNow however abouit a year and a half later eating like this has caused so major changes in the size of the toddler. Now after she eates 10 waffles you can barley tell. It takes alot more food than that to make her belly any biger than it already is. But she doesnt overeat in the mornings. She just eats enough to get her full,which still is alot.<br>\r\n<br>\r\nShe put 5 waffles on a plate and drenched them in syrup and butter. She handed them to Shylee who instantly started to dig in. Her mom knew she only had a small amount of time before she would be holloring for more so she got right back to the pan to cook 5 more. She hoped that Shylee had not gotten any more hungry over night and that would be enough to feed her until she figured out what she would have for the rest of the day.<br>\r\n<br>\r\n\"More mommy more\" Shylee began to shout<br>\r\n<br>\r\nno sooner had she finished than her mom quickly set another flooded plate of waffles infront of her obese daughter. She quickly began to stuff them into her mouth as quick as she could. Soon she was finished with a little burp. Oh, did I mention the 2 full glasses of orange juice she drank with it, so she tummy had a slight slosh to it. She looked up at her mom and said...</span></div></div>",
            "created":1297227600,
            "id":1050879,
            "title":"Waffles"
        },
        "12222":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Wanted still more food",
                "Wanna go somewhere (your choice)"
            ],
            "content":"<div class=\"\"><div> <span>\"I want more food mommy! I'm still hungry!\"<br>\r\n<br>\r\n\"Are you really still hungry honey?\" Her mother asked.<br>\r\n<br>\r\nShe wished she had't said that last word. Shylee's plump face started to get red and her eyes started to get watery. All signs she would have a tantrum.<br>\r\n<br>\r\n\"I WANT FOOD! I'M HUNGRY, I'M HUNGRY, I'M HUNGRY!\" She screamed and hit the table with her fists.<br>\r\n<br>\r\n\"Oh Honey please don't scream. I will make more waffles for you. But please stop screaming!\"<br>\r\n<br>\r\nShylee was crying loudly. So hard it hurt Sassy's (her mother's name) ears. She fast stood up to make more waffles<br>\r\n<br>\r\n\"Don't scream I'm already making more waffles for you sweetie.\" Her mother said.<br>\r\n<br>\r\nShylee's crying slowly got less. She looked at her mother still with wet eyes. It was obvious that the smallest thing she did't like would make her cry again. Her mother made another five waffles. Shylee had a big appetite and got fast very hungry. Sassy did every thing to get her daughters tummy full and Shylee was maybe pretty young but she knew very well her mother would do whatever she wanted as long if she screamed or threw a tantrum and the only thing she wanted was food.<br>\r\nEven while Shylee was pretty fat her mother did't worried about it and was simply blind for her daughters size. <br>\r\n<br>\r\n\"Hurry up mommy. I'm so hungry.\"<br>\r\n<br>\r\n\"There almost done honey.\" She said while she put the waffles on a plate and drenched them in butter and syrup. \"Here you go honey.\"<br>\r\n<br>\r\nShylee started to eat right away. She pushed the food in with both hands and ate loudly with big bites and open mouth. Even a pig would eat with better manners. <br>\r\nAfter the waffles where in her big gut she let out a loud belch and looked at her mother.<br>\r\n <br>\r\n\"Is there something honey?\" Her mother asked friendly.<br>\r\n <br>\r\nShylee opened her mouth that was covered with butter and syrup.</span></div></div>",
            "created":1297314000,
            "id":1051283,
            "title":"More waffles"
        },
        "122222":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "its fine for her to come",
                "its not fine for her to come"
            ],
            "content":"<div class=\"\"><div> <span>\"I want to go to Kayla's house\" said Shylee, much more calmed down from the extra food in her now finaly satisfied tummy.<br>\r\n<br>\r\nKayla was her best and pretty much only friend. Her mom and Kala's mom met in a restraunt where she workes. Kayla's mom is a cook, but her type of cook it to come up with new dishes for a nice restraunt. One reason Shylee likes her so much is because she is always trying to get her daughter and her friends ( Shylee ) to test out her latest creation. Now because of this Kayla, who is also 2 and a half, is got a layer of fat on her as well. But she is not near as big as Shylee. She fits is the catigory of chubby. Just like Shylee though she has a nice round tummy and also some fat ankles and lower legs.<br>\r\n<br>\r\nShylee's mom was kinda releaved to hear thats what she wanted to do because it meant she got a break from constantly inding something to feed her growing daughter. Now I wouldnot say that stacie, Kayla's mom, a feeder, but she did like to make sure her little girl and her friends had a full belly. Now she never tried to force her daughter, much less her friends, to eat. But she did strogly encourage them to try new foods.<br>\r\n<br>\r\n\"Well let me give them a call and ask if I can drop you off, does that sound good\" asked Sassy<br>\r\n<br>\r\n\"Yea Yea\" shouted Shylee who started jumping up and down a little in her seat which made her whole body give a slight jiggle. A little less from her belly because of how full it was<br>\r\n<br>\r\n</span></div></div>",
            "created":1297314000,
            "id":1051518,
            "title":"Wanna go somewhere (your choice)"
        },
        "1222221":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Arrive at Kayla",
                "Something else (your choiche)"
            ],
            "content":"<div class=\"\"><div> <span>Sassy dialed the number of Kayla and her mother (Jennifer) and waited.<br>\r\n<br>\r\nClick! \"Hello this is Jennifer.\"<br>\r\n<br>\r\n\"Hi Jennifer. It's me Sassy. Say I was wondering would it be a problem if i drop Shylee by you. She want's to see Kayla again.\"<br>\r\n<br>\r\n\"Oh that would be nice. I was just thinking of some new creations and i would be nice if she could try it.\"<br>\r\n<br>\r\n\"Well i don't think that will be a problem. Not with her appetite. I drop her off as soon if she's ready. See you later.\" She hung up and turned to Shylee. \"All right Shylee you can go to Kayla. But first get dressed.\"<br>\r\n<br>\r\nShylee always hated getting dressed. Not that she hated clothes that much but how tight the were on her fat frame. Most of the time they hardly fit. Also many left her belly bare and showed her belly button. Just like now.<br>\r\n<br>\r\n\"Oh Shylee this shirt is getting a bit too small for you. You're really growing fast.\"<br>\r\n<br>\r\nShylee was really growing fast. Just not in the right way.<br>\r\nIt took some time before the finally found some fitting clothing. Even the T-shirt she wore now still showed a stroke of soft belly flesh. Shylee softly poked in it. She liked it to play a bit with her fat. She also wore some stretch pants however they were stretched to the maximum size.<br>\r\n<br>\r\n\"You know i should give some of your clothes that don't fit anymore to Kayla. I think she can use them.\"<br>\r\n<br>\r\n\"Mommy can we go now?\" Shylee asked impatient.<br>\r\n<br>\r\n\"It's fine we can go.\"<br>\r\n<br>\r\nThey walked too the car but to get Kayla in a car seat soon seemed impossible. The car seat that already was getting tight the last times finally has gotten too small. Or more Shylee was gotten too fat for it.<br>\r\nSassy just put her on the backseat and buckled her up.<br>\r\n<br>\r\n\"I should look in the attic. Maybe i have a bigger seat for you there. From when i was a baby. Your grandmother could never throw something  away. Some things there are something for a museum.\"<br>\r\n<br>\r\nShylee smiled. She loved her grandmother. She lived on the second floor. She was a nice and old lady. She could tell terrific stories. Nice stories for little kids and exciting stories that would even amuse teenagers. She also had nice stuff she gathered over the years and had always some food to snack on. Grandma always said: When your belly is big and round happiness can be found. She also thought a round belly looked very cute. So Shylee never had a problem with food if she went to her grandmother.<br>\r\n<br>\r\n\"I like grandma. She's nice.\" Shylee said.<br>\r\n<br>\r\n\"Yeah Shylee i know. I love her too. She's my mother too you know.\" <br>\r\n<br>\r\nShylee leaned back. She wondered what Kayla's mom made for them today again. Her new creations normally tasted terrific. Kayla's mother also always liked to see a kid which such a healthy appetite. Kayla herself also liked Shylee a lot since they had the same interests and both liked some good food.       <br>\r\n</span></div></div>",
            "created":1297400400,
            "id":1051968,
            "title":"Of to Kayla"
        },
        "12222211":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "strait to the feeding",
                "play a little first"
            ],
            "content":"<div class=\"\"><div> <span>When they got to Kayla's house Shylee instantly was fighting to get off her seatbelt. Her mom noticed this and gave of a little giggle.<br>\r\n<br>\r\n\"Here honey I will help you\" said Sassy<br>\r\n<br>\r\nShe got out and went around to her door and opened it. After fighting for a minute there was  snap and the best flew across Shylee. She hopped out and looked around. The house Kayla lived in looked pretty simalar to Shylee's, but on the inside it was compleatly different. They walked up to the door and rang the door bell. A thin women opened up the door with a smile.<br>\r\n<br>\r\n\"Kayla, Shylee is here\" shouted Jeniffer behinde her sholder<br>\r\n<br>\r\nYou could here a loud thump and then a bunch more thumps that got a little louder with each one. Then Kayla came sliding across the floor because of her socks and caught herself before she fell.<br>\r\n<br>\r\n\"Hey Kayla\" said Shylee brushing past the woman to get  inside<br>\r\n<br>\r\nThey both ran into the next room. Of course Shylee did more of a quick waddle behinde Kayla. See kayla was chubby but not big enough to affect how she moved.<br>\r\n<br>\r\n\"Thank you for letting Shylee come over\" said Sassy with a msile<br>\r\n<br>\r\n\"Oh its no problem Kayla has been complaining of being bored latley anyways\"<br>\r\n<br>\r\nWell Iguess I will come back in, eh five hours\"<br>\r\n<br>\r\n\"Sounds good\"<br>\r\n<br>\r\n\"Great see you then\" said Sassy shutting the door</span></div></div>",
            "created":1297486800,
            "id":1052663,
            "title":"Arrive at Kayla"
        },
        "122222111":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "It tastes delicious",
                "It tastes horrible"
            ],
            "content":"<div class=\"\"><div> <span>\"Nice to see you again!\" Kayla said hugging Shylee pressing her chubby body against Shylee's fat.<br>\r\n<br>\r\nShylee always wondered how it was possible that Kayla was't fatter. Her mother cooked terrific. Not that Shylee's mother was a bad cook but Kayla's mother was just better. Shylee knew that if her mother could cook just as good she would be even fatter then she was now.<br>\r\n<br>\r\n\"It's good to see you too.\"<br>\r\n<br>\r\nShylee could see her friend also gained a bit. Not too much but she saw how her clothes cut a bit more in her body. She always paid attention to that since Kayla was her best friend. She was also one who knew her secret that Shylee wanted to get fatter. If Kayla wanted to get fatter herself was something she still was't sure about.<br>\r\n<br>\r\n\"Shylee it's so nice you wanted to come.\" Jennifer said. \"Besides i have a new creation i would like it if you two girls would try it.\"<br>\r\n<br>\r\n\"I would love too.\" Shylee said.<br>\r\n<br>\r\nKayla rolled with her eyes. She knew her friend would keep eating her mother's food until she would burst. At her age she still believed people would explode if they ate too much.<br>\r\n<br>\r\n\"Well take a table I'll will bring each of you one of my new creations.\" Jennifer said.<br>\r\n <br>\r\n\"I like your mother. She cooks fantastic!\" Shylee said.<br>\r\n<br>\r\n\"Yeah i know she does. I really like her food. But i think I'm getting to fat from it.\"<br>\r\n<br>\r\n\"Why do you mind? Look at me. I'm way fatter then you.\"<br>\r\n<br>\r\n\"Well i would't mind becoming fat. It's just that other kids are teasing me because of my size. They're calling me names and all. I hate that. If it was just become fat i would't mind at all. You know i like eating. If I gain weight with it. so be it.\"<br>\r\n<br>\r\nBoth giggled but the next moment Kayla's mother entered with two plates with delicious food.<br>\r\n<br>\r\n\"You know what is? It's... \"<br>\r\n<br>\r\nIt was normal That Kayla's mother always exactly told what was in her creations. Shylee did't really mind since except salt and pepper she did't knew any other spice. Also some of the food or what piece of meat it was was unknown to her. Only thing she cared about was how it tasted. In her eyes that was the only thing that mattered.<br>\r\nKayla's mother told her it was also part how it looked like. It needed to look delicious just how it tasted. Shylee must admit that it was partly true. She also would't wanna eat something that looked gross. But Shylee almost liked any kind of food. She was also never scared to try something knew while most kids never tried to eat something new. Shylee hardly had some food she did't liked so she always liked it to taste something she did't knew.<br>\r\nKayla's mother was done saying what it was while Shylee did't put any attention to it.<br>\r\n<br>\r\nShylee took her knife and fork and fast started to eat.<br>\r\n    </span></div></div>",
            "created":1297832400,
            "id":1054897,
            "title":"The new creation"
        },
        "1222221111":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "more",
                "im full"
            ],
            "content":"<div class=\"\"><div> <span>The second the first bite hit her tongue she knew she would be pretty happy and full in a little while. This was the best the she had ever tasted, next to the  last thing her mom eat. She will never forget last time she was over there and just how stuffed she got. She cant even quite remember what it was but it was great. She was so full that she even was able to get Kayla to rub her tummy a little bit.Kayla also seemed to like the food very much. She was eating a little fast than she normaly did. Shylee did like to see this. Sometimes she sould notice how Kayla's tummy got a bit bigger after eating some of her moms food,well a good bit. Kayla almost loved food as much as shylee, but now Shylee knew that she did not like people making fun of <br>\r\n<br>\r\nher for being chubby. Shylee was sad to hear that since she was kinda hoping that Kayla would start gaining on purpose to.Shylee didnt even mind what people thought of her. She didnt even see much other kids besides Kayla so she would make a pig of herself anywhere. Plus this was one of her favorite places to do this because the more of the food you ate of her moms, the happier she was. Plus Shylee even saw the dish that she got very stuffed on, on a menu in a restruarnt a week later.<br>\r\n<br>\r\n\"Ok girls, would you like anymore\" asked Kayla's mom nicley<br>\r\n<br>\r\nShe came in at the right time because just as she came in, Shylee <br>\r\n<br>\r\nfinished her last bite. Shylee looked at her mom and said...</span></div></div>",
            "created":1297918800,
            "id":1055537,
            "title":"It tastes delicious"
        },
        "12222211111":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "They're gonna do something else",
                "Someone else comes to visit"
            ],
            "content":"<div class=\"\"><div> <span>\"I would like some more please.\" She asked it on her sweetest tone that could almost melt every ones hart.<br>\r\n<br>\r\n\"Well i could make some more. I like it when people like my food.\"<br>\r\n <br>\r\nKayla's mother always liked it When Shylee came over. Shylee always liked it to taste some of her dinners. She also liked Shylee's big appetite and fat body that she thought looked kind of cute. She always hoped that Shylee could convince Kayla to also gain a little. She still thought Kayla was way too thin.<br>\r\n<br>\r\n\"You know your mother really is a great cook. I always love her food.\"<br>\r\n<br>\r\n\"Yeah me too. But i don't want to eat too much. People make fun of me already since I'm a bit chubby. I don't want to gain even more weight or else they tease me even more.\"<br>\r\n <br>\r\nShylee did't understand her friend could't like her fat just like she did. It would be so much more fun for her. She also saw so many times on the tell sell channel stupid stuff that could help you lose weight. She could maybe understand that a boy wanted a six pack and a muscled body but why would such a boy wanna have a skeleton like girlfriend? It were some things of life she did't understand and maybe never would.<br>\r\n<br>\r\n\"How do they tease you?\" She asked Kayla.<br>\r\n<br>\r\nThey're calling me names. They also poke and pinch my fat. It hurts. They call me very mean names. I hate that. I don't like being made fun of. Well at least you're nice to me.\"<br>\r\n<br>\r\n\"Of course. You're my friend. Besides i could't tease about you being chubby since this belly i way bigger then yours.\"<br>\r\n<br>\r\nBoth girls needed to giggle. <br>\r\nSuddenly Kayla's mom showed up with another plate. It seemed just as tasty as the one before. Shylee's mouth started to water while Kayla's mother put the plate down.<br>\r\n<br>\r\n\"Why were you two laughing about?\" She asked.<br>\r\n<br>\r\n\"Nothing important mommy.\" Kayla said.<br>\r\n<br>\r\nShylee was too busy eating to answer. Kayla looked doubting at her friend. She knew Kayla for as long if she could remember. She did't remember much at her age. Shylee always had a big appetite to joy of her mother.<br>\r\n </span></div></div>",
            "created":1298350800,
            "id":1058697,
            "title":"Things Shylee does't understand "
        },
        "122222111111":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "about overweight kids",
                "a cortoon"
            ],
            "content":"<div class=\"\"><div> <span>Shylee stood up after the last bite of the food and let out a belch.<br>\r\n<br>\r\n\"Wow that was really good. im full now\" said Shylle patting her larger belly<br>\r\n<br>\r\n\"It was not enough to make her tummy any bigger but close.<br>\r\n<br>\r\n\"Me too\" said Kayla also standing up. because she was a bit smaller than Shylee her belly got a little rounder from the food.<br>\r\n<br>\r\nShylee noticed this ofcourse and smiled.<br>\r\n<br>\r\n\"How can you not like this enough to not care about what people think\" asked Shylee pinching Kayla's tummy.<br>\r\n<br>\r\n\"I just really dont like being made fun of.\"<br>\r\n<br>\r\nShylee really hated to hear this. She would like to have someone gain with her. that way she could maybe rub someelses belly besides her own. She really wanted to convince her not to care and just gain. Besides, she didnt care what people thought about her. She just knew that she liked her belly and liked it the fuller it was too.<br>\r\n<br>\r\n\"Well you want to go watch tv for a litle while\" asked Kayla<br>\r\n<br>\r\n\"Sure, I wonder whats on.\"<br>\r\n<br>\r\nThey walked into the living room and got on the couch. Shylees place sunk in a good bit from her weight. They clicked on the tv and the show that was on was...</span></div></div>",
            "created":1298437200,
            "id":1059550,
            "title":"They're gonna do something else"
        },
        "1222221111111":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "She tells why",
                "She does't really know herself"
            ],
            "content":"<div class=\"\"><div> <span>A talk show. Jenny Jones walked in front of the camera telling that she was today talking with parents of kids who were very overweight.<br>\r\n<br>\r\n\"Talk show. Boring.\" Kayla mumbled while she did't even listened too the subject.<br>\r\n<br>\r\nShe just wanted to change the channel but Shylee stopped her. She wanted to see this. Kayla put the remote down and looked at the screen. When she noticed the subject she must admit she got a bit curious and also went sitting up straight and listened carefully.<br>\r\nJenny started talking with a mother because her sister told Jenny she was overfeeding her two year old girl. Both girls put on big eyes when the kid came on stage and was told what she ate on a normal day. <br>\r\nAfter that a few more overweight boys and girls not older then five came in the show. One of the boys did't wore a shirt. The girls all wore a tiny shirt that covered their chests but showed their huge round bellies. One girl wore a normal shirt but she was so fat it did't stayed down no matter how many times the mother tried to pull it down. <br>\r\nAlmost all parents had the same story. That their kids were perfectly healthy and that they were maybe a bit overweight but that they did't worried since they would grow into it, that not giving your child food would be a form of child abuse, that they would lose it when they would get older, that's important to let their child be happy and since they want their child stop crying. Every mother made an excuses why her child was so fat. It seemed that not one of the mother's thought her child had or would get a weight problem and that they would keep their child feeding no matter what anybody said. Some even had a bowl with food in the studio.<br>\r\nAfter the show was over both girls looked at the other with big eyes.<br>\r\n<br>\r\n\"Well. That was... interesting.\" Kayla said.<br>\r\n<br>\r\n\"Did you see how fat those kids were?\" Shylee said excited.<br>\r\n<br>\r\n\"Yeah I did! I can't believe those mothers! thinking that their child would lose the weight while Jenny showed there's a big chance they would stay fat!\"  <br>\r\n<br>\r\n\"I don't wanna lose weight.\" Shylee whispered. \"I like being fat. Besides i like eating too much.\"<br>\r\n<br>\r\nKayla rolled with her eyes and looked at her friend. <br>\r\n<br>\r\n\"You would have fit great in that show.\" She mumbled.<br>\r\n<br>\r\n\"Yeah I'm also overweight!\" She said proudly and stuck her belly out.<br>\r\n<br>\r\n\"I still don't get it why you wanna be fat. Why do you wanna be fat?\"<br>\r\n </span></div></div>",
            "created":1299042000,
            "id":1063238,
            "title":"Jenny Jones"
        },
        "12222211111111":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "I guess i wil try it",
                "no I still dont want to"
            ],
            "content":"<div class=\"\"><div> <span>\"Well I have a bunch of reasons. First I LOVE food,more than anything. Second, I love my big soft belly and feeling it rest on my thies when I sit down. Its very warm. Also I love the feeling of being very full. Sometimes I can eat so much that my belly will get a little bigger and harder, thats when its the best time to rub it. Like that time I was over here and ate so much of your moms ffood and you rubbed my belly.\" said Shylle getting a little excited.<br>\r\n<br>\r\n\"Wow\", said Kayla \"That does sound pretty good, but what about when people make fun of you, doesnt that make you mad or sad\" <br>\r\n<br>\r\n\"Well I dont care what people think, and also not all people make fun of fat people, some like them and think that fat kids are cute, just like those moms on the t.v.\" <br>\r\n<br>\r\n\"Well, you are right there\" and it does sound pretty well enjoyable<br>\r\n<br>\r\n\"And think about it. If you decided to gain with me we could both eat alot and rub eachothers bellies and maybe even feed eachother. nd if you outgrow your clothes you can boroow some of my old ones. Come it it will be really fun\" said Shylee patting Kayla's tummy<br>\r\n<br>\r\n\"Well..</span></div></div>",
            "created":1299301200,
            "id":1065179,
            "title":"She tells why"
        },
        "122222111111111":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "They start eating",
                "Something else (your choiche)"
            ],
            "content":"<div class=\"\"><div> <span>\"Well i guess i can try it. Maybe I like it. So I don't need to care what other people say?\"<br>\r\n<br>\r\n\"Only if they say nice things. Like your mother never had something mean to say about my weight. My mother also never said something mean about my weight. But she was sometimes a bit wondered how much i could eat. If someone teases you just ignore it.\"<br>\r\n<br>\r\n\"I find that hard to do. Teasing always makes me sad.\"<br>\r\n<br>\r\n\"Then you can eat to make you feel better. It does help a bit to stuff yourself when you're sad.\"<br>\r\n<br>\r\n\"Weeeeeell. All right you convinced me. I'll become fat and i see how it works out. But what now if it turns out I don't like it? What then?\"<br>\r\n<br>\r\n\"Well you could try to lose it all by some exercise.\"<br>\r\n<br>\r\nKayla looked at her friend with a bored look. Kayla was't very active. She was't active it all. She normally only liked things when you did't need to move too much what was probably one of the reasons she and Shylee could get along so well since Shylee hated exercise even more (if that was possible) Then Kayla. Besides Kayla's mother was't to fond of exercise. Kayla always wondered why.<br>\r\n<br>\r\n\"Shylee I hate exercise. You know that. Besides that i have heard so many people wanna lose weight. It can't be that easy is so many people wanna lose it but don't.\"<br>\r\n<br>\r\n\"True. But your still young. You could grow into it. Just like those kids on T.V. Now come on. You said you would do it.\"<br>\r\n<br>\r\n\"Fine then. I guess I will also make my mother happy. At least I hope so.\"<br>\r\n<br>\r\n\"She does't like you weight?\"<br>\r\n<br>\r\n\"I think she would be happier if I gained some more weight. But I never wanted to do it because I hated to be teased. But now I do it. I hope she likes it. But can we wait a bit before we start? I'm still a bit full from that dinner my mother made.\"<br>\r\n<br>\r\n\"Well i guess I'm too. So what do you wanna do until then?\"<br>\r\n<br>\r\n\"Watch some T.V? I got some nice DVD's from my mother!\"<br>\r\n<br>\r\n\"Cool put them on!\"   <br>\r\n<br>\r\nFor the first time the girls were half lying on the couch. Both were kind of lazy and if Kayla really wanted to gain her laziness would only help her gain faster.</span></div></div>",
            "created":1299560400,
            "id":1067129,
            "title":"I'm gonna gain"
        },
        "1222221111111111":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "after. The results",
                "Shylee feeds her"
            ],
            "content":"<div class=\"\"><div> <span>After about another hour of watching tv Shylee and Kayla were now in the kitchen. Shylee was really happy that her friend decided she would gain weight. She just had to make sure she liked it enough to keep doing it. Kayla was even getting excited about it. The more she thought about it ithe more fun it seemed.<br>\r\n<br>\r\n\"Ok, I want you to fill up the whole table with all the food in this house that you like\" said Shylee<br>\r\n<br>\r\n\"Got it\"<br>\r\n<br>\r\nKayla started to run around the room gabbing all sorts of food as she went. She got cookies,soda's,oven pizza's,doughnuts,some premade samwiches, and even some leftover cake. She sat down after this because all the running made her tired.<br>\r\n<br>\r\n\"From now on you should not move as much, it will help you gain qicker the last calories you loose from moving. Now you will not be able to eat all of this right now but I want you to eat as much as you can, and maybe even more, if you want after a minute I wil feed you\" said Shylee with a smile<br>\r\n<br>\r\n\"The not moving around part wont be hard, I already do that. Thats probaly I am already kinda pudgy\" said Kayla pinching her tummy.<br>\r\n<br>\r\n\"good, now go\" shouted Shylee<br>\r\n<br>\r\nKayla instantly started to dig into the food. She was eating pretty fast and Shylee was glad to see that because she knew that she would end up eating more than normal before she got full.</span></div></div>",
            "created":1299819600,
            "id":1068919,
            "title":"They start eating"
        },
        "12222211111111112":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "She gives them more food",
                "Something else (your choice)"
            ],
            "content":"<div class=\"\"><div> <span>Kayla started with a big bag of chips. After that she finished two boxes of cookies. She wolfed down four sandwiches. After that she started on the leftover cake. But Shylee could see her friend was kind of stuffed.<br>\r\n<br>\r\n\"Now i will feed you.\" Shylee said.<br>\r\n<br>\r\nShe placed on hand on Kayla's belly and started to rub it. Gently. Kayla made a sound of pleasure. It felt good if someone rubbed her stuffed belly. <br>\r\nThen she saw Shylee hold some of the cake right above her mouth. She opened her mouth and Shylee dropped the cake in it. Fast she chewed and swallowed it.  <br>\r\nShylee kept rubbing until all the left over cake was gone with some dough nuts and another bag of chips.<br>\r\n<br>\r\n\"Wow I feel so stuffed. I don't think I ever ate this much before in my entire life. Well my entire life is't that long.\"<br>\r\n<br>\r\n\"Well it's a good start. If you eat more each day your stomach will slowly stretch and be able to hold more food.\"<br>\r\n<br>\r\n\"Are you sure?\"<br>\r\n<br>\r\n\"How do you think I got such a big belly like this?\" Shylee said with a grin.<br>\r\n<br>\r\nKayla's mother came in.<br>\r\n<br>\r\n\"What are you girls doing in here? It's much too quiet.\"<br>\r\n<br>\r\nShe then noticed all the food. Then the empty bags and boxes and her stuffed daughter.<br>\r\n<br>\r\n\"Eh. Hi mommy. I'm trying to eat a bit more to eh... gain some weight\"<br>\r\n<br>\r\n\"Really?\" Her mother said with a smile. She seemed very happy seeing her daughter stuffed with food on the couch. Her legs spread so her belly could lay between them. \"Well if you really wanna gain some weight I could try to make my food with a bit more fat in it if you would like that.\"<br>\r\n<br>\r\n\"That would be great mommy!\" <br>\r\n<br>\r\n\"And Shylee. Do you wanna stay for dinner and also eat some fattening food?\"  <br>\r\n<br>\r\n\"Oh yeah! I also wanna gain some weight!\"<br>\r\n<br>\r\nKayla's mother smiled while she looked at the two little girls.</span></div></div>",
            "created":1300338000,
            "id":1071702,
            "title":"Rubbing and feeding"
        },
        "122222111111111122":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "Shylee goes home",
                "Kayla's mom makes more food anyway"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I gotta say im very surprised you ate all that, does your belly hurt\" asked her mom kindly<br>\r\n<br>\r\n\"Well yea it kinda does\" said Kayla \"But Shylee has been rubbing it for me\"<br>\r\n<br>\r\n\"Well that does always help, im sure your not but are you still hungry\"<br>\r\n<br>\r\n\"Wel no, im stuffed\"<br>\r\n<br>\r\n\"Ok Im sure, but let me know if yal are\" siad Kayla's mom as she walked out of the room<br>\r\n<br>\r\nShylee and Kayla turned their ttentin back to the t.v. A different show was on now. After a little while of silent rubbing and watching Shylee broke the silence.<br>\r\n<br>\r\n\"I think your mom likes that you ate so much\" said Shylee with a smile<br>\r\n<br>\r\n\"No she isnt, i mean shes not mad but I dont think she is glad either\"<br>\r\n<br>\r\n\"I think your wrong, did you see the way she looked at your full belly poking out\" said Shylee with a pat<br>\r\n<br>\r\n\"Well...maybe she is.\" said Kayla with a shy smile<br>\r\n<br>\r\n\"See, even more reason for you to gain\"</span></div></div>",
            "created":1300424400,
            "id":1072387,
            "title":"A little of both"
        },
        "1222221111111111222":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Kayla finishes it",
                "Kayla is't able to finish it"
            ],
            "content":"<div class=\"\"><div> <span>Shylee did't knew how right she was. Kayla's mother was dancing from joy. All this time she hoped Kayla would eat more and gain more but still she stopped eating because she did't wanted to become fat because she hated it if others teased her. But lucky for Kayla's mother Kayla was very lazy and hardly moved and hated any kind of exercise so she did't burn any calories.<br>\r\n<br>\r\n\"I'm so happy Shylee is her friend. I'm sure she convinced Kayla to gain. How do I thank her?\"<br>\r\n<br>\r\nShe knew how. The thing Shylee liked to do most was: eating. Kayla said she was full but maybe she could stretch her stomach a bit. Besides that she was full did't want to say that Shylee also was full. Shylee had a huge appetite. Besides she needed to do something. Fast she started to make something.<br>\r\n<br>\r\nShylee and Kayla went up in the cartoons. Both also liked it to sing with theme songs. Both girls were just sitting on their fat buts watching T.V. Both were also pretty lazy.<br>\r\n<br>\r\n\"Cool that your mother let us look so much T.V. My mother only let me watch two hour and then i need to do something else. Unless when it's a movie.\"<br>\r\n<br>\r\n\"My mother never mind it. Strange. My grandmother is't like her. She does't want me to watch T.V. She always wanted me to go outside to take a walk. She always says young girls like me should be outside running, swimming, playing...\"<br>\r\n<br>\r\n\"You do play outside. Remembering the summer when we took our toys... \"<br>\r\n<br>\r\n\"She says that's not playing. With playing she means football, baseball, tennis or any other kind of exercise. I don't know how it is with your grandma but me and my grandmother never got along. Well that wants to say my father's mother. My grandmother from mother's side is very nice. She does't want that I watch T.V all day but that does't want to say she forces me to do exercise. She also likes it to see me playing with dolls or to tell me stories.\"<br>\r\n<br>\r\n\"My grandmothers are very nice. Both of them. I think it's because i don't have any siblings or cousins. At least not yet. Since I'm the only grandchild they love me. Only me since there's no other. Also my aunts and uncles since they have no child yet.\"<br>\r\n<br>\r\n\"Lucky you. I have some cousins and Nini. I still don't get it why my mom wanted to take another child. The three of us were very happy together. All she ever does is cry, poop, drink and sleeps. And the sound she makes. Horrible. Stupid little sister.  <br>\r\n<br>\r\nJust then Kayla's mom entered<br>\r\n<br>\r\n\"Look what I have for you two.\"<br>\r\n<br>\r\n\"Mom. More food. I don't think i can eat another bite. I'm still really stuffed.\"<br>\r\n<br>\r\n\"You can. Just take small bites and eat slowly so you don't get full fast.\" Shylee told her.<br>\r\n<br>\r\nBoth got a plate full of food. With a weak smile Kayla started to eat slowly.    </span></div></div>",
            "created":1300597200,
            "id":1073362,
            "title":"My family"
        },
        "123":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "yes- can not make another girl"
            ],
            "content":"<div class=\"\"><div> <span>(Based on a real girl on the Maury Povich show)<br>\r\n<br>\r\nBecka is 3 years old and weighs 84 pounds. Her Mom thinks that happiness is better than health. And Becka is happy when she eats. Becka is greedy and eats everything. Her Mom boasts this:<br>\r\n<br>\r\n\"My daughter is 84 pounds. And I feed her ALL DAY LONG. If she wants 5 eggs, I give her 5. If she wants 10, I give her 10! I feed Becka 20 chicken wings, and when she's done and wants 20 more, she gets it. Pancakes, plates of bacon, double cheeseburgers, fries, chicken wings, cookies, ice cream! My baby is happy when she's eatin', and I will feed Becka. I don't care what anybody says! Bigger is better!\"<br>\r\n</span></div></div>",
            "created":1282798800,
            "id":944802,
            "title":"another girl"
        },
        "1231":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "contnue eating",
                "gallon of oj"
            ],
            "content":"<div class=\"\"><div> <span>This morning Becka was at the table eating a load of pancakes. She was in just her diaper. Her belly was sitting in her lap as she ate. Her mother did not offer her food, she just gave it to her when she asked for it and she was proud that her daughter would ask for more food after already stufing her self. And Becka loved to eat. She loved that her mom was proud of her and she loved the feeling of being so full she can not even walk,well waddle.<br>\r\n<br>\r\nThen</span></div></div>",
            "created":1282798800,
            "id":944805,
            "title":"yes- can not make another girl"
        },
        "12312":{
            "choices":[
                "They go to Mcdonalds",
                "They go to daycare"
            ],
            "content":"<div class=\"\"><div> <span>She began to chug a whole gallon of oj. Her Mother held the gallon up for her.<br>\r\n<br>\r\n\"That's right, baby. Drink up.\" Her Mom cooed<br>\r\n<br>\r\nWith every gulp, Becka's belly jiggled. Soon the gallon was empty.<br>\r\n<br>\r\n\"More, Mommy! More!\" Becka screamed<br>\r\n<br>\r\n\"Alright honey.\" Her Mom said<br>\r\n<br>\r\nThen-</span></div></div>",
            "created":1282798800,
            "id":944816,
            "title":"gallon of oj"
        },
        "123122":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "She get's hungry",
                "Someone walks over too her"
            ],
            "content":"<div class=\"\"><div> <span>She handed her a plate with three hamburgers.<br>\r\n<br>\r\n\"Now fast finish those. We need to go too daycare.\" Becka's mother said.<br>\r\n<br>\r\nBecka was already busy pushing the first burger in her greedy mouth. Becka's mother picked up her stuff she needed that day. It would be good if Becka went too daycare every now and then so she could meet some other kids. She spend a lot of time at home eating and watching T.V.<br>\r\nWhen she went back too the kitchen she saw how her daughter pushed the last hamburger in her mouth.<br>\r\n<br>\r\n\"Good job Becka. Look how big your belly is! Bigger is better.\"<br>\r\n<br>\r\nBecka smiled. You could see some pieces of food between her teeth. Becka was a kid with a big appetite. A very big appetite. Her mother fed her everything she want and as much if she want. Of course with a big appetite this affected her weight. You should maybe think her mother was getting kind of worried when her kid started to get very fat But not Becka's mother. She was proud that Becka was fat. Like they said: Bigger is better. She did't cared what other people said. She would feed Becka anything she wanted. <br>\r\nBecka got off from her high chair and waddled too the car. <br>\r\n<br>\r\nBecka was struggling to get in her car seat but it was obvious that her car seat was too small or more that she was too big. Still her mother was proud at how big Becka was and put her in a normal seat. After that she soon drove Becka too day care<br>\r\n<br>\r\nJessica Chandler was a born beauty. Since she was a kid it was obvious she would be very beautiful. She also had a sweet personality and a body most woman would kill for. She also loved little kids and they loved her so it was't surprising she found a job at daycare. Now with an age of twenty-three you could clearly see she was a real beauty but she also was still virgin and still single. However if she wanted a guy she would't have any trouble getting one.<br>\r\n<br>\r\n\"Hello Jessica!\" Becka's mother said while she ran inside dragging Becka with her. \"Here she is. Now she has a big appetite so make sure she get's enough food. Now bye Becka. I gotta go.\"<br>\r\n<br>\r\nShe fast kissed Becka and ran out.<br>\r\nJessica looked doubtful at Becka. 'A big appetite' she could see that, but 'make sure she get's enough food'. It was obvious Becka was too fat for her age but she knew Becka's mother by now. Still if she would be Becka's mother she would surely try to limit what she ate but of course she had't anything to say about how parents needed to raise their kids.<br>\r\nHowever she once found out a kid was being maltreatment by his parents and called the police and the kid was taken away and now lived happily in a foster home. But was it a crime to feed someone? <br>\r\n<br>\r\nWhile Jessica thought about this Becka waddled over the playground. <br>\r\nThree girls all dressed in the newest design outfits looked at her and snickered.<br>\r\n<br>\r\n\"Look there's the fatso.\"<br>\r\n<br>\r\n\"She so fat that i don't get how she fitted through the door.\"<br>\r\n<br>\r\n\"Maybe they greased her in first.\"<br>\r\n<br>\r\nBecka did't really paid attention to all the teasing. She waddled over too the reading corner to watch in books. Maybe one of the teachers wanted to read a book to her. She picked one of the books and started to look at the pictures. <br>\r\n </span></div></div>",
            "created":1282971600,
            "id":945776,
            "title":"Daycare"
        },
        "1231222":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "half of the box",
                "the whole box and wants more"
            ],
            "content":"<div class=\"\"><div> <span>While Becka was looking at the book a lady walked up to her. She had a smile on her face and was holding a box.<br>\r\n<br>\r\n\"Hey Becka, im mrs fran\" sai the lady nicley<br>\r\n<br>\r\n\"I just started to work here yesterday and noticed you, you look like your a big eater and I did not want you to be hungry so I made yo a box of home made doughnuts.\" said Mrs Fran lowering the box in front of Becka<br>\r\n<br>\r\nShe took a doughnut out and started eating it. The lady just smiled. She liked seeing fat little girls and thats why she started to work at a daycare. She thought out of all the kids at a daycare at least one would be fat and love to eat. Her plan was to start bringing food for Becka and make sure they were exta fattneing.<br>\r\n<br>\r\nNow Becka has eating...</span></div></div>",
            "created":1283144400,
            "id":947303,
            "title":"Someone walks over too her"
        },
        "12312221":{
            "author_id":"sagepsypris",
            "author_name":"TheSage",
            "choices":[
                "Mrs. Fran gives in and takes Becka to get more food",
                "Skip to when Becka gets picked up"
            ],
            "content":"<div class=\"\"><div> <span>Becka didn't even realize she had eaten more then one donut; but when she looked down to find there the next one was she had already eaten half of them.<br>\r\n<br>\r\n\"oh looks like we have a hungry one huh?\"  Mrs. Fran gently cooed as she notice another one of her donuts disappearing, not that she minded.  She loved to see good little girls and boys stuff their faces with food no matter the type of food; but this was not the most opportune place to feed the little porker.  There was just to many un-understanding children around for little Becka to really cut loose.  a small moan of completion came from little Becka when Mrs. Fran looked down at her little porker princess with a smile.  Both of them knew that little Becka wasn't done by far and the little girl's eyes met hers with want and need, not for Mrs. Fran but for more food.<br>\r\n<br>\r\n\"M-more,\" Becka pouted gently as she placed a hand on her belly.<br>\r\n<br>\r\n\"But Becka,\" Mrs. Fran whispered in her soft gentle voice \"you ate it all,\" She softly smiled and pinched Becka's frowning cheek gently, playfully even.  Becka at that time pouted more.  She wanted more and she wasn't used to being told there is no more, usually mommy would go buy her something or make something; but there was no way to do that here.  That is exactly what Mrs. Fran wanted, she wanted to see what this little girl would do for food, lots of it.<br>\r\n<br>\r\n\"No, want more now.\" Becka started to throw a tantrum for more food, that bunch of donuts wasn't enough it was just a taste to her.<br>\r\n<br>\r\n\"Becka, please be good,\" Mrs. tried to coach Becka into calming down \"If you are good till your mom gets here to pick you up I will bring much, much more for you and that soft belly tomorrow, ok?\"  she tried to appeal to Becka's need to be full and fed.  Becka didn't shout, or cry she just pouted knowing full well if she gave any fuss she wouldn't get food from Mrs. Fran.<br>\r\n<br>\r\nwhere should we go from here...</span></div></div>",
            "created":1489000020,
            "id":2286588,
            "title":"half of the box"
        },
        "12312222":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Lunch time",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The whole box. she even ate the crumbs.<br>\r\n<br>\r\n\"I'm still hungry.\" Becka said sadly knowing that most people found that so cute they gave her food. <br>\r\n<br>\r\n\"Since you asked so nicely.\"<br>\r\n<br>\r\nFran gave her another box. However Fran would have also given her another box if Becka would have asked it roughly.<br>\r\nFran just like fat girls. She never had children however she planned too have them and fatten them up as soon if they were of breast feeding. She would make sure they would be cute and very fat and always well fed. But until she would find a boyfriend who wanted to get kids with her she was happy enough too look here and it looked like she found a perfect favorite girl.<br>\r\n<br>\r\n\"Would you like it if i read you some stories?\" Fran asked.<br>\r\n<br>\r\nBecka nodded. She started too like this woman. Delicious food and she would read her a story. She had a big appetite that was thanks too her mother who always fed her and told her she was beautiful and that bigger was better, and since she liked her fat just like her mother her appetite only increased just like her size. Becka was't planning to ever get thin. She was only planning to get fatter and that was just what Fran wanted.<br>\r\nShe went sitting at some pillows with Becka next too her. She started reading while Becka ate the donuts. Fran put her other arm over Becka's neck and started to rub her belly. Becka wanted to ask why but when she noticed how good it felt she decided not too.<br>\r\nBecka soon finished the second box and Fran looked at her.<br>\r\n<br>\r\n\"Are you still hungry?\"<br>\r\n<br>\r\nBecka nodded.<br>\r\n<br>\r\n\"You have a good appetite. I think that's important for a girl. You need to eat good. It's just that... eh that...\"<br>\r\n<br>\r\n\"Bigger is better!\" Becka said.<br>\r\n<br>\r\n\"Eh yeah. Yeah that's right. So we need to make your belly bigger.\" She said and gave it a gentle pat.<br>\r\n<br>\r\nBecka smiled while she looked at Fran. Normal people at the daycare were nice but they never offered her food outside lunchtime. And this lady did.<br>\r\n<br>\r\n\"My mom aways tells me bigger is better. She feeds me all day long and everything and as much if i want!\" <br>\r\n<br>\r\n\"Really... could i meet your mother.\"<br>\r\n<br>\r\nFran knew that if she would fatten a child the child could complain or even worse the parents. But this girl want to be fat so she would't complain and her parents also seemed too like her fat so they would't complain either. Maybe they could fatten her together. Maybe she would't tell her mother too fatten her but feed her. Just too be sure. That she would gain with that was obvious.<br>\r\n<br>\r\n\"Here you have some cookies. I specially made them.\"<br>\r\n<br>\r\nIn her mind she added: \"I made them specially super fattening.\"<br>\r\n<br>\r\nBecka ate them. Even if she knew they were fattening she would have eaten them. Maybe even faster.<br>\r\nFran continued reading Becka wile rubbing her belly while Becka stuffed her face some more. However after a second box of cookies Becka decided she had enough and she wanted to have enough room in her belly for the lunch.<br>\r\n<br>\r\n\"Hansel and Gretel looked and saw a house made of gingerbread. Lollies were growing in the garden and the windows were made of sugar.\" Fran told too Becka who licked her lips. <br>\r\n<br>\r\nFran then got an idea. She knew the story of Hansel and Gretel of course (who has't). She slowly put the book away. Becka wondered why the nice woman put the book away jut at such a funny part.<br>\r\n<br>\r\n\"You know i remember the story a bit different then in the book. I will telly you what really happened. All right?\"<br>\r\n<br>\r\nBecka nodded excited. She always liked twisted tales.<br>\r\n<br>\r\nFran told the story that not Hansel but Gretel was fattened, and fattened really good. The witch died in the oven and Hansel and a much fatter Gretel returned home and lived happily ever after.<br>\r\nBecka before heard the story of Hansel and Gretel but she liked this version much more.<br>\r\n    </span></div></div>",
            "created":1283230800,
            "id":947765,
            "title":"Stories and snacks"
        },
        "13":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "want her fatter",
                "just dont care"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now do her parents want to make her fatter or just dont care</span></div></span></div>",
            "created":1281243600,
            "id":932432,
            "title":"Savanna"
        },
        "131":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Wake up",
                "A dream",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Savanna took her burger in both hands and took a huge bite out of it and chewed happily and looked at the fries on her plate. Savanna took a look on her round belly and smiled.<br>\r\n<br>\r\n\"Life is perfect.\" She mumbled with full mouth.<br>\r\n<br>\r\nFor Savanna life was perfect. Since the day she was born she was a hungry girl. Her mother loved her and she loved to eat and her mother loved to feed. Not the best combination. Savanna soon got a round belly. Now most parents would be a little worried about that. Savanna's parents were different. They loved her baby daughters round belly. She thought it looked incredibly cute. Her mother wanted Savanna to grow fatter and more cute. She found out she wanted to have a fat daughter and more then one. She was already pregnant from her second child.<br>\r\nBut there was something else that caused Savanna to be a fat girl. Her parents owned a snack bar and lived next too it. Her father even build a door in the wall so they could easily walk from their work to their house. Of course working in a snack bar and a daughter with a big appetite and parents who liked their daughter fatter is a bad combination. Savanna also loved junk food and always got as much junk food if she wanted every day and also liked snacks during the day. Most people who came there knew the little fat girl. She became some sort of mascot for her parents snack bar. They did't put any attention to how fat the little girl became or else did't cared.<br>\r\nHer mother even with a few months pregnant still worked. Savanna was a bit worried with getting a baby brother or sister. Would she like her, would mommy and daddy don't love her anymore and only have eye for the new baby, would the new baby also become fat and most important would she need to eat less since they also need to have enough to feed the baby. But she decided to worry about that when it was time (her mother made enough junk food to feed Savanna and her little sister or brother and even some more).<br>\r\n<br>\r\nSavanna took a large sip from her milkshake. She was sitting on her fat butt on the couch watching cartoons with a dinner tray on her knees like she did every dinner She pushed the last fries in her mouth and since the tray was empty she put it next too her. She took the last sip from her milkshake and belched loudly and giggled and looked at her fat belly that stretched her pants to the max. <br>\r\n<br>\r\n\"Time for some dessert.\" She said.<br>\r\n<br>\r\nOf course standing up and ask for a dessert was the most easy thing to do put she did't want to move and just waited until one of her parents came in.<br>\r\n<br>\r\n\"I would like some dessert.\" She yelled to her mother.<br>\r\n<br>\r\n\"Of course dear. The Savanna special?\"<br>\r\n<br>\r\nThe savanna special was a huge ice cream her parents made for her. Most people who ordered it were't able to finish it. But the fat little Savanna ate it without a problem. <br>\r\nHalfway her ice cream her pants button flew off to the other end of the room and she felt suddenly very relieved. She finished her ice cream and kept watching cartoons until her mother took her upstairs to make her ready for bed.<br>\r\n<br>\r\nShe always loved it to wash Savanna. When she soaped her in she felt how fat her daughter was and was proud of it.  After bed she brushed her teeth and put on her nightie and put her in bed.<br>\r\n<br>\r\n\"So now sleep tight Honey.\"<br>\r\n<br>\r\nHer mother kept looking at her daughter and enjoyed seeing how her daughter big belly pushed up the covers so it looked like a mountain. She went downstairs.<br>\r\n<br>\r\nSavanna was in her bed playing with her fat what was always a bit difficult since it was hard after dinner. She liked it more when it was a soft and squishy. She loved too play with it more then anything else while other kids her age rather played with dolls.<br>\r\nShe loved that she was fat and liked it to become fatter and she also liked it too make her mommy proud by eating a lot of food. She fell asleep with a big grin on her face.</span></div></div>",
            "created":1281934800,
            "id":937256,
            "title":"Savanna the snack bar mascot"
        },
        "1311":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "alot of food",
                "no food ",
                "somethin else"
            ],
            "content":"<div class=\"\"><div> <span>Savanna woke up and rubbed her eyes. then she smiled and jumped out of bed. Or really fell with style. and ran down stairs.<br>\r\nThe reason she was o happy is because it was her favorite day. Feed Me Day. Every year Savanna's parents held a day at there snack bar were you could by food and feed it to Savanna. She would have to eat it. She ate all day from open til close. That was 8 hours. She loved this day because the day after that she was always fatter. <br>\r\n<br>\r\nSo she ran down stairs to see...</span></div></div>",
            "created":1282021200,
            "id":937711,
            "title":"Wake up"
        },
        "13111":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Continue feeding",
                "Someone comes in"
            ],
            "content":"<div class=\"\"><div> <span> ...a lot of food. Soon it would all be packed in her fat tummy. <br>\r\nMost people in their neighborhood went once a week too the snack bar and most of the people knew Savanna and they liked feeding day. Especially some teenager girls liked it too feed her food and talking about how cute she was. What harm was there in just feeding a  four year old girl that just loved junk food.<br>\r\n<br>\r\n\"Mommy i'm hungry.\"<br>\r\n<br>\r\n\"Well you have too wait one more hour until we open. Savanna looked disappointed and also a bit disappointed at her mother's belly knowing what was inside there.<br>\r\n<br>\r\n\"Mommy why did you need to have another child?\"<br>\r\n<br>\r\n\"Well Savanna we love you of course but we also would like another child. That does't mean we wanna replace you or does't love you anymore. We still do. Besides now you're gonna be the bigger sister. Then you also have a playmate. would't you like that.\"<br>\r\n<br>\r\nThe biggest hobby Savanna had was eating and she also saw that like playing since she liked too do it. But eating with someone else mend you had too share and Savanna did't liked that.<br>\r\nShe went sitting in her usual spot on the couch too watch T.V.<br>\r\n<br>\r\n\"Oh i hope Savanna is gonna be all right with a little sister or brother.\" Her mother said too Savanna's father. <br>\r\n<br>\r\n\"Oh she ill need some time to get used too that but i'm sure it will work out fine.\" Her father said.<br>\r\n<br>\r\nWhile Savanna watched cartoons her thoughts about her new brother and sister got less. She still was't sure. She knew there was also a chance that she would like her sibling.<br>\r\n<br>\r\n\"Savanna! It's opening time!\" Her mother yelled.<br>\r\n<br>\r\nSavanna hated moving fast and rarely did it but did was one of the moments she did. She went sitting in her chair and opened her mouth. Soon two girls walked in that lived down the lane and always took a snack if the walked too the city.<br>\r\n<br>\r\n\"Hi Savanna. Is it feeding day again?\" One of them asked.<br>\r\n<br>\r\n\"Uh huh! Feed me! I'm hungry!\"<br>\r\n<br>\r\n\"All right hungry girl.\" <br>\r\n<br>\r\nThe two girls gave their order and ordered some food for Savanna. each one went sitting  at a side feeding her food saying how cute she was. Already other costumers came in and a lot liked it too buy some extra food too support their little snack bar mascot. <br>\r\n </span></div></div>",
            "created":1282539600,
            "id":942037,
            "title":"Feed Me Day"
        },
        "131111":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "continue",
                "skip to end of day"
            ],
            "content":"<div class=\"\"><div> <span>Savanna loved being fed all day. She loved food and loved the feeling when her belly was being filled to the point of bursting. Thats why this was her favorite day. And no one had a problem with it. Every one liked to feed the pig of a girl who happily accepted the food.<br>\r\n<br>\r\nHer mom also liked watching her daughter be fed. It made her happy because she knew her daughter was happy. She also loved the fact that she knew that her daughter would gain alot of weight from today's stuffing. Her plan was to have the fattest daughter in the world but knew it would take a while.<br>\r\n<br>\r\nIt was becomeing the middle of the day and Savanna was feeling very stuffed. Her shirt was past her belly button and her pants had to be unnbuttond long ago. However she was not close to being done. It was dinner when the most people came and when she was fed the most. She would probally be in her underwear by dusk.</span></div></div>",
            "created":1286168400,
            "id":968934,
            "title":"Continue feeding"
        },
        "1311111":{
            "author_id":"bloodkat303",
            "author_name":"Panda",
            "choices":[
                "Dinner rush",
                "Your Choice"
            ],
            "content":"<div class=\"\"><div> <span>Savanna pulled up her shirt to exposed her stuffed belly. She felt her fat tummy was the real mascot. As the lunch rush came in, person after person took turns filling Savannah's gut. She loved the way the food was pushing her stomachs limits and made her belly ache and very noisy. A lot of customers joked saying it sounded like she was hungry when they knew her belly was struggling. At the end of the lunch rush, Savannah was sitting in a chair rubbing her belly and belching. Her bellys loud gurgling only made her want to eat more. She wanted to fuel the war inside her stomach as well as get fatter</span></div></div>",
            "created":1451693220,
            "id":2082737,
            "title":"continue"
        },
        "1311112":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Abbey orders a lot of food for Savanna ",
                "Abbey orders a lot of food for Savanna and for herself. "
            ],
            "content":"<div class=\"\"><div> <span>\"Do you still have some room in your belly? Or are you full?\" A chubby teenager with dark blond hair asked.<br>\r\n<br>\r\n\"I'm still hungry! Feed me!\" Savanna yelled.<br>\r\n<br>\r\nThe chubby teenager moved a minced neat hot dog over to the wide open mouth of the fat girl. Savanna's mother smiled. The next moment she heard the ripping sound from Savanna's pants when they split.<br>\r\n<br>\r\n\"I was wondering when those would split.\" Savanna's mother said with a smile.<br>\r\n<br>\r\nSavanna's shirt started to rip right in the middle and her mother thought it could rip of any moment. She looked at the chubby teenager. She knew her and knew how nice she was too Savanna.<br>\r\nHowever not everyone in the street liked it. Some people thought it was wrong feeding a girl of Savanna's age so much junk food. They also saw how fat she was and how much she gained and called her parents irresponsible. She hoped they would't make a too big deal about it.<br>\r\nShe woke up from her thoughts when the door opened.<br>\r\n<br>\r\n\"Oh. Hello Abbey.\" Savanna's mother greeted her.<br>\r\n<br>\r\nAbbey was their best costumer. Before they opened the snack bar Abbey used to be a thin girl. But there was nothing left from that. She ate about every week at least three times there. That of course affected her figure. Now she was without a doubt an obese girl with a huge belly, big breasts that rest on top of it, Rubbing thighs and a ass hat hung over most chairs. But Abbey did't seem to mind any of that.<br>\r\n With a black father and a white mother Abbey got a light tanned color like coffee with milk. Her black hair came from her fathers side of the family, but it hung straight just like her mothers hair.<br>\r\nShe waddled in and smiled at Savanna. Savanna's mouth curled in a smile. Abbey liked feed me day and always bought a lot of food for Savanna.<br>\r\n<br>\r\n\"Hello. Nice to see you again.\" She turned to Savanna. \" Ready to get stuffed my snack bar mascot?\"   <br>\r\n    <br>\r\n\"You bet! I'm not full yet!\" savanna yelled and opened her mouth wide.</span></div></div>",
            "created":1346302800,
            "id":1416877,
            "title":"Abbey"
        },
        "13111121":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "She feeds Savanna",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Abbey normally would have gotten a good bit of food for herself as well but today was different. it was all for  Savanna. She made sure to bring plenty of money to be able to buy the butterball toddler tons of tasty treats. She walked up to the food counter after talkin with Savanna for a minute<br>\r\n<br>\r\n\"well hello Abbey, we were wondering when you would show up\" smile Savanna mother<br>\r\n<br>\r\n\"Well im here now lets get some food in your daughters belly!\"<br>\r\n<br>\r\n\"Oh trust me shes had alot all ready, but you know as well as I do she always has room for more\"<br>\r\n<br>\r\nWith that Abbey ordered 3 triple stack burgers, Two foot long hot  dogs, two big things of fry's and three large Coke's and walked over to Savanna<br>\r\n<br>\r\n\"Look what I got\" she sang to her as she lifted up the bags of food <br>\r\n<br>\r\nSavanna smiled \" Ohh Ohh what is it\"<br>\r\n<br>\r\nAbbey dumped the contents of the bag on the table she was sitting at. Savanna's eyes bulged out at all the yummy food placed in front of her that all had one destination, her belly! She instantly reached for some of the food but Abbey swated her hand away<br>\r\n<br>\r\n\"no no no, you know the deal. whenever i come. I get to feed you\" she smiled happily<br>\r\n<br>\r\nThis was true. Every year when Abbey would come on this special day she would order alot of food but unlike most other comstomers she would sweetly feed all the food to Savanna herself and maybe even give her a belly rub when she was done. Savanna smiled \"oh yea i forgot\" <br>\r\n<br>\r\n\"Now open up\" she said as she started to unwrap the first burger</span></div></div>",
            "created":1348376400,
            "id":1433863,
            "title":"Abbey orders a lot of food for Savanna "
        },
        "131111211":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Focus back too Savanna's feeding",
                "She wants to visit those people once"
            ],
            "content":"<div class=\"\"><div> <span>Savanna's eyes sparkled. She liked Abbey. Not only because of all the food she bought however hat surely was part of it but also because Abbey was always nice to her. She sometimes babysit Savanna. Even while Savanna was a teenager she always liked it to watch Cartoons with Savanna or playing with toys or reading her stories and playing board or card games. She did't babysit that often because Savana's parents mostly were at home or at work but since they worked next to their house they did't really need a baby sitter so often.<br>\r\n<br>\r\n\"Come on. Open your mouth as wide if you can. It's a tall burger and it needs to fit in your mouth.\"<br>\r\n<br>\r\nSavanna opened her mouth as far if she could. Abbey shoved the burger in it and Savanna clapped her jaws together biting of a big part of the hamburger. She happily started chewing and Abbey looked lovingly at her. Abbey looked at Savanna's mother and told her with gestures to come closer.<br>\r\nSince besides Abbey and Savanna the only costumers both had their food She moved over to them.<br>\r\n<br>\r\n\"What is it?\" Savanna's mother asked.<br>\r\n<br>\r\n\"Well about a month or so a new family moved in our street. You must have noticed them. They live right over there. Abbey said and pointed to the other end of the street.<br>\r\n<br>\r\n\"Oh yeah now I remember them. I believe three kids. Real stick figures those kids. Poor things.\"<br>\r\n<br>\r\nAbbey continued Feeding Savanna her burger but kept talking.<br>\r\n<br>\r\n\"Well my parents thought we should call them welcome too the neighborhood so some time ago we went visiting them and I also needed to come. Well it appears they're real health freaks. They had a training room to stay fit and ate terrible food. They did't want to use fat and hardly used sugar. Those kids never got candy. Wat they served tasted terrible because the refused to use any greasy or sweet stuff.\"<br>\r\n<br>\r\n\"Well Abbey that sounds terrible but we can't change that. I mean if they want to life that way that's their choice.\"<br>\r\n<br>\r\n\"I know. I understand... but that's not the problem. The seem to have a real hate against fat and greasy food and the people who make it.\" Abbey said.<br>\r\n<br>\r\nSavanna finished her first burger and Abbey fed her the second burger. Savanna did't really seemed to what was going on since she was too much focused on the food.   <br>\r\n<br>\r\n\"Wait a minute so the hate... us. I guess the hate the snack bar as well. What do they wanna do? Close it?\"<br>\r\n<br>\r\n\"Well it seemed that way. They hate fat people too and they saw Savanna a few times and... \"<br>\r\n<br>\r\n\"Wait. You said they hate fat people, and don't get this the wrong way Abbey but you're not skinny yourself, and you were there.\"<br>\r\n<br>\r\n\"True. They started to talk about that and were so mean against me and how bad my parents raised me that we without saying goodbye walked out and slammed the door. Since we did't hear from them since I think they got the message. But before that happened they had some mean comments about Savanna.\"<br>\r\n<br>\r\nAbbey took Savanna's third burger. She loved doing this. She had so much fun just like Savanna but she focused too Savanna's mother again.<br>\r\n<br>\r\n\"I'm not gonna repeat exactly what hey said but it was obvious they thought it was wrong that a kid of her age ate so much junk food and was so fat. They said Savanna must be placed out of her home and that they were planning to call child welfare.\"<br>\r\n<br>\r\nSavanna's mother went pale. That some people did't liked Savanna or how much junk food she was eating was no problem. She could deal with that. Savanna was her child and she could get her as fat and feed her as much as he wanted but child welfare was a totally different story. If Savanna was too fat for their medical standards and she knew for sure Savanna was they could really take her away.<br>\r\n     <br>\r\n</span></div></div>",
            "created":1348635600,
            "id":1435282,
            "title":"The new people"
        },
        "1312":{
            "author_id":"izanagichaos",
            "author_name":"chaoszeel",
            "choices":[
                "Ice cream ",
                "Mexican Food",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Savanna had started dreaming, as her excitement for \"Feed Me\" day caused her unconscious mind to shit into overdrive....<br>\r\n<br>\r\nSavanna found herself sitting in a large chair, her tummy a bit larger than when she went to bed but due to how large the chair was it only made it half way towards the edge of the chair. In front of her she saw an crowd of... food people. Burgers, Fries, Chips, Onion Rings, and other Junk food populated the crowd as they all chanted her name. Savanna smiled and said the only two words that were needed; \"Feed me!\"<br>\r\n<br>\r\nAll of the Junk Food people started to rush towards Savanna's gaping maw, as if being sucked in by a vaccum. As she devoured them, her body grew in nearly all directions but up. Her tummy billowing outward as she ate, her legs and rear spreading out at a slower pace than the belly. And all the while her arms and face slowly grew rounder and rounder.<br>\r\n<br>\r\nBy the time the first wave of food people were finished, her belly started to overhang from the chair, and her legs and rear were getting close to filling out the rest of the chair. Then the next wave of food people came, consisting of...<br>\r\n</span></div></div>",
            "created":1516855980,
            "id":2444630,
            "title":"A dream"
        },
        "132":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "keep eating",
                "rub her belly",
                "somethin else"
            ],
            "content":"<div class=\"\"><div> <span>\"More Please\" asked Savanna<br>\r\n<br>\r\n\"Here you go\" said her mom placing another plate in front of her fat daughter<br>\r\n<br>\r\nHer mom was alright with how fat her only four year old daughter was. really she would not care if she was skinny as a rail or inmoble. She just gave her what she asked for. Right now she had just given Savanna her 5th plate and its only breakfast. <br>\r\nSavanna was in haven. She loved being fat and had a plan to get inmoble wich she was close to becoming. She already waddled and her legs hurt if she stud or walked for a while.<br>\r\nHer mother noticed how much her daughter would eat when she was just able to eat real food. She would be so stuffed that when she was getting changed she would noticed how big her belly was. when she got a little older she started to rub her belly and play with it when she was just sitting.<br>\r\n<br>\r\nSo now Savanna wants to...</span></div></div>",
            "created":1281502800,
            "id":934432,
            "title":"just dont care"
        },
        "14":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "Want her fatter",
                "just dont care"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now do her parents want her fatter or just dont care</span></div></span></div>",
            "created":1281243600,
            "id":932433,
            "title":"Briann"
        },
        "141":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "Skip to three weeks later",
                "she makes a big breakfast",
                "soemthin else"
            ],
            "content":"<div class=\"\"><div> <span>Before Briann even woke up her mom wasplanning how to make her bigger. Her friend knows that she is trying to make Briann the biggest girl eery so she called her today. She told her about a secret place for People who want to get fat or people who are making someone fat.<br>\r\n<br>\r\nShe explanned that when they got o the place that they would set up a scedual. Then they would take you to the \"work room\" where you would see a huge vault of a creamy looking mixture. She would put a mask with a hose atchaed to it that let to the machine. they would turn it on and they Briann would start to drink it. Now even though its a liquid it is digested like a food. now it will take about a week of going for you to tell that she is gaining but once it starts there is no going back.<br>\r\n<br>\r\nThis made Briann's mom so happy they planned to go to this place first thing this morning so...</span></div></div>",
            "created":1282539600,
            "id":941921,
            "title":"The classes"
        },
        "1411":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>After three weeks of the classes which she has gone to a total of 6 classes and it showed. Her eblly had gotten alot bigger. her thighs have grown alot and her uppers arms had also bulked up. She had gained 20 lbs. Her mother does not think she will ever be able to walk. When she crawls her tummy touches the floor. Also her appetite had increased alot to.<br>\r\n<br>\r\nHer mom loves it. She loves seeing her daughter gain so much weigh. Right now they were at a class and Briann was hooked up to the machine.</span></div></div>",
            "created":1282712400,
            "id":944164,
            "title":"Skip to three weeks later"
        },
        "14111":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "At home",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"How is she doing?\" She asked a woman who watched was busy feeding Briann.<br>\r\n<br>\r\n\"Oh very good. I must admit i myself was't sure about such a young girls but she does it good and really likes it.\"<br>\r\n<br>\r\n\"Wait... she likes it. She's just 15 months old. How can she like something?\" <br>\r\n<br>\r\n\"She's young but even then they have minds. Most kids started to understand things before they're able too say things. I remember that with my daughter when she was younger. I hold out a page of a book and asked where's the duck and she points too the duck. When i ask her where's the elephant she points at the....\"<br>\r\n<br>\r\n\"Fine i get it. But how do you know she likes it?\"<br>\r\n<br>\r\n\"Obvious. She is sucking at the end of the hose. Also when it's not one. She she wants more. Besides i never heard from her a noise of complain and i saw her playing with her fat. She smiled while doing it.\"<br>\r\n<br>\r\n\"Six classes in just three weeks. That's about two every week. I'm so proud at her.\"<br>\r\n<br>\r\n\"Well we're done here for today. You two can go home.\"<br>\r\n<br>\r\nShe shut the machine off and she still heard Briann sucking at the end of the hose. Just to get the last few drops of the liquid out of it. The woman pulled the hose out of it and her mother picked her up.<br>\r\n<br>\r\n\"Oh she's getting pretty heavy. A bit longer and i won't be able too carry her.\"<br>\r\n<br>\r\n\"Yeah i was wondering how long did you want to go through with those classes?\"<br>\r\n <br>\r\n\"I don't know. Why?\"<br>\r\n<br>\r\n\"Well this stuff was invented too help people who are underweight or people who suffer from anorexia or people who just wanna become fat. That's your daughter. Well most of those people are well adults and teenagers and a few anorexia kids. But your daughter is the youngest of all. She still needs to grow a lot and it seems like you wanna keep making her fatter.\"<br>\r\n<br>\r\n\"So? What's wrong with that. She get's fat and likes it, she get's fat and i like it, You can use that stuff and you like it, everyone wins.\"<br>\r\n<br>\r\n\"That's the point miss. We invented this stuff for adults and teenagers. we also have a few anorexia kids. But those kids just need a few classes until the're at a normal weight. Just a small amount of that stuff is no problem but if you take many classes...\"<br>\r\n<br>\r\n\"Then what?\" She asked worried. <br>\r\n <br>\r\n\"Well to be honest i don't know. She's the youngest person we ever used it on while it was mend for older people. Together with how much she consumes it could have some... side effects.\"<br>\r\n<br>\r\n\"Side effects?\" She asked now really worried. \"Like what?\"<br>\r\n<br>\r\n\"Well that's it i don't know. We were't planning to use it on a 15 month old one. She's some sort of test person. But who knows. Maybe ther're no side effect and she gains just normal. Well i won't use the word normal... but you know what i mean. Don't worry too much.\"<br>\r\n<br>\r\n\"You used her like a test person?\"<br>\r\n  <br>\r\n\"Well i remember that her mother want her too take classes no matter what and they used that chance too test it on her. But i would't worry too much. The side effects can't be life threatening. We sure of that. I think it might effect her gain. Do you still want to go trough with this?\"<br>\r\n<br>\r\n\"I something wrong then? Don't you wanna continue fattening her?\" <br>\r\n<br>\r\n\"No on contrary. They want to keep her. But since you're her mother i think you should know about the side effects that could take place. It could also lead to faster weight gain. Lucky that this stuff is used to make sure it's fattening but you can't get any health problems that other people have with normal weight gain. So your fine with it?\"<br>\r\n<br>\r\n\"Sure. But tell me if you notice anything all right.\"<br>\r\n<br>\r\n\"I will do that. Don't worry.\" </span></div></div>",
            "created":1283317200,
            "id":948190,
            "title":"Side effects"
        },
        "141111":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "dinner",
                "next class"
            ],
            "content":"<div class=\"\"><div> <span>When Briann and her mom got back home she instantly put  her daughter on the couch. She drinks so much of the mixture that her belly is always stuffed to the brim and very tight. Most of the time her shirt is rode up or just taken off. All Briann can do is look happy and dizzy. Her mom loves it. She rubbes her belly and notices the weight she gains.<br>\r\n<br>\r\n\"Your belly is so big and cute\" said her mom smiling<br>\r\n<br>\r\n\"I am going to keep takin you to those classes, but if there are side efects then we might have to find another way to get you to gain weight.\"<br>\r\n<br>\r\nShe knew Briann could not talk but she just talked to her any way like any parent does. And the fact that Briann liked being fat was no secret. She would play with her belly and even thighs and pat it and then giggle when it would jiggle. She also loved to eat so it was the perfect combo. A child with a parent that likes her being fat, the child likes being fat and she loves to eat.<br>\r\n<br>\r\nHer mom tapped her stuffed aughters belly and her a sloshing sound from all the liquid in her tummy.</span></div></div>",
            "created":1283317200,
            "id":948396,
            "title":"so happy"
        },
        "1411112":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "watch the feding",
                "somethin else"
            ],
            "content":"<div class=\"\"><div> <span>When they arived at the center, Brianns mother found the lady that watched over Briann when she was on the macheine.<br>\r\n<br>\r\n\"Oh her are you ready to hook her up\" asked the lady<br>\r\n<br>\r\n\"Well I wanted to ask you somethin, You usualy stop Briann from drinking,well I would like you to letr her drink from the machen until she cant anymore, She ends up stuffed but every time I think she could drink more\"<br>\r\n<br>\r\n\"Well  remember the side efects we talked about\"<br>\r\n<br>\r\n\"I remember, but until there are some I would like her to drink until she cant any more, let her tell you when to stop\"<br>\r\n<br>\r\n\"Well, ok if you want to do it like that then so can I\"</span></div></div>",
            "created":1283317200,
            "id":948518,
            "title":"next class"
        },
        "14111121":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "At home",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>She hooked Briann up while her mother walked away. She was't too happy about this. Sure she used this stuff too fatten people up but this woman fattened up her own kid that could't even talk. Sure Briann liked it now but when she got older would she still like it? Together with how much this kid consumed and also how much more she would consume now she would probably end up immobile before she was 5. <br>\r\nAt the other hand who was she to tell other people how to raise their children. But even after she told her about the side effects that could happen she still wanted this.<br>\r\n<br>\r\n\"Well let just hope there are no side effects. Right Briann?\"<br>\r\n<br>\r\nBriann looked up hearing her name. She could't say anything but she knew her name was Briann.<br>\r\n<br>\r\n\"Well you gonna have a big meal today. I need too feed you until you feel full. You're always sucking at the end of the hose when it's off so you can eat more. I'm just worried how much more that is.\"<br>\r\n<br>\r\nBriann already was sucking at the end of the hose.<br>\r\n<br>\r\n\"All right here it goes. I hope i do the right thing. If this girl get's teased later because she's fat i sure hope she is't too angry at me. After all it was't me who wanted too use a 15 month old girl. I just got her. I wanted to help underweight people. Not fatten up a baby just because her mom wants her fatter. But of course i don't have anything to say about this.\"<br>\r\n<br>\r\nBriann did understand what this strange woman said but also did't really cared. The delicious liquid was coming out of the hose and she loved too swallow it. She also noticed it went too her belly and noticed how big her belly got lately. She expected it got something to do with each other but her mind did't went further then that.<br>\r\nWith a mother that wanted her fatter Briann was used too eat everything and as much if she could. The same goes for this creamy liquid.<br>\r\n<br>\r\nAfter the right amount was stuffed in the little girls belly she let the machine running even while she was't sure if she did the right thing. <br>\r\nBriann did't seem too mind and still sucked at the end of the hose. More and more of the liquid got in her fat belly. She kept sucking and sucking and did seem too slow down. <br>\r\nShe almost consumed the double amount when her mother came in.<br>\r\n<br>\r\n\"How is she doing?\"<br>\r\n<br>\r\n\"She seems fine. She has a big appetite. She is almost stuffed with the double amount.\"<br>\r\n<br>\r\n\"Good girl Brainn!\" Her mother yelled.<br>\r\n<br>\r\n\"But miss with all what she consumes now even more could lead faster too those side effects.\"<br>\r\n<br>\r\n\"Well you told those side effects are a possibility. You're not 100% sure there are side effects, and even if they are side effect the possible lead to more weight gain. There's nothing wrong with that. And if it's something else you notice it so we can stop. Right?\"<br>\r\n<br>\r\n\"Of course miss. But do you think or your child is happy.\"<br>\r\n<br>\r\n\"You told me she likes it.\"<br>\r\n<br>\r\n\"Yeah she does but i mean when she get's older. I mean she's very overweight and if she comes in touch with other kids her weight could become a problem. Just like teasing because of her weight.\"<br>\r\n<br>\r\n\"Ah i don't think it's gonna be that bad.\" She said calmly wondering is she ever would let Briann go to school.<br>\r\n<br>\r\nBriann already consumed double of the normal amount but was sucking more slowly. Now she looked with a painful face at her mother. <br>\r\n<br>\r\n\"All right stop!\"<br>\r\n<br>\r\nShe stopped the machine and unhooked the mask. Briann was really bloated and seemed too be very happy.<br>\r\n<br>\r\n\"I can't believe how much she ate. If you consider how young she is.\"<br>\r\n<br>\r\n\"Yeah she has a big appetite. Come on Briann let's go home.\"  </span></div></div>",
            "created":1284354000,
            "id":956024,
            "title":"Double or more"
        },
        "141111211":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "she feeds her",
                "she decideds to let her rest"
            ],
            "content":"<div class=\"\"><div> <span>Briann and her mom were at there house sitting on the couch. Briann was only in her diaper because of the size of her stuffed to the brim belly. And her diaper was also threatened by the size of the tummy. Her mom was so happy with how big she had gotten and knew she would keep letting her drink until she was full. <br>\r\n<br>\r\nShe laid a hand on the tight round belly and  started to rub it. She patted it and there was a thump. There would have been a slosh but she was so full that the liquid had no room to move. Briann was just in a daze. She was happy to have her tummy rubbed by her mom. She liked it being so big. ( most kids like big things ) She was also breathing healily from the presure in her belly.<br>\r\n<br>\r\nBriann'a mom was trying to decide weather to try to feed her dinner tonight. She duobted that she would be hungry but really wanted to feed her even more</span></div></div>",
            "created":1284440400,
            "id":956993,
            "title":"At home"
        },
        "1411112111":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Next Class",
                "There appear some side effects"
            ],
            "content":"<div class=\"\"><div> <span>\"Well i will make some food for her. If she don't want to she does't have too eat it.\"<br>\r\n<br>\r\nShe went too the kitchen. She did't wanted too fed Briann too much so if she really was't hungry anymore she was fine with that since she was stuffed with the liquid but she forget one thing. Before she always learned Briann to eat everything on her plate. Briann was too young too understood that this was an exception since she was stuffed.<br>\r\n<br>\r\n\"You know i'm so proud at you Briann.\" Her mother said while she put the oven on. \"You are a true gainer at hart. Don't care what that woman said. You're gonna be a fat girl right?\"<br>\r\n<br>\r\nShe put Briann on the ground. Briann was sitting there and reached forward and fell for over but thanks too her huge belly she did't hurt herself. She put her hand down and crawled over too the kitchen . There was a scraping sound since she needed to drag her belly over the floor. When her mother saw it she smiled.<br>\r\n <br>\r\nThe fat little girl was curious about what her mommy did. But with her mommy feeding her all the time and a tube that let a creamy liquid run right in your mouth and at home normally sit and sleep the little girl also grew pretty lazy. Part that was because she hardly have to do anything. Her mother did anything for her. Just the short crawl too the kitchen made her pretty tired.<br>\r\n<br>\r\n\"Oh Briann did you crawl over all the way to here. What a good girl you are. Let's put you in your chair.\"<br>\r\n<br>\r\nIt took her mother a lot of effort to lift the little girl. She fast noticed that there was a problem. There was no way Briann would be able to fit in her high chair. She was much too fat for that. Maybe her under legs but her thighs would become stuck and there was no way her butt would fit in the chair. She finally decided to put Briann in a normal seat on top of a few phone books. Tight against the table so she would't fall off.<br>\r\n<br>\r\n\"What a beautiful belly you have. You're terrific in your classes. That makes me very happy.\" <br>\r\n<br>\r\nBriann did't really knew what her mother told her but she did knew her mother was very happy so that made her happy. She hoped it got something to with what she did.<br>\r\nHer mother talked too her a few minutes until she heard a bell. She stood up and ran too the oven and came back with two pizza's. She put one in front of herself and the other in front of Briann and cut the one for Briann in eight slices.<br>\r\nBriann was very stuffed still but was used too eat everything on her plate. She slowly ate her first slice that went in her stuffed tummy. The second slice went down even slower and Briann almost need too strangle it down.<br>\r\nShe looked at her mother who saw in how much trouble her little girl was.<br>\r\nShe fast rushed over and shoved the plate away. <br>\r\n<br>\r\n\"Oh Briann if you were full you should have told me.\" Her mother said worried. <br>\r\n <br>\r\nFast she started to rub her daughter's belly. Slowly Briann felt better. But she was still stuffed an just fell asleep in her chair. Her mother smiled and picked her up. She knew that in just a few days time Briann would be too heavy for her too carry anymore.<br>\r\nShe tugged Briann in and kissed her good night but the little girl was already long in dreamland.<br>\r\nShe looked one more time back to see her daughters belly that rose up like a mountain.</span></div></div>",
            "created":1284699600,
            "id":958615,
            "title":"You don't have to if you don't want too"
        },
        "14111121111":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "side afect happens",
                "no side afect"
            ],
            "content":"<div class=\"\"><div> <span>At the next classBriann's mom told the lady that she was happy wih lasttimes results and would like to continue to feed her to her limit.<br>\r\n<br>\r\n\"Well we have found that one of the possible sideaffects can be increased appitite, some of our clients have had a major increase in there appitite and have had to eat alot more, more often to stay full\" said the lady with concearn<br>\r\n<br>\r\n\"Weel, that would not be a problem for me, i dont mind if Briann has a bigger appetite, it just means she eats more and gats fatter, and thats what I want\" said Brianns mother stuburnly<br>\r\n<br>\r\n\"Well ok\" said the lady and took Briann by the hand to the room<br>\r\n<br>\r\nShe hooked her up to the tube. She turned ont he machine and watched. Briann noticed the yummy liquid flow through the tube and started to drink. She loved the taste and was happy that she could now drink until she was full. she did not even know when she was full, she just knew when she ate alot then her tummy would start to hurt.<br>\r\n<br>\r\nBrianns mom was watching from a window and was so happy to see her daughter being filled with the liquid and watching her belly grow as she drank. She was kinda hoping for the side afect of increased appitite would happen. She was courious to see how big her belly could get.</span></div></div>",
            "created":1284786000,
            "id":959073,
            "title":"sideaffect:increased appitite"
        },
        "141111211111":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Dinner time",
                "Somethng else"
            ],
            "content":"<div class=\"\"><div> <span>Briann was happy sucking at the end of the tube while she got filled with the liquid. She loved the taste and get fatter. The little girl did't know that inside her body the liquid had another effect. It slowly started to increase her appetite. It would take some time to take effect but it happened.<br>\r\n<br>\r\n\"I'm not happy doing this. That little girl is slowly turning into a blob. Some people should't be allowed too have children. If this stuff really increases her appetite and i need to stuff her and also the more food she eats at home she will gain like crazy. I took this job too help people. Not too fatten up a kid that can't even tie her own shoes.\"<br>\r\n<br>\r\nShe looked at the little girl. Seeing how her clothes slowly became a bit tighter. She saw that the little girl spread her legs as much if she could so her belly could lay in her lap. She saw that while crawling her belly touched the ground. <br>\r\n<br>\r\n\"If we go on she will become so fat that her legs won't be able to touch the ground anymore. It's that this is my job and it pays good or i would refuse doing it.\"<br>\r\n<br>\r\nBriann kept sucking and sucking and when she finally felt full she put on a painful look what was a sign for the lady to stop the machine.<br>\r\n<br>\r\n\"Oh Briann did you enjoy the feeding? Oh who is a fat little piggy? It's you. It's you.\" Her mother said and tickled her.<br>\r\n<br>\r\n\"Eh miss... did you think that she might be very uncomfortable? Being at this size at her age?\"<br>\r\n<br>\r\n\"No not really. Kids at her age don't do that much. I'm sure she'll be all fine.\" <br>\r\n<br>\r\nHer mother picked her up and knew that today was probably the last time she would pick her, or rather would be able to pick her up.<br>\r\nLucky her cousin was very good at building things. So when this all started she asked him for a very strong super sized stroller. He thought it would be fun doing it so he agreed doing it. But he also wanted too see Briann. He would come over today.<br>\r\nWhile they drove home in Briann's little body something happened. The little girl started to feel hungry again even while she consumed more then the double amount of the creamy liquid then what she was used too. She did't know why this was but knew she got hungry.<br>\r\nAt home her mother put her in front of the television.<br>\r\n<br>\r\n\"I wonder if she's hungry. She hardly eat anything yesterday. At the other hand those side effects could increase her appetite. But maybe it did't.\"<br>\r\n<br>\r\nWhile she was thinking she heard the doorbell. Fast she ran too the door and opened it. It was her cousin Robbie with a large stroller.<br>\r\n<br>\r\n\"Hello Robbie it's good to see you. Hee you did it. Oh i'm so glad with this.\"<br>\r\n<br>\r\n\"It's very strong. Rust free steel. Strong fabric should be able too hold about 500 pounds i did my best for it.\" Robbie said. \"But for which baby is it?\"<br>\r\n<br>\r\n\"Come in. It's for Briann.\"<br>\r\n<br>\r\nRobbie knew his cousin had something for fat kids. When they were younger they visit often and some times while watching T.V he saw her during talk shows about obese kids her eyes almost glued too the T.V. Of course as kid she denied it but when she got older she admit she had something for it. He wondered hoe Briann looked like and walked in.<br>\r\n<br>\r\n\"Wow! Well she sure has grown!\" Robbie said while he saw Briann. \"Cousin she's huge!\"<br>\r\n<br>\r\nBriann looked at her mother. <br>\r\n<br>\r\n\"Hungy! Hungy!\" She managed too say.<br>\r\n<br>\r\n\"Seems she's hungry.\" Robbie said.<br>\r\n<br>\r\nBriann's mother ran too the kitchen too prepare dinner.<br>\r\n<br>\r\n\"I can't let my little girl die from hunger. Would you like it to join us?\"<br>\r\n<br>\r\n\"Oh i would love too. I eat way too much junk food.\"  <br>\r\n  </span></div></div>",
            "created":1285045200,
            "id":960882,
            "title":"Super sized super strong stroller"
        },
        "1411112111111":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "diaper tears",
                "somthing else"
            ],
            "content":"<div class=\"\"><div> <span>Briann's mom put Briann in her high chair which was creking under the huge weight of the huge toddler. Then she and Robbie. There was a big amount of food on the table, and Briann's mom hoped her daughter would be able to eat most of it.<br>\r\n<br>\r\nRobbie made himself a small plate and started to eat. Briann's mother did the same. Then she made a rather big plate for Briann. She was glad Briann had earned to feed herself a few months before so she could just watch her stuff herself. Briann started to quickly feed herself and soon her still very stuffed belly began to grow again. Had there not been a side affect then she would have felt very full but right now all she felt was hungry.<br>\r\n<br>\r\n\"She sure is a big eater\" said Robbie with a look of amazment<br>\r\n<br>\r\n\"Ya, im pround of her for that\" said her mom with a smile<br>\r\n<br>\r\nBrianns diaper was being streched to its limets and looked as if it would tear of from her tummy growing with all the food being stuffed inside it. By now she was on her 3rd plate and Robbie and Brianns mother were no longer eating but watching how much Briann was eating.</span></div></div>",
            "created":1285477200,
            "id":963682,
            "title":"Dinner time"
        },
        "14111121111111":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "She also wants the rest of the family too see Briann",
                "Next class"
            ],
            "content":"<div class=\"\"><div> <span>\"Well there's nothing wrong with her appetite. At least she won't suffer from anorexia.\"<br>\r\n<br>\r\n\"I'm just so proud of her. She's such a good girl.\"<br>\r\n<br>\r\nRobbie was't sure if fattening a toddler up was something to be proud of or was wrong but he had no problem with it if his cousin wanted to do it. After all he was only child, younger then her, single and still virgin so what did he knew about raising a child.<br>\r\n<br>\r\nSuddenly he heard a strange sound. It sounded like Velcro when you open it. Then he saw what it was Briann's diaper that teared of of her and fell open. Luckily enough it was clean and her belly that was resting in her lap covering her private parts.<br>\r\nBriann's mother must admit that she was a bit worried about when she saw Briann's chest were she saw some small boobs. <br>\r\n<br>\r\n\"Wow Briann you grow out of your diaper.\" Her mother said proudly.<br>\r\n<br>\r\n\"So what does she need to wear now? If her diapers don't fit?\"<br>\r\n<br>\r\n\"Well i just have to buy bigger diapers. You know. For old people. I'm sure she fit's in those. Until she learns how to use the bathroom.\"<br>\r\n<br>\r\nRobbie did't thought that Briann seemed like she would put effort in it too find out how too use the bathroom. Also the fact she could't even walk. Only crawl and even then with her belly dragging over the floor. Those things combined give him the thought that Briann would't learn how to use the bathroom anytime soon.<br>\r\nBriann belched loud after her plate was empty and rubbed her belly with her hands. She seemed very happy and satisfied.<br>\r\n<br>\r\n\"Well i guess it's time to put her in bed. She has a lot of eating too do and i still need to wash her.\"<br>\r\n<br>\r\n\"Oh can i come and watch?\" Robbie wanted to have kids once. He knew he first need to have a relationship with a girl but it could't hurt to knew how you need to wash a 15 month old.<br>\r\nBriann was able to sit in the tub and with the weight of her huge belly Her mother was't too worried that she would fell on her back and drown but still she kept a eye on her. <br>\r\nBriann loved being washed. She also liked to splash in the water so much that half of the water was out of the tub.<br>\r\n <br>\r\nHer mother started to wash her admiring any curve, love handle and roll of fat. She washed her carefully she she could feel them. She did't saw this like wrong. Just washing her daughter. That she liked to at the same time feel the fat was just something extra.<br>\r\n<br>\r\nAfter she tugged Briann in bed she and Robbie walked downstairs. <br>\r\n<br>\r\n\"Well Robbie I'm really glad you made that super strong stroller for her.\"<br>\r\n<br>\r\n\"That's fine. I enjoyed making it. Besides she really needed it. I'm for sure she's the biggest kid of the family. At least compared to age and height.\"<br>\r\n<br>\r\n\"I hope she is. It was fun seeing you again Robbie. You should visit more often.\"<br>\r\n<br>\r\nShe waved Robbie good bye and walked back inside thinking of her fat growing daughter.      </span></div></div>",
            "created":1285736400,
            "id":965373,
            "title":"There goes the diaper "
        },
        "141111211111112":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "right this way",
                "there is a problem"
            ],
            "content":"<div class=\"\"><div> <span>It was time for the next class and Briann was ridin in the car with her mom. The seat belt was cutting into her large soft belly. Her mother saw this and made a note to adjust the belt. She didnt want her angel to be uncoffertable.<br>\r\n<br>\r\n\"Are you ready to be fed\" said Brianns mom in a baby talk voice<br>\r\n<br>\r\nShe couldnt wait to see how much Briann would eat this time. She had been alot hugryer lately and would take aeveral hours just to fill her up. With this came her growing even faster. Her mom could no longer carry her so she used the new stroller every time she had to take Briann with her. Brianns mom favorite part was the belly. It was so round and soft. She also loved it when it was very stuffed and she could here all the sloshing inside .<br>\r\n<br>\r\nThey arrived at the center and Brianns mom got out, inbuckeled Briann, put her in the stroller, and walked in. The lady at the front desk, they one who keeps warning her about the side affects, walked up and said...</span></div></div>",
            "created":1285995600,
            "id":967217,
            "title":"Next class"
        },
        "1411112111111122":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Feed her more",
                "Maybe i should stop"
            ],
            "content":"<div class=\"\"><div> <span>\"Hello nice to see you again. Listen there's a small problem.\"<br>\r\n<br>\r\n\"What is that?\"<br>\r\n<br>\r\n\"Well please come with me too my office.\" She said.<br>\r\n<br>\r\nThe two followed her into her office. Briann saw a box of cookies on the table and tried to reach it. But her short fat arms were unable to reach it and her mother was too busy listening.<br>\r\n<br>\r\n\"Well you see some people used your daughter more or less like a test person. We have some other people now who're not too happy about using a 15 month old like a test person. Not only that... you daughter eats way more then she's supposed to. It may cause some problems. In her weight but also in acting.\"<br>\r\n<br>\r\n\"Like what?\" <br>\r\n<br>\r\n\"Well her big appetite will make her try to eat food more often. Especially if it's fat or greasy. It could make her really greedy if it's about food. That might take some trouble when she meets other kids. I also told you that some people are't happy using a 15 month old. If they also hear that she eats more then she's supposed to...\"<br>\r\n <br>\r\n\"They don't know that?\"<br>\r\n<br>\r\n\"Well not yet. Maybe they won't but i'm really worried about her. I mean you can't even pick her up, and since we are talking here she trying to take the cookies if you have't noticed.\"<br>\r\n<br>\r\n\"I like my daughter fatter and she likes it too.\"<br>\r\n<br>\r\n\"She's just 15 months old. I don't think she can decides it jet. Do you really think you daughter will like being fat if she's older? I mean she's highly obese now. I think it's time to stop now.\"<br>\r\n<br>\r\n\"We both like her fatter. I thought you were here too make her fatter. Not too tell me how to raise my kid!\"<br>\r\n<br>\r\n\"Miss i'm not trying too tell you how too raise you kid but it could go very wrong. She will try to get greasy and fatty food and with her increased appetite she will want to eat a lot of it together with the liquid she will gain like crazy. Point two is that i can get in trouble feeding your daughter more, and finally she can't even walk. She can hardly move. Don't you think she's fat enough now? Think careful about this.\"<br>\r\n<br>\r\nHer mother looked at Briann who still tried to get the cookies.  </span></div></div>",
            "created":1286082000,
            "id":967759,
            "title":"Problem's"
        },
        "14111121111111221":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "alot more- hours",
                "just a little longer"
            ],
            "content":"<div class=\"\"><div> <span>\"I still want to feed her here. If she grows up to not like it then I can help her lose the weight. Havent you heard about the 400lbs 7 year old who lost all of that weight\"<br>\r\n<br>\r\n\"Well, i guess I have no chose but to feed her, my boss would be mad if I kept feeding a 15 month old but he would be even more mad if I turned down a paying costmure.\" said the lady with a worried look<br>\r\n<br>\r\nThey got up and Briann's mom handed her a cookie and they went to the room. When they got there they did the normal procedure of hooking Briann up the the hose, and turning on the machine. Briann started to suck on the hose happily as the liquid came through. She loved the stuff.<br>\r\n<br>\r\nHer mom watched her from the window. She loved to see her daughters belly grow as it became full. And watching her shirt ride up.<br>\r\n<br>\r\nAfter a while her mom noticed that she had drank alot but was still greedly sucking from the hose. With every gulb her big stuffed belly came out onto her lap even more. Her mom began to get excited to see how much longer she would drink.</span></div></div>",
            "created":1286082000,
            "id":967776,
            "title":"Feed her more"
        },
        "141111211111112211":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Go back home",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Briann's mother slowly got a bit worried. Briann kept sucking and sucking at the hose. Her belly kept growing.<br>\r\n<br>\r\n\"Is she all right?\" Her mother asked.<br>\r\n<br>\r\n\"Well i would't say all right since she seems to got a taste for this liquid. Normally she drank a lot of it but with her increased appetite and growing hunger well she just needs and wants a lot more.\"<br>\r\n<br>\r\nBriann seemed very happy. Slowly her shirt rode more up. Also other parts of her body started growing. Briann did't seemed like she wanted to stop. She just kept sucking and sucking.<br>\r\n<br>\r\n\"Listen miss, I don't think this can be good for her. Should't i stop?\"<br>\r\n<br>\r\n\"No no she can handle this. Stop her when she's full.\"<br>\r\n<br>\r\nThe woman looked in disbelief at Briann's mother Who did't noticed it. This woman should't be allowed to have kids. She thought.<br>\r\nBriann kept sucking. Suddenly with a loud: RIIIIIIIIIIP! Her shirt split in half and also her pant became tighter while her butt thighs and legs got fatter. While also her pants split. Briann only wore her underwear and diaper that woul't stay on long.<br>\r\nBriann's mother took a seat to watch her growing daughter. <br>\r\nSome time later Briann was still sucking. A bit slower since she became tired. Her underwear and diaper ripped of and her belly was so big it reached past her feet. <br>\r\nFinally Briann stopped sucking and the woman was relieved when she could stop and remove the hose.<br>\r\nBriann belched loudly. She felt strange since while she was eating she grew more hungrier and more but now she felt very stuffed.<br>\r\n<br>\r\n\"I can't believe how much she consumed.\" The woman said. <br>\r\n<br>\r\n \"I knew my little girl could do it. Way too go Briann. I'm so proud at you.\"<br>\r\n<br>\r\n\"Miss i think all this weight could effect her body. You know we made this liquid to make people gain but made sure it would't cause any health problems, but i think without those problems such a  high weight is't good for her.\"<br>\r\n<br>\r\n\"You can worry about you kid i worry about mine.\" Briann's mother said and walked over to her obese daughter.<br>\r\n<br>\r\n\"Hee honey. How was it?'<br>\r\n<br>\r\nBriann's only answer was a loud belch and she moved lightly.<br>\r\n<br>\r\n\"Eh... Miss perhaps i should get a towel for your daughter since she is't wearing anything.\"<br>\r\n<br>\r\n\"That would be nice.\" Briann's mother asked.<br>\r\n<br>\r\n\"I'm so glad that Robbie made this chair so i can get you in and out the car without lifting since i won't be able too do that anymore.\"<br>\r\n<br>\r\n\"Miss are you aware that she consumed way more then she should be supposed too. Her urge for food an cause her too do very strange things, as long if she can get food.\"<br>\r\n<br>\r\n\"Oh don't worry i'll make sure she get's enough food.\"</span></div></div>",
            "created":1286254800,
            "id":969316,
            "title":"Super sized toddler "
        },
        "1411112111111122112":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "ask to put her on the hose again",
                "just take her home and feed her there"
            ],
            "content":"<div class=\"\"><div> <span>Briann's mom and the lady talked for a whiole longer but her mom noticed something. Briann was whining and reaching for the hose.<br>\r\n<br>\r\n\"Is she hungry already\" asked her mom a little excited<br>\r\n<br>\r\n\"Well it is one of the sideaffects that I told you it will be hard to keep her full if you can at all, which is not good\" said the lady in a I told you so voice<br>\r\n<br>\r\nBriann's mom did start to wonder if she should ask if she could be put back on the haose for  little longer, but she also knew how much she had already drank. She Didnt want to hurt her. What if her belly actually poped. She looked down and saw how big it was, it reached her knees. Her belly had never been that full before. She even patted her belly and it was as tight as a drum and hard as a rock. But she also wanted her daughter to gain weight and if she was hungry to let her eat. <br>\r\n<br>\r\nWhat should she do</span></div></div>",
            "created":1286341200,
            "id":969910,
            "title":"Something else"
        },
        "14111121111111221122":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "She feeds Briann until she's full",
                "She feeds Briann all the food in the house but she's still hungry"
            ],
            "content":"<div class=\"\"><div> <span>While the thought of putting her back on the hose was in her head she decided to just take Briann home. She already drank awfully much. Even more and she would probably pop. She would buy some food on the way home.<br>\r\n<br>\r\n\"Do you remember that you needed to wake up around 0:00 and 6:00 to feed the baby? At least my baby did that.\"<br>\r\n<br>\r\n\"Yeah i remember that. Briann was just like that. wake up in the middle of the night.\"<br>\r\n<br>\r\n\"Well with her age it's possible that you need to wake up again in the middle of the night too feed her. Maybe not but it's a possibility. Keep that in mind.\"<br>\r\n<br>\r\nBriann's mother looked at her daughter. She was so happy with how fat she was getting. Just like what she always wanted. A fat daughter. Now her dream became real. If she needed to wake up a few times at night she was fine with that.<br>\r\nShe looked at her Briann and saw her huge belly. Her legs surrounded by rolls of fat. Her huge rear that looked like two basketballs and her round upper arms that looked like little pillows that were slowly swallowing up her under arms, and her pink puffy cheeks in the face of her daughter. She felt very proud at her daughter<br>\r\nBriann started too whine harder. Normal the smallest whine was enough to let her mother feed her was was in reach. She did't understand what was going on since a hose filled with a creamy liquid was so close.<br>\r\nFinally her mother came over too her but did't gave her the hose but wheeled her out what only caused her too whine harder.<br>\r\n<br>\r\n\"Don't worry sweetie. We get some food soon.\"<br>\r\n<br>\r\nBriann was too young too really understood every word but she knew that mommy used sweetie for her and also knew what food mend. So she knew she was getting food. But she still did't understood why they went out while inside was a creamy liquid ready for her. Her mother drove straight to Mc Donals for three big mac menu's with a lot of chicken nuggets. That should be enough to keep her occupied till she was home.<br>\r\nBriann showed that she was really hungry the way she was wolfing down her food.<br>\r\n<br>\r\n\"Oh Briann is fattening up so nicely. I'm so glad that you got so fat. It's what i always wanted.\"<br>\r\n<br>\r\nBriann was still too busy eating to listen too her mother and even she would have listened then she would't have understand most of it. But she would have understood that her mother was happy.   <br>\r\n<br>\r\nBrianns mother was a bit worried. That was more because of what the woman said. That she needed to feed Briann even more. Sure she liked feeding Briann but getting hungry again in such a short time then it would be hard keeping her full and she could't stand her daughter being hungry.<br>\r\nWhen she got home and opened the door to get Briann out. In her mouth she thanked Robbie again for the super sized super strong stroller. Robbie even made it so you could get her easy in and out the car. More or less.<br>\r\n<br>\r\n\"So Briann. I guess you're hungry.\" Her mother said while she wheeled her inside. \"So just watch some T.V here and i will make you some food.\"<br>\r\n<br>\r\nShe put some cartoons on and started to make food as fast if she could<br>\r\n</span></div></div>",
            "created":1286686800,
            "id":972334,
            "title":"Hungry Briann"
        },
        "141111211111112211221":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "follow her mom",
                "stay with BRiann and Robbie"
            ],
            "content":"<div class=\"\"><div> <span>Once she put Briann onthe couch she went into the kitchen and started to look for things to feed her. She grabbed a bag of chips ans took them to her to hold her off for a while until she had time to make somthing. She gave her the bag of chips and went back to the kitchen. She looked in the fridge and found some leftover pizza, she put it in the microwave and looked for more food.<br>\r\n<br>\r\nShe found some makes for hamburgers and fries so she started too make them. Once she microwave went off he took the warm slices of pizza to Briann. When she went into the living room she saw that she had eatin all the chips and her belly was slightly bigger. Remember that all her clothes were off so it was very easy to see her tummy. She could tell Briann was still hungry because she was reaching for the plate. So she gave her the plate and went to finish the other food.<br>\r\n<br>\r\nAfter a while she had finished making the burgers and fries, there were 6 burgers and a big bowl of fries. She went into the living room and sat next to her stuffed but hungry daughter and started to feed her the food. With every bite the huge belly got a little bigger and her mom was in heven.<br>\r\n<br>\r\nFinaly after a while all the food was in her very big round and hard tummy and her mom was rubbing it. She knew none of her clothes, or diapers would fit so she needed to go to the store to get some biggers ones. However she knew she could not take BRiann with her. People would all ready make comments to her about her being fat, but nude to. So she had to find someone to keep her.<br>\r\n<br>\r\nShe quickly thought of someone,Robbie.<br>\r\n<br>\r\nShe called Robbie and he agreeed and said he would be there as soon as he could. Now all BRiann's mom had to worry about was BRiann getting hungry before she got back, or even left. A few minutes later Robbie came to the door and Her mom went out.</span></div></div>",
            "created":1286686800,
            "id":972484,
            "title":"She feeds Briann until she's full"
        },
        "1411112111111122112211":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "She talk about getting pregnant too Robbie",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>She made sure she told Robbie to feed Briann when ever she wanted and knew that that would be soon. If this went on like this Briann would become fat so fast. She loved how fat she was. She liked it to have girls with big round bellies. Maybe she could get pregnant again. But at the other hand there was a chance that she would get a boy and she really wanted a girl. She heard about a special diet that would stimulate  a unborn child too become a girl but it was't 100% sure.<br>\r\n<br>\r\n\"But i would like it too have another child like Briann who i could fatten up. But there's a chance it won't be a girl.\"<br>\r\n<br>\r\nOf course you also need to have a boyfriend to get pregnant first. Briann's father left her after one night of sex. Later she found out she was pregnant and her parents were furious. She was planning abortion but before the abortion she suddenly felt it moving and suddenly she knew she wanted to keep,it. She was glad she did. Else she never would have Briann. Problem is most man don't marry woman who already has a child. Especially if this woman likes it to fatten a child. Maybe she could use a sperm donor or just a one night stand. But that would't be entirely fair against the child and the father.<br>\r\n<br>\r\n\"Now where was that store? A here it is.\"<br>\r\n<br>\r\nShe stopped for an big store called; the super size clothing store. They must have some clothes for Briann there and also some super sized diapers.<br>\r\n<br>\r\nShe walked in and walked too a clerk.<br>\r\n<br>\r\n\"Excuse me but were can i find big diapers and big clothing for a 15 month old?\"<br>\r\n<br>\r\n\"On the second floor miss.\" The Clerk answered.<br>\r\n<br>\r\nShe easy found the diapers. Just the biggest that would be fine but now came the hard part. Clothes. She did't took Briann with her so they could't take her size and she did't knew her size. Not with how much she gained the last time. That would be pretty pointless since she gained each day. Now even faster. <br>\r\nShe decided not too buy much since she would't be able to were it for long. Just two dresses in the biggest size. Maybe they would be a bit loose on her that would't take long. She also took some super sized stretchy underwear.<br>\r\nShe paid for the clothes and diapers and fast drove back.<br>\r\n<br>\r\n\"Oh Briann you're growing so fast. You make your mother very happy.\"<br>\r\n<br>\r\nShe suddenly stopped and drove too the super market.<br>\r\n<br>\r\n\"I can better do some shopping. Briann is growing hungry so fast. What do i need? I think some cookies and pretzels at least i don't need to make those. Further some pizza's and other stuff that's easily too make... and of course some junk food.\"<br>\r\n <br>\r\nIt did't take her long to buy all the food and came back home. She picked up all thighs and walked in. She already heard Briann whining.<br>\r\n<br>\r\n\"What's wrong?\" She asked worried.<br>\r\n<br>\r\n\"Well she wanted food. I gave her a whole box of cookies and three chocolate bars and she still wants more.\"<br>\r\n<br>\r\n\"Well then give her some more!\" She said and gave Briann a bag pretzels she started eating. \"I told you she's very hungry.\"<br>\r\n<br>\r\n\"She's indeed.\"<br>\r\n<br>\r\n\"Yeah but she's a bit lonely. I thought about taking a second child.\"<br>\r\n<br>\r\n </span></div></div>",
            "created":1286946000,
            "id":974245,
            "title":"Buying clothes"
        },
        "14111121111111221122112":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "at mcdonalds",
                "after. Can she move?"
            ],
            "content":"<div class=\"\"><div> <span>Her mom was broken out of her thoughts by Briann screaming \" HUNGRYYYYYYYYYYY\"<br>\r\nShe heard this and instantly went into the kitchen and grabbed a bag of chips. She opened them and gave them to Briann and she instantly started shoveling the chips into her mouth. Briann's mom knew this would not last long so she had to think of what to feed her next. Finaly she decided to take her somewere to eat. <br>\r\n<br>\r\nShe decided to take her to Mcdonalds. It was one of Briann's favorite places to eat and she had enogh money to get her anything to eat, which she knew would be alot. Thinking of this she got excited. Thinking of how big and full her tummy would be. But she was only in a diaper. It would be hard to stop her from eating to dress her so she decided to just take her in her diaper. <br>\r\n<br>\r\nShe grabbed another bag of chips and loaded Briann into the car<br>\r\n</span></div></div>",
            "created":1287464400,
            "id":977806,
            "title":"Something else"
        },
        "141111211111112211221121":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "She's still hungry",
                "Something happens"
            ],
            "content":"<div class=\"\"><div> <span>Briann looked surprised at her mother with asking eyes.<br>\r\n<br>\r\n\"We're going to MC DONALDS!\" She said clearly.<br>\r\n<br>\r\nBriann did't understand much, partly since she was too lazy too put a lot effort in understanding or talking. As long if her mother knew what hungry mend it was fine but she did understand Mc Donalds since the food there tasted so good she for once did effort too reminding it. She still could't say it but understood it mend she got delicious food. <br>\r\nThe sweet giggling and happy smile showed how much she liked it. But soon she focused on her pretzels again.<br>\r\n<br>\r\n\"Oh Briann you're getting so fat and round and i'm so proud at you. You like getting fatter don't you?\"<br>\r\n<br>\r\nBriann did't paid any attention too what her mother said and just ate her pretzels.<br>\r\nHer mother finally parked the car and helped Briann in her new stroller and wheeled her inside. She heard whispering and heard some words like: \"So fat\" \"obese\" \"What does she eat?\" and \"How much does she weigh?\" She felt kind or proud hearing this. She got in line. A lot of people looked at her. Not just because of Briann's size but also since she only wore a diaper. This clearly showed how fat she really was.<br>\r\n<br>\r\n\"Yes miss may i take your order?\" A woman asked.<br>\r\n<br>\r\nIt was clearly that she was't happy having such an obese baby in just her diaper inside. Not that she was't used too obese people. There were enough obese people who came here but seeing a little girl that could 't be older that 1 and a half year and already was so obese and almost naked disgusted her.<br>\r\n<br>\r\n\"Well one burger with fries and a salad and three big mac menu's super sized.\" Briann's mother said.<br>\r\n<br>\r\nIt was obvious the woman knew that The three menu's were for the obese toddler what disgusted her even more. She could't really blame the little girl. It was't her fault her mom fattened her. But she put on a forced smile and said: \"Of course miss.\" As soon as she turned her smile disappeared.<br>\r\n<br>\r\nA few minutes later She looked smiling at Briann who wolfed her food down without slowing down for a moment. She could clearly see her belly getting bigger while it filled with food.<br>\r\n<br>\r\n\"Can't believe she does that!\" A voice said.<br>\r\n<br>\r\nBriann's mother looked over her shoulder to see who said that. She saw a tall thin woman with three kids. A chubby girl in a pink dress, with a pink bow in her blond hair and two thin boys in sport clothing both with short blond hair. <br>\r\n<br>\r\n\"What's wrong with what i do?\" She asked angry.<br>\r\n<br>\r\n\"How you're fattening your child. You should't be allowed to take a child. She's very uncomfortable and unhealthy.\"<br>\r\n<br>\r\n\"O yeah. Well my daughter is beautiful, happy and healthy!\"<br>\r\n<br>\r\nWhile the woman and her kids walked away she screamed: \"Besides your daughter also is't miss skinny either!\"<br>\r\n<br>\r\nThe chubby girl looked over her shoulder at Briann an her mother with a strange look in her eyes.<br>\r\nBriann's mother focused on Briann again and saw she finished her last fry.<br>\r\n  </span></div></div>",
            "created":1287550800,
            "id":978124,
            "title":"Food and insults"
        },
        "1411112111111122112211211":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "skinny",
                "chubby/obease"
            ],
            "content":"<div class=\"\"><div> <span>Her mother smiled when she saw the last fri go through her daughters lips and into her round bloated belly. She looked at Briann's belly. It was so big and filled most of her lap. She even noticed that her thighs was being strained but the diaper.<br>\r\n<br>\r\n\"Hungry\" said Briann in almost a shout <br>\r\n<br>\r\nThis made people look and make some more insults in hushed tones. All her mom did was smile and go back up to the counter. She ordered 4 bigmacs, 2 double cheese burgers, 4 packs of fries, and 3 milkshakes. She was almost certain this would fill Briann up but kinda hoped it wouldnt. Even if i didnt she was glad to imagin how big her tummy would get after all this food<br>\r\n<br>\r\n\"I wonder if the diaper can hold\" she quietly asked herself<br>\r\n<br>\r\nShe brought back the food and saw that another girl was sitting next to Briann<br>\r\n<br>\r\nShe was...</span></div></div>",
            "created":1287550800,
            "id":978252,
            "title":"She's still hungry"
        },
        "14111121111111221122112112":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "The set up a play date",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Very fat. Not as fat if Briann but there were't many kids that would reach Briann's size. She saw the two kids looking at each other. She noticed before that kids who are't able to talk knew a strange way to communicate with the other. Just like she heard a woman tell that her two year old talked too his half year old sister while she could't talk yet.<br>\r\n<br>\r\n\"Oh sorry is this your kid?\" A young woman asked.<br>\r\n<br>\r\n\"Eh yes This is Briann.\" She said.<br>\r\n<br>\r\nShe looked at the woman. Kind of chubby with a potbelly. Red brown hair till halfway her back and a perfect cute face with a smooth skin. She could't be older then twenty.<br>\r\nHer kid's her was red. Her mother was chubby but she was really fat. Her belly bugled out forward in her lap between her big thighs. Her flabby arms rested next each side with on top a face with puffy, pink cheeks and a double chin.<br>\r\n<br>\r\n\"What's her name?\" She asked curious.<br>\r\n<br>\r\n\"Gwen. Wow your daughter has a healthy appetite. I suppose that's all for her.\" <br>\r\n<br>\r\n\"Yes it is. But it seems your Gwen also has an healthy appetite.\"<br>\r\n<br>\r\n\"Eh yeah she does. Say could you keep an eye on her for a few minutes so i can get some food?\"<br>\r\n<br>\r\n\"Sure no problem.\" <br>\r\n<br>\r\nBriann and Gwen still seemed interested in each other but Briann was busy eating her food while looking at Gwen. I wonder if that woman likes her kid's weight? She thought.<br>\r\nGwen was close enough to touch Briann's belly and Briann did the same with her belly. Soon they were both playing with each others fat.<br>\r\n<br>\r\n\"So they seem to like each other. That's nice. Normally Gwen has trouble playing with other kids.\"<br>\r\n<br>\r\n\"Well Gwen looks really cute.\"<br>\r\n<br>\r\n\"Yeah she does. Well i hope she eats her food. I like her even more if she's stuffed with food. I like it so much that she's so fat and...\"<br>\r\n<br>\r\nShe stopped and looked a bit afraid at Briann's mother. She just more or less said she liked fattening her kid. This woman would probably think she was a freak. She seemed so nice and the two kids seemed to get along so good. But the woman looked at her with a friendly smile. <br>\r\n<br>\r\n\"Come sit here.\"<br>\r\n<br>\r\nShe placed the food in front of her daughter and went sitting next too Briann's mother.<br>\r\n<br>\r\n\"Please don't see me like a freak. It's just that...\"<br>\r\n<br>\r\n\"Ssssh. Don't worry. I like Briann also fat and i want her to get fatter. That's why i take her too special classes were she gains weight.\"<br>\r\n<br>\r\n\"Really? What does her father say?\"<br>\r\n<br>\r\n\"He left before Briann was born. For him I was just a one night stand. Bastard. He did't even knew i got pregnant. I thought about abortion but when i felt it moving it was just... well you know how it feels. I wanted to keep it. How about Gwen's father?\"<br>\r\n<br>\r\n\"Her father? I walked home late one night and got raped by a freak. I also thought about abortion but i always wanted a child... Well maybe not this early but... I struggled a bit with myself about keep it or abortion. But it finally became keeping. I'm glad i did. I love her so much. I also loves how fat she's getting. I just hope she looks like me and not like her father. You said something about classes to gain weight? Can i join too?<br>\r\n <br>\r\n\"I think so. I don't see why not. Here i give you the address.\"<br>\r\n<br>\r\nWhile the mothers kept talking and liked each other more each minute the two fat toddlers were eating and playing with each others fat and saying things just by looking at each other and also were liking the other more each minute.  </span></div></div>",
            "created":1287723600,
            "id":979153,
            "title":"Gwen"
        },
        "141111211111112211221121121":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "continue",
                "skip to playdate"
            ],
            "content":"<div class=\"\"><div> <span>\"Well,why dont we set up a play date\" said the women nicley \"I mean since the kids get along so well,we could feed them to\"<br>\r\n<br>\r\n\"Oh ya, we will danfenently have to feed htem, those classes I was talking about have made her very hungry,if you cant tell\" said Briann's mom<br>\r\n<br>\r\nThey extange addresses and also phone numbers. Meanwhile the kids have been very happy feeling each others fat, expessaly as Briann's belly is growing from all the food. Gwen had lifted up her shirt so Briann could touch her tummy. Not that lifting made a big difference, the belly was already up to her belly button from the food she had also just ate.<br>\r\n<br>\r\n\"They look so cute, with there bellies showin and them playing with them\" said the women with a smile<br>\r\n<br>\r\n\"Yeah,imagine how there bellies will be when you come over and feed them\" said Briann's mom<br>\r\n<br>\r\nHow much can Gwen eat\" asked Briann's mom so she knew how much food to get for the occasion<br>\r\n<br>\r\n\"Endlessly, she only stops when there is no more food\" <br>\r\n<br>\r\n\"Oh that is great\" said Briann's mom \"I cant wait to feed her and Briann\"</span></div></div>",
            "created":1287723600,
            "id":979257,
            "title":"play/feed date"
        },
        "1411112111111122112211211212":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Continue feeding",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Well Briann. Are you looking forward?\" Her mother asked and looked at her.<br>\r\n<br>\r\nBriann was playing with some of her toys while her mother was busy cooking. Gwen would come soon and she wanted to make sure she had enough food. That was why she did some grocery shopping and was now cooking to make sure she had enough food. <br>\r\nBriann leaned against the wall. Briann never had been the most active kid but since she started the classes she became even lazier if that was possible. Her mother did't mind. How lazier her daughter was mend she would't burn any calories what would mend she would be fatter.<br>\r\n<br>\r\n\"Hungry!\" Briann screamed.<br>\r\n<br>\r\n\"Oh Briann just wait a few more minutes. Then Gwen will come over and then you both get fed. I promise.\"<br>\r\n<br>\r\nBriann did't understand it but the comforting tone made her realize that she soon would be fed. Her mother always used that tone if she would get some food soon.<br>\r\nShe crawled a yard over a blanket her mother placed her on. She smiled since she liked the feeling when she dragged her fat belly over the floor. But she got tired even crawling a yard. <br>\r\nThen she heard the doorbell. Her mother fast run too the front door. She came back with Gwen and her mother. She remembered Gwen from the Mc donalds.<br>\r\n<br>\r\n\"Hello Briann. Nice to see you again.\" Gwen's mother said and placed Gwen also on the blanket.<br>\r\n<br>\r\nBriann and Gwen looked at each other, and started too communicate on the way only babies can. Soon they remembered about the playing with each others fat and just a few seconds later they started to do it again and both kids liked it. Soon they were giggling and even forget their hunger for a moment.<br>\r\n<br>\r\n\"Ah i see you made some food.\" Gwen's mother said.<br>\r\n<br>\r\n\"Yeah since you said Gwen eats a lot i decided to make some food. But Briann is also hungry. I did't fed her so much like i would normally so she could eat some more now. But i know that she get's hungry very soon so...\"<br>\r\n<br>\r\n\"Mommy hungry!\" They heard Gwen scream.<br>\r\n<br>\r\n\"Hungry!\" Briann also screamed.<br>\r\n<br>\r\nHer mother fast finished a few hamburgers and gave them too Gwen's mother. Six burgers. Three for each. As soon as the plate came in reach of the two greedy toddlers they grabbed the food and started to stuff it in their hungry mouths. Since the big burgers their faces were soon covered in food. That did't stop them from eating the burgers what did't take long if you thought that it were three burgers for just two toddlers.<br>\r\n<br>\r\n\"Eh they're done already. Eh besides that blanket...\"<br>\r\n<br>\r\n\"Don't worry. It can it the wash machine. Lucky too or else. I really like that blanket and so does Briann. Does Gwen likes spaghetti with tomato sauce and meatballs?\"<br>\r\n<br>\r\n\"Oh sure she does. But even more with some grated cheese.\"<br>\r\n<br>\r\n\"Perfect idea. Maybe also add some liquid butter just for the taste?\"<br>\r\n<br>\r\n\"Oh yeah lets do it.\"<br>\r\n<br>\r\nThey smiled wile the two fat toddlers wolfed down their food. All four seemed very happy.<br>\r\n<br>\r\n\"You know what i don't get. Some people think this is... bad. I mean look at how happy they are. They look so cute with their huge bellies. What can be bad about this? You see i never really met someone who also likes it to fatten up their kid. I once said it when i was with a few other mother's and they said i was mad. They threw me out the club. No one wanted to speak to me again. They told others and everyone in the neighborhood saw me like a freak. Then we moved. So no one knows what happened. Not a moment too early i guess. I heard some people were planning to call child safety and let Gwen be removed from me. But i told no one where i went. It was also near the place were i got raped so it is't such a good neighborhood.\"<br>\r\n<br>\r\n\"Yeah i know a lot of people that think this is bad. I never had someone too talk about this. Until now. When I met you. I'm so glad i did.\"<br>\r\n<br>\r\n\"Me too. Me too.\"<br>\r\n<br>\r\nThen they heard a familiar sound.<br>\r\n<br>\r\n\"Hungry! Hungry.\"<br>\r\n<br>\r\nThe two faces of their kids looked hungry at them each with an empty plate and both covered in the tomato sauce that did't made it to their mouth.    <br>\r\n     </span></div></div>",
            "created":1287810000,
            "id":979737,
            "title":"Play and a lot of food"
        },
        "14111121111111221122112112121":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "hotdog/corndog time",
                "after-thirsty then more food"
            ],
            "content":"<div class=\"\"><div> <span>\"Could you go to the fridge and get out the hotdogs and then the corn dog sticks\" asked Briann's mom<br>\r\n<br>\r\n\"How many, there are 4 packs of eight\" <br>\r\n<br>\r\n\"Get all of them, we are going to stuff them like crazy today\" said Briann's mom with a smile<br>\r\n<br>\r\nShe pulled out the stuff and took it to Briann's mom. While she started to make the freast of hotdogs and corndogs Gwen's mom looked at Briann and Gwen. She smiled when she saw how there tummies were starting to push out a little from the food they have eaten. She walked over to the blanket where the kids were at and started to rub both there bellies. She loved how soft and squshy there tummies were. However they were also a little hard from the food.<br>\r\n<br>\r\n<br>\r\nGwen's mom got excited at the thought of how big there bellies would be by the time they got done. Then she started to think of how fat Gwen would become if they kept doing this.</span></div></div>",
            "created":1287810000,
            "id":979789,
            "title":"Hotdogs and Corn dogs"
        },
        "141111211111112211221121121211":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Something too drink for them",
                "More food"
            ],
            "content":"<div class=\"\"><div> <span>Gwen's mother looked again at her daughters belly. She always liked fat girls since she could remember. When she was young she also loved cartoons were characters ate until they were fat and round. Later it became talk shows over obese people. <br>\r\nOf course when she first noticed she was pregnant she was very upset since she had never had sex before except for that freak that raped her so there was no other choice then that it was from him. Sure she thought about abortion but she always wanted to have kids. Not at this age but still. After all why would the kid be like his dad. If she would raise him or her well what could happen. You can't judge someone just because one of his or her parents was a crazy freak, and then she felt the kid moving. She felt those wonderful (and sometimes painful) feelings inside her and then she knew she could't do abortion. After all what was inside her was something alive. More or less. That's the reason why she got Gwen. <br>\r\nBut still she kept liking fat young girls. So she added some sugar to Gwen's bottle of milk, and when she finally started to eat solid food she made sure it was fattening. Now she finally found a mom who thought about it the same way.<br>\r\n <br>\r\n\"A lot of mayonnaise, ketchup and mustard for on the hot dogs.\" Briann's mother said<br>\r\n<br>\r\n\"Easy with the sauce. Else they get dirty.\"<br>\r\n<br>\r\n\"Get? They're already covered in sauce. I would say stuff them and who cares if the get dirty? after the feeding we can wash them. Gwen can get some old clothes from Briann. She has outgrown them anyway.\"<br>\r\n<br>\r\n\"Oh really. That would be very handy. We also soon start with the classes.\"<br>\r\n<br>\r\nBoth took a plate of hot dogs and slowly pushed them in the hungry mouths of the toddlers who liked it to eat the tasty hot dogs while sauce dripped from their hot dogs, chins and out of their mouth on their clothes and blanket. Brianns mother was glad she could put the blanket in the washing machine.<br>\r\n<br>\r\n\"You know i should tell you something about the classes. Since Gwen is very young it could have some... side effects.\"<br>\r\n<br>\r\n\"Really? Side effects. What kind of side effects?\"<br>\r\n<br>\r\n\"Well increasing weight gain and appetite. Craving for food and get's hungry very fast. I thought you should know that.\"<br>\r\n<br>\r\n\"Now i'm sure gonna take those classes. Those side effect are things that i would like if Gwen got them.\"<br>\r\n<br>\r\nThe fat toddlers swallowed the last of their hot dogs and their mother's took the corn dogs.<br>\r\n<br>\r\n\"It's so nice the kids got a friend. I was a bit scared it would become a bit hard for Gwen too find friends since she was fat.\"<br>\r\n<br>\r\n\"Well i would't worry about that. I hear that childhood obesity is very high here and that still more people get overweight. Maybe in the future everyone is overweight.\"<br>\r\n<br>\r\n\"I would love to see that.\"</span></div></div>",
            "created":1288069200,
            "id":981645,
            "title":"Messy toddler's"
        },
        "1411112111111122112211211212111":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "a gallon each",
                "more"
            ],
            "content":"<div class=\"\"><div> <span>There bellies were big and hard. Both Briann's and Gwens mothers were very happy as they looked at there daughters bellies. They patted and rubbed the big tummies in front of them. <br>\r\n<br>\r\n\"Thirsty\" said Gwen<br>\r\n<br>\r\nThey had not thought about dinks for them since they were so foccused on stuffing the toddlers with food.<br>\r\n<br>\r\n\"Which would your daughter like more, soda or milk\" asked Briann's mother went to the fridge<br>\r\n<br>\r\n\"Soda, she loves soda and the carbonation makes her belly a little bigger\"<br>\r\n<br>\r\n\"How much can she drink\" asked Briann's mother<br>\r\n<br>\r\n\"As much as you have\" said Gwens mother with a smile<br>\r\n<br>\r\n<br>\r\nHow much does she have<br>\r\n</span></div></div>",
            "created":1288069200,
            "id":981752,
            "title":"Something too drink for them"
        },
        "14111121111111221122112112121112":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Continue feeding the girls",
                "Feed the girls while talking about the idea"
            ],
            "content":"<div class=\"\"><div> <span>\"Well i always have a few bottles in fridge and more in the pantry. I always like it when Briann's belly is filled with soda!\"<br>\r\n<br>\r\nIt was true that she always  liked it if Briann's belly was full with pop but since she started taking classes her belly was mostly full with the liquid. <br>\r\nBriann's mother fast ran too the pantry. Gwen's mother waited and suddenly looked up with a strange smile. <br>\r\nGwen looked up from her corn dog. She knew very well her mother was planning something. She learned too know what that look mend. Slowly her mother looked in some drawers. Briann's mother came back with a few bottles.<br>\r\n<br>\r\n\"Are you looking for something?\"<br>\r\n<br>\r\n\"Yeah. Do you have any funnels. We can put them in their mouths and the fill the funnels with the soda.\"<br>\r\n<br>\r\n\"Ha ha haa! That would be really funny. I have two here.\"<br>\r\n<br>\r\nShe opened a closet and took two funnels out of it. Both took a bottle and walked to their girl. Put the funnel in the mouth and they started too pour the soda in it. Both girls were forced to drink or else they would choke. but both toddlers liked it to be fed and liked it to be fat and become fatter and playing with the others fat so both were like good girls drinking an entire gallon of soda. All four smiled seeing the bellies bloated with soda.<br>\r\nBriann's mother was busy baking bacon with a lot of fat. Both girls knew the smell and the taste.<br>\r\n<br>\r\n\"This is so much fun. We should start a club: Fatten up kids.\"<br>\r\n<br>\r\n\"I would love too. But it's much too risky. You know how people acted when you told them that you liked it to fatten Gwen.\"<br>\r\n<br>\r\n\"We could do it on Internet. You have also groups who think about killing all black people or killing all Jew's, and that people of different color's should't get kids. It's all terrible and i don't agree but my point is... it's wrong but it's on the net. So why not start a group and put up a website?\"<br>\r\n <br>\r\nBriann's mother was thinking. a room filled with fat toddler's. Bulging bellies and love handles and fat folds. she would't mind. Probably they all would take classes. Good for the experiment. But still it could go wrong. <br>\r\n</span></div></div>",
            "created":1288155600,
            "id":982194,
            "title":"Funnels and soda"
        },
        "141111211111112211221121121211121":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "two litter",
                "gallon"
            ],
            "content":"<div class=\"\"><div> <span>\"I guess thats a good idea, lets talk about it when they are napping, you know they will be tired after all this food is n there big tummies, plus I heard that if you sleep after eating alot that it will make you fatter quicker\" said Briann's mom<br>\r\n<br>\r\n\"Ok, I guess thats good\" said Gwen's mom, filling the funnel's with more soda<br>\r\n<br>\r\nThey were already half way through the gallon's and there bellies were growing with every gulp. They were also hapy to be drinking the good tasting drink and feeling there bellies being bloated with the fizzy stuff. Briann's mom was done with the bacon and put it on a plate so it could cool and the girls could finish there drink. <br>\r\n<br>\r\nShe came over and started to rub both of there tummies. By now they were laying next to eachother on the now fillthy blanket. Also by now the girls bellies were big and hard with food and soda. If they were wearing a shirt they would have long since been pushed over. <br>\r\n<br>\r\nFinally the last drops of soda were given to the girls and they pulled out the funnel. Both girls looked happy but then...<br>\r\n<br>\r\n<br>\r\n\"Thirsty\" said Gwen<br>\r\n<br>\r\n\"Hungry\" said Briann<br>\r\n<br>\r\nThe moms were surpriesed Gwen was still hungry. They expected them to still be hungry but not thirsty after the gallon each of them had.<br>\r\n<br>\r\nBRiann's mom brought over the pplate with bacon and started feeding Briann.<br>\r\n<br>\r\n\"I have another... in the fridge</span></div></div>",
            "created":1288155600,
            "id":982399,
            "title":"Continue feeding the girls"
        },
        "1411112111111122112211211212111211":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Talking about the site",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"A two litter is that enough for her?\"<br>\r\n<br>\r\n\"I don't know. I can't believe she's still thirsty. I thought she had enough.\"<br>\r\n<br>\r\nShe walked to the kitchen and returned with a two litter bottle of soda and the funnel. She put the funnel in Gwen's mouth and continued giving her soda while Briann ate the bacon. Interested she looked at Gwen while more and more of the bacon went past her lips that got all greasy. Briann's mother used a lot of fat too bake them just like Briann liked it. <br>\r\n<br>\r\n\"Your daughter is enjoying the bacon.\" Gwen's mother said.<br>\r\n<br>\r\n\"Yeah she always did. Especially if its fatty and greasy. She has a real taste for that. Your daughter really likes soda.\"<br>\r\n<br>\r\n\"Yeah she drinks a lot. But i don't worry until she starts drinking alcohol. Then she's probably gonna have a hangover every night.\"<br>\r\n<br>\r\nBriann's mother smiled. She did't thought she'd have too worry about that with Briann. Her sweet little toddler was almost immobile. Sure she could still crawl but then she needed to drag her belly over the floor. Even before that Briann never really was a girl that wanted to crawl. As long if she could sit and look around her and got food she was fine. Briann never took effort to walk and with a belly as big if her she probably would never be able too. If Briann really got immobile what was a big chance she could keep Briann home and feed her so she would become even fatter.<br>\r\n<br>\r\n\"So that was the last drop.\" Gwen's mother said while she tossed away the empty bottle.<br>\r\n<br>\r\nGwen was't thirsty anymore and started to stuff her face with the remaining bacon. after all the bacon was gone both bellies were as hard if a rock and both girls started to rub their eyes with their greasy hands.<br>\r\n<br>\r\n\"I think it's nap time for them.\" Gwen's mother said.<br>\r\n<br>\r\n\"Well i think it's first bath time and then nap time.\" <br>\r\n<br>\r\n<br>\r\nBriann's mother filled the bath tub with water and Gwen's mother undressed the two toddlers. <br>\r\nBoth mother's got a good view at the big bellies of their daughters and all other rolls of fat on the rest of their bodies. Both started to soap in their daughter what was the most fun part for them to do. Then they could feel their daughters fat. But now the also need to was their girls. All the eating made them pretty messy. Just like their clothes. Briann's mother tossed them in the washing machine and took two nighties. One for Briann and one for Gwen. She could guess Gwen's size. Same like Briann had some time ago. She could have the nightie. Briann out grew it anyway.<br>\r\nAfter the girls were rubbed dry and in their nightie the mother's tugged them in. Both girls were soon in dreamland while the mothers started making plans.</span></div></div>",
            "created":1288328400,
            "id":983269,
            "title":"More soda and bacon"
        },
        "14111121111111221122112112121112112":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "now talk about the sight",
                "skip to next class"
            ],
            "content":"<div class=\"\"><div> <span>They went into the livingroom and sat on the couch.<br>\r\n<br>\r\n\"Hey,before we talk about the sight,lets talk about those classes you told me about\" said Gwen's mom<br>\r\n<br>\r\n\"Well, there is this place that have these machines, they are filled with this fatty liquid. The machine is attched to a hose that the patient puts in there mouth, then they turn it on and the liquid is pumped into there mouth\" said Briann's mom<br>\r\n<br>\r\n\"That sounds cool, is there a limit on how much they can drink\" asked Gwen's mom<br>\r\n<br>\r\n\"Well you can ask them to let Gwen drink as much as she can\" <br>\r\n<br>\r\n\"Oh she would be drinking forever, she has a endless aptite\" said Gwen's mom proudly<br>\r\n<br>\r\n\"Well how about I take you and Gwen to our nect class and maybe they will go ahead and let you put Gwen on a machine and we can watch both of our daughters bellies be stuffed, after the class, Briann's belly is really big and hard\" said Briann's mom happily<br>\r\n<br>\r\n\"Oh that would be great\"</span></div></div>",
            "created":1288328400,
            "id":983278,
            "title":"Something else"
        },
        "141111211111112211221121121211121121":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Yeah make a site",
                "Don't make a site"
            ],
            "content":"<div class=\"\"><div> <span>\"But now... you wanted to start a website?\"<br>\r\n<br>\r\n\"Well many people think fattening kids is bad. But on the Internet there so many bad things. It's wrong to judge people about their skin color. But how many sites are there about hate against colored people. Hundreds. There are also sites about cannibalism. That's also wrong. Sites that encourage anorexia. There's even a site that tells how ways too kill yourself. I mean a lot of people find that wrong but there are still sites about it. I think if a woman that also likes it too fattening her kid finds the site and then we can meet her.\"<br>\r\n<br>\r\n\"I understand what you mean. Point is that it goes world wide. She could live at the other end of the planet.\"<br>\r\n<br>\r\n\"At least we can contact her and tell her stuff and share information. Maybe some live nearby.\"<br>\r\n<br>\r\n\"What if someone sees our site and hates the idea? What then? I mean if they find out what we do we're...\"<br>\r\n<br>\r\nWe don't use our own names. Use a name like: Fatten-Up-Girls or Mommy-Feeder or something like that. We make sure that we sure know we can trust someone before we invite her over.\"<br>\r\n<br>\r\nBriann's mother was thinking. She liked the idea of seeing a lot of fat girls all together with her daughter Briann. But she was afraid about the risks. But if Gwen's mother was right there were't any or hardly any risks.<br>\r\n<br>\r\n\"I'm sure Gwen would like it to meet other fat kids. Don't you think Briann will like it?\"<br>\r\n<br>\r\n\"Well Briann does't hang around so much with other kids except for Gwen.\"<br>\r\n<br>\r\n\"Yeah. Besides thank for that nightie.\"<br>\r\n<br>\r\n\"Listen don't worry about that. Briann does't fit's it anymore. Besides if you come upstairs you can take the rest of Briann's old clothes. Most don't fit her. If you take them i at least i know they are used.\"<br>\r\n<br>\r\n\"Well that would be nice. But i'm really handy with the computer. Should i make a site?      </span></div></div>",
            "created":1288414800,
            "id":983771,
            "title":"How about a site"
        },
        "1411112111111122112211211212111211211":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "feed them a little more",
                "just wait til next time"
            ],
            "content":"<div class=\"\"><div> <span>\"well, sure, go ahead and make a site. But lets just show our girls at first and then let other people join and put there kids on the site, but before we let them we should meet then and test there girls.\" said Briann's mom<br>\r\n<br>\r\n\"What do you mean by test\" asked Gwen's mom<br>\r\n<br>\r\n\"A test to see how much they can eat and how much they weigh. We can put groups on the site for skinny girls that start gaining, chubby girls that start gaining, and then fat girls that start gaining\" said Brinnn's mom \" we can also put groups for the part of the body they gain the most weight, like for girls with big bellies we can call it Tramindous Toddler Tummies\"<br>\r\n<br>\r\n\"Great idea, I will start working on the layout on a peice of paper when we get home and bring it back next time we come\"<br>\r\n<br>\r\n\"Ok, sounds great, should we wake Briann and Gwen up, maybe even feed them a little more\" asked Briann's mom<br>\r\n<br>\r\n\"Well lets wake them up and...</span></div></div>",
            "created":1292648400,
            "id":1017615,
            "title":"Yeah make a site"
        },
        "14111121111111221122112112121112112112":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Stuffing Briann",
                "See the site"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait until next time. If i feed Gwen now she does't eat at dinner and then she get's hungry during the night and starts crying until i wake up.\"<br>\r\n<br>\r\n\"Yeah i understand that. I also hated it when Briann woke me up when she was just born.\"<br>\r\n<br>\r\n\"But maybe we should make a picture of them so we can see how much they grow. Do you maybe have a recent picture from about a week ago? Then we can see some progress.\"<br>\r\n<br>\r\nBriann's mother smiled. Seeing Briann getting bigger every day, she liked it so much she took a lot of pictures lately of her. Also enough from last week.<br>\r\n<br>\r\n\"Sure i have some. I just need to print them. Why don't you get the kids then i will get the camera then we can take the pictures and print them.\"<br>\r\n<br>\r\nGwen's mother took the kids one by one since they were too heavy too carry at the same time. She put them next to each other. <br>\r\nGwen took a ball she saw and bite in it. When she noticed she could't eat it she threw it softly to Briann. She took it and softly threw it back. Soon they were playing. <br>\r\n<br>\r\n\"Ah they're playing. That's so sweet.\" Gwen's mother said.<br>\r\n<br>\r\nBriann's mother found the camera and took a few nice pictures that clearly showed how fat the two kids were. <br>\r\nWhile Briann's mother printed the nicest pictures of Briann and Gwen were still playing. Briann normally did't play with other kids. Point was that she did't know any other kids except Gwen. Her mother also did't really hang out with other mothers with kids so she also did't meet other kids. Since she did't meet other kids her most important interest was eating. Now she met another kid that also liked eating and was also fat. She liked it a lot.<br>\r\n<br>\r\n\"All right Here are the best pictures i think.\"<br>\r\n<br>\r\n\"This is so great. I made a lot of sites but I'm really gonna enjoy it making this site. I start on it when i'm home.\"<br>\r\n<br>\r\n\"Don't you need to make dinner?\" Briann's mom asked.<br>\r\n<br>\r\n\"I live near a snack bar. Besides Gwen loves junk food so she won't mind.\"<br>\r\n<br>\r\nJust then Gwen let out a baby, girl giggle. I sounded really cute. Briann  liked it so much she also let out a baby, girl giggle.<br>\r\n<br>\r\n\"Well i hate it to take her away but we need to go home. Come on Gwen.\"<br>\r\n <br>\r\nShe picked her up but Gwen made protesting sounds and stuck her hands out to Briann. Briann did the same.<br>\r\n<br>\r\n\"Looks like she don want to go.\" Briann's mother said with a smile. \"Come on Briann. Gwen has too go but you will see her soon again.\"<br>\r\n<br>\r\n\"Yeah Gwen. We really need too go. But we will visit them soon again.\" Gwen's mother told too Gwen. \"Well see you soon.\"<br>\r\n<br>\r\n\"Nice woman. Right Briann.\" Brianns mother asked her after Gwen and her mother left. \"Gwen is nice too don't you think?\"<br>\r\n<br>\r\nBriann looked sad in the way she saw Gwen leave. But now Gwen was gone she noticed she was hungry again and looked tempting too the kitchen.   <br>\r\n<br>\r\n\"Oh Briann are you hungry again? I will make some food for you.\"  <br>\r\n</span></div></div>",
            "created":1292994000,
            "id":1020055,
            "title":"Pictures"
        },
        "141111211111112211221121121211121121121":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "First",
                "after shopping"
            ],
            "content":"<div class=\"\"><div> <span>She walked into the kitchen and noticed that most of the food was gone. She remembered how much food the girls ate. This made her look back at Briann. Her belly still had a round full look to it but not as much as before she went to sleep.<br>\r\n<br>\r\n\"You ate all the food\" said Briann's mom with a smile \"I guess we will have to out for dinner, then go shopping\"<br>\r\n<br>\r\nBriann smiled when she heard the word out because when ever she heard that it usualy meant eating but not a home and whenever they went someowere to eat she always got to eat more.<br>\r\n<br>\r\n\"Come on Briann, we have to find a shirt and some pants that fit you, that might take a minute\"<br>\r\n<br>\r\nHer mom thought about it and knew because Briann did not wear clothes,but just a diaper, most of the time that there were probally not any clothes that would fit her. She took Briann up stairs and put her on her bed and went to her closet. She pulled out a pint little shirt and tried to put it on her. It only made it to her belly button.<br>\r\n<br>\r\n\"All your clothes are in this size, I guess we will have to go clothes shopping to. So we have to go eat, got to the grocery store, then clothes shopping. Wow we have a whole night planned dont we\" said Briann's mom \"Guess now the only thing to do is decide to eat first or later<br>\r\n<br>\r\n</span></div></div>",
            "created":1292994000,
            "id":1020124,
            "title":"Stuffing Briann"
        },
        "1411112111111122112211211212111211211211":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Clothes shopping",
                "She meets another mother with a fat kid who likes it to fatten her child"
            ],
            "content":"<div class=\"\"><div> <span>Briann opened her mouth and pointed in it. It was obvious she was hungry and did't wanted to wait.<br>\r\n<br>\r\n\"Well that answers my question.  Besides it's maybe better if you eat first. Else the clothes might rip after you ate. But we need to hurry or else the shop is closed. <br>\r\n<br>\r\nShe put Briann in her new stroller and took Briann too the car and drove too the City.<br>\r\n<br>\r\n\"Well Briann what do you wanna eat? Mc Donald's, Wendy's, Burger King? I think you like Mc Donald's a lot don't you?\"<br>\r\n<br>\r\nBriann looked up at her mother. She just wanted to eat. She knew some of the words. Her mother used them when they got good food. She was very hungry and hoped mommy would buy enough food.<br>\r\nHer mother stopped by a drive in. <br>\r\n<br>\r\n\"Can i take you order miss?\" A voice sounded.<br>\r\n<br>\r\n<br>\r\n\"Yes i would like ten big mac's also ten packs of fries and ten vanilla milkshakes all super sized and three boxes of chicken Mc nuggets.\"<br>\r\n<br>\r\nShe drove further and took her order. The man looked strange at her.<br>\r\n<br>\r\n\"Is that all for you?\"<br>\r\n<br>\r\n\"Of course not. It's for my daughter.\"<br>\r\n<br>\r\nThe man looked with big eyes at Briann. He had seen a lot of fat kids in Mc Donalds but still Briann was really fat. He decided to say nothing of it. If she wanted to make her daughter obese who was he too stop her? As long if she paid for the food it was fine.<br>\r\nBriann started to stuff her face as soon if the food came in her reach. She started too cram as many fries in her mouth if was possible without choking. Her mother was careful enough too watch every now and then too make sure Briann would't choke.<br>\r\nEven she was surprised how fast the food was disappearing in the huge belly of her only child. <br>\r\nShe wondered if she would ever get another child. Perhaps if she would get another friend. Always hard too find a partner if you already had a child. But Briann was the most important thing in her entire life. Her little piggy especially if she saw how big bites she took from her burger while she had such a tiny mouth.<br>\r\n   <br>\r\n\"All right Briann you just eat. After that we will go clothes shopping. We need to go to a special store since you're too fat for normal clothes are't you my little eating machine?\"<br>\r\n<br>\r\nBriann grinned at her mother and focused on her eating again. Making sure she did't leave a crumb. Anything would end up in her huge belly. </span></div></div>",
            "created":1294722000,
            "id":1033404,
            "title":"Mc Donald's for dinner"
        },
        "14111121111111221122112112121112112112111":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "very happy teenage employe",
                "an old mean employe"
            ],
            "content":"<div class=\"\"><div> <span>Afer about thirty minutes of stuffing her face Briann finished all the food and was sipping the last bit of shake. she let out a small toddler burp and smiled while she placed a hand on her now bigge and harder tummy. Her diaper was straing from the new weight packed inside her belly.<br>\r\n<br>\r\n\"Are you full now Briann\" asked her mom with a giggle as she tapped her belly with a thump<br>\r\n<br>\r\nShe giggled and nodded her head. She could understand almost anything that involved food or being full from food so she understood. Her mom just turned back around and pulled out of the parking lot  to go to the clothes store.<br>\r\n<br>\r\n\"Hopefully these will fit you a little longer seeing as your tummy will shrink a little once your food digest\" said Her mom<br>\r\n<br>\r\nShe knew that Briann could not talk but she still talked to her. It is almost like she is talking to herself. Every now and then Briann would replay with a laugh or some word that does not excist. Finaly they puttled into another parking lot of the clothing store. It was an adverage sized store but with a big sighn that read,Plus Size Clothes, and for kids in little multi colored letters. She hoped that she would not get yelled at by random people for her daughter fat and bloated state. But she knew that many people did not agree with haveing an overweight child,much less making them get even bigger, even if they did work at a store for those types of children.<br>\r\n<br>\r\nThey walked in and were met by a...</span></div></div>",
            "created":1294722000,
            "id":1033453,
            "title":"Clothes shopping"
        },
        "141111211111112211221121121211121121121111":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "They barely fit",
                "They don't fit"
            ],
            "content":"<div class=\"\"><div> <span>A happy looking teenager girl. She must admit she was surprised seeing a girl as young as Briann was so fat but she knew how to hide that surprise. After all Briann was't the first fat kid and she was learned to be nice to costumers no matter what. <br>\r\n<br>\r\n\"Hello miss can i help you?\" She asked friendly.<br>\r\n <br>\r\n\"Well yes i look for clothes for my daughter Briann.\"<br>\r\n<br>\r\n\"Right. Well i think we will need to look in the plus size section.\"<br>\r\n<br>\r\n\"You think?\" A woman said that looked like an anorexia patient. <br>\r\n<br>\r\nBesides her were three kids that also looked like anorexia patient's. They all three looked very unhappy and almost starved. Brianns mother looked with sadness at the thin kids and got a disgusted look from the mother when she looked at Briann. <br>\r\nThe teenager employee looked worried. She did't know what too do if the two mothers would ended up in a fight.<br>\r\n<br>\r\n\"Your daughter does't need the super size section but the super duper size section! She's obese!\"<br>\r\n<br>\r\n\"My daughter is healthy and happy! Your kids look very unhappy and are nothing more then skin and bones!\"  <br>\r\n<br>\r\n\"Ladies! Ladies! Please calm down!\" The teenager said very worried now looking for help from somebody else.<br>\r\n<br>\r\n\"My children are healthy and very happy! Your daughter is't healthy at all! She will die at young age because of her high weight!\"<br>\r\n<br>\r\n\"Your children are not happy! I don't see them smile! They will die at young age because they are underfed!\"<br>\r\n<br>\r\n\"Come on kids we're  leaving!\"  <br>\r\n<br>\r\nThe kids did't said anything and followed their mother outside. The teenager wiped her forehead and slowly breathed.<br>\r\n<br>\r\n\"I'm really sorry about that. Some people just don't agree with someone else how to raise kids. Well eh if I can take your kids size I can see were you can find some clothes.\"<br>\r\n<br>\r\nShe took a measurement and wrapped it around Briann's belly and whistled.<br>\r\n<br>\r\n\"Wow she's really... eh big.\" She said.<br>\r\n<br>\r\nBriann's mother must admit she was proud to hear that.<br>\r\n<br>\r\n\"Well i think you can find something for her on the third floor. But if I might give you an advice i would take dresses since i'm afraid most pants eh... are to tight for her.\"<br>\r\n<br>\r\nShe wanted to say won't fit her but did't want to offend  this lady. Her boss told her on the first day: \"Be nice too the costumers so they come back.\"<br>\r\n<br>\r\nBriann and her mother went to the third floor. Slowly her mother drove her stroller past clothes. She must admit the teenager had been right. Dresses would probably better fit Briann and they would take longer before Briann would outgrow them. It took some time before she found some clothes that would fit Briann.<br>\r\nIt made her proud that Briann was so fat that she only fit a few clothes. <br>\r\n<br>\r\nShe also saw a fat teenager that weighed about 300 pounds with large round DD cups and a mother with two chubby twins and another mom with a fat boy. The mother of the boy did't seem too happy with her son's size.<br>\r\n<br>\r\n\"All right Briann let's see if those fit.\" </span></div></div>",
            "created":1295154000,
            "id":1036350,
            "title":"mean comments and big clothes"
        },
        "1411112111111122112211211212111211211211111":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "at the class",
                "a call from there new friend"
            ],
            "content":"<div class=\"\"><div> <span>Briann's mother picked up a red dress. She picked up Briann out of the cart,which was pretty hard, and stood her up. <br>\r\n<br>\r\n\"Ok Briann lets see about this one,you do like red\" said her mom as she tryed to slip the dress over Briann's head and then belly<br>\r\n<br>\r\nIt was pretty tight and showed how round Brianns belly was getting. Also the arm hole's were cutting into her skin. She took that one off and tryed to find another one,a size bigger. After a while she came across a pink little dress with a bow around the middle tummy area.<br>\r\n<br>\r\n\"Alright Briann, its this or nothing\"<br>\r\n<br>\r\nShe slipped it over her head and belly and stood back to see how it looked. It was still pretty tight but not as much as the last one. She did like how it made Brienns belly stick out more. She went around a picked up a few more dresses and even a pair of strechy pants and a light blue shirt with a butterfly on it. then Briann's mom remembered something very important<br>\r\n<br>\r\n\"Briann I just remmebered you have a class today at five o clock. Its two thirty now\" almost shouted her mom looked at Briann expecting a response<br>\r\n<br>\r\nShe took off the new clothes and put them in the basket, along with Briann and rushed to the counter. When she got there she paid for the clothes, and left. She had to get Briann and her new clothes home and ready for her class. With all the other stuff going on with there new friend she just kinda forgot. <br>\r\n<br>\r\n\"Well Briann I wonder which one of these clothes will strech the most\" said her mom with a smile and a pat on Briann's tummy which jiggled a little as she did</span></div></div>",
            "created":1295154000,
            "id":1036474,
            "title":"Very tight"
        },
        "14111121111111221122112112121112112112111111":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Briann is done",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm back.\" Briann's mother said while she walked in.<br>\r\n<br>\r\n\"I see that.\" The woman said. She did't seem too happy.<br>\r\n<br>\r\n\"Is something wrong? You don't look too happy.\" Briann's mother asked.<br>\r\n<br>\r\n\"Well your daughter is getting really fat. This liquid was't mend to fatten up kids who can't even tie their own shoes. I mean she already has an increased appetite. Apart from that you asked me too feed her more then normal... I don't know what is going too happen.\"<br>\r\n<br>\r\n\"I think she just get's bigger and more cuter.\" Briann's mom said.<br>\r\n<br>\r\n\"You know this was mend to help people who are underweight like an anorexia patient.\"<br>\r\n<br>\r\n\"Well Briann is a hungry and growing girl and i want you too feed her.\"<br>\r\n<br>\r\nThe woman looked at her and mumbled: \"Fine then.\"<br>\r\n<br>\r\nShe placed the tube in Briann's mouth. Briann started too sucking at the end of the hose while the liquid got pumped in her mouth where it got swallowed to her huge expanding belly.<br>\r\nThe woman looked disappointed at it. She knew by now that this woman wanted her baby to be fat and god might know why but she was't happy about it but her job paid good and besides she also helped some people with it. However some anorexia pateint's need almost to get forced to eat this. But at least it was for their own good.<br>\r\nWhat this woman did would't do the baby any good. She thought. Even if the baby liked being fat now. If she would be older. Her mother would not ever be around to take care of her. Supposed she lived that long.<br>\r\n<br>\r\n\"You can't decide on your own if you want this or not, can't you little girl.\" She said sweet.<br>\r\n<br>\r\nBriann did't understand what the woman said and even if she would have understand her she would't have cared what she said. The only thing she cared about was getting the creamy liquid inside her hungry belly.<br>\r\n<br>\r\nBriann's life was very simple. She did't cared about many things. She cared about getting food and sleep and a clean diaper. Also playing with her toys or with her friend Gwen were things she liked too do but apart from that not much. She also liked watching T.V but she did't need to watch like some older children need to see every episode about a cartoon. As long if Briann got what she wanted she was happy. For now was that getting as much creamy liquid in her belly if was possible. <br>\r\n  </span></div></div>",
            "created":1295413200,
            "id":1038165,
            "title":"Doubts"
        },
        "141111211111112211221121121211121121121111112":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "The tank finally runns out",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Briann's mom looked on from the window as her little baby girl geting stuffed with the creamy liquid. However she noticed that before she could see the tank with the liquid in it. But now the tank was replace with not only a bigger tank.. But it was also covered so she could not see how much of it was left. This kinda made her happy because for one there must have been alot more for her to drink. But also when she could see how much was left she would get a liitle sad when it was almost empty.<br>\r\n<br>\r\nBrianns belly was really getting round. The liquid showed no sighn of slowing down any time soon. Briann just kept sucking. She really liked the taste and loved it filling her baby belly. Her diaper looked like it was getting pretty tight as her belly was starting to cover the top of it. And with every gulp her tummy got a little bigger and a little tighter. she had clearly drank more than she normaly did because her tummy had never gotten this big before. She looked really stuffed.<br>\r\n<br>\r\n\"I think I should cut it off\" said the women who never gave up<br>\r\n<br>\r\n\"No, dont cut it off until she is full.\" said Briann's mom sternly<br>\r\n<br>\r\n\"but look at her belly, it is getting huge\"<br>\r\n<br>\r\n\"But she is not full yet, I can tell by the look on her face\"<br>\r\n<br>\r\nthe girl just walked off. Briann's mom was  really hoping she would eventualy give up. Briann's tummy was now starting to shine from her skin being streched so tight. Her mom does not think she has ever had this much before. She has never seen her so full before. At home they would run out of food before she ever got this full before.<br>\r\n<br>\r\n</span></div></div>",
            "created":1295413200,
            "id":1038368,
            "title":"Something else"
        },
        "1411112111111122112211211212111211211211111121":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Make the appointment",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Finally she heard a sputtering sound. The tank was finally empty. Briann still was sucking at the hose.<br>\r\n<br>\r\n\"She's still hungry. Do you have another tank for...\"<br>\r\n<br>\r\n\"No! Forget it. That girl drank more then any human was used too and she still wants more. Even with all those side affects, and who now how much more  side affects could come up you still want to feed her. She the fattest kid I've ever seen and i counting every kid I've seen in a talk show about obese kids!\"<br>\r\n<br>\r\nBriann was extremely obese now. She looked more like a blob. Her limbs got so fat she could hardly move them. Even at this age she clearly had boobs that were lying on two huge rolls that went past Briann's feet that were almost gone in the two huge rolls at her ankles and her huge legs and thighs that were so big if tires and a butt who looked like two beach balls. Her upper arms were like pillows where her under arms were slowly disappearing in more each day. Her head was melted to her chest with several chins and two bowl, pink cheeks that took up most of Brianns cute face. But she seemed very happy.<br>\r\n<br>\r\n\"What do you wanna do. Making your child the heaviest person in the world. because that's what she's becoming. and at this rate she will reach it before she's ten years old. Do you really want to have a kid in elementary school that's the heaviest person in the world?\"<br>\r\n<br>\r\n\"Well why not. If she's happy with it and I'm happy.\"<br>\r\n<br>\r\n\"Well she won't go to school anyway. She's too fat to go too school but she already was too fat several classes ago. I tried to stop you from fattening your child but you kept coming. You know do what you like but i refuse too have any part about this. I wanted to help people not making a thumb suckling toddler the fattest human on the world!\" <br>\r\n<br>\r\nAfter those words she walked to her office and slammed the door so hard it was probably heard in the entire building.<br>\r\n<br>\r\nBriann just looked around her for as far if she could and belched loudly now and then.<br>\r\n <br>\r\n\"Well Briann I must admit you are the fattest toddler I've ever seen.\" Her mother said proudly. <br>\r\n<br>\r\nEven Gwen seemed small compared to how big Briann was. It made her remember she had too make an appointment with Gwen and her mother.<br>\r\n Briann was put back in her stroller with a lot of effort and her mother drove back home. Still smiling when they arrived home.</span></div></div>",
            "created":1296018000,
            "id":1042540,
            "title":"The fattest toddler"
        },
        "14111121111111221122112112121112112112111111212":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "He can",
                "He cant"
            ],
            "content":"<div class=\"\"><div> <span>When they got home Briann's mom had to weel her daughter into the house in the stroller because the way it looked, Briann was way to stuffed to walk. In fact, she ever wondered if Briann would be able to walk after the food digested. This had to make her think how she would move her around in this case.<br>\r\n<br>\r\nShe rooled her in and lefter her onto the couch. Again Brianns tummy came out to her ankels. her belly was so round from all the liquid that was packed in it,already taking afect on her fattening body. She started to again think about moving her arround and thought that maybe she would call her brother again,the one that made the strolled, and see if he could make something for her. She knew she also had to make an appotment for Gwen but figured that could wait til a little later.<br>\r\n<br>\r\nShe looked down and saw Briann rubing her tummy with both hands. She could not even reach thte from of her belly with her chubby little hands.<br>\r\n<br>\r\n\"Your soo cute\" said her mom with a grin and a pat on Brian's belly.<br>\r\n<br>\r\nShe looked her over. All of her was getting fatter every day. Even her ankels and wrist her fat. She really liked it After looking at her gorged daughter for a little longer she went into the kitchen to call her brother</span></div></div>",
            "created":1296018000,
            "id":1042678,
            "title":"Something else"
        },
        "141111211111112211221121121211121121121111112121":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Robbie arrives",
                "Briann is hungry"
            ],
            "content":"<div class=\"\"><div> <span>Robbie took the phone after the first ring.<br>\r\n<br>\r\n\"Hello this is Robbie.\"<br>\r\n<br>\r\n\"Hello Robbie. It's me dear cousin. I call you about Briann.\"<br>\r\n<br>\r\n\"Briann? Is something wrong with her. Did she had a accident because of the chair since i could swear it would work perfect when i...\"<br>\r\n<br>\r\n\"Nothing  is wrong with Briann. Don't worry. I need you because i might need your help again. Briann gained even more weight. She's even fatter then last time. She can hardly move. So i was wondering if you could make something to move her around?\"<br>\r\n <br>\r\n\"Eh well that should't be too hard too do. But that will only work on first floor since it will be difficult to make a elevator for her. I could make that but that would take some time.\"<br>\r\n<br>\r\n\"No need for that. Bathroom and her room are on first floor so No problem.\"<br>\r\n<br>\r\n\"Good then i will come right over.\"<br>\r\n<br>\r\nShe hung up and walked over to Briann. She looked at her highly obese child. She was so proud at Briann for being so fat. She was a born gainer. From the first class she already showed she liked eating and getting fatter. <br>\r\nShe also saw Briann would't be able to crawl anymore. Her belly would't probably allow her tho reach the ground and even if it did her legs got to fat to bend anymore. <br>\r\nShe thought about this. She learned enough from watching talk shows and other stuff about obese people to know there were certain things she need to think of with having an obese child.<br>\r\n<br>\r\nBriann seemed to be very happy being so fat. She did't need to do much anymore. The only things she needed to do was eat, sleep, watch T.V and of course playing with Gwen. But she liked to do all three of those things so she did't really mind it. She did't even mind she could hardly move. Why should she. She knew her mother would do anything for her and Briann took full advantage of that. Not that she was a mean brat but her young mind had't learned anything about right and wrong or being nice to people. Adult just did things for you.<br>\r\n<br>\r\n\"You know i should call Gwen and her mother to come over tomorrow. I wondered how far she is with that site. She said she was good with making websites.\"<br>\r\n<br>\r\nShe dialed the number and Gwen's mother picked up.<br>\r\n<br>\r\n\"Hell It's Me Briann's mother. I was wondering how are you doing with the site?\"<br>\r\n<br>\r\n\"Oh great. I've been very busy with it. Hee how about i would come tomorrow and i will show you?\"<br>\r\n<br>\r\n\"That's great i just wanted to ask you to come over tomorrow.\"<br>\r\n<br>\r\n\"Fine then i come about 12 hour if that's fine with you.\"<br>\r\n<br>\r\n\"That's perfect. See you tomorrow.\"<br>\r\n<br>\r\nhe hung up and watched Briann while she waited for Robbie.  </span></div></div>",
            "created":1296363600,
            "id":1044579,
            "title":"Two calls"
        },
        "1411112111111122112211211212111211211211111121212":{
            "author_id":"lickingstars",
            "author_name":"lickingstars",
            "choices":[
                "He creates a feeding machine for Briann",
                "He finds a way to control Briann's side effects so that her hunger is manageable"
            ],
            "content":"<div class=\"\"><div> <span>The year and a half old toddler was plopped on the rather large couch to digest the immense meal of fattening substance she had recently consumed at the clinic.  She sat there, no less that a couple hundred pounds, too outlandishly large and inhumanly shaped for clothing, taking up as much cushion space as two average sized people despite no part of her body touching the floor.  Her beach ball sized buttocks was slightly compressed against the back of the couch and smooshed outward across the adjacent cushions. Briann's cartoonishly fat legs were forced into a split and seemed to sprout out in segments of blubber from each of her respective butt cheeks.  <br>\r\n<br>\r\nAt the end of her now useless legs were her feet, that looked like normal feet except it was as if they had been blown up with fat, the same as air in a balloon animal.  Her toes had become nothing but tiny tiny balls of fat that were completely spherical.  Her belly looked like it belonged to an obese adult.  It had forced its way over her waist and pushed aside her legs to their current position and it extended outward over the edge of the couch stopping to rest not but three inches from the ground.  Its button was peering forward as if looking across the living room.  It was doing the most work it had ever done in its short existence by digesting the meal that Briann had gluttonously gorged down a short time ago in her class.  <br>\r\n<br>\r\nBriann had become such a food consuming, fat storing, machine that she had developed breasts that were 100% fat.  They were like the moobs on an obese man and presented themselves more sideways than out in front of the child.  They extended out far enough to begin to hang off of the side of her ponderous gut.  <br>\r\n<br>\r\nHer arms had become virtually useless.  They jutted outward from her body similar to her legs, also in segmented blubber deposits.  She could only move her forearms by bending them at the elbow joint, and even that movement was restricted because of the upper arm fat that has begun to consume her forearms.  Her range of motion had been restricted to next to nothing and she couldn't even rub any of her own fat because her hands and wrists were suspended in her gelatinous form.  <br>\r\n<br>\r\nBriann no longer had a neck.  Her chest, arm, neck/face, and back fat had swallowed her neck.  This resulted in her head also being somewhat swallowed itself.  Her face was tilted slightly toward the ceiling and the pressure of her cheek fat had become so much that it forced her plump lips to pucker slightly as if ready for the tube from the classes to be inserted again.  Her would be neck fat formed into multiple chins that extended out to the beginning of her boobs.<br>\r\n<br>\r\n<br>\r\nBriann however remained hungry due to the side effects of her classes.  She began to move her arms as much as she could and lick her lips rapidly to try to display her hunger to her mother.  Briann's mom immediately took this opportunity to go to the kitchen to make her sweet-pea multiple cakes, pastries, and other assorted treats.  In the short term she gathered all of the snack food in the house and began to rapidly feed it to Briann.  Briann soon began to wail due to not being fed fast enough.  She had gotten used to the machine at the classes and anything short of that simply couldn't satisfy her now.  <br>\r\n<br>\r\nBriann's mom would have to have Robbie create her a solution when he arrives to build a new transportation method. </span></div></div>",
            "created":1320642000,
            "id":1219408,
            "title":"Briann is hungry"
        },
        "14111121111111221122112112121112112112111111212121":{
            "author_id":"mrx1",
            "author_name":"mrx1",
            "choices":[
                "House 1",
                "House 2"
            ],
            "content":"<div class=\"\"><div> <span>Briann´s mom calles Robbie and told him, that she also needs a feeding machine for Briann, because she can´t feed her fast enouth. Robbie sait that he can´t build a feeding machine, because it needs a big tank and there is no room in the house where they live now. They will have to move to another house, where he can build in a feeding machine.<br>\r\n<br>\r\nBriann´s mom thought about this. She has enouth money to move somewere else. It would also be better for the future because they can make larger doors so Briann can be moved easier. So she decided it would be the best to move somewhere else. <br>\r\n<br>\r\nAfter some research she found 2 houses to sell which look interesting:<br>\r\n<br>\r\nHouse 1: It´s near the house where they live now, so they don´t need to move far away. But maybe it´s to small.<br>\r\n<br>\r\nHouse 2: It´s far away, but very very big. It has a build in garage, that could be rebuild in a room for Briann, so she could be easily rolled out of the house, and there is also enouth place for a feeding machine.<br>\r\n<br>\r\nWhere do they move?</span></div></div>",
            "created":1347426000,
            "id":1426044,
            "title":"Problems"
        },
        "141111211111112211221121121211121121121111112121212":{
            "author_id":"mrx1",
            "author_name":"mrx1",
            "choices":[
                "Go to the rest of the house",
                "Start the feeding machine first."
            ],
            "content":"<div class=\"\"><div> <span>3 months went by and the house is now ready, so that they can move in. Briann got even fatter in the 3 months. She can´t move any muscle, not even her fingers and toes. She also can´t chew anymore, so her mother has to sick a plastic tube in her mouth and fill it with mashed food, so it can easy flow down in her stomach. But now she doesn´t have to do this anymore because the house with the intigratet feeding machine is ready.<br>\r\n<br>\r\nHer mother is proud of her. Briann weights already 300 ibs and is only 1,5 years old. She knows one day she will be the heavies human of the world.<br>\r\n<br>\r\nThey transport Briann with a special vehicle to the new house, where they bring her to the garage, that is now her room. She is placed on an extra stabile bed. Opposit of the bed is a TV and right of the bed is a very big tank, the tank for the feeding machine. In the tank is pure fat. There is a hose that is now put in Briann´s mouth down to her stomach. She also gets catheters. because no diaper would fit her and no diaper change woud be possible. <br>\r\n<br>\r\nWhat do they now?</span></div></div>",
            "created":1348117200,
            "id":1431783,
            "title":"And so they move far away"
        },
        "1411112111111122112211211212111211211211111121212122":{
            "author_id":"izanagichaos",
            "author_name":"chaoszeel",
            "choices":[
                "see the rest of the house",
                "Fast foward to the next class"
            ],
            "content":"<div class=\"\"><div> <span>The Machine started up and the hose in Briann's mouth, pumping the fat into her mouth, enjoying the fact she will be fatter afterwards. Her belly growing as she ate, but it will not be as large as it would during the classes her mother took her to. Her mother headed inside the house to prepare for next class.</span></div></div>",
            "created":1364878800,
            "id":1563249,
            "title":"Start the feeding machine first."
        },
        "14111121111111221122112112121112112112111111212121222":{
            "author_id":"izanagichaos",
            "author_name":"chaoszeel",
            "choices":[
                "Briann is still not full.",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>The next Class there was someone else at the front desk, A boy in his late teens with messy brown hair \"Ah, you must be Briann's mom, Ms...\" \"Just call me Jule\" Briann's mom said, before he could say her last name \"Ah yes, so Jule, let's take you and Briann to the room, Shall we?\" Jule followed him with Briann to the room with the tanks, covered of course so Jule could not see how much there was of the formula. \"You might be wondering about the other girl who was assisting you before\" said the teen while getting things ready \"Ah, yes, what happened to her?\" \"She was put off of your case due to the fact she did not want to help someone make their child the fattest person ever, I understand her point but she let her opinions get the better of her. It's not my concern what you do to your daughter, just as long as I get paid I'm fine with what ever the patent needs.\" Hooking Briann up to the machine he went to the controls to turn it on, \"oh, and we have made sure that Briann douse not have to worry about not getting full, for we added extra tanks for her.\" said the teen \"Oh, thanks, at least Briann will get full this time.\" said Jule. The teen turned on the machine to feed Briann. For a few hours the machine pumped Briann full of the weight gain solution, then...</span></div></div>",
            "created":1374555600,
            "id":1632819,
            "title":"New operator"
        },
        "141111211111112211221121121211121121121111112121212221":{
            "author_id":"izanagichaos",
            "author_name":"chaoszeel",
            "choices":[
                "She Weighs Brian after she is done Dighesting the formula",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>Some more Hours passed, and Briann showed no signs of stopping for a while.\"Wow, she can hold alot...\" said the teen, \"Oh yes, that is my Briann, at this rate she will be the Heaviest human!\" Said Jule, slightly exited. A couple more hours passed and then Briann was full just as the final tank ran out. Whoa... Just...whoa... 10 tanks... she sucked down all of them...\" the boy was visibly shocked at the sight, while only 2 and a half feet tall, Briann was huge. Her stomach dwarfed the rest of her body due to the side effects of the solution and the solution in her stomach made sure she would be huge. \"I am impressed... while the higher ups may feel that it is wrong to use a child as a guinea pig, the results are astounding!\" the teen said, \"now, lets get Briann out, it sure is going to be tough getting your child back home, is it?\" \"oh yes\" said Jule \"She is getting so big that it is going to be hard to move her soon.\" \"while she may be cute, you might need to invest in some type of body butter of some sort if you are going to have her keep gaining like that.\" \"oh, thanks for the advice, she sure is going to need it if she is going be a big, cute girl.\" Jule rubbed her daughter's tummy and left with Briann. Later...</span></div></div>",
            "created":1374555600,
            "id":1632822,
            "title":"Enough is not enough"
        },
        "1411112111111122112211211212111211211211111121212122211":{
            "author_id":"nowaya",
            "author_name":"Nowaya",
            "choices":[
                "Invite Gwen over. ",
                "See rest of house."
            ],
            "content":"<div class=\"\"><div> <span>After finally being able to get Briann out of the truck she had to use to hold her, she moved her gigantic daughter to her room, pouring liquidized fries into her mouth as a holdover until she could get her back to the feeding machine. As Briann was at this point too fat to chew and probably even too fat to speak much, she had no way of knowing how hungry she  was, but she would assume the answer was very. She pushed her, now sitting in a huge reinforced wheelchair, even faster. As she did so, she noticed that her daughter's beautiful belly was now just beginning to touch the ground. She needed to get her onto her machine, and she needed, even more, to see what she weighed. <br>\r\n<br>\r\nOnce they reached the bed-an agonizing two minutes for Briann with barely any food- which is to say, only the liquidized equivalent of thirty large fries- they reached her bed, which the mother was able to put her on quit easily with the wheelchair's motorized tilt function. This was the only part Briann liked about going places, that slow slide from chair to bed with all her flab. Finally, she wa settled, happily sucking on her feeding tube, and her mother turned on the integrated scale. <br>\r\n<br>\r\n524 pounds. <br>\r\n<br>\r\nHer mom tapped the screen of the scale, reset it, and let it calculate again.<br>\r\n<br>\r\nIt now displayed the proper number. <br>\r\n<br>\r\n603 pounds. <br>\r\n<br>\r\nThe mother nearly swooned. 603 pounds of enormous, flabby, massive, fatty, huge, one-and-a-half year old daughter. Her belly now stretched far past her useless feet, rolls upon rolls of young, cute belly, close to reaching the end of the bed and just beginning to fall off the side. Barely visible feet ensconced in flabby rings of leg fat, accentuating the uselessness of her limbs. Her arms were extended, outstretched, supported by fat and hiding her cute chubby hands. Her boobs- yes, boobs at one-and-a-half!-stretched down her body, stopping halfway down her huge bulk. Her face looked up and forward, placed there by rings of chins-seven, at this point-and neck fat, absorbed in a TV show. Her cheeks were also fat, now stretching past the edge of her face and ever-so-slightly pinching her nose. Her hair flowed back, unencumbered, over her sea of back fat, stopping just above her wide, flabby butt. Each cheek weighed as much as a girl of six or seven, and each one was around the size of a yoga ball. From it flowed the tube which collected her waste, which had replaced her diaper several pounds ago. It was entirely necessary, as not only was there no way to access all of Briann's fantastically huge butt, but also with the degrading of her very slight muscles there was no way she could hold any of it back. The tube went up, merged with the catheter- also necessary, as only a forklift could lift her belly at this size- and disappeared into the ceiling, near where the food tube came down and restarted the cycle. Briann-and Brianns mother- were in heaven. Except for one small thin, she realized. She, in her excitement of feeding, moving, feeding, feeding again, getting settled, and then feeding even more, she had completely forgotten about Gwen, Briann's only friend. \"Briann, would you like to have Gwen over? I'm sure she'd love to see you!\" Briann's mouth twitched slightly  and her eyes crinkled. Her mother, after a moment, recognized that as a smile.</span></div></div>",
            "created":1437195600,
            "id":2009625,
            "title":"She Weighs Brian after she is done Dighesting t..."
        },
        "14111121111111221122112112121112112112111111212121222111":{
            "author_id":"nowaya",
            "author_name":"Nowaya",
            "choices":[
                "Skip to Gwen's arrival.",
                "Briann's POV."
            ],
            "content":"<div class=\"\"><div> <span>After giving Briann a kiss on the cheek and assuring her she'd be right back, Jule walked slowly into the house and fixed herself a small sandwich. She would never have thought of doing such a thing before, but ever since Briann had gotten her feeding machine she was able to have a bit of free time and spare food. It was nice. As such, she'd gained a little bit back- being able to eat at regular mealtimes rather then whatever scraps remain after Briann had gone to sleep does tend to add some poundage. She was now slightly less skin-and-bones. <br>\r\n<br>\r\nAfter finishing the sandwich, she dialed Gwen's mothers number. After three rings, she picked up. \"Hello?\"<br>\r\nGwen's voice rang out in the background. \"Mommy, hungry!\"<br>\r\n\"Hi, it's Briann's mother! How are you?\"<br>\r\n\"Oh, hello! I'm just fine! And you?\"<br>\r\n\"Just fantastic!\"<br>\r\nGwen again. \"Mommy, HUNGRY!\"<br>\r\n\"Just a minute, let me give her a burger.\" <br>\r\nAfter a minute, she returned.<br>\r\n\"Sorry, she's just been demanding so much food after we broke the big 150. It's hard, but I like it, and so does she.\" <br>\r\n\"That's great! I'm so happy for you!\"<br>\r\n\"Yes, and how's your darling Briann?\"<br>\r\nBriann's mother chuckled. <br>\r\n\"You've really got to come over and see for yourself! Make sure you bring Gwen too!\"<br>\r\n\"Oh, excellent! We're free now, we'll be there by, let's say, 3 PM.\"<br>\r\n\"Awesome! We've moved, our new address is [REDACTED].\"<br>\r\n\"Ok, see you soon!\"<br>\r\n\"HUNGRY!!\"<br>\r\n</span></div></div>",
            "created":1437282000,
            "id":2009839,
            "title":"Invite Gwen over. "
        },
        "141111211111112211221121121211121121121111112121212221111":{
            "author_id":"nowaya",
            "author_name":"Nowaya",
            "choices":[
                "\"Hungry!\"",
                "\"Briann!\""
            ],
            "content":"<div class=\"\"><div> <span>A few hours later, the house is ready for Gwen's arrival. Snacks have been readied, Briann's feeding tank has been refilled, and the floor's been cleaned. Briann sucked happily on her feeding tube. Despite not understanding much about the passage of time, she could tell that something interesting was happening by the way her mother bustled around. She \"smiled\" in the only way she could, and waited excitedly.<br>\r\n<br>\r\nBefore too long, a car pulled into the driveway. Gwen's mother got out, admiring the large home before her, before a cry of \"MOMMY!\" brought her back to reality. She quickly helped Gwen out of the backseat of her car and half-carried, half-waddled her towards the door. Although Gwen was nowhere near the size of our cute chubby protagonist, she had certainly grown, with a belly that hung nearly to her knees from her standing position. She currently had half a hamburger stuck in her mouth. <br>\r\n<br>\r\nBriann's mother watched Gwen (and her mother) toddle and jiggle up the drive. She smiled, thinking of her own enormous daughter. What would have happened if she hadn't done the classes, and had instead fattened her daughter up the \"natural\" way? Who can say. What can be said, however, is that Jule was far too happy with Briann like this to want her any other way.<br>\r\n<br>\r\nBy this time, the duo of Gwen and her mother had reached the door. Jule, opening it, exclaimed, \"What a beautiful little girl!\" It was now obvious that Gwen was straining her clothes to the limit. She was wearing only sweatpants and a T-shirt, which, by the length of the limbs alone, seemed built for adults, but by how Gwen filled them looked cartoonishly small. Her belly flubbed out over her waistband and rested by her knees, seemingly impairing her ability to both crawl and stand. Perfect.<br>\r\n<br>\r\nUpon entering the house, Gwen immediately cried...</span></div></div>",
            "created":1437282000,
            "id":2009885,
            "title":"Skip to Gwen's arrival."
        },
        "1411112111111122112211211212111211211211111121212122211112":{
            "author_id":"nowaya",
            "author_name":"Nowaya",
            "choices":[
                "Sad",
                "Determined"
            ],
            "content":"<div class=\"\"><div> <span>\"Of course, dear, you miss your friend.\" Gwen's mother said to the little girl. \"Now, do you want to crawl there?\" But Gwen was already off, pushing herself forward with her knees on her belly, and her belly dragging itself onr the ground. After a few minutes, they reached Briann's room. Briann's mom proudly flung open the door. <br>\r\n<br>\r\nGwen and Gwen's mother both stopped, in awe of the vaguely-girl-like blob in front of them. Gwen's mother was barely able to formulate a sentence. \"Sh...She...how...oh...She's so big! How heavy is she?\"<br>\r\nFor answer, Briann's mother activated the scale. It now read 611 pounds! <br>\r\n\"Oh, my lovely, beautiful daughter! You've gained eight pounds since this morning! Awesome job, Briann!\" She said, patting her belly. Said belly was clearly bulging out a bit farther then it had earlier. Speaking of bellies, Gwen's was moving forward, as was Gwen herself. She was crawling for Briann. Then, about halfway there, she decided it was taking far too long. So she did something completely unprecedented.<br>\r\n<br>\r\nShe stood. <br>\r\n<br>\r\nThen, she took her first step.<br>\r\n<br>\r\nGwen's mother was ecstatic. \"Gwen dear! I'm so proud of you! Don't overstrain yourself!\"<br>\r\n<br>\r\nBriann's mother was similarly proud. Briann had never learned, which was wonderful, but she sort of missed being able to witness that milestone. Now she was able to, through Gwen.<br>\r\n<br>\r\nGwen, mostly unaware of these facts, pressed forward. Sweat coated her body, dripping down her brow and dribbling onto the ground from her huge round belly. After taking a strenuous ten steps, she plopped down to the ground and reached up her chubby arms towards the bed. The mothers needed no further prompting, lifting her onto Briann's bed. Gwen then proceeded to crawl the last few feet until she was sitting on top of Briann's vast belly. Briann \"smiled\" again, and Gwen smiled right back, Gwen then proceeded to play with Briann's vast expanse of flab. Briann was super happy! Then, however, her facial expression changed. She now looked...</span></div></div>",
            "created":1437282000,
            "id":2009897,
            "title":"\"Briann!\""
        },
        "14111121111111221122112112121112112112111111212121222111122":{
            "author_id":"nowaya",
            "author_name":"Nowaya",
            "choices":[
                "Took the tube from Gwen and retuened it to Briann's mouth.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Briann's eyes took on a much more focused look. She looked at her mother, then at the tube, then at Gwen, then made a sucking sound. At first, her mother didn't understand. \"What is it, my big princess? What are you trying to tell me?\" <br>\r\nBriann then looked at the tube, then looked up. Then made a popping sound. <br>\r\nBriann's mother looked concernedly at her. \"You want me to...take out your tube? Are you sure?\" Briann jiggled her head slightly, indicating \"Yes.\" <br>\r\n<br>\r\nHer mother, nervously, took it out, dribbling lard all over her chins and boobs. <br>\r\nBriann then breathed deeply, a small line of sweat breaking out from the effort. \"Aah,\" she said. Her fat cheeks and chins and lack of musculature made it impossible to close her mouth or even change it's shape from an open and tube-ready position. This is why she had been unable to eat solid food- the inability to close made it impossible to chew. \"Aan,\" she said, pointing her eyes at the tube, then at Gwen. \"What is it you want me to do, dear? I don't understand!\" <br>\r\n<br>\r\nBriann rolled her eyes, something she had learned to do from TV. Then, she made the most determined face yet. She strained, sweat breaking out of every pore in her body, soaking the bed and Gwen's pants. Atrophied and tiny muscles that she had not used in months strained against her blanket of fat. \"Aaannnn...\" she said, working the hardest she'd worked in a year. \"Oh, my strong little warrior princess! I can barely believe it! You're so strong!\" her mother said, barely believing the scene. \"Aaaa...AA!\" Briann said, her expression changing to one of triumph. Pleased with her work, she closed her eyes slightly and panted. Due to the sudden relaxation, both of her waste tubes suddenly sprang to life, bearing away the residue of her extreme strain. Sweat dripped on the floor, and her belly let out a sharp growl, demanding food after doing without any substance for forty whole seconds. <br>\r\n<br>\r\nBriann's mom looked closely, trying to see what her strong little girl had done. Finally, she realized it.<br>\r\n<br>\r\nHer left pointer finger, formerly pointing straight at the wall, was now pointing a few degrees more towards her front, in the general direction of Gwen. Her mother finally caught on.<br>\r\n<br>\r\n\"Oh, Briann! You want to share!!\" <br>\r\n<br>\r\nBriann, exhausted, still managed to muster the effort to jiggle out a \"Yes.\" <br>\r\n\"Briann, you're so polite! So caring! May I?\" The last question was directed at Gwen's mother, who was still in awe of Briann's enormous size. \"Uh...yeah! Sure!\" <br>\r\nBriann's mother proceeded to move the tube close to Gwen, who, needing no encouragement, started to suck. Briann smiled a huge smile! Which is to say, her mouth opened even wider, and the corners closed ever so slightly. But then, her expression changed to pain! She just realized she was ravenous! Starving! Her belly roared in response, jiggling wildly and nearly shaking Gwen off. The fact that she had, over the course of the day, drank up almost five hundred gallons of pure lard did not once cross her mind. All that she now knew was that she was ravenous. Briann's mother immediately...</span></div></div>",
            "created":1437282000,
            "id":2009910,
            "title":"Determined"
        },
        "141111211111112211221121121211121121121111112121212221111222":{
            "author_id":"johnfreeman010",
            "author_name":"johnfreeman010",
            "choices":[
                "Shift to Briann's and Gwen's POV",
                "Shift to the mothers' POV"
            ],
            "content":"<div class=\"\"><div> <span>Briann's mother suddenly noticed that Briann was already hungry from the lack of food due to the intense growling coming from Briann's giant belly.  Briann's mother immediately regretted letting Briann remove her feeding tube, but Briann's mother was prepared for such an occasion.  Brian's mother then went to  the feeding machine and pulled out a second feeding tube, an emergency tube, from the machine.<br>\r\n<br>\r\nThe emergency tube on the machine was there just in case Briann got so hungry that one tube wasn't enough to sate her hunger and that she would need two tubes pumping lard into her mouth.  However, another obese baby coming over made the need for an emergency tube more useful.  Briann's mother then placed the emergency tube into Briann's mouth and turned on the flow for the emergency tube, causing lard to flow into Briann's mouth and down her esophagus.  Suddenly, Briann's belly stopped rumbling, and Briann no longer has any hunger pains due to having a source of food again.  Briann and Gwen, who is on Briann's belly, are now feeding together from the same machine.<br>\r\n<br>\r\n\"Oh, Briann!\" Briann's mother exclaimed, \"I didn't realize that you would last this much without food! I'm going to make sure you won't have to go hungry next time.  Still, I'm proud that you are willing to share your feeding tube to your friend, even if it makes you go hungry afterwards.\"<br>\r\n<br>\r\nBriann and Gwen continued to happily eat lard from the feeding machine, their bellies slowly growing bigger with lard.<br>\r\n<br>\r\n\"I think we should give our girls some time alone to play with each other,\" Gwen's mother said.<br>\r\n<br>\r\n\"I agree,\"  Briann's mother said as they went to another part of the room.</span></div></div>",
            "created":1450501200,
            "id":2076728,
            "title":"Emergency Tube"
        },
        "1411112111111122112211211212111211211211111121212122211112221":{
            "author_id":"nowaya",
            "author_name":"Nowaya",
            "choices":[
                "Switch to the parents. ",
                "The day flies by, and the girls have gained... "
            ],
            "content":"<div class=\"\"><div> <span>Briann looked happily at her rapidly bulging companion. Though Briann lacked in age, life experience, and mobility, she could tell that Gwen was enjoying herself immensely. The smaller girl was sucking greedily on the tube, bright green eyes shining with joy through her face fat. Her T-shirt had ridden up, exposing her fat lump of belly that was rapidly swelling and approaching roughly the size and shape of a beach ball. Briann could see that, although at her size she needed the feeding tube simply to stay alive, Gwen did not- and that meant she was quite willing to get even bigger. Briann was very pleased.<br>\r\n<br>\r\nGwen, too, was quite happy. The lard, though quite unusual, tasted terrific, and the quantity of it meant that she would soon be just as fat as her significantly larger friend. As she looked down from her perch on Briann's belly at her friend's immense face, ringed by cheeks, chins, and arm, nestled down in the valley between the peaks of belly and butt, she could see just how happy she was. Gwen had long ago weighed, as well as a girl so young could, the consequences of immobility, and she had almost instantly decided that <i>not</i> having to do anything at all was vastly preferable to the alternative. She stroked Briann's enormous belly, and smiled around her tube. Briann returned the gesture. <br>\r\n<br>\r\nAnd so, the two girls ate, and ate, and ate...</span></div></div>",
            "created":1451106000,
            "id":2079676,
            "title":"Shift to Briann's and Gwen's POV"
        },
        "14111121111111221122112112121112112112111111212121222111122212":{
            "author_id":"johnfreeman010",
            "author_name":"johnfreeman010",
            "choices":[
                "50 pounds",
                "More than that"
            ],
            "content":"<div class=\"\"><div> <span>Hours had gone by, and the two girls are still sucking and eating lard from the machine's tubes.  They clearly had grown bigger and fatter, if their large distended bellies and growing layers of fat were of any indication. Even though Briann was larger than Gwen, the machine fed both girls the same amount of food so that one girl didn't eat as much as the other.  Still, Briann and Gwen were happy that they were eating and gaining together.  So far, each girl had gained at least:</span></div></div>",
            "created":1451278800,
            "id":2080375,
            "title":"The day flies by, and the girls have gained... "
        },
        "141111211111112211221121121211121121121111112121212221111222121":{
            "author_id":"nowaya",
            "author_name":"Nowaya",
            "choices":[
                "Quick, we have to weigh her!",
                "Oh no, how will I get her home now?"
            ],
            "content":"<div class=\"\"><div> <span>It was an inadvertent glance at the stove clock that ruined the conversation. The two mothers had been talking to each other for hours when Gwen's mom happened to see that it was 10:30- far too late for Gwen. \"Oh my gosh!\" she cried, pushing her chair away from the table. \"I had no idea it was so late! I'd better get Gwen home.\" \"Why don't you two spend the night? Briann would love to have you guys,\" said Jule, Briann'a mother. \"I'd love to,\" said Gwen's mom, Alexis, \"but I don't want to impose on you two.\" \"Oh, it's perfectly fine! Really! With Briann in the garage we've got lots of extra space.\" \"Well, that's very kind of you, but-\" Alexis stopped with a gasp. They had reached the garage. And hours of feeding had taken their toll. <br>\r\n<br>\r\nBriann had clearly gained, although on such a large body as hers the effects weren't too noticeable. There was certainly an distinct roundness to her normally flabby stomach. It also pooched out significantly farther across the bed. Jule could tell that once she'd digested it all she'd be quite a lot flabbier. But who really took the cake was Gwen.<br>\r\n<br>\r\nGwen was now quite a lot bigger. Her enormous belly, which had been resting flabbily on her knees when she first sat on Briann, was now a round ball sitting heavily between her calves. Her too-tight shirt had completely busted, scraps of cotton coating Briann's belly, small ornaments to her gain. Her leggings had rode down so far as to expose her bare bottom to the rest of the room. She'd become, in short, quite enormous. Alexis, recovering from her initial shock, said...</span></div></div>",
            "created":1451439900,
            "id":2081247,
            "title":"50 pounds"
        },
        "1411112111111122112211211212111211211211111121212122211112221211":{
            "author_id":"nowaya",
            "author_name":"Nowaya",
            "choices":[
                "\"...too much! Gwen's too fat now!\"",
                "\"...not enough! Put her back on that machine!\""
            ],
            "content":"<div class=\"\"><div> <span>\"...Quick, we need to weigh her! I have to see how much she's gained!\"<br>\r\n<br>\r\nAlexis was in heaven. Her little girl, already very fat, had clearly become much fatter- and that was all she had ever wanted for her little big Gwen. But, as the daughter of an actuary and a calculus professor, numbers were at the heart of Alexis' being- so she needed a quantity. She needed to find out just how much <i>more</i> Gwen weighed than she had just a day before. But, seeing as Gwen wasn't exactly in the mood to move very far, they resorted to a bit of old-fashioned ingenuity. Alexis began by waving a very large cookie at Gwen, catching the attention of the smaller fatty. With the smell of the cookie permeating her snubby nose and Alexis's cooing, Gwen began scooching herself over to her mother, dislodging her scraps of clothes still further in the process. Once she reached the edge of Briann's vast body, the two mothers were able to lower her down without <i>too</i> much process. Briann, however, upon realizing that Gwen was gone, threw a tantrum- or as much of a tantrum as an immobile girl can throw (it wasn't much- just a bit of low moaning.) Jule activated the bed scale, revealing that Briann now weighed a whopping 671 pounds- fifty pounds up from this morning! An absolutely astonishing gain by any standards. \"Aw, my beautiful big princess! Were you trying to impress Gwen? Well, you impressed me for sure, Bri-Bri!\" She patted her daughter's sweaty hair affectionately. <br>\r\n<br>\r\nThen, phase two. Gwen was, again without much protest, lifted back onto her perch on the vast swath of fat that was Briann. Then, the scale was activated again. The numbers flashed- 885! After some quick calculations, that brought Gwen up to an absolutely astounding 214 pounds- up from just 164!<br>\r\n<br>\r\nAlexis gasped, barely believing the numbers before her. \"This is- this is...\"<br>\r\n </span></div></div>",
            "created":1456281840,
            "id":2108678,
            "title":"Quick, we have to weigh her!"
        },
        "14111121111111221122112112121112112112111111212121222111122212111":{
            "choices":[
                "Briann couldn't eat without Gwen's company.",
                "Briann's hunger overpowers her friendship with Gwen, and demands more food."
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my god, she's too fat! I didn't want her to become this large, take her off that machine immediately!\" Alexis cried out.<br>\r\n\"What? But I thought this is what you and your daughter wanted.\" Briann's mother asked, a bit perplexed.<br>\r\n\"Well, maybe you don't care about how well your daughter gets around, but I still want mine to be able to walk.\" Alexis stated, as she grabbed Gwen and hastily made her way out of the building, \"Good day!\"<br>\r\n<br>\r\nBriann was disappointed. She really liked Gwen's company, but since her mother took her away, she seemed not in the mood for eating.<br>\r\n\"Oh, Briann. Don't worry about Gwen, I'm sure her mother will pull through eventually. Now how about we hook you up to Gwen's old Hose and see if we can't make you even larger than this?\" Briann's mother encouraged.<br>\r\nBriann thought for a while...</span></div></div>",
            "created":1457275440,
            "id":2113694,
            "title":"\"...too much! Gwen's too fat now!\""
        },
        "14111121111111221122112112121112112112111111212121222111122212112":{
            "author_id":"sphysic",
            "author_name":"Sphys",
            "choices":[
                "Follow the mothers' conversation.",
                "Skip to the morning."
            ],
            "content":"<div class=\"\"><div> <span>“This… this isn’t enough; she’s much too thin!” Exclaimed Alexis, turning to Jule. <br>\r\n<br>\r\n<br>\r\n“Would it be alright if I took you up on your offer to stay the night? Leaving Gwen on the feeder, of course, I’d love to see how big she’ll be in the morning.” She explained, almost visibly drooling at the thought of her growing girl getting all the larger.  <br>\r\n<br>\r\nShe’d known, almost immediately after seeing the girl that her daughter was currently sitting on, what she wanted in Gwen’s future, growth, nothing but. Only for her ‘little’ girl to grow, out, and out, and out, larger than even Briann, and with the clinic’s paste’s effects, she’d never have to worry about any unwanted consequences caused by her unnatural size.  <br>\r\n<br>\r\n<br>\r\nJule readily agreed, sharing Alexis’ enthusiasm in fattening the girls, “Of course, who do you think you’re asking? I’ll even increase the power for good measure.” She said, twisting one of the pump’s many dials, making the flow noticeably quicken.  <br>\r\n  <br>\r\n<br>\r\nThe girls, being on the receiving end of the feeding, were slightly surprised at the increase in flow, but, being the gluttons they were, they welcomed the change, suckling on their respective hoses. The mothers, strange as they may be, were moving back inside the house for the night, or at least they would be if Alexis could keep her hands off her daughter’s growing body. Currently, she was squishing and massaging all of the newly added flab from today’s feeding, the testament of the girl’s excess, while thinking that it’d take nothing short of a miracle for the growing Gwen to be able to move a single step after tonight.  <br>\r\n<br>\r\nThough, with the inevitable promise of much more Gwen, there was a question to ask,  <br>\r\n<br>\r\n<br>\r\n“Is it alright to leave her on top of Briann? Maybe we should move Gwen now, given that this is about the last time we’ll be able to.”  <br>\r\n<br>\r\n<br>\r\nJule hadn't realized this seemingly obvious problem, but luckily, she seemed to have a solution. “Oh, I can’t believe that slipped my mind. Could you come and help me for a moment, there should be an extra bed in storage for when Briann outgrows the one she’s on, let’s put Gwen on it.”   <br>\r\n<br>\r\nAfter giving her consent, Alexis went with Jule over to the more cluttered area of the garage, soon finding the aforementioned bed. Given the bed’s size, they thought it’d be more comfortable for both of them to carry it at once, so, each mother grabbing a side, they started lugging it over next to Briann’s bed, making sure it was close enough for Gwen’s tube to reach. Now to move the growing girl, it wasn’t hard, given that they only needed to nudge the smaller girl until she ended up on the other bed slightly disgruntled but ultimately not caring much in the presence of food.  <br>\r\n<br>\r\nAlexis, now all the more excited for the growth her daughter would experience for now till… well, she supposed it wouldn’t end, not for a good few years at least, spoke out of barely repressed delight and relief,   <br>\r\n<br>\r\n<br>\r\n“I’m glad we moved Gwen now, I doubt we’d have been able to if we’d waited till morning. She’s already so big, how much larger do you think she’ll be in the morning?”  <br>\r\n<br>\r\n<br>\r\n“I’d assume closer to my daughter’s size right now, but we won’t know until tomorrow. Come on. We should probably get some food ourselves, what would you like?” Jule asked, remembering that they hadn’t eaten throughout their conversation.  <br>\r\n<br>\r\n<br>\r\n“Oh, anything’s fine, but now that you mention it, I am hungry. Maybe we should wait till we’ve finished eating to continue our conversation since I’m hoping to eat something before breakfast tomorrow.”  <br>\r\n<br>\r\n<br>\r\nLeaving the girls to feed from their respective hoses, the mothers went back inside to finish their earlier conversation, each having the pleasant thought of how much doughier the girls will be in the morning.</span></div></div>",
            "created":1556587440,
            "id":2652337,
            "title":"(She can't get no) Satisfaction."
        },
        "1411112111111122112211211212111211211211111121212122211112221212":{
            "author_id":"johnfreeman010",
            "author_name":"johnfreeman010",
            "choices":[
                "\"Let my brother Robbie help modify your car.\"",
                "\"Rent a more spaceous car for Gwen.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Oh no, this isn't good!\" Alexis worriedly said after recovering from her shock, \"I never would expect Gwen to grow this big so soon!  She looks too big to fit in the car now.  How am I supposed to get her home now?\"<br>\r\n<br>\r\n\"Don't worry.  My car has more than enough room for Gwen.  I can help drive her home,\" Jule said.<br>\r\n<br>\r\n\"Thank you for your help, but how can I drive Gwen around if I don't have access to you or your car?\"  Alexis asked.<br>\r\n<br>\r\nJule thought about how to fix this problem before coming to a conclusion.<br>\r\n<br>\r\n\"I know how to fix this,\" Jule said, \"You can:</span></div></div>",
            "created":1451458680,
            "id":2081405,
            "title":"Oh no, how will I get her home now?"
        },
        "14111121111111221122112112121112112112111111212121222111122212121":{
            "author_id":"nowaya",
            "author_name":"Nowaya",
            "choices":[
                "resisted, and started to cry.",
                "accepted, but Briann isn't happy..."
            ],
            "content":"<div class=\"\"><div> <span>\"...he's worked wonders for me and Briann!\" said Jule, enthusiastically. \"He's an engineer.\" Alexis considered this. It would certainly make it easier to carry her ever-growing daughter around, but did she really want a Briann-sized little girl? After some deliberation, she threw caution to the winds and said, \"That'd be great!\" \"Excellent!\" said Jule. \"I'll call him tomorrow then. For now, let's get Gwen to my car.\"<br>\r\n<br>\r\nAlexis went over and gave her daughter's swollen belly a soft pat. \"Gwen dear,\" , she said softly, \"it's time to get going.\" She reached for the feeding tube stuck firmly in the smaller huge girl's mouth. Gwen...<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1451483100,
            "id":2081478,
            "title":"\"Let my brother Robbie help modify your car..."
        },
        "141111211111112211221121121211121121121111112121212221111222122":{
            "author_id":"johnfreeman010",
            "author_name":"johnfreeman010",
            "choices":[
                "100 pounds",
                "Even more than that"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Both girls have clearly gained more than 50 pounds each.  In fact, they have gained:</span></div></span></div>",
            "created":1451278800,
            "id":2080376,
            "title":"More than that"
        },
        "1411112111111122112211211212111211211211111121212122211112221222":{
            "author_id":"johnfreeman010",
            "author_name":"johnfreeman010",
            "choices":[
                "150 pounds",
                "Still more than that"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Amazingly, both girls gained more than 100 pounds each.  They have gained:</span></div></span></div>",
            "created":1451278800,
            "id":2080379,
            "title":"Even more than that"
        },
        "1411112111111122112211211212111211211211112":{
            "author_id":"undeadviper",
            "author_name":"UndeadViper",
            "choices":[
                "They chat to the girl at the checkout",
                "they buy the clothes and go striaght home"
            ],
            "content":"<div class=\"\"><div> <span>She grabbed a green dress with daisy patterns, it looked large enough. She fed Briann's hands through the holes and gently pulled it down. The dress stopped just below the rolls of fat that would grow to be Briann's breasts.<br>\r\n\"okaaay\" her mother murmured, she searched the rack for more dresses. She decided upon a yellow sundress two sizes larger. She tired to put that on Briann, but found that only reached a few inches bellow her breasts. She threw it in her basket, deciding to use it as a shirt for Briann.<br>\r\n\"Hungry!\" groaned Briann, clutching her swollen belly. <br>\r\n\"I know sweetie\" her mother said, giving her a chocolate bar to placate her \"Just give mommy some more time\". Briann gurgled happily, shoving the chocolate into her mouth greedily. There was a quiet hissing noise as her super-sized diaper began to stain yellow.<br>\r\n\"Awww Briann!\" her mother groaned \"You'll have to wait to get home for a change\"<br>\r\n<br>\r\nShe grabbed a larger dress, a red strawberry patterned one. This time it managed to cover her belly button, leaving her fat legs and diaper on show. Satisfied she threw two in the basket. Briann was getting too big even for plus-sized baby clothes. All the sizes she bought were barely crop-tops on her! she'd have to find a source for bigger ones before people started saying her baby was nearly nude!<br>\r\n<br>\r\nShe turned to leave to nearly knock a girl over.<br>\r\n\"Oh No!\" she gasped as the girl managed to steady herself along a self, she noticed that the girls belly was swollen into a round pregnant bulge. \"Oh my god are you okay?\"<br>\r\n<br>\r\n\"I'm fine, I'm fine\" the girl replied, clutching and rubbing her belly. She was a pale girl with dirty blond hair tied in a ponytail behind her. She looked at her than at Briann. \"oh my\"<br>\r\nShe stared at the very fat toddler sitting in only a soaked diaper, Briann grinned back with chocolate smeared lips, rubbing her belly that hung to her knees.<br>\r\n\"She's.....very...big\" the pregnant girl said slowly, rubbing her own belly reassuringly.<br>\r\n<br>\r\n\"I know\" Briann's mom grinned, feeling the same burst of pride \"she certainly loves her food\"<br>\r\n<br>\r\n\"You let her get this big?\" the girl said, sounding unsure of her own words. She moved closer to the grinning Briann who reached out with fat-swollen arms.<br>\r\n<br>\r\n\"Yes\" her mother replied defensibly \"With a little help of course\"<br>\r\n<br>\r\n\"So you fattened her...\" the girl looked stunned, but before Briann's mother could reply she turned to her.<br>\r\n\"as you can see, I'm ready to pop\" she said a hand resting on her pooped-out belly button. \"its just....when the baby is born, i want her to be...to be like yours\" she looked like she had been bottling this up for a while.<br>\r\n<br>\r\n\"Aww honey\" Briann's mother smiled  giving her girl a hug \"So you want help?\" the girl nodded \"Okay, there s place that help anorexics get back to normal weight, they let me take Briann there, they giver her a tube and a pump to suck a fattening paste. It helps her balloon up in no time.\"<br>\r\n\"Okay\" the girl nodded, she got her iphone out and added the address.<br>\r\n\"When are you due?\" <br>\r\n\"Around two weeks\" the girl replied \"I'm stocking up on diapers and clothes, do you mind if i take a photo of Briann? Give me something to aspire to?\"<br>\r\n\"Sure\" her mother smiled. Briann cooed and giggled as the girl took a few photos of her. She enjoyed being the little celebrity. <br>\r\n<br>\r\n\"Thank you so much\" the girl smiled. \"I'm Amy, by the way\" they shook hands and Briann's mother told her \"If you want to meet up again or chat about gaining here's my number\" she gave it too her and the girl smiled, she gave Briann a rub on the belly and a chocolate bar before waddling away.<br>\r\n<br>\r\n\"What a lovely girl she was\" smiled her mother taking hold of teh stroller and wheeling Briann away. briann nodded, having eaten her chcolate bar already, before soaking her diaper again</span></div></div>",
            "created":1470848820,
            "id":2194002,
            "title":"They don't fit"
        },
        "1413":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Another girl</span></div></span></div>",
            "created":1282798800,
            "id":944613,
            "title":"soemthin else"
        },
        "14132":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Yes.",
                "No."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Instead of another girl at school, perhaps its some boys at home?</span></div></span></div>",
            "created":1451106000,
            "id":2079723,
            "title":"No"
        },
        "142":{
            "choices":[
                "her mom starts to like her daughter fat",
                "Even more feeding",
                "somethin else"
            ],
            "content":"<div class=\"\"><div> <span>Briann was always a chubby girl her mother her only parent didn’t care about what she weighed just more upon that she was a happy girls with all that she wanted. “more” the little said with the only words she could mouth since she was just starting to talk, when her mother offered her a 12 stack of pancakes. Devouring every little bite the little girl started to feel more and more full and more and more happy that she lived in a great home with a awesome mom. </span></div></div>",
            "created":1282280400,
            "id":940275,
            "title":"just dont care"
        },
        "1422":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "it held",
                "it tears",
                "more food then tears"
            ],
            "content":"<div class=\"\"><div> <span>As Briann was eating her diaper became tighter with her growing belly. She was already eating more then usual this morning. Her little big belly was getting very round and overlapping the diaper. Her mother looked over to her daughter and smiled. It did look pretty cute. She was pretty messy because of the syrup.<br>\r\n<br>\r\nHer mother started to wonder what she would look like even bigger which she knew she would be because as long as she was hungry she would be eating and her hunger was increasing.<br>\r\n<br>\r\n\"you are such a good eater\" said her mom<br>\r\n<br>\r\nThere was no respnse because the only words she could say were hungry and more.<br>\r\n<br>\r\nThen her mom startde to notice that the velcrow on the diaper wassliping but...</span></div></div>",
            "created":1282366800,
            "id":940592,
            "title":"Even more feeding"
        },
        "14222":{
            "author_id":"slaike",
            "author_name":"amber",
            "choices":[
                "Fast forward too 14:00",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Briann stuffed another piece of pancakes in her mouth and then her diaper tears. If the little girl noticed this she did't showed it. The only thing she minded was getting the pancakes in her mouth. <br>\r\nHer mother did looked smiling at her.<br>\r\nHer mother (let's call her Caroline) did't really cared about her daughters weight. If she did she would have been more worried. Not that she did't loved Briann. Briann was the most important thing in her life but she saw no problem in a child with a healthy appetite. She fed Briann whenever she wanted and also if she did't want it. The little girl was learned to eat everything that was set in front of her and she did. She ate and ate and ate and then she ate some more.<br>\r\nBriann was't stupid. Sure she just turned one a few months ago, and could't say many words but she understood more words and her brain was working too understand more. But she was pretty lazy. Trying to say the words was too much effort for her. Just like she could crawl but hardly did it. As long if she would get food she was all right.<br>\r\nOf course lack of exercise and constant snacking caused the girl too become pretty fat. She herself did't care much about it. The only thing she mind was get food in my tummy. All of her fat was spread over her young frame.<br>\r\n<br>\r\n\"Good girl!\" Caroline said while Briann finished the last bite.<br>\r\n<br>\r\nShe did't knew what good girl mend but knew the different between a happy and an angry voice. So she knew it was something good.<br>\r\n<br>\r\nThen she heard someone at the backdoor. She looked up and saw Jenny. The next door neighbor. She was Babysitting Briann a lot since she needed money and was also very handy and helped in the house sometimes since Briann's parents were't too handy i making or repairing things. Jenny was thirteen but learned a lot of repairing things from her parents and she liked doing them.<br>\r\n<br>\r\n\"The door is open!\" Caroline said.<br>\r\n<br>\r\nJenny walked in and kissed Briann.<br>\r\n<br>\r\n\"How's my favorite neighbor kid?\"<br>\r\n<br>\r\n\"She's your only neighbor kid.\" Caroline said.<br>\r\n<br>\r\n\"Details, details!\" Jenny said laughing.<br>\r\n<br>\r\n\"Oh Jenny my sister asked me to help my mother. Could you babysit around 14:00?\"<br>\r\n<br>\r\n\"Sure it's no problem.\"<br>\r\n<br>\r\nJenny smiled with perfect white teeth, She had a pretty face and dark red hair. Since she was pretty small for her age she sometimes looked a bit younger then she was. She also carried a round potbelly and saw no harm in feeding Briann if she wanted it and her mother was fine with it. She knew were all the snacks were since she also licked it too snack herself during the work she did here and both Briann's parents were happy to gave her something for her help besides money.<br>\r\n<br>\r\n\"Besides thanks for the help with the sink. It works perfect thanks too you.\"<br>\r\n<br>\r\n\"No problem. I like working with my hands.\"<br>\r\n<br>\r\n\"Now i'm sorry but i need to take Briann to take a bath. She became very messy.\" <br>\r\n<br>\r\n\"Oh i help.\" Jenny said. <br>\r\n<br>\r\nJenny and Caroline walked with Briann over too the baby room and filled a small bathtub with water. Briann looked excited when she heard the water. She liked it if her mother washed her and already started too giggle.<br>\r\nJenny already picked the soap and shampoo. She knew how too was Briann. Together they cleaned the little girl.<br>\r\n</span></div></div>",
            "created":1282626000,
            "id":942941,
            "title":"Jenny"
        },
        "142222":{
            "author_id":"killercon",
            "author_name":"bsh101",
            "choices":[
                "The feeding",
                "Clothes shopping. stuffed baby"
            ],
            "content":"<div class=\"\"><div> <span>After they got done with the bath they went to get her dressed. They found some strechey pants but every shirt came up to her belly button. Although it looked very cute Caroline knew she could not take her out in public with her tummy showing and her already being a fat little girl. She did not like bein critizised by people for her daughter weight. <br>\r\n<br>\r\nThe only people who accepted her weight where family and Jenny. Any way she came up with a theory. Feed her so much that she ripps her shirt and her pants are to tiht and then quickly take her clothes shopping. This way her clothes might last a little while so they went beack tot he dinner table. She told this to Jenny and she was happy to help. She had a thing for feeding little kids. <br>\r\n<br>\r\n\"Ready for some more food for your tummy\" said Caroline in a funny voice that people use when they talk to kids.<br>\r\n<br>\r\nBriann just started to giggle.</span></div></div>",
            "created":1282626000,
            "id":943137,
            "title":"Something else"
        }
    },
    "info":{
        "author_id":"killercon",
        "author_name":"bsh101",
        "brief_description":"fallow four fat babies gaining weight",
        "created":1281277680,
        "description":"<td align=\"left\" class=\"norm\">I know I alrweady have two of these oness in my other stories but here a chance to start fresh.<br>\r\nNow there is a twist to this one instead of the parents trying to get them to loose weight, they are eather ok with it or want to make them gain.<br>\r\n<br>\r\nrules<br>\r\n<br>\r\nrealistic gains- no 50 lbs in one meal<br>\r\n<br>\r\nMake the chapter as long as you can<br>\r\n<br>\r\nNudity is alowed but not descripted<br>\r\n<br>\r\nPLEASE ADD<br>\r\nPLEASE REVEIW<br>\r\nPlease email me at killercon123@yahoo.com if you are interested in an rp or would like to comment on my stories</td>",
        "id":1697352,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1556868300,
        "modified":1556868300,
        "pretty_title":"Fat babies on muray weight gain"
    }
}