{
    "chapters":{
        "1":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Carly",
                "Sam",
                "Mandy",
                "Missy (Carly's former best friend)",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>who do you want to tickle or be tickled by</span></div></span></div>",
            "created":1309496400,
            "id":1138515,
            "title":"let's start"
        },
        "11":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "feet",
                "armpits",
                "theighs",
                "neck",
                "sides"
            ],
            "content":"<div class=\"\"><div> <span>You had recently appeared on iCarly and since then you and carly had become really good friends and you were getting to know each other. One day you were hanging out at carly's place.<br>\r\n<br>\r\n\"So tell me, what is your most embarrassing secret?\" asked Carly. <br>\r\n<br>\r\n\"What, I'm not telling you\" You responded. <br>\r\n<br>\r\n\"Oh, come on, tell me\" Carly prodded you. <br>\r\n<br>\r\n\"OK, I'm scared of being tickled.\" You reluctantly admit. <br>\r\n<br>\r\n\"What?\" Carly asked, sounding surprised and confused at the same time.<br>\r\n<br>\r\n\"Don't laugh\" You say as your face blushes bright red.<br>\r\n<br>\r\n\"Don't worry, I know a cure for your tickling fetish\" said Carly.<br>\r\n<br>\r\n\"What that?\" You ask, a little worried.<br>\r\n<br>\r\n\"Tickle Fight!\" Carly yelled before she jumped on top of you and began tickling your ribs.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHA HEY STOP THAT HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHA\" You laugh, taken by surprise by the sudden tickling.<br>\r\n<br>\r\n\"So, what's your most ticklish spot?\" Carly asked.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHA I'M NOT TELLING YOU HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" You say defiantly as you laugh your head off.<br>\r\n<br>\r\n\"Guess I'll have to tickle a confession out of you\" Carly said before she tickled your...</span></div></div>",
            "created":1309496400,
            "id":1138539,
            "title":"Carly"
        },
        "111":{
            "author_id":"uberstory",
            "author_name":"urberstory",
            "choices":[
                "She licks your toes.",
                "She uses Sam's electric tickling brush",
                "She uses a feather"
            ],
            "content":"<div class=\"\"><div> <span>Carly flips you over on your stomach and sits on your butt.  She then moves quickly towards your legs and sits on your calves. You feel her grab your left shoe and tries to pull it off but you try to shake out of her grasp. Unfortunately, she is able to pull off your converses as she uses her belt to tie your ankles.  Soon she gets up and grasps onto your right foot and pulls you closer to the couch. Carly strokes your foot with her index finger and you twitch a bit.  Luckily for you, you're not so ticklish on your feet but Carly manages to get a few laughs. She pulls off your socks and decides try something else.</span></div></div>",
            "created":1365609060,
            "id":1569323,
            "title":"feet"
        },
        "1111":{
            "author_id":"caketimez",
            "author_name":"Caketimez",
            "choices":[
                "Keeps licking...",
                "Tickles somewhere else..."
            ],
            "content":"<div class=\"\"><div> <span>You burst out laughing as you feel Carly's tongue on your toes.  \"AHAHAHHAHAHAHAHHAHHAH CARLY, PLEAHAHHEHEHASE!  NOHHAHAHO NOT THAT!\" You beg as she licks your helpless bare toes.  \"No way i'm gonna stop, this is way to fun!\" she says as she more quickly licks your sensitive toes.  \"PLEHEHAHAHHASE EHEHHAHAHAHAHAHAHHAHHA NO MORE!\" you  beg as she mercilessly licks yours helpless little ticklish toes. You beg and plead but Carly is enjoying this far to much to stop now.  After a couple minutes she stops and then...</span></div></div>",
            "created":1387086540,
            "id":1707830,
            "title":"Toe lickin' good."
        },
        "115":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "feet",
                "armpits",
                "neck"
            ],
            "content":"<div class=\"\"><div> <span>Carly staying with the upper body, began raking her hands up and down your sides causing <br>\r\nyou to laugh and wiggle. \"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nNOHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nPLEASESTOPHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" you plead laughing, but your pleas<br>\r\nfall on deaf ears. \"Tickle Tickle Tickle. \"tell me your most ticklish spot!\" Carly demanded. <br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHANEVERHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAI'LLNEVERTELLHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" you laugh as you buck up and down. \"Whoa\" said<br>\r\nCarly as she tried to stay on top of you. \"Where should I tickle you now?\" asked Carly.</span></div></div>",
            "created":1309755600,
            "id":1140197,
            "title":"sides"
        },
        "1151":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "a feather",
                "a toothbrush",
                "a dried out ink pen"
            ],
            "content":"<div class=\"\"><div> <span>Without even allowing you to answer Carly turns towards you feet, sits on your arms to prevent you from escaping, removes your shoes &amp; socks and starts tickling your bare feet.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHANOHAHAHANOOOHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAQUITITHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" You laugh wiggling your feet wildly.<br>\r\n<br>\r\n\"What's your tickle spot?\" asked Carly.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA I'LL NEVER TELL HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHA\" You answer defiantly. Carly then grabbed your left foot and pulled back your toes before she began tickling them.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHASTAHAHAHAPHAHAHAHAHAHAHAHAHAHA&amp; #34; You laugh, now hysterical.<br>\r\n<br>\r\n\"Hold on\" said Carly \"I'm going to go get some tickling tools\".<br>\r\n<br>\r\nSeeing the oppurtunity, you get up and try to make a run for it, but Carly comes back at the last moment and chases after you. She chased you into her bedroom and jumped on your back causing you to fall face first onto her bed and began tickling your ribs.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHA NOHOHOHO HAHAHAHAHAHAHA\" You laugh as Carly's fingers wiggle in between your ribs.<br>\r\n<br>\r\nShe then turned you over and again sat on your arms while facing your feet.<br>\r\n<br>\r\n\"Trying to get away I see, now where was I? oh yeah, I was getting tickle tools\" Carly said playfully before she pulled out...</span></div></div>",
            "created":1309755600,
            "id":1140236,
            "title":"foot tickling time"
        },
        "11511":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Carly accidently finds your tickle spot",
                "Sam arrives and joins in"
            ],
            "content":"<div class=\"\"><div> <span>Carly then pulled out a feather and began stroking it up and down your soles. \"HAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAA<br>\r\nHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH<br>\r\nAHAHANOOOOOHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHACARLYSTOPHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH<br>\r\nAHAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHA\" you laugh frantically wiggling your feet. then, unfortunately<br>\r\nfor you....</span></div></div>",
            "created":1311483600,
            "id":1153726,
            "title":"a feather"
        },
        "115111":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "you fight back",
                "carly used the feather",
                "Sam comes in"
            ],
            "content":"<div class=\"\"><div> <span>As you struggle, you roll over onto your back, causing Carly to lose her grip. As she flailed<br>\r\nher arms wildly trying to regain her grip, her fingers accidentally brushed over your belly<br>\r\ncausing you to instantly to scream with laughter. <br>\r\n<br>\r\n\"HAHAHAHAHAHA\" You scream.<br>\r\n<br>\r\n\"Hmmm, so that's your most ticklish spot?\" said Carly.<br>\r\n<br>\r\n\"Carly please?\" you beg, but<br>\r\nyour pleas fall on deaf ears as Carly quickly straddles you and begins sadistically <br>\r\ntickling your stomach with her fingernails.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHA NOOOOOHOHOHOHO HAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH<br>\r\nAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH<br>\r\nAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHA\"You laugh, thrashing and squirming.<br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1311483600,
            "id":1153741,
            "title":"Carly accidently finds your tickle spot"
        },
        "1151111":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "carly triumphs",
                "you triumph"
            ],
            "content":"<div class=\"\"><div> <span>Knowing you couldn't take much more, you decide to fight back. You reach up and begin tickling Carly's sides.<br>\r\n<br>\r\n\"hahahahahahahahahahahahaha no fair hahahahahahahaha\" She giggles.<br>\r\n<br>\r\n\"It's a tickle fight remember\" You remind her.<br>\r\n<br>\r\nCarly however continues to tickle your belly.<br>\r\n<br>\r\n\"hahahahahahahahahahahahahahahahahahahahahaha stop stop hahahahahaha\" You laugh trying not to lose your slight advantage.<br>\r\n<br>\r\nYou both laugh, squirming as you tickle each other.<br>\r\n<br>\r\nWho gains the advantage?</span></div></div>",
            "created":1329627600,
            "id":1280095,
            "title":"you fight back"
        },
        "11511111":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "thinks of another way to tickle you",
                "slides her hands under your shirt and tickles your exposed belly"
            ],
            "content":"<div class=\"\"><div> <span>After half an hour of struggling, Carly ultimately triumphed, pinning you down and straddling your waist.<br>\r\n<br>\r\n\"Now let's continue\" Carly said before tickling your stomach once more.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHA QUIT IT AHAHA\" You screamed in protest, frantically flailing.<br>\r\n<br>\r\n\"Give up?\" asked Carly.<br>\r\n<br>\r\n\"AHAHAHAAHAHAHAHAHAHAHAAHAHA NO\" You replied refusing to give up.<br>\r\n<br>\r\nYou tried to pry Carly's hands away from your sensitive stomach, but to no avail.<br>\r\n<br>\r\n\"Tickle Tickle Tickle\" Carly teased.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHA\" You laugh loudly.<br>\r\n<br>\r\nThen Carly...</span></div></div>",
            "created":1331269200,
            "id":1291524,
            "title":"carly triumphs"
        },
        "115111112":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>Carly then slid her hands under your T- shirt and tickles the now exposed flesh.<br>\r\n<br>\r\n\"HAAHAHAHAHAHAHAHAHAHAHAHAHHAAHAHAHAHAHHAHAAHA HAVE MERCY HAVE MERCY AHAHAAHAHAHAHA<br>\r\nAHAHAHAHAHAHAAHA STAHAHAHAHAHAP MERCY PLEASE HAHAHA\" You beg, pleading for mercy, but you get none.<br>\r\n<br>\r\nCarly mercilessly dances her long, slender feminine fingers over your exposed belly.<br>\r\n<br>\r\n\"Give up?\" She asked.<br>\r\n<br>\r\n\"NEVER\" You shout.<br>\r\n<br>\r\n\"I was hoping you'd say that, let's make a little wager; if I win I tickle you as long as I want and vice versa\" She challenged.<br>\r\n<br>\r\n\"Bring it on\" You said stupidly, still laughing and struggling.<br>\r\n<br>\r\nCarly wiggled her fingers on your belly, her short nails torturing you.<br>\r\n<br>\r\n\"AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" You laugh, wiggling under her small frame.<br>\r\n<br>\r\n\"Coochie, Coochie, Coo\" Carly bantered as she tickled you senseless.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHA WOO HOO HOO STOP HAHAHAHAHAA<br>\r\nI CAN'T TAKE IT AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH\" You plead once more.<br>\r\n<br>\r\n\"Give Up?\" Carly asks again</span></div></div>",
            "created":1331355600,
            "id":1292455,
            "title":"slides her hands under your shirt and tickles y..."
        },
        "1151111122":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Fine OK",
                "No",
                "No way"
            ],
            "content":"<div class=\"\"><div> <span>\"Give Up?\" Carl asked again.<br>\r\n<br>\r\n\"Not a chance\" You sternly reply.<br>\r\n<br>\r\n\"Ok, I warned you\" Carly said. With that said, she resumed her vicious tickle assault on your helpless belly.<br>\r\n<br>\r\n\"AHAHHAHAHAHAHAHAHAHA STOP IT PLEASE STAHAHAHAHAHAP\" You plead.<br>\r\n<br>\r\n\"Oh, is the poor wittle baby tickwish\" Carly bantered.<br>\r\n<br>\r\n\"HAHAHA NOT FUNNY AHAHAHAHA\" You yell.<br>\r\n<br>\r\n\"Then why are you laughing\" Carly continued to tease.<br>\r\n<br>\r\nYou thrash, wiggle, and squirm but nothing can stop the tickling.<br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH <br>\r\nAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" You laugh, Carly's manicured fingernails tickling you senseless. You wiggle trying to avoid them, only to run into the other set of fingers.<br>\r\n<br>\r\n\"I'll ask you one more time, do you give up?\" Carly asked.<br>\r\n</span></div></div>",
            "created":1332651600,
            "id":1302201,
            "title":"Tickled Senseless"
        },
        "11511111221":{
            "author_id":"boxhand",
            "author_name":"Boxhand",
            "choices":[
                "tickles for more hours",
                "tickles everywhere"
            ],
            "content":"<div class=\"\"><div> <span>YES YES OH GOD YES! you yell. Carly then stops the torture. \"looks like i win\" she said evily. You realize that a deal is a deal. Carly leads ypu to a couch and she straps you in using rope. you try to break free but cant. Carly then tickles your stomach...for 3 long hours! Car;y then...</span></div></div>",
            "created":1334379600,
            "id":1315689,
            "title":"Fine OK"
        },
        "115111112211":{
            "author_id":"ihateusernames",
            "author_name":"Iamawriter",
            "choices":[
                "Carly tickles you until you per",
                "Carly lets you go"
            ],
            "content":"<div class=\"\"><div> <span>It has been 3 long hours and Carly doesn't seem to be stopping. HAHAHAHAHAHAHAHAHAHAHAHAHAHAHA you scream. Carly says \" looks like you're enjoying this huh?\" You reply is \" NOOOHAHAHAHAHAHAHAHAHAHAHA\" Carly says \" well it looks like you are enjoying it enough.\" She tickles you for another 2 hours then you scream \" STHOHOHOHOHAHAHAHAHAPP, PLEAHAHAHAHAHASEEHEHEHE IM GONAHAHAHAHA PEEWEEHEHEHAHAHAHAHA.\" Carly says \" well in that case.....</span></div></div>",
            "created":1339477200,
            "id":1358412,
            "title":"tickles for more hours"
        },
        "1151111122111":{
            "author_id":"ihateusernames",
            "author_name":"Iamawriter",
            "content":"<div class=\"\"><div> <span>I better get some paper\" Carly says. You look in fear as she does get paper and puts it under you. You say \"Uh Carly your joking right.\" she ignores you and says \"oops forgot the camera\" you stare at her in fear as she presses play and says \"hi I'm Carly and this is ( insert your name here) being tickled until he pees!\" you say \"Carly please, have mercyHEHEHEHEHEHEHEHEHEHEHEHEHEHENONONOOOOOOPLEASEPLEASEHEHEEHEHEHEHEEEHEPLEASEC ARLYCARLYNONOOOOOHAHAHAHAHAHAHAHAHAHAVEMERCY\" \"Um no\" she teases as a small wet spot appears on your jeans. \"oh looks like its starting\" she says as you completely lose control and wet yourself. Carly says \"I think I'll be keeping this, hope your not to mad at our bargain. Now I'll let you go.\" She untied you and you go back to being friends.</span></div></div>",
            "created":1339477200,
            "id":1358430,
            "title":"Carly tickles you until you per"
        },
        "11511111222":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Gave up and accepted the punishment",
                "Passed out and woke up tied up"
            ],
            "content":"<div class=\"\"><div> <span>Carly goes in for the kill as she leans over and blows a raspberry on your belly button. This is enough to send you into hysterics. Even worse, Carly swirls her tongue around inside your navel for good measure.<br>\r\n<br>\r\n\"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAHAHAHAHAHAHAHAHEHEHEHEHEHEHEHEHEHEHEHEHEHE HEHEHEHEHEHEHE\" You scream.<br>\r\n<br>\r\n\"Tickle, Tickle, Tickle\" Carly bantered before she blew another raspberry on your navel all the while digging and scribbling her fingers and nails over your belly and sides.<br>\r\n<br>\r\n\"AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" You laugh, trying futilely to free yourself. <br>\r\n<br>\r\nThe tickling was becoming torturous and you could feel yourself becoming lightheaded. You...</span></div></div>",
            "created":1423869000,
            "id":1933243,
            "title":"No"
        },
        "11511111223":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Fine, OK I Give Up",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>\"HAHAHA NO WAY HEHEHEHEH\" You answered.<br>\r\n<br>\r\n\"Okay, looks like I'll have to try something else\" Carly said.<br>\r\n<br>\r\nWith you being weak from laughing so much, so hard and for so long, Carly was able to grab your arms and pin them over your head, completely exposing your belly.<br>\r\nShe then switched so that she was sitting on your arms, pinning you to the ground and leaving your arms trapped beneath her legs. And you completely helpless with nowhere to go.<br>\r\n<br>\r\n\"Ready to give up now?\" Carly asked as you futilely struggled beneath her.<br>\r\n<br>\r\nBracing yourself, you said \"Not a chance!\"<br>\r\n<br>\r\nCarly smiles at your response and simply slides her hands under your shirt so that they're resting on your flat, taut, ticklish tummy. She teases you for a few seconds by lightly tickling you, curling and uncurling her fingers as well as gently, gracefully gliding her soft fingertips over your stomach.<br>\r\n<br>\r\n\"hehehehehehehehehehehehehehe cuhuhuhuhut ihihihihit ouhuhuhuhut hahahahahahahahahahahaha\" You say, overcome by giggling from Carly's teasing tickles.<br>\r\n<br>\r\n\"I'll give you one last chance to get up\" Carly says.<br>\r\n<br>\r\n\"ehehehehehehehehehehe dohohoho youhuhuhur worst huhuhuhuhuhuh\" You reply.<br>\r\n<br>\r\n\"Oh I will\" Carly says before letting loose and viciously tickling your belly, scribbling and wriggling her nails into your sensitive skin.<br>\r\n<br>\r\n\"AAAAAAAAAAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA NOHOHOHOHOHO NOHOHOHOHOHO HUHUHUHUH STAHAHAHAHAHAP\" You protest, immediately bursting into loud laughter.<br>\r\n<br>\r\n\"Gitchie gitchie goo\" Carly teases you, her fingernails furiously flickering over your belly, drawing loud gales of laughter from you.<br>\r\n<br>\r\n\"HEHEHEHEHEHEHEHEHEHEHUHUHUHUHUHUHUH IHIHIHIHIHI WOHOHOHOHON'T GIHIHIHIVE UP HEHEHEHEHEHEHEHEH\" You insist, struggling trying to free yourself.<br>\r\n<br>\r\n\"You will eventually\" Carly replies. \"Or you'll get more tickles from the tickle monster!\"<br>\r\n<br>\r\n\"EEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHEHE OOHOOHOOHOOHOOHOO NEHEHEHEHEVER\" You say.<br>\r\n<br>\r\nDespite your best efforts, Carly has you pinned down quite nicely and it quickly becomes apparent that you aren't going anywhere.<br>\r\n<br>\r\n\"Might as well give up, you can't go anywhere\" Carly says, scribbling her fingers and their long nails over your poor belly, causing you to suck in your stomach in an attempt to evade the tickling momentarily.<br>\r\n<br>\r\n\"YOUHUHUHUHUHU'RE NAHAHAHAHAHAWT GONNA HAHAHAHAHAHAHAHA WIHIHIHIHIN HAHAHAHAHAHAHAHAHAHAHAHAHAHA\" You tell her, hoping you can hold out long enough to figure a way out of this.<br>\r\n<br>\r\n\"Tickle, Tickle, Tickle\" Carly continues her banter. \"You can't get away\"<br>\r\n<br>\r\n\"AAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHA HAHAHAHA\" You can only laugh hysterically, helpless against Carly's tickling skills.<br>\r\n<br>\r\n\"Ready to give up?\" Carly asked.</span></div></div>",
            "created":1497640680,
            "id":2337098,
            "title":"No way"
        },
        "11511112":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Feet",
                "Belly"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You end up winning the struggle. Having advantage, You decide to tickle Carly's...</span></div></span></div>",
            "created":1334638800,
            "id":1317465,
            "title":"you triumph"
        },
        "115111121":{
            "choices":[
                "Carly offers to let you suck on her toes and lick her feet however long you like",
                "You give her amazing feet even MORE tickling"
            ],
            "content":"<div class=\"\"><div> <span>Carly tried to escape, but your firm grip held her down. You tied Carly down with a rope. Now she couldn't move. Frantically, she yelled,\"Let me go!\" but you said \"Sorry, I can't do that. You just tickled me like crazy, and now I'm going to get my revenge.\" Desperately, she said \"I'm sorry! I'll do anything else! Just let me go, please!\" \"What's the matter? Are you ticklish?\" Carly didn't say a word. \"So you ARE ticklish! Perfect! Now, I think I'll start with...\" Your eyes glanced up and down until you selected a spot. \"I think I'll start with your feet.\" You unzipped her black boots as she put up a futile struggle, revealing her white ankle socks. You gave her socked feet a quick tickle, causing her to burst out giggling. Then, you tried to pull her socks off. She tried to clench her toes, saying \"No, please don't!\" It didn't matter. Her socks came off anyway, revealing her gorgeous feet in dark red toenails. You began tickling Carly's bare feet. She tried to hold it in, but burst out in hysterical laughter. AAAAAAAAAAAAAHHH! AAAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH! AAAAAAAAAAAAHHHHAHAHAAHA! You tickled her feet relentlessly. You scraped her nails down her soft soles, you tickled the tops of her feet, her toes, in between her toes, everywhere. Then you used the feather under her toes and in between them. No matter what Carly said, you refused to stop tickling her bare feet. They were just so gorgeous and soft and helpless and sensitive. Plus, the sight of Carly struggling to get away from her foot tickling was so cute. You just tickled her poor soles. Just tickle, tickle, tickle, tickle, tickle all over her helpless sexy feet. And there was nothing she could do. All Carly could do was sit there and get her feet tickled. For as long as you wanted. You'd give her breaks to catch her breath, but then it started again. Then, </span></div></div>",
            "created":1363212300,
            "id":1549411,
            "title":"Feet"
        },
        "1151111211":{
            "author_id":"gmjuf",
            "author_name":"Minecraft",
            "choices":[
                "Carly gives you a foot job",
                "Sam comes barging in"
            ],
            "content":"<div class=\"\"><div> <span>So you stop and agree knowing you have a foot fetish you licked her left foot for a good 10 minutes and then her right foot for another 10 minutes you star to suck her gorgeous toes and then start to suck her other toes Carly realizes you have a massive boner so she starts to rub it you feel so good sucking Carly's soft gorgeous toes and having your cock rubbed by her other foot so .....</span></div></div>",
            "created":1377412140,
            "id":1651194,
            "title":"Carly offers to let you suck on her toes and li..."
        },
        "115111122":{
            "author_id":"tko27",
            "author_name":"Tko37",
            "choices":[
                "Lick her navel",
                "Pick up a feather"
            ],
            "content":"<div class=\"\"><div> <span>You lift up her shirt and dig into her sides she lost balance and fell down. You take the chance and pick up a roll of duct tape to tie her armrs and legs.She tries to play it cool but you can see she' nerviuse you resume the belly tickling and she laughs uncontrolaby.<br>\r\nYou decide to try her navel and realise it's her tickle spot.After tickling her navel for 5 minutes you decide to take it up a notch <br>\r\nSo you...<br>\r\n</span></div></div>",
            "created":1564882680,
            "id":2696767,
            "title":"Belly"
        },
        "1151111221":{
            "author_id":"tko27",
            "author_name":"Tko37",
            "choices":[
                "Baby oil",
                "Raspberries"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You give her a teasing look and place your toung on her left hip.You then proceed to lick your way up her stomach she's laughing really hard at this point. You give her a break an then decide to go for the gran finale...</span></div></span></div>",
            "created":1564882920,
            "id":2696770,
            "title":"Lick her navel"
        },
        "11511112211":{
            "author_id":"tko27",
            "author_name":"Tko37",
            "content":"<div class=\"\"><div> <span>You ran to the bathroom and pick up a botle of baby oil. You then aply it to her tummy paying special attention to her bellybuton.<br>\r\nYou fluter your fingers all over her belly until she's crying from the tickling.You decide to stop and untie her.You look into her eyes and<br>\r\nKiss .</span></div></div>",
            "created":1564883160,
            "id":2696772,
            "title":"Baby oil"
        },
        "12":{
            "choices":[
                "get something to eat",
                "take a nap",
                "rehearse",
                "wrestle"
            ],
            "content":"<div class=\"\"><div> <span>You waited paitently in the iCarly studio, as you've been filling in for Fredie filming the show. You hear the elevator come up and out walks Sam. \"Where's Carly?\" you ask.<br>\r\n<br>\r\n\"Oh she's running late, but I got tired of waiting and I'm bored, so let's...\"</span></div></div>",
            "created":1334725200,
            "id":1318162,
            "title":"Sam"
        },
        "121":{
            "choices":[
                "pull her out",
                "tickle her"
            ],
            "content":"<div class=\"\"><div> <span>\"I don't think Carly would like us raiding her fridge like this\" you say as Sam leads you down stairs to the kitchen.<br>\r\n<br>\r\n\"There's nothing good in the fridge, I already checked, but lets look in the cupboards\" she says, sounding like she does this kind of thing all the time. She gets down on her hands and knees, crawling half way into the cupboard. \"Ok, I found some chips, but I think I'm stuck\" she says as she tries to back out of the cupboard.<br>\r\n<br>\r\n\"Want me to pull you out?\" you ask as she struggles.<br>\r\n<br>\r\n\"Ugh, yeah, I'm stuck pretty good\" she says, sounding a little defeated. You grab her sides firmly and she lets out a startled yelp.<br>\r\n<br>\r\n\"Sorry, did that hurt?\" you ask as you pull your hands away.<br>\r\n<br>\r\n\"No, you just surprised me, I'm ready now though\" she says, sounding nervous. You reach down and grab her sides again and again she shouts.<br>\r\n<br>\r\n\"Okay, if I'm not hurting you Sam, I have to ask, are you ticklish?\" you ask, already knowing the answer.<br>\r\n<br>\r\n\"What? No! Just pull me out already!\" she says sounding scared and angry. You grab Sams' sides again and...</span></div></div>",
            "created":1335330000,
            "id":1322362,
            "title":"get something to eat"
        },
        "1211":{
            "author_id":"them",
            "author_name":"theM",
            "choices":[
                "your feet",
                "Your belly"
            ],
            "content":"<div class=\"\"><div> <span>You grab on to her and pull as hard as you can. Soon she fell on top of you and you were knocked out cold. You woke up in the studio on a bean bag chair and there was Sam next to you.<br>\r\n<br>\r\nSam<br>\r\nThanks for the save there.<br>\r\n<br>\r\nYou<br>\r\nYour welcome<br>\r\n   <br>\r\nSam<br>\r\nYou reminded me of something there.<br>\r\n<br>\r\nYou <br>\r\nWhat?<br>\r\n<br>\r\nSam<br>\r\nThis!<br>\r\n<br>\r\n<br>\r\nSam starts tickling <br>\r\n</span></div></div>",
            "created":1363303500,
            "id":1550206,
            "title":"pull her out"
        },
        "12111":{
            "author_id":"sungoesdown",
            "author_name":"jumpingdown",
            "choices":[
                "she tickles u with a feather",
                "she tickles ur sides"
            ],
            "content":"<div class=\"\"><div> <span>Sam pounces on you and wrestles you to the ground with ease. She grabs your shoes and yanks them off before scribbling her fingers over your socked feet. \"Tickle tickle!\" she teases.<br>\r\n<br>\r\nYou laugh uncontrollably, thrashing your body. Sam grins and pulls off your socks too, exposing your bare feet. <br>\r\n<br>\r\n\"You. Are. So. Ticklish.\" Sam announces, giving your soles a swipe with each word. <br>\r\n<br>\r\n\"I knooowwwahahaha!\" You cry out. Sam expertly snags both feet in her elbow, theyre inches from her face and begins to rake across both soles like a maniac. Your screams ring through the apartment. <br>\r\n<br>\r\n</span></div></div>",
            "created":1575276360,
            "id":2754476,
            "title":"your feet"
        },
        "12112":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Carly walks in and saves you",
                "Sam stops tickling you"
            ],
            "content":"<div class=\"\"><div> <span>Sam pounced on you and dug her wiggling fingers into your belly. <br>\r\n<br>\r\n\"GAHAHAHAHAHAHAHAHAHAHAHA SAM STAHAHAHAP\" you burst into laughter, trying to manuever out of the way of Sam's devious fingers but Sam's got you pinned. <br>\r\n<br>\r\n\"Aw, is the little poor baby tickwish\" Sam mocked you, digging her fingers in. <br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA GET OFF OF ME HAHAHAHAHAHAHAHAHAHA<br>\r\nTHIS ISN'T FUNNY HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" you protest profusely, but Sam ignores you. <br>\r\n<br>\r\n\"Tickle, Tickle\" Sam banters as you wiggle and roll around. <br>\r\n<br>\r\n\"AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA STOP IT HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<br>\r\nCUT IT OUT HAHAHAHAHAHAHAHAHAHAHAHAHAHA\" you continue to plead. <br>\r\n<br>\r\nYou wave your hands around trying to grab her hands, but the tickling is overwhelming and you can't focus. <br>\r\n<br>\r\n\"Whoops, can't have you using your hands to defend against Mama's tickle attacks\" Sam says before she grabs your hands and pull them underneath her knees, effectively rendering you incapable of stopping her tickling. \"There, that's better\". Then Sam slides her hands underneath your T shirt, exposing your ticklish tummy to her wicked fingers. \"For that, now you're really going to get it.\"<br>\r\n<br>\r\nWith that, Sam began ruthlessly tickling your exposed belly. To put it simple, you lost it. <br>\r\n<br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAH<br>\r\nAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHAH<br>\r\nAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" You laugh. You thrash and struggle, but you are completely helpless. <br>\r\n<br>\r\nKnowing this, you throw your head back and laugh. <br>\r\n<br>\r\nEventually…</span></div></div>",
            "created":1386436380,
            "id":1704509,
            "title":"Your belly"
        },
        "121121":{
            "author_id":"roboroboi",
            "author_name":"Android 29",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sam what are you doing to y/n? I'm tickling him. CARLEY HELP HAHAHAH PLEASE HAHA. okay sam that's enough stop tickling him he has had enough tourture lets film the video. The end!</span></div></span></div>",
            "created":1565509380,
            "id":2700215,
            "title":"Carly walks in and saves you"
        },
        "1212":{
            "choices":[
                "breaks free",
                "stays stuck"
            ],
            "content":"<div class=\"\"><div> <span>\"So, you're sure you're not ticklish?\" you ask, deciding the opportunity is too good to pass up.<br>\r\n<br>\r\n\"IHAHAHAHAHA!\" is all Sam can manage as you cut off her answer by wigling your fingers up and down her sides.<br>\r\n<br>\r\n\"Sam, I'm so dissapointed\" you say as she continues to laugh and buck wildly, trying to escape. \"Lying to me already, well, I'll give you one chance. Tell me your most ticklish spot and maybe I'll let you go.\" You stop tickling her long enough for her to catch her breath, but keep your fingers poised at her sides.<br>\r\n<br>\r\n\"No waHAHAHAHAHA!\" she tries to answer as you launch another tickle attack. \"Ok, guess I'll just have to tickle it out of you\" you say. She continues to fight you and she...</span></div></div>",
            "created":1335416400,
            "id":1322887,
            "title":"tickle her"
        },
        "12121":{
            "choices":[
                "moves to a different spot",
                "pulls out a tickle tool"
            ],
            "content":"<div class=\"\"><div> <span>With one final push, Sam falls out of the cupboard and knocks you over, sending you both to the floor. You find yourself lying face down, and as you try to get up, you feel a weight pressing down on your legs. You turn your head to find Sam laying with her back on your legs. <br>\r\n<br>\r\n\"Normally I'm not much of a tickler, but you started it, so I'm gonna finish it\" she says, pulling off your shoes. <br>\r\n<br>\r\n\"Wait, Sam I'm soreeheehee!\" you giggle as you feel her fingers on your socked feet. <br>\r\n<br>\r\n\"Not sorry enough, but you will be\" she says as she takes of your socks. You try desprately to crawl away, but burst out laughing and can only pound your fists on the floor as she tickles your bare feet. Just when you think things can't get any worse, she...</span></div></div>",
            "created":1340269920,
            "id":1363904,
            "title":"breaks free"
        },
        "13":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "her fingernails",
                "an electric toothbrush",
                "a stiff feather",
                "a hairbrush",
                "a feather duster"
            ],
            "content":"<div class=\"\"><div> <span>two months ago you appeared on a webcast of iCarly that helped it reach its most viewership ever. you had become great friends with Carly, Sam, and Freddie and began appearing on iCarly more and more frequently. one night after a webcast, you had to get home. after saying goodbye to the crew, you ran down to the lobby. in the lobby it was dark and there was no one there except for a girl who looked about your age standing near the door. as you got closer to the door, you realized the girl was Mandy, iCarly's biggest and craziest fanatic. before you could try and run out the door, Mandy knocked you out with some weird spray. when you came to, you looked around and saw you were in the basement. you tried to stretch before you realized you were standing with your hands tied to a pipe above your head. then Mandy came in. \"hey, my name's Mandy and I know who you are. you're that guy from iCarly, you can help me get a permanent spot on iCarly. so will you please help me? I won't take no for an answer.\" said Mandy talking a mile a minute, as usual. \"no, you're too crazy. now untie me.\" you reply. \"please?\" begged Mandy. \"no\" you reply sternly. \"oh well, I geuss we'll have to do it the hard way. I know everything about you including where you're most ticklish at.\" said Mandy as she pulled up your shirt exposing your stomach. \"you wouldn't?\" you challenged. \"I would and I will.\" said Mandy\"the only question is what to tickle with\". Mandy then reached down and revealed a bucket full of tickling tools. \"now, what should I use to tickle your tummy?\" said Mandy before she began tickling your belly with</span></div></div>",
            "created":1311051600,
            "id":1150497,
            "title":"Mandy"
        },
        "131":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Mandy used her tongue",
                "Mandy put feathers on one set of fingers",
                "Mandy started tickling your navel"
            ],
            "content":"<div class=\"\"><div> <span>\"you know, I think I'll just use these bad girls\" said Mandy as she showed you her long fingernails. and with that Mandy knealed down and began tickling your exposed stomach. \"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHACUTITOU THAHAHAHAHAHAHAHAHAQUITITHAHAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHASTAHAHAHAPHAHAHAHAHAHAHAHA\" ; you laugh hysterically moving from one side to another trying to avoid Mandy's quick fingernails. \"Will you help me get on iCarly?\" asked Mandy persistently. \"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHANEVERHAHAHAHA\" you answer. \"We'll see about that\" smirked Mandy before she began spider tickling your stomach. \"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHANONOHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAPLEASESTOPHAHAAHAHAHAHAHAHAHAHAHAHAHA HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" you laugh begging for mercy. \"I won't stop tickling until you agree to help me get on iCarly\" said Mandy. \"Not gonna happen\" you reply. \"Well I guess I'm not gonna stop tickling\" Mandy replies as she begins tickling right on top of your abs. \"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" you laugh. \"Tickle, Tickle, Tickle\" taunted Mandy. then...</span></div></div>",
            "created":1311051600,
            "id":1150592,
            "title":"her fingernails"
        },
        "1311":{
            "choices":[
                "she stops and gets a pan",
                "she jumps on top of you and digs her nail in your stomach"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Mandy then stoped tickling you and you thought she was done but then she untied you and handcuffed you to a bed and took your shirt off. \"this will be fun\" she said and licked your stomach and chest.</span></div></span></div>",
            "created":1313470800,
            "id":1169462,
            "title":"Mandy used her tongue"
        },
        "1312":{
            "author_id":"kingeddie",
            "author_name":"kingeddie",
            "choices":[
                "Mandy decides to give you a break",
                "Mandy starts using a different tool",
                "Mandy amplifies the tickling"
            ],
            "content":"<div class=\"\"><div> <span>Mandy then got a devious idea. she reached into a pillow and grabbed five stiff feathers and put them on her left <br>\r\nfingertips. she then began tickling you with both the feathers and her fingernails. <br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHA<br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<b r></b>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHASTAHAHAHAPHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<b r></b>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA<b r></b>\r\nHAHAHAHAHAHAHAPLEASEHAHAHASTAHAHAPHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA <br>\r\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" you laugh thrashing and tugging at your bonds. <br>\r\n\"Help me become a member of iCarly.\" said Mandy. <br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHANEVERHAHAHAHA\" you laugh. \"Tickle Tickle Tickle\" Mandy taunted as you shrieked with laughter from the combination of fingers and feathers. \"HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH AHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\" you laughed. Then...</span></div></div>",
            "created":1311051600,
            "id":1150698,
            "title":"Mandy put feathers on one set of fingers"
        },
        "13121":{
            "author_id":"sexiscoolques5",
            "author_name":"John",
            "choices":[
                "Hot wax",
                "Tooth brush "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>when she came back she blew a raspberry on you're belly button <br>\r\n\"HAHAHAHAHAHAHAHAHAHAHAHA\" You screamed in laughter as she blew more for about 10 minutes <br>\r\n<br>\r\nAnd then took more tools out and got  <br>\r\n<br>\r\n</span></div></span></div>",
            "created":1465691580,
            "id":2162770,
            "title":"Mandy decides to give you a break"
        },
        "15":{
            "choices":[
                "Shelby Marx",
                "Melanie (Sam's sister)",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about these girls?</span></div></span></div>",
            "created":1311483600,
            "id":1153498,
            "title":"more"
        },
        "151":{
            "author_id":"subiaco76",
            "author_name":"mysterousabuser",
            "choices":[
                "carly and sam tickle her sensless",
                "freddie tickles her with a feather"
            ],
            "content":"<div class=\"\"><div> <span>since carlys fight with shelby marx they became great friends so one day carly went over to her house just for kicks when she walked in shelby was making out with her boyfriend steven so carly kicked steven out and yelled at shelby then sam ran in and ducked taped her to her bed what happens now</span></div></div>",
            "created":1311483600,
            "id":1154149,
            "title":"Shelby Marx"
        },
        "1511":{
            "choices":[
                "finds sam and tickles her",
                "tickles YOU (the unnamed male)"
            ],
            "content":"<div class=\"\"><div> <span>Then Carly tickles Shelby's tummy and Sam tickles her armpits. \"HAHAHANOSTOPHAHAHA!\" Shelby Marx laughed. Then 5 minutes later, Carly and Sam stopped. \"Well, it's been fun, but we should get back to iCarly rehearsal.\", Carly said. Then Carly, Sam, and Freddie go back to their studio. Then Shelby Marx broke free and got out of the duct tape and sees you and knows that you were watching the whole time. Then Shelby Marx...</span></div></div>",
            "created":1311570000,
            "id":1154443,
            "title":"carly and sam tickle her sensless"
        }
    },
    "info":{
        "author_id":"kingeddie",
        "author_name":"kingeddie",
        "brief_description":"tickle or be tickled by your favorite girls from icarly",
        "created":1309553940,
        "description":"<td align=\"left\" class=\"norm\">tickle or be tickled by your favorite icarly girls. you are an unnamed male. your stomach is your most ticklish spot</td>",
        "id":1790040,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1575276360,
        "modified":1575276360,
        "pretty_title":"Tickled by the icarly Girls"
    }
}