{
    "chapters":{
        "1":{
            "author_id":"animefeetxii",
            "author_name":"Animefeet",
            "choices":[
                "Maka Albarn",
                "Tsubaki Nakatsukasa",
                "Thompson Sisters (Liz & Patty)",
                "Marie Mjolnir",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose one.</span></div></span></div>",
            "created":1280379600,
            "id":926683,
            "title":"Which girl?"
        },
        "11":{
            "author_id":"catso",
            "author_name":"None",
            "choices":[
                "Smell her feet",
                "Keep licking",
                "Rub her feet on his face",
                "Call a friend",
                "Lets get Maka's feet dirty"
            ],
            "content":"<div class=\"\"><div> <span>As the day ends, you exit the classroom to find Maka blocking your path. She ask you to come by her place so she can begin an initiation process to see if your soul academy material. You agree and accompany her to her home. You ask if soul is going to be there. Maka \"No, hes out doing who knows what, besides you have an initiation to worry about.\" \"Okay, step one, I've prepared a small quiz for you.\" \"Get a high enough score and I'll begin step two.\" You and her walk into her room and she sits on her bed and you take a chair adjacent from a desk to start your quiz. After two hours of working, both your stomachs growl. \"Must be getting hungry, I cook us up something to chew on.\" You finish as she returns with two plates of spaghetti and two cookies on each plate. She is wearing her blue kilt and pink hod-die, hair in pig-tails and is now barefoot (wasn't earlier). She walks by and picks up your quiz before you finish. \"Almost done and you got every answer correct. Good job.\" \"I'm a bit to excited about step two, you clearly passed enough, lets progress shall we.\"<br>\r\n<br>\r\nShe sits on her bed once more and pours a large quantity of hot sauce in your spaghetti and tells you to drink it and not react to it. You breeze this step by slowing it whole, not even tasting it. Maka jumps up on the bed in excitement while putting her feet up in your lap without you noticing. \"Nice idea, by swallowing it piece at a time you didn't even smell it.\" \"Now for step 3, I want you to rub my feet.\" \"Start at the heels, then arch, then instep, then to the ball, the toes and then in-between my toes.\" \"Also it should take 15 minutes each foot.\"<br>\r\n<br>\r\nAfter 35 minutes of rubbing Maka's feet she says as you are holding her left foot \"Great work, this feels so nice.\" \"The next part gets even better for me, unfortunately it really sucks for you.\" You, \"Why, I can't see you doing anything that coul--) your sentence is interrupted as Maka suddenly shoves her left foot in her mouth. \"Sorry about this, but its just the easiest way to get away with doing this kind of thing.\" \"Besides, it feels too good to pass up an opportunity like this one.\" (She giggles innocently) <br>\r\n<br>\r\nYou try to pull your mouth away and succeed but suddenly, you look up and see under her left forearm. She grabs your hair with her left hand and pulls you back toward her. As your head fly's forward, your mouth is still open while you gasped for air and she successfully slips her foot back into your mouth this time she is lightly rubbing the sole of her foot back and forth on you tongue. You taste a light, faded coat of dirt, dust and plenty of sweat on the bottom of her foot. She pulls you foot out of your mouth after about two minutes of roughly pushing and pulling her foot in and out of your mouth before she slips it out slightly only so she can brush her toes against the tip of your tongue. Afterward, she pushes the tip of your tongue in-between her toes then finally releases your hair and lets you fall back on the rest of the chair. She lays her right foot on your chest and lifts her left foot up again. She looks impatient now. \"Suck on my toes.\" You deny and she stomps the heel of her right foot into your crotch. You lean over in pain with your head just above her knees. She leans over and holds your chin up with her left hand and sticks her face close to yours. (She's even less patient now) \"I'm lucky if I can get away with doing this once to each boy in the academy.\" \"If I'm going to have you as a foot slave for only a little while I have to exhaust all the ideas I have for you tonight.\" \"That's right, one night of anything I want.\" \"I may use your face as a foot rest as I watch TV, just make you lick my feet for fun, suck on my toes for my pleasure.\" \"Or maybe I'll take a jog and rub my sweaty bare feet on your face until your pores absorb all the sweat.\" \"Or maybe I'll walk around death city barefoot, get my feet all dirty and make you lick them clean, hell maybe I'll just rub my feet in the dirt until they have a thick coat of dirt on the bottom of my feet, then you can rub them again, then I can rub my dirty feet on your face and then you can lick them clean again.\" \"No need to rush though, after all I have all night.\" She shoves you head back and stretches out her foot. \"Lick them!\" She watches you lick her left foot clean with a smirk and she brushes her right foot roughly up and down your chest, stomach and crotch. She thinks out loud now.<br>\r\n<br>\r\n\"Now how should I go on with this annual tradition before Medusa come in again.\" Or that's right, you wouldn't know about that do you? Once in a while Medusa comes in and takes my.... volunteers away. (In an agitated way) You know Medusa right, the witch who walks around barefoot all the time, with the black toenails with yellow arrows.(She says in an almost idolizing, envious manner) Once she came through the window around 2am and took my subject away for herself. Once she got beyond the death city perimeter, I followed her and watched what she did with him once they were alone. Due to the fact that shes always barefoot, her feet were very dirty and she loved having a soft, cool and wet surface area to rub her hard, dirty callouses against. She doesn't care if her feet get dirty considering how they almost always are, but she dos prefer them clean and what a great way and time to get them that way. Not to mention her toes, the black nails with yellow arrows make her toes look bigger, the big soles help that. Watching her big, rough, dirty toes being being rubbed all over someones lips, coming in and out and the dirt wiped off her toes and soles onto their tongue and face of that boy was scary but also very impressive. She went on and on doing so many things in so many ways I just want to try it all. We only have, lets see (She checks the time) 13 hours to do all the things I have to get to. Now lets see.... where do we start?\"</span></div></div>",
            "created":1322112180,
            "id":1228044,
            "title":"Maka Albarn"
        },
        "115":{
            "author_id":"boppenpanda",
            "author_name":"dfl",
            "choices":[
                "She forces you to clean her feet",
                "Medusa sweeps in!",
                "she invites a friend"
            ],
            "content":"<div class=\"\"><div> <span>You look up at Maka with fear in your eyes (you weren't particularly fond of the taste of her vile feet). Her finger was on her lips as she contemplated what to do with her foot slave next. Suddenly her expression brightened, she had made up her mind up. \"Let's take a little walk...\" She said.<br>\r\n<br>\r\nYou gulp in fear and look down at her feet. She would be walking around death city... barefoot. \"Alright, come on, let's walk\" she tells you. Out of fear you get up and start walking behind her, staring at her feet. She opens up the wooden door with a creak, and you are met with the sharp fresh air of Death City.  She steps down the porch , still barefoot, and motions for you to follow. You know that she is in much better shape than you (evidenced by her ability to dominate you earlier) so running or fighting weren't an option. Eventually you decide to just follow and try not to make her mad at you. You watch her as she walks on the dirty ground around Death City. You couldn't help but think that she is kind of cute, with her slim body and pig tails, but her feet were just too much for you.<br>\r\n<br>\r\nAs you silently walk behind her, you watch her rub her feet into the dusty sidewalk. Whenever she found a place to get her feet dirty, she would immediately go over and rub her feet in it until they were just about saturated with dirt. You walk on and watch her long legs manipulate dirt onto her feet for hours. She rubbed her feet into the dusty black pavement, the soil in the park, and just about every other place in the city. Every time she does so, she gives you a childishly fiendish look, relishing her victory over you.<br>\r\n<br>\r\nAfter several hours of this she leads you back home. \" Whew, what a walk! I'm ready to get 'clean' \". She smiles at you, but you look away. \"But first\" she says, while walking over to her yard. \"Let's do a top off!\" and begins to rub her bare feet into a large patch of soil in the yard. You watch in absolute terror as you know you'll have to lick it off soon. She grinds her toes into the soil, and rubs her sole all over the dirt. \"Take a look!\" she says and raises her sole so you can look. You want to vomit right then and there. Her sole and pads of her toes are completely black with dirt. She has soil all over and in between her toes. \"Looks yummy, right?\" she whispers in your ear. <br>\r\n<br>\r\nThen...</span></div></div>",
            "created":1340598120,
            "id":1366527,
            "title":"Lets get Maka's feet dirty"
        },
        "1151":{
            "author_id":"dragonclam",
            "author_name":"Clam",
            "choices":[
                "Rubs her salvia covered feet in your face.",
                "Makes you eat off her feet. ",
                "Walks all over you."
            ],
            "content":"<div class=\"\"><div> <span>You both head back inside to Maka's room. She sits down and says, \"Put your face under my feet now!\" You do as she says hoping not to make things worse for yourself. Just thinking about what is about to happen makes you throw up a little in your mouth. \"Open wide,\" Maka says. You start to open when she shoves her right foot into your mouth. All you can taste is dirty a little bit of her sweat in your mouth. Your eyes start to water as you lick her toes in your mouth. You much rather have just eaten dirt. \"Hurry up slave,\" Maka says, \"you still have one more foot to clean.\" She takes her foot out of or mouth and quickly sticks the other in. She looks at her right foot judging how well you did. After a while she says, \"You did a very poor job we will have to redo this foot.\" You cringe at the though of cleaning either foot for much longer. You start to feel the need to throw up, but you suppress the urge. After about 30 minutes of cleaning her feet she looks and you and says, \"These are clean enough. Lets find something else for you to do.\"<br>\r\nShe...</span></div></div>",
            "created":1532037540,
            "id":2522101,
            "title":"She forces you to clean her feet"
        },
        "11513":{
            "author_id":"triplefour",
            "author_name":"Triple",
            "choices":[
                "You nod",
                "You shake your head",
                "Don't respond"
            ],
            "content":"<div class=\"\"><div> <span>\"Lie down!\" Maka demands, \"I want to walk all over your pathetic body.\"<br>\r\n<br>\r\nYou are hesitant to follow her command but you oblige and lie down on your back in front of her, your face dangerously close to her feet, now covered in your saliva. You look up as Maka stands up from her bed and inspects your body. A smug smile formed on her face before she lifts up her foot and shifts her weight on your stomach, excited to trample you.<br>\r\n<br>\r\nYou could only lay there and take her torment as she moves and walks down your chest, slowly making her way towards your face. It was a humiliating experience, as you're forced to endure the pain of a teenage girl stepping on you like you were nothing to her. However, it isn't long until she reaches your face and with a smirk, she forces her big toe on your lips, until she got it in your mouth.<br>\r\n<br>\r\nYour instinctive reaction was to spit it out but you knew it wasn't an option, especially since she can easily overpower you if you piss her off too much. Instead, you take it in, and slowly suck on her toe while it's being thrust inside your mouth.<br>\r\n<br>\r\n\"Keep on sucking it, like a baby!\" Maka ordered, a cruel overtone present in her voice.<br>\r\n<br>\r\nThis kept going for a couple of minutes, and in-between that time, she switched feet and forced you to suck her other big toe. It went on and on as she kept making fun of you but when that time was up, she suddenly stopped. You sighed in relief, relishing the small break you had from her feet.<br>\r\n<br>\r\nDamn\" Maka mumbles in disappointment, her eyes fixed on the clock on the bedroom wall, \"We have less than three hours until I have to stop doing this. But...\"<br>\r\n<br>\r\nShe playfully rubs her toes on your nose, wiggling it spread the smell on your nostrils. There was still a sharp foot smell lingering, even when you cleaned it with your tongue.<br>\r\n<br>\r\n\"You secretly want it to last forever, don't ya?\" she teased, her big toe still in her mouth.<br>\r\n<br>\r\nIs this some trick question?</span></div></div>",
            "created":1576047900,
            "id":2758106,
            "title":"Walks all over you."
        },
        "12":{
            "author_id":"animefeetxii",
            "author_name":"Animefeet",
            "choices":[
                "She removes her right shoe, and makes you smell her feet",
                "She removes her right shoe, and makes you choose which is worse"
            ],
            "content":"<div class=\"\"><div> <span>   You approach a door with a carefully drawn camellia flower etched onto it, and turn the handle. There is a blinding flash, and you are transported to what appears to be a hot spring. Through clouds of steam, you can make out the shape of a girl's silhouette, and it seems like she's about to undress. <i>Am I seeing things?</i> You wonder, taking a step forward, and onto a twig. With an unusually loud <i>*snap*</i>, the stick breaks in two. You look up, and a wave of fear washes over you. The girl's shadow was gone. <br>\r\n   Something tackles you onto the ground. On top of your chest sits a beautiful young lady that you recognize as Tsubaki. She places her booted feet on either side of your head, and holds her chained scythe to your neck. You gulp.<br>\r\n   \"You were trying to watch me undress!\" She yells.<br>\r\n   \"Wh-what? N-no... I...\" You stammer. <br>\r\n   \"You were just standing there staring at me! Don't think I didn't see you!\" Tsubaki growls.<br>\r\n   \"Please, I r-really wasn't...\"<br>\r\n   \"Then what were you doing here?\"<br>\r\n   \"I... I d-don't know! Honestly!\"<br>\r\n   \"I don't believe you. You're already on my bad side, lying will only make things worse.\"<br>\r\n   \"I honestly don't know wh-what...\"<br>\r\n   \"Save it. Even if you weren't trying to see me undress, you still interrupted my bath! I haven't had a chance to bathe since before we fought the Keshin!\" She says angrily. You can tell it's hopeless - there's nothing you can say that will change her mind. <br>\r\n   \"Wh-what are you going to do?\" You ask weakly.<br>\r\n   \"Well, seeing as I have to wait to bathe...\" She says with a slightly evil grin. \"I think you should be my foot stool for a while.\" Your heart almost stops. You immediately begin struggling, and trying to get away.<br>\r\n   \"Let me go! Please!\" You beg, wildly flailing back and forth.<br>\r\n   \"Aaw, what's wrong? Maybe if you can tell me why you're so desperate to escape, I'll let you go,\" She giggles, moving her hand to her left boot. Your eyes dart from her left foot to her right, and you take notice of the long, tight-fitted, black sock that travels all the way up to her knee on her right leg. <br>\r\n   \"I see you've noticed my stocking. It's the only one I have,\" She says, oddly sadistically. You open your mouth to talk, but no words come out. You stop struggling, there's no use in it. Tsubaki slowly starts removing her shoe, taunting you with every passing second, until, finally, the boot falls to the ground. When you hear the term 'sweaty feet', you usually don't associate it with sweat falling down in beads, and feet glistening from the amount of perspiration on them. Unfortunately, this was how Tsubaki's foot was. You had a new motivation to get free, and begin flailing about more wildly than ever. Then comes the worst part - the stench. It was like an intensified combination of cheddar popcorn, vinegar, and sweat. You had never smelled anything so horrible. <br>\r\n   \"Just wait until I get my other shoe off!\" She sings happily, moving towards her right foot.<br>\r\n(Couldn't get the spacing to work right after I posted this T_T)</span></div></div>",
            "created":1297043460,
            "id":1048992,
            "title":"Tsubaki Nakatsukasa"
        },
        "121":{
            "author_id":"dragonclam",
            "author_name":"Clam",
            "choices":[
                "Lick her sock clean.",
                "Walk around and get her feet dirty."
            ],
            "content":"<div class=\"\"><div> <span>You look up as she clamps her first foot down on your face. You hold your breath as the foot comes down toward your face. Tsubaki takes a seat on a nearby stool as she reaches for her other shoe. \"You will have to breath eventually,\" Tsubaki says as she starts to undo her other boot. You struggle to escape the foot on your face as she tugs at the other boot. Finally you run out of breath and have to breath. You take a long deep breath trying your hardest not to smell the foot. You had no such luck of course. As you breath in you smell the foot tightly clamped on your face. You wince as the foot smells like a salty, cheesy mess. \"If you think that is bad just wait until I get this other boot off,\" Tsubaki says as she is about to take her other boot off. You struggle as she gets closer and closer to taking off her other boot. \"Stop squirming,\" She says as she pinches your nose with her foot. You take one last breath before she takes off her other boot and get another smell of her foot. Somehow the sock had gotten worse than before. Then you realize that was because she had taken her other boot off. \"Now what to make you do with this one,\" Tsubaki taunted. <br>\r\nShe makes you...</span></div></div>",
            "created":1532015220,
            "id":2521940,
            "title":"She removes her right shoe, and makes you smell..."
        },
        "1211":{
            "author_id":"dragonclam",
            "author_name":"Clam",
            "choices":[
                "Stay still.",
                "Fight her."
            ],
            "content":"<div class=\"\"><div> <span>\"Now open wide,\" Tsubaki commands.<br>\r\n You fight to keep your mouth closed as she does her best to shove her socked foot into your mouth. \"I haven't taken that off in months,\" she says as she pushes harder.<br>\r\n You can't keep her foot out of your mouth any longer and she forces her sock into your mouth. You almost puke as the taste enters your mouth. She pinches your nose with her other foot and says, \"Start licking or things will get much worse.\"<br>\r\n You start to lick and the taste of sweat and dirt gets worse in your mouth. You can feel her moving her toes in your mouth. Somehow that made the taste even worse as she wiggles her toes in your mouth. You almost lose your lunch as the taste gets worse from her sock. Finally, she takes the sock out of your mouth and takes her other foot off of your nose. \"I don't think you have worked hard enough yet,\" she says as she starts to peel her sock off.<br>\r\nYou wince when the smell of her feet gets even worse when she gets her foot out of her sock. The foot smelled worse the other bare one. \"If you struggle again you will have to be punished,\" she says.<br>\r\nDo you...</span></div></div>",
            "created":1532149860,
            "id":2522620,
            "title":"Lick her sock clean."
        },
        "1212":{
            "author_id":"dragonclam",
            "author_name":"Clam",
            "choices":[
                "Make you lick her feet clean.",
                "Make your face dirty."
            ],
            "content":"<div class=\"\"><div> <span>She takes her socked foot off of your face. \"Now don't go anywhere or this will get even worse for you,\" Tsubaki commands. You lay there as still as can be too worried to find out what could be any worse than what she is about to do to you now. She walks over to a dirt patch and starts to rub her feet in it. \"Oh no,\" you think as she does her very best to make sure her feet get nice and dirty. After a few minutes Tsubaki walks back over to you and sits down on the stool. \"Now that these are dirty enough for you, I wonder what I should make you do with them,\" she says.<br>\r\nDoes she...</span></div></div>",
            "created":1532015640,
            "id":2521945,
            "title":"Watch her walk around and get her feet dirty."
        },
        "122":{
            "choices":[
                "You Continue Your Sniffing Until Tsubaki Uses Her Other Foot",
                "Tsubaki Uses Her Other Foot Now"
            ],
            "content":"<div class=\"\"><div> <span>Tsubaki grins at your increased struggles, knowing the smell is already torturing you. She giggles quietly as she pulls her right boot off, revealing her sticky, wet stocking that clings tightly to her foot as she wiggles her toes inside it. She lets this boot fall to the floor next to the other one, and places her stocking foot on the other side of your head, opposite the bare one. The stench is five times worse now! Due to five more toes to contend with!<br>\r\n<br>\r\nYou can't move with Tsubaki sitting on your chest, she has put away her scythe but you dare not move after being threatened with it, you know from watching the show (you are from the real world of course ^.^;) that she is a weapon and more than capable of kicking your ass. Tsubaki smirks into your eyes as she sees you suffering on her unwashed feet's stench.<br>\r\n<br>\r\nTsubaki wiggles her bare and socked toes on either side of your head, \"I have a task for you, since you owe me something anyway.\" Tsubaki says smiling innocently at you. <br>\r\n<br>\r\n\"W-what?\" You ask timidly.<br>\r\n<br>\r\nTsubaki grins cruelly and lifts up her bare foot, still dripping with sweat, directly above your face. You stare directly into her shining sole, reflecting light due to the grease. \"Hm hm hm,\" She chuckles, \"I just want you to test my feet, and tell me which smells worse.\" <br>\r\n<br>\r\n\"H-How?\" You ask, but you already know the answer.<br>\r\n<br>\r\n\"How else?\" She says loudly as she lets her foot drop onto your face, your nose buried into her nasty sole. \"By smelling them!\" <br>\r\n<br>\r\nSurprised by the foot falling onto your face, you unintentionally breathe in through your nose. Which needless to say smells very foul.<br>\r\n<br>\r\nTsubaki feels your breath on her foot, and shivers in pleasure. \"Mmmm....how nice.\" She presses her foot down harder, \"Keep at it!\"</span></div></div>",
            "created":1297047540,
            "id":1049038,
            "title":"Tsubaki Has a Task For You"
        },
        "13":{
            "author_id":"tadashiro",
            "author_name":"Lordzzeno",
            "choices":[
                "Liz",
                "Patty",
                "Both",
                "One, then the other shows up to help"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I kinda hate chapters like this but it seems a bit necessary. Who do you get it from? Liz, Patty,  Both, or one then the other shows up to assist her?</span></div></span></div>",
            "created":1328060880,
            "id":1269047,
            "title":"Thompson Sisters (Liz & Patty)"
        },
        "131":{
            "author_id":"rockermanxx",
            "author_name":"james",
            "choices":[
                "Get up and go over to her dresser?",
                "Have some polish in her pocket?"
            ],
            "content":"<div class=\"\"><div> <span>You have entered the world of Soul Eater. You do not know where you are, and thus keep wandering around aimlessly. You come upon a mansion several floors high. You walk in asking if any one is there. You get no reply. After walking around a bit trying to find someone one you stumble upon a open door. The light was left on but no one was there. In the room is what looks to be a comfortable bed, as well as a dresser with makeup piled on top of it. You peer in the closet and notice several outfits consisting of a hat a red skin tight shirt and skinny jeans. Still in your confusion you don't realize that you are in Liz Thompson`s room. All you could focus on was the bed. You are very tired from walking around and have to lie down. In time you fall asleep.<br>\r\n<br>\r\nYou are awaken with a loud bang! You get up and hear voices down the hall. Quickly you hide under the bed. Then you hear a familiar voice. The voice of Liz Thompson telling you that you are in the Soul Eater world. \" Oh my god!\" She exclaims, \" I`m beat!\"<br>\r\n<br>\r\nShe comes and sits on the bed with her boots positioned right in front of your face. \" Damn it took forever to find that keshin soul, my feet are so tired!\" and with that she kicks off her boots they fall open ended towards you,your nose only inches away. Then her feet come down laying on top of the boots, she has white ankle socks on that have a small amount of dirt around them. You can see her wiggling her toes, excited about the cold air.<br>\r\n<br>\r\nThen she slides her feet back. Shoving your nose in the entrance of her boot. Instantly the smell of sweat enters your nose. You cant breath though your mouth for this would alert her of your presence, forcing you to indulge in her foot smell, your eyes are now about 2 inches away from the soles of her socked feet. which have their toes placed on the bottoms of her boots and her heel is propped up against the base of the bed.<br>\r\n<br>\r\n\"AWWWWW, \"she says \" Now to do my nails.\"<br>\r\n<br>\r\nDose she...</span></div></div>",
            "created":1340145180,
            "id":1363111,
            "title":"Liz"
        },
        "14":{
            "author_id":"tadashiro",
            "author_name":"Lordzzeno",
            "choices":[
                "you grunt or shout, causing Marie to notice you.",
                "You sneak from under the bed but she notices you",
                "She sleeps and you sneak out, but someone comes in and sees you",
                "She gets up and bends to pick her shoes up and sees you.",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>You sigh in misery as you walk around the hall of Shibusen, looking for wherever your next class is. It was an extremely large place and you had gotten lost after you turned the first hallway! Still, you walk around before stopping at a door. You check your watch and see that its been nearly a half hour since you entered.<br>\r\n<br>\r\nYou push the door open in agrivation, intending yo bitch out whoever was inside, regardless of who it was. But you stopped and looked around. You were in a blue room with multiple lightning- like patterns, yet it still looked girly somehow. Seeing nobody around, you enter and close the door behind you and lock it. You go over to the dresser and see multiple bottles of perfumes, shower items and such. You open one of the drawers and smirk, pulling out a pair of pink, heart pattern, frilly panties. You blush, being quite a pervert(regardless of gender) and put it in your pocket before taking several more. Then you see a blue and yellow book in this drawer, picking it up.<br>\r\n<br>\r\n You read through it, as there is no lock. You don't see a name but find much about relationships. At page ten, you pale at seeing a small dialoug. Someone called her Marie in it. The lightning patterns suddenly made sense. You were in the room of Marie Mjolnir! A powerfull weapon! Hell, she was a frickin' DEATH SYTHE! As if on cue, a key can be heard being inserted into the doorknob. Your heart skips a beat and you jump around before diving under the bed. You were quite snug under there but not uncomfortable. The door then opened and you saw her, Marie herself, walk in. She doesn't notice you, but still sits on the bed, setting her bag down.<br>\r\n<br>\r\nRight in front of your face were her shoes. White high-heels with a zig-zag pattern on them. Suddenly, she actually speaks!<br>\r\n<br>\r\n\"Oooh... My aching feet... This school is so biiiig...\" she groaned. You roll your eyes. You weren't the only one who thought so. \"high heels... I need to buy new shoes. These aren't fit to walk around with.\" She says, removing the right shoe from her foot.<br>\r\n<br>\r\nWHOOSH!!<br>\r\n<br>\r\nSuddenly, a horrible burst of foul odor assaults your nose. It stinks of vinegar and stale cheese popcorn! You can't cover your nose because they're trapped at your sides! No choice but to smell the reeking stench of Marie's foot stink. As the other shoe is removed, the smell doubles and you try not to gag. Its pure torture for your poor nose.<br>\r\n<br>\r\nYou hear sniffing comming from Marie. \"Ugh! Ewww! So stinky...\" she whined. You agree with her on that one too! \"I should shower...\" once again, you agree. \"But... Maybe a nap first...\" THAT you don't agree on! She lays back on the bed and lets her feet dangle in front of you, the pugnant odor wafting into your innocent nose.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1328060160,
            "id":1269040,
            "title":"Marie Mjolnir"
        },
        "15":{
            "author_id":"animefeetxii",
            "author_name":"Animefeet",
            "choices":[
                "Yumi Azusa",
                "Mira Naigus",
                "Blair (Human form)",
                "Medusa",
                "More..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More of the lovely ladies from Soul Eater.</span></div></span></div>",
            "created":1280379600,
            "id":926693,
            "title":"More"
        },
        "153":{
            "author_id":"dragonclam",
            "author_name":"Clam",
            "choices":[
                "Make you smell her stockings.",
                "Make you lick her stockings."
            ],
            "content":"<div class=\"\"><div> <span>You were walking down a street on your way to the store. You decide to take a path you don't normally take through some woods. After a while of walking you come across a pumpkin house. Being tired and hungry you decide to head inside. Little did you know it was the house of Blair the witch. As you head inside you look around to see if anyone is there. You see no one and decide to sit on the nearby couch. As you relax on the couch you hear the soft patter of someone walking nearby. You turn your head to look around and when you turn back you get hit in the head.<br>\r\nYou wake up in a dark room. You take a minute to look around and realize you are in a basement of some kind. You hear a voice from the darkest corner say, \"So what are you doing here cut thing.\" You squint to try and see how was speaking with no such luck. \"I was tired and wanted to take a rest,\" you answer truthfully. \"You shouldn't just walk into strangers houses you know,\" the voice replies, \"So now you will have to pay the price.\" As she steps forward you see that you are talking to Blair the witch. She is wearing a dress, long stockings, and boots. \"That prices is being my slave,\" she says. She starts to undo her left boot. <br>\r\n<br>\r\nDoes she...<br>\r\n</span></div></div>",
            "created":1532149080,
            "id":2522615,
            "title":"Blair (Human form)"
        },
        "154":{
            "author_id":"alex999999",
            "author_name":"Alexthefurry",
            "choices":[
                "shrunk ",
                "normal size"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>does she find you shrunk or finds you at normal size</span></div></span></div>",
            "created":1517261700,
            "id":2446531,
            "title":"Medusa"
        },
        "155":{
            "author_id":"animefeetxii",
            "author_name":"Animefeet",
            "choices":[
                "Arachne",
                "Mizune"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more, these are the last ones.</span></div></span></div>",
            "created":1280449080,
            "id":926699,
            "title":"More..."
        }
    },
    "info":{
        "author_id":"animefeetxii",
        "author_name":"Animefeet",
        "brief_description":"The girls from Soul Eater torture you with their feet.",
        "created":1280447580,
        "description":"<td align=\"left\" class=\"norm\">     In this story, you are tortured by the feet of the girls from Soul Eater. Pretty simple. Here are the rules:<br>\r\n#1. Girls only. No guys.<br>\r\n#2. Tell the story in 2nd person. For example; You look up at Maka.<br>\r\n#3. Your character does not have a foot fetish, and will not develop one. i.e. Your character doesn't enjoy it.<br>\r\n#4. Use proper grammar. I understand small mistakes like a misuse of a word, but something like this: 'oooh no i shoutd plz dnt' Will not fly.<br>\r\n#5. Chapters must be at least a paragraph long, except for ones where you're choosing a character.<br>\r\n#6. No sex.<br>\r\nFollow those six rules, and everything will be great. ^.^</td>",
        "id":1694527,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1576047900,
        "modified":1576047900,
        "pretty_title":"Soul Eater: Foot Torture"
    }
}