{
    "chapters":{
        "1":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "a boy",
                "a girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So are you a guy or a girl?</span></div></span></div>",
            "created":1305090000,
            "id":1104110,
            "title":"Who Are You?"
        },
        "11":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Go and get something to eat",
                "Take a nap",
                "Interrogate the manager",
                "Explore the hotel",
                "Spy on the workers"
            ],
            "content":"<div class=\"\"><div> <span>It's been quite a long time...You're finally returning to your hometown. Your family had to move when you were younger, but now you finally get to move back. The same streets, the same buildings and shops...It's like nothing's changed. You can't wait to explore the forest you always played in when you were a kid. It was your one and only happy place whenever you felt sad or hurt. But, something just doesn't seem right. As you unpack your things, you get the feeling that someone...or something is watching you...<br>\r\n<br>\r\nLucky! Your parents have to go out for the entire weekend, so you've got the whole house to yourself! You put on a change of clothes and head out. When you reach the forest, you suddenly get the feeling that there's something horrible waiting for you there. You brush it off as you think it's just your imagination. You walk past some trees, until you finally reach it, you're childhood secret spot near a cliff...Only to find a large cabin right there. You feel like your heart's been torn out. Who would do something like this? This was your favorite place in the whole world,and now it's been taken away from you. As you feel your sadness slowly be replaced by rage, you decide to find out who's responsible for this.<br>\r\n<br>\r\nYou calmly walk up to the door, only for it to be opened up for you by two six-year old kids. One was a girl with long blonde hair with a smile on her face. The other was a boy with short black hair with a smile on his face too. \"Welcome sir!\" They shout at you. You're completely taken aback by this. They 'show' you inside, forcefully shoving you in. \"Excuse me, but where's your manager?\" You say, trying to keep a calm voice. The two point to a reception desk at the other side of the lobby. As you approach the receptionist, you see that it's a twelve-year old boy with brown hair, watching you with a happy look on his face. \"Um, hi. I'd like to speak with the manager.\" \"I am the manager! My name is William. Wil for short.\" It all just get's stranger and stranger. \"What would you like to talk about?\" \"I'm here because I've got a complaint.\" \"I'm sorry, but to file a complaint here, you have to stay for at least a couple of days.\" Didn't expect that, but you're thankful that your parents had to go for the whole weekend, so you decided to stay there for the weekend.<br>\r\n<br>\r\n\"That's great! And since you're our first customer, I've decided it's all expenses paid, free of charge!\" You get a cold chill the moment he finishes talking. Is there really something watching you from somewhere? But you don't wanna pass up an all expenses paid stay here! \"Now then, just sign your name here on the guest list,and we're all good to go.\" You hesitate signing it a little, but you manage to do it. \"Now then, Luke will show you to your room.\" You get a very bad feeling as you hear footsteps coming closer and closer. You feel like all the warmth in your body is replaced with an intense cold feeling. You look to your left to see a black-haired boy, about Wil's age, wearing a long black cloak covering his neck down to his ankles slowly walk towards you. You can't seem to explain it, but you're scared of this guy. There's just something not right about him. \"Come with me.\" He tells you. You'd better not make him angry and do as he says.He leads you to a hallway,until you reach the first door to the right. \"This is your room.\" You open the door to see a large, clean and rather stylish looking bedroom. \"The bathroom is to your left, the closet is right across the bed, and out the window is the sea. Enjoy your stay.\" He bows down to you before leaving. As you close the door, you suddenly feel a whole lot better. Well, now what should you do next? You forgot to eat breakfast, and you're feeling a bit tired from being with Luke, and you've still got a lot of questions to ask that William guy. What to do, what to do...</span></div></div>",
            "created":1307854800,
            "id":1124591,
            "title":"The Hotel Cabin"
        },
        "111":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Lupine Special",
                "Avian Special",
                "Reptile Special"
            ],
            "content":"<div class=\"\"><div> <span>You wander around until you find a door that reads 'Cafeteria'. Your stomach growls and you remember that you didn't eat anything this morning! You decide to head inside to get something to eat. It was all expenses paid anyway.<br>\r\nInside are lots of round table with chairs, all of which are empty. \"They weren't kidding when they said that I'm their first customer...\"<br>\r\n<br>\r\nYou walk up to the main desk and look at the menu hanging on the wall. \"Hello there! What can I get you?\" You look at the worker, which turns out to be another kid! This one has red messy hair. \"My name is Gill, since it sounds like my favorite Digimon character. I even dyed my hair the same color! So,what would you like?\" \"...Um...Can I ask what this 'Lupine Special' is?\" \"Oh,that...It's a tender steak cooked to a sizzling juicy crisp mixed with a few spices to give it that special 'Bow wow' to it!\" \"...Well, what about the 'Avian Special'?\" \"It's a vegetarian meal, mostly fruits and berries, mixed with a an exotic flavoring that can really give you a 'Bird's eye view' in food!\" \"Okay...This just keeps getting weirder and weirder...\" \"Did you say something?\" \"Ah,what about the 'Reptile Special'?\" \"Oh,that one is a delicious prime rib grilled to perfection, and a special ingredient in it will really give you a 'Rip snarling' good time!\"<br>\r\n<br>\r\nYou can't help but feel that Gill keeps adding a bunch of animal puns in the food names, but you also have a bad feeling about eating any of this...Your stomach start gurgling again. You have to eat something!</span></div></div>",
            "created":1312002000,
            "id":1158294,
            "title":"Animal choices?"
        },
        "1111":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Sit down and get to know Akira and Elly",
                "Follow Gill to Wil's desk",
                "Go back to your room"
            ],
            "content":"<div class=\"\"><div> <span>As you order the Lupine Special, Gill immediately starts cooking. You sit down on a table and watch him moving around the kitchen, cutting, slicing, adding spices, and all that other stuff. As he adds the finishing touches, You watch as the two younger kids walk in, curiously looking around the cafeteria. You wave your hands to them as they run towards you and take a seat around you. \"So, I never knew who you two are. What are your names?\" you ask.<br>\r\n<br>\r\n\"My name is Akira! I got it from a show my older brother once watched.\" the boy said. \"My name is Elly, I thought of it myself!\" the girl says. You try to smile nicely to the two as you think of how weird they got their names from. As Gill carried the dish on the table, you saw from the corner of your eyes a sad look flash from the two. \"What's wrong?\" you ask. \"No-no...Nothing...\" Akira says. \"Don't eat it!\" you hear Elly whisper to you. You look at her with a suspicious look on your face. The smell of the steak wafts into your nostrils and your mouth starts salivating in an instant! You grab the knife and fork and start wolfing down the dish as fast as you can. Speaking of wolf, it seems that after every bite, light blue fur is sprouting from your skin. Not only that, but claws are growing out of your hands and feet! After you finish the whole steak, you take notice of the changes just as a furry blue tail suddenly bursts out of your pants! You look at yourself in disbelief! Snout, fangs, pointed ears on your head, everything! But your clothes still fit you, and you can still stand on your two legs, and your hands are still shaped like hands too!<br>\r\n<br>\r\n\"Wh-what the heck just happened to me!?\" you yell in disbelief, immediately standing up. \"Um, I think you turned into a blue anthropomorphic wolf, I believe.\" Gill says, closing his eyes and putting his hand on his chin. \"What'd you mean by that!? Can't you see that I just transformed into some furry freak!?\" \"Hey, that's not nice!\" \"Yeah!\" You look down to see the two six-year olds with an angry puffed-up face looking at you. You realize you just insulted them somehow and give a sigh. You kneel down to one knee and look at them. \"I'm sorry if I offended you. I'm just a little...surprised that I turned into this.\" The two let out the air in their mouths before saying \"Okay...\" to you, looking away. \"Anyway,\" you say, getting to your feet. \"Why did this happen to me? What caused this?\" You ask Gill. \"It was the food. The name was a heads-up on what will happen to you if you eat it.\" You think about it for a while before saying to Gill, \"Is there a way to reverse it?\" \"I'll have to ask Wil about that.\" he said before leaving.</span></div></div>",
            "created":1316062800,
            "id":1187660,
            "title":"A Fur Raising Experience"
        },
        "11112":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Stay on the couch",
                "Follow them"
            ],
            "content":"<div class=\"\"><div> <span>As you watch Gill head to the exit, you decide to follow him. After getting his attention and saying good bye to Akira and Elly, the two of you leave for the Lobby. After a few minutes, Gill stops in his tracks and suddenly blurts out, \"Wait, how do we get back there again?\" You stare at Gill with a look of shock and confusion on your face. \"You mean to tell me that you don't know how to get back to the Lobby!?\" \"Yeah, I haven't been outside the cafeteria for a while since breakfast...\" You just stare as you watch Gill begin to reminiscence whatever it is he's thinking of. A smile appears on his face, he closes his eyes and you see a bit of drool starting to overflow out the corner of his mouth. You can feel your anger towards him grow more intense, until you just start growling at him, which snapped him back to his senses. \"Oh, sorry. I was just remembering the yummy flavors of all the food I ate.\"<br>\r\n<br>\r\nThe two of you continue on your way across various hallways and doors, until you finally make it back to the lobby. Gill immediately runs over to Wil, who was reading a magazine on the couch. \"Wil! I thought I'd never get back here alive! D'you have any bread?\" \"Gill, I thought you're supposed to be at the cafeteria!\" \"Well, I had to escort our guest here because he has a request for you.\" You walk over to the two, surprising Wil a little bit. He quickly regains composure and asks, \"So, what is it you need from me?\" You explain what happened to you and ask for a way to reverse the wolf transformation. \"Sorry for asking, but why would you want to go back to being human?\" \"Why? What do you mean why!? I'm a blue wolf person!\" \"Light blue.\" Gill chimes in. \"W-Whatever! Just, change me back to a human, please?\" \"Like I said, why would you want that? You're much stronger as a wolf anthro, and you still have your original mind, so you won't lose control over yourself. Not to mention your increased senses. What's stopping you from wanting to stay like this?\" \"Um, maybe it's because of the fact that I LOOK LIKE A TOTAL FREAK HERE!!!\"<br>\r\n<br>\r\nBoth Wil and Gill suddenly get an angry look on their face. You've definitely offended them somehow. \"Sorry, but even if I wanted to, I can't change you back.\" \"W-why not?\" \"Because, 1. You're kinda mean when it comes to normality. 2. I don't have a means of reversing the effects of the food.\" \"Yeah, and you're really mean when it comes to looks, too!\" \"Gill, I already said that.\" \"Oh, right.\" You sit down on the couch, trying to accept the change that has befallen upon you. Does this mean that you'll be like this for the rest of your life? No, it can't be! Right at that second, you started smelling something weird...Smoke? No wait...Ashes? Whatever it is, it's something around that. You think that there may be a fire that broke out somewhere, but the two kids in front of you start smelling the air. \"Hey, does that smell like smoke to you?\" Gill said. \"Now that you mention it, I do remember asking him to practice his aim at the gym...\" \"You don't think...\" You're not sure just what the two are talking about, but you know that it has something to do with another employee here.<br>\r\n<br>\r\nThe two tell you to stay in the lobby as they leave to go check something in the gym.</span></div></div>",
            "created":1320037200,
            "id":1215334,
            "title":"A strange plot?"
        },
        "111121":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Run after them!",
                "Someone else comes along."
            ],
            "content":"<div class=\"\"><div> <span>\"Might as well try to keep them happy, after what I said back there.\" You stay on the couch, examining the coloring of your fur. After a while, you can hear the footsteps of someone approaching you. You look towards the direction of the sound and see...Luke! You can feel it. Your instincts are screaming in your head, telling you to get away from him, as fast as you can! You watch him as he calmly strides over to the lobby table. He looks at some papers and begins sorting them out. \"Come on...Get out of here...Before my instincts start acting up by themselves...\" Your legs start twitching, ready to sprint out of the lobby the moment you give them the command. When he finishes sorting the papers, he looks at you. A horrible cold chill was sent down your spine and lasted for at least 10 seconds. \"Grrr...\" He walks up to you and looks at you in the face. \"Have you seen Wil anywhere?\" \"...He...He's with Gill...At the gym. He said something about...Someone practicing his aim.\" \"...Am I using too much power?\" You look at him inquiringly. Just staring at his eyes is making your limbs feel numb. \"Allow me to adjust.\" Suddenly, you can feel your limbs again. You can breathe easier and your legs have stopped twitching. But you still feel like getting far away from him. \"How...did you do that?\" \"It's something I can do, which I don't like to share with others.\" You watch as Luke starts to leave and disappears around the corner. \"Something he can do, huh?\"<br>\r\n<br>\r\nAfter half an hour, you hear someone else coming. You see Akira and Elly come around the corner, and you wave to them. \"Hey! Mr. Wolf-man!\" \"Mr. Wolf-man!\" They run towards you and start asking a bunch of questions. \"Where's Wil?\" \"Where did Gill go?\" \"How's it like being furry?\" \"Are you enjoying your stay?\" \"Do you think I should change my shirt?\" \"Do you brush your teeth after every meal?\" You try to get their attention, but they continue to barrage you with random questions. \"Did you see Luke again?\" \"Isn't he scary?\" \"How come he always wears black?\" \"Did you try to rip him apart?\" \"Do you think he's actually nice inside?\" \"Have you seen our dragon yet?\" \"STOP!!!\" You pant a little as the two just stand there looking at you. \"...Okay, I don't mind answering some of your questions, but please, one at a time! Wait...What was that last question?\" \"You mean about brushing your teeth?\" Elly asks. \"No, that other one.\" you say. \"You mean...the dragon?\" \"Yeah, that's the one.\" \"Uh oh...\" Akira and Elly look at each other before running to the corridor Wil and Gill used. This left you frustrated and confused.</span></div></div>",
            "created":1324702800,
            "id":1245819,
            "title":"Another meeting"
        },
        "1111211":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Get to know him",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>The more you think about the way those two just took off, the more you want to get answers from them. \"Aw, to heck with that guy Wil!\" You bound after the two, trying to see which direction they went to. That is, if there weren't so many darn corridors here! What kinda stupid cottage house is this!? You suddenly smell something...You try sniffing the ground...This must be their scent! You follow the trail, hoping that doing this will lead you to them. As you continue to follow them, some thoughts began entering your mind. \"Hey, isn't this like how wolves would go around hunting for prey to kill?\" You concentrate on blocking out the 'kill' part in that last statement. \"Heh, I guess the wolf part of me is starting to leak a bit...\"<br>\r\n<br>\r\nAfter a while of trailing Akira and Elly's scents, you reach a pair of double doors with a bit of smoke coming out of the tiny space in between the two doors. You look up at the sign above, which read 'gym'. \"Hmm, I wonder if they'll get mad at me for not listening to them...\" Your knees start trembling a bit, and your fanged teeth are chattering a bit. \"Ugh...Luke must be around here...Probably inside...\" You open the door slightly, being careful not to make gap too noticeable. You peak inside and see Akira and Elly jumping up and down, saying something. Your ears can't quite understand what they're saying, but you do hear some stray words like \"sorry!\" and \"didn't mean-\" and such. You push the door a little bit further and you see Wil and Gill, bending over someone with a red shirt. You push the door just one more time, and see Luke. He suddenly turns to face you, making another cold chill cover your spine. He quickly walks over to you, and you feel desperation and panic instantly wash over you! You try to move, but as you watch him come closer and closer, your muscles seem to be locked at just the mere sight of him. As he fully opens the door, you just stand there, sweat rolling down your furred head as he inspects you top-to-bottom. \"It seems that I've just caught myself a little doggy without his chain.\" You gulp as he grabs you by the neck of your shirt.<br>\r\n<br>\r\n\"Sir, I've found someone that shouldn't be here.\" Luke says, dragging you to the others and pushing you to the floor. \"Hmm? What are you doing here? Shouldn't you be back in the lobby?\" Wil says, looking down at you. You open your mouth, trying to answer, but your voice feels constraint, like something's keeping it inside you. \"Alright, that will be enough Luke. You can go check if there's any suspicious activity going on somewhere else.\" \"As you wish, sir.\" You watch as Luke leaves the gym, and a breath of fresh air enters your lungs. You breath heavily for a few seconds before looking around you. Wil, Gill, Akira and Elly are all looking at you. You also see someone with blonde hair and a red shirt doubled over behind a few feet away. \"Okay, why did you come here? Didn't we tell you to just wait in the lobby?\" Gill said. \"Well, see, These two...uh, they mentioned something about...a dragon?\" The two suddenly look at Akira and Elly, who look at the floor apologetically. \"Yeah, and?\" Wil asked, looking back at you. \"I just wanted to ask a few questions, so I followed them.\" There was a silence in the gym. That was when there was a splutter and a gasp coming from the blonde kid! You all come to his side and help him up. \"Is there anything I can get for you?\" Gill says. \"Are you alright?\" Elly asked. \"*cough* D-don't worry. I'm fine...\" He stands up on his own and sees you. \"Oh! A guest?\" You nod. \"Well, my name's Drake. Nice to meet you!\"</span></div></div>",
            "created":1325307600,
            "id":1249829,
            "title":"Chasing your prey"
        },
        "11112111":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Your room",
                "The swimming pool"
            ],
            "content":"<div class=\"\"><div> <span>You look at Drake, looking like he was caught in a bomb explosion. His red shirt is slightly charred and there's black smudges on his face and arms. His blue pants are even torn at the edges as well. \"Are you sure you're alright?\" you ask. \"Don't worry, I'm fine. Really.\" he says, standing up on his own. \"I told you, be more careful when practicing your aim!\" Wil said. \"Yeah! What would we do without our big, lovable dra-\" Will hits Gill in the ribs before he could finish that word. You already know that he was going to say 'dragon' there. \"Um, I think I already know what he was gonna say, Wil.\" you say, hoping for the best. Wil didn't look very surprised, but Gill looks completely shocked. \"Wha? N-no! I wasn't gonna say that!\" \"Then what were you saying?\" Elly asked. \"I-I was....gonna say, uh...Dra...Dra...Meh, I've got nothing.\" Gill says, admitting defeat.<br>\r\n<br>\r\n\"Well, how about we let the pup and the lizard get to know each other?\" Wil said as the four left the gym. You turn to Drake and ask \"Is it really true? You're a dragon?\" Drake just looks at the ground and nods his head. You normally would have laughed at it, thinking it's a joke, but after being turned into a wolf anthro, and seeing the scarlet-red eyes at the boy in front of you, pretty much anything is possible at this point. But still, a human like him as a fire-breathing dragon? \"C-can you...uh, show some proof or something?\" \"Step back, I'll use half my power.\"<br>\r\n<br>\r\nYou do as you're told and watch as he clench his fists and look like he's focusing on something. You see it! Red scales covering his arms and face. His hair starts bunching together, turning rigid and becoming his yellow horns. His faces pushes out into a muzzle and you see a pair of wings and a tail burst out of his clothing. The wing membrane is a deep blue color. As he relaxes, Drake looks at you, waiting for your reaction. \"W-wow...That's amazing!\" \"You...don't think I'm a freak?\" \"If I was a human, I might have. But either way, it's still pretty cool!\" \"Gee...thanks a lot. It really means a lot to me.\" Drake says, a smile forming.<br>\r\n<br>\r\nThe two of you sit at the bleachers, getting to know each other. \"You see, all of us aren't human. We just wear disguises in order to interact with other people.\" \"Huh. I guess that's why the others got mad at me when I said I look like a freak.\" \"Don't worry. None of them can really blame you for thinking that. It's just a natural reaction from, you know...Changing species...\" The two of you talk for a while until the doors of the gym open, with someone coming in. It was Akira and Elly! \"Big brother!\" \"Big brother!\" The two run over to the dragon anthro beside you and gives him a big hug. \"Alright, now what's the problem?\" Drake asks, rubbing Akira's head. \"It's Luke again!\" Akira says. \"He's so scary!\" Elly says. \"Now now, don't worry. He'd never hurt you two, alright? He's just not very good at playing with others. Now run along before Wil starts wondering where you two are.\" You watch the the two kids run out the gym. \"Wow, you seem to be good with kids, huh?\" you say. \"Yeah, I've always seem to be like the 'big friendly dragon that can beat up the creatures of the night' sort of figure for those two.\" \"What about the others?\" \"Wil usually doesn't care as much. Gill's more like a playmate. Luke's too scary for them, and Lyle is too much of a trouble maker.\" \"Lyle?\" \"Our lifeguard and apparently our scientist. He's the one who causes all the transformations here in this cabin.\" Drake says. An idea forms in your head. If he's the cause of all this, then can he undo it all as well? \"Hey, where can I find him?\" \"Well, he's either in the pool taking a dip, or messing up your room.\" You suddenly feel a twinge of intense anger from that last statement. You start growling at the mere thought of someone inside your territory, doing whatever he wants in there. \"Hmm? Oh, right. I think wolves are territorial creatures, right?\" \"Shut up and take me to him right now! If he thinks he can just waltz into my room, <b>MY ROOM!</b>\" \"C-calm down! We're not even sure if he's heard of you yet!\" You take a few deep breathes and feel some of your anger fading. But you still have to decide where to go, however.</span></div></div>",
            "created":1329541200,
            "id":1279769,
            "title":"The More Friends, The Merrier"
        },
        "111121112":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Pumped Up (muscle growth)",
                "Belly-Filler (weight gain)"
            ],
            "content":"<div class=\"\"><div> <span>After taking a few deep breathes, you look at Drake and say, \"Alright. I'm calm. Now take me to where he usually is. Hopefully, he really hasn't heard about me at all.\"<br>\r\nDrake nods and heads out the gym. You follow him out to the hallway, where Drake starts going down one corridor.<br>\r\n<br>\r\nAfter a few minutes, the two of you are standing outside a door with a sign on top, which read \"swimming pool\" on it. The two of you walk through the glass doors and see the sun shining down on a large pool area, which almost looked like a part of some 5-star resort! There was a large curved pool with a lifeguard chair next to it, a large glass ceiling over the whole room, a few coconut trees around, an entire beach-side bar on one side! And several tanning chairs around the pool. It seems that one of them is occupied, with a 12-year old boy who looks oddly like Luke, only he's wearing a pair of blue and white trunks, and seems to be asleep. Drake approaches him and nudges him awake.<br>\r\n\"H-huh? Oh, Drake! How nice of you to visit me.\" he says.<br>\r\n\"Okay Lyle, I've got a question to ask you, and you'd better answer it.\" Drake says.<br>\r\nYou approach the two and look angrily at Lyle, who also looks at you, but doesn't seem fazed at all.<br>\r\n\"If I messed up Wolf-man's room? Nope, I'm a bit busy reorganizing some formulas and quadratic equations in my head right now.\"<br>\r\nHe closes his eyes again and seemingly goes to sleep, which only enrages you. You suddenly grab him by the shoulders and start shaking him.<br>\r\n\"Alright! Tell the truth! Did you go near my room or not!?\"<br>\r\n\"Ugh, I said no. Now will you please let me go back to sleep?\"<br>\r\nDrake places his scaly hand on your furred arm, and you let go of him.<br>\r\n\"Well, could you at least turn be back human?\" you ask, calmer this time.<br>\r\n\"Well, alright then. But there's a guarantee that it won't work.\"<br>\r\n\"What do you mean by that, Lyle? Is this another one of your tricks?\" Drake asks.<br>\r\n\"Basically, I've been doing a reverse transformation potion research in my room, but so far, all it does is give you a bad case of the runs. Yeah, I think that's idiot for diarrhea.\"<br>\r\nYou reel back your arm to punch him, but Drake instantly grabs you from behind, holding you back by the shoulders.<br>\r\n\"Okay, I think that's enough now. C'mon guest, lets go.\"<br>\r\n<br>\r\nYou two are standing in front of the bar now, away from Lyle.<br>\r\n\"So what am I gonna do now, Drake!? I really am stuck like this forever...\" you say, whimpering.<br>\r\n\"It's okay, it's okay. For now, all you can do is enjoy your vacation. Here, I'll get you something from the bar.\" Drake said, pointing at the bar.<br>\r\n\"Oh no, this time, I'll pick what I wanna get, and I am not gonna turn into some kind of half-breed wolf creature.\"<br>\r\nAs you walk to the bar, you can hear Drake mumble that you already are one, but you ignore him.<br>\r\n<br>\r\nWhen you reach the bar, you see Gill cleaning a glass with a blue rag.<br>\r\n\"Gill!?\" you exclaim.<br>\r\n\"Oh! It's you! Uh, um...The guy who sorts the mail, right?\"<br>\r\n\"What? What are you talking about? It's me!\"<br>\r\n\"Of course I know you! I was just playing with you, Mr. Blue Dog-man.\"<br>\r\n\"Now I'm Mr. Blue Dog-man?\"<br>\r\n\"Heheh, Just kidding. So, you want the Lupine Special?\"<br>\r\n\"No! Not that again!\" you say, grabbing the counter.<br>\r\n\"Alright! Alright! Jeez, I was trying to make a joke. That's all.\"<br>\r\nYou look at the menu at the back wall of the bar. Most of them are labeled with the word 'special' at the end, which must mean that they are transformation dishes again. Though when you looked at the drinks, they all had one thing in common...Well, two in common anyway. 1 was that none of them had 'special' at the end. 2 was that you haven't heard of any of those drinks before in you life. Wanting to play it safe, you tell Gill,<br>\r\n\"I'll just have something to drink.\"<br>\r\n\"Great! What would you like?\" he says, tying the rag back onto his left arm.<br>\r\nTurns out it was the bandanna he always wears. But for a split second there, Your eyes spotted something on his arm where he tied his bandanna back on. You couldn't get a good view of it, but it was definitely something...<br>\r\n\"Hello? Your order?\"<br>\r\n\"Huh? O-oh! Yeah! Um, I'll have...\"</span></div></div>",
            "created":1334552400,
            "id":1316580,
            "title":"Taking a tan with a nice outdoor bar."
        },
        "1111211121":{
            "author_id":"honix",
            "author_name":"Honix",
            "choices":[
                "Go to thé gym",
                "go To your room"
            ],
            "content":"<div class=\"\"><div> <span>As you order the (pumped un) smothe Gill imediatly starts making your drink adding ingredients flavors and a few finishing touches Drakon says « do you know what that drink will do to you? » And to that you respond « wait it is going to do somthing to me? What is it going to do? » drakon is about to say something but Gil quikly interupts him and says « Well your drink is ready sir drink up we woudnt want it to get warm now would we » looking at drakon you see that not wanting to upset Gil by revealing the effects he stops talkin but jas a sligtly worried look on his face. Being that the smothe looked very good you goboled it up in one go it was so delicious you barely noticed the changes your body was going trough. With each gloups your muscle grew and became rock solid. Your shoulders broadend and grew while your arms became big and ripped your chest balloned out almost destroying your shirt your legs grew mutch bigger and ripe with power and your back grew and whidend and a solid 8pack formed on your stomach looking like a brick wall of solid muscle even your tail muscle grew making your tail noticably bigger. After drinking the l’ASR drop all you could do was gasp at the vew of your new bodybuilder fisique. Your once baggy shirt was straned at its breaking point and would tear at any movement and your shorts wer riped at the side so big wer your legs . After rasing your shirt and looking past your humongus pecs you saw your deeply cut 8pack whitch got a gasp and a wow! Out of Gil and drakon that wer now admiering your big ripped Wolf muscles. Grining at yourself you rased your arm and flexed whitch your biceps explode with raw power while your sleves wer destroyed under the presure of your mucles. You felt yourself up and loved that your soft fur covered sutch hard muscles you then realized that you should change before all that was left was your boxers. As if reading your mind drakon said we should go to the gym we have clothes that fit your sise there . But you tougth that you could also change at your room then again you could test your superhuman strength at the gym where should you go?</span></div></div>",
            "created":1540735200,
            "id":2569708,
            "title":"Pumped Up (muscle growth)"
        },
        "11112111211":{
            "author_id":"honix",
            "author_name":"Honix",
            "choices":[
                "Go Sleeeeepppp",
                "question wil"
            ],
            "content":"<div class=\"\"><div> <span>You decide to go to the gym to get some new clothes because you didn't want any one see you naked you said '' Ok lets go to the gym'' Drake Told you to follow him and you left the pool area behind following the 12 year old. You thought that the place could be a mess as you remember it vas damaged the last time you saw it but to your surprise the gym was clean not only that but it was the biggest gym you ever saw in your life it bad dumbbells that where over 5000lbs!!! it had huge workout machines the had weights that were several tons. You couldn't hide the fact that you were impressed and just stood there until dragon spoke and brag you back to your senses '' Hey are you coming'' he asked ''Hum oh yea wow this gym is impressive '' Drake ''Yea it is pretty advanced maybe you could try it out after you change so we could test your strength '' You'' Sure that sounds interesting '' You liked the thought of that while following Drake you felt like an alfa wolf maybe it was because of your wolf form instinct you would have to find a way to control it before it got you in trouble. Drake brings you to a small gift shop of sorts within the gym filled with supplements clothes and other various gym stuff. Drake''Well Wil said the all expenses were payed so pick whatever you like'' You ''Hum ok Just look away wen I change please'' Drake ''Ok Well tel me wen you are done. You ended um taking a shirt and short of your favorite colour the fit you but stil show off your muscles and went to see Drake ''Good you are clothed now ready for that workout. You '' Yup i am ready I feel very strong I can't wait to see With this body can do!'' Drakon'' Great but first do you want something to drink to drink before the workout like a protein shake recovery booster physical enhancer or just water'' You ''What is a physical enhancer'' Drake ''it is a special supplement that will significantly increase your gains in a workout '' You thought that it would be nice to be even bigger and because you didn't have anything to lose you said ''I will take the physical enhancer please'' Drake ''ok you got it '' He then got a bottle from one of the shelves and a cup he went to a mini fridge near and got milk he then mixed the powder in the bottle and the milk in the cup and gave it to you. ''here you go '' it looked kind of brownish but smelled vanilla so you drank it and after you finished it you immediately felt energized like you could run 20 marathons in a row. Drake said ''So do you feel ready for your workout '' You '' Yea I have so mulch energy lets do it '' Drake good lets start with an endurance check '' He then brought you to a treadmill ''Hop on an lets see how fast you are '' you then went on the tread mill and started at 20 kmh it was a breese you felt like you could do this all day but than drake augmented the speed 30knh 40kmh 50... it was easy you were impressed by your own body but drake saw that and kept augmenting the speed and after 70kmh it was getting difficult but he kept pushing 80kmh 100kmh''ok You can stop now '' Drake''not yet iam shure you can do better 120kmh 140kmh at 150kmh you were at your limit and after 15Minuts at that speed you said you count go on so Drake stoped the machine. wen it stopped you stepped off the treadmill compleatly exausted with your legs were aching so you sat on a bench massaging your legs then drake said your top speed is 157kmh impresive i cant wait to see how strong you are!'' You'' yea but idont think i can stand anymore . But as you said that the pain vent away and you could feel your legs getting bigger and even more ripped the growth wasn't an strong as with the shake but it did strain your shorts and you couldn't tell at first but you were getting taller as well gaining several inches in height and even your abs grew bigger and more defined and almost formed a 10 pack You '' WOW hat enhancer shure works wonders dosent it ''Drake ''Yes it does but now tha you have recovered lets see how strong you are'' You ''Ok but witch weagt should i start with a bench press Start with 800kg for starters and I will add weight until we reach the limit You'' 800KG that is insane the biggest deadlift ever made was 500kg no way I can press 800!! Drakon'' dont underestimate yourself not only are you very muscular but you also are a wolf so your muscles are mutch stronger than an ordinary human.'' You ''Ok but I still dont think I am that strong '' Drakon ''trust me you are stronger than you think'' You then saw a conveniently bench press chair with a bar alredy staked with 2 400kg weights so you proceeded to go and lift it but to your surprise you hade no difficulty lifting it in fact it was as light as a feather Dragon said ''see you are very strong '' You ''Wow it like it is nothing now lets see how strong I really am'' after that you and Drake adding weights and testing how heavy until you found your breaking point at 57 THONS where you did 10 reps and finally gave in and sat back up on the bench sweating like crazy and sticking your thong out to help cool of because you were a wolf. your entier upper body ached and you could barely lift your arms but soon the pain went away and you grew your back wedded even more and your biceps grew huge and your pecks were so large you could barely see your abs but you could felt them and felt they were now a fully formed deeply cut 10 pack . Drake ''you can almost lift 60 Thons WOW your are even stronger than luke now hum oops... forget I said that'' You ''really how strong is he''     ''I can't tell you that But just strength alone isn't enough to defeat him in combat'' You ''Ok but tell me why am I feeling so tired all of a sudden'' Drake It is because of the supplement it makes you buff but makes you tired after the workout you should probably go to sleep it is getting late anyway '' you ''Ok see you tomorrow I had a great time today except fore the wolf transformation part put anyway thank you for the workout'' Drakon buy It was nice hope to see you tomorrow as well' you'' You can count on it'' as you leave the gym you wonder if you should ask will some questions or go to your room and sleep. Witch will you choose</span></div></div>",
            "created":1540765920,
            "id":2569871,
            "title":"Testing your new limits"
        },
        "111121112111":{
            "author_id":"honix",
            "author_name":"Honix",
            "choices":[
                "Lyle wonting to experiment a littel bit ",
                "Something entirely unexpected...."
            ],
            "content":"<div class=\"\"><div> <span>So seeing as it was getting late you said goodby to drake and Went to your room.          But as you started walking down the innumerable corridors you started getting lost as you had no idea how to navigate this strange place, As of yet. But luckly you picked up a fammiliar scent and after following it for a while you got to the loby and found that you wer tracking Elli and Akira hom wher curently playing a card game but wen you came in they immédiately turned ther attention to you the massive musclebound black wolfanhro and immediately bombarded you whith question like « wow look how big you are » and « dis you workout at the gym » or « can we feel your biceps pretty pleese! » and so on and so on . Having so mutch attension from so smaller that you made you feel good like the apha mâle and you loved it partially beacause of your wolf instincts. So not wanting to diplease your fans you knelt down to let them feel your huge  flexed biceps and you got a lot of impessed wows and cool from the tiny kids but soon they and you felt a menacing ora you knew all to well you saw luke comming from the opposite corridor and Elli and Akira god behind your massive body. But to your supprise lukes aura seemed less intimidating as if it was less effective now that you wher bigger but luke saw that and cranked up his aura until you coudint moove and said « you migth be big now but that can change and muscles alown wont be good enuff to scare me so dont start getting ideas Wolf » after that the went black to his chores and then Akira said « thanks for trying to protect us big Wolf brother » you thème thanked them for trying to cheer him up but you needed some rest after sutch a long day so you vent to your room to sleep (you could remember wher to go from the loby)                Onl’y to find.....</span></div></div>",
            "created":1547902920,
            "id":2604803,
            "title":"Go Sleeeeepppp"
        },
        "1111211122":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Try to force Lyle to reverse this",
                "Go and look for Luke"
            ],
            "content":"<div class=\"\"><div> <span>\"Uh, I guess I'll just have that drink over there.\"<br>\r\nGill looks at the menu and smiles.<br>\r\n\"Oh, the Belly-Filler? Coming right up!\"<br>\r\nGill proceeds to grab a number of bottles off the shelves underneath the counter, places a cup in front of you and begins to mix it up. He places a cover on top and begins shaking it, even performing a few tricks by throwing it up in the air, then catching it. Once he was finished, he places it in front of you again and removes the cover. In the cup looked like a sparkly transparent drink with bubbles on the side. You smell it a bit, getting that scent you might smell from soda. You look at Gill, who begins to return all the bottles he took.<br>\r\n\"Is this safe?\"<br>\r\n\"What do you mean by that?\"<br>\r\n\"It's not gonna turn me into another animal, will it?\"<br>\r\n\"No! Of course not!\"<br>\r\nYou're still a little suspicious at what this might do to you, but maybe Gill is being honest about it. You grab the cup and take a little sip, tasting the sweet bubbly liquid as you swallow.<br>\r\n\"Hey, it's not that bad...\"<br>\r\n\"Glad you like it!\"<br>\r\nYou gulp down the rest of it and return the empty cup back to Gill, who proceeds to clean it again. You return to Drake, who was sunbathing in one of the tanning chairs. You look at his face, which had a dreamy, contented look on his face. Feeling a little sleepy yourself, you get on one of the chairs and begin to dose off. You stomach gurgles a bit, and you give out a small burp. Massaging it, you fall asleep before you know it.<br>\r\n<br>\r\nYou're not quite sure what's happening, but you're looking for a golden pillow in the marshmallow kingdom, but you're being chased by a gigantic 3-headed hydra that spits streams of soda. As you run as fast as you can, dodging every licorice tree in front of you, the hydra continues to chase you, sending streams of soda that blow away any tree it hits. Your foot gets caught on an upturned root, and you fall flat on your face. The hydra catches you in one of it's clawed hands, and raises you up to it's middle head. It roars at you, then blasts soda into your face. You end up swallowing some, the rest sending you far away from it. You land in what appears to be a cauldron full of chocolate milk. Taking a sip, you're hooked to the flavor and begin drinking it all. But you're suddenly hit in the head by something. Turning around, you see the lollipop tribe, angry at you for falling into their village. They tie you up with a taffy rope and stuff your face with creme-filled donuts and strawberry ice cream. You try to break free or keep your mouth closed, but they manage to prevent either from happening. You look around, desperate to find something to help you. As if all your prayers are answered, the lollipop tribe disappears and Lyle approaches you.<br>\r\n\"Oh, Lyle! Thank goodness your here, could you please untie me?\" you say.<br>\r\n\"I could do that, or we could do the fun way.\"<br>\r\n\"The fun way?\"<br>\r\n\"Okay, the fun way it is!\"<br>\r\nA chalkboard appears above him, full of equations, letters, and numbers that you can't understand.<br>\r\n\"Solve this equation and the taffy will melt. Or, wait for the taffy to break from your own girth and risk explosion. Begin.\"<br>\r\n\"W-wait, what!?\"<br>\r\nThe equations begin moving around, and you feel the taffy getting tighter and tighter. You look down and realize that the taffy rope isn't getting smaller, you're getting bigger!<br>\r\n\"Gah! Uh, uh, w-what do I do!?\"<br>\r\n\"Just give me the resulting equation from simplifying the next two equations on the board.\"<br>\r\nThe symbols on the board all began to rearrange themselves into some shape, which vaguely seems familiar to you. Then, it comes to you. The shape is a 3-headed hydra! It roars, coming out of the board, ready to eat you.<br>\r\n<br>\r\n\"Uh...no...Go away...S-stop it...\"<br>\r\n\"Hey, Doggy-boy, wake up.\"<br>\r\n\"Lyle, that's not very nice.\"<br>\r\n\"Think I care?\"<br>\r\nYou groggily wake up, slowly opening your eyes and seeing a scaly face looking at you.<br>\r\n\"GAAAAAAHHH!!!\"<br>\r\n\"WAAAAAHHH!!!\"<br>\r\n\"WHAT IS WITH THE SCREAMING!?\"<br>\r\nYou pant, seeing Drake in the same state as you. You look to his side and see Lyle, covering his ears.<br>\r\n\"Oh, sorry. Bad dream. And a really strange one, too.\" you say.<br>\r\n\"Really? I though you screamed because of your new body.\" Lyle tells you.<br>\r\n\"What? Why would I...\"<br>\r\nYou look down and see a bulbous, blue-furred stomach sitting on top of you. You look at the rest of yourself and realize that you entire body blobbed out! Your face felt pudgy, your neck kept rubbing it's 2 chins together, your limbs were laced with fat, and your stomach must've been the size of a beach ball, or bigger!<br>\r\n\"What the heck did this to me!?\" you shout.<br>\r\n\"Hey, no screaming! Geez...\" Lyle said, covering his ears again.<br>\r\n\"Um, you don't mind us saving your clothes and giving you some temporary ones, right?\" Drake asked.<br>\r\nYou look at yourself once more, not seeing your shirt, of even any shred of it on the floor. You check your pants, since you can't see over your titanic gut, and instead feel some swim trunks covering your hips. It almost reached to your knees, so you're thankful that these are at least your size.<br>\r\n\"Where are my regular clothes?\" you ask.<br>\r\n\"Oh, I had Gill take it to your room. Don't worry, he's not the type to go through other people's stuff.\" Drake says.<br>\r\n\"Oh, good. Now, TURN ME BACK TO NORMAL!\" you shout.<br>\r\n\"If I stay anywhere near you, I'm gonna burst an ear drum...\" Lyle says.<br>\r\n\"Uh, you could go to my gym?\" Drake says.<br>\r\nYou merely growl at this remark and try to get up, having some difficulty with your belly in the way. Once you're on your feet, you look straight into Drake's eyes, who backs away a little bit.<br>\r\n\"That wasn't funny...\" you say.<br>\r\n\"Eh...S-sorry about that...\" he says, looking away.<br>\r\n<br>\r\nAfter you manage to calm down (again), the two of you are sitting on some tanning chairs, looking at Lyle as he begins pouring something into the pool. It was one of the bottles from the bar.<br>\r\n\"Okay, how about you try to look for Luke? He's the only one other than Wil that can actually control that guy.\"<br>\r\n\"And risk his evil-eye staring down at me? I dunno about that...\"<br>\r\n\"Come on, Lyle wasn't afraid of you as a blue wolf-man that can rip him to pieces. Think he's gonna be scared of an obese version of that?\"<br>\r\n\"You do have a point there.\"<br>\r\nYou scratch your stomach, feeling it push in as you place your hand on it. After some thinking, you've decided.</span></div></div>",
            "created":1336107600,
            "id":1329310,
            "title":"Belly-Filler"
        },
        "11112111222":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "It actually gets bigger...",
                "It doesn't shrink, but you can feel something happening."
            ],
            "content":"<div class=\"\"><div> <span>\"You know what, I'm just gonna go ahead and look for Luke.\"<br>\r\n<br>\r\nYou stand up and already start trudging towards the exit. You turn back to see Drake waving goodbye as he heads off to Gill's bar. You exit the swimming pool, looking at the hallway you were in. You rub your gut, hoping to get rid of it as soon as possible. \"Now, where could he be?\"<br>\r\n<br>\r\nYou walk off to a random direction, hoping that you'll find him soon. However, after several minutes of half-walking, half-waddling, you were already panting heavily, slightly leaning to the wall, beads of sweat rolling down your head.<br>\r\n<br>\r\n\"Hahh...At least, maybe this...Hooh, might shrink my gut, just a bit...\"<br>\r\n<br>\r\nIt may have taken a little longer than expected, but you soon feel the same chill crawling up your spine. From around the corner, you see Luke come out and suddenly turn to your direction. You can see his eyes widen in surprise as you quickly waddle your way up to him. The fearful feeling you're getting doesn't seem to be as strong as it normally is...<br>\r\n<br>\r\n\"L-Luke! Hah, I'm glad to find you!\"<br>\r\n<br>\r\n\"Uh...What exactly happened to your...physique?\"<br>\r\n<br>\r\n\"Hah...Well, I went to the pool...Had a drink...Fell asleep, and woke up like this.\"<br>\r\n<br>\r\nLuke just raises an eyebrow, folding his arms. \"Who else is in the pool?\"<br>\r\n<br>\r\n\"Drake and Lyle. Gill left to deposit some of my...Stuff to my room.\"<br>\r\n<br>\r\n\"Alright, follow me.\"<br>\r\n<br>\r\nLuke heads off to the direction you just came from, with you following behind. You can't really put your finger on it, but his aura of intimidation is definitely weaker than when you first met him. Maybe it's from working all day, and he's tired or something? Well whatever the case, you're just glad that you can stay closer to him without getting your senses all fussed up. When you two reach the pool, you enter to see Lyle drinking something at the bar, Drake asleep on a tanning chair, and Gill staring at the swimming pool's water. Luke immediately heads off to Lyle. Drake wakes up upon sensing Lyle, and Gill looks up from his spot, his interest taken away from the lapping water. You immediately head to an empty tanning chair to rest as Drake begins talking to you.<br>\r\n<br>\r\n\"So, you found him, huh? Are you glad that he's gonna help you out now?\" he asked.<br>\r\n<br>\r\n\"Well, a little bit...Still tired from all that walking though. This stomach is just...Pretty heavy...\"<br>\r\n<br>\r\nYou look up to see Lyle and Luke talking about something. Judging from their faces, Lyle doesn't seem to be taking his twin very seriously, and Luke is getting pretty irritated. Lyle returns to his drink, only for Luke to swat the glass out of his hand, the drink shattering on the ground. You widen your eyes in surprise of this. Gill just sits down with you and Drake, the dragon looking a little shocked himself.<br>\r\n<br>\r\n\"Looks like the fight is starting to get personal.\" Gill said in a strangely monotone voice.<br>\r\n<br>\r\n\"Uh, D-Drake, is there any bad blood between those two?\" you ask.<br>\r\n<br>\r\n\"Well, Lyle is always a psycho, and there's obvious bad blood between him and Gill. But those two, they're twin brothers...I know that they don't always get along, but...\"<br>\r\n<br>\r\nLyle stands up, shouting things at Luke, who shouts back. They exchange harsh words for a little while before you catch something interesting.<br>\r\n<br>\r\n\"Why should I be some servant to that werewolf anyway!? And you, the two of us are pokémon for crying out loud! Why are you allowing yourself to be some man-servant to...To that flea-ridden mutt!\"<br>\r\n<br>\r\nLuke suddenly pulls out a knife, pointing it directly at Lyle's face. It was at this point that you're frozen in fear. He's not actually gonna kill him, will he!?<br>\r\n<br>\r\n\"You...You take that insult back, right now. He may be as childish and simple-minded as a puppy, but he is still our master. He saved our damn lives for crying out loud! And you have the nerve to call him that!?\"<br>\r\n<br>\r\nLuke was breathing heavily as Lyle just stared at him, an angry frown on his face. You glance at Drake and Gill, who could only watch, frozen in fear, unable to move from their chairs. You look back at the knife in Luke's hand, the light glinting off of the blade. Lyle just shrugs his shoulders as he shakes his head, letting out a sigh with his eyes closed.<br>\r\n<br>\r\n\"...I'm sorry. I didn't mean to insult him like that...\"<br>\r\n<br>\r\nLuke lets out a large sigh as he returns the knife into his cloak. \"Alright...But, are you still going to try and help our guest over there?\"<br>\r\n<br>\r\nLyle looks at you before a smile creases his face. He starts chuckling, which leads to downright laughter.<br>\r\n<br>\r\n\"I'm sorry Luke, but I have received no orders to help our guest's weight problem. You, on the other hand, are free to give him as many of my special serums to your heart's content. You may be the only thing I'm afraid of, but that doesn't mean I will never fight back.\"<br>\r\n<br>\r\nLyle, wearing his usual smirk, walks away from his twin brother. As he passes by you, he stops for a moment without looking at you. \"Beware the wolf, dear guest. Beware the wolf.\"<br>\r\n<br>\r\nYou ponder that message as he leaves the area. You look back at Luke, who was once again holding his knife, watching the light shining off of the blade in various angles. You look back at Gill and Drake, seeing them already getting up and walking over to Luke. You do so as well. However, one thing you notice is that Luke's intimidating feeling is completely gone.<br>\r\n<br>\r\n\"H-hey. What was all that about?\" you ask.<br>\r\n<br>\r\n\"...It's...Personal issues. You need not concern yourself with it.\" Luke says before pocketing his knife a second time.<br>\r\n<br>\r\n\"I suggest not questioning him further. Remember what he's got under his coat.\" Drake said.<br>\r\n<br>\r\nYou nod as Luke gets behind the bar and takes out several bottles. \"These things are filled with Lyle's experimental serums, and Gill knows only a few of the mixes and their corresponding effects. We'll just have to make something up and hope for the best.\"<br>\r\n<br>\r\nThe four of you set to work, looking at the different liquids, you smelling them in an attempt to at least identify their ingredients. It took a little while, but you all put together something inside the shaker. Gill begins shaking it in his hands before setting it in front of you. \"Drink's up.\"<br>\r\n<br>\r\nYou look at the bubbly blueish liquid. Smelling it gave you a mental picture of several fruits, mostly berries. You grab the cup and put it up to your lips. \"If something happens to me, I'm giving this entire place a bad review, along with my complaint.\"<br>\r\n<br>\r\nYou down the drink as fast as you can, tasting the tangy fruit flavor of it. You just sit on the stool, watching your stomach, waiting for it to shrink back down.</span></div></div>",
            "created":1360990800,
            "id":1533234,
            "title":"Twin Face-Off"
        },
        "111121112221":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Chat with Drake and Gill while waiting.",
                "Someone comes along..."
            ],
            "content":"<div class=\"\"><div> <span>Your stomach gurgles a little bit as a warmth begins to build up inside of it. You, along with the others, are surprised to see it swell visibly, growing larger and rounder. You stand up from your seat, taking a few steps back as your stomach swells bigger and bigger. Not only that, but you can feel the warmth spreading to the rest of your body, seeing it swell and grow outwards too.<br>\r\n<br>\r\n\"...Well, this is unexpected.\" Gill said.<br>\r\n<br>\r\nYou can feel your entire body expanding, your limbs rounding out, your waist stretching the swimming trunks you're wearing, and your cheeks filling up like balloons. You look at the others with a pleading look, and some are already trying to mix another drink to counteract this one. Your cheeks are getting in the way of your mouth, preventing you from speaking. Though it doesn't stop you from whimpering and grunting. Your legs soon give in, collapsing underneath you. You fall onto your back, only able to see the ceiling and the top half of your growing stomach.<br>\r\n<br>\r\n\"Don't worry! We've got this next one ready.\" Dracus said.<br>\r\n<br>\r\nYou can see the blue and red dragon enter your view with a cup in one hand. You do your best to open your maw as he slowly pours the concoction into your mouth. You swallow, tasting a lemony sweetness as you down the entire cup. Your stomach and entire body begins to slow its growth, until it comes to a full stop. You and everyone else sigh in relief now that this problem's solved. But a new one arises when you feel a pulling sensation. Like some force has grabbed you by the arms and legs, and is trying to tear you into two.<br>\r\n<br>\r\n\"Hey, is he getting taller?\" you hear Gill say.<br>\r\n<br>\r\nSoon enough, you actually do feel a little taller. Your stomach seems to be shrinking as well, along with your limbs. You wait a little until you can actually sit up again, but what you see surprises you. As you sit up, you see that everyone is looking <i>up</i> at you! You look down at yourself and feel that the entire cabin has shrunk. It seems that you really are growing taller! But, your stomach is growing smaller to <i>you</i>. Your stomach must be unaffected by this new growth, so it looks like it's shrinking from your perspective!<br>\r\n<br>\r\n\"Ugh, this guy just keeps getting bigger, one way or another...\" Luke said, shaking his head.<br>\r\n<br>\r\nAs you continue growing, you soon outgrow the bar, and even some coconut trees too! You feel the pulling sensation come to a stop, and you look around. The employees are the size of action figures to you, and you're the largest thing in the pool area, including the pool itself! And this is just when you're sitting too. You're still very fat, hovering just below the 'obese' threshold, but you're at least happy with that. Drake uses his wings to fly up to your face and hovers there a little.<br>\r\n<br>\r\n\"Hey, you alright there buddy?\" he asks.<br>\r\n<br>\r\n\"Y-yeah, I'm fine. A little surprised, but fine...\"<br>\r\n<br>\r\n\"...Well, I guess everything worked out in the end then!\" Gill said, manning the bar again.<br>\r\n<br>\r\nYou sigh at Gill's happy-go-lucky attitude. Now that you're a gigantic fat wolf, you at least won't be afraid of a number of things. But...<br>\r\n<br>\r\n\"How am I supposed to get back to my room!?\" you say.<br>\r\n<br>\r\n\"Don't worry, we'll think of something somehow!\" Drake said, patting your nose gently.<br>\r\n<br>\r\nYou snort at him, pushing him away with the blast of air. You look down at Luke, who seems to be staring at empty space for some reason.<br>\r\n<br>\r\n\"Luke?\" you say.<br>\r\n<br>\r\n\"Hm? Oh, don't worry about me, it's nothing. I'll report this to Will. Just...Enjoy a swim or...Something.\"<br>\r\n<br>\r\nWith that, Luke leaves the area. You sigh as you extend an arm over to the water's edge and dip a couple fingers in. It's cool and inviting, and you splash a little of it around with your fingers...</span></div></div>",
            "created":1361509200,
            "id":1537732,
            "title":"Not The Only Thing..."
        },
        "1111211122211":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "It was Wil. What was he doing here?",
                "It was Lyle. What's that in his hand?"
            ],
            "content":"<div class=\"\"><div> <span>\"So...Uh...You two seem to be alright with all of this.\" you say.<br>\r\n<br>\r\nGill just seems to be just perfectly happy, smiling up at you whenever his face peers out from the bar. Drake just shrugs his shoulders at you as he settles at the edge of the pool, his legs dipping into the water.<br>\r\n<br>\r\n\"We're just...Kinda used to this, you know. Wil is the kind of person who...Well, wants these things to happen.\"<br>\r\n<br>\r\n\"He wants this all to happen?\" you ask.<br>\r\n<br>\r\n\"No...Well, in a way. He's just crazy that way. You're not exactly the first toy to get played with.\" Gill said.<br>\r\n<br>\r\nYou suddenly look at Gill with a shocked expression. What did he mean you weren't the first toy!? Have they...Have they done this before!? H-how!? Did they set up other cabins in other places in the past? But that doesn't make sense. They were young. If they've done this in the past...How old are they, really!?<br>\r\n<br>\r\n\"Hey...You...Don't think we're freaks, do you?\" Drake asked.<br>\r\n<br>\r\nYou look back to him, and he was looking back up at you with emotional eyes. He looked...Hurt. Was he...Perhaps he was emotionally scarred by the earlier 'toys'. You try and give a genuine smile, shaking your head. These kids are obviously not just 'kids' at all. But it looked like they've gone through things that would scar anyone, of any age. At least, that's what you guess. You move your plump fingers next to Drake and give him a soft push.<br>\r\n<br>\r\n\"Hey, you guys are different and eccentric. But 'freak' is just something jealous people use to call you. If they choose to push you away, it's their loss. They're missing out on awesome friends like you two.\" you say.<br>\r\n<br>\r\nDrake just smiles as he wraps an arm around one of your fingers. Gill began whistling a tune to himself as he continued to work in the bar, hidden by the roof of the small building. You recognize the tune as the opening theme song of that anime called Digimon. It was the third season, Digimon Tamers. You remember watching that show a few years back, when it was still being aired. You just closed your eyes as you began reminiscing to Gill's whistling. You really enjoyed that show, especially the characters in it! You definitely remember that one red dinosaur guy, and how he...You suddenly open your eyes. Gill just...He reminded you greatly of that character. You look back down at the bar and see Gill exit, walking up to you. He looks up and smiles all goofy, waving his arms at you. You just smile and nod to him. He really does look like that character. What was his name again? Oh well, maybe he knows.<br>\r\n<br>\r\n\"You're a fan of that Digimon show, right?\" you ask.<br>\r\n<br>\r\n\"Yeah! You noticed it? The third season was my favorite. The story, the action, the ending...Man, I still tear up every time I re-watch the ending.\" Gill said.<br>\r\n<br>\r\n\"Yeah, it was pretty good. Say, can you tell me who that red dinosaur character was? I forgot his name.\"<br>\r\n<br>\r\n\"Oh, it was Guil-\"<br>\r\n<br>\r\nDrake suddenly rushed in and clamped a hand over his mouth. He began whispering something to Gill, something you can't hear. You just look at them suspiciously as Drake relinquishes his hand.<br>\r\n<br>\r\n\"S-sorry...Uh, we're not exactly...Supposed to share info with guests.\" Drake said.<br>\r\n<br>\r\n\"What!? That info just happens to be about a several years-old TV show! What could be wrong with that?\" you ask.<br>\r\n<br>\r\nBefore they could say something, someone suddenly enters the pool area...</span></div></div>",
            "created":1375629420,
            "id":1640036,
            "title":"Sitting And Chatting"
        },
        "1111211122212":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Continue from my point of view.",
                "Back to the other characters in this story."
            ],
            "content":"<div class=\"\"><div> <span>Until yours truly a shy yet lonely young yellow Anime robot cat while wearing a white t-shirt and red and white vertically striped swimming shorts happened to come rumbling along while minding my own business, as I noticed a blue gigantic fat wolf sitting there splashing a little water with his fingers while some of the staff were with him.<br>\r\n<br>\r\nWhile I was just standing far away from the pool I decided to take off my t-shirt which revealed my gigantic completely fat and corpulent self as I heavily waddled towards the nearest tanning chair as I laid back after putting my shades on while letting out a content sigh.<br>\r\n<br>\r\n\"Now this is the life if you know what I mean.\" I said.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1439169240,
            "id":2019141,
            "title":"Someone comes along..."
        },
        "1113":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Go back to your room to meet someone else",
                "Look around for any other workers",
                "You bump into Luke..."
            ],
            "content":"<div class=\"\"><div> <span>You order the Reptile special, which Gill immediately began cooking. You take a seat as you wait for the food to cook. The smells wafting from the stoves are just heavenly, you can't help but continue to sniff the air. Once Gill has finished the cooking, you see Wil walk into the cafeteria, eyes closed and nose in the air.<br>\r\n<br>\r\n\"Mmm, is that the smell of meat cooking on a stove?\" he said, still walking with his eyes closed. You call him over, which caught his attention. You can tell, since he finally opened his eyes just as he was about to bump on a chair. \"Oh, you're here!\" he said, grabbing a chair next to me. \"Well, dinner is served, even though it's not even dinner time yet!\" Gill said, carrying the Reptile special over to the table. I can't help but stare at it, it just looked so good! I glanced at Wil and saw the look of a starving animal on his face. Better eat this before he eats it for me!<br>\r\n<br>\r\nThe first bite was just so...so...Ahh! it's too good for words! You begin eating as much of it as you can, glancing at the two every once in a while. It's strange though, they look like they're enjoying watching you stuff your face silly. your skin starts to itch a little bit, but you just ignore it. What's really weird is that every time you take a bite, your skin itches even worse. Right after you finish the whole thing, you began scratching yourself like crazy, not even noticing the two watching you with such a gleeful look in their eyes. Once your itchiness finally subside, you look at your skin to see it growing green scales! Your body is growing green scales all over, and you feel something on your backside too! \"What, what the heck was in that dish!?\" You shout, watching claws grow out of your finger tips. \"Oops, did I forget to tell you the side effect?\" Gill said, staring happily at you. \"The menu specials decide what type of animal anthro you'll transform into.\" Wil said, grabbing the plate and giving it a good lick and swallowing.<br>\r\n<br>\r\nAs the transformation continues, a scaly tail bursts out of your pants, your hair falls off, and your face extends into a snout. \"Ugh,what...What have you done to me...?\" you say, grabbing the table for support. \"How about I just show you instead?\" Wil said, giving you the now clean plate. You stare at it in horror, as a crocodile's face stares back at you, protruding teeth and everything! You drop the plate, unable to accept what happened. \"You know, plate smashing really isn't part of the stay, but I guess you can do that if you really want to.\" Gil said, shrugging his shoulders.<br>\r\n<br>\r\n\"Change me back...\" was all you can say. \"What?\" Wil says, looking confused. \"I said, change me back, or I'll snap your neck into two!\" you demand, baring your sharp teeth at them, hoping it would scare them. But Wil merely raised his finger at your face. \"Tsk, tsk, tsk, no can do. You'll have to wait until the end of your stay.\" he says before leaving. \"Well, you'd better go back to your room now. Wil may not look like it, but he can get pretty vicious sometimes. Believe me, I know.\" Gil said, rolling up his left sleeve showing a blue bandanna tied to his arm. He took off his bandanna to reveal an abnormally large scar, which look a bit like scratch marks of a savage animal. An image comes to your mind of a huge monster almost ripping his arm off. You suddenly feel sorry for him. \"Uh,yeah...I guess...\"<br>\r\n<br>\r\nYou were just about to leave until Gill called out to you. \"There's something else I wanna say to you. Stay away from Wil when he's in a bad mood. And avoid Luke if you can, he's practically Wil's right-hand man!\" You remember his words as you exit the cafeteria. But now, what will you do now that you're half-crocodile?</span></div></div>",
            "created":1315198800,
            "id":1181594,
            "title":"Scaly..."
        },
        "11131":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Blue",
                "White"
            ],
            "content":"<div class=\"\"><div> <span>You slowly walk back to the room, nervously looking around. You're not the type of person who likes to stand out so much, especially in a negative sense. You walk around, stop, look, and continue walking. \"Hopefully, I'll get back to my room without anyone seeing me like this. They'll surely think I'm a monster now that I'm half-crocodile.\" You say to yourself, trying to calm yourself down.<br>\r\n<br>\r\nThere's your room! At least, there's the hallway leading to your room. But, it's across the lobby. Wil is there, playing chess by himself...With some really weird looking pieces. A T-rex, a blue dog, a werewolf, and a crocodile...Wait, what is he doing exactly? You look around the lobby to make sure no one else is around before approaching Wil. \"Hey, what are you doing?\" you ask. Wil looks up from the board and sees you. He starts to giggle a bit and moves the crocodile piece in front of the werewolf piece. \"I said what are you doing?\" He laughs a bit louder this time before looking at you again. \"I'm setting the board to match the playing field.\" What? You wonder what he meant by that. If he moved the pieces around when he saw you, does that mean that the crocodile piece represents you? If so, that means he's the werewolf piece. \"Who are the other pieces?\" You think out loud. \"The T-rex is Gill, and the blue dog is Luke.\" he says, still smiling. He moves a large white bird piece onto the board on a nearby square. \"And who's that?\" \"Someone who looks like my faithful dog. I believe he has claimed your territory his own.\" You tilt your head a bit to the side, trying to understand what he meant by that. \"What if the squares represent a room here?\" Wil says, seeing your confusion. If he's saying what you think he's saying, then someone must be in your room right now! You widen your eyes in realization of this fact. You run back to your room, no longer caring if anyone else saw you like that.<br>\r\n<br>\r\nAs you reach your room, you see water seeping out from under the door. You open the door and step inside, only to see the entire room is flooded with water! On the soggy bed lay a boy that looks just like Luke, only wearing a white shirt, pants and glasses. \"Well well well, here comes the guy's latest play thing.\" he says, sitting up on the water-soaked covers. You feel anger filling every scaly inch of your being. Who the heck is this guy!? And what has he done to your room!? \"You know, while you were gone, I made the place more suited to your physical needs. No need to thank me.\" he said, standing up to bow down to you. \"What the hell have you done to my room!?\" You shout at him. He seems to be surprised at your reaction. \"What? You mean you don't like it, Mr. crocodile-man?\" \"No! I don't!\" You grab him by the shirt and open your mouth wide, ready to snap it shut with his head inside. \"Now now, no need to go wild on me. I just thought you would feel better if your room supported the needs of a crocodilian guest.\" Now that he mentions it, you do kinda feel more at home with a wet floor. And you feel calmer just standing there with such a humid atmosphere. You decide to let the guy go and back off a few steps. \"S-sorry...\" you say, a bit embarrassed at almost going feral a moment ago. \"There now, wasn't that hard to be civilized, now was it?\"<br>\r\n<br>\r\nAs the Luke look-alike sits back down on the bed, he starts laughing. \"Heheheh, sorry about that. I just can't believe that my gracious 'leader' would focus more on mind alterations than on physical changes.\" Is he talking about when you turned into a crocodile from the food back in the cafeteria? \"You know how I turned into this?\" you ask. \"Of course I do! And, I know a lot more about our little group and our plans and goals. If you'd like, I'll tell you more about it.\" You nod your head. \"Alright then, but you have to do something for me first.\" He takes out two test tubes from his pockets, filled with differently colored liquids. \"These two potions I made have varying effects. I'd like you to test one of these out for me.\" One test tube was blue in color, and the other was white. \"Which would you choose, blue or white?\"</span></div></div>",
            "created":1317186000,
            "id":1196562,
            "title":"Who does this guy think he is?"
        },
        "111311":{
            "author_id":"apollotalon",
            "author_name":"Jordan",
            "choices":[
                "It works REEEEEEEEAALY WELL!",
                "Nothing happens... yet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You: Umm... If you don't Mind me asking what does the blue one do?<br>\r\nLuke look-alike: Oh. This one increases Physique and muscularity.<br>\r\n<br>\r\nYou look at it.<br>\r\nThen you take it and drink the whole thing.</span></div></span></div>",
            "created":1317186000,
            "id":1196876,
            "title":"Blue (Muscle Growth)"
        },
        "1113111":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Luke is being cooperative with you.",
                "The greeters suddenly burst in!"
            ],
            "content":"<div class=\"\"><div> <span>It kinda tastes like blueberries. As the last drop of the potion falls down your throat, you give back the empty test tube to the Luke look-alike, who puts both tubes back in his pockets. He begins adjusting his glasses and watches you carefully. That's when you feel it...Raw power building up inside of you. You look at yourself in the water's reflection and see yourself...still the same as before. \"Hey, what gives?\" you say, looking at the guy. \"Just wait a moment. Muscles take time to reconstruct themselves into a larger mass after all.\" You look back at your reflection, only to see your arms a little...wider? You look at your arms directly and see biceps slowly puffing up under your scales, and it's getting really big too! The sleeves of your shirt are already getting a bit tight, and your legs are kinda hurting too. You look down to see them beginning to strain your pants as well. Must be your leg muscles growing too! As the changes continue, you can't help but flex your right arm, shredding the sleeve up to the shoulder. Not only that, but you're still growing! You turn around to see your tail...It's getting longer and thicker, but you guess a tail is just one big muscle anyway. \"Get ready!\" he said. You look at him with a confused look. You suddenly feel a burst of power inside you. Like an instant, Your clothes burst to pieces, no longer able to contain all that reptilian strength. You look at your body, flexing an arm to see just how big it was. Luke's look-alike is still watching you carefully. As you look at your full-body reflection in the water, you marvel at how big you've grown! You could barely fit through the doorway now! And...You're also naked...You immediately turn away from the Luke look-alike, even though there really isn't anything visible, thanks to the scales acting as a secondary layer of skin.<br>\r\n<br>\r\n\"Now now, there's no need to be so modest.\" \"What do you mean there's no need? My clothes are all too small to fit me now! How can I not be modest, especially with you watching me the whole time!\" \"Heheh,I'm not into that sort of filth, if that's what you're thinking.\" \"Oh yeah, you still haven't told me your name.\" \"I'll tell you once you turn around and face me.\" You slowly turn to the side, then face him completely, only to be blinded by a bright flash of light. Hey, he just took a picture of you with a camera he was hiding in his back pocket! \"Heheheh, I'll put this photo in the 'success' file.\" \"Hey! Why the heck did you just take a photo of me!?\" \"I always take a photo of my experiments, so I can keep track of it all.\" He stands up and puts the camera away. He suddenly changes to a more serious look, which eerily looks like Luke's face. \"My name is Lyle, the lifeguard. At least, that's the job Wil gave me when we built this cabin. Believe me when I say that Wil is someone who you must never mess with. He's a wild monster underneath his kind exterior. Believe me, I know. But I'm sure you've met someone who knows that side of him even better than me.\" You remember seeing the huge scars on Gill's arm. \"But, what does he even want? And why do all this to me?\" \"I believe I can't tell you that. He's always watching us, thinking ahead of us by at least 2 or 3 steps.\" You remember the chess board Wil was playing with back in the lobby. \"Anyway, I'm also Luke's twin brother, which is why we look so much alike. I think he has the most information about Wil than the rest. You'll want to talk to him, but you have to watch what you say, or you'll regret it.\"<br>\r\n<br>\r\nYou gulp as Lyle finally exits your room. You start thinking about what to do next. If Luke is the one who knows the most here, then you'd better call him. You pick up the phone next to your bed and press the button there (there's only one, and it's labeled 'room service'). After about a minute, there's a knock on the door. \"Come in!\" Luke enters the room, pausing when he saw it flooded with water. When he sees you, he widens his eyes in surprise to see you as a huge, muscled, anthro crocodile. \"Well, it looks like you ate at Gill's cafeteria, and you must've met my twin.\" You nod, feeling a bit nervous and embarrassed. \"So, what is you need sir?\" \"Um, I just have some questions to ask.\" \"Very well then, but first...\" Luke starts rummaging around under his cloak, looking for something. At least, that's what you think, since you don't really see what he's doing under there. He pulls out a brown tattered loincloth and shows it to you. \"You might wanna wear this first.\" \"Uh, don't you have anything else?\" \"It's the only one I have with an adjustable size, sir. And I'm sure you like showing off your muscles anyway, the way you're currently...dressed.\" \"My clothes burst when I grew, okay!\" you shout, taking the loincloth and strapping it on your body.<br>\r\n<br>\r\nSomething's odd here. Why do you feel fine with Luke in front of you? Shouldn't you be having a hard time breathing right now?</span></div></div>",
            "created":1317358800,
            "id":1197903,
            "title":"You Got Big!"
        },
        "11131111":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Fall into deep slumber"
            ],
            "content":"<div class=\"\"><div> <span>You sit down on the bed, which creaks to the weight of your new muscles. Luke closes the door behind him and walks in front of you before folding his arms and looking at the wet floor. \"Alright, what is it you need to ask.\" \"Right, I need to know more about Wil, and what his plans are.\" You feel a cold chill crawl up your spine as Luke stares at you directly in the eye. He's not even scared at your new form! But, you still don't feel the intense cold feeling when he's nearby. \"I'm afraid I can't tell you that. Anything else?\" \"Uh...Alright, why is it I feel...well, kinda fine right now, even though you're right in front of me?\" Luke closes his eyes, as if to say he's thinking of a proper response to tell you. \"I'm not currently exposing my strength at full capacity right now. You could say that the feeling you keep experiencing is my true power, leaking out of me. Right now, I'm bottling up as much of it as I can, which is why you're not feeling anything right now.\" His true power? It was leaking out? What does he mean by that? Before you can give a reply, he gives you a quick glance, instantly silencing you. \"You don't want to know what my true power is. Not until you've stayed here for at least a day...That's when Wil wants to show you more of what we can do.\"<br>\r\n<br>\r\nYou're completely speechless right now. Luke is supposedly \"powerful\" ? So much so that he's trying his best not to radiate it so much? And these kids...or whatever they are, are able to do more than turn your body into this? Who the heck are they? \"I...I want to know who you all are. And what do you want!?\" You stand up, rising up much higher than Luke, but he's completely unfazed. \"I told you...I can't tell you that.\" \"Well at least tell me who YOU are!\" \"Hmph...You need to know that I've handled creatures far stronger than you.\" You suddenly feel the same intense feeling from Luke as before, but...it's different. You could barely move now! \"I'll just let you feel some of my true power.\" Your body starts to feel heavy...Very heavy! You fall on your knees in front of Luke, who's just watching you, like a statue. Your body continues to get heavier, falling flat on the floor, seeing something under his cloak - blue fur...You see something that resembles blue fur! Your body feels light again. You stand up, panting, looking at Luke. He's still staring at you with his unblinking eyes. This time, you notice a white spike protruding right through his chest. \"Wh-what the...blue fur...a spike...\" \"Darn, so you noticed.\" The spike immediately retracted into his cloak, as if it was never there before. \"This is all the information I can give you. Now, you must be feeling tired, dear guest. I believe you've had a rough day today.\" Your body feels tired from experiencing Luke's aura. You fall backward to your bed. You hear the door open, and Luke's voice ahead of you. \"My piece is the blue dog for a reason. My body was created with the form of the Aura Pokemon. My true name...You will learn it another time.\" The door closes. Luke must've left the room. Your body feels so tired from Luke's aura. So...tired...</span></div></div>",
            "created":1317790800,
            "id":1201187,
            "title":"This is why he's the blue dog..."
        },
        "111311111":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "try asking them",
                "don't ask anything"
            ],
            "content":"<div class=\"\"><div> <span>Everything is so blurry...So many distorted images...You can't seem to make anything out...So...Tired...Is this a dream? Maybe...Or, have you been dreaming and now you're awake? You can't really tell...\"Hey!\" So tired, can't concentrate...\"Wake up!\" What is that? So noisy...\"Hey!!!\"<br>\r\n<br>\r\nYou sit up right on your bed, feeling like someone pulled you out of a trance. You look beside you to see the two younger children working here. \"Y-you two...Who are you two?\" \"It's us, the ones who you met back in the lobby, remember?\" The blonde girl said. You think back to yesterday...Yes, they're the ones who you saw open the door and greeted you into this place. \"Can...Can I ask what your names are?\" \"I'm Akira, and this is Elly.\" the boy said. \"Akira...Elly...What...What happened to me?\" \"Well, we saw Luke tell Wil something, you see.\" Elly said. \"Then, Wil told us to come to your room and wake you up.\" You start feeling better now, knowing that Wil at least's cares enough to get someone to check up on you. You look at yourself again. You're still a muscled croc anthro, and you're still wearing nothing but a loincloth. You notice the two kids staring at your body, curiosity in their eyes. \"Why are you two looking at me like that?\" \"Well...What happened to you?\" Akira asked. \"Last time we saw you, you were less muscled...and human!\" Elly said, poking your chest. \"It's...it's a long story. I really don't wanna go into detail.\" Elly continues to poke your chiseled torso, then beckons Akira to do the same. \"Hey Akira! You've gotta check this out! His muscles are so big!\" \"Really? Well make some space already!\" Akira starts squeezing your biceps while Elly is massaging your legs. \"Um, guys...\" You feel really awkward with the two enjoying your muscles like it's a once-in-a-lifetime chance for them. Akira is now pressing his hands on your abs, with Elly checking out your shoulder length. \"Guys, please, stop.\" They don't seem to hear you, as they continue to grab your biceps like crazy. \"Hey!!!\" you finally shout, grabbing the two by their shirt collars. You hold them up in the air as they struggle to get free. \"Okay, I'm sorry I have to be rough with you two, but I need some personal space here for now.\" You set them down on the wet floor. They look at each other and bow down to you. \"We're sorry!\" they say in unison. You're actually a bit surprised by this, but you forgive them. You sit back down on your bed and try to remember all the events that happened here. \"What's wrong?\" Elly asks. \"Nothing, just thinking.\"<br>\r\n<br>\r\n\"You know, if you have any questions, then feel free to ask us.\" Akira says. An idea instantly pops up in your head. How about you try asking THEM what you need to know! It might be a little risky though, but it may be worth a try.</span></div></div>",
            "created":1322888400,
            "id":1233805,
            "title":"Awakening To A New Day"
        },
        "1113111111":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "catch up",
                "go somewhere"
            ],
            "content":"<div class=\"\"><div> <span>You look at the two, who both seem to be concerned a bit. You think that they might know at least a little bit about Wil and his crazed designs. \"Hey, uh...I actually do have some questions to ask.\" you say. The two lean forward to listen. \"...Can you two tell me anything about Wil?\" The two look at each other and shake their heads to you. \"Sorry, we can't.\" Akira said. \"He'll get mad if he finds out.\" Elly said. It was worth a try, but you decide to keep asking. \"Look, I really think that Wil is up to no good, and Luke is helping him! Could you please tell me something about it?\" The two think hard for a moment before Akira speaks up. \"Wolfy has control over us, and we must obey him. To go against him is to go against all of us, even if we don't want to.\" \"The others might know what Wil is planning, but they won't speak about the matter, like us.\" Elly said. You think hard for another question you could possibly ask them. Then, a memory of Luke's blue fur and chest spike suddenly pops into your head. \"Luke had blue fur and a spike on his chest...What is he?\" \"...He's the Aura Pokemon.\" they say in unison. \"Yeah, I know! he told me that before he knocked me out cold! He also said that he'll tell me his true name soon! Does that mean anything?\" The two greeters stay quiet for what seemed like a very long time. Eventually, Elly said something. \"Have you played Pokemon Diamond or Pearl yet?\" \"No, the copies are usually sold out by the time I visit the video game stores.\" \"His body was modeled after a certain Pokemon there.\" Akira said. \"Okay, so he's a Pokemon. What about you two?\"<br>\r\n<br>\r\nThe door suddenly bursts open, revealing Gill at the door. \"Heeey!\" \"Big brother!\" the two said,hugging Gill. \"What's up guys? Who's this one?\" Gill stares at you in the eye for a few seconds before Akira shouts, \"It's the guest, silly!\" \"Really!? Wow! You've been working out?\" You shake your head, not quite sure whether he was messing with you, or he really thought that you've been exercising. \"Anyway, Drake asked me to come look for you two.\" Gill told the two greeters. You think for a moment. Drake? Who was he? Another employee here? You watch as the two 6-year-olds leave the room, leaving just you and Gill in your room. \"So tell me, how'd you get so big so fast?\" \"Oh, well, I met Lyle.\" Gill suddenly loses his smile, turning into an angry frown. \"Lyle? Did that jerk do anything bad to you?\" \"He flooded my room.\" you say, as if the news was years old. \"Hmph. That guy gets on everyone's nerves. Only Luke is the guy that can keep him on a leash that won't break.\" he says, anger definitely in his voice. He sighs and looks at you with a smile again. \"So, wanna catch up on anything, or should I take you somewhere?\"</span></div></div>",
            "created":1330318800,
            "id":1285251,
            "title":"Pressing For Information"
        },
        "11131111111":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Stay here and organize your thoughts.",
                "Look around the place a little more."
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I don't really feel like going anywhere right now. Let's just talk for now.\" \"Okay then!\" Gill eagerly sits next to you on your bed. Now may be your chance to get some answers! \"So...What should we talk about?\" you ask. \"Let's just start with what happened after you left the cafeteria...\"<br>\r\n<br>\r\nAfter a long explanation of meeting Will, Lyle making you drink that muscle growth serum, and Luke coming in and knocking you out, you finish with Gill staring at you. \"Wow, they must really love messing with you.\" he says. \"Yeah, seems like it. Anyway, I have a few questions right now.\" you say. \"Alright, ask me anything!\" \"What is Luke, really?\" \"Oh, he's really a lucario, the aura pokemon. Will had him take on the form of a human as long as we're here.\" That answer just brought up more questions. Does Will have the power to change others' forms? And what did he mean by 'as long as we're here'? \"Okay...Um, can you tell me more about Lyle then?\" \"...Hold your hands up please.\" \"Huh?\" \"I said hold your hands up.\"<br>\r\n<br>\r\nGill stands up and starts stretching his arms. You hold up your meaty hands curiously, and he begins punching them! They barely felt anything to you, but you can feel him pushing you back. \"That stupid jerk! All he cares about is himself, and his stupid experiments! He never listens to anyone! The only person he's ever afraid of is Lucario! Why won't he just die! That pathetic, stupid, snobby, horrible excuse of a pokemon deserves to bite the dust! Why won't Wolfy just kill him!!!\" Gill continues to punch your hands, each blow stronger and stronger than the last one. Eventually, you had to stand up and brace yourself to keep from falling back. The strongest blow Gill did sent you falling backwards onto your bed. You were genuinely surprised by how strong his lithe body is! As you lay on your bed, you nervously watch Gill panting, arm still outstretched from his punch. \"Are...Are you alright?\" \"...I, I'm fine. Just...Just needed to blow off some steam...I need to go.\"<br>\r\n<br>\r\nGill leaves the room, leaving you still stunned from what you've just witnessed. But after calming down a bit, you realized that he must've said more than he should have, without realizing it! \"So, Lyle never listens to anyone, not even Will. Gill must really have a deep grudge against him, wanting him to die. And, did he just call him a pokemon? And who's Wolfy? Man, what did I get myself into...\"</span></div></div>",
            "created":1345179600,
            "id":1406927,
            "title":"Catching Up"
        },
        "111311111112":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "You press him for more information.",
                "You decide to let it slide and enjoy this room...For now."
            ],
            "content":"<div class=\"\"><div> <span>You decide that you need to gather more information. Getting out of your room, you decide to head to the lobby for now. When you reach it, no one is there. It was empty.<br>\r\n<br>\r\n\"Huh...Wil and Luke aren't here...\"<br>\r\n<br>\r\nYou see a board sitting there on the front desk, you approach to see that it's the same board you saw Wil using before. The pieces aren't there anymore, so Wil or someone else must keep it with them. Not seeing any reason to stay, you decide to head out elsewhere. Walking down a random hallway, you search the area. It takes you quite a while, but you soon reach a set of double doors with the sign 'pool' above it. You push it open and are astonished to see a huge resort-like room inside the cabin!<br>\r\n<br>\r\n\"Wow...Just how big is this place?\" you say to yourself.<br>\r\n<br>\r\n\"Meh, it's pretty big...Or pretty small. It all depends on what Wil wants it to be.\"<br>\r\n<br>\r\nYou turn to see Lyle in the corner of the pool, just standing there in the water, watching you.<br>\r\n<br>\r\n\"Great. What do you want?\" you say.<br>\r\n<br>\r\n\"Aww, is that how you thank the one who gave you your wonderful physical strength?\" he said, a mocking tone in his voice.<br>\r\n<br>\r\n\"...\"<br>\r\n<br>\r\nYou just ignore him and approach the bar that was just a bit away from the pool. You look at the menu, seeing quite a number of things similar to what you saw back in the cafeteria.<br>\r\n<br>\r\n\"Great. Only thing missing is if Gill is the bartender...\"<br>\r\n<br>\r\n\"Anyone say my name?\"<br>\r\n<br>\r\nYou turn to the corner behind the counter, and you see Gill walking out into the open, a blue rag cleaning a mug. At this point, you were a little surprised.<br>\r\n<br>\r\n\"Gill? But, shouldn't you be in the cafeteria? I thought you were the chef there!\" you say.<br>\r\n<br>\r\n\"I am! But I also have to work as the bartender here too. Anyway, want something to drink? Dragon's Firepower? Tiger's Blood? How about the Belly-Filler? Whichever takes your fancy, I'll make it for you.\" Gill said with a smile.<br>\r\n<br>\r\n\"Careful, the drinks are made from my special serums!\" Lyle shouts from the pool.<br>\r\n<br>\r\nYou wanted to ignore that, but since you've already been changed twice now, you already know not to trust anything these kids give you.<br>\r\n<br>\r\n\"Look, I just wanted to look for information about Wil. I mean, what the heck is up with him? Does he have some kind of control over you all? I...\"<br>\r\n<br>\r\n\"You really shouldn't be sticking your snout into our business. Luke will not hesitate to turn you into designer shoes.\" Lyle warned.<br>\r\n<br>\r\n\"I'm afraid that's right. If you delve too deeply into our lives, Wil may decide to make your stay permanent, with no hope of return.\" Gill said, setting the mug down.<br>\r\n<br>\r\nYou look at the rag in his hands, which he ties onto his left arm...Wait, you saw something there. You didn't get a good look, but that bandanna is being used to hide it. Whatever it is, it seems that Gill doesn't want anyone seeing it.<br>\r\n<br>\r\n\"Come on, honored guest. You should just relax! Take a dip in the pool, or try a drink or two!\" Lyle said, climbing out of the water.<br>\r\n<br>\r\nYou turn to him, wanting to give a retort, but you stop to see something incredibly weird. His belly...It was the shade of blue, like the ocean. And, there seemed to be a white tail sticking out behind him. When he turns to the side, walking towards a lifeguard chair, you can see that it is, in fact, a tail. And there are small blue protrusions sticking out of his back, too.<br>\r\n<br>\r\n\"Unreal...\" you whisper.<br>\r\n<br>\r\n\"Heheheh, I'm letting you see them, to show you that there's more than meets the eye. We may be children, but we are so much more than you think...\" Lyle said, his eyes shifting and focusing on you.<br>\r\n<br>\r\nHe gives a light chuckle as these strange features on his body disappear, sinking into his human body. You look back at Gill, who was staring angrily at him.<br>\r\n<br>\r\n\"Is that...Normal?\" you ask.<br>\r\n<br>\r\n\"Yes. It's normal. I know his attitude can really get to you, but that's just how he is.\" Gill said.<br>\r\n<br>\r\n\"No, I mean...Those things. Was that...Was that a part of his real body?\"<br>\r\n<br>\r\n\"Hmm? Uh...I'm not allowed to say any more.\"</span></div></div>",
            "created":1371372240,
            "id":1611852,
            "title":"Detective Work"
        },
        "1113111111121":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Forget physique! Have some of that right now!",
                "No, you have more important business to return to..."
            ],
            "content":"<div class=\"\"><div> <span>You're not giving up so easily this time. You're going to get this guy to talk to you, and he will answer.<br>\r\n<br>\r\n\"Look Gill, I'm already in this deep enough. I don't think a few more answers for my questions will change anything. Come on, help a friend out.\"<br>\r\n<br>\r\nGill's eyes widened when you said the word 'friend' to him. He looked down at the counter, definitely thinking it over. You glance back at Lyle, who seems to be relaxing on his lifeguard chair. Gill looks back up to you, a glint in his yellow eyes.<br>\r\n<br>\r\n\"Alright, fine. But if I think the question is too deep, I'm not talking.\" he said.<br>\r\n<br>\r\nYou smile, glad to finally be getting something useful around here. First off, you ask him about Lyle and his body, especially about what you saw earlier.<br>\r\n<br>\r\n\"Yeah, that was a part of his real body. Like Luke, Lyle's body is based off of a pokémon. I can't say which, though. I already told you about Luke as a lucario. You'll have to figure it out yourself.\"<br>\r\n<br>\r\nYou nod, taking another glance at Lyle. He's now looking at your direction, a big smile plastered on his face. You see Gill stick out his tongue at him, which only elicits a laugh from Lyle. \"Man, that guy's so sure of himself.\" he said. Next, you ask about the others. Are they also in human disguises, like the twins?<br>\r\n<br>\r\n\"Yup. None of us are really human at all. We're only human so long as we have a...Well, as long as you're here.\"<br>\r\n<br>\r\nYou're unsure how to respond to that, so you just move on to your next question. You ask him why he hates Lyle so much, and you see Gill clench his fists, anger creeping onto his face.<br>\r\n<br>\r\n\"T-that's...Personal. You have to understand, I can't just...You know, share it with any new person I meet.\"<br>\r\n<br>\r\nYou nod your head and assure him you understand, and won't ask about it again until he's ready. You try another question, this time about Luke. Why is he so loyal to Wil, and so willing to go through...Well, all kinds of things? At least, from your impression of him, and from what you know so far.<br>\r\n<br>\r\n\"None of us are really sure why. Some believe it's because Luke's loyalty just works that way. Others...They think that Luke owes his entire life to him. As for me, I'd say that Luke just has a thing for Wil. In fact, I wouldn't be surprised if he had a picture of Wil on a shrine in his room!\"<br>\r\n<br>\r\nGill bursts out laughing, and you're not sure if he was joking or not. You see Lyle sit down next to you, explaining that Gill always has nonsensical thoughts and ideas running through his head. Gill calms down before explaining that he was completely joking. It's too ridiculous of an idea for Luke to be infatuated with Wil in any way. For one, they're both male.<br>\r\n<br>\r\n\"It's a perk that Gill has, being childish. He's like the third member of Akira and Elly's team. Those three play quite well, you see. Gill, a Belly-Filler, if you don't mind.\"<br>\r\n<br>\r\nGill begins taking out some bottles from behind the counter, mixing them together, shaking them, and then pouring it all into a glass. Lyle grabs his drink and sips it occasionally. Gill has already returned the bottles and is now chatting with you once more. You can't help but smile a little as the serious atmosphere has lightened up a bit.<br>\r\n<br>\r\n\"Well, at least it's good to see that you two aren't at each other's throats right now.\" you say.<br>\r\n<br>\r\n\"Yeah, we despise each other. But Luke and Wil said that they'll turn us into mince meat if we start fighting.\" Gill said.<br>\r\n<br>\r\nYou nod your head as Lyle seems to make a purring sound after every sip he makes from his drink. You look at him as he closes his eyes in bliss, his free hand occasionally rubbing his flat belly whenever he drinks. You just turn your gaze to Gill, expecting him to give an explanation. He catches your sight and just smiles.<br>\r\n<br>\r\n\"You'll have to drink one yourself if you wanna know why.\" he said.<br>\r\n<br>\r\nYou look back at Lyle, who's already finished his drink. Now he's moaning in delight as he rubs his two hands on his stomach, opening one eye to look at you.<br>\r\n<br>\r\n\"This faux body doesn't change, but my real one is experiencing the effects right now.\" he said, continuing his delighted moaning.<br>\r\n<br>\r\nYou're somewhat tempted to try one yourself, but you already know that it will cause another change on your body. You look down at your part crocodile, part human body and admire the powerfully built physique. The drink is called a Belly-Filler, so it will most definitely have some effect on your stomach. Right now, you're pretty sure you don't want anything to happen to your rock-hard abs, but Lyle seems to be really ecstatic from it...</span></div></div>",
            "created":1376493360,
            "id":1645956,
            "title":"More Info"
        },
        "11131111111212":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "It's nothing...Back to the questioning!",
                "Oh wait, Wil is there..."
            ],
            "content":"<div class=\"\"><div> <span>You shake your head and focus your mind back to the task at hand.<br>\r\n<br>\r\n\"So, I'd like to know more about you, Gill.\" you say.<br>\r\n<br>\r\n\"Oh me? Well...Hmm, I like the colour red. I'm usually pretty cheerful and happy. I like to play games, but I like eating food more...\"<br>\r\n<br>\r\nYou just smile and nod your head as Gill seems to be content describing himself to you.<br>\r\n<br>\r\n\"And, uh...Hmm, well...I made friends with a crocodile-alligator hybrid one time.\" he said.<br>\r\n<br>\r\n\"Wait, what?\"<br>\r\n<br>\r\n\"Yeah! His name's Victor, and he treats me to lunch really often.\"<br>\r\n<br>\r\nYou just look at Lyle, who chuckles lightly at you. You just shrug this off as Gill's imagination, or something. Suddenly, Lyle leans in close to you and whispers into your ear. \"This world isn't the first one we've messed with...There are dozens of others just like this one. Alternate realities, Parallel dimensions, the works.\"<br>\r\n<br>\r\nYou just stare, mouth agape as Lyle smiles at you, not an ounce of sincerity on his face.<br>\r\n<br>\r\n\"And I'm the one with the imagination.\" Gill says rather harshly.<br>\r\n<br>\r\nYou can't help but feel that Lyle wasn't kidding that time. Are they...Are these kids a bunch of world travelers!? You glance at the doors...</span></div></div>",
            "created":1378634520,
            "id":1659546,
            "title":"Continue The Interrogation"
        },
        "111311111112121":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "You! Question time.",
                "Lyle! Great, so now what is he gonna do to you?"
            ],
            "content":"<div class=\"\"><div> <span>You look at Lyle dead in the eyes. \"Alright, what was with that little comment of yours?\" you ask.<br>\r\n<br>\r\n\"What comment?\" he asked, smiling a bit.<br>\r\n<br>\r\n\"You know! The one about this world not being the first one that you guys messed with!\"<br>\r\n<br>\r\n\"What ever do you mean?\" he asked, his smiling widening into a sneer.<br>\r\n<br>\r\n\"Forget it. You will never get a good, straight answer from that guy.\" Gill said.<br>\r\n<br>\r\nYou look back at him, his breath held as he looks away angrily. You can hear Lyle's snickering from next to you.<br>\r\n<br>\r\n\"Unless...\"Lyle said, his voice barely a whisper.<br>\r\n<br>\r\nYou look back at him, and he gestures to the pool. \"I like a good challenge.\" he tells you.<br>\r\n<br>\r\nYou look at the pool and think hard. You're a muscular reptile that spends most days in the water. Right now, it would seem that Lyle is expecting you to challenge him to a race, or something. It's almost as if he wants to lose! Unless...But right now, you need more information. You need to know just who these people are!<br>\r\n<br>\r\n\"...Lyle, how about a race?\" you ask.<br>\r\n<br>\r\n\"Oh? What kind of race?\"<br>\r\n<br>\r\n\"We'll race from one end of the pool to the other. If I win, you have to answer my questions.\"<br>\r\n<br>\r\n\"And if I win, then you have to take part in another experiment.\"<br>\r\n<br>\r\nYou wince at this. It was already a big risk with what Lyle had you drink. But was it really worth the risk?<br>\r\n<br>\r\n\"...F-fine then!\"<br>\r\n-----<br>\r\n\"Okay, are both swimmers ready?\" Gill called out.<br>\r\n<br>\r\nYou were standing a few feet away from Lyle, who smirked in your direction. You waited as Gill began counting down.<br>\r\n<br>\r\n\"3, 2, 1...Go!\"<br>\r\n<br>\r\nWith that, you jump into the pool. You're not that great of a swimmer, but your animal instincts suddenly kick in. You begin stroking your arms and legs in the water, moving your tail in time as well. You thought that you were doing good progress, until you took a peek at Lyle.<br>\r\n<br>\r\n\"W-what the!?\" you think to yourself.<br>\r\n<br>\r\nWhat you see could almost be described as a bird. A large, white and blue bird with huge, wing-like hands that are propelling him through the water with great ease. He was already ahead of you by the time you stopped gawking.<br>\r\n<br>\r\n\"O-oh no...I am not gonna be experimented on again!\"<br>\r\n<br>\r\nYou swim faster, harder, working to push yourself as far as you can go. When you reach the other end, Lyle was already about to swim back to Gill. You kick the pool's wall as you flip and twist underwater, trying to give yourself as much push as you can to get ahead of Lyle. The end was in side, and you two were snout-and-beak. Lyle pushed forward with his hands and tail, and you do the same. You reach out and grab the edge of the pool, your head breaking through the water's surface.<br>\r\n<br>\r\n\"Gah! Hah...So Gill, who won?\" you ask.<br>\r\n<br>\r\nYou glance at Lyle, who seemed to be smiling widely. He catches your gaze and shows his pointed teeth. Admittedly, this is the first time you've ever seen a bird with teeth in its beak.<br>\r\n<br>\r\n\"Well, the winner is...\" Gill says.</span></div></div>",
            "created":1385393520,
            "id":1698904,
            "title":"The Race"
        },
        "113":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Gym",
                "Swimming Pool",
                "Buffet"
            ],
            "content":"<div class=\"\"><div> <span>You decide that it's best to ask the manager, Wil, some questions. You head back the way you came. When you reach the lobby, you feel the same intense feeling in your body again. It looks like Luke is there, standing right next to the receptionists desk. Great, now you gotta watch what you say in front of this guy.<br>\r\n<br>\r\nYou calmly walk over, trying to mask your fear.\"Can I help you?\"Wil asked, a smile on his face. You can't help but feel like he's mocking you and daring you to bad mouth him in front of Luke. \"Uh, yeah. I was, uh, wondering what other things you have in this place.\" \"Oh, we have lots of things to do here! First is the gym somewhere in the right wing, then a nice swimming pool out back. If you'd like, there's also a buffet section in the cafeteria, but you'll have to ask the chef there if you wanna use that section.\"<br>\r\n<br>\r\n\"I'll take you to whichever choice you make.\"Luke said, staring at you dead in the eyes. You try to think it over, but you start to feel like you'd faint from being right next to him! Hurry, where are you gonna go?</span></div></div>",
            "created":1314594000,
            "id":1177546,
            "title":"What Else Is There?"
        },
        "1131":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Try out that drink, please!",
                "Start exercising now, if you don't mind.",
                "Know you better, so let's chat!"
            ],
            "content":"<div class=\"\"><div> <span>\"I will guide you immediately.\" Luke said, strolling away to the hall behind him.<br>\r\nYou follow him close by, but you stay as far as three feet away from him, at least. After a few more hallways, the two of you come to a pair of double-doors with the sign \"Gym\" above it. Luke starts making his way back to the lobby as you look at the double-doors in front of you. You always thought that you need to work out more. Not that you were out of shape, or anything like that. It's just that you have a little trouble when it comes to lifting heavy objects. As you push open the doors, you're shocked to see just how insanely big the inside is! The ceiling has got to be at least 20 or 30 feet high! But what strikes you odd the most is how big the cabin itself looked from the outside. Something weird is going on around here, but you should as might as well go inside and try something.<br>\r\n<br>\r\nInside, you see lots of different training equipment, and it seems that there's already someone inside. He notices you and walks over, slightly sweaty from using the dumbbells. He was a blonde-haired boy, about the same age as Wil and Luke. He was wearing a red shirt and blue pants. The thing about him that really caught your eye was that he had scarlet-red eyes, which kinda made you cringe a little bit. \"Hi there! My name is Drake, nice to meet you!\" You shake hands and ask him what he does here. \"Oh, I just help out the guests with their training and exercise. Stuff like that.\" He grabbed his arm as he flexed it, not really showing any bulging muscles at all. \"You know, it's strange. I work out here a lot, but I don't get any stronger at all. Oh well, the others say I look better thin anyway.\" You look at all the exercise equipment and decide to try the dumbbells he was using. You take a few steps before he stops you. \"W-wait, I have to ask you something. Would you like a drink before working out? It might give you...animal-like strength, so to speak...\" \"You want me to drink something first?\" \"Uh huh! But you don't have to drink it if you don't want to. Heck, we can just chat here for a while and not even work out at all!\" he says, smiling. \"Well, I'd like to...\"</span></div></div>",
            "created":1315458000,
            "id":1183433,
            "title":"Working Out?"
        },
        "11311":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Tiger Power Up",
                "Dragon's Fire Power"
            ],
            "content":"<div class=\"\"><div> <span>\"Well, I'd like to try out that drink, please!\" you say eagerly. \"Certainly, sir!\" Drake says before walking to a closet at the corner. You watch as he comes back holding a bottle in his hand. \"Here you go!\" he says, holding it out to you. You take the bottle and examine it. It was filled with a red liquid, which kinda made you think of blood...<br>\r\n<br>\r\n\"Is there a problem?\" Drake asks. \"Oh, nothing really. It's just that, it sorta looks like blood.\" \"Well don't worry. I'm not a vampire, that's just ridiculous. But if you see scales on me, then you're just hallucinating.\" Where did that comment come from? Oh well. As you're about to drink it, you think that maybe it's best to know just what you're going to drink. \"Hey, Drake.\" \"Yeah?\" \"What is this stuff anyway?\" \"...That's just a Tiger Power Up drink...\" Strange, you've never heard of a drink like that before. \"But...If you really don't like it, I can get you the Dragon's Fire Power drink instead...\"<br>\r\n<br>\r\nDrake is looking at you impatiently, as if he's anxious to see you drink something. But since you've never even heard of these two drinks before, Who knows what might happen! But if you keep this guy waiting any longer, then what if he decides to call Luke or something? Better choose one already...</span></div></div>",
            "created":1315544400,
            "id":1184215,
            "title":"Animal-like strength, huh?"
        },
        "113112":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Drake reaches the closet",
                "Drake couldn't move"
            ],
            "content":"<div class=\"\"><div> <span>\"Um, I think I'd rather go with the Dragon's Fire Power drink.\" Drake suddenly beamed with joy at your choice, which was really, really awkward...for you. \"Really? Honest and Truly?\" Drake said, his hands clasped together. \"Uh...yeah?\" Drake quick swiped the Tiger Power Up drink from your hand and ran toward the closet again. You could've sworn he was saying something. \"Finally! I'll...have another...around here! And they...said that...\" You couldn't quite make out the rest of his mumbling. When he returned, he gave you a bottle with a green liquid inside. Well, a green color for a drink is at least more...normal-ish, sort of. You screw off the cap and look at Drake, who was smiling happily at you. You start drinking the contents of the bottle. Surprisingly, it tasted much better than you expected! Most exercise drinks tasted more like fruit water, or something, but this was totally worth at least more than ten times that flavor!<br>\r\n<br>\r\nAfter finishing off the bottle, you set it down on a table at the side. \"Okay, now I'm ready to go!\" you say eagerly. Drake just wags a finger in front of you. \"Sorry, but I think you gotta wait for the drink to digest first.\" You don't fully understand what he meant by that. Usually, it's okay to exercise even right after drinking something. That's when your skin started itching. You scratch it a bit before the itch comes back, and it's getting a bit more irritated! \"Gah! Why am i so itchy all of a sudden!?\" You start scratching your back, front, arms, legs, everything! What you don't notice is Drake getting something from the closet again and sitting down on the bleachers on one wall, watching you. As you continue to scratch yourself, you start feeling something harder than skin...You look down at your arms and see scales...Green scales! And it's spreading all over your arm! \"Wh-what the!?\" You look around and see Drake staring at you. He gives a friendly wave to you before you feel something in your pants. You feel around your back, only to be surprised when a long reptilian tail bursts out of it! Not only that, but the scales have already spread all across your body! Your face grows out a snout, with slits for nostrils, fangs, and even you hair fell off! You felt your back go completely numb, as two stubs pushed out from your shirt. As quickly as they appeared, two green scaly wings ripped through your shirt, folding themselves neatly on your back. As you feel your whole body finally settle to the changes, you look at your clawed hands and your taloned feet. Drake walks over to you with something in his hand. \"Well, that was a pleasant change, now wasn't it?\" \"...What did you do to me?\" Drake held out a hand mirror, showing the reflection of a green anthropomorphic dragon. You stare at your reflection, your mouth open in horror. \"Well, now I've finally got someone to help me out now!\" You grab Drake by the collar of his shirt, something warm building up inside your throat. \"Change me back...Now.\" \"Sorry, but I'm not allowed to. And besides, I'm not the one who you should make your enemy.\" You needed more answers from him, so burning him alive wouldn't do any good. You let him go, anger slightly subsiding now. \"Anyway, I bet you're wondering what I meant by 'I'm not allowed to,' aren't you?\" You nod as you take a quick glance at the gym doors. No one. \"Well, I guess I can explain it to you.\"<br>\r\n<br>\r\nThe two of you sit down at the bleachers, with you keeping an eye on him the whole time. \"You see, I'm supposed to make sure anyone who enters the gym has to drink something. Otherwise, Wil is gonna punish me for insubordination.\" \"What do you mean? What kind of punishment would he do? And why would he even want you to do this in the first place?\" \"Sorry, but all I can tell you is that the punishment is extremely painful and, sometimes, even traumatizing.\" You start imagining a bunch of horrible scenes and pictures in your mind. \"Woah, that's just not right.\" \"I know...And he said that if I ever double-cross him, he's gonna serve dragon steak for dinner tonight.\" Wait a minute, what's he talking about? Wil couldn't have possibly have known that you chose to drink that Dragon's Fire Power stuff, and Drake isn't a dragon...But the way he acted, and the stuff he said...No way, he can't possibly be...<br>\r\n<br>\r\nDrake leaned on his knees for a bit, covering his face a little with his arms. \"And worse of all, he said that he has no use to a pawn that doesn't follow orders.\" You see some red scales begin to appear on his arm, starting from the inside of his shirt. \"Uh, Drake...\" \"Yeah?\" he looks at you with his scarlet-red eyes. \"You said that if you had red scales, then I'm just hallucinating, right?\" \"Yeah?\" \"Well, I'm seeing some right now...on your arm.\" He looks at his arms, and saw the red scales reaching his shoulders. \"Gah! ah, I, uh, th-this is...just an allergic reaction! Yeah, I'm actually allergic to, uh, to dust. And these bleachers haven't been cleaned in a while, so, ah, I-I'll be right back!\" Drake stood up and left for the same closet. He tripped on the last step of the seats, and fell flat on the floor. \"Hey, you okay?\" you say, standing up from your seat. \"I, I'm fine!\" he said, his voice sounding a little bit...rougher.</span></div></div>",
            "created":1317963600,
            "id":1202159,
            "title":"Dragon's Fire Power"
        },
        "1131121":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Macro drink",
                "Muscle Growth drink"
            ],
            "content":"<div class=\"\"><div> <span>Drake gets up and reaches in the closet. You watch as he starts drinking a whole bottle of something. When he puts the bottle down, empty, he walks back over to you. \"Phew! That could've been ugly!\" he says, all the weird changes on his body completely gone. You can't help but wonder what he just drank back there. \"Hey Drake.\" \"Yeah? What is it?\" \"What was that you drank back there?\" \"Oh...um, well, it's just, uh, my medicine...\" You can already tell he was lying the way he keeps fidgeting around. You get up from the bleachers and walk closer to him, trying to get a better look at him. \"Oh really? So you drink an entire bottle of medicine everyday?\" \"...Yes. That's how bad my allergies are.\" Drake was looking away from you now. \"I don't believe it. No one has allergies that bad. Even if it causes red scales to spread all over, and make your voice change too.\" Drake was staring at the door now, as if hoping someone would come and stop the conversation. But no one came, heck no one even passed by. \"I...I...I...\" \"Drake...Tell me the truth...What are you?\" Drake gave out a sigh and looked at you in the eye. \"...I'm a dragon.\"<br>\r\n<br>\r\nThe two of you were sitting on the bleachers again, with Drake telling you about himself. \"I was born as a dragon, but I was completely alone for some reason. I think I might have been abandoned by my parents, or my egg got lost somehow. I don't really know. All I remember is that Wil found me one night, and I've been so loyal to him ever since. Even though he treats me like his own brother, sometimes...He would treat me in a completely different way.\" You suddenly remember the horrible images you imagined earlier. \"You mean he would start hurting you?\" \"Yeah...But I don't blame him. I think there's something wrong inside him, something that might be causing him to do that. Maybe...\" You were going to ask him some more questions until the door suddenly burst open, Luke standing there.<br>\r\n<br>\r\n\"Drake, you're being summoned by our master. It's time for our daily meeting.\" You feel the intense cold feeling, but it's not as strong as it was last time. \"Alright, I'm coming!\" Drake said before Luke left the gym. \"Sorry, I gotta go. Remember this though, Luke is much more loyal to Wil than I am. So be careful around him!\" Drake left the gym as well, leaving you alone inside. You see the closet wide open. \"Looks like he forgot to close the cabinet door...\" You walk over to it to see a large number of bottles inside, all full of different colored fluids. Some bottles were labeled in english, but most of the bottles were labeled with a bunch of runes you've never seen before. \"Does he have his own draconic language or something?\" You shrug your shoulders as you look for the empty bottle Drake had drunk, but it seems to be hidden in the back. Oh well, guess you'll just take your chances and get a random one and hope for the best.</span></div></div>",
            "created":1322715600,
            "id":1232615,
            "title":"A Temporary Antidote"
        },
        "11311212":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "You make it back to your room",
                "Someone finds you"
            ],
            "content":"<div class=\"\"><div> <span>After some looking around, you find a bottle with a clear, transparent fluid. Once again, the label was in a weird rune-like language that you couldn't understand. \"Hopefully, this is what he drank, or something else might happen to me!\" You take the bottle and unscrew the cap. You smell it first, getting a slightly sweet aroma from the drink. \"This seems nice...Bottoms up!\" You begin chugging the bottle down into your gullet. As the last drop fell into your throat, you give a satisfied sigh as you replace the cap and put the now empty bottle back. Looking at the door and seeing no one behind it, you close the cabinet doors and wait for something to happen. That was when you felt it. A small gurgling sensation in your stomach. \"Looks like something's gonna happen now!\" you say, excitedly.<br>\r\n<br>\r\nYou felt your arms tingling. You look at them and realize that they're bulking up! The muscles were slowly expanding, growing underneath your green scales! \"Whoa! Didn't expect this to happen...\" You feel the same tingling sensation throughout your entire body. Your calves began to shake a little, growing underneath your frame. Your chest expanding and pushing out your shirt. Even your stomach had the same sensation as your body. You remember the small mirror that Drake handed to you earlier. You walk over to where it is and look, but it's too small! Thought it really doesn't matter much, cause you're still growing! You rub your 6-pack abs, becoming an 8-pack. Your biceps are blowing up to basketball size. Your calves growing longer, adding a few inches of height to your expanding body. When it finally stopped, you look at your body in astonishment. You're a rippling mass of pure dragon muscle! You flex your arm in front of you, gaping at the sheer size of it. You pound your own chest, and feel nothing at all! \"This is amazing!!!\" you say to yourself.<br>\r\n<br>\r\nYou look around at the gym equipment, excited to try out your new strength. Your first thought was the empty weightlifting bar. You pile up as much as 200lbs. on it and lie down on the bench press. Your firmly grab the bar and lift. It's surprisingly light and easy to lift! You even try lifting it with one hand with no problem at all! You try 500lbs. and still too easy! Finally, you put up to 800lbs on the bar. The moment you push, you feel some resistance as the weights try to push your arms down. You decide to try and put some effort to it, and the weights finally gave in on the first try! You set the bar back and look at your arms again. \"This is so cool! Why would Drake never even try drinking that stuff when he knew just exercising wouldn't do a thing?\"<br>\r\n<br>\r\nAs you sit down on the bleachers again to wait for Drake to come back, a thought enters your mind. \"Wait...How could I be so stupid! It's too obvious for them to not see me suddenly turn into a reptilian beefcake after like 10 minutes! I'd better get outta here before anyone comes to check on me here!\" You stand up and check the gym doors before exiting. On both sides, you only see hallways leading to more hallways. \"Great, I don't even know how to get back! Looks like I'll have to depend on my luck and senses now. Hope no one finds me...\" You set off to the first corridor you see, moving towards the left.</span></div></div>",
            "created":1330664400,
            "id":1287565,
            "title":"Muscle Dragon"
        },
        "113112121":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "It was Drake",
                "It was...Luke? He looks like Luke..."
            ],
            "content":"<div class=\"\"><div> <span>As you walk down the corridor, you spot a fork in your path, going to the left and right. You look down both choices and hear footsteps coming. A shadow appears on the left corridor. \"Crud! Someone's coming!\" Hastily, you run down the right, trying to avoid being seen. Several near encounters happen as you rush towards your room, not even sure if this is the path to your room. \"Darn it, where the heck am I!?\" You run down every twist and turn you see. The cabin is definitely a lot bigger inside than out. You're already sure that you're lost somewhere in this maze-like building, and you're already getting tired out from your constant running. Just when you're almost out of hope, you see another branch of corridors, with voices coming from one of them. As silent as you can, you lean forward, trying to listen in on the voices. \"...Man, I hate redecorating. Can't we just leave it the way it is? I'm sure the guest wouldn't mind at all.\" \"Guilmon, you remember what Wolfy told us, right? We have to keep him comfortable until...\" The voices stopped talking. You felt a chill creep down your spine. It gets worse and worse until your whole body is shuddering violently. \"W-what's going on?\" Your legs tremble, threatening to collapse from your shaking body. You can't seem to move a single muscle. This experience can only mean one thing. \"Luke...\" Managing to move your back and head, even just a little, you manage to peak out and see two kids standing in front of a door. Sure enough, the black cloak on one of them means that Luke really is there. The figure standing next to him, the boy he called Guilmon, is trembling as well. \"Lucario, can you p-please back off with your aura, just a little bit? I-I can barely move a muscle!\" You recover as your massive body stops trembling. \"Gill, it's time to go. Aren't you in the middle of cooking something?\" \"Oh, darn it, you're right!\" The two head off towards a different direction, leaving you free to check out the room they were in. But from their conversation about redecorating and about you...\"This must be my room!\"<br>\r\n<br>\r\nUpon entering, the whole room was definitely very different compared to when you first entered it. The walls were now a beige colour, with medieval torch-shaped lights. There were several jewel-encrusted furniture such as chairs, a desk, a cabinet, and even the bed was jewel-encrusted! But there was someone lying on your bed. He had a wispy, dreamy look on his face, with a small smile etched onto his mouth. \"Wil!\" you shout, approaching him. He seems unsurprised as he lazily stands up from your bed. \"Yo. How ya doin', dragon guy.\" \"What did you do to my room!?\" \"Redecorated it. It's gonna be on your tab once your stay's over.\" A tab!? You feel like punching him now! You instinctively growl and clench your fists tightly. You can already feel your arms tensing as you're ready to unleash hell on this kid. \"Calm down! This whole stay is complementary, so everything is no charge, remember? That includes the redecorated room. Besides, don't you feel more at home in this kind of place?\" He did have a point. Looking around your room did soothe you a little bit, if not a little too 'dragon's hoard' themed for your taste. Taking a deep breath, you control your anger for the time being and look at Wil. He seems to have taken a liking at one of the torches, staring at it intensely. \"Alright, I admit, I like this new room. But please, if you're gonna mess with my stuff, get my permission first.\" \"You mean like how you messed around with Drake's medicine cabinet?\" You froze up. How did he know about that? Wil laughed at your reaction. \"Isn't it a little too obvious? You were an ordinary human when you got here. And now, you're a hulking green dragon with muscle tone good to win the world championships!\" You think over what he said and laugh a little yourself. It is really that obvious, actually.<br>\r\n<br>\r\nThe two of you sit down on your bed, chatting about the other workers. \"So who is this Guilmon I saw Luke talking to?\" \"Oh, he's the chef of the cafeteria. We usually call him Gill.\" \"Is it because he's named after that digimon character?\" \"Yup, it's a little embarrassing if you're going around with a character's name as your own name.\" \"Yeah, that's understandable. Anyway, about Drake...Is it really true that he's a dragon?\" \"He told you? Well in that case, I have no reason to keep it from you. Yes, he's a dragon. He has to drink his medicine to temporarily take on the form of a human, but it always wears off after a while. One of the things he can do is force his dragon form to come out though, but then he'll have to take his medicine earlier than usual.\" \"Huh. But, what about me? I drank some of that Dragon's Fire Power stuff, and now I'm a dragon. Won't I...\" Wil looked sullen, looking away from you. \"I'm sorry, but it won't wear off for a very long time.\" \"What!? W-Why not!?\" \"You drank a muscle growth formula on top of that energy drink. The result would have changed your genetic structure, causing the changes to become permanent.\" Your heart sinks into your stomach, as the thought of living as something inhuman for the rest of your life burns into your mind. \"But look at it this way! With those guns, no woman can possibly resist you now!\" Wil says casually. A long, uneasy silence settles in as neither of you says a word. Suddenly, Wil gets up and stretches his arms. \"Welp! No use being all gloomy about it now! Besides, your strength may serve you well in the future...\" Wil smiles at you creepily, as if he's saying something to you. But you're not sure exactly what it is. \"Well, no one's manning the front desk. Back to my post!\" Immediately, he runs out of your room, not even bothering to close the door. Sighing, you get up to close the door when someone walks up in front of it.</span></div></div>",
            "created":1348290000,
            "id":1432663,
            "title":"Room Redecorations"
        },
        "1131121212":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "you accept the offer, and Lyle gives you a weird-looking serum.",
                "Drake suddenly appears and chases Lyle away."
            ],
            "content":"<div class=\"\"><div> <span>As you push the doors closed, something stops it from the other side. You step back as someone pushes the door fully open and looks at you. The person standing before you looked very much like Luke, but he didn't have a black cloak, nor did he give off that intimidating aura. Instead, he wore a white shirt with a blue front, and white shoes and glasses. Another thing that made him very different was that smile. This guy had a smile that just shouted 'bad news'.<br>\r\n<br>\r\n\"Why hello there, valuable guest.\" he said, his sneer getting bigger.<br>\r\n<br>\r\nYou can't help it, but something inside you is just screaming at you not to trust this guy!<br>\r\n<br>\r\n\"And who, may I ask, are you?\" You said.<br>\r\n<br>\r\n\"Why, I'm Lyle. Luke's twin brother. Why, didn't he tell you anything about me?\"<br>\r\n<br>\r\n\"No, he didn't. And I'm fairly certain the others didn't either.\"<br>\r\n<br>\r\n\"Hmm, shame...\"<br>\r\n<br>\r\nHe looks at you from top to bottom, from horn tip to foot claws. He had his smile the entire time, and it kept growing wider and wider as he observed you. Finally, you decide to ask.<br>\r\n<br>\r\n\"What are you looking at?\" \"Oh, I just wanted to get a closer look at you, ever since you became a large green anthropomorphic dragon with very good muscle tone...\"<br>\r\n<br>\r\nUgh, he knows about you too? Does everyone know about what you did!? Wait, does Drake know it too?<br>\r\n<br>\r\n\"Well anyway, you seem like a very decent piece of work. Though I do still want to perform a few experiments...\" Lyle said, turning away.<br>\r\n<br>\r\nYou suddenly realize what he just said, and you grab onto his shoulder and turn him back towards you.<br>\r\n<br>\r\n\"Wait, a few experiments? So, are you the one who makes Drake's medicine? Then you can cure me, right!?\"<br>\r\n<br>\r\n\"Heh, heheheheh...A cure? Oh, I might have something for you...If you're willing to take the risk. It's untested, and I have no data on what may happen.\"<br>\r\n<br>\r\n\"Really? Oh...W-well...\"</span></div></div>",
            "created":1364533200,
            "id":1559899,
            "title":"Meet The Mad Scientist"
        },
        "11311212122":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Dracus has to go now.",
                "You two spend some more time chatting."
            ],
            "content":"<div class=\"\"><div> <span>You were thinking it over. You seriously didn't like this guy, much less trust him with your body! But, if he really did have a cure...<br>\r\n<br>\r\n\"Heheheh, if you're not gonna give me an answer, then I'll be happy to answer my question for you.\" Lyle said.<br>\r\n<br>\r\nHe grabbed hold of your arm with one hand, and had a syringe in the other! He took you by surprise, and you didn't have enough time to react! It was a split second, but before this jerk could jab the needle into your scales, something knocked it away. You caught a glimpse of something red, until you managed to see what had jumped on Lyle. It was a red dragon anthro, just like you, only thin and athletic-looking, instead of your bodybuilder-like physique. He was grappling with Lyle, trying to knock the syringe out of his hands.<br>\r\n<br>\r\n\"You will not do <b>ANY</b> experiment on him, you hear me!?\" He shouted.<br>\r\n<br>\r\n\"Guh...Dracus! Why'd you have to interrupt me, of all times!\" Lyle shouted.<br>\r\n<br>\r\nThe two grappled until Lyle had let go of the syringe. Then, this Dracus person quickly stood up and crushed it underfoot. Lyle looked pretty mad, shouting something about coming back before running off. You felt really thankful of him now. You walked up to him and placed a scaly hand on his shoulder.<br>\r\n<br>\r\n\"H-hey, um...Thanks for saving me back there...\" You say.<br>\r\n<br>\r\n\"O-oh, uh, well...Yeah, of course I would! What are friends for?\" he said.<br>\r\n<br>\r\nIt was then when something in your mind just clicked. You suddenly recognize his voice, which was slightly gruffer than when you last remembered. It sounded a lot more threatening in the heat of the moment, but now that he was calm, you recognize it.<br>\r\n<br>\r\n\"D-Drake!? Is that...Really you?\" you ask.<br>\r\n<br>\r\n\"Yeah, heheh, it's me. Are you surprised?\"<br>\r\n-----<br>\r\nThe two of you are in your room now, talking things over. You confessed about messing around with his medicine, but he doesn't hold it against you in the least. He insisted that the only thing he cared about was that you were safe. In return, he admitted that that was his true form, and that \"Drake\" wasn't his real name.<br>\r\n<br>\r\n\"It's Dracus. You see, my boss Wil insisted that we all use faux names whenever we're around guests and other people. He...Well, he just doesn't seem to trust other people with our real names.\" he explained.<br>\r\n<br>\r\n\"But, why would he make you all use different names instead? I mean, why keep your real names a secret?\" you asked.<br>\r\n<br>\r\n\"I really have no idea! The only explanation he would give us is that revealing your real name will reveal the entrance to your soul...\"<br>\r\n<br>\r\n\"...What? Is Wil always cryptic like that?\"<br>\r\n<br>\r\n\"I dunno. It's just his thing, I guess.\"</span></div></div>",
            "created":1367125200,
            "id":1580120,
            "title":"A Friend In Need"
        },
        "113112121221":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "There's a feast in your honor.",
                "There's a staff party, and you're invited!"
            ],
            "content":"<div class=\"\"><div> <span>You were thinking of what to say to Dracus, when the door suddenly bursts open. You look...And see Wil there, eyes agleam and a smile on his face.<br>\r\n<br>\r\n\"Drake! I'm starting a staff meeting in 6 minutes. Everyone is to attend. Go and say goodbye to your friend, and let's go!\" he said.<br>\r\n<br>\r\nDracus turns to you, an apologetic smile on his face. \"Sorry, buddy. I gotta go.\"<br>\r\n<br>\r\nYou just nod as he stands up and walks away. Wil just stands there in front of your door, smiling at you. It was getting a little creepy, to be honest.<br>\r\n<br>\r\n\"Mr. Guest. You have been enjoying your stay here, haven't you?\" he asked.<br>\r\n<br>\r\n\"W-well...It's been interesting, so...Yeah, a little bit!\" you admit.<br>\r\n<br>\r\n\"Oh, good...It's getting a little late, and we don't want you missing your beauty sleep, now do we?\"<br>\r\n<br>\r\nWil holds up a small figurine, which kinda looks a bit like a red dragon. He whispers something as a sudden burst of drowsiness hits you. Your vision instantly blurs as a loud yawn escapes your lips. Your body becomes heavy as you fall onto your bed, your eyes barely able to stay open.<br>\r\n<br>\r\n\"Sleep tightly now, honored guest...\"<br>\r\n<br>\r\nThe last thing you remember seeing is his smile growing wide, his mouth full of sharp beastly fangs.<br>\r\n-----<br>\r\n\"Well now, is everyone here?\" Wil asked.<br>\r\n<br>\r\n\"All are present and accounted for, sir.\" Luke answered.<br>\r\n<br>\r\n\"Pfhe. I have more important work to do, than to attend meaningless meetings.\" Lyle says, fiddling with his glasses.<br>\r\n<br>\r\n\"So...What is the reason for this meeting, sir?\" Dracus asked.<br>\r\n<br>\r\n\"It's about...Our dear guest.\" Wil answered, a sneer growing over his lips.<br>\r\n<br>\r\n\"Ooh! Are we finally gonna dissect him?\" Lyle asked, smiling widely.<br>\r\n<br>\r\n\"What have I told you, Lugia!? No one harms my precious toy!\" Wil yelled, growling audibly at his employee.<br>\r\n<br>\r\n\"Keep your claws hidden, Wolfy. I've just finished waxing the table.\" Luke said, not even looking.<br>\r\n<br>\r\nWil took a deep breath, and his smile returned to his face. \"Don't worry, Lucario. I'm calm.\"<br>\r\n<br>\r\n\"So, tell me again, why are we having this meeting? So far, you only told us that it's about our guest.\" Dracus asked.<br>\r\n<br>\r\n\"Ah, that. You see, it would seem that our green muscle-dragon has began to lose trust in us, thanks to a certain someone.\" Wil said, glancing at Lyle.<br>\r\n<br>\r\n\"So, what do you suggest we do to put him back into a state of safety?\" Luke asked.<br>\r\n<br>\r\n\"Easy. We whip up a nice, delicious feast. Are you ready for it, Guilmon?\"<br>\r\n<br>\r\nA boy with red hair and yellow eyes looked at everyone, a grin dancing on his face. \"I'm finally getting a chance to test out a new recipe!\" he declared, his grin widening ever so slightly.<br>\r\n-----<br>\r\nYou groan as the sunlight burns your eyelids. You sit up on your bed, shaking your head back and forth. Then, the memories come back to you.<br>\r\n<br>\r\n\"Dracus! Wil...W-what...\"<br>\r\n<br>\r\nA knock on the door made you jump a little. You turn to it as you groggily get up to answer it. When you look out, you see two little kids, no older than 6. You remember the two, who opened the door for you. The girl and boy were both smiling up at you, as if they were trick-or-treaters on Halloween night.<br>\r\n<br>\r\n\"We have a message for you, Dragon man!\" the boy tells you.<br>\r\n<br>\r\n\"It came from straight at the top! Wil sent it to you!\" the girl said.<br>\r\n<br>\r\nYou're shocked awake as they giggle to each other. They then tell you the message...</span></div></div>",
            "created":1385478780,
            "id":1699285,
            "title":"Staff Meeting"
        },
        "1131121212212":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "You're growing!",
                "You're shrinking!"
            ],
            "content":"<div class=\"\"><div> <span>\"W-wait, what?\" you ask blankly.<br>\r\n<br>\r\n\"Didn't you hear us? We're having a party, and we want you in it!\" the boy said.<br>\r\n<br>\r\n\"B-but, I'm not a staff member.\" you said.<br>\r\n<br>\r\n\"But it would be so lonely if you missed out on the fun! That's why Wil is inviting you over!\" the girl said, grabbing hold of one of your arms.<br>\r\n<br>\r\nBefore you could respond, the two grab you by the arm and yank you along with them. You travel through a number of hallways until you come up to a large door with a sign that said \"Cafeteria\" at the top. You can hear some muttering coming through the door, and you guess that everyone must be inside.<br>\r\n<br>\r\n\"C'mon! Let's go!\"<br>\r\n<br>\r\nThe two open the door and drag you along inside. In the large room, you see a large round table filled with various dishes, from T-bone stake, to vegetable stew, you guess that the chefs must have worked hard on this. There were party decorations all over the walls, streamers and ribbons covering the area. Wil approaches you with a big smile.<br>\r\n<br>\r\n\"Hey hey! Glad you could make it! I think I should introduce you to everyone, don't you?\" Wil said happily.<br>\r\n<br>\r\nYou just stare at him blankly as he continues to smile at you. Then the two little kids line up behind him as Wil makes a sweeping gesture to them.<br>\r\n<br>\r\n\"This is Akira and Elly! They handle the door and greetings!\" Wil explains.<br>\r\n<br>\r\nYou just smile and nod your head. With that, the two wander to another section of the room. You don't have time to worry about them, though, as you feel a shiver crawl up your spine. Luke casually approaches you as Wil gestures to him like he's a trophy being presented.<br>\r\n<br>\r\n\"This is Luke! He's my personal assistant, and the most dependable around here. You have a problem, take it up to him!\" Will said.<br>\r\n<br>\r\n\"Just don't annoy me, or you'll regret it.\" Luke said, staring at you in the eye.<br>\r\n<br>\r\nYou just nod as he walks away. Then, Wil calls over Dracus and the guy who looks like Luke. You glare at him for a little as they approach.<br>\r\n<br>\r\n\"This is Drake and Lyle. I'm sure you're already acquainted with Drake, and you've encountered Lyle before. They're the gym instructor and pool lifeguard respectively. Play nice now!\" Wil said.<br>\r\n<br>\r\n\"You will be my experiment subject.\" Lyle said, a smile growing on his face.<br>\r\n<br>\r\nYou and Dracus glare at him as he walks away laughing. \"Don't worry. Nothing's gonna happen while I'm here.\" Dracus assured you.<br>\r\n<br>\r\n\"And, let's not forget the one who cooked up this great feast of ours! Gill! Come over here!\" Wil called out.<br>\r\n<br>\r\nYou hear some crashes as a boy with red hair rushes out of the kitchen. He stops in front of you and bows.<br>\r\n<br>\r\n\"My name is Gill, and I'm the chef. It is very nice to meet you.\" he said.<br>\r\n<br>\r\n\"No, please! The pleasure is all mine.\" you said.<br>\r\n<br>\r\nWhen Gill stands back up, you notice the eerie yellow of his eyes.<br>\r\n<br>\r\n\"Okay gang, food time!\" Wil shouts.<br>\r\n<br>\r\nAnd just like that, everyone takes a seat around the large table, piling their plates with various foodstuff to eat. You take your own seat and begin eating yourself. It was heavenly! The flavor was delicious, and you continued to eat more and more. Suddenly, you feel a strange rumbling in your stomach. That's when you notice it.</span></div></div>",
            "created":1394725920,
            "id":1759753,
            "title":"It's Party Time!"
        },
        "11313":{
            "author_id":"doctor",
            "author_name":"The Author",
            "choices":[
                "Dragon Fire or Tiger Blood",
                "Pumped Up"
            ],
            "content":"<div class=\"\"><div> <span>\"Let's just talk,\" you say, taking a seat on some bleachers alongside the gym walls.<br>\r\n<br>\r\n\"Sure, okay,\" Drake replies and jumps up on them and takes a seat a bit further up than you. He leaned back and stretched and for a moment you were sure you saw a few red scales on his smooth preteen armpits. Then he finished and you lost sight of them, though it, together with a bunch of other things, was making you wonder. \"So I'm Drake, I'm the trainer here, but you know all that. What about you?\"<br>\r\n<br>\r\n\"Oh, um, I'm Michael and I'm seventeen. I used to live near here then I moved when I was seven, and I just moved back last week.\"<br>\r\n<br>\r\n\"Nice. What made you come out to visit us?\" Drake asked.<br>\r\n<br>\r\n\"Well I used to come to this spot a lot when I was little. It was sort of my own little spot where I could be by myself, or sometimes play with my friends,\" you explained, \"So I wanted to visit my spot and I found your little cottage here and, well, here I am.\"<br>\r\n<br>\r\n\"Oh, I'm sorry,\" Drake said, \"We didn't know we were setting up on a spot special to someone.\"<br>\r\n<br>\r\n\"It's... well it's not okay, but it belongs to the forest I guess,\" you sigh, \"So I guess I forgive you. But what are you all exactly?\"<br>\r\n<br>\r\n\"What do you mean?\" Drake asked, though there was an edge of nervousness to his voice. \"We're just a bunch of kids living in the woods.\"<br>\r\n<br>\r\n\"No you're not,\" you reply. You weren't brilliant, but you were smart enough to know something odd when you saw it. These weren't just kids, and you could see that easily. \"Luke's spooky, Wil's way more authoritative than a twelve-year old could possibly be, and you have red eyes and scales.\"<br>\r\n<br>\r\n\"I don't have scales,\" Drake protested with a laugh, \"You're seeing things dude.\"<br>\r\n<br>\r\n\"Perhaps, but there's plenty of other things off about this place. It's bigger on the inside for example.\"<br>\r\n<br>\r\n\"Oh, no it, uh, it just looks smaller outside than it actually is,\" Drake stuttered, clearly not good at lying.<br>\r\n<br>\r\n\"And does Luke normally stalk people simply for living near this place?\"<br>\r\n<br>\r\n\"No, he just- come on man, I'm not good at this sorta thing,\" Drake whined, sounding more and more nervous.<br>\r\n<br>\r\nWell that confirmed one thing; Luke had definitely been stalking you before, which explained that uncomfortable feeling at home. You weren't really sure about anything else, but you had your suspicions. Still, it was probably best to avoid annoying these kids too much, especially with Luke around. Or Drake even, if he really was what you suspected him to be. \"Alright, so let's get to working out,\" you say, \"What kind of drinks do you have?\"<br>\r\n<br>\r\n\"Oh! Well I have Dragon Fire, Tiger Blood, not real blood mind you, and Pumped Up,\" Drake explained, his cheeriness restored.<br>\r\n<br>\r\n\"Okay, well I guess I'll have...\"</span></div></div>",
            "created":1317445200,
            "id":1198906,
            "title":"Know you better, so let's chat!"
        },
        "113131":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Dragon Fire",
                "Tiger Blood"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll have either Dragon Fire or Tiger Blood.\" you say.<br>\r\n<br>\r\n\"Um, Michael, can you please specify which one?\" Drake says, tilting his head slightly.<br>\r\n<br>\r\n\"Yeah, about that. I've never heard of any of those drinks before, so I'd like to see those two myself.\"<br>\r\n<br>\r\n\"Understandable.\" Drake says, shrugging his shoulders.<br>\r\n<br>\r\nHe stand up from his seat and heads towards a small closet on the side. Drake comes back holding two bottles in his hands. He gives it to you, so you can examine it more thoroughly. The Dragon Fire bottle has a picture of a dragon's head breathing fire, with the name spelled out with the flames forming letters. As for the Tiger Blood drink, it had a picture of a burly tiger flexing one arm, with the name written on the large tiger's bicep. You look back at Drake, who just shrugs again.<br>\r\n<br>\r\n\"So, are you gonna drink one or not? I'm not allowed to let you have more than one drink.\"<br>\r\n<br>\r\nWait, you can only drink one of them? Oh well, you're kinda curious about the taste anyway...</span></div></div>",
            "created":1358571600,
            "id":1511378,
            "title":"Dragon Fire or Tiger Blood"
        },
        "1132":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Jump in the pool",
                "Don't jump",
                "Luke enters the area"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, there can't possibly be a pool out back! There is no out back at all! This cabin is sitting at the edge of a cliff, remember?\" you say, your insides feeling a little warmer, but still icy cold from Luke. \"Oh, I beg to differ.\" Wil says, smiling at your confusion. \"We do have a pool out back. Luke, can you kindly show him the way?\" \"Yes sir.\" he says, immediately walking away.<br>\r\n<br>\r\nYou quickly follow after him, sprinting a little bit. You stop and stay at around three feet behind him, so you can feel the horrid sensation the least while still able to keep a visual on him. After a short while, you're lead to a pair of glass double doors, with the sun shining through it. As Luke leaves, you peer inside and gasp as you see a huge swimming pool, right there in the sunlight! It took you a few seconds to realize that you look ridiculous staring through the door like that, so you enter the swimming pool area.<br>\r\n<br>\r\nYou look around and see a tall lifeguard's chair to the side, and there's someone there! You walk closer and see that it's Luke! \"Hey, Luke! Is that you?\" He sees you and jumps off the chair. \"Nope, sorry. If I was, then I bet your insides would be getting frozen into an ice sculpture right now.\" He's right. He seems more active than Luke...And nicer, since you're not getting the same feeling off of him. \"Anyway, my name's Lyle, Ly for short, but no one ever uses that one. But if you'd like, you can just call me some other names that start with 'L' such as Lee, or Lucian...or Lu...uh...Lenard, and um...Hmm...Darn, I'm all out...\" Well, at least he's not acting scary like Luke. \"So, Lyle...Can I go swimming?\" \"Sure! We've got a changing room around here, so you can change clothes if you'd like. Or better yet, how about you swim right NOW!!!\"<br>\r\n<br>\r\nLyle grabs you by the shirt and 'lightly' pushes you toward the water. You manage to regain your balance a few steps away from the water. \"Hey! What the heck was that for!?\" you shout. \"Hahahahaha! You don't know? Didn't Wil tell you that everything here has a special little side effect on the guests?\" Your head starts filling with questions. But why would he try to make you go swimming like that? It's like he wants to see what happens...\"Heheheh, alright...I'll tell you all about the side effects that can happen in this place. If you were to jump into that special water I made in my lab the other day.\" Special water from his lab? Does he mean the pool water!? No way would you want to come in contact with any unknown chemicals, not from this madman, er, boy. But, he said he'll tell you everything about the effects in this weird cabin...But who knows what'll happen to you if you jump in that pool! Are you willing to take that chance?</span></div></div>",
            "created":1316322000,
            "id":1189423,
            "title":"The Pool"
        },
        "11321":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Head back to your room",
                "Find another employee"
            ],
            "content":"<div class=\"\"><div> <span>\"If I jump into this water, will you really tell me what I wanna know?\" \"Yeah, sure, whatever.\" \"No! You gotta promise me that you'll tell me!\" \"Fine, fine, I promise.\" You turn around and look at the water. It looks normal enough, like water from any old pool. You really don't wanna go in there, but if it means learning what you need to know, then there's no other choice here...<br>\r\n<br>\r\nYou jump in, making a big splash and almost hitting Lyle with the water, almost. As you float to the top, nothing happens...so far. Lyle walks to the edge and crouches down to get a closer look on you. \"Okay, I jumped into your dumb lab water, now tell me everything!\" \"Tsk, tsk, tsk, not yet I will...\" You start feeling a strange sensation on you backside, neck, and fingertips. You feel your back and find a growing bulge underneath your pants! Your body suddenly feels numb, and you can't seem to move. \"Wh-what's...happening?\" you say, looking at Lyle. He starts smiling, sitting on the very edge of the pool, his feet submerged in the pool water. Unable to feel your body or move it, all you can do is float on the water's surface, watching Lyle smile at you as he splashes a bit with his feet.<br>\r\n<br>\r\nWhen all feeling finally returns to you, you move around a bit, feeling another strange sensation. Your body seems normal, but there's also something about it that's not normal. \"If you're confused about what happened, I suggest taking a better look at your body.\" You turn around in the water, trying to look at yourself. You see blue skin, a tail, webbed feet and hands...What the heck happened to you!? \"Here.\" Lyle stretches out his hand, offering to pull you up. You decide to let him help you up, even though he didn't do much considering the fact that he's still sitting on the pool edge. You look at the rippling water, and almost make out a head...Wait, that's a shark's head! You touch your face and find it pointing down and in front of your face! You must've thought your nose in front of you was just the water. \"What the? I'm...I'm a shark!\" \"That's right, at least, you're half a shark. You still have webbed hands and feet, and you're also capable of breathing in and out of water.\" You get the urge to bite his head off and rip the rest of his body into pieces. You try to control yourself, however, since he still hasn't told you what you wanted to know.<br>\r\n<br>\r\n\"Alright, now you'd better tell me right now, everything you know here, before I get impatient and bite off your arm!\" \"Hehehe, alright already. I'll tell you.\" He stands up in front of you, and begins walking around you. Your urge grows stronger and stronger, until you notice something. His feet, they were in the pool water the whole time, but it's still human! \"Oh, you noticed? Heheh, I'm not gonna share my secret of course, but I will share Wil's secret about the cabin.\" Lyle walks to a chair and sits down. He invites you to a chair next to him, so you sit there. \"What I'm about to tell you is strictly confidential. Don't tell Wil or Luke that I told you all of this. You see, Wil is looking for a new toy to play with, so we built this cabin to attract unsuspecting victims. The thing is, Wil is completely relentless when it comes to playing with toys, so they tend to...break after a while.\" You gulp after hearing the word break. If you were the newest toy, how did all the other toys break? \"Anyway, some of us disapproved his idea, and they ended up...punished severely for it. Luke completely lost his emotions, and can only feel what Wil wants him to feel.\" \"That's impossible! How can anyone lose their emotions?\" \"Well, Luke went through a traumatic experience when he spoke his mind to Wil, and ever since then, he's had that horrible cold air around him.\" You shudder at the mere mention of the sensation you felt when Luke was nearby. \"So now, none of us have the courage to stand up to Wil, even if we were to join together. And, Luke was also turned into Wil's puppet, always following his directions. Only once or twice have I seen him question his command, or even ignore it completely. I think Luke still remembers how to feel for others, or something. Anyway, Luke is Wil's eyes and ears. That's all you need to know about him.\" You nod, understanding some of the things Lyle told you. \"One last thing you do need to know. Wil likes to distort reality a lot, so he wants us to enjoy morphing the toys' body a lot. And the change I've done is turn you into an anthropomorphic shark. And besides, if we don't do our jobs, he'll punish us until we do it. I don't plan on having to go through it again, believe me.\" Lyle stands up and jumps into the pool. \"Hey! What are you doing!? That water'll turn you into whatever!\" \"Nah, it doesn't work on me!\" You remember his feet again. \"I suggest you go now! Or someone will check up on you!\" You stand up and look at yourself. Your pants are torn, but that's all the damaged that's been done. You head to the doors, and look back to see Lyle coming out of the pool, still human. As you head inside the cabin, you're unsure of what to do next.</span></div></div>",
            "created":1317531600,
            "id":1199193,
            "title":"The Pool's effects"
        },
        "113212":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "A yellow bag",
                "A white bag"
            ],
            "content":"<div class=\"\"><div> <span>You decide to go try getting some more info from the other employees around the cabin. Except, you're not exactly sure just where to start. You wander around for a little bit before you spot a sign above some double doors. \"The gym? I guess someone's bound to be inside there.\" You cautiously open the door and look inside. The place was huge! It's gotta be about 3 stories big in there! \"Whoa...Is this place another distorted reality like what Lyle told me?\" You scan the place and spot no one using any of the workout machines inside. You shrug your shoulders as you turn back to look for someplace else. When you close the door and look behind you...<br>\r\n<br>\r\n\"What do you think you're doing?\" You freeze as you see a blonde kid wearing a red shirt and blue pants looking at you curiously. \"Ah, I was just, um...\" You try to think up of a good excuse to use. \"Hey Drake! I'm back with the snacks! Huh? Who's this guy?\" You see a red-haired boy run up to the first employee holding a bunch of snacks in his arms. \"I was just getting to that, Gill.\" Drake said. The two look at you inquiringly and you feel more and more uneasy. \"Ah, I was just, um...Looking for some help!\" \"Really? What kind of help?\" Drake asked. \"Well, I met Lyle, you see, and-\" \"What!? You met Lyle!!! Is that why you're a shark-man!?\" The boy named Gill shouted. \"Er...yes...\" \"Well why didn't you say so? Come with us.\" Drake said, leading you into the gym. You have no other choice but to follow the two inside. You all sit down on the bleachers on one wall as they began asking you if you're alright. You tell them everything that happened at the pool. \"Oh, don't let him get to you. He just loves doing these things to people.\" Drake said, stroking the fin on your back. \"He's a total jerk! Straight and simple!\" Gill said, laying down the snacks in front of him. \"Yeah, but is everything he said really true?\" you ask. The two nod their heads, and you start feeling a bit sorry for Luke. \"You know, another strange fact is Luke happens to be Lyle's twin brother, yet they have completely different personalities.\" Drake said. \"Yeah, I kinda already noticed that.\" \"Just be careful around him. If he's causing you any trouble, just call on Luke!\" Gill said. \"What!? But I thought Luke was supposed to be bad news!\" \"We know, but he's also the only real person that Lyle would listen to. He only sometimes listens to Wil, and that's saying something.\" Drake said, looking at his hands, as if checking something.<br>\r\n<br>\r\nYou notice something very odd. Gill brought a lot of snacks with him, but no one has even started opening a single one! \"Hey, uh, just what are all those supposed to even be for?\" you ask, pointing to the pile of junk food in front him. \"Oh, this is just some experimental stuff that I got from Wil. He said that we should try testing them out when we have time. You wanna try it out?\" \"Ah...What does it even do exactly?\" \"Dunno, but I hear it's supposed to give someone great power.\" Drake said, grabbing a bag and inspecting the back. You feel like trying out one of the bags to find out if it's true. \"Or make them plump out like a marshmallow!\" You look at Gill with a surprised face. He just smiles back at you. \"*sigh* If I'm gonna be up against someone that can distort reality to his whim, I might as well try raising my chances of survival.\" You reach out to grab...</span></div></div>",
            "created":1323406800,
            "id":1237289,
            "title":"Unsuspecting Encounter"
        },
        "1132122":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "you stop growing.",
                "...Wait, you're still growing?"
            ],
            "content":"<div class=\"\"><div> <span>You tear open the white bag, seeing the snacks inside. They look like perfectly normal potato chips. You look at the others, who aren't eating any themselves. You shrug as you begin eating it one by one. They were pretty tasty, and you begin eating it by the handful. Before you even realize it, the bag was already empty. You reach out for another one, but Drake suddenly grabs your outstretched arm.<br>\r\n<br>\r\n\"Whoa there, you have to let the snacks take effect before you start eating another bag!\"<br>\r\n<br>\r\nYou just nod as you patiently wait there. In a minute, you could feel your stomach grumbling as you let out a light burp. Your whole body starts feeling a little warm as you look yourself over.<br>\r\n<br>\r\n\"Hey, did you work out recently?\" Gill asked.<br>\r\n<br>\r\nYou just stare at him, irritated that he would ask something like that. You've been sitting there with them! You expected him to be a little smarter than that. But, you do feel a little warm. Also, your clothes feel a little tighter than before.<br>\r\n<br>\r\n\"Hey...You're growing!\" Drake said.<br>\r\n<br>\r\nYou look at yourself and realize that he was right! You were originally thin and lithe, but now there are visible muscles on your frame! You flex one arm and see the bicep make a small mound of muscle on it, with a small vein to compliment it too!<br>\r\n<br>\r\n\"Wow, this is amazing!\" you say.<br>\r\n<br>\r\nYou feel your body getting warmer, and your muscles grow bigger and bigger! You've got baseball-sized biceps, quads the size of small trees, washboard abs, and it all continues to grow! You decide and test your strength. You walk up to a dumbbell on the ground and lay you webbed hands around the bar. You see the two kids eying you eagerly, waiting for you to lift the heavy weights. You pull, and the weights come up to your chest. With another heave, you lift it above your head. The two clap and applaud as you drop the bar. They immediately set heavier weights for you to lift. When they're done, they tell you it's worth 300 lbs.<br>\r\n<br>\r\n\"300!?\" you say. You've never lifted that much before!<br>\r\n<br>\r\nThey just urge you on as you comply. Your muscles are still growing, and you hope that you're ready for this. With a few heaves, you actually manage to get it off the ground! But there's still the final challenge. You push, inching the bar above your head bit by bit. And soon, you hear their applause and cheering once more. You've just lifted 300 lbs. on your first try! You drop the bar and make a pose as the two continue to cheer on for you. You bring a flexed arm to your face and kiss it, loving this turn of events! Soon, your body no longer feels warm and...</span></div></div>",
            "created":1367405880,
            "id":1582215,
            "title":"The White Bag"
        },
        "11323":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Gently. He probably reacts to positivity better, after Luke's threat.",
                "Roughly. This guy needs to be taught a lesson, and your fists might just work."
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, you hear the doors of the swimming pool flap open. The two of you look to see Luke standing by the doors, glaring daggers at Lyle. He briskly walks towards him, and you see that Lyle has tensed up, a look of fear in his eyes. You can almost feel the animosity Luke is permeating in your own bones.<br>\r\n<br>\r\n\"What do you think you're doing?\" Luke asks.<br>\r\n<br>\r\n\"I...Wanted to let the guest take a dip in the pool.\" Lyle said, looking away.<br>\r\n<br>\r\n\"Well, it's a good thing I didn't really leave. I was by the door when I saw you start talking with the guest, and I saw you try to push him into the experimental water.\"<br>\r\n<br>\r\nExperimental water? So the pool water really is from a lab! Lyle merely scratches his neck as Luke stares him down with eyes that could pierce through your soul.<br>\r\n<br>\r\n\"Don't mistreat the guests. Understand? I'm only warning you this one time. If I ever catch wind of any misbehavior from you, I will end you.\"<br>\r\n<br>\r\nLyle quickly nods his head, his breathing going shallow as Luke just stood there. Then, Luke blinks a few times before facing you, the cold feeling ebbing away.<br>\r\n<br>\r\n\"If he ever mistreats you, please do not hesitate to report him to Wil, or me. We will deal with him accordingly.\"<br>\r\n<br>\r\n\"Y-yes sir!\" you say.<br>\r\n<br>\r\nWith that, he bows his head a little before turning to the door and walking out. Lyle lets out a deep breath as he slumps to the ground, hands on his head.<br>\r\n<br>\r\n\"That was close. Too close. Way too close.\" he mutters to himself.<br>\r\n<br>\r\nNow you're presented with a choice. You could ask him about the side effects he was talking about earlier. But, how to do it?</span></div></div>",
            "created":1438685460,
            "id":2016500,
            "title":"Twin Psychos"
        },
        "114":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "knock on the door.",
                "enter without knocking.",
                "stand in the hall."
            ],
            "content":"<div class=\"\"><div> <span>Deciding to see exactly what had taken away your favorite hiding place, you wandered the hall outside your hotel room. Some of the doors you passed were open and you peered inside, seeing no harm in being curious. Through one door, you saw what appeared to be a little girl's room with pink walls, a white canopy bed and dresser, and a white vanity with dolls and stuffed animals on the floor in one corner. Curiously, you were tempted to walk in but you held back, not wanting to anger anyone for invading their private space. \"Cute.\" whispering, you said. \"It must belong to one of the younger girls who work here.<br>\r\n<br>\r\nMoving on, you saw another open door. Looking inside, you were surprised to find a boy's bedroom that looked much like your room did when you were six years old. Again, you felt the urge to walk inside, just to look around but shrugged it off, knowing it was not right to do so. \"I wonder whose bedroom this belongs to.\" mussing, you said. \"He might be surprised to know I played with the same toys as a kid.\"<br>\r\n<br>\r\nChuckling at the thought, you continued down the hall to find another open door and peered inside to find what looked like a play room. There, he saw a six year old boy with black hair wearing a blue hooded shirt dancing to a catchy instrumental tune with a six year old girl with long blonde hair wearing a dress made of pink feathers. You smiled, watching them and were greatly tempted to join them. You found that you had to force yourself to step away from the door, not wanting to spoil their childhood fun but you could not get yourself to move on or even move back to your own room. Something was calling you to one of the three rooms you had peered into and the urge was not about to stop nagging at you.<br>\r\n<br>\r\n\"I can't just walk into a child's bedroom.\" disturbed, you thought. \"It's wrong, I have no business to do such a thing.\"<br>\r\n<br>\r\n\"You have a good heart, sir.\" startling you, a voice said.<br>\r\n<br>\r\nYou spun around to find a twelve year old boy with scarlet-red eyes, a red shirt and blue pants. \"S-Sorry.\" blushing, you said. \"I did not see you at first.\"<br>\r\n<br>\r\nThe boy shrugged. \"I am Drake, the gym trainer.\" smiling, he said. \"I'm sure Akira and Elly would not mind you entering their rooms as long as you ask them first.\" he pointed into the playroom. \"The song is almost over, now would be a good time to knock and ask them. Just be ready for a little 'fun' if you do ask to enter.\"<br>\r\n<br>\r\nWith that said, he walked away, just as the music stopped. You were not sure what to make of how Drake said 'fun' but the urge to enter one of the three rooms was still nagging at you. What do you do?<br>\r\n</span></div></div>",
            "created":1350795600,
            "id":1450897,
            "title":"Explore the hotel"
        },
        "1141":{
            "author_id":"scilock",
            "author_name":"Scifiwizard",
            "choices":[
                "Elly.",
                "Akira.",
                "Suggest your own game."
            ],
            "content":"<div class=\"\"><div> <span>I politely knocked on the door as the song stopped and Elly answered. \"Oh, hi!\" smiling, she said. \"You must be our new guest, how can we help you?\"<br>\r\n<br>\r\n\"Yes, well...\" you blushed slightly. \"Forget it... it's silly...\"<br>\r\n<br>\r\n\"Don't be shy, mister.\" walking to the door, Akira said. \"What's on your mind?\"<br>\r\n<br>\r\n\"I heard the music and saw you two dancing and I was tempted to join you.\" blushing more, you replied. \"Only it would not be right... an adult playing with children.\"<br>\r\n<br>\r\nElly giggled and motioned you to come closer. You knelled down to her level and she touched your nose. There was a slight spark, making you feel dizzy but, when your vision cleared, you were suddenly standing eye to eye with the two six year olds! \"Now you are a child too.\" smiling, Elly giggled. \"We can change you back after we are done playing, okay?\"<br>\r\n<br>\r\nTo say I was startled was would have been an understatement but I somehow felt calm about it. \"I- I guess that's okay.\" seeing you were wearing children's clothing, you said. \"What shall we play first.\"<br>\r\n<br>\r\n\"That depends upon who you want to play with first.\" smiling, Akira replied. \"If you decide to play with Elly, you will likely play house or with dolls. If you decide to play with me first, you will might play hide and seek or with cars.\"<br>\r\n<br>\r\nWho do you decide to play with first?<br>\r\n</span></div></div>",
            "created":1367176080,
            "id":1580334,
            "title":"knock on the door."
        },
        "11413":{
            "author_id":"adobefat",
            "author_name":"Adobefats",
            "choices":[
                "Chasing begins as does hiding...",
                "Something goes amiss..."
            ],
            "content":"<div class=\"\"><div> <span>Suggesting to play together being they the friends as Indians to me the tough Cowboy made Elly smile and give a smirked grin to her friend Akira.<br>\r\n<br>\r\n\"Great idea, as we will be the Indians who chase the cowboy and capture him, we could torture him or...\" Akira said, as he looking to then Elly, she shook her head and seemed disgusted with the idea.<br>\r\n<br>\r\n\"We could chase and mix it with a hide and seek game, me needing to find places to hide from two mean Indians.\" I suggested, trying to urge them to join in to what I thought as being fun.</span></div></div>",
            "created":1375803720,
            "id":1641433,
            "title":"Cowboy and Indians"
        }
    },
    "info":{
        "author_id":"wolffurry",
        "author_name":"wolffurry",
        "brief_description":"You've been trapped by 7 \"kids\", who are not as they appear. Can you escape? Probably not.",
        "created":1305111900,
        "description":"<td align=\"left\" class=\"norm\">You decide to visit your usual secret spot in the forest, right next to a beautiful seaside cliff. Only, you see a big cottage house there, and it wasn't there before too. After you decide to visit the place, you're met with seven kids, five of which are twelve year olds, the other two are six. The thing is, they enjoy doing all kinds of things to visitors, and they're not gonna let go of their newest toy. Can you get out?<br>\r\n<br>\r\n-You can make the character look like he/she is enjoying it or not.<br>\r\n-You can make him/her gain weight/muscle, transform to an animal/anthro, grow to macro sizes, etc.<br>\r\n<span style=\"text-decoration:line-through\">-No adult anything, unless really necessary. And I mean really necessary.</span><br>\r\n-After some years of this interactive existing on the site, I've decided to be more lenient with adult things. Chapters that involve nudity, description of certain parts, and romantic advances are considered okay. Straight-up sex will need to be kept brief, with half the chapter length at max. Other than that, you're free to be descriptive of it if you want.<br>\r\n-The kids should always look like they're toying with the main character, or trying to get the main character to believe whatever they tell him/her. Something like that. It's just their thing, you know? Good.<br>\r\nOther than the above, just write whatever you want, okay?<br>\r\n<br>\r\nCharacter update:<br>\r\nWil - The manager/receptionist/mastermind. He's about twelve years old with brown hair and blue eyes. He's also the leader, the way the others act and talk about him. He seems to be watching the whole game with the use of a chess board and pieces. He's the werewolf piece. He has dark secrets about the other kids...<br>\r\n<br>\r\nLuke/Lucario - The guard/guide/spy/bellboy of sorts. He's twelve years old and wears a long black cape that covers most of his body. He rarely ever talks, and only focuses on the task given to him by Wil. He's very loyal to him, but sometimes helps the guest, maybe. He's the blue dog piece. He has a very cold air about him, like whoever isn't used to being with him will die from over-intimidation. His true form is the Aura Pokémon. Seems to have personal issues with twin brother Lyle.<br>\r\n<br>\r\nGill/Guilmon - The chef/resident knucklehead. He's also twelve years old with red hair and wears a blue bandanna on his left arm. He's the red T-Rex piece. He enjoys both cooking and eating food, but mostly the eating part, even though he's thin. He doesn't enjoy watching the side-effect of the food he makes on the guest, but has to do it because of what Wil once did to his arm, leaving scars the shape of scratch marks...Has an incredibly deep hatred towards Lyle.<br>\r\n<br>\r\nAkira - A welcomer/friendly guide. A six year old with black hair wearing a blue hooded shirt who's always with his partner. He just wants the guest to be happy. He can be irritating though.<br>\r\n<br>\r\nElly - A welcomer/friendly guide. A six year old with long blonde hair wearing a dress made of pink feathers who's always with her partner. She wishes the best of luck to both her partner, and the guest. She can be annoying though.<br>\r\n<br>\r\nDrake/Dracus - The gym trainer. A twelve year old who never grows any muscle. He has scarlet-red eyes, a red shirt and blue pants. He's usually an honest person, and doesn't like having to lie to the guest, hence why he's not even good at it. He always asks the new customers if they want to drink something before working out. Good with kids. Also, he sometimes warns them about seeing him with red scales...As a hatchling, Wil found him one night and has been loyal to him ever since. His true form is a bright red and dark blue dragon.<br>\r\n<br>\r\nLyle - The pool lifeguard/mad scientist. A twelve year old who has a tendency to act like a psycho sometimes. He wears a white shirt, white pants, and glasses. He's willing to tell you info if you were to take part in his possibly life-threatening experiments. His twin brother Luke is the only one that can control him all the time. He enjoys either telling the guest stories about themselves, or just plain messing or tricking the guest. He's the white bird piece. Has an equally deep hatred towards Gill, but he can easily hide it, no matter the circumstances. Has personal issues with his master, causing a rift between him and his twin brother.</td>",
        "id":1775421,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1547902920,
        "modified":1547902920,
        "pretty_title":"These children are not normal!"
    }
}