{
    "chapters":{
        "1":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "Ate a new Devil Fruit",
                "a Scroll she found in the library",
                "a magic potion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Hancock become a Fat Giantess?</span></div></span></div>",
            "created":1394996520,
            "id":1761332,
            "title":"Beginning"
        },
        "11":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "She quickly grows and expands.",
                "She slowly grows and expands."
            ],
            "content":"<div class=\"\"><div> <span>The beautiful Pirate Empress and ruler of Amazon Lilly Boa Hancock was sitting on her throne bored and also craving to see the one and only man who not only melted her heart but who also owned it: Monkey D. Luffy the Captain of Straw-Hat Pirates and future Pirate King. She had a strange dream the previous night that had her worried. She saw her beloved Luffy with those two devil women of his crew they were seducing him. She had received information on them from her former fellow Shichibukai Jinbei. The archeologist called Nico Robin had originally been a threat to Luffy and his crew while she worked for the secret organization ran by another former Shichibukai Crocodile. That made Hancock's blood boil to know such information. The orange haired girl named Nami was a notorious pirate-hating thief.  Nami had been originally working under Arlong and she had even once actually betrayed Luffy during their first meeting when facing that pathetic Buggy loser. Hancock gripped her throne's armrests upset. The Snake Princess was hearing a voice in her head telling her to track down the Straw-Hats and make Luffy hers at last. Her beautiful face gained a healthy red blush at the thought of finally becoming true soul mates with her straw-hat hopeful husband but there was some issues that needed taking care of first. <br>\r\n<br>\r\nHancock's thoughts were interrupted when one of her crew-members came in. Hancock fixed her  expression to the cold, cruel, and stern woman they knew. She spoke in an icy cold tone, \"You'd better have a good reason for coming in and disturbing my train of thought. If I do not like your excuse I will petrify you.\" The thing that made Hancock's heart flutter for Luffy even more was that he had kept his word and never told any of the other Kuja pirates/islanders about the true origin of the 'Gorgon sisters'' abilities being results of Devil Fruits force-fed to them instead from legendary mythological monsters. <br>\r\n<br>\r\nThe Kuja gulped, \"Forgive me for interrupting you Hancock-sama but I found a strange fruit.\"<br>\r\n<br>\r\nHancock was surprised but didn't outwardly show it, \"A strange fruit? Show me.\" <i>A Devil Fruit?</i><br>\r\n<br>\r\nthe Kuja holds up a strange fruit shaped similar to a pineapple only it was a light pink color. <br>\r\n<br>\r\nHancock looks at it, the strange fruit drawing her interest. <i>I've never seen one that color before</i> \"Give it to me.\"<br>\r\n<br>\r\nThe Kuja obliged giving Hancock the fruit.<br>\r\n<br>\r\nHancock looked at it and dismissed the Kuja, \"You may leave now.\"<br>\r\n<br>\r\n\"Yes Hancock-sama,\" The Kuja turns and leaves.<br>\r\n<br>\r\nHancock studies the pine-apple like fruit. <i>It wouldn't matter if I chose to taste it. I already have Devil Fruit powers.</i> She nods at her reasoning before taking a bite of the fruit and drops it in disgust. She stood from her throne and crushed the fruit under her shoe, unaware it would take a bit for this fruit's effects to take affect. She walks to her bedroom. </span></div></div>",
            "created":1395019500,
            "id":1761547,
            "title":" Kyo Kyo No Mi, Model: Shibō"
        },
        "111":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "She was the size of the island",
                "She was much larger and completely envelops the island "
            ],
            "content":"<div class=\"\"><div> <span>Hancock felt her entire body tingling and stopped walking, \"What is this?\" she suddenly began to grow fatter, her body began to fill out, her ass and stomach quickly grew  fatter and fatter to where her  blue dress could just barely cover them, her arms and legs quickly filled with rolls of fat. Her face became rotund and even cuter and she gained several more chins. She gasped seeing her newly fattened body in a nearby full length mirror, \"What happened to me?! I've become fat! What will Luffy think if he sees me like this?!\" but then she remembered her beloved loved to eat a lot and wondered. \"Maybe he'll accept my love with me like this since it obviously means I can eat big meals by his side now.\" She giggles at the thought of eating a big feast beside her love. <br>\r\n<br>\r\nHancock does a few poses getting  quickly used to her new figure. \"I have heard the saying bigger is better.\" she winks at herself. She felt more tingling and felt herself become even fatter but this time she also felt her body grow bigger and larger. She was surprised seeing she now stood 25  ft tall, \"I'm getting really big if I continue growing I should get out of the palace so I don't ruin it,\" she waddled towards the door feeling herself tingle again, \"I hope I can make it,\" She manages to crash through the wall and door just as she began growing even larger and this time she didn't stop until she was as big and tall as her whole palace and then became larger, \"This new Devil Fruit is amazing,\" <br>\r\n<br>\r\nThe residents of the island were stunned to see their newly massive fat leader. <br>\r\n<br>\r\nHancock moans as she felt herself continuing to fatten and become much larger until...<br>\r\n<br>\r\n</span></div></div>",
            "created":1430750520,
            "id":1973293,
            "title":"She quickly grows and expands."
        },
        "1112":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "Hancock was gassy",
                "Hancock was hungry",
                "timeskip to the ship being done"
            ],
            "content":"<div class=\"\"><div> <span>Hancock was so massive the entire island was enveloped and crushed beneath her monstrous flab  \"Oh dear guess I grew too big for the island,\" She found herself not caring that several lives were suddenly snuffed out under her, a new thought entered her mind erasing all others, this singular thought being to find her darling straw-hat Luffy and finally become a true couple with him, she knew cause of his Gomu Gomu No ability, it would really help them. (This is how Hancock looks currently <br>\r\n<a rel=\"nofollow\" href=\"http://fc03.deviantart.net/fs71/f/2014/306/f/f/bigger_boa_by_saxxon-d852wyu.png\" target=\"_blank\">http://fc03.deviantart.net/fs71/f/2014/3...</a>)<br>\r\n<br>\r\nHancock purrs, \"Luffy my beloved, your future queen is coming for you,\" She found out her new mass could float, it seems eating 2 devil fruits erases the weakness to sea water and seastone, She floats over to another different island. She would demand they build her a ship huge enough for her. <br>\r\n<br>\r\nThe residents were just minding their own business when they felt the island quake and they looked and gasped in horror seeing a mountainous blob woman waddling onto the island she was larger than the island so she could only be partially on it. <br>\r\n<br>\r\nHancock looks down on the residents as a true goddess would, \"Puny insects! You listen well! I am the beautiful Boa Hancock soon to be Monkey D. Hancock! I am seeking a ship worthy of carrying my beautiful self to my future Pirate King! You will build me this ship within a month's time if you do not comply I will destroy your island!\" <br>\r\n<br>\r\nThe residents gulp and know she meant business and so they got to work.<br>\r\n<br>\r\nHancock smirked but then an ominous rumble sounded from her mighty belly.</span></div></div>",
            "created":1430756040,
            "id":1973331,
            "title":"Larger than continent sized goddess"
        },
        "11121":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "Hancock continues farting ",
                "Hancock gets hungry "
            ],
            "content":"<div class=\"\"><div> <span>Hancock rubs her giant flabby belly and relieved the pressure releasing a massive hurricane like fart, FFFFRRRRRRRRRRRRRRRRFFFRRRRPPPPPPPPPBBBBBBBBPPPPPPPPPPBBBBLLLLLBBB!!!! Her fumes were so powerful they kicked up tsunamis like an actual storm would.<br>\r\n<br>\r\nHancock sighed, \"I feel a bit better but I still feel a bit more,\" She grunts and unleashed yet another hurricane like fart, BBBBBBBBLLLLOOOOOOOOGGGGGGGGGGGGMMMMPPTPTPTTTTP!!!!!!!!!!<br>\r\n<br>\r\nThe residents could smell her fumes and many of them gagged. <br>\r\n<br>\r\nHancock was enjoying letting her gas go, her new size had erased many restraining traits she once had, she figured the best way to win her beloved Luffy over was to intimate his carefree traits. So the massive snake princess just let her gas rip freely. Her belly gurgles with more. <br>\r\n<br>\r\nHancock giggled,  \"Oh I am going to fart again.\" She grunts and let's loose another wind storm sized fart, BBBRRRRRRRRRRRRRRMMMMMMMPPPPPPPPPPTPTT!!!! She giggles and patted her still gurgling belly, \"Goodness I wonder what I ate today to be so gassy?\"<br>\r\n<br>\r\nPPPPPPPPPPPRRRRRAAAAAAAAAAARRRRRRRRRRRRPPPPPPPPPPPPPPPPBBBBBBBRRRRRPPPPPPTTT TTT!!!!!!!<br>\r\n<br>\r\nAnother hurricane force fart thundered from her mountainous ass making it vibrate. <br>\r\n<br>\r\n\"Oh my such a gassy woman I am right now.\" Hancock said with a giggle stroking her belly which gurgles again.</span></div></div>",
            "created":1430835180,
            "id":1973892,
            "title":"A gassy snake goddess  "
        },
        "111212":{
            "author_id":"animefanjm",
            "author_name":"Hollowichigo2nd",
            "choices":[
                "Hancock decides to just eat them and go to another island",
                "Hancock wakes them up by shaking the island"
            ],
            "content":"<div class=\"\"><div> <span>Hancock rubs her massive belly as it gurgles again only this time she was quite hungry. She sees the residents busy with building her ship, \"Insects! I the future Pirate queen hunger! Some of you go and bring me all the food, you have on this island! The rest keep working!\"  Her massive belly gurgled loudly like thunder to show her hunger. <br>\r\n<br>\r\nSeveral people quickly scrambled to their homes and places of business that had food in them getting every bit of food they could get their hands on.<br>\r\n<br>\r\n<br>\r\nHancock was more impatient that usual to get to her beloved Luffy so she could at last make him hers, \"You insects better hurry or I'll eat you!\" <br>\r\n<br>\r\nThe people heard her and scrambled over themselves to gather all the food they could and bring it to the blobby pirate queen to be. They hurried as fast as their legs could carry them.  <br>\r\n<br>\r\nHancock snarled impatiently releasing a burst of her Haoshoku Haki in her frustration; killing off all the birds that were flying near her and causing the residents to stop in fear. <br>\r\n<br>\r\nThe residents soon all collapsed from the strain of her Haoshoku Haki burst. <br>\r\n<br>\r\nHancock sees them all knocked out and was outraged, \"How dare these insects faint on the job!!!\" </span></div></div>",
            "created":1431288960,
            "id":1976204,
            "title":"A hungry snake goddess"
        },
        "13":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "instant",
                "gradual ",
                " it also made her a futa",
                "also gave her animal ears and a tail ",
                " it also made her a futa with animal ears and a tail"
            ],
            "content":"<div class=\"\"><div> <span>one day The sexy Pirate Empress Boa Hancock was looking around a new mysterious magic shop that seemed to have just cropped up one day<br>\r\nnothing had caught eye that was until she found a bottle that read<br>\r\nAlvida' magic beauty potion makes you 1000 times sexier<br>\r\n Boa Hancock picked the bottle up<br>\r\n\"shop keep how much \"<br>\r\nthe creepy shop keep smiled and said \" for you 50 beris\"<br>\r\nBoa tossed the shop keep the 50 beris then guzzled the potion down<br>\r\nthe change was <br>\r\n</span></div></div>",
            "created":1410370740,
            "id":1855161,
            "title":"a magic potion"
        },
        "134":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "cat",
                "fox",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what animal </span></div></span></div>",
            "created":1430754780,
            "id":1973322,
            "title":"also gave her animal ears and a tail "
        },
        "135":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "fox",
                "cat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what animal </span></div></span></div>",
            "created":1430754840,
            "id":1973323,
            "title":" it also made her a futa with animal ears and a..."
        },
        "1351":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "300 pounds ",
                "500 pounds ",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how fat is she </span></div></span></div>",
            "created":1430754960,
            "id":1973324,
            "title":"fox"
        },
        "13511":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                "20 feet",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how tall is she </span></div></span></div>",
            "created":1430755020,
            "id":1973325,
            "title":"300 pounds "
        },
        "135111":{
            "author_id":"game98979",
            "author_name":"game98979",
            "choices":[
                " 8 inches (proportionally)",
                "bigger "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how big is her futa dick</span></div></span></div>",
            "created":1430755200,
            "id":1973328,
            "title":"20 feet"
        }
    },
    "info":{
        "author_id":"animefanjm",
        "author_name":"Hollowichigo2nd",
        "brief_description":"The pirate Empress becomes a Fat GTS and goes to find the Straws-Hats. ",
        "created":1394995080,
        "description":"<td align=\"left\" class=\"norm\">The sexy Pirate Empress Boa Hancock is somehow turned into a fat giantess and decides to go out into the world to find her beloved Luffy and finally stake her claim on him. <br>\r\n<br>\r\nRules:) <br>\r\n<br>\r\n-Hancock is very determined to find Luffy and will crush or eat anyone who gets in her way of finding him.<br>\r\n<br>\r\n-Vore, crushing, and stomping is allowed. Scat is allowed as well. Hancock is  allowed to become fatter.<br>\r\n<br>\r\n-The only pairing is between Hancock and Luffy.<br>\r\n<br>\r\n-Hancock knows about Nami and Robin's pasts and doesn't exactly view them in a positive light. </td>",
        "id":1982096,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1431288960,
        "modified":1431288960,
        "pretty_title":"One Piece: Fat GTS Boa Hancock"
    }
}