{
    "chapters":{
        "1":{
            "author_id":"nachtmuziek",
            "author_name":"NachtMuziek",
            "choices":[
                "15-17",
                "18-22",
                "23-26",
                "27-30",
                "30+"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before we begin, how old is the girl who will be punished? This will help determine the setting and context of the punishment.<br>\r\n</span></div></span></div>",
            "created":1519362000,
            "id":2456787,
            "title":"First things first..."
        },
        "11":{
            "author_id":"nachtmuziek",
            "author_name":"NachtMuziek",
            "choices":[
                "Jamie",
                "Leah",
                "Laura",
                "Another set of girls (In case you don't like the ones listed)"
            ],
            "content":"<div class=\"\"><div> <span>Here are the options:<br>\r\n<br>\r\nJamie: A 15 year old redhead with an average sized bust and beautiful green eyes. <br>\r\n<br>\r\nLeah: A 16 year old blonde girl with big boobs and pretty blue eyes. She's curvy but not chubby at all.<br>\r\n<br>\r\nLaura: A 17 year old Hispanic girl with slightly smaller than average breasts but a thick and well toned butt. <br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1519362000,
            "id":2456792,
            "title":"15-17"
        },
        "111":{
            "author_id":"nachtmuziek",
            "author_name":"NachtMuziek",
            "choices":[
                "Home",
                "School",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does Jamie receive her humiliating punishment?</span></div></span></div>",
            "created":1519448400,
            "id":2457261,
            "title":"Jamie"
        },
        "1112":{
            "author_id":"nachtmuziek",
            "author_name":"NachtMuziek",
            "choices":[
                "Public school",
                "All girls private school",
                "Coed boarding school"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of school does Leah go to?</span></div></span></div>",
            "created":1519448400,
            "id":2457263,
            "title":"School"
        },
        "112":{
            "author_id":"nachtmuziek",
            "author_name":"NachtMuziek",
            "choices":[
                "At home",
                "School",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where does Leah first receive her punishment?</span></div></span></div>",
            "created":1519362000,
            "id":2456828,
            "title":"Leah"
        },
        "1122":{
            "author_id":"nachtmuziek",
            "author_name":"NachtMuziek",
            "choices":[
                "...all of the clothes you are wearing.\"",
                "...your blouse and skirt.\"",
                ".... your blouse and bra.\""
            ],
            "content":"<div class=\"\"><div> <span>Leah has always been a huge pain in the ass for her teachers at West View High. She was brilliantly smart, and barely needed to pay attention in class to get A's. But because she didn't need to pay attention, she frequently got bored in class, which often resulted in her acting out. She loved to point out her teacher's mistakes, and because she was also beautiful, the whole class paid more attention to her and her antics than to the lesson at hand. Detention didn't work, as she'd just do the same things there, just on the teachers' personal time after school. Most teachers gave up punishing her, since it didn't work, and instead tried to find ways to keep Leah occupied so she wouldn't negative affect other students' education. <br>\r\n<br>\r\nBut with the new law passed, that was about to change. Mr. Laning, Leah's algebra professor, decided he had enough. Since all other forms of punishment were useless, maybe humiliation would finally get the blonde to stop being such a troublemaker. <br>\r\n<br>\r\nIt all started in algebra class, when Leah started throwing paper balls at Mr. Laning's back while he tried to write an equation on the board. His patience already running thin, the teacher turned around and calmly asked the blonde to cut it out.<br>\r\n<br>\r\n\"What was that, Arthur? What makes you think I'll listen now? You can't do shit to me.\" Leah taunted the man. Mr. Laning was going to let it go, but she disrespected him by addressing him using his first name and blatantly disregarded his polite request. Now pissed, Mr. Laning wasn't going to hold back anymore.<br>\r\n<br>\r\n\"That's it, young lady, I've had it with your disrespectful behavior! Now you've done it.\" Mr Laning barked.<br>\r\n<br>\r\nLeah snickered. \"Oh yeah? What're you going to do about it?\"<br>\r\n<br>\r\nMr. Laning simply smiled. \"Are you aware of the law that was passed last week? The one giving authority figures almost unlimited power in administering punishments?\"<br>\r\n<br>\r\nLeah shook her head 'no'.<br>\r\n<br>\r\n\"Well, it allows me to administer any punishment that doesn't result in physical harm. And as far as I know, 'humiliation' is not a physically harmful punishment.\"<br>\r\n<br>\r\nLeah was now a bit nervous. \"...humiliation?\"<br>\r\n<br>\r\n\"That's right. And you know what one of the most humiliating things for any teenage girl is?\" <br>\r\n<br>\r\n\"What?\" Leah asked nervously.<br>\r\n<br>\r\n\"Exposure.\"<br>\r\n<br>\r\nLeah didn't respond.<br>\r\n<br>\r\n\"And with that, Leah, I kindly ask that you remove...</span></div></div>",
            "created":1519448400,
            "id":2457284,
            "title":"School"
        },
        "11223":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "began unbuttoning her blouse",
                "refused to remove her blouse"
            ],
            "content":"<div class=\"\"><div> <span>\"You...you can't ask me to do that,\" Leah stuttered, trying to remain defiant.<br>\r\n<br>\r\n\"I can and I will,\" Mr. Laning replied smugly. \"Now, your choice is a simple one. Remove your blouse and bra, or have it removed for you. Which will it be?\"<br>\r\n<br>\r\nLeah...</span></div></div>",
            "created":1582088400,
            "id":2789705,
            "title":".... your blouse and bra.\""
        },
        "112231":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "Yes",
                "No "
            ],
            "content":"<div class=\"\"><div> <span>Leah began slowly unbuttoning her blouse under the stern and unwavering gaze of Mr. Laning. The class watched her silently until her cleavage was fully exposed, than one of the football players let out an \"Oh Yeah!\" The offending young man was quickly silence by a glare from Mr. Laning, and the rest of the class watched in silent expectation as Leah removed her blouse entirely.<br>\r\n<br>\r\nLeah finally unbuttoned her blouse and, with her head bowed, slid it off her body. She exposed a very firm torso, with a flat (but not overly defined stomach) and a very prominent bust line contained by a white bra with a little lace. Even Mr. Laning found himself both impressed and aroused by the sigh of Leah's bra contained breasts.<br>\r\n<br>\r\n\"Do I have to take my bra off too?\" Leah asked pleadingly as she looked back up. \"I've learned my lesson, really I have.\"<br>\r\n<br>\r\nMr. Laning found himself unable to talk. After he cleared his throat a couple of times, he finally asked, \"So what size bra do you wear, Leah?\"<br>\r\n<br>\r\nBowing her head in embarrassment, Leah whispered, \"Thirty eight double dee.\" One of the students let out a whistle, and this time Mr. Laning didn't admonish anyone.<br>\r\n<br>\r\n\"So can I keep my bra on?\" Leah asked hopefully as she looked back up.<br>\r\n<br>\r\nDoes Mr. Laning let Leah keep her bra on?<br>\r\n</span></div></div>",
            "created":1593061200,
            "id":2856647,
            "title":"began unbuttoning her blouse"
        },
        "1122311":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "could put her blouse back on",
                "could retrieve her blouse at the end of the day",
                "could put her blouse back on, for a price"
            ],
            "content":"<div class=\"\"><div> <span>\"You can keep your bra on,\" Mr. Laning relents, much to the disappointment of the male students. \"But we will have a discussion after class.\"<br>\r\n<br>\r\nLeah breathes a sigh of relief, and is probably the most attentive she has ever in any of her classes, much less Mr. Laning's. She catches more than one boy staring at her bra clad breasts. She tries to console herself that she's shown more in a bikini at the beach, but she's still pretty embarrassed. Finally, class is over and everyone but her and Mr; Laning shuffled out.<br>\r\n<br>\r\nIt seemed to Leah that the male students took their time exiting the class, with all of them staring at her bra clad breasts as they left. She was beet red by the time she and Mr. Laning were alone.<br>\r\n<br>\r\n\"So, Leah, do you think you've learned your lesson?\" Mr. Laning asked.<br>\r\n<br>\r\n\"Yes sir, absolutely sir, I'll never be disrespectful in any of my classes ever again,\" Leah said sincerely.<br>\r\n<br>\r\nMr. Laning quitely studied for a few minutes, and Leah notices his gaze keeps dipping down to her exposed cleavage.<br>\r\n<br>\r\nFinally Mr. Laning announced that Leah</span></div></div>",
            "created":1593161220,
            "id":2856948,
            "title":"Yes"
        },
        "11223111":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "content":"<div class=\"\"><div> <span>Leah hurriedly put her blouse back on, thanking Mr. Laning profusely, and promising to turn over a new leaf.<br>\r\n<br>\r\nTrue to her word, Leah was never disruptive in class again. And the tale of her having to go shirtless served as a cautionary tale to the other students in her school, reducing disciplinary problems drastically.</span></div></div>",
            "created":1593161340,
            "id":2856949,
            "title":"could put her blouse back on"
        },
        "11223113":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "leave the class without her blouse",
                "take off her bra for Mr. Laning"
            ],
            "content":"<div class=\"\"><div> <span>\"A price?\" Leah asked hopefully. She suspected that Mr. Laning was going to make her promise to be a better student of something. At this point, she would readily agree. And she would mean it sincerely too. She never wanted another morning like this again!<br>\r\n<br>\r\n\"Yes, a price,\" Mr. Laning repeated. \"In return for letting you leave this classroom with your blouse on, you will take your bra off for me now. And...\" Mr. Laning added, staring straight at her breasts, \"You will let me feel them.\"<br>\r\n<br>\r\nLeah's jaw literally dropped. Surely Mr. Laning couldn't have just proposed what she just thought he did.<br>\r\n<br>\r\nMr. Laning waited for a few minutes, then asked, \"Well, Leah, what's it going to be?\"<br>\r\n<br>\r\nLeah decides to</span></div></div>",
            "created":1593162600,
            "id":2856959,
            "title":"could put her blouse back on, for a price"
        },
        "114":{
            "choices":[
                "Alisa",
                "Erica",
                "Even more choices"
            ],
            "content":"<div class=\"\"><div> <span>Here are more options:<br>\r\n<br>\r\nAlisa: A 15 year old Asian with small breasts and a very shy and timid personality. <br>\r\n<br>\r\nErica: A 16 year old blonde girl with a completely flat chest and butt and no pubic hair anywhere.<br>\r\n<br>\r\n</span></div></div>",
            "created":1543035600,
            "id":2581537,
            "title":"Another set of girls"
        },
        "1142":{
            "author_id":"paladium23",
            "author_name":"Wasted Days",
            "choices":[
                "First day of community service.",
                "Your last free day.",
                "Nightmare."
            ],
            "content":"<div class=\"\"><div> <span>\"This can't be happening!\" thought Erica, a blonde teenager girl who time and genes didn't help her. Why am I telling you this? Because today she was going to experience a change in her life.<br>\r\n<br>\r\nLet's go back in time to understand this, Erica, has a complex with her body. She wanted to prove that she was more mature, her conclusion? steal a beer from a mini market, she was caught when the beer slipped from her blouse and broke on the ground. The employees saw a devastated and scared girl after this, so they simply called her parents.<br>\r\n<br>\r\nHowever, Erica's mother was in a different mood than theirs. \"What's the deal with you?\"<br>\r\n<br>\r\n\"Nothing.\" She replied. \"I just wanted to be mature.\" Erica was more relieved that the police wasn't involved.<br>\r\n<br>\r\n\"Yeah, trying to steal a beer is really adult matters.\" Erica's mom sighed. \"I guess I have no choice.\" she thought.<br>\r\n<br>\r\nLater in their house.<br>\r\n<br>\r\n\"Erica, I need to talk with you.\" said Erica's mom.<br>\r\n<br>\r\n\"What now?\"<br>\r\n<br>\r\n\"You have been lately, so obsessed about this maturity of yours and causing too much trouble that I think it's time for a punishment.\" Erica did not respond.<br>\r\n<br>\r\n\"I sign you to do community service and a friend of mine has a vacancy in her store, so I proposed you, this can be useful since you want to start acting as an adult.\" Her mother said.<br>\r\n<br>\r\nErica wasn't happy, but maybe this could help her, she was about to leave the living room when suddenly.<br>\r\n<br>\r\n\"Where are going?\" Her mom asks.<br>\r\n<br>\r\n\"To my room, I thought you were done.\"<br>\r\n<br>\r\n\"What are you talking about? I haven't mentioned your punishment yet.\" Erica was confused about this, so her mom continued. \"And for your punishment, I need your clothes in here.\" she points to the table of the living room.<br>\r\n<br>\r\nShe just giggled, but her mother wasn't kidding and she noticed it.<br>\r\n<br>\r\nErica frowned. \"Oh, you want it? Here.\" She takes off her blouse, revealing she wasn't wearing a bra, but why she should? After all, she had a flat chest. \"And these ones, too.\" She pulls down her pants, underwear included and she stands naked in front of her mother, showing her crotch with no signs that pubic hair has ever grown in there. \"You can keep it, I have more in my room.\" She crosses her arms.<br>\r\n<br>\r\n\"And you still don't get it, huh.\" Erica's mom smiles, tired of her daughter throwing tantrums. \"Your punishment is that you aren't allowed to wear clothes anymore, here is a copy of the format I sent to the city hall. And be prepared, you are the first person in the city to be punished like this.\" She leaves the piece of paper on the table and goes to her bedroom.<br>\r\n<br>\r\nErica went pale after hearing this and just thought: \"This can't be happening!\"</span></div></div>",
            "created":1584939600,
            "id":2805846,
            "title":"Erica"
        },
        "1143":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "Donna",
                "Ayamki",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>Donna, a seventeen year old black athlete with a firm body and prominent bust line<br>\r\n<br>\r\nAyami, a shy sixteen year old Japanese transfer student who speaks broken English, has very long, dark straight hair, is barely five foot tall and has very large breasts, especially for her petite frame</span></div></div>",
            "created":1593161520,
            "id":2856951,
            "title":"Even more choices"
        },
        "11432":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "scence class",
                "health class",
                "english class"
            ],
            "content":"<div class=\"\"><div> <span>For the most, Ayami tried not to attract attention, or get into trouble. In the latter department, she was very successful, as she was a quiet, well-mannered student who only occasionally caused a disruption in class because of an accidentally mischosen word, which would get loud laughter and cause Ayami to turn beet red.<br>\r\n<br>\r\nBut when it came to not attracting attention, Ayami failed miserable. She was a very beautiful young woman, and her waist length dark, straight silken hair that stretched down to her waist only accentuated her exotic beauty. She always wore baggy clothes and kept her head bowed, but even under all her shapeless clothing, people still knew that a fit, trim body with a 32DD rack (made even more impressive because it was on a five foot tall frame) laid underneath.<br>\r\n<br>\r\nOf course, no one actually ever saw the body underneath, because Ayami never went anywhere except school and her sponsor home, which consisted just of her and her seventy-one year old grandmotherly sponsor.<br>\r\n<br>\r\nThis changed one day due to a mischosen word Ayami used in a response to a question in her </span></div></div>",
            "created":1593162240,
            "id":2856956,
            "title":"Ayami"
        },
        "114321":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "told her to come up to the front of class",
                "to see him after class",
                " continued his lesson, ignoring Ayami for the rest of the class"
            ],
            "content":"<div class=\"\"><div> <span>On one hand, Ayami loved her Honors Physics class. It was a small class, just six students, including herself. Her teacher, Mr. Campbell, was fairly youngish, having only recently graduated from college himself, but he was very knowledgeable on the subjects he taught, and very enthusiastic. And even though this was an Honors class, Mr. Campbell was not above using practical and entertaining demonstrations on some subjects.<br>\r\n<br>\r\nIn addition, all the students were very enthusiastic about the subject. And since it was a scientific subject, Ayami found that rarely was she presented the opportunity to embarrass herself on a poor choice of words in English.<br>\r\n<br>\r\nThe downsize in Ayami's eyes was that she was the only girl, and the only non-white, in the class. Granted, it wasn't like she was in a class full of crude gigantic football players pumped up with hormones. These were nice, well-mannered intellectually curious young men who were always polite with her and even occasionally joked with her. And they were all not bad looking. And it was a good group. Mr. Campbell was young enough that he could have passed for any of the guys' older brother, and the classroom was more camaraderie rather than strict academic discipline.<br>\r\n<br>\r\nBut they were still guys, and she caught them more than once \"checking her out.\" Even Mr. Campbell would surreptitiously size her up.<br>\r\n<br>\r\nAnd then one day it happened. Without meaning to, Ayami said something outrageous enough to get the guys laughing for a solid ten minutes before Mr. Campbell finally got the class under control. Ayami was beet red, Mr. Campbell gave her a stern look, then </span></div></div>",
            "created":1593601260,
            "id":2859590,
            "title":"scence class"
        },
        "12":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "Alisha Washington",
                "Jamat Abidi",
                "Maria Lopez",
                "Hikaru Koda",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>The choices of the girls to be punished are as follows:<br>\r\n<br>\r\n18 year old Alisha Washington, a tall athletic busty young black woman who is a senior at the local high school,<br>\r\n<br>\r\n18 year old Jamat Abidi, a shy young woman with dark hair and dusky skin whose family has only recently immigrated to the area and who is a senior at the local high school<br>\r\n<br>\r\n19 year old Maria Lopez, a petite but curvy young woman who has recently graduated high school, lives at home and works at a local retail store<br>\r\n<br>\r\n20 year old Hikaru Koda, a young woman from Japan attending the local university</span></div></div>",
            "created":1593147600,
            "id":2856943,
            "title":"18-22"
        },
        "122":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "in English class",
                "in Math class",
                "in Study Hall"
            ],
            "content":"<div class=\"\"><div> <span>All things considered, Jamat would have just preferred to stay home and get her high school degree online. She hated high school. The kids were always staring at her because of her conservative clothing, and the way she always wore her hair in what they called an old librarian's bun. And even though she wore loose clothing and moved about scrunched up, all the students (and more than a few teachers) were quite aware of her large, firm chest (to Jamat's shame, she wore a 34DD bra and, when it was off, which was only at home in the shower, there was absolutely no sag in her breasts).<br>\r\n<br>\r\nShe tried to explain her discomfort to her parents, but they were oblivious. They had moved to this new country and expected ALL their children, including Jamat, to adapt to the western ways. While maintain proper modesty, of course.<br>\r\n<br>\r\nJamat was very much aware when the new law was passed, but she was never a disciplinary problem at school. And as graduation approached, she felt her daily dose of discomfort was going to soon come to an end.<br>\r\n<br>\r\nHow wrong Jamat was going to be proven wrong.<br>\r\n<br>\r\nJamat's humiliation at high school would begin</span></div></div>",
            "created":1594284060,
            "id":2864608,
            "title":"Jamat Abidi"
        },
        "1222":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "The full class of 8 plus Mr. Whiting",
                "A special study session with Mr. Whiting and two other students",
                "A private tutoring session with just Mr. Whiting"
            ],
            "content":"<div class=\"\"><div> <span>The only class Jamat felt comfortable in was her math class. True, she was the only nonwhite young woman in a small class of eighteen year old white guys, but there were a number of reasons for her to still like it.<br>\r\n<br>\r\nFirst of all, the class only had eight students, including herself. The class took up two slots, and was followed by her study hall slot, which she could (and did) take in the same classroom as her math class. <br>\r\n<br>\r\nMr. Whiting, her math teacher, kept a minifridge behind his desk. So his students could bring their lunches in, put them in the fridge, and have lunch in his classroom. Which Jamat did.<br>\r\n<br>\r\nJamat also had qualified to take the rest of her classes virtually for the remainder of the year. So Jamat could come to school, stay in one class room, and then go home.<br>\r\n<br>\r\nMr. Whiting was a great teacher, and very helpful to all his students. And yes, she did catch the guys staring at her bustline from time to time, but the guys were shy, and turned away if she caught them staring. And they were generally nice guys.<br>\r\n<br>\r\nSo, except for running the gamut of stares, leers and occasional catcalls  entering and exiting the school, Jamut found her time at school not so bad.<br>\r\n<br>\r\nThen one day, things took a turn.<br>\r\n<br>\r\nWhere does Jamat's naked punishment begin?<br>\r\n</span></div></div>",
            "created":1595923380,
            "id":2876760,
            "title":"in Math class"
        },
        "12222":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "spend the Saturday topless",
                "spend the Saturday wearing just her underwear",
                "see her after class to discuss discipline"
            ],
            "content":"<div class=\"\"><div> <span>Jamat herself was never a disciplinary problem. She was polite, quiet, always had her homework done and, in her honors math course, was always engaged with thoughtful questions. Mr. Whiting and her classmates both liked and respected her (and secretly lusted after her always concealed firm and curvaceous body).<br>\r\n<br>\r\nYes, Jamat, if left to her own devices, would never find herself facing disciplinary problems.<br>\r\n<br>\r\nJamat's mother, on the other hand...<br>\r\n<br>\r\nOn Saturdays, Mr. Whiting held a special honors math seminary for the top three students in his class. Each quarter, Jamat had managed to make on of the top three spots in her class. The last quarter of the year, it was her, Mr. Whiting, Lance and Daniel. <br>\r\n<br>\r\n<b><i>Brief pause for a description of the other characters.</i></b><br>\r\n<br>\r\nMr. Jonathan Whiting was a twenty-seven year old instructor with a lanky build, sandy hair, a light beard and a year round seasonal tan who was working on his doctorate as he taught math. To keep in shape, Mr. Whiting enjoys rowing. He is a jovial man who loves teaching.<br>\r\n<br>\r\nLance Williams was a shy young man, about five foot six, fair skinned, dark haired, who enjoyed running cross country, and could have probably lettered, if he weren't so introverted.<br>\r\n<br>\r\nDaniel Fields was five foot nine and enjoyed adventure racing and had dreams of being on American Ninja or a similar program. He tended to be soft spoken but amiable<br>\r\n<br>\r\n<i><b>Back to the story</b></i><br>\r\n<br>\r\nJamat always caught a ride home with Lance. She was very quiet on the ride home, mainly because Daniel was even shyer than her, and she did not want to distract him.<br>\r\n<br>\r\nSo all Jamat had to do was arrive on time.<br>\r\n<br>\r\nUnfortunately, Jamat's mother was always late. So Jamat always arrived five to ten minutes late for the special Saturday session. And no matter how much she tried, Jamat just couldn't get her mother to be more timely.<br>\r\n<br>\r\nAnd then it happened, Once again, on a Saturday session, Jamat was ten minutes late. She had explained her problem to Mr. Whiting, who was sympathetic, but she could tell the weekly tardiness was starting to get on his nerves. He saw it as a lack of respect from Jamat's mother.<br>\r\n<br>\r\nAs soon as Jamat walked into the room, Mr. Whiting informed her that she would have to</span></div></div>",
            "created":1595945160,
            "id":2876945,
            "title":"A special study session with Mr. Whiting and tw..."
        },
        "122223":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "if she is late next Saturday, she will face an alternative punishment",
                "he would give her a choice of punishments now"
            ],
            "content":"<div class=\"\"><div> <span>After telling her to speak to him after class, Mr. Whiting began the special study session, His attitude was such that Jamat felt Mr. Whiting might have forgotten about the discipline.<br>\r\n<br>\r\nWhen she got ready to leave, though, Mr. Whiting told her to remain behind.<br>\r\n<br>\r\n\"Jamat, I'm afraid we're going to have to address your consistent tardiness,\" Mr. Whiting began.<br>\r\n<br>\r\nJamat just bowed her head and nodded, ashamed.<br>\r\n<br>\r\n\"You are aware of the alternative punishments that are allowed now, are you not?\" Mr. Whiting asked.<br>\r\n<br>\r\nJamat looked up, eyes wide open. She was very much aware of the alternative punishment, but not even in her worse nightmares had she ever considered the possibility that she would be subjected to them.<br>\r\n<br>\r\n\"Are you aware of these alternative punishments, Jamat?\" Mr. Whiting. repeated.<br>\r\n<br>\r\nAgain, Jamat nodded.<br>\r\n<br>\r\nMr. Whiting informs her that </span></div></div>",
            "created":1597203120,
            "id":2884337,
            "title":"see her after class to discuss discipline"
        },
        "1222231":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "topless",
                "in your underwear"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"If you are late next Saturday,\" Mr. Whiting continued, you will have to spend the day</span></div></span></div>",
            "created":1597203180,
            "id":2884338,
            "title":"if she is late next Saturday, she will face an ..."
        },
        "1222232":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "see her breasts",
                "fondle her breasts"
            ],
            "content":"<div class=\"\"><div> <span>\"I will give you the choice, Jamat,\" Mr. Whiting continued. \"You can either stand in front of me for ten minutes topless, or you can let me fondle your breasts for ten minutes.\"<br>\r\n<br>\r\nJamat couldn't believe this was happening. And the fact that it was all her mother's fault was not lost on Jamat. But it didn't change anything. Either Mr. Whiting would be the first man ever to see her bare breasts, or he would be the first man to handle them,, even if it was through her clothing.<br>\r\n<br>\r\nMr. Whiting repeated his question. With a great reluctance, Jamat decided to let Mr. Whiting</span></div></div>",
            "created":1597203480,
            "id":2884340,
            "title":"he would give her a choice of punishments now"
        },
        "13":{
            "author_id":"deverx",
            "author_name":"SWLatina",
            "choices":[
                "Natasha",
                "Alice",
                "Kimberly",
                "Efath",
                "Deng"
            ],
            "content":"<div class=\"\"><div> <span>Normally, you would think that women in this range wouldn't be in situations where they could be punished in such a fashion. And yet somehow the five beauties below will find themselves in exactly that sort of situation. They are:<br>\r\n<br>\r\nNatasha, a twenty-three year old Ukrainian beauty who has only recently immigrated to the West<br>\r\n<br>\r\nAlice, a twenty-four year old redhead who works as a waitress at her family's restaurant<br>\r\n<br>\r\nKimberly, a twenty-five year old African American who has just recently passed the bar in her state<br>\r\n<br>\r\nEfath, a twenty-three year old woman who speaks little English and has rarely left her home<br>\r\n<br>\r\nDeng, a twenty-three year old woman from Taiwan who is getting a graduate degree from the local university<br>\r\n<br>\r\nSo which woman is going to get naked for us?</span></div></div>",
            "created":1593569580,
            "id":2859427,
            "title":"23-26"
        },
        "134":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "It's not a friend's house, it's an Air B'n'B.",
                "Efath hears her mobile phone start to ring, from somewhere in the house...",
                "The sound of a key in the front door sends Efath scuttling for cover.",
                "Mortified, Efath uses the table cloth to hide her nakedness.",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>Efath woke in her friends house... The unnatural silence stretching out, as she yawned and rose from the bed. The culture was so different here from her native Pakistan, and friends were hard to find.<br>\r\n<br>\r\nHer English skills weren't great, but she hoped to practice and improve them with her new friends. A sleep-over was unfamiliar, and uncomfortable as an idea. But living in the US, she knew she'd have to adjust.<br>\r\n<br>\r\nWhat little she could understand, she found she had to explain as mistakes or just plain wrong.<br>\r\n<br>\r\nExploring the house was awkward, as she had to do it nude. Another Americanism, she wondered. Her clothes carefully folded and piled beside the bed were gone. Maybe, this was part of a prank... or just a thing for guests in a strangers house.<br>\r\n<br>\r\nIn either case, she was intensely aware of her nudity. The stairs creaking as she carefully walked down them. Hands and arms hiding as much as possible of her flesh. She remembered seeing the washing machine downstairs. A hope that her clothes were being washed and dried seemed a faint hope to cling to...<br>\r\n<br>\r\nEven that hope was already fading as she reached the bottom of the stairs. The silence growing oppressive, and liberating. She was alone, and so free to walk about naked... But also she was alone... and abandoned.<br>\r\n<br>\r\nThe washing machine empty, no sign of her clothes hanging up to dry inside. Even a cautious peek outside only confirming they weren't drying in the open air.<br>\r\n<br>\r\nThe dawning realisation that they weren't her friends was impossible to deny. Efath spotted the folded letter on the kitchen table. Her heart sinking as she unfolded it. The writing was too complicated, for her to understand.</span></div></div>",
            "created":1598442540,
            "id":2891747,
            "title":"Efath"
        },
        "135":{
            "author_id":"rjh-kk",
            "author_name":"Mr. George",
            "choices":[
                "She fashions some crude clothes from other household items...",
                "Embracing the challenge, she's ready to leave in just her gown and shoes...",
                "Deng's phone rang... her 'friends' checking up on her...",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>There was an excited atmosphere as Deng woke. Today was the day of her graduation.<br>\r\n<br>\r\n\"Enjoy your graduation...\"<br>\r\n<br>\r\nShe found the note on the bedside table, signed by all her housemates. The reason for it was obvious, once Deng opened her wardrobe.<br>\r\n<br>\r\nInside it, her graduation gown hung, pressed and ready to wear... But, it was the only thing in there.<br>\r\n<br>\r\nA feverish search through her dresser drawers confirmed that every other item of clothes had been stripped out of the accommodation. She'd have to go to her Graduation, in her gown and only that. A garment hardly designed to be resistant to the breeze.<br>\r\n<br>\r\nDeng found her body starting to respond to that idea. A tingle in her middle, an excitement in her veins and her face started to flush.<br>\r\n<br>\r\nShe was mortified to find the idea was turning her on.</span></div></div>",
            "created":1598443260,
            "id":2891755,
            "title":"Deng"
        }
    },
    "info":{
        "author_id":"nachtmuziek",
        "author_name":"NachtMuziek",
        "brief_description":"Unlucky girls get punished with nudity after breaking the rules",
        "created":1519420200,
        "description":"<td align=\"left\" class=\"norm\">A new law is passed that allows much more freedom for anyone in a position of authority (parents, teachers/principals, bosses, etc.) to punish those beneath them. The only restriction is that the punishment cannot do physical harm to the person being punished. Pretty much everything else is fair game, including nudity.<br>\r\n<br>\r\nThis story takes place in modern times, and this new law is only a month old. Whoever the protagonist is will be the first in their community to be punished with nudity. <br>\r\n<br>\r\nRules:<br>\r\n1) This is an ENF story only. No other fetishes allowed (diapers, scat, anything sci-fi, etc.).<br>\r\n2) No violence or rape. Groping is allowed, but anything further is not. <br>\r\n3) Keep storylines fresh, don't just have her be naked all the time with nothing else interesting happening. This one can be difficult to follow without breaking other rules, so this \"rule\" is more of a guideline than a hard rule. <br>\r\n4) Try to have good grammar and spelling. <br>\r\n<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":2150089,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1598443260,
        "modified":1598443260,
        "pretty_title":"Naked Punishment"
    }
}