{
    "chapters":{
        "1":{
            "author_id":"bodybuilder500",
            "author_name":"Sabre.",
            "choices":[
                "Grant you the ability to grow/shrink anything or anyone you want? "
            ],
            "content":"<div class=\"\"><div> <span>It's a warm sunny day. children, animals and adults can be heard for miles around.  But unlike all the other people outside playing/working. One long Blonde haired, curvy middle aged bare foot woman named Tiffany  wearing a pink tank top and pink sweat pants  can be found sitting at the kitchen table by herself staring mindlessly at the pictures of three little kids  that hang on the fridge.  Who are these three little kids?  why non other than her three daughters that she's not seen since her Ex husband divorced her and gained full custody of them.    There's Rebecca the eldest daughter.  Sarah the middle child.  And last but not least her adopted  Asian daughter Linda. As she stares at the photos she  Thinks to herself about all the fun the four of them used to have when they were little.  But her fond memories soon fade as memory of how they all betrayed her  during the divorce emerge.    She recalls how They all lied to the cops saying their mom beat them. made them eat shitty food and locked them in the smelly basement with no food or water all the time.  All because their father promised them things she couldn't afford in exchange for them lying So he could gain full custody.   She soon becomes filled with anger and hate.  Deciding  she needs to blow off some steam she storms to her room to put on a pair of socks and her shoes.  She get's to her room and goes to her dresser, pulls open the middle drawer and removes a pair of white socks.  She goes to her bed to take a seat as she puts them.  After putting on her socks she removes her white tennis shoes from under her bed and slips them on.  Still steaming mad she storms out of her two story white colored house, slamming the brown door shut behind her. And begins to angrily walk towards downtown.  While walking she comes to the town park and decides to stop and get a drink from the water fountain.  On her way to the fountain she sees a Glowing blue object laying in the sand box, she goes to see what it is. Upon arriving at the sandbox, she kneels down into the sand and she see's that the glowing blue object looks like a  6 inch tall winged fairy.  Thinking it's just a toy she decides to leave it. But as she begins to stand up she notices it's wings slightly move. She than leans in to get a closer look than before. As she does this she gasps as she sees what she thought was a tiny little glowing toy begin to try and get up. thinking it's an actual fairy she scoops it into her hands and begins to examine it.  Upon inspection she sees it's tiny little stomach inhaling and exhaling. She rises to her feet and begins to run home with her unexpected find.    As she arrives home she lays the  little fairy on her back on top of the kitchen table.  And watches the little fairy breathe.  A few minutes pass and tiffany begins to grow bored but just as she is about to leave she hears a faint help.  tiffany  immediately sit's back down and looks at the fairy. A few seconds pass before tiffany hears another faint help.  Tiffany asks the fairy what can I do to help?  The fairy replies water.  Tiffany responds by saying what about water?  are you thirsty?  The little fairy faintly says put me in some water.  Tiffany confused asks the fairy why?  won't you drown?   The fairy responds with a faint please just do it.  Tiffany decides to do what was asked of her and brings the fairy to the  black kitchen sink, she puts in the drain plug than gently places the fairy in the sink.  Tiffany than proceeds to turn on the cold water. Watching as the sink slowly fills tiffany worries that her little friend will drown to death.  As the sink becomes half full tiffany notices the fairy beginning to glow even brighter than before.  Continuing to watch she sees the fairy begin to rise up.  Starring in awe tiffany watches the fairy shoot up out of the water and into the air above her.   The fairy lowers herself to the counter top and looks up at tiffany who is still awe struck.  the fairy proceeds to say thank you human if it wasn't for you I would be dead.  Tiffany staring down at the bright blue glowing fairy says wha... wh.. what are you?  The fairy replies by saying I'm a water fairy. Tiffany still confused by this whole ordeal asks her is this real or am I dreaming?  The fairy responds by saying this is real not a dream.  You saved my life and for that I am in your debt.  Please tell me how  can I ever replay you?  Tiffany not knowing what to say remains silent.   The fairy chuckles as she says I don't blame you for not knowing what to say. I Imagine you're beyond confused.  Why don't we start by introducing ourselves.  I'll start my name is Wendy, what's yours?  Tiffany responds by saying i'm tiffany.  Wendy than says I owe you for saving my life tiffany, now please tell me how to repay you?  tiffany begins to stutter wha.. wa...what like how huh?  Wendy chuckles again as she says i'm a fairy which means I have magic so please tell me what would you like me to grant you?  Tiffany responds with um what can you give me?  Wendy smiles as she says a lot of things.  How about I grant you.</span></div></div>",
            "created":1383924360,
            "id":1691322,
            "title":"An odd find. "
        },
        "11":{
            "author_id":"bodybuilder500",
            "author_name":"Sabre.",
            "choices":[
                "Teleport one of my daughters here or all 3?  "
            ],
            "content":"<div class=\"\"><div> <span>Tiffany ponders this idea for a few minutes thinking about how it would be perfect for getting even with all those that have wronged her especially her ex husband and three daughters.  After thinking for another couple minutes tiffany smiles and says I know what I want.  Wendy smiles back at her saying and what might that be?  Tiffany responds by saying I want you to stay with me and help me get revenge on my  three daughters  and their father. Wendy smiles as she says as you wish. Tiffany says good I was hoping you wouldn't refuse. Wendy chuckles and says I love revenge. What can I do to help? </span></div></div>",
            "created":1383925440,
            "id":1691327,
            "title":"Grant you the ability to grow/shrink anything o..."
        },
        "111":{
            "author_id":"bodybuilder500",
            "author_name":"Sabre.",
            "choices":[
                "Her most hated daughter Rebecca to her house. ",
                "All 3 daughters. ",
                "Sarah? "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tiffany decides she wants Wendy to teleport. </span></div></span></div>",
            "created":1383925560,
            "id":1691329,
            "title":"Teleport one of my daughters here or all 3?  "
        },
        "1111":{
            "author_id":"bodybuilder500",
            "author_name":"Sabre.",
            "choices":[
                "Rebecca appears before tiffany. ",
                "Wendy has a better idea?  "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tiffany tells Wendy that her daughter  Rebecca, told the worst lies.  I want her to be teleported here right now. So I can punish her for all her hurtful lies. </span></div></span></div>",
            "created":1383925740,
            "id":1691332,
            "title":"Her most hated daughter Rebecca to her house. "
        },
        "11111":{
            "author_id":"bodybuilder500",
            "author_name":"Sabre.",
            "choices":[
                "How tall 1 inch?  ",
                "How tall 6 inches?"
            ],
            "content":"<div class=\"\"><div> <span>Wendy uses her magic to locate Rebecca and soon finds her and proceeds to teleport her to tiffany's house.  Within seconds a cloud of smoke fills the room. The smoke soon disperses revealing tiffany's eldest  daughter Rebecca laying on the ground.  Rebecca is 19 years old.  5'4, 110lb  well toned , she has long  black hair, ice blue eyes. she's  wearing a plain white t shirt, blue jeans and a pair of light purple tennis shoes.  Wendy looks at Rebecca  before  turning to ask tiffany, how are you going to punish her?   Tiffany get's an evil look in her eye. than  asks Wendy you said you can shrink people right? Wendy smirks before saying yeah to any size.  Tiffany, tells Wendy, good it'll do just nicely.  Tiffany than  begins to look at her daughter who's still lying on the floor and says well well well If it isn't my back stabbing daughter.  Rebecca looking up at her mother says in a slightly scared voice mom?  Tiffany scoffs and get's an angry look on her face before shouting. Shut your mouth no one said you could speak.  Rebecca jolts back a few inches on the floor. What's the matter scared I might beat on you, lock you In the smelly basement, or make you eat shitty food  again?  Oh wait I never did any of that Did I? Rebecca looking up at her mothers angry face begins to tremble out of fear. Tiffany shouts again did I?  answer me. Not wanting to make her mother even more angry Rebecca mutters n..n..no. Tiffany counters by saying that's what you told the cops I did didn't you?  Rebecca hesitantly says yes.  Tiffany still looking down at her trembling daughter says oh  so are you admitting that you lied?  Just so you could go live with your dad who promised to buy you stuff I couldn't?   Rebecca answered with a another hesitant yes followed by a mom i'm sorry please will you forgive me?  Tiffany laughs followed by her saying forgive you?  for all the hell you three girls put me threw?  Hell no.  You're going to be punished you little lying ungrateful bitch.   Tiffany than looks at Wendy and says shrink her.  Make it so she can't die as well. I plan on making her suffer and don't need her dying on me.  Wendy cracks her knuckles and points her hands at Rebecca shooting out a green beam of light that begins to shrink her.  </span></div></div>",
            "created":1383928320,
            "id":1691342,
            "title":"Rebecca appears before tiffany. "
        },
        "111111":{
            "author_id":"bodybuilder500",
            "author_name":"Sabre.",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is that what size she shrinks to?</span></div></span></div>",
            "created":1383928440,
            "id":1691343,
            "title":"How tall 1 inch?  "
        },
        "1111111":{
            "author_id":"bodybuilder500",
            "author_name":"Sabre.",
            "choices":[
                "Light her on fire?",
                "Panty tourture?"
            ],
            "content":"<div class=\"\"><div> <span>Rebecca begins to feel weird as the green beam hits her. and notices her clothes are becoming loose. she cries out please mom i'm sorry please stop.  Tiffany just laughs manically as she watches her daughter shrink. Within seconds Rebecca is shrunk to 1 inch tall and buried underneath her clothes. Wendy pleased by her work  smiles and tells tiffany, there you go one 1 inch girl that can't die.  Now what?    </span></div></div>",
            "created":1383928980,
            "id":1691346,
            "title":"yes"
        },
        "11111112":{
            "author_id":"bodybuilder500",
            "author_name":"Sabre.",
            "choices":[
                "stuck between the cheeks."
            ],
            "content":"<div class=\"\"><div> <span>Tiffany tells Wendy you'll see as she reaches down to the pile of clothes her daughter resides under.  Tiffany, picks up the clothes gently shaking them until her daughter falls off and lands on the floor.  Throwing the clothes aside tiffany, scoops up her 1 inch daughter bringing her to face level. Tiffany, can see the look or complete horror on her daughters face. Smirking tiffany says remember how you said I locked you in my smelly basement? Well guess what i'm actually going to do what you accused me of doing all those years ago. Except you won't be going in the smelly basement of my house. Nope. you'll be going in a different kind of basement.  One that I can guarantee will smell really horrible. as tiffany began to  move her daughter to behind her.  Rebecca instantly knew what her mom meant and begin to  struggle as hard as she could. but it was all in vain as Rebecca saw her mom begin to pull back her pants and panties.  She could see her mothers colossal butt crack and the two  well shaped round butt cheeks on both sides of it. She began to cry as her mom dangled her above the opening.  A few seconds passed before her mother finally let go of her.  Rebecca went freefalling into the back of her moms pink cotton panties. </span></div></div>",
            "created":1383930180,
            "id":1691356,
            "title":"Panty tourture?"
        }
    },
    "info":{
        "author_id":"bodybuilder500",
        "author_name":"Sabre.",
        "brief_description":"A betrayed mother gets revenge. with the help of a little magic fairy. ",
        "created":1383918840,
        "description":"<td align=\"left\" class=\"norm\"><b></b> </td>",
        "id":1961887,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1384593600,
        "modified":1384593600,
        "pretty_title":"A mothers revenge.    "
    }
}