{
    "chapters":{
        "1":{
            "author_id":"anonegg",
            "author_name":"Anonegg",
            "choices":[
                "School",
                "Work",
                "Shopping",
                "Beach",
                "Other (Writer's Choice)"
            ],
            "content":"<div class=\"\"><div> <span>Jenna slapped her alarm clock as it began to buzz annoyingly down her ear. With a groan of dismay she pushed herself up onto her elbow. 7am. Damn. Time to get up.<br>\r\n<br>\r\nThe eighteen year old brunette pushed herself upright so that her legs dangled over the side of the bed. Wearily she rubbed at her eyes. For some reason she hadn't been sleeping well, and she knew that lack of sleep always did weird things to her memory. She made an early morning vow to be extra vigilant today.<br>\r\n<br>\r\nShe stood up. At 5'7 she was of average height, although her body was curvacious; not quite chubby, but just a little wider than normal. Her double D boobs pulled tightly against the \"Winnie the Pooh\" t-shirt that was the entirety of her pyjamas. She stood and stretched, the hem of the t-shirt rising to reveal just a hint of her neatly trimmed pubic hair.<br>\r\n<br>\r\nAs she scratched idly at her perfectly rounded buttocks, Jenna noticed a note taped to her bedroom door. She tore it off and read it.<br>\r\n<br>\r\n\"Jenna,\" it said \"I got called into work early - major problems with the IT systems. Leave your pyjamas in the hamper, and I've left you fresh socks on the landing. Love mom.\"<br>\r\n<br>\r\nNervously, Jenna opened her bedroom door and shouted as loud as she could \"Hello? Is there anyone there?\"<br>\r\n<br>\r\nThere was no response. Encouraged by this, Jenna pulled her t-shirt over her head, leaving herself completely naked. She dumped it into the laundry hamper in her room as requested, and entered the landing outside. Knowing that the kitchen floor would be cold on her feet, she slipped on the socks left for her - plain, white knee-highs - and made her way downstairs to the kitchen. She giggled nervously to herself.<br>\r\n<br>\r\n\"Look how mature I am.\" she thought \"Strolling naked around the house.\"<br>\r\n<br>\r\nShe'd get dressed after breakfast, she told herself. For now she just wanted to enjoy the sensation. She poured herself a bowl of cereal and sat down at the table. The wooden chair beneath her felt cold against her bare skin, and her nipples poked teasingly at the edge of the table. She giggled to herself once more.<br>\r\n<br>\r\nAs Jenna was halfway through the bowl of cereal the kitchen phone rang. She set aside her spoon, stood up and answered the phone.<br>\r\n<br>\r\n\"Hello?\"<br>\r\n<br>\r\n\"Jenna? It's your mom. Did you get my note?\"<br>\r\n<br>\r\n\"Yeah. T-shirt's in the hamper and I'm wearing the socks right now.\"<br>\r\n<br>\r\n\"Oh good. Listen, you should leave the house as soon as you can. The traffic is pretty bad today.\"<br>\r\n<br>\r\nWalking into the hallway (the phone was cordless), Jenna opened up the airing cupboard and, distracted by the conversation, pulled her sneakers out. As she did, she continued talking:<br>\r\n<br>\r\n\"Did you have trouble yourself?\" Jenna asked.<br>\r\n<br>\r\n\"A little bit. The radio in work is on the traffic channel, though, and it sounds like it's worsening. How close are you to being ready?\"<br>\r\n<br>\r\nJenna slipped her feet into the sneakers.<br>\r\n<br>\r\n\"I'm ready now, actually.\"<br>\r\n<br>\r\n\"Well good. Get going now then and I'll see you tonight.\"<br>\r\n<br>\r\n\"Okay. Love you mom.\"<br>\r\n<br>\r\n\"You too dear.\"<br>\r\n<br>\r\nClick.<br>\r\n<br>\r\nJenna left the phone on the stairs, and rubbed at her eyes. She still felt pretty beat. She wanted nothing more than to go back to bed, slip under the covers and spend an hour or two dreaming. Unfortunately she had a schedule to stick to. But there was something... something didn't feel right, to her. She had the strong sense that she was forgetting something... ah, her handbag! She couldn't believe she'd nearly forgotten something so important. <br>\r\n<br>\r\nWearing nothing but socks, sneakers and a purse, Jenna opened her front door and entered into the world. The day was bright and sunny, so no cold breezes alerted her to her state of undress as she closed the door behind her.<br>\r\n<br>\r\nSo, where is Jenna going?</span></div></div>",
            "created":1369630800,
            "id":1597949,
            "title":"I've got this vague feeling..."
        },
        "11":{
            "author_id":"ruffwanderer",
            "author_name":"Ruff Wanderer",
            "choices":[
                "She knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>Jenna made her way over to her car, and plopped down into her seat. In her sleepy fog, she couldn't quite place the odd feeling she felt of hot leather on... bare skin. Her foggy brain didn't quite pick up on the fact that she was now driving naked, wearing just her shoes and socks. Regardless, Jenna knew she had to hurry as she quickly sped to school. A mandatory showing of some video about school spirit or some other nonsense was showing in the auditorium and all students were required to go. Despite Jenna's best efforts to arrive on time she noticed that she was the only one in the parking lot, as everyone else had already gone in. Sighing, Jenna quickly parked her car and grabbed her handbag, jogging to the side entrance of the school so she could slip in unnoticed. If anyone had been looking, they would have seen the gorgeous 18 year old's breasts bouncing left and right as she jogged towards the school. Jenna made her way into the school, and with a deep breath headed towards the auditorium. Everyone was already there and the hallways were deserted. So Jenna rushed into the auditorium, but it was pitch dark, as they were showing the movie on the screen. A few heads turned but all they saw was a curvy silhouette of an attractive girl but they could see nothing more. <br>\r\n<br>\r\n\"Excuse me, is this seat taken?\" Jenna asked a boy in the back, in a somewhat isolated area hidden from most peoples' view.<br>\r\n<br>\r\n\"Huh, oh uh no its open.\" The guy said, squinting trying to make out who the girl was but it was still too dark.<br>\r\n<br>\r\n\"Thanks Uhm, what's your name?\" Jenna said.<br>\r\n<br>\r\n\"Tom. And no problem...\"<br>\r\n<br>\r\n\"My name is Jenna.\" <br>\r\n<br>\r\nWith introductions out of the way Jenna sat down, thankful to have made it without an incident. She sat there watching the movie for a few minutes and quickly grew board. Reaching into her handbag she grabbed her iphone, and turned it on to play some her favorite game, candy crush! Unfortunately for her the screen let out a glow Tom's mouth dropped at what he saw...<br>\r\n<br>\r\n </span></div></div>",
            "created":1376283600,
            "id":1644596,
            "title":"School"
        },
        "111":{
            "author_id":"ruffwanderer",
            "author_name":"Ruff Wanderer",
            "content":"<div class=\"\"><div> <span>\"Jenna... your naked!\" Tom shouted in surprise.  <br>\r\n<br>\r\n\"I am not... What!\" Jenna shrieked. She suddenly remembered never getting fully dressed that morning.<br>\r\n<br>\r\nIt turns out that shouting and shrieking may not have been the best decision as teachers made their way over to check the disturbance. When they found Jenna, sitting down clutching her naked body in a ball, the lights went on and everyone looked at Jenna. Perhaps in a sudden panic, Jenna fled her seat giving everyone a glimpse of her completely naked body. Her luscious buns jiggled along with her perfect and large breasts. She ran, and ran until she made her way to her car. Then it hit her, she had left her handbag in the auditorium. <br>\r\n<br>\r\nThat is how Jenna ended up walking back into the school naked with her head down, as lewd comments and cat calls were made. Several students pinched her bottom, squeezed it and even spanked it. Others reached for her breasts and they tweaked her nipples or just straight squeezed. A few even touched her bush. She was humiliated and the teachers marched her naked, to the main office where she was brought into the principal's office. Suspended from school, and her reputation ruined, Jenna left the school naked as students snapped pictures of her exposed body. She drove away and changed schools the next day. She never could escape those photos and they haunted her the rest of her life, leading to embarrassment and humiliation everywhere.</span></div></div>",
            "created":1376283600,
            "id":1644652,
            "title":"She knows!"
        },
        "112":{
            "author_id":"ruffwanderer",
            "author_name":"Ruff Wanderer",
            "choices":[
                "She knows! ",
                "She doesn't know! "
            ],
            "content":"<div class=\"\"><div> <span>Tom couldn't believe what he was seeing. The chick right next to him, Jenna was sitting there completely naked. Her screen gave enough light for him to see everything. Their location in the back corner kept her covered from any other eyes, and Tom certainly didn't want to spoil the moment.<br>\r\n<br>\r\n\"Uhm... nice phone. Is that candy crush? Thats cool.\" Tom stammered, still hypnotized by her naked flesh.<br>\r\n<br>\r\n\"What. Oh yeah I guess it's alright. This is just so boring you know. Like I'm a senior, I shouldn't have to watch this crap.\"<br>\r\n<br>\r\n\"Yeah totally... you want to bag this. I don't think we'd get in that much trouble as long as we came back at the end. We got like, 30 minutes to kill probably.\"<br>\r\n<br>\r\n\"Why not. This is really boring. What year are you, I don't recognize you?\"<br>\r\n<br>\r\n\"Oh, I'm a junior, I just moved here this year.\"<br>\r\n<br>\r\n\"Okay cool. Well let's head out.\" Jenna said as she put her phone back into her handbag.<br>\r\n<br>\r\nJenna led the way as Tom followed her out eagerly, no teachers really noticed as the slipped out the door. Tom's eyes lit up as her saw Jenna in her full naked glory, with light seeming to reflect off her skin. Her shapely butt wiggled slightly as she walked and her breasts were perfect, with two pink nipples poking hard in the air. <br>\r\n<br>\r\n\"Alright, so where do you wanna head?\" Jenna asked.<br>\r\n<br>\r\n\"What... oh right. Want to get something to eat, I missed breakfast this morning.\"<br>\r\n<br>\r\n\"Okay, I only had a little cereal so I'm still pretty hungry. Let's go get bagels.\"<br>\r\n<br>\r\n\"Sure, good idea. We could take my car.\" Tom suggested as the two started to head out the doors, with Tom trailing behind admiring her sexy butt as it bounced with each of her steps. Then the unfortunate happened and Tom's heart dropped...<br>\r\n<br>\r\n\"Hey, what are you kids doing!\"<br>\r\n<br>\r\nIt was Mr. Geco, the creepy science teacher...  </span></div></div>",
            "created":1376283600,
            "id":1644600,
            "title":"She doesn't know!"
        },
        "1121":{
            "author_id":"ruffwanderer",
            "author_name":"Ruff Wanderer",
            "content":"<div class=\"\"><div> <span>Mr. Greco could not believe what he was seeing. A completely naked girl, Jenna his own student none the less stood before him unashamed and... well naked.<br>\r\n<br>\r\n\"Jenna, why on earth are you naked!?\" Mr. Greco asked as he eyed the voluptuous girl up and down, admiring her large breasts, and neatly trimmed bush.<br>\r\n<br>\r\n\"What... I'm naked? Oh my...\" Jenna looked down at her body, noticing for the first time her naked state.<br>\r\n<br>\r\nTom discreetly elbowed her and whispered, \"Go with it. Act like it's expected to be nude. Trust me.\"<br>\r\n<br>\r\nJenna looked at him confused but didn't see much other option as her hands twitched moving towards covering but stopping halfway. Torn between covering and being exposed she decided that she'd try and follow Tom's lead. With a blushing face she faced her teacher, letting her boobs bounce free and her bush uncovered.<br>\r\n<br>\r\n\"I'm... uh yeah I'm naked because I'm a nudist now.\"<br>\r\n<br>\r\n\"Mr. Geco, it's perfectly legal in this state, and she is 18.\" Tom offered helpfully.<br>\r\n<br>\r\nMr. Geco not buying it one bit said, \"Okay, if you really want me to believe this blushing, embarrassed naked girl is a nudist then why don't you speak to the school about your newfound practice. Otherwise you will be expelled for indecency and Tom you will at the least be suspended.\" Mr. Geco said.<br>\r\n<br>\r\nJenna knew she was trapped. She also knew she couldn't afford to get expelled her last year, right before college. She also didn't want Tom to suffer, it wasn't his fault she forgot to get dressed after all. <br>\r\n<br>\r\n\"Ok. I'll do it.\" Jenna said with a gulp causing her boobs to jiggle wonderfully.<br>\r\n<br>\r\nSo that's how Jenna ended up standing in front of her whole school, on a stage naked proclaiming that she would remain completely naked the rest of the school year. With that statement she promptly removed her shoes and socks causing her jiggly parts to wobble quite nicely. She had never felt so exposed or naked in her entire life, and she was going to have to get used to it. The kids in the front row snickered as they stared from their lower angle, admiring her trimmed, brown haired bush and the rest of her body. She knew this was going to take some getting used to. Well now it's safe to say that... she knows!</span></div></div>",
            "created":1376283600,
            "id":1644649,
            "title":"She knows! "
        },
        "1122":{
            "author_id":"ruffwanderer",
            "author_name":"Ruff Wanderer",
            "choices":[
                "She Knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>Mr. Geco stared openly, with pure desire. A beautiful young woman, one of his students he had imagined nude so many times before was standing before him, uncovered, and completely naked. It was always one of his fantasies that he'd find Jenna naked and embarrassed in school. Well she was definitely naked, but for some unknown reason unembarrassed.<br>\r\n<br>\r\n\"What's going on here!\" Mr. Geco yelled, while openly leering at Jenna's naked body.<br>\r\n<br>\r\n\"Mr. G, uh... I'm going to the bathroom and Tom here is too. We both had to go at the same time I guess.\" Jenna said thinking fast (ironically).<br>\r\n<br>\r\n\"Oh. Well then that's fine. But to make sure you both head over there I'll walk you to the bathroom.\"<br>\r\n<br>\r\nMr. Geco's mind raced trying to comprehend what was happening. It was as if Jenna thought her shoes and socks were a full wardrobe. It was almost like she thought she was clothed. That was it! Somehow, for some reason she must think she was wearing her clothes. Otherwise this usually modest girl would be red faced, and covering herself in shame. Unless she was a closet nudist, Mr. Geco was willing to bet she thought she was decently clothed. He smiled, realizing he could have some fun with this. Looking over at Tom he winked, knowing Tom had most likely reached the same conclusion. Tom jumped at the gesture, but realized what it meant and smiled. They were going to try and keep this young beauty blissfully unaware of her unclothed state as long as possible. <br>\r\n<br>\r\nAfter a minute of both guys walking slightly behind Jenna, drinking in her pert, curvy butt as it wobbled when she walked they had reached the bathrooms. Jenna turned around to face Mr. Geco, causing her curvy breasts to bounce into view, as her trimmed bush was put on open display. Both of the guys stared at her naked body as she let them know that she was going to the bathroom now. She turned to open the door, wiggling her butt in the process as it shut close behind her.<br>\r\n<br>\r\nWith the door closed, Tom and Mr. Geco began to discuss their plans. They needed to keep her unaware of her nudity as long as possible, so her beautiful curves could be admired for longer. <br>\r\n<br>\r\nIn the bathroom Jenna headed over to the mirror to get a look at her reflection. For whatever reason both Mr. Geco and Tom had been checking her out non stop and she wanted to see if she had food on her teeth or something. Unfortunately for her (fortunately for us) the mirror was gone, and a note was left in it's place saying a replacement would come soon. So, Jenna not really having to go to the bathroom just stood there trying to kill time so Mr. Geo didn't get suspicious. Then, suddenly the door sprang open and a classmate of her's, Stacey looked at her with utter shock.</span></div></div>",
            "created":1376283600,
            "id":1644615,
            "title":"She doesn't know! "
        },
        "11221":{
            "author_id":"ruffwanderer",
            "author_name":"Ruff Wanderer",
            "content":"<div class=\"\"><div> <span>\"What in the world are you doing NAKED Jenna!\" Stacey screamed as she flung the door open, causing the door to become somehow jammed and stay wide open giving both Tom and Mr. Geco a great view of the scene about to play out.<br>\r\n<br>\r\nJenna looked at her friend confused, and said, \"Are you high? What are you talking about I'm properly dres...\"<br>\r\n<br>\r\nJenna looked down and finally noticed her naked predicament. She let out a high pitched yelp, and put one hand over her large breasts and the other over her trimmed bush. She immediately began blushing as she thought of the display she had given her teacher and classmates! She then remembered, putting her shoes on while on the phone, but nothing else. How could she have not noticed, she hadn't the faintest idea except maybe she had just been extremely tired this morning. Regardless, she now stood naked and exposed desperately trying to cover herself up in front of her friend Stacey, Tom and her teacher Mr. Geco. <br>\r\n<br>\r\n\"You didn't know? Poor girl, I'll go get my jacket from the auditorium, just... uh stay put I guess.\" Stacey said as she rushed out of the bathroom leaving Jenna alone with Tom and Mr. Geco.<br>\r\n<br>\r\n\"You knew the whole time... why didn't you say anything.\" Jenna said, blushing even more while desperately covering herself, doing a poor job at covering her nipples which were peaking out.<br>\r\n<br>\r\n\"I simply treated you normally as I thought you wanted to be treated. I did not want to judge your belief system or something of the sort unknowingly. Had I known you had simply forgotten to get dressed I would have helped you immediately.\" Mr. Geco elegantly lied.<br>\r\n<br>\r\n\"And well... I just wanted to see your tits and ass as long as possible. Your hot.\" Tom admitted rather unabashedly.<br>\r\n<br>\r\nJenna shook her head, as she blushed at the compliments. Stacey sure seemed to be taking her time, and Jenna couldn't take much more of this awkwardness, being naked in pretty much silence in front of a student and teacher so she decided to abandon ship. She picked up her dropped handbag and made a mad dash out the bathroom past Mr. Greco and Tom unveiling her curvaceous body one more time. The men started at her large breasts bouncing, trimmed bush exposed, and her shapely ass jiggle as she ran by abandoning her cover. Mr. Greco took advantage of the situation and with a loud SMACK noise slapped the naked girl's sexy ass. It wobbled wildly as she let out a little screech, but she continued running.<br>\r\n<br>\r\n\"Tom, how could you!\" Mr. Greco yelled, trying to cover up his own pervy-ness to the girl who was already rounding the corner giving them one last view of her glorious butt, with a red hand print adorning it now. <br>\r\n<br>\r\nTom shook his head at his teacher, and noticed something shiny out of the corner of his eye. Lying in the bathroom was Jenna's car keys...<br>\r\n<br>\r\nJenna raced to her car, still in shock at being not only naked, but groped by a creepy junior! (really Mr. Geco) Not caring anymore, she was sprinting now with her breasts bouncing around wildly, and painfully for her. She finally made it to her car, and opened up her bag searching frantically for her keys. Her heart dropped... they were gone. She must have dropped them in the bathroom when she had dropped her handbag to cover herself up. Not knowing what else to do, she ran back towards the school desperately hoping the assembly was still going on. Of course the assembly just had to end, right as she ran by the auditorium. A flood of students and teachers came out and were astonished to see a completely naked girl running  and jiggling her way past them. Jenna unprepared for the seemingly instant exodus of the students ran smack into a guy and fell to the ground, with her legs spread. She gave everyone a perfect spread eagle shot, revealing her vagina in all it's detail as A crowd instantly surrounded her, and students began taking pictures and recording their naked, fallen classmate. <br>\r\n<br>\r\n\"Haha, dude look at Jenna's bush!\"<br>\r\n<br>\r\n\"Great tits!\"<br>\r\n<br>\r\n\"Why is she naked?\"<br>\r\n<br>\r\n\"What a slut!\"<br>\r\n<br>\r\nSome brazen, and perverted students had the audacity to reach out and grope Jenna's butt and breasts. That is until finally teachers broke it up and wrapped a coat around the sobbing Jenna. The coat hung open in the front, not hiding her breasts completely and leaving her ass and pussy displayed as she was led away to the main office where she had a hard time explaining everything to the principal. It's safe to say, that she has learned to pay more attention to her wardrobe. I think we can all say, she knows! <br>\r\n</span></div></div>",
            "created":1376283600,
            "id":1644646,
            "title":"She Knows!"
        },
        "11222":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "She Knows!",
                "She Doesn't Know!"
            ],
            "content":"<div class=\"\"><div> <span>Stacey was about to ask Jenna about her choice of wardrobe when she turns around to see Mr. Greco and Tom outside the door. Neither were making a big deal about Jenna's nudity, so she played it cool. She entered the restroom and closed the door behind her. She wanted to see if Jenna was aware of her nudity or not. If she wasn't, this could make her boring day much more fun!<br>\r\n<br>\r\n\"Hey Jenna. nice outfit. Very brave.\" Stacey said.<br>\r\n<br>\r\n\"Really? It's just what I normally wear.\" Jenna answered.<br>\r\n<br>\r\nThat's it! Stacey now knew her secret, and now the fun would begin!<br>\r\n<br>\r\n\"Oh, I guess I just don't notice your outfit sometimes. That is a cute outfit. would you mind if I got a picture of it?\" Stacey asked, grinning mischievously.<br>\r\n<br>\r\n\"I suppose there's no harm in that.\"<br>\r\n<br>\r\nJena struck a pose. She pointed her hips toward Stacey, turning her upper body so her right shoulder pointed away from Stacey. She placed her right hand on her hip and placed her left hand behind her neck, pointing her elbow toward Stacey. She arched her back to make her look more statuesque, but it just made her chest more prominent. She gave her best smile, and Stacey couldn't be happier with how the picture turned out. <br>\r\n<br>\r\n\"Thanks Jenna! How about one from behind?\" Stacey asked, hoping Jenna wouldn't mind.<br>\r\n<br>\r\n\"Um, ok.\"<br>\r\n<br>\r\nJenna then turned so her butt was facing Stacey then rotated her upper body left so her left shoulder was facing Stacey again. Her left hand was on her left hip and she craned her neck so Stacey could see her face. He left nipple was barely visible behind the amount of side-boob she was showing. Again, she gave Stacey a pretty smile and Stacey couldn't believe how lucky she was. She now had two pictures showing every inch of Jenna's naked body!<br>\r\n<br>\r\n\"Thanks, Jenna. These look great!\"<br>\r\n<br>\r\n\"Really? can I see them?\" Jenna asked.<br>\r\n<br>\r\nStacey tried to think of what to do when Jenna takes a step towards her.</span></div></div>",
            "created":1376542800,
            "id":1646720,
            "title":"She doesn't know!"
        },
        "112221":{
            "author_id":"anonegg",
            "author_name":"Anonegg",
            "content":"<div class=\"\"><div> <span>Before Stacey could react, Jenna had the phone in her hands and was staring at the picture. After a moment her eyes widened.<br>\r\n<br>\r\n\"Oh... my... god...\" Jenna proclaimed.<br>\r\n<br>\r\nResigned to apologizing, Stacey say \"Listen, I can explain-\"<br>\r\n<br>\r\n\"You have an x-ray photo app!\"<br>\r\n<br>\r\n\"A... a...?\"<br>\r\n<br>\r\n\"It lets you see through people's clothes when you take a picture! Oh wow, I have just got to try this!\"<br>\r\n<br>\r\nStacey could only watch speechless as Jenna left the safety of the women's bathroom. Mr Geco and Tom were leering at her body as her hands raised the phone to eye level. She took a picture.<br>\r\n<br>\r\n\"Hehe... I'm going to see you guys naked!\" Jenna taunted. \"Um... Stacey, why isn't it working?\"<br>\r\n<br>\r\n\"What isn't working?\" Tom asked.<br>\r\n<br>\r\n\"This x-ray app. It took nude photos of me, but it's not working with you guys.\"<br>\r\n<br>\r\nThere was a pregnant silence. Time seemed to slow as Jenna, beginning to suspect the truth, looked down at herself. Her glorious naked breasts stared back at her. Shocked by this turn of events she released her grip on the phone. Stacey, however, was anticipating this and dove to the ground to save it. Unfortunately for Jenna, she chose that moment to run away in blind panic, tripping over her falling classmate in the process. Her arms flailed wildly as she fought to reclaim her balance, her feet criss-crossing across the hallway uncontrollably. She crashed into the auditorium door, knocking it open and attracting the attention of every person in the room. Gravity finally claimed her, and she fell hard against the wall - and hit the lightswitch in the process.<br>\r\n<br>\r\nThe next thing she was aware of was the face of Mr Geco, filling her vision. He pulled a bottle of smelling salts away from her nose.<br>\r\n<br>\r\n\"Are you alright, Jenna?\" he asked.<br>\r\n<br>\r\n\"Yeah.\" she replied groggily. \"Just had this terrible nightmare...\"<br>\r\n<br>\r\nUnsteadily she climbed to her feet. Stacey was suddenly at her side, grabbing hold of her arm to steady her. Without thinking Stacey directed her towards the nearest seat - which turned Jenna directly towards the wide-eyed, wide-mouthed auditorium full of students. It suddenly struck Jenna that if her nudity had been a dream, then surely she should have woken up in her bedroom?<br>\r\n<br>\r\nHer free hand reached for her crotch. It felt the soft curls of her neatly manicured pubic hair.<br>\r\n<br>\r\nAnd suddenly she knew.</span></div></div>",
            "created":1377234000,
            "id":1650470,
            "title":"She Knows!"
        },
        "112222":{
            "author_id":"ruffwanderer",
            "author_name":"Ruff Wanderer",
            "choices":[
                "She knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hold on! I uh... really have to pee.\" Stacey said delaying Jenna from seeing the pictures.<br>\r\n<br>\r\n\"Ah, forget it I gotta head back outside to Mr. Geco.\"<br>\r\n<br>\r\n\"Let me come with you.\"<br>\r\n<br>\r\n\"I thought you had to pee?\" Jenna questioned.<br>\r\n<br>\r\n\"Forget it, lets go.\" Stacey said.<br>\r\n<br>\r\nWith a shrug that cause her boobs to jiggle, she walked out the door and ran smack into Mr. Geco! Mr. Geco couldn't believe his luck, her naked flesh was touching him, her breasts squished on his chest and her bush pressed on his leg. Jenna immediately apologized and backed right into Stacey who gave Jenna's firm ass a little squeeze. This caused Jenna to jump with a yelp causing her boobs to bounce wildly to the delight of Mr. Geco and Tom. This was getting ridiculous, how did the girl not realize she was naked. Little did any of them know, that unless someone explicitly pointed out that Jenna was naked she would remain unaware of it, until someone did so. You see her brother had hypnotized her the night before, to impress his friends who had all seen Jenna naked. Now, she was still under the spell and nobody had broken it yet. Of course, nobody knew she was under hypnosis but regardless they all knew that she thought she was adequately covered. <br>\r\n<br>\r\n\"Okay, I guess we better head back to the auditorium now.\" Jenna said.<br>\r\n<br>\r\n\"Yes of course, I trust you'll all head back there right away. I myself have to use the restroom, so go on ahead without me.\" Mr. Geco insisted as he closed the bathroom door leaving the students alone. Mr. Geco smiled, he didn't want Jenna's nude journey to end just yet. He would simply follow the students from afar, watching what they did with the oblivious and naked Jenna. <br>\r\n<br>\r\n\"Alright, lets go before he finds out we didn't go back. Where do you want to head? The assembly will probably end in like 25 minutes now so we could chill at the gym, or go swimming real fast...\" Stacey insisted wanting to prolong Jenna's nudity.</span></div></div>",
            "created":1376629200,
            "id":1646855,
            "title":"She Doesn't Know!"
        },
        "1122222":{
            "author_id":"ruffwanderer",
            "author_name":"Ruff Wanderer",
            "choices":[
                "She knows?",
                "She doesn't know?"
            ],
            "content":"<div class=\"\"><div> <span>\"Lets go to the pool!\" Jenna said enthusiastically. <br>\r\n<br>\r\nWith that it was decided, and the three students with a sneaky and horny teacher following behind, headed to the swimming pool. Stacey and Tom began to strip to their underwear to swim in. Stacey took of her shirt and pants revealing a red pushup bra and a red thong, showing off her perky C sized breasts and curvy ass. Mr. Geco peered through the door window, admiring Stacey's sexy, scantily clad figure next to the naked Jenna. To Mr. Geco's surprise it appeared that Jenna was pantomiming taking off her clothes. It looked as if she thought she was actually dressed and that she was now in her underwear! It seemed that Stacey and Tom caught on as well.<br>\r\n<br>\r\n\"Nice panties Jenna.\" Stacey said, knowing full well that Jenna thought she had stripped to her underwear. <br>\r\n<br>\r\nJenna simply blushed and smiled, and with a splash dive into the water. Seconds later she was out of the pool crying out how cold she was. That was pretty obvious, as her wet body glistened and her nipples looked hard as rocks. Water dripped down her naked body, and her breasts jiggled as she shivered and tried to hugh herself to keep warm. She stood there naked, wet, cold and oblivious of the show she was putting on for her friends, and one horny teacher. <br>\r\n<br>\r\n\"Oh come on its not that bad.\" Stacey said.<br>\r\n<br>\r\n\"Fine lets see how you like it!\" Jenna said playfully as she pushed her friend into the pool. Unfortunately for stacey, Jenna had grabbed ahold of her bra, and it came off with a tear leaving Stacey topless in the pool. <br>\r\n<br>\r\n\"Give me my bra back!\" Stacey yelled, with both hands holding her breasts in the pool. <br>\r\n<br>\r\n\"Come and get it!\" Jenna yelled running away from the pool.<br>\r\n<br>\r\nThe sight was maddening, a naked girl holding a bra over her head with a topless girl chasing her from behind. Both girls' bounced tantalizingly, and Tom was sure glad he had come to school today as he followed the sexy girls who were now bring the chase into the hallways. He grabbed his clothes, and while putting them on followed the sexy girls. When he heard a shriek, it sounded like somebody else had seen the two girls... Was the fun about to end?</span></div></div>",
            "created":1376974800,
            "id":1648767,
            "title":"She doesn't know!"
        },
        "12":{
            "author_id":"anonegg",
            "author_name":"Anonegg",
            "choices":[
                "As a waitress",
                "In an office",
                "Swimming instructor for kids",
                "Writer's Choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And where does she work?</span></div></span></div>",
            "created":1369630800,
            "id":1597952,
            "title":"Work"
        },
        "122":{
            "author_id":"cescott",
            "author_name":"thescourt",
            "choices":[
                "Go into the call centre",
                "Visit IT",
                "Face the Managing Director"
            ],
            "content":"<div class=\"\"><div> <span>Jenna hurried down the pathway, slowing briefly to push her way through the rusted, creaking gate (<i>have to get some oil on that</i>, she thought - not for the first time) and scampered down the lane to the busy insurance company where she worked. The sun was warm but the late summer morning had a chill of autumn and Jenna subconsciously felt colder than on previous days. <br>\r\n<br>\r\nStill with her mother's warning of traffic ringing in her her ears, Jenna stepped up her pace, anxious not to be late. Despite being only a mile from her home, Jenna knew there were a couple of busy junctions to cross and if they were snarled it could be horrendous trying to weave through the cars, weathering the maelstrom of testosterone fuelled road-rage which greeted her most days. Picking up her pace, Jenna was aware of her pendulous breasts bouncing in rhythm with her stride. As her most appealing asset, Jenna often showed them off by wearing tight fitting tops and wired bras in the office. Had she the skinny waist some of her colleagues were blessed with, Jenna knew she'd garner more interest from her male colleagues than she did but there were more than a few subtle glances in her direction. Not that she would have the courage to wear anything more skimpy. Jenna liked to look like she was overtly sexy but, deep down, there were always mental barriers that prevented her from going too far. Even on holiday she wouldn't brave exposing herself on the beach.<br>\r\n<br>\r\nApproaching the first bust intersection, Jenna noticed that a few drivers - particularly the male gender - were looking at her with odd smiles. Oblivious to her nakedness, Jenna smiled back, assuming they were just enjoying the way her breasts jiggled as she walked. Little did she know that the jiggling was more apparent than normal. And when an elderly lady in a shiny new Jaguar which far exceeded her state pension payment gave Jenna a reproachful snarl, Jenna simply stuck two fingers up and carried on her way. Jealous old cow.<br>\r\n<br>\r\nIt was strange, though, that today of all days, most of the blaring car horns were accompanied with leering and whistles rather than the usual scowls and expletives. Still, it mad a change and Jenna was convinced it was down to the Indian summer. If only the temperature would warm up a couple of degree. The wind was cutting right through and chilling her skin. As she stepped into the lavish reception of Carter Smith Associates Insurance Company (empty as it always was first thing in the morning; the dutiful receptionist making the early morning coffees for the directors), the air conditioning hit her full on. Despite only being moderately warm outside, the AC made it feel like she was stepping into an ice box and her body reacted instantly. Jenna's buttocks clenched and her large, light brown nipples stood to attention, rising concurrently with the temperature dropping.<br>\r\n<br>\r\nCarter Smith Associates Insurance Company was not a huge company but there were about 40 people employed in various guises, spread out over two floors. Jenna worked on the first floor with the rest of the secretarial and administrative staff whilst the ground floor was taken up by the reception, board room and IT staff. Jenna hated going into IT as it was full of nerdy men ranging from university leavers to middle aged hippies, none of which had enjoyed the delights of the female form (at least not in the flesh, so to speak. There was no doubt they'd fantasised over the many avatars in their makeshift graphical game worlds) all going silent when she entered and staring. Not that she often ventured into their realm but she knew there was no getting out of it today. A few days ago she'd taken a laptop in as the processor was running slower than it's usual snail-pace and they'd assured her it would be fixed by this morning. <i>Oh well, have to bite the bullet and collect it, making small talk as they undressed her with their eyes and thought of the many they'd never experienced</i>. Well, normally they'd undress her with their eyes. Had she known otherwise...<br>\r\n<br>\r\nBut she needed to go to the office and make a few urgent calls. Most of the staff in the call centre were female and spent the first hour of the day discussing the mindless soap operas of the previous evening, something Jenna detested, which gave her the opportunity to sit and make the calls while not being interrupted (how could anything be more important than Coronation Street?). However, this meant walking past the glass fronted office of the Managing Director who was wanting to speak to her about a new project they were supposed to be developing; something she'd been trying to put off. It wasn't that she didn't want the work but when it came to the handsome, debonair Lawrence Carter, Jenna simply turned to mush. Her inner thermostat would rise causing a blush to spread throughout her whole body and she was always sure that the damp patch between her thighs would leave a lasting impression on his leather upholstery. It was even worse now that rumours of his impeding divorce were spreading and it hadn't helped that in a drunken state at the last office party, Jenna had danced up close and personally with her boss.<br>\r\n<br>\r\nRunning her hand through her hair, Jenna tried to decide what to do first. Should she go straight to her desk and crack on with her work? Or should she collect her laptop from IT? Maybe she should just face the music and go straight to the MD. At least she'd prepared herself in advance, trimming and shaping her pubic hair in case the miraculous should happen. Not that she dreamt it would.</span></div></div>",
            "created":1380171600,
            "id":1670223,
            "title":"In an office"
        },
        "1223":{
            "author_id":"cescott",
            "author_name":"thescourt",
            "choices":[
                "She knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>Jenna strode up to the Managing Director’s office, head held high, determined to go in on the offensive. This was her opportunity to make an impression and she wasn’t going to let it pass. Going on the offensive, oblivious to the stares and gapes of her colleagues, Jenna marched past the glass fronted office of Laurence Carter and let herself in. Oblivious to the stares; oblivious to her nakedness.<br>\r\n<br>\r\nLaurence looked up and stared open-mouthed. His eyes took in the full glory of Jenna’s naked body, wandering from her large breasts down to the neatly trimmed mound of pubic hair, taking in the dark opening between her slightly parted legs.<br>\r\n<br>\r\nJenna felt her temperature rise as his eyes swallowed her and the blush rose to her face. Not wanting to look stupid, Jenna attacked with her opening gambit.<br>\r\n<br>\r\n“Look Laurence, I think you should know…” she began but was cut off by her boss who coughed strategically into a bunched fist.<br>\r\n<br>\r\n“Erm…Jenna? I think you may have forgotten something.” Laurence suggested.<br>\r\n<br>\r\nJenna nervously sat on the leather chair in front of her boss, crossing her legs and inadvertently covering her embarrassment. The chair felt colder than normal, probably down to the air conditioning , she thought but it wasn’t going to distract her. “I know you haven’t had the initial report yet, sir, but I assure you I’ve got everything covered.”<br>\r\n<br>\r\nLaurence raised an eyebrow. “Everything?”<br>\r\n<br>\r\n“Yes, sir. Everything.” Jenna wasn’t going to be beaten down. This was her moment.<br>\r\n<br>\r\n“Are you sure?” Laurence asked. “You’re fully a-breast of the situation? You haven’t made a boob?”<br>\r\n<br>\r\nJenna squirmed in the chair. She was under pressure and it was unusual for Laurence Carter to be speaking in such an overtly sexual manner but she was feeling empowered and it was turning her on. She could feel herself becoming moist and she just wanted to be out of there, somewhere private and sorting out her primal needs. This needed to be done though.<br>\r\n<br>\r\n“If you see any boobs, please let me know and I’ll handle them,” Jenna pouted, not noticing the mischievous smiling playing around her boss’s lips. “I’ll be completely open and if, when I’m done, you’re not completely satisfied, I’ll lay it all out and put everything into your hands.”<br>\r\n<br>\r\nLaurence nodded and waved his hands contentedly. So for the next half hour, Jenna sat naked in front of her boss putting forward her proposal. Not that he took any interest but the thought was there. When they were done, Jenna stood up, leaned forward and shook his hand.<br>\r\n<br>\r\n“I’ll have everything sorted in a week,” Jenna said, her breasts swinging down over the desk.<br>\r\n<br>\r\nAnd with that, Jenna spun around (giving the MD a full, glorious view of her magnificent, toned rear end) and walked out of the office, smiling. On her way out, she took a satisfied glance at her reflection in the glass window.<br>\r\n</span></div></div>",
            "created":1380258000,
            "id":1670803,
            "title":"Face the Managing Director"
        },
        "12231":{
            "author_id":"cescott",
            "author_name":"thescourt",
            "content":"<div class=\"\"><div> <span>The reflection in the mirrored glass revealed her worst nightmare. Not only could she see the horror in her face but the reflection, in full length profile, of her body, naked except for her socks and sneakers. Three short words popped into her mind, \"Oh...my...God!\"<br>\r\n<br>\r\nIt all made sense. The drivers, the looks of her co-workers, the Managing Director's innuendo. The Managing Director! She'd just presented herself to the company owner's son completely nude.<br>\r\n<br>\r\nShock gave way to embarrassment and Jenna rushed out of the office, her breasts bouncing and her bum wobbling in her haste to flee the scene. There was nothing she could do, nowhere to hide.<br>\r\n<br>\r\nAnd that's when she remembered the cleaners store cupboard. Covering herself up as much as possible, Jenna rushed down the corridor, barging past a couple of startled Japanese businessmen who watched, bemused. Racing to the end of the corridor, ashamed yet strangely turned on. \"Pleaes let it be unlocked,\" she whispered to herself, panting breathlessly.<br>\r\n<br>\r\nShe reached the last door and turned the handle, expecting no movement. But for once, today, luck was on her side. The door swung out to reveal a dark cupboard stuffed with mops, buckets, cleaning utensils...and an apron! Diving into the relative safety of the store-room, Jenna reached for the apron to restore some semblance of modesty. She was trembling, blushing...giggling. It was so wrong, so embarrassing. So why was she so turned on?<br>\r\n<br>\r\nHalf an hour later, after carefully peering around the green glossed door, Jenna emerged from her hiding place hoping no-one was around. Dressed only in the cleaner's apron, she quickly and quietly slipped down a rear stairwell to make her swift exit out of a rear door, desperately hoping no-one would see her attire, her naked behind, her slight pink glow and the sheen of sweat all over her skin. Or smell the musky odour that emitted from between her legs and fingers.</span></div></div>",
            "created":1380258000,
            "id":1670812,
            "title":"She knows!"
        },
        "12232":{
            "author_id":"anonegg",
            "author_name":"Anonegg",
            "choices":[
                "She knows",
                "She doesn't know"
            ],
            "content":"<div class=\"\"><div> <span>Jenna gave a little jump of surprise as she faced the window. She hadn't realised... that she'd been standing so close to it! Her reflected face filled her vision, so that she didn't see anything else which might have made her jump in surprise.<br>\r\n<br>\r\n\"You are a strong, confident businesswoman.\" she told herself. \"This project is going to be amazing for your career.\"<br>\r\n<br>\r\nShe turned to move away... and saw something reflected in the window that caused her distress. A naked woman! <br>\r\n<br>\r\nOn the computer screen behind her! <br>\r\n<br>\r\nShe turned to find the majority of the nearby office staring at her, wide eyed and mouth agape. It was probably just surprise because she was talking to herself. The only person in the office not watching her was Karen, the twenty year old lesbian intern who, in Jenna's view, was a lazy, slovenly wretch. Although she was pretty, her short blonde hair was unruly, and she didn't even wear a tie! Her desk was facing away from the window, and Jenna just about glimpsed the image of two naked women pressed against each other before Karen minimized the window and pulled up a spreadsheet. Well, if she was going to be working on Jenna's project then she was damned well going to establish some ground rules!<br>\r\n<br>\r\nGlad that the entire office was watching her - for she didn't want to have to assert her authority more than once - she stormed over to Karen's desk, the stomping of her feet causing her breasts to bounce around wildly. She stood next to Karen's desk, hands on her hips.<br>\r\n<br>\r\n\"And just what do you think you're doing?\" Jenna demanded.<br>\r\n<br>\r\n\"I was just...\" Karen began, but stopped as her breath was taken away.<br>\r\n<br>\r\n\"I think you were doing THIS!\"<br>\r\n<br>\r\nJenna reached over Karen to grab the mouse, unknowingly thrusting her bare breasts into the intern's face. She clicked on the minimized window and immediately brought up a picture of a naked brunette woman, both of her hands running through her hair.<br>\r\n<br>\r\n\"Do you think this sort of image is appropriate for the workplace?\" Jenna demanded as she stood up once again.<br>\r\n<br>\r\n\"Uh... is this a trick question?\"<br>\r\n<br>\r\n\"No, it isn't. Listen, Karen; if you're on this new project, then that means you're going to be directly beneath me. I need to know that you're focused on the task in hand and that you can deliver satisfaction whenever I need it. I'll deliver all the tongue lashings that are required; I can assure you that by the end of this project I will lick you into shape!\"<br>\r\n<br>\r\n\"Is that a promise?\"<br>\r\n<br>\r\n\"It is. In fact, I think I will start right now!\"<br>\r\n<br>\r\nAs Jenna got to her knees and began to crawl beneath Karen's desk - her bare backside on full display to the entire office - Karen began to unbutton her trousers and, along with her panties, pushed them to her knees. She didn't care if the office saw; she had a major crush on Jenna since the day that they'd first met, and she'd be damned if she passed up this opportunity. What she did not realise, however, was that Jenna's only intention was to pull the Ethernet cable that allowed Karen access to the Internet. As Jenna turned to climb out, she was confronted by Karen's bare, shaven pussy as the intern slipped her feet free of her lower clothing.<br>\r\n<br>\r\n\"What in gods name are you doing?!\" Jenna cried as she scrambled desperately out from under the desk.<br>\r\n<br>\r\n\"I... wait, I thought you said you were going to lick my pussy.\"<br>\r\n<br>\r\n\"I said no such thing!\"<br>\r\n<br>\r\n\"You did! You said you were going to give me tongue lashings and lick me into shape!\"<br>\r\n<br>\r\n\"That was discipline, you stupid girl!\" Jenna snapped. \"I didn't mean to take your clothes off! Do you have any idea how inappropriately dressed you are right now?!\"<br>\r\n<br>\r\n\"Me?!\" Karen roared back. \"What about you?!\"<br>\r\n<br>\r\n\"What about me?\"</span></div></div>",
            "created":1380862800,
            "id":1674150,
            "title":"She doesn't know!"
        },
        "122322":{
            "author_id":"cescott",
            "author_name":"thescourt",
            "choices":[
                "She knows",
                "She doesn't know"
            ],
            "content":"<div class=\"\"><div> <span>Realisation dawned on Jenna. This rude, arrogant upstart was trying to usurp her authority.<br>\r\n<br>\r\nWell, she thought, we’ll soon put a stop to that nonsense. “Karen!” Jenna snapped. “Put your bloody clothes on right now! You’ll report to me at the end of the day and I’ll deal with you there and then.<br>\r\n<br>\r\n“And,” she continued, addressing the whole office, “I don’t want a single cock-up today.”<br>\r\n<br>\r\nSome of Jenna’s male colleagues blushed and quickly sat down, covering their obvious excitement. Jenna, though, didn’t realise and turned her attention back to the lusty lesbian. <br>\r\n<br>\r\n“I don’t know what you think you’re playing at, Karen but this is neither the time nor the place. Now get to work and come see me later. From now on, you’re going to bend over backwards for me. I don’t want any balls up in my project. You’re going to do as I say or I’ll tear you a new arsehole. Do you understand? It’s not like I want you to do anything you’ll find demeaning. But if you feel you can’t satisfy my needs on your own, I’m happy to bring someone else in to help. I’ve got my eye on you and I really want to get behind you but if you just screw around without giving me what I want, it’ll be the back door for you, young lady. Rub me up the wrong way and you’ll be going down.”<br>\r\n<br>\r\nKaren blushed and nodded, not really understanding the mixed message from her buxom boss but not wanting to get into that particular conversation in the middle of the office. The meeting after hours could prove very interesting and she found herself getting wet at the thought.<br>\r\n<br>\r\n“Now put your clothes back on and do something constructive,” Jenna snapped.<br>\r\n<br>\r\nObliging, Karen slipped her panties back up, her middle fingers hooked into the thin lace waistband. Not wanting to let Jenna know what she was missing, Karen allowed her index finger to slide ahead, up the inside of her milky thigh and up the full length of her moist, shaven pussy. As she trailed the finger over her clit, circling it a couple of times, the electric shock of pleasure rippled up through her entire body. Then she reluctantly covered herself up and scooped to pick up her trousers, bending forward so her mouth was mere inches from Jenna’s own, tidily trimmed pussy.<br>\r\n<br>\r\nJenna, shocked at the way Karen had so blatantly made a come-on at her, had looked away before the intern could put on her trousers and hadn’t noticed the glint in her eye as Karen ogled her private parts.<br>\r\n<br>\r\nJenna swivelled away, her breasts and bottom swinging in tandem with the motion, her sneakers squeaking on the tiled floor. “Oh,” she said, looking back over her shoulder, “and don’t forget to wear a tie.<br>\r\n<br>\r\n“And the rest of you can get back to work or I’ll be coming down on each and every one of you, too. I’m running this project and you’ll respect me. Now come along, there’s nothing more to see. It was just a picture of a naked woman, for crying out loud. Have none of you ever seen a naked woman before?”<br>\r\n<br>\r\nIgnoring the muted coughs and mumbled comments, Jenna returned to her desk and dropped into her chair, the padded seat less comfortable now after several years of abuse from her backside slamming into it. Yet it seemed more uncomfortable and scratchy today. Must think about ordering a new one, she thought. Powering up her old desktop computer, Jenna cast an astute eye over the office, making sure everything is as it should be. <br>\r\n<br>\r\nJust as the Windows logo pinged up on her screen, Jimmy, the work experience lad who was helping in the post room nervously shuffled up beside her, his eyes roving everywhere except at Jenna. In a tentative, cracked voice, Jimmy asked “Erm…Jenna…Is there something important you’ve forgotten to do, today?)<br>\r\n</span></div></div>",
            "created":1381067280,
            "id":1675038,
            "title":"She doesn't know"
        },
        "1223222":{
            "author_id":"cescott",
            "author_name":"thescourt",
            "choices":[
                "She knows",
                "She doesn't know"
            ],
            "content":"<div class=\"\"><div> <span>Jimmy ran a trembling hand through his tousled hair and tried not to look Jenna in the eye. Mind you, he didn’t want to look anywhere at Jenna for fear she might reprimand him for being a sick pervert. But how could he not look? He’d never seen a naked woman before and certainly he didn’t think his first would be as voluptuous and sexy as Jenna. She had curves in all the right places and he suspected she knew exactly how to pleasure a man.<br>\r\n<br>\r\nOh God. Now he was getting over excited and he was worried his immature body might betray his attempts at keeping a calm exterior.<br>\r\n<br>\r\n“Well, Jimmy?” Jenna snapped. “Spit it out. What have I forgotten?”<br>\r\n<br>\r\nJimmy shuffled from one foot to the other, perspiring slightly. His eyes fixed upon her breasts, then her thighs, then her…<br>\r\n<br>\r\n“I don’t have time for this, Jimmy. Can you hurry up, please? I have a project to run.”<br>\r\n<br>\r\nShe didn’t know much about Jimmy, though she’d seen him wandering around the premises like a lost sheep for a few days. Jenna felt sorry for him, being forced into working somewhere he clearly didn’t want to be, doing something mundane and having nothing to talk about when he got home. Except for stamps and envelopes and copier paper. Nothing exciting ever happened in an insurance company.<br>\r\n<br>\r\nHe was still young – and immature. Jenna was convinced he hadn’t hit puberty yet and he certainly wasn’t a great catch for any girl. That was rather a bitchy thing to think, she told herself, after all, she was not long out of school herself and at his age she had been overweight with puppy fat for breasts. Time had been a great healer for her and she was proud of her body and looks now. It was just a shame she was so damn tired and irritable.<br>\r\n<br>\r\nJenna sighed. “<i>Please</i> Jimmy. You’re making me nervous with that little wiggle you’re doing.” She gave a mock shake, to replicate what he was doing and her breasts wobbled playfully.<br>\r\n<br>\r\nJimmy swallowed hard and forced the words out of his mouth. “It’s just that…erm..you said you would give me some time to briefly run through what you do on a daily basis and it’s…er…my last day today so I was wondering…?”<br>\r\n<br>\r\n<i>Bugger!</i> She’d forgotten about that. But her boss had told her he needed some paperwork signing off to prove what he’d done and she had to devote a bit of time to him. Jenna rocked back in the chair, running a hand through her hair and inadvertently spreading her legs giving Jimmy a full view or her trimmed pussy.<br>\r\n<br>\r\n“Look Jimmy,” she said, after a moment’s pause. “I’m really busy with this project and I need to crack on. I can make lunchtime. Would you be happy if it was just a quickie in the post room?<br>\r\n<br>\r\nJimmy had to force his cracked voice out through dry lips. “Absolutely Miss…Jenna. Erm…would you like me to get you anything. I mean, is there anything special you’d like?”<br>\r\n<br>\r\nJenna was slightly confused by his response but carried on regardless. “Well if you’re nipping next door, I wouldn’t mind a baguette. The meatier the better. And make it a foot-long. Six inches is never enough, don’t you think? You always want more afterwards. At least if you’ve had the full twelve inches, you feel well stuffed afterwards. And I’d like some fruit, if you can manage it.”<br>\r\n<br>\r\n“Fruit?” Jimmy stammered.<br>\r\n<br>\r\n“Yes. You know, some grapes or an apple. Or a pear. I like a nice, firm, juicy pear, don’t you?”<br>\r\n<br>\r\nJimmy thought that was <i>exactly</i> what he’d like but was too embarrassed to say. So he kept his mouth shut and nodded, desperately trying not to look at her gorgeous tits.<br>\r\n<br>\r\n“Oh, one other thing,” Jenna added before sending the youth on his way. “If they have a packet of mints, I’d love some. My throat’s a bit dry and I could really do with something to suck on. Would you mind getting me something to suck on Jimmy?”<br>\r\n<br>\r\nJimmy nodded and made his excuses. Hastily he shuffled out of the office, desperate for some fresh air and a quiet place where he could reflect on his meeting with this gorgeous, sexy and almost completely naked beauty. <i>How could she just sit there and flash her…her…</i>bits <i>at him without being in the least bit embarrassed?</i> Not that Jimmy cared. This was a day he was never going to forget. And he was going to spend time alone in the post room with him whilst she gobbled on his foot-long.<br>\r\n</span></div></div>",
            "created":1381093800,
            "id":1675271,
            "title":"She doesn't know"
        },
        "123":{
            "author_id":"anonegg",
            "author_name":"Anonegg",
            "choices":[
                "She knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>Jenna pulled up outside of the swimming baths about twenty minutes before it was due to open. The ride over had been inexplicably uncomfortable. For some reason the leather seats seemed to stick to her skin more than usual, pinching her flesh whenever she turned a corner. She hadn't been able to reach down and adjust her shorts - she had only began driving recently, and she was very reluctant to shift her hands from the ten and two position.<br>\r\n<br>\r\n\"Still, not an issue now.\" she told herself as she climbed out of the car.<br>\r\n<br>\r\nAnyone watching would have been mesmerized as the gorgeous, curvy eighteen year old brunette locked her car door and strode across the car park to the employee entrance. Her breasts jiggled with her every step, and her backside writhed from side to side as she walked.<br>\r\n<br>\r\nOnce inside, she was greeted by silence. Most of the staff would be upstairs in the cafeteria, enduring the daily staff meeting. Since Jenna was only a part timer, this wasn't something she had to worry about. Instead she pushed open the door to the women's lockeroom, picked an empty locker at random and put her handbag inside. She kicked off her shoes and stripped off her socks, so that, unbeknownst to her, she was completely naked. She placed her only garments on the bench beneath the locker.<br>\r\n<br>\r\nAs she reached for her handbag to withdraw her swimsuit (which, like the rest of her clothes, was actually back at home and forgotten about), she felt the sudden urge to pee. Two small side-rooms were attached to the main lockeroom; one containing showers, the other containing toilet cubicles. Jenna dashed into the latter, took a seat and relieved herself.<br>\r\n<br>\r\nWithin a few minutes she returned to her locker. She popped open her handbag, and went to retrieve the swimsuit inside... and found it missing.</span></div></div>",
            "created":1370754000,
            "id":1607922,
            "title":"Swimming instructor for kids"
        },
        "1231":{
            "author_id":"anon_ninja",
            "author_name":"anon_ninja",
            "content":"<div class=\"\"><div> <span>“Hmm… must’ve left it back at the toilet cubicles” thought Jenna as she closed her locker and walked back to the stalls. On her way back, she caught a glimpse of what looked like naked skin in a nearby mirror and did a double-take as she ended up staring wide-eyed at what she eventually realized was her own reflection. <br>\r\n<br>\r\n“OMIGOD!” thought Jenna in complete shock as she immediately dropped her arms to cover her ample breasts and shaven mound. Surely enough, her swimsuit was not in the cubicles as Jenna went back to her locker to fetch her items, while still subconsciously using her arms for cover. As she reached her locker, Jenna tugged desperately at the knob only to realize that it wouldn’t budge. Unfortunately for her, this meant she had no access to her keys, or even her shoes and socks. Aware that she was now stuck as naked as the day she was born from head to toe, Jenna frantically searched the entire locker-room in case anyone accidentally left behind a spare towel. <br>\r\n<br>\r\nDefeated by the lack of findings, Jenna hastily decided to sneak back home before anyone from work caught her in all her glory. Still covering her privates, Jenna slowly stepped out of the locker-room into the pool area. Since it was still early in the morning, Jenna was blinded by the reflection of sunlight on the surface of the pool and used her hands to cover her eyes. However, Jenna froze as she heard a series of gasps. When Jenna regained her vision, she saw that several swim-students and instructors gaped at Jenna’s perfect unclad body. Jenna violently blushed bright red as she was overcome by the overwhelming embarrassment of being exposed in front of so many people.<br>\r\n<br>\r\nJenna shrieked in horror as she took off sprinting out of the pool area, giving her viewers an unobstructed view of her bouncing boobs and jiggling bottom.<br>\r\nAs Jenna left the premises, passing by several more incoming students, she immediately made her way home. She lived about 15 minutes away on foot, but it took her almost an hour to make it home as she tried hard to hide herself from view along the way. Every now and then, a passerby car honked in her direction as they caught a glimpse of the disrobed beauty clumsily using her hands to provide cover. Jenna remained bright red out of embarrassment, especially when she realized that some of the honking cars were her classmates from school. Dedicated to make it home, stark-naked Jenna ignored all shocked looks and honking cars and focused on walking as fast as she can.<br>\r\n<br>\r\nWhen Jenna finally made it to her front door, she immediately forgot she left her house keys back in the locker room. Wanting this episode to end, Jenna ran around the perimeter of her house, climbed over the fence, and waited in the backyard for her mom to come back home. <br>\r\n<br>\r\nSince this episode, Jenna never wanted to face her co-workers again and decided to quit her job to save herself from further awkwardness. Needless to say, I think it’s safe to say at this point that she knows!<br>\r\n</span></div></div>",
            "created":1479539400,
            "id":2238982,
            "title":"She knows!"
        },
        "1232":{
            "author_id":"anonegg",
            "author_name":"Anonegg",
            "choices":[
                "She knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>\"Huh. I must have put it on before I went to pee. Man, I really need to be more careful - who knows what I'll forget next!\"<br>\r\n<br>\r\nAs she placed her shoes and socks in the locker, somehow blissfully unaware that the rest of her clothes were not present and accounted for, she hoped fervently that the cool water of the pool would help wake her up a little. She was always like this when she missed out on sleep!<br>\r\n<br>\r\nThe key to her locker was attached to a wrist band, which she promptly slipped over her hand. Wearing nothing but this and a smile, she stepped bare footed, bare breasted and bare arsed out into the pool area through a double set of doors designed to shield the lockerroom's modesty.<br>\r\n<br>\r\nThankfully for her, this area, too, was deserted. She stepped across the blue criss-cross mats left on the floor to provide grip and dipped her toe into the water.<br>\r\n<br>\r\n\"Damn. It's warm.\"<br>\r\n<br>\r\nSo much for it waking her up. Taking a deep breath, she thrust her arms forward, bent at the knees and dove into the pool. She felt faintly digusted as she swam beneath the surface. The water was murky and foggy, like the filter hadn't worked or something. She could barely see a few feet in front of her. She turned back towards the side of the pool, and broke to the surface close to the wall. She kicked her legs so that she swam forward, and folded her arms on the side. Unable to resist, she rested her head on her arms and closed her eyes. Just for a minute...<br>\r\n<br>\r\nShe awoke with a jolt as a beach ball bounced off her bonce. She looked up with surprise to see Malcolm, the senior swimming instructor, grinning down at her.<br>\r\n<br>\r\n\"Morning sleepyhead.\" he said.<br>\r\n<br>\r\n\"Hey Mal. Listen, what's up with this water?\"<br>\r\n<br>\r\n\"Why, what's wrong?\"<br>\r\n<br>\r\n\"It's filthy. I can barely see more than a foot or so.\"<br>\r\n<br>\r\nMalcolm frowned. \"Damn. The filter must have broken. Again. Listen, can you take the first class today, while I go speak with the owner about this?\"<br>\r\n<br>\r\n\"Yeah sure. What's the first class?\"<br>\r\n<br>\r\n\"Oh, just a couple of kids, about 4 to 6 ish. They're supposed to be learning how to swim underwater. Typical, huh?\"<br>\r\n<br>\r\nJenna couldn't help but laugh. Malcolm was only a few years older than her, yet already he'd adopted a world weary, cynical approach to most things.<br>\r\n<br>\r\n\"I'll be back in time for the afternoon class.\" he promised as he retreated into the men's lockeroom.<br>\r\n<br>\r\nAs she waited for the children to arrive and get dressed, Jenna busied herself swimming laps. Her favourite way of swimming was the breast stroke; ever since she'd developed, she'd found that they made excellent flotation devices. It made the stroke so easy it was almost like she was flying.<br>\r\n<br>\r\nThe peace wasn't to last. Before long the air was filled with the sound of noisy, annoying children as they cannon balled into the shallow end of the pool.<br>\r\n<br>\r\n\"Hey! Stop that!\" Jenna shouted in her most authoritive tone.<br>\r\n<br>\r\nDiscarding her swimming, Jenna made her way over to the shallow end and stood up in the water. Since it was designed for kids, the surface of the water barely passed her knees. For some reason the children fell into a complete and utter silence, as if on some sort of cue.<br>\r\n<br>\r\n\"Okay. That's better.\" she told them.<br>\r\n<br>\r\nTheir eyes were wide with what she assumed was respect.<br>\r\n<br>\r\n\"Today we're going to be swimming underwater. Now I'm going to start handing out goggles, but you are <i>not </i>to start swimming straight away. Are there any questions?\"<br>\r\n<br>\r\nOne of the boys thrust his hand in the air.<br>\r\n<br>\r\n\"Yes?\" Jenna asked.<br>\r\n<br>\r\n\"Um, miss, I was just wondering...\"</span></div></div>",
            "created":1370754000,
            "id":1607939,
            "title":"She doesn't know!"
        },
        "12321":{
            "author_id":"doragom333",
            "author_name":"doragom333",
            "content":"<div class=\"\"><div> <span>\"My swimsuit is new and really itchy.  I swim much better naked, so can I take it off too?\"<br>\r\n<br>\r\n\"What?\" Jenna replied, flabbergasted.  \"Of course you can't!  This is a public pool.  Also,\" she continued, looking around at the other children, another boy and a girl.  \"Wouldn't it be embarrassing being naked in front of someone you don't know?\"<br>\r\n<br>\r\n\"It's okay, Miss Teacher,\" the girl spoke up.  \"They're my brothers.  And you really aren't being fair.\"<br>\r\n<br>\r\n\"I think I'm being perfectly fair,\" Jenna replied, though an uneasy feeling began creeping up her spine.  \"Everyone has to wear a swimsuit in the pool.\"<br>\r\n<br>\r\n\"Then why aren't you?\" the girl replied, pointing at Jenna.<br>\r\n<br>\r\n\"Sweetie, don't be silly, I-\" Jenna began, but stopped upon seeing her bare breasts.<br>\r\n<br>\r\nJenna sputtered, moving her hands along her body, trying to grasp at fabric that wasn't there for nearly half a minute before turning back to the children, whose faces continued giving her an innocent, yet earnest stare.  \"AH!\" Jenna screamed, turning around and swimming towards the deep end.<br>\r\n<br>\r\n<i>How could I have been so stupid!?</i> she thought.  <i>The car ride, the locker room... and now I'm naked in front of these kids!?  I'm lucky if I'll only get fired for this!</i><br>\r\n<br>\r\nHer fearful thoughts were then interrupted by a loud splash, followed by childish laughter.  Turning her attention back to the kids, she saw that the three had entered the water and had already made it halfway across the pool, where the water began to get deep.  However, one of the boys, presumably the one who got splashed and also the one deepest in the pool, coincidentally, was beginning to flounder and struggle, splashing wildly.<br>\r\n<br>\r\nJenna instinctively sprang into action, concern for the child overcoming her mortification.  Hurrying back towards the group, she scooped the boy in her arms and brought him back to the others.  Fortunately, he hadn't breathed in any water, so he was fine once he could touch his feet to the pool floor.<br>\r\n<br>\r\n\"N-now then,\" Jenna stammered, crouching in the water and covering her breasts with her arms.  \"Don't do that again!  I know you've been told not to swim into the deep end on your own without adult supervision.\"<br>\r\n<br>\r\n\"Sorry,\" the boy apologized, his face red with embarrassment from having to be saved.  \"Can we please have goggles now?\"<br>\r\n<br>\r\n\"Goggles?  Oh-Oh, right!\" Jenna said, the lesson plan suddenly coming back to her.  \"I just need to go get them from the pool box-\" she stopped mid-sentence.<br>\r\n<br>\r\nSaid box was on the corner of the pool room, and she would have to get out of the water to get the equipment.  She thought perhaps to excuse herself to go find a towel, spare swimsuit for the staff, or something, but she had a feeling that if she left these kids alone again, they could get into even worse trouble.<br>\r\n<br>\r\n\"C-could you please, not look at me while I get them?\" Jenna asked, her face turning red.<br>\r\n<br>\r\n\"Okay,\" the kids said, covering their faces with their hands.  However, Jenna could see that all three of them had opened their fingers enough to still see what was happening.<br>\r\n<br>\r\nSighing, Jenna quickly exited the pool and dashed over to the box, covering her rear as she went.  She tried to keep one hand there as she opened the box with her other hand and rummaged through to find the goggles.  But the going was slow, as the goggles turned out to be underneath the flippers and kickboards, no doubt due to organizing incompetence.  After a few seconds of this, she realized that her hand wasn't blocking much anyway and brought her other hand in so that she could get back in the water.<br>\r\n<br>\r\nShe needed this lesson to end now.  Get the kids out of the pool area, grab a towel from the locker room, and get the heck out of dodge.  If only there were some way...<br>\r\n<br>\r\nA lightbulb moment pinged in her head.<br>\r\n<br>\r\nGoggles in tow, she leaped back into the water and nearly threw the goggles at the trio.  \"All right then,\" Jenna said nervously, covering up as before.  \"So I know that today the plan was going to be swimming underwater, but unfortunately the water is still dark and murky, as you can see.\" she looked down, indicating the clouded pool.  \"So, sadly, we'll just have to do treading practice and call it early-\"<br>\r\n<br>\r\nA loud whirring noise suddenly broke her speech.  The filters had reactivated!<br>\r\n<br>\r\nJenna's face paled as the fogginess faded away allowing a clear view of everything underwater, including the three naked bodies in front of her.<br>\r\n<br>\r\n\"W-Why are you all naked!?\" she screeched.  \"Where are your swimsuits?\"<br>\r\n<br>\r\n\"I told you, I swim better naked.\" the first boy replied.  \"And hey, it's not fair that you get to swim naked while we have to wear itchy swimsuits.\"<br>\r\n<br>\r\n\"Yeah!\"  \"Naked swim!  Naked swim!\" the others added.<br>\r\n<br>\r\n<i>These kids are crazy!</i> Jenna screamed internally, looking around frantically for their discarded clothes.<br>\r\n<br>\r\n\"Hey, Jenna,\" Malcolm's voice called out as he entered through the doors.  \"We got the filters back up and running, so everything's good to-\" he stopped, stunned by the view of Jenna's naked body hunched over in the pool and three naked bouncing bottoms mooning in his direction. \"Wh-Wha-?!\" he stammered.<br>\r\n<br>\r\nJenna couldn't take this anymore.  \"LongStory,AccidentISwear,CoverForMe,GottaGo,ExplainItAllLaterByeAAAAAAAA! 34; she screamed, words flinging from her mouth as she charged up the stairs, both arms across her breasts, too panicked to cover her crotch, nearly bowling over Malcolm as she dove into the locker rooms.<br>\r\n<br>\r\nFortunately, she still had her key, so she was able to open up her locker and grab her belongings.  Too freaked out to search for a towel, she put on her socks and shoes, and tore through her handbag in search of any wearable clothing.  Unable to find any, she positioned the bag in front of her lower body, covered her breasts with her other arm, and slammed through the emergency exit on her way to her car in front of the parking lot.<br>\r\n<br>\r\nBack in the parking lot, she noticed that a lot more cars had arrived and some people were still in the parking lot.  Doing her best to ignore the gasps and cries of people beholding her body, wearing only a damp set of socks and shoes.  \"Why did I park so close to the front door!?\" she wailed.<br>\r\n<br>\r\nAfter only a minute and a half, but what felt like forever, she got to her car.<br>\r\n<br>\r\n\"Come on, come on, open!\" she hissed, having trouble fitting the key into the lock and covering herself at the same time.<br>\r\n<br>\r\nA sudden wave of gasps distracted her attention as she saw a large group of people bursting out of the entrance.  At that moment, she cringed as she realized: The emergency exits  are programmed to sound the alarm when opened.  She just drew the entire exercise club to her predicament!  There were even some students she knew from school in that group!<br>\r\n<br>\r\nAmidst all the hoots, cheers, and catcalls, she got the door open, sprung inside, slammed it shut, and drove out of there as fast as she could.</span></div></div>",
            "created":1378789200,
            "id":1661048,
            "title":"She knows!"
        },
        "12322":{
            "author_id":"anon_ninja",
            "author_name":"anon_ninja",
            "choices":[
                "She Knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>“Can I use my own goggles I brought from home?” asked the boy as he pointed towards the bench where he kept his towel and, surely enough, a pair of goggles.<br>\r\n<br>\r\n“Of course.\" Jenna said. \"Lemme go get them for you while you all wait her,” Jenna instructed as she stepped out of the shallow pool, giving the class a full-on view of her wet, naked body from head to toe. The children, still silent, stared quietly at their nude instructor and watched her gingerly walk around the premises trying not to slip while finding goggles for the rest of the class.<br>\r\n<br>\r\nAs soon as she finally found a stash of goggles, she came back into the shallow pool went on to help some of the kids adjust the fit of their goggles. Since Jenna was standing in knee-deep water, she had to bend over slightly in order to be in proper position to help the kits fit into their goggles. <br>\r\n<br>\r\nHowever, as she looked downwards, she noticed something peculiar in the water. Could it be some kind of weird reflection? Or possibly some strange debris? Upon further investigation, Jenna realizes…. <br>\r\n</span></div></div>",
            "created":1479536280,
            "id":2238950,
            "title":"She doesn't know!"
        },
        "123222":{
            "author_id":"anon_ninja",
            "author_name":"anon_ninja",
            "choices":[
                "She knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmm, must be this debris in the pool. We really gotta fix those filters,\" thought Jenna as she kicked away the particulate matter in the water. Her kicking motion caused her perfectly rounded breasts to sway side-to-side as she finished up helping the kids put on their goggles. For the longest time, Jenna complained about how poorly the filters at the pool worked since the water was frequently murky, which made swimming in it rather unpleasant. Nevertheless, Jenna decided to proceed with the swimming lesson anyways. <br>\r\n<br>\r\n\"Alright boys and girls! Let's start today's lesson by using the kickboards!\" said Jenna as she motioned to the equipment stash. \"Wait here while I get everyone a board\" instructed Jenna as she  energetically hopped out of the pool.. once again putting her bare buttocks on display to the kids as they looked on in awe. <br>\r\n<br>\r\nAs soon as Jenna found the boards, she gingerly made her way back into the pool, causing her breasts to bounce around with every step. When she got back to the pool, she handed every student a board and began to demonstrate the first exercise. <br>\r\n<br>\r\nJenna wanted to start the day by teaching the kids how to float on their back. \"You see? It's simple. You just put the board right behind your back and let yourself relax\" instructed Jenna. She proceeded by placing the board on her lower back just as she instructed and allowed herself to float in the water. <br>\r\n<br>\r\nIn one magnificent instant, the buoyancy of the board hoisted Jenna's curvaceous body towards the surface of the pool, lifting he ample breasts completely out of the water. Unsure of how to react in this situation, the students remained silent and their eyes were glued to Jenna's boobs. For some reason, Jenna realized that the class was being unusually quiet but she couldn't seem to figure out why. \"I guess it's  normal.. I'd be pretty shy on my first  day of class too\" figured Jenna as she continued to lay on her board naked-as-the-day-she-was-born. Jenna decided to spend a few more moments relaxing and demonstrating how to float while the kids \"observed\" her technique. After all, she loved the way the cool breeze felt on her skin. Jenna's entire body was covered in goosebumps as it was exposed to the morning air. She even started to feel her nipples harden a bit. \"Oh my! Thank God no one is able to see that!\" thought Jenna as she quietly chuckled to herself.. \"That would be pretty embarrassing!'<br>\r\n<br>\r\nAfter a few moments have passed, Jenna figured it was the kids' turn to try it out. \"Any questions about how to use the board?\" asked Jenna the class while her nipples continued to face the sky. After a long, awkward silence, Jenna turned her head as she heard a voice... \"Uhhh... Jenna???\"</span></div></div>",
            "created":1492506660,
            "id":2306871,
            "title":"She doesn't know!"
        },
        "1232222":{
            "choices":[
                "She knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>Looking over at the source of the voice, she saw that it was one of the boys, waving his hand around in the air, trying to get her attention.  \"Yes?\"  She asked, getting off the kickboard, her breasts swaying gently from the motion.<br>\r\n<br>\r\n\"I don't have a board.\"<br>\r\n<br>\r\nThat was an easily solved problem, Jenna thought to herself, \"Just take this one.\"  She said, passing the board from her demonstration to the kid.  Once she double checked that everyone had one, she began helping those kids that needed it getting on the boards on their backs.  A few kids rolled off a few times, but everyone was able to get the hang of it pretty easily.  For some reason, it seemed to mostly be the boys rolling off whenever she was around.  They probably just liked her and wanted her attention was Jenna's thought.<br>\r\n<br>\r\nOnce everyone was done with this lesson, she got everybody's attention, \"Alright class, the next thing we're going to work on is the breast stroke, which is how you're going to have to swim when underwear, let me demonstrate.\"  First she demonstrated on the surface, her breasts bobbing up and down in the water in front of her, then she demonstrated underwater.<br>\r\n<br>\r\nAfter a bit of this, she came back in front of the class and made sure everyone knew the basics.  But before the lesson could start, one of her students had swam up next to her and was poking her in the arm.  \"Yes?\"  She asked.</span></div></div>",
            "created":1548505500,
            "id":2607704,
            "title":"She doesn't know!"
        },
        "13":{
            "author_id":"anonegg",
            "author_name":"Anonegg",
            "choices":[
                "She knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>Jenna threw her handbag into the backseat of the car before sitting in the driver's seat. The engine purred into life as she turned the key. She shivered, however, as the air conditioning blew over her bare skin.<br>\r\n<br>\r\n\"Why does it feel so much colder?\" she asked herself as she pulled out into the road.<br>\r\n<br>\r\nBut of course; her mother had borrowed the car only yesterday because hers was out of gas. She must have messed with the air con. With a tut of disapproval, Jenna turned the knob down to make it warmer.<br>\r\n<br>\r\nThe drive proved fairly uneventful, although Jenna was a little bit confused when she'd pulled up to a set of traffic lights. The car beside her was an SUV; a tall car that towered over her little convertable. For some reason the teenage boy sitting in the passenger seat had been mesmerised by Jenna. He'd just stared at her, wide eyed. It was a little unnerving. Still, the lights had changed to green and the car had pulled away, so Jenna pushed the thought out of her mind.<br>\r\n<br>\r\nHer first stop was the grocery store. It was a small, family-run store a block or two away from her house. She'd pick up a few things here for her mom before heading over to the shopping mall to get some new clothes for her holiday (and a little beauty treatment while she was there). The sidewalk outside the grocery store was empty, so she pulled up in the empty space and got out of the car.<br>\r\n<br>\r\nAs she slammed her door shut, however, she noticed something unusual in the side mirror...</span></div></div>",
            "created":1369717200,
            "id":1598620,
            "title":"Shopping"
        },
        "131":{
            "author_id":"anonegg",
            "author_name":"Anonegg",
            "content":"<div class=\"\"><div> <span>The sight of a bare hip greeted Jenna as she looked into the mirror. As she turned towards it, the hip also moved, revealing a patch of neatly trimmed brown hair. Frowning with confusion, she looked down at herself.<br>\r\n<br>\r\n\"Oh. My god.\"<br>\r\n<br>\r\nPanicking, she covered herself with her hands and looked around. Thankfully there weren't many people in the street, although those few who were were clearly admiring what they saw. Revealing her breasts once more, she reached down and pulled the handle on the car door. The door opened, but the car alarm began to bleep. It sometimes happened with her car. Usually it was just a minor inconvenience, but in her state of undress the last thing she wanted was to draw attention to herself! The grocery store clerk ran out to see what all the fuss was about, and caught a full-frontal glimpse of Jenna's naked body as she threw herself into the front seat.<br>\r\n<br>\r\n\"Come on come on.\" she urged as she fumbled with the car key.<br>\r\n<br>\r\nAfter what seemed an eternity she was able to get the key into position and revved the engine. She pulled out into the road and began the nervous journey home.<br>\r\n<br>\r\nHow in the hell hadn't she noticed she was naked?!</span></div></div>",
            "created":1370062800,
            "id":1601518,
            "title":"She knows!"
        },
        "132":{
            "author_id":"anonegg",
            "author_name":"Anonegg",
            "choices":[
                "She knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>\"Huh. My mirror's a little bit loose.\"<br>\r\n<br>\r\nBending over, she began fumbling with it, hoping that it would somehow lock into place again. After nearly a minute she gave up with a groan of disgust.<br>\r\n<br>\r\n\"It'll be okay for now, but I should really go to a mechanic in case a police officer notices it. I would be <i>so </i>embarrassed if I got a ticket for a broken mirror!\"<br>\r\n<br>\r\nStill, that was something to worry about later. For now she opened up the back door of her car, retrieved her handbag and made her way into the shop. The small bell above the door jingled, announcing her arrival. The store clerk was busy stacking magazines on a nearby shelf, however, so didn't look around.<br>\r\n<br>\r\nPicking up a basket, Jenna slid her arm through the handles and made her way around the store. She took her time examining the produce, trying to find the cheaper options where she could.<br>\r\n<br>\r\n\"Air conditioning is a bit colder than normal.\" she muttered to herself.<br>\r\n<br>\r\nIt was the same problem as her car. The absurd thought of her mother sneaking into the store dressed like a ninja and messing with their settings made her giggle. Still smiling at the bizarre mental image, she made her way to the front counter and placed the basket on top of it. The store clerk, thoroughly engrossed in a magazine article, idly went behind the counter with his eyes glued to the page.<br>\r\n<br>\r\nJenna's handbag slipped from her shoulder and fell to the floor, spilling her makeup bottles.<br>\r\n<br>\r\n\"Oh nuts.\" she muttered, and crouched down. She began scooping the rogue items back into her handbag while overhead the electronic bleeping of the clerk scanning the items could be heard.<br>\r\n<br>\r\n\"Paper or plastic?\" he asked.<br>\r\n<br>\r\n\"Paper, please.\" she called up.<br>\r\n<br>\r\nThe rustling of the paper bag sounded as Jenna retrieved the last of her makeup. Thankfully, none of it seemed damaged. She stood up.<br>\r\n<br>\r\n\"That'll be eig...\" the store clerk trailed off, his eyes widening in surprise.<br>\r\n<br>\r\n\"What?\" she asks.</span></div></div>",
            "created":1370062800,
            "id":1601531,
            "title":"She doesn't know!"
        },
        "1321":{
            "author_id":"anonegg",
            "author_name":"Anonegg",
            "content":"<div class=\"\"><div> <span>\"You're, uh, you're naked.\"<br>\r\n<br>\r\nJenna dropped her money on the counter, her eyebrow raised in confusion.<br>\r\n<br>\r\n\"You what now?\"<br>\r\n<br>\r\n\"Miss, I'm going to have to ask you to either put some clothes on or leave.\"<br>\r\n<br>\r\n\"What are you talking about? I'm not-\"<br>\r\n<br>\r\nShe looked down.<br>\r\n<br>\r\n\"...naked.\"<br>\r\n<br>\r\nJenna panicked. She grabbed the nearest cover she could think of; the brown paper bag on the counter. It was just wide enough to hide her nippes as she clutched it to her chest. She closed her eyes as her embarrassment crashed down upon her. The events of the day - her naked breakfast, the phone call, that pervy kid gawking at her at the lights - all came back to her in a red-faced explosion.<br>\r\n<br>\r\nAnd then to make matters worse, the bell above the door rang. Somebody else was coming into the shop.<br>\r\n<br>\r\n\"Hey, they're towing away a... woah.\"<br>\r\n<br>\r\nWith a sense of dread, Jenna tore her eyes away from this new stranger and looked out the window. Sure enough, there was her car... being attached to the back of a tow truck. Clutching her groceries to her naked chest, Jenna ran out of the store, determined to stop them before they took away her means of getting home...<br>\r\n<br>\r\n...and stood on the pavement, staring, as the tow truck pulled away, leaving her wearing nothing but shoes and a brown paper bag. Her home was a twenty minute walk away.<br>\r\n<br>\r\n----<br>\r\n<br>\r\nAfter a minute or two of experimenting, Jenna discovered that if she held her hands cupped in front of her crotch, with the bag resting on top, then it was just tall enough to cover her from the front. It was close, however. With every step her unsupported bust pushed against the bag, threatening to spill over the top at any second. As she made her way down the suburban sidewalks towards her home, she drew plenty of stares from the front. No doubt they were curious about how little this woman was actually wearing; from their angle, they'd be able to see the top of her breasts and most of her legs.<br>\r\n<br>\r\nShe didn't dare look behind her, however. Her face burned thinking about those expressions turning from curiosity into wide-eyed astonishment. How could she ever show her face in this neighbourhood again?<br>\r\n<br>\r\nAfter what seemed an eternity she reached her front door. With a sigh of relief, she placed the grocery bag on the floor, and reached for her handbag... which, she realised, she'd left on the counter back at the store.<br>\r\n<br>\r\n\"How could this get any worse?\" she asked the cruel and all-knowing universe.<br>\r\n<br>\r\nShe grabbed the bag and lifted... and watched in horror as it tore in two. The groceries crashed to the floor.<br>\r\n<br>\r\n\"I had to ask.\"<br>\r\n<br>\r\nThere was really only one more thing she could do, now; hide behind the nearest hedge and wait for her mother to return home.<br>\r\n<br>\r\nIt was going to be a long wait.</span></div></div>",
            "created":1371013200,
            "id":1609904,
            "title":"She knows!"
        },
        "1322":{
            "author_id":"ewong247",
            "author_name":"Ewong",
            "choices":[
                "She Knows!",
                "She Doesn't Know!"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, I was just distracted by those hooligans outside. That'll be eight fifty.\" The clerk said.<br>\r\n<br>\r\nJenna swiped her credit card and once it was approved, she thanked the clerk, hugged the bag to her chest, and walked away.<br>\r\n<br>\r\n\"Hmm, backless dress.\" The clerk thought as she walked past him.<br>\r\n<br>\r\nJenna walked out of the store, and was shocked to see a bunch of teenagers kicking her car's mirror around.<br>\r\n<br>\r\n\"Stop right there!\" She commanded.<br>\r\n<br>\r\nThe boys all turned towards her, it didn't take long for them to see her bare pelvis under the bag. They stood with their mouths open in disbelief.<br>\r\n<br>\r\n\"Hmm, they must react well to a strong female authority.\" Jenna thought.<br>\r\n<br>\r\nShe walked to her trunk and placed the bag inside, bending at the waist. <br>\r\n<br>\r\n\"Uh, miss?\" One of the boys asked</span></div></div>",
            "created":1386127860,
            "id":1702864,
            "title":"She doesn't know!"
        },
        "13221":{
            "author_id":"anon_ninja",
            "author_name":"anon_ninja",
            "content":"<div class=\"\"><div> <span>“I think you forgot something before you left the house this morning” sneered one of the teenagers as he pointed down at Jenna’s bare pelvis.<br>\r\n<br>\r\n“What do you mean? I didn’t forget anyth…” said Jenna and suddenly stopped herself as she caught a glimpse of the reflection of her bare hip against side of her car. She immediately realized that she accidentally left the house in the nude and spent all this time in front of strangers completely naked. Jenna screamed in complete shock as she tried to retain any form of modesty by lowering her grocery bags to at least cover up her entire front-side from the teenage boys. However, this effort was fruitless as this action ended up flashing her ample breasts to her very entertained audience. Things took a turn for the worse, however. In the act of fumbling around with her groceries bags, Jenna accidentally lost control and watched her only form of cover fall to the ground, giving the boys a completely unobstructed view of her naked body.<br>\r\n<br>\r\n“Aaaaaaah!” Jenna shrieked in horror as she immediately got down on all fours to try to find her keys on the ground and leave this embarrassing situation as fast as possible. However, she couldn’t find her purse among the pile of groceries and ripped pieces of paper bags, at which point she realized that she left it back at the front counter. Mortified by this realization, Jenna quickly stood up and made her way back in the store to retrieve her belongings. The teenagers, who at this point were filming the entire scene on their phones, stared in wide-eyed amazement as they watched Jenna’s jiggling butt make its way back in the store. As Jenna sped-walked over to the counter with her arms pumped at her sides, she didn’t care that she was currently displaying her bouncing boobs and naked body to three store-clerks and a handful of customers. She was mentally focused on fetching her purse and getting out of there as fast as possible, leaving all witnesses staring in disbelief by this sight.<br>\r\n<br>\r\nAfter Jenna reached her bag, she grabbed it and quickly rushed back out of the store, made her way to the parking lot and headed over to her car. As she passed by the group of teenage boys again, she felt them give her bottom a few pinches and spanks as she reached into her purse for her key and unlocked her car. When Jenna got it, she hurriedly fired up the engine and sped out of the parking lot and made her way home- naked and without groceries. Jenna couldn’t believe the embarrassment she put herself through today, but needless to say, now she knows!<br>\r\n</span></div></div>",
            "created":1479534900,
            "id":2238945,
            "title":"She Knows!"
        },
        "14":{
            "author_id":"ebtf",
            "author_name":"EBTF",
            "choices":[
                "She knows!",
                "She doesn't know."
            ],
            "content":"<div class=\"\"><div> <span>Jenna decided to go to the beach. But when she sat down in her car, she felt the leather rub against her... bare bottom? But Jenna figured that she wearing one of her skimpy bikinis and so, she started the car and went to the beach.<br>\r\n<br>\r\nAs soon as she got to the beach, she realized that she forgot to bring a towel, but luckily for her, there was a stand nearby that sold beach towels for $5. But does she know of her nudity at the stand?</span></div></div>",
            "created":1391527620,
            "id":1738822,
            "title":"Beach"
        },
        "142":{
            "choices":[
                "She knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>The teenager working at the stand looked to be about fifteen years old, and gawked at her, mouth agape, as though he had never seen a girl in a bikini before.  Which was preposterous, because the beach was full of girls in bikinis even skimpier than the one Jenna (thought she) had on.<br>\r\n<br>\r\nShe flashed the boy a smile (and a whole lot more).  \"Could I get a beach towel, please?  I seem to have left mine at home.\"<br>\r\n<br>\r\nThe boy didn't answer, and only stared at her, his eyes flickering between her breasts and her crotch.  Okay, Jenna enjoyed teasing boys as much as the next girl, but this was getting a bit creepy.  She leaned forward over the counter, letting her full breasts dangle beneath her.  \"Hey, I'm up here!\"<br>\r\n<br>\r\nHe blinked, finally meeting her eyes.  \"Sorry, what?  A towel?  Yeah, that makes sense.  I can see why'd you want one.\"<br>\r\n<br>\r\nJenna rolled her eyes at his adolescent foolishness.  \"You take card, right?\"  She reached into her purse and handed him her card.  He fumbled with it like an idiot before running it on the machine.  Jenna rolled her eyes as she took the towel and walked away, feeling the boy's eyes on her butt.  He was probably new here.  After a few weeks on the job, he wouldn't look twice if some exhibitionist slut crossed his path.<br>\r\n<br>\r\nShe set the towel down on the sand and lay down when she realized that she didn't bring any sunscreen.  Well, she could go back to the stand and buy a bottle, but that meant another run in with the boy who couldn't keep his eyes in his head.  Oh well.  She'd just have to make a new friend instead.  That was half the fun of going to the beach, wasn't it?<br>\r\n<br>\r\nShe looked around, surprised at all the attention the other beach goers were giving her.  It seemed like half the people were looking at her, the men with lust and the women with jealousy.  That cheered her up.  She knew she was gorgeous, but it was nice to be validated like that.  Eventually, she found someone she could ask to rub sunscreen all over her toned and supple body.</span></div></div>",
            "created":1479435900,
            "id":2238525,
            "title":"She doesn't know."
        },
        "15":{
            "author_id":"gundamfan",
            "author_name":"the dude",
            "choices":[
                "nature hike",
                "gym",
                "movie theater",
                "visit grandma",
                "walk around the city"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>where is jenna going</span></div></span></div>",
            "created":1391486700,
            "id":1738370,
            "title":"Other (Writer's Choice)"
        },
        "152":{
            "author_id":"jlharris99",
            "author_name":"jlharris",
            "choices":[
                "the gym is in walking distance",
                "take a drive",
                "take a bus ride"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the gym close to her house or does she need to take her car or a bus there?</span></div></span></div>",
            "created":1453321500,
            "id":2091867,
            "title":"gym"
        },
        "1523":{
            "author_id":"anon_ninja",
            "author_name":"anon_ninja",
            "choices":[
                "She Knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>Jenna had to get halfway across town to get to the gym. Luckily for her, there was a city bus that could pick her up near her house and drop her off right in front of the gym. <br>\r\n<br>\r\nRealizing that this was the best option, Jenna began briskly walking towards the bus stop wearing nothing but a pair of socks, sneakers, and her purse. <br>\r\n<br>\r\n“Hmm. There's a bit of a nip in the air” thought Jenna, realizing that the morning air was more frigid than she anticipated. “Oh well, I'm sure it'll warm up this afternoon and everything will be back to normal” she figured as she continued walking towards her stop. <br>\r\n<br>\r\nHer perfect double D breasts and rounded butt cheeks bounced and jiggled with every step as Jenna’s neighbors looked on in both shock and excitement. Several of her male neighbors caught sight of this and took the liberty of using their phones to record the scantily clad brunette make her way to her destination.<br>\r\n<br>\r\nBut Jenna had no idea of the show she was putting on for her neighbors. In fact, she was so oblivious of her predicament that she decided reach into her purse and pull out a pair of headphones to listen to her gym-music playlist during her walk. The nearly-naked Jenna was lost in the world of her music until she finally reached her bus stop where she was greeted by a handful of teenagers on their way to school and quite a few adults who looked to be on their way to work. <br>\r\n<br>\r\nThey all gave Jenna wide-eyed stares but she paid no attention to them until one of the teenagers grinned at Jenna and began talking to her.<br>\r\n<br>\r\n“Excuse me, lady”….<br>\r\n</span></div></div>",
            "created":1480042200,
            "id":2241466,
            "title":"take a bus ride"
        },
        "15232":{
            "author_id":"lamppost",
            "author_name":"lamppost",
            "choices":[
                "She knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><div> <span>As one of the teenagers talked to her, Jenna pulled off her headphones and hung them around her neck.<br>\r\n<br>\r\n\"Yes what is it?\"  She replied a little on guard.  While it wasn't unusual to get occasional looks at her attractive body it was a bit out of the ordinary for a stranger to suddenly talk to her.  Though come to think of it she had been getting more looks and stares than usual this morning.  And not just from men, even from women.  Though she was sure it was just a coincidence and she was probably overreacting.<br>\r\n<br>\r\nThe younger teenager smiled at her.<br>\r\n<br>\r\n\"I just wanted to say you look great this morning.  Very stylish of you.\"  The boys friends seemed to giggle among themselves as they watched the two of them.  Had they but him up to this?  Dared him to talk to the beautiful older girl waiting for the bus?<br>\r\n<br>\r\nJenna blushed a little from the upfront praise of the boy appreciating her outfit, unaware that a group of adults behind her had their phones out to recording her rounded butt.  The group of teenagers also had gotten their phones out.  Perhaps they were bored waiting for the bus?<br>\r\n<br>\r\n\"Thank you, that's very nice of you to say.  It's nothing special, just something I picked at the last minute\"  She said with a shy smile.<br>\r\n<br>\r\n\"Well I have to say I really like it.  It suits a girl like you well.  It's very daring.\"  The boy said as his eyes roamed over her body.<br>\r\n<br>\r\n\"Oh I wouldn't think it's daring.  Usually my outfits are very modest.\"  Jenna said as she nervously wrung her hands behind her back.  This motion caused her sizable double D breasts to thrust forward, making them look even more enticing.  The teenager's jaw dropped a little as he took in the sight of the girl in front of him.  More and more people, adults and teenagers arrived at the bus stop as the time until arrival closed in.  Most were recording the nude body of the unknowing girl in front of them.  Some laughed among themselves and pointed while others muttered about exhibitionist sluts and the lack of proper morals in kids today.  Jenna was of course oblivious to it all as she focused on the boy in front of her.<br>\r\n<br>\r\n\"Well if you don't think it's daring then who am I to judge?  I just thought you looked beautiful.  So where are you headed looking like that gorgeous?\"  The boy said with a grin.<br>\r\n<br>\r\n\"Just across town.  There's a gym I work out at.\"  Jenna said with a small smile as she was hit on.<br>\r\n<br>\r\n\"All the way across town?  Well I'd love to join you but my friends and I have school.\"  The teenager motioned back to his group of friends who waved.  One of them even whistled at her which caused Jenna to blush.  Jenna could see in the distance that the bus was approaching.<br>\r\n<br>\r\n\"School is important.  I hope you and your friends have fun.\"<br>\r\n<br>\r\n\"Oh I'm sure we'll have plenty to share and talk about since we met you.\"  The boy smiled as he moved back to his friends.<br>\r\n<br>\r\nThe bus arrived and Jenna waited as the doors opened and a few passengers got off.  An older women's eyes widened as she spotted Jenna.<br>\r\n<br>\r\n\"You should be ashamed of yourself!\"  She yelled at Jenna as she walked past with a scowl.<br>\r\n<br>\r\nJenna rolled her eyes as she put her headphones back on and got on the bus.  Her outfit wasn't that bad was it?  She climbed up the steps past the wide eyed bus driver and took an empty seat.  She shivered as she sat down.  The seats sure were cold this morning.  She stared out the window unaware that everyone in the bus was looking at her.  The people who were waiting at the stop with her still hadn't put down their phones, Jenna unaware of them recording her shame.  Were their phones really that interesting?<br>\r\n<br>\r\nAs she looked out the window she settled in for a long bus ride.  She saw her reflection in the mirror and realized...<br>\r\n</span></div></div>",
            "created":1486806420,
            "id":2276203,
            "title":"She doesn't know!"
        },
        "153":{
            "author_id":"rocuevas",
            "author_name":"ROC",
            "choices":[
                "She knows!",
                "She doesn't know!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jenna got outside to her car and was digging through her purse for her keys. She was going to the movies to see the latest movies. As she got her keys she noticed something strange by her car. \"What the...?\" She said as she looked closer.</span></div></span></div>",
            "created":1448732520,
            "id":2067629,
            "title":"movie theater"
        }
    },
    "info":{
        "author_id":"anonegg",
        "author_name":"Anonegg",
        "brief_description":"A woman leaves her house completely naked; you decide when she finds out!",
        "created":1369687680,
        "description":"<td align=\"left\" class=\"norm\">Our heroine, Jenna, is about to leave the house with the vague feeling that she's forgotten something important. It's her clothes, of course! But when - and how - will she discover her little mistake?<br>\r\n<br>\r\nRules:<br>\r\n<br>\r\n1) No sex, please. We're ENFlish.<br>\r\n<br>\r\n2) This story is purely about a woman's nudity. This means NO to vore, expansion/shrinking, urination, characters soiling themselves or anything of that ilk.<br>\r\n<br>\r\n3) Each chapter MUST end with two options: \"She knows\" or \"She doesn't know\".<br>\r\n<br>\r\n4) Any chapters with the option \"She knows\" CAN end the story, if you want. Just give an idea on what happened afterwards. So if she is in the middle of a shopping mall and 'She knows', then describe how she escapes the situation before ending.<br>\r\n<br>\r\nRegards,<br>\r\nAnonegg.</td>",
        "id":1935374,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1548505500,
        "modified":1548505500,
        "pretty_title":"She doesn't know! (ENF)"
    }
}