{
    "chapters":{
        "1":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Magic",
                "Science",
                "Accidental",
                "Something else",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Here it is, the first page. Unfortunately, I'm only allowed a certain number of spaces per page (which can be a good thing). Here are some ideas, and in case you need an idea of someone to start with, I'll give you my main character, Debbie.<br>\r\n<br>\r\nShe's a 23 year old woman.<br>\r\nShort black hair.<br>\r\n5' 7\" tall<br>\r\nAverage build<br>\r\n34 A<br>\r\n28 waist<br>\r\n34 hips<br>\r\nLikes to wear just about anything, esp. bikinis (one and two piece) and tight clothing.<br>\r\nShe's straight<br>\r\nGeneral knowledge<br>\r\nAnd loves growing breasts of any size (but that can change due to the story)<br>\r\n<br>\r\nFinally, no popping (unless used as a reset like Captain Neil used to do), gore, male breast expansion, or racial slurs (light profanity is allowed, with stuff like this, it isn't unusual).<br>\r\n<br>\r\nAlso, keep a section for more choices open, please.<br>\r\n<br>\r\nFirst, how does this happen?</span></div></div>",
            "created":1197867600,
            "id":476594,
            "title":"The beginning"
        },
        "11":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Spell",
                "Manifestation",
                "Item",
                "Curse",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Magic can go right or wrong, depending on the user and the cause.<br>\r\n<br>\r\nHow does it happen now?</span></div></span></div>",
            "created":1197867600,
            "id":476596,
            "title":"Magic"
        },
        "111":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Potion",
                "Spoken spell",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>By use of a spell:</span></div></span></div>",
            "created":1201323600,
            "id":491315,
            "title":"Spell"
        },
        "1111":{
            "author_id":"gdesan73684",
            "author_name":"Linjeda271",
            "choices":[
                "Debbie drinks the potion now",
                "Debbie drinks the potion later",
                "A friend comes over"
            ],
            "content":"<div class=\"\"><div> <span>After having finished her shopping for the day, Debbie was approached by a man. He wore all black, therefore Debbie could not see his face.<br>\r\n<br>\r\n\"Hello Debbie.\" The man greeted. \"I have something for you.\" In his hand the man held an 8 fl oz bottle with a red liquid inside.<br>\r\n<br>\r\n\"What is it?\" Debbie questioned. She felt the urge to take the bottle, but she wanted to know what it was exactly.<br>\r\n<br>\r\n\"Drink it, and you will find out. I'm sure you will like it.\" The man answered. \"Do not worry. This isn't poisonous or anything like that. It won't harm you.\" The man placed the bottle in Debbie's hands before quickly waking away before Debbie could ask anymore questions. Debbie looked into the direction the man went, before heading home.<br>\r\n<br>\r\nOnce home, Debbie placed her shopping items down and sat on her couch. She held the potion in her hands.<br>\r\n<br>\r\n\"He said it would not harm me.\" Debbie said. \"If I want to know what this is, then I'll have to drink it.\"</span></div></div>",
            "created":1268110800,
            "id":848439,
            "title":"Potion"
        },
        "11111":{
            "author_id":"abrc11",
            "author_name":"Arkrieg",
            "choices":[
                "... Calls her friend",
                "... Laughs, that her breasts are bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Debbie immediately downs the red potion, then continues going home. She had no idea that her breasts were growing already. A few minutes later, she realizes her breasts were almost the size of volley balls. She then...</span></div></span></div>",
            "created":1325134800,
            "id":1248490,
            "title":"Debbie drinks the potion"
        },
        "113":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Grow bigger while they wear it",
                "Grow bigger because of an action or phrase",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>An object to amplify.<br>\r\n<br>\r\nHow does it work?</span></div></span></div>",
            "created":1197867600,
            "id":476601,
            "title":"Item"
        },
        "1132":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "the belt.",
                "the mug.",
                "the dowel rod."
            ],
            "content":"<div class=\"\"><div> <span>Debbie reached up for the pull string just above the ladder leading into the attic. It wasn’t much of an attic, more of a storage space. Still, she was able to store old boxes of mementos from her family. The weather was changing, the air chilling as winter approached. She’d gone up to find her old hooded sweatshirts, while around the house. As she searched for them, she noticed some old boxes her mother gave her. She opened one and found the photos of her grandparents. There was the first car grandpa bought, and there’s mom learning to ride a bike. The next box held old books and a journal from her grandmother, and underneath it was her mother’s journal. She read the trials and troubles her mother went through, when suddenly there was a crash beside her. She turned her attention to the box that fell next to her.<br>\r\n<br>\r\nIt was a little dusty, but she remembered getting it from a friend of hers. Debbie remembered her friend asking her to keep it safe, and that she would come back for it eventually. That had been three years ago, and she hadn’t so much as a phone call since. She opened the box and saw what was inside. There were a few empty jars, a book labeled spells, and some odd dolls and trinkets. It all seemed pretty strange, but something at the bottom of the box caught her eye. There was a brown paper bag at the bottom of the box. Debbie grabbed the bag and opened it. Inside were three ordinary objects: a black belt with a silver buckle, a black coffee mug, and a dowel rod with some shapes and symbols carved into it. The objects were simple enough, but she was drawn to them. She didn’t think her friend would mind if she borrowed one of these just for the sake of curiosity. Reaching into the bad, Debbie pulled out the…</span></div></div>",
            "created":1401166800,
            "id":1803412,
            "title":"Treasures Discovered"
        },
        "11322":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "sticks it under the faucet again.",
                "sets it down and thinks for a bit."
            ],
            "content":"<div class=\"\"><div> <span>Debbie sat the mug on the floor. Placing the bag back into the box, she folded the box closed, and set it back against the stack of other boxes. Turning to leave, she grabs the tote containing her winter clothes and take it along with the mug downstairs. Dropping off the clothing, she takes the mug into the kitchen. She wondered what the contents of the box could have been from. Perhaps they were things from her ex boyfriend. Maybe they were things she found in a garage sale. With winter coming around the corner, Debbie knew she could put the mug to some good use. Hot cocoa and a good book make for a nice evening.<br>\r\n<br>\r\nShe rinsed off the mugs black, glossy exterior, matching handle, and and then the inside. She filled it up and turned off the water. As she washed the inside, she noticed the water level sinking. Not just from the cleaning, before she finished she watched the water level vanish. She lifted the mug to inspect it for cracks. ‘Of course it would defective,’ she thought, reasoning why the mug was in storage. She couldn’t see any cracks underneath, so she filled the mug again. Just as it did before, the water level sank, until the bottom of the glass was visible and dry. She turned over the mug to inspect it closer, but as she did, water began to pour out of it. She flipped it rightside up, seeing the empty mug still empty, then tipping it over, poured more water until no more water escaped. Debbie began to reevaluate the item in her hand. “Ok, this is a magic mug of infinite space, I guess,” she humored to herself.<br>\r\n<br>\r\nHolding the mug under the faucet again, she turns on the water. The cup is filled, then magically empties. She fills it again, and it drains just the same. She fills it a third time, and as it drains, she feels a strange sensation in her chest. She turns her attention to her breasts, which are now sticking out like soft hills from her ribcage. “I must have grown two cup sizes,” she says, not even believing herself. She looks over at the mug and turns it over in the sink. Water begins to pour out, and her chest shrinks, drooping her shirt back to its original position. Debbie finally realizes the potential of this mug, and her deep desires begin to rise to the surface. Now she can have the chest she wants, or even more! She could be even bigger, but just how big could she get? Holding the mug in her hand, Debbie…</span></div></div>",
            "created":1401166800,
            "id":1803433,
            "title":"Her Cup Flows Over"
        },
        "11323":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Try it again with Amy.",
                "Invite more friends over, to see if it works on other people."
            ],
            "content":"<div class=\"\"><div> <span>Debbie removed the dowel rod from the old box. It was a light colored wood, with several little sigils burned into it. It fit the length of the box, roughly eighteen inches long, but no more around than a bike handlebar. It looked old, maybe ceremonial, but what did Debbie know. She decided to call her friend over to see if she could help. Debbie carried the rod down stairs and put it on her coffee table. She called Amy, a friend from college, studying history and ancient cultures. She might not know exactly what it was, but she could get them started in the right direction.<br>\r\n<br>\r\nAmy drove up to the house a few hours later. She had the weekend off, and decided that a visit to her friend to help her out would be a fun afternoon. She knocked on the door, and was greeted by Debbie, and a kind hug. They walked to the living room where Debbie showed Amy the rod in question. “I found it in the attic. I think it belonged to an old acquaintance, but I don’t know what happened to them. What do you think it is?” Amy looked over the rod, reading the sigils and carvings. They appeared old, but she couldn’t figure out where they originated from. “This does appear to be old, maybe five or six hundred years old, and I believe it was used to solve some sort of dispute. There’s stress fractures in the wood, as if people fought over it.” She looked over the rod while grasping it in both hands. Debbie wanted to see for herself, so she reached for the stick. “Really? Let me see.” As she grasped it, a split second of a sensation reached out to both parties. <br>\r\n<br>\r\nAmy released the stick, and Debbie held on. A little stunned, Debbie asked, “What was that?” Amy was just as confused. The sensation wasn’t uncomfortable, but it was unexpected. The lifeless wood sent some kind of tingle into each of their bodies, and neither one knew what the result was. Debbie spoke up again, “Amy, what was that?” “I don’t know,” she responds, “I don’t know what that was or how it happened.” Nothing on the rod appeared to be any sort of trigger or button. What could have set it off? “It happened when we both touched the stick. Perhaps if we repeat the process, we can see what will happen.” Debbie posed the idea, but Amy was having second thoughts. Debbie reassured her, “It wasn’t that bad, maybe all it does is send a little feeling into each person, to share some kind of experience, maybe?”<br>\r\n<br>\r\nAmy didn’t care for being the test subject, but she didn’t think her friend would intentionally risk her life, or her friends life. She agreed, and as Debbie held out the stick, Amy grabbed hold. The sensation returned, and the stick began to glow a soft yellow. It now felt warm, like it had rested by a campfire. Their breathing began to quicken, and they both looked each other over to see if any changes were occurring. Amy noticed it first, and tried to get her friends attention. When Debbie saw her gaze was at her chest, Debbie looked down.Her chest was pushing outward, filling out almost three inches in front of her. A big smile filled her face as she looked at Amy’s chest. Her friend, almost as small as she was, was sticking out almost four inches in front of her, raising her shirt just a little bit. “Amy, your chest is growing too!” Amy gasped, and released the rod. As soon as she let go, and her hands reached for her breasts, they shrank back to their smaller A cup size. She padded her chest in a sigh of relief, that the changes weren’t permanent, but as she sat back, she saw her friend was still a big as before. Her pumped breasts filling out a very full C cup, putting tension on the fabric of her shirt.<br>\r\n<br>\r\nDebbie held the stick in her hands, smiled at Amy and said, “Well, that’s a start.”</span></div></div>",
            "created":1439787600,
            "id":2022104,
            "title":"The Magic Rod"
        },
        "1133":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Theft. Grows bigger from other women",
                "Interacts with other (cursed or otherwise) objects",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices</span></div></span></div>",
            "created":1197867600,
            "id":476602,
            "title":"Something else"
        },
        "11331":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Physical touch",
                "Just by concentrating on them."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Theft:<br>\r\n<br>\r\nOption 1: By touching other women.<br>\r\n<br>\r\nOption 2: Absorption within seeing distance.</span></div></span></div>",
            "created":1201323600,
            "id":491313,
            "title":"Theft. Grows bigger from other women"
        },
        "113311":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Wear the special bra to the bar.",
                "Don’t wear the bra, but talk about it with your friends."
            ],
            "content":"<div class=\"\"><div> <span>Debbie was looking over some items at a garage sale. It was a warm autumn afternoon, folks were cleaning out their houses, and Debbie stopped by her neighbors place to see if there was anything she could use. Some old records were still in good shape, and she found some cool plates to replace the old ones that were chipped and cracked. She carried her things up to Mr. Paulson, her neighbor, sitting at a small card table with a little lock box. “Hey there, Mr. Paulson.” “Hello, Debbie. Good to see you out here. How are things at work?” “Oh, just wishing for that raise to come, but who knows.” “Ah, well, you’re patient, that’s for sure. So, find anything you like?” “Yeah, just these few things. Seems like you guys are getting rid of a lot of cool stuff.” “Yes, well, we’re just making some room before the holidays. Our son is flying home, and we needed to clean out his old room so he has somewhere to stay when he comes home.”<br>\r\n<br>\r\nJust as Mr. Paulson finished his sentence, Mrs. Paulson stepped into the garage from the house. Mrs. Paulson seemed like any other nice neighbor, except she had a fantastic chest. They looked like volleyballs stuffed in a teal blouse. She approached Debbie, “Hey there, good to see you again, Debbie. Why haven’t we seen you for dinner more this summer?” “Hey Mrs. Paulson. I’ve been busy with work, just trying to show them how much I offer so they’ll either give me this raise I’ve been asking for, or at least some better hours.” Mrs. Paulson looked at her husband, and he smiled back at her. She turned to Debbie and said, “Why don’t you follow me inside dear. There’s something I want to show you.”<br>\r\n<br>\r\nMrs. Paulson lead Debbie to her bedroom, up to her closet. She reached up on the shelf, and removed a small shoebox. “Debbie, I’ve had this item for quite some time, and it was given to me by a very special person who told me, when the time came, I needed to pass it on to a woman I thought deserving of it. I didn’t think it would change my life like it has, but I think you are the next woman who should have this.” She opened the box and inside was a simple white bra. Debbie had a hard time processing this, “I don’t understand.” “Oh now Debbie, you don’t think I was always this big, did you?” She stuck out her chest, emphasizing their size. As long as Debbie knew her, Mrs. Paulson had always been that big. However, she’d only known her for a few years. “Debbie, this bra is special. If you’re wearing it, you’ll be able to absorb the size off of other women.” She closed the box and handed it to Debbie. “Now, you’ll need to be careful who you take from, you don’t want to harm anyone who wouldn’t deserve it, so take your time and be patient.” Debbie still didn’t understand, but she accepted the gift anyway. “Thanks.”<br>\r\n<br>\r\nDebbie walked back to her house with her records, plates, and bra. She locked the door behind her and threw on one of the records she just bought and put the plates in the dishwasher to be cleaned. She sat down on the couch and placed the box in her lap. She opened it up and took the bra from inside. It didn’t special. Simple, no pattern, but it was small enough it would probably fit her. No way it would have fit Mrs. Paulson. If the thing did work, she still didn’t have any clue as to how much, or if there was a way to reverse it. Of course, she could think about it later, tonight was girls night. She was going to catch up with her friends Amy and Candace at the bar. She threw the bra on her couch and went toward her bedroom to change. As she entered, she hung her head out the door, looking at the bra on the couch. Should she wear it tonight? Just in case?</span></div></div>",
            "created":1382331600,
            "id":1682542,
            "title":"Magic Bra"
        },
        "113312":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Debbie was downtown one day. She enjoyed looking window shopping on weekends, especially whenever new shops would open. It was pretty regular for a few shops to go out of business once in a while, and then a new one would pop up in the same lot. So she passed the usual clothing stores, the food vendors, and soon came upon one such new store.<br>\r\n<br>\r\n‘World Lifestyle’ was printed on the window. A ding sounded above the door as Debbie entered. The small store was dimly lit with many shelves stocked with statues and other odd items. She perused the items but didn’t find any really interesting things she thought she needed. As she passed the counter, a man emerged from the back. He was wearing grey slacks and a matching vest, yellow shirt with stripped neck tie. “Hello my young friend. My name is Vince Hornstrom,” he said with a slight accent. “Is there anything I can help you with?” “Oh, I’m just looking around. I’m really not looking for anything.” “Are you sure I couldn’t interest you in this fine gemstone ring? Very rare and good for your luck.” “That’s alright. I don’t really believe anything could really change my luck, I’ve got enough of it already.” <br>\r\n<br>\r\n“Perhaps you do. I have something for you. It is customary in my homeland to give the first customer of your new business a special gift.” Vince twisted a ring on his hand and stared contently at Debbie, “and I think I know exactly what you want.” He reached under the counter and brought out a wooden box. He reached into it and pulled out a red jewel on a golden chain. “This jewel is very special.” He looked around the store to make sure no one else was around. “While you wear it, you will have the ability to take what you want from other women.” Debbie looked at Vince then at the necklace. “Just take it. Trust me, if you don’t want it, feel free to give it to someone else. But be careful who you give it to. The results may be devastating. And I know you won’t, but try not to take too much advantage of people, alright?” Debbie grabbed the necklace from Vince, “Sure, I won’t.” <br>\r\n<br>\r\n“Have a lovely day.” Debbie stepped out of the store and looked at the necklace. She put it on and continued down the street.<br>\r\n</span></div></div>",
            "created":1201323600,
            "id":491328,
            "title":"Just by concentrating on them."
        },
        "1133121":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Debbie walked down the street with her new necklace. It was a very nice gesture for the man to give her this beautiful necklace, but she did not need the little story that went with it. Taking traits from other women, that was just crazy. A woman with long legs walked past and Debbie thought to herself, ‘still, I wish I was a little taller, especially with longer legs like her.’ As she turned around she noticed everyone on the sidewalk getting shorter. As she stopped, it was easier to notice that she was getting taller. She turned around to notice the woman with the legs was now the same height as everyone else. Debbie looked down and saw she grew five inches, making her six feet tall with legs stretching her skirt taught and almost showing her panties. Debbie looked around at everyone else, who did not seem to notice. She needed an explanation, so she decided to head back to the store. As she entered, Vince was standing over by a table, cleaning off the table top with boxes nearby probably with things to put on the table. Debbie ran to him.<br>\r\n<br>\r\n“What just happened to me?!” Debbie exclaimed. “Oh, I see you grew a few inches. I do love taller women.” Debbie grabbed the necklace he had given her, “This necklace, are you telling me this is what made me taller?” “As I said before, you must have taken the height from another woman, the necklace is merely a conduit of transfer. Did you not believe me?” Debbie grabbed him by the shoulders, “Well, of course I didn’t, but now that it’s happened to me…I just…I mean…what’s going to happen to me?” Vince was still calm and collected. He placed his hands on Debbie’s wrists and gingerly removed them from her shoulders. He then looked sincerely and powerfully into her eyes, “You now have control over your image and the image of others. It is your responsibility to use, as you so desire. Just remember, no one will notice the changes outright until you bring up the change itself, then they will become aware.” He continued to look deeply into her, creating a relaxed feeling Debbie knew was genuine, “I gave you the necklace for a reason, but I cannot tell you why as of yet. All I can say is if you do have any questions, please visit me anytime.” He smiled and Debbie could not help but smile back. She felt relaxed enough to go home, but she still didn’t know what to do with this new charm.<br>\r\n</span></div></div>",
            "created":1265086800,
            "id":829593,
            "title":"Debbie stumbles on her new power."
        },
        "11332":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "and tries out one of the stones.",
                "and finds one of the stones missing!"
            ],
            "content":"<div class=\"\"><div> <span>Debbie was walking through the park in the early morning. To keep in shape, she would walk every day for two miles, or about twice around the park. Although she tried to stay in shape, she didn’t need to do her workout. Her metabolism wouldn’t let her get any larger than she was. Ever since sophomore year, Debbie hasn’t grown an inch. She doesn’t resent her body, but she wished she had more curves. Maybe some slightly bigger boobs and an ass to speak of. Walking along, Debbie didn’t worry about these things. She knew she could get surgery, but doesn’t want to go through the procedure or spend the money. So for now, she’s happy with what she has.<br>\r\n<br>\r\nFinishing the first lap, she passed a poor old homeless man. “Excuse me, miss. I don’t really have a place to stay, and it’s been a while since I’ve eaten anything. I was wondering if you could spare some change for an old soul, such as myself?” Debbie jogged in place thinking about the poor old man. She thought about the five dollars in her pocket she kept for her morning latte. Reaching into her backpack, she plucked out the five dollars and handed it to the old man. “Here you go. It’s all I’ve got right now. Sorry.” He grabbed the bill, but Debbie found she couldn’t let go of it, either. “I know, Debbie,” Debbie couldn’t move. She could only hold onto the bill, one foot in the air behind her, looking on to the old man. “…and it’s that selfless action you’ve shown me that will earn you a boon. I’ve looked into your spirit and found what drives you, whether you know it or not.” He held up a bag and Debbie’s hand shot up under it. All she could do of her own will was to move her eyes from the old man to the old leather bag now in her hand. “Each of these stones is associated with your body, in one form or another. Place them in water and the corresponding part of you will grow. Your body will adapt to accommodate the extra size and weight. Burn the item and that part of your body will return to its normal size. Be warned, once you burn a stone, it will be gone forever. Do you understand?” Debbie’s head shook up and down, “Good. I’ll be taking that five dollars.” Debbie’s hand released the money, but she still couldn’t move. “Be careful now. Remember, you can grow to your hearts content, but you can only go back once…” The old man walked down the track as a fog rolled in.<br>\r\n<br>\r\nAs soon as the fog rolled away, Debbie lowered her foot and arm. She looked at the bag in her hand and opened it up. There were four stones of different color. Along with them was a small piece of paper. The paper listed out the different color stone’s associated body part: red was for breasts, blue for her butt, green for height, and yellow for muscles. Debbie clutched the bag in her hand. Could this old man be telling her the truth? How could he make her react that way, freezing her and moving her unwillingly? Not feeling like finishing her walk, and with no money for coffee, Debbie decides to go home.<br>\r\n<br>\r\nThrowing her bag on the couch, she sits down in her bedroom. ‘Truth or not, it wouldn’t hurt to try these gems out. She opens the bag…<br>\r\n<br>\r\n1.\tand tries out one of the stones.<br>\r\n2.\tand finds one of the stones missing!<br>\r\n</span></div></div>",
            "created":1315458000,
            "id":1183757,
            "title":"Selfless Actions and You Shall Recieve"
        },
        "113321":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Have some fun.",
                "Try more than one?"
            ],
            "content":"<div class=\"\"><div> <span>Debbie pulls out the red stone. If she changed anything about herself, it would be her breasts. She walked to the kitchen and grabbed a drinking glass from the cupboard. She filled it up close to the top and set it down on the counter. Holding the stone in her fingers above the glass, Debbie dropped it in. The stone hit with a clink on the bottom of the glass. Just as it settled, little air bubbles escaped and floated to the top. “Huh,” Debbie gasped. The water level of the glass started to descend. She could feel her top getting tighter. The bumps on her chest started swelling outward. They formed in her palm, spreading outward. The growth stopped, and she let go of her chest.<br>\r\n<br>\r\nShe had grown two inches. The little stone sucked up the water in the glass, and in return, Debbie’s breasts grew. She lifted the glass and poured the stone into her palm. It felt wet, and a little warm, but soon cooled. She placed it on the counter and went to the bag. She pulled out the blue stone and grabbed the glass again. She filled it up and set it down. The stone settled on the bottom, bubbles floated upward, and Debbie grabbed her butt. The action was instant, her flesh was swelling and filling up her jogging suit. The fabric shifted to her swelling ass. The growth stopped, and the glass was empty once more. Debbie was in amazement, but she knew she had to be careful. Like the old man said, these things worked one way. If she ever wanted to shrink back, it would cost her any future growth. She had to be careful…<br>\r\n<br>\r\n1.\tbut that didn’t mean she couldn’t have a little fun.<br>\r\n2.\tor maybe try more than one in a glass?<br>\r\n</span></div></div>",
            "created":1315458000,
            "id":1183764,
            "title":"This Can't Be Real."
        },
        "11333":{
            "author_id":"kickfacer",
            "author_name":"ULTIMEGA",
            "choices":[
                "Store-bought",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more choices</span></div></span></div>",
            "created":1269320400,
            "id":855884,
            "title":"Something else"
        },
        "114":{
            "author_id":"kickfacer",
            "author_name":"ULTIMEGA",
            "choices":[
                "Natural-born",
                "Placed Upon",
                "Other forms"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Some curses can actually benifit the victim, but not without a price</span></div></span></div>",
            "created":1269320400,
            "id":855881,
            "title":"Curse"
        },
        "1142":{
            "choices":[
                "Growth continues overnight.",
                "Delayed Reaction."
            ],
            "content":"<div class=\"\"><div> <span>Debbie was walking down the road one day. Her hair was glistening in the sunlight, her beautiful green eyes having that same sparkle. However, she saw an old woman walking towards her. She decided to walk right past her. However, the woman grabbed her wrist, and Debbie turned to face her. The woman said to her, \"My child, I have grave news of your future. If you go down the path further, you will encounter a demon in disguise, and something of dignity will be stripped from you.\" Debbie didn't know what she meant, but she kept on the lookout.<br>\r\n<br>\r\nA couple more minutes later, she encountered a younger woman, though she had nothing to say. However, she did chant a curse toward Debbie. \"Gør denne ene bære mælk af et dusin køer.\" (Danish-English Translation: Make this one carry the milk of a dozen cows.) But Debbie was unaware of this curse cast. She reached her house with no trouble. Unbeknownst to her, her breasts swelled a little. She did not notice at first, but she did feel something strange about her. Debbie walked over to her cell phone and called her best friend, Emily.<br>\r\n<br>\r\nEmily Picked up on the other end, and she said, \"Yo, Deb, what's up?\" Debbie replied, \"Oh, nothing, except... I met this woman on the street, and she said something about a demon in disguise and my dignity being lost. But nothing's happened!\" Emily replied, \"Oh, don't sweat it, girl. It's not like someone will catch you undressing or anything.\" The two of them just laughed. They chatted until Emily said goodbye and hung up. Debbie didn't notice it, but through the entire conversation, her 34A's grew into D's. She walked up the stairs, and she went into her room. She had a Cheese Stick in her hand, just for a little munching before she went to bed. But all the while, her D's grew into E's without her notice.<br>\r\n<br>\r\nDebbie walked over to her mirror, and noticed that she looked more beautiful than before. She said to herself, \"Boy, milk sure does wonders.\" She twirled, making her breasts bounce a bit. She did notice some growth, but part of it she thought was there before. She got changed for bed. She got into a muscle shirt and a pair of boxers that belonged to her boyfriend. She practically jumped into the bed, and she bounced on it once or twice. She got under the sheets, turned out the light, and grabbed a pillow to give a little extra comfort. She went to sleep in an instant...</span></div></div>",
            "created":1277269200,
            "id":905191,
            "title":"Curse of the Milk-Keeper"
        },
        "11421":{
            "choices":[
                "Find that woman!",
                "Grows too fast."
            ],
            "content":"<div class=\"\"><div> <span>Debbie tossed and turned in her sleep. She was snoring like a lawnmower. Of course, unknown to her, her E breasts started swelling up. They gave more bounce, and became more sensitive. They still retained their firmness and spherical shape. Debbie felt a constant ease, almost as if she had been injected with a painkiller. Her breasts were G's by 10:30. Her basketball-sized bosom was growing bigger and bigger without her knowing. By 12:55, they were M's and were still growing. They were the size of beachballs and still swelling. By night's end, her breasts were 1 1/2 times the size of beachballs.<br>\r\n<br>\r\nThe alarm clock rang at 7:35, and Debbie woke up smothered in what seemed like pillows of flesh and fabric. The fabric was red, like her muscle shirt, and they seemed stretched out. She pushed them off of her face, only to feel that touch in her breasts. Just then she realized the pillows were her breasts. Each was about 2 3/4 feet around. She walked over to her mirror, and saw that she had her dignity (in this case, her breasts) stripped of their natural beauty. She burst into tears, and covered her eyes. She walked downstairs, crying. Unfortunately for her, she had to find that woman. The unfortunate part is that she'd have to go outside, in public, in broad daylight...<br>\r\n<br>\r\nShe was mortified, she didn't want to be seen like this. She said to herself, \"I can't go out there with my boobs this big! What'll my BF say? What will happen to me? Will I be groped, or worse, raped? But I have to find that woman, I have to find a way to reverse this, whatever has happened...\" Just then, the younger woman came to her window, and she cast a spell that really got Debbie heaving. She said, in Danish again, \"Med den hastighed, hvormed en flod, gør denne kvinde fart i hendes proces.\" (Translation: With the speed of a river, make this woman speed in her process.) Debbie then felt her breasts grow again. She grew beyond any cup size and was still growing. Each breast had to be 4' in diameter. She almost dropped, her muscle shirt ripped to her nipples, exposing much more cleavage. She had to change fast.</span></div></div>",
            "created":1277269200,
            "id":905222,
            "title":"Magic Beans and Moonlight not included"
        },
        "12":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Chemical",
                "Pill",
                "Remote Control",
                "Radiation",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Science, although it only has to make sense on paper.<br>\r\n<br>\r\nHow does it happen?</span></div></span></div>",
            "created":1197867600,
            "id":476597,
            "title":"Science"
        },
        "123":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "She decides to set it to a modest E cup",
                "She goes all the way to HHH cup",
                "The doctor allows her to go a little further"
            ],
            "content":"<div class=\"\"><div> <span>“Hello? Debbra, can you hear me?” Debbie blinked with groggy eyes at the man in the white lab coat. “Uh, I’m *ungh*, I’m awake.” She was resting on a hospital bed, the sheet covering her waist and legs, bandages over her chest and IV’s in her arms. “Well, I just wanted to tell you the operation was a success. The microscopic drones have been programmed and implanted into your breasts.” Debbie still was not quite awake, the anesthetics were just wearing off. “We have everything ready to go, but you will need to wait here for a few more hours before you are allowed to leave, and you can retrieve your remote after two weeks, pending no complications.” Debbie blinked again, trying to focus on the doctor. “Great, thanks…” She rolled her head to one side, fighting the urge to fall asleep again. “Well, I’ll let you rest up.” Debbie closed her eyes once again…<br>\r\n<br>\r\nFirst week passes. “So you got this operation, and they didn’t make you any bigger?” Katie asks her friend Debbie. “No, the operation just implanted the tiny robots in my boobs, and I can’t get the remote that controls them for another week,” Debbie explains. Katie and Debbie have been friends their whole lives, every since they were kids living across the street from each other. Katie had long brunette hair, stood about 5’10” tall and an average build. She had a thin frame, that accented her C cup breasts. She knew Debbie always wanted larger breasts, but she felt no difference toward the subject. She simply didn’t understand what the procedure was nearly as well as Debbie did, and was expecting to see her friend with a larger rack. “So when you get this remote, you’ll be able to grow your breasts?” “That’s what they told me.” “Yeah, by how much?” “You know, they didn’t say…”<br>\r\n<br>\r\nAnother week passes. Debbie walks into the hospital. “Hi, I’m here to see Dr. Georing.” “Ah, Debbra, right on time. Please, come this way,” he leads her to his office. The doctor closes the door and Debbie takes a seat. “I hope you have recovered completely?” “Oh yes, everything’s healed very quickly.” “Great, let’s just have a look at your chest, hmm?” Debbie blushes and begins to remove her blouse. Dr. Georing moves a seat closer to her and looks her over. He takes special attention to areas where they operated, making sure she healed completely. He pushed the chair out of the way and opens a drawer in his desk. From inside it, he pulls out a small remote, about the size of a cell phone. “You appear to have healed enough for me to give you this.” He shows her the remote. “This remote will allow you to increase and decrease the size of your breasts via the drones we implanted in your chest. Shall we test it?” Debbie nods. The doctor brings it closer to her and shows her some specifics, “It is a very simple remote, it has a key pad for locking and unlocking and these allow you to increase or decrease overall volume. They tend to work with one another, but for the most part you have control.” Dr. Georing presses the + button. Debbie’s breasts filled slightly, like water balloons. He pressed the – button, and they deflated back to their original size. He took the remote back behind his desk and connected it to his computer. “Now all that’s left is to set the limiter.” Debbie was waiting for this, but she still didn’t expect she would have a say necessarily. “A limiter? For what?” “Well, we can’t have you with breasts that won’t allow you to function now can we?” He chuckled and so did Debbie, half-heartedly. “So I need to program the upper limit of your growth. Most who go through with the procedure stay within a reasonable range, some more adventurous housewives and women in the adult industry have larger limits.” “How large?” “Eh’ well, in this clinic, I suppose the largest we’ve set was about an F cup, but I’ve heard of some clinics going up to HH and even HHH cup.” “Could I be set to that big, even bigger if possible?” “Well, I suppose it might be within the realm of possibility, not necessarily reason,” he chuckled at this. Debbie looked at him. He straightened up in his chair. “Well, we do need to test you with the limit before you can leave, so I can increase your size, then when you feel you have the upper limit you want, I can set the value and that will be your limit, ok?” Debbie could agree to this, “Alright, that sounds fine.” “Ok, I’ll just sync the remote to my computer, and…we’re ready to go.” He begins to increase her size…<br>\r\n</span></div></div>",
            "created":1267938000,
            "id":847106,
            "title":"Remote Control"
        },
        "1231":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "She tries them out now",
                "She tries them out later"
            ],
            "content":"<div class=\"\"><div> <span>As her breasts begin to inflate, Debbie thinks her situation over. She always wanted larger breasts, but the doctor was the specialist. Perhaps, if she started smaller, he would be more willing to work with her on being bigger, after she’d had some time to test out her new breasts. Who knows? She might even be happy with just an E cup. Debbie carefully decided to go slowly for now.<br>\r\n<br>\r\nAs her breasts plumped to small melons, the doctor stopped the growth and asked her, “Well, how about this size?” Debbie smirked, and shrugged her shoulders, “I guess this will work, for now.” “Great, I’m glad you’re going to take this slowly,..” Before Dr. Georing could finish his sentence, Debbie asked, “Could you give me just another inch?” The doctor smiled and typed a few extra keys. Debbie watched as her breasts grew, plumping slightly before her eyes, then resting. ‘Yeah,’ Debbie thought, ‘this’ll be a good starter size…’<br>\r\n<br>\r\nDebbie made her to the front door with groceries in her arms. It had been a few weeks since her last meeting with Dr. Georing, and Debbie was really enjoying her increased breast size. Her adventure to the post office, the library, and most recently, the grocery store, gathering looks from men and women. She loved her new breasts, but she still wished she could be bigger. Along with her adventures, Debbie had been doing some research into what other women who had the operation. She had a small catalogue of sizes, locations, and different doctors. Dr. Georing was right, the largest number for women was between DD and F cup, a tiny amount going smaller, and a mishmash of women going slightly more extreme. One woman was able to go up to a K cup, and the largest she’d seen was a triple M cup. Searching forums and websites for any way to reach these women, Debbie finally found an email address for the woman with the MMM cups.<br>\r\n<br>\r\nDebbie sent her an email admitting she was an admirer, and had the same surgery, but the doctor didn’t allow her to go larger. She really wanted any information that she could use to increase her size. A few days pass, and Debbie receives a response.<br>\r\n<br>\r\nDear Debbie,<br>\r\n\tIf you’re looking to go larger, you’re going to have a hard time going through the proper channels. Finding the papers wasn’t tough, it’s all the extra fees you have to pay. There’s a simpler, and cheaper way, but I can’t give it to you. I’m attaching a link to the guy who helped me out. He’s one of the programmers who designed the original code. For a price, he’ll help you unlock your remote. I’ve got to tell you, I had mine increased, and I do have my limit, but where I am now isn’t close to what it can be. Be careful, honey.<br>\r\n<br>\r\nPS. Be sure to send pics. I want to know what I’m competing with ;)<br>\r\n<br>\r\nDebbie quickly addressed a new email to the man she was informed of. Trying not to sound too needy, she expressed her desires, wondered how much his services would cost, and how long it would take. The same day she receives a reply. All it said was:<br>\r\n<br>\r\n$2,000 and thirty minutes.<br>\r\n<br>\r\nAlso attached was a bank account the money could be transferred to. Debbie couldn’t type fast enough. She forwarded the money, but she knew the transfer wouldn’t happen till the next morning. She sent an email detailing that she sent the money. The next response was:<br>\r\n<br>\r\nWhen it transfers, I will email you. Pending the transfer verification, let me know when you want to proceed. We’ll take it from there.<br>\r\n<br>\r\nDebbie couldn’t wait. She’d found a way around the system. Now she just needed to make sure this guy was who she was told he was. Laying in bed Debbie couldn’t sleep. She was anxious of what she would do tomorrow, and in the back of her mind, she was also a little worried. ‘What if this guy just takes off with my money? What if he isn’t who he says he is, and somehow messes up my system?’ Well, Debbie didn’t try to worry about that, she focused on tomorrow.<br>\r\n<br>\r\nHer alarm rang at eight in the morning. She slapped the snooze and rolled out of bed. She felt like it was Christmas and St. Patrick’s day all rolled into one! Rolling her chair over to the desk, she clicked open her browser. Three new messages popped up in her inbox, including one from her secret angel. The email confirmed that the money transferred, and he left a link to a closed chat room she could use. Debbie logged in using the provided id and password. There was only one other person in the room: RaiderCatz. Debbie’s id was Maior.<br>\r\n<br>\r\nMaior: Hello?<br>\r\nRaiderCatz: Hey, I’ve just finished uploading the code from my hard drive. Just let me know when you’re ready.<br>\r\nMaior: Well, I’m ready whenever. Just tell me what to do.<br>\r\nRaiderCatz: Well, first thing, you should have a cable that plugs from your remote to the computer.<br>\r\nMaior: I was never given one of those.<br>\r\nRaiderCatz: I know, it’s a safeguard so people can’t do what we’re doing right now. That’s why I overnighted one to you. MMMadie forwarded me your address, saying I should help you out. It should be in your mailbox.<br>\r\n<br>\r\nDebbie ran out the front door in her pajamas. She opened the mailbox and found a small brown parcel. She brought it inside and unwrapped it next to her keyboard. As she figured out how to connect it to the PC, another response popped up on her computer.<br>\r\n<br>\r\nRaiderCatz: Just so you know, I’ve taken the liberty of connecting your computer with mine. All you need to do is make sure that first you return your breasts to their original size.<br>\r\n<br>\r\nDebbie took the remote and unlocked it with her code. She then pressed the – button, reducing her breast size. Her breasts reduced, receding into her body, returning to a familiar A cup.<br>\r\n<br>\r\nMaior: Alright, they’re back to the original size. Now what?<br>\r\nRaiderCatz: Now you connect the remote to your computer.<br>\r\n<br>\r\nDebbie connected the cable to the computer, and from the cable to the remote. The lights began to flash, similarly to when she was first getting setup with the remote. <br>\r\nRaiderCatz: Now I need you to make sure you do not touch the remote or anything that pops up on your computer. Are you logged out of everything other than this window?<br>\r\nMaior: Yes<br>\r\nRaiderCatz: Good. Now just let me do my part.<br>\r\n<br>\r\nWindows started popping up and closing so fast, Debbie couldn’t read what was on them. They flew past, loading who knows what or rewriting whatever was scripted, or whatever. Debbie didn’t know, but she did feel her fears begin to creep back into her mind. Her brain fought with itself. She wanted larger breasts, but what if this guy does something that could injure her? A few minutes passed and Debbie decided to go get a drink of water. Taking a short break, she returns to the computer, the windows have slowed, and now a progress bar was loading. It was moving slowly, from 62%. RaiderCatz had also posted something.<br>\r\n<br>\r\nRaiderCatz: Almost done, this is the last thing.<br>\r\n<br>\r\nDebbie moved her eyes closer to the screen, watching intently as the little green bar filled, moving slowly to its goal. Cheering it on, Debbie waited, and waited. Finally, 100%, the bar vanished, and so did the other windows. She was back to the chat screen.<br>\r\n<br>\r\nRaiderCatz: Done.<br>\r\nMaior: Really? That’s it?<br>\r\nRaiderCatz: I’ve setup your remote with two access codes. The original one setup by your doctor is the same, and it will only go up to your current F cup. This new code will allow you to expand however far you want to go. 57241<br>\r\nMaior: Alright, I’ll remember that.<br>\r\nRaiderCatz: If you need any help in the future, you can reach me at that email address. Don’t use this chat room again; I won’t use it.<br>\r\nMaior: Oh, alright, thanks again!<br>\r\nRaiderCatz logged off</span></div></div>",
            "created":1307509200,
            "id":1121959,
            "title":"There Are Ways Around Such Matters"
        },
        "12311":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Her breasts were shrinking.",
                "Her breasts were growing."
            ],
            "content":"<div class=\"\"><div> <span>Debbie disconnected the remote from her computer. It was finished. She’d found a way to get the growth she’d always dreamed of, but she wouldn’t know if it worked until she tried it. Debbie punched in the new code and the green light on the remote flashed in recognition. She pressed the + button and saw her chest plump under her white tee shirt. She pressed the button a few more times, and her chest swelled little by little. After the fifth or sixth press, Debbie holds down the + on the remote. Her breasts push the fabric further, forming the melons she’d enjoyed for the past week. Then her breasts continued to swell; bigger than melons, as big as bowling balls. “Now this is more like it,” Debbie said. Her breasts continued outward, swelling to volleyballs. She cupped her left breast under her shirt, feeling the fabric move and stretch for her growing bosom. She got up from the computer desk and made her way to the bedroom. Never taking her finger off the button, Debbie tries to remove her shirt. She struggles while just using one arm, but manages to lift it over her head. Just letting the shirt hang on her arm, she marvels at the basketballs hanging just above her bellybutton. She shakes the shirt off her arm and lets it fly across the room, landing on the television, then sliding off to the ground.<br>\r\n<br>\r\nShe begins rubbing her bare breast, rolling her head back as she feels the size, feels the shape of her breasts, and feels them still swelling. She finally takes her hand off the button and throws the remote on the bed. Her wide eyed expression in amazement at the two glorious orbs hanging above her stomach. She felt every inch she could, and then her mind began to fill with ideas. Clothes she would need, places she should go, people she needed to talk to, all began forming around her enormous chest. Around her chest that could be even bigger. That could be much bigger. It was all too much for her to take in so suddenly; she had to lie down. She flopped backward on the bed, her breasts adding inertia to her travel downward.<br>\r\n<br>\r\nThe bed bounced and threw her softly above the sheets, then back down, but something was digging into her back. She felt it under her shoulder, but immediately, she felt something else happening…</span></div></div>",
            "created":1307509200,
            "id":1121961,
            "title":"No Stopping Her Now"
        },
        "1232":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Went to visit Katie",
                "Goes home",
                "Tests social indecency "
            ],
            "content":"<div class=\"\"><div> <span>The doctor presses the + button on the remote. Debbie watches as her breasts begin to swell. Slowly, they fatten and fill her chest. Doctor Georing is watching intently, observing both Debbie and the computer screen. She continues to swell, stopping a little larger than melons. “This is the usual cutoff for most patients.” “I want to go bigger, please.” The doctor nods and continues the expansion. They begin to swell again, getting bigger, reaching bowling ball size. Once again, the doctor looks at her and Debbie just responds, “Bigger.” He continues with the growth. She smiles bigger as she grows, reaching basketball sizes, moving onto a small beach ball. The doctor stops again, “I’m sorry, Debbra, but this is the maximum I can allow you. Tell you the truth, this is as big as I’ve ever seen, without special licensing.” “Oh, well, how do I get that licensing?” “Listen, Debbie, you seem like a nice girl, and I’ll even let you keep this as your limit, but don’t go fretting about that, you don’t want to end up like that your whole life, do you?” In the back of her mind, Debbie was considering it. “Now, I just need you to read over these instructions, this is your pass-code, I’ll put you back where you were when you came in here, and I would like to suggest you don’t keep this size right away. Your body might be able to handle it now, but you need to condition yourself first. Heck, if you like it and eventually get used to it, you might be able to apply for licensing a larger size.” Dr. Georing was chuckling again. Debbie slowly deflated back to her former A cup size, and she buttoned up her blouse before leaving the office. “Thank you again, Doctor.” “Oh, please, you were a wonderful patient, and if anything out of the ordinary happens, please, let us know, ok?” “Alright,” Debbie concluded as she left the office. She placed her purse over her left shoulder, holding the remote in her right hand. She grinned as she…</span></div></div>",
            "created":1267938000,
            "id":847108,
            "title":"Up To HHH Cup"
        },
        "12321":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Keep doing what we always did on weekends.",
                "Go somewhere and show off my awesome new chest."
            ],
            "content":"<div class=\"\"><div> <span>Debbie decided to visit her friend Katie. She drove her car over to her friend’s apartment complex. Going up to the front door, she pushed the button to ring Katie. “Who is it?” Katie asks over the intercom. “It’s me, Debbie. I want to show you something.” “Alright, come on up,” Katie finished as the door buzzed open. She walked up the four flights to Katie’s apartment. <br>\r\n<br>\r\nKatie had been a friend with Debbie since they first met in college. They had been roommates for the first few years, and even though they moved to different parts of the city, they would still get together on the weekends. They would talk, go shopping, or do whatever they wanted around the city, but lately Debbie was more to herself. Katie really wanted to know what her friend was up to. She heard a knocking on the front door. Leaving the kitchen, she moved to let her friend Debbie in. <br>\r\n<br>\r\n“Katie!” “Debbie?! What have you been up to? I haven’t seen you in almost a month.” “I’ve been kinda busy.” She threw her purse on the couch, hiding the remote in her hand behind her back. “Busy? Too busy to see your best friend?” “Do you wanna see what I’ve been doing?” “Well, sure, what is it?” Debbie pulled the remote from behind her back and showed it to her friend. Katie raised her eyebrow, not knowing what her friend was up to. Debbie held her finger on the + button and she watched her friends reaction. Katie watched as Debbie’s black blouse begins to squirm, with two small balloons inflating where her breasts should be. Katie’s eyes began to widen as Debbie just smiled as the buttons began to strain slightly by her DD cup breasts. She let go of the button as she was just shy of F cups, and some of her cleavage and bra became exposed through gaps in her shirt.<br>\r\n<br>\r\n“This is what you were working on? This is crazy. This is awesome. What are you going to do with them?” Debbie put the remote in her purse, leaving her chest larger but not to its limit. “I don’t really know. I just wanted to do this for myself. I guess we could…”<br>\r\n<br>\r\n1. Keep doing what we always did on weekends.<br>\r\n2. Go somewhere and show off my awesome new chest.<br>\r\n</span></div></div>",
            "created":1280293200,
            "id":925909,
            "title":"A visit to Katie"
        },
        "1233":{
            "choices":[
                "A K-cup",
                "An N-cup",
                "Bigger!"
            ],
            "content":"<div class=\"\"><div> <span>The doctor presses the + button on the remote. Debbie watches as her breasts begin to swell. Slowly, they fatten and fill her chest. Doctor Georing is watching intently, observing both Debbie and the computer screen. She continues to swell, stopping a little larger than melons. “This is the usual cutoff for most patients.” “I want to go bigger, please.” The doctor nods and continues the expansion. They begin to swell again, getting bigger, reaching bowling ball size. Once again, the doctor looks at her and Debbie just responds, “Bigger.” He continues with the growth. She smiles bigger as she grows, reaching basketball sizes, moving onto a small beach ball.<br>\r\n<br>\r\nThe doctor stops again, “I’m sorry, Debbra, but this is the maximum I can allow you. Tell you the truth, this is as big as I’ve ever seen, without special licensing.” Debbie gave him a venomous look, and replied, \"I don't care about licenses, just make 'em bigger!\" Dr. Georing was frightened by her retort, and gratified her wish. \"All right,\" he answered shakily, \"I'll do it, but don't harm me.\" she wasn't going to, but his surrendering compliance was still what she was hoping for. he pressed on the remote's + button, and her growth, and her smiling, resumed. she swelled, and when she said, \"OK! They're big enough!\" Debbie whooped at her new bust, as he resignedly set the limiter at...</span></div></div>",
            "created":1275714000,
            "id":895112,
            "title":"The doctor allows her to go...how much further?"
        },
        "12333":{
            "author_id":"ryguy0228",
            "author_name":"Ryguy0228",
            "choices":[
                "S cup",
                "Bigger boobs."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bigger tits?</span></div></span></div>",
            "created":1573448400,
            "id":2745278,
            "title":"Bigger!"
        },
        "13":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Random occurence",
                "Item defect",
                "Playing in the shower",
                "Playing with the hose",
                "Something Else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Accidents include stumbling upon it by chance, rather than by type.<br>\r\n<br>\r\nHow does it happen?</span></div></span></div>",
            "created":1197867600,
            "id":476599,
            "title":"Accidental"
        },
        "133":{
            "choices":[
                "She plays with her new assets",
                "Do it again!",
                "Move the hose elsewhere...?"
            ],
            "content":"<div class=\"\"><div> <span>Debbie awoke from a long sleep, which was usual for her, and felt strange, so she decided to take a long hot shower. She happened to have a very delux shower which  consisted of a normal shower head, and two hoses. One sprayed quickly, the other slow, and was used to rise areas that were more sensitive. <br>\r\n<br>\r\nShe turned on the water and stripped out of her sports bra and thin underwear, stepping into the water. As the main head rinsed through her hair, she decided to take the gentle hose and run it across her nipples. As the water lapped across her sensitive breasts, she noticed it began to feel pleasurable, so she spent a minute or two just holding the water on her nipples. Soon her chest began to feel heavy, and she looked down in shock to see he breasts were expanding! She moved the water away, stopping them at a supple and round E cup...<br>\r\n</span></div></div>",
            "created":1247720400,
            "id":726055,
            "title":"Playing in the shower"
        },
        "1331":{
            "choices":[
                "Run the hose over her breasts again!",
                "'Play' some more."
            ],
            "content":"<div class=\"\"><div> <span>Surprised, but not displeased, she pokes at her larger chest, only to have her finger slip on the wet surface.<br>\r\n<br>\r\nShe cups her breasts experimentally, one in each hand, raising them slightly before letting them drop.<br>\r\nJiggle.<br>\r\nShe giggles, and tries it again.<br>\r\nJiggle. She's overcome with a fit of laughter.<br>\r\n<br>\r\nShe sobers quickly, and decides to try something. Placing her thumbs at the outer sides of her breasts, she slowly traces a line until the line reaches her nipples.<br>\r\nHer rosy nipples rise and harden as she twirls her fingers around them. Her eyes close slightly as one hand slides down her stomach...</span></div></div>",
            "created":1265950800,
            "id":835180,
            "title":"She plays with her new assets."
        },
        "1332":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Everything was ok.",
                "The hose somehow attached itself to her.",
                "Her J cup breasts deflated back to A cup."
            ],
            "content":"<div class=\"\"><div> <span>Debbie felt the roundness of her breasts, feeling the weight in them. She looked down at the hoses and moved them toward her nipples again. This time she pressed against her chest, squishing her boobs flatter. She could feel her flesh spread up her rib cage and down toward her stomach. She released the hoses and let her J cup breasts jiggle as they dropped from their suppression. Debbie caressed her right nipple, letting the weight pull on her, a feeling she had never felt before today. She enjoyed the feeling, and she never wanted it to stop.<br>\r\n<br>\r\nUnfortunately, all good things come to an end. She figured she had better go on with her day, but her mind began to worry: did she have clothes that would fit her, what would people at her work think, and what if I can’t reduce their size? Debbie began to get light headed, the world began to swim, her vision became blank and she felt a thud as she collapsed to the floor.<br>\r\n<br>\r\nShe woke up several hours later, still in the tub. The first thing she noticed…<br>\r\n</span></div></div>",
            "created":1265086800,
            "id":829575,
            "title":"Do it again!"
        },
        "134":{
            "author_id":"mc123",
            "author_name":"Mc123",
            "choices":[
                "...even up her breasts",
                "...deflate the inflated breast",
                "...inspect the inflated breast"
            ],
            "content":"<div class=\"\"><div> <span>Debbie was turning the valve that was putting the valve into action. However, she accidently turn it to the limit, causing the hose to run wild. The end of it ended up into one of her nipple and fill up her breast. She tugged the hose away from her, leaving her with a breast bigger than the other.<br>\r\n<br>\r\nSeeing the result, Debbie...</span></div></div>",
            "created":1533790800,
            "id":2530913,
            "title":"Playing with the hose"
        },
        "1343":{
            "author_id":"mc123",
            "author_name":"Mc123",
            "choices":[
                "An helium tank",
                "An air compressor",
                "A water pipe"
            ],
            "content":"<div class=\"\"><div> <span>Debbie felt the inflated breast. It was a rather odd thing to see. She has a boob that's definitely bigger than the other. It look like a softball has been put in the same bag as a basketball. It also give her a weird balance when she move around.<br>\r\n<br>\r\nSpeaking of this, where was the hose that inflated her breast connected to? </span></div></div>",
            "created":1579150800,
            "id":2774514,
            "title":"...inspect the inflated breast"
        },
        "135":{
            "choices":[
                "BIGG SISTER!",
                "Big little sister",
                "Big companion"
            ],
            "content":"<div class=\"\"><div> <span>Amanda is a young woman, 15 years of age, and she is in demand for something every other woman has: big breasts. One time, she was walking through the desert searching for a legendary oasis that few people have spoken of. She took off searching, until a long time had passed and she found it at last! She ran to it and took a long swig of the water. It was as clear as glass and as sweet as sugar. But what caught her eye the most was the wonderful fruits that grew on the palm trees around her. They grew on the trunks and were flashing colors of gold and red. She took one, and bit into it, it tasted like a mixture of banana, pineapple, and mango. It was heaven. She stayed at the oasis, taking on the bountiful fruit surrounding her. Until the next minute, a woman came up to her. Amanda turned her face, and was smacked straight into a massive pair of breasts. She seemed to be of English descent, but she was also massively endowed. Each breast must've been about six feet around. Her brown hair and blue eyes made her beautiful. Much like an Englishwoman, she spoke in a slight accent. She said to Amanda, \"I see that you have discovered the fruit of the Blossomia Tree. It has powerful properties. It can make you live forever, and has a secondary gift. The gift of endowment. Slowly, your breasts will grow and grow. The more fruit you eat in a sitting, the bigger your breasts become. You become tied to the trees, and the water as your body constantly needs to be hydrated by the spring. It takes alot of water to support massive breasts, dearie. My name is Katherine, and yours?\" Amanda replied, \"My name's Amanda, most of my friends call my Mandi.\" Katherine looked at her, smiling, and said to her, \"So, my dear, do you wish to live eternally with endowment, or go back to the real world and die unhappily as the world around you gets bigger? I have been here for 350 years, taken here by the Spanish. I was the only survivor of the expedition that sought this Oasis. Ah, I see you have the beginnings of your eternal growth.\" She was right, Amanda's breasts were probably now 6 inches around. She continued to eat the fruit in her hand, and she grabbed another, finishing it off in a flash, and then took another, and another, and even another until she was full. Her breasts now must've been 3 feet across, and were still swelling. Katherines were huge, too. But Amanda suspected that after 350 years, she would've been much bigger. She asked her, \"Katherine, if you've been here for 350 years, shouldn't your breasts be much more humongous by now?\" \"Well, you see, my dear, I only took one a day. You took alot in one sitting, that's why you're growing faster than me.\" \"Speaking of which, I think I'll have 4 more!\" She did, and her breasts swelled with each bite. Afterwards, her breasts were humongous, 6 feet across, just as big as Katherine's when she first met her. Katherine wallopped her large endowments onto Amanda's, and she was wondering why she did that. Katherine said to her, \"It gets cold at night, Amanda dearie, breasts need to overlap for warmth.\" Amanda couldn't sleep, she was still thinking of her boobs growing bigger and bigger. Just then, she took two more fruits, and she ate them down to their seed-filled cores. She started swelling more, and now her breasts were about 9 feet across. Surprisingly, she was still able to carry the weight. She discovered that for every fruit she eats, another inch is gained to her height. So she was now about 6'2\" tall. And then, it hit her as hard as a freight train. THERESA! I FORGOT ABOUT MY LITTLE SISTER! It turned out, Theresa was as a matter of fact on the shore of the oasis, boobs the size of watermelons. So she was safe. Amanda saw her, and got a sigh of relief from it. She then took another four fruits, and she ate all of them. She then went to sleep, boobs swelling to enormous proportions.</span></div></div>",
            "created":1267506000,
            "id":844995,
            "title":"Something Else"
        },
        "15":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "Sheer will",
                "Natural bodily response to outside stimulation",
                "Food or Drink",
                "Plants",
                "Gameshow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More ideas.</span></div></span></div>",
            "created":1268024400,
            "id":848243,
            "title":"Other"
        },
        "153":{
            "choices":[
                "Milk",
                "A strange fruit",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What would Debbie eat or drink to get bigger?</span></div></span></div>",
            "created":1273899600,
            "id":883451,
            "title":"Food or Drink"
        },
        "154":{
            "choices":[
                "A kind of poison ivy",
                "A weird flower",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of plant would do the growing?</span></div></span></div>",
            "created":1273899600,
            "id":883453,
            "title":"Plants"
        },
        "155":{
            "author_id":"pyro9975",
            "author_name":"Pyro9975",
            "choices":[
                "New York, Ohio, California, Washington, and Haiwaii?",
                "New York, Ohio, Washington, California, and Haiwaii?",
                "Washington, Haiwaii, Ohio, New York, and California?"
            ],
            "content":"<div class=\"\"><div> <span>Bright lights filled a large stadium filled with thousands of cheering spectators. A man in a slick black suit and styled hair raises a microphone to his mouth and says to the audience, “Hello and welcome again to another exciting episode of?” The audience joins him in saying, “Curves for Cash!” “That’s right, the only show that lets you win a bigger bust for more bucks. I’m your host, Brad Winters. In case some of you are joining us for the first time,” there was mild laughter in the audience, “here’s how the game show works. Our contestant will join me out here on the quiz turf. She’ll have sixty seconds to complete the questions put before her on the board.” He pointed up to the large hanging screen above him. “The more she answers correctly, the bigger we’ll make her boobs. At the end of the show, she’ll be granted the double or nothing option, which if she answers correctly, will double her size and her winnings. If she is wrong, she wins nothing, and goes home as flat as she was when she arrived. But enough of the rules, let’s meet our contestant!”<br>\r\n<br>\r\nThe audience cheers as Debbie walks out from the doorway Brad entered from. She’s wearing blue windbreaker pants and what looks like a matching blue sports bra with white trim. She waves to the audience as she makes her way to Brad. “Ladies and gentlemen, our contestant for the evening, Debbie Dunn!” Debbie stands beside Brad, “Debbie joins us from Chicago, Illinois, where she spends most of her week as a bio-programmer, and her weekends traveling with friends or going camping. Debbie, we’re happy to have you here.” Debbie moves closer to the microphone, “really happy to be here, Brad. I watch C for C every week.”<br>\r\n<br>\r\n“Well, we’re glad you enjoy it. I would also like to point out that Debbie’s ever expander top was provided by Drexol clothing. Drexol, leading provider in 100% tear proof clothing since 2104. And as always, our cosmetic augmentation ray is provided and operated by Chief Body Artist and surgeon, Dr. Artimus Gains.” On the other end of the stadium, a large machine rose out of the ground, with a man in a white coat behind it, waving to the crowd. “Remember, Debbie, every question you answer correctly, and Dr. Gains will increase your bust. Every inch you earn you can trade at the end of the show for $50 an inch. Get each question correctly and the double or nothing question, and you could win up to 12,000 inches or $600,000!” The crowd cheered again. “Debbie, are you ready to play?” “Yes, let’s get big.” “Alright, here’s the first set of questions.” The big screen switched to question mode, and a smaller screen appeared before Debbie.<br>\r\n<br>\r\n“Put these states in the order they joined the republic of the United States, from oldest to newest. <br>\r\n1. Ohio<br>\r\n2. Haiwaii<br>\r\n3. California<br>\r\n4. New York<br>\r\n5. Washington”<br>\r\n<br>\r\nDebbie pondered the question. She was lucky, geography and history were her worst subjects. If they were the low dollar questions, she’ll have an easier time with the high dollar ones. Thinking it over, she tried to make easier sense of it. The states joined from east to west, and these were evenly spread out. The tough one was which came first, Washington or California? Brad pipped up, “Thirty seconds.” Without thinking, she blurted out…\t<br>\r\n</span></div></div>",
            "created":1360213200,
            "id":1526479,
            "title":"Curves for Cash!"
        }
    },
    "info":{
        "author_id":"pyro9975",
        "author_name":"Pyro9975",
        "brief_description":"This is an interactive Breast Expansion story displaying as many possible ideas.",
        "created":1197929880,
        "description":"<td align=\"left\" class=\"norm\"><b>This story is to generate different ideas for breast expansion.</b><br>\r\n<br>\r\nIt seems that more and more expansion stories have the same premise. Well I hope this can create some more ideas than the stagnate one's around the web. <br>\r\n<br>\r\nTry and post whatever you think can contribute to generating a new idea that someone might want to use. Other forms are allowed, specifically butt and GTS.<br>\r\n<br>\r\nStory lengths should last <span class=\"cred\">one</span> to <span class=\"cred\">two</span> pages. After that, leave a space for people to display their own idea. If you want, make a page for even more ideas, but try to keep them relevant to breast expansion. Multiple forms of the same idea should follow in the same category.<br>\r\n<b>Edit: stories can be longer, I just don't want scores of pages without some kind of expansion. Just leave a spot for someone to add more options if they want. i.e. *3 Something Else</b><br>\r\n<br>\r\nAlso, please no hardcore stuff. Soft stuff is fine, and some expansion outside of breast expansion is allowed, as long as the prevailing idea stays in the chest area, and sticks to it's section of the story.<br>\r\n</td>",
        "id":1363146,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1579197720,
        "modified":1579197720,
        "pretty_title":"Breast Expansion Idea Emporium"
    }
}