{
    "chapters":{
        "1":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "Marvel ",
                "DC"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Marvel or DC</span></div></span></div>",
            "created":1217307600,
            "id":562552,
            "title":"Which do you want"
        },
        "11":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "Invisible woman",
                "Mary Jane /not a hero",
                "jean grey",
                "Storm",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which woman do you want</span></div></span></div>",
            "created":1217307600,
            "id":562554,
            "title":"Marvel"
        },
        "111":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Regular Marvel universe",
                "Ultimate Marvel",
                "Jessica Alba version"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which version of Sue Storm becomes a titanic giantess or shrinks someone?</span></div></span></div>",
            "created":1413176400,
            "id":1871286,
            "title":"Invisible woman"
        },
        "112":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "  Waits for MJ to come home ",
                "The Black Cat aka Felicia Hardy who is in love with Spiderman comes ",
                "Spiderman seeks help"
            ],
            "content":"<div class=\"\"><div> <span>(Authors note from the Hawks eye view---- For you comic fans out there this takes place before the One Day later reboot) <br>\r\n<br>\r\nMary Jane was walking down the street in New York and saw on the screen in Times Square that Spiderman was facing off against the Shocker and the Rhino. The sreen showed Spidey (Who she of course knows is Peter Parker) dodge one of Rhino's charges.<br>\r\n<br>\r\nSpidey pov<br>\r\nSpiderman was almost laughing as he dodge one of Rhino's charges \"TorroTorro!\" he cried mockingly as the Rhino ran uder him crashing into the car that Shocker was standing on sending him flyinginto a building.<br>\r\nGood thing you have been reupholstered or that would have hurt, oh wait it did anyway\" Spidey quips. <br>\r\n\"I teach you ya smug bug\" Shocker shouts blasting a full power shot tha Spiodey dodge by a mile causeing one of the Shocker's blast to send Rhino crashing into an electricle pole electrifying him.\"Shocking isn't it\". Leaving only the Shocker for Spiderman to deal with, whom Spidey threw against a broken fire hydrant causing his suit to malfunction. He then swung home.<br>\r\n<br>\r\nMJ pov----------<br>\r\nMJ watched the battle on the screen and the man she loved swing away probably headed to their home, but with a hero you never know she reflected as she finished her shopping and headed home about an hour later. <br>\r\n<br>\r\nSpidey pov--------<br>\r\n<br>\r\nSpidey was outside the balcony of his and MJ's new apartment and had just opened the glass door to go in when he was engulfed in a bright light and blacked out....... <br>\r\n<br>\r\nWhen he came to he was shocked to see that every thing was gigantic what does he do? <br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1217307600,
            "id":562581,
            "title":"Mary Jane /not a hero"
        },
        "1121":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "3 inches",
                "1 inch",
                "right about a centimeter(cm) tall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Spiderman decides to wait for MJ to help him so he goes inside the apartment. then he notices that he is only_______ tall.<br>\r\n<br>\r\nhow tall is he?</span></div></span></div>",
            "created":1217307600,
            "id":562597,
            "title":"  Waits for MJ to come home"
        },
        "11213":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "he climbs up the chair",
                "he climbs up he hot sexy nearly bare skin to her face"
            ],
            "content":"<div class=\"\"><div> <span>Spiderman looks at this now immense and alien world that used to be his apartment. He was wondering what had happened to him when suddenly he heard a rumble and felt somethig like earthquakes when Mary Jane the woman he love entered the room. <br>\r\n<br>\r\nMJpov------ MJ walked in the apartment expecting Peter to already be there but she didn't see him \"he must be in the city somewhere, he'll be home soon i hope for our  night of romance he promised me.\" she thought hopefully  thinking of the sexy scimpy negligee she had bought for the evening. She noticed that the door to their terrace was open so she went to close it. <br>\r\n<br>\r\nSpidey pov----------<br>\r\n<br>\r\nSpiderman saw MJ enter carrying a Victoria's Secret bag then look around calling his name \"MJ I'm down here\" he shouted. Mj turned around and started heading his way he thought she had heard him and realized that she was going to close the door. He ran as fast as hecould and tried using his web shooters but they were empty. He saw a shadow grow over him and saw MJ's high heel come down right by him. She closed the door then took her bag and went into the bedroom.<br>\r\n<br>\r\nMJ pov-------<br>\r\n<br>\r\nAfter she closed the door she went into the bedroom and put the tight, lace, skippy, sexy little negligee on. She then went into the living room put on some mood music and sat ina comfotable chair to wait and surprise peter when he got home.<br>\r\n<br>\r\nPeter pov------<br>\r\n<br>\r\nSpiderman watched in awe as Mary jane walked in the room in the sexy lingere he knew she had bought for the evening she the sat in a chair with the lights turned down low. He knew he had to get her attention somehow, but it would be hard since he was  only 1 cm tall<br>\r\n<br>\r\nhow does he do it........<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1217307600,
            "id":562610,
            "title":"right about a centimeter(cm) tall"
        },
        "112131":{
            "author_id":"iambeowulf",
            "author_name":"iambeowulf",
            "choices":[
                "Crawls into the back of MJ's Panties and into her crack",
                "Ignores temptation and proceeds up her back"
            ],
            "content":"<div class=\"\"><div> <span>Peter proceeded to climb up the back of the chair until he reached his wife's enormous, see-through lingerie-encased butt. Suddenly, he felt VERY tempted to climb into the back of MJ's bottom undergarment and explore her buttcrack. However, another part of him told him he should focus on continuing up MJ's back to her head.<br>\r\n<br>\r\nWhat does he do in the end?</span></div></div>",
            "created":1217307600,
            "id":562657,
            "title":"up the chair"
        },
        "112132":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "1",
                "2"
            ],
            "content":"<div class=\"\"><div> <span>Peter knew he had to get MJ's attention somehow. He was so small he was going to have to climb the now mountainous Mary Jane. It took about an hour for him to reach her chair and in that time she had drunk 4 glasses of champene and had a 5th sitting on a table beside her. By the time Spiderman had reached her foot she was asleep! \"Dammit! this makes things so much harder.\" Peter thought he was hoping MJ might feel or see him. While he was thinking his spidersense went crazy and he dodge as MJ shifted her foot which probably would have crushed him. More caustious this time he approached her foot which was clean and smelt like she had taken a shower and put lotion on them. Spiderman used his Spider powers to adhere to MJ's foot and began to climb to the top of her foot . When he reached her ankle he was nearly thrown off when she moved her foot in her sleep. When she stopped he began climbing again. As he climbed he noticed that her legs were perfeclty smooth \"Great she buy's expensive lingere, champene and has her legs waxed in anticipation of our romantic evening and I'm missing it all because i'm 1cm tall and she's had so much champene she's asleep. when she wake up and I'm not here she will be sad or pissed one I hope she don't take it out on me.\" he thought as he climbed at about her knee he had to take a rest because of how small he is and the fact that he is burnig up from the heat of her titanic body. Suddenly he started laughing to himself \"I call my self Spiderman and now I'm the size of a spider gotta love irony\" <br>\r\n<br>\r\nHe continued his slow climb up her leg till he got to her thigh and stoped to notice two things, one. Her negligee begins above him and it will be hard  to climb, Two. Mary Jane is not wearing any panties <br>\r\n<br>\r\nSo now he has a decision to make<br>\r\n1 he could make the difficult climb on the lacy material or <br>\r\n2 he could crawl under it on her bare skin but will have no other choice but to start by climbing by or on her vagina (because the negligee is tight around the tops of herleg but not between them) and he'll have to come out between her huge breasts<br>\r\n<br>\r\nWhat does he do?<br>\r\n</span></div></div>",
            "created":1217394000,
            "id":566712,
            "title":"Mount Mary Jane"
        },
        "1121322":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><div> <span>Peter figured even though it might be dangerous it would be quicker to climb by her vagina. He crawled between he legs and crawled to her cavernous vagina. He started climbing on the outer lips of her vagina, he couldn't believe the heat coming from it. He looked at it closer and saw he was making her wet without her knowng it. His spidersense warned him as a giant hand came and rubbed the spot he was just at. <br>\r\n<br>\r\ndoes he fall in?</span></div></div>",
            "created":1218085200,
            "id":566715,
            "title":"down under"
        },
        "11213221":{
            "choices":[
                "Goes into Cervix",
                "Tries to get out"
            ],
            "content":"<div class=\"\"><div> <span>As Peter falls into the vagina, he dodges MJ`s finger. He then starts sweating in his suit and his feet sticking to the floor of the vagina. Spidey hears a loud moan and realized MJ was so horny, she started fingering herself only making Peter more regretful. Peter thinks \" MJ is waiting for me and after drinking so much champagne, she couldn't resist pleasuring herself\". So while being entranced in his thoughts, he didn't notice Mary Jane's finger coming at him. He notices at the last second and gets pushed by the finger further inside the vagina. He sees the Cervix and was starting to become curious.  </span></div></div>",
            "created":1270530000,
            "id":863135,
            "title":"Vagina"
        },
        "11213222":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "nothing he makes it out",
                "MJ finds him"
            ],
            "content":"<div class=\"\"><div> <span>Peter realized that MJ was still asleep so he had to climb more carefully. He made it over her waist and had some light from the thin lacy skimpy fabric. He gazed in awe ath the giant smoo, flat yet inclining plain(since she was sitting) of MJ's stomache. He stared off into the distance at the gigantic twin hills in the distance. He begins his climb again, broiling from the heat her body is putting off. he is just above her navel when she moves and he falls in. Peter looks around in awe at the the giant navel. He began climbing out when...............  </span></div></div>",
            "created":1218085200,
            "id":566717,
            "title":"no"
        },
        "112132222":{
            "author_id":"gohdjustin",
            "author_name":"jimmy",
            "choices":[
                "takes he clothes off",
                "steppes on spider man"
            ],
            "content":"<div class=\"\"><div> <span>Spiderman sees a big hand reach for him he doesnt hesitate but walks twards the hand. Marry Jane picks up spider man and brings him to her face.She was shocked to find her husband about a centimeter tall. After being horney for hours she puts him on the ground and then...</span></div></div>",
            "created":1268542800,
            "id":850981,
            "title":"MJ finds him"
        },
        "1121322221":{
            "author_id":"andrewmejia",
            "author_name":"Andrew",
            "choices":[
                "Shoves him up her ass",
                "Shoves him up her pussy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She then begins to take her cloths off. After she is naked she picks up peter and then...</span></div></span></div>",
            "created":1533121140,
            "id":2527602,
            "title":"takes he clothes off"
        },
        "113":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "70s version",
                "90s version",
                "movie version"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which version?<br>\r\n(link://http:www.fabianmonk.deviantart.com)70s Phoenix version<br>\r\n(link://http:www.gamerssphere.com)90s version<br>\r\nor movie version</span></div></span></div>",
            "created":1447822800,
            "id":2063764,
            "title":"jean grey"
        },
        "1131":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "By way of the Phoenix Force",
                "By digesting a growth serum of Pym Particles ",
                "Some other unknown way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does she start growing?</span></div></span></div>",
            "created":1447822800,
            "id":2063767,
            "title":"70s version"
        },
        "1133":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "Xmen 1/2",
                "Xmen 3",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which movie ?</span></div></span></div>",
            "created":1460782800,
            "id":2134230,
            "title":"movie version"
        },
        "11331":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Japan where she's thought of as Godzilla,a friendly Godzilla though ",
                "England where she tries to seek help from the population "
            ],
            "content":"<div class=\"\"><div> <span>This takes place after the events of X2 Jean had been assumed dead when she apparently sacrificed herself to save her friends Jean had as Professor Xavier stated in the third film been protected from the massive water flow by her psychic powers wrapping her in a cacoon but it also had given her a third strange power next to her telepathy and telekinesis:Jean was slowly growing gigantic and as she rises from the ground she tries to psychically scan for any of the X-Men's whereabouts but quickly found out that her telepathic powers had been demolished for now so instead the now 70 foot sexy ginger headed mutant still in her all black X-Men uniform began walking across the vast Ocean making vast tidal waves as she waded through the sea until she reached </span></div></div>",
            "created":1460869200,
            "id":2134523,
            "title":"Xmen 1/2"
        },
        "11332":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "...But her hand got frozen by the iceman ",
                "...And she grabs him "
            ],
            "content":"<div class=\"\"><div> <span>Since Magneto became a human because of the antidote injected on his body by the Beast, Jean was loosing control of her power, <br>\r\nand the battlefield was turning into an \"extermination field\". No distinction between humans or mutants, she was killing and destroying<br>\r\neverything and everyone around her.  <br>\r\n<br>\r\n\" I have to do something i'm the only one able to stop her \" Logan said to Storm, who agreed and tried to help everyone to flee the zone.<br>\r\n<br>\r\nBut as Logan approached her, he realized something else. Jean was growing ! \"Damn it this can't be ! JEAN STOP THAT NOW ! \"  he shouted,<br>\r\nbut she had no reaction. Her power was becoming stronger, but her size too !<br>\r\n<br>\r\nShadowcate and Iceman noticed a big Jean, and decided to stay at some distance to wait for Logan.<br>\r\n<br>\r\n\" Jean do you hear me ?! YOUR POWER MAKE YOU GROWING ! \" . Unfortunately Wolveringe couldn't walk faster, as her power hurt him <br>\r\nbadly and often had to make a step back. By the time he finally could reach her but it was too late. He was now facing a giant Jean, or should he<br>\r\ncall her \"a giant Phoenix\". But at last, she stopped to use her power.<br>\r\n<br>\r\nJean still had her black eyes, althought that she seemed to have regain some conscious, and looked down around her. \" Where are they ? \" She asked.<br>\r\n<br>\r\n\" You mean all the humans you just killed ? You have a biggest problem to solve right now ! Let me help you \" Logan replied.<br>\r\nJean was now looking at the tiny Logan at her feet. \" You will come with me Logan \". She bent down trying to reach him...</span></div></div>",
            "created":1460782800,
            "id":2134245,
            "title":"The last stand "
        },
        "113321":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "Storm and the others are here !",
                "Logan can reason with the real Jean..for now "
            ],
            "content":"<div class=\"\"><div> <span>Her hand was coming closer and closer to Logan, when it suddenly...got frozen, which surprised Jean who screamed. Wolverine then looked<br>\r\nto see iceman. \" what the hell are you doing there ? i can take care of her ! You have to go she's too dangerous ! \"<br>\r\n<br>\r\n\" No way we leave you alone with her !\" He replied.<br>\r\n<br>\r\n\" We ?! \" <br>\r\n<br>\r\n\" Shadowcat will come back soon with Stom and Colossus. We will fight her together ! \" He insists.<br>\r\n<br>\r\n\" Listen boy ! You...\" <br>\r\n<br>\r\n\"LOGAN WATCH OUT ! \"<br>\r\n<br>\r\nWolverine then just got crushed by the giant boot of Jean. Iceman screamed of terror until he realize after she removed her boots that he was still<br>\r\nalive, thanks to the Adamantium skeleton ! But now Jean was after him ! So he used all his strenght to freeze her body. The only thing was that his<br>\r\nice was not enough tough for her giant size, so it breaks after only some seconds.<br>\r\n<br>\r\n\"hu ho...i have some troubles.\" <br>\r\n<br>\r\nJean then used her telekinisis power to catch some antidotes injection from the small building behind her.and threw them at iceman, who fell on the ground, while<br>\r\nloosing his power.<br>\r\nMeanwhile Logan finally could regenerate his skin on his crushed body, but he didn't have time to react as he was grabbed thight in the giant hand of the Phoenix, who raised him to her eye levels.<br>\r\n<br>\r\n\" Jean i know you can hear me ! Do something it''s me !! \"<br>\r\n<br>\r\n\" I may not be able to crush you, but i can hurt you badly in my hand while i'm stepping on your friends.\" She replied ignoring what he just said.<br>\r\n<br>\r\nWolverine couldn't move  a finger, he was trapped in the soft and cold hand of the woman he loves as she is about to kill iceman. He had to do something !</span></div></div>",
            "created":1460782800,
            "id":2134293,
            "title":"...But her hand got frozen by the iceman "
        },
        "115":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "ms. Marvel",
                "Mystique",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>(this was originally added to by- eddied)<br>\r\n<br>\r\nhow about these characters</span></div></span></div>",
            "created":1217307600,
            "id":562561,
            "title":"other"
        },
        "1151":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "kamala khan Ms marvel",
                "Carol Danvers Ms Marvel",
                "both "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so the old or new ms marvel</span></div></span></div>",
            "created":1477717200,
            "id":2230287,
            "title":"ms. Marvel"
        },
        "11511":{
            "author_id":"finkaboutit",
            "author_name":"Emanon",
            "choices":[
                "sneaks away to train and test them",
                "goes full sized right there"
            ],
            "content":"<div class=\"\"><div> <span>Kamala Khan now had the title of Ms. Marvel a title she worked her hardest to earn. To train she always would use the Avengers simulation room to train whenever she had the time. She always trained hard to be the best hero she could be but she often would end the training with a simulation that was a bit of a fantasy for her. It was New Jersey her home just a little smaller or if she was 250 ft tall without changing size. <br>\r\n<br>\r\nShe always enjoys the feeling of power she has over the city and that was before using her growth power. But over time as she played the simulation night after night it became a little boring the people always reacted the same and the damages just disappeared after she was done. Ms Marvel left the training room a little disappointed but she sees the new Wasp and decides she may be able to combine her growth powers with the pym Particles to reach titanic heights. So Kamala shrinks down and sneaks a ride with wasp. Soon Kanala finds herself alone with the pym Particles in Nadia's house. Ms Marvel...</span></div></div>",
            "created":1479013200,
            "id":2236654,
            "title":"Ms. Marvel's secret dream"
        },
        "115111":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "Kamala stops at about 60ft... for now",
                "She keeps growing"
            ],
            "content":"<div class=\"\"><div> <span>A part of  of her wanted to use every last particle to see what would happen. With the particles combined with her powers she could easily surpass Giant Man or either Wasp and was eager to see the results.<br>\r\n<br>\r\nBut in the back of her head was still that reasonable voice. She couldn't be certain exactly what WOULD happen and Nadia probably wouldn't like the results.<br>\r\n<br>\r\nWhile Nadia was distracted, Kamala slid through an open window, keeping her treasure in her arms. When she was away from the house, Kamala returned to normal size sprinted away before slowing into a nonchalant walk, looking for a good, wide area to test her potential new size. It would also be good if there were some larger buildings around so she could gauge she just how big she would get.<br>\r\n<br>\r\nNow she was finally free to unleash the Pym particles and see what they could really do! She popped them open and without activating her powers she started to grow.<br>\r\n<br>\r\nShe waited and looked around.Her surroundings shrunk, a sensation that wasn't new to her, though her growth was slower than usual. It felt... different. She wasn't stretching herself, instead new tissue was forming by the second. At first it felt painful, but then it felt invigorating like she knew she was getting stronger by the second. She soon towered over houses, reaching and surpassing her usual limit, then kept growing as though nothing had happened.<br>\r\n<br>\r\nKamala had heard the Pym Particles could strain the users mind and body, which is why Henry and Nadia were reluctant to grow, but she actually felt pretty great. Was this because she was used to size changing? Or because she was an Inhuman?<br>\r\n<br>\r\nLooking around even the tallest houses only came to her knees and she felt stronger than she had ever been. This was great!</span></div></div>",
            "created":1479704400,
            "id":2240032,
            "title":"Might not stick around just felt like doing this"
        },
        "1151111":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "She grows to the expecting height ",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Kamala didn't know exactly how large she was, but most of the houses were barely to her knees and she was about twice as tall as her \"normal\" maximum. That was great! How did this work exactly? Was she twice as strong and twice as tough? She couldn't wait to see the looks on the Avengers faces when they could see what she could do.<br>\r\n<br>\r\nAnd yet she wanted more. 60 feetish was about the \"normal\" size for a pym particle user but she knew they could get larger than that and she had taken a lot.<br>\r\n<br>\r\nShe concentrated, willing the Pym Particles to continue their work. The buildings around her grew smaller and smaller, she had to watch her step lest she crush a car or person and still rose higher, her body quickly becoming large and wide enough that she  had to stand with her legs apart. Hmm if she wanted to test her limits she was going to have to find somewhere she could really cut loose.  Fortunately her new height gave her a better view. She could see a wide open park. Perfect. <br>\r\n<br>\r\nKamalla headed towards it, watching every step.<br>\r\n<br>\r\n\"Excuse me! Superhero coming through!\" That was fun to say! People gawked up at her, though they weren't too scared. They had seen giant heroes before, though rarely as large as her.<br>\r\n<br>\r\nShe quickly reached the park and was soon so large that she almost crushed the trees with her feet. She had to be over 200ft now. Probably 250ish but she had no way of being sure. She still wasn't feeling the supposed strain this put on a size shiftier which in her book was a good sign. Now it was time to use her powers and see what she could really do. Kamalla took a second to think about this.  Her powers allowed her to grow about six times her normal size,, though she wasn't truly sure she had reached her limits, so if there wasn't any complication or side effect of mixing the pym particles with her Inhuman powers, unless it unlocked some kind of hidden ability or something.<br>\r\n<br>\r\nWell no point speculating about that, it was time to put this the test. There was just one thing she needed to say.<br>\r\n<br>\r\n<b>\"EMBIGGEN!\"</b></span></div></div>",
            "created":1481000400,
            "id":2246416,
            "title":"Just in the mood to write"
        },
        "1151112":{
            "choices":[
                "Grow more",
                "Destroy the world"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ms.Marvel is growing so fast. That she outgrow the world. What will she do?</span></div></span></div>",
            "created":1498280400,
            "id":2341447,
            "title":"She keeps growing"
        },
        "11511121":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "Continue",
                "And I wont add to another 1 or 2 line chapter"
            ],
            "content":"<div class=\"\"><div> <span>Kamalla rose higher and higher, and at a rate much faster than she expected. She was far bigger than she had ever been before, far bigger than any size shifter shifter she had ever known, yet with each second she was still growing at at an astonishing rate. She could see more and more of her town as it dwindled before her eyes, its buildings soon appearing no more than model size to her.<br>\r\n<br>\r\nShe expected the air to be thinning but as her head neared the clouds she was surprised to find this was not the case. She looked up and saw her head racing towards the clouds. Kamalla couldn’t believe it! She had to be close to a mile tall and her growth showed no sign of stopping. How was this possible and when would it end?<br>\r\n<br>\r\nThe clouds were soon level her chest, then her waist, then far below her. She could barely see the ground below her. How big was she now? Bigger than a mountain? And yet still she grew. And the air still felt ok.<br>\r\n<br>\r\nHer feet were still in the park, but if her growth kept going, she feared what she might do, so  with one great step she placed herself outside. <br>\r\n<br>\r\nLooking up again she could see that not only was she higher than any cloud or bird, but she could see the inky blackness of space. Before long her head pushed through the atmosphere and the rest of her soon followed. How was she not suffocating? It seemed impossible, yet here she was.  Her thoughts were distracted by the beauty of space and the glistening stars around her.  She noticed the earth was seeming further and away, and took a step in to space, allowing her self to float. Before long she would be able to put her arms around the earth, then soon hold in her hands. She watched the planet dwindle before her eyes, having an urge to poke it just to say, say she,  though feared the .destruction she might cause. She floated around inspecting her surroundings,</span></div></div>",
            "created":1499144400,
            "id":2347164,
            "title":"You don't deserve a real addition but im bored"
        },
        "11512":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Yeah I said yes!",
                "On second thought......"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you sure the original Ms. Marvel: <a rel=\"nofollow\" href=\"https://www.google.com/imgres?imgurl=http%3A%2F%2Fimages5.fanpop.com%2Fimage%2Fphotos%2F30800000%2FMs-Marvel-carol-danvers-30892877-382-418.jpg&amp;imgrefurl=http%3A%2F%2Fwww.fanpop.com%2Fclubs%2Fcarol-danvers-ms-marvel%2Fimages%2F30892877%2Ftitle%2Fms-marvel-photo&amp;docid=K6OzvYOtW_JBQM&amp;tbnid=i0cq2Ierkm61WM%3A&amp;vet=10ahUKEwjSkM7h9sjXAhXL5SYKHWJwB1QQMwiBASgFMAU..i&amp;w=382&amp;h=418&amp;bih=662&amp;biw=1366&amp;q=carol%20danvers%20ms%20marvel&amp;ved=0ahUKEwjSkM7h9sjXAhXL5SYKHWJwB1QQMwiBASgFMAU&amp;iact=mrc&amp;uact=8\" target=\"_blank\">https://www.google.com/imgres?imgurl=htt...</a> is what you want þo grow gigantic or possibly you shrink in front of her?</span></div></span></div>",
            "created":1510981200,
            "id":2416766,
            "title":"Carol Danvers Ms Marvel"
        },
        "1152":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Comics",
                "Film",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Comic version or film version?</span></div></span></div>",
            "created":1413176400,
            "id":1871288,
            "title":"Mystique"
        },
        "1153":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "She-Hulk",
                "Emma Frost",
                "Not my cup of tea......"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>( this was riginally added by-----) Darthtater<br>\r\n<br>\r\nmore choices</span></div></span></div>",
            "created":1217307600,
            "id":562564,
            "title":"other"
        },
        "11531":{
            "choices":[
                "Too much Gamma Energy",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What causes the Jade Giantess to become even more of a giantess?</span></div></span></div>",
            "created":1406523600,
            "id":1834841,
            "title":"She-Hulk"
        },
        "115311":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Regular Marvel Universe",
                "War World Hulk or Civil War"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which time period or era universe will the golly green giantess experience her much bigger and grander life?</span></div></span></div>",
            "created":1406696400,
            "id":1835571,
            "title":"Too much Gamma Energy"
        },
        "115312":{
            "author_id":"gigastar",
            "author_name":"Gigastar",
            "choices":[
                "Accidental exposure to Pym Particles",
                "The Scarlet Witch's reality warping powers gone wild",
                "Stumbling over the fourth wall while breaking it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could cause She-Hulk to grow?</span></div></span></div>",
            "created":1419742800,
            "id":1908464,
            "title":"Growing Green"
        },
        "11533":{
            "choices":[
                "Black Cat",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Black Cat?</span></div></span></div>",
            "created":1260680400,
            "id":805410,
            "title":"Not my cup of tea......"
        },
        "115332":{
            "author_id":"eliza-13",
            "author_name":"emo",
            "choices":[
                "WASP*",
                "NEXT*"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>!!! THE WASP !!! <br>\r\nSHE IS SO COOL.</span></div></span></div>",
            "created":1266123600,
            "id":836123,
            "title":"what about !!!THE WAPS!!!"
        },
        "1153321":{
            "author_id":"patwickersham",
            "author_name":"rockysavannah",
            "choices":[
                "Janet Van Dyne of Earth-616",
                "Another version."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before continuing, I'd like to know what version of the Wasp will be used.</span></div></span></div>",
            "created":1496466000,
            "id":2330516,
            "title":"WASP*"
        },
        "11533212":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Giant girl from Adventures",
                "Wasp from earth mightiest heroes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which will it be<br>\r\n</span></div></span></div>",
            "created":1499144400,
            "id":2347108,
            "title":"Another version."
        },
        "115332121":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Steal the Pim particles",
                "Ask Hank to help her"
            ],
            "content":"<div class=\"\"><div> <span>Janet who was in her giant girl costume was resting on her bed. She was deep in thoughts, thinking about the battle that happened yesterday. They were fighting a giant robot and even she couldn't out grow it, this got to her because SHE was supposed to be the biggest in the world. She then got an idea on how to increase her growth, ether steal some Pim particles, or ask Hank to help her.</span></div></div>",
            "created":1499144400,
            "id":2347114,
            "title":"Giant girl from Adventures"
        },
        "1153321211":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "1000ft",
                "3000ft"
            ],
            "content":"<div class=\"\"><div> <span>Janet had shrunk herself down to wasp size and had easily avoided all the guards. She grabbed the Ville that contained the growth particles and she then swallowed them. They tasted so good, going down her throat and into her belly. She then started to feel that tingling feeling when she started to grow. When her head burst out of the ceiling, she could see some of the guards looking at her in shock. She winked at them and then she kept growing, she had just gotten her head outside and she was still growing. She stops growing at</span></div></div>",
            "created":1499144400,
            "id":2347144,
            "title":"Steal the Pim particles"
        },
        "11533212111":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Take over the world",
                "Help the world even more"
            ],
            "content":"<div class=\"\"><div> <span>After Janet had stopped growing, she felt more powerful than ever before. She hadn't opened her eyes and yet, she felt all the power in the world. She finally opens her eyes and sees blue, then she hears a sound of something coming to her, it made the sound of what a fly makes when right next to her ear. She looked and saw a Very tiny plane that was no bigger then her pinkie toe, she saw all the people looking at her in awe. While giving the citizens a gentle smile, she then decided to wave at them and say hello. When she waved, then plane went straight down. Janet with a casual move of her hand, let it land on the palm of her hand. She then asked \" Is everyone all right\"? The pilots gave her a thumbs up and she gave a huge sigh, she then apologized to the people and when they left her palm, she looked down at the city. The skyscrapers only reached her waist, her showdow covered New York itself. People were staring up at Giant girl in shock. They knew she could get big but never have they ever seen her get this big. People had there phones out recording it and sending it out on social media, there were also other news channels covering at the super heroine massive size. There were some people who were fine with the new size Giant girl had, but there were others who had there concerns.<br>\r\n<br>\r\nPeople were wondering what she was going to do, because there were no Aliens, Giant monsters, or Giant robots. There was nothing going on so why would she be using this new size now? Some speculated she was just testing her new growth out, or maybe there was an accident and she grew to this new size. Others thought she was trying to take over the world and be some type of goddess, others thought she was going to kill all the humans. So what does she do now?</span></div></div>",
            "created":1499749200,
            "id":2351721,
            "title":"1000ft"
        },
        "115332121112":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "She takes some extra Pym particles",
                "She doesn't need them and decides to face him like this"
            ],
            "content":"<div class=\"\"><div> <span>Cameras from helicopters and from the ground, were showing all different angles of Janet. People who were watching from there homes could see how massive she truly was. She made the people all the ground feel like ants, just little insects that could be squashed at any moment, and all it would take was one step, then there life's would be over. People who were daring enough would run up and touch her boots, which Janet would SEE and just giggle at. Helicopters from news station got a better look at her. Her hair looked like a giant corn field, her back stretched for what look like forever, and some helicopters even got a great look at her rear end, but Janet put a stop to that by glaring at them, and because they loved living, they backed off.<br>\r\n<br>\r\nJanet couldn't contain her excitement and just had to smile. She had done it, broken past her growth limit and had gained more power than she thought she could have. On top of that, she became the focus of the news, while in most cases she didn't like having all the attention, right now she was loving it. Everyone was loving her new size and some were now calling her a goddess, she also got even bigger breast, which could easily destroy a building, and a enormous Butt. She looked behind and saw a lot of men, even a couple of women looking at her ass. \"Well what to do now, hmmm, oh yea\" Janet lifted her head high in the air and had a big, kinda evil smile on her face, \" I think it's time to pay rock face a visit, now I just have to get his attention\". Janet then got an idea and turned her head, where she spotted a helicopter right next to her, she then asked \" hey, could bring that camera you got there and focus on my face\" they obliged her and everyone could one see her enormous face.<br>\r\n<br>\r\n\" Hey rock face or whatever your name is, I want a rematch, so meet me in the desert and fight me, then will see who the biggest and strongest is\"! She then looked down and said \" excuse me, could you people be so kind and move out of the streets, I really don't want to stomp on you guys\" they moved. Then she lifted her boot up, people could see every little thing on the bottom of her boot, the dust, crumbs, and sand between the soles of her boot, it then came down with a massive BOOM, causing everyone to be lifted off the ground. Other people waved her on, cheering her name, some even going on there knees and bowing down to her. Janet didn't pay attention to them, all she wanted to do was beat that rock guy.<br>\r\n</span></div></div>",
            "created":1502341200,
            "id":2367289,
            "title":"Help the world even more"
        },
        "11533212112":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Janet smash",
                "Time to sit down"
            ],
            "content":"<div class=\"\"><div> <span>Janet stopped growing at 3000 feet. She looked around, only seeing the blue skies and felling the wind hit her huge body. \" Oh my god! I'm So BIG\" Janet said to herself, looking down she saw she towered over the buildings, the tallest only reaching her waist. The beautiful Giantess squatted down so she could see the people. The civilians said nothing as they were so awestruck by the beautiful goddess looking down at them. Janet smiled back at them \" hello\" she said this with a cheerful tone.<br>\r\n<br>\r\nGiant girl then heard her Avengers card beeping. She picked it up with some difficulty and put it next to her ear. She heard that the rest of her teammates were fighting a group of Giant robots and they needed her. Janet Immediately headed to the location, her boots living boot prints in the road, and the earth shook from her walking. <br>\r\n<br>\r\n\"Dont worry guys, your big gun just got a whole lot bigger\" she muttered. </span></div></div>",
            "created":1513314000,
            "id":2428453,
            "title":"3000ft"
        },
        "115332121121":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Eating lunch with Spiderman ",
                "Fighting an Army"
            ],
            "content":"<div class=\"\"><div> <span>Earths mightest heroes, The Avengers, are surrounded by 120ft robots. Without the hulk and Giant girl's assistance, the robots had managed to back them into a corner. All of them were breathing hevaly with sweat going down there bodies, caused by the heat coming down on them. The robots moved to there positions, each of there steps shaking the ground, causing all of the Earths heroes to grit there teeth and to grip there hands hard. Being known as the jokester of the group, Spiderman decided to break the tension with a joke.<br>\r\n<br>\r\n\" Hey, you guys ever,SHUT UP!\" They all yelled, irritation evedent in there voices. They all were to tired, hungry, and nervous to hear the webslingers joke's. Spiderman rubbed the back of his head nervously \" sorry, just trying to lighten the mood.\" Wolverine looked at the web slinger while pinging the bridge of his nose in irritation \" web head, instead of trying to make a joke, TRY TO COME UP WITH A PLAN!\" Spiderman put his finger in his ear, trying to get the ringing out, and he looked at Wolverine. \" Hey, just calm down, I called Janet earler, she'll come and crush these guys-like a spider\" Wolverine interupted with a teasing tone.<br>\r\n<br>\r\n\"Hurtful\" spiderman said, Then he heard a BOOM, which knocked him as well a the other Avengers off there feet. The robots staggered for a second but regained there balance. The Avengers looked up and saw there Giant team mate standing above them. They noticed something way different, she was way bigger than usual, easily towering over the canyon they were in.<br>\r\n<br>\r\n\"Hey guys what's up\". All of there jaws were dropped, they had always known she was big and could get bigger, but not this big. Giant could not describe her anymore, humongous was the right term. She was just unimaginable huge it was insane.<br>\r\n<br>\r\nJanet looked down at the robots, who looked like insects just waiting to be squashed under her Boots. She turned her head to her team mates and said in a manly deep voice \" COME WITH ME IF YOU WANT TO LIVE\". <br>\r\n\"Lame\" Spiderman whispered.<br>\r\nJanet glared at the young hero who shrunk under her gaze \" I heard that\"<br>\r\n<br>\r\nThe robots bag an to fire at her, which made her giggle, these tiny robots were only tickling her enormous body, it was kinda sad to be honest. She lowered her hand, allowing her team mates to climb on it. She lifted them up to her chest, where the Avengers truly started to see how small they were to there large friend. <br>\r\n<br>\r\nJanet lifted her boot into the air and smashed it onto the ground, causing a dust cloud to form and millions of pieces of rocks to go flying. Janet lifted her boot to see the robots bodies destroyed, peaces were everywhere. Janet sighed and looked at her hand to see the Avengers looking at her in aww. <br>\r\n<br>\r\nJanet smiled and said \" yea I know I'm amazing, no need to thank me guys\" saying in a mocking tone. The Giantess saw her favorite web slinger jump on her shoulder \" THAT WAS AWSOME, oh and HOW ARE YOU... So huge, will bigger then you normally are?<br>\r\n<br>\r\nJanet sighed and explained her whole story, it was now a month later, what is she doing now?</span></div></div>",
            "created":1514350800,
            "id":2433114,
            "title":"Janet smash"
        },
        "1153321211211":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Eats robbers",
                "Spars with Spiderman"
            ],
            "content":"<div class=\"\"><div> <span>After dealing with all the major threats, and with crime going lower than ever the Avengers decided to take a break. They weren't stupid and knew while crime has gone low, it doesn't mean it has stopped, so they decided to leave the friendly neighborhood wall crawler and size changing heroine to defend the city. The two youngest members tried to get Tony to reconsider, but the billionaire play boy would not let up. Now we see the two heroes dressed up in there regular clothes and being Peter Parker and Janet Van Dyne.<br>\r\n<br>\r\nThey were eating at, in Peter's choice of words, the best burger joint in New York. We see them both sitting outside, with there food in front of them, Janet reached in first and had the first bite. Peter looked on with a smug smirk as Janets eyes shot up as bright as Tony's armour and she began to scarves it down as fast as the Hulk. After a few minutes of eating in silence, Jan leaned back in her chair as her not so amused face came back. <br>\r\n<br>\r\n\"Peter thanks for taking me here, and I know you have all ready heard this from me for the billionth time, but man I'm Pissed off\"! Peter looked at her with a small smile \" hey I know, I would rather be on vacation to, but\" he said this with dragging the last word out \"if Captain America thinks us two staying here is a good Idea, then we're probably doing what's best\". Janet looked back at him with a LOOK that said are you kidding me \" Pete, you do know this was Tony's Idea right? I mean I love Tony, but you and I both know his Ideas usually don't work\". Peter tried to rebuttal his friend but couldn't come up with any more arguments, so he just gave up and kept eating, his eyes drifting back and fourth between Janet and a couple guys starring at her.<br>\r\n<br>\r\nJanet looked where he was looking to see the boys starring at her with drool coming out there mouths. She giggled and waved at them before returning to her food, and finishing off the fries. The two then headed off and went to a ally, which was a short cut to Avengers Tower. Just as they passed by a trash can, the group of boys from earlier came and surrounding them. A muscular man, who looked to be around his early 20s got up close to them, and put a hand on Janets face. He gave her a disgusting smirk \" Hey sweetie if you want to get passed, you got to give me some \"special treat\", his buddy's all laughed, but then they stopped as they heard Peter laughing.<br>\r\n<br>\r\nThe leader then went to Peter and picked him up by his shirt \" WHAT YOU LAUGHING AT, ARE YOU STUPID OR INSANE?! It was then he heard all his guys scream and run, before he could yell at them to come back, he noticed a huge showdow completely cover him. He looked back and saw that the women wasn't just any women, she was Giant Girl, and she looked pissed. She picked him up easily and then said in a dark tone \" When I'm done beating you, you better clean up your act, or I will find you, and I will swallow you up, GOT THAT?! It was then the man started to beg and cry, Janet then knocked him out with one punch. She looked back at Peter with a scowl on her face \" you could have helped\", Peter gave her a smile and said \" yea I could have, but you handled tougher things before, I was sure you could have squashed him like  a bug if you wanted\".<br>\r\n<br>\r\n\"Well, okay, but let's get going, I'm already getting hungry and I might have you as a snack\". She gave him a teasing smirk and he shivered before laughing it off and following her.</span></div></div>",
            "created":1516424400,
            "id":2442911,
            "title":"Eating lunch with Spiderman "
        },
        "11533212112112":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Just kidding",
                "No your going in"
            ],
            "content":"<div class=\"\"><div> <span>Avengers Tower<br>\r\n<br>\r\nIn the training room, Spiderman and Giant Girl are across from each other, wanting for the bell to ring. Spiderman had his knees bent, with his hands in front of his face ready to pounce like a cat. Janet on the other hand was in no Attack position, just standing still with a cocky smirk on her face, as if she knew what was about to happen. <br>\r\n<br>\r\nRiiiiiiiiiiiiinnnnng<br>\r\nThe bell rings and the second it did, Spiderman jumped at Janet, but he quickly stopped as she grew to about 100ft tall. The wall crawler webbed onto the ceiling, which was 10 to 20 ft taller then Janet. Janet looked at him and said in a gruff, deep voice \" FE FI FO FUM, IM GONNA EAT A LITTLE SPIDER TODAY\"! Janet then slammed her arm into the ceiling only to find spiderman not there. <br>\r\n\"Hey gg, You really let yourself go, you got to cut back on the sweets\", the giant turned around to see Spider-Man on the floor, by her foot. She then let out a growl and stomped on where he was, this goes on a few more times, before Janet finally encloses her first on him.<br>\r\n<br>\r\nShe then squeezed him, not enough to hurt him to bad, but to show that his strength wouldn't save him this time. She opens her hand and then flicks him with the other hand, sending him flying into the wall. While he groans and tries to get up, a showdow covers him and he sees Janets rear end in front of him.<br>\r\n<br>\r\nWith a note of terror in his voice he says \" Janet what are-<br>\r\nHe then gets squished under her butt, her soft cheeks grinding him like pillows. He tries to lift them off, but it's no use, as it's clear she has the strength advantage. He then feels himself start to rise and notices that his still stuck on her butt. <br>\r\n\" Hey spidey, how you doing\"?<br>\r\n\" well I'm currently stuck on your butt, so that's either a good thing or bad thing, more depends on what you've eaten today\"<br>\r\nJanet chuckles and says \" well lucky for you, I haven't had anything today, so yea looks like your good, so better get used to this\".<br>\r\n\" wait what\"? <br>\r\n\"Better get used to being on my butt, because now, your going INSIDE MY BUTT, so have fun\"<br>\r\nBefore he can respond, he notices her finger coming to his position.</span></div></div>",
            "created":1516942800,
            "id":2445215,
            "title":"Spars with Spiderman"
        },
        "115332121121121":{
            "author_id":"stillwell007",
            "author_name":"smoakwriter",
            "choices":[
                "grow Peter back ",
                "stay this size with Peter"
            ],
            "content":"<div class=\"\"><div> <span>as Peter saw the her hand getting closer he noticed that the his spider-sense wasn't alerting him to anything which freaked him out, that had never happened before while focusing on this, thinking Janet did this somehow. he against all odds managed to slip out of Janet's ass crack and started running but quickly stop as he realized that Janet was blocking the only way in and out of the massive room, the door. Peter on the opposite side of the room was knocked on the ground as Jan had noticed him and was moving to get him she did she did not say anything freaking Peter much further as Jan's hand reached out towards him Peter was just crawling back until he hit the wall terrified he raised up his hands in a blocking position, closing his eyes trying to get a hold of his spider-sense which still did nothing. and so Peter waited not having to wait for long as he felt his are and body unable to move ( more so out of fear then being held by Jan as Jan was being very gentle). Jan finally said \"Peter are you okay that wall hitting your head looked kinda bad, are you awake Peter (she was now whispering), you know i was joking about my butt right right\". Peter who was now shaking in fear not believing his \"friend\" while now staring teary eyed at Jan who seemed a bit smaller Peter subconsciously guessed around 80-90 feet and still getting smaller when she stopped she was around 40 foot tall still worrying about Peter who hadn't said anything in around 15 minutes since she had joked earlier Peter then finally spoke asking if she was really joking or if she really wanted to shove him up her ass. as she blushed and looked away Peter knew the answer and started to get up and and walk off of her hand before asking \"why didn't you shove me up there then?\" Peter \"because i felt bad after seeing you cowering over there\" she said sadly but as Peter was about to jump off of her hand Janet Screamed \"WAIT\" and squeezes her hand on Peter as he screamed out in pain she quickly released her grip and said sorry as Peter as he was again cowering in fear she quickly stuffed him in the back of her pants as Peter started freaking out she said she had to test something she than shrunk and so did Peter as peter was freaking out because he did not know what was happening.<br>\r\n<br>\r\n<br>\r\ndoes Janet........................................................................... ..................................</span></div></div>",
            "created":1602626760,
            "id":2920753,
            "title":"JK lol"
        },
        "1153321212":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Janet grows to a mega goddess"
            ],
            "content":"<div class=\"\"><div> <span>A couple days later, Janet went over to hanks to ask him for help, explaining what she wanted. Hank had  a look of stress on his face, \" Janet while I would love to help you, we don't know if your body can take  that amount of growth\". Janet gave him a desperate face \" Oh come on hank, your the one who says we need to take risk to discover to things, besides you and I can have some fun\" Janet gave him an affection wink. Hank started sweating and started to have a bulge in his pants \" come on hank, for once you can get the girl you love\" hank thought and after a minute of thinking he caved in. Okay said hank, He then felt himself lifted off the air by Janet who had grown to 10 feet tall and then she planted a kiss on his cheek. Oh thank you Hank</span></div></div>",
            "created":1504674000,
            "id":2381538,
            "title":"Ask Hank to help her"
        },
        "11533212121":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "To rule it",
                "To protect it"
            ],
            "content":"<div class=\"\"><div> <span>A few days later, Janet's suit had been upgraded by using the power of the infinity stones, and now she could grow to any height without being under stress. Now, they were going to test the new suit out and see if it could go way beyond her normal limits.<br>\r\n<br>\r\nYou ready Janet Hank said, with excitement in his voice, your about to become a God!<br>\r\nJanet looked at him, her blue eyes filled with excitement, her feet moving up and down just thinking about all the power she will have. \" yes Hank, I'm ready, I'm ready to become a GODDESS! Hank then pressed the button that activated her suit and Janet then began to think big, images of her giant form picking up buildings and making them look like the size of an ant.<br>\r\n<br>\r\nShe then began to grow, at a much faster pace then normal and she all ready saw she was towering the biggest buildings in New York; going way beyond them, she could see the people who at her \"normal\" huge size would look like dolls, now looked liked ants and they were getting smaller, much smaller. Her boots started to tower over the largest buildings and kept getting BIGGER. She then stopped and looked down, what she saw made her mouth open wide, with shock, aww, happiness, and joy all in her face.<br>\r\n<br>\r\nShe had grown so large that her one foot could destroy all of New York, it would be like crushing an ant farm, so easy. She looked down and could not see any people, so she bent over and she saw that the people were so tiny, she could carry every person in New York on the palm of her hand and have no problem. <br>\r\n<br>\r\nShe looked down and then picked up a building, using her middle and index finger to hold it. She saw that the building was ant size to her and upon a closer look, she saw it was the tallest building in New York, standing at 300 ft tall. She looked at New York and decided <br>\r\n</span></div></div>",
            "created":1505624400,
            "id":2386944,
            "title":"Janet grows to a mega goddess"
        },
        "115332121211":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Eat people ",
                "Butt crush people "
            ],
            "content":"<div class=\"\"><div> <span>You know what, why not just rule this planet Janet thought. \"I mean no one is going to stop me, and no one can,\" Janet looked at New York and spoke \"PEOPLE OF THE WORLD, IT IS ME GIANT GIRL, I AM NOE CLAMING THE EARTH AND I WILL BE YOUR GODDESS. Janet then looked to see the Avengers coming and she smiled \" yes, they will be a perfect example to show how powerful I am now.<br>\r\n<br>\r\nThe quin Jet stopped in front of Janet and out came all the Avengers. Caption America was the one who spoke \"Janet, whatever has happened to you, you need to fight it, this isn't you\". Then Janet laughed, which made all the Avengers cover there ears \" OH LOOK THE TINY AVENGERS ARE HERE TO STOP ME, WELL I DINT KNOW IF YOU HAD NOTICED, BUT IM NOT JUST A GIANTESS ANY MORE, I AM A GODDESS. <br>\r\n<br>\r\nWith that she grew even more making New York look like a piece of dust and the Avengers looking like ants only 50 times smaller. She looked down and saw each of the avengers looking up at her in fear and aw. \"YOU SEE NOW, YOU AVENGERS CANT SROP ME I WAS ALWAYS THE STRONGEST AND NOW I MAKE YOU ALL LOOK LIKE INSECTS COMPARED TO ME; she then picked them up and opened her mouth, WELCOME HOME she said and she dropped them in her mouth and swallowed them. <br>\r\n<br>\r\nShe could feel them attacking her stomach wall but it didn't bother her, in fact it made her feel great. <br>\r\n<br>\r\nShe looked down at New York and said FE, FI, FO, FUM, YOUR ALL GONA BE CRUSHED UNDER MY BUM. She turned around showing off her giant butt in her purple pants, she squats down and half of New York, wanting the other half still intact so the people can worship her. She stood up and used her hands to get the dirt off her butt. \"The great city of New York, brought to the brink of destruction by my butt, that will definitely show people what there goddess is capable of\" Janet thought, she looked down at her boots to see people climbing them and she sent them all a glare before tossing them off with shaking her boot.<br>\r\n<br>\r\n\"HOW DARE YOU, NO ONE TOUCHES THERE GODDESS AND GETS AWAY WOTH IT, TIME TO PUT YOU ALL IN YOUR PLACE, UNDER MY BOOT. She then smashed them all, turning them into red spots on the floor.<br>\r\n<br>\r\nJanet then decides to<br>\r\n<br>\r\n</span></div></div>",
            "created":1506142800,
            "id":2390266,
            "title":"To rule it"
        },
        "1153321212112":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Spit one of the Avengers out",
                "Shit them all out"
            ],
            "content":"<div class=\"\"><div> <span>Janet looks behind and shakes her hips. Then she smacks her huge round ass, causing it to jiggle, wind starts to pick up and buildings fall over. Janet lets out a laugh \" MY ASS IS AMAZING, JUST IT MOVING CAN DESTROY BUILDINGS\" a few more laughs and she finally calmed down. She looked at the tiny building in front of her and she  turned around, her ass facing the building for everyone to see. The beautiful GIANT Goddess jumped up and landed on the building, crushing it completely, leaving a dust cloud and derbies flying everywhere.<br>\r\n<br>\r\nGiant Girl wiggled her butt, wanting to make sure the building was completely destroyed. Janet stood up, looked down and saw a giant butt print in the middle of New York. She smiled wickedly and slapped her ass, causing wind, which blew people back. Janet looked at her stomach, patting it as if she were pregnant \" well, if it makes you Avengers feel better, you will all become apart of MY ASS. So you all better have fun, not everyday you go inside a goddess and get shit out.</span></div></div>",
            "created":1514523600,
            "id":2434161,
            "title":"Butt crush people "
        },
        "1153322":{
            "author_id":"tatertot",
            "author_name":"Darthtater",
            "choices":[
                "The Stepford Cuckoos?",
                "No thank you...."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The Stepford Cuckoos?</span></div></span></div>",
            "created":1318050000,
            "id":1202753,
            "title":"Howsabout..."
        },
        "11533222":{
            "author_id":"kan101",
            "author_name":"Neo Space",
            "choices":[
                "Its about Time......",
                "No...I don't think so...."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Shadowcat????</span></div></span></div>",
            "created":1318222800,
            "id":1204022,
            "title":"Here Kitty,Kitty,Kitty,Kitty...."
        },
        "115332221":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Kitty grows ",
                "Someone shrinks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does it happen then does Ms. Pryde grow or someone shrinks?</span></div></span></div>",
            "created":1348808400,
            "id":1436434,
            "title":"Its about Time......"
        },
        "1153322211":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "50 feet",
                "100 feet"
            ],
            "content":"<div class=\"\"><div> <span>Kitty Pryde of the uncanny X-Men at just 15 had just broken up with Colossus and was on a solo mission to stop her own nosy  neighbors from finding out about the school for mutants when a special group of Sentiels sent by the local government to destroy any mutants in the area attacked her hometown luckily or yourself you and Kitty happened to be great friends growing up and even though she was publicly known as a mutant that didn't change either of your feelings for one another you saw the group of giant robots chasing Kitty down the street her using her special ability to walk through solid material to avoid all their powerful blasts just as she stopped to catch her breath you saw one of the Sentiels fire at her and thinking quickly leaped in the path Kitty saw you do this and grabbed you focusing her intangibility so that the blast went through you both but unfortunately for her special mutant gene the blast does a lot more to her as Kitty Pryde finds herself growing taller how big does she get?</span></div></div>",
            "created":1351227600,
            "id":1454066,
            "title":"Kitty grows "
        },
        "11533222112":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "You gave the giantess Kitty the tour",
                "Something interrupts you"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh No what's happening to me?\" Kitty cries still holding on to you as she grows taller and taller towards the sky high above the 30 foot Sentiels whom once she reaches 100 feet tall she angrily crushes into scrap \"You hurt my friends darn Sentiels!\" she bellows then looking down at your tiny form in her huge palm Kitty shakes you awake \"Wake up sleepy head! Rise and shine!\" as you awake to see your childhood friend at a whooping 100 feet you nearly faint but Kitty giggles shaking her head \"Don't worry _ I won't hurt you yeah that Sentiel's laser blast combined with my genetic DNA turned me into a giantess cool huh? But since your parents are out of town I'll take care of you until Beast aka Dr. Hank McCoy my friend at the X- Mansion can shrink me back to normal now that those Sentiels are taken care of what say you and me go exploring around our old neighborhood Oh I know how about you give me a tour it's been a while since I was last here pretty please?\" she begs with enormous blue eyes you nod quickly unsure whether she's telling the truth about hurting you what happens now? </span></div></div>",
            "created":1351227600,
            "id":1454068,
            "title":"100 feet"
        },
        "1153322212":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "One of the X-men",
                "You"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So who is it that shrinks?</span></div></span></div>",
            "created":1348808400,
            "id":1436435,
            "title":"Someone shrinks"
        },
        "115332222":{
            "author_id":"jlaufey45",
            "author_name":"JLaufey45",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the lovely Natasha Romanoff, also known as Black Widow? </span></div></span></div>",
            "created":1396760400,
            "id":1774067,
            "title":"Black Widow?"
        },
        "1153322221":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Comics(growth)",
                "Movie(growth)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Comics version or movie version?</span></div></span></div>",
            "created":1396760400,
            "id":1774167,
            "title":"Yes"
        },
        "11533222212":{
            "author_id":"jlaufey45",
            "author_name":"JLaufey45",
            "choices":[
                "She grows",
                "Someone else shrinks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First: Does she grow, or does one of her male comrades shrink?</span></div></span></div>",
            "created":1396760400,
            "id":1774525,
            "title":"Movie Version"
        },
        "115332222121":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "She grows",
                "Everyone but her shrinks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Black Widow necessarily how, or does everyone except for her shrink?</span></div></span></div>",
            "created":1457067600,
            "id":2112778,
            "title":"She grows"
        },
        "1153322221211":{
            "author_id":"aelassthia",
            "author_name":"Ronica ",
            "choices":[
                "she doesn’t like it",
                "she likes it"
            ],
            "content":"<div class=\"\"><div> <span>Nat was at Stark Tower when she came across a weird vile of liquid. it suddenly exploded, landing on her.<br>\r\n<br>\r\nShe felt her clothes tightening as they started to rip at the seams and she shot up, beggining to fill the room. Her head butted through the ceiling and she reached 500 feet, looking down in shock</span></div></div>",
            "created":1532104680,
            "id":2522368,
            "title":"She grows"
        },
        "1153322221212":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "The world is yours, own it",
                "These are people, live in harmonyp"
            ],
            "content":"<div class=\"\"><div> <span>You awaken in your small New York apartment, stowing your red hair out of your eyes as you pull a shirt and pants over your undergarments. You are Natasha Romanoff, an agent for shield and member of the avengers, also known as Black Widow.<br>\r\n<br>\r\n You get dressed for work, showering and sliding into your tight black jumpsuit just as you would any day, walking out the door. The street is suspiciously empty, and you are confused as there is no sign of life in the typically vibrant New York City. You look around, and see a bug on the ground. It is a big one, about tree inches in height, and you raise your sneaker to crush it, grinding it into a pulp under your sole.<br>\r\n<br>\r\n You start to jog through the streets, freaking out at the lack of people. You suddenly hear something on the ground, and look at your toes to see what looks like a shrunken woman banging on your shoes. You gasp at the sight of such a thing, and observe the ground, seeing that the reason you had not been able to find anyone was that everyone in the world except for you was shrunken to three inches tall.<br>\r\n<br>\r\n You go through possible solutions in your head, deciding that</span></div></div>",
            "created":1457067600,
            "id":2112784,
            "title":"A New World"
        },
        "11533222212121":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Shield Headquarters",
                "Broadcast your New Set of Laws"
            ],
            "content":"<div class=\"\"><div> <span>You cynically laugh as you bend over and snatch the miniature woman off the pavement. She is hollering for help as you clasp her head between fingers. Raising her to your face, you examine her body and say \"sorry, but I need examples.\" You raise her high in the air for all to see, as you set her on your palm, and slam the other hand into her now bloody pulp which was formerly her body.<br>\r\n<br>\r\nYou wok off to explore the newly acquired planet, deciding to go to</span></div></div>",
            "created":1457067600,
            "id":2112788,
            "title":"The world is yours, own it"
        },
        "115332222121212":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Entertain me",
                "Pleasure me"
            ],
            "content":"<div class=\"\"><div> <span>You walk to the CNN studio,about to announce your new rules for the world which you now ruled over. You make your way through the once busy streets of the big apple until you reach your destination, and open the door.<br>\r\n<br>\r\n You set the broadcasting camera to display on every tv in the world as you set up your set. You stand in front of the camera, and speak into the live feed.<br>\r\n<br>\r\n\"Hello, this is Natasha Romanoff speaking, or as most of the world knows me as, Black widow. As you all are well aware of by now, some random occurrence has caused the shrinking of the human race to just three inches in height. That is, except for me. I am now all of you's goddess. I am the ultimate authority and judgement. If you attempt to resist empowerment then you will be put to death in a cruel way. Now here are the laws I am laying out as of now.<br>\r\n<br>\r\n 1. The only purpose of living is to serve me in whatever way I want.<br>\r\n<br>\r\n2. Any resistance I even suspect will be punished severely.<br>\r\n<br>\r\n3. I am to live in the Empire State Building. I expect it to be cleared, and anyone on a floor other than the lobby will be exterminated.<br>\r\n<br>\r\n<br>\r\n Now I don't think that's too hard world. And I will be taking a world tour to make sure the rest of you are submitting.\" You then close the broadcast and start your trot down the pavement, mowing over innocent crowds of tiny people without a care. You walk to the Empire State Building, and enter with a skip in your step. Reaching down, you scoop up a handful of about ten people and take the elevator up to the top floor.<br>\r\n<br>\r\n You set them on a table as you overlook the city you have conquered. You see a woman scurrying around the floor in panic as you scoop her up and examine her. You look at your table of slaves and say \"Let this serve as an example.\" You take the screaming woman and set her on your tongue, which is laying out of your mouth, slowly retreating her into your mouth.<br>\r\n<br>\r\n You toy with the woman, swishing her around before taking the lady out with two fingers. The shocked woman struggled as you brought her up to your teeth, where you slowly bit into her stomach. She hollers in pain as you stop and lift your tongue up, making the morsel fall into your throat as you was her down with a swallow. You look at the crowd of people and say<br>\r\n<br>\r\n \"Unless you want to end up like her,</span></div></div>",
            "created":1457067600,
            "id":2112801,
            "title":"Broadcast your New Set of Laws"
        },
        "115332222122":{
            "author_id":"jlaufey45",
            "author_name":"JLaufey45",
            "choices":[
                "No, one of her friends or coworkers, or a stranger, shrinks",
                "Yes, her partner or the enemy shrinks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does this happen while on a mission?</span></div></span></div>",
            "created":1410670800,
            "id":1856655,
            "title":"Someone else shrinks"
        },
        "1153322221221":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "She shrinks.",
                "Someone else shrinks around her."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, in an attempt to broaden the choices here I'm adding the option of having her shrink as well here as it fits in only here really.</span></div></span></div>",
            "created":1525237200,
            "id":2487233,
            "title":"No, one of her friends or coworkers, or a stran..."
        },
        "11533222212211":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Avengers - Civil War",
                "Infinity War an onward."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What timeframe does this happen?</span></div></span></div>",
            "created":1525842000,
            "id":2490617,
            "title":"She shrinks."
        },
        "115332222122112":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "She is shrunk by Wanda.",
                "She shrinks at random, around another woman."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And now for the cause. </span></div></span></div>",
            "created":1525842000,
            "id":2490622,
            "title":"Infinity War an onward."
        },
        "11533222212212":{
            "author_id":"iambeowulf",
            "author_name":"iambeowulf",
            "choices":[
                "Clint Barton (Hawkeye)",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shrinks around Natasha?</span></div></span></div>",
            "created":1525237200,
            "id":2487243,
            "title":"Someone else shrinks around her."
        },
        "115332222122122":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Single person shrinks.",
                "Multiple"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Multiple people could shrink around her, or only one.</span></div></span></div>",
            "created":1526015580,
            "id":2491543,
            "title":"More choices"
        },
        "1153322221221222":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Shield/Avengers HQ",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where should the shrinking occur?</span></div></span></div>",
            "created":1526016000,
            "id":2491544,
            "title":"Multiple"
        },
        "1153322222":{
            "choices":[
                "Sure",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Perhaps the green skinned telepath of the Avengers and the Guardians of the Galaxy?<br>\r\n<br>\r\nHow about Mantis?</span></div></span></div>",
            "created":1413262800,
            "id":1871425,
            "title":"Mantis?"
        },
        "11533222221":{
            "choices":[
                "Alien Technology",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What cause our telepath to grow?</span></div></span></div>",
            "created":1413262800,
            "id":1871587,
            "title":"Sure"
        },
        "115332222211":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "CB version ",
                "Film Version"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay but first which one will we be using though? Which Mantis that is: <a rel=\"nofollow\" href=\"https://www.google.com/imgres?imgurl=http%3A%2F%2Fwww.writeups.org%2Fwp-content%2Fuploads%2FMantis-Marvel-Comics-Avengers-Profile-d.jpg&amp;imgrefurl=http%3A%2F%2Fwww.writeups.org%2Fmantis-avengers-marvel-comics%2F&amp;docid=QmjCXmwSFVv4fM&amp;tbnid=79ryZvGwfQiQBM%3A&amp;vet=10ahUKEwjR04Ti-MjXAhUKQCYKHRmrCB0QMwh5KBkwGQ..i&amp;w=500&amp;h=1033&amp;bih=662&amp;biw=1366&amp;q=mantis%20marvel&amp;ved=0ahUKEwjR04Ti-MjXAhUKQCYKHRmrCB0QMwh5KBkwGQ&amp;iact=mrc&amp;uact=8\" target=\"_blank\">https://www.google.com/imgres?imgurl=htt...</a> the comic book version or: <a rel=\"nofollow\" href=\"https://www.google.com/imgres?imgurl=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2FirfMZjGeS1-Wl6wNAck1gbPXwyA%3D%2F200x0%3A1991x1194%2F1310x873%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_image%2Fimage%2F54825235%2Fmantis.0.png&amp;imgrefurl=https%3A%2F%2Fwww.polygon.com%2F2017%2F5%2F17%2F15624888%2Fguardians-of-the-galaxy-vol-2-mantis-wrong&amp;docid=K7wHCXweFSBEiM&amp;tbnid=cCpHcYKNsJIERM%3A&amp;vet=10ahUKEwjR04Ti-MjXAhUKQCYKHRmrCB0QMwhpKBMwEw..i&amp;w=1310&amp;h=873&amp;bih=662&amp;biw=1366&amp;q=mantis%20marvel&amp;ved=0ahUKEwjR04Ti-MjXAhUKQCYKHRmrCB0QMwhpKBMwEw&amp;iact=mrc&amp;uact=8\" target=\"_blank\">https://www.google.com/imgres?imgurl=htt...</a> the film version?</span></div></span></div>",
            "created":1510981200,
            "id":2416776,
            "title":"Alien Technology"
        },
        "115332222212":{
            "author_id":"therouge",
            "author_name":"shortestgiantess",
            "choices":[
                "Shrinking route",
                "growth"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just as the title to the chapter explains. </span></div></span></div>",
            "created":1526099580,
            "id":2491966,
            "title":"Will Mantis grow, or someone else shrink?"
        },
        "11533222222":{
            "choices":[
                "Alright",
                "Who else is there?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Tigra is a rather small name in the Marvel Universe. Why do we try to fix that?</span></div></span></div>",
            "created":1418792400,
            "id":1904098,
            "title":"No"
        },
        "115332222221":{
            "choices":[
                "Magic Trinket",
                "Science gone wrong",
                "Another way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>OK, now how is Tigra going to become a REALLY big kitty cat?</span></div></span></div>",
            "created":1429592400,
            "id":1967497,
            "title":"Tigra the Titan"
        },
        "1153322222213":{
            "author_id":"thehobbit101",
            "author_name":"Bilbo Baggins",
            "choices":[
                "She uses Pym Particles to grow",
                "She uses Pym Particles to shrink someone"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two other ways Tigra becomes a giantess.</span></div></span></div>",
            "created":1504501200,
            "id":2380293,
            "title":"Another way"
        },
        "115332222222":{
            "author_id":"hydranoid2009",
            "author_name":"hydranoid2009",
            "choices":[
                "Red She Hulk",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Betty Ross? The Red She Hulk: <a rel=\"nofollow\" href=\"http://img3.wikia.nocookie.net/__cb20140518142123/marvelheroicrp/images/7/7e/Red_She-Hulk_%28Earth-616%29.jpg\" target=\"_blank\">http://img3.wikia.nocookie.net/__cb20140...</a></span></div></span></div>",
            "created":1419138000,
            "id":1905690,
            "title":"Red She Hulk"
        },
        "1153322222222":{
            "author_id":"jlaufey45",
            "author_name":"JLaufey45",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Wanda Maximoff?</span></div></span></div>",
            "created":1431579600,
            "id":1977882,
            "title":"Scarlet Witch?"
        },
        "11533222222221":{
            "author_id":"jlaufey45",
            "author_name":"JLaufey45",
            "choices":[
                "Continue",
                "Different Story"
            ],
            "content":"<div class=\"\"><div> <span>Ultron sent Wanda to begin his mission of extermination, by destroying major cities around the world.<br>\r\n<br>\r\nWanda began in New York City, using her magic powers to grow until she was the size of the largest skyscrapers. She began to attack, cruelly crushing all in her path beneath her boots.</span></div></div>",
            "created":1431579600,
            "id":1977883,
            "title":"Yes"
        },
        "11533222222222":{
            "author_id":"chaosdn1",
            "author_name":"Zambolo",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Selene, the black queen?</span></div></span></div>",
            "created":1494997200,
            "id":2321023,
            "title":"No"
        },
        "115332222222221":{
            "author_id":"chaosdn1",
            "author_name":"Zambolo",
            "choices":[
                "Selene at the end of Necrosha",
                "Readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will leave option for other story path</span></div></span></div>",
            "created":1494997200,
            "id":2321026,
            "title":"yes"
        },
        "1153322222222211":{
            "author_id":"chaosdn1",
            "author_name":"Zambolo",
            "choices":[
                "continued",
                "readers choice"
            ],
            "content":"<div class=\"\"><div> <span>(SPOILERS! This scene takes place just after Selene has ascended, where we are given a view of her magnificent booty. X-force V3 issue 25 if you're wondering. She was robbed I tell you.)<br>\r\n<br>\r\n'My children...' Selene's voice echoed, Selene's inner circle looked up in awe of the newly ascended goddess before them, her glowing blue form towered above her palace 'I hunger. Bring them to me, the sacrifices... The ones with power... All of them...<br>\r\n<br>\r\nThe inner circle did as they were told and set out to gather any who had not been absorbed by Selene. Nearby, X-Force were trying to come up with a plan to defeat the new dark goddess. Warpath explains that the worlds magic users cannot be relied upon to help, as they have been affected the worse by Selene's ascension. Warpath proceeds to teach his team the ghostdance so that Selene cannot consume their souls. (ass pull) <br>\r\n<br>\r\nThe inner circle finish collecting the last of the resurrected on Necrosha and Blink teleports them back to the palace, just in time for X-force to barge in and attack them. A fight breaks out between the two groups with the inner circle ending up on the back foot. Warpath confronts his brother ,Thunderbird, who is under Selene's control, Thunderbird unable to directly help his brother has just enough control to inform Warpath that the only way to defeat her is to stab her in the heart with her own knife, which Thunderbird possesses. Warpath manages to break his brothers neck and claim the knife 'It'll be over soon' he says to Thunderbird and begins to make his way towards Selene.<br>\r\n<br>\r\nSelene senses Thunderbirds death 'No' she says as she realises someone has taken her knife. (divergence from comic incoming) Selene looks down at her feet and see's the members of X-force looking up at her and Blink teleporting away with Mortis. Enraged she slams her fist down at them but they manage to evade her (she doesn't shrink down to fight them in this story) 'The X-men. Xavier and his children, fighting to the end, how noble.' Selene's powerful voice boomed down at them 'But the end is here, worms. Your souls are mine now! And I will have them all!</span></div></div>",
            "created":1494997200,
            "id":2321041,
            "title":"Selene at the end of Necrosha"
        },
        "11533222222222111":{
            "author_id":"chaosdn1",
            "author_name":"Zambolo",
            "choices":[
                "Selene's first herald (will continue at some point)",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>Selene realises something is off about X-force when she grabs hold of Angel 'Your soul... I cannot feel it. None of them... Why?' 'Because you are weak' Angel yells at her. Selene snarls, before a grin creeps across her face 'If I cannot feed on your souls, then I will have to be satisfied with burning the flesh off your bodys.' Selene boomed before burning then crushing Angel to a pulp in her hand and letting his ashes fall onto his teammates below. 'You fucking bitch' Domino screamed as she opened fire on the massive goddess 'Do you truly believe that your claws and knives and guns can kill me? I am a goddess!' Selene bellowed as X-force charged forward and began attacking her 'I am beyond this realm! I am beyond human and mutant!' she continued as she crushed Wolfsbane beneath her gigantic boot 'You are nothing to me! I am Selene! I am..' <br>\r\n<br>\r\n'Hey' Selene was interrupted by Warpath who was running towards her, knife in hand 'We get it. You're Selene. Now how about you shut up 'goddess' and get ready to die.' Selene's eyes narrowed as she noticed the knife in his hand 'You are a fool if you think you can stop me now' she roared and stepped back out of what remained of her palace and smashed her arm into it, sending the structure crashing down upon X-force. Selene began laughing in triumph, it boomed across Necrosha, echoing with power.<br>\r\n<br>\r\nShe continued laughing until she saw movement out of the corner of her eye. Looking down she saw the mangled form of X-23 clawing her way out of the rubble 'What do we have here then' she chuckled 'Don't know when to stay down, do you.' Selene reached down and plucked the helpless girl from the ground. X-23 struggled as much as her broken body would allow, but her healing factor wasn't repairing her fast enough 'Cease your pointless struggles, you cannot escape me' Selene said as she brought the tiny girl up to her face, Selene noticed that X-23 was healing. Selene studied the girl in her hand and became curious 'you seem a little young to be running around with assassins, what's your name?' Selene's question was met with stony silence. <br>\r\n<br>\r\nUndeterred, Selene began probing X-23's mind, the young girl tried to resist but couldn't stop the dark goddess from seeing her memory's, her entire life. 'Hmm' Selene smiled 'I have myself a born killer, you should have been part of my inner circle, Laura isn't it?' 'I would never join you' X-23 said, her body sufficently healed, allowing her to talk. 'Why not? you have more in common with my little circle than the X-Men' Selene smiled and then continued 'Speaking of which, it appears I have lost a few followers, no matter. If they could not survive then they were not worthy enough to follow me.' Selene began speaking to her captive again 'You survived when they could not, I think you should replace one of them, don't you?'<br>\r\n<br>\r\nX-23 began squirming again and yelled 'no, i'm nothing like you' 'Such fire, and you're right, you're not like me. I am a goddess and desire your service Laura. Make no mistake, you will join my side and be the first of my heralds.' Selene boomed 'I saw what protects your soul from me Laura, this ghostdance. Now hold still.' <br>\r\nSelene began to bring X-23 closer to her face and to X-23's horror, Selene opened her mouth. X-23 began to squirm and yell furiously which caused a laugh to emanate from Selene's throat. X-23 screamed as she was pushed into Selene's colossal mouth, her small body was wrapped in Selene's powerful tongue and drawn in further. Selene savoured the tiny girl thrashing around inside her mouth 'Mmm' she moaned. Inside Selene's mouth X-23 heard the moan all around her and looked towards its origin, there was just enough light for X-23 to see Selene's massive, powerful throat, that could easily swallow her whole. She began fighting more ferociously, but could do nothing but wait for the dark goddess to devour her.<br>\r\n<br>\r\nTo X-23' surprise, her expected fate never came. Instead she was gradualy massaged by Selene's huge tongue, until finally being deposited back into the goddesses hand. 'I dont..' X-23 sputtered. covered in saliva 'Understand?' Selene boomed 'have you not noticed my little Laura?' It slowly dawned on X-23 what Selene had done as she looked at her skin. The paint was gone, the one thing stopping Selene from devouring her soul has been sucked away. X-23 shook and closed her eyes. This met with laughter from Selene 'Laura, I can feel your soul now, you are mine, now and forever' Selene reached inside X-23, but instead of consuming the young girls soul, she began altering it.</span></div></div>",
            "created":1494997200,
            "id":2321073,
            "title":"continued"
        },
        "115332222222222":{
            "author_id":"jlaufey45",
            "author_name":"JLaufey45",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Nebula?</span></div></span></div>",
            "created":1525928400,
            "id":2491063,
            "title":"Nebula?"
        },
        "1153322222222221":{
            "author_id":"jlaufey45",
            "author_name":"JLaufey45",
            "choices":[
                "Infinity Gauntlet",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Nebula become a giantess or interact with shrunken heroes?</span></div></span></div>",
            "created":1525928400,
            "id":2491064,
            "title":"Nebula"
        },
        "11533222222222211":{
            "author_id":"jlaufey45",
            "author_name":"JLaufey45",
            "choices":[
                "\"Men should all be reduced to specks so that women have all the power for once.\"",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>On the ruins of Titan, the heroes had fought Thanos to a standstill. Nebula saw her chance. She leapt forward, knocking Iron Man aside, and using her cybernetic arm, she delivered a shock to Thanos's hand, loosening his grip on the Infinity Gauntlet. Before the Earth's heroes could react, she herself had pulled the gauntlet from his hand. The power it contained flowed through her and was almost more than she could bear--but she knew she could not stay. With the power of the Space Stone, she let the Gauntlet pull her towards one of the two remaining stones. The Mind Stone.<br>\r\n<br>\r\nIn Wakanda, Shuri had managed to separate Vision's mind from the Infinity Stone which formed the core of his brain. With Wanda fighting in the battle, though, they had no way to destroy it. They wouldn't even get the chance. Nebula appeared in the lab and took the newly-detached Mind Stone from Vision's forehead where it still lay. In another cloud of blue space-warping energy, Nebula vanished again.<br>\r\n<br>\r\nOn Titan, Nebula reappeared in front of Dr. Strange. \"Now, wizard. You will submit to my power and surrender the last Stone.\" Against the power of the Mind Stone, he could not resist and surrendered the stone to her. She had now completed the Infinity Gauntlet, and had the power of a god. But unlike her adoptive father, she did not feel the need to destroy half the universe. Instead, she would make it all her plaything.<br>\r\n<br>\r\nIn an instant, the world returned to the way it was before Thanos began assembling the gauntlet. Those who had fought him and his forces would still remember what had happened as if a dream, but things were back to the way they should be, more or less, but with a cruel and bitter new goddess.<br>\r\n<br>\r\nNow, Nebula thought, what should be her first decree as the new goddess of the universe?</span></div></div>",
            "created":1525938300,
            "id":2491073,
            "title":"Infinity Gauntlet"
        },
        "12":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "Wonder Woman",
                "Supergirl",
                "Batgirl",
                "Lois Lane/ not a hero",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which do you want</span></div></span></div>",
            "created":1217307600,
            "id":562566,
            "title":"DC"
        },
        "121":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "  shrinks Batman an Superman and goes home",
                "  Shrinks people and justice leagers in the city ",
                "  becomes a giant a goes on a rampage"
            ],
            "content":"<div class=\"\"><div> <span>It was an average day for Wonder Woman, things were going pretty slow. So far that day she had only stoped two bank roberies, foiled an armor car robery, busted a drug smugling ring, beat up 50 arms dealers, saved an oil tanker from sinking, and stopped a building from burning down, all before lunch. That afternoon she was flying over the docks and saw that a boat with different jewels was being held up. Wonder Woman flew closer and saw that Superman was trapped by a huge chunk of kryptonite and Batman was unconscious. Wonder Woman flew down and was hit from behind by an energy blast. Wonder Woman turns around and sees a red headed woman in a purple harem outfit with a cape and knee high purple boots holding a glowing septer<br>\r\n\"Who are you, the strip joints are that way\" said wonder woman pointing towords the city.<br>\r\n\"I am Acitore, I am an all powerful sorceress who can grant any wones greatest desire.\"<br>\r\nWonder Woman looks behind her and sees a bunch of goons loading crates in a truck.<br>\r\n\"You want you to grant my deepst desire, fine I \"desire\" you to surrender.\"<br>\r\nAcitore shook her head and said \"No your desire is to have absolute power over everything in the world of men and with this spell you will get it and leave me alone.\" As she said that an energy blast left her staff and hit Wonder Woman in the breast. Wonder Woman did not know what to think, until suddenly she was filled with a great lust <br>\r\n\"Umm,thank you Acitore I'll leave you to your buisness\" she said in a daze.<br>\r\nWait\" Actiore said \"I must tell you of your new powers, you already feel horny thats good, but now you can change the size of anything in the world including yourself, Now I must be off have fun\" with that her and her goons dissapeared<br>\r\nLeaving Superman and Batman alone with Wonder Woman.<br>\r\n<br>\r\nWhat does Wonder Woman do?<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1217307600,
            "id":562574,
            "title":"Wonder Woman"
        },
        "1211":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "put superman in her boot ",
                "put him in her cavernous pussy",
                "other "
            ],
            "content":"<div class=\"\"><div> <span>Wonder Woman decides to use Superman and Batman to satisfy her cravings. She concentrates and shinks Batman and Superman to 2\". Both of them regained consciousness and saw the bilboard sized face of their capotor <br>\r\n\"what hapened\" they both asked and Wonder Woman told them everything including the fact that she was now a horney evil monster only concerned with satisfying her cravings.<br>\r\n\"Now what to do with you two\" she thought for a moment\"Superman willbe the most trouble so i need to put you somewhere special\" she then broke off a small peice of kryptonite <br>\r\n\"First Ill deel with you Batman\" with that she put batman deep in her ample cleavage, then she pressed and rubbed her breast togerther with batman in between them<br>\r\n\"Now to you Superman\"<br>\r\nwhatdoes she do?<br>\r\n</span></div></div>",
            "created":1217307600,
            "id":562575,
            "title":"Wonder Womans new toys"
        },
        "12111":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "Batman escaped her breast !",
                "Find some people to shrink"
            ],
            "content":"<div class=\"\"><div> <span>\" And you...\" Wonderwoman said while grabbing Superman in her hand. \" I want you near my foot\". She then just slide him right<br>\r\nin her boot, and made sure to have him under her foot so he wouldn't be able to fly away. He was now under her arch, trying to hit <br>\r\nher but this was useless.<br>\r\n\"You'd better get used to the smell, because you won't leave that place. \" She said. The shrunken man of steel never stopped to use<br>\r\nall his power with hope to escape, but it was like a massage for Wonderwoman who enjoyed it.<br>\r\n<br>\r\n\" All right now what to do ? \"<br>\r\n<br>\r\n</span></div></div>",
            "created":1460782800,
            "id":2134018,
            "title":"put superman in her boot "
        },
        "12112":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "option 1",
                "option 2 "
            ],
            "content":"<div class=\"\"><div> <span>Wonder Woman thought for a moment then decided that she new what to do.<br>\r\n\"I KNOW JUST WHAT I AM GOING TO DO WITH YOU SUPERMAN\" Superman looked at his giant friend in horror as she slowly moved the hand he was in down her beautiful body while the other opened her pants. The next thing Superman saw was a giant vagina. Wonder Woman spread her lips and shoved Superman as far into her as she could until he touched the cervix. Wonder Woman now ready flew home.<br>\r\n<br>\r\nSuperman now has two options <br>\r\n1.He could wait were he is up against the cervix of the hottest woman in the world from fear of hurting his friend.<br>\r\n2.Or he tries to fight his way which could hurt Wonder Woman or give her an orgasm.<br>\r\n<br>\r\nSo name your poison...................................................<br>\r\n</span></div></div>",
            "created":1217307600,
            "id":562576,
            "title":"put him in her cavernous pussy"
        },
        "121121":{
            "author_id":"cocreator",
            "author_name":"coCreator",
            "choices":[
                "Wonderwoman sits back and enjoys her massage.",
                "Wonderwoman has a better idea."
            ],
            "content":"<div class=\"\"><div> <span>Superman decides that patience would be preferable to hurting his giant confused friend--plus, it wasn't so bad in here...in fact, he was beginning to like it.  Wonder woman was never the most passionate person, and maybe he could use this opportunity to get to know her better.  As he even had these beginnings of an erotic thought, his uniform bottom seemed to undergo its own shrinkage.  <br>\r\n\"This isn't like me at all.\"  Superman thought.  \"I always have pure thoughts.\"<br>\r\nHe sat down, leaning against the wall...\"Oh, that's got to be her G-spot,\" he noticed.  \"I wonder what a little massage from here would do?\" he wondered out loud.  \"I really shouldn't...\"<br>\r\nHe started moving his hands around, and around the wall of Wonder woman's luxurious vagina.  He opened his mouth, and began to suck the center of her G spot...<br>\r\nUp in her Bustier, batman had regained consciousness and was surveying his situation.  If Wonder woman weren't so damn hot, he could just leave now with his baterang.  He instead finds himself drawn deeper and deeper by her ample breasts.  He slowly makes his way around Diana's curvaceous giant breast until he spied his prize.  \"Holy Giant aereola,\" he said out loud.<br>\r\n<br>\r\nWonder woman was almost home when she began to feel a sensation of movement in her clothing.  <br>\r\nHer two little toys began to stir in their new prisons.  \"My friends have finally given in to my womanly power,\" she thought to herself.  What shall I do with them?<br>\r\n</span></div></div>",
            "created":1250226000,
            "id":743946,
            "title":"Sit tight inside of Wonderwoman."
        },
        "1211212":{
            "author_id":"cocreator",
            "author_name":"coCreator",
            "choices":[
                "Just stay there and see what happens",
                "Try to escape when he turns long again"
            ],
            "content":"<div class=\"\"><div> <span>\"I know what to do!\"<br>\r\nShe feels superman begin to massage her G spot.  \"I can do better than that!\"  <br>\r\nSuddenly, Superman begins to grow...and grow...until he reaches the walls of her pussy...and then he shrinks again.<br>\r\n\"Great Scott!\" says superman, \"What's happening to me?\"<br>\r\nThen he realized, his size was pulsing up and down!  <br>\r\n<br>\r\nWonderwoman could feel superman grow and ebb, all in her ecstacy.  She moaned, and cryed out.<br>\r\n<br>\r\nSuperman could feel wonderwoman moving toward orgasm.  What should he do?<br>\r\n<br>\r\n</span></div></div>",
            "created":1250226000,
            "id":743947,
            "title":"Wonderwoman has a better idea."
        },
        "1213":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                " bath in the bay and be a nude giantess playing with the boats ",
                "other heros attack her",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>Wonder woman decides to use her power to grow herself and do whatever she wants to the city. She grows until she's almost as tall as the tallaest skyscraper. All the people were the size of ants to her. So the worlds most sexy crime fighter is now several hundred feet tall. She decides to take a walk in the city. <br>\r\nWonder Woman enjoyed the sight of her giant knee high boots crushing those beneath her. \"Now I know why Giganta enjoys this.\" Wonder woman thought to herself. \" I AM YOUR NEW MASTER YOU WILL DO AS I COMMAND\" At her statement everyone in metropolis ran away terrified. \"SINCE YOU ARE NOT OBEYING ME I GUESS I NEED TO TEACH YOU ALL A LESSON\" she shouted. And with that she grew more until the tallest skyscrapers was only about nine inches high. <br>\r\nShe walks through the city until she sees the building she wants the new Queen/Wayne industries tower.<br>\r\n<br>\r\nThis building is made of the best materials, its supposed to be nearly indestructable from any disaster. It looked like a tapered cylinder and contained over 500,000 employees all who were panicking from the tremors caused by the approaching beauty. <br>\r\n<br>\r\nWonder Woman stood over it so that it was directly between her legs she then removed hher pants and slowly lowered her wet dripping pussy onto the building. woder woman moaned and shuddered as she slowly raised and lowere herself on the tower.<br>\r\n<br>\r\nInside the tower people were panicking many were at the windows looking out in horror at he inside of Wonder Womans vagina as it raised up and down. The light from the building illuminated the pink pulsating flesh in her vagina as she moved up and down with increasing speed. suddenly Wonder woman stopped all the people were releaved un til they saw two giant hands grab on to the tower. then suddenly the felt a flying sensation aand a great shock as the entire building was ripped frm the streets below.<br>\r\n<br>\r\nWonder Woman now had the tower in her hands a laid on the ground. Her giantbut alone crushed several blocks as she laid down. Wonder woman goy a good grip on the building turned it upside down and inserted int into her cavernous pussy.<br>\r\n<br>\r\nIn the tower all was choas as people and furniture were tossed about as Wonder Woman rammed the building into her self harder, faster, and deeper.<br>\r\n<br>\r\nWonder Woman felt she was near her climax ad shoved the building all the was to her cervix and the best orgasms of her life her throws of passion demolishing a fifth of the city.<br>\r\nWhen she was done she took the building out and saw that it was warped in some places but still intact so she grew some more and slowly put the building into her mouth<br>\r\n<br>\r\nInside the building the people who weren't dead or unconsious watched inhorrer as they wereplace in her mouth fearing what would come next knowing that if they were swalloed that neither the building or themselves would survive.<br>\r\n<br>\r\nWonder Woman put the building that was now an inch to her in der mouth and slowly swallowed it whole. \"WELL NOW WHAT SHOULD I DO?\" she thought to herself.<br>\r\n</span></div></div>",
            "created":1217307600,
            "id":562578,
            "title":"  Giant Wonder Woman"
        },
        "12131":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "orders the people in he boat on her nipple to pleasure her",
                "torture the people in her navel"
            ],
            "content":"<div class=\"\"><div> <span>Wonder Woman looked around and saw how dirty she was and decided to go to the bay. <br>\r\n<br>\r\n(Hawk's eye view-- from here on out the story will be narrated by the narrator from the classic show the Superfriends)<br>\r\n<br>\r\nMeanwhile at the bay.. the port was bustleing with ships  attempting to escape the city with their cargos of people, including two Carnival cruise ships. As Wonder Woman neared the bay all the people began to panic. <br>\r\n<br>\r\nWonder woman saw that she was to big to get in so she shrunk to a more reasonable size. she shrunk to were she could get in the bay but all the boats were still toy size. She laid back in the water and moved her breast under the nearest cruise ship. She grew  until her breast and nipple had pushed the boat out of the water and it was stuck to her nipple.<br>\r\n<br>\r\nShe saw as she looked down her body that there was water puddled in her navel along with some small boats what soes she do?</span></div></div>",
            "created":1219208400,
            "id":572492,
            "title":"toy boats"
        },
        "12132":{
            "author_id":"papsdatank",
            "author_name":"Tank",
            "choices":[
                "Put him between her toes",
                "Put him in her pussy"
            ],
            "content":"<div class=\"\"><div> <span>While Wonder Woman was terrorizing the town, Superman comes from out of nowhere and lands a mighty blow on the giantess' jaw, Wonder Woman stumbles back and holds her jaw in pain, though she is roughly 2 miles tall she's it's still painful to fight the Man of Steel. Superman then uses heat vision on her gigantic eyes, Wonder Woman stumbles to the ground, Superman says \"I don't care how big you are, you still can't beat me!\" Wonder Woman makes a desperate swipe and grabs the Man of Steel, \"what should I do with you?\" the nude giantess said to Superman. Does she...</span></div></div>",
            "created":1235710800,
            "id":653224,
            "title":"other heros attack her"
        },
        "121321":{
            "choices":[
                "After the 2 heroes die from her sweaty feet, she asks the town for a foot rub.",
                "She shrinks to a 5x the size of humans and tramples them to death."
            ],
            "content":"<div class=\"\"><div> <span>\"I have decided that I will put you in my sweaty, stinky toes,\" said Wonder Woman. She put them in her sock in the toe area where her feet sweats and, of course, stinks the most. Then she put on her sock and her boots. She left tham there to suffocate from toxic foot air, unbearable Wonder Woman foot stench, and tons of sweat while she continues her rampage.</span></div></div>",
            "created":1248152400,
            "id":729553,
            "title":"Don't Mess With Wonder Woman's Stinky, Sweaty Feet"
        },
        "1213211":{
            "choices":[
                "The citizens massage her feet.",
                "The citizens are too terrified to move a muscle so she lashes out in anger"
            ],
            "content":"<div class=\"\"><div> <span>The moisture levels in her sock were rising rapidly. Soon enough superman could no longer breathe even air, only her horrible stench coming from her foot. Super punches and struggles as hard as he can against her massive toes but this only succeeds in tickling wonder woman. She giggles and stomps her foot down hard on the ground to get superman to stop, but she underestimates her gigantic size difference and smushes his legs completely. Now, too weak to move, superman succumbs to her enormity and lays back. As she continues walking the sweat completely replaces the air in between her toes and he drounds on it. Wonder woman notices the lack of a struggle, \"Hmm, the little guy must have died in there, what a shame.\" then she pinches her toes together completely obliterating his body. His goey remains flow down the sides of her toes but she doesn't even feel it. Now that she's done with her punishment she notices that all the stomping around the city is absolutely killing her feet. So she plops down, crushing thousands with her enormous ass, and takes off her boots and socks. To the denizens of metropolis it's like someone released a nuclear bomb of stench on their town. She carelessly flings her soaking wet socks away and captures a few hundred underneath, drowning them in stinky foot sweat. But right before she starts rubbing her feet she comes up with an evil plan. \"All citizens of metropolis, I demand you to massage my massive feet until I deem you complete. And if I don't think you're doing a good job, I'll squish you, or perhaps worse.\" she says with a devilish grin.</span></div></div>",
            "created":1277355600,
            "id":905499,
            "title":"After the 2 heroes die from her sweaty feet, sh..."
        },
        "12132112":{
            "author_id":"jjuenger",
            "author_name":"jjuenger",
            "choices":[
                "She surveys the damage",
                "She feels horny",
                "She finds another city",
                "More heroes arrive",
                "Here comes Giganta"
            ],
            "content":"<div class=\"\"><div> <span>As Wonder Woman sits on the city and waits for her foot massage, the surviving citizens of Metropolis continue to stand in their spots. They can hardly believe that she would be capable of anything so evil and selfish, let alone anything of this magnitude.<br>\r\nUnfortunately for them, she has little patience for their collective confusion. In no time, she stands back to her full two mile height and looks at the remains of the city with her hands on her hips.<br>\r\n\"It seems to me that my subjects are in no mood to honor the whims of their goddess,\" she says angrily, her voice echoing for miles. \"Well, I guess that means you don't deserve to live among me.\"<br>\r\nIt was with that statement that she lifts her bare foot above an entire neighborhood and slams it as hard as she can. This one simple stomp creates a deep crater that obliterated much of the remaining city, as well as killing most of its population, and an earthquake that could be felt for hundreds of miles, leveling much of what stood within 75 miles.<br>\r\nAll of this impressed the gargantuan Amazon to no end. \"I guess I am a true goddess after all,\" she sneers as she picks up her boots, puts them back on, and ponders her next move.</span></div></div>",
            "created":1589935560,
            "id":2838258,
            "title":"Force of Nature"
        },
        "121321125":{
            "author_id":"jjuenger",
            "author_name":"jjuenger",
            "choices":[
                "Wonder Woman fights her",
                "Wonder Woman gives in",
                "Circe shows up",
                "More heroes arrive",
                "They get their abilities taken away"
            ],
            "content":"<div class=\"\"><div> <span>\"And I thought I was the only one who can have fun at this size.\"<br>\r\nWonder Woman smiles as she recognizes the voice behind her. \"Leopard print or pink dress, Big Red?\"<br>\r\n\"I figured the occasion called for the leopard print,\" Giganta says as she walks up to her, starting to look her up and down as she walks around her. \"I must say that being evil seems to suit you. I couldn't have done a better job myself. I never tried this because I never wanted to test my limits. But you, you were willing to go all in the instant you got this talent.\"<br>\r\n\"You're interested in teaming up, aren't you?\" Wonder Woman asks.<br>\r\n\"I wouldn't be here if I wasn't,\" Giganta says frankly. \"Think about it. You already dispatched our biggest concern. Two of us can make a point so much more effectively. Besides, I know what side effects come with this gift, and who else can satisfy you now?\" She proves this point by, while behind her, she reaches around with one arm and rubs her breast while reaching for her crotch with the other, starting to kiss her neck.</span></div></div>",
            "created":1589977560,
            "id":2838437,
            "title":"Giganta From Behind"
        },
        "1213211252":{
            "author_id":"jjuenger",
            "author_name":"jjuenger",
            "choices":[
                "They have more sex",
                "They rampage together",
                "Follow Wonder Woman separately",
                "Follow Giganta separately",
                "Shrink down some"
            ],
            "content":"<div class=\"\"><div> <span>Wonder Woman knew that Giganta was right on all counts. She became the biggest creature ever the first chance she got; she obliterated a wide area with a simple, petulant movement; and she knew that nothing short of a redwood would be able to satisfy her. It was with this in mind that she puts one hand on top of the crotch hand while pulling Giganta closely with the free one.<br>\r\n\"Lay down for me, Diana\" Giganta whispers in her ear. \"I want to seal this deal.\"<br>\r\nSure enough, Wonder Woman lays on the ground, flattening some of the topography she had already ruined. Giganta then gets on top of her and kisses her deeply. They take off each others' outfits, tracing their bodies with their fingertips as they did so.<br>\r\nGiganta then starts kissing down Diana's body, taking care to lick around the sensitive, erect nipples. She keeps her hands on the breasts as she kisses down her abdomen. After focusing on her navel for a while, she kisses down to the outer edges of her vagina, licking its edges like margarita salt.<br>\r\nShe then plunges her tongue deep into her vagina, causing Diana to gasp involuntarily. Diana wraps her legs around Giganta's chest as she starts bucking her hips on Giganta's face. This prompts Giganta to lap on her G-spot harder. Diana intentionally holds back her orgasm to prolong the feeling, pulling Giganta's hair when she finally cums hard in her mouth.<br>\r\nGiganta licks the juices before she looks up and smiles. \"Since we're so close, call me Doris.\"</span></div></div>",
            "created":1590202560,
            "id":2839757,
            "title":"Strange Bedfellows"
        },
        "12132112521":{
            "author_id":"jjuenger",
            "author_name":"jjuenger",
            "choices":[
                "They rampage",
                "They look for more heroes",
                "They see the military",
                "Acitore shows up",
                "They want more sex"
            ],
            "content":"<div class=\"\"><div> <span>Wonder Woman looks at Giganta, her orgasm face still on her. \"Doris, I have never experienced anything like that in my life. It just felt so damn right.\"<br>\r\n\"That's because you have been suppressing your true self for so long,\" Doris says. \"You were trained to be this righteous type. Even the Amazons have been keeping you down. Acitore saw a lot of potential in you. She knew that you could be so much more.\"<br>\r\nThe mere thought of being so much more was enough to bring back Diana's carnal craving. She leaps forward, smacks into Doris, takes her to the ground, and lands on top of her. She begins kissing Doris wildly as she places her vulva on top of Doris's.<br>\r\nThis causes Doris to gasp loudly, even before Diana starts rubbing them. Doris wraps her legs around Diana's waist as she returns the movements. They kiss each other deeply as their breasts rub against each other. They trace their bodies with their fingertips. They then kiss each others' necks as they smack each others' asses. All of this causes them to come to orgasm in a hurry.<br>\r\nBoth of the women then look in each others' eyes, panting hard as they smile at each other.</span></div></div>",
            "created":1590370680,
            "id":2840596,
            "title":"Super Sex"
        },
        "121321125214":{
            "author_id":"jjuenger",
            "author_name":"jjuenger",
            "choices":[
                "Both accept",
                "Diana accepts",
                "Doris accepts",
                "Both deny",
                "They get distracted"
            ],
            "content":"<div class=\"\"><div> <span>It is in this post-coital bliss that both of them start to hear maniacal laughing around them. Both of them look around in their position, but see nothing. Each of them then get to their feet. Only then does the source of the laughter materializes.<br>\r\n\"I knew that both of you wanted to have a little bit of fun once you caught up with each other,\" Acitore says as she walks up to them, looking both of them up and down. \"Doris, I must admit that your musculature really suits you. All that rampaging really gives you a tight ass.<br>\r\n\"As for you, Diana, I never thought that you would take such a liking to the side effects so quickly. Quite frankly, you always struck me as something of a sexy prude.\"<br>\r\n\"Trying to butter us up for something, Acitore?\" Diana asks.<br>\r\n\"Only a new Legion of Doom,\" Acitore says. \"A superior version of the old idea. No one reports to anyone. We each have our own place to conquer and rule with iron fists. Think about it. There are so many women that you have fought over the years, Diana. All of them must be chomping at the bit for this opportunity.\"<br>\r\n\"What's the catch?\" Doris asks.<br>\r\n\"Autonomy,\" Acitore says. \"You leave me alone, and I'll leave you alone. What do you two say?\"</span></div></div>",
            "created":1598916480,
            "id":2895260,
            "title":"The New Legion"
        },
        "1213211252141":{
            "author_id":"jjuenger",
            "author_name":"jjuenger",
            "choices":[
                "Circe",
                "Cheetah",
                "Baroness Paula von Gunther",
                "Queen Clea",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>\"That sounds reasonable to me,\" Doris says. \"How about you, Wonder Wrecker?\"<br>\r\nDiana looks at both of them before looking at the changed topography around them. The fact that she had a hand in this, combined with the feeling of ecstasy she just experienced, really made this no contest. She looks at Doris again before looking back at Acitore.<br>\r\n\"As long as I can get my needs fulfilled any time I want, I'm in,\" Diana says.<br>\r\n\"Perfect,\" Acitore says. \"Let's see who we can find to join our group, provided anyone survived anything that happened here.\"<br>\r\nIt turns out that they didn't have to walk far, even by their gargantuan standards. They see that someone has found them and is standing at their feet, yearning for a piece of the action. Who is it?</span></div></div>",
            "created":1599180300,
            "id":2897011,
            "title":"Seeking the Newest Member"
        },
        "122":{
            "author_id":"crsh0",
            "author_name":"rickerd",
            "choices":[
                "batman",
                "superman",
                "you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Supergirl is flying around new york city looking at all the buildings and all when she is attacked by a monster.she wins and while the monster is fleeing it drops a shrink ray.Supergirl is pondering who to use this on.who should she use it on?</span></div></span></div>",
            "created":1265691600,
            "id":833382,
            "title":"who she shrinks?"
        },
        "1221":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "Use her super ear power ",
                "Use her vision power"
            ],
            "content":"<div class=\"\"><div> <span>Supergirl waited the night, and turned on the Bat light on the roof to call him. Once he arrived, he was surprised to see Supergirl.<br>\r\n<br>\r\n\" What are you doing ? Why did you call me ? \"<br>\r\n<br>\r\n\" Well i just got this gun from a monster, and realized this could be a way to keep you away from my cousin. I always thought i could <br>\r\nspend more time with him if you were not around.\" She then pointed the gun at him and shrunk him to the size of an ant.<br>\r\n<br>\r\n\" Why did you do this ?! Did you get infecte by a red kryptonite or something ? Grow me back ! \" Batman shouted.<br>\r\n<br>\r\n\" Or else what ? \" She replied, putting her fists on her thighs <br>\r\n<br>\r\nThe Bat didn't know what to say, so he just ran away.  <br>\r\n<br>\r\n\"Oh come one you really think you can escape a giant Kryptonian ? \" She giggled. But as she did that, she lost her focus on him for a second, and realized<br>\r\nhe just disappeared from her sight. <br>\r\n<br>\r\n\" Damn where is he ? Well you can't be so far from me anyway. I can see some shadows parts near the walls, he's probably hiding in there.\"</span></div></div>",
            "created":1460782800,
            "id":2134249,
            "title":"batman"
        },
        "1223":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "She sets the switch to Grow on herself",
                "Shrinks you down to puny size to have \" fun\""
            ],
            "content":"<div class=\"\"><div> <span>We are using the Supergirl from Superman TAS so the mighty Girl Of Steel spots you walking along the street minding your own business when she calls over to you \"Hey you! Can you come here for a sec?\" you upon seeing the mighty pretty teenaged super heroine wanting your help jump at the chance \"Sure Supergirl I'll do anything! What do you need help with?\" she smiles mischievously \"Oh you'll find out in a minute or so just stand there for a sec I got something I want to show you let me see here...\" she examines the shrink device \"Oh cool there's a Grow setting on it too!\" looking at you she gets a wild idea \"Hmm looks like I can have some major fun with him but how shall I start?\" </span></div></div>",
            "created":1386046800,
            "id":1702616,
            "title":"you"
        },
        "12231":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "She stuffs you in her breasts",
                "Shoves you down her shorts"
            ],
            "content":"<div class=\"\"><div> <span>You ask again getting impatient \"Okay what's the surprise...What? Holy s**t!\" you scream out as Supergirl's body is rapidly increasing right in front of your eyes bigger and bigger she is growing fortunately or unfortunately there's no one else around perhaps they saw what was happening and fled ahead of time in any case you stare up in horror at the 50 foot sized Kara grinning at you towering over the city \"Now for that surprise I was talking about earlier!\" her loud voice booms out causing department store windows to explode you start backing up but in one swift movement she grabs hold of your tiny form bringing you up to her huge pretty face you stare into her baby blues \"What are you going to do to me?\" Supergirl grins \"I've been wondering about that for a while hmmm what can I do to you? Ohh here's what I can do...\" then </span></div></div>",
            "created":1386219600,
            "id":1703624,
            "title":"She sets the switch to Grow on herself"
        },
        "122312":{
            "author_id":"bibcuddler",
            "author_name":"Curso",
            "choices":[
                "Vagina",
                "Butt"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When she shoves you in, she shoves you to her...</span></div></span></div>",
            "created":1433912400,
            "id":1990361,
            "title":"Shoves you down her shorts"
        },
        "1223121":{
            "author_id":"bibcuddler",
            "author_name":"Curso",
            "choices":[
                "Grabs you by your legs",
                " Snaps her panties shut"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Suddenly Supergirl shoves you toward the front of her panties! When she sees that you are entirely in she...</span></div></span></div>",
            "created":1433912400,
            "id":1990363,
            "title":"Vagina"
        },
        "12231211":{
            "author_id":"bibcuddler",
            "author_name":"Curso",
            "choices":[
                "She takes you out",
                "Something else happens"
            ],
            "content":"<div class=\"\"><div> <span>Supergirl then grabs you by your legs and shoves you into her vagina! She pushes you in and out slowly! You hear her muffle moans and she starts moving faster and faster. You try screaming but your vibrations make her nearly scream from pleasure! And that is when...</span></div></div>",
            "created":1433912400,
            "id":1990367,
            "title":"Grabs you by your legs"
        },
        "122312111":{
            "choices":[
                "I had a snack!",
                "You get to know the back side"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Suddenly her hand retracts and she raises you to her face. Her massive tongue slides out and she licks you clean, leaving you coated in her warm drool. She grins and says \"I think it's time...\"</span></div></span></div>",
            "created":1479531600,
            "id":2239167,
            "title":"She takes you out"
        },
        "12231212":{
            "author_id":"bibcuddler",
            "author_name":"Curso",
            "choices":[
                "She continues and you hold on",
                "Your arms collapse inside"
            ],
            "content":"<div class=\"\"><div> <span>Let's go of her panties. You are pressed up inside her vagina. But you grab onto the edges so you look like a \"x\" and you stay right on top of the lips. Suddenly from the outside you feel Supergirl thrusting you against something. It's a building! That is when you hear moaning because she is pressing you in and out!</span></div></div>",
            "created":1433912400,
            "id":1990372,
            "title":" Snaps her panties shut"
        },
        "12232":{
            "author_id":"lt.gymsocks",
            "author_name":"Lt.gymsocks",
            "choices":[
                "Takes off her boots",
                "Puts you in a jar"
            ],
            "content":"<div class=\"\"><div> <span>She aims the device at you and you begin to shrink! You can't believe your eyes as you shrink to about 2 inches tall. Supergirl picks you up and tells you \"We are gonna have some fun when I get home.\" Your now worried as you are flung forward a an increasing rate. She's flying! She arrives at her apartment and...</span></div></div>",
            "created":1477285200,
            "id":2227894,
            "title":"Shrinks you down to puny size to have \" fun..."
        },
        "122321":{
            "author_id":"lt.gymsocks",
            "author_name":"Lt.gymsocks",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She removes her boots as an increasing foot odor appears she puts her feet on the table while you quiver in fear. She asks you, \"Do you like my feet?\" </span></div></span></div>",
            "created":1477285200,
            "id":2227895,
            "title":"Takes off her boots"
        },
        "1223211":{
            "author_id":"lt.gymsocks",
            "author_name":"Lt.gymsocks",
            "choices":[
                "You wake up at her feet",
                "You wake up in her cleavage "
            ],
            "content":"<div class=\"\"><div> <span>You told her you like her feet out of fear and she said, \"Good can you massage them? They get really sore from fighting crime.\" You begin to massage the pair of giant soles in front of you as best as you can, so you won't be squashed obviously. You keep massaging the big pair of feet in front of you until you are pushed against them. Super girl laughed seeing you struggle against her sweaty feet, waiting for air then you pass out.</span></div></div>",
            "created":1477285200,
            "id":2227900,
            "title":"Yes"
        },
        "12232111":{
            "author_id":"lt.gymsocks",
            "author_name":"Lt.gymsocks",
            "choices":[
                "She tosses you in her boot",
                "She has second thoughts"
            ],
            "content":"<div class=\"\"><div> <span>You are surprised to be waking up, thinking you died. You looked around you. It was dark, with little light entering. It smelled of sweat, and the floor was like carpet, but huge carpet. Eventually a blast of light enters the room. The roof opens up for you to find Supergirl towering over you she said, \"You finally woke up! I thought I killed you!\" You felt for an exit but all you felt were fleshy walls. Turns out Supergirl curled her feet and put you under them. Soon her feet closed, and the roof went down on you. You were being crushed by Supergirl. You couldn't move your limbs as you were slowly crushed under Supergirl's feet. Before you passed out, Supergirl's phone rang. There was a crime alert. Supergirl shrugged and told you, \" I need to go. What ax I do with you? Oh, I know, I'll put you in my boot!\"</span></div></div>",
            "created":1477285200,
            "id":2227911,
            "title":"You wake up at her feet"
        },
        "122321111":{
            "author_id":"lt.gymsocks",
            "author_name":"Lt.gymsocks",
            "content":"<div class=\"\"><div> <span>You are thrown into her boot and she sticks her foot in. You try to run away but your face first to her foot. You hope this is all a dream when she flies away. You feel pushed away from her foot. She needs to get to this crime fast! You here a voice telling you to lick her foot, probably Supergirl, so you do. Her foot tasted better than expected. The sweat too. As you enjoyed licking her foot, Supergirl saved some people from a house fire she was given an award when she was finished, this was the only time she touched the ground, you body was not expecting the weight, and you were crushed, you died licking her feet.</span></div></div>",
            "created":1477285200,
            "id":2227917,
            "title":"She tosses you in her boot"
        },
        "1223212":{
            "author_id":"lt.gymsocks",
            "author_name":"Lt.gymsocks",
            "choices":[
                "The end",
                "The end"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You tell her you don't like her feet and she gets mad. \"Well, we'll see what you will be soon enough!\" She then uses her heat vision to turn you to dust.</span></div></span></div>",
            "created":1477285200,
            "id":2227897,
            "title":"No"
        },
        "122322":{
            "choices":[
                "She takes you out and you see her giant pussy",
                "She invites her female friends over "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She sets the gun on shrink and shoots you. Before you know whats happening, she shoves you into the jar. What happens next?</span></div></span></div>",
            "created":1488171600,
            "id":2283024,
            "title":"Puts you in a jar"
        },
        "123":{
            "author_id":"imbatjammed",
            "author_name":"imbatjam",
            "choices":[
                "25 ft",
                "50 ft",
                "100 ft"
            ],
            "content":"<div class=\"\"><div> <span>After finishing a drop-off at Arkham, Batgirl found a strange remote in Hugo Strange's cell. Taking it away from him fearing what he could do with it, she didn't see the smile on his face.<br>\r\n<br>\r\nAfter taking the remote, Batgirl began to tamper with it on a building not far off from the Batcave.<br>\r\nSuddenly, the remote began to shake violently, as did Batgirl. Finally the shaking ended with Barbra getting a<br>\r\nfeeling of wooziness. She shut her eyes and looked down at the street _ feet below.</span></div></div>",
            "created":1385960400,
            "id":1702406,
            "title":"Batgirl"
        },
        "1232":{
            "author_id":"imbatjammed",
            "author_name":"imbatjam",
            "choices":[
                "Gotham police attack",
                "Nightwing comes",
                "Who is that in the distance?"
            ],
            "content":"<div class=\"\"><div> <span>After realizing what had happend, Barbra, who was now in only her bra and panties rather than her entire costume, was actually overjoyed.<br>\r\n\"Finally! I've been waiting for a chapter to be added for so long!\" She gleamed.<br>\r\n<br>\r\nBarbra began to simply crush cars, pick up people and eat them, and laugh at the people running away from her.<br>\r\n\"Run bugs! Run from your goddess!\" She said after slaming her ass into a halfway house, killing several people from the crushing and falling debris.<br>\r\nSuddenly, she spotted a familer black car with two people.<br>\r\n\"Bruce and Tim have come to get me huh?\" Well 3 is a company.\" She smiled.<br>\r\n<br>\r\nAfter getting out of the car, before they could even react Batman and Robin were picked up, and thrown into Barbras panties.<br>\r\n\"Ohh this feels so good. Now if only Dick were here...\" She said pushing the pair even further up her vagina.<br>\r\n</span></div></div>",
            "created":1385960400,
            "id":1702410,
            "title":"Yay"
        },
        "12323":{
            "author_id":"imbatjammed",
            "author_name":"imbatjam",
            "choices":[
                "Supergirl",
                "Miss Martian"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Its... _____ at 50 ft as well!</span></div></span></div>",
            "created":1385960400,
            "id":1702415,
            "title":"Who is that in the distance?"
        },
        "123232":{
            "author_id":"imbatjammed",
            "author_name":"imbatjam",
            "choices":[
                "The Justice League, headed by Superman comes for them"
            ],
            "content":"<div class=\"\"><div> <span>Miss Martian had just touched down on Earth for the first time in Gotham bay. However, due to not knowing how large the natives were, she used her shape shifting to become the exact height of the first being she saw, who just happend to be Barbra.<br>\r\n<br>\r\n\"What are you doing?\" Miss Martian asked.<br>\r\n\"Having fun, just like a goddess should.\" Barbra replied.<br>\r\nTo both her delight, and horror Miss Martian watched as Barbra took robin from her panties, and swallowed him whole. She then began crushing the frantic people on the streets.<br>\r\n\"Mind if I join in?\" <br>\r\n\"Sure\"!<br>\r\n<br>\r\nThe pact was soon sealed in the blood of the Gotham populace. Miss Martian, not knowing what to do simply followed Barbras lead. Eating people or \"morsals\" as she soon called them, throwing them down her panties for pleasure, crushing them with her feet, ass, and breasts. For them, it was heaven. For the citizens, a holocaust.<br>\r\n<br>\r\n\"Is that natural?\" Miss Martian said pointing to many flying beings coming towards them.<br>\r\n\"Yup, and it means were in for a fight.\" Barbra said as...</span></div></div>",
            "created":1385960400,
            "id":1702421,
            "title":"Miss Martian"
        },
        "124":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Giant Lois",
                "Tiny Lois"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay do you want a skyscraper Lois or a shrunken reporter?</span></div></span></div>",
            "created":1391317200,
            "id":1737252,
            "title":"Lois Lane/ not a hero"
        },
        "1241":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "By way of Mr. Mxyzptlk he turns her into a giant Menace for Metropolis! ",
                "Is experimented on by Lex Luthor to create a evil Giantess "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay how though? Here in the DC Universe there are multiple ways to make a  giantess Lois Lane! </span></div></span></div>",
            "created":1457067600,
            "id":2112937,
            "title":"Giant Lois"
        },
        "125":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "the Black Canary",
                "Starfire",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>( this one was added by ------eddied)<br>\r\n<br>\r\nhow about these fine ladies</span></div></span></div>",
            "created":1217307600,
            "id":562569,
            "title":"other"
        },
        "1251":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Shrink ",
                "Grow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Dinah shrink or grow?</span></div></span></div>",
            "created":1355202000,
            "id":1486035,
            "title":"the Black Canary"
        },
        "12512":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "30 feet not big enough ",
                "Well over 50 feet "
            ],
            "content":"<div class=\"\"><div> <span>Dinah Lance aka The Black Canary,Green Arrow's love interest was on a solo mission for once no Ollie,Justice League or Birds Of Prey this time she was chasing after thugs from Intergang smuggling experimental devices following a severe beat down to the thugs Dinah was prepared to return the equipment to STAR LABS when looking more closely at the device she discovered it was a growth machine \"Wonder why they wanted this thing unless they needed another Giganta...I really should return this..but on the other hand I always wanted to be taller!\" without hestiation she tapped the main switch and then BOOOOM! The machine malfunctioned \"Darn that was unfortunate!\" she thought but then felt like her entire body stretching like Plastic Man but unlike him she was actually growing like Elasti-Girl or Giganta herself \"Wow! Its really working if only Ollie could see me now...\" Dinah said happily as debris all around her fell like glass and the small warehouse was being torn to shreds by the sexy blonde super heroine with fishnets getting bigger by the second just how big would she get?</span></div></div>",
            "created":1386046800,
            "id":1702547,
            "title":"Grow"
        },
        "1252":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "The sexy comic version",
                "Animated one"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which version of Starfire grows large?</span></div></span></div>",
            "created":1386392400,
            "id":1704782,
            "title":"Starfire"
        },
        "12521":{
            "author_id":"flapjackzac",
            "author_name":"Gac Zorman",
            "choices":[
                "Notices Atom, wants to play with him.",
                "Takes the belt, along with Atom."
            ],
            "content":"<div class=\"\"><div> <span>Ryan Choi (The New Atom) has been accepted into the Teen Titans, maybe someone with the intelligence of The Atom is just what the team needed. <br>\r\n<br>\r\nOne boring day, the team is just chilling out. The guys playing video games, and Raven in her room reading spell books. Starfire was bored and unsure what to do with this free time, she decided to get to know her new teammate (Ryan Choi) better, and find him in his lab. <br>\r\n<br>\r\nStarfire enters his newfound lab, all this strange stuff she has never seen before peaked her interest. But she could not find Ryan anywhere.<br>\r\n<br>\r\n(Ryan Choi was busy working on an prototype for a secondary atom belt in case of emergencies. But instead it malfunctioned and shrunk Ryan)<br>\r\n<br>\r\nShe notices a fancy belt on the table. She decides to put the belt on, unaware this is really the source of the Atoms size changing abilities. But Starfire still can't find Ryan, unaware that he was actually shrunk to the same size as a tic-tac, and standing right next to her butt. Unable to get her attention quick enough he jumps into one of the belt pockets on Starfire's hips. And so, Starfire leaves the room, and enters her personal  quarters. <br>\r\n<br>\r\nShe stands in front of her bathroom mirror, shaking her hips, unaware the Atom is bouncing around in her pockets. She laughs and takes the belt off her waist, throws it on her bed, and undresses for a shower. Ryan Choi can't help but watch the titanic alien princess strip from her tight purple clothing. <br>\r\n<br>\r\n(Few minutes later)<br>\r\n<br>\r\nThe Atom manages to get out of the belt pocket and onto the bed, just as Starfire steps out of the bathroom dressed only in highly revealing panties and bra. She begins to approach her bed, still unaware of Ryan's presence...<br>\r\n<br>\r\n</span></div></div>",
            "created":1514350800,
            "id":2433360,
            "title":"The sexy comic version"
        },
        "125212":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Butt",
                "Vagina"
            ],
            "content":"<div class=\"\"><div> <span>The giant red harried alien grabs the belt and puts it back on her hips, with the Atom clinging onto it. With a few mighty steps she gets near her giant sized bed and lays down. After a few minutes she falls asleep peacefully, snoring away not even realizing her tiny sized teammate is in her room.<br>\r\n<br>\r\nAtom quickly peaks his head, wanting to make sure his presence would not be noticed. While very kind and gentle, and a bit clumsy, the Tamaramian like other females had a temper that would make any man want to face the wrath of Darkside himself. If she were to see him like this, small and on her body, the most likely outcome would be, Starfire gets upset and he has to face her wrath, or he gets called a pervert and kicked off the team. Ether way his screwed. What to do?<br>\r\n<br>\r\nWhile thinking on a course of action, the miniature sized hero had not noticed his beautiful teammate start to roll over. The next thing he knew, he was flat on face with a huge crushing weight that felt as if the moon got dropped on him. He then started to smell something funny. It was then he realised where he was. \"God damn it\" he uttered in a irritated tone.<br>\r\n<br>\r\nHe was trapped under her...</span></div></div>",
            "created":1538283300,
            "id":2556780,
            "title":"Takes the belt, along with Atom."
        },
        "1253":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "Power Girl",
                "Zatanna",
                "Not my cup of tea......."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>(this one was addded by -------- Darthtater)<br>\r\n<br>\r\nOr maybe........</span></div></span></div>",
            "created":1217307600,
            "id":562570,
            "title":"other"
        },
        "12531":{
            "choices":[
                "She triples in size",
                "She grows even bigger"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Power Girl was walking down the street one day and then got hit by a growth ray..</span></div></span></div>",
            "created":1466917200,
            "id":2171326,
            "title":"Power Girl"
        },
        "125312":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Giganta attacks",
                "Bank robbery happens"
            ],
            "content":"<div class=\"\"><div> <span>Power girl then sees she is as big as the buildings. People have stoped doing there regular activities to look at the giant kryptonian. Power girl looks at herself and says \"well I did always want to be this big\". She then decides to head to the headquarters of the new but before she gets there</span></div></div>",
            "created":1494651600,
            "id":2318594,
            "title":"She grows even bigger"
        },
        "1253122":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Atlee",
                "Super girl"
            ],
            "content":"<div class=\"\"><div> <span>Power girl then picks up on some gun shots with her super hearing. With 3 steps she is all ready at the door step of the the bank. One of the robbers looks up at the giantess and starts firing on her. The little bullets don't do anything to her, and she just bends over, flicks him, knocking him unconscious. Power girl then said \" hey, listen to me, I won't hurt any of you if you come quietly, but if you resist, this is gonna hurt, Alot\". Slowly she sees the bank robbers come out and with one of them, is a women, with a gun pointed at her head. One of the robbers yells \"YOU TRY ANYTHING AND THIS WOMEN GETS IT, SO HERE'S HOW IT, Smack, with a flick, power girl sent the thief flying and in her palm is the other robber. The robber looks around confused and scared, he then turns his head to see power girl's big blue eye looking at him. She then says \" Well that's unfortunate, I really don't like doing that to you guys, so LITTLE man, what are you gonna do\". The man lifts up his hand \" I surrender, I surrender\", power girl gives him a smile and responds with \" good idea, I really hope you learn not to do this in jail\". The robbers are put into a car and there driven off, power girl gives a sigh, and turns around when she hears cheering. She sees people clapping and cheering her name \" POWER GIRL, POWER GIRL, POWER GIRL, POWER GIRL\", power girl blushes and waves she then tries to fly but notices she can't. \"Well, guess I could just walk, now all I have to do is, then there is an explosion, \" Godamit, can I just have ONE, day without something exploding\". Then someone flies right next to her, she catches she or he, and its</span></div></div>",
            "created":1494738000,
            "id":2319408,
            "title":"Bank robbery happens"
        },
        "12531221":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "They can't make her small",
                "She wants to get bigger"
            ],
            "content":"<div class=\"\"><div> <span>Atlee looked up and sees her friend Karen, dressed up in her power girl costume. Atlee gives her a grin and says \" hey Karen I could_ It was then Atlee noticed how big Karen's face looked. She stood up and noticed that she was standing on something blue and soft. She then looked down to see herself way high up. She looks at Karen and says \"ohmygodyouraGIANT\" Karen replies with \"yep, it's pretty cool being this big, so kiddo, who's picking on you\". Atlee then looked to where the destruction is and points to the dust, in it is a rock monster, spitting out lava,with glowey eyes. \"So that's the bully huh, don't worry Atlee, I'll take care of him. The monster charges, but then a huge shadow eclipse him and he looks up to see a boot coming down on him. He goes splat into the pavement, and power girl grinds her boot into him just to make sure he is down for the count. She lifts her boot to see him smashed like a pancake, Atlee gives Karen a big hug,\" Wow Karen, you are the greatest\". Karen looks at her and gives a warm smile \" Thanks kid, now that THAT's over, want to come with me to the headquarters\" Atlee nods and Karen , walks to the base.</span></div></div>",
            "created":1494824400,
            "id":2320093,
            "title":"Atlee"
        },
        "125312212":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "200ft",
                "500ft"
            ],
            "content":"<div class=\"\"><div> <span>Karen and Atlee arrive at the JSA headquarters. There, they talk to the scientist and he says he can make her normal size again. Karen then said \" Wait, is there a growth setting on there to\" the doctor replied \"yes, yes there is, why? Karen then looks down and says \" I've always wanted to be really tall, and now I can be the tallest in the world, by the way is there a limit on how big I can become\". \"No, thanks to your kryptonian cells, you could potentially be able to be as large as you want\", Karen smirks and says \" well cool, now it's time for New York city to meet its biggest protector\". The scientist get the growth ray and fire it at her, she starts growing to about.<br>\r\n<br>\r\n</span></div></div>",
            "created":1495342800,
            "id":2323338,
            "title":"She wants to get bigger"
        },
        "1253122122":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Misfit comes over"
            ],
            "content":"<div class=\"\"><div> <span>Karen opened her eyes to see white clouds floating right next to her face. She then looks down to see the JSA headquarters, and it's TINY, so tiny that she could easily destroy it with half of her boot. She then sees Atlee flying next to her \" wow, Karen look at you, your so big now\". Karen gave her a smile \" yea, I've always wanted to be this big, and now here I am\", Atlee then jumps on her shoulder, \" this is so COOL, now what should we do now, karen. Karen then saw a get away car trying to lose the cops, Karen then stood up and put Atlee on her palm saying, \" well it's time to introduce the city to there new and improved power girl. <br>\r\n<br>\r\nThe cops were trying to get a clear shot at the driver, but the other robbers were shooting at there car's making it impossible to get a clear sight on them. Then one of the robbers shot one of the police cars and it spinned out of control, causing all of the cars to crash into each other. The robbers were going to celebrate about it, but then there car was taken up into the sky, and then they stopped, they then the girl named Atlee standing there with a smile. The robbers point there guns at her and Atlee then says \" I wouldn't do that if I were you, power girl gets really cranky when someone hurts her friends\" the robber laughs and says \" well, power girl isn't here to save you right now, is she\". Then the car is slowly lifted up and a blue eye is looking through the window, and there car is moved back. They then make out the face to be none other than power girl, who is giving them a dirty look \" so, you guys were ok with shooting my friend/ little sister and thought you would get away with it\". Then one of the robbers shoot her with a rocket launcher, but she then opened her mouth and ate it.<br>\r\n<br>\r\nThe robbers all sat there shocked, with there mouths hanging open. Power girl then with a big gulp, swallowed the missile. She then winks at them \" man that hit the spot, thanks boys, but I'm still hungry, you got any more of those I can munch on\". Then Atlee climbs up on power girl's face and on to her nose. She then turns to power girl saying \" hey pg, you said you were hungry right, well why not have one of the robbers as dinner\" power girl looks at the robbers and licks her lips \" well, you got that right Terra, they do look pretty tasty\" then the robbers start screaming in fear. \" calm down boys, I'm not going to eat you or anything, so let me just put you down and you can go into the happiest place on earth, prison\". After setting them down, power girl then says, well Atlee that was fun\" Atlee gives her a sheepish grin while saying \" yea it was fun, man I can't believe they thought you were going to eat them\" <br>\r\n<br>\r\nKaren then chuckles and says \" yea, well thanks for coming kid, it's always nice having you around\" Karen then slides her finger up and down Atlee's back, giving her a massage. \" oh Karen, can misfit come here to, she's like my best friend and your number one fan. Karen then remembered meeting the red head, who when she had gone to mars, had met Atlee and the two had become friends. Ever since then, they have been hanging out and she always loved hanging out with her, because she was a fan of power girl. Power girl had met her and had liked her to, she saw her like a little sister like Atlee and always loved when she and Atlee, would hang out, because they would both act like regular girls and it gave her a chuckle or two.</span></div></div>",
            "created":1495342800,
            "id":2323349,
            "title":"500ft"
        },
        "12531221221":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "Charlie wakes up",
                "Another super villan attacks"
            ],
            "content":"<div class=\"\"><div> <span>Charlie aka Misfit was finishing up some homework for her math class, when she got a call from her friend Atlee. She and Atlee had met a couple months ago and hit it off real fast. With both of them being considered the weirder type of superheroes and both of them looking author to power girl, they were each other's best friend. Atlee had called her saying for her to come over right away. What made Charlie hesitant to go was that Atlee had the tone in her voice in which she would pull a prank on her or show her something really weird but she was to curious about what she needed to show her.<br>\r\n<br>\r\nWith her power being able to teleport, she got to where Atlee was in about a second. She teleported right next to Atlee, causing Atlee to shriek in terror and land on her butt. Charlie gave her grin and laughed \" man, I should have brought my phone to record that\" Atlee scowled at her and said \" well I would fling you into the air but right now, I REALLY need to show you something\". Charlie then said \" If it's another porn video, I swear to God, I will\" but then atlee brought her hand over to her mouth \" threaten me later, right now you have to see this\" Atlee then grabbed her arm and brought her over to a parking lot, which Charlie found to be really creepy and very weird as to why Atlee would bring her hear as she can't even watch a scary movie without almost peeing her pants. <br>\r\n<br>\r\nThen atlee brought them over to something big, REALLY BIG, and it was also blue. Whatever it was, it was at least 50ft tall or more. Atlee then said \" okay you can reveal yourself\" then the blue object moved and landed on the ground. Charlie then saw what she was looking at, It was a BOOT. She then was surrounded by something and a second later she saw power girl, who was now gigantic. Power girl gave a smile and said \" hey Misfit, how's it going\" then out of the blue, She fainted, leaving Karen very worried and then Atlee jumped on her hand saying \" um that was not what I was expecting\".</span></div></div>",
            "created":1500699600,
            "id":2357527,
            "title":"Misfit comes over"
        },
        "125312212211":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "She's fine, just blacked out ",
                "She tries to eat them"
            ],
            "content":"<div class=\"\"><div> <span>After a few minutes, Atlee brought over a bucket of water and dumped all of it on Misfit. Misfit woke up with a scream, and Punched Atlee in the face, causing Atlee to fall on her back. The superhero looked at her best friend, and rushed to her side, reaching out to her, \" Oh god, Atlee I'm so Sorry\" she said with sadness in her voice. Atlee looked up at her \" hey what was that about, do I look like a bad guy\" she said with a pout. Charlie, realizing that her friend was okay replied back \" Well, if you want the truth\" she said this with a growing sly grin. Atlee then said \" well let's forgive and forget, Oh, do you remember what happened after you passed out\"? Charlie put a finger on her chin, while she strained her face trying to remember what happened, \" no, I can't, what the shell caused me to pass out\"? <br>\r\n<br>\r\nThen a loud BOOM erupted, causing Charlie to stumble and fall. Then a giant boot landed next to her, Charlie looked up to see power girl looking down at her. Atlee got next to her and with a huge grin says \" do you remember now\"? The teleporting superhero could not speak, she only made some weird noises. Karen looks down at her and grins, her beautiful blue eyes staring straight at her with love and kindness in them. Karen then spoke, her voice shaking the ground itself \" HEY MISFIT, YOU ALRIGHT? Misfit then asked atlee to pinch her, she did, and Misfit mutterd \" okay your not dreaming, so\". She then shouted \"OH MY GOD, YOUR A GIANT\". She then ran up to her boots and poked them, while Atlee and Power girl giggled, Atlee got up to Karen's ear and said \" looked like she's having fun\". Karen then smiled and nodded at her, she then picked up Atlee and Misfit, allowing them to stand on her open palm.<br>\r\n<br>\r\nKaren then said \" IM GLAD YOUR HEAR MISFIT, SO LETS GO OUT AND...\"<br>\r\n<br>\r\nAtlee and Misfit look at each other and then to Karen, worry in each other's eyes. Atlee then shouted \"Karen, are you okay\"?</span></div></div>",
            "created":1512882000,
            "id":2426454,
            "title":"Charlie wakes up"
        },
        "1253122122111":{
            "author_id":"starwars3",
            "author_name":"wildcat911",
            "choices":[
                "The Sun comes up",
                "She is requested to go to the wachtower"
            ],
            "content":"<div class=\"\"><div> <span>The Kryptonian regains her bearings and now focuses on the two tiny hero's on her palm. \"Sorry guys, my mind went blank for a second, nothing to worry about\". The girls relaxed, deciding to sit down on the massive palm of there friend and see what it was like to sleep on a goddess. By God, it felt great! Despite her body being tough enough that planets exploding only tickled her and being able to take punches from Gods, her skin was soft. <br>\r\n<br>\r\nPower girl grinned down at them \" Hey you two, enjoying your nap time\"?<br>\r\n<br>\r\nThe two just nodded, to busy trying to comprehend how Karen's hand can be so comfortable. Then all of a sudden, Karen felt one of her muscles spasm. During the pain she accidentally dropped the two teens and with the spasm only lasting a second, she luckily caught them again with little to no problem. Fearing that might happen again, the massive super heroine put the them on the ground and after that she sat down, letting her back rest on a mountain nearby.<br>\r\n<br>\r\nAtlee ran to Karen's side quickly, with misfit not far behind. The two got right next to Karen's leg and deciding she was close enough for her friend to hear her, she says \" Karen are you ok\"? <br>\r\n<br>\r\nKaren looked at her with a gentle smile \" Yea I'm fine, just a little pain in my muscles, probably a side effect of the growth.\" In her mind though, Karen was very scared of what had happened. Her friend's at the JSA sent her a message when Atlee went to get Misfit. The message had said that the sunlight the kryptonians use for there power was going to increase by a tremendous factor. The only reason they could think this was happening was that now that Karen was so big, her cells size have also increased. They were going to need more energy and the sun could give them plenty of it.<br>\r\n<br>\r\nOn one hand, Karen couldn't help but be happy. She had always been weaker then her cousin Kal-El and on some occasions Super girl as well. Now she can be stronger then them, not just a little stronger, but WAY stronger. Her finger alone could more than likely beat them in a arm wrestling contest. Hell forget about her limbs, her ASS alone could defeat the two kryptonians no problem. Not that she would do anything like that! Those two were her family, the last of her mind. She looked at for them like a big sister. Well giant now but still, actually thinking about it, maybe she could ask Kal and Super girl to go have a sparring match. She would very much want to know who could win.<br>\r\n<br>\r\nOn the other, all the power she had now, she barely has any control of it. When the sun comes out, this power is going to get way BIGGER. The last thing she wants is to grab someone between her fingers and crush them like a grape. Well with a little training and some help, she could learn to take that kind of power.<br>\r\n<br>\r\nKaren looked down and picked up the two little hero's. She began to float while saying \" Time to get back to work girls, and-oh shit, didn't even think of where to put you guys\". The blonde giantess then looked at her massive cleavage, then at the two teens. The two knew what she was thinking and didn't want to do her idea at all. They protested but the massive heroine plucked them from the ground and put them between her massive boobs with no Waring. The two screamed as loud as they could, but Karen ignored them.<br>\r\n<br>\r\nDeciding to save an explanation for later, and actually enjoying the little ones squirm in there, she set off to her city. Just then<br>\r\n<br>\r\n</span></div></div>",
            "created":1530890340,
            "id":2515665,
            "title":"She's fine, just blacked out "
        },
        "12532":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>(this was addded by SUPERFAN)<br>\r\n<br>\r\nIt all started when Luthor was half-way through his first term as President of the United States.<br>\r\n<br>\r\nZatanna the Magician performed at a special charity benefit for the \"Earthquake Widows And Orphans Fund\" in Gotham City. She had just finished her act, to a standing ovation. And, upon returning to her dressing room, she found a boquet of American Beauty roses on the make-up table. <br>\r\n<br>\r\nThe note pinned to the tissue-paper wrapping read:<br>\r\n<br>\r\n\"Congratulations! From your biggest fan.\"<br>\r\n<br>\r\nIn place of a signature, however, was the silhouette of a bat.<br>\r\n<br>\r\nSmiling to herself, Zee smelled the roses. The moment she did so, however, she was hit by a wave of vertigo. She only had time enough to sit down, on the chair in front of the vanity table, before passing out.<br>\r\n<br>\r\nThe moment she did so, a strange figured appeared in the mirror!<br>\r\n<br>\r\nThis golden-masked figure wore a red cloak over matching cover-alls and boots. It also had a red, Pilgrim-like hat, with a golden capital \"a\" surrounded by a golden circle. And, the only indication it gave that it was male was when it emerged from the mirror, like a swimmer emerging from a YMCA pool, and spoke aloud.<br>\r\n<br>\r\n\"It looks like the narco-hypnotic scent of these genetically-engineered roses worked! I wonder how Pamela Isley would react if she knew that Calculator had leaked her botanical secrets all over the Internet? Along with the technology behind Mirror Master's unique teleportation and the Mad Hatter's mind-controlling microchips!\"<br>\r\n<br>\r\nThe stranger chuckled as he answered his own question.<br>\r\n<br>\r\n\"She'd probably cause Arkham Asylum to break out into pure...Anarky!\"<br>\r\n</span></div></div>",
            "created":1217307600,
            "id":562571,
            "title":"Zatanna"
        },
        "125321":{
            "author_id":"hawkergts",
            "author_name":"RisingFan",
            "choices":[
                " \"...with everyone else in the world shrunk down to six inches tall!\" ",
                "\"...by becoming a hundred-foot tall giantess (costume and all)!\" "
            ],
            "content":"<div class=\"\"><div> <span>(this was added by SUPERFAN)<br>\r\n<br>\r\nAnarky now positioned the unconscious magician so that she was sitting upright in her chair. He paused momentarily, to ogle her fishnet-stockinged legs. Then, he placed her top hat back on her head. But, with a small device hidden behind each of her monogrammed earrings.<br>\r\n<br>\r\n\"Listen closely, Zatanna. You are now under my power. When you wake up, I want you to shrink me small enough to fit in your pocket. After that? Well...\"<br>\r\n<br>\r\n* * * * *<br>\r\n<br>\r\nBruce Wayne was pleasantly surprised to get Zatanna's invitation to dinner in her hotel suite. He accepted without hesitation, and arrived at 8:00 PM, later that evening. He found her ready and waiting, still wearing her stage costume.<br>\r\n<br>\r\n\"New York char-broiled sirloin? Dom Perignon, with Waterford crystal glasses? What's the occasion, Zee?\"<br>\r\n<br>\r\n\"I'm just celebrating my first crime-free gig, in Gotham, in the last five years.\"<br>\r\n<br>\r\nThey engaged in similar small talk for the rest of the meal. Then, just as Bruce was about to pour some after-dinner coffee, he noticed something strange.<br>\r\n<br>\r\n\"You know, if I didn't know better, I'd swear that this coffee pot was the Larko Lamp.\"<br>\r\n<br>\r\nWhereupon, Zatanna replied: \"ecurB enyaW, emoceb ekoms! retnE eht pmal!\"<br>\r\n<br>\r\nBefore the man who was secretly the Caped Crusader of Gotham City could react, he had become a cloud of gray smoke going down the spout of what clearly not a coffee pot!<br>\r\n<br>\r\nOf course, with no one holding it, the Larko Lamp should have fallen to the carpeted floor of the suite. But, Zatanna uttered another backwards-spell to levitate it into her hands. She then uttered a third spell, making it small enough to fit in the empty diamond setting of a gold ring on her right hand.<br>\r\n<br>\r\nWhen this had been accomplished, she waved her left hand while saying:<br>\r\n<br>\r\n\"ecurB, egreme-er sa eht taB-eineg. yletelpmoC tneidebo ot em.\"<br>\r\n<br>\r\nThis resulted in a second cloud of smoke. The top of which became the upper torso of the legendary Batman. But, with his arms criss-crossed. And, even more strangely, with the bat-ears of his mask covered by a yellow turban!<br>\r\n<br>\r\n\"What is your wish, My Mistress?\"<br>\r\n<br>\r\n\"I wish to be worshipped as a goddess...\"</span></div></div>",
            "created":1217307600,
            "id":562572,
            "title":"continue"
        },
        "1253211":{
            "choices":[
                "...having her feet massaged, and shoes shined, by the mini-JLA.",
                "...having the Bat-genie make love to her!"
            ],
            "content":"<div class=\"\"><div> <span>  As a result of this wish, Zatanna became the only normal-sized person in the world.  Everyone else was reduced in size, accordingly, along with their possessions and places of residence.  There were some exceptions, however.<br>\r\n<br>\r\n  Zatanna let the White House in Washington, DC. remain normal-size, so she could make it her palace.  But, the city of Washington, itself, now resembled a proportionately small diorama of the USA's capital city, spread out across half the front lawn of the White House.   <br>\r\n<br>\r\n  The other exceptions, not as publicly visible, were the Tower of Fate, near Salem, Massachusetts.   And, New Themiscyra (aka Paradise Island), somewhere in that area of the southern North Atlantic that most people called...the Bermuda Triangle.<br>\r\n<br>\r\n  Diana, the Amazon Crown Princess better known as Wonder Woman, was en route to Massachusetts in her Invisible Plane to meet with Dr. Fate.  The legendary wizard of the Justice Society had telepathically contacted her, requesting that she meet with him and the Spectre at his abode, to plan a suitable course of action.<br>\r\n<br>\r\n  For, at that moment, there were few others who were aware of the reality change that had occurred!<br>\r\n<br>\r\n  When she finally did arrive, she was teleported into the obelisk-like tower, where she saw Dr. Fate and the Spectre gazing into a crystal ball, at Zatanna...</span></div></div>",
            "created":1217307600,
            "id":562689,
            "title":" \"...with everyone else in the world shrunk..."
        },
        "12532111":{
            "choices":[
                "Deadman",
                "The Phantom Stranger"
            ],
            "content":"<div class=\"\"><div> <span>  \"Ohhhhhhh!  Oh, YES!!!  Oh, Flash.  You have such marvelous little hands!\"<br>\r\n<br>\r\n   This was how Zatanna was responding to the super-speed massage being given by Wally West to her fishnet-clad feet.  At the same time, Hawkman was flying back-and-forth beneath her Oval Office desk, applying shoe polish to the high-heel she usually wore on her left foot.  The one for her right foot had already been polished, and was now being shined by the Elongated Man!<br>\r\n<br>\r\n   \"I hope you boys are doing a good job, down there,\" she called out to them.<br>\r\n<br>\r\n   \"Yes, Goddess!\" they replied in unison:  \"Nothing less will ever please us.\" <br>\r\n<br>\r\n    \"This blasphemy cannot be allowed to continue,\" growled the Spectre, as the crystal ball went dark.<br>\r\n<br>\r\n    \"I agree,\" replied Dr. Fate:  \"But, you cannot confront her, directly.  The Batman serves her as a djinn.  If she unleashes him against you,  she will empathically convert the blind faith of her shrunken worshippers into extra power for him.   The extra power that would require of _you_, to subdue him, would destroy the Earth as well!\"<br>\r\n<br>\r\n   \"Do you have a better idea, Mage of Order?\"<br>\r\n<br>\r\n   \"Actually, I think I do,\" replied Wonder Woman.<br>\r\n<br>\r\n   * * * * *<br>\r\n<br>\r\n   As it turned out, her plan called for the recruitment of Boston \"Deadman\" Brand, and the Phantom Stranger.   Who was sent for, first?</span></div></div>",
            "created":1220418000,
            "id":578036,
            "title":"...having her feet massaged, and shoes shined, ..."
        },
        "125321111":{
            "choices":[
                "...on the White House lawn."
            ],
            "content":"<div class=\"\"><div> <span>    The super-villainess known as Giganta had been capable of growing to a height of one hundred feet, prior to the reality-shift.  Now that she was as small as the rest of the world, however, she could only grow to a height of ten feet.   Although, that still made her enormous, from their point of view!<br>\r\n<br>\r\n    So, when Boston \"Deadman\" Brand used his ghostly powers to take over one of the guards at the Federal Metahuman Detention Facility (a.k.a. \"the Slab\"), the first thing he did was deactivate the neuro-electrical dampening headband that kept Giganta from concentrating enough to utilize her super-growth power.<br>\r\n<br>\r\n    Klaxons began blaring as the ten-foot tall giantess shattered her way up through the roof of the prison wing that held her cell.  And, before any of the guards in the watchtowers could fire off a shot, she had fled through a teleportal shaped like an Egyptian ankh!<br>\r\n<br>\r\n    A second later, Giganta emerged into the \"foyer\" of the Tower of Fate.<br>\r\n<br>\r\n     \"Are you all right, Boston?\" asked Wonder Woman.<br>\r\n<br>\r\n     \"Just fine, Princess!  And, so's your old sparring partner.\" <br>\r\n<br>\r\n     \"Are you ready for Phase I?\"<br>\r\n<br>\r\n      The possessed redhead nodded, whereupon Dr. Fate activated another teleportal.<br>\r\n<br>\r\n      \"May the Lords of Order smile upon us,\" he intoned.  And, Giganta entered the teleportal, emerging...     </span></div></div>",
            "created":1223010000,
            "id":590474,
            "title":"Deadman"
        },
        "1253211111":{
            "choices":[
                "...the Phantom Stranger and the Atom, at Ivytown University. ",
                "...the Phantom Stranger and Batman in Gotham City."
            ],
            "content":"<div class=\"\"><div> <span>   \"Code Red!  Code Red!   Security breach on the front lawn.  Repeat: security breach on the front lawn!  Potential Class-A threat.  This is not a drill.  Repeat: this is not a drill!\"  <br>\r\n<br>\r\n    As Giganta (currently possessed by Deadman) advanced upon the main entrance to the White House, a hundred crimson-clad figures suddenly flew up into the air, blocking \"her\" path.   These were Zatanna the Goddess' first line of defense:  the Amazonian mercenaries of Bana-Migdahl.  Each one wearing a high-tech suit of \"Rocket Red\" armor!<br>\r\n<br>\r\n   \"Attention, giantess!\" declared the leader, over a built-in public announcer:   \"Go back wherever it is you came from.  No one may approach the Palace of the Goddess without her leave!  Go back!  Or, suffer the consequences.\" <br>\r\n<br>\r\n   \"Consequences/schmonsequences.  Let's get this party STARTED!\"<br>\r\n<br>\r\n   So, they gave Giganta \"her\" wish.<br>\r\n<br>\r\n    * * * * *<br>\r\n<br>\r\n    In the meantime,  Phase 2 was about to start.   This involved...   <br>\r\n<br>\r\n    </span></div></div>",
            "created":1224133200,
            "id":596129,
            "title":"...on the White House lawn."
        },
        "12532111112":{
            "choices":[
                "Catwoman and the Stranger go directly there.",
                "They make one little stop first."
            ],
            "content":"<div class=\"\"><div> <span>   I am called the Phantom Stranger.  And, in the universe that existed before the First Crisis, Jason Todd--the second Robin--had been killed by the Joker.   But, not so, in this reality.<br>\r\n<br>\r\n   In this one, the one altered by Zatanna the \"Goddess,\"  I rescued Jason Todd...micro-seconds before the explosion of the time bomb planted by the Joker!<br>\r\n<br>\r\n   I brought him to the Himalayan land of Nanda Parbat, to recuperate.  For, I sensed that he would play a major role in the fate of this world in the very near-future.   That role began five years ago, when Bruce Wayne was spinally injured in a \"car crash.\"   Or, at least, that is how the shrunken inhabitants of this world remember it.  In their minds, Bruce Wayne became a paraplegic recluse before the coming of the Goddess.   And, since then, in gratitude for having been healed by her, he has been the high priest of her temple in Gotham City.   <br>\r\n<br>\r\n  But, that Bruce Wayne is merely a double!  One of a series of phyto-genetic clones created by a Zatanna-worshipping Pamela Isley, to disguise the fact that the real Bruce Wayne is no more.  That he has virtually ceased to exist since he, as the \"Bat-genie,\" granted his mistress that fateful wish.<br>\r\n<br>\r\n  It is Jason Todd who is now the Dark Knight of Gotham.   Trying to organize a resistance movement composed of the psychically immune.  That is;  those who were not affected by the reality shift...and remember how things should truly be.  Unfortunately, most of them have been rounded up by the Zatanna-worshipping police and committed to Arkham Asylum for the Criminally Insane. <br>\r\n<br>\r\n  That is why the new Batman occasionally raids Arkham.  Arranging break-outs of the psychically immune with the help of the same person I now seek the aid of:  Catwoman!<br>\r\n<br>\r\n  The three of us meet in the now-derelict movie theater where the first Dark Knight was truly born.<br>\r\n<br>\r\n   \"Jay's told me a lot about you, Stranger.  Which, I admit, isn't much!  So, what can I do for you?\"<br>\r\n<br>\r\n   My reply is blunt:  \"I need your help breaking into the White House.\"     <br>\r\n      <br>\r\n<br>\r\n   </span></div></div>",
            "created":1224392400,
            "id":597144,
            "title":"PHASE II"
        },
        "125321111122":{
            "choices":[
                "conitnue from the pov of Superman vs. Batman.",
                "continue from the pov of the Phantom Stranger."
            ],
            "content":"<div class=\"\"><div> <span>  Catwoman's reply was instinctive and unequivocal:  \"SAY WHAT?\"<br>\r\n<br>\r\n   I explained to her that, if I used my mystic teleportation power, my arrival would immediately be detected by Zatanna.  That is why I needed someone to infiltrate the White House for me.   Someone with almost-superhuman stealth, without it being supernatural.<br>\r\n<br>\r\n   \"Let's say I agree to this crazy request.   What do you want me to steal once I'm inside?  And, what's in it for me?\"<br>\r\n<br>\r\n   \"The source of Zatanna's god-like power,\" I replied (answering her questions in the same order):  \"And, the freedom to resume your old life of crime, without living in fear of being incarcerated at Arkham as a heretic.\"<br>\r\n<br>\r\n   As if on cue, I sensed him approaching, just moments before he crashed down through the roof.<br>\r\n<br>\r\n   \"Blasphemers!\" shouted Superman (Zatanna's Secretary of Defense):  \"In the interest of homeland security, and in the name of the Goddess, I place you under arrest!\"<br>\r\n<br>\r\n   \"Go!\" yelled the Batman:  \"I'll hold him off!\"<br>\r\n<br>\r\n   \"Jay, no!\"  exclaimed Catwoman. <br>\r\n<br>\r\n  She tried to leap to his side.  But, not even she could dodge the Phantom Stranger. The next thing she knew, we were in the Ivytown University office of Professor Raymond Palmer.  Also known as...the Atom.<br>\r\n<br>\r\n  \"Forgive the intrusion, Professor.  But, we have need of your assistance.\"<br>\r\n<br>\r\n   </span></div></div>",
            "created":1225602000,
            "id":603188,
            "title":"They make one little stop first."
        },
        "1253211111222":{
            "choices":[
                "Return to the Phase I fight between Giganta/Deadman and the Rocket Red Amazons."
            ],
            "content":"<div class=\"\"><div> <span>   Prof. Palmer showed us the Hyatt Time Pool (named for his late mentor).  It was a chronospatial anomaly that resembled a white, six-pointed star containing multi-colored concentric circles.<br>\r\n<br>\r\n   \"Before the Goddess game, I used to make all manner of trips into the past.  Albeit, only after reducing myself to one-inch tall.  For, as you can see for yourselves, no one of normal size could fit through that aperture!\"<br>\r\n<br>\r\n   I replied that, with Zatanna having shrunk the rest of the world to only six inches tall,  \"...the two of you will have to shrink proportionately smaller.  To the pre-shift equivalent of one-sixth of an inch!\" <br>\r\n<br>\r\n   Prof. Palmer frowned:  \"The scientist in me still wishes you had more concrete proof of this reality shift.  But, as a teacher, I resent the way I have to shovel anti-scientific propaganda down my pupils' throats, while lecturing on the history of nuclear physics!\"<br>\r\n<br>\r\n  So saying, he then asked Catwoman if she was ready.  She nodded.  Whereupon, he embraced her to him (causing a brief mutual blush) and pressed a switch on his size-and-weight control belt.  Seconds later, I literally had the two of them in the palms of my cupped hands!!<br>\r\n<br>\r\n   \"Have you set the co-ordinates accordingly, Professor?\"<br>\r\n<br>\r\n   He nodded:  \"If they were correct, we'll arrive at the same moment Giganta came through that teleportal you mentioned.   The alarms over her presence drowning out any going off as the result of detecting ours.\" <br>\r\n<br>\r\n    I nodded in response.  After which, I opened my hands and dropped the unusual duo into the Time Pool. <br>\r\n<br>\r\n      </span></div></div>",
            "created":1225688400,
            "id":603392,
            "title":"continue from the pov of the Phantom Stranger."
        },
        "12532111112221":{
            "choices":[
                "...sound asleep, with the magic ring on her right hand above the blankets.",
                "...apparently \"gratifying\" herself."
            ],
            "content":"<div class=\"\"><div> <span>  \"Let's get this party STARTED!\" exclaimed the possessed redhead.   So, the Rocket Reds decided to fulfill her wish.<br>\r\n<br>\r\n  Within seconds, \"Giganta\" was being dive-bombed by the armor-clad Amazons.   Wrist-mounted lasers firing from their gauntlets.  Miniature rockets being fired from shoulder-mounted launchers.   And, kung fu punches and kicks (learned from Madame Shiva, herself) amplified by their exo-skeletal arms and legs. <br>\r\n<br>\r\n  All these were used against \"Giganta.\"    But, \"she\" only found them as annoying as mosquito bites would be to a normal-sized person.   Conversely, however, Deadman was able to use his host body's once-simian musculature and instincts to leap and tumble about.  Sometimes, returning the kicks used against \"her.\"  And, sometimes swatting the Rocket Reds like someone normal-sized would swat a fly!<br>\r\n<br>\r\n   \"Just call me 'Queen Kong,' ladies!\"<br>\r\n<br>\r\n   Meanwhile, just moments earlier, Catwoman and the Atom had rematerialized beneath the bed of \"the Goddess.\"   The Atom restored them both to \"normal\" height, before taking a quick peek outside.  Seeing that the proverbial coast was clear, Catwoman fired the grappling hook from her \"cat's-claw\" gun straight up into the air.<br>\r\n<br>\r\n   The claw landed on top of the bed's footboard, activating the micro-electronic winch attached to the gun.  Drawing both Catwoman and the Atom upwards as it reeled in the steel filament cord,  When they reached the top, they saw an apparently naked Zatanna...</span></div></div>",
            "created":1226206800,
            "id":605862,
            "title":"Return to the Phase I fight between Giganta/Dea..."
        },
        "125321111122211":{
            "choices":[
                "...the Bat-genie emerged from beneath Zatanna's blanket!",
                "...someone else showed up!"
            ],
            "content":"<div class=\"\"><div> <span>  \"There it is!\" exclaimed the Atom (unintentionally belaboring the obvious):  \"Remember; all we have to do is grab it, and the Bat-genie is ours to command.\"<br>\r\n<br>\r\n   Whereupon, he and Catwoman crept along the top of the bed's footboard unti they were parallel to Zatanna's blanket-covered right foot.    Then, they jumped down on the blanket, so they could begin army-crawling toward her hand.   <br>\r\n<br>\r\n   Two minutes later, they had reached their objective.<br>\r\n<br>\r\n   \"I don't suppose you carry a jar of cold cream in your bag of tricks?\" the Atom asked (being careful to whisper).<br>\r\n<br>\r\n   \"Not quite!\" replied Catwoman, as she removed a half-gallon plastic bottle from her knapsack, along with a pump-action insecticide spraygun .<br>\r\n<br>\r\n   \"What's the yellow stuff in the bottle?\"  the Atom inquired, suspiciously.  <br>\r\n<br>\r\n   \"Baby oil.  Sometimes, I have to crawl through vents too narrow for even _my_ svelte figure!  So, I use atomized baby oil to further eliminate friction.  Care to do the honors?\"<br>\r\n<br>\r\n   The atom quickly-but-quietly removed the cap of the spraygun and filled it with some of the baby oil.  After which, he restored the cap to its rightful place, before manipulating the T-shaped pump handle.  He then began lubricating--under Catwoman's guidance--certain spots within the area encircled by Zatanna's ring.<br>\r\n<br>\r\n    When they had completed three hundred sixty degrees, they immediately started tugging on the ring.   Unfortunately, that is when...</span></div></div>",
            "created":1228971600,
            "id":618367,
            "title":"...sound asleep, with the magic ring on her rig..."
        },
        "1253211111222111":{
            "choices":[
                "She begins by punishing the Atom. ",
                "She begins by punishing Catwoman."
            ],
            "content":"<div class=\"\"><div> <span>   The top half of the blanket flew up and backward, like a tidal wave.   Covering both Catwoman and the Atom before they could even move!<br>\r\n<br>\r\n   \"Mistress!  Mistress!  Please, awaken!\"<br>\r\n<br>\r\n   \"Huh?  What?\"<br>\r\n<br>\r\n    \"Intruders, Mistress!  They seek to steal me from you.  I sensed them as they attempted to make off with my lamp.\"<br>\r\n<br>\r\n    \"Oh, really!  Where are they, now?\"<br>\r\n<br>\r\n    \"Beneath the blanket.\"<br>\r\n<br>\r\n    There was a brief moment, as the blanket was removed, that Catwoman and the Atom were blinded by the return of bright light.  When their eyes had adjusted, however, they saw Zatanna glaring down at them.  With her left hand clutching the top half of the blanket to her chest.  And, her right arm protectively embracing the Bat-genie's shoulders!<br>\r\n<br>\r\n    \"I don't know how you two got in here,\" she muttered:  \"But, you're going to regret spoiling the afterglow of our little...bat-a-tete!\" </span></div></div>",
            "created":1250571600,
            "id":746133,
            "title":"  \"BAT\"  TIMING"
        },
        "12532111112221112":{
            "choices":[
                "...the Atom grabs Catwoman and makes a run for it.",
                "...G'nort snatches her up like a retriever with a duck."
            ],
            "content":"<div class=\"\"><div> <span>  \"Oh, G'noooooooort!\"  she sings out:  \"Come here, puppy.  Mommy has a surprise for you!\"<br>\r\n<br>\r\n  \"Oh, no,\" mutters the Atom:  \"She couldn't mean...!\"<br>\r\n<br>\r\n  But, she does.  She is calling for G'nort G'neesmacher!!  A alien humanoid of canine descent...and the clumsiest being without fear ever recruited by the Green Lantern Corps.  Unfortunately, he displays no such clumsiness when he comes bounding into Zatanna's bedroom panting and drooling!!<br>\r\n<br>\r\n  \"What is it, Mommy?  Huh-huh-huh-huh?  What's the surprise?\"<br>\r\n<br>\r\n  \"A little kitty for you to play with.\"<br>\r\n<br>\r\n  \"A little kitty?  Oh, goody-goody-goody-goody!  Where is it, Mommy?  Where-where-where-where?\"<br>\r\n<br>\r\n  Zatanna merely smiles and points to the blanket.  Whereupon...<br>\r\n<br>\r\n    <br>\r\n<br>\r\n  <br>\r\n<br>\r\n  </span></div></div>",
            "created":1270962000,
            "id":866637,
            "title":"LIKE CATS  AND  DOGS"
        },
        "1253212":{
            "author_id":"uniontupapa",
            "author_name":"cinto",
            "choices":[
                "He stand still",
                "Tries to run away"
            ],
            "content":"<div class=\"\"><div> <span>Zattana looked at the restaurant and then at the small bat-genie  and said \"But wait until we reach a safety zone... don't wanna kill any innocent bystandar by my sudden growth\"<br>\r\n<br>\r\n\"what??\" asked the small voice coming from her pocket, that was not what he asked of her. Zattana grinned as she hear him and said \"You silly little thing...you actually thought you had me under your control...I was just curious to see what was your plan...that's all, but I do want to grow\".<br>\r\n<br>\r\nOnce Zattana reached a park she commanded the bat-genie \"Now... make me grow a hundred feet and transfer all your powers to me...when you have done so you will return to normal and will not remember what just happened\" she said and giggled.<br>\r\n<br>\r\n\"What the\" Bruce wayne thought. At one moment he was sitting on a restaurant with Zattana and now he was in the middle of a park.<br>\r\n<br>\r\n\"Hello cutie\" He heard Zattana's voice from behind him, but it sounded different. He turned and his face went pale at the sight of a giant Zattana sitting on her knees looking down at him with a smile.<br>\r\n<br>\r\n\"You look so adorable\" Zattana giggled and rerached down to grab him</span></div></div>",
            "created":1265778000,
            "id":833792,
            "title":"giant zattana"
        },
        "12532121":{
            "choices":[
                ",,,Metropolis.",
                "...some other town called home by one of the JLA."
            ],
            "content":"<div class=\"\"><div> <span>  \"Z'anna?\"  exclaims the billionaire philanthropist.<br>\r\n<br>\r\n  The giantess giggles and says (half-seriously):  \"That's Goddess Zatanna to you, little man.  And, I wish _you_ to be my chief acolyte!\"<br>\r\n<br>\r\n  Before Bruce Wayne can protest, or run off to become the Batman, he feels an odd compulsion.  He immediately gets down on both knees and starts kowtowing!<br>\r\n<br>\r\n  \"Oh, mighty goddess!  You're wish is my command.\"<br>\r\n<br>\r\n  Zatanna giggles some more and picks him up in the palm of her left hand.  Ever so gently, she kisses him.  Yet, so huge are her lovely lips, that she leaves the entire front of Bruce Wayne's Armani suit completely covered with lipstick!<br>\r\n<br>\r\n  Whereupon, she stands back up and starts marching off in the direction of... </span></div></div>",
            "created":1270962000,
            "id":866648,
            "title":"BEWITCHED,  BOTHERED,  AND  BESMOOCHED"
        },
        "125321212":{
            "choices":[
                "...Central City (hometown of the Flash).",
                "...Star City (hometown of Green Arrow&Black Canary)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Upon reaching the nearest highway interchange, she sees signs giving the direction and mileage to Metropolis and two other cities.  Those other two being...</span></div></span></div>",
            "created":1270962000,
            "id":866650,
            "title":"...some other town called home by one of the JLA."
        },
        "12533":{
            "author_id":"tatertot",
            "author_name":"Darthtater",
            "choices":[
                "Harley Quinn",
                "Knockout"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about......</span></div></span></div>",
            "created":1227675600,
            "id":612103,
            "title":"Still more....."
        },
        "125331":{
            "choices":[
                "I am sure",
                "Giganta"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you sure Harley Quinn? How about Giganta?</span></div></span></div>",
            "created":1260680400,
            "id":805411,
            "title":"Harley Quinn or Giganta"
        },
        "1253311":{
            "author_id":"the1swagking",
            "author_name":"The1SwagKing",
            "choices":[
                "Growth ",
                "Power to Shrink"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now does Harley grow to extreme sizes, or does she obtain the ability to shrink others?</span></div></span></div>",
            "created":1498280400,
            "id":2341417,
            "title":"Harley Quinn"
        },
        "1253312":{
            "author_id":"doggy74",
            "author_name":"The keeper of awesomeness",
            "choices":[
                "continue "
            ],
            "content":"<div class=\"\"><div> <span>This version of Giganta is more powerful and has never encountered Wonder Woman or any of the Justice League members.<br>\r\n<br>\r\nThe Justice League were at a meeting which was held at the Watchtower, The current Justice League roster contained Superman, Wonder Woman, Batman, Green Arrow, Cyborg, Hawkgirl, the Flash and Green Lantern. The Justice League had to slit up into two groups because of two dangers, Darkseid recently challenged threatened Superman and the Justice League and would assault the Watchtower. The second danger was the occurrence of a new super villain who was fifty foot tall and attacked Blackgate penitentiary which was located in Gotham. The Justice League was split up into two teams, the first team contained the main bulk of the League which included Superman, Cyborg, Green Lantern, Hawkgirl, Flash and Green Arrow. Both Wonder Woman and Batman were sent to contain the escaping criminals and deal with the new super villain.</span></div></div>",
            "created":1442984400,
            "id":2038857,
            "title":"Giganta"
        },
        "125332":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Heck yes",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Nah not her! But how about a person from DC's imprint Vertigo like the sexy girl Death as a giantess?</span></div></span></div>",
            "created":1386392400,
            "id":1704783,
            "title":"Knockout"
        },
        "1253322":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Hawkgirl GTS",
                "Vixen GTS or no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hawk girl or Vixen? </span></div></span></div>",
            "created":1387342800,
            "id":1709935,
            "title":"Nope"
        },
        "12533222":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Huntress",
                "Mary Marvel "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>If not then maybe a giantess Huntress or Mary Marvel?</span></div></span></div>",
            "created":1387342800,
            "id":1709937,
            "title":"Vixen GTS or no"
        },
        "125332222":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "50 feet Not so bad",
                "100 feet very bad for Fawcett City"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Just how gigantic will the sweet Mary Marvel become?</span></div></span></div>",
            "created":1387774800,
            "id":1712525,
            "title":"Mary Marvel "
        },
        "1253322221":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Original 1940 version ",
                "Updated white skirt version"
            ],
            "content":"<div class=\"\"><div> <span>One final question then we'll get on with the actual story which version of Mary will this particular  giantess be? Two choices either the original Fawcett Comics 1940s version or the modern day version(Superbuddies white skirt version) before she became all black evil Mary Marvel?</span></div></div>",
            "created":1447131600,
            "id":2059507,
            "title":"50 feet Not so bad"
        },
        "12533222211":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "She pick up a random guy to visit the city",
                "She soon realized this is not a dream"
            ],
            "content":"<div class=\"\"><div> <span>It was a normal day in Fawcett city, at last that's what the people would have think if they were not seeing a sleeping giantess<br>\r\nlying in the middel of a city, a giantess they could recognize as Mary Marvel because of her suit, They were looking at her, discussing<br>\r\nabout she could have become so big, when she finally wake up.<br>\r\n<br>\r\n\" hmmm...Do i still dreaming ? Probably. Everything seem so small.\"<br>\r\n<br>\r\nThe people took a step back, which caught her attention. \" Hi ! Where am i ? this city looks familiar, like a miniature size of Fawcett City, <br>\r\nthat's where i come from. \" She said.<br>\r\n<br>\r\n\" huh...you are at Fawcett City. And we don't know how you got so big...\" replied one old man.<br>\r\n<br>\r\n\" Hahaha i see..i am dreaming about my own city then.\" She then stood up, causing a big noise which scared the people around. \" So maybe i can <br>\r\nvisit it in a new perspective ! Anyone wanna come with me ? \"<br>\r\n<br>\r\n</span></div></div>",
            "created":1460782800,
            "id":2134264,
            "title":"Original 1940 version "
        },
        "125332222112":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Flee while the city still stood",
                "She stays and continues her career as a crime fighter "
            ],
            "content":"<div class=\"\"><div> <span>As the World's Mightiest Girl stood at a pure amazing and yet terrifying 95 feet tall she took one small step forward CRUNCH! she accidentally flattened someone's car it was then she heard the chorus of screams reaching her ears and it dawned on her that \"Holey-Moley this isn't some dream or a model city;this really is Fawcett City and I actually am a giantess OH NO! I'm terribly sorry people.....oops!\" As she tried to reassure the frightened,panicking crowds she meant no harm she tripped and fell once her skirt bottom hit the ground the very Earth itself seemed to groan out in pain as tremor after tremor occurred and nearly everything not nailed or bolted to the ground flew up twenty feet into the air people included fortunately no one was hurt too badly just shaken up \"Oops Sorry!\" Mary called out from above as she tried to stand up but in doing so caused another building to collapse it seemed even the smallest amount of movement caused such uncanny destruction \"Oh my it seems as a towering giant my powers are increased a hundred times fold not only am I possibly more powerful than my brother captain marvel but golly I might as well be the most powerful force upon the planet itself....\" She thought to herself as she knew her massive size made her a major threat to the city and all who inhabited it so she immediately decided to..</span></div></div>",
            "created":1460782800,
            "id":2134270,
            "title":"She soon realized this is not a dream"
        },
        "1253322221122":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "...super vilains ?",
                "...normal guys ? "
            ],
            "content":"<div class=\"\"><div> <span>She decided to stay and continues to fight crimes. Her size would be at last really persuasive, even for a super vilain. It would be better also to try to not<br>\r\nuse any power, she doesn't need it anyway. Looking down around her, she carefully and slowly bent down to talk to the people : \" i'm sorry. I will try to fix <br>\r\nthe damages once i get back to my size. But for now as i have no idea where to start, i will use this size to fight crimes. Maybe it will be a low price for what<br>\r\ni've done, but this is a start.\" The guys nodded, still scared.<br>\r\n<br>\r\n\" All right, let's stop some...\"</span></div></div>",
            "created":1460782800,
            "id":2134276,
            "title":"She stays and continues her career as a crime f..."
        },
        "12533222211222":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Playfully drop all three into the front of her panties ",
                "She playfully dropped them in the back of her panties"
            ],
            "content":"<div class=\"\"><div> <span>As Mary Marvel is speaking she happens to witness a few masked men fleeing from a bank heist and thinks to herself \"Well it's a start maybe I won't be able to give these guys a proper superhero thrashing but at least I'll be able to give them a good scare!\" As she politely excused herself from the crowds \"Sorry duty calls now for those mean ole bank robbers!\" And with two giant steps she was standing over the trio of now startled thugs all armed to the teeth with bags of cash in the other hand \"What th- is that Mary Marvel? How did she get that big?\" One man asked his comrades as if she could hear them and she could perfectly Mary stated firmly with both hands on her hips \"Never mind how I got this way the important thing is that you three put all that money back where it belongs and surrender to the authorities or there will be dire consequences for you!\" All three bandits stared at each other then to her amazement started laughing \"Oh that's rich sweet little....I mean now BIG Mary Marvel is going to teach us a lesson when she can't even walk through town without crushing stuff under those little yellow boots or that bubble butt of here Ahahahaha what a riot!\" The head criminal laughed urging his comrades to join in their mocking laughter was ticking Mary off as she suddenly grabbed hold of all three they foolishly tried firing a few bullets at her but this of course did nothing to stop or hurt their captor in the  slightest instead Mary merely shook her head \"Tsk,tsk I gave you guys the easy way out and of course you had to go and pick the hard way very well since you like insulting others I'll show you how it feels to be the bug in the pickle jar for a while....\" Before any of them could process this Mary decided to </span></div></div>",
            "created":1460782800,
            "id":2134280,
            "title":"...normal guys ? "
        },
        "125332222112222":{
            "author_id":"advancedy",
            "author_name":"AdvancedY",
            "choices":[
                "Mary made them suffocate by farting on them.",
                "They got swallowed by Mary's asshole."
            ],
            "content":"<div class=\"\"><div> <span>Without even changing an expression of her face, Mary swiftly lifted the back of her skirt upwards and pulled back her panties with one hand and dropped the criminals inside of her panties letting them know that she will enjoy this. Then she pulled back her panties, and patted her butt, positioning criminals right between her butt cheeks. ‘You feel really good down there’, she stated and laughed at the tiny people’s misery. ‘I could easily sit down on the ground and have you crushed inside my panties, but I am not that kind of person’, said Mary.</span></div></div>",
            "created":1473397200,
            "id":2207942,
            "title":"She playfully dropped them in the back of her p..."
        },
        "12533222212":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Have some fun;play around with a few of the people in town ",
                "Get to work with finding those bombs"
            ],
            "content":"<div class=\"\"><div> <span>It was a quiet peaceful day in Fawcett City,home of the mighty Marvel Family with Captain Marvel(or Shazam)busy aiding the Justice League on one of their missions the entire city was in a uproar of crime waves and teenager Mary Marvel with her all white costume and fresh off from joining the Super Buddies group(Captain Atom,Fire,Booster Gold etc) was the only one capable of containing them all following a long and exhausting day's work she flew to the newest Science Museum to learn about Star Labs' new prototype a device able to increase the size and height of any person or people in her Mary Batson identity she was among the curious onlookers as the scientist in charge unveiled it then came a explosion as the Exit Door burst open and who else came waltzing in but Dr. Sivana,famed archenemy of the Marvels \"Ha,ha,ha,ha,ha attention good people of Fawcett City Time to unveil my latest scheme......\" Mary jumped up <br>\r\n\"Holy money Dr. Sivana! What is he doing here? Time to change into.....oh wait I can't change into Mary Marvel with all these people around! Guess I have to wait around for a bit until the crowd clears.\" As the mad scientist revealed he had planted bombs all throughout the city and they were triggered to go off in about five minutes while all the people were panicking non stop Mary was thinking hard of a solution \"Even with my speed I can't locate all those bombs in time I have to think of another solution oh wait.......\" And quickly she ran and hid behind a certain and whispered \"Shazam!\" Changing into her superpowered alter ego and quickly amid the startled crowds and Dr. Sivana who cried out <br>\r\n\"What the- Mary Marvel?\" Grabbed hold of the device and flew off with it to a distant location then she pressed a button at the center and watched amazed as her body started changing<br>\r\n\"It's working I'm getting bigger!\" Indeed she was larger and larger she became and in her excitment she accidently destroyed the device finally the teenaged heroine reached the full terrifying height of 70 feet and looked around her now tiny surroundings \"Wow! Billy will never believe this but now for the task at hand I got to find and destroy those bombs although I always wanted to be a bit bigger.....\" Mary was torn between the task at hand and having a bit of fun beforehand what does she do?</span></div></div>",
            "created":1473397200,
            "id":2207947,
            "title":"Updated white skirt version"
        },
        "125332222121":{
            "author_id":"advancedy",
            "author_name":"AdvancedY",
            "choices":[
                "Plays along for a bit.",
                "Refused and decided to have some fun with police."
            ],
            "content":"<div class=\"\"><div> <span>Despite the threat of bombs falling down on the city and causing a great damage to civilians and buildings, Mary Marvel was still a young girl and her desire to have some fun in her new giant form was greater than her responsibility of protecting the city, ‘everyone deserves some fun time, especially me’, she thought. Mary smiled as she started to come up with tons of ideas of how she could amuse herself in this city. ’I could pretend to be giant monster, or opposite of it – I could capture criminals and punish them, I could also just play with people, there are so many of them running around my boots’, on Mary’s face appeared a smile of a child, who was coming up with a game to play.<br>\r\n<br>\r\nSuddenly, Mary’s thoughts of having fun were interrupted by a quiet voice, coming from the police car down on the ground. The police chief spoke in loudspeaker, ‘Can you hear me, giant Mary Marvel’. Mary giggled at his voice, which sounded very quiet and high-pitched, ‘yes, I can hear you, little officer’. ‘Good, because I have to tell you that you are causing the destruction to the city with your gigantic size’, officer continued speaking into his loudspeaker, ‘but this was on accident, because streets are too narrow to fit in and people and cars are too small to notice’, ‘Whether it was by accident or on purpose, you are under arrest’, he finished and Mary</span></div></div>",
            "created":1473397200,
            "id":2207957,
            "title":"Have some fun;play around with a few of the peo..."
        },
        "1253322221212":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Panties(back side)",
                "Down her cleavage"
            ],
            "content":"<div class=\"\"><div> <span>With her hands on her hips the gigantic Mary Marvel giggled her laughter causing a few buildings to wobble and a car alarm or two went off \"Well I don't think so Mr. Police Officer you see I'm really big now and without Captain Marvel this city is prey to every type of criminal out there these people need someone to protect them with with my new size no villain would dare challenge me but no worry this new found power and height hasn't gone to my head I'm still the same ole good Mary Marvel I want to have a little fun with you first cutie before I go searching for those bombs....\" Before the officer can even think of what to say she gently picked him up and this really terrified him <br>\r\n\"Now,now wait one minute Miss Marvel you can't....\" He started reaching for his gun which Mary giggled at <br>\r\n\"Bullets can't affect me at regular size what makes you think they can hurt me like this? Now there's no reason to be scared mister I'm only to play a game with you.\" The officer was really freaking out as he screamed <br>\r\n\"No,no wait Miss Marvel....don't do anything foolish....no what are you doing no don't put me in there please......\" He begged as the cute teenaged superheroine playfully dropped him right in her</span></div></div>",
            "created":1473397200,
            "id":2208064,
            "title":"Refused and decided to have some fun with police."
        },
        "12533222212121":{
            "author_id":"advancedy",
            "author_name":"AdvancedY",
            "choices":[
                "caught the officer and dropped him in her boot.",
                "passed gas."
            ],
            "content":"<div class=\"\"><div> <span>Little police officer was terrified. He was screaming and wiggling in Mary’s fingers while being brought towards the back of superheroine’s white panties. Mary’s butt was quite big while in normal size, but now it was just gigantic. Mary quickly pulled back her panties, revealing her humongous butt cheeks to the poor officer ‘Hope you like what you see, otherwise it would suck to be you’ Mary laughed and dropped the officer inside ‘No…please…wait!’ he officer freaked out, but he landed on thick fabric of Mary’s panties ‘It’s time to turn off the light’ Mary giggled, releasing her panties and letting the back of her skirt fall back on it’s place ‘That’s better!’ she smiled as she adjusted officer position with her finger just so he could be right between her enormous butt cheeks. When everything went dark, officer got really scared and in a moment, Mary’s huge finger, right through her panties pushed him deeper between her gigantic butt cheeks ‘How could such a nice girl like Mary Marvel do that to me?’ officer cried. Mary was thinking what to do next, when she saw another officer on the ground ‘Oh look at you, you are jealous to your partner down there’ she pointed to her butt ‘Well, good Mary Marvel is going to save the day! If you like dark and smelly places, I got one for you – my good old yellow boot!’ Marry laughed at tiny officer, who just began to flee when suddenly she felt that she really needs to fart. ‘It is so bad time for it’, she said and</span></div></div>",
            "created":1473397200,
            "id":2208074,
            "title":"Panties(back side)"
        },
        "125332222121212":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Tickle,tickle,tickle She begins tickling him nonstop ",
                "She brings him up for a big wet one then tickles him "
            ],
            "content":"<div class=\"\"><div> <span>Mary Marvel gasped loudly as she released a very loud fart Pfffffffffffftttttttttt! \"Oh excuse me!\" She cried out quite embarrassed everyone else on the ground was passed out completely and her gas blast had destroyed a few buildings and blown up a couple of cars as well the officer on the ground held his nose trying yo block out the horrible smell<br>\r\n\"Oh my God what did you eat Mary Marvel?\" He barely choked out she bent down and scooped him up towards her face \"Don't wait I...I didn't mean to offend you or anything....\" He started pleading thinking he was about to end up like his partner imprisoned in her panties but Mary giggled as she looking down she carefully sat down her enormous butt crushing a few more cars and causing another earthquake the police officer in her underwear already suffering the after effects of her fart screamed as he was helplessly tossed around meanwhile with the officer pleading for his life in the palm of her hand Mary decides to.......</span></div></div>",
            "created":1473397200,
            "id":2208081,
            "title":"passed gas."
        },
        "1253322222":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Yes",
                "Never heard of her"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Black Alice maybe?</span></div></span></div>",
            "created":1414299600,
            "id":1878142,
            "title":"100 feet very bad for Fawcett City"
        },
        "12533222222":{
            "author_id":"supermario5",
            "author_name":"Brown",
            "choices":[
                "Okay let's try it",
                "Once more not familiar with her next!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>If not her then maybe someone else like Miss Martian from the comics not the show Young Justice,the half cousin of the famed Martian Manhunter himself who shares all of his powers but is secretly a dreaded White Martian herself? </span></div></span></div>",
            "created":1473224400,
            "id":2207407,
            "title":"Never heard of her"
        }
    },
    "info":{
        "author_id":"hawkergts",
        "author_name":"RisingFan",
        "brief_description":"Some of the hottest Marvel and DC heroines as giantess\r\n",
        "created":1217350200,
        "description":"<td align=\"left\" class=\"norm\">I deleted the original by accident so I reposted it here<br>\r\nsome of the hottest female heros are giant<br>\r\nmale heros can be shrunk<br>\r\ndo what you want<br>\r\n</td>",
        "id":1456560,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1602626760,
        "modified":1602626760,
        "pretty_title":"Super Hero Giantess"
    }
}