{
    "chapters":{
        "1":{
            "author_id":"blaziken",
            "author_name":"Thedude404",
            "choices":[
                "A Eevee.",
                "A Snivy",
                "A Tepig",
                "A Oshawott",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>In the Unova region live an anthro Keldeo name Tusk. Tusk is well known, in the region, to change any young trainer into a pokemon and have fun as well.<br>\r\n<br>\r\nHe was also known to be a great swordsman as he holds a sword whenever he get's challenge into battle. Tusk was known to win all of his battles.<br>\r\n<br>\r\nAs Tusk look around the unova region. Tusk notice a young trainer with a brown shirt, shorts, blue eyes and brown hair. <br>\r\n<br>\r\nThe young trainer's name is Coltron. Tusk just smile to himself. \"A young trainer all by his lonesome. I think I found my next victim. Let's have some fun with him\"<br>\r\n<br>\r\nTusk then sneaks up to Coltron. Coltron had just started his journey, as a pokemon trainer. He had just got his first pokemon from Professor Juniper.<br>\r\n<br>\r\n\"Well I should get going then. There's a lot of pokemon for me to capture\" But before he could. Coltron was suddenly grab and turns around.<br>\r\n<br>\r\nHe see's an anthro Keldeo with a red cape grabbing him. \"Who are you?\" Coltron ask. \"My name is Tusk and I'm going to have fun with you\"<br>\r\n<br>\r\nColtron tries to get out of the grip. But Tusk's grip was too strong. Tusk then gather his energy and zaps Coltron. Coltron felt the zap and fall on his knees. He suddenly feels weird.<br>\r\n<br>\r\n\"W-what did you do to me?\" Coltron ask. \"You'll see soon enough\" Coltron then begins to change. But what did he change into?</span></div></div>",
            "created":1453852380,
            "id":2094886,
            "title":"Coltron meets Tusk"
        },
        "15":{
            "author_id":"blaziken",
            "author_name":"Thedude404",
            "choices":[
                "A Pikachu",
                "A Bulbasaur",
                "A Charmander",
                "A Squirtle",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's more choices</span></div></span></div>",
            "created":1453852440,
            "id":2094887,
            "title":"Other"
        },
        "155":{
            "author_id":"blaziken",
            "author_name":"Thedude404",
            "choices":[
                "A Caterpie",
                "A weedle",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices</span></div></span></div>",
            "created":1453852500,
            "id":2094888,
            "title":"Other"
        },
        "1553":{
            "author_id":"blaziken",
            "author_name":"Thedude404",
            "choices":[
                "Miltank",
                "Tauros",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices</span></div></span></div>",
            "created":1459803780,
            "id":2127647,
            "title":"Other"
        },
        "15531":{
            "author_id":"blaziken",
            "author_name":"Thedude404",
            "choices":[
                "Follow Tusk.",
                "Find a new home"
            ],
            "content":"<div class=\"\"><div> <span>Coltron's body begins to grow pink fur as it begins to spread through out his whole body. His hands and feet then begins to fuse together as they change into his new black hooves. Coltron then felt pressure coming from his belly as it begins to bloat. His shirt then rip as his under belly becomes a cream color and four pink udders grew out.<br>\r\n<br>\r\nHorns then pops out on top of his head as his face changes into his new muzzle and his eyes change to a blue color. His pants and shirt then rips as they become prices of fabric on the floor. His ears then went to the top of his head and become pointy. Last a long tail, with a black ball, grew out from his behind as his gender change to female.<br>\r\n<br>\r\nColtron look over his, or hers, new body and reconcile the pokemon she change into. \"I'm a Miltank\" said Coltron. \"Yep you like it? I figure I give you a new perspective 9f life from the opposite gender\" said Tusk. \"Change me back\" said Coltron. \"Nah I think I'll leave you like that. Oh and your name has changed as well since your no longer male. Bye\" Tusk then left.<br>\r\n<br>\r\nColtron, or Coltrena now, wonder if she should follow Tusk or find a new home to live at. Maybe she should find a nice farm to live on.</span></div></div>",
            "created":1459804440,
            "id":2127657,
            "title":"Miltank"
        },
        "15533":{
            "author_id":"blaziken",
            "author_name":"Thedude404",
            "choices":[
                "Anthro Keldeo",
                "Other pokemon."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Tusk change Colton into an anthro Keldeo like him?</span></div></span></div>",
            "created":1474224780,
            "id":2211660,
            "title":"Other"
        },
        "155331":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Coltron and Tusk try to fight each other",
                "Coltron and Tusk explore their now shared body"
            ],
            "content":"<div class=\"\"><div> <span>Coltron felt the shock flow through him, making his body shake. It felt like every atom, every molecule in his body was vibrating and urging to be changed. His hands gripped the grass, his finger nails digging into the mud. Coltron cried out in pain, \"No!\" He closed his eyes tight, trying to will his body to stop shaking. Miraculously, it felt like his insides were slowing, not vibrating so erratically. <br>\r\n<br>\r\nTusk looked on at the human in surprise. \"How are you...\" He did not finish the question, too caught up in watching this human boy fight back the change. He had never seen a human with such, determination. Others had tried but easily fell victim to the transformation. This one, Coltron, was different somehow. He crossed his arms and taunted, \"The change is only inevitable. Even I, Tusk the great Keldeo, could not stop the change once it has started.\"<br>\r\n<br>\r\n\"Shut up!\" Coltron yelled through gritted teeth.The pain racking his body was nothing like he had experienced before. His muscles and tendons wanted to unweave. His bones wanted to split apart, into something new. It was a losing battle, and he knew it. Coltron could not stop whatever this weird pokemon-human had done to him. But based on his gloating tone, he figured that this Tusk could not control the changes in his body either. He looked up at the creature in front of him, imagining himself like him. He immediately felt his body begin the change.<br>\r\n<br>\r\nColtron breathed heavily as his clothes ripped away. He felt his toes glue together, becoming hard and stiff. He stared at the human-looking Keldeo, who appeared genuinely surprised by his changes. Coltron smirked and took a chance. He charged the pokemon-human Keldeo, taking the creature completely by surprise. Tackling him to the ground, he held on tight as Tusk tried to wiggle free. <br>\r\n<br>\r\nTusk was half embarrassed for being taken by surprise and half impressed by this human's initiative; he growled, \"Let go of me human!\" He struggled under Coltron's surprising strength. He squirmed and kicked until he felt a sudden shock pass through to him. All at once he stopped, feeling his own self begin to vibrate, to change. Tusk cried out, unfamiliar with the pain a change brought on. He and the human both yelled out in anguish, until it stopped all at once. The pain was gone. <br>\r\n<br>\r\nEven though the pain had vanished, Coltron still ached, his body racked by phantom pain. He had no idea what he was now, but he knew he was different. This thing had forced him to change into something. And, the same thing was lying close by, so close that it must have been cutting off the circulation to his left arm and leg. Coltron glared at the creature, but he took note that he did not feel any extra weight or body heat coming from it. <br>\r\n<br>\r\nTusk felt eyes on him; he turned to see the changed human staring at him angrily. He appeared to be a mirror of Tusk's own face. Tusk decided that this human would have to pay for its insolence, for ruining his fun. He took joy in the fact that the human was still breathing heavily from the change. He then realized that his own chest was breathing in time with the changed human, and he wondered why. The answer came to him immediately when he glanced at his body. This changed human's head was attached, just to the right of his own head. The human was sharing his body. Tusk knew that was not quite right because he became aware of a different, unsettling problem. The right half of his body felt missing, even though he could clearly see it stretched out before him. Tusk gulped, realizing what had happened. The human had caught him in the transformation. They had been transformed together, fused together. <br>\r\n<br>\r\n</span></div></div>",
            "created":1577664660,
            "id":2766694,
            "title":"Two-headed Anthro Keldeo"
        },
        "1553312":{
            "author_id":"blaziken",
            "author_name":"Thedude404",
            "choices":[
                "Coltron and Tusk start to know each other",
                "They were suddenly attack",
                "Readers choice."
            ],
            "content":"<div class=\"\"><div> <span>\"Well this is great. First I met this weird Keldeo who tried to change me, against my will, and now I'm sharing the same body aa him.\" Said Coltron<br>\r\n<br>\r\n\"Well I'm not happy about it as you are human.\" Said Tusk. \"The names Coltron.\" Said Coltron.<br>\r\n<br>\r\n\"Alright Coltron. I am Tusk if you have forgotten. Were going to have to work together.\" Said Tusk.<br>\r\n<br>\r\n\"Why?\" Coltron ask. \"Because if we don't. Then we'll be stuck like this. Now let's see what we can do with our share body.\" Said Tusk.<br>\r\n<br>\r\n\"Alright then.\" Coltron and Tusk then explore their share body together. They learn a few things.<br>\r\n<br>\r\nColtron can move the right side of their body and Tusk can move the left side of their body.<br>\r\n<br>\r\nSo the two of them have to be in perfect sync to move. It took a few tries. But the two found a way to work together.<br>\r\n<br>\r\n\"I can get use to this.\" Said Coltron. \"Me too. But I also want my old body back as well.\" Said Tusk.<br>\r\n<br>\r\n\"Me too. But as a human.\" Said Coltron</span></div></div>",
            "created":1577799720,
            "id":2767437,
            "title":"Coltron and Tusk explore their now shared body"
        },
        "15533121":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Coltron and Tusk go to Coltron's human house (He no longer exists)",
                "Coltron and Tusk go to Coltron's human house (His family is surprised)"
            ],
            "content":"<div class=\"\"><div> <span>\"Glad we are in agreement Coltron.\" Tusk nodded. There was something he liked about this human; Tusk thought it might have been his fiery, ambitious spirit. This was the only human to have taken some measure of control over the change, and on top of that, he had managed to get the better of him. While Tusk was not happy to have been mixed into the transformation, he could not deny the results. He felt powerful, far more powerful than before. He smiled to himself, imaging himself being able to beat all three of the Swords of Justice at once, even in their stronger, anthro forms. However, Tusk realized that the increase in strength came with an equally large drawback. He had to share this power, share this body, with the human. <br>\r\n<br>\r\n\"Okay, we are standing now.\" Coltron said aloud. Though, he felt like standing was unsteady for them. He could not feel Tusk's half of their body, and so it was like he was leaning into an invisible wall. \"Separate us, and turn me back into my human body.\" <br>\r\n<br>\r\n\"Why so soon?\" Tusk questioned. \"We have yet to see our full potential. Do you not feel the power our form brings?\"<br>\r\n<br>\r\nColtron had to admit he felt... strong, like an energy was pulsing through him. He wondered for a moment if all Pokemon had that similar sensation. \"Yes,\" he admitted, \"I feel strong. Its like nothing I have ever experienced.\" Coltron then turned to look at Tusk in the eyes. \"But, I want my human body back.\" <br>\r\n<br>\r\nTusk frowned, \"Well... there is slight problem.\" he looked down at their hoove-feet for a moment before turning his gaze back to Coltron. \"The Change is no small feat of mine. I can only cause another to transform every few... weeks or so.\" <br>\r\n<br>\r\n\"Weeks!? Are you kidding me?\" Coltron glared at his other half.<br>\r\n<br>\r\n\"Unfortunately not.\" Tusk bitterly admitted. \"You and I are bound together until the power returns to me, whether we like it or not.\" <br>\r\n<br>\r\nColtron sensed his other half was telling the truth, to his dismay. \"I was supposed to start my journey; I was going to get my first Pokemon.\" He spoke, not hiding accusing tone.<br>\r\n<br>\r\n\"This was not solely my fault Coltron.\" Tusk retorted. \"Grated, I was the one who caused you to begin changing, but you were the one who somehow managed to take charge of it. A noteworthy feat. And not only that, you brought me into the change with you.\" <br>\r\n<br>\r\n\"All I wanted was to get back at you. This was not the result I had in mind.\" Coltron argued.<br>\r\n<br>\r\n\"It does not matter at any rate. We are, as you humans say, 'a package deal' now.\" Tusk replied. \"And, it is not as terrible as I had initially thought. I for one am eager to learn the capabilities of this shared body of ours. Oh, the foes we could challenge... the anticipation excites me.\"<br>\r\n<br>\r\n\"Okay...\" Coltron agreed.<br>\r\n<br>\r\nTusk looked at the human quizzically. He knew that he had a great way of getting others to see his point of view, but he had not expected Coltron to agree to quickly. \"I'm glad you see things my way.\"<br>\r\n<br>\r\n\"But first,\" Coltron interjected. \"I need to tell my family that I will be out of contact for a few weeks.\"<br>\r\n<br>\r\n\"Out of the question. We are not visiting some human town.\" Tusk balked at the idea.<br>\r\n<br>\r\n\"Like you said...\" Coltron smiled, \"We are a package deal; I am quite literally your other half now. If you want me to help you with challenging foes, you will let me speak with my family.\" Before Tusk could speak, he continued. \"Otherwise, it will be a very long few weeks. We...\" He emphasized 'we' as he spoke, \"...have no choice but to work together. For either of us to do anything we want, we both need to cooperate. To move our body effectively, we will need to learn how to move in sync.\"<br>\r\n<br>\r\n\"I see you point.\" Tusk frowned for a moment. This human was ambitious and intelligent; the same qualities he admired in himself. He found himself smiling despite his frustration with his 'other half' not simply agreeing with him. \"Fine. We are partners in a sense, and partners help one another. Where does your family live?\" </span></div></div>",
            "created":1581964260,
            "id":2788700,
            "title":"Two-Headed Keldeo: Stuck With Each Other for Now"
        },
        "155331211":{
            "author_id":"blaziken",
            "author_name":"Thedude404",
            "choices":[
                "A trainer finds them.",
                "A pokemon finds them.",
                "Readers choice."
            ],
            "content":"<div class=\"\"><div> <span>In a few hours. They make it back to Coltron's home. Coltron opens the door as he calls for his mother.  <br>\r\n<br>\r\n\"Mom I'm home.\" But there was no answer. They begin to explore Coltron's home as Tusk was impress. <br>\r\n<br>\r\n\"You have a nice home.\" As they look around. Coltron finds a family photo. But there was something off.<br>\r\n<br>\r\nThere was his mother, father and his brother Brendan. But he wasn't in the picture as he pick it up.<br>\r\n<br>\r\n\"That's funny. I should be in this picture. I remember taking this picture with my family. <br>\r\n<br>\r\nHe look around and sees no other pictures of himself. Coltron was worried. \"What's going on here?\"<br>\r\n<br>\r\nHe then heard a voice. But it was almost a scream. It was his mother standing there. \"Wh-who are you?\" She ask.<br>\r\n<br>\r\n\"Mom it's me Coltron. Your older son.\" Said Coltron. \"What are you talking about? I only have one son. I don't know a Coltron.\"<br>\r\n<br>\r\nColtron was shock. Tusk felt it was time for them to go. \"We should leave. Sorry to disturb you mam.\"<br>\r\n<br>\r\nThe two headed anthro Keldeo then left. Coltron was still in shock. \"How can mom forget me. It's like I don't exist.\" Said Coltron.<br>\r\n<br>\r\n\"Well for what I saw. I think you don't exist.\" Said Tusk. \"But how? I'm still here.\" Said Coltron <br>\r\n<br>\r\n\"Hmm I guess, when we fuse, your existence got erase from everyon's memory.\" <br>\r\n<br>\r\nColtron was still upset. \"My life can't get any worse.\" Tusk felt sorry for his new friend.<br>\r\n<br>\r\n\"We need to get moving before a trainer finds us.\" Coltron agree as they left his hometown.</span></div></div>",
            "created":1582248180,
            "id":2790413,
            "title":"Coltron no longer exist"
        },
        "155331212":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Coltron and Tusk explain the truth",
                "Coltron and Tusk explain a lie"
            ],
            "content":"<div class=\"\"><div> <span>\"Not far from here.\" Coltron answered. Before being transformed by his 'partner', he had been exploring the area directly around his home town, like he had done many times before. He enjoyed hiking in the woods and spotting the various Pokemon that resided in it. \"I live just this way.\" Coltron pointed ahead as he took a step. He immediately regretting the action. <br>\r\n<br>\r\nHe and Tusk were suddenly unbalanced. Each reflexively threw the arm they had control over into the air. Coltron then tried to lean their torso one way, while Tusk attempted to do so in a different way. After a few long moments of struggling to remain upright, they tumbled backwards, landing on their bottom. Coltron had the sudden revelation that getting to his family's home would be an immensely difficult task. He had miscalculated just how much he and Tusk were forced to cooperate just to move in a straight line. His body felt like a two-man jail cell with Tusk as his jail-mate. <br>\r\n<br>\r\n\"Apparently, moving our body in sync is more difficult than either of us previously thought.\" Tusk admitted. He had high hopes for using his greater powers in combat. But, that power seemed to come with a monumentous draw back. <br>\r\n<br>\r\n\"Well we don't have a choice now do we.\" Coltron spat. He pressed his hand into the dirt to raise himself, but only succeeded in half lifting their butt off of the dirt. \"Will you help me? We need to stand up again.\" <br>\r\n<br>\r\nTusk grumbled, but he did comply with the request. They spoke back and forth, \"Wait a second. Shift your leg. I am bracing my arm so you move. Hold still. Now rise, slowly. They managed to coordinate their body back into standing a position again. \"Now, lets start walking forward, slowly.\" Tusk stated. <br>\r\n<br>\r\nOne wobbling foot, and then the next. They walked in this measured, hesitant fashion for quiet some time, making sure to comment to each other on what they were doing before engaging in the action. While slow, Coltron and Tusk managed to make progress towards their destination, Coltron's family home. <br>\r\n<br>\r\nThe woods gave way to an open country side, with a few houses scattered around. Cars could be heard driving winding road every few minutes. Coltron's house was nearest the woods, giving him and Tusk ample hiding as they approached. <br>\r\n<br>\r\nHis mother was easy to spot. She was watering her garden and taking time to pull weeds that had taken root near her plants. So as not to frighten her, Coltron spoke in a hushed tone to his other half, directing them to hide behind a nearby bush. Safely obscured, Coltron spoke up, \"Uh... Mom...\" <br>\r\n<br>\r\nHis mother stood up, and looked around for the sound of her son's voice. \"Coltron?\" <br>\r\n<br>\r\n\"Yeah, its me. Uh, promise you won't freak out when you see me.\" He spoke hesitantly. <br>\r\n<br>\r\n\"What do you mean? Are you covered in mud again?\" She slowly approached the bush that he and Tusk were hiding behind. <br>\r\n<br>\r\n\"No, nothing like that. I just have a new... friend.\" He answered as he and Tusk stood up, revealing themselves to her. <br>\r\n<br>\r\nHis mother dropped the watering can, spilling the water over the soft ground. She placed one hand over her mouth as she gasped at her son's appearance. \"Coltron? What happened?\" She rushed over to him, and then suddenly stopped an arm's reach length away. She looked back and forth between Tusk and Coltron, seemingly unsure whose head to look at.<br>\r\n<br>\r\n\"Its me mom.\" Colton smiled. \"And this...\" he pointed to his left, \"is my new friend, Tusk.\" His tone indicated that his other half was not exactly a friend. <br>\r\n<br>\r\nHis mother opened his mouth several times, but no words escaped. She closed her eyes for a few second, and then opened up. \"What happened?\" </span></div></div>",
            "created":1583695500,
            "id":2798443,
            "title":"Two-Headed Keldeo: Coordinating is Hard"
        },
        "1553312122":{
            "author_id":"ctbro",
            "author_name":"Ctbro",
            "choices":[
                "Coltron and Tusk practice in an open clearing",
                "Tusk leads them to his small camp"
            ],
            "content":"<div class=\"\"><div> <span>Coltron went on to explain to his mother the situation that lead to his and Tusk's current predicament. He decided against telling her all the details, excluding the fact that Tusk had thrust the transformation on him involuntarily. This was to his other half's clear surprised, but he did not correct Coltron. \"Yeah Mom, Tusk offered me the chance to become a human-like Pokemon like him. But, things obviously went sideways.\" He waved his hand at their joint body. \"I don't know if we were too close, but my transformation... blended into him. Now we're stuck with each other.\" <br>\r\n<br>\r\nHis mother appeared to be listening quietly; her face remained a mixture of shock and worry. \"But... how do you get apart?\" <br>\r\n<br>\r\n\"If I may...\" Tusk hesitated. \"My transformation power will return to me, but it takes time. It will be at least a few weeks.\" <br>\r\n<br>\r\n\"No... the professor.\" His mother shook her head. \"We must call him. He will know...\" She was already at the backyard door. <br>\r\n<br>\r\n\"Wait Mom.\" Coltron called out, making her pause. \"We would prefer to not involve him.\" He took a moment, wording his next sentence carefully. \"Besides sharing a body... we're clearly some hybrid human-pokemon. I think it would be best to not involve the professor. I trust him, but I don't trust his ability in keeping secrets.\" In truth, Coltron was very concerned about being found out and experimented on. <br>\r\n<br>\r\nHis mother seemed to understand the darker undertone of what her son was suggesting. \"Okay... then what do I do.\"<br>\r\n<br>\r\n\"Wait... unfortunately. I just wanted to let you know about my... our condition.\" Colton continued. \"Its probably best that we stay hidden, and when Tusk's transformation power returns, I will come back fully human again.\" <br>\r\n<br>\r\nHis mother was teary-eyed as he walked back to her son and Tusk. She wrapped them in a hug. \"Okay Coltron. You two be safe, and come back whenever you need something.\" <br>\r\n<br>\r\nColtron held onto his mother for a few more moments, before he pulled out of the hug. He could feel tension along his torso, and he knew that Tusk was uncomfortable with the show of affection from a stranger. But, Coltron knew that was his mother. She care deeply for people and pokemon, especially her family. And in a sense, Tusk was a member of the family now. \"Thanks Mom.\" <br>\r\n<br>\r\nWith that, Coltron and Tusk carefully turned around and walked back into the cover of the forest. Coltron knew that that next few days were going to be difficult. Until they learned to move together, more efficiently, they were easy targets. </span></div></div>",
            "created":1584475620,
            "id":2802883,
            "title":"Two-Headed Keldeo: Not the Whole Truth"
        }
    },
    "info":{
        "author_id":"blaziken",
        "author_name":"Thedude404",
        "brief_description":"A story where a young trainer meets an anthro Keldeo who changes him into a pokemon",
        "created":1453851840,
        "description":"<td align=\"left\" class=\"norm\">Tusk is a legendary anthro Keldeo who loves to change humans into other pokemon for fun. He encounters his next victim. A trainer, name Coltron, and decided to change him into a pokemon as well and have some fun with him as well. </td>",
        "id":2073218,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1584475620,
        "modified":1584475620,
        "pretty_title":"Coltron and Tusk"
    }
}