{
    "chapters":{
        "1":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "choices":[
                "Will ends up on an Island changed. ",
                "Will is stranded in the middle of the ocean ",
                "Will begins to grow scales ",
                "Other ",
                "Other "
            ],
            "content":"<div class=\"\"><div> <span>A streak of lightning split across the sky after a roar of thunder. The rain poured down like hail as the monstrous waves crashed against the sides of the white yacht that floated without course in the middle of the ocean.  Will Mason, a young sailor, stood at the mast trying to direct his ship through the chaos. In his few years of sailing he had never come across anything like this. Just five minutes ago it was as pretty as a postcard image. Then all of sudden it’s the perfect storm. <br>\r\nWill’s boat cut through another wave coming down with a huge splash. The rain worsened falling harder. Will lost all visibility of his surroundings. He hung on the mast for dear life as he heard a rolling booming crash coming toward him. The floor disappeared beneath his feet.  Will tumbled down into the dark waters below as a rogue wave took his only refuge. <br>\r\n</span></div></div>",
            "created":1367754360,
            "id":1584486,
            "title":"Sunken "
        },
        "11":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "choices":[
                "Will sees a passing ship ",
                "A day later still on the island "
            ],
            "content":"<div class=\"\"><div> <span>  Will desperately crawled up on the sandy beach spiting up water and blood. He felt strange. He coughed up more water, each cough he felt himself changing, getting less masculine. He had somehow lost most his clothing in the ocean.  His pants were nearly destroyed barley clinging to his waist. He wore a life jacket that was getting bagger by the second against his already bare chest. Sand stuck to his legs now ever so smooth. He felt his hips crack and expand as his thighs grew wider. His butt enlarged causing an odd ripple through his back. His arms grew smaller completely losing any trace of masculinity. Will fell to his stomach as the transformations slowly continued, Will coughed up more water feeling the black strands of his hair extend painfully out of his head. Will’s vision became completely blurred. A large crack echoed through his skull returning his vision. Will parted his now puffy soft lips; He could feel the new softness of his face .A wave of short black hair brushed against Will’s cheek. <br>\r\n“What’s,” He whispered.<br>\r\nWill lost his breath as he felt something awful happening in his groan area. Will pressed his head down against the sand. His penis and testicles were beginning to reseed in into his body. As they reseeded two mounds began to grow on Will’s chest. They grew large quickly overcoming the lifejacket. Will took it off gasping at the unnatural scene of two breast forming on his chest.  His manhood continued to reseed causing his breast to extend further. They grew and grew, his nipples growing hard and erect. Will’s penis had disappeared completely replacing itself with a fully formed vagina. The transformations ceased as Will lay on his back bewildered.   Will put his hand on his rather large right breast, He gasped at the tender softness.  Will couldn’t believe it. Will squeezed the soft mound tighter. It rose and lowered with his each breath. Will let his left hand slowly travel down his curvy soft exterior. His stomach was flat and warm. He reached his newly formed vagina. He gasped with erotic joy at the sensation. He threw his hand away the sensation to foreign. He put his head back and stared up to the sky deeply.     <br>\r\n“I’m-I’m a girl?” He muttered the horrific truth. <br>\r\n“I’m a girl.” He repeated as the next set of waves crashed onto the shore. <br>\r\n</span></div></div>",
            "created":1367754600,
            "id":1584488,
            "title":"Will ends up on an Island changed. "
        },
        "112":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "choices":[
                "Wake back up on the beach ",
                "Wake up in the Jungle"
            ],
            "content":"<div class=\"\"><div> <span>The sound of crashing waves awoke Will. The sky was young, the sun was rising. Will let out a yawn, his chest felt was heavy, like there were weights on him. Will glanced down and remembered. He had grown breast. He had transformed into a woman. His body was stiff and tired. Will didn’t want to move, didn’t want to come to full realization of what had happen to him. He just wanted to lay, stay on the beach and not move. He closed his eyes and began to fall back into sleep when his stomach began to growl. His eyes shot back open. He was hungry, starving for food. He couldn’t remember that last time he ate before the storm. Could just lay here and let the hunger finish me off. Will thought.  No, he was fighter always will be and always has been. But he hadn’t always had boobs on his chest; he hadn’t always had a vagina. Hadn’t always been a woman. Will closed his eyes and went back to sleep. </span></div></div>",
            "created":1367809560,
            "id":1584950,
            "title":"A day later still on the island "
        },
        "13":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "choices":[
                "Transform "
            ],
            "content":"<div class=\"\"><div> <span>Will awoke to the smell of sea water and rock. He opened his eyes and looked across a gray smooth surface, a blue atmosphere in the distance. He closed his eyes, breathed in and got up. He yawned while his right hand rubbed the smooth marble like surface of whatever he ended up on. <br>\r\nWhere the hell am I He wondered as he scratched his abnormally smooth chest. Will raised an eyebrow and looked down at his chest. It was remarkably smooth. Will noticed something else, he was naked. His life jacket was gone, his clothing, everything down to his watch missing. But his clothing was not the only thing he was missing. His penis was gone. It was gone. Will spread his legs in panic,  nothing was there. His Penis, his balls, NOTHING. He was like a male barbie doll bare.  Will studied his body even further, He had lost his male figure, his hair had somewhat grown over. His body was smooth and petite, missing all the ingredients that made him...him.   While Will was examining his right arm he noticed something. A black tattoo of the number 42 in bold block letters. That had never been there before. Will got to his feet and looked around the ever still ocean. He looked down at the single unnatural pebble like rock he stood on and then peered over to the 42 tattoo on his arm. <br>\r\n“Where the hell am I?” As he asked the unsettling question Will lost his balance and stumbled about the rock. He caught himself and stood up. <br>\r\n“That was weird?” <br>\r\nWill felt weakness in his legs and lost his balance again. Will stumbled over the rock into the ocean. He fell in hard and started to sink toward the bottom. He tried to swim up but couldn’t, he couldn’t move his legs.<br>\r\nWill couldn't hold his breath for long, he was going to die.              <br>\r\n</span></div></div>",
            "created":1370413980,
            "id":1604632,
            "title":"Will beins to grow scales "
        },
        "131":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "choices":[
                "Discovery "
            ],
            "content":"<div class=\"\"><div> <span>Will continued to sink to the bottom. He struggled for air as he descended toward the bottom of the ocean.  Will let his hands out toward the surface wanting air, wanting to taste oxygen one last time. Then something remarkable happened. Will’s hands started to shrink and his nails began to extend. Will could feel all his insides shifting around. Something was happening. <br>\r\nAs he descended down Will felt his legs fuse together. A gel like substance excreted from his pores and surrounded his legs. Will cringed as he felt his legs meld together to form a new limb entirely: A tail. <br>\r\nAt the end of this now scaly green tail two clear, film like fins formed. Will cringed again as he felt his now covered hips and butt expand and grow. <br>\r\nWill’s back arched causing two breast to explode from his chest. Will’s stomach flattened, his face became more soft and innocent. His lips puffy and pink, his eyes a mesmerising green and hair dark red long locks. Three slits appeared on each side of his neck, Will had grown gills. Will breathed in. He stopped himself from descending. He examined himself and looked over his body. He touched his pink nipple and gasped. <br>\r\nHe was a woman, he was a mermaid.                   <br>\r\n</span></div></div>",
            "created":1370416740,
            "id":1604652,
            "title":"Transform "
        },
        "1311":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "choices":[
                "You are Number 42 ",
                "Will gets freed "
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nWill floated in the ocean not knowing what to do. This was impossible. He had transformed into a woman, a mermaid for crying out loud. Was he supposed to panic? What just happened to him saved his life. But he didn’t want to be a woman. He wanted to be him, he wanted to go back to his normal life.  Will put his hands on his soft face. He wished he could see himself, how beautiful he probably was. Will looked down at his chest. His breast were a sight for sore eyes. Not too big not too small, great for a swimmers body. He held them swimming backward. For some reason working with the fin and tail while swimming came very easily to him. It was like walking except well it wasn’t. <br>\r\nWill continued backward then stopped. He smiled. <br>\r\n“Lets take this in another gear.” <br>\r\nWill blasted forward through water. He smiled with joy as he seemingly flew through the underwater landscape. He raced past coral reefs and other sea creatures. Suddenly he heard a noise, a high pitched noise that he couldn’t resist. It was calling to him and he needed it. He raced toward the source of the sound blindly. It was above the surface and mesmerising. It was so soothing to listen to. Will’s smile was ear to ear as he reached the surface. But the moment he appeared above the surface, a net was thrown over him. <br>\r\nWill fought but he couldn’t get free. He saw a boat approaching in the distance. <br>\r\n“What’s going on!!? Whatss sfsdfj sbfdjbksdfk;snfdkl fldsn “ <br>\r\nA force of electricity sparked through the water. Will flipped and flopped and soon was out. <br>\r\n<br>\r\nThe boat approached and a sailor pulled him out of the water. He was accompanied by soldier of some sort that got on the phone while the sailor untangled  the net. <br>\r\n“Yeah we got him.” The soldier said. “Yeah we’re on our way. Subject 42 is on his way.” <br>\r\n</span></div></div>",
            "created":1370419020,
            "id":1604669,
            "title":"Discovery "
        },
        "13111":{
            "author_id":"marvelcool",
            "author_name":"D.C. les",
            "content":"<div class=\"\"><div> <span>Will awoke feeling wetness all around him. He let out a breath sending out a stream of bubbles. Will quickly floated up right. He was underwater, but he wasn’t in the ocean.Will looked around at his surroundings as a claustrophobic atmosphere settled into his soul. Thick glass surrounded him on four sides. A Device hummed over head on the exterior of the glass most likely filtering the water. <br>\r\nWill was in a tank. A large glass tank. White lights were installed under the flooring of the tank to illuminate interior. Will looked outside of the tank. As far as he could tell he was in a large grayish room that was completely empty. The glow of the tank seemed to be the only light. Will swan to every side of the tank trying  to find a way out but did not discover one. Will raised his right hand to eye level studying it. <br>\r\nI wonder how strong I am? Will thought. <br>\r\nWill cocked his arm back, prepared to punch when a voice stopped him in his tracks.<br>\r\n“I wouldn’t do that if I were you.” An deep old said. <br>\r\nWill spun around covering up his breast to see the source of this voice. An old man in a lab coat stood in front of the Tank writing down notes in a clip board. <br>\r\n“Simulates natural Female behaviors.” He said writing down on his clipboard. <br>\r\nWill swam closer to the side of the tank the old man was on. “Who are you?” Will asked. <br>\r\nThe doctor looked Will in the eyes. “My name is Dr. Fred Sanders.” <br>\r\n“What did you do to me?” Will asked. <br>\r\n“I didn’t do this to you the people I work for did this to you.”  He said.<br>\r\n“Why?” <br>\r\n“Because they want to find a way to win wars with more than guns.” <br>\r\n“What?” <br>\r\nThe doctor put his pin in his breast pocket and clipboard to his side. “You’ll find out soon enough Will.”  <br>\r\nThe turned started toward the doorless gray wall. “Please sir, let me out of here.” <br>\r\nWill’s soft voice echoed. The doctor stopped and turned toward Will. “Will, I’m sorry, but you’re not going anywhere for awhile. Because unlike the other 41, you survived.” <br>\r\nWithout another word the doctor turned toward the wall. A large square shaped opening appeared in the wall and the doctor walked through it. It closed and will was left alone. He swam to a corner and cradled himself looking at the dreaded 42 tattooed on his arm.  <br>\r\n<br>\r\n<br>\r\nEND?     <br>\r\n <br>\r\n                  </span></div></div>",
            "created":1370987760,
            "id":1609383,
            "title":"You are Number 42 "
        },
        "14":{
            "author_id":"ryannfraser",
            "author_name":"Ryan",
            "choices":[
                "You reach the light",
                "The current is too strong",
                "You feel something else trying to pull you under",
                "Something comes from above, and pulls you out of the water",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You cast around, looking for any sign of safety, and spotted the vaguest of lights in the distance. Will began swimming as hard as he could towards the light, but the current kept pulling him back, he kept trying, fighting against the current. If you reached that light, there was a light source, which meant either land, or another ship. If you could reach that light, then you'd be safe. But it was a big if. </span></div></div>",
            "created":1514815380,
            "id":2435267,
            "title":"Other "
        },
        "142":{
            "author_id":"ryannfraser",
            "author_name":"Ryan",
            "choices":[
                "Will chooses to pass on",
                "Will chooses to return to his world",
                "Some other outcome occurs"
            ],
            "content":"<div class=\"\"><div> <span>You try your hardest, but you are now at the mercy of the current, being pulled into a spiral, which you realised is a massive whirlpool, you continued being pulled, the current  getting stronger and stronger, until you are pulled under. Your vision clouded by bubbles, barely able to stay conscious, you knew you were about to die. So it came as a surprise to you as the bubbles cleared from your vision, as your feet found solid ground. You opened your eyes that you didn't know you had closed, to find yourself standing in a grand chamber. Designs of seaweed and depictions of mythical beasts, such as the Kraken, were prominent on the walls and ceiling of the chamber, and at one end, a massive throne of green coral sat, and on that throne sat a woman garbed in a blue-green dress, shifting, and flowing, as if the tide itself were contained within this woman's garb. She looked at you with eyes like the very storm you had just been in. The eyes had a far-away look in them, as if the woman wasn't really looking at you, but into your very soul. <br>\r\n\"Wh-where am I?\" you asked, your voice cracking slightly with the amount of salt water you had swallowed \"Who are you?\" <br>\r\n\"Your location is of no consequence,\" said the woman \"Only your choice. You are not supposed to be here, but this is a unique opportunity for me.\"<br>\r\nIn the time it took you to blink, the woman was next to you, looking right into your eyes, a thoughtful expression on her face.  <br>\r\n\"You are supposed to be dead, Will Mason,\" said the woman \"Instead you translated from reality to abstraction. You have a choice to make here: I can send you on, to your rest in the land beyond. You have led a good life, Will Mason, and a just reward awaits you. in the Fields of Ellysium.\"<br>\r\n\"And the second option?\" asked Will. He wasn't really ready to die yet, no matter what reward awaited him. <br>\r\n\"I will send you back to your world,\" said the woman \"But I must warn you, that you shall not be unchanged. Exactly what changes you will go through, I do not know, but I do know you will gain abilities that most people only dream of. You will act as my agent in the world, I will give you tasks to complete from time to time, and if you do not complete them, our agreement ends, and you shall go to your rest. But know that the judges may not look as favourably on you then as they do now, if you should shirk these responsibilities.\"  </span></div></div>",
            "created":1514816700,
            "id":2435271,
            "title":"The current is too strong"
        }
    },
    "info":{
        "author_id":"marvelcool",
        "author_name":"D.C. les",
        "brief_description":"A collection of stories featuring a variety of transformations post a ship-wreak ",
        "created":1367753760,
        "description":"<td align=\"left\" class=\"norm\">After a fatal ship wreak, Will Mason, stumbles into a...well that's for you to decide! This is TG Accident 2(check out to TGA1 to see my earlier work.) <br>\r\nThe basis is the same, to create different transformation/TG stories. Be creative!  Make it a one-shot or an entire story. The first story will give you an outline of what you should aim for when writing. PLEASE leave reviews and add as you like. <br>\r\nENJOY!! <br>\r\n<br>\r\nAnd check out the first TG accident.  </td>",
        "id":1931954,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1514816700,
        "modified":1514816700,
        "pretty_title":"TG accident 2 "
    }
}