{
    "chapters":{
        "1":{
            "author_id":"xerox777",
            "author_name":"Zero",
            "choices":[
                "desert",
                "city",
                "jungle",
                "meadow",
                "frozen wasteland"
            ],
            "content":"<div class=\"\"><div> <span>as you walk along the street wereing your usual clothes, you see simething on the gound, so you pick it up.  there you find an odd ring. it's solid quartz.  you thik its cool and decide to keep it when you get home you put it on, just before you go you try to take it off, but find that it's stuck.  after about 15 minutes you decide to just take it off in the morning.  but at 00:00 (you prefered military time) you were teleported into a different world.<br>\r\n<br>\r\nwhen you woke up you found yourself in a</span></div></div>",
            "created":1320213900,
            "id":1216609,
            "title":"welcome to your new life"
        },
        "12":{
            "author_id":"xerox777",
            "author_name":"Zero",
            "choices":[
                "Zero",
                "Clair",
                "Blaine",
                "Sarah",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Name: Zero<br>\r\nage: 16<br>\r\neye color: seafoam green<br>\r\nsoul description: looks like a ball of solid steel, and has a crimpson aura surrounding it.<br>\r\nspecial abilities: has an immune system that would put a crocodile to shame.<br>\r\nbio:an urchin who has always had to take care of himself. much like blackstar, he tends to run right into situations without givig much thought has a hard time trusting others at first, but is always loyal to his friends.  he has ADHD(attention deffacit hyperactive disorder)(i know what it's like, i have it too).<br>\r\n<br>\r\nLikes: friends, running, fighting, a good book, music, watching the sunset and sunrise, novelty shirts(i didn't say it was your fault.  i said i was going to blame you), and having staring contests with goldfish(they can't blink).<br>\r\n<br>\r\ndislikes:<br>\r\njerks, bullies, perverts, and people who refuse to shutup about how great they think they are.</span></div></div>",
            "created":1320215520,
            "id":1216615,
            "title":"who are you"
        },
        "121":{
            "author_id":"xerox777",
            "author_name":"Zero",
            "choices":[
                "Blair",
                "liz, patty, and kid",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you wake up in an  ally way your head hurts but what really want to know is why your not in your home your head starts to hurt even more, and then, you faint.<br>\r\nWho finds you?</span></div></span></div>",
            "created":1320217020,
            "id":1216620,
            "title":"Zero"
        },
        "1212":{
            "author_id":"xerox777",
            "author_name":"Zero",
            "choices":[
                "Prof. Stein's labratory",
                "The DWMA",
                "One of his freinds' houses"
            ],
            "content":"<div class=\"\"><div> <span>The pain you felt was a blow from a demon.  He was about to finish you off when he was shot.  he died instantly.  but he brought backup.  a second demon appeared be hind the person who shot the first demon.  liz saw it comng and spoke up. \"Kid behind you.\" *Bang* the second demon fell as well.  \"well thats all of them. 24 demons in all.\" \"so that's 12 for each of us.\" \"right\" after the girls aborded all 24 of the Demon souls, known by them as keshin eggs, Patty spoke up. \"hey kid, who's that\" she asked pointing to your seemingly lifeless body.\"i'm not sure, but i do know that he needs help. come on it's late, but we to should find help for him.\" as he said this, he picked your body up out of the pool of your own blood, and started to drag your body towards _____.</span></div></div>",
            "created":1320283200,
            "id":1217083,
            "title":"Saved by Death?"
        },
        "12122":{
            "author_id":"xerox777",
            "author_name":"Zero",
            "choices":[
                "yes, keep an eye on them",
                "no, thank them for their kindness, and then leave"
            ],
            "content":"<div class=\"\"><div> <span>As they walked it started to rain.  then a crack thunder could be heard.  not that far off, an evil more powerful than the keshin was arising.  a deep barritone voice that was so cold it could make ones spine freeze spoke.\"I AM AWAKE, ..., AND SOON I SHALL BE FREE.  THIS SEAL WILL ... BE ... BROKEN ... AND I SHALL SPREAD MY REIGN OF DESTRUCTION ACROSS THE LAND.\"<br>\r\n<br>\r\nthe next morning you awake to see a a boy two girls and somebody in a cloak and mask.  the man in the mask spoke first. he greeted you and invited you to breakfast.  you're not entirely sure if you can trust them.  go with them anyways?</span></div></div>",
            "created":1320296820,
            "id":1217210,
            "title":"The DWMA"
        },
        "1213":{
            "author_id":"xerox777",
            "author_name":"Zero",
            "choices":[
                "tsubake",
                "mafune",
                "still more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>tubake or other</span></div></span></div>",
            "created":1320220560,
            "id":1216633,
            "title":"tsubake"
        },
        "12132":{
            "author_id":"xerox777",
            "author_name":"Zero",
            "choices":[
                "Angella",
                "Professor Stein"
            ],
            "content":"<div class=\"\"><div> <span>Mafune was heading back to the academy.  He had agreed to be a teacher there if Lord Death would put Angella under the academy's  protection.  Thankfully he had argeed.  He happened to pass by an ally and saw you there.  knowing he couldn't just leave you there, he picked up your limp and half dead body out of its pool of blood, and ran towards the academy.  He took you straight to the Nurse's office, and Professor Stein bandaged your wounds.  Several hours later you wake up with some one by your bed who is it?</span></div></div>",
            "created":1320277440,
            "id":1217033,
            "title":"Mafune"
        },
        "12133":{
            "author_id":"xerox777",
            "author_name":"Zero",
            "choices":[
                "crona",
                "more"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about crona</span></div></span></div>",
            "created":1320275520,
            "id":1217012,
            "title":"still more"
        },
        "121332":{
            "author_id":"xerox777",
            "author_name":"Zero",
            "choices":[
                "fine by me",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Soul and Maka</span></div></span></div>",
            "created":1320275640,
            "id":1217016,
            "title":"more"
        },
        "122":{
            "author_id":"berryy2",
            "author_name":"trimonter",
            "choices":[
                "yes",
                "new chracter",
                "new chracter"
            ],
            "content":"<div class=\"\"><div> <span>name: clair<br>\r\neyes: red, slitted pupile<br>\r\nsoul: purple with black aura <br>\r\nspecies: shinigami / witch<br>\r\nmagic type: illusions barriers<br>\r\npersonality: apathtic sarcastic<br>\r\nlikes: makeing things, exploring, scaring people,<br>\r\ndislikes: the war, kinshin, kids<br>\r\nlives in: shinigami's manshion with kid for 3 years<br>\r\nbio: when first got to death city she was attacked by all of shibushin and defeted them. then death came to fight but upon seeing her he stoped and told everyone don't attack her. she hates the war going on. nobody but death and stein trust her. crrently working on a anti- black blood serume</span></div></div>",
            "created":1326461100,
            "id":1257504,
            "title":"other1"
        },
        "123":{
            "author_id":"meeper15",
            "author_name":"meeper15",
            "choices":[
                "first day at the academy teaming up with your sister",
                "go it alone"
            ],
            "content":"<div class=\"\"><div> <span>Name:Blaine<br>\r\nAge:15<br>\r\nRace:human 5.5 ft. tall<br>\r\neye color:icy Blue<br>\r\nhair:dark brown<br>\r\ngender:Male<br>\r\nsoul decription: looks like a hazey shadow of himself.<br>\r\nroll:weapon (one handed long sword)<br>\r\npersonality:a nice kid that trys to do the right thing, but he is Overbearing sometimes and has a secret plan to achieve world domination but thats a long way in to the future.<br>\r\n<br>\r\nrelatives:Sarah (twin sister), mother and father are missing.<br>\r\n<br>\r\nlikes:his sister Sarah,honor,plotting his war tactics,trying to master other weapon modes,and leading men to victory (if he had any).<br>\r\n<br>\r\ndislikes:defeat,overconfident jerks and cowards,and incomputent meisters.</span></div></div>",
            "created":1386827700,
            "id":1706606,
            "title":"Blaine"
        },
        "1231":{
            "author_id":"meeper15",
            "author_name":"meeper15",
            "choices":[
                "a existing caricature",
                "someone new"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>before you go to class you and your sister (as a pair) must be assigned to a meister as weapons so who is it?</span></div></span></div>",
            "created":1386829380,
            "id":1706617,
            "title":"first day at the academy teaming up with your s..."
        },
        "124":{
            "author_id":"meeper15",
            "author_name":"meeper15",
            "choices":[
                "first day at the academy with Blaine.",
                "go it alone"
            ],
            "content":"<div class=\"\"><div> <span>name:Sarah<br>\r\nage:15<br>\r\nrace:human 5.5 ft. tall<br>\r\neye color:baby blue<br>\r\nsoul dicripion:shadowy verson of herself.<br>\r\nroll:weapon:shield (is used at the same time as Blaine\"long sword\" with the same meister).<br>\r\nhair:dark brown keeps it in a ponytail.<br>\r\npersonality:a softspoken yet all-or-nothing king of girl that has odd dreams she wants to achieve but focuses on defending the meister long enough for Blaine to deliver the killing blow.<br>\r\n<br>\r\nlikes:her brother,defending whoever is using her,architecture iterestests her.<br>\r\n<br>\r\ndislikes:not being use in battle,being helpless in a situation,and crumbling bulidings.</span></div></div>",
            "created":1386828900,
            "id":1706612,
            "title":"Sarah"
        },
        "1241":{
            "author_id":"meeper15",
            "author_name":"meeper15",
            "choices":[
                "a existing caricature",
                "someone new"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>before class begins you two (as a pair) must be assigned to a meister as weapons so who is it?</span></div></span></div>",
            "created":1386829200,
            "id":1706615,
            "title":"first day at the academy with Blaine."
        },
        "125":{
            "author_id":"meeper15",
            "author_name":"meeper15",
            "choices":[
                "empty slot1",
                "empty slot2",
                "even more slots"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>more room for new students your welcome.</span></div></span></div>",
            "created":1386829560,
            "id":1706619,
            "title":"more character slots"
        }
    },
    "info":{
        "author_id":"xerox777",
        "author_name":"Zero",
        "brief_description":"You're a character in the new season of the anime Soul Eater",
        "created":1320213000,
        "description":"<td align=\"left\" class=\"norm\">Welcome, now let’s get started, I’m into the anime Soul Eater.  I do not own Soul Eater, its characters or any part of the franchise.  I do however own this interactive.<br>\r\n<br>\r\nRules:<br>\r\nNo:<br>\r\nScat/pee/etc. (if it goes in the toilet, LEAVE IT OUT OF MY INTERACTIVE!),<br>\r\nUsing one of the soul eater character’s as your character. Please, please, make your own character.<br>\r\nNo using stuff from other anime’s; FOR EXAMPLE: Sasuke (I have nothing against him, but I’m tired of seeing him in anime’s where he doesn’t belong), or using CHAOS like Shadow or Sonic, cause again, NOT from the Soul Eater universe.<br>\r\nFYI:    THIS ALSO INCLUDES KINGDOM HEARTS ( I love the series, almost addicted really, but I don’t want to see a single key blade in this.  You can have your person’s weapon form or their partner’s weapon form to be something that looks like a key, but if you make it a key blade,  I WILL DELETE YOUR CHAPTER)<br>\r\n<br>\r\nVore:<br>\r\nI will not allow any form of vore, except for soul vore, but you MUST use this one the way they use it in the anime. The only other exception I'll make is hard vore, and I mean like when a lion eats an antelope, tearing each lim off. Exceptions to these include snake characters (lamias, nagas, gorgons, etc.) who are allowed soft vore and possibly unbirth. (any one who does not obey this rule will have their chapter deleted WITHOUT mercy.) [i don't hate vore, I just want to keep this interactive wiithin the SE boundaries]<br>\r\n<br>\r\nRelationships:<br>\r\nRelationships are encouraged.  HOWEVER, I will not allow it go as far as characters having sex, alot of the guys in soul eater are known to be perverts so what think is entirely part of their character, if you do feel like you want to take it that far please only do a little, and don't go into detail.<br>\r\n<br>\r\nChapter length:<br>\r\nI will allow for some short chapters, but if you make a short chapter that isn’t for a continuous decision change, I WILL delete it.  Chapters must be at least 1 DECENT paragraph long.  Easiest way to do this, PROVIDE DETAIL.  The more detail you can provide, the better.<br>\r\n<br>\r\nI have no restrictions on gender so you can make them whatever gender you want<br>\r\nEX.  Male, female, herm (this is BOTH male and female genitals), etc.<br>\r\n<br>\r\nOther thing I will not give restrictions to is species. THOUGH if you 'God Mod' your character I will delete your submission.  No this doesn't mean no phoenixes, but you can't make your character one they. (Example of something allowed: naga/lamia, taurs, harpies, cyclops, ogres) [also worth mentioning I will allow your character to be an 'angel' or 'demon' but know that evil is evil and good is good, so no good demons and no evil angles, btw a fallen angle counts as a demon.]<br>\r\n<br>\r\nBad grammar or spelling:<br>\r\nNO TEXT LANGUAGE!!!! (EX. For The Win, for the longest time I thought I meant Fuck The World)<br>\r\nANY TEXT LANGUAGE WILL EITHER BE DELETED OR FIXED, DEPENDING ON HOW MUCH THERE IS.<br>\r\n<br>\r\nRequirements:<br>\r\nPlease watch the whole Soul Eater Series BEFORE starting this interactive, I will KNOW if you add something that was not mentioned in the Soul Eater series, and please keep in mind this interactive takes place AFTER the LAST episode in the series.<br>\r\nIf you CAN use English please do, if it’s Basic English like if it’s a second language to you, try your best and I’ll help where I can as far as grammar and spelling.<br>\r\nAlso, if you choose to be a weapon, please provide a link to a picture of that character's weapon form(s)<br>\r\n<br>\r\n<br>\r\nOTHER THAN THAT:<br>\r\n<br>\r\nGO WILD.<br>\r\n<br>\r\n<br>\r\n<br>\r\nAlso, Soul Eater belongs to Funimation.  \"You should be watching.\"<br>\r\n</td>",
        "id":1823215,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1416115200,
        "modified":1416115200,
        "pretty_title":"Soul Eater: your new life"
    }
}