{
    "chapters":{
        "1":{
            "author_id":"bbbs",
            "author_name":"bbbs",
            "choices":[
                "Fanboys",
                "Least I Could Do",
                "Craving Control",
                "Questionable Content",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Webcomic?</span></div></span></div>",
            "created":1205470800,
            "id":508894,
            "title":"Beginning"
        },
        "11":{
            "author_id":"bbbs",
            "author_name":"bbbs",
            "choices":[
                "Giantess",
                "Shrink"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What Type?</span></div></span></div>",
            "created":1205470800,
            "id":508895,
            "title":"Fanboys"
        },
        "112":{
            "choices":[
                "Lemmy.",
                "Paul.",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who shrinks?</span></div></span></div>",
            "created":1310435580,
            "id":1145757,
            "title":"Shrink"
        },
        "12":{
            "author_id":"bbbs",
            "author_name":"bbbs",
            "choices":[
                "Issa",
                "Nancy",
                "Marcy",
                "Cindy",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which girl?</span></div></span></div>",
            "created":1205470800,
            "id":508897,
            "title":"Least I Could Do"
        },
        "13":{
            "author_id":"bbbs",
            "author_name":"bbbs",
            "choices":[
                "Giantess",
                "Shrinking"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which type?</span></div></span></div>",
            "created":1205470800,
            "id":508898,
            "title":"Craving Control"
        },
        "14":{
            "author_id":"bbbs",
            "author_name":"bbbs",
            "choices":[
                "Faye",
                "Dora",
                "Raven",
                "Penelope",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which Girl?</span></div></span></div>",
            "created":1205470800,
            "id":508900,
            "title":"Questionable Content"
        },
        "15":{
            "choices":[
                "Homestuck",
                "other",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about these</span></div></span></div>",
            "created":1299906000,
            "id":1069248,
            "title":"Other"
        },
        "151":{
            "choices":[
                "Grow",
                "Shrink"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>okay is this a grow or shrink story?</span></div></span></div>",
            "created":1307163600,
            "id":1119891,
            "title":"Homestuck"
        },
        "1511":{
            "choices":[
                "Rose",
                "Jade",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who grows?</span></div></span></div>",
            "created":1307163600,
            "id":1119892,
            "title":"Grow"
        },
        "15113":{
            "choices":[
                "Vriska",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>let's move onto the troll girls</span></div></span></div>",
            "created":1307163600,
            "id":1119894,
            "title":"Trolls"
        },
        "151132":{
            "choices":[
                "yes!",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how abut Kanaya?</span></div></span></div>",
            "created":1308978000,
            "id":1134499,
            "title":"no"
        },
        "1511322":{
            "choices":[
                "yes",
                "nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Terezi then?</span></div></span></div>",
            "created":1308978000,
            "id":1134500,
            "title":"No"
        },
        "1512":{
            "choices":[
                "Humans",
                "Trolls",
                "Carapces"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who is shrinking?</span></div></span></div>",
            "created":1309035660,
            "id":1134502,
            "title":"Shrink"
        },
        "15122":{
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>does karkat shrink?</span></div></span></div>",
            "created":1309035720,
            "id":1134504,
            "title":"Trolls"
        },
        "152":{
            "author_id":"mastertheif17",
            "author_name":"MT17",
            "choices":[
                "Sure!",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about Twokinds by Tom Fischbach?</span></div></span></div>",
            "created":1310960220,
            "id":1149697,
            "title":"Twokinds?"
        },
        "1522":{
            "author_id":"sonpyh",
            "author_name":"Hypnos",
            "choices":[
                "Sure!",
                "Nah."
            ],
            "content":"<div class=\"\"><div> <span>What about Girl Genius, the popular gaslamp fantasy tale of a young lady who discovers she's the heir to a powerful family of mad scientists, in a world where these \"sparks\" engage in all manner of insane experiments (including size-changing) in their bids for world domination?</span></div></div>",
            "created":1443845400,
            "id":2042795,
            "title":"Girl Genius?"
        },
        "15221":{
            "author_id":"sonpyh",
            "author_name":"Hypnos",
            "choices":[
                "Zeetha",
                "Agatha"
            ],
            "content":"<div class=\"\"><div> <span>          It had taken time, but the city of Mechanicsburg had finally returned to normal...or at least what passes for normal in a city where every citizen is a minion for the ruling family of sparks which had called Mechanicsburg home for untold generations. Still, after that nasty business with the Battle of Mechanicsburg, and the nearly three years (although everyone agreed it felt like less) they had spent in a bubble of frozen time, a Heterodyne had once again returned to make the city great. Agatha Heterodyne, to be specific! A strawberry-blonde young lady (late teens) descended from one of the famous Heterodyne brothers themselves, she had already proven herself to be as brilliant (and only occasionally mad) as her immediate predecessors, and more inclined to share in their heroic legacy than the tales of terror her more...monstrously villainous?...distant ancestors had inspired.<br>\r\n          Yes, there was once more a Heterodyne within the fearsome Castle Heterodyne which overlooked the town, and everyone was pretty happy about it. The Castle itself, at this particular moment, felt some mixed emotions. Of course it was happy, surely happier than any of the people, because the Castle was alive with artificial intelligence, and had spent decades forced to watch an endless stream of would-be conquerors, pretenders, and slaves walk through its halls while its fractured consciousness was scattered across dozens of areas within its walls. Finally Agatha had returned, proven herself to be the true Heterodyne heir (no small feat in itself), repaired its mind and restored its power. It was overjoyed...and impatient.<br>\r\n          Even if the Castle might have been capable of love, the generations of evil sparks who created and refined it ensured that their twisted, sadistic creation could never feel something as pure and good. Still, the deranged AI was fond of Agatha, in its way. Even beyond the desire to serve the Heterodynes that was its prime directive, the things the girl had done to save the Castle had made it...not grateful, per se, but burning with a desire to repay its new mistress. It had finally found a way to do so.<br>\r\n          In the depths of its reconnected memory banks, the Castle had unearthed the history of one of the earliest Heterodynes to take up residence within it. Wulfric Heterodyne was as brilliant as any of the Heterodynes who had come before him, but he had a warrior's heart, and all of his intellect was put towards battle and conquest. This made him a favorite of the vicious Jaegermonster soldiers he commanded in battle (\"dezpite hees total unvillingness to vear any kind ov hat\" his generals remarked of him), but secretly made him feel inadequate as a warrior against creatures as strong and durable as they were. His crowning achievement had been a ray gun which gave him the edge he needed. Whenever he found himself in immediate danger, the energy of the ray would cause him to grow larger, so that his increased strength and durability would allow him to overcome the danger. Of course, the bigger he got, the more of a target he became, and the bigger the danger he faced, so what began as spurts of inches or feet eventually became 10s or 100s of feet at a time, until he reportedly became large enough to use the castle itself as a (uncomfortably pointy) throne. Of course, the need to eventually eat (and some reported psychological side effect which the Castle could not recall) meant that Wulfric had to occasionally shrink down (although the method for doing so also remained lost to the Castle), probably when some maximum height was reached or some trigger was activated. It appeared that once, Wulfric accidentally shrunk down deep in enemy territory, and when the Jaegers finally caught up, they found him pierced by a dozen swords, surrounded by the corpses of 300 enemy combatants. \"A verry goot death\", all involved concluded.<br>\r\n          Along with these notes, the Castle had rediscovered the schematics for the ray which gave Wulfric his ability to grow. Refined with research from more current size-obsessed sparks, the Castle was convinced it was ready to be presented to her mistress...or given Agatha's annoying tendency towards \"rational thought\", used <i>on</i>her mistress. The Castle dreamed of her mistress, towering over the streets of Mechanicsburg, a physical testament for all of Europa to the power of the Heterodyne bloodline! Of course, her clothes wouldn't grow with her, but the Castle never saw much use in clothing. Plus, once her size leveled off (assuming it did), the Castle would commission a marvelous new outfit to mark her as Queen of Europa! ...Unless it had made a mistake and created a death ray by accident. It was so good at making death rays! But if it ended up killing its mistress...well it wouldn't be unforgivable, it could simply revive her. The Castle had a reputation to uphold, though, and did not want to take the risk.<br>\r\n          So, yes, the Castle was impatient. It wanted to make its mistress a physical goddess, but it also wanted to test the ray to make sure it was safe. The Castle knew there were multiple subjects within it who would make excellent test subjects. Chief among them was Zeetha, Agatha's green-haired warrior woman bodyguard and best friend (mid 20s). A warrior after Wulfric's own heart, her intense morning training exercises alone would provide her with enough danger to make her a true amazon by lunch. The trouble would be keeping Agatha from realizing its plans until the right moment. Or it could truly take after the scientists it had spent centuries serving, throw caution to the wind, zap Agatha and hope for the best.<br>\r\n<br>\r\n(For reference:<br>\r\nZeetha: <a rel=\"nofollow\" href=\"http://girlgenius.wikia.com/wiki/Zeetha,_Daughter_of_Chump\" target=\"_blank\">http://girlgenius.wikia.com/wiki/Zeetha,...</a><br>\r\nAgatha: <a rel=\"nofollow\" href=\"http://girlgenius.wikia.com/wiki/Agatha_Heterodyne\" target=\"_blank\">http://girlgenius.wikia.com/wiki/Agatha_...</a> )<br>\r\n<br>\r\nThe Castle finally made up its mind and chose...<br>\r\n</span></div></div>",
            "created":1443851340,
            "id":2042818,
            "title":"Girl Giantess"
        },
        "152211":{
            "author_id":"sonpyh",
            "author_name":"Hypnos",
            "choices":[
                "She makes it through the course without many close shaves (grows 1/2 ft.-1 ft. )",
                "She's thrown off balance, and ends up barely holding her own (grows 2-3 ft)"
            ],
            "content":"<div class=\"\"><div> <span>          Zeetha rubbed the sleep from her eyes as she made her way down the stairs to the room she had recently been using as a gym. She dimly recalled that it had once been an arena in which the Heterodynes could test their newest automated weapons, death traps, and ray guns without destroying half the castle. It had been easy enough to convert it into a gym, particularly because she hadn't needed to change anything.<br>\r\n\"Good morning, Zeetha.\" The voice of the Castle came from all around her, with a mix of measured respect and deep annoyance, as if she were a particularly hardy rat it had been unable to properly dispatch.<br>\r\n\"*yaaaaaawn* Morning, castle.\" Zeetha responded brightly, in spite (or perhaps in direct response to) the Castle's tone.<br>\r\n\"I'm going to destroy you today.\"<br>\r\n\"Ha!\" Zeetha grinned, gazing towards the ceiling. \"You know you say that every day. Well, you better try.\" She reached behind her and drew her twin blades of destruction in front of her, grinning the entire time. \"Give me everything you've got!\"<br>\r\n\"VERY WELL!\" Blades and saws of every imaginable size and design sprang from the walls around her, as massive bladed pendulums swung from the ceiling directly behind and in front of her. Gouts of flame sprang up from the floor, as bolts of lightning criss-crossed the room from every conceivable angle. \"LET US SEE IF YOU ARE TRULY WORTHY TO TRAIN AND GUARD THE MISTRESS!\" The Castle cackled maniacally, before pausing dramatically for effect, which was not lost on Zeetha, who stood there for a moment suitably impressed.<br>\r\n\"Love the classic dungeon feel! Are the lightning traps new?\"<br>\r\n\"Oh those old things? I've just gotten them repaired, but they've been part of the family for centuries. I do have some new acid pit designs I've been working on if you...?\"<br>\r\n\"Oh sure! I'd love to try them out!\"<br>\r\n\"Oh would you? That would be so helpful, thank you!\"<br>\r\n\"No problem.\"<br>\r\n\"NOW PERISH!\"<br>\r\n          The time for theatrics and pleasantries now clearly passed, Zeetha leapt into action, nimbly dodging ever blade she could as she maneuvered around the room, parrying those she could not. She realized the pendulums were more for distraction than anything, as she easily avoided the acid pits strategically placed beneath them. Ducking between bolts of lightning and plumes of flame, she realized the Castle seemed to be going a bit easy on her, even for a warm-up. As she tried to figure out what its game was, a tiny ray gun peaked up from a hidden panel on the floor, and gave her ankle a jolt.<br>\r\n          \"Ow! Cheap shot!\" she yelled at the Castle as she finished the first part of the training course. \"Heh heh heh. If you're not going to expire when I ask you to, I need to find my fun when I can,\" it retorted. Of course, that was what it had been waiting for. With the energy coursing through her body now, it was simply a matter of finishing the exercise to start her growing. With the most elaborate and dangerous traps still to come, Zeetha would be lucky to still be able to fit through the door by the time she was done...</span></div></div>",
            "created":1443947160,
            "id":2043380,
            "title":"Zeetha"
        },
        "1522111":{
            "author_id":"sonpyh",
            "author_name":"Hypnos",
            "choices":[
                "Strike While the Iron is Hot!",
                "Wait. We'd Hate for Zeetha to Be Uncomfortable So Soon..."
            ],
            "content":"<div class=\"\"><div> <span>          Zeetha tried to shake off the jolt. The castle was teasing her, but she couldn't let it get to her. She couldn't afford to be psyched out when the wrong move could be her last. She took a deep breath to center herself, opened her eyes, and bolted forward as she let her instincts take over. The first part of the course had been largely for show, meant to lull her into a false sense of security with large, obvious tracks. Zeetha wasn't fooled; she knew this is where the Castle stopped circling her and moved in for the kill. Pressure pads would launch darts tipped with poisons causing painful, prolonged death with the slightest touch. Trip wires which could only be seen with a keen eye (in the right light) opened pits far too large to jump. Dueling clanks (robots) which learned from every opponent they crossed swords with emerged from the walls.. Paralysis gas pumped in silently from every wall (not deadly in and of itself, but would make her easy work for every other thing in the room that wanted to kill her. Finally, once she somehow avoided everything else, she'd have to avoid enough death rays to reduce the sturdiest (non-Jaeger) army to ashes in a matter of seconds (the castle could only do \"subtle\" for so long).<br>\r\n<br>\r\n          Zeetha ran right over the plates, blocking the flurry of darts from both sides with her swords, and dodging the few which she couldn't block (\"ooh, feeling dangerous today, are we\" the Castle noticed with amusement\". She stepped nimbly through the web of trip wires  which criss-crossed the floor below her, landing on a safe spot...which turned out to be another pressure plate, which opened walls on either side of the chamber, from which emerged eight giant rats, which immediately began chasing her. Had her mind not been totally given over to the warrior instincts which were keeping her alive, she'd have noted these were new, and to congratulate the Castle afterwards for keeping things interesting. She knew she had to finish things quickly. She leaped over the nearest dueling clanks (narrowly avoiding a few swipes which were aimed squarely at her neck), which were quickly overwhelmed  by the rats. Nearing the finish, she managed to reflect most of the death rays aimed at her back at their machines, destroying them. The remaining death rays fired impotently at the green-haired amazon until the rats came into range, and quickly picked them off. Breathing heavily, Zeetha grabbed a nearby cup of water...and quickly poured it out, watching as it ate a hole in the floor. She felt the tingle of adrenaline, and began to pace as a way of winding down, her sweat-covered clothes clinging tightly to her.<br>\r\n<br>\r\n          ...Too tightly. And that tingling sensation had not abated as she had calmed down. Returning to her senses, Zeetha immediately realized something was wrong. She knew instinctively how she held her swords, and they seemed slightly...smaller in her hands. She let them fall to her feet. She felt a breeze running across her stomach, and realized that her shirt was exposing more of her belly than usual, and the single button which held it closed was straining hard. Her pants, meanwhile, were riding a bit low, and the ends of her pant legs ended at her mid-shins. Most noticeable of all to her was how tight all of her clothing felt. The harness around her chest was digging in to her flesh, and she quickly undid the clasp, letting her sword holster clatter to the ground. She likewise  took off the headband which had been digging into her skull, and she noticed the concerned expression on the decoration which (as always) mirrored her own feelings. Less easy to take off were the things which were causing her the most discomfort by far: her underwear. The downside to wearing disintegration-proof underwear was that they were not especially comfortable to begin with, and didn't have much flexibility. She could feel her already large breasts overflowing her bra cups, as her underwear rode up her shapely butt, giving her an incredible wedgie. The tingling finally left Zeetha at just over six and a half feet tall, over half a foot taller than she had been even 10 minutes ago. <br>\r\n<br>\r\n          \"Well, I suppose that was a passable effort. Congratulations, you get to live another day. Yay.\" The Castle forced one of the half-gnawed clanks to give Zeetha a slow clap, but Zeetha was too busy taking stock of her changes to catch much of the show. Suppressing any panic or confusion she was feeling, she looked up and addressed the room. \"Castle, what did you do to me?\" she asked with all the patience of a mother dealing with a chronically mischievous child. The clank stopped clapping as the various traps either turned off or reset themselves. The room quickly grew dark and silent. Zeetha sighed, exasperated. \"I'm telling Agatha.\" First, however, she needed to get out of her clothes. She'd head back to her room. She definitely didn't have underwear big enough to account for whatever bloating the Castle was causing, but she could at least slip into a stretchier shirt and baggier pants. They'd be tight, but at least she'd be moderately comfortable as she searched for Agatha. <br>\r\n<br>\r\n          She walked out of the room, and the Castle considered its next move. It had no shortage of defense mechanisms it could use to delay (and enlarge) her subject, or it could bide it's time and let Zeetha relax her guard a bit before striking next.</span></div></div>",
            "created":1444975080,
            "id":2047926,
            "title":"Close Shaves and Tight Squeezes"
        },
        "15221112":{
            "author_id":"sonpyh",
            "author_name":"Hypnos",
            "choices":[
                "Electricity (grows 2 feet taller)",
                "More Growth Ray Energy (no growth now, but any future growth is doubled)"
            ],
            "content":"<div class=\"\"><div> <span>          Zeetha quickly made her way back to her quarters. They were fairly close to her training chamber, but she still had through several hallways, which were now filled with minions, servants, and the occasional visiting professor or spark. None of them seemed to notice a six and a half foot tall green-haired woman walking strangely throughout the castle. If any of them had come up with a list of the strangest things they'd seen in Mechanicsburg, Zeetha wouldn't have cracked the the top hundred. Zeetha slammed the door behind her as she quickly disrobed. She had to strain to reach the clasp on her bra, which was digging into her back almost deeply enough to break the skin. Allowing herself a moment to calm herself in the privacy of her own chambers, she considered her wardrobe. She briefly considered remaining naked. In her home of Skefander, warriors regularly went to battle wearing little to nothing at all. She ultimately decided against it though. Although she didn't really feel self-conscious, she wanted to spare Agatha any awkward complaints from the rest of the castle's inhabitants. She ultimately decided on her favorite red-striped shirt, a simple (and stretchy) cotton short-sleeved number, and a baggy pair of pants. The shirt exposed her midriff a bit, but the pants fit fairly well, although they ended a bit before her ankles. Convinced she was ready for whatever else the Castle might throw at her, she gripped the door handle to turn it...only to be given a jolt from the electrified handle!<br>\r\n<br>\r\nThe jolt was...</span></div></div>",
            "created":1444976640,
            "id":2047932,
            "title":"The Warrior Goes Commando"
        },
        "152211121":{
            "author_id":"sonpyh",
            "author_name":"Hypnos",
            "choices":[
                "Unleash the Defense Mechanisms!",
                "Oh Look! A Group of Thugs Trying To Invade The Castle!"
            ],
            "content":"<div class=\"\"><div> <span>          \"Ow!\" Zeetha screamed in shock as she fell backwards in shock. She shook her hand, and then realized there was no pain, only tingling. The tingling quickly spread to the rest of her body. Zeetha let loose a soft moan as she began to grow. Her legs lengthened as the cuffs of her pants begin to tear up the sides. The button on her pants popped off as the zipper forced itself down, revealing a tuft of green pubic hair. She heard a tear from behind her as her sizable rear tore a hole right through the back of her pants. Zeetha was breathing heavily as her chest rose and fell, rising a bit further and falling a bit less every time. Her breasts surged larger with every breath, creating a ever-increasing valley of cleavage as her neckline plunged.  Her shirt rose to just under her breasts as her torso lengthened., and the stress of her growing chest and widening shoulders caused the material in the middle of her chest and back to tear. Her sleeves crawled up her shoulders, making it look more like a tank-top, and then a sports bra.<br>\r\n<br>\r\n          Finally, her newest transformation ended, leaving her eight and a half feet tall, with her pants reduced to shorts which failed to conceal her privates, and her shirt barely holding up as a revealing bikini top. She was breathing heavily, and if she had not been disoriented by what had just happened to her, she would have recognized this unmistakably as arousal. Her hard nipples poked out of her torn shirt, and she was reaching for her crotch without realizing it. as she suddenly sprang to her feet. She realized that she could see over the top of her bedposts, which were easily over seven feet tall. She cursed the Castle under her breath, and grabbed one of her swords (now more of a dagger to the mini-giantess) to cut her ruined pants off. She took the sword, and a fresh pair of pants. She cut them down into a pair of short shorts, and cut the sides into strips to accommodate her even larger hips. Eventually she managed to get them on, and even keep the zipper up. She knew they wouldn't last through another spurt, but they'd do for now. She knew there was no way any of her shirts would fit her no matter what she did to them, so she decided to leave her top as it was. <br>\r\n<br>\r\n          She used one of her now tiny gloves to turn the handle, and managed to open the door without further incident. She was about to leave when a thought struck her. She went over to her bed and took two massive bed sheets from it. She tied one of them around her neck like a cloak, and it managed to cover her pretty well, for the moment at least. She folded the other sheet in half and wrapped it around her waist as a kind of skirt. This way, she reasoned, if he clothing failed her further, she could wrap the sheets around her as a last-ditch attempt at modesty. Determined not to get tricked again, she left the room intent on finding Agatha and putting an end to this.<br>\r\n<br>\r\n          The Castle found all of this incredibly enlightening. The growth process was truly impressive, but what held her attention was the spontaneous arousal the process seemed to cause. This must have been the side effect which had afflicted Wulfric. It made sense that the body protected itself by turning the stress of growth into arousal...although if that were true, it would mean that the larger the subject got, the hornier the subject would get until...what? Perhaps achieving orgasm is what returned the subject to their normal size and state. But any attempt at penetration whould be seen as a new source of danger, wouldn't it? There were too many questions the Castle still needed answers for, and it couldn't well do that with Zeetha returned to normal, or even if she remained at her current size!<br>\r\nIt seemed a distraction was in order...</span></div></div>",
            "created":1444979520,
            "id":2047941,
            "title":"Electricity (grows 2 feet taller)"
        },
        "1522111212":{
            "author_id":"sonpyh",
            "author_name":"Hypnos",
            "choices":[
                "Zeetha still hasn't adapted to her larger body, and takes some hits (3-4 feet).",
                "Zeetha uses her enhanced strength to easily overpower her attackers (1-2 feet)."
            ],
            "content":"<div class=\"\"><div> <span>Zeetha strode down the same hallways she had walked down minutes ago, when she was two feet shorter and much better covered (although also much less comfortable). The change had resulted in two effects which were now readily apparent. The first was that everyone did a double take as she walked past. There were all kinds of strange things traveling through the castle, but a green-haired giantess in what was clearly a bedsheet cloak was still a sight to behold. Luckily, the second effect was that her stride was much greater than it had been, which spared her much of the gawking stares her reappearance had inspired. She kept her head down to seem inconspicuous (and to avoid hitting her head) as she made her ways down the hallways that would lead her to Agatha's lab. After a few minutes however, she realized her error. She looked up, only to realize that wherever she was, it was nowhere near the lab. Indeed, it appeared as if she was in the catacombs under the castle proper. She cursed the castle, once more. She had forgotten that the castle could move its doors and hallways around to confuse invaders. Of course it wouldn't want her getting to Agatha until whatever strange experiment it was running was over!<br>\r\n<br>\r\nShe was about to turn around and try to find her way out, when she heard voices coming from around a corner.<br>\r\n\"You sure this information's good, Jim?\", a rough, deep voice asked in a quiet, vaguely threatening tone.<br>\r\n\"Of course, Red. Of course!\". replied Jim in a tone that was as far from confidence as humanly possible. \"Me cousin ain't never steered me wrong before!\"<br>\r\n\"The defenses of the castle are legendary. If that map is at all out of date, I swear to you you'll be the first to find out\", Red responded.<br>\r\nZeetha rolled her eyes. Treasure hunters, no doubt in search of some Heterodyne relic rumored to be buried in the refuse and junk somewhere in the lowest levels of the castles. A suicide mission for even the most prepared group of scavengers, but every once in a while someone would get caught bragging about some clockwork miracle they knicked on a lucky run, and Zeetha had heard that a few of the stories might actually have been true. Which kept thugs like this coming from the sewers to try their luck. Zeetha knew the castle could handle them, but after the stress of the morning, she was itching to take her frustration out on something that wasn't made of stone and metal...and inanimate.<br>\r\n<br>\r\n\"You're all gonna find out exactly how much trouble you're in\", Zeetha said in her most threatening tone as she stepped out from around the corner to confront the men. As she expected from the sound, there were six in total, all men, and all shrank back in surprise from the towering figure in front of them. As Zeetha struck a threatening pose, the thugs got a good look at the scantily-clad amazon, and some of their fear turned into...something else. The leader, Red, grinned  as he held up his hands in an effort to both quiet his men and create a sign for peace. \"Well now, miss. No need to do anything rash. We'll be perfectly willing to go on our way, and leave you be...if you can think of a way to make it worth our while...\" The men laughed, with a mix of menace and nervousness in their voices. Zeetha was so shocked by the audacity, arrogance and stupidity of these men, she was struck speechless. Instead she drew her swords, which she now kept in a makeshift belt around her waist, and made a face that left no ambiguity as how dead these men were. Red sighed, and signaled his men forward to attack.</span></div></div>",
            "created":1451029500,
            "id":2079195,
            "title":"One Wrong Turn..."
        },
        "15221112121":{
            "author_id":"sonpyh",
            "author_name":"Hypnos",
            "choices":[
                "Masturbating causes her to grow even more.",
                "She doesn't get any bigger, but neither does she shrink down."
            ],
            "content":"<div class=\"\"><div> <span>          As the first two thugs rushed her, Zeetha gripped her swords tightly, but found it hard to keep a good grasp in her enlarged hands. That moment of distraction almost killed her, as she just barely managed to parry both attackers, as she turned  to keep her eye on the remaining three thugs. Wait, three? Suddenly a sharp pain in her side alerted her to the final thug, who gave her a shallow cut to her side. She reared back and kicked him with more strength than she realized she had. He went flying backwards into a wall, where he connected with a sickening crunch and crumpled to the floor. Suddenly, as she turned back to the thugs she was parrying, her vantage point began to shift, as she grew again.<br>\r\nHer swords became even harder to hold as her shirt continued to rise over her expanding breasts. Popping sounds were heard coming from her pants, as the strips she had made on the sides of her pants began to tear, and she was once again dealing with a wedgie as her expanding ass began to eat what was left of the material. The two thugs were so stunned at the transformation happening before them, neither noticed when, with lightning quick speed, Zeetha's swords cut deeply into their shoulders. <br>\r\n<br>\r\n          As they fell to the ground in pain, Zeetha charged the remaining three thugs. Red boldly stepped forward to challenge the amazon as Jim and a third thug moved to flank her. As Red stepped forward to stab at her, Zeetha caught his arm and proceeded to put him in a headlock. \"Alright, if you boys want your leave her with your lives, and his, you'll scram before I change my mind.\" As they seemed to be considering it, Zeetha felt another sharp pain in her arm. The bastard had bit her! As she tried to shake him off like a rabid dog, the other two charged, one going high, the other going low. The one who went high got a sword to the gut, but Jim manage to slice her across a thigh. As she screamed, she slit Red's throat with one of her swords, and brought the other one down through Jim's torso. She looked around to confirm that all of her attackers were either dead or unconscious.<br>\r\n<br>\r\n          Breathing heavily, she suddenly felt a wave of pain mixed with pleasure washing over her. as she began moaning as she grew once more. She quickly undid the cape around her neck and hips as they suddenly became incredibly restricting. Her ballooning breasts and widening shoulders lifted the ruined shirt over her nipples, as the back of the shirt tore away, leaving her top fluttering to the ground. The popping sounds from her pants continued, as her widening hips destroyed all but one of the strands keeping her pants together. The fly on her pants broke immediately, again leaving her exposed. As the growth topped out at 12 feet, Zeetha was left as a statuesque display of femininity and power. Topless, clad only in a very tight thong which was beginning to dig into her womanhood. If she had been thinking clearly, she would have noticed that her wounds had healed almost miraculously. But she was so overcome with arousal, she had only one thought. She reached down between her legs and set about relieving her intense feelings.</span></div></div>",
            "created":1451031420,
            "id":2079200,
            "title":"Zeetha still hasn't adapted to her larger b..."
        },
        "152211121212":{
            "author_id":"sonpyh",
            "author_name":"Hypnos",
            "choices":[
                "Walking through the cluttered streets causes Zeetha to grow significantly.",
                "Zeetha heads to the nearest city gate, hoping to send Agatha a message."
            ],
            "content":"<div class=\"\"><div> <span>          A few minutes later, after soaking through what was left of her pants, Zeetha came to her senses. She stood and surveyed her surroundings. She could hear rushing water coming from a room not far from where she was. She knew she was down in the depths of the castle, and concluded that the sound was likely the sewage flow, which flowed out into the sea surrounding Mechanicsburg. Looking around at the dead thugs surrounding her, she considered her options. They looked so small to the giantess, who could hold even the largest as a mother would hold a child. If she was already that big, getting through the hallways of the castle would be a challenge, even without accounting for the myriad ways the Castle could continue to attack or distract her. When she finally got to speak with Agatha, she really didn't want to be 50 feet tall. So...what if she got out of the castle? She realized that would be the best plan of action for now. She took one of the bedsheets she had brought with her, and tied it around her ample bosom. She allowed it a bit of slack, so that she might grow into it if need be, but she knew that any more than a few feet and it would be as useless as her shirt had been. She followed suit with the other sheet, tying it around her hip as a loose-fitting skirt. It only came down to her knees, but it'd do. She followed the sound of the rushing water until she came to the source. She briefly considered going back for the bodies of the thugs, but then recalled that the giant rats which patrolled the lowest floors of the castle would likely take care of them. She stepped into the water...only to immediately step on a sharp rock which had been submerged.<br>\r\n<br>\r\n          She felt a sharp pain, and almost immediately felt the tingling sensation she was becoming accustomed to. Her top tightened around her chest, so that it no longer covered the bottom of her breasts. Her skirt rose up her lengthening legs, so that it now only came up to her mid thigh. Bending over slightly to examine her foot, Zeetha felt a snap, and the torn remains of her pants fluttered into the stream, as they were quickly swept out to the sea. She had grown two more feet, putting her at around 14 feet. She realized she was breathing heavily, beginning to feel aroused once more, but the fresh pain in her foot kept her focused. She gingerly began to step carefully throughout the water, and eventually the stream became deep enough for her to swim out into the sea. Floating on her back, Zeetha smiled, relieved to be free of the Castle for the time being. Eventually she'd swim to the shore, and then climb her way back to the front door of the Castle, from which she'd hopefully be able to get Agatha's attention. But for now she was content to relax. Although the last few hours had been trying, they had also been the most excitement she had seen in months, and she couldn't be too mad at the Castle right now. There would surely be time for that later.<br>\r\n<br>\r\n          Meanwhile, the Castle had been watching everything, through the eyes of mechanical mice it used as surveillance in the catacombs. It was pleased at the progress Zeetha was making, and was grateful for the steady stream of data coming its way. Now it knew that although arousal was clearly the main side effect of the growth process, simply pleasuring oneself was both not enough to induce growth, nor was it enough to reverse it. Perhaps a certain height maximum needed to be reached first? Or perhaps some higher level of arousal? Whatever the answer, it needed even more data to puzzle it out. Zeetha needed to grow faster. Luckily, the Castle knew that she had to return if she wanted to reach Agatha, and although its influence was not nearly as strong outside of the castle, Zeetha would still have to navigate the narrow and chaotic streets of Mechanicsburg to do so, and it would surely not be especially easy...</span></div></div>",
            "created":1451117100,
            "id":2079470,
            "title":"A Great Escape"
        },
        "15222":{
            "author_id":"blackfiend",
            "author_name":"Red7",
            "choices":[
                "Sure!",
                "No thanks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about Order of the Stick? The D&amp;D-based web comic following the Order, and involving a myriad of potential giantess material?</span></div></span></div>",
            "created":1444032180,
            "id":2043867,
            "title":"Order of the Stick"
        },
        "152222":{
            "author_id":"nintendo1360",
            "author_name":"Nintendo1365",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about someone from the web comic spinnerette? a world filled with superheros and villains and a girl who gets spider powers kinda like peter parker.</span></div></span></div>",
            "created":1444087320,
            "id":2044111,
            "title":"spinnerette"
        }
    },
    "info":{
        "author_id":"bbbs",
        "author_name":"bbbs",
        "brief_description":"Girls from popular webcomics grow.",
        "created":1205554620,
        "description":"<td align=\"left\" class=\"norm\">This should be self explanatory, since there are like 500 similar stories.  Feel free to add, I'll be concentrating mostly on butt crush.</td>",
        "id":1400874,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1451117100,
        "modified":1451117100,
        "pretty_title":"Webcomic Giantess/Shrink"
    }
}