{
    "chapters":{
        "1":{
            "author_id":"tezak100",
            "author_name":"Draga",
            "choices":[
                "The tower is empty",
                "His room is under attack",
                "His laundry is burning Warlic's stuff"
            ],
            "content":"<div class=\"\"><div> <span>\"They say I’m mad, but I disagree. Just because I turned a tower into a fish, and stuffed three people into a phone box just to see if they would fit doesn’t mean I’m mad, does it? Anyway, my name is Cysero, a weapon smith. This is my story, a story that changed lives.\"<br>\r\n<br>\r\nThe day started off normally. I was woken by a stray chickencow that had wandered into the tower. It let off a loud moocluck (seriously, how do they do that?) and flew out of the window rather groggily.<br>\r\n<br>\r\nWhat does Cysero first see?</span></div></div>",
            "created":1221690420,
            "id":583672,
            "title":"The beginnings"
        },
        "11":{
            "author_id":"tezak100",
            "author_name":"Draga",
            "choices":[
                "He starts looking for Warlic",
                "His breakfast comes to life",
                "An army of sneevils break in"
            ],
            "content":"<div class=\"\"><div> <span>“Damn” I groaned, “Must have left the door open last night.” But then I wandered. What had happened last night? All I could remember was helping Ash pull a prank on Artix, and Warlic shouting at me to stop my laundry from destroying his research. As I got up, I heard a loud explosion outside. I went to the window, and saw Dr. Voltabolt. Falconreach’s resident mad scientist and dentist was cackling madly in the wreckage of his lab. He was talking about “destroying magic” and “taking over the world”, the usual drivel.<br>\r\n<br>\r\nI went to get some breakfast, half walking, and half stumbling down the stairs. I felt unusually dizzy for some reason. Must still be a bit tired, I thought, but as I saw in the mirror I saw none of the usual symptoms: Bags under my eyes, slouching, and well groomed hair. (With most people, their hair is usually messy when the wake up, but I’m not most people.) I just assumed it was a trick of the light, and went down into the kitchen. It was empty. Usually Warlic was here cleaning up the mess I made from dinner, but though it was clean, he was nowhere to be found.<br>\r\n<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1221690960,
            "id":583676,
            "title":"The tower is empty"
        },
        "111":{
            "author_id":"tezak100",
            "author_name":"Draga",
            "choices":[
                "His store is already open",
                "His store is gone",
                "He gets knocked out by a mysterious stranger"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\n“Warlic!” I shouted, “Where on Lore are you?” There was no response. This is weird, I thought. I quickly summoned up some clothes and ran outside, where I was in for a shock.<br>\r\n<br>\r\nThe town was empty! There wasn’t the sound of Yulgar working at the forge, or Gram’s pet store’s usual growling. I decided to investigate, so I made my way to my store to see what had gone on. The way the town was so quiet, it frightened me. Usually the town was alive and bustling with adventurers seeking new quests and rare items. Now, the only sound was of the wind blowing and the inn sign creaking.<br>\r\n</span></div></div>",
            "created":1221692460,
            "id":583689,
            "title":"He starts looking for Warlic"
        },
        "1112":{
            "author_id":"tezak100",
            "author_name":"Draga",
            "choices":[
                "Twilly",
                "Zorbak",
                "Ash"
            ],
            "content":"<div class=\"\"><div> <span>When I arrived, I went to unlock the doors, or I would have if my store was there. I quickly searched around to try and find anything that could tell me what had happened, and soon I had. The dimensional anchor keeping my mega store attached to the universe had been severed! This is serious, I thought, so I decided to do the one thing that I had been taught to do in this type of situation: Run around screaming like a sneevil being chased by a gorillaphant. However, as I screamed, I heard a faint rustle behind the bushes so I decided to check it.<br>\r\n<br>\r\nWhat does Cysero find?</span></div></div>",
            "created":1221724800,
            "id":583895,
            "title":"His store is gone"
        },
        "11121":{
            "author_id":"tezak100",
            "author_name":"Draga",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>To my surprise, I found what appeared to be a big red football, so I decide to relive my stress by punting it but before I could, it shouted at me to stop.<br>\r\n<br>\r\n“Whoa,” I said. “ What did I drink last night?” My confusion was cleared away when I cleared away the foliage and found the cowering form of Twilly. I cleaned him with a blast of Waterga and after he wringed out his ears; he told me what he remembered.<br>\r\n<br>\r\n“I can’t remember much,” he said. “It’s mostly a big blur. All I can remember is Artix chasing Ash for some reason. I woke up this morning under this bush, and when I realised that no one else was here I hid.”<br>\r\n<br>\r\nWe decided to split up to try and find anyone else, so I gave him some spare health potions and went to the portal at the top of town, near the guardian tower. I decided to go to Warlic’s tent, to see if he had just left early and if he knew what was going on.<br>\r\n<br>\r\nIs Warlic there?</span></div></div>",
            "created":1221724920,
            "id":583896,
            "title":"Twilly"
        },
        "111211":{
            "author_id":"tezak100",
            "author_name":"Draga",
            "choices":[
                "Search for everyone else",
                "Go straight to Voltabolt's lab"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nAt his tent, I was in for some good news, some bad news and some horrible news. The good news was that Warlic was there. The bad news was that he was unconscious. The horrible news was that he was in a cage guarded by a giant mechanical drill. I had seen that drill before, but I just couldn’t put my finger on it, or my toe. <br>\r\n<br>\r\nI blasted the drill with an energy bolt, but it just shrugged it off. On its shoulder, I saw that a bit of its wiring was exposed, so I jumped over it, and prised its shoulder open with my staff. Then I finished it off with a blast of energy at its wiring. I blew open the cage door and woke up Warlic. I woke him up, and asked him if he knew who was behind all this, and what he said confirmed where I had seen the drill before, and that we were all in danger. <br>\r\n<br>\r\nIt was Voltabolt’s…<br>\r\n<br>\r\nWhat does Cysero do next?</span></div></div>",
            "created":1221725040,
            "id":583897,
            "title":"Yes"
        },
        "1113":{
            "choices":[
                "Cysero starts up again",
                "Continue..."
            ],
            "content":"<div class=\"\"><div> <span>\"Well, next I was in a cage... wait, something happened before that... Oh, yeah! Um, someone snuck up behind me, and I... KNOCKED HIM OUT WITH MY LIGHTNING-FAST NINJA REFLEXES!!!!\" (Warlic comes in)<br>\r\n<br>\r\n\"Um, that's not how it went, Cysero,\" Warlic said.<br>\r\n\"Sure it is!\"<br>\r\n\"No.\"<br>\r\n\"Well, then, what happened, Mister Study-Bookies?\"<br>\r\n\"*sigh* Alright, I'll tell our readers how it REALLY went.\"<br>\r\n<br>\r\n\"When the person snuck up behind him, Cysero was looking through the bushes for a rope to bring his shop back into our dimension. The person grabbed a twig and knocked him out. I'm 100% serious. A TWIG. Cysero has a very sensitive skull. After that, he...\"</span></div></div>",
            "created":1229135100,
            "id":618871,
            "title":"He gets knocked out by a mysterious stranger"
        }
    },
    "info":{
        "author_id":"tezak100",
        "author_name":"Draga",
        "brief_description":"The choose-your-own adventures of Cysero from DragonFable!",
        "created":1221690000,
        "description":"<td align=\"left\" class=\"norm\">Ok. Activate Describo-bot!<br>\r\n<br>\r\nOkay guys. I want a nice, clean story. No sex, vore, inflation, or any of that stuff. Just pure comedy action in the world of Lore!</td>",
        "id":1474793,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1229135100,
        "modified":1229135100,
        "pretty_title":"The Mad Weaponsmith"
    }
}