{
    "chapters":{
        "1":{
            "author_id":"lwut2929",
            "author_name":"lwut",
            "choices":[
                "...the Holmes Inn.",
                "...the Loon Corral.",
                "...the Speltzer Tavern.",
                "Before he can read it, the sheriff calls on him!",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Seven days couldn't quell over the sound of gunfire behind me, their rings echoing over the sound of Buckeye's galloping like some pesky cloud in front of the sun. Nobody was around to see me ride past but the occasional lizard and vulture waiting to pick up their next potential meal, but it was all still there, sitting right on my back; the angry screams as every sheriff in town seemed to band together at once, my frantic breathing as they all gave chase and escorted me out of town with the fire of their revolvers and rifles, and the feeling of a slew of bullets soaring around me, the closest being a single one that grazed my jacket sleeve as sheer luck left me galloping into the dark outside of the town's streetlamps. I could almost feel my arm bleeding, despite knowing I'd ridden out of the brigade without a scratch.<br>\r\n<br>\r\nHad I'd known that'd be my last time in town, I would've thought up some last words.<br>\r\n<br>\r\nBuckeye seemed as keen and able as ever, but with how light the bag on my side felt, I could tell today would've been the last of smooth sailing for us, at least until we'd find whatever scrap of food that could've been lying around to push us up another mile or so. By the looks of it, whatever it might be was starting to look like the severed head of a cactus, maybe the hide of a lizard if my stomach and the matches in my pocket had it in them to roast up a fire, with nothing but the dried plants and looming mesas sitting in the horizon to give the burning sand any shade. The last glimmer of metal from a town had gone by two days ago, something I'd damned myself for not even stopping by, if at least to check if they had wanted posters.<br>\r\n<br>\r\nAll that kept me going were a set of mountains in the distance, where green sat along its face. It was a dulled, jaded green that was dried from the summer sun, but it was still green, something that was fueled by water and nutrients. Whatever was waiting there, it'd be the last I'd get out of the trip, whether it be finding a place to with enough food to hide away from the world or a total dead end. Maybe a bit of both, who knew?<br>\r\n<br>\r\n<i>Probably three hours, or so...</i> I thought to myself, not breaking through my week of silence. <i>Maybe there's some fruit there, or a few animals hiding around that I ca- </i>\"Wait a minute!\"<br>\r\n<br>\r\nWith the sun hanging in the sky the way it was, I could see a few splotches of brown at the foot of the mountain, a shade lighter than the rock face itself, wearing tinier splotches that were varying shades of gray and black.<br>\r\n<br>\r\nCivilization.<br>\r\n<br>\r\n\"Hang in there, Buckeye!\" I announced giddily, snapping the reigns again. His galloping quickened up a tad, but his pace was too slow to match the beating of my heart as I aimed us for the foot of the mountain, hoping the least I'd find was a few abandoned crates of food...<br>\r\n<br>\r\n<br>\r\n<div align=\"center\">.....</div><br>\r\n<br>\r\n<br>\r\n<div align=\"center\">WELCOME TO DIAMOND VALLEY</div><br>\r\n<br>\r\nThe words on the sign hung high and proud over the entrance to the town, their words freshly painted. The sign itself was relatively devoid of any nicks and scrapes, too, as did the buildings waiting on the road that it lead into, clueing me in that the lack of residents walking the street yet weren't because the place was a ghost town, with the sun still as low as it was.<br>\r\n<br>\r\nNobody was around to turn their head at the clip-clop of Buckeye's hooves as I rode in undisturbed, curiously observing the signs of all the stops and shops in the area. As a first impression, the place seemed like a fairly clean, bandit-free nook in the desert, and a decent enough place to get a meal. Maybe ask a few questions, find a map, or just spend a few nights to take a few deep breaths.<br>\r\n<br>\r\n\"Stay, boy.\" I told Buckeye as I rode him up to a hitching rail, then felt the sweet joy of being able to bend my legs as I unhooked my feet from the stirrup and swiveled off the stable, jumping back down to the dirt. As I tied his reigns to the rail, I looked up at the sign above the porch we were standing from, being that of...</span></div></div>",
            "created":1485830700,
            "id":2271436,
            "title":"https://www.youtube.com/watch?v=6x6o_tBU8DU"
        },
        "13":{
            "author_id":"keroro04",
            "author_name":"Keroro04",
            "choices":[
                "I need help serving customers their drinks and meals.\"",
                "I need help getting orders while I make the meals.\"",
                "I need to make sure a package gets to one of my friends.\"",
                "I need help protecting my shop from the Sewneyes.\"",
                "Free Choice."
            ],
            "content":"<div class=\"\"><div> <span>\"Huh, Speltzer Tavern\" I said, as I looked at the sign of the building I approached. The tavern was a big building clearly meant for people quite a bit bigger than me, as the doors at least four times my height and the building itself looked like it was one of the bigger buildings in town. After some thinking, I decided to enter the tavern so I could see if there was at least one person in the town.<br>\r\n<br>\r\nOnce I entered the Speltzer Tavern, it became obvious why it was so quiet outside. Inside the tavern, it looked like almost all of the people here were currently in here, either asleep from being absolutely stuffed or chatting amongst themselves in between meals. After some looking around for the tavern owner, I found a Shrew Anthro manning the bar, and since he seemed lonely and busy, I decided to talk to him for a bit.<br>\r\n<br>\r\n\"Hey, you.\" I said. \"It looks as if your having a bit of a problem. What's your name?\"<br>\r\n<br>\r\n\"Oh my name, it's Oliver Speltzer, nice to meet you.\" The shrew Anthro said while in the middle of cleaning used glass after used glass. \"Hey do you think you could help a bit with some work here? I'll pay you, of course.\"<br>\r\n<br>\r\n\"Pay?\" You ask, now intrigued. \"What kind of job are you talking about?\"<br>\r\n<br>\r\n\"Well…</span></div></div>",
            "created":1485849300,
            "id":2271546,
            "title":"...the Speltzer Tavern."
        },
        "133":{
            "author_id":"jawsometeeth",
            "author_name":"Goodvibes",
            "choices":[
                "Walk with Augustine to the Holme's Inn",
                "Ask Augustine a few questions while walking.",
                "Free Option"
            ],
            "content":"<div class=\"\"><div> <span>\"....I need to make sure a package gets to one of my friends\" Oliver announced, I looked at him with the intent to see any mischief in his eyes. <br>\r\n<br>\r\nI think Oliver is a kind enough man, or at least not a stupid one, that I nod my head in agreement. Besides, it wasn't like I could be a chooser at the moment, seeing as I needed the money to live.\"Sure, I can do this job? What will I be carrying?<br>\r\n<br>\r\n\"Not just you, I also hired another hand to he-\" Oliver was about to finish his statement, right before a glass bottle flew over my head. Oliver screeched and flew to the floor as if he was a hawk after prey. He got back up and cursed to the throwers. \"You better pay for that glass, Shaw!\"<br>\r\n<br>\r\nShaw---the shit, eating grin being a huge indicator--- laughed off this attempt at a threat. He wasn't a big guy either, hell, I beat in the contest of height. However, the I could faintly see the muscle on his frame, no doubt working a heavy lifting job. Still, maybe If I get the guy to pay for his broken drinking utensil, I could get some extra payment from Oliver. All from goodwill of course. Right before I could have a word with the man, someone else beat me to it.<br>\r\n<br>\r\nA loud crash came from the table and a donkey-anthro had her hand on it. Shaw looked at the donkey-anthro, who from my vantage couldn't have been a smidge or two taller than me, and immediately took out his wallet. He came right towards Oliver and mumbled out an apology, he walked back to his table. The donkey came over to us and I got a closer look at her.<br>\r\n<br>\r\nShe was muscled at her top,not to an exaggerated point, though anthro muscles did differ from humans. For all I know she could easily break me in two. A vest contained her modesty and a bandanna covered her hair. No doubt wanting her long-face to be uncovered. However, she did possessed a distinct figure if one looked downwards, her hips were as wider than her shoulders! I could see the contours inside her blue material, It was a sight for the eyes. I couldn't think what she was holding behind her. I shook my head a little, it was rude to stare at people<br>\r\n<br>\r\n\"Thanks Augustine!\" Oliver squeaked out.<br>\r\n<br>\r\nAugustine huffed and then looked at me. She nodded her head a little, probably as a way of asking \"who the hell is this?\"<br>\r\n<br>\r\nI held out my hand and replied to her.\"Just call me Henry, I heard we would be on an endeavor?\" <br>\r\n<br>\r\nAugustine grunted and walked behind the bar, I caught the briefest glimpse of her rear. It was an immense thing that I couldn't even hold with my entire arms-span. Again did I shake my head, staring is rude. A few moments later, Augustine walked back out carrying a large crate, she was also pushing one forward with her hoof. She looked at me, no doubt as an indication to take it. I got up from my seat and bent down to lift the crate. Heavy, but nothing to insane for my constitution.<br>\r\n<br>\r\n\"Great, now remember to take the to Holmes' Inn.\" Oliver said. Augustine was already out the door before he finished and I followed the girl as well.</span></div></div>",
            "created":1550715000,
            "id":2620606,
            "title":"I need to make sure a package gets to one of my..."
        },
        "134":{
            "author_id":"lwut2929",
            "author_name":"lwut",
            "choices":[
                "Henry agrees to help guard the bar.",
                "Henry refuses. He's got enough on his mind...",
                "Something else... "
            ],
            "content":"<div class=\"\"><div> <span>He'd finished wiping off the last of the glasses as he spoke, and with nothing left for his hands to do, he set them down on the bar and twiddled his thumbs. \"You wouldn't happen to know any experience with...you know...<i>guns</i>, and whatnot?\"<br>\r\n<i></i><br>\r\n\"...maybe?\" I answered, surprised to hear a question like that from the small, shaky little man.<br>\r\n<br>\r\nHaving noticed my confusion, he seemed a little more shrunken out of guilt. \"I know...pardon me if it's strange of me to ask, but with everything on the papers, I guess I'd just been getting a little desperate, lately.\"<br>\r\n<br>\r\nI pulled up a stool and sat down, resting both arms on the bar. \"Desperate about what?\"<br>\r\n<br>\r\nFor whatever reason, he seemed utterly perplexed. \"You mean you don't know? You don't know anything about the Sewneyes, and all the things they'd done?\"<br>\r\n<br>\r\n\"The Sewneyes?\" I repeated, the word feeling strange and unfamiliar on my tongue. \"Well, I'm not from around here, so I'm no expert. I take it they're outlaws, or something?\"<br>\r\n<br>\r\n\"Outlaws?\" He scoffed. \"Hell, most folks 'round here don't even know for sure that they aren't <i>ghosts!</i> Most we've got to know 'em for is just a string of towns that just go <i>kaput</i> in the middle of the night, hollowed out by morning of anything worth half a spit of takin'! They've got a string of crime stretchin' all the way across the country, and any day soon, it'll...it'll be...\"<br>\r\n<br>\r\nBy then, his speech'd been mixed too much with his ragged breathing to continue, and he just went limp, slumping down on the bar.<br>\r\n<br>\r\n\"Here.\" I offered, reaching into my bag and setting down a few dollars. \"How 'bout I pay for <i>both </i>of our drinks?\"<br>\r\n<br>\r\n\"...sure.\" He soon let out, taking the cash and turning to the barrels. \"I-I'm sorry, I've just got a lot on my tail right now...I can't even hold my weight against a few drunks, and any day now, I just know they'll be at the front door!\"<br>\r\n<br>\r\n\"The law any good around here?\" I asked, but quickly came to fear the answer, with everything at stake for me.<br>\r\n<br>\r\n\"Well, they're not <i>bad</i>,\" He mulled, pouring the first of two glasses of whisky. \"but I'm sure the Sewneyes'd torn through at least <i>one</i> good town on their big trip...\"<br>\r\n<br>\r\n\"Maybe they'll just skip by, or something. This place anything really worth looting?\"<br>\r\n<br>\r\n\"I sure hope not...\" He said tiredly, setting down both our drinks. \"Listen, I'm sure you've got your own business to tend to, and I don't wanna beg for help from somebody who'd just ran into town...but if you're also lookin' for a job, would anything I'm paying sound interesting?\"</span></div></div>",
            "created":1486946400,
            "id":2276819,
            "title":"I need help protecting my shop from the Sewneye..."
        },
        "14":{
            "author_id":"lwut2929",
            "author_name":"lwut",
            "choices":[
                "Henry helps him out.",
                "Henry declines!"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey, Fella, over here!\"<br>\r\n<br>\r\nMy muscles all clenched at once as that voice rang out from next door. With what was probably too suspicious of an expression on my face, I looked over their way.<br>\r\n<br>\r\nWith the exact same luck I'd had that fateful night, the emblem on the roof of their porch was a sheriff's badge, matching one that shimmered on the chest of his vest. Even better was how burly and thick his body was, so big that he was almost on the verge of spilling out through the mouth of the patio, and yet his arms struggled to hold the weight of a large package in his hands, his legs buckling out slightly.<br>\r\n<br>\r\n\"Y...Yes?\" I answered meekly.<br>\r\n<br>\r\n\"Mind giving me a hand with this, real quick?\" He asked, his voice grunting from the pressure.</span></div></div>",
            "created":1485831240,
            "id":2271438,
            "title":"Before he can read it, the sheriff calls on him!"
        },
        "141":{
            "author_id":"lwut2929",
            "author_name":"lwut",
            "choices":[
                "Hank offers him a tour.",
                "Hank gets up to get a crowbar, but winces; Henry asks what's wrong."
            ],
            "content":"<div class=\"\"><div> <span><i>Would not helping him out be suspicious?</i> I thought to myself, mulling my options over. <i>You know...yeah. Yeah, it probably would.</i> \"Sure, just hold on a second!\"<br>\r\n<br>\r\nSwiftly, yet quietly, I ran over to him and ducked underneath the crate, bracing both arms along the bottom and pushing up with my back. The sheriff's legs stepped out near me, and I took a step as well, the two of us walking through the door in synch.<br>\r\n<br>\r\n\"Right there, just in front of the desk.\" He instructed, and we sidestepped in unison to the left half of the office. When we were in front of the desk, I let go and slipped out of the way, and he slowly lowered the crate down with a pained groan that turned into a relieved sigh when it touched the ground. He let himself fall back into a fairly wide chair that stood behind him.<br>\r\n<br>\r\n\"<i>Hoo</i>...thanks, kid.\" He breathed out, one hand resting on top of his abdomen as the other came down to rub his left knee. Without the crate blocking my view of him, I could freely observe him in detail, and was almost split by what I was looking at. From the chest up, he had the jaw, neck, and arms with the rigid bulk of muscle that most other stallions tended to carry around, if only softened out by an inch or two of chub, but his burliness was rounded out from below by a pretty sizable stomach that sat nestled on his lap like a big bag of sand, a porky set of legs underneath that were clearly fond of just sitting around and lazing in chairs.<br>\r\n<br>\r\n\"You're new 'round these parts, arn't you?\" He asked, a friendly smile reaching along his muzzle as he thrust out an open hand. \"Name's Hank. The Sheriff 'round here, in case you haven't guessed!\"<br>\r\n<br>\r\n\"Uh...Henry!\" I responded, but silently damned myself for giving half my real name as I held my hand out, which was promptly crushed in a tight grip, and I let my eyes search around the room as he did most of the shaking for me, till they landed on the label painted not he crate.<br>\r\n<br>\r\n<b>WILLIAM R. BRASSE AMMUNITIONS, IL</b><br>\r\n<br>\r\n\"Henry...Brass.\"<br>\r\n<br>\r\n\"Nice to meet you, Mister Brass!\" He replied as he let go, the chair's legs creaking as he sat back. \"So, you just stopping by for a visit, or somethin' on those lines?\"<br>\r\n<br>\r\n\"Oh, you know, I'd just...well...I'd been...taking wherever the wind takes me, you know!\"<br>\r\n<br>\r\n\"Just seein' the countryside, letting' it takes you where it wants, eh?\" He continued, nodding sagely. \"I can see the interest n' that.\"</span></div></div>",
            "created":1485833040,
            "id":2271446,
            "title":"Henry helps him out."
        },
        "15":{
            "choices":[
                "Enter the General Store",
                "Go to the Doctor",
                "Go to the Train Station",
                "Visit the Mayor",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>The sign above me read \"Diamond Valley General Store\". The place looked small, but I bet it had as much as this town need. Maybe they'll have some food for me and Buckeye.<br>\r\n<br>\r\nLooking to my left, I noticed another small building. It was about the same size as the general store. I noticed a armadillo man limp into the building. Looked like he'd been shot. So the building must have belonged to the town doctor.<br>\r\n<br>\r\nLooking further to the left, I saw the town's train station. There was a large steam engine sitting at the station. Maybe there was someone there I could talk too.<br>\r\n<br>\r\nTo the right of the station was a much larger building. In all my time travelling from place to place, I could tell a mayor's office when I see one. Maybe I could slip in there and talk to someone.<br>\r\n<br>\r\nBut there could be other places and people in the town I could check out. After a little bit, I decide to...</span></div></div>",
            "created":1487474940,
            "id":2279336,
            "title":"Something else."
        }
    },
    "info":{
        "author_id":"lwut2929",
        "author_name":"lwut",
        "brief_description":"There's no place more perfect to start over than in the middle of nowhere.",
        "created":1485764340,
        "description":"<td align=\"left\" class=\"norm\">After wasting the very first years of his adulthood on crime and theft, the last robbery committed by Henry \"The Brat\" Dunwick brings his life as an outlaw to an end after a hail of gunfire chases him out of his old town, slapping his face on wanted posters for many miles. With nowhere to go, all he does is ride, traveling as far a horse can take a kid with nothing to keep him alive but his clothes, a bag of food, and a matchbox. After days go by with nothing in sight but the mesas and valleys of the countryside, he finally finds an area of solitude in a lone, yet populous town that was once the branch of a successful mining company, a town with mostly friendly faces who don't sour up when he comes near.<br>\r\n<br>\r\nCould Diamond Valley be a new start for Henry, or the beginning of another failure, brought on either by future hardships or his own past?<br>\r\n<br>\r\n<br>\r\n<div align=\"center\"><u><b>Characters</b></u></div><br>\r\n<br>\r\n<br>\r\n<b>Henry Dunwick</b><br>\r\n<br>\r\nSpecies: Human.<br>\r\n<br>\r\nHeight: 5'3\"<br>\r\n<br>\r\nAge: 22.<br>\r\n<br>\r\nThe main character of the story, a forcibly retired criminal who's been casted out of his old town after one of his latest bank robberies had gone horribly awry, making him a wanted man across the state. After riding endlessly through the deserts of Nevada in search of a place to hole himself up, he finally comes across the town of Diamond Valley, a quaint little pot of land hidden away from all the main roads and trails. With the chance to start of with a clean slate ahead of him, he decides to take on the face of yet another nice schmoe that nobody knows yet and shed behind his old ways, but how far behind him could they be gaining on him?<br>\r\n<br>\r\n<br>\r\n<b>Beatrice Holmes</b><br>\r\n<br>\r\nSpecies: Cow.<br>\r\n<br>\r\nHeight: 10'8\"<br>\r\n<br>\r\nAge: 41.<br>\r\n<br>\r\nThe bubbly and hospitable owner of the Holmes' Inn, an extremely obese cattle who's always glad to see a new face drop by for a drink or a bed. Whenever a stranger comes into town in need of a place to get his bearings straight, she's more than happy to toss them an apron and offer them a job, sometimes letting them stay upstairs until they can find themselves a home.<br>\r\n<br>\r\n<br>\r\n<b>Hank Erdnust</b><br>\r\n<br>\r\nSpecies: Horse<br>\r\n<br>\r\nHeight: 8'5\"<br>\r\n<br>\r\nAge: 43<br>\r\n<br>\r\nThe stern, yet kindly sheriff of the town, Hank is a walking brick wall of muscle who's a brilliant gunslinger and a fair lawman who skillfully keeps the town in order, but has lately put on a fair deal of weight after getting shot in the leg some years ago, making it harder for him to walk. He's hoping to retire soon, but is yet to find a suitable replacement to take the badge off his hands.<br>\r\n<br>\r\n<br>\r\n<b>Maddie Roche</b><br>\r\n<br>\r\nSpecies: Rattlesnake (naga style)<br>\r\n<br>\r\nHeight: 14'5\" by the torso, 33'7\" by length.<br>\r\n<br>\r\nAge: 98 (but still in her prime)<br>\r\n<br>\r\nThe large, <i>very</i> corpulent owner (and oftentimes addicted customer) of the Loon Corral, q local gambling house. Maddie is a paranoid emotional wreck who constantly gets in the face of anybody whom she perceives as a threat or nuisance to the town, oftentimes making an effort to scare them off and drive them out. Her weight makes her mostly big-bellied around her torso, but the lower half of her body is far thicker, and she tends to rattle her tail whenever she's agitated or angry.<br>\r\n<br>\r\n<br>\r\n<b>Oliver Speltzer</b><br>\r\n<br>\r\nSpecies: Shrew.<br>\r\n<br>\r\nHeight: 4'8\"<br>\r\n<br>\r\nAge: 41.<br>\r\n<br>\r\nThe new owner of the Speltzer Tavern after his father retired and placed the business on him, but he's far from ready to take on the job of handling a bar filled with the town's drunk residents, being too neurotic and tidy to sanely keep the place going. Since his dad tended the bars on his lonesome, Oswald is now totally alone, and is desperate for a second hand to help sand over the workload.<br>\r\n<br>\r\n<br>\r\n<b>Augustine Muller</b> (Created by Goodvibes)<br>\r\n<br>\r\nSpecies: Donkey.<br>\r\n<br>\r\nHeight: 5'6\"<br>\r\n<br>\r\nAge: 32.<br>\r\n<br>\r\nA friend of Oliver, she was taken in by his father after the death of her parents. The event changed in such a way that she has barley spoken to anyone besides Oliver. Even with a twelve year difference between them, they still can hit it off. Their relationship is a more platonic love for each other. Oliver did ask for her help in running the tavern, but she seems not to be interested in that endeavor. Although, she does come in if he needs help with any serious troublemakers or to restock his supplies. Currently, her job is a \"handywoman\" so to speak, where she helps build new buildings for the town. Alternatively, she helps lift heavy loads and bring them to other parts of the town.<br>\r\n<br>\r\n<br>\r\n<b>Marie Westbrook</b> (Created by The 12th Doctor (non canon))<br>\r\n<br>\r\nSpecies: Komodo Dragon.<br>\r\n<br>\r\nHeight: 11'3<br>\r\n<br>\r\nAge: 43.<br>\r\n<br>\r\nMarie is the owner of Diamond Valley's only train station. She and her husband, human repairman John Blake-Westbrook, were the ones who asked for the station to be made, to make trade and travel easier for the people of the town. They have a home in the station - which is good, because Marie is so immensely fat that she can't leave her bed or her bedroom.<br>\r\n<br>\r\nMarie and John are fairly well known throughout the town as nice people. John does whatever he can to fix things around town and is always lending a helping hand. Marie, meanwhile, is always happy to let people speak to her and discuss their problems. There's a rumor going around Diamond Valley that Marie is trying to get even fatter.<br>\r\n<br>\r\n<br>\r\n<b>The Sewneyes</b><br>\r\n<br>\r\nThe name for a largely unseen gang of traveling outlaws who commit all their crimes blindfolded in the dead of night, responsible for a series of raids and robberies that are performed with a surprising amount of grace and skill. They tend to hole up in dark, abandoned areas when they stop to establish as a temporary base, not unlike the abandoned mines just up the mountains near Diamond Mine Valley...<br>\r\n<br>\r\n<br>\r\n<b>Elaine Rooke</b><br>\r\n<br>\r\nSpecies: Crow<br>\r\n<br>\r\nHeight: 17'11\"<br>\r\n<br>\r\nAge: 32<br>\r\n<br>\r\nThe leader of the Sewneyes, and also the biggest out of the entire gang. Despite being massively obese, she can run, jump, and maneuver her way out of any bad situation with highly acrobatic flair, able to bend in ways you wouldn't think possible with arms and legs as thick as hers are. Her lackeys are pretty much the only other people who get to interact with her, being as elusive as she is, but she can come across as very charming and charismatic. Still, when the chips are down, she's a true and brue criminal who won't stop at nothing to get what she wants.<br>\r\n<br>\r\n<br>\r\n<b>Buck Tanner</b><br>\r\n<br>\r\nSpecies: Coyote<br>\r\n<br>\r\nHeight: 10'11\"<br>\r\n<br>\r\nAge: 27<br>\r\n<br>\r\nWhile the Sewneyes perform under secrecy and stealth, Buck Tanner commits all his crimes right in the light of day, with little that could stand in his way that he couldn't just grab and throw over his shoulder. Anything Henry'd stolen all his life couldn't match what Buck grabs for himself in a <i>year</i>, and the calvalry of muscle he lugs around reduces Hank's to that of a child's, his towering build riddled by scars from every conceivable blade. He almost has no expression aside from a stony grimace, and rarely speaks unless something <i>really</i> manages to anger him.<br>\r\n<br>\r\n<br>\r\n<b>Rules:</b><br>\r\n<br>\r\n- Henry cannot grow or gain weight.<br>\r\n<br>\r\n- Don't kill off characters without my permission. Killing off other user's characters is forbidden.<br>\r\n<br>\r\n- Maximum character height is 50 feet.<br>\r\n<br>\r\n- All characters must be at least 21, but no elderly.<br>\r\n<br>\r\n- Henry is always the main character. I'll start the story off in first person, but I don't object to other perspectives, as long as there aren't any tug-of-wars over them.<br>\r\n<br>\r\n- Original characters are more than welcome. Should you wish, hit me up with an email an I'll add their bio to the front page. (On the subject, only original characters; no fanfiction.)<br>\r\n<br>\r\n- Mythical creatures are allowed, minus humanoids (i.e. harpies, centaurs, etc.) Humans are also allowed, but I would still like the focus to be devoted to Jacob and the anthros he interacts with.<br>\r\n<br>\r\n- No torture, necrophilia, rape, pedophilia, underage, tgtf, futa, diapers, scat, water sports, non-oral vore, or hard vore. In terms of violence, keep this the tone of an average spaghetti western, not a Tarantino one.<br>\r\n<br>\r\n- Male characters are allowed, and are free to be fattened up, but (with no disrespect intended) I want Henry to remain straight.<br>\r\n<br>\r\n- Weight gain and any amount or means of weight gain is allowed, as long as it's paced to let the reader take it in.<br>\r\n<br>\r\n- Each entry must be at least 7 lines long. I'll be looking for solid attempts at story and detail here, so any chapter whose length I don't approve of will be banned on sight.</td>",
        "id":2110484,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1550716320,
        "modified":1550716320,
        "pretty_title":"Anthro Western"
    }
}