{
    "chapters":{
        "1":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "One prototype chariot to go..!",
                "I can turbo charge that..!",
                "Torque, set, truck, pairing..!",
                "Blue sky, with an option for wings..!",
                "So what is it this time..?"
            ],
            "content":"<div class=\"\"><div> <span>\tThe year is eight hundred and thirty four of the Toranthan Era, or T.E. This era was brought about as a direct consequince of the Monastic Order of Hilmareem, blessed with near absolute authority in the area of faith and spirituality following the fall of the Gilragden Empire. Rallied the various fiefdoms and their militaries to attack the independent city-state of Torantha for refusing to accept their holy word and oust the Toranthan Shamanism. The holy war ended violently for both the Leadership of the Hilmareem as well as the various fiefdom lords. The initial transition into Toranthan rule was peaceful with tolerance being extended for followers of the now vanquished religion. However continueing complications with frequint revolts over faith soon undermined the authority of Toranthan Senate of Elders and triggered a coup from a militaristic group identifying themselves as the Vilrakiin Order. The quick upset in leadership quickly saw dissidents silenced ushering in an age of militaristic expansion coupled with dictatorial oppresion. Eventually resulting in the complete conquest of all vital regions of Agrith by the third century T.E. The next five hundred years saw little change within the Vilrakiin Order ruling in an elitist fashion with near absolute authority and power. Diliberately causing famine and rippening the conditions for rampant disease through their policy of over taxation and neglect of the common populace. Their tyranical behavior changed drastically when a call to arms was declared. This was meant to rally the people of Agrith against a common enemy. Nearly two decades of preparation were witnessed before the conflict erupted with an invading alien species calling themselves the Sabron Imperium. In under thirty-eight hours The Vilrakiin Order surrendered in light of their previous declaration of  \"Fighting until the last man.\" Sabron control was a quick transition, with the Imperium spending exhorbinant amounts of materials in order to construct Agrith's near non-existent infastructure. Chief among their concerns was the construction of a spaceport. Which quickly blossomed into an experimental metropolitan and political command zone. Archetype City.<br>\r\n\tSeeking gainful employment in the newly constructed capital city of Agrith coupled with its assortment of advanced industrial equipement. Several million have flocked to new city seeking their fortunes. Remnants of the Vilrakiin Order, convinced the Sabron adminstration to accept an admentment to the Occupied Agrith Constitution. Which was then modified to reflect the Sabrons belief in equality of the law. That any person or persons seeking employment in job affected directly by resonance manipulation serve for a limited capacity as an altered. The denizens of Agrith call them Magic Casters. The technocratic Sabrontason called them practicioners.The Vilrakiin remnants begrudgingly agreed given the nature of the Sabron backed practicioner group, the Surauto Vaim nes Archanaun. A seperate independent, guild-state, with autonomous, self regulatory authority to oversee any and all practicioners within their area of domain. While the Vilrakiin order strugles to reshape its identity in order to survive under post Sabron rule. The various, and once oppresed peoples of Agrith have accepted the Sabron as liberators, as the world surges forward in an unprecedented renaisance.<br>\r\n\tThe story takes place in Archetype City, capital of planet Agrith, post Sabron Invasion. Starting at a courier company, Chariot Couriers. Several small outfits such as this, have sprung up using humans who have been transformed into robot cycles called Chariots. The story may either follow the couriers or the packages reciepients once they have been introduced.<br>\r\n<br>\r\n<br>\r\n\tThe lone male worked diligently at his holo-consul. Sorting away at a myriad of information. Before a message alerted him to a job request. He selected a number of possible candadates meeting the criteria before forwarding the message. Not surprisingly he received multiple responses. Using pre gathered intel to determine tests. He checked with dispatch to see if anyone was in the werehouse. With a \"no\" response. He alerted his compatriots before departing his work station. His Sabron lizard-like tail swinging as he left.<br>\r\n\tHe looked off to the side as the receptionist greeted another batch of candatates with the first one being converted into a 2d human sized poster card, called a flat cell. The receptionist numbered it, hung it off to the side  before continuing to the next candadate.<br>\r\n\tThe Sabron continued from the offices into the werehouse, multiple room length aisles consisting of flat cells awaited him. With purpose he checked his Electronic Wrist Computer. Assesing the best candadate from the test data. He then noticed multiple requests from his coworkers to obtain flatcells on their behalf. The Sabron etched a path into his mind before executing his retrieval mission. Gathering, before rolling the flat cells into cylanders, then marking them for dilivery. He arrived just as the couriers did in the loading bay. Checking off the master manefest and noting the area of assignment. He delivered the cylanders and their living occupants to the couriers for safe delivery, Wondering why to himself the couriers insisted on logos when their chasis was a dead give away of employment. Yet as they departed, so did he. Passing another Sabron, self tasked to work the werehouse while he returned to the offices. Meanwhile, reflecting on his peoples efficientcy, and effectiveness...<br>\r\n<br>\r\n<br>\r\n\tThe courier didn't like the Sabron, always rubbed off to them as a calculating cold. They didn't pay it much mind. Charging onto the Cityway. The over desinged, under used, asphalt road. Was redundant given the Sabron's inclination towards mass trasit light rail. The courier came back to reality as a convoy of coffins raced pass. The police chariots were constructed to house and transport full humans. The enclosed space was said to be akin to a coffin, so the name stuck. Well armed and well armored. Few chose to contest them, even fewer their convoys, with their blaring sirens speeding past. The courier let them pass before continuing there own path. The interlocking network of one way roads allowed access to the entire city. No speed limit, fines only if your safeties didn't work, you run out of gas, or your vehicle leaks oil. The courier couldn't be happier as it accelerated towards it's top speed.<br>\r\n<br>\r\n<br>\r\n\tThe Sabron Vika-Mang, wore her mechanic blue coverall, wrapped snugly around her waist. Her brown tank top worn snugly around her bosum. Her tall slender and muscular frame both femanine yet intimidating. She was more Sabron in appearance then most of her ilk. Streaks of scales dotted her skin. Blending perfectly against the oil and other petroleum based fluids splashed across her. She stopped abruptly to check the time. The Chariot she had been working on was half way dismantled. To ensure Chariot Couriers remained competitive she needed to provide effective and safe designs for her chariot/employees. Something few of them understood.<br>\r\n\tQuickly cleaning her self enroute to the loading bay she was greeted by the companies newest aquisition. The courier handed her the tube containing the flat cell. From there it was usual short business. She got the impression that courier didn't like her kind. Didn't matter she supposed, as long as the courier did their job. She arrived quickly on Karen. The president was a low ranking Vilrakiin. Both wanted to start a business, so they teamed up. Karen's holographic image greeted Vika-Mang on her desk top as she entered the main office. Due to laws, concessions had to be made. Together, both lacked the funds for a Re-assembler, and operations without one would be cost prohibitive. So Karen had herself transformed. In exchange, Vika-Mang upgraded Karen's hardware to double as a super computer so she could oversee company operations. This left Vika-Mang as the defacto owner. Though aside from the occasional signature, she was mostly free to tinker and improve chariot designs. An odd but effective relationship.<br>\r\n\tVika-Mang lifted up the cylander and smiled. Karen eagerly returned the gesture...</span></div></div>",
            "created":1328082900,
            "id":1269161,
            "title":"Last episode. Overview of Agrith's History..."
        },
        "11":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "Daniel. A chariot is born..!",
                "Chris. A chariot is born..!",
                "Alex. A chariot is born..!",
                "Max. A chariot is born..!",
                "Other? This chariot is here for the job..."
            ],
            "content":"<div class=\"\"><div> <span>Vika-Mang lifted up the cylander in hand, the new flat cell acquisition brought a smile to the two women.<br>\r\n<br>\r\n\"You have those new schematics I uploaded?\" Asked Vika-Mang.<br>\r\n<br>\r\n\"Sure do.\" Retorted Karen's electronic voice through her holo image. \"I must say, your kind doesn't overlook much do you?\"<br>\r\n<br>\r\n\"I'd have to answer no. We overlook plenty. Just not when it counts.\"<br>\r\n<br>\r\n\"So what do you have planned?\"<br>\r\n<br>\r\n\"If the design performs to intention, we should see an speed increase of fifteen percent, weight decrease of ten percent, and a handling increase of twenty-two.\"<br>\r\n<br>\r\n\"So overall?\"<br>\r\n<br>\r\n\"Depends on them.\" Replied Vika-Mang, holding up the cylander.<br>\r\n<br>\r\n\"I suppose I'll get ready.\"<br>\r\n<br>\r\nKaren's holo image disapeared before a surge of energy was diverted to a low silhuete metalic box. The lid opened up revealing computer innards stored on the underside of a framework spanning the short metalic tub. Vika-Mang lifted at a lever quickly pulling all the hardware out of the chamber. Unfamiliar energy seemed to pour out from the tubs metalic walls creating a bath of sorts. Glyphs of blue energy began to appear across the metal framework. Soon everything contacting this fluid began to change and transform. The Re-assembler was reforming into its intended design. A magical energy bath.<br>\r\n<br>\r\nVika-Mang placed her arm into the energy bath. Appearing to smile as she let the bath wash over her exposed skin. \"I really am looking forward to later. But for now.\" Vika-Mang extracted the flat-cell, duplicated it's critical data before thrusting it into the heart of the Re-Assembler Karen. The magical fluid began to boil while gray fluid shot outward from the flat-cell creating the frame work for the new chariot. Like an embryonic process the flat-cells occupant was reborn in minuets into a chariot complete with company logo and pink paint.<br>\r\n<br>\r\nThe chariot took on its robot design and had difficulty getting out of the Re-Assembler.<br>\r\n<br>\r\n\"Careful now. I have to add fluids and oils for your hydrolics and engine.\" Stated Vika-Mang. \"Plus you don't want to damage your boss and payer.\"<br>\r\n<br>\r\nThe chariot looked at the Sabron questioningly before carefully continueing its extraction. While the Re-Assembler took on its storage appearance.<br>\r\n<br>\r\nClear, Vika-Mang returned the hardware innards to their storage place with Karen's image soon appearing on a holo display nearby.<br>\r\n<br>\r\n\"The rules hear are simple.\" Stated Karen. \"Do your job, and do it well. Stage one contract is until you've worked off your transformation. Stage two, your an independent contractor, and keep most of your earnings. Penalties are acrued for damages against yourself, property, and or others. Underperformance nets you time in Vika-Mang's motor pool.\"<br>\r\n<br>\r\n\"It's not that bad.\" Contested Vika-Mang. \"I'll mostly see you for routine maintenance. Such as fluid levels, performance testing and such.\"<br>\r\n<br>\r\n\"I meant your tinkering.\"<br>\r\n<br>\r\n\"How else am I supposed to improve upon my designs? Draw them up? I'm not a specialist in theoritcal science and practical application. If I was, my name would be Hivri-Gand.\"<br>\r\n<br>\r\nThe newly minted cycle bot looked on confused. Then it noticed its metal skin.<br>\r\n<br>\r\n\"But enough about us.\" Continued Vika-Mang. \"This job is your rebirth, whether you use it to re-create yourself or insist on retaining your pre-flat-cell identity. Let's hear about you?\"<br>\r\n<br>\r\nThe Bot-cycle took a moment in decision before responding. \"I am...\"</span></div></div>",
            "created":1328128560,
            "id":1269324,
            "title":"One prototype chariot to go..!"
        },
        "111":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "I was, or atleast I think I am, a male..!",
                "That certain image, my new female visage..!",
                "Another's tale..."
            ],
            "content":"<div class=\"\"><div> <span>They could again once feel a body. The cold metalic flesh responding to their every command. It seemed so foreign, yet somehow familiar. They understood it was their flesh reformed in the arcane bath of a Re-Assembler. They had changed, liberated from their cage only to be bound within a new one. They could see their image in a nearby mirror. They had been rebuilt into a chariot. Their eye drifted. A Sabron, here? They were saying something. It touched its hand to its forhead. An image of a friendly face, a Sabron face greeted its memory...<br>\r\n<br>\r\n\"..Now its important to pay attention and watch were you step.\" Stated a small frame Sabron, their tail swinging eagerly before the group. \"Of course you are perfectly safe inside this room.\"<br>\r\n<br>\r\nAn unfamiliar face came forward. \"How can we be safe with that Re-Assembler there.\" They stated in an accusatory tone.<br>\r\n<br>\r\n\"Do you have work card?\" The Sabron inquired. After a pause. \"Does anyone in group have work card?\"<br>\r\n<br>\r\n\"No one told us about a work card.\" Stated another person.<br>\r\n<br>\r\n\"Work request poster should of.. How many can read?\"<br>\r\n<br>\r\nOnly a few of the rooms occupants raised there hands. The Sabron didn't look happy. Sighing before continueing. \"Welcome to werehouse. Is being big place. This area is in offices. This room being in-processing and reception. While hatred toward Vilrakiin understood.\" Stated the Sabron motioning to the Re-Assembler. \"This equipement being drone, require operator. I Ekri-Rin am being such. Equipement is being newer gen. Older re-assigned to City's Military block. Each have signed contract yes?\"<br>\r\n<br>\r\nNo one seemed to object.<br>\r\n<br>\r\n\"Will assume no one read, or being untrue, not all read yes?\" Stated Ekri-Rin rhetorically. Pausing for only a brief moment in contemplation. \"Let me begin by welcoming you or welcoming you again to the experimental municipality and political zone. Archetype city. As planets main, and currently only space port. The OAC being declaring city politcal capital of Agrith. My people as being new overlords, have brought in contengent of Sarauto Vaim nes Archanaun. Vilrakiin Order have also contested control of city. Peace is being price of treaty, and admendment. Neither organization have authority to police those out side of their own. Both have acquired great standing in city's economy. Admendment dictate any seeking employment in field affected by resonance manipulation..\" Ekri-Rin could tell they didn't understand. \"Is being field affected by magics.\" The crowd seemed to grasp it finaly. \"That employment is being transformed for period of intern.\" Ekri-Rin paused for a moment.<br>\r\n<br>\r\n\"What about those not aligned to either organization?\" Asked someone.<br>\r\n<br>\r\n\"I am being wasting much time. Others expected soon. Answer quick yes? City is being declared monopoly zone. Alegiance is being sworn to either Vilrakiin, Sarauto Vaim, or glorious Imperial Guard. Those seeking other are relegated to fringe zone. Is not being personal, only prudent.\"<br>\r\n<br>\r\n\"So then independent mages have to practice on the city's outskirts?\" Asked another.<br>\r\n<br>\r\n\"Answer is being yes and no.\" Replied Ekri-Rin. \"Sabron tradition is being dictating business interests require liscence for operation. Both organizations have paid fee in price of volunteers for Re-Assembler duty. Independent mages must likewise pay same fee, proportional to personal. Are there independent mages in goup?\"<br>\r\n<br>\r\nThree people held up there hands.<br>\r\n<br>\r\n\"Is group one or seperate.\"<br>\r\n<br>\r\n\"Seperate.\" They answered.<br>\r\n<br>\r\n\"Then is problem. Price must be being paid for Liscense. Three for three liscences. Mandated Imperial tax rate is being one for five value or equivelant. If you step aside, attendant will be arriving to discuss exchange.\"<br>\r\n<br>\r\nThe three complied.<br>\r\n<br>\r\n\"Special concerns is being seperately addressed. Already established none have work cards. Which guarentees employment without need of undergoing transformation. If havin...\"<br>\r\n<br>\r\nA group of four held up yellow cards.<br>\r\n<br>\r\nEkri-Rin gave a quick smile. \"Those cards are being work request, is simular but different. Please wait until all others are processed before approaching. Now if everyone here for employment were to line up with paperwork in hand. I'll begin.\"<br>\r\n<br>\r\nThe various people did so.<br>\r\n<br>\r\n\"Process is being simple, is werehouse. Step atop Re-Assembler. Agree and will being transformed. Is flat-cell, perfectly safe. Correct yes Rachel.\"<br>\r\n<br>\r\nA 2d image of a woman on a wall waved back at everyone. Until then, Daniel had just assumed she was a clear poster.<br>\r\n<br>\r\n\"Process is quick, painless, and simple. Flat-cell is numbered with relevant intel before storage. Is storage for your body, and should you chose, your mind. Though werehouse has internal server which will allow flat-cells to communicate and keep up to date.\"<br>\r\n<br>\r\n\"How long will we be stored?\" Asked another.<br>\r\n<br>\r\n\"Is being last question answered yes.\" Stated Ekri-Rin in a matter of fact tone. \"Storage will last until work request is filled, from there the best applicant is chosen, or you should decide to seek employment elsewhere, at which point we revert you and be sending you outside the city.\"<br>\r\n<br>\r\nThe various applicants began getting processed until it was Daniel's turn. At which point, Ekri-Rin made one last statement. \"One last thing, we have received complaints about disorientation following conversion. I am being  told this is natural side effect with no case of amnesia yet reported. So process is being safe.\"<br>\r\n<br>\r\nDaniel stepped up and underwent flat-cell conversion. Eventually being hung behind another flat-cell. What an aisle, and then it wasn't the only one. How many? Daniel didn't know. Archetype City. The place of opertunity. At least the open chat kept Daniel stimulated. But it was without the trappings of humanity, just pure electronics with source codes. After a time, Daniel couldn't help but feel envious of the rear side of the female figure in front. \"At least I have a view...\"<br>\r\n<br>\r\n<br>\r\n\"You are?\" Inquired Vika-Mang.<br>\r\n<br>\r\n\"Is that normal?\" Inquired Karen.<br>\r\n<br>\r\n\"I think is being symptom of body disassociation.\" Observed Vika-Mang. \"Perhaps jolt to computer might...\"<br>\r\n<br>\r\n\"I am Daniel.\" The prototype chariot replied.<br>\r\n<br>\r\n\"I am being pleased to meet you.\" Stated Vika-Mang.<br>\r\n<br>\r\n\"Likewise.\" Stated Karen's holograph.<br>\r\n<br>\r\n\"Pink huh.\" Observed Daniel.<br>\r\n<br>\r\n\"Is not being in my schematics, is it being problem?\" Asked Vika-Mang.<br>\r\n<br>\r\nDaniel watched for a moment. What did Vika-Mang say? New body is rebirth, can retain old identity or create new. The next few words would define the new Daniel...</span></div></div>",
            "created":1328218860,
            "id":1269919,
            "title":"Daniel. A chariot is born..!"
        },
        "12":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "Viewpoint of a chariot..!",
                "A turbo charge tale..!",
                "Around the circuit..!",
                "Cyber-magic machine Karen..!",
                "Other? What is left to be said is..."
            ],
            "content":"<div class=\"\"><div> <span>Vika-Mang lifted up the cylander in demonstration to Karen's holograph. \"I am being eager to meet new employee. Can test new schematic design?\"<br>\r\n<br>\r\nKaren had to smile. Her overly capable business partner may of been a Sabron. May of even by law,  be her owner during her period of alterment. But aside from the occasional vocabulary slip-up. Acted like a kid anytime she genuinely wanted to do something. Karen let her thoughts go over the companies financies. In moment she displayed the relevant details.<br>\r\n<br>\r\n\"Appears design will have to wait.\" Stated Vika-Mang, after a moment of checking her own calculations. \"Would thought, we be doing better.\"<br>\r\n<br>\r\n\"We can still try it.\" Stated Karen.<br>\r\n<br>\r\n\"Is better not doing.\" Stated Vika-Mang. \"Too many unknowns, to little safety net. Standard is being best.\" Vika-Mang had to smile.<br>\r\n<br>\r\n\"Guess I'll get started.\" Stated Karen as her holo-image dissipated. Her predicament was the cost of going independent. It further hadn't helped her to align herself with a Sabron when many of the Vilrakiin Order still exhibited heavy bigotry towards their worlds new masters. She let her mind tap into lay line resevoirs to acquire the additional magic she would need. She could feel Vika-Mang pull at her mind, standing the rack upright and exposing her typically concealed electronic body to the open. That feeling, however unpleasant was only temporary. She could feel the wealth of energies pooling into her body. The feeling of it reshaping into its intended active form. Moments trickled by as she metamorphosed into the arcane bath of her Re-Assembler design. Perfectly capable, yet unable to speak or respond.<br>\r\n<br>\r\nVika-Mang went over to Karen's consul and pulled up the standard chariot schematics for the company. It had been her last big break through. A descent design offering overall reliability and impresive performance. The holo-screen came up, asking confirmation. Vika-Mang placed the flat-cell within the magic bath, made sure she was clear before activating the Re-Assembler. \"On plus side.\" Stated Vika-Mang to Karen. \"Modification is allowing you ability to act in greater capacity then design.\"<br>\r\n<br>\r\nKaren would of agreed if she could of responded. That extra frame hardware, non-standard in her transformation allowed her to retain her human self, abit in a cybernetic sense. Most transfromed mages were reduced to powerful arcane machines with a tech control collar offering anyone the ability to use them. Mindless drones faithfully carrying out their duties until their contracts were paid off. At least this way she had some say.<br>\r\n<br>\r\nAmber knocked on the office door before entering. The average height, thin build blond, had the perfect cheerleeder look for her, and would amusingly act as the companys go to morale builder.<br>\r\n<br>\r\nVika-Mang turned her head towards Amber. \"Is business being good?\"<br>\r\n<br>\r\n\"It's always excellent Vika-May.\"<br>\r\n<br>\r\nVika-Mang's eye lifted up in slight iritation. She tolerated the many employees frequint alteration of her name because she understood it made her more personable. Plus their response was, it made it sound more feminine. She was a female, so she didn't understand how she couldn't be feminine. \"Is being appointments then?\"<br>\r\n<br>\r\nAmber smiled and bowed courtly. \"I've forward relevant information to dispatch but there is one Jeffery Adams. He is offering a complete dinner with a night of entertainment.\"<br>\r\n<br>\r\n\"Free food is good.\" Stated Vika-Mang absently. \"Very few restuarants cater to the Sabron palet. Please tell him invitation is being accepted. Though I fail to see how dancing, unclothed women is being entertainment. Has artistic value though.\"<br>\r\n<br>\r\nKaren had to laugh internally. The Sabron seemed to have no concept of flirtation. Sure, Jeffrey invited others to his little events. But Vika-Mang was the only female.<br>\r\n<br>\r\n\"I'll relay that message just as...\"<br>\r\n<br>\r\n\"I think new employee is being ready. Yes?\" Vika-Mang turned to retreave the newly born chariot. It stumbled carefully as it adapted to its new body. \"Please take it easy, no need to damage your boss, as she does cut your checks.\"<br>\r\n<br>\r\nThe chariot looked at her curiously for a moment before continuing.<br>\r\n<br>\r\nAmber bit her lower lip. \"You gonna test them?\"<br>\r\n<br>\r\n\"Is being prudent, yes?\"<br>\r\n<br>\r\nAmber assisted Vika-Mang in helping the chariot out of the Re-Assembler. \"Alright fellow employee.\" She stated aloud in a welcoming tone. Rules are simple, penalities will be accrued for any damages afflicted against your self, others, or property during your employment. Contract is until you pay back the transformation cost. Then your an independent contractor, able to keep most of your earnings. Like me.\"<br>\r\n<br>\r\nThe chariot looked questioningly as it kneeled down and took on its cycle appearance.<br>\r\n<br>\r\nVika-Mang was quick to go over all final checks and services before preparing to mount the cycle for testing.<br>\r\n<br>\r\nKaren had already returned to normal, thankfully Amber put her brain back in its case so she could resume operations. \"They'll be time for introductions later.\" Stated Karen. \"But lets give you a full shake down to help you acclimate to your new body. Amber, if you would be so kind.<br>\r\n<br>\r\nAmber shot a glance back at the holo image. She was clearly biting her lip in anticipation of giving her new co-worker a ride. \"I'm your senior and a Kep'rim turbo.\" Amber mounted the cycle, letting the loud roar of its engines wash over her. She locked her feet in then her hands. In moment, her areas of contact began transforming into an extension of the Chariot. The process was quick, with Amber becoming an indistinguishable part of the cycle.<br>\r\n<br>\r\nVika-Mang pulled at the throtle. The chariots engines roared with their increased power. Vika-Mang grabbed her cycle jacket and helmit and mounted the Chariot motorcycle. With a smile she spoke. \"Turbo's are the seniors in this outfit and will teach you the lay of the land. I can only wonder what it must feel like to be such an instrument of power, to be augmented to have such thrust. When we get back you'll get assigned. Of course if you impress upon any of the turbos your worth, then it isn't entirely uncommon for reassignment to their independent fleets. I hope you enjoy the feeling of Amber's power. Cause I'm about to enjoy the two of you.\"<br>\r\n<br>\r\nVika-Mang gave one thumbs-up to Karen who returned the gesture. She then drove the new chariot out into the city...</span></div></div>",
            "created":1328136060,
            "id":1269405,
            "title":"I can turbo charge that..!"
        },
        "121":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "The mind of Vika-Mang..!",
                "Chariots perspective..!",
                "Turbo charge find..!"
            ],
            "content":"<div class=\"\"><div> <span>What is this feeling, this enviornment, what am I? Asked the Chariot to itself. That Sabron receptionist had warned him that body dissasociation tended to become common occurance for anyone stored to long. Was I a man, or a woman? The chariot couldn't even recall its name. only the memory of looking outward against the same image for the passing of countless days. Their mind tied into a network of other's awaiting job placement at, what was it? The Werehouse?<br>\r\n<br>\r\nThen came the message, followed by the test. The feeling of being disconnected from the network, the world it defined itself in. Its carboard cylandrical container, the sensation of movement, and now it gazed forward at its own metalic skin. It had been reborn, it's nearby reflection let it understand its new role. Whoever it had been, it was now a Chariot. An automated, human mind driven bot-cycle with prelimary transformational abilities for moderate interaction in its enviornment or else high speed movement.<br>\r\n<br>\r\nEverything was new. It needed time to adjust. Time to understand itself. Kep'rim? Turbo? A young blond mounted its chasis. Before fusing with it. The Chariot felt defferent, no longer in control.<br>\r\n<br>\r\n\"Hi, I'm Amber.\" Came an energetic voice. \"You are now, an extension of me. I understand you'll be having some difficulty readjusting to standard thought processes so I'll go easy on you. Love to run you through the cycles and teach you the in's and out's of your new form. But Owner wants to test us.\"<br>\r\n<br>\r\nThe shared sensation of a warm, flesh and blood body climbing its backside. Mounting them, testing their reaction before driving them forward. What was this sensation?<br>\r\n<br>\r\n\"I'll admit I love riding.\" Stated Amber, her voice barely containing her arousal. \"But being ridden is entirely something else.\"<br>\r\n<br>\r\n\"We ready?\" Asked Vika-Mang's voice through a microphone.<br>\r\n<br>\r\n\"We're ready.\" Replied Amber. \"Test us as you like, I'll be working on waking our sleeper.\"<br>\r\n<br>\r\n\"Edriim.\" Replied Vika-Mang.<br>\r\n<br>\r\n\"Thats just the same as 10-4.\" Stated Amber to the Chariot. \"Now if only I could get...\"<br>\r\n<br>\r\nThe singular fixed perspective transformed into an assortment of images. Forward, left front, right front, either side, and reverse. The asphalt road appeared one way in a trench. The chariot could feel itself accelerating under the hand of it's rider. The sensation of hot smooth asphalt. What a wake up.<br>\r\n<br>\r\n\"Careful there.\" Warned Amber. \"I was a bike person before this job and your just getting us more worked up then we need to be.\"<br>\r\n<br>\r\nThe Chariot could began feeling its performance suffer, its attention fracture. Then it could hear the Sabron swearing.<br>\r\n<br>\r\n\"I wouldn't worry Vika-Mang.\" Stated Amber through their speakers. \"This one is a natural. Getting a real hard on for the experience. We're finding it difficult to.. To.. Focus..\"<br>\r\n<br>\r\nThe Chariots restlessness seemed magnified by Ambers. \"Stop.\" She commanded. \"Or I'll have to shut down sensors.\"<br>\r\n<br>\r\nThe Chariot did its best.<br>\r\n<br>\r\n\"It's.. It's.. Better..\" Slured Amber in a daze. \"Now watch our.. Our speed.. You'll only see this.. This when your merged with a tur.. Turbo..\"<br>\r\n<br>\r\nVika-Mang kept pushing the cycle in an attempt to achieve its maximum speed. Her sonar receptors in her hands, feet, and tail became awash in sensation as she not only observed her surroundings through her eyes but felt an image of it in her body. From the passing of hard rubber across asphalt, the firing rods of the engine, the passage of volts through the cycles frame. The rapid and repeated assualt against her senses assailed her. While her determination and discipline carried her forward, her body betrayed its delight.<br>\r\n<br>\r\nThe Chariot could feel the increased heat in its rider, even the wind did nothing to deter or even conceal this.<br>\r\n<br>\r\n\"Don't let the all business demeanor.. Of Vika-Mang fool you.. Fool.. Fool us.. Hard to.. To think..\"<br>\r\n<br>\r\nVika-Mang had reached her destination, pulling off of the trench-way. She brought the Chariot to a stop. Taking only a moment to check fluids, engine temperature, and the speedometer.<br>\r\n<br>\r\n\"You are quite the find.\" Purred Vika-Mang. \"Amber should of only boosted your abilities about thirty percent. Twelve percent above a turbo's standard. You must of been quite the athlete.\"<br>\r\n<br>\r\nThe Chariot could sense a well of pride at the mention of that term. Could remember how it used to love to run. Before its flat-cell conversion, before this new body.<br>\r\n<br>\r\n\"You did, we did splendid.\" Stated Amber excitedly. She triggered the bot configuration. Everything about the Chariot was streamlined. Its shapes, its movement. Amber used a nearby window to check their reflection. \"Turbo's work in tangent with either Chariots or Trucks. We get control while we're fused. Of course I don't mind riding you as my human self.\"<br>\r\n<br>\r\nChariot remembered much, its past, its presence. The hope it had for its future. The wealth of memories flooded back. The Chariot knew instinctively which ones were its own and which ones were Amber's or others.<br>\r\n<br>\r\n\"Finally something decent to eat.\" Stated Vika-Mang walking up to a stall vendor cooking an assortment of food.<br>\r\n<br>\r\n\"I thought Sabron's get sick when they eat cooked food.\" Stated Amber in observation.<br>\r\n<br>\r\n\"Nonsense. Thats only if we eat food with processed ingredients.\" Vika-Mang quickly placed an order with the chef before looking back at the Chariot. She tilted her head for a moment before speaking. \"Amber dear. Please give speech control to our new employee.\"<br>\r\n<br>\r\n\"But I like the control.\" Pouted Amber.<br>\r\n<br>\r\n\"And you'll have plenty of oppertunity for that later.\" Consuled Vika-Mang.<br>\r\n<br>\r\nThe Amber fused bot, atop its single wheel gave a look of defeat before it became a visage of wonder.<br>\r\n<br>\r\n\"You finally wake up my fine ride?\" Asked Vika-Mang.<br>\r\n<br>\r\nThe Chariot reflected over all its memories and how best to respond. It's silicate mind could process at speeds far exceeding its once organic self. \"Yes.\" It happily chimed in an electronic voice. All the things to consider. What it once was, what it desired to be. Ambition, memory, desire. It all came down to this. \"Yes I have. I am...\"</span></div></div>",
            "created":1328330580,
            "id":1270708,
            "title":"Viewpoint of a chariot..!"
        },
        "13":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "Truck, first assignment..!",
                "Business is as business does..!",
                "Another experiment? Typical Sabron..!",
                "Couriers work never done..!",
                "Other choice! And that would be..?"
            ],
            "content":"<div class=\"\"><div> <span>Karen was constantly busy, her supercomputer bound mind had to be. Otherwise she would of been innert awaiting someone to use her Re-Assembler body. She could watch on the security camera's, the many dealings of the employees. Their antics, inter work place feuds and such. The all business Sabron is what interested her the most. Happiest when least effective tinkering away as she did now on gutted Tim. But ever effective, no-nonsense when it came to business. One delivery later. The courier was paid before returning to work. While Vika-Mang walked towards their shared office. Karen had to respect the Sabron, her insistance on finding that certain better design. Had she been a human, Karen would of been skeptical about becoming her property. But the Sabron race didn't think like humans. Wasn't bigotry prone, just efficient when it counts.<br>\r\n<br>\r\nVika-Mang retrieved the flat cell from its container. Beaming a smile.<br>\r\n<br>\r\n\"Before you ask.\" Stated Karen's holographic voice apologetically. \"Next one alright.\" Karen brought up a list of data. The Sabron's mind was hot wired like a calculator. The joke was Sabron's were studying advanced calculus before they learned to walk. One of a multitude of sayings meant to dehumanize the humanoid race of lizard-monkeys. Thankfully their cold calculating logic allowed them to reach conclusions far faster then their human counterparts. Especially given raw data.<br>\r\n<br>\r\n\"Data appears conclusive. Net increase in expanion is coupled with creation of new dolly team. While experiment, though capable to conduct, might undermine growth and allow potential rivals contestment.\" Vika-Mang's eyes rolled back as she checked the calculations against the data she had previously seen else where to assess any discrepancies. \"New dolly team it is.\" Vika-Mang pulled at the flat cell. She wasn't surprised to see a second one.<br>\r\n<br>\r\n\"Then I'll get started.\" Karen stated as she underwent the transformation of super computer into Re-Assembler. Karen had never created one of the duo team trucks. In essence, two individuals fused into one vehicle chasis to support the rapid and safe transport of goods. Codenamed Dolly team. Atleast this offered Vika-Mang a new avenue of mechanical research. While allowing their company to open up their markets into the transportation of heavier goods. Karen had to check and recheck the schematics to ensure they were properly loaded. Her greatest regret about being transformed into a Re-Assembler was its autonomous nature. She genuinely missed being able to caste her own spells. But this was only temporary. That is once the company became a success and she could find someone else willing to take her place.<br>\r\n<br>\r\n\"Unlock safeties please.\" Stated Vika-Mang when she realized Karen's electronic brain wasn't detaching.<br>\r\n<br>\r\n\"Opps. Sorry. Everything is green. Talk to you in a few.\"<br>\r\n<br>\r\nVika-Mang lifted out the computer frame and stood it up. Karen's framework began to metamorphose into a large, eight foot by eight foot box. Vika-Mang placed the first flat cell into the magic bath before going around to the opposite side and placing the second flat cell. Returning to the control terminal. She conducted a last minute inspection before triggering the transformation.<br>\r\n<br>\r\nThe magical fluid began boiling as a silhoute took place. The minutes lurched forward while Vika-Mang manned her station for any signs of discrepancies. As the fluid calmed so to did an odd contraption emerge from the fluid. It struggled against itself, undecided how to act or behave.<br>\r\n<br>\r\n\"Calm yourself please.\" Instructed Vika-Mang. \"Your current form is meeting requirement for dolly team. One body two minds. Will be needing sometime to adapt. Will offer training or if short cut desired. OS for new occupation.\"<br>\r\n<br>\r\nThe contraption didn't appear interested in Vika-Mang's second option. Thankfully Karen had restored enough of herself to allow the four wheel vechicle to drive safely out of her. The load bearing vehicle had two engines, each mounted on the rear wheel, with wheels interlinked by axles, and the forward wheels able to turn. The polished chrome hue of the entire dolly didn't make it appear serviceable, while tires would need to be independently added.<br>\r\n<br>\r\n\"I'm being thankful this is something to work with.\" Stated Vika-Mang plugging in a small sensor device. \"But is not appearing to be complete or functional.\" She punched in a few commands in her hand held terminal to instruct the truck where it needed to go. Driving it over a hydrolic jack. Vika-Mang soon had it at waist level. Picking and pulling until she could begin modifications. One welding kit, a leather apron, protective weilding mask, and multiple canisters later. The completed dolly team finally made its debut. Two small framed, hydrolic reinforced robots sat atop the rear vehicles engines in opposition to one another. It wasn't sightly, but Sabron went for functional. The truck inspected itself. the forward wheels, once fixed moved inward as the truck compacted itself into a single four armed robot over a four wheel base. Vika-Mang looked on proud of her work. The truck tested its lifting capacity and its frame tolerances before finally commenting with its equiped speakers.<br>\r\n<br>\r\n\"Given our design modifications, over contractual obligations on your part. We are thankful. But the paint is...\"<br>\r\n<br>\r\n\"I will be needing to get spray paint ordered. Not sure if there is auto store in city. Then there is question of paint color, scheme, and location of company logo. Leave that to turbo's, think will be team building excercise. Plus, not good with painting. Told not artistic.\"<br>\r\n<br>\r\nThe truck looked at her with their dual eyes questioningly.<br>\r\n<br>\r\n\"But now rest.\" Instructed Vika-Mang. \"Metal will need to cool and harden, stress to far and only encourage repairs. Their was also rebuilding of engine to maximize torgue for load. Blow, and will be expensive.\"<br>\r\n<br>\r\n\"That wasn't in the schematics.\" Warned Karen.<br>\r\n<br>\r\n\"Is better I think. Makes more use and allows easier storage. Plus, not against street law. Have cousin who work there so I should know.\"<br>\r\n<br>\r\n\"Your like a Frankenstein with the machines.\" Joked Karen.<br>\r\n<br>\r\n\"Not sure of reference.\" Answered Vika-Mang. \"But assume is compliment, so thanks.\"<br>\r\n<br>\r\nKaren had to smile inwardly. For all their failings, the Sabrons had something going horribly right for them...</span></div></div>",
            "created":1328140980,
            "id":1269446,
            "title":"Torque, set, truck, pairing..!"
        },
        "14":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "The prototypes viewpoint..!",
                "Tinker lord Vika-Mang..!",
                "Amber, the turbo..!",
                "Overlord system Karen..!",
                "Other? The missing..!"
            ],
            "content":"<div class=\"\"><div> <span>Karen gazed through the multiple security cameras. Ever watchful of her enviornment. Her desire for gain demanded a certain price be paid. Thankfully, her Sabron compatriot Vika-Mang knew how to alter her, post transformation to allow her a greater range of abilities than the standard drone OS, like most other mages of the Vilrakiin, who had been assigned Re-Assembler duty. This left her super computer mind to watch and analyze everything connected into her. She didn't know how the Sabrons did it, like an internal clock. Vika-Mang ceased her tinkering on the chariot Tim and cleaned herself up enroute to the loading bay. The assigned courier was making their return with the new employee in tow. Vika-Mang accepted the cylander and its flat-cell contents, paid the courier, chatted unsuccessfully for a moment before letting the courier return to their duties.<br>\r\n<br>\r\nKaren smiled internally. Vika-Mang, thanks to the law, may of been her owner. But both of them agreed she lacked an understanding of business. Leaving the upgraded Karen to play boss. Still, there was the matter of decision on new employees. Every new flat-cell undergoes its transformation under Karen. But it was Vika-Mang who pushed the final button that started the procedure. Thankfully that was a decision Vika-Mang shared with Karen. The security camera caught Vika-Mang about to enter their shared office. Karen turned on the holographic display atop Vika-Mang's desk.<br>\r\n<br>\r\n\"Look's like we have our new employee.\" Chimed Vika-Mang happily.<br>\r\n<br>\r\nKaren returned a holographic smile. \"I'm looking forward to meeting them.\"<br>\r\n<br>\r\n\"So, can we attempt my prototype chariot design?\"<br>\r\n<br>\r\n\"Next time.\" Stated Karen apologetically. \"First theres an idea I want to run past you.\"<br>\r\n<br>\r\n\"We're in need of chariots since we upgraded Thompson into a turbo. We also have discussed expanding into goods transportation and are looking towards acquisitioning our first dolly team truck. Which I have a modification idea for.\"<br>\r\n<br>\r\n\"I'm looking forward to that.\" Stated Karen, excitedly. \"Your modifications truly define our company.\"<br>\r\n<br>\r\n\"Thankyou.\" Accepted Vika-Mang. \"But its common sense to restrict new employees from turbo duty until they can pay for it. Cuts down on employment of undesireables. Which begs the question?\"<br>\r\n<br>\r\n\"My idea.\" Stated Karen. \"I've queried laws and have decided we should make use of that spare hopper thruster you have.\"<br>\r\n<br>\r\n\"A limited thrust chariot seems a waste for such an engine. Then theirs the matter of the liscence for Thadrinium usage as well as a number of other concerns.\"<br>\r\n<br>\r\n\"I know about the whole blood of the Imperium and how dangerous that stuff can be in the wrong hands but you do have a liscence.\"<br>\r\n<br>\r\n\"Every Sabron gets a liscence.\" Laughed Vika-Mang. \"We consider Thadriniums use to be birth right, of course we don't go making warheads out of the stuff either. Bad karma.\"<br>\r\n<br>\r\n\"Still, I was thinking of experimenting with a jump jet courier prototype.\"<br>\r\n<br>\r\n\"Say no more.\" Stated Vika-Mang in agreement. \"You just said a Sabron's favorite word. Experiment and prototype...\"<br>\r\n<br>\r\nA knock came from the doorway. The young cheerleader frame blond Amber looked confused. \"Sorry to interupt.\" She stated with a pile of paperwork in her hands.<br>\r\n<br>\r\nVika-Mang traded the cylander for the stack of paperwork. She quickly proceeded through it. \"Re-negotiate, re-negotiate, tell Winston I'm calling a meeting about his contract. Reinhard appears to be paying to much. While these last three are argueing our services are too expensive and have paid to little. Contractual dodgers. They'll never get far dealing with Sabron.\"<br>\r\n<br>\r\n\"So then what. You black mail them or something?\" Inquired Amber.<br>\r\n<br>\r\nVika-Mang had to laugh. \"Nah, if they don't pay up then I tell my friends. At which point its kind of our social contract not to deal with anyone unwilling to pay fairly for our services rendered. Even if it costs us more. We're united in our unwillingness to accept less.\"<br>\r\n<br>\r\n\"Could of fooled me.\" Joked Karen. \"What with how little you ask for trading.\"<br>\r\n<br>\r\n\"Fair trade, fair value. Decision is based against understanding of materials in circulation and desireable proportionment of storage until goods mature in value.\"<br>\r\n<br>\r\n\"Right.\" Stated Amber.<br>\r\n<br>\r\nVika-Mang shot her a glance. \"Request is doable. Will need to draw up schematics then program data for use in conversion.\"<br>\r\n<br>\r\n\"Shouldn't you of ordered the new hiree in say five days then?\" Asked Amber.<br>\r\n<br>\r\n\"You don't understand Sabron names do you?\" Asked Karen.<br>\r\n<br>\r\n\"Whats to understand, non gender specific names that don't make alot of sense. Expanded with house, community, and finally Klan names.\"<br>\r\n<br>\r\nVika-Mang had to laugh. \"My name is actually my job specialty. I'm a computer software engineer, or Vika-Mang.\"<br>\r\n<br>\r\n\"I didn't realise Sabron had those.\" Stated Amber astonished.<br>\r\n<br>\r\n\"It's a rarety to find those capable. Given how our minds process languages in standard context, engieneered design, or numerical vaules. Most can't seem to decypher digital causing confusion.\"<br>\r\n<br>\r\n\"A Sabron confused?\" Laughed Amber. \"I'd love to see that.\"<br>\r\n<br>\r\n\"Maybe someday.\" Stated Vika-Mang handing the paper work back to Amber in exchange for the cylander.<br>\r\n<br>\r\n\"So?\" Asked Karen.<br>\r\n<br>\r\n\"Consider it done.\" Stated Vika-Mang. Setting to work on her drafting table in the corner. She quickly went over several design concerns before committing her rough draft onto her terminal as a hard copy. Printing up a final copy to ensure consistantcy and a fail safe record. She sent her schematics to Karen several hours after having received the request.<br>\r\n<br>\r\nKaren had been eager. Wasting no time to convert herself into a Re-Assembler of appropriate size. \"Talk to you when it's finished.\" Stated Karen briefly before Vika-Mang pulled her mainframe out of the Re-Assembler and disconnected it. The safety was a result of resonance energies creating static feedback in unshielded electronic equipement. Wouldn't want to fry Karen's brain. One downloaded schematic later. The immersion of the flat-cell into the magic bath. Vika-Mang manned the Terminal as she triggered the final conversion process. It took only moments for the flat-cell and its occupant to become transformed into a three wheeled robot mounted into a jet pack. Minus the jet. The packs robotic eyes followed Vika-Mang's actions as it was removed to her workshop where the Hopper thruster was finally attached. Amber made sure to restore Karen's functionality once the bath had drained.<br>\r\n<br>\r\n\"Not what I was expecting.\" Stated Karen in observation.<br>\r\n<br>\r\n\"A little paint, and fine tuning, will act like compact courier bird. Had to alter design to create added thrust thru engine flux differential so it should be faster. Three wheel base for ground navigation and rapid take off ability, which is also retractable into frame.\" Stated Vika-Mang as she lifted out and placed back the third wheel. \"Add staps, and will double as serviceable jump jet.\"<br>\r\n<br>\r\n\"Will it perform?\" Asked Amber.<br>\r\n<br>\r\nVika-Mang looked into the robots eyes and smiled. \"Will perform, is given great gift. Maybe need to work harder due to speed difference. Other option is extended employment as someones pet toy.\"<br>\r\n<br>\r\n\"Which just leaves reception.\" Stated Karen's holograph.<br>\r\n<br>\r\n\"I'll show him around.\" Stated Amber. I don't think Tim will be happy that he's been down for so long.\"<br>\r\n<br>\r\n\"Shouldn't matter.\" Stated Vika-Mang. \"Is pay without work.\"<br>\r\n<br>\r\nKaren and Amber had to give each other an eye.<br>\r\n<br>\r\n\"Back to work.\" Stated Karen after a minute...</span></div></div>",
            "created":1328168220,
            "id":1269650,
            "title":"Blue sky, with an option for wings..!"
        },
        "15":{
            "author_id":"authrox",
            "author_name":"Authrox",
            "choices":[
                "Independant Military Contractor..?",
                "Health-Care Contractor..?",
                "Construction Contractor..?",
                "Private Sector Contractor..?",
                "What's this? Personal Request..? (Other)"
            ],
            "content":"<div class=\"\"><div> <span>---Data Simulation Initiated---<br>\r\n<br>\r\nA lone female silhouete walked down the virgin sand beach, palm trees swaying in the background, a strong salt water mist in the air, while the wind carried a soft chill against the ever present tropical sun. Karen was in heaven, walking the beach front of her family's manor. The white brick walls glittering in the backdrop of the tropical jungle. It must of been in her family for generations. It offered everything from a full staff, to a plantation where anything needed could be grown. She couldn't be happier. But as much as she wished she were there. She knew instinctively of her self imposed prison. Even the image of her favorite butlet, waiting patiently with an assortment of her favorite foods on a serving tray, was nothing but memory.<br>\r\n<br>\r\n---Data Simulation Terminated---<br>\r\n<br>\r\nKaren's mind drifted back to the confines of her cyberself. As a child, that place had always been a safe place, an inviting place. Even now, the place's lost was a point of anger for her. Vilrakiin high command, specifically certain self serving officials. Used various defense laws to oust her family from their property without even paying them a dime. All in the name of defense, they claimed. In reality, the rampant corruption among the Vilrakiin elite created unfavorable conditions for the subsequint tiers. The lower the tier. The more often one could expect themselves to be victimized. Unable to resist, most abandoned what good will they had left and began victimizing anyone not of the Vilrakiin ranks. The system was horible. In Karen's eyes, the only good that came out of it, was its finality, met with the Sabron's typical, and expediant trial of leading officials in a given area of contestment. Usually resulting in an equally expediant death, unless being pardoned or proven innocent.<br>\r\n<br>\r\nKaren had to laugh internally. The official didn't even survive the invasion. The last word she heard of them was of their denial that Agrith, their private play ground, was on the cusp of collaspe. Of how, even when imperial forces blasted their way through the thick steel doors of their bunker. Even when there own forces where in a panic. They just sat still, denying everything. The downside to post invasion, crime had been so rampant, that the removal of those the imperium declared undesireable would of undermined any semblance of structure. The Sabron desperately needed to ensure a quick and expediant transition into their rule. The result was a mass pardon of crimes for everything but the most grievous. Given the nature of their war, the multi-world contestment with opposing forces, and an undermanned military force tasked to delivery nearly the impossible. It's understandable why they wanted to free as much man power as they could for other engagements. The post invasion society wasn't perfect. But compared to the once dominant tyranny. Everyone agreed it was by far an improvement.<br>\r\n<br>\r\nThen their was the matter of the Sabron leadership. Their rule was more autonomous than anything else. Independent agents overseeing independent branchs of the government. Operating in tangent yet lacking any central authority. Rule by locality, they called it. By there own charter it meant Agrith could chose from either their own or Imperial agents they trusted to rule on their behalf. It wasn't to much of a leap in understanding to see why groups such as the Agrith Liberation Front (ALF) were calling for a free Agrith. Noble intentions, if abit nieve...<br>\r\n<br>\r\nSeconds passed as Karen's program rendered mind, raced through countless details and considerations, what ever thoughts she considered, she found herself returning to the nature of her reality. Multiple optics and video feeds served as her only real means of external sensory. She could count the pulses of energy traveling through the multitude of wires and cables. Her world was in part digital, and for as long as her body, the transformed metalic flesh of her Re-Assembler self remained bolted to the Dura-crete floor. Everything about the building in which she resided was in essence, an extention of herself.<br>\r\n<br>\r\nHer parents had told her that honest reward required honest sacrifice. That karma rewarded itself in kind. There had been a moment in her history when she questioned this. But no longer. Her taboo alliance to the off-worlder, her sacrifice of conversion. It was all towards a single goal. She didn't try to underhand Vika-Mang, she knew enough about the Sabron to know faulty calculations and numbers upset them to no end. Add the fact that Vika-Mang was among only a handful of Sabron on world capable of programing code. A condition Karen was now subject too. It wasn't prudent. Not that that really mattered. Mage's always outlived their mundane counterparts. Something about the arcane often slowing or completely stoping the process of aging. Compound the fact that Sabron didn't typically live too long past two-hundred and fifty. Vika-Mang's status of being childless meant that their was a possiblity she might inherent the entire fortune of their partnership. But she was getting ahead of herself.<br>\r\n<br>\r\nAn optic over the docks detected Vika-Mang retreaving the new flat-cell from one of the companies Couriers. It seldom took Vika-Mang very long to get to Karen when that happened. Karen had determined there was very little difference any Sabron as far as their nature was concerned. They were instinctively driven to experiment any chance they got. Evidenced by the fact that every greeting, even among family was always a chalenge. Always a test to see what if anything changed. They couldn't help it, they were after all Sabron. Which did nothing to change the fact for why the flat-cell was here.<br>\r\n<br>\r\n\"Perhap's now we be trying experimental chariot.\" Implied Vika-Mang in a hopeful tone.<br>\r\n<br>\r\nKaren had dealt with Vika-Mang enough to know she was attempting to deviate from their agreed path. She took a moment to find relevant work orders before displaying it for Vika-Mang.<br>\r\n<br>\r\n\"I would of thought this one is being here for other reason.\" Stated Vika-Mang, shaking the cylanders content.<br>\r\n<br>\r\nKaren couldn't deny it. Vika'Mang's insistance on acquireing a Re-Assembler had been ingenious. The Transformed Worker's Admendment specified any business using altered own or have access to a Re-Assembler. Stipulating reversion or conversion to said workers take place at the same said device for safety. Which meant Karen couldn't revert until the conditions of her last contract conversion had been met. Couple the law to the blatant lack of availble Re-Assemblers. What Karen never would of considered on her own. The conversion she agreed to in order to fill the company's needs. Created a favorable situation for their independent outfit. With first point conversion minimizing waiting time, as well as conversion costs, and add a service charge for delivery of said goods anywhere in the city. The business venture had become incredibly lucrative. Something Karen wasn't going to complain about anytime soon. Her sacrifice, her gain.<br>\r\n<br>\r\nHer holo-image self smiling towards Vika-Mang, all that was left, was for the two partners to decide on which order to fill...</span></div></div>",
            "created":1328859900,
            "id":1274013,
            "title":"So what is it this time..?"
        }
    },
    "info":{
        "author_id":"authrox",
        "author_name":"Authrox",
        "brief_description":"Post-Invasion World Agrith. Archetype City. Transformed employment optional.",
        "created":1328068800,
        "description":"<td align=\"left\" class=\"norm\">Year is Eight hundred and Thirty four of the Toranthan Era or T.E. Post Sabrontason invasion, experimental municipality and political zone, Archetype City, planet Agrith. The Vilrakiin remnant, by trade magic users. Now contends with the Technocratic Surauto Vaim nes Archanaun. The Sabrons equivelent organization of magic users. While employment is plentiful, most jobs in Archetype City requires interns be transformed. Story begins with a courier outfit and may extend to any denizens introduced during the story arc. Anything within reason goes...<br>\r\n<br>\r\nThe world of Agrith has abundant water, islands, and only three seperate island contentants.<br>\r\n<br>\r\nAgrith is one of fifty four worlds conquered by the Sabron in a twenty-four year time span. Sabron are currently consolodating control with no intentions of further expansion.<br>\r\n<br>\r\nNatives are human, origin unknown, with a multigenerational exposure to transformations.<br>\r\n<br>\r\nHighest mage population per capita in the Sabron imperium.<br>\r\n<br>\r\nThe Sabron occupation force represents a small minority in Archetype City. Race alias are Lizard-monkeys due to agility, or Scalies due to patches of scales across their skin. Race is general just in behavior though their ethics are skewed as a result of their racial inclination towards experimentation and data collection.<br>\r\n<br>\r\nI'd appreciate it if...<br>\r\nTransformations serve a function. I.e. backpack, ATM, ect.<br>\r\nStories build character development.<br>\r\nStories expand upon the experimental municipality. (Locale creation)<br>\r\nStories reflect or mimic probable societal tolerances for a post TF civilization.</td>",
        "id":1845020,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1328859900,
        "modified":1328859900,
        "pretty_title":"Toranthan Era"
    }
}