{
    "chapters":{
        "1":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Home",
                "School",
                "Work",
                "In the mall shopping with Natalie",
                "At Melissa's House"
            ],
            "content":"<div class=\"\"><div> <span>    Your name is Timothy Walters. You are a 16 year old male. You have two sisters, Lauren, age 18, and Samantha, age 17. Lauren is nice to you most of the time but she could be ruthless if the situation allows and Samantha never really liked you and would more than likely dispose of you if she could. Your mother is named Carol, she is 37 and not very fond of you. You also have a cousin, Natalie, age 20, she visits quite often and sometimes spends a couple of nights at your house. You also have a girlfriend, Melissa, age 18, along with an ex-girlfriend, Karen age 17. You have a part time job working as a waiter in a semi-formal restaurant. You currently attend High School with your sisters, girlfriend, and ex-girlfriend. Your schedule is Chemistry, German, Lunch, Geometry, and then Home Economics. Now that the background information is established, let's get started. <br>\r\n<br>\r\n    Where do you shrink?<br>\r\n    </span></div></div>",
            "created":1223442000,
            "id":595555,
            "title":"In The Beginning"
        },
        "11":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Kitchen",
                "Living Room",
                "Samantha's Room",
                "Lauren's Room",
                "Carol's Room"
            ],
            "content":"<div class=\"\"><div> <span>   It was a Saturday morning just like any other, except for one small detail. When you awoke at around eleven fifteen everything was towering above you, though you were still waking up it took no time at all for you to realize that you had shrunk to about three inches during the night. You were so totally dumbfounded you didn't initially realize that your clothes did not shrink with you. You slowly climbed down the frame of the bed until you reached the floor. Then you proceeded to walk out of your room into the hallway. It took you what seemed like forever when at normal size it would have been a minute trip, at most. Once you reached the hallway you were faced with a serious problem. Where would you go now? You had plenty of options including the kitchen, living room, Samantha's room, Lauren's room, or Carol's room. You think to yourself which location has the highest chance of helping you. You then decide that you'll head to the....<br>\r\n<br>\r\nWhere do you go for help?</span></div></div>",
            "created":1223442000,
            "id":592654,
            "title":"Where To Go When You're Shrunk In Your Home"
        },
        "111":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Carol",
                "Samantha",
                "Lauren"
            ],
            "content":"<div class=\"\"><div> <span>   \"No use being shrunk on an empty stomach.\" you figure. You begin your long trek to the kitchen. On the way you had to endure a trek that seemed to take forever and longer. As you finally reach the kitchen you see that someone is in the kitchen, preparing lunch more than likely. You enter the kitchen and slowly make your way to the person, because you plan to climb up her to reach the counter. As you are about half way there she walks over the the fridge to retrieve something for her lunch. This sudden movement causes you to loose your grip and fly onto the counter right into a gooey mess of ketchup on a lettuce, tomato, cheese, cucumber, mustard, and ketchup sandwich. As the person come back to finish making her lunch you finally can see that it is....<br>\r\n<br>\r\nWho is it making lunch?</span></div></div>",
            "created":1224046800,
            "id":595565,
            "title":"Someone's In The Kitchen With Timothy"
        },
        "1111":{
            "author_id":"darkheart13",
            "author_name":"DarkHeart",
            "choices":[
                "You fall from the sandwhich",
                "Not fast enough",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Carol was all you could see at the point; a 5'6\",tanned, brown eyed beauty . She wore a tight undersized grey tank top, her breasts like oceans waiting to spill forth. The mesmerizing sight of those beauties swaying and bouncing with each step was just too much to look away from! Your erection stood tall and proud, your mind momentarily distracted from the imminant danger at hand. Only when her hand reached past you did you remember why you were getting such a beautiful sight; YOU'RE STILL IN HER SANDWHICH!  <br>\r\n<br>\r\n\"CAROL!! DOWN HERE!\" you scream and try to get the ketchup from your arms and legs to move. The thick tomatoe paste must have weighed 20-30 lbs, weight added to you and causing you to slowly make your way towards the side of the sandwhich. A dark shadow casted itself from above before your world came crashing to a halt. You could hear everything from the ketchup squishing into the cracks of the sandwhich to the crushing of the lettuce and cuccumber slices. The small amount of crawling space became even more confined as Carol's fingers dug into the sandwhiches sides, lifting the sandwhich up to her waiting pale lips. Your squirming had to quicken if you were ever going to make it to any of the sides of the sandwhich! Shoving at the sliced vegetables and crawling through globs of condiments seemed to have paid off! You can see the kitchen light not even three feet infront of you! With a rather soft <i>SQUELCH</i>, your head popped free of the monsterous bread slices and out into the open. <br>\r\n<br>\r\nStrange...where was Carol? The table below and the counters were all insight but..<br>\r\n<br>\r\n<i><b>CRUNCH</b></i><br>\r\n<br>\r\nThe sandwhich quaked around you; you were in the back of the sandwhich! Carol moans happily somewhere behind you, obviously enjoying the various flavors of your prison. You have to escape! With new found fight, you began to squirm with all your might and free one of your arms.<br>\r\n<br>\r\n<br>\r\nWas it enough?</span></div></div>",
            "created":1307421180,
            "id":1121212,
            "title":"Carol"
        },
        "11112":{
            "choices":[
                "She actually feels something moving in her mouth",
                "She's still unware and continues to chew"
            ],
            "content":"<div class=\"\"><div> <span>As your body squirmed in the sandwich, you felt her take another bite out of it, but luckily enough for you, it wasn't the area where you were. \"No! Please don't eat me!\" You shout at the top of your lungs in some kind of hope to get her attention before she finishes her meal, but to no avail. She didn't hear hear you. Your head has finally poked through the sandwich, so only your arms and head were free. You gasped as you watched her chew up the sandwich and quickly swallow it down. You watched the large bump slide down her throat, knowing that that could've been you. \"Shit! I gotta get out of here!\" You say to yourself as you tried crawling out of the sandwich.<br>\r\n<br>\r\nThen, at that very moment, you gasped up in horror as Carol began bringing the sandwich back up to her wide open mouth. Strings of saliva were visable, as well as some mashed up food stuck between her teeth. You screamed at the top of your lungs, hoping that she would hear you, but she was still unaware of your pressense in her sandwich. \"NOOOo! DON'T EAT ME, CAROL!\" You shouted once more as the part of the sandwich you were in was between her teeth. She tore the piece off, along with her, and closed her mouth. She swished you around in her mouth for a moment before biting down into the sandwich. You could feel her teeth tear touch your legs, but didn't tear down into them. <br>\r\n<br>\r\nDoes she feel you in her mouth, or is she still unaware of your pressense?</span></div></div>",
            "created":1360784460,
            "id":1531359,
            "title":"Not fast enough"
        },
        "12":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Going Home With Mrs. Jeffords",
                "Being Analyzed In The Science Lab",
                "Being Given To A Student",
                "Thinking It Over During Lunch"
            ],
            "content":"<div class=\"\"><div> <span>      You awake from your blackout to see that everything is huge compared to you. \"I must have shrunk.\" you think to yourself. You estimate your height to be about three inches and remember that they are expecting you back in Chemistry after you went to the restroom and apparently shrunk. You decide your best bet would be to go to the office and get help there. As you make the long trek from the restroom to the main office you were in little danger of being stepped on due to the fact that it was still first period, if not the very end of first period, when you arrived in the main office. Your next hurdle was climbing up to the receptionist's desk. You almost fell once but you made it. The receptionist, Mrs. Jeffords, is usually a very nice person and would know how to help you. Mrs. Jeffords is about thirty five years old, has long brown hair, a nice body composition, green eyes, and a beautiful face. You are able to get Mrs. Jeffords' attention with great ease and as she picks you up you explain your situation to her. Once you are done Mrs. Jeffords explains to you that there is no known way to restore you back to size and that you can't be sent home due to the fact that the school would receive negative press on letting a student shrink. \"So we are left with four options, little Timothy,\" Mrs Jeffords explains to you, \"first, you can come home with me and live with my two daughters and myself in secrecy, secondly I can arrange you to be analyzed in the Science Lab to try to discover what happened, third we can give you to a student and let her have her way with you, or lastly we can take you to the cafeteria for lunch and get something to eat while we think this over. So Timothy, what do you say?\"<br>\r\n<br>\r\nWhich Option Do You Choose</span></div></div>",
            "created":1223592600,
            "id":612050,
            "title":"Shrunk At School Is A Serious Situation"
        },
        "121":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Susan",
                "Catherine",
                "Mrs. Jeffords"
            ],
            "content":"<div class=\"\"><div> <span>   \"I think I'd like to live with you and your girls.\" you say. \"Splendid!\" Mrs. Jeffords replies and proceeds to place you in her purse until the end of the day. You sleep soundly for hours until Mrs. Jeffords opens the purse letting in an almost blinding light. \"We're here.\" she says. She takes you out of her purse and places you on the table. Just then two curious girls come running into the kitchen. They looked to be about 16 and 17. \"This is Susan and Catherine.\" Mrs. Jeffords says. Susan was 16 years old, red hair, green eyes, a nice face, and beautiful body. Catherine was 17 years old, brown hair, blue eyes, a outstanding body and a face to match. \"This is Timothy,\" Mrs. Jeffords explains to the girls, \"he is going to be living with us.\" \"Kind of like a pet.\" Susan said. \"Yes. He is our pet.\" Mrs. Jeffords agrees. You are beginning to get the feeling this wasn't such a good idea. \"So which one of us gets to keep him?\" Catherine asks. \"Good question,\" Mrs. Jeffords responds, \"but I think Timothy should get to answer that.\" <br>\r\n<br>\r\nWho do you choose as your keeper?</span></div></div>",
            "created":1224046800,
            "id":595638,
            "title":"Second Thoughts"
        },
        "1213":{
            "choices":[
                "she tourtures you by grinding you in her mouth",
                "she puts you in the jar with the other people",
                "after rubbing you in her breasts,She drops you onto a piece of lettuce"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>after awhile Mrs.Jeffords sends the kids out,She goes into the kitchen and starts to get things out of the pantry . Half an hour later she calls you into the kitchen you see six other people your size in a jar. You run and she grabs you.</span></div></span></div>",
            "created":1269884040,
            "id":858631,
            "title":"Student or snack"
        },
        "124":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "You are blown forward into Mrs. Jeffords' BLT with cheese on white",
                "You are blown to the next table onto one of the lunch trays",
                "You are blown over to the preperation table and land among bread slices and buns"
            ],
            "content":"<div class=\"\"><div> <span>    \"Let's talk it over during lunch.\" you tell Mrs. Jeffords. \"Very well, then.\" she replies as she places you in her purse until the lunch period begins. After what seemed like forever you see light again as Mrs. Jeffords reopens her purse and sets you on the lunch table. You can see that Mrs. Jeffords has an apple, a pudding cup, a bottle of water, and a BLT with cheese on white for lunch. Sometime during lunch Mrs. Jeffords asks to excuse herself to go retrieve some documents. While she is gone you cautiously help yourself to some of her sandwich during the period of Mrs. Jeffords' absence, a strong wind caught you off guard causing you to.....<br>\r\n<br>\r\nWhat exactly happens due to this wind?</span></div></div>",
            "created":1223528400,
            "id":593107,
            "title":"Just A Little Winded"
        },
        "1243":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Bread Slice",
                "Hotdog Bun",
                "Hamburger Bun"
            ],
            "content":"<div class=\"\"><div> <span>   The wind blows you over to the preparation table, where students can prepare their lunches and where condiments along with topping are available, into the bread box among assorted buns, rolls, and bread slices. You are dazed from the trip and are disorientated. You just barely escape from the metal tongs a number of times. You eventually regain your senses and climb out of the bread box onto the tabletop. Just as you do though, a shadow falls upon you and you quickly run back into the bread box and hide among the bread. The metal tongs come once again and this time you're not so lucky. The metal tongs grab you and pin you down the bread you were hiding under.<br>\r\n<br>\r\nWhat kind of bread was it?</span></div></div>",
            "created":1223874000,
            "id":594829,
            "title":"Someone Got More Than Just Their Grains"
        },
        "12431":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Erica's",
                "Hannah's"
            ],
            "content":"<div class=\"\"><div> <span>    The metal tongs release you but before you can do anything you are suddenly covered in ketchup, followed by two cheese slices, then a tomato slice, a lettuce leaf, some mustard, some sliced cucumber, a thin spread of mayonnaise on the second slice of bread. You were trapped in this students sandwich. You didn't even know who it was. After a while you feel the lunch tray being set down onto one of the tables. You now can hear muffled voices and to your excitement you think one of them sounds like Melissa. Your heart skips a beat at this new discovery and you now have restored hope. Just then you feel the sandwich being lifted, you wiggle a little to try to see whose sandwich you are in. You can't get a really good view but you are positive that it is either the head cheerleader Erica, a senior with green eyes, brown hair, a nice body, and a beautiful face, or it could be Hannah, she is a junior with blue eyes, black hair, a very beautiful face, and a nice body if you ever broke up with Melissa you would go for Hannah next. Whoever belongs the sandwich you're in, your situation is looking very bleak right now. <br>\r\n<br>\r\n Whose Sandwich are you in?</span></div></div>",
            "created":1223874000,
            "id":594838,
            "title":"A Surprise In Every Sandwich"
        },
        "12432":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "To compassion",
                "To the point of eating you"
            ],
            "content":"<div class=\"\"><div> <span>   You are dropped on top the unmistakable feel of a plastic lunch tray. Unfortunately for you though is that you didn't feel it because you were sleeping soundly in a hot dog bun. It wasn't until you felt the actual hot dog slide up beside you that you realized you were in trouble. But before you could do anything you were pinned down to the bun by the weight of ketchup, mustard, chili, cole slaw and onions. You were totally immobile as the tray was carried to a table. You recognized the girl holding the tray though, she was Tiffany a senior in you Chemistry class. She had blond hair, green eyes, a great body, and a wonderful face. You asked her to go out with you after you broke up with your ex and she had declined. Tiffany sat down at the lunch table and started eating the hot dog, luckily she started at the opposite end of you. Her eating the hot dog caused you to fall onto the lunch tray after which you started yelling, screaming and flailing to get Tiffany's attention. It worked and Tiffany picked you up and licked you clean. \"Timothy, what happened to you?\" she asked. You told her your entire story and Tiffany nodded in a sympathetic manner. \"Timothy your story moved me,\" Tiffany began, \"your problem is which way did it move me? Did it move me to the point that I will care for you and protect you, or did it move me to eat this hot dog plain, stick you in the bun, and eat you?\"<br>\r\n<br>\r\nWhich way did your story move Tiffany?</span></div></div>",
            "created":1224133200,
            "id":596004,
            "title":"With The Girl You Couldn't Get, But Not As Planned"
        },
        "124322":{
            "choices":[
                "To forget it and eat you",
                "Keep you as a slave"
            ],
            "content":"<div class=\"\"><div> <span>After a minute of staring at you, she finally came to a decision.<br>\r\n<br>\r\n\"Sorry, but I'm just too hungry to help you.\" She said. Before you could complain, she gets up and sits on you so you can't escape. Tiffany pulls out her hot dog and mashes it up in her giant teeth. She then pulls you out and puts you where the hot dog was. You were right in the middle of the other ingredients. She lifted you up so you could see her face. Although you were going straight to your doom, you couldn't help but think she was absolutely beautiful.<br>\r\n<br>\r\n\"Looks like you aren't a hot dog, you're a hot human.\" She licks her lips and brings you closer to her mouth. You plead to her, trying to change her mind.<br>\r\n<br>\r\n\"Wait! At least keep me as a slave! I'll do anything!\" You yell, hoping she would be interested in that. She stops, your head is right in front of her lips. A second later, your head could have been on the other side.<br>\r\n<br>\r\n\"Well, you are pretty cute, and a personal slave might be nice to have.\" She thinks about it. After a while, she decides . . .</span></div></div>",
            "created":1490472480,
            "id":2294654,
            "title":"Hot human for lunch"
        },
        "12433":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Yes, Karen does notice you",
                "No, Karen doesn't hear you and now you only hope her bite misses you"
            ],
            "content":"<div class=\"\"><div> <span>    You realize that you are in a hamburger bun. Before you can alert this person to your existence the student squirts some ketchup upon you followed by a lettuce leaf, hamburger patty, cheese slice, mustard, tomato slice, onions, pickles, and the top bun spread with mayonnaise. You are totally trapped beneath the massive amount of weight. You can only hopelessly look on as the student, which you now make out as female, carries the lunch tray to the table. As she sets the tray down on the table you can make out some voices. Before you can hear who the voices belong to the female picks up the hamburger and proceeds to take a bite, missing you by mere inches. You scream and do all you can to get her attention. When suddenly you realize that you are in Karen's burger. Your hope fades a little, considering you broke up with her, but regardless you continue to get Karen's attention. Now is the defining moment as she closes in for another bite, she still could miss you again but then again she could not miss you. You continue to scream for her attention. Her beautiful crimson lips are coming ever closer. This is it.<br>\r\n<br>\r\nDo you get KAren's attention in time?</span></div></div>",
            "created":1223960400,
            "id":595159,
            "title":"The One Time You Want Karen To Miss You"
        },
        "124332":{
            "author_id":"star_sage",
            "author_name":"Sage",
            "choices":[
                "Does she get you completely in her mouth?",
                "Or do you get chomped?"
            ],
            "content":"<div class=\"\"><div> <span>Karen’s mouth fills your view, and you realize she couldn’t possibly have seen you. She’s going to bite down in a moment, and it’s going to be all over. Closing your eyes, expecting any moment to hear the crunch of her teeth grinding through your bones, you lay still, and then, when you don’t hear any grinding, you feel the burger being pulled back inside, you look up, elated, thinking she might have seen you. She hadn’t though, as you look up at her, she’s just chatting wit another girl, your presence in her lunch completely lost on her, as she has what to her is just a normal day. That, for some reason makes you made, but, it also makes you realize that you aren’t going to be seen like this, and so, instead of focusing on being spotted, you start to wriggle and squirm, that first bite having loosened your hold enough that you actually get a little ways out, before the burger moves again, her mouth opening once more, and the hot humid breath from inside washing over you as she breathes out onto her lunch. Staring into that abyss, a cavern of soft, pink flesh counter pointed by the hard, shining white teeth, with pillars of saliva moving everywhere, you almost cry, knowing she won’t miss you, and that you are going inside.</span></div></div>",
            "created":1225947600,
            "id":604454,
            "title":"You're a Boyburger"
        },
        "1243321":{
            "author_id":"star_sage",
            "author_name":"Sage",
            "choices":[
                "Do you avoid the teeth?",
                "Or do you crunch between her molars?"
            ],
            "content":"<div class=\"\"><div> <span>With a crunch sound you feel pressure around your body as her teeth tear into the burger, the bread giving in an instant to the force of her jaw, whereas your entire body couldn’t move it a nanometer. The sound of it is enough to make you cry out, as it fills your world, actually deafening anyone that might hear your pitiful shout to the miniscule noise, including the one to whom the mouth belonged. Then, with a clack, you feel the jaw stop, and you’re surprised to find that, though you are a little worse for the wear, you aren’t hurt. A run of saliva does drip onto your head from the sealing, and you can feel it coating the rest of your body as well, making the burger nice and mushy as you lay in it. Your relief at being whole is short lived, however, as the girl suddenly starts chewing, her jaw dropping and making your stomach do a flip, before you can see out through a tiny break in her lips, that shuts you back into the darkness of her mouth, as it rises, and you can feel your body move as the tongue pushes against it, trying to force it toward her molars, the renewed sound of grinding filling your ears as Karen starts to chew her lunch.</span></div></div>",
            "created":1225947600,
            "id":604455,
            "title":"Does she get you completely in her mouth?"
        },
        "12433211":{
            "author_id":"star_sage",
            "author_name":"Sage",
            "choices":[
                "she raises her cup to her lips to wash it all down.",
                "her hands come to poke at whatever’s in her mouth."
            ],
            "content":"<div class=\"\"><div> <span>As the jaw rises, you can feel your body slide over the bumpy, but saliva slick tongue, with he rest of her lunch. Luckily, however, you are not between her teeth as they come together like jagged rocks, crunching into the burger, bread, and everything else, a mixture of juices suddenly washing over you, along with the saliva, making you cough as it fills your mouth with a not unpleasing taste, before the jaw drops again, and you take the opportunity to roll toward the center of her tongue, the pressures around you relived for a moment, and then back again as she bring her jaw upward once more. Free of the burger, you grip her tongue, and feel it come against you, tasting you special as she begins to realize not everything in her mouth is what’s usual for a burger, she doesn’t seem to notice too much though, as the jaws fly down once more, the crunch now a soggy squish, as the contents of her mouth lose the solidity they have, becoming a mush that is more easily broken down by her stomach. That thought makes you blanch as you realize what’s going to happen when she swallows, and you start to squirm and wriggle, making her stop for a moment, and then her mouth opens up, causing you to turn, hope filled eyes gazing out as….<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1225947600,
            "id":604456,
            "title":"Chewie, Chewie Happening(But Missing You)"
        },
        "124332111":{
            "author_id":"star_sage",
            "author_name":"Sage",
            "choices":[
                "“Stop being a baby and finish your lunch so we can go.”",
                "“Well, go to the nurse and have her check you out.”"
            ],
            "content":"<div class=\"\"><div> <span>Your eyes go wide for that moment before it starts to flow onto you, and you are given a flash of understanding, before the cup tilts, and its contents wash into her mouth, pushing you toward the back of her throat in an irresistible flood. Carried by the current, you can do nothing but watch as the light of the world is taken from you, and with a gulp that sounds all around you, you are dragged into Karen’s body. The feeling of her neck muscles pushing against you and passing you down is enough to make you scream out as they try to crush you, but luckily they give just enough that no bones break as you are passed down by the motion, reaching a tight passage, and then getting through again in a moment. Suddenly you hear a loud thudding sound, making you realize you just passed out of her neck, where you were just a bulge, and into her chest, where you aren’t even that. No more can you be seen by the outside world, you are just a part of Karen, and as you pass deeper still, you suddenly hear a roaring sound, like great bellows, that you think must be her lungs, before, at last, you feel a great press below, and are forced through a valve into her stomach, landing with a splash in the standing stomach juices, as the sounds of Karen’s body fill your ears.<br>\r\n<br>\r\n“Oh man, I think there was something alive in there,” you hear her say.<br>\r\n<br>\r\n“Well, putting mice from the lab into the burgers is the only way they’d get real meat here,” you heard a distant voice joke.<br>\r\n<br>\r\n“No, I’m serious,” Karen added, and you heard a sigh from outside, after which the other voice said...</span></div></div>",
            "created":1225952100,
            "id":604459,
            "title":"Meat in a School Lunch? Preposterous!"
        },
        "13":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "The employee break room",
                "The Kitchen",
                "The restroom",
                "The Eating Area",
                "The Parking Lot"
            ],
            "content":"<div class=\"\"><div> <span>     It was a normal day at work. You were working the lunch shift so the restaurant is pretty busy. The chef is a beautiful red haired, blue eyed, great bodied female by the name of Amber. You two get a long pretty well but once in a while there is a fight. It was a day like any other day, nothing special about it. You were taking orders from the table and bringing food out from the kitchen. Then all of the sudden you blacked out. When you awoke you noticed that you had shrunk to about three inches tall. The only problem is you didn't know exactly where you had shrunk.<br>\r\n<br>\r\nWhere in the restaurant did you shrink?</span></div></div>",
            "created":1244128620,
            "id":702133,
            "title":"Shrinking On The Job"
        },
        "14":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Get something to eat at the food court",
                "Shop some more",
                "Go back to Natalie's house and think about your next move",
                "Go to Management and see if they can fix it",
                "Meet up with Natalie's friends and see if they can do anything"
            ],
            "content":"<div class=\"\"><div> <span>    You were shopping with Natalie in the mall, nothing really that strange. Except for a big difference. While Natalie is trying on a dress at one of the clothing stores, you shrink, you don't know how but you shrink. When Natalie returns she picks you up with a look of shock and horror on her face. \"Wha..What happened to you?\" she asks in clear astonishment. You tell her all that you know and that's not that much to begin with. \"Well,\" Natalie begins, \"what are we going to do now?\" \"We could go to the food court. I'm hungry.\" you reply. \"If you're well enough to eat, then maybe we should shop some more, or maybe we should go to my place and think about what we're going to do next.\" Natalie continues. \"Or maybe we could tell management what happened and see if they can reverse it.\" you counter. \"We could do that, but we could also meet up with my friend and see if they know how to fix you.\" Natalie counters back. Both of you ponder over your choices but eventually reach a verdict.<br>\r\n<br>\r\nWhat do you two plan to do.</span></div></div>",
            "created":1224046800,
            "id":595571,
            "title":"You Shrink In The Mall, And Malls Were Big Already"
        },
        "141":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "The college students",
                "The business woman",
                "The girls you know from High School"
            ],
            "content":"<div class=\"\"><div> <span>    You two decide to go get some food at the food court. \"Now be careful and don't get lost.\" Natalie warns you. You assure her you won't. The mall food court has a decent variety of choices including a sub sandwich shop, a pizza place, a hamburger joint, a hot dog stand, and an ice cream parlor.  As you enter the food court, though, someone bumps Natalie causing her to drop you without her noticing. You lost sight of Natalie and you knew you were lost. But you did see three tables near you that looked promising. The first table had three college students at it, a blond, a red head, and a brunette. The second table had a business woman alone working on her laptop. The third and final table had four girls you knew from high school. Now that you analyzed your choices you must decide.<br>\r\n<br>\r\nWhich table to you go over to? </span></div></div>",
            "created":1224196500,
            "id":612051,
            "title":"So Much Goes So Wrong So Fast"
        },
        "1411":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "Start climbing up her jeans",
                "The girl unexpectedly moves her foot, can you hang on"
            ],
            "content":"<div class=\"\"><div> <span>You decide to go for the table with the three college girls on. They all look really beautiful and you can feel a tingling down your spine.<br>\r\n<br>\r\nTaking a deep breath you run over to one of the girls shoes, the enourmous trainer belonging to the brunette girl and quickly take hold of the front part. Using all your strength you begin pulling yourself to the top of her shoe. <br>\r\n<br>\r\nAfter a little moment of struggling you make it to the top of the girls trainer. <br>\r\nRight behind you see her bare legs under her denim jeans towering way above you like some tall building! It looks like quite a climb but you gotta do it now!<br>\r\n<br>\r\nWhat happens next?<br>\r\n</span></div></div>",
            "created":1229385480,
            "id":620278,
            "title":"The college students"
        },
        "14111":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "you decide to climb the brunette girls jeans",
                "you change your mind and decide to go up the blond girls legs"
            ],
            "content":"<div class=\"\"><div> <span>\"This may be kind of hard.\" you say to yourself<br>\r\nHer bare legs are smooth shaven giving you nothing to hold on to, until you reach her jeans. You pause for a moment as you are big enough for her to feel if you aren't careful. <br>\r\nYou could try to shimmy up her leg, but if she notices you she is more likely to swat before she looks. That would be a bad thing. Or you could try to climb one of the other girls. </span></div></div>",
            "created":1229385720,
            "id":620284,
            "title":"Start climbing up her jeans"
        },
        "141111":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "up to her knee",
                "to her hips"
            ],
            "content":"<div class=\"\"><div> <span>You grip her denim jeans and begin to climb. It is hard work and after a few minutes you have not gone very far.<br>\r\n<br>\r\nYou hug her jeans with your arms and legs as best you can considering that it is far wider than you and try to climb it lumberjack style. That's when you reach a lump in her jeans. how far had you climbed?</span></div></div>",
            "created":1229385840,
            "id":620288,
            "title":"you decide to climb the brunette girls jeans"
        },
        "1411112":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "between her breasts",
                "surrounded by food"
            ],
            "content":"<div class=\"\"><div> <span>You continue your climb up, this time being a little more careful not to disturb her!<br>\r\nInfront of you is a huge expanse of tanned skin between her jeans and the green top she is wearing<br>\r\nYou eventually proceed up her stomach.<br>\r\n<br>\r\nYou managed to make it up to her breasts. You begin to feel a little funny being this close to a girls breasts, as the top she is wearing exposes both breasts and her cleaveage clearly. However you are more scared of falling between them to even care right now. You do admit they are a nice sight. Looking down you see the brunette girl has a plate of food infront of her, you can't see what it is but it smells nice.<br>\r\n<br>\r\nThen there is a terrifying rumble from below you and it nearly makes you fall.<br>\r\n\"That was her stomach rumbling.\" you say to yourself \"She must be really hungry!\" You think. <br>\r\nIf you can just make it to her ear, then you will be alright. However when you are just about to continue the girl suddenly moves forward to scoot her chair in a little. You lose your footing and fall! You close your eyes.<br>\r\nThen open them breifly mid fall to see <br>\r\n<a rel=\"nofollow\" href=\"http://img522.imageshack.us/my.php?image=saladleavesvegetables92wm1.jpg\" target=\"_blank\">http://img522.imageshack.us/my.php?image...</a><br>\r\nHoping that you might have landed somehwere soft, when you open your eyes you are<br>\r\n<br>\r\n</span></div></div>",
            "created":1229386980,
            "id":620302,
            "title":"rumbling stomach nearly makes you fall"
        },
        "14111122":{
            "author_id":"vat69",
            "author_name":"Taylor",
            "choices":[
                "you wave madly at the young brunette, will she spot you ",
                "the forkful is put inside her mouth, brace yourself for the inevitable"
            ],
            "content":"<div class=\"\"><div> <span>To your shear disappointment, when you open your eyes you are surrounded by food.<br>\r\nAll around you are enourmous tomatoes, lettuces, cucumber slices, croutons and carrots. You have landed between some slices of cucumber a tomato and two croutons. <br>\r\nLooking up you can see the three college girls and see two of them tucking into food. \"I better find a way to escape this salad box before I am eaten by one of these girls.\" you say to yourself. \"I've got to escape, I don't want to be among their lunch.\"<br>\r\n<br>\r\nThe three college girls are talking amonst themselves. You do not know any of them but you think they are all cute.<br>\r\n<br>\r\n<br>\r\nThe three college girls are:<br>\r\n<br>\r\nStacey Antondale- a 18 year old brunette who is studying Media and Artistic Design.<br>\r\n<a rel=\"nofollow\" href=\"http://img510.imageshack.us/my.php?image=staceynt0.jpg\" target=\"_blank\">http://img510.imageshack.us/my.php?image...</a> <br>\r\n<br>\r\nEloisa Davies- a 19 year old blonde who is studying Fashion Design as she is a model, she is also training to be a beauty therapist.<br>\r\n<a rel=\"nofollow\" href=\"http://img156.imageshack.us/my.php?image=eloisawt1.jpg\" target=\"_blank\">http://img156.imageshack.us/my.php?image...</a><br>\r\n<br>\r\nLauren Shandelson- a 18 year old redhead who is studying the same as Eloisa, she is also a model and is keen to be a fitness instructor.<br>\r\n<a rel=\"nofollow\" href=\"http://img510.imageshack.us/my.php?image=laurenry2.jpg\" target=\"_blank\">http://img510.imageshack.us/my.php?image...</a><br>\r\n<br>\r\nLooking up from your position among the salad you try to think how you are going to escape, then you hear another rumble from your right. From above descends a huge silver object and you jump back in fear as three prongs spear the tomato a short distance from you and lift it up. You watch it rise high into the air and disappear between the brunette girls lips, an audible chewing can bea heard as she chews it up.<br>\r\nNow you begin to panic as that could have easily been you. The fork comes down again and spears another load of salad and again up it goes and into the girls mouth.<br>\r\nYou climb up onto a crouton and wave madly to try and attract the girls attention but you are thinking you will be too small for them to see you. Besides they are in deep conversation and probably too busy eating to notice you.<br>\r\nThe fork comes down again and picks up a tomato, some lettuce and a cucumber slice, then one of the prongs touches the crouton you are on and it goes straight through it. Then you feel the crouton being raised into the air. Not being quick enough to get off it you are lifted up along with the forkful of food.<br>\r\n\"This is the end, I am going to be eaten by a college girl.\" you say as you find yourself looking at the face of a beautiful young girl with brunette hair.<br>\r\n\"Its the same girl I was climbing earlier, and now she's going to eat me.\" you say, terror whelling up inside you.<br>\r\nThe fork is moving towards her lips and then her lips part revealing a perfect set of pearly white teeth, you can see bits of salad stuck in the gums and then the mouth opens wider and you can now see right into her mouth. \"This girl has a lovely mouth, but I don't want to end up inside it, must get her attention.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1229550900,
            "id":621147,
            "title":"\"I've got to escape...\""
        },
        "141111222":{
            "author_id":"drago64",
            "author_name":"Dragon",
            "choices":[
                "you try to get out through the esofogus",
                "you stay and go with the flow"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you get swollowed and slide down her gulet into the You end up some how serviveing the digestivjuse but where to go now try to get out or go with the other food.</span></div></span></div>",
            "created":1291007040,
            "id":1004102,
            "title":"the forkful is put inside her mouth, brace your..."
        },
        "15":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Follow After Melissa Into The Kitchen",
                "Wait For Melissa's Return In Her Purse",
                "Wait For Melissa's Return On Her Homework"
            ],
            "content":"<div class=\"\"><div> <span>      One day you were at Melissa's house doing homework with her. You walk into the other room to grab something real quick when suddenly you find yourself shrunk to only the height of three inches tall. You go back into the living room to see that Melissa is going into the kitchen, more than likely to fix herself a snack. You observe your situation and find three paths of action available at this point. You could follow Melissa into the kitchen and try to get her attention, secondly you could climb into her purse and get her attention when she returns, or lastly you could try to get Melissa's attention by standing on her homework so she'll see you when she comes back to finish it. <br>\r\n<br>\r\nWhich path of action do you pursue?</span></div></div>",
            "created":1223528400,
            "id":593104,
            "title":"What To Do When You're Shrunk"
        },
        "151":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Keeping you as her boyfriend",
                "Eating you as a food item"
            ],
            "content":"<div class=\"\"><div> <span>  You proceed to follow after Melissa as she goes into the kitchen. By the time you get there she is already gathering ingredients for something you can't make out at this point. You climb up the kitchen drawers to reach the counter top. Once there you see that Melissa is making herself a sandwich with lettuce, tomato, cheese, cucumber slices, ketchup, and mustard. You run over to where Melissa is working. While you run you try to get her attention by means of waving your arms and screaming. To both of your surprise Melissa does notice you and picks you up. \"What happened to you?\" she asks. You tell her what you know and ask for her help. \"You know, Timothy,\" Melissa starts to say, \"when I first saw you shrunk, two things ran through my mind: One, no matter your size you would stay my boyfriend, and two, I was not going to have a tiny boyfriend and I was going to eat you.\" \"Which one did you decide on?\" you ask with an obvious tremble in your voice. Melissa tells you she decided on option...<br>\r\n<br>\r\nWhich of the two options does Melissa go with?</span></div></div>",
            "created":1223960400,
            "id":595173,
            "title":"You're Going to Be With Melissa One Way Or Another"
        },
        "1512":{
            "author_id":"samiam123",
            "author_name":"Ashley",
            "choices":[
                "Melissa's Mother, Jessica. ",
                "Melissa's Older Sister, Emma."
            ],
            "content":"<div class=\"\"><div> <span>    \"I could never have a tiny boyfriend,\" Melissa begins, \"that leaves only one reasonable choice.\" Melissa then proceeds to play you down on top of the lettuce leaf on her sandwich, then she squirts ketchup on top of you, after which she then places another lettuce leaf, followed by a cheese slice, and then ending with the second slice of bread spread with mustard. \"Now we'll get to test whether you really are so cute I could just eat you up.\" Melissa says with a grin. As Melissa lifts the sandwich to her beautiful crimson lips you loose all hope of survival. That is until someone enters the kitchen. \"Melissa, what are you doing talking to your sandwich?\" the person says. \"Who is this person who might just save me.\" you think to yourself with new found hope.<br>\r\n<br>\r\nWho entered the kitchen?</span></div></div>",
            "created":1224133200,
            "id":595998,
            "title":"You Might Just Be With Melissa Forever"
        },
        "15121":{
            "author_id":"plaster7",
            "author_name":"Crazy",
            "content":"<div class=\"\"><div> <span>           Melissa's mother Jessica walked in curiously. \"Oh. Hi mom! Sorry I just made this cute little sandwich so I was a little caught up in the moment eating it\" she said. She placed her thumb down on the bread over your head preventing any audible sound, that might escape from you, from being heard. \"Oh. Haha! I see, I've done that before. Where's Tim? Did he leave already?\" her mother asked. You begun to panic again realizing you had no hope in the position you're stuck in. She smiles innocently \"Yea. He walked home just a few minutes ago.\" she lied to her mother cleverly. <br>\r\n           Jessica turned around, and as she left the kitchen she told her daughter: \"Well alright. Don't get to excited with that sandwich\". You were doomed. \"I won't!\" she replied back waiting until she knew her mother had gone back to her room. She picked the sandwich back up and held it readily. \"Now where were we?\" she asked as she licked her crimson lips with glee. She bit into the corner of the sandwich causing your world to shake. She chewed and swallowed, taking pleasure in teasing you. She continued to eat the bits of sandwich that didn't cover you until you, and what was left of the bread, lettuce, tomato, and condiments was left around you, was all the was left. She giggled heavily licking her lips once more. She brought you up to her moist lips and spoke \"I hope you're ready babe\". She opened her lips and began to stuff all of you into them. After you were nicely packed into her mouth she licked you clean of the sandwich and chewed it up around you. She pushed you up to her teeth as she swallowed the mush it had become. \"Mmmm\" she moaned tasting you. You screamed for your life, but knew it was in vain. She pulled you to the back of her throat and swallowed. You easily slid down inside her esophagus heading straight for her stomach. You felt her heart beat and less then a minute later you found yourself landing in her stomach acids. \"You were the tastiest little thing ever! Goodbye little one.\" she said. And so you began to digest. Soon you would be nothing. And that was how you became a part of your clever girlfriend forever.</span></div></div>",
            "created":1434607560,
            "id":1994231,
            "title":"She's a clever one. Yes she is."
        }
    },
    "info":{
        "author_id":"samiam123",
        "author_name":"Ashley",
        "brief_description":" One day you mysteriously shrink and now must elude hungry females. GPs for good editions.",
        "created":1223419380,
        "description":"<td align=\"left\" class=\"norm\"> Before we begin I would Like to lay down some ground rules.<br>\r\n<br>\r\n 1. Only one male in the story, you.<br>\r\n 2. There is no size change after you are shrunk.<br>\r\n 3. You must eventually get eaten, crushed, or stepped on somewhere along the lines of the story.<br>\r\n 4. NO Unbirthing.<br>\r\n 5. If eaten would prefer but not required to be eaten in a food item. i.e. sandwich, hot dog, hamburger, etc.<br>\r\n 6. Editions must be in second person. \"You did this.\"<br>\r\n 7. No characters under 15 or above 37.<br>\r\n 8. New characters can be added.<br>\r\n 9. NO One line editions.<br>\r\n 10. Please use proper grammar and spell check.<br>\r\n 11. Remember NO Other males except for you.<br>\r\n 12. NO Animals, insects, that sort of thing.<br>\r\n 13. No toilet stuff in great detail.<br>\r\n 14. NOTHING sexual is allowed in great detail<br>\r\n 15. Original characters only Please. Nothing from games, movies, TV etc. if you add a character make it original.<br>\r\n 16. Please add and enjoy this interactive.<br>\r\n</td>",
        "id":1482256,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1490472480,
        "modified":1490472480,
        "pretty_title":"Hungry Hungry Females"
    }
}