{
    "chapters":{
        "1":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Hero of Bowerstone (Female)",
                "Hero of Brightwall (Princess/Queen)",
                "Lady Grey",
                "Hammer",
                "More Fable Lady"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It's time to choose your favorite female characters from Fable (Video Game Series).</span></div></span></div>",
            "created":1366261200,
            "id":1574090,
            "title":"Our story began."
        },
        "11":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Expansion",
                "Weight gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose Expansion, or Weight Gain for Hero of Bowerstone (Female) to be.</span></div></span></div>",
            "created":1366261200,
            "id":1574169,
            "title":"Hero of Bowerstone (Female)"
        },
        "111":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Bluebeery Expansion",
                "Full Body Expansion",
                "Next Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of expansion for the Hero of Bowerstone (Female)?</span></div></span></div>",
            "created":1366261200,
            "id":1574186,
            "title":"Expansion"
        },
        "1113":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Butt Expansion",
                "Hourglass Expansion",
                "Transform"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are more of expansion for the Hero of Bowerstone (Female).</span></div></span></div>",
            "created":1366520400,
            "id":1576344,
            "title":"Next Expansion"
        },
        "112":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Magic",
                "Eating & Drinking",
                "Force Feed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of weight gain for Hero of Bowerstone (Female)?</span></div></span></div>",
            "created":1366261200,
            "id":1574181,
            "title":"Weight gain"
        },
        "12":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Weight Gain",
                "Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you want weight gain or expansion Hero of Brightwall (Princess/Queen)?</span></div></span></div>",
            "created":1366261200,
            "id":1574164,
            "title":"Hero of Brightwall (Princess/Queen)"
        },
        "121":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Eating",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of weight gain for the Hero of Brightwall (Princess/Queen) to gain?</span></div></span></div>",
            "created":1366261200,
            "id":1574171,
            "title":"Weight Gain"
        },
        "1211":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Slightly Chubby Princess",
                "An Overweight Princess",
                "An Obese Princess"
            ],
            "content":"<div class=\"\"><div> <span>The Princess woke up with a bright light shining on her face. <br>\r\n\"Come on, Princess. It is time to wake up\", came the voice of her loyal butler, Jasper. <br>\r\n\"Ugh, go away, Jasper\", groaned the Princess. Mornings were not her thing. <br>\r\n\"Now that is hardly the response of a Princess. And after the cooks spent all that time preparing your birthday cake...\"<br>\r\n\"Cake?\"<br>\r\nThe Princess jumped out of bed. She loved the cake the cooks made. It was so nice. The way it fell apart in your mouth. The soft sponge...<br>\r\n<br>\r\nThe Princess was brought back by her dog licking her hand. <br>\r\n\"Hey boy. Did you sleep well?\", She asked her companion. <br>\r\nHe barked in response. <br>\r\n\"Good. I slept well as well.\"<br>\r\n\"Sorry to interrupt this conversation, but your clothes are ready. The finest cloth, with immaculate stitching. The white would bring out the colour of your eyes\". Jasper came over carrying a short brown skirt, a pair of tights and a white top that was quite tight around her breasts. <br>\r\nAfter a quick change, the Princess left the room. Soldiers saluted her as she passed and people greeted her. Nothing different happened. And why would it? She was only a human, after all. <br>\r\n<br>\r\nRunning into the kitchen, the Princess is surprised to see a huge cake, at least three layers of sponge and frosting. So nice...<br>\r\n\"Princess, are you okay\", asked one of the cooks. She had been gradually getting closer to the cake. <br>\r\nShe backed up a small amount and cleared her throat. \"Yes, I'm fine. Just looking forward to the party, that's all.\"<br>\r\nShe quickly left the kitchen before she devoured the cake. <br>\r\n<br>\r\nAt the party, a number of people had turned up. Her butler, Jasper, her combat mentor, Sir Walter Beck. Heck, even her brother had turned up. The Princess didn't really care about them though. She was waiting for the cake. <br>\r\nAfter a quick Happy Birthday Song and a few introductions, the Princess finally had her chance at the cake, along with other baked goodies. Quickly grabbing a plate, she swiped a couple of slices of cake, an Apple pie and a Mince pie. After grabbing her food, she ran off to her den in the library, where she quickly ate all the food. She was disappointed at how fast she ate it, so she returned to the party. <br>\r\n<br>\r\nAfter more cake than she could manage, the Princess finally went to bed. As she slept, the fat from the cake was transferred onto her slim body, causing her pyjamas to tighten and me of her buttons to pop out. <br>\r\nWhen morning arrived, the Princess found it harder to get up. Upon looking in the mirror, she was met with the sight of a...</span></div></div>",
            "created":1400734800,
            "id":1800568,
            "title":"Eating"
        },
        "12112":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "No thank you, I want to continue with the original storyline.",
                "Actually yes, I want to start off with a different storyline.",
                "Actually yes, I want to start off with a different storyline(alt)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hold on, do you still want to continue with the original storyline, or do you want to start the story off differently?</span></div></span></div>",
            "created":1432270800,
            "id":1981447,
            "title":"Fork In The Road To Rule"
        },
        "1212":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Cursing Pies",
                "Fat Magic"
            ],
            "content":"<div class=\"\"><div> <span>Which story with Magic does the Hero of Brightwall (Princess/Queen) wanting to gain?<br>\r\n<br>\r\n<br>\r\nDo you want a 'Cursing Pies' or 'Fat Magic'?<br>\r\n<br>\r\n-Cursing Pies<br>\r\nHero of Brightwall got a strange pie, when she eat it, then the next morning, the hero of brightwall got fatter.<br>\r\n<br>\r\n-Fat Magic<br>\r\nBefore she became a Hero of Brightwall and a new queen, she was a princess, Until on one day, a wizard place a fat magic on her that she will think or eat food will make her fat.</span></div></div>",
            "created":1381294800,
            "id":1676512,
            "title":"Magic"
        },
        "12121":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Wakes up and realises what is happening. ",
                "Stays sleeping and gains more and more. "
            ],
            "content":"<div class=\"\"><div> <span>Man, adventuring is hard, thought the Hero of Brightwall. She had just fought her way through a group of Hollow Men that had invaded the local tavern in her name-sake town, Brightwall. <br>\r\n\"Thank you so very much, Princess!\", weeped the owner of the tavern. He kind of lost when he asked the Princess for help clearing it out. <br>\r\n\"Happy to help\", replied the Princess. She was happy to help, as everyone she helped supported her in her rebellion against her brother, King Logan. Walking out of the tavern with a slight limp, the Princess sighed. <br>\r\n\"A Hero. The most powerful person in Albion and I'm easily hurt by a walking bone pile\", she complained. It wasn't her fault that she had dropped her sword when countering a Hollow Man's slash. <br>\r\n<br>\r\nLooking towards the Potions stand, the Princess was disappointed to see that it was closed. <br>\r\n\"Curse my luck. I'll have to have a pie if I want to travel tonight.\"<br>\r\nLimping over to the Pie stand, she was immediately spoken to by the owner. <br>\r\n\"Hello, Princess!\", he shouted happily. He was a slightly porky man. He looked as though he had been sampling his own pies. <br>\r\n\"Hello. I'd like a pie. Any kind will do\", she told him. <br>\r\n\"Perfect. You can sample my new pie! I call it the Meaty Pie. It combines chicken, beef and pork, along with a nice meat tasting gravy.\", he shouted. <br>\r\nThe Princess flinched every time he shouted. He was pretty loud. <br>\r\n\"I'll take one.\"<br>\r\nThe owner walked off and returned with a large pie. It was about double the size of a normal pie and looked twice as delicious. <br>\r\nThe owner was happy for her to just take it, as long as she came back. After multiple promises that she would, the Princess limped off to her house just outside Brightwall. <br>\r\n<br>\r\nUpon arrival, her faithful companion, Shadow, was enthusiastic in his greeting. After a thorough licking, the Princess sat down at her table. Pulling the pie out of her rucksack, she gave it a quick look over before cutting a small slice. Popping it in her mouth, her mouth exploded with flavour. <br>\r\nThe three kinds of meat mixed together to give a perfect taste, which was intensified by the gravy. <br>\r\nWhile eating, she failed to notice that each piece she ate made her body gain a little fat. To begin with, it wasn't much. Just a couple of pounds in her belly. But as she ate more and more, her gain sped up. <br>\r\n<br>\r\nHer small belly pushed out to form a small potbelly. Her B-Cup breasts bloated up to C-Cups. Each of her ass cheeks gained 5 pounds. After finishing a quarter of the Pie, the Princess was back up to full health. Standing up, she didn't notice her gain but felt a bit more tired. Deciding to put her plans on hold, she walked up her stairs and collapsed on her bed, fully clothed. Falling asleep, she was plagued by dreams involving the Pie she had just ate. <br>\r\n<br>\r\nUnknown to her, it wasn't a dream. She had sleep-walked back down to the Pie and was now slowly eating it. The Princess' once perfect body was bloating again. Her ass swelled with fat and her belly burst free from her top. Her breasts jumped up another cup size and popped a button of her top. <br>\r\nDoes the Princess wake up and realise what she is doing? Or does she remain sleeping and gaining?</span></div></div>",
            "created":1400821200,
            "id":1800865,
            "title":"The Meaty Pie"
        },
        "121212":{
            "author_id":"mr-lac",
            "author_name":"Mr Lac",
            "choices":[
                "She wakes up undisturbed",
                "Someone wakes her up"
            ],
            "content":"<div class=\"\"><div> <span><div align=\"justify\">Overcome by her dreams of pie, she remained asleep and proceeded eating away on the pie to her hearts content. Forgetting to use any cutlery this time around, she scooped up pieces of pie with her hands and shoved them into her mouth.<br>\r\n<br>\r\nWith each bite she took was making her body swell and swell by the second, dropping bits and pieces of crumbs and chunks of meat onto herself; as her clothes struggled to keep her growing frame contained. The more she devoured, the less remained of what the Princess' body was like before; in terms of shape and size. <br>\r\n<br>\r\nHer breasts grew to another cup size and burst her top wide open, buttons scattered away in different directions, free for all to see, as they now looked like a pair of small sized basketballs, which sagged side to side on her growing belly. Her arms were full of pudginess and flab that was clearly hanging from them. Her hands were no better, being quite pudgy themselves; as her fingers were looking very plump like sausages. Her belly was getting softer and bigger than before, drooping over her waist like an apron. The belly would gurgle and churn, unknown to the Princess, symbolizing it was holding in some massive amounts of gas. Her huge butt looked like two big watermelons. It was perhaps as big, if not bigger, than her belly. Her ass cheeks drooped down her legs and would sway and jiggle with each movement she took. And lastly the Princess' thighs looked like logs and would share in the jiggling madness whenever she moved. <br>\r\n<br>\r\nFinally finishing the rest of the pie in her sleep, the Princess, wearing only her tight skirt and shoes, rubbed her stained greasy hands on her belly while moaning with delight and planted herself onto the floor; and proceeded to drift away into a deep slumber while occasionally snoring loudly.</div></span></div></div>",
            "created":1434126420,
            "id":1991478,
            "title":"Stays sleeping and gains more and more. "
        },
        "1212121":{
            "choices":[
                "Not there. ",
                "Still selling pies. "
            ],
            "content":"<div class=\"\"><div> <span>The next morning, the Princess woke up. She was surprised to find herself on the ground floor of her house, and not in her comfy bed. What surprised and irritated her was the empty pie casing. Jumping to her feet, causing her body to jiggle madly, she huffed. <br>\r\n\"Someone stole my pie! I was gonna eat that...\"<br>\r\n<br>\r\nA shiver brought her back to reality. She wasn't wearing a top. Not seeing the remnants of her old shirt, she opened a wardrobe which had a number of shirts that she had insisted be brought here from the Sanctuary. <br>\r\nGrabbing one, she struggled to button up the front. <br>\r\n\"Come... ON!\" She grunted, pulling the top across. She managed to get a couple of buttons in, but the rest wouldn't move. <br>\r\n<br>\r\nScratching her bigger ass, still not noticing her body, the Princess headed towards town. She wanted more of the pies, and was hoping that the seller was still there. <br>\r\nWhen she reached the town, she ignored the looks she was getting from the townspeople and headed towards the marketplace. When she got there, she saw that the baker was...</span></div></div>",
            "created":1444837920,
            "id":2047323,
            "title":"An oblivious wake-up"
        },
        "12121212":{
            "choices":[
                "Eat the last pie. ",
                "Head to bed for a nap. "
            ],
            "content":"<div class=\"\"><div> <span>\"PIES! GET YOUR FRESHLY BAKED PIES HERE!\"<br>\r\nHearing the baker's familiar shout, the Princess smiled. Her luck was good today. Half walking and half waddling, the Princess approached the Baker. As he caught sight of her, he didn't react like the rest of the people who had seen her. <br>\r\n\"Looks like you enjoyed them!\", he said happily. <br>\r\n\"Oh, yeah. They were good\", replied the Princess. \"You don't happen to have anymore, do you?\"<br>\r\n\"Right this way...\"<br>\r\n<br>\r\nThe baker led the Princess behind his stall, where a massive oven housed a huge amount of the pies. <br>\r\n\"Now, how many do you want?\", he asked. <br>\r\n\"Emmm... How much is one?\"<br>\r\n\"50 Gold for the Hero of Brightwall\", he said. <br>\r\n\"All of them\", she quickly said. <br>\r\nAfter handing over a number of bags filled with gold, the Princess headed home. As the baker watched her almost knock a child over, an evil smile appeared on his face. <br>\r\n<br>\r\nAt home, the Princess locked her door and dumped all of the pies on the table. The top disappeared under all of them, and some were stacked on top of each other. Drool appeared at the corners of her mouth. She was resisting the urge to dive in and devour every single pie on the table. <br>\r\n\"Come on... Remain dignified\", she told herself. <br>\r\nAfter storing most of the pies in her cupboards and drawers, the Princess set two pies on the table. She did set a knife next to one of them, but her resistance finally broke. <br>\r\n<br>\r\nGrabbing a handful, she stuffed it in her mouth. Gravy, crumbs and bits of meat rained down into her cleavage. She grabbed another handful. And another. And another. <br>\r\nWhile she was chomping through her feast, fat was slowly being added to her body. Her belly began to split into two rolls. It lay between her thighs, which were slowly widening beyond the width of tree trunks. Her breasts broke the buttons of her top. They resembled basketballs in size, and sagged down onto her belly. Her ass ripped her skirt apart, leaving her in her panties/thong. Each cheek was a globe of fat. <br>\r\n<br>\r\nOblivious to her slowly growing body, the Princess finished off the first pie. She leant back on her chair and let out a massive burp. She then wiped her greasy hands on her belly, leaving a faint stain. <br>\r\nYawning, the Princess contemplated sleeping. Although the 'thief' who had stolen her previous pies could return and take these ones. <br>\r\nIn the end, she decided to...</span></div></div>",
            "created":1445029080,
            "id":2048112,
            "title":"Meaty Pies lead to a Meatier Princess"
        },
        "12122":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "A slight hunger, with some cravings for food. (Slow Gain)",
                "A sense of bloating, especially her stomach. (Fast Gain)"
            ],
            "content":"<div class=\"\"><div> <span>The Princess cursed to herself. She was in a really bad mood. <br>\r\nHer brother, who had promised that he would be at her 16th birthday, would not be turning up. Instead, he placed an expedition to some island above her. <br>\r\nShe swiped all the chess pieces of her board, leaving the game between Jasper and her undecided. Speaking of Jasper, he knew to avoid the Princess when she was angry, having raised her since she was a child. <br>\r\n<br>\r\nThe Princess had run out of things to break or knock over in her room, so she stormed out. When the guards outside her room went to salute, she cut them off with a glare so fierce, even Balverines would run. Pushing past them, she stomped down the stairs into the garden. When a Noble would go to greet her, they would receive either a glare or a curse. <br>\r\nAfter a number of nobles had been rejected, the Princess met someone who wasn't so easily scared. <br>\r\n\"Greetings, Princess\", said a wizened old man, with a wispy white beard. <br>\r\nThe Princess glared at him. <br>\r\n\"It's a fine day, isn't it?\", he said, not noticing her stare. <br>\r\nAnd so it went. The old man would comment on something, while the Princess would glare at him. Until...<br>\r\n<br>\r\n\"Oh my God! SHUT UP!\", shouted the Princess at the top of her voice, drawing the attention of everyone in the garden. <br>\r\nThe old man didn't reply. His expression changed from a pleasant happy one to a surprised one to a very, very angry one. <br>\r\n\"Why, I'm shocked. That is not how a Princess should act, especially to her subjects. Perhaps some humility would teach you?\"<br>\r\nThe Princess stomped her foot. <br>\r\n\"GET OUT OF MY GARDEN!\", she shouted. <br>\r\nThe old man stared at her. <br>\r\n\"Yes, humility. Perhaps... Yes, that would do.\"<br>\r\nThe old man waved his arms while chanting some weird language that the Princess didn't recognise. To be honest, she didn't care. She had stormed off towards her room. <br>\r\n<br>\r\nWaking up the next morning, the Princess got out of bed. Pulling her pyjama top down, she didn't notice her belly, which had gained a couple of pounds. <br>\r\nAfter throwing on some clothes, she went outside. Her anger had dissipated, but some other feeling had replaced it. <br>\r\nWhat was that feeling?</span></div></div>",
            "created":1402549200,
            "id":1811084,
            "title":"Fat Magic"
        },
        "122":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Full Body Expansion",
                "Hourglass Expansion",
                "More Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of expansion for Hero of Brightwall (Princess/Queen)?</span></div></span></div>",
            "created":1366261200,
            "id":1574172,
            "title":"Expansion"
        },
        "1222":{
            "choices":[
                "Magic",
                "Potion",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do the Princess's assets become bigger?</span></div></span></div>",
            "created":1444838820,
            "id":2047329,
            "title":"Hourglass Expansion"
        },
        "12223":{
            "choices":[
                "Ghostly Changes ",
                "Next"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, how about this?</span></div></span></div>",
            "created":1444838940,
            "id":2047330,
            "title":"More choices"
        },
        "122231":{
            "choices":[
                "A very curvy ghost woman. ",
                "A very angry looking hollow man. "
            ],
            "content":"<div class=\"\"><div> <span>Stabbing a Balverine, the Princess of Albion, also known as the Hero of Brightwall, rolled away from another Balverine. She had been fighting them for a couple of minutes now, and was beginning to struggle. Drinking a health potion, she shot it with her pistol. Roaring, the Balverine charged at her. <br>\r\n\"Damn...\", She muttered, rolling to the side. <br>\r\nConcentrating, she felt heat flow to her hand, which manifested as a fireball. She chucked it at the Balverine. It hit it in the chest, causing it to fall to the group. Running over, the Princess quickly stabbed it through the chest. She had many close calls with things that she thought were dead, but weren't. <br>\r\n<br>\r\n\"Now, let's see what you were guarding...\"<br>\r\nRunning behind them, she found a dark hole, which she assumed led into a cave. <br>\r\n\"Brilliant, another cave\", she said sarcastically. \"Love them\".<br>\r\nShe cautiously made her way down, one hand on her pistol and the other following the wall. She wasn't expecting to run into any trouble, but caves were usually occupied by bats and hobbes. <br>\r\n<br>\r\nAfter a while, during which she almost fell down a pit, the Princess reached a massive cavern. There wasn't very much to look at, although there was a path cut into the rock below her. <br>\r\n\"No harm in following the path\", she said, jumping down. <br>\r\nAlong the path, she spotted a couple of animals. A deer watched her pass by before running off. In the distance, a flock of bats circled a tree. <br>\r\n<br>\r\nThe path finally led to what looked like a shrine. The Princess couldn't tell what it was a shrine to, nor did she particularly care. What bothered her was that she had extorted information from a bandit, fought through loads of Balverines and almost fallen down a hole and all she got was a shrine. <br>\r\n\"What a bunch of garbage!\" She shouted, kicking the shrine. <br>\r\n<br>\r\nTurning around, she limped down the steps, trying not to step on her now sore foot when a noise behind her caused her to stop. Turning again, she saw...</span></div></div>",
            "created":1444941540,
            "id":2047719,
            "title":"A Hollow Discovery"
        },
        "1222311":{
            "choices":[
                "The Princess keeps her body. ",
                "The Goddess gets a new body. "
            ],
            "content":"<div class=\"\"><div> <span>The Princess saw a very curvy woman, who looked slightly see-through. Her breasts were three times the size of the Princess's, while her ass stuck about two feet from her body. Her hips were almost as wide as the Princess was tall. And she didn't look too happy. <br>\r\n<br>\r\n\"Why did you kick my shrine, mortal?\" She asked, her voice echoing around the cavern. <br>\r\nThe Princess, still kind of shocked that this woman had just appeared, made a squeak. <br>\r\n\"Mortal, answer me!\"<br>\r\nFinally snapping out of her confusion, the Princess replied, \"I'm not a mortal. I'm a Hero! And who are you to question me?\"<br>\r\nThe woman glared at the Princess. Her face didn't change. <br>\r\n\"It is beneath a Goddess to answer mortals. Although, a Hero is interesting...\"<br>\r\n<br>\r\nThe Princess, stubborn as ever, answered rudely. <br>\r\n\"The fact that I'm a Hero is irrelevant. I see that I've wasted my time here. See you later\", she said, turning to leave. She was stopped when the woman suddenly appeared in front of her. <br>\r\n\"You're going nowhere. You see, I haven't blessed a mortal with my gifts in a long time. And I haven't taken a host body in an even longer time. I find it fitting that a Hero becomes my host\", she said, smiling. <br>\r\nThe Princess just laughed. <br>\r\n\"Please! You expect me to believe that? I'm out of here\".<br>\r\n<br>\r\nWalking around the woman, she was half-way to the exit when a cold feeling halted her. She couldn't move, and her body was starting to feel heavier. <br>\r\n\"What's... happening?\", she stuttered. <br>\r\n\"Why, your body is changing to suit my needs\", answered a voice inside her head. <br>\r\nScreaming in surprise, the Princess accidentally shot a wall with her pistol. <br>\r\n\"What? Why?\", she screamed. <br>\r\n\"Because I can\".<br>\r\n<br>\r\nFeeling the heavy feeling intensify, the Princess looked down, just in time to see her breasts jump up a cup size. They were now D-Cups, and had broken the top button of her shirt off, revealing her new cleavage. Feeling her hips crack, she grabbed her ass and found it growing. Her panties were beginning to disappear into her ass crack. Her hips widened by a couple of inches, causing a rip to appear in her skirt. <br>\r\n<br>\r\nAfter a very lengthy argument with her new voice in her head, the Princess looked back at her body. Her breasts were contained, barely, in her top. They were bigger than her head, and weighed more than one of her hammers. Her ass was now two cream orbs stuffed in a very tight skirt. Each one was firm and round. Her hips had widened by a couple of feet to accommodate her new ass. <br>\r\n<br>\r\n\"I much prefer this form\", the voice said. <br>\r\n\"I don't! Give me my old body back!\", shouted the Princess, stamping her foot in protest. <br>\r\n\"No, I think not\", replied the voice. \"I think it's time for me to assume full control of this form\".<br>\r\n\"Like hell you are!\"<br>\r\n<br>\r\nAs a pain began to form in her head, the Princess began to fight the influence of the Goddess. But who gets control of the body?</span></div></div>",
            "created":1444946460,
            "id":2047744,
            "title":"A Curvy Possession"
        },
        "12223112":{
            "author_id":"keller12354",
            "author_name":"Seelmetal ",
            "choices":[
                "The goddess goes to the immediately ",
                "She teleports to a town"
            ],
            "content":"<div class=\"\"><div> <span>    Perfect I have returned to Albion in the body of a hero no less fortunately her body was malleable enough to sculpt to my whim.Now to see her memories oh so a hero and a princess what a boon and about to be queen too hehe I should get a move on I will miss my coronation but I should explore a little bit.</span></div></div>",
            "created":1551500940,
            "id":2625114,
            "title":"The Goddess  get a vessel "
        },
        "1223":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry Expansion",
                "Breast Expansion",
                "More Expansion for Hero of Brightwall"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are more expansion for Hero of Brightwall (Princess/Queen).</span></div></span></div>",
            "created":1366261200,
            "id":1574183,
            "title":"More Expansion"
        },
        "12231":{
            "author_id":"vocalrvbplayer",
            "author_name":"Vocal",
            "choices":[
                "Anything But Blueberry Pie",
                "A Blueberry In Aurora",
                "Choose another storyline"
            ],
            "content":"<div class=\"\"><div> <span>Want the Hero of Brightwall (Princess/Queen) to expand into a big juicy blueberry girl, huh? Aww, why the hell not. After all, it's about time someone made a Blueberry Expansion story for  this female protagonist. Now then, on with the show!<br>\r\n<br>\r\nStory 1: Anything But Blueberry Pie<br>\r\nWhile visiting Brightwall, the Hero of Brightwall stopped by a vast stall in the marketplace selling juice-filled blueberry pies. However, little does she know, that once she takes a bite out of one of these special pies, she will never be the same.<br>\r\n<br>\r\nStory 2: A Blueberry In Aurora<br>\r\nDuring a visit to the City of Aurora, the Hero of Brightwall is kidnapped by a secret occult who worship a rather rotund blueberry goddess, and they plan on making her into a blueberry just like their deity. Will the Hero of Brightwall be able to escape the occult and their religion, or will she \"destined\" to the same fate alongside their goddess?</span></div></div>",
            "created":1431752400,
            "id":1978899,
            "title":"Blueberry Expansion"
        },
        "122311":{
            "choices":[
                "Nothing happens. She eats the pie. ",
                "A knock at the door. Someone needs help!"
            ],
            "content":"<div class=\"\"><div> <span>Walking out of the Brightwall Academy, the Princess sighed. She had just helped Samuel out, as he had accidentally summoned a whole bunch of hollow men and didn't have the means to stop them. She had taken care of it in no time, but she had taken a couple of attacks. Her natural healing ability had healed her in seconds, though. <br>\r\n<br>\r\nAfter checking in with Jasper and finding very little in terms of quests, she decided to have some time to herself. She thought that it was time for a little shopping. Looking at the map, she had a couple of options. There was Bowerstone, although it was always packed. Driftwood, while small, was quite cheap. And finally, Brightwall. Cheap and a large selection. There was no competition. <br>\r\n<br>\r\nLanding outside Brightwall Village, the Princess checked her purse. She had a good amount of coins on her, plus she earnt some coins every hour from rent. Walking into the town square, she could see a number of stalls. There was the blacksmith, although she wasn't in dire need of a new weapon. The pawnbroker was offering 12% more for rare stones. Walking past the potions booth, she stopped and bought a couple of health potions. Further on round, her eye was drawn to a shabby stall. <br>\r\n<br>\r\nThe woman in charge looked quite desolate. It was clear that she wasn't selling too much. The Princess aimed to change that. <br>\r\nWalking up to the stall, the woman gasped. \"Your highness...\", she started. <br>\r\n\"Quiet! I don't want people to start calling me 'Your Highness' again. It gets quite repetitive after a while\", said the Princess. <br>\r\n\"Oh, of course. Anyway, can I help you?\", asked the woman. <br>\r\n\"Yeah. You don't seem to be selling too much. Is there a reason?\"<br>\r\nThe woman sighed. <br>\r\n\"Well, I'm reasonably new to the market, so not many people stop by. In fact, you're the first today.\"<br>\r\nThe Princess couldn't help but feel sorry for her. <br>\r\n\"What are you selling?\", she asked. <br>\r\n\"Blueberry Pies, freshly made with the best blueberries in all Albion!\", she woman said, clearly proud. <br>\r\n\"I'll take a couple\".<br>\r\n<br>\r\nAfter the Princess had given the woman the coins and received her pies, she waved goodbye. After an unremarkable look around the rest of the market, she decided to call it a day and head home. Leaving Brightwall Village, she headed for her home in Mistpeak Valley. She prefered the solitude, rather than the noise of a city. <br>\r\nInside, she set the pies on the table and went upstairs to get changed. Throwing her travelling clothes into the corner of the room, she threw on a white top, some tights and a brown skirt. Heading back downstairs, she saw the pies on the table. <br>\r\n\"That woman was really nice. And those pies do look good. Might as well\", said the Princess. <br>\r\n<br>\r\nGrabbing one of the pies, the Princess cut herself a generous slice. Lifting it to her mouth...</span></div></div>",
            "created":1432011600,
            "id":1980316,
            "title":"Anything But Blueberry Pie"
        },
        "1223111":{
            "choices":[
                "Decides to find the woman who sold her the pies. ",
                "Spies more of the pie on the table. "
            ],
            "content":"<div class=\"\"><div> <span>Taking a bite of the pie, the Princess gasped. It tasted divine! The blueberries were fresh, and the crust basically fell apart in her mouth. Swallowing the first bite, the Princess took another, then another, then another, until nothing was left. Licking her lips, she leant back on her chair and gave a quiet burp. <br>\r\n\"Oh, excuse me!\", said the Princess. \"Man, that was good. And there's still some left. It would be a shame if no one would eat it...\".<br>\r\n<br>\r\nCutting another slice, she ate it in a manner much like the first. Only, this time after finishing it, she felt... full. <br>\r\n\"Strange, I haven't eaten in a while. How have two slices of pie filled me up?\", wondered the Princess. <br>\r\nAfter a while, the bloated feeling disappeared. Deciding that it was nothing, the Princess had a third slice. Once again, the bloated feeling reappeared. This time, it was more intense. Looking at her stomach, she saw nothing out of the ordinary. However, changes were overcoming her body. <br>\r\n<br>\r\nA blue dot appeared on her nose. It slowly grew in size, turning her entire face a deep blue. It even affected her hair, as its normally brown colour had become blue. Next, the blue colour started moving down her body. Her breasts had gone blue, then her belly and then her legs. Her arms also started changing colour. The Princess didn't notice anything, as her clothes covered her entire body. Once her hands had turnt blue, only then did she realise something was up. <br>\r\n\"What the...?\", she began, when the full feeling began to grow in intensity. Moving her hands to her stomach, she recoiled when it pushed out. <br>\r\n<br>\r\n\"Oh, god!\", she yelled in surprise. Looking down, she saw her belly, once flat, was now pushing against her top. Unbuttoning it, she gasped when a blue sphere appeared. Grabbing it, she whimpered. <br>\r\n\"What is happening?\", she asked, scared. <br>\r\nHer breasts began filling out, causing another whimper. Grabbing them, she gave a quiet moan due to their sensitivity. Feeling her backside beginning to expand, she sighed. <br>\r\n\"What is going on!\", she shouted. <br>\r\n<br>\r\nEventually, the growing stop. The Princess sighed in relief, before looking at her body. <br>\r\nHer breasts had gone up to E-Cups. Each one was a deep blue and very sensitive. Her belly made her look eight months pregnant with twins. Her backside was now two orbs of blue flesh. <br>\r\nLooking around, the Princess...</span></div></div>",
            "created":1432098000,
            "id":1980554,
            "title":"Nothing happens. She eats the pie. "
        },
        "12231112":{
            "choices":[
                "Find the woman, and get her to help. ",
                "Become even bigger. "
            ],
            "content":"<div class=\"\"><div> <span>Falling onto her giant ass, the Princess yelped. It was... a pleasurable experience, but at the same time, was quite a weird feeling. Normally, a wooden floor would bruise her backside, but now? She was more likely to bruise the floor. <br>\r\n\"What happened to me? One minute, I'm me. The next, I'm this... blue... thing?\"<br>\r\nLooking at her blue body, the Princess couldn't help but be a little turned on. <br>\r\n\"It's not that bad...\", she giggled, before catching herself on. \"What am I on about? I need to find a cure!\"<br>\r\n<br>\r\nStill on the floor, the Princess attempted to get to her feet. She struggled, and rocked backwards and forwards. Eventually, she was on her feet, and regretting it. <br>\r\n\"I feel so heavy\", she complained. \"Whatever has happened to me, it's made me heavier!\"<br>\r\nA rumble caused her to flinch. <br>\r\n\"I cannot be hungry! I just ate some pie!\"<br>\r\nHer stomach rumbled in response. Apparently, it wasn't satisfied with what she had had. <br>\r\n\"Fine!\", she exclaimed. \"A couple more slices, then we are going!\"<br>\r\n<br>\r\nMoving her girth over to the table, she attempted to fit her backside into a chair. After the arms had broken off and the chair had finished creaking, the Princess grabbed the remnants of the first pie and stuffed it  into her mouth. She instantly regretted it, as it reminded her of how good the pie was. Reaching across the table, she grabbed the second pie and cut it in half. Leaving one half, she quickly finished the other half. <br>\r\n\"Oh yes... Tastes so good!\", she said, licking her blue lips. <br>\r\nStruggling out the chair, and cringing at the creaking it emitted as she moved, she started moving towards the front door when a familiar feeling returned. <br>\r\n\"Oh dear god... No!\"<br>\r\n<br>\r\nInstead of running out the front door, the Princess moved as fast as she could towards the back door. As she ran out into her garden, she felt her body begin to expand again. Only this time, it was a little bit more pleasurable. <br>\r\nAs her spherical belly grew bigger, she watched her breasts expand. Poking one, she moaned at how sensitive it was. Grabbing both, she moaned loudly, partly due to the growth under her hands, and partly because of the sensitivity. <br>\r\n\"Oh, yes... Bigger!\", she gasped, massaging her growing breasts. <br>\r\nWhile she was focusing on her breasts, her belly, still a sphere, had gone past the realm of twin pregnancy and was making her look pregnant with around six kids. Her backside had reached the size of her old belly and had basically rendered her skirt useless. Her panties, stained blue, were slowly disappearing into her ass crack. Her body, while still mobile, was beginning to become a sphere. Her thighs had joined in the growth, giving her a pear shape. Her cheeks had filled up as well, making it slightly harder to talk. <br>\r\n<br>\r\nFinally, the growth stopped. The Princess was disappointed, but when she saw her body, she wasn't too happy.  <br>\r\nShe was mobile, but barely. Her breasts were about J-Cups. Her top hung around her shoulders, as she had unbuttoned it to have a better grasp on her breasts. Her bra contained them, but was showing signs of strain. Her belly was massive. It was still a sphere, but was the same size as an exercise ball. Each ass cheek looked like it was housing a couple of globes. Her thighs completed her lower body, giving her massive hips. <br>\r\n<br>\r\nLooking at herself, the Princess knew there was only one course of action. </span></div></div>",
            "created":1432184400,
            "id":1980849,
            "title":"Spies more of the pie on the table. "
        },
        "122311122":{
            "choices":[
                "Continued to grow. ",
                "Stopped growing. "
            ],
            "content":"<div class=\"\"><div> <span>Despite the drawbacks of being a giant blue girl, the Princess found herself oddly attracted to the idea of being an even bigger giant blue girl. She had one problem though. <br>\r\n\"How on earth do I get back into my house?\", asked the Princess out loud. She had grown bigger than the door, and her first attempt to get through the door resulted in her giant hips getting stuck. <br>\r\n<br>\r\nAfter freeing herself from the door, she sighed. <br>\r\n\"I need that pie, but I'm stuck out here. Come on, think!\", she told herself. She waddled her bulk around her back garden a couple of times before trying a couple of ideas she had had. <br>\r\nFirst, she approached her door and, rather hopelessly, tried to suck in as much breath as she could. It worked briefly, before she felt the need to breathe halfway through the door. Throwing herself to the side as best she could, she got out before she was truly stuck. <br>\r\n<br>\r\n\"Okay then... Idea number 2!\", she exclaimed. <br>\r\nWaddling to the door, the Princess placed her hands on her hips and pushed. The feeling that followed was uncomfortable, to say the least. Once again, her plan failed as she couldn't stick the feeling. <br>\r\n\"Fine! Last idea before I walk back into that town and buy more pies!\", she exclaimed. <br>\r\nWaddling once again to her door, the Princess turned sideways. Slowly moving through the door, she was surprised that her final idea was working. <br>\r\n\"Never expected this to work. Sometimes the simplest ideas are the best!\", she said, happy that she could eat her last pie. <br>\r\n<br>\r\nReaching the table, she was going to forget the knife, but decided against it. Cutting it in half, and then half again, she lifted one bit and quickly stuffed it into her mouth. Bits of blueberries fell onto her skin, but she couldn't distinguish between the fruit and her skin, so she forgot about them. Polishing off her first slice, the Princess lifted a second, and much like the first, it disappeared down her throat. <br>\r\nLeaning back as best as she could, she gave a couple of burps. Lifting the pie tin, she quickly finished it off. <br>\r\n\"And then there was none! Ohhh, I don't feel so good...\", She moaned. <br>\r\nWaddling as fast as she could, she reached her back garden before letting out a massive burp, which made her feel better. It was instantly replaced with a familiar bloated feeling. <br>\r\n<br>\r\n\"Yes! Bigger, please!\", squealed the Princess. She was looking forward to this expansion, and had basically stripped to her underwear in preparation. Looking at her belly, she watched in anticipation as it began to grow even bigger. Moving her arms towards her breasts, she was disappointed and slightly shocked to see that she couldn't reach them, no matter how hard she tried. <br>\r\n\"Come... On!\", she grunted. \"Reach... my... Breasts!\"<br>\r\n<br>\r\nShe eventually gave up, as she could see what was happening to her body. The previous expansions had involved her body becoming bigger and bluer, but this one was different. Instead of each individual body part growing, her body was beginning to become a sphere. Her arms were being pulled into her bigger upper body, and her legs were slowly being absorbed by her lower body. Her cheeks were beginning to fill out, making it slightly harder to talk. <br>\r\n<br>\r\n\"Oh yes... Bigger!\", moaned the Princess. \"Make me bigger!\"<br>\r\nIn response to her request, she...</span></div></div>",
            "created":1433653200,
            "id":1989211,
            "title":"Become even bigger. "
        },
        "122312":{
            "choices":[
                "Yes, and she attacks the others. ",
                "No, so she continues to follow. "
            ],
            "content":"<div class=\"\"><div> <span>Strolling through the centre of Aurora, the new Queen let out a sigh of mixed content and boredom. Ever since the Darkness had been defeated in what people were now calling the Battle of Bowerstone, most enemies had disappeared from Albion. Heck, even the Sand Furies had mostly disappeared from the deserts surrounding Aurora. This left the Queen/Hero with nothing to do. <br>\r\n\"Man, I thought the life of a royal would be more exciting. It's even worse than when I was a Princess!\", she complained. <br>\r\n<br>\r\nUnknown to her, a problem was arising. People were going missing in the deserts surrounding Aurora. They were all woman. The reason the Queen was there was to investigate the disappearances. When it was mentioned to her in Bowerstone Castle, she jumped at the chance. Now that she was here, she had no idea where to start. <br>\r\n\"The only leads were the woman. And they are gone\", mused the Queen. \"It's best if I take a look around the desert, see if anything comes up\".<br>\r\n<br>\r\nOut in the desert, the Queen sighed. It was just as hot as she remembered. <br>\r\n\"At least I'm not being taunted by the Darkness this time\", she said, shuddering at the thought. <br>\r\nIt eventually got the point where it was too hot for her to continue in her current clothes. She retrieved the Guild Seal from its case and was teleported to the Sanctuary. Jasper greeted her in his usual fashion. <br>\r\n\"If I may ask, why are you covered in perspiration?\", he asked. <br>\r\n\"The desert is a hot place, Jasper\", panted the Queen. She was really feeling the effects of the heat. <br>\r\n<br>\r\nAfter changing into a very dusty set of clothes that were reserved for the desert, she left the Sanctuary. Back in the desert, she still felt hot but it wasn't as bad. <br>\r\n\"Let's continue, shall we?\", asked the Queen to no one in particular. <br>\r\nWhen a voice replied to her question, she almost had a heart attack. <br>\r\n\"Yes, let us continue... Goddess!\"<br>\r\nShe spun around to find nothing. Turning was a mistake, as she felt a blow to the back of her head. She fell to the ground, unconscious. <br>\r\n<br>\r\nThe Queen woke up. She was nice and cool, which was surprising. The last she knew, she was in the middle of the hottest desert on the planet. <br>\r\n\"My head...\", she groaned. \"Who attacks Royalty? Honestly...\"<br>\r\nGetting to her feet, she felt a breeze around her lower body. Looking down, she gasped. <br>\r\n<br>\r\nShe was no longer wearing her dusty desert clothes. She was wearing the robes of Auroran Royalty. She had gold bangles, gold necklaces, gold everything. Looking around the room, she saw a mirror. Peering at it, she recoiled when she saw her new hairstyle. Instead of her short ponytail, she had an elegant updo that wouldn't look out of place in the back garden of her castle. <br>\r\n\"What...?\", she began. She was cut off when the doors opened. <br>\r\n<br>\r\nA man flanked by two Sand Furies walked in. <br>\r\n\"Well, it appears our Goddess had descended upon us. Do not worry, for we shall give unto you your true form\", he said, walking around her. <br>\r\n\"Listen here, I order you to release me. If you fail to do so, the armies of Albion shall descend upon you and...\"<br>\r\n\"Do absolutely nothing, as we have the Goddess on our side\", said the man. \"Now, follow me. I shall reveal your true form\".<br>\r\nThe Queen had intentions of refusing, but as she looked into the man's eyes, she found herself agreeing with the idea. <br>\r\n\"Let us go, then\", the Queen told the man, gesturing for him to lead. <br>\r\n<br>\r\nAs the Queen, the unknown man and the two Sand Furies walked down a corridor, the Queen was attempting to regain control of her body. <br>\r\n<br>\r\nIs she successful?</span></div></div>",
            "created":1433739600,
            "id":1989431,
            "title":"A Blueberry In Aurora"
        },
        "1223122":{
            "choices":[
                "Drank it herself. ",
                "Had to be forced to drink it. "
            ],
            "content":"<div class=\"\"><div> <span>Despite her trying her hardest to repel the suggestion to follow the unknown man and obey every order he gave her, the Queen was unable to resist the crude mind control. She was helpless until they group walked into what appeared to be a large cavern that had been partially converted into a throne room. The throne was similar to the one in Bowerstone Castle, although this one was made out of pure gold. It had a deep blue seat, and was flanked by two more Sand Furies. The man gestured for the Queen to take a seat, which she did. <br>\r\n<br>\r\n\"Now, we have brought you here because we believe that you are a reincarnation of the great Auroran Goddess. It is said that she is reborn every time Aurora is threatened, so that she may free her people. After she frees them, she assumes a certain form so that Aurora may prosper and flourish under her guidance\", explained the man. \"You understand this, yes?\"<br>\r\nThe Queen nodded against her will. <br>\r\n\"As I have defeated the Darkness and saved Aurora, I am the person you just described. I shall therefore become your goddess, and allow Aurora to flourish under my rule\", she said. <br>\r\n<br>\r\nThe man appeared to be satisfied with her answer and gestured to an unseen person. They soon showed themselves, as a woman in typical Auroran Robes walked into the Throne Room, bearing a gold platter with a blue potion on it. She walked right up to the throne and knelt before the Queen. <br>\r\n\"My Goddess, I present to you the vessel that shall grant you your new form\", she said, lifting the platter. <br>\r\nThe Queen lifted the potion and...</span></div></div>",
            "created":1433770080,
            "id":1989459,
            "title":"The role of the Goddess"
        },
        "12231221":{
            "choices":[
                "Fell under his control again. ",
                "Resisted his magic. "
            ],
            "content":"<div class=\"\"><div> <span>Lifting the bottle to her lips, she paused briefly. <br>\r\n\"Hang on, what am I doing?\", she asked herself. \"I'm a queen, not a goddess\".<br>\r\n\"My Goddess, is there a problem?\", asked the man, causing her to look into his eyes once again. <br>\r\n\"No, I was merely preparing myself\", answered the Queen. <br>\r\n<br>\r\nPutting the bottle to her lips, she tilted her head back and downed the entire bottle. She was surprised to find that the potion tasted a lot like blueberries. Putting the bottle back, she gestured for the girl to leave. <br>\r\n\"It is done\", she told the man. \"Now, tell your new goddess your name\".<br>\r\nHe knelt before her. <br>\r\n\"My Goddess, I am your Chief Priest, responsible for locating the Goddess. My name is irrelevant, for we do not use them\", he told her. <br>\r\n\"Very well. For here on forth, I shall refer to you as Chief\", she said. A small itch was beginning to annoy her on her nose, which attracted the attention of Chief. <br>\r\n\"What is this itch? Why won't it leave?\", asked the Queen, scratching it as best as she could. <br>\r\n\"It is the beginning of the changes. Do not fear, no harm shall befall you\", reassured Chief. <br>\r\n\"If you say so...\"<br>\r\n<br>\r\nBack in her room, the Queen was slightly irritated to find that her mirror had been removed. <br>\r\n\"No one, not even the Goddess, may look upon you while you are in your quarters\", Chief told her from outside her door. She accepted this, although she was still irritated. Lounging on her sofa, she found that the itch had mostly dissipated, only to be replaced by an even stranger feeling. If she had been paying attention to her body, she would've found that she was now a deep blue colour. <br>\r\n\"A goddess... I always knew I was destined for greatness\", she told herself, smiling. She was ignoring the bloated feeling that she was feeling. She stopped ignoring it when she felt heavier. <br>\r\n\"What on Aurora...\", she asked, annoyed at being broken out of her trance. Looking down at her body, she finally broke her mind control. <br>\r\n<br>\r\nHer once white, slender body was now violet in colour. And she was no longer slender. She was becoming the opposite. As she watched, her belly began to bloat outwards. Her breasts began to push against her bra, one of the two articles of clothing from Albion that she was allowed to keep. Below her body, she felt her ass begin to expand as well. <br>\r\nGetting to her feet, she rushed out of her room as fast as her bloating body would allow. She found Chief, who smiled when he saw her enter. <br>\r\n\"What is going on here?\", she demanded angrily. <br>\r\nChief held his hand up. <br>\r\n\"Have no fear, Goddess. It is only you assuming the form of the true goddess\".<br>\r\n\"No, it's me becoming a massive blue ball!\", she snapped. <br>\r\n\"I see the problem. Look into my eyes, it'll help\", he said. <br>\r\n<br>\r\nAs the Queen looked into his eyes, she...</span></div></div>",
            "created":1433771880,
            "id":1989472,
            "title":"Becoming the Goddess"
        },
        "122313":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Story 3: Princess & the Blueberry Factory",
                "Story 4: Blueberry Mansion"
            ],
            "content":"<div class=\"\"><div> <span>Here are two more Blueberry Story for Hero of Brightwall (Princess/Queen).<br>\r\n<br>\r\nStory 3: Princess &amp; the Blueberry Factory.<br>\r\n<br>\r\nThe Hero of Brightwall found an invitation for a blueberry factory tour. Then the next day,  as she enter the blueberry factory, then it's was a trap for her. Can she escape from te blueberry factory, or she'll become blueberry girl test subject forever?<br>\r\n<br>\r\nStory 4: Blueberry Mansion.<br>\r\n<br>\r\nThe Hero of Brightwall arrive at the Abandon Mansion, there she saw a lot of Blueberry Food for her, but this mansion has a darkest secret that will turn her into a Blueberry Girl Forever.</span></div></div>",
            "created":1436548500,
            "id":2006041,
            "title":"Choose another storyline"
        },
        "12233":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Pregnant",
                "Transform"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There are two expansion for the Hero of Brightwall (Princess/Queen) left.<br>\r\n<br>\r\nDo you want Pregnant or Transform?</span></div></span></div>",
            "created":1366779600,
            "id":1577671,
            "title":"More Expansion for Hero of Brightwall"
        },
        "122331":{
            "choices":[
                "Natural Pregnancy",
                "Magical Pregnancy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A couple of options left now. Is the Hero of Brightwall's pregnancy natural or magical?</span></div></span></div>",
            "created":1410152400,
            "id":1854310,
            "title":"Pregnant"
        },
        "1223312":{
            "choices":[
                "A ghost seeking a second chance at life. ",
                "A new type of potion. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, a couple of ways on how the Hero of Brightwall can, through magical means, become pregnant. </span></div></span></div>",
            "created":1410152400,
            "id":1854313,
            "title":"Magical Pregnancy"
        },
        "12233121":{
            "choices":[
                "She was overcome with a wave of pleasure. ",
                "Some of the Wisps flew at her. "
            ],
            "content":"<div class=\"\"><div> <span>Peering into the depths of the cave, the Princess of Albion sighed. It was a new cave, sure, but what made it different from any other cave? The Princess was pretty sure that she knew the answer. <br>\r\n\"Come on, boy. Let's see if we can be home in time for dinner.\", She said to her dog, Rex. <br>\r\n<br>\r\nAfter fighting through Hobbes, Hollow Men and a horde of Bats, the Princess finally reached the bottom of the cave. What she found took her breath away. <br>\r\nInstead of being dark and dank, like every other cave, it was brightly lit. Coloured wisps flew around, their light reflecting of the walls. <br>\r\n\"This is gorgeous...\", said the Princess. <br>\r\nHer trance was soon broken by one of the wisps flying into the ground. Apparently, not all of them were dead, as a couple of Hollow Men rose up around her. Drawing her sword, she slashed through two of them before switching to her pistol and blasting another two. Spinning, she summoned flames in one hand and lightning in the other and threw both at the final Hollow Man. <br>\r\nBreathing deeply, the Princess then heard another noise. Turning again, she saw that all of the other wisps had stopped moving. <br>\r\n<br>\r\nDeciding that it was best to leave, the Princess stopped when they all started to move again. Although the way they moved was quite strange. They moved back and forth, gradually speeding up. <br>\r\n\"What is going on?\", asked the Princess. <br>\r\nOnce again, she turned to leave when...</span></div></div>",
            "created":1410325200,
            "id":1854950,
            "title":"A ghost seeking a second chance at life. "
        },
        "122331211":{
            "choices":[
                "Nothing major happens. (Slow Pregnancy)",
                "Her belly begins to grow. (Fast Pregnancy)"
            ],
            "content":"<div class=\"\"><div> <span>The Princess paused when she felt a small twinge of... something. She couldn't place it, nor did she really care, so she continued onwards. <br>\r\nShe stopped again when the same feeling returned, only stronger this time. <br>\r\n\"What is this?\", she asked out loud. <br>\r\nShe was answered with another twinge, only this time...<br>\r\n\"Ohhhhh...\", moaned the Princess, biting her lower lip. <br>\r\n<br>\r\nThe new feeling was over-powering her. In an attempt to relieve it, the Princess tried many different things. She closed her eyes, believing that if she couldn't see, she couldn't feel. <br>\r\nIt didn't work. <br>\r\nShe bit her lip again, causing it to bleed slightly. It also didn't work. <br>\r\nIf the Princess had opened her eyes, she would have seen that a very brightly coloured wisp, slightly bigger than the others, was floating throughout the Princess's body, causing the waves of pleasure. <br>\r\nStill attempting to relieve the pleasure, she grabbed her breasts. The wisp floated up to them, and centred on them, causing the Princess to moan. <br>\r\n<br>\r\nAfter every attempt to relieve the pleasure had failed, the wisp finally made its move. It floated down to her vagina, and floated into it. <br>\r\nThis was the final straw for the Princess, who finally passed out from the pleasure. <br>\r\nWhile she was lying there...</span></div></div>",
            "created":1410411600,
            "id":1855668,
            "title":"She was overcome with a wave of pleasure. "
        },
        "1223312112":{
            "choices":[
                "Woke up, and escaped the cave. ",
                "Attracted the attention of more wisps. "
            ],
            "content":"<div class=\"\"><div> <span>As the Princess lay on the ground, twitching and moaning every so often, her slim body began to change. Her flat belly began to push against her corset under her top. Both were tightening by the minute. After a couple of minutes, the first button popped off. It flew across the cavern and through another wisp, which vibrated in an annoyed way. After another minute had passed, another button popped off. <br>\r\n<br>\r\nAs soon as her slowly expanding belly reached a couple of inches from her body, the rest of her began to grow. Her C-Cup breasts, held in place by her corset and top like her belly, began to fill with milk. They also started to push against both pieces of clothing. However, the buttons held, but only just. <br>\r\nHer backside began to put on a few pounds. As each cheek grew, her panties began to disappear in between them. Within seconds, they had mostly disappeared. <br>\r\n<br>\r\nAs time passed, the Princess, still unconscious, grew. After half an hour had passed, she could be considered 'Big'.<br>\r\nHer belly was no longer flat. It protruded about two feet from her body. It had broken free from her top, and was fully exposed. The skin on it was taut and stretch marks were beginning to appear. Her breasts were now E-Cups. They had popped the top two buttons off of her top, causing her cleavage to be on full view. Small white spots had appeared, showing signs of lactation. <br>\r\nHer backside had caused her panties to rip apart and her body had risen off the floor a couple of inches due to the size of it. Her skirt had been pushed up by the size of it, causing the bottom of her ass to be visible. <br>\r\n<br>\r\nTwitching, the Princess...</span></div></div>",
            "created":1435942920,
            "id":2002690,
            "title":"A Pregnant Princess"
        },
        "12233121122":{
            "choices":[
                "A group of enemies. ",
                "The remaining wisps. "
            ],
            "content":"<div class=\"\"><div> <span>Twitching, the Princess unconsciously let out a loud moan as her body grew. The wisps that were still floating around the cavern all paused. They all turned towards the Princess and began to slowly float towards her. <br>\r\n<br>\r\nAt this point, the Princess woke up. Struggling into a sitting position and looking at her body, she opened her mouth to scream, but was quickly silenced by a wisp flying into her mouth. As her eyes widened, another one began the process of pleasuring her. As the Princess began to twitch again, she moved her hand towards her bigger breasts and began kneading them. She was good at it, as she had opened the Master Pie Maker on the Road to Rule. Soon enough, she passed out from pleasure again. <br>\r\n<br>\r\nAs the wisps watched her fall back into a lounging position, they began to move again. When they reached her body, the all entered different points on her body. Some entered through her vagina, others entered through the back and the rest entered her mouth, which was wide open. Whenever the wisps entered decided which part of her grew the most. <br>\r\n<br>\r\nIf they entered her mouth, her breasts and belly would both grow. If they entered through her ass, her ass and belly grew and if they entered through her vagina, her belly would undergo a substantial growth. <br>\r\nThe wisps entered each part of her body in equal amounts. Some remained outside. As they entered, the Princess's body began its second growth. <br>\r\n<br>\r\nHer E-Cup breasts began to fill with even more milk. They had broken free of the top buttons of her top, leaving a massive amount of cleavage on view. Her bra, strained to its limits, was still holding. <br>\r\nHer backside began to fill with fat. Each cheek resembled a globe of the world she had in her house, and weighed about the same. Her thighs joined in, stopping when they resembled tree trunks. <br>\r\nHer belly was easily the biggest part of her body. It extended at least four feet from her body. It was covered in stretch marks and was a bright pink. <br>\r\nThe rest of her body had grown to complete the picture. Her cheeks had puffed up, giving her face a rounder look. Her arms and hands had put on a few pounds, so she now had sausages for fingers. Her shoes had begun to show signs of strain, as her feet had bloated up as well. <br>\r\n<br>\r\nGroaning, the Princess opened her eyes. Looking down at her body, she finally finished what she had started earlier. She let an almighty scream out of her mouth. <br>\r\n\"What the Hell!\", she screamed. A whooshing noise was heard.  <br>\r\nThis scream had attracted the attention of...</span></div></div>",
            "created":1437170640,
            "id":2009255,
            "title":"A Very Pregnant Princess"
        },
        "122331211222":{
            "choices":[
                "Go home. ",
                "Go even deeper. "
            ],
            "content":"<div class=\"\"><div> <span>Grabbing her new belly, the Princess gasped. It felt so... tight and big. She recoiled when she felt movement within her massive belly. <br>\r\n\"Am I? No, I couldn't be...\", she started to say. <br>\r\nShe was interrupted by another whooshing sound. Turning her head around, she saw nothing, bar some wisps and a pool of water in the centre of the cabin. The pool reminded her that she hadn't had a drink in ages. <br>\r\n<br>\r\nShe struggled to sit up. After a number of attempts, she had managed to get into a sitting position. It wasn't comfortable, but she wasn't too concerned about that. Planting her hands on the ground either side of her, she began pushing her huge girth off the ground. <br>\r\n\"Come... On!\", she grunted. \"I'm not... that heavy!\"<br>\r\nEventually, she was on her feet and was starting to regret it. She was really sore, and her back was killing her. <br>\r\n\"Ouch... Why is this happening to me?\", she grumbled. Swinging her hips, she waddled towards the pool of water. <br>\r\n<br>\r\nReaching the waters edge, she dropped to her knees. Her cushioned backside collided with her wider legs, causing ripples on both areas. Reaching down, she scooped up some water and lifted it to her mouth. Gulping it down, she sighed. <br>\r\n\"Oh man, that is good...\"<br>\r\nAs she drank more and more, the remaining wisps were making their moves. Simultaneously, they began to move towards the unaware Princess. <br>\r\n<br>\r\nThe Princess, hearing whooshing noises behind her, finished drinking and rotated 180 degrees. Seeing the wisps approaching, she, once again, opened her mouth to scream. Once again, she was stopped. A couple of faster wisps had reached her and had begun to silence the Princess. <br>\r\nAfter she had fallen unconscious again, the remaining wisps started to enter her. They entered each part of her body, mouth, ass and vagina, in equal amounts. <br>\r\n<br>\r\nHer massive body began its third expansion. Her breasts, already the size of massive watermelons, grew even bigger. They finally broke free of her shirt. Buttons flew off in all directions. Her bra strained against the massive mammaries, but held. <br>\r\nHer backside grew even bigger. Her skirt ripped along the sides, releasing her ass. Each cheek grew bigger and bigger. Her panties held on, but just barely. <br>\r\nHer belly surpassed the rest of her body. It extended about six feet from her body. It was a massive globe. The skin covering it was pulled tight and was covered in stretch marks. <br>\r\nHer face puffed up even more, giving the Princess a third chin. Her arms plumped up even more. Her hands looked like catchers mitts, and her fingers resembled overstuffed sausages. Her thick thighs widened, stopping when they were a couple of feet wide. Her hips had widened to accommodate her gargantuan belly. Her feet had burst through her shoes, any her tights were now straining to hold her massive lower body. <br>\r\n<br>\r\nGroaning, the Princess woke up. She had a splitting headache, and her back was killing her. But at least she was alive. She didn't respond to her body's growth. She didn't care anymore. <br>\r\nAfter she had struggled to her feet, she paused. What was she going to do now? She was a massively pregnant Hero. But she was still a Hero. Looking across the cavern, she saw another cave. She could either explore that cave, or she could go home and wait until she had given birth. <br>\r\nIn the end, the Princess decided to...</span></div></div>",
            "created":1437217980,
            "id":2009439,
            "title":"A Massively Pregnant Princess"
        },
        "1223312112222":{
            "choices":[
                "A house, with smoke coming from the chimney. ",
                "Many, many more wisps. "
            ],
            "content":"<div class=\"\"><div> <span>Looking at the exit, a number of thoughts passed through her mind. One in particular stuck. <br>\r\n\"What about my Pride?\"<br>\r\nThe Princess was known as a person who didn't give up willingly. She would continue on, no matter the danger to her or her... children. <br>\r\n\"If they are children...\", she muttered, tapping her fat fingers on her globular belly. <br>\r\nPutting one foot ahead, she wobbled. Her centre of gravity had shifted due to her new body, and she was having trouble moving her heavier legs. <br>\r\n\"Alright, I can do this!\"<br>\r\nSwinging her hips down and then forwards, she found that it was much easier to walk. It was still hard, but easier than before. <br>\r\n<br>\r\nReaching the entrance to the next cave, she stopped. Her face had gone red, and she was breathing heavily. <br>\r\n\"I... I never thought it would be this... this hard to walk\", she said, trying her best to breathe properly. <br>\r\nAfter regaining her breath, she continued onwards. She was shivering slightly, as most of her clothes had been ripped apart. She briefly considered the Sactuary, but decided against it. <br>\r\n\"Who knows how Jasper would react\", she told herself, rubbing her arms in an attempt to heat them up. <br>\r\n<br>\r\nThe Princess eventually reached a new cavern, after many, many rest stops. She was slightly surprised to see...</span></div></div>",
            "created":1437342540,
            "id":2009992,
            "title":"A Huge Mistake Made By A Huge Princess"
        },
        "122331212":{
            "choices":[
                "She wanted more wisps. ",
                "She had enough wisps. "
            ],
            "content":"<div class=\"\"><div> <span>Just as she was about to turn to leave, a wisp flew at the Princess. She didn't have enough time to move out of the way, as the wisp was very fast and she was unprepared, so the wisp hit where it was aiming. It flew up her skirt, worked its way into her panties and into her vagina, causing the Princess to moan. <br>\r\nShe didn't notice anything, but her belly, once flat, pushed out the smallest bit. <br>\r\n\"Well, that was weird...\", She began. <br>\r\n<br>\r\nOnce again, as she turned to leave, another wisp flew at her. It repeated the actions of the first and caused another moan. <br>\r\nHer belly pushed out again. <br>\r\nInstead of leaving, the Princess stepped towards the wisps. The two inside her were suggesting that it was a good idea for her to accept a couple more into her body. The Princess pointed at two wisps flying nearby, which caused both of them to enter her body. Because there was two of them, the pleasure she received was greater. She had to resist the urge to moan again.<br>\r\nDown at her belly, it had pushed out again, straining the buttons lower down on her top. Her breasts had also started to grow. They hadn't gone up a size yet, but they were on their way to it. <br>\r\n<br>\r\nDoes the Princess stay and absorb more wisps, or leave with what she had?</span></div></div>",
            "created":1410498000,
            "id":1856097,
            "title":"Some of the Wisps flew at her. "
        },
        "1223312121":{
            "choices":[
                "The Princess resists the wisps. ",
                "The wisps are too strong for the Princess. "
            ],
            "content":"<div class=\"\"><div> <span>Looking at all of the wisps in the cavern, which was quite a lot, the Princess hesitated. She briefly remembered why she was here,  before the wisps inside her took control of her mind once again. They suggested that it would be good if she were to allow more wisps to enter her. <br>\r\nThe Princess smiled. Reaching down, she unbuttoned her skirt and let it drop to her ankles. She then did the same with her panties, leaving her vagina exposed. <br>\r\nRaising her arms, she spoke to the wisps. \"Come to me. Come to me if you wish to be reborn!\"<br>\r\n<br>\r\nNothing happened at first. But then, one wisp flew at her, causing another growth. Another wisp flew at her. And another. And another. Eventually, a conveyor belt had formed, leading into the Princess, who was growing very big. <br>\r\nHer belly had passed the size of a full-term pregnant woman. Her breasts were bursting with milk and had just passed G-Cups. Her ass had formed a layer of fat, as the Princess was sitting on it with her legs spread to allow the wisps an easy path into her. <br>\r\n<br>\r\nJust about a quarter of all the wisps had entered the Princess. She was still under the control of the wisps inside her, but something seemed wrong to her. <br>\r\nIs she beginning to resist?</span></div></div>",
            "created":1410584400,
            "id":1856263,
            "title":"She wanted more wisps. "
        },
        "12233122":{
            "choices":[
                "Nothing. ",
                "Her bigger breasts with her even bigger belly!"
            ],
            "content":"<div class=\"\"><div> <span>Walking out of a newly discovered cave, the Princess/Hero shielded her eyes. The sunlight was harsh, especially after her adventures in the cave, which was quite dark. Down in the cave, she had fought a number of Hollow Men, one of which had gotten a lucky bit on her. It wasn't a deep cut, but she knew that it was better to be safe than dead. <br>\r\n<br>\r\nWalking into Bowerstone Marketplace, the Princess stopped by her house first. She dropped off a couple of pictures her dog had dug up, grabbed a bit of gold and headed to the Apothecary. <br>\r\nShe owned the Apothecary, so everything was discounted to her. The problem was that they had run out of Healing Potions. <br>\r\n\"Why are you short on Healing Potions?\", she asked, slightly annoyed. <br>\r\n\"Well, a number of adventurers came through earlier and bought all of them. However, I know you are a busy woman, so you'll want to be moving on as fast as possible. I have a new experimental potion here. The makers claim that it is the exact same as a Healing Potion, only with a few extra ingredients. Take it, free of charge\", The shop owner explained, handing her a red potion. <br>\r\nTaking it, she returned to her house. <br>\r\n<br>\r\nBack home, the Princess inspected the bottle. It was the exact same as a Healing Potion, but she could feel something... Something new to her. Deciding that it was an emergency, she popped the cap and drank the entire bottle. <br>\r\nUpon finishing it, she felt weird. Heading up to bed, she fell asleep, not knowing what the potion would do to her. <br>\r\n<br>\r\nWaking up the next morning, the Princess finds herself very heavy. Looking down at her body, she saw...</span></div></div>",
            "created":1410152400,
            "id":1854325,
            "title":"A new type of potion. "
        },
        "13":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Weight Gain",
                "Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose Weight Gain or Expansion for the mayor of Bowerstone: Lady Grey.</span></div></span></div>",
            "created":1366261200,
            "id":1574545,
            "title":"Lady Grey"
        },
        "131":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Force Feed",
                "Magic",
                "Eating"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are three of weight gain for Lady Grey from Fable Series.</span></div></span></div>",
            "created":1401080400,
            "id":1802849,
            "title":"Weight Gain"
        },
        "132":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Full Body Inflation",
                "Blueberry Expansion",
                "Hourglass Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are three expansion for Lady Grey from Fable Series.</span></div></span></div>",
            "created":1401080400,
            "id":1802846,
            "title":"Expansion"
        },
        "14":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Weight Gain",
                "Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pick one of two thing for Hammer from Fable II.</span></div></span></div>",
            "created":1366261200,
            "id":1574195,
            "title":"Hammer"
        },
        "141":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Magic",
                "Force Feed",
                "Eating"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are Three Weight Gain for Hammer from Fable II.</span></div></span></div>",
            "created":1401080400,
            "id":1802853,
            "title":"Weight Gain"
        },
        "142":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Breast Expansion",
                "Blueberry Expansion",
                "Hourglass Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are Three Expansion for Hammer from Fable II.</span></div></span></div>",
            "created":1401080400,
            "id":1802855,
            "title":"Expansion"
        },
        "15":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Elise (Fable III)",
                "Veronica",
                "Whisper (Fable)",
                "Rose (Fable II)",
                "Next Fable Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are more female from Fable.</span></div></span></div>",
            "created":1366347600,
            "id":1574777,
            "title":"More Fable Lady"
        },
        "151":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Weight Gain",
                "Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose Weight Gain or Expansion for Elise (Hero child friends) from Fable III, you want it.</span></div></span></div>",
            "created":1373950800,
            "id":1629002,
            "title":"Elise (Fable III)"
        },
        "1511":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Overeating after the Prince/Princess leaves the castle. ",
                "Force-fed while she was a captive of Nigel Ferret. ",
                "Some other method. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>And how exactly does Elise gain Weight?</span></div></span></div>",
            "created":1400994000,
            "id":1801945,
            "title":"Weight Gain"
        },
        "15111":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "A lot of food remains. Time to think and eat!",
                "No food remains. Time to go raid the kitchen..."
            ],
            "content":"<div class=\"\"><div> <span>Guilt was a terrible feeling. Elise knew this now. The Prince had sacrificed innocent civilians for her. Granted, she felt a bit happy. She was still alive, but she couldn't help wondering 'What If' as she took another bite of some mutton she had liberated from the kitchen, among other things. <br>\r\nThis was basically Elise's life now. Grab some food from the kitchen and use it to mull over her issues in life. Today's topic; what if she had died instead of the rioters?<br>\r\n<br>\r\nA number of ideas rose up, the most prominent being that she would be dead. The second was that the Prince would be heart-broken, but would he still have left during the night?<br>\r\nElise thought about this as she finished off the liberated mutton. Trying to take another bite of it resulted in her almost biting of her finger, which prompted Elise to move to retrieve more food. She lifted her slightly bigger body out of the chair in which she sat, and walked over to where she kept her food supply. <br>\r\n<br>\r\nPassing her mirror, Elise payed no mind to her body. One, she didn't care, and two, no one else cared. She did like her slightly bigger breasts, which were straining her dress a small bit, and her ass, which was bigger, along with her hips. What ruined her perfect figure was the small layer of pudge which had formed on her belly, lifting the bottom of her top a little bit. <br>\r\nWhat happened to her body was of no concern to her. She just wanted her Prince back. <br>\r\n<br>\r\nFinally arriving at her secret food storage, Elise opens her wardrobe and removes the bottom of it to see...  </span></div></div>",
            "created":1400994000,
            "id":1801948,
            "title":"Overeating after the Prince/Princess leaves the..."
        },
        "151111":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "10 mutton",
                "6 cakes"
            ],
            "content":"<div class=\"\"><div> <span>\"There a lot of food that i took from the kitchen left.\" said Elise as she think of the food and the prince.<br>\r\n<br>\r\nThen she began to think and said \"Hmm. Should i choose 10 mutton or 6 pies.<br>\r\n<br>\r\nThen she decided to choose for her to eat is.......</span></div></div>",
            "created":1402549200,
            "id":1810993,
            "title":"A lot of food remains. Time to think and eat!"
        },
        "151112":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Someone hears her and alerts the guards. Time to split!",
                "No one hears her. Elise continues her raid. "
            ],
            "content":"<div class=\"\"><div> <span>Finding no food in the secret hatch of her wardrobe, Elise was forced to wait another couple of hours. She needed to make sure that the cooks had left the kitchen, and as a further precaution, the castle, and she needed to wait until there was a break in the guards patrol routes. <br>\r\nShe had mapped it all before. <br>\r\nAt 8:00 PM, the cooks left the kitchen to collect their pay and, 15 minutes later, they left the castle to go see their families, after a quick check that no one had raided the kitchen. Elise couldn't go during this time as some cooks still remained in the kitchen and guards stood in front of the outside door and the inside corridor was filled with servants, nobles and guards. <br>\r\nAt 9:00 PM, guards were still in front of the outside door but the inside corridor was a little bit emptier. At 9:15 PM, the outside guards change, leaving a two minute window for Elise to slip in. She would spend at least half an hour gathering supplies. The next guard change would be at 10:30 PM, leaving another two minutes for Elise, along with her smuggled supplies, to escape. <br>\r\n<br>\r\nThat was the hard part. She would then have to get back to her room, which was easy. With a combination of hidden passages and her knowledge of the castle, Elise would never be caught. The perfect heist, in her opinion. <br>\r\nAt 9:00 PM, Elise left her room and walked outside. Nobles were allowed outside until 10 PM, so she had free reign until then. Keeping close to the kitchen door, Elise just walked around until the guards changed. Taking this opportunity, Elise quickly slipped into the kitchen, locking the door behind her. After locking the inside door, Elise started raiding the cupboards and fridges. <br>\r\n<br>\r\nShe grabbed as much as she could of her favourites, but leaving some so it wouldn't be noticed. After a good half hour of looting, Elise was finally ready to leave. Checking both doors, guards were still there. <br>\r\nAfter ten minutes had passed, Elise was bored. The apple she had been rolling about had been recently eaten, leaving her nothing to do. Her stomach rumbling gave her something to do. <br>\r\nElise looked around. No one was there, so why was she checking? Reaching into one of her bags, Elise pulled out some mutton. Quickly eating it, she pulled out some more. Then some more and then more. Soon enough, her first bag of mutton was empty. Due to its very high fat content and the amount she had eaten, the mutton had taken its toll on Elise' figure. <br>\r\n<br>\r\nHer breasts were barely contained within her dress despite the extra material provided by her belly, which had forced its way through and under the dress and now hung down like a small apron. Her ass had forced the back of the dress up but it was still covered by her incredibly stretched panties and a very small amount of her dress. Giving a couple of quiet burps, Elise giggled, which was very unlike her. <br>\r\nUnknown to her, the cooks had prepared a special mutton for the Kings birthday. They had mixed some alcohol in with the sauce and Elise had eaten quite a bit, leaving her a little drunk. It was having a profound effect on her decisions, as Elise had forgotten about the bags she had packed. <br>\r\nShe had heaved her hefty body to her feet and was now raiding the rest of the kitchen, making a lot of noise. <br>\r\nDoes anyone hear her?</span></div></div>",
            "created":1401253200,
            "id":1803610,
            "title":"The Midnight Raid"
        },
        "1511121":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "A Guard. The Law finally caught up with her. ",
                "A random drunk, looking to join her. "
            ],
            "content":"<div class=\"\"><div> <span>Hearing the inside door creak open, Elise stopped walking towards the leaders and turned around. <br>\r\nA maid stood at the door, gaping at the heavy girl who looked a bit unsteady. <br>\r\n\"Hey there, no need for guards... *Hic*\", slurred Elise. The alcoholic mutton was a bit potent, especially for her, who had never had an alcoholic beverage before. <br>\r\nThe maid stared at Elise before shouting, \"GUARDS! THERE'S AN INTRUDER IN THE KITCHENS!\"<br>\r\n\"Oh, Damn. Not good.\", cursed Elise before pushing past the maid. <br>\r\n<br>\r\nHearing the guards, Elise inadvertently crashed into a suit of armour. Normally, her body would cause it to shake, but her bigger body caused it to completely break apart. Broken armour pieces were strewn around the corridor behind her. The pursuing guards jumped over them, but some weren't fast enough and tripped over them. <br>\r\n<br>\r\nCrashing into more objects, Elise was making life harder for her pursuers. Reaching the dining room, four guards jumped her. Spinning round, two of the guards were smacked in the face by her bigger breasts, knocking them out. The other two grabbed her arms and attempted to push her to the ground. That didn't work, as Elise used her bigger body mass to crush one of the guards before rolling onto the other one. <br>\r\nGiggling madly, Elise found this fun. Knocking out guards in, what to her was, a high-speed chase. Swaying off, Elise eventually escaped the castle. The guards were still chasing her as she ran into the local Bowerstone tavern. Hiding among the revellers and drunks, Elise would be hard to spot. <br>\r\n<br>\r\nLooking around, Elise sat at a table by herself, a beer in front of her. She was deep in a day-dream, until someone tapped her on the shoulder. Clumsily turning around, Elise sees that it is...</span></div></div>",
            "created":1401253200,
            "id":1803734,
            "title":"Time to run!"
        },
        "1511122":{
            "choices":[
                "After a while, she makes it. ",
                "No, she is caught by a guard. "
            ],
            "content":"<div class=\"\"><div> <span>Surprisingly, no one heard the racket that Elise was making. She was knocking over pots and pans and tankards, but no one came to investigate. The bags that she had originally packed were lying near the door, unwatched. <br>\r\n<br>\r\nElise wasn't focused on finding food in general. Instead, she wanted more of the King's Mutton. She loved how the meat fell apart in her mouth, how the sauce made her forget about her problems...<br>\r\n\"Yes!\", squealed Elise. She had finally found it. <br>\r\nA number of mutton chops, all drenched in the alcoholic sauce and waiting for someone to eat them. Elise threw herself at them. She tore huge chunks off, occasionally stopping to down a tankard of water. The amount of food she was eating, along with the alcoholic sauce, was having a profound effect on her body. <br>\r\n<br>\r\nHer face had gone quite red, and her cheeks had puffed up. Elise was hiccuping every few seconds, and stopped to giggle every so often. Her breasts were stretching her dress to its limit. Bits of mutton and sauce fell into her cleavage, where she would pick them out and then eat them. They were about F-Cups, and were still growing. Her belly was on full view. Her dress had given up on covering the massive sphere of fat. It protruded about a foot in front of her, and jiggled everytime she moved. Her ass, still contained within her panties but just barely, was two massive globes of pure fat. Her ass cheeks would jiggle occasionally, due to her movement. <br>\r\n<br>\r\nEventually, Elise stopped. She had run out of mutton to eat. Turning around, she lost her balance and fell over with a loud crash. Giggling madly, she got up to her feet. Grabbing her bags of food, she tries to return to her room. But does she make it?</span></div></div>",
            "created":1431666000,
            "id":1978321,
            "title":"No one hears her. Elise continues her raid. "
        },
        "15113":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "She had a curse on her by a witch",
                "She drink the fat potion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are more choice of weight gain for Elise from Fable III.</span></div></span></div>",
            "created":1401080400,
            "id":1802566,
            "title":"Some other method. "
        },
        "1512":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Breast Expansion",
                "Butt Expansion",
                "Other Types of Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of expansion happens to Elise?</span></div></span></div>",
            "created":1391490000,
            "id":1738862,
            "title":"Expansion"
        },
        "15121":{
            "choices":[
                "New type of potion. ",
                "Other method. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How do Elise's already big breasts grow bigger?</span></div></span></div>",
            "created":1431666000,
            "id":1978325,
            "title":"Breast Expansion"
        },
        "151211":{
            "choices":[
                "A small bit. ",
                "All of it. "
            ],
            "content":"<div class=\"\"><div> <span>Running into Bowerstone's town square, Elise let out a laugh. She loved getting out of the castle. It got awfully boring with all the politics and judging and stuff. While she was in Bowerstone, she felt free. And she loved it. <br>\r\n<br>\r\nLooking around some shops, her eye was drawn to the potion shop, where a massive sign saying SALE was visible. Walking inside, a number of potions caught her eye. <br>\r\n\"Health Potion... Maybe not. Slow Time Potion? Don't need one. Summon Creature potion? Weird... BG potion, females only. Intriguing...\"<br>\r\nPicking up the BG potion, she took it up to the counter and paid for it. Before she could leave, the shopkeeper tapped her shoulder. <br>\r\n\"Be careful about how much you drink in one go, okay?\"<br>\r\nElise nodded and waved goodbye. <br>\r\n<br>\r\nBack in her room at the castle, Elise locked her door, pulled the curtains closed and unstoppered her new potion. Raising the bottle to her lips, Elise drank...</span></div></div>",
            "created":1431666000,
            "id":1978333,
            "title":"New type of potion. "
        },
        "1512111":{
            "choices":[
                "Drink some more of the potion. ",
                "Ignore it. "
            ],
            "content":"<div class=\"\"><div> <span>Taking a couple of small sips, Elise waited for something to happen. She was disappointed when the only thing that happened was her burping a couple of times. <br>\r\n\"Well, that was a waste of money. I need to be more careful about what I buy\", Elise said before walling out of her room. <br>\r\n<br>\r\nAfter dinner, Elise returned to her room. Her day had been full of disappointments, ranging from the dud potion to being told for not returning to the castle on time. <br>\r\n\"I hope tomorrow's a better day...\", she sighed, pulling her dress off. Standing in front of her mirror, Elise looked at her body. She looked like she always did. Long curls in her hair, shapely body... Only something seemed off. <br>\r\n\"I can't place it. There is a really obvious difference here, and I can't see it!\", complained Elise. <br>\r\n<br>\r\nAfter an intense session in which she glared at her body trying to work out what was different, Elise finally conceded. She couldn't see it. So she pulled on her nightgown and collapsed on her bed. <br>\r\nHer sleep was plagued by weird dreams of giant, flesh-coloured balls chasing her around. When she awoke in the morning, she had forgotten the events of yesterday. If she had remembered them, she wouldve realised that her breasts, which were originally C-Cups, had gone up a couple of cup sizes and were now E-Cups. She did realize that her nightgown was a bit tighter, along with her dress, but ignored it. <br>\r\n<br>\r\nLooking over at her dresser, Elise saw the BG potion sitting there. <br>\r\n\"What if it's one of those potions that you have to take daily?\", she wondered out loud. <br>\r\nIn the end, Elise decides to...</span></div></div>",
            "created":1431838800,
            "id":1979196,
            "title":"A small bit. "
        },
        "15123":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Fule Body Inflation",
                "Blueberry Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two kind of expansion for Elise from Fable III.</span></div></span></div>",
            "created":1401080400,
            "id":1802900,
            "title":"Other Types of Expansion"
        },
        "152":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Weight Gain",
                "Expansion",
                "Full Body Inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose one of the three expansion for Veronica from Fable Series.</span></div></span></div>",
            "created":1401771600,
            "id":1806748,
            "title":"Veronica"
        },
        "1521":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Magic",
                "Force Feed",
                "Eating"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are three weight gain for Veronica from Fable Series.</span></div></span></div>",
            "created":1401944400,
            "id":1807497,
            "title":"Weight Gain"
        },
        "1522":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Pregnant",
                "Blueberry Expansion",
                "Hourglass Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are three expansion for Veronica from Fable Series</span></div></span></div>",
            "created":1401944400,
            "id":1807496,
            "title":"Expansion"
        },
        "153":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Weight Gain",
                "Expansion",
                "Full Body Inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are three expansion for Whisper from Fable and Fable: the Lost Chapter.</span></div></span></div>",
            "created":1402203600,
            "id":1808964,
            "title":"Whisper (Fable)"
        },
        "1531":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Eating",
                "Magic",
                "Force Feed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are three weight gain for Whisper from Fable.</span></div></span></div>",
            "created":1402203600,
            "id":1808965,
            "title":"Weight Gain"
        },
        "15312":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Story #1",
                "Story #2"
            ],
            "content":"<div class=\"\"><div> <span>Here are two story of magic weight gain chapter for Thunder sister name Whisper from Fable.<br>\r\n<br>\r\nStory #1: Whisper bump into a wizard, then the wizard place a fat magic on her to teach her a lessons. Can Whisper find the way to lift the fat magic? (It's similar to children book call Fat Magic).<br>\r\n<br>\r\nStory #2: Whisper found a stranger spell book, after she read it at night, the next morning Whisper will be shock that her body has become fatter.</span></div></div>",
            "created":1432270800,
            "id":1981337,
            "title":"Magic"
        },
        "1532":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry Expansion",
                "Butt Expansion",
                "More Expansion for Whisper"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are one of the expansion for Whisper from Fable.</span></div></span></div>",
            "created":1402203600,
            "id":1808967,
            "title":"Expansion"
        },
        "154":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "She wasn't hungry anymore",
                "She could provide for herself and Little Sparrow to go to the chocolate factory",
                "They could live in a grand castle. "
            ],
            "content":"<div class=\"\"><div> <span>The Hero of Bowerstone's Sister always wanted a wish granted. From a young age, she was the main provider for both herself and her sibling. She found it hard by herself, as Bowerstone Old Town had a number of shady characters, including one persistent creep who offered money for a \"Favour\". <br>\r\nAs soon as Little Sparrow was old enough, Rose was forced to send her out to help provide. But one fateful day, a trader, by the name of Murgo, came into town.<br>\r\n\"Come one, come all!\" shouted Murgo at the crowd gathering around his caravan. \"First item I have procured from the Old Kingdom is this!\"<br>\r\nHe whipped off a tarp on an object next to him, revealing a mirror. At the back of the crowd, two girls approached, curious at the noise. <br>\r\n\"Now, whoever looks into this mirror, in complete darkness, will instantly become beautiful. All for the price of 5 gold coins!\" promised Murgo. <br>\r\n\"I'll take it!\" shouted a man at the front. <br>\r\n\"Excellent, excellent. You won't be disappointed, I assure you. Now, my next object is this. A magic music box. All you must do is turn the key and whatever you wish will become reality.\"<br>\r\nAfter this, the crowd dispersed. <br>\r\n\"Rubbish\" said the taller of the two girls. \"There's no such thing as magic!\"<br>\r\nA woman clothed in a red robe turned around to face them. <br>\r\n\"It's a sad time indeed, when the young don't believe in magic.\" She said. <br>\r\n\"You don't actually believe it's magic, do you?\" asked the girl. <br>\r\n\"All for the price of five gold coins, you could have an answer. But whatever the choice, you and your Little Sparrow won't be any closer to the inside of a castle. Eating fine food, drinking the best wine. The choice is yours, Rose.\"<br>\r\nWith that, the woman walked off. <br>\r\n\"We might as well try it, Little Sparrow. It'll make no difference to our lives if it isn't magic. Come on, let's get those coins!\"<br>\r\n<br>\r\nA couple of hours later, the duo had collected five coins, purchased the music box and had returned to their shack. As Rose turned the key, she wished that...</span></div></div>",
            "created":1391490000,
            "id":1738873,
            "title":"Rose (Fable II)"
        },
        "1541":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Old Lady",
                "Old Man"
            ],
            "content":"<div class=\"\"><div> <span>She could go to a place where she could easily provide food and drink for herself and Little Sparrow. <br>\r\nBut nothing happen, and so Rose &amp; Little Sparrow went to bed to sleep.<br>\r\n<br>\r\nThe next morning, Rose &amp; Little Sparrow woke up and saw that they was in the forest &amp; the next is a mansion made out of dessert, then their wish really come true.<br>\r\n<br>\r\n\"Little Sparrow, this mansion is looking yummy to us\" said Rose to Little Sparrow as the two girl began to eating it. <br>\r\n<br>\r\nThen someone say \"Who is nibble my mansion?\"<br>\r\n<br>\r\nThe two girl stop nibble, as they turn around &amp; saw someone who live a dessert mansion is...</span></div></div>",
            "created":1431666000,
            "id":1978293,
            "title":"She wasn't hungry anymore"
        },
        "15411":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "\"Pies & Chocolate Milk\"",
                "\"Mutton & Juice\""
            ],
            "content":"<div class=\"\"><div> <span>\"Who are you? Are you living this mansion that we nibble at. Me &amp; my little sister Little Sparrow are looking for a new home to live it &amp; we want to eat &amp; drink.\" ask Rose to the old lady.<br>\r\n<br>\r\nThen the old lady answer to the two girl \"My name is Mary. And yes, you two girl can living with me. I'm going to making something for both of you girl to eat &amp; drink.\"<br>\r\n<br>\r\nThen the two girl went inside &amp; said to Mary \"Me &amp; Little Sparrow want a.......\"</span></div></div>",
            "created":1431666000,
            "id":1978343,
            "title":"Old Lady"
        },
        "154111":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "\"10 of Pies & Chocolate Milk\"",
                "\"25 of Pies & Chocolate Milk\""
            ],
            "content":"<div class=\"\"><div> <span>\"I'll make Pie &amp; Chocolate Milk for you &amp; your delicio-- i mean your little sister. Anyway how many Pies &amp; Chocolate Milk do you both want?\" said Mary to Rose &amp; Little Sparrow as she lick her mouth secretly.<br>\r\n<br>\r\nThen Rose answer to Mary as she &amp; her little sister Little Sparrow as they sit on a chair \"Well then we want......\"</span></div></div>",
            "created":1431666000,
            "id":1978381,
            "title":"\"Pies & Chocolate Milk\""
        },
        "154112":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "\"15 Mutton & Tomato Juice\"",
                "\"20 Mutton & Blueberry Juice\""
            ],
            "content":"<div class=\"\"><div> <span>\"I'll make a mutton &amp; juice for you &amp; your yum-i mean your little sister of yours. And how  many mutton that you want me to make? And also which kind of juice do you really wants?\" ask Mary to Rose &amp; Little Sparrow.<br>\r\n<br>\r\nThen Rose began to answers to Mary \"Me &amp; my little sister want....\"</span></div></div>",
            "created":1431752400,
            "id":1978846,
            "title":"\"Mutton & Juice\""
        },
        "1542":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Near the Chocolate River",
                "In the Experimenting Room",
                "There may be no need for looking. Rose hears a nearby groan..."
            ],
            "content":"<div class=\"\"><div> <span>She could go to a place where she could easily provide food and drink for herself and Little Sparrow. <br>\r\nDespite her strong belief that something would happen, nothing happened. <br>\r\n\"Well, that was a waste of five gold! Come on Little Sparrow, we're going to bed.\", said Rose angrily, storming off in the direction of their little shack. Throwing herself down onto her bed, Rose spent a good five minutes silently cursing the magic box and mocking Murgo. <br>\r\n<br>\r\nWaking up during the night to a bright light, Rose turned around groggily. <br>\r\n\"What...\" was all she could say before Little Sparrow and she were transported away from their shack. <br>\r\n<br>\r\nOnce again, Rose woke up. Looking around, she noticed a distinct lack of Little Sparrow and their shack. <br>\r\n\"So it wasn't a dream. Maybe... I can provide here\", Rose shouted happily. Her joy was short-lived, as she remembered Little Sparrow was missing. <br>\r\n\"But first, I have to find my sister. I can't provide for myself while she starves somewhere\".<br>\r\nRose looked around, shouting for her sister. After receiving no answer, she decide to look...</span></div></div>",
            "created":1400648400,
            "id":1799905,
            "title":"The Chocolate Factory exists during any time..."
        },
        "15422":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "She began to expand again. ",
                "She heard a nearby groan..."
            ],
            "content":"<div class=\"\"><div> <span>There was a nearby chocolate river, which looked nice, but Little Sparrow didn't like chocolate, so Rose didn't bother looking there. The Experimenting Room was an interesting area, as Little Sparrow was always experimenting. There was the time she had almost blown up their shack by mixing some silvery metal and water. Deciding that the Experimenting Room was the best choice, Rose headed off in its general direction. <br>\r\n<br>\r\nComing upon the door to Experimenting Room, Rose was disappointed to see that it was closed. Her sister never closed doors behind her, unless...<br>\r\nUnless she was in danger! Rose yanked open the door, calling for Little Sparrow. She got no answer. Turning to leave, Rose was surprised to see that the door had disappeared. <br>\r\n\"Well, I'm not leaving\", Rose said to herself. <br>\r\nHaving a look around, Rose saw a number of weird things. There was a tank filled with small balls. There were some sheep with pink wool. On one occasion, Rose thought she saw a little man with green hair but when checking out the area, she found nothing. <br>\r\n<br>\r\nBut the most interesting machine was a giant machine with a button on it. Pushing the button, the machine made a couple of whirring noises, extended outwards a little and produced...<br>\r\nA stick of blue... stuff. (Gum didn't exist at this point.)<br>\r\nPulling it out, Rose eyed it over. She didn't really want to do anything with it, but it looked edible and Rose was very hungry. Licking it, she was surprised to find out that it tasted like a blueberry that the gypsies Little Sparrow and she visited over the Winter. <br>\r\nShe popped the entire thing in her mouth. <br>\r\n<br>\r\nThe first bite was heaven! Some sort of tomatoey taste ran down her throat, before changing to potatoes and a beef tasting liquid. Rose was still chewing at this point, as it changed for a final time. It now tasted like blueberry pie and some cold taste she couldn't identify. As she continued chewing, Rose couldn't see her nose turning a deep violet colour. She didn't notice as the violet hue took over her entire body. <br>\r\n<br>\r\nStill chewing, Rose started feeling a little bloated. Passing it off, Rose had another look around the Experimenting Room. As she walked, she found it harder and harder to walk, eventually waddling. Looking down, Rose screamed. <br>\r\nHer belly had pushed out from underneath her clothes and was a deep violet colour. Looking over her hands, they were also deep violet. Waddling as fast she could, Rose started shouting for help. All the while, she was attempting to push her belly back, but it fought back. And it was winning. Her breasts joined in the fun, and started to strain the top half of her clothes. <br>\r\n<br>\r\nEventually, the growth stopped. But Rose wasn't happy. She was deep violet and she looked pregnant! Her belly looked like she was 9 months pregnant with twins and her breasts looked like a ball she had once found. The ball was pretty big, which didn't bode well for her. <br>\r\nRose was having trouble moving, as her thighs had no room between them and rubbed get her when she walked. <br>\r\nHappily, she spied the door and waddled towards it as fast as she could. But before she got to the door...</span></div></div>",
            "created":1400734800,
            "id":1800515,
            "title":"In the Experimenting Room"
        },
        "154221":{
            "author_id":"sparksalot",
            "author_name":"Reneg4de",
            "choices":[
                "Someone stopped her. ",
                "She rolled into something. "
            ],
            "content":"<div class=\"\"><div> <span>Waddling as fast as she could, Rose was almost at the door when her body started groaning. <br>\r\n\"Oh no...\" was all she got to say before she began to expand again. <br>\r\nHer already huge body bloated. Her arms and legs began to expand. Rose's body began to look spherical, but she could still move. Waddling as best she could, Rose stopped when her top started to rip. Her pants also ripped from the strain of trying to contain her massive legs and ass. Her belly was a ball with two other balls lying on top. <br>\r\n<br>\r\nBy this point, Rose was unable to move as her legs were slowly being sucked into her spherical body. Her arms were suffering from the same problem. She flapped her arms frantically, trying to roll her huge body. <br>\r\nShe did manage to roll, but not in the right direction. She rolled backwards, away from the door. Rose opened her mouth to scream, but was stunned when it hit off the floor. Slightly dazed and beginning to get dizzy, Rose could do nothing as she rolled around the room. She hit off things, but it didn't hurt. <br>\r\nShe finally came to a stop when...</span></div></div>",
            "created":1400821200,
            "id":1800867,
            "title":"She began to expand again. "
        },
        "1542211":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><div> <span>\"Huh? What the? I'm stop falling. Is someone there? Are you the one stop me from falling?\" said Rose as she wobble around as the juice insside of her and saw someone that save her life was Little Sparrow as she was smile to see Little Sparrow.<br>\r\n<br>\r\nIt was Little Sparrow that save blueberry Rose from fall and Little Sparrow gender was....</span></div></div>",
            "created":1400821200,
            "id":1800873,
            "title":"Someone stopped her. "
        },
        "15422112":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Fruit Room",
                "Juicing Room"
            ],
            "content":"<div class=\"\"><div> <span>Female Sparrow look at her big sister Rose became a blueberry girl. <br>\r\n<br>\r\nThen Rose said to Sparrow \"I'll explained later, Sparrow. But now you have to help me return me back to normal.\"<br>\r\n<br>\r\nThen Sparrow agree to Rose as she began to push Blueberry Rose to find to make her back to normal, until she saw two room are Fruit Room and Juicing Room.<br>\r\n<br>\r\nThen Female Sparrow began to choose......</span></div></div>",
            "created":1409806800,
            "id":1852380,
            "title":"Female"
        },
        "155":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Page (Fable III)",
                "Linda (Fable III)",
                "Much more Fable girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two female characters from Fable Series.</span></div></span></div>",
            "created":1401080400,
            "id":1802825,
            "title":"Next Fable Female"
        },
        "1551":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Weight Gain",
                "Expansion",
                "Full Body Inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are three expansion for Page from Fable III.</span></div></span></div>",
            "created":1401080400,
            "id":1802827,
            "title":"Page (Fable III)"
        },
        "15511":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Eating",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two of weight gain for Page from Fable III.</span></div></span></div>",
            "created":1401944400,
            "id":1807506,
            "title":"Weight Gain"
        },
        "15512":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "TransForm",
                "Hourglass Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two expansion for Page from Fable III.</span></div></span></div>",
            "created":1401080400,
            "id":1802929,
            "title":"Expansion"
        },
        "1552":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Weight Gain",
                "Expansion",
                "Full Body Inflation"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are three expansion for Linda from Fable III.</span></div></span></div>",
            "created":1401080400,
            "id":1802829,
            "title":"Linda (Fable III)"
        },
        "15521":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Eating",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of weight gain for Linda from Fable III?</span></div></span></div>",
            "created":1401598800,
            "id":1805473,
            "title":"Weight Gain"
        },
        "15522":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry Expansion",
                "Butt expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which kind of expansion for Linda from Fable III?</span></div></span></div>",
            "created":1401598800,
            "id":1805474,
            "title":"Expansion"
        },
        "1553":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Briar Rose (Fable)",
                "Geraldine (Fable III)",
                "One more Female of Fable Series"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two female from Fable Series to choose.</span></div></span></div>",
            "created":1403240400,
            "id":1814916,
            "title":"Much more Fable girl"
        },
        "15531":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Expansion",
                "Weight Gain"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two expansion for Briar Rose from Fable and Fable: The Lost Chapter to choose.</span></div></span></div>",
            "created":1403240400,
            "id":1814918,
            "title":"Briar Rose (Fable)"
        },
        "155311":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Transform",
                "Butt Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two expansion for Briar Rose from Fable and Fable: The Lost Chapter to choose are: Transform (half-human half-animal) and Butt Expansion</span></div></span></div>",
            "created":1403240400,
            "id":1814925,
            "title":"Expansion"
        },
        "155312":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Magic",
                "Eating"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two weight gain for Briar Rose from Fable and Fable: The Lost Chapter to choose.</span></div></span></div>",
            "created":1403240400,
            "id":1814924,
            "title":"Weight Gain"
        },
        "15532":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Weight Gain",
                "Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two expansion for Geraldine from Fable III to choose.</span></div></span></div>",
            "created":1403240400,
            "id":1814917,
            "title":"Geraldine (Fable III)"
        },
        "155321":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Eating & Drinking",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two weight gain for Geraldine from Fable III to choose.</span></div></span></div>",
            "created":1403240400,
            "id":1814921,
            "title":"Weight Gain"
        },
        "155322":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry Expansion",
                "Full Body Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two expansion for Geraldine from Fable III to choose are: Blueberry Expansion and Full Body Expansion.</span></div></span></div>",
            "created":1403240400,
            "id":1814919,
            "title":"Expansion"
        },
        "15533":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Lady Sophia (Fable: TLC)",
                "Amanda Grey (Fable: TLC)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here are two more girl of Fable Series left are: Lady Sophia (Fable: The Lost Chapter) and Amanda Grey (Fable: The Lost Chapter).</span></div></span></div>",
            "created":1403240400,
            "id":1814948,
            "title":"One more Female of Fable Series"
        },
        "155331":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Weight Gain",
                "Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose weight gain or expansion for Lady Sophia from Fable: TLC.</span></div></span></div>",
            "created":1403240400,
            "id":1814949,
            "title":"Lady Sophia (Fable: TLC)"
        },
        "1553311":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Eating and Drinking",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose one of two weight gain for Lady Sophia from Fable: TLC.</span></div></span></div>",
            "created":1403240400,
            "id":1814955,
            "title":"Weight Gain"
        },
        "1553312":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Blueberry Expansion",
                "Full Body Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose one of two expansion for Lady Sophia from Fable: TLC.</span></div></span></div>",
            "created":1403240400,
            "id":1814954,
            "title":"Expansion"
        },
        "155332":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Weight Gain",
                "Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose Weight Gain or Expansion for Lady Grey sister: Amanda Grey from Fable: TLC.</span></div></span></div>",
            "created":1403240400,
            "id":1814950,
            "title":"Amanda Grey (Fable: TLC)"
        },
        "1553321":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Eating",
                "Magic"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose one of two weight gain for Lady Grey sister: Amanda Grey from Fable: TLC.</span></div></span></div>",
            "created":1403240400,
            "id":1814953,
            "title":"Weight Gain"
        },
        "1553322":{
            "author_id":"jonwii",
            "author_name":"speechjon",
            "choices":[
                "Pregnant",
                "Breast Expansion"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Choose one of two expansion for Lady Grey sister: Amanda Grey from Fable: TLC.</span></div></span></div>",
            "created":1403240400,
            "id":1814952,
            "title":"Expansion"
        }
    },
    "info":{
        "author_id":"jonwii",
        "author_name":"speechjon",
        "brief_description":"Pick your expansion on all of your favorite girl from Fable Series from Microsoft.",
        "created":1366267500,
        "description":"<td align=\"left\" class=\"norm\">Here a rule for all of you.<br>\r\nAlso the first Fable Expansion Story that i've made.<br>\r\n<br>\r\n-Female only.<br>\r\n-Weight Gain (Eating, Magic, etc).<br>\r\n-Expansion (Blueberry, Fruit, Full Body, Breast, etc).<br>\r\n-Male aren't going to gain weight or expansion, but they will be in it.<br>\r\n-Magic is Allow.<br>\r\n-Transform include Half human, Half Animals only.<br>\r\n-Sex is allow.<br>\r\n<br>\r\n<br>\r\nHere some that aren't allow.<br>\r\n<br>\r\n-No Suddenly Weight (Hero of Brightwall gain 10,000lbs).<br>\r\n-No TG.<br>\r\n-No Death.<br>\r\n<br>\r\nIf you don't know what Fable (Video game series from Microsoft is)? Then go at <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://fable.wikia.com/\" target=\"_blank\">http://fable.wikia.com/</a> to learn about it.<br>\r\n<br>\r\nYou can add a chapter if you choose any of kind of expansion or weight gain, you want or think of something.</td>",
        "id":1929566,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1551500940,
        "modified":1551500940,
        "pretty_title":"Fable Female Expansion & WG"
    }
}