{
    "chapters":{
        "1":{
            "author_id":"pieguy",
            "author_name":"Pieguy",
            "choices":[
                "The mission begins...."
            ],
            "content":"<div class=\"\"><div> <span>Sandra Shaggington was out shopping when she recieved an urgent SMS.<br>\r\n\"Agnt 69, pls rprt 2 HQ at 1ce. It is an mrgncy.\"<br>\r\nQuickly she ran to the nearest phone booth and punched in her ID, and was immediately warped to the headquarters of SFSA.<br>\r\n\"Agent 69, it has come to our attention that HECISB is planning to use a new weapon, the Bikinifier, to turn all clothing into skimpy bikinis. Now, sexy as that may be for girls like us, the men will look really weird and we can't have that,\" her boss, Agent 1 said upon her arrival. \"Now. We've had our chem girls develop a secret weapon for use against the HECISB- the Invisibility Potion.\"<br>\r\nShe held up a flask filled with a clear liquid.<br>\r\n\"So, it'll turn me invisible?\" Agent 69 said.<br>\r\n\"Yes. But.... but there are two flaws. First, it only lasts two minutes.\"<br>\r\n\"Hmm, I can see how that would be a problem...\"<br>\r\n\"It gets worse. The potion only works on the human body, not clothing. In order to successfully carry out your mission, you'll have to strip naked, then take the potion.\"<br>\r\nAgent 69 blushed momentarily, then regained her composure.<br>\r\n\"Anything for the sake of not having to see men in bikinis.\"<br>\r\nAgent 1 nodded. \"Exactly. Now. I trust you have your spy gadgets in your all-purpose backpack?\"<br>\r\nAgent 69 nodded.<br>\r\n\"Good. We'll warp you to the outside wall of the HECISB compound. Good luck, Agent 69.\"</span></div></div>",
            "created":1147245840,
            "id":317881,
            "title":"The Potion"
        },
        "11":{
            "author_id":"pieguy",
            "author_name":"Pieguy",
            "choices":[
                "Take the potion",
                "Climb the wall"
            ],
            "content":"<div class=\"\"><div> <span>Agent 69 materialised in the shadow of the HECISB compound's outer wall. She could see that there was a gate nearby, but also that it was possible to climb the wall using her grappling hook. She nibbled her lip anxiously. She had two options. She could,<br>\r\na) Fire her grappling hook at the wall and climb up. This would take a while though, and she would easily be spotted by searchlights.<br>\r\nb) Take a swig of the potion and slip through thge gate unnnoticed.<br>\r\nBut the trouble with this was the nudity thing, what to do with her spy gear and what if the potion wore off while she was halfway there?<br>\r\n<br>\r\nOn careful deliberation, she decided to....</span></div></div>",
            "created":1147246200,
            "id":317882,
            "title":"Outside the Wall"
        },
        "111":{
            "author_id":"pieguy",
            "author_name":"Pieguy",
            "choices":[
                "She makes it",
                "She is caught"
            ],
            "content":"<div class=\"\"><div> <span>Agent 69 crept as close to the gate as she dared, thyen took a small sip of potion. Her body tingled and she turned completely invisible. Quickly she stripped, stuffed the clothing and potion into her backpack and warped it over the wall. It was cold, she was naked, but she had no other choice. She held her breath and padded round the corner, through the gate and round the other side, where she found the backpack in the darkness. (The potion had the unexpected side effect of night vision.) She sat down, gasping with relief as the potion wore off and she became very visible again. Quickly she redressed and took a breather while considering what to do next. Ok, she'd made it inside the wall. But she still had to get in the building itself. She couldn't warp in- her portable warping device only worked on inanimate objects. She could see that the place was completely covered with motion sensors- so she couldn't get in through a window or anything like that.<br>\r\nShe sighed. She would have to use the potion again.<br>\r\nFirst things first, though. She accessed blueprints of the building from the SFSA database and located a small supply closet near the front entrance. She memorised its location, then sipped the potion, stripped naked, warped her gear into the closet and ran across the lawn towards the building.</span></div></div>",
            "created":1147246980,
            "id":317884,
            "title":"Casing the Joint"
        },
        "1111":{
            "author_id":"pieguy",
            "author_name":"Pieguy",
            "choices":[
                "Find it on her own",
                "Ask for directions"
            ],
            "content":"<div class=\"\"><div> <span>Agent 69 sprinted up the hill and slipped in among a group of HECISB agents. She quickly ducked into the supply closet just as she became visible again.<br>\r\nOne problem.<br>\r\nWrong closet.<br>\r\nShe said a whole group of words that really shouldn't be repeated, suffice to say that they weren't \"oh dear\".<br>\r\nWhat the HELL was she to do now?<br>\r\nShe was naked, she had no equipment and she was perfectly visible. She had to get to that other closet. Just then, she heard footsteps. She opened the door and saw a lone HECISB agent approaching.<br>\r\nAgent 69 grabbed her and pulled her into the closet. She beat up the enemy agent, stole her bikini, came out of the closet and shuddered at the childish pun.<br>\r\nThe bikini was ill-fitting and very uncomfortable, but it would have to do.<br>\r\nNow, how to get to that other closet?</span></div></div>",
            "created":1147251900,
            "id":317892,
            "title":"Coming Out Of The Closet"
        },
        "11112":{
            "author_id":"pieguy",
            "author_name":"Pieguy",
            "choices":[
                "It was.",
                "It wasn't."
            ],
            "content":"<div class=\"\"><div> <span>Just then, a HECISB agent passed by.<br>\r\n\"Excuse me, how do I get to Supply Closet 31A?\"<br>\r\n\"Well, it's just down the.... wait a minute, YOU'RE NOT AGENT 241!\" the enemy agent screeched.<br>\r\nAgent 69 immediately sprinted off, with the enemy in hot (and I do mean hot) pursuit. \"Intruder! SECURITY!\" the enemy yelled. Agent 69 had to get her off her tail. She hated to do it, but...<br>\r\nShe undid the clasp on the bikini top and threw it into the agent's path. \"STO-oooooop!\" she yelled as she slipped on the top and fell to the ground. Agent 69 barrelled on down the hall. Just then, a whole group of enemy agents rounded the corner behind her and started gaining fast.<br>\r\nAgent 69 REALLY hated to do it, but...<br>\r\nShe untied both strings on the bikini bottom, which fell to the ground behind her. The lead pursuer wiped out on it, followed by the others tripping over her in a spectacular chain-reaction you really had to see to believe.<br>\r\nAgent 69, meanwhile, sprinted naked down the next hall, ducked into a closet and shut the door, panting and praying that this was the right one.<br>\r\n<br>\r\nWell, was it?</span></div></div>",
            "created":1147253040,
            "id":317893,
            "title":"The Chase"
        },
        "111121":{
            "author_id":"pieguy",
            "author_name":"Pieguy",
            "choices":[
                "Into the Control Chamber"
            ],
            "content":"<div class=\"\"><div> <span>Agent 69 almost wept with relief. There, against the far wall, was her backpack with her clothes, gadgets and the potion.<br>\r\n\"Attention all agents. Attention all agents. Be on the lookout for a suspicious character, believed to be a SFSA spy. Suspect is nude, I repeat, unclothed,\" a cool female voice said over the loudspeaker.<br>\r\nAgent 69 said a few more unprintable words. What to do, what to do? If she went out fully dressed, she'd stick out like dogs' nuts. If she went out nude, everyone would be on the lookout for her. She had no bikini with which to disguise herself. She sighed. Potion time again.<br>\r\nShe decided to leave her gear in this closet, now that she'd memorised the location. First she called up the blueprints on the screen. Oh, what luck! The supply closet was right down the hall from the central control centre where she suspected they were holding the Bikinifier.<br>\r\nShe steeled herself and took the potion.<br>\r\n<br>\r\nThe closet door opened and closed as the barely-audible footsteps made their way down the hall.</span></div></div>",
            "created":1147336500,
            "id":318053,
            "title":"Luckiness Abounds"
        },
        "1111211":{
            "choices":[
                "She stays in the room gaining a better look at the security messures",
                "She goes throu the room as soon as possible."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She is in shock to realize that inside the control room and beyond (as in all high security areas) the guards are naked men.</span></div></span></div>",
            "created":1168501260,
            "id":372684,
            "title":"HECISB male guards"
        },
        "11112111":{
            "author_id":"pieguy",
            "author_name":"Pieguy",
            "choices":[
                "She makes it in the nick of time.",
                "She doesn't make it in time, and everyone can see her in the nick."
            ],
            "content":"<div class=\"\"><div> <span>Agent 69 looked at the large array of naked men with bemusement, considering that the name \"Hot Evil Chicks in Sexy Bikinis\" doesn't really imply that there might be dudes involved, particularly nekkid ones. She diverted her eyes from the men to look at the vast array of surveillance cameras on the walls, all of which were looking right through her.<br>\r\nShit! Two minutes were almost up! She sprinted for the far door.</span></div></div>",
            "created":1175278320,
            "id":394028,
            "title":"Reconnaissance"
        },
        "111121111":{
            "choices":[
                "She took more of the potion to search the control room in detail",
                "She save the potion for later and fights the remaining 2 men hand to hand"
            ],
            "content":"<div class=\"\"><div> <span>Sandra, the agent 69 has only seconds to make it to the empty next room where she had warped the potion.    Right before she could walk through the door, one of the men stood in her way, distracted reading a chart with notes.   <br>\r\nSandra hesitate for a second and looked around, but there was no other place to go.  She had to find a way to make this big man move.   Seeing he was relaxed and distracted and knowing her invisibility would grant him no prenotice of her attack she launched her best shot.<br>\r\nThe other 2 men in the room turn to look at his colleague when he felt on his knees, his hands holding his naked testicles.  He was in so much pain he could not speak.<br>\r\nSandra was hearing his groans from the other room, sitting in the floor behind a desk and rubbing her sore right foot.   <br>\r\nWhen his cries turn to deep panting She stood up, the potion in her hand and looked the image of her magnificent body in a wall mirror.   The potion was running scarce and the men were only 2.</span></div></div>",
            "created":1194077700,
            "id":460007,
            "title":"She makes it in the nick of time."
        },
        "1111211112":{
            "choices":[
                "Sandra wakes up in a glass case",
                "Sandra wakes up in public"
            ],
            "content":"<div class=\"\"><div> <span>Sandra  drew back her arm and shot a quick punch into the first, she drew back her arm, about to punch and-she became visible. Seeing her now, the man grabbed her breasts and squeezed. Enraged, agent 69 kicked him, but he grabbed and tickled her bare feet. Distracted, she was overcome by backup.<br>\r\n<br>\r\nShe began to run, but she tripped. She was grabbed and hoisted away as one man felt her up from behind. THis was not her day. Now she knew why they were naked at least.</span></div></div>",
            "created":1233007020,
            "id":639119,
            "title":"She save the potion for later and fights the re..."
        },
        "111121112":{
            "choices":[
                "The boss is really a man, and his machine will make all women naked forever.",
                "She  is parlyzed and felt up some more."
            ],
            "content":"<div class=\"\"><div> <span>Sandra ran. and ran. But then she felt it. She tried to run, but at that moment, she was visible. The man behind her instantly grabbed her around the waist and began to feel her up, whie another began to tickle her bare feet.<br>\r\n<br>\r\nAs they carted her off in a sea of arms and groping appendages, she overheard something about a \"Permanent nakedness\" machine.<br>\r\n<br>\r\n</span></div></div>",
            "created":1240245060,
            "id":678999,
            "title":"She doesn't make it in time, and everyone c..."
        },
        "111122":{
            "choices":[
                "Trie and escape.",
                "Give up."
            ],
            "content":"<div class=\"\"><div> <span>She rushed in and closed the door behind her, unfortunately it wasnt the right door. She was thruted into a large chamber, where a pair of mechanical arms began to feel her up, creating a graph of her bodily features and characteristics. She tried to leave, but they tickled her. <br>\r\n<br>\r\nOnce she was out, an outfit was put ton her. Instantly it burned away into nothingness.<br>\r\nThe screen said in big letters\"Nudity complete\"<br>\r\nShe almsot screamed as she realized what this meant.</span></div></div>",
            "created":1240245240,
            "id":679001,
            "title":"It wasn't."
        },
        "1112":{
            "choices":[
                "They have fun with her.",
                "They bring her up to a cell.",
                "They do something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She hears an alarm go off. Instantly she becomes visiible. She trieds to coever up, but it is no use. Beams of light attach to her and pull her like puppet strings.</span></div></span></div>",
            "created":1240245360,
            "id":679002,
            "title":"She is caught"
        },
        "112":{
            "author_id":"pieguy",
            "author_name":"Pieguy",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It's too risky to use the potion, she thought. She fired her hook and started up the wall.<br>\r\nUnfortunately, the wall was electrified to guard against intruders.<br>\r\nShe wasn't wearing insulated shoes.</span></div></span></div>",
            "created":1147246320,
            "id":317883,
            "title":"Shocking End"
        }
    },
    "info":{
        "author_id":"pieguy",
        "author_name":"Pieguy",
        "brief_description":"Agent 69 must take an invisibility potion to defeat the forces of evil!",
        "created":1147245060,
        "description":"<td align=\"left\" class=\"norm\">Agent 69 is a hot superspy working for the SFSA- Sexy Female Spy Agency. She is called to test a new invisibility potion in a mission against the HECISB- Hot Evil Chicks in Sexy Bikinis. Can she do it?<br>\r\n<br>\r\nNudity, yes. Sexual content of any kind, no.</td>",
        "id":1104247,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1240245360,
        "modified":1240245360,
        "pretty_title":"Agent 69 and the Invisibility Potion"
    }
}