{
    "chapters":{
        "1":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Main Story",
                "Boy Series1-3",
                "Girl Series 1-3",
                "The Curina Pokédex",
                "Gym Leaders"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.5;\">Greetings, fellow trainers.  Professor Hickory here, again.<br>\r\nI thought I might inform you of the starter Pokemon I have available here at my lab!<br>\r\n<br>\r\n#001 Leafbon<br>\r\nGrass Type<br>\r\nAttacks:<br>\r\nTackle (Normal Type)<br>\r\nA physical attack in which the user charges, full body, into the foe.<br>\r\nDefense Curl (Normal Type)<br>\r\nThe user curls up to conceal weak spots and raise its DEFENSE stat.<br>\r\nLeech Seed (Grass Type)<br>\r\nA seed is planted on the foe to steal some HP for the user on every turn.<br>\r\n<br>\r\n#004 Freery<br>\r\nFire Type<br>\r\nAttacks:<br>\r\nTackle (Normal Type)<br>\r\nA physical attack in which the user charges, full body, into the foe.<br>\r\nDefense Curl (Normal Type)<br>\r\nThe user curls up to conceal weak spots and raise its DEFENSE stat.<br>\r\nEmber (Fire Type)<br>\r\nThe foe is attacked with small flames. The foe may suffer a burn.<br>\r\n<br>\r\n#007 Starckler<br>\r\nWater Type<br>\r\nAttacks:<br>\r\nTackle (Normal Type)<br>\r\nA physical attack in which the user charges, full body, into the foe.<br>\r\nGrowl (Normal Type)<br>\r\nThe user growls in a cute way, making the foe lower its ATTACK stat.<br>\r\nBubble (Water Type)<br>\r\nA spray of bubbles hits the foe. It may lower the foe’s SPEED stat.<br>\r\n<br>\r\nWell,  that's all I have left to tell you, I suppose!  Below, you may choose from the following:<br>\r\nMain Story:  Follow Ash Ketchum and his friends through a legendary journey through the Curina Region!<br>\r\nBoy and Girl Series 1-3:  Start your own Pokemon journey!  Choose your Pokemon partner and solve the mysteries of Curina, as well as defeat the infamous Team Nuclear!<br>\r\nThe Curina Pokedex:  View the Curinadex and raise your knowledge of the region's Pokemon inhabitants.  <sub>Author's Note:  On my free time, I will get to spriting these!  So don't get your panties in a twist, 'kay?  All fakemon are accepted!</sub><br>\r\nGym Leaders:  Get information on the region's Gym Leaders and other characters!</span></span></div></div>",
            "created":1306731600,
            "id":1116647,
            "title":"Stories Of Curina"
        },
        "11":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Leafbon",
                "Freery",
                "Starckler",
                "Team Nuclear visits"
            ],
            "content":"<div class=\"\"><div> <span>\"ASH! Where are you?!\" Yelled Dawn.<br>\r\n\"Pip! Piplup!\" Joined her blue penguin like creature, Piplup.<br>\r\nThey had been waiting half an hour for him to get back from his house. Ash Ketchum and Pikachu live in a place called Pallet Town. Pallet Town is located in the Kanto region. This was the place where the soon-to-be pokemon master started out.<br>\r\n\"Sorry, Dawn, but I got overwhelmed by all this... It feels like just yesterday I was running in my pajamas to Professor Oak's to get my first pokemon,\" Ash sighed.<br>\r\n\"Pika pika,\" Pikachu joined.<br>\r\n\"Hey, guys!\" Shouted a friendly female voice. Ash turned to see a tall girl with orange hair, short shorts,a white tee, and tennis shoes. She held a Togepi in her arms and ran up to Ash and gave him a hug.<br>\r\n\"MISTY?!\" Ash exclaimed.<br>\r\n\"I found her at the professor's!\" Brock explained.<br>\r\n\"Ash it's been waaaaaaaay too long! How's your journey?\" Misty asked.<br>\r\n\"Its okay... I've filled out four pokedexs since last time,\" he replied awkwardly.<br>\r\n\"ASH?! Ash Ketchum?!\" Yelled another voice. This time it was a boy in a hood. A strange bee creature followed him as he walked up to Ash.<br>\r\n\"Who are you?\" Ash asked.<br>\r\n\"Double T is what you can call me. I was sent here to give you something,\" Double T answered mysteriously.<br>\r\n\"Wha-\" Ash started, but was given four tickets with a picture of a heart on it.<br>\r\n\"They're to be used at Vermillion City. They'll take you somewhere magical,\" Double T explained.<br>\r\n\"But-\" Ash started, but Double T had already left.<br>\r\n\"That was... Strange...\" Brock murmured.<br>\r\nAsh looked at the tickets and read them aloud.<br>\r\n\"Take a trip to the Curina region, a region of many mysteries and magic...\" He read.<br>\r\nEveryone looked at eachother and nodded to go. They went to Ash's to bid farewell to his mom. Then Proffessor Oak's.<br>\r\n\"Curina... This is a place which I know little about...\" The proffessor said as he looked at the tickets. \"But, the proffessor there- Proffessor Hickory I think it was- sent in three pokeballs for you. One and that's it...\"<br>\r\nAsh looked at them as the proffessor explained each one.</span></div></div>",
            "created":1306818000,
            "id":1117064,
            "title":"The Start Of The Journey"
        },
        "114":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Team Rocket",
                "On The Ship",
                "Someone Is There"
            ],
            "content":"<div class=\"\"><div> <span>Before Ash could decide, there was a loud commotion coming from outside. Everyone walked outside to see what was causing the uproar.<br>\r\n\"Get back here! Your under arrest!\" Shouted officer Jenny from her motorcycle.<br>\r\n\"What's going on officer Jenny?\" Dawn asked.<br>\r\n\"These troublemakers just blew up part of the Safari Zone and took almost all the Pokémon there! Then, they blew up part of the Celadon Department Store and took all the merchandise!\" She explained.<br>\r\n\"Who are they?\" Misty asked.<br>\r\n\"Ahahaha! Don't you know?\" giggled one of the female members. The group wore black suits with knee high pink boots. The pants were short shorts. Their shirts were skin tight and covered by large lab coats. They wore safety goggles and their hats were small and had a long tail that reached down to their backs.<br>\r\n\"We are Team Nuclear!\" one of the other members joined. \"And now that you know, you can run along and tell all your little friends about us!\"<br>\r\n\"Pikachu, use Thunder!\" Ash commanded strongly. Pikachu lept in the air and curled in a ball.<br>\r\n\"Pika...CHUUUUU!\" He screamed. A flash of electricity shot out of his cheeks and electrocuted their hovercraft. There was a little smoke, but nothing else happened. They smiled at them.<br>\r\n\"Nice try. Really, it was quite a show. But, it'll take more than a mere mouse to bring us down!\" Shouted a man with the same suit, only with indigo and red. They took of and left a dark patch where they had been hovering.<br>\r\n\"We may have lost them, but my love for you will never be lost!\" Brock said as he grabbed officer Jenny's hand. She grabbed a small box and pushed it against him and there was a popping sound.<br>\r\n\"NYA! Maybe later then...\" He choked out.<br>\r\n\"Don't touch me or all taser you again!\" She growled, then she drove away.<br>\r\nProfessor Oak was by the dark patch. He wore white gloves and rubbed the blackened and withering grass and flowers.<br>\r\n\"This is nuclear refuse... Highly toxic, but can be used as an efficient way to use alternate fuel...\" He explained solemnly. \"Well, you better get going to Curina.\"<br>\r\n\"What about the Pokémon?!\" Ash exclaimed.<br>\r\n\"... I'm sure you'll find them there. Now, go! Those tickets expire soon!\" He insisted. The group left and headed for Viridian and weaved through the Viridian forest, then through Pewter city where Brock said hi to his family,  got a little lost in Mt. Moon, then through Cerulean where Misty picked up Starmie and Psyduck, down through Saffron, and finally stopped at Vermillion City port. There was a huge mass of people there waiting to get aboard the cruise ship to Curina.</span></div></div>",
            "created":1306818000,
            "id":1117331,
            "title":"A Visit From Team Nuclear"
        },
        "1141":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "They Explore The Arena",
                "They Go To Their Cabins To Rest",
                "They Go To The Water Park"
            ],
            "content":"<div class=\"\"><div> <span>\"Look! Its the twerp!\" Whispered a man with blue hair.<br>\r\n\"Not just him, its the other ones too! And the other girl!\" Whispered a girl with red/violet hair.<br>\r\n\"Don't you think its kinda strange that where ever we go, they always seem to be in the same place?\" Asked a cat like creature with a little gold emblem on his head.<br>\r\n\"WOBBEFETTE!\" Shouted a blue creature with a black tail.<br>\r\n\"Well, we got this job fair' n' square! They can't blast us away for working,\" the blue haired man stated.<br>\r\n\"Shut up James! Or they'll hear you!\" The girl hissed.<br>\r\n\"Jessie, I don't think hiding in a barrel was a smart idea...\" James murmured.<br>\r\n\"Why?\" She asked.<br>\r\nThe barrel began to shake and then it popped.<br>\r\n\"There you are!! I've been looking for you two!! Now GET BACK TO WORK!\" Shouted a fat man in a captain's uniform.<br>\r\n\"Eighty, eye! Captain,\" they yelled as they quickly started mopping the deck.<br>\r\nAfter an hour of mopping and scrubbing and shoving Wobbafett in his pokeball about two hundred more times, they sat down and rested.<br>\r\n\"Well done! I can see my face in the wood!\" Squealed a girl with brown short shorts and a light blue tee-shirt. She gave them all lemonades and gave the pokemon food. She also gave them five dollars.<br>\r\n\"Scuse' me! Can I have a sandwich instead?\" Meowth asked.<br>\r\n\"Goodness! Are you from Curina?\" She asked as she poked at him.<br>\r\n\"Uh, no. Why?\" Jessie asked.<br>\r\n\"The pokemon there are pretty special. According to legend, the pokemon there all belonged to a trainer that lived there. They grew up and learned many of her abilities, such as speaking english. A rumor also started that the pokemon there have the ability to turn a human into a pokemon!\" She explained.<br>\r\n\"A human... Into a POKEMON?!\" The trio exclaimed.<br>\r\nShe nodded. Then gave Meowth a sandwich and left.<br>\r\nLINE*LINE*LINE*THIS IS A LINE*LINE*LINE*LINE<br>\r\n\"Wow... Did you hear that lady's story?\"Ash asked his party. They nodded.<br>\r\n\"That's a little scary, knowing that could happen to somebody...\"Misty murmured.<br>\r\n\"I wonder what abilities the pokemon have!\" Dawn remarked.<br>\r\n\"I wonder what GIRLS it has!\" Brock sighed dreamily.<br>\r\n\"HELLO!\" Cried an echoey voice. The group turned to face the girl Team Rocket had been talking to. She was on a podium with a microphone.\"WHILE WE ARE HERE, I WOULD LIKE TO TAKE A MOMENT TO SHOW YOU WHAT'S ON BOARD! TO YOUR RIGHT IS THE BATTLE ARENA. TO YOUR LEFT IS TO THE INSIDE OF THE SHIP. BEHIND YOU IS A BEAUTY SALON AND A GIFT SHOP. AND BEHIND ME IS A WATER PARK. ENJOY YOUR STAY ON THE FIRST RIDE ON THE S.S.MARIA!\" She said happily.</span></div></div>",
            "created":1306904400,
            "id":1117742,
            "title":"Team Rocket"
        },
        "11411":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Pikachu",
                "Butterfree"
            ],
            "content":"<div class=\"\"><div> <span>\"Blastoise, use Hydro Pump!\" Shouted a boy.<br>\r\n\"Emboar, dodge it and use Heat Crash!\" Shouted another boy.<br>\r\nA wave of heat surounded the stadium and the ground crumbled due to the impact of the heat and Blastoise was sent soaring through the air. It landed with a crash at the other end of the ship.<br>\r\n\"Blastoise is unable to battle! The winner is Emboar!\"<br>\r\n\"Nice job, Pignite!\" The trainer cried as the pokemon ran up to him.<br>\r\n\"Pignite? That's a Emboar!\" Ash exclaimed.<br>\r\n\"I evolved it! But now look,\" the trainer explained as he gave the pig pokemon a rock. It shrank and lost it's flaming maine.<br>\r\n\"WHOAH! What is that?!\" Misty asked astonishly.<br>\r\n\"Its a de-evolution stone. Only found in Curina!\" He explained happily as he hugged the pokemon.<br>\r\n\"ASH! I challenge you to a battle!\" Shouted a happy female voice. The group turned to see a girl wearing a grey jacket, long bell bottom pants, and tennis shoes. Her hair was a light shade of brown, she had a few freckles, and grey eyes.<br>\r\n\"Who are you?\" Dawn asked.<br>\r\n\"If you beat me, I'll tell you,\" she giggled.<br>\r\n\"OKAY!\" Ash replied. \"One on One!\"<br>\r\n\"That's what I was hopping you would say...\" She replied.<br>\r\n\"Go! Butterfree!\" She shouted as she threw her pokeball.<br>\r\n\"Pika-bee!\" Pikachu whined.<br>\r\n\"Alright, buddy, go get'em!\" Ash smiled.<br>\r\nPikachu jumped of his shoulder and jolted towards the arena. Butterfree sent out a purple ray at pikachu and he flew towards a horn.<br>\r\n\"What the...?!\" Ash cried.<br>\r\n\"I'm a phycic! I told Butterfree to attack!\" She hollered.<br>\r\n'I've been in this same situation before...,' Ash thought to himself. 'At one of my gym battles...\"<br>\r\n\"Pikachu, use thunder!\"<br>\r\n\"ChUuuuuuuuuuuuu!\" Pikachu cried, but the butterfly had already zoomed past to evade the attack. A mist of purple dust showered everywhere.<br>\r\n\"Pika!\" Pikachu gagged.<br>\r\n\"Poison Powder!\" Brock murmured.<br>\r\n\"C'mon! Surely this isn't the Ash Ketchum I've been hearing about!\" He girl guffawed. The Butterfree sent more waves of phycic energy to Pikachu.<br>\r\n\"Pikachu!\" Ash yelled.<br>\r\n\"Pika!!!!\" Pikachu yelled. Pikachu jumped to his feet and jumped on top of the Butterfree.<br>\r\n\"Bwee! Buta bree!\" It screeched as Pikachu clung to it's back. It flapped rappidly trying to shake him off.<br>\r\n\"THUNDER!\" Ash cried.<br>\r\n\"GROUND IT!\" The girl screamed.<br>\r\nThe Butterfree flew straight down on it's back and slammed Pikachu into the ground. A whirl of smoke billowed from every direction and a flash of electricity lit up the fog. The fog cleared and showed that the winner was-</span></div></div>",
            "created":1307336400,
            "id":1121216,
            "title":"Battle Aboard the Ship"
        },
        "114112":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "The Island Region",
                "Team Nuclear Returns!"
            ],
            "content":"<div class=\"\"><div> <span>\"Piiiiiikkkkkkaaaaaaa...\" Murmured Pikachu. He layed in a crater and water was seeping in through the cracks.<br>\r\n\"Pikachu is unable to battle! I WIN!\" Gloated the girl. \"Come on, Butterfree! Let's go show... Gen...gar...\" She said, but stopped as she saw a huge purple pokemon standing in front of her.<br>\r\n\"Gengar...\" It said angrily as it stared at her.<br>\r\n\"heh heh... I'm gonna go to my room now...\" She murmured as she walked away.<br>\r\n\"Sorry about her, she's just a battle addict. Nobody goes to her GYM, so she comes to cruises and tricks  people into battling her,\" explained the Gengar.<br>\r\n\"You just talked!\" Ash yelped.<br>\r\n\"Yes. Ke keh! Its a nifty ability I acquired from Curina, don'tcha think?\" He said laughing.<br>\r\n\"You can talk?!\" Ash repeated.<br>\r\n\"Yes. We just established that,\" the Gengar said frowning and rolling his big red eyes.<br>\r\n\"You-\"<br>\r\n\"SHUT UP!\" The Gengar shouted. \"Do you want your Pikachu all better or not?!\" He growled.<br>\r\n\"Sure...\" Ash murmured.<br>\r\nLINE*LINE*LINE*THIS IS A LINE*LINE*LINE*LINE*<br>\r\n\"My, my, my... Looks like you've met the GYM leader as well...\" Said a nice girl in a nurses outfit.<br>\r\n\"Officer Jenny?!\" Shouted the clearly confused group.<br>\r\n\"Officer? I don't know about that, but I'm Nurse Jenny! I'll get your Pikachu feeling all right in a jiff!\" Replied Nurse Jenny happily.<br>\r\n\"WOW. The first Nurse Jenny I've met...\" Sighed Dawn.<br>\r\n\"Pip ip lup!\" Sighed Piplup in unison.<br>\r\n\"Officer or Nurse doesn't matter! As long as you'll be mine!\" Brock swooned as he grasped her hand.<br>\r\n\"Yeah... I'll think on that...\" She said uneasily.<br>\r\n\"Croagunk...\" Croaked an indigo frog as it jabbed it's glowing purple fingers into Brock's side.<br>\r\n\"Ehhh... Why must love always be war for me?\" Brock groaned as the pokemon dragged him away.<br>\r\n\"Brock will never learn, will he?\" Misty sighed.<br>\r\n\"Togeprriiii!\" Squealed her pokemon that was shaped like an egg. It jumped out of her hands and went down to a hallway.<br>\r\n\"Togepi! Come back here!\" Misty shouted as she ran towards the childish pokemon.<br>\r\n\"Wait up, Misty!\" Ashe hollered as he followed her.<br>\r\n<br>\r\n\"Pika bee!\" Pikachu groaned as he looked over from the treatment bed.<br>\r\n\"Chan! Chan si!\" Murmured a Chansey.<br>\r\n(Entering Pokedex Translation Mode)<br>\r\n\"Ugh, that's the first time in a while that I've lost a match...\" Pikachu groaned.<br>\r\n\"Ooh, its okay. Lost of pokemon always lose to her. She's an amazing trainer,\" replied the happy Chansey.<br>\r\n\"I know... Its almost as though she could-\"<br>\r\n\"Read your mind? She can! There's a rumor going around saying that she's related to pokemon!\" Murmured Chansey.<br>\r\n\"Ya don't say?\" Replied Pikachu.<br>\r\n\"Whatcha doin, Chan Chan?\" Asked Nurse Jenny.<br>\r\n\"Chansi!\" Replied the Chansey.<br>\r\n<br>\r\n\"Toge toge prrriiii!\" Cried Togepi as it pulled a sheet off of a table and getting tangled in the sheet.<br>\r\n\"Toge PIIII\" cried Misty as she flew forward as the ship jolted forward.</span></div></div>",
            "created":1308027600,
            "id":1126205,
            "title":"Nurse Jenny"
        },
        "1141121":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Ugaria Town"
            ],
            "content":"<div class=\"\"><div> <span>\"Attention, passengers! We have arrived to Curina! Unless you want to go to the Hoen Region, I would recomend you get off now!\" Boomed a speaker.<br>\r\nAsh grabbed his things and went to the pokemon center to get Pikachu.<br>\r\n\"Hey, buddy! You feeling better?\" Asked Ash happily.<br>\r\n\"Chaaaaaa!\" He squealed.<br>\r\nThey walked away and headed off the ship. What lay before them was a magnificent landscape. It had tropical trees filled with big ripened fruit and pokemon that were eating from it. The sand was warm and soft and the grass was tall, but not too tall. Just right. The flowers were also in bloom, I might add. They were huge and had the colours of red, pink, purple, and a few times the mix of blue and green. They were just big enough for a Smoochum to take a nap in. The sun complimented all the plants very well. It was as if the sun positioned itself so it made every inch of everything to make it glow. But the ocean was probably the best feature. The waves were perfect. Not too big, not too small, not too powerful, and not too light. Just perfect. Everything looked like paradise and it made them relaxed.<br>\r\n\"Wow... This island... Is so beautiful!\" Dawn remarked with a dreamy sigh.<br>\r\n\"Yeah...\" Misty joined as she sat on the sand.<br>\r\n\"Pikachu!\" Shouted Pikachu. He jumped off of Ash's shoulder and jolted towards the ocean.<br>\r\n\"I think we should all go on break!\" Ash said as he pulled out his pokeballs.<br>\r\nOut came a Monferno, an Oshawott, a Starraptor, and a Bayleef that he picked up from the professor.<br>\r\nDawn threw hers out and out came a Mamoswine, a Togekiss, an Ambipom, a Buneary, and a Pacharisu.<br>\r\nBrock sent out Sudowoodo, Croagunk, a Geodude, a Happiny, and an Onix.<br>\r\nMisty sent out Starmie, Seaking, Phyduck, and Politoed.<br>\r\nThe pokemon roared and squealed as they ran out onto the beach.<br>\r\n\"Gengar, I've said sorry about a hundred times! How many more times do I have to say it?!\"<br>\r\nThe group turned to see the GYM leader being pulled by the ear by Gengar.<br>\r\n\"A thousand! Now, let's go! You have pokemon to tend to!\" He growled at her.<br>\r\n\"Hey!\" Ash shouted to them.<br>\r\n\"Oh, hey! Its Ash!\" Shouted the GYM leader.<br>\r\n\"Is this your friend?\" Questioned the big pokemon.<br>\r\n\"Uh, well, we battled...\" She murmured.<br>\r\n\"Let's go!\" He growled as he tugged on her.<br>\r\n\"Owowowowow! That's my good ear! I use it to hear things!\" She whined.<br>\r\n\"Wow... Its in a hurry to get out of hear...\" Misty said.<br>\r\n\"He wouldn't let her speak at all...\" Dawn added.<br>\r\n\"Pokemon like Gengar are usually very cruel, but in my perspective, I think it was just being over protective...\" Brock said.<br>\r\n\"I wonder why?\" Ash asked.<br>\r\n\"Pika pika...\" Pikachu joined.<br>\r\n\"Well I'm gonna figure out who she is weather he likes it or not!\" Ash shouted. He ran into the forest and followed them into the brush.<br>\r\n\"Ash!\" Dawn and Misty shouted in dismay as they followed him.<br>\r\n\"Looks like I'm goin with them...\" Brock sighed.<br>\r\n<br>\r\n\"Hey, wait up!\" Ash shouted as he ran to the girl and Gengar.<br>\r\n\"Gengar, please let me go! I want to talk to him!\" She pleaded.<br>\r\n\"Ke keh! Fine! But you're so stubborn!\" He growled as he turned her loose.<br>\r\n\"THANK YOU,\" she huffed. \"So, Ash! Hello!\"<br>\r\n\"Hi!\" He returned. \"Who are you?!\" He yelled.<br>\r\n\"I am the GYM leader. I do all types of pokemon. I even have a manor full of them! I live in there by the way. Its nice to have pokemon in every inch off your house because it never get's cold,\" she explained.<br>\r\n\"What about the ice type pokemon?\" He asked.<br>\r\n\"I keep them in my giant shed, which is also my refridgerator,\" she smiled.<br>\r\n\"Okay, but what's your name?\" He asked angrily.<br>\r\n\"Sigh... Come to my manor, and we'll talk. Gengar! Take me away!\" She said as the Gengar grabbed her and dissolved into a shadow.</span></div></div>",
            "created":1308114000,
            "id":1126528,
            "title":"The Strange Gym Leader"
        },
        "11411211":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Sure!",
                "I have too see the GYM leader! Maybe later."
            ],
            "content":"<div class=\"\"><div> <span>\"Whoah, that was very weird,\" Dawn huffed as she stopped to lean on a tree.<br>\r\n\"Yeah, that Gengar is VERY over protective!\" Misty growled.<br>\r\n\"If he keeps that up, we'll never get anywhere!\" Ash protested.<br>\r\nThey moved on through the forest until they made it to a small town. To the right was a giant research facility. To the left was a house. It was a very small house, but it was a house none the less. It had a small tree and a woman picking berries from it. A growlithe was curled up next to her under the tree. It perked up it's head and stared at them it stood up and walked up to them. It slowly stood on both feet and transformed into a human girl!<br>\r\n\"What the-?!\" Ash stammered.<br>\r\n\"Well, that's not a proper greeting...\" she growled. Her hair was black, as well as her pants. Her shirt was a light baby blue and she wore a pair of glasses. She also wore a white lab coat.<br>\r\n\"Er... hi...\" Ash mumbled.<br>\r\n\"My name is Hailey. I work with Professor Hickory,\" Hailey explained.<br>\r\n\"I'm Olivia!\" said the girl picking the berries. Her hair was a golden blonde with a few brownish streaks. She was up to the chin of Hailey. She wore red stilletos, a black skirt, a white shirt, and a black sash over it. She also wore glasses, but they took the shape of a rectangles.<br>\r\n\"Hi...\" the group shuddered.<br>\r\n\"What? Anthros aren't that bad...\" Olivia murmured.<br>\r\n\"You are, too?!\" Dawn squeaked.<br>\r\n\"I'm a Poliwag!\" she replied happily.<br>\r\n\"Is there more of you?\" Misty asked.<br>\r\n\"Sure! This place is full of them! Why, here comes Professor Hickory right now!\" Olivia said as she pointed to a large, dog-like creature.<br>\r\n\"An Umbreon?! Even the professor is anthro?!\" Brock said in shock.<br>\r\nThe pokemon got on both feet and turned into a woman. Her hair was bumped up and long. It was blonde and reached to her waist. All you could see that she wore was Nike tennis shoes and a lab coat. Her eyes were a deep shade of blue.<br>\r\n\"Hi Professor Hickory!\" cheered Hailey and Olivia.<br>\r\n\"Hello, girls!\" replied Hickory. \"Ash! Hello! I've been waiting for you! I need your help! Will you please help me?\" she asked.<br>\r\n</span></div></div>",
            "created":1308114000,
            "id":1126656,
            "title":"Meeting the Proffessor"
        },
        "114112111":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Something Attacks Them",
                "Capper Cave"
            ],
            "content":"<div class=\"\"><div> <span>\"I need you to go to Capper cave and pick up a Drozalisc fossil for me,\" she said.<br>\r\n\"Uh... Okay...\" Ash replied.<br>\r\n\"Good. You may be acquainted with Hailey on your journey. And on the way, take my camera and take pictures of the cave drawings. I need them for my research!\" She hollered as Ash went on his way.<br>\r\nAs they made it to the cave, a shadowed figure lay on the top of the opening.<br>\r\n\"What's that?!\" Misty asked as the figure shifted over the rocks and disappeared.<br>\r\n\"Was it a... Pokemon?\" Ash asked.<br>\r\n\"What are you looking at? I don't see anything,\" Hailey said.</span></div></div>",
            "created":1308114000,
            "id":1127007,
            "title":"To Get the Drozalisc Fossil"
        },
        "1141121111":{
            "author_id":"hawktiger5",
            "author_name":"A. Prescott",
            "choices":[
                "The Meet and Greet and the Exchange ",
                "Team Rocket strikes again"
            ],
            "content":"<div class=\"\"><div> <span>As the gang looked at the shadowy figure, and then a group of Zubats fly at them, causing everyone to duck their heads. \"Hmm, we must be close.\" Hailey spoke. Ash and Brock led the way, while Dawn and Hailey were in the back. Ash and Brock stopped when they stopped at a brightly lit area of the cave. Hailey then spoke up again, \"Here we are, Ash, the site of the Drozalisc fossil. Professor Hickory lit the area to keep the Zubats from overflooding the site. When we first found the site, This place was a den of Zubats.\" Dawn then look at the fossil and saw it was uniquely shaped. Pikachu looked around in cave and looked towards Ash and ran back to him. Hailey then looked at Brock and said, \"Would you mind to carry the Drozalisc fossil?\" Brock was about to have hearts in his eyes again, but Misty saves the day and pulls his ear and speaks for him, \"He can carry the Fossil, won't you Brock?\"<br>\r\nBrock nodded and went over to the fossil and carried it out of Capper Cave and started to head back to Ugaria Town, where Hailey noticed the Professor Hickory was have a chat with a black haired boy with a red jacket with a black shirt underneath and dark colored jeans. Hailey knew the boy who was at the age of 17. His father helped Professor Hickory find the Drozalisc fossil and then whispered to Ash, \"That is Adam Kaiser, his father help us find the Drozalisc fossil. I think you two to would get along quite nicely.\" Ash looked at Adam and then looked closer and noticed that a Growlithe was right next to where he was standing and that he had several other pokeballs. </span></div></div>",
            "created":1371013200,
            "id":1610116,
            "title":"Something Attacks Them"
        },
        "1141121112":{
            "author_id":"kirbyfan1996",
            "author_name":"Kirby",
            "choices":[
                "The group continues into the cave.",
                "Something else interrupts them."
            ],
            "content":"<div class=\"\"><div> <span>Ash stared at the rocks for a little bit longer and said, \"Never mind. We've got to get going.\" In his mind, however, he still thought <i>What was that?</i><br>\r\n<br>\r\nOut of the cave, however, came someone neither human nor Pokemon Almost everyone in the group flinched at the sight of him. He was a pink ball-shaped creature with red feet. He wore a serious and rigid countenance. He had a funny green hat and an intimidating sword. Only Hailey went forward to greet him.<br>\r\n<br>\r\n\"Hello, Kirby,\" she said. \"What brings you here?\"<br>\r\n<br>\r\nKirby brightened up immediately. \"Ah! Hailey!\" he responded. \"I'm feeling fine today. Just decided to take a look at this cave. I felt there might be something of interest in there, but, so far, I was wrong. So, who are your friends?\"<br>\r\n<br>\r\nThe group relaxed a little and introduced themselves to Kirby. They were still a little cautious by the enigmatic feel around him. For awhile, they stayed quiet. Realizing that, Ash spoke up.<br>\r\n<br>\r\n\"So, where ya from?\" he asked.<br>\r\n<br>\r\n\"Oh, I'm from a faraway planet called Pop Star,\" Kirby returned. \"I came over here to investigate the Legend of the Lost Girl of Curina.\"<br>\r\n<br>\r\nHailey broke in. \"Come on, Kirby. That's just a myth that one generation passes down to another.\"<br>\r\n<br>\r\nThe rest of the group gave a puzzled look, so Kirby explained the legend. \"Maybe that's what you believe, but there is just something about it that makes it not a common myth. Since the rest of you seem to not know it, I will explain it to you. See, there was once a girl who was one with Pokemon, able to understand what Pokemon wanted and able to explain that to other people. She was a skilled trainer, and she managed to catch the Legendary Mew with her trusted Charizard, Flame. She continued catching Legendary Pokemon to the point where there was only one not in her possession. Just as she was on the verge of catching this Pokemon, she vanished without a trace. something about that story seems suspiciously true. At least in the words of Azelf.\"<br>\r\n<br>\r\nKirby took out a poke ball and handed it over to Ash. He continued while watching the stunned Ash. \"There are unknown forces at work around, and I believe that you all need to be prepared for whatever might happen. I'm off to see what else I might find in Curina to uncover the truth to this mystery. May we meet again. Farewell.\" A star came down, and Kirby jumped on it. In a moment, he was gone.</span></div></div>",
            "created":1311829200,
            "id":1156577,
            "title":"Capper Cave"
        },
        "11411211122":{
            "author_id":"kirbyfan1996",
            "author_name":"Kirby",
            "choices":[
                "The Battle Begins",
                "Something interrupts."
            ],
            "content":"<div class=\"\"><div> <span>After a few more moments of waiting, the group moved on into the cave. The cave turned dark quickly, but the flame Hailey supplied as a Growlithe gave ample lighting for the group to progress. It had started off very wide, but ther cave got narrower and narrower the further they travelled. Eventually it began to widen again, but the path took many sharp turns afterwards. Soon, they came into a very large room already lit up well. Hailey reassumed human form and suggested that the group look around. As the group looked around, Ash noticed a strange part of the floor. <i>Wonder what that is?</i> he thought. \"WHOAAAA!!!\" he yelled as he fell down the hole.<br>\r\n<br>\r\nMisty ran over to the hole first. \"Ash Ketchum!\" she yelled. \"What have you got yourself into this time?\"<br>\r\n<br>\r\nAsh stood up. \"I'm fine. I think I'm going to take a look down here. Oh, and send Pikachu down here.\"<br>\r\n<br>\r\nPikachu immediately jumped down into Ash's hands. \"Pika! Pika!\"<br>\r\n<br>\r\nThe underpass was also well lit. Ash and Pikachu walked a bit, but came across a huge wall shortly after. \"Guess that means there's nothing this way. I guess we - WHAT WAS THAT?\" Ash noticed the shadow again. This time, however, it approached them. Ash noted that it looked somewhat like Pikachu, except it was a deep, dark shade of purple and that there was something strangely deep in its eyes.<br>\r\n<br>\r\n\"CHUUUUUU,\" it murmmered. A second figure walked closer. It was a middle-aged woman with deep, black hair and a mischievous demeanor.<br>\r\n<br>\r\n\"Hello there,\" she started. \"My name is Regina, and this is my little friend, Psychu. That's not important, though. Who are you? And how did you find my little hiding place?\"<br>\r\n<br>\r\n\"Uh, I'm Ash Ketchum, and this is Pikachu. I actually fell in through a hole, and Pikachu jumped in after me.\"<br>\r\n<br>\r\nRegina was looking more closely at Ash. She seemed to be staring at something deep inside Ash for a moment. Then she started talking again. \"Your aura... it reads the Key of Destiny...\"<br>\r\n<br>\r\n\"Key of what?\" Ash responded.<br>\r\n<br>\r\nSomething in Regina's manner became slightly more irratated. \"There are secrets in Curina meant to be discovered by the Key of Destiny. If it be so, I must bestow the Gift to him and his allies. If you are the Key of Hope, prove it to me.\"<br>\r\n<br>\r\nBefore Ash could speak darkness shrouded Regina's body. When it subsided a Mismagius was standing. \"I don't know what's going on, but I do love battling.\" Ash took out the Ball Kirby had given him. \"Let's see your strength, Azelf!\"</span></div></div>",
            "created":1312347600,
            "id":1160772,
            "title":"The Key of Destiny?"
        },
        "114112111221":{
            "author_id":"kirbyfan1996",
            "author_name":"Kirby",
            "choices":[
                "The Rest of the Group Runs In"
            ],
            "content":"<div class=\"\"><div> <span>Azelf emerged from the Ball. Immediately she came over to hug Ash. <i>Ash! It's so great to see you again!</i> she emnated.<br>\r\n<br>\r\n\"Azelf,\" Ash said, \"now's not the time for hugging. Now's the time for kicking some ass!\"<br>\r\n<br>\r\nAzelf glanced at Regina and her Psychu. <i>A battle? Alright. Although, it has been quite some time since I was last under a Trainer.</i> Azelf floated over to Pikachu. <i>You ready?</i><br>\r\n<br>\r\n\"Pika! Pika!\" replied Pikachu.<br>\r\n<br>\r\nRegina wasted no time hurling a Shadow Ball at Azelf. Ash panicked. <i>Crap!</i> he thought. <i>I don't even know what attacks Azelf knows!</i> To his suprise Azelf merely yawned before returning the attack with Mirror Coat. The counterattack was strong enough to knock Regina out. Azelf beames with pride. The Psychu, however, quickly became angry. It began to charge up for a Hyper Beam before Ash yelled, \"Pikachu use Thunderbolt on Psychu!\" The ray of pure power unleashed.<br>\r\n<br>\r\n\"PIIKAACHUUUU!\" If this battle had occured little after Ash acquired Pikachu, the pure power of Hyper Beam surely would have disintegrated the Thunderbolt. Years of experience, however, allowed it to dominate the Hyper Beam, returning it towards Psychu. It fell down quickly.<br>\r\n<br>\r\n\"That's it?\" Ash said.<br>\r\n<br>\r\nRegina stood up as human again. \"Indeed that power could only come from Pokemon who harness the power from the soul of the Key of Hope,\" she uttered.</span></div></div>",
            "created":1312434000,
            "id":1161595,
            "title":"The Battle Begins"
        },
        "1141121112211":{
            "author_id":"kirbyfan1996",
            "author_name":"Kirby",
            "choices":[
                "Ash finds a secret cavern.",
                "Ash finds a way out."
            ],
            "content":"<div class=\"\"><div> <span>\"We shall meet again shortly...,\" Regina continued as she withdrew into the shadows.<br>\r\n<br>\r\n\"Wait, come back!\" Ash yelled. But he already knew that whoever that mysterious woman was probably gone. More questions were buzzing around in his head. Who was that woman? And what is this \"Key of Destiny\" and this \"Key of Hope?\" At that moment, however, he was more worried about how dark it had become and how he could get back to the upper room.<br>\r\n<br>\r\nPresently, Ash could see a dim light from what seemed to be a very far distance. He could also hear some slow, steady footsteps. \"Hey, guys! Is that you?\"<br>\r\n<br>\r\n\"Ash?\" He could tell it was Misty's voice. \"Are you there?\" He could tell that his friends were now running toward him with the light growing a bit brighter, He proceeded to start running towards them.<br>\r\n<br>\r\n\"Coming!\" However, at that moment, an explosion came from somewhere above, and the roof of the cavern caved in, blocking the way between Ash and his friends. \"Oh, come on!\"<br>\r\n<br>\r\n\"What was that?\" echoed Dawn's voice.<br>\r\n<br>\r\n\"I don't know what's going on, but I think the roof caved in. Doesn't look like it can be broken, either.\" Ash paused for a moment and then continued. \"I'll try going further into this tunnel and see if there's a way out. Can you guys go back and find another way to get to me?\"<br>\r\n<br>\r\n\"Will do!\" Brock responded. The light grew dimmer as Ash proceeded further into the cave.</span></div></div>",
            "created":1323925200,
            "id":1240334,
            "title":"And the Cave Caves In!"
        },
        "12":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Boy Series 1",
                "Boy Series 2",
                "Boy Series 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What up, peeps?</span></div></span></div>",
            "created":1306731600,
            "id":1116655,
            "title":"Boy Series1-3"
        },
        "121":{
            "author_id":"hawktiger5",
            "author_name":"A. Prescott",
            "choices":[
                "Head to the St. Anne",
                "Meet up with Lt. Sarge",
                "Last minute checkups before leaving"
            ],
            "content":"<div class=\"\"><div> <span>Adam Kaiser was heading to Vermillion City. The day before, Adam Kaiser received a ticket to head to the. Curina Region. Adam was very excited to be heading to another region with alot more pokemon to see and more Gym Leaders to defeat. Adam was from the Unova region, but his father sent Adam to the Johto for two years, working with Professor Elm, then he moved to Kanto to be with Professor Oak. Adam wanted to be a Gym Leader and he proved his skill time after time again.<br>\r\n<br>\r\nAdam's father, Issac, a great breeder, gave Adam his first pokemon, A Growlithe. Growlithe has been loyal to Adam ever since. Then Adam received a Chramander and a Cyndaquil from both Professors and his father gave Adam a new pokemon that he knew would help him on his journey. Adam and Growlithe countinued going down Route 6 and heading into the outskirts of Vermilion City. Adam finally got out of the tall grass and entered the main city. What does Adam do now?</span></div></div>",
            "created":1371099600,
            "id":1610199,
            "title":"Adam Kaiser"
        },
        "1213":{
            "author_id":"hawktiger5",
            "author_name":"A. Prescott",
            "choices":[
                "Go to the Arena",
                "Head to his room",
                "An old friend appears"
            ],
            "content":"<div class=\"\"><div> <span>Adam went into the Pokemon Center to heal his pokemon, including Growlithe, and went over to the PC, since it was going to take some time. Adam then saw he had a message from Professor Hickory, the same professor that Professor Oak mentioned earlier when Adam was in Pallet Town. Adam opened the message and read the fine print on the computer screen. \"Greetings, Adam Kaiser, I am Professor Hickory, Pokemon Professor extraordinaire of the Curina Region, and I would like to thank you for deciding to join me on an adventure to find new pokemon in the Curina Region with me. I'll meet you in Ugaria Town. I talked to Professor Oak earlier and he told me about your love for Fire-Type pokemon, so when you get into town, I have a gift for you.\" <br>\r\n<br>\r\nAfter Adam read all of the email, he was kinda excited. Adam then went over to Nurse Joy and got his poke balls back and said, \"Thank you, Nurse Joy.\" She smiled and replied, \"Your welcome and have a great day.\" Adam exited and started heading to the pier and get on the St. Anne. Adam showed his ticket and walked on board. Adam then saw there were alot of great things to do on the boat, including a Pokemon Arena, a large pool, a sauna, and many other things. Adam let out Growlithe, his loyal buddy, and sat down in a chair to look at upcoming events and where his room is. Adam smiled that his room was in the first class section of the ship. Adam was going to thank Professor Oak when he got off the boat, but now, Adam had the chance to relax after a long time of walking. What does Adam do?</span></div></div>",
            "created":1371590940,
            "id":1613197,
            "title":"Last minute checkups before leaving"
        },
        "122":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Apologize",
                "Ignore her and go to the lab",
                "Hide your inner passion and insult her"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.5;\">           \"Garnet, Professor Hickory told me to tell you that she has a Pokemon for your birthday tomorrow.\" Garnet's mother said as she packed his bag for his up coming journey. Garnet grabbed some tea out the refrigerator. \"Alright, your bag is packed. Don't forget your Pokedex, badge case, goggles, and extra clothes.\" Garnet's mother said as she handed him a list. \"I know mom,\" Garnet growled as he headed toward his room.<br>\r\n          As he claimed the stairs, he slowly began to feel the excitement well up in his chest.  After all this time, he was finally going to be able to become a Pokemon trainer!  He jumped up into his room, fist pumping the whole way up.  He grinned, glancing out his window to snag a quick view of the Pokemon Laboratory.<br>\r\n<i>Just a few more hours and I can finally leave this crappy town...</i> he thought to himself.  <i>Well, not completely crappy...</i>  He couldn't help but grin, spotting his neighbor, Amethyst, outside playing with her little brother and their pet Eevee.<br>\r\n          Garnet and Amethyst had been neighbors for as long as he could remember.  The two of them never seemed to get along, but Garnet had always secretly admired her for some reason, despite the frequent name calling and abusive actions he received from her.  The two of them would be starting their Pokemon journey at the same time, and that made him happy.  In a way, it made him happy that the Professor had received those budget cuts and delayed his journey.<br>\r\n<div align=\"center\">***</div><br>\r\n          With the blaring of an alarm, Garnet awoke, jumping suddenly from his bed.  He winced, as he had once again been sleeping in an awkward position.  He sluggishly grabbed his bag and trudged down stairs, making his way outside to the Professor's lab.<br>\r\n           He said goodbye to his mother and exited his house, running into Amethyst. They both collapsed to the ground with a thud.</span></span></div></div>",
            "created":1380436380,
            "id":1671513,
            "title":"Garnet"
        },
        "123":{
            "author_id":"kirbyfan1996",
            "author_name":"Kirby",
            "choices":[
                "Meanwhile, from a boat coming off from the Kanto Region...",
                "A random enemy attacks the ship!",
                "Someone else is following Kirby..."
            ],
            "content":"<div class=\"\"><div> <span>After a long journey through space, the ship landed in a little known cove in the Curina Region, nearby the Kanto Region. The ship was large and impressive with enough space to carry at least one thousand passengers comfortably. It shined in the sun with magnificence.<br>\r\n<br>\r\nThe passengers disembarked shortly after. Most of them had come to see the magical Pokemon of Curina. These Pokemon were known for awesome powers, including the ability to change other beings into Pokemon. However, Kirby, the cute and lovable hero of Pop Star, as he stepped off knew he was not here for a vacation. He had heard rumors of a powerful trainer who nearly attained every single Pokemon yet somehow vanished. With suspicion in his mind over this event, he had set off to investigate.</span></div></div>",
            "created":1311829200,
            "id":1156412,
            "title":"Kirby in Curina"
        },
        "13":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Girl Series 1",
                "Girl Series 2",
                "Girl Series 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What's up, ladies?</span></div></span></div>",
            "created":1306731600,
            "id":1116660,
            "title":"Girl Series 1-3"
        },
        "131":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Leafbon, the Sapling Pokemon!",
                "Freery, the Fireball Pokemon!",
                "Starckler, the Suction Pokemon!"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.6;\">          It was a fresh March morning.  The waves crashed gently at the shores of Ugaria Town.  Krabby and Staryu scuttled across the sand as the beach began to crowd with tourists from the Kanto Region, just having arrived from the docks.  The Curina Region was waking up for the day, though many of the year's newest trainers were just a bit quicker.<br>\r\n<i>This is it!</i> thought Amethyst eagerly.  <i>The day I get my Pokemon!  I'll be the very first!</i><br>\r\n          Soon enough, the young Professor Hickory opened the doors to her lab, yawning into the sleeve of her lab coat.  Her blonde hair was ravaged, and she had specks of black oil on herself.  She had bags under her eyes as she gazed at the group of four adolescents, picking Amethyst and beckoning her to enter the laboratory.<br>\r\n\"So you're the first of this generation of trainers, hmm?\"  Hickory asked, eying the young girl curiously.  She seemed to excited to speak.  \"Very well.  You may pick from these three that I have hand picked.  You may only have one, so choose carefully...\"<br>\r\n          Amethyst looked them all over, staring at their pictures rather than their stats.<br>\r\n<i>There's Leafbon, the grass type...  Freery the fire type...  Or Starckler the water type...  Which do I choose?</i> she pondered, touching each Pokeball.</span></span></div></div>",
            "created":1370926800,
            "id":1609461,
            "title":"Amethyst"
        },
        "1313":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "She's eventually stopped by a loud shout (Rival Battle!)",
                "She stops at the tall grass (Wild Pokemon Battle!)",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.5;\">          Amethyst grinned and eagerly grabbed the small Pokeball containing Starckler.  She quickly tossed the ball and there was a bright flash before the young, blue, octopus Pokemon appeared, rubbing its eyes as it peered around, eying its surroundings before making eye contact with its new trainer.<br>\r\n\"He's all yours,\" the Professor yawned before shooing the two of them to the lab doors.  \"I want one more moment of your time, if I could?\"<br>\r\n          Amethyst nodded, adjusting her sun visor to better view the Pokemon Professor.<br>\r\n\"I have a friend over in the Kanto Region, his name is Professor Oak.  He asked me to pick the first three trainers who entered my lab to be responsible for this...\" she explained, holding a small, red device out to her.  Engraved on the front were the words <i>Pokedex</i> in black writing.  \"The Pokedex is a complex machine that works as a digital encyclopedia for Pokemon.  For each Pokemon you catch, the Pokedex automatically records data upon it.  To help you along, I want you to have these...\" the Professor added, handing Amethyst 5 empty Pokeballs and a Map of the region.<br>\r\n          Amethyst smiled widely, placing the Map in her turquoise satchel, as well as the empty Pokeballs.  She was anticipating the start of her journey!  The professor noticed this and shoved the girl out of her lab.<br>\r\n\"Start your damned journey already!  That Pokedex isn't going to fill itself, y'know!\" she hollered as Amethyst sprinted onwards to the awaiting Curina Region.</span></span></div></div>",
            "created":1370926800,
            "id":1609536,
            "title":"Starckler, the Suction Pokemon!"
        },
        "13131":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Leafbon is Victorious!",
                "Starckler is Victorious!"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.5;\">          Amethyst was walking along route one, already having gone through the very annoying process of telling her parents she was leaving to start her Pokemon journey.  Starckler was clung to her shoulder, sleeping calmly as he remained suctioned to Amethyst's body.  All seemed to be going well as the day drew on.<br>\r\n<i>At this rate, I'll be at Sunshine City in no time!</i> she thought happily.<br>\r\n\"Hey, Amethyst!\" shouted a gruff, male voice.<br>\r\n          It immediately brought a frown to the girl's face as she turned to see a young boy that she knew very well.<br>\r\n\"What do you want, Garnet?\" Amethyst questioned, glaring towards him.<br>\r\n          The boy wore black sneakers with white markings.  He wore grey cargo shorts with deep pockets and a pants lanyard.  He also sported a red sleeveless jacket and a white underhshirt.  Upon his ginger head were a pair of light blue goggles.  He held in his tanned hand a small Pokeball, and his light brown eyes had the glint of excitement.<br>\r\n\"What do I want?  I want a battle!\" he exclaimed.  \"When two trainers make eye contact...  Well, you have to battle!\"<br>\r\n          Amethyst glared, though nodded and shook her Starckler awake and sent him out to battle.<br>\r\n\"Go, Leafbon!\" Garnet shouted, tossing the Pokeball out.  There was a flash of light, and the Sapling Pokemon appeared with a rustling growl.<br>\r\n<i>I sure hope I know what I'm doing...</i> Amethyst thought nervously to herself.</span></span></div></div>",
            "created":1371013200,
            "id":1610084,
            "title":"Rival Battle!"
        },
        "131312":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Walk Through the Night to Sunshine City",
                "Set up a Temporary Camp Until Morning"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.5;\">          Before she knew it, the battle had begun, and Amethyst was already struggling.  Garnet had the edge of speed with his Leafbon, and it seemed a lot stronger and fit than her Starckler.  To her relief, however, Starckler seemed to be at attention and ready to defend.<br>\r\n\"Leafbon, use Leech Seed!\" Garnet instructed with a shout, grinning eagerly as the Pokemon obeyed.<br>\r\n\"Starckler, use Bubble!\" Amethyst returned.  The Pokemon gave a yawn and slowly performed the task, but it took enough time to take a hit from Leafbon's Tackle attack. The tired Pokemon let out a shrill squeal, the Leech Seed going into effect.  Leafbon seemed rejuvenated, and Starckler a bit drained.<br>\r\n\"Your Pokemon is pathetic, Amethyst!' Garnet guffawed, taunting them both.<br>\r\n          Amethyst glared before shaking her fists bitterly.  The battle wasn't going the way she wanted it to.<br>\r\n\"Listen up, Starckler!  You'd better wake up and use Growl, followed by a pretty damn good Tackle!\" she barked, making the Pokemon cringe.  It let out a bitter squeak to Amethyst before hastily obeying.  Leafbon manage to Tackle back, and once again was strengthened by Leech Seed, making Starckler plop tiredly on the battle field.  Amethyst could tell the battle was on its last length, but she wasn't going to wuss out.  \"Make this last one count, Starckler!  Use Bubble!\"  The Pokemon groaned, though used what little energy remained and let out a full fledged Bubble attack!<br>\r\n<i>Critical Hit!</i> Amethyst thought excitedly as the Leafbon twirled dizzily and fell to the ground, defeated.<br>\r\n\"Oh, no!  Leafbon!\" cried Garnet as he rushed to his fainted Pokemon.<br>\r\n\"I won..!\" Amethyst cheered, bounding happily to her exhausted Starckler.  She gave a smirk to Garnet.  \"I believe you owe me something.\"<br>\r\n          Garnet glared bitterly, though paid the prize money to out victorious heroine and her Pokemon.<br>\r\n\"C'mon, Leafbon...  Mom'll fix you up...\" Garnet grumbled, heading back to Ugaria Town.<br>\r\n<i>That was tough...  And it took longer than I thought it would...</i> Amethyst thought to herself, using the Potion her mother had provided for her on the now lively Starckler.  The sun had lowered considerably, and it seemed now that Sunshine City would have to wait until tomorrow.</span></span></div></div>",
            "created":1371172080,
            "id":1610572,
            "title":"Starckler is Victorious!"
        },
        "1313122":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Gotcha!  The Wild Zydrone was Caught!",
                "Shoot!  It was so Close Too!!"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.5;\">          Amethyst hated the idea, but decided it would be best to set up camp and walk in the morning.  She was glad her mother had packed her with a sleeping bag, because soon enough, the heated tropical forest was a bitter cold freezer.  She set up a tarp, draping it over a branch before uncurling the sleeping bag and setting it inside.  She placed a cute star patterned blanket over the sleeping bag before crawling in to rest.  Starckler followed, its suction cups popping as it shook in the cold.<br>\r\n\"Come here, you...\" Amethyst murmured, pulling the shivering Pokemon into the sleeping bag with her.<br>\r\n***<br>\r\n          It was morning.  The sun shone brightly through the leaves, and it was already sweltering in the jungle-like forest.  The Pokemon created a symphony of sound as they called out happily.  Amethyst and Starckler were just starting to awaken, until they noticed something odd...<br>\r\n\"H-Hey..!  What the hell..?\" Amethyst squealed, thrashing about.  Somehow, in their sleep, a Pokemon had tied their sleeping bag to the tree they had slept under using web!<br>\r\n          Stackler squealed before sliding out of the sleeping bag and landing with a plop in the grass.  It grew wide eyed before making frantic popping sounds to its trainer.<br>\r\n\"What is it, buddy..?\" Amethyst asked before pausing.  There was an odd clicking sound that sent shivers up her spine.  She shook lightly before turning her head and letting out a horrid shriek.  \"A BUG!\"<br>\r\n          Looking her straight in the eyes was a purple insect, poking its antennas at her.<br>\r\n\"USE BUBBLE!\" Amethyst squealed, flailing in an attempt to escape the sleeping bag.  She successfully fell to the ground with a thud, landing next to her partner as it attacked the opposing Pokemon.  Amethyst quickly pulled out her Pokedex.<br>\r\n          \"<span style=\"font-family:courier new, monospace\">ZYDRONE, THE SHARP POINT POKEMON.  THEY COLONIZE IN TREES AND ARE HIGHLY TERRITORIAL.  THEY CONTAIN LETHAL VENOM IN THE STINGERS ON THEIR ABDOMENS.</span>\"<br>\r\n          Amethyst watched the little bug Pokemon fall to the ground and squirm lightly as it was pelted with bubbles.  It seemed weak, though she needed it for the Pokedex.  Hesitantly, she threw a Pokeball.</span></span></div></div>",
            "created":1371260280,
            "id":1611058,
            "title":"Set up a Temporary Camp Until Morning"
        },
        "13131221":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Amethyst Gets There With No Trouble!",
                "Amethyst Runs into Some Weird People..."
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.5;\">          Amethyst watched intently as the Pokeball rocked to the side.  It rocked again...  A third time...  And then it clicked.<br>\r\n\"Yeah!  We did it, Starckler!\" Amethyst cheered joyously, hugging her Pokemon as it gave off happy clicks.  She grabbed the Pokeball containing Zydrone and scanned it with her Pokedex.<br>\r\n\"<span style=\"font-family:courier new, monospace\">ZYDRONE; LEVEL 4<br>\r\nGENDER: FEMALE<br>\r\nTYPE: BUG/POISON<br>\r\nATTACKS: <br>\r\nSTRING SHOT (BUG TYPE)<br>\r\nTHE FOE IS BOUND WITH STRINGS SHOT FROM THE MOUTH TO REDUCE ITS SPEED.<br>\r\nPOISON STING (POISON TYPE)<br>\r\nTHE FOE IS STABBED WITH A POISONOUS BARB OF SOME SORT.  IT MAY ALSO POISON THE TARGET.</span>\"<br>\r\n\"Hmm...  Not exactly a good Pokemon...  But I'm sure you'll come in handy with the Professor's research,\" Amethyst mumbled to herself.  She placed the newly caught Zydrone in her belt before doing the same with her Starckler.  She gave an anxious look ahead before setting out for the walk to Sunshine City.</span></span></div></div>",
            "created":1372457520,
            "id":1619381,
            "title":"Gotcha!  The Wild Zydrone was Caught!"
        },
        "131312212":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "They come back and see her!",
                "Keep going to Sunshine City"
            ],
            "content":"<div class=\"\"><div> <span><span style=\"line-height:1.5;\">          Amethyst steadily made her way through the jungle-like forest.  As she carried on, the temperature began to rise and with it, the humidity.  The only apparent Pokemon in this forest appeared to be Zydrone, making each battle increasingly more tedious than the last; they were weak little buggers, but at least this forest had a decent supply of pecha berries.<br>\r\n          Amethyst glanced to her shoulder where Starckler had perched himself yet again.  She expected to see him sleeping, but it seemed he was far too hot to close his eyes.  He had some kind of mucous-like substance oozing from his skin, probably to keep him cool.<br>\r\n\"Don't worry, buddy, we're almost there!\" she said reassuringly to him, though he only made subtle popping sounds.  Ahead, there appeared to be some shouting.  Amethyst got quiet and walked ahead stealthily, attempting to hide herself behind a tree.<br>\r\n\"I can't believe I got stuck with you on this mission!\" hissed a bitter, older male voice.  \"A rookie!  I've been in this group for 5 years and they stick me with an inexperienced brat like you!\"<br>\r\n\"Sorry, sir,\" mumbled a weak, much younger sounding male voice.  \"I promise, I'll do whatever you say to a 'T'!\"<br>\r\n\"You'd better!  Sunshine City is our biggest mission yet!  One screw up and we're through!  Finished!\" barked the older man.  \"Don't forget, we meet back here tonight; make sure no one sees you.\"<br>\r\n\"Sure thing, sir!\"<br>\r\nThe two departed without another word.<br>\r\n\"I wonder what that was about...\" she whispered quietly to Starckler, who stared at her with the same look of confusion.</span></span></div></div>",
            "created":1415197440,
            "id":1882010,
            "title":"Amethyst Runs into Some Weird People..."
        },
        "133":{
            "author_id":"paniick",
            "author_name":"Leon",
            "choices":[
                "Leafbon",
                "Freery",
                "Starkler"
            ],
            "content":"<div class=\"\"><div> <span>A grandmother, mother, father, and daughter were gathered around a dinner table. A cake with white frosting and ten lit candles was at the center of the table.<br>\r\n\"Make a wish a Forest,\" said the mother, Ivy Vyne. She had a long green braid and blue eyes. She wore a navy polo shirt and jeans. The father, Thor N.E. Vyne, had dark blue hair and steely gray eyes. He wore a button up gray shirt, and khakis. The grandmother, Rose Vyne, had white hair held in a bun, pink eyes, and wore glasses and a pinkght sun dress. The daughter was Forest Vyne. She had long green hair in two pigtails and pink eyes. She wore a button up black shirt, a pink plaid skirt, thigh high white socks and silver boots. <br>\r\nForest took a deep breath and blew out the candles. After eating the cake, presents were passed out.<br>\r\n<br>\r\n\"Ohmygosh a pokecharm!\" Forest squealed excitedly. She dangeled the necklace in front of her. It was a silver star with a pokeball in the middle. Pressing the pokeball, the star unfolded into a circle. There were four screens, and a keyboard on the bottom panel. Forest could check emails and make calls, access maps, and play the radio all at the same time. \"Nanna, Mom, Dad, I can't thank you enough!\" <br>\r\n<br>\r\n\"That's not our only surprise sweetie.\" said Mom, \"Go upstairs and pack your things quickly, Professor Hickory is waiting.\" Forest was confused for a minute before her face lit up with realization. She looked between her mother and then her father. Her father gave a small nod. Without that, Forest tore off to her room, rushing to fit everything in her bag while she prayed her parents wouldn't change their mind. Her grandmother entered her room while Forest was struggling to zip up her bag.<br>\r\n<br>\r\n\"Sweetie you realize what this means right?\" Nanna said sweetly. <br>\r\n\"It means I'm going on my Pokemon journey right?\" Forest asked uneasily, afraid she had been tricked.<br>\r\n\"It means we won't get to see each other every day. You will be away on adventures, and we will be here praying for your safety.\" Nanna finished with a sigh. Forest stopped fighting her bag's zipper and looked at her grandmother. <br>\r\n\"Are you worried Nanna?\" She asked<br>\r\n\"My only granddaughter is going out into the big bad world. Of course I'm worried\"<br>\r\n\"Oh, Nanna,\" Forest moved over to hug her, \"Don't worry so much. You went on journey at my age, just like Mom and Dad and every other adult. It's how I'll become an adult. And I promise to call every week.\" That was when Thor walked in. Forest and Rose hastily separated.<br>\r\n\"Are you ready?\"  He asked. <br>\r\nForest grabbed her mostly zipped up bag and said,\" yep.\" After a brief goodbye with her parents, Forest left for the Professor's lab. Walking through the lab, Forest spotted the tall blonde woman she was looking for.<br>\r\n\"Professor, it's me Forest,\" Forest called out to the scientist. Hickory straightened up from her machine and looked at Forest.<br>\r\n\"Ah, Forest, so you did come. If you follow me I'll show where the Pokemon are.\" The professor led them to a table with three pokeballs. \"In each ball is a pokemon. There is Leafbon, the grass type, Freery, the fire type, and Starkler, the water type. Which one will you choose?\"</span></div></div>",
            "created":1322974800,
            "id":1234986,
            "title":"Meet Forest!"
        },
        "1331":{
            "author_id":"paniick",
            "author_name":"Leon",
            "choices":[
                "Lavender",
                "Blush",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>\"I choose Leafbon.\" Forest said decidedly. Professor Hickory gave Forest the ball, and Forest released the Pokemon. <br>\r\n\"Leaf leaf!\" Greeted the Pokemon.<br>\r\n\"Hello there,\" Forest said to her, \"I'm your new trainer, Forest. I bet we'll be great friends.\" The Pokemon took a look at her new trainer, and a look of horror came across her face. Before Forest could say anything, Hickory spoke again.<br>\r\n\"Well, now that you have you're first Pokemon, you can begin you're journey. Are you ready?\" She asked. Forest straightened up and looked at the Professor seriously.<br>\r\n\"Yes mam, I am.\"<br>\r\n\"Then welcome to the world of Pokemon. Here is a Curina's Pokedex, and five pokeballs to get you started, good luck!\" The professor said, handing Forest the items. Forest put them a pocket in her bag.<br>\r\n\"Alright Leafbon,\" Forest said to her Pokemon, who looked suspiciously like it was about to sneak away, \" It's time to start our journey!\" Forest punctuated her sentence with an (extremely cheesy) fist pump. However, just then, the doors to the lab were flung, open and standing there was Forest's childhood rival...</span></div></div>",
            "created":1323061200,
            "id":1235000,
            "title":"I Choose You, Leafbon!"
        },
        "13312":{
            "author_id":"paniick",
            "author_name":"Leon",
            "choices":[
                "Beginner's Luck! I'll Win For Sure!",
                "I'm not ready for a battle yet..."
            ],
            "content":"<div class=\"\"><div> <span>Blush, the girl that lived down the street, was only two days older than Forest, and the absolute bane of Forest's existence. She had long, straight light pink hair that reached her hips, brown eyes, glasses, wore a white dress with pink hearts on the hem, with a baby blue cardigan, loose white socks, a red bow in her hair and red Mary Janes. She sneered at Forest.<br>\r\n<br>\r\n\"Ha, you got that Pokemon! Leafbon is wimpy, ugly and for losers like you!\" Blush lamely taunted. Both Leafbon and Forest had flames of rage in their eyes. Professor Hickory looked confused. <br>\r\n<br>\r\n\"Blush, what are you doing  he-\" The Professor interrupted.<br>\r\n<br>\r\n\"Oh yeah Blush!\" Forest shouted, crossing her arms.<br>\r\n<br>\r\n\"Yeah,\" Blush shouted back, hands on her hips.<br>\r\n<br>\r\n\"Oh Yeah,\"<br>\r\n<br>\r\n\"Yeah,\"<br>\r\n<br>\r\nOh Yeah,\"<br>\r\n<br>\r\n\"Yeaaaaah,\" Blush drawled out the 'yeah'.<br>\r\n<br>\r\n\"Let's see your Pokemon then.\" Forest said.<br>\r\n<br>\r\n\"The only way you're going to get to see my Pokemon is in a battle!\" Blush told her triumphantly, \"So is that a challenge?\" Forest glanced at her Leafbon. The Pokemon was as fired up as she was and looked as ready to teach Blush a lesson. But then again, Forest had never been in a battle before...</span></div></div>",
            "created":1323061200,
            "id":1235005,
            "title":"Blush"
        },
        "133121":{
            "author_id":"paniick",
            "author_name":"Leon",
            "choices":[
                "Teal",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Forest shook away her doubts. It's not like Blush had been in any battles either (that Forest knew of). She turned to Leafbon. <br>\r\n\"Listen, will you work together with me to beat her?\" Forest asked. The Pokemon nodded. \"Then go and fight, Leafbon!\" She said. The Pokemon positioned itself in front of Forest, ready.<br>\r\nRight about then, Professor Hickory spoke up, \"Girls I'd really rather you didn't battle in my-\" Again she was cut off.<br>\r\n\"I've been waiting for this!\" Blush said excitedly. She tossed out a pokeball. From it emerged a little fireball. \"Go Freery!\" <br>\r\n\"Girls please don't-\" The professor tried one more time, but unfortunately, she was ignored once again.<br>\r\n\"Leafbon use tackle!\" Forest ordered. Professor Hickory gave up and settled in a chair to wait out the battle. A series of tackles and a couple of defense curls made up the battle. Eventually, just as the Professor was getting REALLY bored, both Pokemon landed a dramatic, final blow on each other before collapsing. <br>\r\n\"Leafbon!\"<br>\r\n\"Freery!\" <br>\r\nBoth trainers collapsed next to their Pokemon, then, in sync said-<br>\r\n\"Professor, please help my Pokemon!\" <br>\r\nProfessor Hickory had a moment, a brief moment of cruelty, where she considered tossing the two girls out of her lab and making them walk to the next town's Pokecenter to heal their own Pokemon. But the moment passed, and she took the grateful young trainers' Pokemon, and healed them. And then promptly kicked them out.<br>\r\n\"Get out and go on your damn journey already!\"<br>\r\nAfter getting kicked out of the Professor's lab, Blush and Forest departed after another round of lame insults and childish bickering. Finally, Forest found herself on the edge of her hometown, Ugaria Town.<br>\r\n\"Well this it...\" She muttered and left without looking back...<br>\r\n<br>\r\nIn Professor Hickory's Lab, a young boy received the last starter, Starckler, and his name was... </span></div></div>",
            "created":1323061200,
            "id":1235111,
            "title":"Beginner's Luck! I'll Win For Sure!"
        },
        "1331211":{
            "author_id":"paniick",
            "author_name":"Leon",
            "choices":[
                "Would Chase After Him",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Teal was his name. He had light blue eyes, spiky blue-green hair, wore a black hoodie with purple stripes on his arms, and gray jeans. He received the last starter, Starckler, along with five pokeballs and a Pokedex.  <br>\r\nProfessor Hickory looked him in the eye and said, \"I'm counting on you to complete this Pisokedex and become a Pokemon master.\"<br>\r\n\"Yes professor...\"<br>\r\nForest cried out in relief when Sunshine City came within view. She had gone through 20 something Rattatas, 25 something Pidgeys and Starlies, and 30 something Bidoofs. She was beginning to truly hate Bidoof. I had taken nearly all day to reach the city. She checked the map on her Poke charm. <br>\r\n\"Okay if I go this way I should reach the Pokemon Center.\" She mumbled, trying to navigate the busy city streets. She heard a jingling and looked up. Jumping up and down on a street lamp was a white monkey with wings. Forest pulled out her Pokedex. Immediately, the Pokemon's picture and information flashed on the screen-<br>\r\n\" Boohimp<br>\r\nFlying/Normal<br>\r\nHt: 1'08\" Wt: 13 lbs<br>\r\n<br>\r\nBoohimp is a white monkey with a green belly, white feathery wings, and bell on its neck, and a curly tail (like a rattatas). They are playful, curious and sometimes mischievous. They live in the trees in forests and on top of tall buildings such as skyscrapers in cities.\"<br>\r\n<br>\r\n\"Boo, boo, hoo, hoo,\" Boohimp looked at her, his bell jingling every time he moved. He cocked his head curiously. Coming to a conclusion, he launched himself at Forest and before she could react, he grabbed her Poke charm, and flew off. After she recovered from her shock, and she realized what she quickly realized what she had to do. She... </span></div></div>",
            "created":1323061200,
            "id":1235348,
            "title":"Teal and Sunshine City"
        },
        "13312111":{
            "author_id":"paniick",
            "author_name":"Leon",
            "choices":[
                "Resist and Get Away, You Have No Chance",
                "Battle, Don't Go Down Without a Fight!"
            ],
            "content":"<div class=\"\"><div> <span>The sun was setting fast as Forest chased after the Pokemon. Leafbon ran at her side, throwing attacks at Boohimp at Forest's commands.However, Boohimp was able to dodge most of the attacks, leaving various amounts of damage in their wake. Forest and Leafbon weaved in and out of streets and alleyways while trying to keep up with the Pokemon. Forest's lungs were beginning to burn and her legs were beginning to ache. Leafbon was positively wilted. Eventually the two of them collapsed next to one of the lit street lamps.<br>\r\n <br>\r\n\"Damn...him...\" Forest muttered as she looked around and found she could not fin Boohimp anywhere, \"My...present...\" She gasped a little more before finally catching her breath. Feeling a little better, she took a better look around. Truly, there was no sign of Boohimp or her Poke Charm, she was completely lost and her Pokemon was completely exhausted. <br>\r\n\"Leafbon,\" Forest addressed her Pokemon, \"Why don't you rest in your ball.\" The tired Pokemon happily accepted. Once Leafbon was put away, Forest let out a deep sigh. <br>\r\n\"I'm not thinking straight, and now I'm lost. I need to find someone I can trust to give me directions to the nearest Pokemon center. As much as I hate to give up, I guess for now it's for the best.\" However glancing around the dark street, Forest saw no one but but dark men that clung to the shadows. A little unnerved, Forest decided to move on and try and find a safer looking area. Walking down the street, she heard a few of the men call out to her, call her disgusting things, but Forest just clutched her bag and kept walking. Street after street, she continued, but only grew more and more lost, and was to afraid to ask anyone she saw. Finally, she found herself in front of an abandoned warehouse. A couple of older kids were there. Feeling braver around fellow children (even older children), Forest decided to approach them. As she got closer, Forest noticed they were dressed a little oddly. The girls wore black dresses, black tights, black boots, black shoulder high gloves and a dark gray cloak. The boys wore black pants, black boots, a black turtle neck, and a dark gray cloak. On their cloaks was a strange symbol. To Forest it looked like a swirly moon.<br>\r\n<br>\r\n\"Um excuse me,\" She said quietly to one of the girls, \"I'm a little lost. Can you direct me to the nearest Pokemon Center?\" The older girl sneered at her.<br>\r\n\"Hey Hugo!\" She called, \"There's a squirt here who's lost. She wants to get to the Pokemon Center. What should we do with her?\" One of the boys lying down stood up and walked over. He was huge. He stood at least six feet tall and gave Forest a crooked smile that made her squirm. <br>\r\n\"You're looking for the Pokemon Center right? That must mean you're a Pokemon trainer.\" He stated.<br>\r\n\"Yes I am trainer,\" Forest answered him, even though it was not really a question. Hugo pulled out a pokeball.<br>\r\n\"In that case, if you want to know where the Pokemon Center is, you'll have to beat me. But if I win I get your Pokemon.\" Hugo grinned down at her as said it. Forest was terrified.<br>\r\n\"I-I-I don't want to battle you!\" She stuttered out.<br>\r\n\"Then that means you automatically forfeit, and I get your Pokemon!\"<br>\r\n\"No!\" She screamed, but the other kids began to crowd around her, ready to help their leader. ...<br>\r\n</span></div></div>",
            "created":1323061200,
            "id":1235395,
            "title":"Night Falls in Sunshine City"
        },
        "133121112":{
            "author_id":"paniick",
            "author_name":"Leon",
            "choices":[
                "Officer Joy ",
                "Boohimp"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll battle you!\" Forest told the man in front of her. Her words surprised everyone in that warehouse, including Forest. Hugo quickly recovered though, and his crooked  grin returned.<br>\r\n\"Hah! Alright pipsqueak, let's see what you got,\" Hugo punctuated his words by tossing out his Pokeball. From the Pokeball came a Creapr. Forest pulled out her Pokedex:<br>\r\n<br>\r\n\"Creapr<br>\r\nGhost<br>\r\nHt: 2' 6\" Wt: 31 lbs.<br>\r\n<br>\r\nIt looks like a purple puff of smoke with a skull for a face and skeleton hands. It can pass through any wall no matter how thick it may be. Once this Pokémon chooses a target, it will doggedly pursue the intended victim until the break of dawn.\"<br>\r\n<br>\r\n\"Wow, a Creapr,\" An impressed Forest said.<br>\r\n\"Hurry up and throw out your Pokemon!\" Hugo snapped. Forest jumped, and then, brought back to reality, grabbed her Pokemon and sent out Leafbon. The exhausted Pokemon took a moment to take in its surroundings and the situation before turning on Forest and chewing her out. Forest was rather happy to be unable to understand Pokemon. Just from the volume and tone, she knew Leafbon was not saying nice things to her. Her cheeks burned red as the kids around her laughed.<br>\r\n\"What is this?\" Hugo forced out through his laughter, \" Aren't you supposed be the trainer? It looks like the Pokemon's training you!\" <br>\r\nForest forced out through her indignation, \" Enough talk! Let's battle!.\" Her face burned bright red as she said the words. Hugo said, \"Please, is a Pokemon like that even worth the effort?\" At the words, Leafbon straightened up at his words and turned around in a battle ready stance. <br>\r\n\"Leafbon!\" Said the Leafbon, ready for battle. Hugo straightened up to.<br>\r\n\"Well, let's get this over with. You can go first.\" He offered generously.<br>\r\n\"Fine Leafbon use leech seed!\" Forest commanded.<br>\r\n\"Creapr, dodge and use Bite!\"<br>\r\nCreapr was unable to dodge the leech seed, but was able to land the Bite. Leafbon went down in one blow. <br>\r\n\"Leafbon!\" Forest cried out as she rushed to the fainted pokemon's side.<br>\r\n\"That was too easy.\" Hugo sneered at Forest and Leafbon, \"You lost, hand over your Pokemon!\" Forest was on the verge of tears. Just then, a figure crashed through the window and landed in front of Forest. Everybody stepped back in surprise. It was...<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1323147600,
            "id":1235628,
            "title":"Battle, Don't Go Down Without a Fight!"
        },
        "1331211122":{
            "author_id":"paniick",
            "author_name":"Leon",
            "choices":[
                "Wake Up"
            ],
            "content":"<div class=\"\"><div> <span>\"Boohimp?\" Forest gasped. The Boohimp stood protectively in front of Forest and Leafbon. Around it neck was a necklace with a silver star and pokeball in the middle. \"You're the same Boohimp from before!\" The Pokemon nodded to Forest's claim.<br>\r\n Hugo was laughing again, \"So you got yourself a little friend do ya?\" Forest glared up at him. \"I'll tell you what kid, if you want to try again with your little Boohimp, that's fine with me. I'm in a rather generous mood today.\" <br>\r\nForest looked at Boohimp, \"Boohimp, are willing to fight with me?\"  Boohimp nodded again. Forest took a deep breath. <i>This is my only chance...</i> She returned her beaten Leafbon to it's pokeball and pulled out her Pokedex. Boohimp's moves were Wing Attack, Swift, Quick Attack and Bite. <br>\r\nForest stood up, dusted herself off and said, \"I accept your challenge.\"<br>\r\n\"I'll go first this time, Creapr use Astonish!\"<br>\r\n\"Boohimp, dodge and use Wing Attack!\" <br>\r\nBoohimp took to the air, avoiding Creapr's attack, and landed the Wing Attack. <br>\r\n\"Creapr, counter with Bite!\"<br>\r\nThe ghost Pokemon bit hard on Boohimp.<br>\r\n\"Boohimp use Bite too!\"<br>\r\nBoohimp bit Creapr. It's super effective!<br>\r\n\"Creapr, get away from that copy cat and use defense curl, then use another Astonish!\"<br>\r\n\"Follow it Boohimp and use Wing Attack!\"<br>\r\nBoohimp wasn't quick enough to stop Creapr's defense curl, but was able to hit it before it used Astonish. <br>\r\n\"Good job, Boohimp, now another Bite!\" <br>\r\n\"No, dodge it Creapr.\" <br>\r\nThe Creapr was able to avoid Boohimp.<br>\r\n\"Use Bite Creapr.\"<br>\r\n\"Wing Attack, then Bite, Boohimp.\"<br>\r\nThe two Pokemon hit each other at the same time. Both Pokemon were becoming visibly weaker, but Creapr more so than Boohimp.<br>\r\n\"Boohimp, just one more Bite!\"<br>\r\n\"Don't let him Creapr!\"<br>\r\nBut Boohimp chomped one last time on Creapr, and the fainted Creapr fell to the floor in defeat.<br>\r\n\"Yes!\" A triumphant Forest shouted. She ran, hugged the Boohimp tightly and said, \"Great job, Boohimp, you're amazing!\" <br>\r\n\"What are you so happy about?\" Came a voice. Forest looked up and saw Hugo was smiling his creepy lopsided smile again. \"Do you think you're leaving this place now?\"<br>\r\n\"But you said...\" A confused and terrified Forest said, \"You said you'd let me go back to the Pokemon Center if I beat you!\"<br>\r\n\"I don't remember saying anything...\" He started laughing again, and all the spectators began to crowd around Forest. \"You might be able to leave, if you can manage to beat us all...\" Forest clutched tighter to Boohimp. <br>\r\n\"Boo, hoo, hoo\" He said worriedly. <br>\r\n\"Now, now Hugo, it's not very nice to break promises.\" An unfamiliar voice said. Everyone turned to see a newcomer leaning up against a crate in the warehouse. He looked about the same age as Forest. He had white hair, with his bangs combed over his right eye, and a silver eye. He was dressed the same as the rest of the gang. Black turtle neck, black pants and shoes and a dark gray cloak. Everyone in the ware house, except for Forest and Boohimp, backed away from the newcomer. \"C'mon, kid, I'll take you to the Pokemon Center.\" A strange chill filled the air.<br>\r\n\"Y-you know, I-I'd rather n-not,\" Forest stuttered out, and began to shiver. <br>\r\n\"Oh no, I insist!\" <br>\r\nDarkness filled Forest's vision...</span></div></div>",
            "created":1323147600,
            "id":1235933,
            "title":"Boohimp"
        },
        "13312111221":{
            "author_id":"paniick",
            "author_name":"Leon",
            "choices":[
                "Battle! Teach this Punk a Lesson!",
                "Just Walk Away"
            ],
            "content":"<div class=\"\"><div> <span>Forest opened her eyes to morning light and found herself in room with a bed, a closet, a mirror and a desk, and nothing else. Next to the bed was her bag. Leaning back, her hand fell on something furry and alive. <br>\r\n\"Gah,\" Forest yelped and pulled back her hand.<br>\r\n\"BOO!\" Cried a startled Boohimp.<br>\r\n\"Boohimp? You're here?\" Forest gasped.<br>\r\n\"Boo, hoo,\" was the answer she got.<br>\r\n\"Leafbon!\" Forest nearly screamed, the events from the previous night coming back to her. Forest quickly dug the pokeball out of her bag and released the Pokemon inside. Forest jumped out of the bed and hugged the irritated, but safe and healthy Leafbon.<br>\r\n\"Thank goodness you're alright!\" Forest gushed with affection. She turned to Boohimp who was still in the bed. \"And Boohimp, thank you so much for coming to the rescue last night, how can I repay?\" Forest said as she threw her arms around him. After snuggling with him for a minute, Forest pulled away and said, \"But where are we? What happened last night? The last thing I remember is that creepy pale kid, and then... everything went dark...and now we're...\" Forest trailed off, looking from one Pokemon to the next for some clue. Someone knocked on Forest's door.<br>\r\n\"Excuse me Miss Vyne, may I come in? It's Nurse Jenny.\" Said a kind voice from the other side of the door. <br>\r\n\"Nurse Jenny! Oh, okay, you can come in.\" Forest said, realizing she was still in her day clothes. The blue haired nurse walked in.<br>\r\n\"It's good to see you're awake. How are you and you're Pokemon feeling?\" She asked as a Chansey walked in behind her. <br>\r\n\"Just fine ma'am, but I can't remember how I got here. What happened Nurse Jenny?\"<br>\r\n\"That's what I was hoping you could tell me. I found you and you're Pokemon unconscious outside the Pokemon Center. I healed your Pokemon and put you to rest.\"<br>\r\nForest considered what to tell Nurse Jenny.<br>\r\n\"Nurse Jenny, does this city have any gang problems?\" Forest asked.<br>\r\n\"No dear, Sunshine City is very safe!\"<br>\r\n\"Oh...\"Forest trailed off, not sure what to say to pure naivety on Nurse's face. In the end, Forest decided not to burden the Nurse with knowledge of the gang-cult-whatever she had found last night. Forest tried to think of something to divert the Nurse's attention. Her eyes fell on Boohimp and she exclaimed, \"e Oh! By the way this isn't actually my Boohimp.\" She informed Nurse Jenny. A confused look crossed Nurse Jenny's face.<br>\r\n\"How strange. But he was with you when I found you and has refused to leave your side. He is very loyal to you.\" The nurse finished with a smile. She double checked the Pokemon and Forest before Forest managed to shoo her away. Once the nurse was gone, Forest went to Boohimp.<br>\r\n\"Boohimp, would want to be my and Leafbon's partner?\" Forest asked. Boohimp was still for moment, and then reached over and gave Forest her Pokecharm back and then nodded. \"Okay then.\" Forest picked up a Pokeball, and gently pressed the center button against Boohimp's head. Leafbon watched them like a witness to something sacred. Boohimp entered the Pokeball, it wiggled a little and then went still. ...<br>\r\n...<br>\r\n<br>\r\nForest looked herself in the mirror, clean and refreshed. A fresh black button up shirt, purple knee socks and pink plaid skirt felt nice. Her silver star Pokecharm shone in the light, her long green hair was washed and brushed and put into two pigtails. She put on silver boots and finally went down for some breakfast. As she entered the first floor of the Pokemon Center she noticed a commotion going on outside. Curious, she went to investigate. Outside in front of the Pokemon Center was a beautiful girl, no older than sixteen. She had short crimson hair that she wore like a cap, red lipstick and golden eyes. She wore a purple tube top, a black leather miniskirt, elbow high finger less white gloves and black boots steel toed boots. A Gardevoir was by her side.<br>\r\n\"Gardevoir, use Light Screen, then follow with Psybeam!\" the mysterious trainer commanded. Gardevoir created a shiny wall in front of itself, and then proceeded to blast it with a multicolored beam. The wall shattered, and in the shards falling in the air, the colors from the Psybeam reflected, making Forest feel like she was looking at a strange midair kaleidoscope. Her mouth fell open. The crowd that was gathered around the trainer and her Pokemon clapped and cheered for her. <br>\r\nThe trainer and her Gardevoir bowed and said, \"Thank you. I am Celina Dew, up and rising Coordinator. Make sure to cheer for me at the Pokemon Contest tonight!\" <br>\r\n\"...Pokemon Contest huh?\" A voice next to Forest said. There was boy about her age.  He had light blue eyes, spiky blue-green hair, wore a black hoodie with purple stripes on his arms, and gray jeans.<br>\r\n\"You don't like them?\" Forest asked. <br>\r\n\"Can't say I'm a fan. I'm more into Gym Battles myself.\"<br>\r\n\"That's right! There is a Gym in this town isn't there?\"<br>\r\n\"If you're thinking of challenging the Gym, you're gonna get you're ass kicked.\"<br>\r\n\"How the hell would you know!\"<br>\r\n\"Oh please,\" The boy rolled his eyes as he said, \"How many Pokemon do you even have? Two, three? The gym leader in this town is wicked strong. You won't stand a chance.\"<br>\r\nHe finished flatly. He was really beginning to peeve Forest. She decided... <br>\r\n</span></div></div>",
            "created":1323320400,
            "id":1236794,
            "title":"Wake Up! A New Day Dawns!"
        },
        "133121112211":{
            "author_id":"paniick",
            "author_name":"Leon",
            "choices":[
                "Find the Gym Leader!",
                "Go to the Contest!"
            ],
            "content":"<div class=\"\"><div> <span>\"You know what,\" Forest said with a sneer, \"Let's see how great you're Pokemon are!\"<br>\r\n\"You challenging me?\" The boy questioned.<br>\r\n\"Yeah I am!\" Forest answered<br>\r\n\"Fine, go Zydrone!\" The boy released a bug Pokemon onto the battlefield. Forest quickly checked her Pokedex. <br>\r\n\"Zydrone<br>\r\nBug/Poison type<br>\r\nSharp point pokemon<br>\r\nHt. 1'00\" Lb. 1.00<br>\r\n<br>\r\nZydrone has a light blue body, four black legs, two grey needles on its abdomen, two white pointy antenaes, purple fly like eyes, and an orange nose.<br>\r\nZydrone are territorial, but not lethal. Their venom can cause swelling and irrataion and possibly cause the body part to be paralyzed for at least fifteen minutes. They can make colonies in trees, the ground, and houses. They eat fruit and leaves.\"<br>\r\nAfter she was done with her Pokedex, Forest let out her new Boohimp.<br>\r\n\"Go Boohimp!\" <br>\r\n\"Zydrone, use poison sting!\"<br>\r\n\"Dodge it Boo, and use Swift!\" <br>\r\nBoohimp was quick enough to avoid the attack, and was able to hit the opponent with his Swift. <br>\r\n\"Follow it up with...Quick Attack\"<br>\r\n\"Zydrone Quick Attack\"<br>\r\nForest's delay cost her, and Zydrone landed it's attack, but Boohimp didn't.<br>\r\n\"Boohimp use Wing Attack!\"<br>\r\n\"Dodge it Zydrone!\"<br>\r\nBut it hit, and it was super effective. <br>\r\n\"Poison sting Zydrone!\"<br>\r\n\"Dodge Boohimp and use another Wing Attack!\" <br>\r\nThe poison sting hit and left Boohimp Poisoned, and Zydrone was able to avoid Boohimp Wing Attack. Again, Forest commanded for a Wing Attack. Zydrone was hit and was close to going done. Boohimp hit it one more time with Wing Attack and won the battle. The boy returned his Pokemon to its Pokeball. <br>\r\n\"Go Starckler!\" From the boy's next ball came a little blue octopus with stars on it. Forest returned Boohimp to its ball, and released Leafbon.<br>\r\n\"Go Leafbon!\" <br>\r\nThe battle began. Leafbon used leech seed on it. It was super effective. Starckler used Tackle. Leafbon sapped health points from Starckler. Leafbon then used tackle. The battle continued like this for a while until Starckler fainted. (A/N: Yeah I know I'm being a lazy ass. Sorry for the shitty battle.)<br>\r\n\"Woo hoo! I won! Ha, so you still think I can't beat that Gym leader?\" Forest said as she grinned. The boy scowled.<br>\r\n\"You don't stand a chance.\" He said flatly. He looked her in the eye, \"Listen, the Gym leader in this town is probably one of the strongest trainers in the region. Stay. Away. From. Her.\" Forest backed away a little and gulped. The boy walked away in the direction of the Pokemon Center. As he walked away, Forest began to wonder what to do next. But her train of thought was interrupted by a voice saying, \"So you must be a new trainer.\" Forest turned to see Celina Dew watching her. Forest blushed and nodded, suddenly having trouble speaking.<br>\r\n\"How'd you know?\" Forest managed to say.<br>\r\n\"Oh, I can always figure out how experienced a trainer is based on how they battle,\" She said casually, but Forest was still impressed. Before either could say another word, a growl erupted from Forest's stomach. Forest blushed deeper. She still had not had breakfast. Celina Dew laughed a little. \"You sound hungry. How about I treat you to lunch?\" Forest smiled and, because her mouth still wasn't working quite right, nodded. ...<br>\r\nThe two ended up in a breakfast house eating pancakes and drinking coffee.<br>\r\n\"So you're from Ugaria Town?\" Celina Dew asked over a cup of coffee.<br>\r\n\"Yeah, I've only been traveling for about two days.\" Forest said, having regained her ability to comfortably speak after having food in her belly and spending some time with Celina Dew and getting used to her. Forest wondered if Celina Dew had a tongue-tied effect on everyone. <br>\r\n\"Ah,\" Celina Dew said with a sigh, \"I remember when I was just beginning my journey. It was such a long time ago now. By the way...\" Celina Dew quickly changed the subject, \"Are you interested in Pokemon Contests?\"<br>\r\nForest shrugged her shoulders and said, \"Well, I've seen a few on TV, and they're really cool I guess.\" <br>\r\n\"Are you going to the Pokemon Contest later today?\" She asked quietly.<br>\r\n\"I'm afraid I don't have any tickets.\" Forest explained.<br>\r\n\"I'll give one for free if you like.\" Celina Dew said.<br>\r\n\"I-I can't accept that!\" Forest stuttered.<br>\r\n\"Oh please do.\"<br>\r\n\"I can't take something like that for free.\"<br>\r\n\"It's not for free.\"<br>\r\n\"What do you want in return?\" Forest asked suspiciously.<br>\r\n\"I'll tell you what, let me give this to you,\" She pressed the ticket into Forest's hand, \"Come to the Contest. After the Contest I'll tell you what I want.\" With that, Celina Dew gave Forest a wink, slapped some money on the table and left. ...<br>\r\nForest left the breakfast house and wandered through the city thinking about what to do. Memories of the previous night filled her head. The gang and the mysterious figure; at that point, the whole incident seemed more like a dream than real. It didn't make sense. She knew what happened was real. Her Boohimp was proof of it! But she couldn't shake the feeling that there was something unearthly about that night. Well, it what happened was real, that gang is dangerous and someone has to know. Forest made up her mind to tell Officer Joy. Having come to a decision, Forest looked up to discover her feet led her to a park. She sat on a bench for a quick rest and watched the Magikarp in the pond; she heard a conversation behind her between a group of older kids.<br>\r\n\"Don't do man. You'll get you ass handed to ya\"<br>\r\n\"She's way too strong!\"<br>\r\n\"Shut up, she can't be as tough as they say!\"<br>\r\n\"She's one of the strongest in the Region!\"<br>\r\nForest thought about what the boy said. Despite his warning, or perhaps because of it, curiosity and pride were urging her to see what the mysterious Gym leader was all about. But maybe she shouldn't go after someone so apparently strong. She heard a shriek from a couple of girls a little older than her.<br>\r\n\"Ohmigod, I can't wait for the Contest!\"<br>\r\n\"Chance is gonna be there!\"<br>\r\n\"And Celina Dew!\"<br>\r\nForest thought of the kaleidoscope Celina Dew had created. She thought of how beautiful she was and amazing it would be to see her on stage. She also thought of her promise to talk after the show. <br>\r\nIn the end Forest decided to...  </span></div></div>",
            "created":1323320400,
            "id":1236822,
            "title":"Battle! Teach this Punk a Lesson!"
        },
        "1331211122112":{
            "author_id":"paniick",
            "author_name":"Leon",
            "choices":[
                "Listen to Her",
                "Get Away from the Weirdo "
            ],
            "content":"<div class=\"\"><div> <span>She couldn't disappoint Celina Dew. Maybe later she could investigate the Gym, but today she would go see the Pokemon Contest. Feeling comfortable now that she had made a decision, Forest took out her Pokemon for some training. The time flew by quickly, and before she knew it she had an hour before the Contest. Putting away her tired Pokemon, made her way to the city streets and followed the map on her Pokecharm. She was about five minutes away from the Contest hall when she heard a very familiar voice-<br>\r\n\"Forest, long time no see.\"<br>\r\nForest turned to see Blush standing behind her. <br>\r\n\"Blush what are you doing here?\"<br>\r\n\"That's none ya business! But since we're both here, let's if you're Pokemon have gotten any tougher!\" Blushed challenged.<br>\r\n\"Fine bring it!\" Forest answered, easily getting fired up. \"Go Boohimp!\" Forest tossed out the Pokeball, and the flying monkey emerged from it.<br>\r\n\"Go Poshyup!\" From Blush's Pokeball, a pink dog with a white fluffy man and a red bow on a fluffy white tail. Forest quickly got out her Pokedex.<br>\r\n\"Poshyup<br>\r\nNormal<br>\r\nHt: 1\"0' Wt: 15 lbs.<br>\r\n<br>\r\nThis Pokemon was bred to by ancient nobles as a lap dog. Somewhere along the way, they started using for battles. They have a spoiled nature, a bad temper, and are very loud. It usually lives in urban environments, like big cities\"<br>\r\n<br>\r\n\"Boohimp, use Swift!\" Forest began. Poshyup dodged it and used Quick attack. Boohimp used Wing Attack  and hit it, Poshyup countered with Headbutt. Boohimp hit Poshyup with a Quick Attack, Poshyup retaliated with another headbutt. Boohimp went down.<br>\r\n\"No Boohimp!\" Forest cried out. She pulled out it's Pokeball and returned it. \"Good job, have a good rest.\" Forest tossed out another Pokeball and said, \"Go Leafbon!\" The grass type came out ready for battle.<br>\r\n\"Leafbon!\"<br>\r\nPoshyup began round two with a headbutt, but Leafbon was able to dodge. Leafbon then used leech seed. Leafbon sapped Poshyup's health. Poshyup tried a Quick Attack and hit the Leafbon. Leafbon hit back with a Tackle and regained some health with its Leech Seed. Poshyup tried to hit it with another Quick Attack, but missed, and then tried another Quick attack, but missed again. Leafbon hit it with a Tackle. Poshyup countered with a Headbutt, and finally landed a blow. Leafbon sapped some more  health from Poshyup, and then hit it with a final tackle. Poshyup went down.<br>\r\n\"Damn it!\" Blush cursed as she returned her Pokemon to its Pokeball. \"Go Freery. Finish this!\"<br>\r\nThe little grass type came out. The tired Leafbon lasted two embers before finally going down. <br>\r\n\"Oh no!\" Forest cried  out.<br>\r\n\"Oh yes!\" Blush cheered, “I always said you were a loser.” Blush walked smirking. <br>\r\n“Dammit, this is my entire fault. It’s all cause I didn’t take them to the Pokémon Center. I’m so sorry!” <br>\r\n“Excuse me?” Said a breathy voice. Forest turned to see a girl about her age with long curly blonde hair and pale blue eyes. “I need some help.”<br>\r\n“I’m sorry I’m in a hurry. I need to get the Pokémon Center.”<br>\r\n“Why?” She asked.<br>\r\n“So I can heal my Pokémon.”<br>\r\n“Oh…” she said looking very thoughtful, “Uh, wait a minute,” She said as Forest began to walk away, Forest paused and turned back as the stranger spoke, “You’re in a hurry… because you need to go to the Pokémon Center…to heal you’re Pokémon…and that’s why you can’t help me, right?” she asked.<br>\r\n“Yes that’s right,” Forest nodded.<br>\r\n“So if you could heal you’re Pokémon right now…You could help me right?”<br>\r\n“I guess…” Forest said slowly.<br>\r\n“Well then, I’ll heal your Pokémon and then you can help me, okay?” <br>\r\n“Uh…”<br>\r\n</span></div></div>",
            "created":1323752400,
            "id":1239314,
            "title":"Go to the Contest!"
        },
        "14":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "next",
                "EVOLUTION"
            ],
            "content":"<div class=\"\"><div> <span>#001 Leafbon<br>\r\nSapling Pokemon<br>\r\nGrass type<br>\r\nHt. 2'4\"<br>\r\nLb. 5.25<br>\r\n<br>\r\nIt grows a delectable and nutritious fruit on its hands. Many Pokemon will hunt it just for a single bite.<br>\r\n<br>\r\n<br>\r\nImage: <a rel=\"nofollow\" href=\"http://fav.me/d67u2vs\" target=\"_blank\">http://fav.me/d67u2vs</a></span></div></div>",
            "created":1311829200,
            "id":1156648,
            "title":"Leafbon #1 "
        },
        "141":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "next",
                "EVOLUTION"
            ],
            "content":"<div class=\"\"><div> <span>#004 Freery<br>\r\nFireball Pokémon<br>\r\nFire type<br>\r\nHt. 2' 04\"<br>\r\nLb. 0.24<br>\r\n<br>\r\nThey tend to be found near the sites of recent volcanic explosions. They enjoy causing others to recoil in fear.<br>\r\n<br>\r\nImage: <a rel=\"nofollow\" href=\"http://fav.me/d68fr4y\" target=\"_blank\">http://fav.me/d68fr4y</a></span></div></div>",
            "created":1311829200,
            "id":1156670,
            "title":"Freery #4"
        },
        "1411":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "next",
                "EVOLUTION"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>#007 Starckler<br>\r\nSuction Pokémon<br>\r\nWater type<br>\r\nHt. 3'05\"<br>\r\nLb. 7.06<br>\r\n<br>\r\nThey gather in groups of three or four. Many humans attempt to hunt them.<br>\r\n<br>\r\n<br>\r\nImage: <a rel=\"nofollow\" href=\"http://fav.me/d68g1b4\" target=\"_blank\">http://fav.me/d68g1b4</a></span></div></span></div>",
            "created":1311829200,
            "id":1156681,
            "title":"Starckler #7"
        },
        "14111":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "next",
                "EVOLUTION"
            ],
            "content":"<div class=\"\"><div> <span>Zydrone<br>\r\nBug/Poison type<br>\r\nSharp point Pokémon<br>\r\nHt. 1'00\" Lb. 1.00<br>\r\n<br>\r\nThey colonize in trees and are highly territorial.  They contain lethal venom in the stingers on their abdomens.<br>\r\n<br>\r\nImage: Unavailable</span></div></div>",
            "created":1311829200,
            "id":1156726,
            "title":"Zydrone #10"
        },
        "141111":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "next",
                "FINAL EVOLUTION"
            ],
            "content":"<div class=\"\"><div> <span>Poshyup<br>\r\nNormal type<br>\r\nHot-headed Pokemon<br>\r\nHt: 1\"0'<br>\r\nLb: 15 lbs.<br>\r\n<br>\r\nPoshyup is pink dog with a white fluffy mane and a red bow on a fluffy white tail.<br>\r\n<br>\r\nThis Pokemon was bred to by ancient nobles as a lap dog. Somewhere along the way, they started using for battles. They have a spoiled nature, a bad temper, and are very loud. It usually lives in urban environments, like big cities.<br>\r\n<br>\r\nImage: Unavailable</span></div></div>",
            "created":1380509460,
            "id":1672022,
            "title":"Poshyup #13"
        },
        "1411111":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "next",
                "FINAL EVOLUTION"
            ],
            "content":"<div class=\"\"><div> <span>#015 Boohimp<br>\r\nChimp Pokemon<br>\r\nFlying/Fire type<br>\r\nHt: 1'08\"<br>\r\nLb: 13<br>\r\n<br>\r\nBoohimp is a white monkey with a green belly, white feathery wings, and bell on its neck, and a curly tail (like a rattatas).<br>\r\n<br>\r\nThey are playful, curious and sometimes mischievous. They live in the trees in forests and on top of tall buildings such as skyscrapers in cities.<br>\r\n<br>\r\nImage: Unavailable</span></div></div>",
            "created":1380509700,
            "id":1672024,
            "title":"Boohimp #15"
        },
        "14111112":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "content":"<div class=\"\"><div> <span>#016 Flockey<br>\r\nFlying/Fire type<br>\r\nChimp Pokemon<br>\r\nHt: 2'11\"<br>\r\nLb: 48<br>\r\n<br>\r\nFlockey is a green monkey with orange fur on its belly. It has white feathery wings, a bell on its neck, a tiny black cup shaped hat on its head, a black vest, cymbals on its wrists and a curly tail (like rattata).<br>\r\n<br>\r\nTo distract predators, it will bang its hands together to create a racket.<br>\r\n<br>\r\nImage: Unavailable</span></div></div>",
            "created":1380509880,
            "id":1672027,
            "title":"Flockey #16"
        },
        "141112":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "FINAL EVOLUTION"
            ],
            "content":"<div class=\"\"><div> <span>Zydronis<br>\r\nBug/Poison type<br>\r\nCocoon Pokémon<br>\r\nHt. 1'06\" Lb. 3.00<br>\r\n<br>\r\nZydronis hang upside down on dead trees and caves. They spend most of their time in hibernation, so they don't eat until they evolve. The horns are to fend off enemies and attack if it is knocked down. The same symptoms from its venom are found with ZYDRONE.<br>\r\n<br>\r\nImage: <a rel=\"nofollow\" href=\"http://fav.me/d5avymi\" target=\"_blank\">http://fav.me/d5avymi</a></span></div></div>",
            "created":1311829200,
            "id":1156780,
            "title":"Zydronis #11"
        },
        "1411121":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "content":"<div class=\"\"><div> <span>Beenonis<br>\r\nBug/Poison type<br>\r\nHoney Bee Pokémon<br>\r\nHt. 3'02. Lb. 10.06<br>\r\n<br>\r\nBEENONIS, are extremely territorial, until they are caught. Afterwards, they are calm and loyal. BEENONIS use their triangle to send telepathic messages to each other. Their stinger is high in toxins and can cause severe pain, paralyze, and possibly even kill. Their wings are that like BEEDRILL, so it can avoid moves that involve sound. Its mouth is located under its hair like structure. It eats berries and leafs.<br>\r\n<br>\r\nImage: <a rel=\"nofollow\" href=\"http://fav.me/d5bcieo\" target=\"_blank\">http://fav.me/d5bcieo</a></span></div></div>",
            "created":1311915600,
            "id":1156918,
            "title":"Beenonis #12"
        },
        "14112":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "FINAL EVOLUTION"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>#008 Starlan<br>\r\nWater/Dark type<br>\r\nHt. 6'4\"<br>\r\nLb. 50.62<br>\r\n<br>\r\nThey cling to WAILORD to get around.  They can swallow anything up to the size of a REMORAID whole.<br>\r\n<br>\r\nImage: Unavailable</span></div></span></div>",
            "created":1371153600,
            "id":1610451,
            "title":"Starlan #8"
        },
        "141121":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>#009 Starcklan<br>\r\nWater/Dark type<br>\r\nHt. 30'10\"<br>\r\nLb. 210.29<br>\r\n<br>\r\nThey swim deep in the ocean where no light can reach.  They are very dangerous creatures in the wild, though are very loyal to their trainers.</span></div></span></div>",
            "created":1371154980,
            "id":1610458,
            "title":"Starcklan #9"
        },
        "1412":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "FINAL EVOLUTION"
            ],
            "content":"<div class=\"\"><div> <span>#005 Fritsky<br>\r\nDancer Pokemon<br>\r\nFire/Ghost type<br>\r\nHt. 4'09\"<br>\r\nLb. 1.29<br>\r\n<br>\r\nThey gather at forest fires and dance gracefully for the duration of the tragedy.  The blue necklace they wear is said to help keep their humanoid shape.<br>\r\n<br>\r\nImage: Unavailable</span></div></div>",
            "created":1371151920,
            "id":1610436,
            "title":"Fritsky #5"
        },
        "14121":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "content":"<div class=\"\"><div> <span>#006 Freerlon<br>\r\nShrieking Pokemon<br>\r\nFire/Ghost type<br>\r\nHt. 6'03\"<br>\r\nLb. 2.00<br>\r\n<br>\r\nIt roams volcanic sites during the night.  It lets out hellish shrieks to startle travelers out of visiting these said sites.<br>\r\n<br>\r\nImage: Unavailable</span></div></div>",
            "created":1371152520,
            "id":1610445,
            "title":"Freerlon #6"
        },
        "142":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "FINAL EVOLUTION"
            ],
            "content":"<div class=\"\"><div> <span>#002 Trufbon<br>\r\nSucker Punch Pokemon<br>\r\nGrass/Fighting type<br>\r\nHt. 7'8\"<br>\r\nLb. 162.03<br>\r\n<br>\r\nIt uses the two growing fruits at the ends of its arms to attack predators.  They engage in friendly boxing matches with each other.<br>\r\n<br>\r\nImage: Unavailable</span></div></div>",
            "created":1371149880,
            "id":1610421,
            "title":"Trufbon #2"
        },
        "1421":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "content":"<div class=\"\"><div> <span>#003 Bonfroo<br>\r\nChampionship Pokemon<br>\r\nGrass/Fighting<br>\r\nHt. 10'9\"<br>\r\nLb. 200.6<br>\r\n<br>\r\nMany humans attempt to wrestle with these Pokemon, though many end up in hospitals.  They often fight for dominance amongst each other.<br>\r\n<br>\r\nImage: Unavailable</span></div></div>",
            "created":1371150840,
            "id":1610430,
            "title":"Bonfroo #3"
        },
        "15":{
            "author_id":"poppingcorn",
            "author_name":"Fredmom",
            "choices":[
                "Gym Leaders",
                "Elite Four Members",
                "Team Nuclear Members",
                "Rivals, Trainers, Ect."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, below are the options to make NPCs, such as:<br>\r\nGym-Leaders<br>\r\nElite Four Members<br>\r\nPC Creator<br>\r\nTeam Nuclear Members<br>\r\nEct.<br>\r\nAnyone can add!</span></div></span></div>",
            "created":1311829200,
            "id":1156798,
            "title":"List of Important Characters"
        }
    },
    "info":{
        "author_id":"poppingcorn",
        "author_name":"Fredmom",
        "brief_description":"Come see the new tropical region and catch all new Pokémon, battle gyms, and get ribbons.",
        "created":1306812720,
        "description":"<td align=\"left\" class=\"norm\"><span style=\"line-height:1.5;\">Hello, and welcome.  My name is Professor Hickory, and let me be the first to welcome you to the wonderful world of Pokemon!  In this world, there live people and Pokemon, and we maintain a special balance together.  For years, Pokemon and humans have lived alongside each other in peace and harmony.  Some people use Pokemon as pets and submit them into special contests in hopes of becoming a top coordinator.  For others, it's the thrill of being a trainer that drives them to face the Pokemon League.  As for myself, I study the unique way in which this island region, the Curina Region, affects this said balance between humans and Pokemon.  Strange things are play here, and I'm counting on you to help me.  Your very own Pokemon adventure is about to unfold!  Go on, get started!<br>\r\n<br>\r\nBACKGROUND:<br>\r\nThe Curina Region is a tropical island region located south of the Hoenn Region.  It has a total of 10 cities, and has access to the Sevii Islands. The Cities include:<br>\r\n<br>\r\nUgaria Town: A calm and peaceful place where you begin your journey.  It's located near the beach, and is where you live, as well as home to Professor Hickory's lab.  There is a beach port here where you can travel to the Sevii Islands.<br>\r\n<br>\r\nSunshine City: Located near Ugaria Town, Sunshine City is a bustling urban area, home to the contest hall and gym leader Catherine, one of the most powerful ghost type trainers in the region.  There is also a park here.<br>\r\n<br>\r\nFort Kinglapan: This city is a major military facility, home to the fighting type gym leader Markus.  There is also a Beginner's Trainer Tower here where trainers may raise their Pokemon, levels 5-20 accepted.<br>\r\n<br>\r\nSotetsu Town: This rural town is home to farmers.  It has a Pokemon school and a small field perfect for catching Pokemon at.  The gym leader here is Nathaniel, a grass type trainer.<br>\r\n<br>\r\nOgonsho City: This large city contains a museum, covering the history of the Pokemon world and such.  There is a Team Nuclear base located here, as well as a department store and a contest hall.  There is a road that leads to Mount Duston, though it is only accessible to those who are strong enough to enter.  Legend has it that the Sister Pokemon, Goldie and Silva, live here.<br>\r\n<br>\r\nShirogan City: This small city is home to gym the steel type gym leader Stephany, as well as the move deleter.  It has a large forest that is great for finding and planting berries.<br>\r\n<br>\r\nScarlett City: This ominous city is the heartland of the eerie story surrounding the Curina Region.  Legend has it that one of the most powerful trainers nearly caught the God Pokemon, Arceus, here before being cursed by the Angel Pokemon, Lafany, to live the rest of their life as a half Pokemon.  Professor Hickory visits here often for research.  The psychic type gym leader Dalin is here as well.<br>\r\n<br>\r\nYaju Town:  This populous town is home to the Safari Zone, located near the ocean and Sanglo Cave.  The dark type gym leader Merissa is here.  There is also a contest hall here, as well as a global terminal used for trading with the other regions.<br>\r\n<br>\r\nVandlet City:  This city is home to the people and Pokemon cemetery.  Professor Hickory often visits here for research as well, and there is also a Team Nuclear building.  The flying type gym leader Yolando is here.  There is a path that leads to Sanglo Cave here.<br>\r\n<br>\r\nSanbert City: This city is actually more or less a village.  There is a Daycare here, though rarely are there any people here.  Pokemon do wander the streets, however, though catching Pokemon that are not in caves, water, or tall grass is extremely prohibited here and will result in a visit from Officer Joy. The ground type gym leader Nathan is here.<br>\r\n<br>\r\nRULES:<br>\r\nWrite in story format<br>\r\nCussing Allowed<br>\r\nMake Up your own Pokémon<br>\r\nYou can have up to two rivals<br>\r\n<br>\r\nNotes:<br>\r\nOver 1000 views!<br>\r\nEDIT: 05/31/13 Added more detail to the intro of the story</span></td>",
        "id":1780879,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1415197440,
        "modified":1415197440,
        "pretty_title":"Pokémon: The Curina Region"
    }
}