{
    "chapters":{
        "1":{
            "author_id":"jjmigmen",
            "author_name":"myheartaches4u",
            "choices":[
                "Yutaro forces Yahiko to crawl",
                "Sano comes over "
            ],
            "content":"<div class=\"\"><div> <span>Yahiko Myojin was hard at work training. Kenshin and the others were out on a boat trip to England. He wanted to go but Kaoru was mad at him for failing to do his chores so as punishment he had to stay. This sucks he thought. Stupid cow. As he was venting he heard the door to the dojo open. Turning around he saw Yutaro. \"I came for my rematch Yahiko!\" Yutaro roared. \"Bring it on!\" Yahiko rushed Yutaro. Their swords clashed. \"Yahiko why don't we make this interesting. See in Europe we play a game of stakes. Loser has to do whatever the winner says. You up for it or are you a big baby a big baby chicken.\" Yutaro teased making baby chicken noises. \"I'm in I ain't no chicken!\" Yahiko exclaimed. Their battle was fierce. Yahiko had the upper hand until Yutaro broke his stance and pierced him winning the duel. Yahiko couldn't believe that he lost. He beat one of Shishio's men so why is it that he lost. \"I win.\" Yutaro proclaimed. \"Now as terms of our agreement you have to do everything I say. And I say you gotten soft like a newborn baby.\" Yutaro taunted Yahiko. \"What's that suppose to mean.\" Yahiko asked confused at the baby comment. \"Well Yahiko you see while studying with the doctor I saw this man who was about the age of Sano wearing diapers. He told the doctor he not only needed them due to infection but that he liked them. He was once a fghter to but got soft. So I'm comparing you to him. Hey that gives me an idea as an order for losing to me your going to be wearing diapers.\" Yutaro said. \"What no way.\" Yahiko replied back quickly. \"So your backing out of our deal how very unmanly of you Yahko.\" Yutaro egged Yahkio on. \"Fine get it over with. Within minutes Yahiko was in nothing but a diaper. \"Now what?\" Yahiko asked annoyed at the situation. \"Well for starters you can show more respect to your Daddy. And also you are going to be using your diapers like a good baby.\" Yutaro replied coldly. \"Your not my dad.\" Yahiko exclaimed. In a flash Yahiko found himself on Yutaro's lap. \"Looks like baby needs a spanking. Yahiko tried to break free but found he couldn't. He wondered how Yutaro got so strong. After 20 smacks Yahiko was in tears. \"Now apologize to me.\" Yutaro said. \"I'm sorry.\" Yahiko whined. \"Good boy now don't do it again.\" Yutaro said. Evening came and Yutaro had put a fussy Yahiko to bed. In the morning he was going to have fun with his new baby.   </span></div></div>",
            "created":1312101000,
            "id":1158479,
            "title":"Yahiko's rival...Daddy?"
        },
        "11":{
            "choices":[
                "Yahiko full of shame gives in",
                "Yahiko wet during the day"
            ],
            "content":"<div class=\"\"><div> <span>Yutaro woke Yahiko up. Yahiko protested being woken up so early. Yahiko got up and was about to put his pants on when he noticed the diaper. He had forgotten. \"Yutaro I'm not a baby let me do something else.\" \"Check again.\" Yutaro said pointing at Yahikos wet diaper.</span></div></div>",
            "created":1316462400,
            "id":1190335,
            "title":"Yutaro forces Yahiko to crawl"
        },
        "112":{
            "author_id":"smegalxring",
            "author_name":"Ahasreturned",
            "choices":[
                "Yahiko needs to pee",
                "Has to poop",
                "Yutaro takes him out for 'fun'"
            ],
            "content":"<div class=\"\"><div> <span>Yahiko just stared for a minute in disbelief at his wet diaper. \"What the hell!\" Turning to Yutaro. \"You did this, did you drug me!\" <br>\r\nYutaro smiling said. \"No you did this all on your own, now let me change you.\" He pulled another diaper out and tried to change Yahiko but soon after much fighting to hold him down. \"THAT'S IT! If you don't want a change then your going to spend the rest of the day in your wet diaper!\" Yutaro pulled something else out and slid it up over Yahiko's diaper and a 'click' and he got off Yahiko who now had what looked like a cage for his diaper with a thick lock.<br>\r\nYahiko tried to pull it off but it was to tight to his skin to come off and the lock needed a key and he looked at Yutaro to see him swallow the key and rub his belly saying hope I don't forget because your going to need a lot to breakout of that.</span></div></div>",
            "created":1499431620,
            "id":2348973,
            "title":"Yahiko wet during the day"
        },
        "12":{
            "author_id":"jjmigmen",
            "author_name":"myheartaches4u",
            "choices":[
                "Sano messes himself",
                "Yahiko accepts his diaper fate"
            ],
            "content":"<div class=\"\"><div> <span>Sano made his way to the dojo. He couldn't wait to see England. He got over his fear of boats. He found the dojo empty except for a sleeping Yahiko. \"Hey Yahiko wake up!\" Sano yelled. Yahiko sprung to his feet revealing his diaper. \"Uh Yahiko where is everyone and more importanly why are you wearing a diaper?\" Sano questioned. \"Idiot you slept in they left yesterday. And the reason I'm wearing these is..\" \"Me.\" Yutaro interjected. He told Sano everything including the fighter who was put in diapers. \"Man thats rough\" Sano laughed. \"Yahiko go play the grown-ups are talking.\" Yutaro said as he poured him and Sano some tea. \"You really went a little far with this revenge match kid.\" Sano said sipping the tea. \"Kid, I assure you Sano that I'm no child.\" Yutaro replied angrily at the kid comment. \"Relax kid no need to get your undies in a bunch.\" Sano said. Yutaro knew he chose rightly by drugging Sano's tea. He asked Sano with a smile on his face \"How's your teaaa.\" Sano was feeling dizzy he could barely hear anything. In a matter of minutes Sano was down and out. Yutaro had only meant to rob him so that he could afford a ferry ride home. This was so much better he thought as he diapered a sleeping Sano. \"Yahiko come in here now!\" Yutaro called. Yahiko who didn't want another spanking quickly came in. His eyes grew big as he saw Sano in nothing but a diaper. \"What did you do?\" Yahiko asked confused. \"Simple I got you a brother.\" Yutaro replied. Sano awoke and was livid. He was tricked and humilaited by a kid. He went to go teach Yutaro a lesson. He tried to have Yahiko help him but Yahiko said,\" No I'm a good boy. I'm a good boy.\" Sano thought to himself. Man that kid really messed with Yahiko. \"Yutaro you slime come out here and face me like a man.\" Sano was ready to beat the crap out of this kid. \"You should know your place.\" Yutaro replied making short work of Sano. Sano couldn't understand how he lost to Yutaro. It was as if Yutaro was on another level. \"Baby is confused I'll tell you. It's my wonder drug. I gave it to both you and Yahiko, now your both as helpless as babies. You'll bodies won't change. You'll still be the same age only, you'll lose all control of your bladder and bowels. In other words your babies stuck in grown-up bodies. And I'm your daddy. You and Yahiko will pay for treating me like a stupid child.\" Yutaro said enjoying the look of fear on Sano's face. \"Now be a good baby crawl.\" Sano found himself on all fours as he crawled around the dojo. He was mortified. Yahiko wet his diaper the effects of the drugs were beginning.    </span></div></div>",
            "created":1312102260,
            "id":1158483,
            "title":"Sano comes over "
        },
        "121":{
            "author_id":"jjmigmen",
            "author_name":"myheartaches4u",
            "choices":[
                "Sano gives in and becomes a good boy",
                "Sano resists and is punished"
            ],
            "content":"<div class=\"\"><div> <span>Yutaro was changing Yahiko, when he saw Sano in a full diaper. \"Sano come over here so Daddy can change you.\" Yutaro said. Sano refused. \"Fine get a diaper rash.\" Yutaro said putting a pacifier in Yahiko's mouth. \"Good boy.\" Yutaro said patting Yahiko on the head. \"Your brother he's a trouble maker. Since your more mature I'm making you his older brother. I have to go get some supplies from the store so your in charge okay.\" Yutaro said. Though Yahiko hated being treated like a baby he liked the idea of being able to boss Sano around. After Yutaro left Yahiko quickly established his role. He forced Sano down on the floor as he changed him. Sano was beat red after being manhandled by Yahiko. \"Yahiko..\" Sano was silenced as Yahiko shoved a bottle in his mouth. \"Time for a feeding.\" Yahiko said. \"No I don't want.\" Sano tried to fight but gave in and began to drink the milk from the bottle. Yahiko fixed himself a bottle of milk to. Yutaro came back with supplies. He gave Yahiko a reward for being good. He gave him a sippy cup. \"Good boy Yahiko your gowning up.\" Yutaro said. Yahiko smiled. He was starting to like this. He was bigger than Sano. \"Here this is for you baby Sano.\" Yutaro said rubbing diaper rash lotion on Sano's privates. \"Stop that!\" Sano yelled only to have his mouth shut by a pacifier that acted like a gag. He couldn't take it off. \"Babies don't talk do they?\" Yutaro questioned. \"Come Yahiko lets leave this baby alone.\" Yutaro said leading Yahiko to another room. Sano was left struggling to get the pacifier out of his mouth. In his struggling he wet himself. He was at first disgusted but then to his horror he found himself enjoying it. No he said he had to fight it. But it felt so good. He kept fighting it. He didn't want to give in but    </span></div></div>",
            "created":1312103580,
            "id":1158491,
            "title":"Sano messes himself"
        },
        "1212":{
            "author_id":"jjmigmen",
            "author_name":"myheartaches4u",
            "choices":[
                "Kenshin finds the two boys",
                "Megumi comes over"
            ],
            "content":"<div class=\"\"><div> <span>Sano resisted. Yahiko however was getting use to the diapers. He wet them as if it were natural thing. While Yahiko was playing Yutaro went to check on Sano. Sano cursed at him. Yutaro grew angry amd spanked Sano hard. Sano affected by the medicine began to cry. He knew he was a man but he couldn't stop. Yutaro comforted him and told him that babies shouldn't use such vulgar language. After awhile Sano to became a good bot. He would listen to Yutaro. He wet his diaper just like Yahiko. Yutaro was happy he got his revenge. He turned both Yahiko and Sano into helpless babies. With that he departed leaving them to wait for their friends return. </span></div></div>",
            "created":1312287360,
            "id":1159875,
            "title":"Sano resists and is punished"
        },
        "12121":{
            "choices":[
                "The boys punish Kenshin",
                "Kenshin finds another way to make it up to the boys"
            ],
            "content":"<div class=\"\"><div> <span>Kenshin blinked. He couldn't believe what he was seeing. Was he dreaming? He didn't quite know. \"Oro? Sano? Yahiko?\" The two boys looked towards the dumbfounded rurouni standing in the doorway, their faces turning a dark shade of crimson. \"Ah! Kenshin, y-you're back!\" Sanosuke stammered, nervously chuckling. Yahiko waved his hands frantically in front of himself, feeling embarrassed enough by the display Kenshin was witnessing. He shouted, \"W-wait! Before you come to any conclusions Kenshin, it was all Yutaro's fault! He made us wear diapers and crap!\" <br>\r\n\"Yeah! You gotta believe us!\"<br>\r\nKenshin shook his head, eyes wide and unsure of what to say about the situation. He ran his hand through his overhanging bangs and murmured, \"Kami-sama, why sessha?\" He forced himself to look to the two boys and said in a calm voice, \"You can go ahead and change out of those things if you'd like. I... won't tell Kaoru-dono what happened to you two today, but only if you hurry out of that get-up.\" <br>\r\nRelief washing over the two, the boys scurried off to the bathroom and changed into their regular wear before Kaoru made it back to the dojo. Upon Kaoru's return, dinner had been made and Yahiko, Sanosuke, and Kenshin warmly invited her home. Kaoru eyed them suspiciously as they ate at the table. \"Alright, I give. What in the right mind did you idiots do?!\" <br>\r\n\"N-nothin Jou-chan!\" Sanosuke hastily replied. \"What'd make you think that?\"<br>\r\nKaoru shrugged. \"I don't know... but...\" She smelled the air and nearly threw up. She covered her nose and winced. \"Yuck! What smells like crap in here?!?!\" <br>\r\nThe three boys shifted uncomfortably in their seats, averting their eyes away from Kaoru. Kaoru's suspicions grew higher and she rose from her spot on the floor, glaring. \"What did you do?!\" <br>\r\nFinally, Kenshin broke down under the pressure and blurted out what he had seen after returning back to the dojo. Kaoru gaped, eyes wide in astonishment. \"What?!\" Yahiko and Sanosuke advanced upon the unsuspecting rurouni. \"You promised you'd keep it a secret!\" Yahiko yelled. Kenshin sweatdropped. \"Oro...?\" \"Don't you 'oro' us! You promised you jack-ass!\" It was obvious both boys were angrier than all the wrath of Hell. <br>\r\nKenshin was in for a terrible punishment if they so chose to do so.  </span></div></div>",
            "created":1339655400,
            "id":1359249,
            "title":"Kenshin finds the two boys"
        },
        "12122":{
            "author_id":"jjmigmen",
            "author_name":"myheartaches4u",
            "choices":[
                "Megumi helps get them change"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Megumi came to the dojo to check in on Yahiko per Kenshins request. There she saw Sano and Yahiko in dirty diapers. She laughed causing Sano to turn away in shame.                                                                       </span></div></span></div>",
            "created":1312572900,
            "id":1162040,
            "title":"Megumi comes over"
        }
    },
    "info":{
        "author_id":"jjmigmen",
        "author_name":"myheartaches4u",
        "brief_description":"Boys in diapers. Sano in diapers. Humiliation.",
        "created":1312099860,
        "description":"<td align=\"left\" class=\"norm\">No character death.<br>\r\nYahiko ends up in diapers.<br>\r\nHave Fun.</td>",
        "id":1797990,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1499431620,
        "modified":1499431620,
        "pretty_title":"Rurouni Kenshin Yahiko's bad day"
    }
}