{
    "chapters":{
        "1":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "Go to Bon Bon",
                "Go to Blut Castle",
                "You bump into someone",
                "Readers Choice",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>You hear the train whistle shreik, followed by the voice the conducter. \"Alright folks, this is the end of the line, I repeat, this is the end of the line.\" Hearing that statement, you get up from your train bed and proceed to head out of the train station. Once you exit the building, the sun blares right in your face, obviously your eyes needed to adjust, considering that you were on the train all night. Once your eyes adjusted to the surrondings you got a clear view of what was around you. You were surrounded by a huge forest and there was a path in front of you. Since you didn't have a whole lot of options, you follow the path.<br>\r\n<br>\r\nAfter about 15 to 20 minutes of walking, you sit down onto a nearby log to rest for a minute. You then see a fork in the way with two paths going in opposite directions. In the middle of the fork there was a guide sign.<br>\r\n<br>\r\nTo the right, the sign said \"To Bon Bon.\"<br>\r\n<br>\r\nTo the left, the sign sain \"To Blut Castle.\"<br>\r\n<br>\r\nYou paused to think witch way you should go...</span></div></div>",
            "created":1421494140,
            "id":1919032,
            "title":"The Story begins.."
        },
        "11":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "Explore the town",
                "Look for a job",
                "Socialize among the crowds",
                "Readers Choice",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>You decided that this is no time for sight seeing and head to the right side of the fork in the road, to Bon Bon.<br>\r\n<br>\r\nAfter about 5 miuntes of walking, your see a breath-taking sight. You saw a medium sized city with a whole lot of gotty looking colors to it. To the right side of the road, there was a sign that said \"Welcome to Bon Bon.\"<br>\r\n<br>\r\nYou shook your head in disbelief, just to make sure you weren't dreaming. You shut your eyes for a couple of seconds and then re-open them.<br>\r\n<br>\r\nThe city was still there.<br>\r\n<br>\r\nYou tried to think of what to do next, now that you've found this place the possibility's are almost endless.<br>\r\n</span></div></div>",
            "created":1421494320,
            "id":1919034,
            "title":"Go to Bon Bon"
        },
        "111":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "a elegant, big breasted mouse.",
                "a young, beautiful squirrel.",
                "someone else."
            ],
            "content":"<div class=\"\"><div> <span>You make your way into the city, just looking around and seeing what was going on. All of a sudden, you catch something out of the corner of your eye. You look to the left and see an arousing sight. Two anthros, one black jackal and one gray she-wolf, were screwing each other like crazy. The she-wolf was screaming at the top of her lungs, due to the jackal constantly pounding her incredibly slimey, pink pussy.<br>\r\n<br>\r\nThe very sight of the couple mating got you terribly aroused. But you manage to control your feelings, and walk off before you did something that you would regret.<br>\r\n<br>\r\nWalking down the street, someone then speaks behind your back.<br>\r\n<br>\r\n\"Hey big boy.\" A female voice said.<br>\r\n<br>\r\nYou look around to see who exactly was talking to you.<br>\r\n<br>\r\n\"Behind you sweetie.\" The voice said.<br>\r\n<br>\r\nYou look behind you and find...</span></div></div>",
            "created":1421494440,
            "id":1919035,
            "title":"Explore the town"
        },
        "1111":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "Go with Betty to check out The Delight Castle",
                "Refuse",
                "You're a bit bussy looking at her outstanding boobs"
            ],
            "content":"<div class=\"\"><div> <span>You turn around to see a very beautiful, big chested mouse woman with golden fur and rather short hair.<br>\r\n<br>\r\n\"Uh... can I...uh...help you? You say to her bashfully.<br>\r\n<br>\r\n\"Yeah, I've never seen you in Bon Bon before, you new here?\" She questioned.<br>\r\n<br>\r\n\"Yeah uh I...uh just got here,and I need a place to stay.\" You reply.<br>\r\n<br>\r\n\"Hmm...where could you stay...Oh you could stay at The Delight Castle just over there.\" She suggests.<br>\r\n<br>\r\n\"Damn that's such big a place, I wonder who owns it?\" You ask.<br>\r\n<br>\r\n\"Heh Heh baby I own that place!\" She responds.<br>\r\n<br>\r\n\"SAY WHAT!!!\" You blurt out.<br>\r\n<br>\r\n\"My name is Betty Goldblum. Sole owner and proprietor of The Delight Caslte of Bon Bon\"<br>\r\n<br>\r\n\"You own that whole place???\" You ask stupified<br>\r\n<br>\r\n\"Uh Yeah...now are you gonig to keep talking or are you gonna come with me to The Delight Castle?\" Betty asks.<br>\r\n</span></div></div>",
            "created":1421494620,
            "id":1919037,
            "title":"an elegant, big breasted mouse."
        },
        "11111":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "Rent a room",
                "Play some games and meet people",
                "Go to the herbelist shop for a couple of rufies"
            ],
            "content":"<div class=\"\"><div> <span>You follow Betty down the citie's crowded streets to a HUGE castle type building. \"This is it. Shall we go inside.\" Betty said. \"Sure, why not.\" You reply back. \"Okay then follow me.\" You follow your host into the giant building. Once you are inside, your jaw falls down to the ground, as you see that this place had a casino, a strip club, a bar, a dining area, a brothel, a herbelist shop, a hotel, a study, and a pool!!! \"HOLY CRAP!!!!\" You blurt out uncontrollebly. \"It's pretty amazing, isn't it.\" Betty begins again. You merely nod 'yes' as your jaw continues to flap in the wind. Betty finally closes it. \"Well have fun, and try not to get into trouble.\" Betty says before bidding you farewell. <br>\r\nYou ponder on what you should do first...</span></div></div>",
            "created":1421494800,
            "id":1919039,
            "title":"Go with Betty to check out The Delight Castle"
        },
        "111111":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "King's Suite",
                "Regular Room",
                "Something else..."
            ],
            "content":"<div class=\"\"><div> <span>You walk into the lobby of the hotel district of the castle, and walk up to the counter to the receptionist, who is a chinchilla with silverish fur and hair bound in dual pony tails, not to mention a balcony that you could do Shakespeare from. (In other words, her tits are huge!)<br>\r\n<br>\r\n\"Hello, and welcome to the Delight Castle Hotel, are you interested in occupying a room?\" She asks politely.<br>\r\n<br>\r\n\"Yes, How much are rooms?\" You ask back trying not to stare at her massive cleavage.<br>\r\n<br>\r\n\"Um...lets see here, ah the King's Suite is $500 and a regular room is $50.\" She answers you.<br>\r\n<br>\r\n\"Both rooms include 3 meals a day at the buffet as well access to all current shows in the theater section of the Castle. However, if you choose the King's Suite, you can choos upto 3 girls per night to have as your personal harem.\" She said making and adorable expression and giggling, which made hare mostly exposed breasts jiggle.<br>\r\n<br>\r\n'Ouch, thats a lot of money, but it's worth it.' You thought to yourself 'Now what type of room should I have'</span></div></div>",
            "created":1421495340,
            "id":1919044,
            "title":"Rent a room"
        },
        "1111112":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "Room Service",
                "Betty (alone?)",
                "someone else?"
            ],
            "content":"<div class=\"\"><div> <span>For a moment you stare at the mostly exposed vast breasts of the chinchilla receptionist before you snap out. You have just enough money to rent a regular room.<br>\r\n<br>\r\n\"I guess, I'll just rent a regular room.\" you say. The curvy receptionist smiles and turns around to get you your key,giving you the opportunity to admire her ample bottom. \"As our guest you are allowed some privileges.\" she says as she hands you your key. \"Oh? And what are those?\" You ask in suprise. The girl leans and you again try not to stare at her buxom display resting on the counter. \"You of course have the standard 3 meals per day, access to most of the attractions in the castle, like the casino, the striptease theatre and music hall. You also have a 50% discount while taking the services of our castle ladies. You can also participate in any ongoing events currently happening at the castle.\"<br>\r\n<br>\r\n\"I see. And, if yo don't mind me asking, what prices do the local ladies ask for their \"services\"? \" you ask. \"Well, for an outsider some of the prices are pretty high, appropriatly to their position at the castle. But as I mentioned, you got the guests discount, not to mention that you pretty cute.\" she winks at you. You blush as you try to gather your excitement. \"If you're curious, my shift ends and 4 o'clock.\" she says giving you your key..<br>\r\n<br>\r\nIn your room, youve already unpacked and are changing. You also try to think what to do next, when suddenly you hear a knock on the door.<br>\r\n<br>\r\nWho is it?<br>\r\n</span></div></div>",
            "created":1421495580,
            "id":1919047,
            "title":"Regular Room"
        },
        "1111113":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "Is there a way you could get me a discount?",
                "Actually I was hoping to find a job.",
                "Let me think about it..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hearing the prices made you feel your waller shrink. You took a few seconds, while at the same time still admiring the curvy receptionist before you. After a minute or two you finally exclaimed..</span></div></span></div>",
            "created":1421495880,
            "id":1919049,
            "title":"Something else..."
        }
    },
    "info":{
        "author_id":"dsfuchs",
        "author_name":"DSFuchs",
        "brief_description":"A visit to the late XIX century town of furry debauchery.",
        "created":1421493840,
        "description":"<td align=\"left\" class=\"norm\">Somewhere in the mountains of middle Europe there is a small town, known only to chosen few. This town is known as Pleasure Bon Bon. It is a town where all sorts of pleasures are widely available in brought daylight, where beatiful women wear revealing clothes and are open to various propositions. It's a heaven and shelter to furries of all breed and type.<br>\r\nThe town also has its set of rules and handful of secrets which you can discover.<br>\r\n<br>\r\nHere are some of the characters you might meet on your way:<br>\r\n<br>\r\nBetty Goldblum - a chesty mouse who's the \"princess\" of what is known as the Delight Castle<br>\r\n<br>\r\nViolet Berry - Betty's slightly ditzy, raccoon best friend<br>\r\n<br>\r\nScarlet Blut - a local vampire, who delights in some bdsm play<br>\r\n<br>\r\nDalila and Ophelia Champagne - twin dogs who work and waitresses in the castle<br>\r\n<br>\r\nAnd many more...<br>\r\n<br>\r\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br>\r\nThis is a fan story of www.pleasurebonbon.com You may use the characters from the site or invent your own, but please keep to the tone and have fun.<br>\r\n<br>\r\nThe main character (you) is male, undisclosed species or characteristics, unless specified in previous thread.<br>\r\n<br>\r\nThis story is predominately straight.<br>\r\nEverything except the following goes: gore, vore, watersports, scat, rape, extreme violence, Macro, inflation, pedo, death, <br>\r\n<br>\r\nMight accept if set up well: Mind control, minor size changes, minor body modification, age play<br>\r\n<br>\r\nPlease add more than a paragraph per entry. Rewards for a good entry - the better the entry, the higher reward.<br>\r\n<br>\r\n</td>",
        "id":2026418,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1421495880,
        "modified":1421495880,
        "pretty_title":"A trip to Pleasure Bon Bon"
    }
}