{
    "chapters":{
        "1":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Beginning",
                "Important Info"
            ],
            "content":"<div class=\"\"><div> <span>My name is Amelia Tucker; I’m the Director of Public Relations for Benson Financial Services, a company was started by my dad George Benson.  I live in a quiet neighborhood with my husband Garrett and our twin sons, Jamie and Andrew.<br>\r\n<br>\r\nWhy am I telling you all of this?  I’m telling you this because I wasn’t always a 26-year-old married woman with two, soon to be three, children.  In fact; up until about 2 years ago, I wasn’t even a woman.  My name used to be Andrew Benson; and I was a spoiled, misogynistic bastard.<br>\r\n<br>\r\nEverything that I had in my life had been given to me; I never had to work for anything.  But that was nothing compared to how I treated women – not even close.  I thought that I was God’s gift to women and that I could do whatever I wanted with them.<br>\r\n<br>\r\nI thought everything was going great for me; I had an amazing girlfriend and a well-paying job at my dad’s company.  That was until I slipped up and made a complete ass of myself at a company party.  As a result, I was forced to live as a woman for a year; working as an assistant to a man that I’d recently hired.<br>\r\n<br>\r\nThey say you have to hit rock bottom before you can build yourself back up.  That was certainly the case for me; as it took losing everything that I thought was important to find out that I actually had nothing.<br>\r\n<br>\r\nThe following is a chronicle of everything that changed me from the man I was to the woman I became.<br>\r\n</span></div></div>",
            "created":1576386000,
            "id":2760090,
            "title":"A Preface"
        },
        "11":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Agree to the conditions",
                "Walk out of the room",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>I was in a great mood as I walked out of my condo that Monday after the July 4th weekend.  After going to a company party, I spent the weekend with some old frat buddies; we drank, got some girls – it was a blast.<br>\r\n<br>\r\nAs I entered the parking garage, I walked towards my recently purchased 2019 BMW 3 Series.  <i><span style=\"font-family:verdana, sans-serif\">When I bought that car, I told myself I was doing it to get girls.  Now whenever I see some guy driving around in one, I can’t help but think he’s just overcompensating for something.  None of my single girlfriends found guys who have them to be very attractive.</span></i><br>\r\n<br>\r\nClimbing into the car, I heard my cell phone start to ring.  A quick look at the dash showed it was my girl, Heather.  With a smile on my face, I answered it and said, “Hey babe, I missed you this weekend.”<br>\r\n<br>\r\n“Did you really miss me, Andrew?” angry, Heather said, “Seems to me like you had plenty of fun without me this weekend.”<br>\r\n<br>\r\nI had no idea what Heather was talking about as I pulled out of the parking garage.  “Whoa babe, what are you talking about?”<br>\r\n<br>\r\n“I saw Danny’s Instagram, you bastard; you were making out with that blonde slut at his condo.”<br>\r\n<br>\r\n“First off, she’s not a slut.”<br>\r\n<br>\r\n“So that’s supposed to make it alright?” scoffing, Heather said, “I’m tired of being treated like I don’t matter; I deserve a real guy who loves me.  We’re through!”<br>\r\n<br>\r\nHeather ended the call before I could respond.  <i><span style=\"font-family:verdana, sans-serif\">With the benefit of hindsight, Heather was right; she did deserve a better guy.  I’m happy to say that she did; having just gotten engaged to a great guy who treats her better than Andrew ever did.</span></i><br>\r\n<br>\r\nThe abrupt end of my relationship with Heather put a damper on my spirits as I continued the drive into work.  But it didn’t last long, because within minutes I’d already decided to go to the bar tonight and find some girl to bring home.  “There are plenty of girls out there for me; I’ll have a new girlfriend by the end of the night.”<br>\r\n<br>\r\n<span style=\"font-family:verdana, sans-serif\"><i>I hope that my sons won’t treat women like that when they’re older.  I also hope they’ll protect their sister from men like that – that’s right, Garrett and I just found out we’re having a girl.</i></span><br>\r\n<br>\r\nI pulled into the Gateway Business Park ten minutes later; driving up to my reserved spot outside the building that housed the family business – Benson Financial Services.  Getting out of the car, I walked into the building; waving at the receptionist as I walked by.  I was a bit confused when I saw her simply glare at me as I walked by, but I brushed it off as I took the elevator to the 3rd floor.<br>\r\n<br>\r\nAs I walked down the hall I came across my secretary, the beautiful Ms. Jessica Robinson, standing in front of the filing cabinet with her back turned to me.  <i>Maybe I’ll ask her out for drinks tonight.</i>  Walking up behind her, I grabbed her by the waist and said, “Good morning, beautiful.”<br>\r\n<br>\r\nJessica reacted by squealing in shock as she pulled away.  Turning to look at me, her a mixture of fright and anger, she said, “Good morning, Mr. Benson.”<br>\r\n<br>\r\nWalking past her, into my office, I said, “What do I have on the schedule today, Ms. Robinson?”<br>\r\n<br>\r\n“Your father wanted to see you as soon as you came in.”<br>\r\n<br>\r\n“I suppose I could make time for the old man.” Sighing, I said, “When I get back, I want to see the paperwork on the River Freight account.”<br>\r\n<br>\r\n<span style=\"font-family:verdana, sans-serif\"><i>I want to stress that I now have a good relationship with my Dad; he’s been nothing but supportive with everything over the last few years.  I know it sounds cliché, but I likely wouldn’t be the woman I am today if it weren’t for him.</i></span><br>\r\n<br>\r\nI went down the hall and took the elevator to the 4th floor.  As I got out of the elevator, I walked by a small number of women standing by the copier.  It was then that I started to notice a pattern; a lot of women were giving me angry looks today.  <i>What did I ever do to them?</i><br>\r\n<br>\r\nI stopped outside of my dad’s office; seeing his secretary, Helen Potts, sitting at her desk.  Good morning, Helen; I’m here to speak with my father.”<br>\r\n<br>\r\n“Go right in, Mr. Benson; he’s been waiting for you.”<br>\r\n<br>\r\nWalking passed her; I opened the door and walked into Dad’s office.  I found him sitting at his desk with Michelle Harding, the company lawyer, standing behind him.  “Hey, Dad, what’s up?”<br>\r\n<br>\r\n“Close the door and have a seat, Andrew.”<br>\r\n<br>\r\nClosing the door, wondering what was going on, I took a seat across from him.  “What’s going on, Dad?” looking at Michelle, I said, “Why’s Michelle here?”<br>\r\n<br>\r\n“It seems you’ve dug yourself into quite a hole, Andrew.” Sighing, Dad said, “Half the secretarial has threatened to file a sexual harassment lawsuit because of your actions at the party Friday night.”<br>\r\n<br>\r\n<i>What’s wrong with how I acted at the party?</i>  “What’s the big deal, so I had a couple of drinks and had some fun?”<br>\r\n<br>\r\n“I’ve received complaints from eight women who said you were behaving inappropriately towards them at the party.”  Opening the file in her hands, Michelle pushed it towards me and said, “While most of the complaints state you harassed them with flirtatious behavior, some of them stated you touched them inappropriately.”<br>\r\n<br>\r\n“Oh come on, that’s all bullshit.” Scoffing, I turned to Dad and said, “I’ve always been nothing but a gentleman to the female staff.”<br>\r\n<br>\r\n“I would keep your mouth shut if I were you.” Sighing, Dad said, “You’re in enough trouble already.”<br>\r\n<br>\r\n“But Dad...”<br>\r\n<br>\r\n“Be quiet Andrew!”<br>\r\n<br>\r\nI went silent as Michelle went back to her file.  “I’m afraid these aren’t the first complaints we’ve received about your actions towards women.” Rifling through the file again, Michelle said, “In the last year alone, I’ve had to quash three sexual harassment lawsuits; one from a client who said you made sexist remarks towards her regarding her pregnancy.”<br>\r\n<br>\r\nI think it’s only to note that I’ve been on the receiving end of pregnancy-related harassment a few times.  Mainly from older clients who think a woman should focus on her family instead of her career.<br>\r\n<br>\r\n“So what happens now?” with a cocky chuckle, I said, “Do I have to issue some apology and promise to treat women better?”<br>\r\n<br>\r\n“You’ll have to participate in sensitivity training after which, yes, you’ll have to give each of the women an apology.”<br>\r\n<br>\r\n“So I have to sit through some stupid class; that’ll be a piece of cake.”<br>\r\n<br>\r\nExchanging a look with Dad, Michelle turned to me and said, “I’m afraid it’s a little more complicated than that.” Pausing, she said, “In order for you to get the most out of the training; you’ll have to live as a woman for one year.”<br>\r\n<br>\r\nI was in disbelief; there was no way Michelle was serious.  “If that’s your idea of a joke, Michelle, it needs some serious work.”<br>\r\n<br>\r\n“I’m not joking, Andrew.” Stepping around the desk, Michelle sat in front of me and said, “You’ll live as a woman for one year; experiencing the same harassment that other women experience every day.”<br>\r\n<br>\r\nIgnoring Michelle, I turned to Dad as panic started to settle in.  “Dad, please tell me you’re not going along with this.”<br>\r\n<br>\r\n“You’re a problem, Andrew; one that practically writes its own hashtags.” Sighing, Dad looked at me and said, “Thankfully this is a problem with a solution.”<br>\r\n<br>\r\n“What are you talking about, Dad?”<br>\r\n<br>\r\n“It’s abundantly clear that you don’t respect women the way you should; based on the complaints and the contempt your showing Michelle.” Getting up, Dad leaned across the desk and said, “I can only imagine how you’d be having this conversation if it was with your mother or sister.”<br>\r\n<br>\r\nIt was becoming abundantly clear that the conversation was turning against me.  If Dad was willing to turn me into a woman, what would he do if I resisted?  Dozens of worst-case scenarios started to play through my mind – chief among them the idea that I’d be cut off.  Trying to improve the situation, I said, “Alright, so maybe I do have a problem with women.”<br>\r\n<br>\r\n“You don’t have a problem with women, Andrew; you ARE a problem with women.” Gesturing to Michelle, Dad said, “Thankfully Michelle has given us a solution to that problem once and for all.”<br>\r\n<br>\r\n“Dad, you’re talking about turning me INTO a woman!”<br>\r\n<br>\r\n“That’s right.” Sighing, Dad said, “Maybe then you’ll realize how terrible you’ve treated them.”<br>\r\n<br>\r\n<span style=\"font-family:verdana, sans-serif\"><i>I wish I could go back and tell my past self not to worry; that what was coming wasn’t the end of the world.</i></span>  Getting up, I headed towards the door.  “You’re crazy if you think I’ll let you get away with this.”<br>\r\n<br>\r\n“If you go out that door I’m cutting you out of my will.” Sighing, Dad said, “You’ll be left with nothing; no job, no inheritance, nothing.”<br>\r\n<br>\r\nI reached out to grab the doorknob, only to stop and pull back.</span></div></div>",
            "created":1576386000,
            "id":2760097,
            "title":"The Beginning"
        },
        "111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Back Home",
                "That Night",
                "The Next Morning",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Those people that knew George Benson well knew that he wasn’t the joking type.  I may not have believed that he was serious about turning me into a woman, but I wasn’t about to risk being cut off.  Turning around, I walked back to the desk and sat down.  “Let’s say I believe you; what happens to me now?”<br>\r\n<br>\r\n“Security will be asked to escort you from the building; we’ll come up with some reason to explain why you had to leave.”  Looking at me, Dad said, “After the procedure, you’ll have one day to adjust and then you’ll be back here on Wednesday for your first day as a secretary.”<br>\r\n<br>\r\nI couldn’t believe this was really happening.  Taking a breath, I said, “Just so we’re clear on this; are you going to turn me into some middle-aged woman like Ms. Potts?”<br>\r\n<br>\r\n<span style=\"font-family:verdana, sans-serif\"><i>For the record, Ms. Potts is a lovely woman.  She gave me these lovely hand-made hats and mittens for the boys while I was pregnant.</i></span><br>\r\n<br>\r\n“No, we won’t be doing that.” Sighing, Dad said, “As satisfying as that would be; you’ll be the same age you are now.”<br>\r\n<br>\r\nWhile Dad reached for his phone, probably to call security, I turned my attention to Michelle.  “I’m curious about one thing; what happens if I don’t learn my lesson?”<br>\r\n<br>\r\n“If you haven’t learned your lesson to the satisfaction of your father, you’ll be forced to remain as a woman permanently.” Looking at me, she said, “At which time you will be removed from your father’s will and forbidden from ever contacting the family again.”<br>\r\n<br>\r\n“Spending a year as a woman should be a piece of cake.” With a cocky smile, I said, “After being one for that long, I’ll have no problem getting women once I’m my old self again.”<br>\r\n<br>\r\n“I must ask that you take this seriously, Andrew.”<br>\r\n<br>\r\nIgnoring Michelle’s comment, I turned my attention to Dad as he got off the phone.  Looking at me, he said, “Security will be waiting for you at the entrance; where they’ll escort you to your car and make sure you leave the property.”<br>\r\n<br>\r\n“Whatever you say, Dad.” Getting annoyed by the whole situation, I stood up and said, “I’ll see you on Wednesday.”</span></div></div>",
            "created":1576472400,
            "id":2760435,
            "title":"Reluctantly Agree"
        },
        "1111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Driving to the Hospital",
                "At the Hospital",
                "Later On",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>I hadn’t expected to be let go from my job today, so I didn’t have anything planned.  After making a stop of the liquor store, I drove back to my condo.  With a 6 pack of beer in hand, I walked out onto the enclosed porch and looked out over the river.<br>\r\n<br>\r\nAs I took out a bottle to drink, I started thinking about the absurd punishment I was given for something I didn’t do.  <i><span style=\"font-family:verdana, sans-serif\">I did later realize that what I’d done to those girls was wrong, but at that point, I wasn’t ready to accept it.</span></i><br>\r\n<br>\r\n<div align=\"center\">**************************</div><br>\r\n<br>\r\nI was looking out over the water, drinking my 3rd bottle of beer, when I heard a knock at the door.  I wondered who could possibly be at the door; since, as far as anyone knew, I was supposed to be at work.<br>\r\n<br>\r\nBottle in hand, I walked through the main room.  Opening the door, I found my younger sister Emily standing there; an inter-office envelope in her hands.  Emily and I both worked for Dad; while I worked in the Accounting Department, she worked in the Legal Department.  Looking at her standing then, in her neatly pressed skirt suit, I said, “What do you want, Emily?”<br>\r\n<br>\r\n“Considering the trouble you’re in, Andrew; I’d drop the attitude.” Walking through the door, Emily said, “Dad sent me over here to have you sign a contract saying you agreed to do this.”<br>\r\n<br>\r\n“I was pressured into agreeing with this.” Closing the door, I said, “I’m not signing anything that involves me becoming a woman.”<br>\r\n<br>\r\nEmily made her way towards the kitchen area; helping herself to a bottle of water from my fridge.  Bitch doesn’t even ask; she just goes right ahead.  “Look, I’m not happy about this either; I can’t stand the idea of both of us sharing the same gender.” Placing the envelope on the counter, Emily said, “But it’s either this or you’re cut from the will.”<br>\r\n<br>\r\n“I would’ve thought you of all people would love to have me out of the will.” Sighing, I said, “With me gone that would mean more for you.”<br>\r\n<br>\r\n<span style=\"font-family:verdana, sans-serif\"><i>To this day I regret saying that; because Emily is one of the hardest working people I know.  She could’ve gotten a job at a major firm in the city, but she decided to work for Dad instead.</i></span><br>\r\n<br>\r\n“While that does appeal to me, I still think it’s in your best interest to sign this.”<br>\r\n<br>\r\n“You realize what they want me to do, right?” scoffing, I said, “Dad and that bitch Michelle think that forcing me to be a woman will help me?  What can I possibly learn from being a weak, pathetic woman that I don’t already know from being a guy?”<br>\r\n<br>\r\n“How about learning what it’s like to be on the receiving end of sexual harassment?” looking at me, she said, “Then just maybe I could have my older brother back?”<br>\r\n<br>\r\n<i><span style=\"font-family:verdana, sans-serif\">Emily and I used to be inseparable as kids, but we slowly grew apart.  We’re much closer now; doing activities that you’d typically see sisters doing together.</span></i><br>\r\n<br>\r\nI started to realize that Emily wasn’t going to leave without me signing the contract.  Putting the beer down, I said, “Just give me the damn thing so I can sign it and get you out of here.”<br>\r\n<br>\r\n“Actually, once you sign it, I’m supposed to bring you to the hospital for the procedure.”<br>\r\n<br>\r\nI begrudgingly signed the papers; while doing so, I looked at Emily said, “Tell me the truth; how long have you known about this?”<br>\r\n<br>\r\n“Dad and Michelle came up with this idea months ago; after it became clear you were becoming a problem for the company.”  <br>\r\nLeaning against the wall, Emily said, “But if you’re talking about what happened at the party; I found out that night.  One of the girls that you harassed happened to be my assistant.  After she told me what happened, I told her to file the complaint.”<br>\r\n<br>\r\n“This was your idea?” slamming the pen down on the table, I said, “You’re the reason I have to spend the next year living as a woman?”<br>\r\n<br>\r\nUnsettled by my outburst, Emily said, “As I said, this is for your own good.”<br>\r\n<br>\r\n“We’ll see about that.” Shoving the contract towards Emily, I said, “There’s your stupid contract; now let's go to the hospital and get this over with.”</span></div></div>",
            "created":1576472400,
            "id":2760528,
            "title":"Back Home"
        },
        "11111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Procedure",
                "After the Procedure",
                "Later On",
                "The Next Day",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Had I not been drinking that day, I probably would have been suspicious when Emily insisted we take her car to the hospital.  But in light of the fact that I’d already had 3 beers before noon, I wasn’t going to make a big deal about it.<br>\r\n<br>\r\nAs Emily drove down the road, I turned to her and said, “So what does Mom think of Dad’s plan?”<br>\r\n<br>\r\n“She was hoping it wouldn’t come to this.” Sighing, Emily said, “But she agrees with dad that it’s for your own good.”<br>\r\n<br>\r\n“So let me get this straight; everyone, including the bitch Michelle, knew about this plan except for me?” my head suddenly pounding, I said, “Don’t you think I should have been told about this?”<br>\r\n<br>\r\n“Dad thought it would be better if you were kept in the dark.”<br>\r\n<br>\r\n“Let’s say, for argument's sake, that I do mistreat women.” looking at Emily, I said, “Don’t you think I would’ve changed my attitude if I knew this could happen?”<br>\r\n<br>\r\n“I guess we’ll never know now, will we?” coming to a stoplight, Emily retrieved another envelope from her back seat.  Handing it to me, she said, “You should read this; it has everything you’ll need to know about the identity Dad had set up for you.”<br>\r\n<br>\r\nI begrudgingly took the envelope from and poured the contents onto my lap.  The first thing that caught my eye was a birth certificate that said – Amelia Renee Sullivan.  There was also a social security card that said the same name.  I started to wonder how they could create these documents when I realized they’d found a way to forcibly turn me into a woman.<br>\r\n<br>\r\nIt wasn’t until I found a small envelope containing keys; to both an apartment and a car, that I had to question what was happening.  “What’s the deal with these keys, Emily?” looking at her, I said, “I already have a condo and a car.”<br>\r\n<br>\r\n“Not anymore, you don’t.”<br>\r\n<br>\r\n“What’s that supposed to mean?”<br>\r\n<br>\r\n“Do you really think a secretary can afford to live in a $50,000 condo and drive a BMW?” turning to me, she said, “I’m afraid the best you can afford is a fourth-floor walkup and a 2003 Camry.”<br>\r\n<br>\r\n“This is bullshit!” throwing everything on the ground, I said, “When Dad and Michelle forced this on me, they said nothing about me living like a poor person.”<br>\r\n<br>\r\n*I feel I should mention that my dad’s company pays its secretaries very well.*<br>\r\n<br>\r\n“I don’t know what to say, Amelia; that’s all you can afford on your salary.” Pulling into the hospital parking lot, Emily said, “Perhaps if you’d focused more on classes in college instead of sleeping around, you would’ve gotten a better job.”<br>\r\n<br>\r\nAs the two of us got out of the car, I turned to Emily and said, “Just so you know, I’m going to make sure everyone regrets doing this to me.”</span></div></div>",
            "created":1576558800,
            "id":2760878,
            "title":"The Drive to the Hospital"
        },
        "111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Once we were inside the hospital, Emily and I took the elevator to the Out-Patient Surgery wing.  She must’ve called ahead or something; because upon stepping out of the elevator, we were met with two nurses.  They gestured for us to follow them down the hall; in doing so, I noticed them giving me looks of disdain.  <i>Do they know what’s about to happen to me?</i><br>\r\n<br>\r\nBringing me into an empty room, her disdain evident in her tone, one of the nurses handed me a hospital gown.  “Take off your clothes and put this on.”<br>\r\n<br>\r\nI’d barely had a chance to put on the gown before a doctor walked into the room.  She looked to be in her mid-30s; part of me imagined asking her out if I’d seen her at a bar.  “Are you Andrew Benson?”<br>\r\n<br>\r\n<i>I guess she’s not one for pleasantries.</i> “Yeah; for a while longer at least.”<br>\r\n<br>\r\n“Please lie down on the bed.” Walking towards me, with two syringes in her hand, she said, “I’m going to give you a muscle relaxer first; it’ll help make the procedure easier for you.”<br>\r\n<br>\r\n[i}Lady, you’re talking about turning me into a woman.  Nothing is going to make that easier for me.  After I lied down on the bed, she injected me with the muscle relaxer; followed by the other injection.  “So how is this supposed to work, anyway?”<br>\r\n<br>\r\n“The procedure involves nanotechnology.” Removing her gloves, the doctor said, “I should warn you; if you should become pregnant, we won’t be able to reverse the procedure.”<br>\r\n<br>\r\n<i>Believe me lady; I have no intention of getting pregnant.</i>  “I’ll try to keep that in mind.”<br>\r\n<br>\r\nWithout saying another word, she left the room.  I wanted to wave goodbye but suddenly found that I couldn’t move.  I wanted to ask why, when my skin started tingling.<br>\r\n<br>\r\nAs I laid the table, unable to move, I became aware of two different sensations: a growing weight on my chest followed by an unnerving, diminishing feeling below my waist.  <i>Sorry girls, this wasn’t my idea.</i><br>\r\n<br>\r\n*For the record, women aren’t as interested in the size of a man’s package as they think we are.  What we really care about is whether they have a good personality.*<br>\r\n<br>\r\nAfter about 10 minutes the tingling subsided and I got the feeling back in my limbs.  I tried sitting up but found my sense of balance was off.  After some trial and error, I corrected for the difference and sat up on the bed.<br>\r\n<br>\r\nA few more minutes passed and I felt confident enough to try walking.  I made my way across to a full-length mirror and got my first look at my new reflection.<br>\r\n<br>\r\nI was now a hot blonde.  Almost on impulse, I took off the gown and checked myself out.  I had D-cup breasts and an hourglass figure.  On top of that I couldn’t have been more than 5’5”; a far cry from just minutes earlier.<br>\r\n<br>\r\nGiving my boobs a squeeze, I said, “At least I’m a good looking girl.”<br>\r\n<br>\r\nEmily must’ve walked into the room at that point.  “Congratulations; you’ve finally found a woman you can grope without her reporting you to HR.”</span></div></div>",
            "created":1576558800,
            "id":2760974,
            "title":"The Procedure"
        },
        "1111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Apartment",
                "The Mall",
                "The Bar",
                "Somewhere Else",
                "Somewhere Else"
            ],
            "content":"<div class=\"\"><div> <span>“I suppose this is your idea of a joke; turning me into a blonde.”<br>\r\n<br>\r\n“This isn’t a joke, Andrew.” Sighing, Emily said, “God, this is supposed to teach you a lesson.”<br>\r\n<br>\r\n“Teach me a lesson about what?” scoffing, I said, “How I shouldn’t objectify women?”<br>\r\n<br>\r\n“That’s exactly it.” With a grin, Emily said, “To think people say blondes aren’t that bright.”<br>\r\n<br>\r\n*I can’t stand that stereotype.  My sister-in-law is blonde and she’s one of the smartest people I know.*<br>\r\n<br>\r\nSitting back down on the bed, I said, “So what happens now?”<br>\r\n<br>\r\n“That’s entirely up to you; since you don’t start work again until Wednesday.” Looking at me, Emily said, “Might I suggest taking a day to adjust.”<br>\r\n<br>\r\n“It’s going to take longer than a day for me to adjust to this.” Getting annoyed, I said, “Dammit Emily, I can’t believe you guys did this to me.”<br>\r\n<br>\r\n“First off; you brought this on yourself.” Taking a breath, Emily said, “Secondly; get all those Dads and Emily’s out of your system.  Come Wednesday it’s going to be Mr. Benson and Ms. Benson.”<br>\r\n<br>\r\n“Are you serious?”<br>\r\n<br>\r\n“You aren’t Andrew Benson anymore; legally you’re Amelia Sullivan.” Pausing, Emily said, “For the next year we’re not family; you’re just an underling working for my dad’s company.”<br>\r\n<br>\r\n<div align=\"center\">*******************************</div><br>\r\n<br>\r\nEmily left a short time later; but not before leaving me with some clothes to change into.  I wanted to scream at her when I saw the clothes she’d left me – a dress that showed off too much cleavage, even by my standards, and some knee-high boots.<br>\r\n<br>\r\nI stood by the bed, staring at the clothes for what seemed like an eternity.  Part of me was tempted to just walk out in the hospital gown, but that wasn’t a very good idea.  With little recourse, I begrudgingly changed into the outfit.  I stumbled a few times as I walked down the hall but thankfully I didn’t fall.<br>\r\n<br>\r\nAs I walked past the nurses’ station, one of the nurses said, “Ms. Sullivan?”<br>\r\n<br>\r\nI almost continued walking until I remembered that was my name now.  Turning around, I walked back to the desk and said, <br>\r\n“Yes?”<br>\r\n<br>\r\nPutting a purse on the counter, along with the set of keys from earlier, the nurse said, “These were left for you; along with a note.”<br>\r\n<br>\r\nDigging through the purse, I found the note:<br>\r\n<br>\r\n<i>Ms. Sullivan,<br>\r\nYour car is parked on Level 4, Spot 110.  Try not to be late on your first day.<br>\r\nMs. Benson</i><br>\r\n<br>\r\nAfter thanking the nurse, I grabbed everything and started towards the elevator.  Once I was on the ground floor, I made my way out of the lobby; noticing some people looking at me as I walked past.  If only they knew I wasn’t always a woman.<br>\r\n<br>\r\nArriving at the parking garage, I quickly found the 2003 Camry that was now my car.  Looking at it, I couldn’t believe the piece of junk before me was my transportation for the next year.  *The car was actually quite nice; I just didn’t want to admit it at that point.*<br>\r\n<br>\r\nGetting into the car, I spent a few minutes making myself as comfortable as I could.  <i>Damn seatbelt keeps squishing my breasts.</i>  Once I was settled, I turned the car on and drove out of the garage.  Stopping at the hospital exit, I wondered where I should go first.</span></div></div>",
            "created":1576645200,
            "id":2761164,
            "title":"After the Procedure"
        },
        "11111112":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "At Mom's Art Gallery"
            ],
            "content":"<div class=\"\"><div> <span>As I drove through town, I formed a plan to force my family to turn me back.  Settling on making a complete fool of myself in public, I decided to go to the mall to buy some outfits for the plan.<br>\r\n<br>\r\nIt was a quick 10-minute drive to the mall; I parked close to the entrance so I didn’t have far to walk.  As I made my way to the door I noticed a man, probably a few years younger than me, standing by the door.  <i>Why’s this guy just standing there?</i><br>\r\n<br>\r\nI was about to ask what he was doing when he suddenly reached over and opened the door for me.  Surprised by the gesture, all <br>\r\nI could manage was a quick ‘thank you’ as I walked by.  The man smiled and said, “You’re welcome, ma’am.”<br>\r\n<br>\r\nAs I walked into the mall, I turned around and caught a glimpse of the guy staring at my ass before I rounded the corner.  <i>If only he knew the truth about me.</i><br>\r\n<br>\r\nI quickly made my way through the mall to Macy’s; where I found myself looking through the dresses they had on the wall.  I was looking at a black dress when a sales clerk walked up to me.  “Can I help you, ma’am?”<br>\r\n<br>\r\nTurning in the direction of the voice, I saw a young girl standing there; probably no more than 18 or 19.  If I had been a guy, I totally would’ve been flirting with her right now.  “Yeah, I’m looking for something that I can wear to the club.”  Putting on a fake smile, I said, “I just broke up with my boyfriend and I could totally go for some rebound sex.”<br>\r\n<br>\r\n“Well, you definitely have an eye for fashion.” Smiling, the girl said, “I wear a dress similar to this when I go clubbing with my girls.  With this dress and your figure, you’ll be very popular in the club scene.”<br>\r\n<br>\r\nThat was just what I wanted to hear; if my family caught wind of me hanging out the clubs with a bunch of guys, they’d quickly decide to change me back.  *I can’t believe how naïve I was back then.*<br>\r\n<br>\r\n“Thanks for the advice.” Smiling, I said, “I think I’ll take this one.”<br>\r\n<br>\r\nThe girl smiled and walked off; giving me a chance to check her out as she did.  Taking the dress off the rack, I went over to a mirror and held it up to my body.  <i>Damn girl, you’ll look hot in this!</i><br>\r\n<br>\r\nWith the dress in hand, I went to the register to pay for it.  It was only then that I wondered how I was going to do so; Emily had mentioned I no longer had access to my bank account.  Digging through the purse, I found a debit card from a local bank.  <i>I guess that’s better than nothing.</i><br>\r\n<br>\r\nAfter paying for the dress, I decided to get something to eat at the food court before leaving.  I can only imagine what people were thinking when they saw me scarf down a huge cheeseburger.  *I thankfully rarely eat fast food now; mostly when I’m out shopping with the twins.  Otherwise, I try my best to maintain my figure.*<br>\r\n<br>\r\nOnce I was done at the mall, I walked back out to the car.  As I got inside, I quickly realized I was close to my mom's art gallery.  Emily had told me Mom knew what Dad had planned for me, but I had to find out for myself.</span></div></div>",
            "created":1576645200,
            "id":2761200,
            "title":"The Mall"
        },
        "111111121":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Talking with Mom",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>While Emily and I had followed in Dad’s footsteps, my mom had started her own art gallery downtown.  My mom, Darlene Benson, was a very persuasive woman; people generally did what she asked them to do without question.  It was my hope that she could convince Dad to change me back.<br>\r\n<br>\r\nParking in front of the gallery, I put on my best impression of a cheerful woman and walked inside.  I was slowly getting the hang of walking in heels, but each click-clack on the tile floor served as a reminder that I was no longer a man.<br>\r\n<br>\r\n*I generally try not to wear heels if I can avoid them; they’re terrible on my back.  I usually only wear them on special occasions, but I find I can’t wait to get out of them.*<br>\r\n<br>\r\nWalking up to the front counter, putting on a smile, I looked at the young woman behind the counter and said, “Hi, my name is Amelia Sullivan; I’d like to speak with the owner about making a purchase.”<br>\r\n<br>\r\n“Of course, I’ll see if she’s available.” Gesturing to a set of nearby chairs, the woman said, “If you have a seat, I’ll let you know when she’s available.”<br>\r\n<br>\r\n“Thank you.”<br>\r\n<br>\r\n<div align=\"center\">***********************</div><br>\r\n<br>\r\nI ended up sitting in the waiting area for about 20 minutes before the receptionist said, “Mrs. Benson can see you now, ma’am.”<br>\r\n<br>\r\nAfter giving a polite wave as I walked by, I made my way through the glass doors that led to Mom’s office.  Arriving outside the door, I peeked inside to find Mom looking at a file on her desk.<br>\r\n<br>\r\nWalking inside the office, I closed the door behind me.  In as derisive a tone as possible, in an attempt to show my anger about what was happening, I said, “Hello mother.”<br>\r\n<br>\r\nStartled, Mom dropped the file and looked at me.  “Andrew, is that you?”</span></div></div>",
            "created":1576645200,
            "id":2761284,
            "title":"At Mom's Art Gallery"
        },
        "1111111211":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Apartment",
                "Later On",
                "That Night",
                "The Next Day",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>“Don’t act surprised, Mom.” Walking over, I sat in a chair across from her.  “Emily told me you were in on this.”<br>\r\n<br>\r\n“I truly wish it hadn’t come to this, Amelia.”<br>\r\n<br>\r\n“Don’t call me that!” getting frustrated, I said, “My name is Andrew, and no amount of paperwork and procedures is going to change that.”<br>\r\n<br>\r\nGetting up, Mom walked around her desk until she was in front of me.  “I’m sorry it came to this, Amelia; but this is for your own good.”<br>\r\n<br>\r\n“That’s bullshit and you know.” Sighing, I said, “Do you really think this is going to change how I act around women?”<br>\r\n<br>\r\n“Yes, I sincerely believe this will help you.” With a smile, Mom said, “When it’s all over, I suspect you’ll be thanking us for putting you through this.<br>\r\n<br>\r\n“I highly doubt that.”<br>\r\n<br>\r\n*I wouldn't call my mother psychic, but she was right on the money. I thank them every time I see them.*<br>\r\n<br>\r\n“What did you think was going to happen when you came here?” looking at me, Mom said, “Did you think I’d take your side and convince your father to change you back?”<br>\r\n<br>\r\n“Yeah, I had hoped you’d be reasonable about this.”<br>\r\n<br>\r\n“I’m afraid I won’t be able to change you back early, but I will do something for you.” Getting up, Mom said, “Your father won’t like this if he finds out, but my door is always open if you need someone to talk to.”<br>\r\n<br>\r\nI was confused as to why Mom was saying that.  Looking at her, I said, “Emily told me I couldn’t act like you guys were family.”<br>\r\n<br>\r\n“I’m certain she meant at the office; where it would be hard to explain.” Pausing, Mom said, “I’m not saying you can approach me if I’m with your father, but I’m still your mother and I want to help you.”<br>\r\n<br>\r\n“Thank you.” Genuinely touched, I said, “I-I really appreciate that, mom.”<br>\r\n<br>\r\n*I wasn’t devoid of all respect for women, even back then.  I still appreciated when my mom helped me through something.*<br>\r\n<br>\r\n“Now I suggest you leave; because your father is coming to take me to lunch.” Pulling me in for a hug, Mom said, “I love you sweetie, and I know you’ll get through this.”<br>\r\n<br>\r\nI suddenly found myself not wanting to let go of Mom, but I knew Dad wouldn’t like it if I was here.  “I love you too, mom.”<br>\r\n<br>\r\nAfter grabbing my purse, I quickly made my way out of the building.  Deciding it was time to go to the apartment, I left the parking lot just as Dad drove in.</span></div></div>",
            "created":1576645200,
            "id":2761366,
            "title":"Talking with Mom"
        },
        "11111112111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Getting Ready",
                "The Club",
                "Sometime Later",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>The apartment complex where I’d be living for the next year was on the complete opposite side of town from my condo.  The only saving grace that I could see was that it was in a relatively quiet area; other than that, the place was rather dingy for my tastes.<br>\r\n<br>\r\nAfter parking the car in front of my building, I grabbed my things and went inside.  I silently cursed Emily for making we wear heels; because I wasn’t ready to walk upstairs wearing them.  I eventually reached the apartment, #405, and let myself inside.<br>\r\n<br>\r\nIf I hated what the place looked like on the outside, my opinion of the inside wasn’t that far off.  The apartment consisted of a small living area; with a detached kitchen to one side plus a hallway leading to a bathroom and bedroom.  The furniture, from what I could tell, was rather old; reminding me of something you’d see in a retirement home.<br>\r\n<br>\r\n*The apartment wasn’t actually all that bad; I just didn’t want to admit it at the time.*<br>\r\n<br>\r\nWalking into the bedroom, I noticed the closet was filled with an assortment of dresses and skirt suits.  Throwing the dress I’d just bought on the bed, I collapsed onto the mattress.  “This has to be a dream; this can’t really be my life now.”<br>\r\n<br>\r\nAfter lying there for a few minutes, I sat up and found my attention drawn to a series of picture frames on the dresser.  Going over for a closer look, I saw there were pictures of me; or at least the blonde bitch that I’d been turned into.  That wasn’t the only thing that caught my attention – the photos were of me with other people in a variety of locations; college graduation, on a beach wearing a bikini, and what looked to be some formal dance with other girls.<br>\r\n<br>\r\n<i>If they can turn me into a girl, I suppose it’s not too hard to make some fake photos.</i>  Leaving the bedroom, I realized that I hadn’t used the bathroom yet in my new body.  I was about to walk to the bathroom when there was a knock at the door.<br>\r\n<br>\r\nGoing to the door, I looked through the peephole and saw some brunette standing there.  For some reason, she looked very familiar to me.  Opening the door, I said, “Can I help you?”<br>\r\n<br>\r\n“I’m Marcy, I live across the hall.” Extending her hand, Marcy said, “I heard some movement inside and thought I’d come to introduce myself.”<br>\r\n<br>\r\n“It’s nice to meet you, Marcy.” Shaking her hand, I said, “My name’s Amelia.”<br>\r\n<br>\r\n“What brings you to town?”<br>\r\n<br>\r\n<i>You wouldn’t believe me if I told you.</i>  “Work.” Trying my best to look cordial, I said, “I just got a job as a secretary at Benson Financial Services.”<br>\r\n<br>\r\n“No way!” looking at me, Marcy said, “I work in the Accounting department there!”<br>\r\n<br>\r\n<i>That’s how I know her!</i>  “Talk about a small world, huh?”<br>\r\n<br>\r\n“I know, right!” chuckling, Marcy looked at me and said, “I’m going out clubbing tonight with some girls from work.  You want to come along and get to know some people?”<br>\r\n<br>\r\nThat would play perfectly into my plan to force my parents to change me back.  “Sure, I’d love to.” Smiling, I said, “I just bought the perfect dress for the occasion.”<br>\r\n<br>\r\n“We’re going to that new club, Elysium that just opened up on 5th Avenue.” Smiling, Marcy said, “How about we meet down in the lobby at 6:30 and we can go together.”<br>\r\n<br>\r\nFor the second time today, I was surprised by the kindness shown me by two women who I didn’t know.  “Sounds like a plan to me, I’ll see you then.”</span></div></div>",
            "created":1576731600,
            "id":2761541,
            "title":"The Apartment"
        },
        "111111121111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "At The Club",
                "Later On",
                "Leaving the Club",
                "The Next Day",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>I waited until around 5:15 to start getting ready to go clubbing; having spent much of the day prior to that drinking and fuming about my situation.<br>\r\n<br>\r\nI had just finished taking a shower, which was an interesting experience, and I was standing naked in front of the bathroom mirror trying to decide my next move.  Having never taken a shower in a woman’s body, I had no real clue about what to do next.  All I had to go on was memories of what Heather and Emily would do – the first step was to dry my hair.<br>\r\n<br>\r\nAs I rummaged through the cabinets for a hairdryer, I made a mental note – if I was going to be stuck in this situation for the foreseeable future, I’ll need to learn how to take care of myself.  Once my hair was sufficiently dried, I put the hairdryer down and walked across the hall to the bedroom.<br>\r\n<br>\r\nTurning my attention to the dress I’d purchased, I decided it was time to put it on.  It ended up being a little snug but it wasn’t uncomfortable.  If anything it was snug in just the right places – exemplifying my breasts and my figure.  <i>Boys won’t be able to keep their hands off me tonight.</i>  At that moment I realized what exactly I was doing; I was making myself look sexy to attract a guy’s attention.  Having recently been a guy myself, the notion wasn’t something I was comfortable with; but it was something that needed to be done.<br>\r\n<br>\r\nWalking back into the bathroom, I finished working on my hair before proceeding to the makeup.  Having been one, I knew what boys liked; so I simply put on enough makeup to make myself look good.<br>\r\n<br>\r\n*I never really bought into the idea that a girl has to make herself look trampy to attract a guy.  Garrett would tell you that it was my personality that drew him to me.*<br>\r\n<br>\r\nIt was just after 6:00 when I walked out of the bathroom; feeling satisfied with my appearance.  Remembering that Marcy said to meet her downstairs at 6:30, I went to the closet to find some shoes to wear.  <i>I need to have a word with whoever filled this closet.</i>  After finding a pair of shoes that seemed to go with the dress, I quickly put them on.<br>\r\n<br>\r\nWith my purse in hand; along with my keys and my cell phone, I left the apartment around 6:25.  I barely made it five feet before I heard a voice behind me say, “Girl, you look amazing!”<br>\r\n<br>\r\nTurning around, I saw Marcy walking towards me wearing what appeared to a mini-dress.  I had to admit that she looked great as well.  “You look amazing too!”<br>\r\n<br>\r\n“The boys will be all over us tonight.”<br>\r\n<br>\r\n<i>This all better be worth it; because I'm not psyched about having to flirt with guys.</i>  “I can’t wait!”</span></div></div>",
            "created":1576731600,
            "id":2761555,
            "title":"Getting Ready"
        },
        "1111111211111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Drinking and Flirting",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>It was a 15-minute drive to the club; by the time we got there, I was looking forward to getting my drink on.  At the very least I wanted to drink enough so Dad, Emily, and Michelle meant as little to me as I did to them.<br>\r\n<br>\r\n*Yeesh, old me, dramatic much?*<br>\r\n<br>\r\nAfter she parked the car, Marcy and I walked around the corner to find a long line of people waiting to get into the club.  We stood on the sidewalk for a moment before Marcy waved at someone she recognized. “Hey, Robin!”<br>\r\n<br>\r\nI followed Marcy as she walked up to a brunette a short distance from the front of the line.  Marcy and I maneuvered under the velvet ropes; I was surprised when there weren’t any complaints about us cutting.<br>\r\n<br>\r\nAs Marcy hugged the girl, I realized that I recognized her as well; but couldn’t place her.  *And I wondered why women had such a problem with me.*<br>\r\n<br>\r\nLooking at me, the girl said, “So who’s your friend?”<br>\r\n<br>\r\n“Robin Hartland, this is Amelia Sullivan; she just moved in across the hall.” Smiling, Marcy said, “She just got a job at Benson Financial.”<br>\r\n<br>\r\nShaking my hand, Robin said, “You got in at the right time, Amelia,\" Robin said. \"Let's celebrate, girls: Andrew Benson is G-O-N-E, gone!\"<br>\r\n<br>\r\n\"I was wondering why you decided to hit the club, after what that creep did to you.\"<br>\r\n<br>\r\n\"Hey, here, whatever loser tries to force me into a lip-lock isn't my f**king boss, so I can tell him what I think of him. Plus, I've got my girls looking out for me. Besides, if I let him keep me out of places, then it's like he won, and he doesn't deserve to win.\"<br>\r\n<br>\r\nThat was a shock to me. I thought girls liked the take-charge type. Here, though, I sounded a lot like a grade-A asshole.<br>\r\n<br>\r\n*Because I was a grade-A asshole.*</span></div></div>",
            "created":1576731600,
            "id":2761730,
            "title":"At The Club"
        },
        "11111112111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Next Morning"
            ],
            "content":"<div class=\"\"><div> <span>It had been almost two hours since the three of us got into the club; Marcy, Robin and I were sitting on a couch a short distance from the dance floor.  As I said, we’d been inside for two hours; we were already on our 3rd round of drinks.<br>\r\nI had to admit it was somewhat sobering to hear Marcy and Robin talking about me in such a negative light.  I hadn’t realized just how poorly I treated women until I heard them talking about their experiences with me.  The worst part was seeing Robin shaking as she described what I’d done to her at the party.  It was all I could do to keep from crying as I heard her recount what happened.<br>\r\n<br>\r\n*While this wasn’t a turning point in my life; this certainly gave me something to think about.*<br>\r\n<br>\r\nMarcy had just gone off to use the bathroom; leaving me alone with Robin.  Moving closer to her, I said, “I’m sorry for what that asshole did to you, Robin.”<br>\r\n<br>\r\n“You don’t need to apologize for him, Amelia.” Looking at me, taking a sip of her drink, Robin said, “It’s not like you were the one forcing yourself on me in the hallway.”<br>\r\n<br>\r\n<i>You have no idea, Robin.</i>  “Still, I’m sorry for what happened to you.” Looking at her, I said, “He violated you; made you feel weak.  No man should make a woman feel that way.”<br>\r\n<br>\r\n“This may sound crazy, but I would like nothing more than for that asshole to experience what I went through.”<br>\r\n<br>\r\n<i>I sincerely hope that doesn’t happen to me.</i><br>\r\n<br>\r\nBefore I could say anything, Marcy returned with three guys.  Pointing to each of them, Marcy said, “Ladies, I’d like for you to meet Michael, Simon, and Jacob.”<br>\r\n<br>\r\nMaybe it was the alcohol, or maybe it was the fact that I was in a girl’s body; whatever the reason, I couldn’t stop thinking about how cute Michael was.  Having totally forgotten about my plan until that moment; I stood up, stumbling a little bit, and said, “Hi Michael, I’m Amelia.”<br>\r\n<br>\r\n<div align=\"center\">********************************</div><br>\r\n<br>\r\nLet’s just say that I’m glad no one in the bar knew who I really was; because I was starting to realize I hadn’t thought my plan all the way through.  The plan was good on paper; get myself good and drunk, then find a guy to flirt with.  In practice, however, it was totally different; I was a guy, inside a woman’s body, making out with another guy.<br>\r\n<br>\r\nMichael and I hit things off pretty quickly; we moved from talking to making out in short order.  I was sitting on his lap, my arms wrapped around his neck as we engaged in some passionate face-grinding.<br>\r\n<br>\r\nWe continued that for a while; until Michael’s group, unfortunately, had to leave to catch an early flight.  Once they left, I sat back down on the couch; still thinking about the kiss.<br>\r\n<br>\r\nI was pulled from my thoughts by Marcy tapping my shoulder, “Girl, I know that look.” Smiling, Marcy said, “You were so totally into him; you should’ve given him your number.”<br>\r\n<br>\r\n“I just got out of a pretty intense relationship; my boyfriend was cheating on me with a girl from his office.” Grabbing my drink, I said, “Michael was cute, but I don’t think I’m ready for a relationship just yet.”<br>\r\n<br>\r\nWhat I’d told them was somewhat true; considering I’d just been dumped by Heather for my actions at the party.<br>\r\n<br>\r\n<i>********************************</i><br>\r\n<br>\r\nIt was well after midnight before the three of us left the club.  With neither of us in a condition to drive, we hailed a cab to take us back to the apartment.  It was a challenge walking up the stairs; after all, we were three very drunk girls wearing heels.  But we eventually made it up to our floor; where we said our goodbyes.  Marcy and Robin went inside Marcy’s apartment while I went inside my apartment.<br>\r\n<br>\r\nWalking into my room, I barely had a chance to take my heels off before I collapsed onto the bed.</span></div></div>",
            "created":1576818000,
            "id":2762283,
            "title":"Drinking and Flirting"
        },
        "111111121111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's choice",
                "Reader's choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>I woke up the next morning with a pounding headache; as if someone was pounding my head with hammers.<br>\r\n<br>\r\nOpening my eyes, I was momentarily confused by my surroundings until I remembered what happened yesterday - my dad and sister had conspired to turn me into a woman.<br>\r\n<br>\r\nSitting up in bed, I caught a glimpse of myself in the mirror above my dresser.  Getting up, I carefully made my way over to the dresser.<br>\r\n<br>\r\nWhen I saw the outfit I was wearing, I said, \"Oh God, what did I do last night?\"<br>\r\n<br>\r\nSuddenly, as if to answer my question, a rush of memories came back - of hanging out with Marcy and Robin as well as having a lot of drinks.<br>\r\n<br>\r\nI was sick to my stomach when I suddenly remembered my overly passionate makeout session with a guy at the bar.  I remembered the guy grabbing my ass as I made out with him.  <i>Oh my God!  Did I really do that?</i><br>\r\n<br>\r\nI was pulled from my thoughts by someone knocking on my door.  Thanks to the hangover it sounded so much worse.<br>\r\n<br>\r\nWalking to the door, I opened it and found myself face to face with Emily - her mouth agape in shock.</span></div></div>",
            "created":1576904400,
            "id":2762547,
            "title":"Hangover with a side of embarrassment"
        },
        "1111111211111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Later On",
                "Sometime Later",
                "The Next Day",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>It took a moment for Emily to compose herself; I couldn’t say I blamed her – I’d be shocked too if I saw my newly female brother wearing a cocktail dress.  Looking at me, she said, “I-I can’t believe it’s actually true.”<br>\r\n<br>\r\n“You’ll have to forgive me, I’m dealing with a pretty nasty hangover right now.” Sighing, I said, “You can’t believe what is actually true.”<br>\r\n<br>\r\nWalking into the apartment, Emily said, “My legal assistant, Robin, was showing me some photos for Elysium last night.” Looking at me, Emily said, “A lot of the photos had this blonde girl in them; I couldn’t quite place how I knew her from somewhere.  That was until Robin said her name was Amelia and that she’d just been hired by the company.”<br>\r\n<br>\r\nClosing the door, I said, “You’re probably wondering why I was at a dance club, aren’t you?”<br>\r\n<br>\r\n*Just for the record; I still go clubbing with my girls on occasion, sometimes Emily joins us.*<br>\r\n<br>\r\n“Among other things, yeah.” Looking at me, Emily said, “Why are you still wearing the dress?”<br>\r\n<br>\r\n“I collapsed almost as soon as I got home this morning; I just woke up a few minutes ago.”<br>\r\n<br>\r\n“Can you do me a favor and change into something else?” covering her eyes, Emily said, “The image of my older brother in a cocktail dress isn’t something I really want to remember.”<br>\r\n<br>\r\n<div align=\"center\">***************************</div><br>\r\n<br>\r\nI stepped out of my room a short time later wearing a pair of shorts and a tank top.  I entered the main room just as Emily came out of the kitchen with what looked to be a cup of coffee.  As she handed it to me, I said, “I was only in there for like 10 minutes, how’d you make a cup of coffee so quickly?”<br>\r\n<br>\r\n“You haven’t checked this place out yet, have you.” Gesturing to the kitchen, Emily said, “There’s a Keurig machine in there.”<br>\r\n<br>\r\nAs we sat down on the couch, I took a sip of the coffee and said, “You might as well get your questions over with.”<br>\r\n<br>\r\n“I guess my first question is how’d you even end up at the club?”<br>\r\n<br>\r\n“Robin’s friend Marcy, from HR, is my next-door neighbor.  She invited me to the club after I told her I worked at the office.”<br>\r\n<br>\r\n“You do know Robin is one of the women who filed a complaint against you, right?”<br>\r\n<br>\r\n“Yeah, I do.” Sighing, I said, “I have to say I feel terrible about what I did to her.”<br>\r\n<br>\r\n“You should feel terrible, Amelia.” Sighing, Emily said, “You groped her in the hallway and threatened to fire her if she told anyone.”<br>\r\n<br>\r\n“If it helps, I did apologize to her.” Pausing, I said, “Granted she doesn’t know I’m Andrew, but I did apologize.”<br>\r\n<br>\r\nAfter we talked about that for a few more minutes, Emily pulled out her phone.  Turning it towards me, she said, “Now I’d really like to hear an explanation for this.”<br>\r\n<br>\r\nI went pale when I realized what I was looking at; a selfie of Marcy and Robin, with me in the background making out with Michael.  <br>\r\n“Oh, God.”<br>\r\n<br>\r\n“Please tell me you only did that because you were drunk.”<br>\r\n<br>\r\n“That’s not the only reason I did it.” Sighing, I said, “I wanted to make a public spectacle of myself; force Dad, Michelle and you to change me back.”<br>\r\n<br>\r\n“They’re not going to see these photos, so I hope it was worth it.” Taking her phone back, Emily said, “It seems to me like you were really enjoying kissing that guy.”<br>\r\n<br>\r\n“It was all an act, Em; I’d had three margaritas by that point.”<br>\r\n<br>\r\n“Oh please, there’s no way that’s an act.” Looking at me, Emily said, “In some of those photos your tongue was so far into that guy’s mouth you could’ve given him a tonsillectomy.”<br>\r\n<br>\r\n“Okay so maybe I went a little rogue.” Sitting back on the couch, I said, “That’s what happens when you put me in a woman’s body.”<br>\r\n<br>\r\nStanding up, Emily said, “Just remember, you can’t change back if you get pregnant.” </span></div></div>",
            "created":1576904400,
            "id":2762764,
            "title":"Continue"
        },
        "11111112111111111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>I had nothing to do after Emily finally went back to work, so I sat down on the couch and just stared at the wall.  I’d never been so bored in my life; I was usually at work right now.  After sitting on the couch for a few minutes, I got up and walked into the bedroom.<br>\r\n<br>\r\nI remembered seeing a pool as I drove into the complex yesterday.  I wasn’t psyched about the idea of going to the pool in a woman’s body, but it sure beats sitting around the apartment all day.  That was my attitude until I realized the only bathing suits provided for me were bikinis.  What kind of lesson will I learn from this?<br>\r\n<br>\r\nI briefly considered going out to buy a one-piece but stopped when I realized I was still a little hungover.  Grabbing the least feminine of the three options, I walked into the bathroom to get changed.  As I stood in front of the bathroom mirror, admiring my appearance, I looked at my reflection and said, “Damn, boys are going to be all over me in this.”<br>\r\n<br>\r\nI stopped when I realized what I just said; although after a minute I decided to chalk it up to last night’s drinking.<br>\r\n<br>\r\n*Yeah; keep telling yourself that, past me.*<br>\r\n<br>\r\nWith a towel in hand, along with an old iPod, I made my way to the pool area a few minutes later.  Walking onto the pool deck, I saw it was mostly empty; except for two other girls, a blonde and a dark-haired girl, working on their tans and a trio of boys splashing around in the pool.<br>\r\n<br>\r\nWith the intent of keeping to myself, I went to an empty corner and made myself at home.  After putting on some sunscreen, I lay back in the chair and started to work on my tan.  I was relaxed within minutes of doing so – making me wonder why I never tried this as a guy.  No wonder girls spend do this so much on vacations.<br>\r\n<br>\r\n<div align=\"center\">**********************</div><br>\r\n<br>\r\nAn hour or so had passed since I got to the pool; I must’ve dozed off for a few minutes while I was working on my back.  Large breasts don’t make lying on your stomach comfortable.  Without opening my eyes, I reached over to where I’d left my bikini top – only to find it wasn’t there.<br>\r\n<br>\r\nThinking it had fallen, I opened my eyes to find that it was gone.  What the hell?  Who would take a bikini top?<br>\r\n<br>\r\n*To be fair, Garrett thought it would be funny to hide my top while we were on our honeymoon.*<br>\r\n<br>\r\nUsing the towel to cover myself up, I started looking around for the top.  Suddenly something out of the corner of my eye grabbed my attention.  I turned to find one of the boys waving my top around.  “Are you looking for this, sexy?”<br>\r\n<br>\r\n“What the hell is wrong with you?” walking over, I grabbed the top from his hand and said, “Why don’t you grow up?” <br>\r\n<br>\r\n*Pot calling kettle.*<br>\r\n<br>\r\nNot waiting around for his response, I turned to walk off – only for him to smack me in the butt.  Before I could stop myself, I spun around and smacked the guy in the face.  I quickly realized that was a mistake – if only because of the fact the boy was a good 5 inches taller than me.  It was only then that I realized how close I was to the pool edge; as the boy shoved me into the pool.</span></div></div>",
            "created":1577595600,
            "id":2766680,
            "title":"At The Pool"
        },
        "111111121111111111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Ladies Who Lunch",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Being pushed into the pool did nothing to cool my temper, but it did make me feel small and helpless. When I heard a splash, I expected nothing less than to have his friends pull me under, just because they could.<br>\r\n<br>\r\nInstead, the arms that touched me guided me away from the boys. \"I know your mothers,\" said a woman's voice. \"Don't think they won't be hearing about this. You three will get yours.\"<br>\r\n<br>\r\nThe person who got me away from the boys soon helped me out of the pool. I saw that it was the blonde I'd noticed earlier. \"You should be okay,\" she said.<br>\r\n<br>\r\n\"Thanks,\" I said. \"Think they'll be back?\"<br>\r\n<br>\r\n\"Unfortunately, I can guarantee it,\" the dark-haired girl said. \"His dad's the super. He hasn't done anything yet that was so bad that his father stepped in to correct him.\"<br>\r\n<br>\r\n\"Boys will be boys,\" I said with disgust.<br>\r\n<br>\r\n\"Pretty much,\" the blonde said. \"I'm Janelle, and this is Tara.\"<br>\r\n<br>\r\n\"Amelia.\"<br>\r\n<br>\r\n\"Wanna go for lunch, Amelia?\"<br>\r\n<br>\r\n\"Alright.\" All my life, I'd believed that women would cut each other down at the drop of a hat. Now, though, I'd made friends with women in record time.</span></div></div>",
            "created":1578027600,
            "id":2768932,
            "title":"Continue"
        },
        "112":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "The Story of Amelia",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"You wouldn't dare,\" I said to my father. \"I'm your only son. Without me, what would you do?\" <i>Yep, I actually thought like that. God, what an idiot.</i> Satisfied that I'd outsmarted the old man, I walked right out the door.<br>\r\n<br>\r\nAfter a stop at the liquor store, I went home to my apartment. I sat in the living room and drank, thinking of all the people who had wronged me in the past 24 hours. <i>Well, actually, I was thinking of all the people I'd blamed for my problems. Since none of them were me, they weren't really responsible for my life going down the toilet.</i> I drank until I passed out.<br>\r\n<br>\r\n<div align=\"center\">******************************</div><br>\r\n<br>\r\nI came to the next morning with the worst hangover I'd ever had. \"God, I thought I closed the curtains,\" I said. Something seemed off, but I was too sick to think of what.<br>\r\n<br>\r\nI raised my arm to rub my eyes, and met some resistance. There was something wrong with that, too, but I still wasn't thinking.<br>\r\n<br>\r\nI sat up and opened my eyes a crack, and discovered something that finally got me thinking. \"This isn't my apartment,\" I said. And it wasn't. I lived in a high-end loft, and this place looked like it was too cheap to hire a doorman.<br>\r\n<br>\r\nNow that I'd jump-started my thinking, it finally dawned on me that my voice was different. Higher.<br>\r\n<br>\r\nI raised my hand to my neck, and felt the same resistance as before. Now, though, I noticed that I also felt something touching my chest. I looked down, and saw it. Or, rather, them.<br>\r\n<br>\r\nI had breasts. Big breasts.<br>\r\n<br>\r\nLooking around, I saw a full-length mirror. Standing before it, I came face to face with a woman. \"Son of a bitch,\" I said. \"He did it. He actually did it.\" I was standing there naked, so I couldn't pretend it was anything else. I had breasts, wide hips, and a vagina.<br>\r\n<br>\r\nIn a panic, I ran straight into the living room and searched for a phone so I could call my dad, or maybe my mom.<br>\r\n<br>\r\n\"Good morning, Amelia.\"<br>\r\n<br>\r\nI turned. Michelle was sitting on a ratty old couch, looking like the cat that swallowed the canary.</span></div></div>",
            "created":1576386000,
            "id":2760132,
            "title":"Walk out of the room"
        },
        "1121":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Continue",
                "Later On",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"What the hell did you do to me, you bitch?\"<br>\r\n<br>\r\n\"I'd watch your tone, Amelia.\" Looking at me, Michelle said, \"Your situation could always get worse.\"<br>\r\n<br>\r\n\"I'm a f**king chick!\" Gesturing to my body, I said, \"I fail to see how things could get any worse.\"<br>\r\n<br>\r\n\"That's just a lack of imagination on your part.\" Sighing, Michelle said, \"You'll find some clothes in the closet, go get dressed and then we'll talk.\"<br>\r\n<br>\r\n************<br>\r\n<br>\r\nI made sure to take my time getting dressed; figuring if I was going to be inconvenienced then so was Michelle.  I did make an effort to look over my new body however.<br>\r\n<br>\r\nWhatever they had done to make me a woman, Michelle and Dad certainly went all out.  I was now probably around 5'5\", a full 6 inches shorter than I had been, with huge breasts and blonde hair down to my shoulders.  <i>Damn bitch turned me into a blonde bimbo.</i><br>\r\n<br>\r\n*I still can't believe I used to think like that; buying into the stereotype that blondes were inherently bimbos.*<br>\r\n<br>\r\nAfter figuring I'd let her wait long enough, I decided to get dressed in the least feminine thing I could find - pants and a top.  That, in itself, was a hassle because whoever stocked the closet made sure that it was almost entirely dresses and skirt suits.<br>\r\n<br>\r\nI walked back out into the main room where Michelle was waiting.  \"Glad you finally decided to get dressed.\" Handing me a folder, she said, \"Read this, it has all the information you'll need about your new identity.\"<br>\r\n<br>\r\nI begrudgingly took the folder and opened it.  It seemed that my name was now Amelia Sullivan; a 24 year old woman with a less than impressive resume.  Looking at Michelle, I said, \"How am i supposed to find a job with this resume?\"<br>\r\n<br>\r\n\"Don't worry about that, Amelia.\" Looking at me, a smile on her face, Michelle said, \"Mr. Benson has gotten you a job as a secretary at his company.\"<br>\r\n<br>\r\n\"What?\" Shocked, I said, \"You really to expect me to be some dumb secretary?\"<br>\r\n<br>\r\n\"I'm afraid that's your only option, honey.\" Pausing, Michelle said, \"Maybe if you'd focused more on your grades and less on sleeping around in school.\"</span></div></div>",
            "created":1576558800,
            "id":2760731,
            "title":"The Story of Amelia"
        },
        "11211":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "My First Day at Work",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"Alright,\" I said, \"I suppose I can manage. My Maserati's parked outside, and I can drive to my condo for a decent night's sleep.\"<br>\r\n<br>\r\n\"Guess again,\" Michelle said.<br>\r\n<br>\r\n\"What do you mean?\"<br>\r\n<br>\r\n\"You really think a secretary can afford a condo and a Maserati? Get real. This fifth-floor walk-up efficiency is your home, and there's a used Crown Vic outside that's your car.\"<br>\r\n<br>\r\n\"Have you lost what little mind you had? When Dad forced this little deal on me, he didn't say anything about me living like a poor person!\"<br>\r\n<br>\r\n*Damn, it bugs me how much hate there is in that quote. But it's what I said, so I'm stuck with it. For the record, Michelle is highly intelligent.*<br>\r\n<br>\r\n\"Your father also never said anything about giving HR nightmares, but you had no trouble inferring that.\" She paused. \"If it helps, the apartment and car may not be yours for long.\"<br>\r\n<br>\r\n\"Oh, good, this was just a joke, and you got me. Ha, ha. ha.\"<br>\r\n<br>\r\n\"No joke, Amelia. The reason you may not have these things for much longer is because you're dangerously close to showing up late for your first day on the job, and bosses frown on that sort of behavior. And landlords and banks expect to be paid.\"<br>\r\n<br>\r\n\"In other words, shut up and get to work.\"<br>\r\n<br>\r\n\"See? Blondes aren't dumb, you figured that out all by yourself.\"<br>\r\n<br>\r\nAs I looked over my information so I knew which rattletrap was mine, I said, \"You may as well know, I will make you and my old man regret doing this to me. I'll find some way to get back at you.\"<br>\r\n<br>\r\n\"And you may as well know, if your plans involve sex with strangers, getting pregnant means we can't change you back into Mr. Wonderful.\"</span></div></div>",
            "created":1576558800,
            "id":2760770,
            "title":"Back with Michelle"
        },
        "112111":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "Arriving at Work",
                "Later On",
                "After Work",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>After having a verbal back and forth with Michelle for a few more minutes, I reluctantly went to get ready for my first day as a lowly secretary.  That, of course, meant having to take a shower; and I wasn’t prepared for the plethora of sensations that came with that.<br>\r\n<br>\r\nOnce I was done in the shower I dried myself off and wrapped a towel around my chest.  Walking out of the bathroom, I was surprised to see Michelle waiting for me on the bed.  “What are you still doing here?”<br>\r\n<br>\r\n“I’m here to help you get ready for work.”<br>\r\n<br>\r\nScoffing at her, I said, “What possible reason could you have to do that?”<br>\r\n<br>\r\n“Despite what you may think, Amelia; I’m not some heartless bitch.” Getting up, Michelle said, “I know you’re new to this and I want to help you learn how to get ready as a woman.”<br>\r\n<br>\r\n*I just want to say that Michelle and I have a better relationship now; we frequently have lunch together at work.  I’m giving serious thought to making her my daughter’s god-mother.*<br>\r\n<br>\r\n“I suppose I could use the help; since you forced me into this so suddenly.”<br>\r\n<br>\r\n\"You can consider this your first lesson about being a woman; even if we dislike each other, we'll still help another woman when they need it.\"<br>\r\n<br>\r\n<div align=\"center\">**************************</div><br>\r\n<br>\r\nWith Michelle’s help, along with some lecturing, I was able to get ready for work in about 45 minutes.  Once Michelle was satisfied that I looked like a professional woman, she led me over to the full-length mirror in the bedroom.  I stumbled in the heels a few times but she helped me stay on my feet.<br>\r\n<br>\r\n“So Amelia, what do you think?”<br>\r\n<br>\r\nTurning my attention to the mirror, I’ll admit I was surprised by how feminine I looked.  There was absolutely nothing to show that I used to be a guy.  I was wearing a navy blue skirt suit with matching heels; I had a light amount of makeup on and my hair was in a bun.  “I guess I look pretty good.” With the faintest hint of a smile, I said, “Thank you for the help, Michelle.”<br>\r\n<br>\r\n“You’re welcome, Amelia.” Smiling, Michelle said, “Now I hope you were paying attention because I’m not coming over here every day to help you get ready.”<br>\r\n<br>\r\n“Will you relax?” sighing, I said, “No matter your opinion of me, I am a fast learner.”<br>\r\n<br>\r\n“I hope that’s true; because I truly believe this will help you.” Retrieving a purse from the dresser, Michelle said, “Here’s your purse; when you get to work, go right to HR.  They’ll need you to sign some new hire paperwork.”<br>\r\n<br>\r\nMichelle and I left the apartment together; taking the stairs down to the first floor.  Once outside, the two of us parted ways – Michelle going to her convertible and me going to my trashy 2003 Camry.</span></div></div>",
            "created":1576731600,
            "id":2761591,
            "title":"Getting Ready"
        },
        "1121111":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "Shopping",
                "Back at the apartment",
                "Something Else",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Upon arriving at work, I had to stop myself from parking in my reserved spot.  Walking into the office, I had to act as though I’d never been in there before.  Going up to the counter, I looked at the receptionist and said, “Hi, I’m Amelia Sullivan; it’s my first day and I was told to report to HR.”<br>\r\n<br>\r\nThe receptionist kindly gave me directions to HR, on the 2nd floor.  After thanking her, I made my way upstairs.  I couldn’t help but dwell on the fact that people were treating me differently now – if only they knew who I really was.<br>\r\n<br>\r\nMy appointment with HR didn’t take long; I spent the time signing various forms.  The HR rep was cordial to me; which proved that she wasn’t privy to my situation.  She likely would’ve treated me differently had she known the truth – after all, I wasn’t HR’s favorite person.<br>\r\n<br>\r\n*Understatement of the century.*<br>\r\n<br>\r\nAfter signing the last of the forms, the woman said, “Welcome to Benson Financial, Ms. Sullivan.” Smiling, she said, “Mr. Lewis is waiting for you in Accounting.”<br>\r\n<br>\r\nAs I made my way up to the department that I’d once ran, I found myself thinking about what the rep had said.  Who could Mr. Lewis possibly be?  I’d hired a Devin Lewis but there was no way it could be him.<br>\r\n<br>\r\nI was soon proven wrong when I walked into my old office to find Devin Lewis carrying a large box.  Putting the box down when he saw me, he said, “You must be my new secretary; the name’s Devin Lewis.” Gesturing to the stacks of boxes, he said, “Your first task today will be to help me set up my new office.\"<br>\r\n<br>\r\nJust great; not only did Dad fire me, but they promoted the last I guy I hired and made him my boss.  Placing my things on my new desk, I grabbed one of the lighter boxes and followed him into the other room.  “If I may ask, sir; how did you get this job?”<br>\r\n<br>\r\n“It’s all about who you know, sweet-cheeks,” looking at me, Mr. Lewis, “The last guy and I were in the same Frat; we went to different schools and graduated in different years, but that didn’t matter.”<br>\r\n<br>\r\nI was suddenly remembering why I’d hired this guy; he was right, we had been in different chapters of the same Frat.  We all looked out for each other no matter what.  “Being frat brothers qualified you for this job?”<br>\r\n<br>\r\n“Not on its own, no; but yesterday he left me a voicemail, something about going into rehab and taking a ‘voyage of self-discovery.’” Pausing, he said, “Apparently he hand-picked me to run the department while he was gone.”<br>\r\n<br>\r\nLike hell I did;  Dad and Michelle must’ve worked out a way to get him the job without him questioning it.<br>\r\n<br>\r\n*******************************<br>\r\n<br>\r\nIt took us several hours to get the office to his liking.  It was just around 2:30 when we finally finished.  “Well I think that’s all for today.  I’m going to leave early; you can too, sweetheart.”<br>\r\n<br>\r\nIt was all I could do not to the guy a new asshole when he slapped my ass.<br>\r\n<br>\r\n*Guess you can dish it out, but you can't take it, huh, old me?*</span></div></div>",
            "created":1576818000,
            "id":2762134,
            "title":"Arriving at Work"
        },
        "11211112":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "A Few Hours Later",
                "Sometime Later",
                "The Next Morning",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Having been focused on getting to work this morning, I didn’t have much time to look at the apartment complex that I’d be living in for the next year.  I think my initial reaction to the apartment was because I was shocked to find I’d turned into a woman.  The complex and the unit itself weren’t all that bad; it wasn’t up to my standards but it wasn’t that bad.<br>\r\n<br>\r\nAfter walking up to the 4th floor, I fumbled with the key for a moment before finally getting inside the apartment.  The first thing I did once I was inside was take off the heels; which immediately made my feet feel so much better.<br>\r\n<br>\r\n*I still don’t know why women wear heels.  Sure they make us look good, but was it really worth all the joint problems later in life.*<br>\r\n<br>\r\nStanding in the middle of the room, I said to myself, “I suppose I should look around this place.”<br>\r\n<br>\r\nThe apartment consisted mainly of a small living area; with a detached kitchen plus a small hallway leading to down to the bathroom and bedroom.  Feeling an urge to get out of the skirt suit, I rummaged through the closet until I finally found something that wasn’t remotely feminine – a pair of paints and a shirt.  Getting dressed was a hassle; apparently I had no problem taking bras off but had trouble putting one on.<br>\r\n<br>\r\nOnce I was satisfied with my outfit, I turned to leave the room; only to stop when my attention was drawn to some photos on the dresser.  Going over for a closer look, I saw there were pictures of me; or at least the female me.  That wasn’t the only thing that caught my attention – the photos were of me with other people in a variety of locations; college graduation, on a beach wearing a bikini, and what looked to be some formal dance with other girls.<br>\r\n<br>\r\n<i>If they can turn me into a girl, I suppose it’s not too hard to make some fake photos.</i> Leaving the bedroom, I decided now was a good time to get drunk.  Thankfully whoever stocked the fridge had the foresight to provide me with some beer – it wasn’t the brand I typically drank, but it would still get me drunk.<br>\r\n</span></div></div>",
            "created":1577077200,
            "id":2763801,
            "title":"Back at the apartment"
        },
        "112111121":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "choices":[
                "The Club",
                "Sometime Later",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>A few hours passed before I finally stopped drinking; leaving 5 empty bottles on the floor.  I was starting to get hungry when I heard voices outside in the hallway.  For some reason they both sounded familiar; so I got up to see who they were.<br>\r\n<br>\r\nOpening the door, I two woman standing there; a brunette and a red-head, both wearing skirt suits.  The brunette took one look at me and said, “We weren’t making too much noise, were we?”<br>\r\n<br>\r\n“No, you’re fine.” Sighing, I said, “I’m just not having the best day.”<br>\r\n<br>\r\n“Join the club, girlfriend.” Gesturing to the red-head, she said, “I’m Marcy and this is Robin.”<br>\r\n<br>\r\nI still couldn’t place where I knew them from; but they both looked familiar, particularly the red-head.  Shaking Marcy’s hand, I said, “I’m Amelia.”<br>\r\n<br>\r\n“Wait a minute, you look kind of familiar.”<br>\r\n<br>\r\n<i>Oh crap; could they know I’m Andrew?</i>  “You guys do too, I’m trying to figure out why.”<br>\r\n<br>\r\nAfter a moment, Robin said, “Wait; aren’t you that new secretary that started today?”<br>\r\n<br>\r\nThat’s where I know them from – work!  “You guys work at Benson Financial?”<br>\r\n<br>\r\n“Yeah; I’m in Accounting and Robin’s in the Legal Department.” Looking at me, Marcy said, “You’re Mr. Lewis’ new secretary, <br>\r\nright?”<br>\r\n<br>\r\n“Yeah.” Thinking back to the butt slapping, I said, “He’s kind of grabby, isn’t he?”<br>\r\n<br>\r\n“He’s nothing like the last guy.” Shuddering, Robin said, “Andrew Benson was the worst man I’ve ever known.”<br>\r\n<br>\r\n<i>Damn Robin, what did I ever do to you?</i>  Looking at me, Marcy said, “I apologize for Robin; she’s still upset about the July 4th Party – Mr. Benson tried to force himself on her.”<br>\r\n<br>\r\n<i>Oh crap.</i>  Trying to play it cool, I said, “That’s terrible, Robin; I’m so sorry.”<br>\r\n<br>\r\n“It’s not your fault; it’s not like you did it.”<br>\r\n<br>\r\n“Okay, why don’t we change the subject here.” Looking at me, Marcy said, “Robin and I are going to clubbing tonight, you feel like joining us?”<br>\r\n<br>\r\nGoing clubbing wasn’t exactly my idea of fun, but it would get me out of the apartment.  Besides, it might give me a chance to embarrass my family.  With a smile, I said, “Sure, sounds like a date!\"</span></div></div>",
            "created":1577077200,
            "id":2763802,
            "title":"A Few Hours Later"
        },
        "1121111211":{
            "author_id":"bartfargo",
            "author_name":"BeeJay",
            "choices":[
                "The Morning After",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>I found a little black dress in my closet. Remembering something an ex-girlfriend said about the versatility of little black dresses, I realized that must be why I was given one. <i>Well, Daddy Dearest, just wait 'til you see what use</i> I <i>put it to.</i><br>\r\n<br>\r\nAt the club, the first thing we dealt with was the two-drink minimum. Halfway through her second Long Island Iced Tea, Robin was feeling talkative, and the subject she wished to hold forth on was none other than yours truly, Andrew Benson.<br>\r\n<br>\r\n\"You know what that rat bastard said to me after he gave me a tonsilectomy with his tongue? 'You're welcome.' You're. Freaking. Welcome.\"<br>\r\n<br>\r\nShe probably didn't say <i>freaking</i>, I may have misremembered. Remember, I had pre-gamed with 5/6 of a six-pack.<br>\r\n<br>\r\n\"You know what I'd like, most of all?\" she asked.<br>\r\n<br>\r\n\"For him to be right here in front of you,\" I guessed, \"so you can tell him what you think of him?\" <i>'Cause, if so, your prayers have been answered.</i><br>\r\n<br>\r\n\"No. What I want... \" She held up the candle on the table. \"I wish he was a woman, and some rat bastard man treats <i>him</i> the way he treated <i>me</i>.\" She tried to blow out the candle, but it didn't work, because it was electric.<br>\r\n<br>\r\n*She got her wish anyway.*<br>\r\n<br>\r\nA waitress brought us fresh drinks. \"Compliments of the gentlemen at the bar,\" she said.<br>\r\n<br>\r\nWe looked over, acting nonchalant. They were there, acting like buying a woman a drink in a bar was a feat akin to curing cancer.<br>\r\n<br>\r\n\"Shall we?\" asked Marcy, already standing up.<br>\r\n<br>\r\nThe three of us walked over to the guys. I don't know what Marcy had in mind, but it probably wasn't what I did.<br>\r\n<br>\r\nBecause I picked out one of the guys, walked right up to him, and gave him a deep-mouth kiss that brought him to his knees. Like I said, I had been drinking.<br>\r\n<br>\r\n*Yeah, just keep telling yourself that, past me.*</span></div></div>",
            "created":1577509200,
            "id":2766031,
            "title":"The Club"
        },
        "12":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More to be added as the time goes by:<br>\r\n1. please use this <span style=\"font-family:verdana, sans-serif\"><i>format</i></span> when writing commentary from future amelia</span></div></span></div>",
            "created":1576386000,
            "id":2760098,
            "title":"Important Info"
        },
        "121":{
            "author_id":"homerj1987",
            "author_name":"Homer J Simpson",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>To anyone who reads this story, I'm considering deleting it; if anyone has ideas or a reason that i shouldn't please let me know</span></div></span></div>",
            "created":1581656400,
            "id":2787323,
            "title":"Continue"
        }
    },
    "info":{
        "author_id":"homerj1987",
        "author_name":"Homer J Simpson",
        "brief_description":"Sometimes you have to lose everything you hold dear to realize how little you truly have",
        "created":1576460880,
        "description":"<td align=\"left\" class=\"norm\">Andrew Benson is a 24-year-old misogynistic man.  He treats women like objects and doesn't give a damn about it.  That all changes when several female staffers at his family's company file harassment complaints against him.  His father gives him an ultimatum - spend one year as a woman, or be cut from the will.<br>\r\n<br>\r\nRules:<br>\r\n1. Use proper grammar<br>\r\n2. Be creative with storylines but keep close to the original idea.<br>\r\n3. Use the 1st person perspective (I, I'm, I'll, etc) - keep it in Andrew's POV<br>\r\n4. I reserve the right to edit, and/or/ remove chapters.</td>",
        "id":2207947,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "modified":1581717720,
        "pretty_title":"Rock Bottom"
    }
}