{
    "chapters":{
        "1":{
            "author_id":"j4min",
            "author_name":"J4min",
            "choices":[
                "Lisa's room, Lisa, (s)",
                "Mom and Dad's room, Homer, (v)",
                "Downstairs kitchen, Marge, (ub)",
                "Maggies new room, Maggie, (cv)",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You are Bart Simpson. You feel weird standing in the back yard completely naked around a campfire made from your clothes.<br>\r\n\"Mom, why are we burning my clothes?\" you ask.<br>\r\nShe replies with \"because you won't need them tommorow honey, now go to bed and enjoy yourself tomorrow and remember everyone, no clothing whatsoever tomorrow\"<br>\r\nSo you go to bed and get a full nights sleep.<br>\r\n<br>\r\nThe next morning you get up and decide to go where and to who?</span></div></div>",
            "created":1301009040,
            "id":1075584,
            "title":"The night before"
        },
        "11":{
            "choices":[
                "they go for a second round",
                "marge comes in",
                "lisa phones a girl",
                "lisa unbirths maggie",
                "lisa eats bart"
            ],
            "content":"<div class=\"\"><div> <span>bart wakes up to see a note on his head it said go to Lisa's room so bart got up and went to Lisa's room so see his sister about the note and when he entered the room he found lisa in a black lingerie bart got a hard on and lisa noticed this and said come on big boy do me bart walked in as if he was in a trance lisa said stand at the foot of the bed as bart did this lisa shut the door and locked it then she laid back down on the bed and said right take my nickers off me art he did and they were wet bart got in the bed with lisa she spread her legs open wide and bart put his penis in to her pussy and went back and forth with it after an hour lisa got an idea bart go to my wardrobe and get my dildo bart did and put it in Lisa's ass and turned it on and they went for another hour and bart cam all over lisa and she loved every bit of it but what will happen next       </span></div></div>",
            "created":1441730700,
            "id":2031813,
            "title":"Lisa's room, Lisa, (s)"
        },
        "12":{
            "author_id":"j4min",
            "author_name":"J4min",
            "choices":[
                "Homer transforms ",
                "Homer brings out an animal and swallows it whole and living"
            ],
            "content":"<div class=\"\"><div> <span>Homer was sitting on the bed waiting for you. When you walk in he gestures for you to sit next to him, so you go and do so.<br>\r\n\"Son we Simpsons are very special\" homer says \"when we reach the age of 12 we can do something that very few people around the world can do, we can... Actually I will show you what we simpsons can do\"</span></div></div>",
            "created":1301073000,
            "id":1075964,
            "title":"Mom and Dad's room, Homer, (v)"
        },
        "121":{
            "author_id":"j4min",
            "author_name":"J4min",
            "choices":[
                "An anthro",
                "An animal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>All of a sudden homer starts to glow, slowly getting brighter until you can't stand to look at him anymore. When the smoke clears you see that homer has transformed into...</span></div></span></div>",
            "created":1301096940,
            "id":1076179,
            "title":"WTF"
        },
        "1211":{
            "author_id":"j4min",
            "author_name":"J4min",
            "choices":[
                "A centaur",
                "A naga",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You can see that he is still partially human but you see that the rest of him is an animal but what is he?</span></div></span></div>",
            "created":1301097300,
            "id":1076184,
            "title":"An anthro"
        },
        "13":{
            "choices":[
                "let bart out ",
                "keeps him in for a day ",
                "rebirths him and has sex",
                "lets bart go into the womb",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>bart woke up the next morning and went to the bathroom for a piss and when went down stairs to the kitchen were marge was in her dressing down and was making him breakfast after bart finished he was so stuffed he could not move and the marge made her way towards bart and undid her dressing down to show her body completely naked and she started to pull bart towards her and put him in her pussy head first and pulled bart in bit by bit soon bart was shoulder deep in his mothers pussy and was going further in to the pussy soon only his feet were left marge was groaning with joy as she pulled the last of her soon up in to her pussy after she was finished marge tied up her dressing down and fell asleep on the table but what happens next does marge     </span></div></div>",
            "created":1441212480,
            "id":2029193,
            "title":"Downstairs kitchen, Marge, (ub)"
        },
        "135":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "Option 1",
                "option 2",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of this<br>\r\n<br>\r\nMarge rebirths Bart and unbirths him again<br>\r\n<br>\r\nMarge rebirths Bart and swallows him whole<br>\r\n<br>\r\nOther</span></div></span></div>",
            "created":1477677600,
            "id":2229616,
            "title":"other"
        },
        "15":{
            "choices":[
                "kwik e mart manjula (ub)",
                "apartment 1599 patty (s)",
                "elementry mrs hoover (v)",
                "82 Evergreen Terrace edna (ub)",
                "lurleens trailer (s) "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>other ideas</span></div></span></div>",
            "created":1438993380,
            "id":2018284,
            "title":"Other"
        },
        "155":{
            "choices":[
                "julia homers old manager ",
                "mindy simmons",
                "laura powers"
            ],
            "content":"<div class=\"\"><div> <span>homer shouted to bart to get in the car as bart rushed around the room all he could find was his underpants so he put them on and went down to the car and got in homer drove thought the woods and they arrive at a trailer park and said go to trailer 23 and you will get your present from their then homer drove off as bart made his way to the trailer when he found the trailer and knocked on the door and it was lurleen she know bart was coming and she was ready then she said come on in bart he laid down on her bed.<br>\r\n<br>\r\nlurleen came in but was fully clothed but she said hope your ready for this bart she started to strip she started with her boots and then her socks ten her pants then her shirt then her panties and bra then she reached for barts underpants and pulled them off to reveal barts Hugh boner and started to put her pussy over his cock and went up and down for nearly two hours they did it all doggie style oral and anal but when bart came lurleen was exhausted you know bart that was amazing thanks said bart are going to stay for a cup of coffee sorry lurleen I have other plans but here's my phone number call me any time thanks bart said lurleen but bart you going to need more clothes if you going somewhere else here take my old clothes she tossed him an old pair of jeans and an old shirt and an old pair of boots lurleen shouts goodbye to bart but who does he go see         </span></div></div>",
            "created":1439936040,
            "id":2022510,
            "title":"lurleens trailer (s) "
        },
        "1551":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "a second round with lurleen",
                "Julia homers manager",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Will put Julia in the options</span></div></span></div>",
            "created":1477677780,
            "id":2229617,
            "title":"julia homers old manager "
        },
        "1552":{
            "choices":[
                "second round with mindy",
                "unbirthed by mindy",
                "mindy brings another girl in"
            ],
            "content":"<div class=\"\"><div> <span>bart has walked from lurleans trailer to a massive house when he walks up to the door he rings the bell and their is mindy homers old flame as she saw bart knowing he was homers son she thinks hmm he must have the cock as his father so she brought him inside and toke him to her bedroom and said right you sit on the bed i will be right back ok said bart as mindy walked in to her closet bart waited and saw mindy in a red Lingerie but as mindy got near to bart she got wet more and more then she reached bart and said bart take my panties off me and fuck me.<br>\r\n<br>\r\nas bart did so mindy shoved his cock into her pussy and she went up and down all night then in the morning bart was given a choice by mindy but what does he choose</span></div></div>",
            "created":1450391280,
            "id":2075874,
            "title":"mindy simmons"
        },
        "1553":{
            "choices":[
                "barts underworld teachers ",
                "mauda flanders ",
                "laura powers"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I just had other ideas but will put Laura in the options </span></div></span></div>",
            "created":1441649700,
            "id":2031180,
            "title":"other"
        }
    },
    "info":{
        "author_id":"j4min",
        "author_name":"J4min",
        "brief_description":"It's Bart's 12th birthday and his family each a different treat in mind for him",
        "created":1300987140,
        "description":"<td align=\"left\" class=\"norm\">It is Bart simpsons 12th birthday and each of his family have a dirty treat for him.<br>\r\n<br>\r\nMost things are allowed<br>\r\nNo short chapters only 3 or4 words long<br>\r\nNone of the Simpson family can die<br>\r\nBart must like everything he is seeing or doing</td>",
        "id":1762194,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1477677780,
        "modified":1477677780,
        "pretty_title":"Bart Simpson's dirty birthday"
    }
}