{
    "chapters":{
        "1":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "You (Growth)",
                "Pan (Growth)",
                "You (Shrinking)",
                "Pan (Shrinking)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>First off, choose what point of view you want this story to be from. Also, choose whether you want this to be a Growth story or a Shrinking story (yea, I know I didn't mention Shrinking in the title... sorry).</span></div></span></div>",
            "created":1123995600,
            "id":267416,
            "title":"POV"
        },
        "12":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Convince Bulma",
                "Convince Dr. Briefs",
                "Steal it"
            ],
            "content":"<div class=\"\"><div> <span>Son Pan was a normal Saiyan/Human girl (at least by her standards). There was one thing though, that Pan always kept from all her friends and family, though. She always had the urge to grow into a giantess and be bigger than everyone; Probably due to the fact that many of her friends would call her \"shorty\" or \"midget\" in school. One day, however, pan had had enough. She couldn't take the way her family looked down on her like she was some fragile item that if dropped would shatter. She decided to make her Giantess dreams into a reality. It would be hard though; she knew the only place to find a device to make herself grow would be the Capsule Corporation, but she didn't know how she would talk Bulma or Mr. Briefs into letting her have one. Either she could convince one of the two to let her have one using her little girlish charm, or she could steal it while they were not looking.</span></div></div>",
            "created":1123995600,
            "id":267418,
            "title":"Pan, the pushed"
        },
        "123":{
            "author_id":"jpelchat",
            "author_name":"Jpelchat",
            "choices":[
                "Activate it in here",
                "Wait and go outside"
            ],
            "content":"<div class=\"\"><div> <span>She dicided that trying to convince anyone would be too risky. After all, if she tried to convince one of them and it failed, she would have a much harder time trying to steal it. She figured she should just steal it while they don't suspect it and save herself the trouble of risking it with Bulma or Dr. Briefs. She arrived at West City in which Capsule Corporation was located, and quickly spotted it. It was a large dome-shaped building on a fairly large lot. She let her power dissapate and she slowly descended onto the grassy turf in front of the building. Quickly realizing that Dr. Briefs was riding his bike not too far away, Pan used her Saiyan speed to quickly move around undetected. She finally made it inside the Capsule Corporation building and quickly she started to check the labs, reading the lables on the doors. Finally, after about five minutes of stealthy moving, pan found it. It was a door with the words \"Growth Project\" on it. She checked through the narrow glass window to see if there was anybody inside, and saw nobody. She quickly opened the door and ran to the far wall (she couldn't move too fast because she used up most of her energy when she was moving fast before) and spotted a strange device that kind of looked like a Dragon-Radar but with a string around it to attach to her neck. She quickly put it on and just as soon as she did, she realized something she didn't before. Was she going to activate it in here or go outside to do it. If she did it in here she would most likely destroy the capsule corp building but if she did it out there, she would risk getting caught with the device. </span></div></div>",
            "created":1123995600,
            "id":267420,
            "title":"Finding the Device"
        },
        "1231":{
            "choices":[
                "50 Feet",
                "100 Feet",
                "WAY bigger!"
            ],
            "content":"<div class=\"\"><div> <span>Pan, after a few seconds of careful, thoughtful consideration, decided to activate it in here. Not to mention that there were footsteps clearly audible....Someone was coming! Had it been anybody else, she would've changed her mind and go outside...I mean, nobody here could stop her. Except...Vegeta and Trunks! She recognized the Shadow of the hair outside the door. It was Trunks. \"Here goes...!\" She says in a hoarse voice, trying to activate the device. \"How do I use this t-\" Suddenly, her entire body glowed. The one-fourth Saiyajin began to grow. There was a screen. It had a monitor saying her current Height, and then three buttons to click. Grow, stop, and shrink. Really simple, really. \"I better grow pretty big...Or he might try and stop me! Super Saiyans are pretty powerful, too...\" However, the Project was unfinished. It was more effective on Organic organisms than anything else.  It wouldn't take too much to outgrow her clothes. For now, however, they were growing steadily with her...</span></div></div>",
            "created":1198213200,
            "id":478110,
            "title":"Pan grows!"
        },
        "12311":{
            "choices":[
                "Pan grows more."
            ],
            "content":"<div class=\"\"><div> <span>Pan was growing. The large area for testing was a hundred feet tall-It needn't be taller. When testing on Living things, they had discovered that anything that grew to one-hundred feet, or taller, had a chance of becoming evil and destructive...Pan didn't know that, though. With a sort of odd grown, the one-fourth Saiyan seemed to crouch, then burst forward with the growth until she became fifty-feet tall. \"Growth...feels...so good...\" She says in short pants, as the door begins to open. Trunks entered, and-\"PAN!?\" He yelled, staggering against the door and closing it behind him. \"Wha...you're huge!\" With a smirk, she reached down and grabbed him. It wasn't hard. \"Hah, you noticed?\" \"But...Pan! I heard that anything that grew about a hundred feet tall became evil!\" The Giantess stood to her full height, but put down Trunks' first. \"Really? Well...It's not like I'll get in trouble! Nobody can stop me...at over a hundred feet even Grandpa Goku won't be able to touch me! Maybe being evil wouldn't be so bad...\"</span></div></div>",
            "created":1198213200,
            "id":478116,
            "title":"Trunks is in for a big surprise!"
        },
        "123111":{
            "choices":[
                "She stops at 100 feet.",
                "She continues to grow."
            ],
            "content":"<div class=\"\"><div> <span>With a smirk, Pan just blew. Trunks was sent flying through the door from the force of the wind. \"Now...It's time for some growing!\" Squealed the Giant Pan, as she clicked the Grow button. With a sigh of pleasure, she began to grow...Her clothes began to seem very tight. However, this went unnoticed by the growing Giantess, as the growth aura was Orgasmic to her....The power...As she hit seventy-five feet, the Saiyan's pants began to rip at the bottom, taking her from wearing Jeans to shorts. At eighty-five, her sleeves began to tear and fall. Upon reaching ninety-five feet in height, she let her large Bandanna fall to the floor. So all she had were Jean shorts and a shirt showing her midriff with no sleeves. Furthermore and finally, she hit one-hundred feet...but does she stop there?</span></div></div>",
            "created":1198213200,
            "id":478119,
            "title":"They grow up so fast...."
        },
        "1231111":{
            "author_id":"rampage77",
            "author_name":"rampage77",
            "choices":[
                "Arrive at Briefs house",
                "Take a detour to "
            ],
            "content":"<div class=\"\"><div> <span>Pan stopped growing at about 100 feet and then gazed at the minuscule world around her. Laughing she brought the tiny Trunks up to her face. \"Well this is a fun, new perspective\" she laughed. \"At my new height-I don't even think that super saiyans could stand up to me so why don't you give up now and capitulate. \"<br>\r\n<br>\r\nWith that Trunk blasted a powerful energy beam at Pan's face but it only made her blink for a second and then laugh. \"HAHA-silly little saiyan\" she smirked \"I told you your no match for me so this is your last chance to surrender before you face my wrath!\"<br>\r\n<br>\r\nTrunks recognized the futility of the fight and surrendered. \"Excellent my new saiyan slave\" she cackled \"now-let's go find your dad since I can't wait to make the prince of all saiyans bow to me and be put in his place. With that, she stuck trunk into her colossal navel and began walking to the Briefs house to find Vegeta. </span></div></div>",
            "created":1552798800,
            "id":2631260,
            "title":"She stops at 100 feet."
        },
        "12311111":{
            "author_id":"rampage77",
            "author_name":"rampage77",
            "choices":[
                "Submit and stay with Pan",
                "Fight back and avenge Vegeta"
            ],
            "content":"<div class=\"\"><div> <span>Pan arrived at the Brief complex in only a matter of minutes given how her large steps easily cut back on the time it took to get around. When she arrived she saw a space capsule in the front yard and could tell that it was currently being used by someone. \"Ha-well I think I know who that is\" she grinned \"Your dad's obsession with training to beat Goku makes him easy to find since I know he has no  friends and will always be either fighting or training. <br>\r\n<br>\r\nWith that she leaned over and picked up the capsule-opening the door on it and shaking the capsule like she was trying to get the last olive at of a jar or something. After a few minutes of this-Vegeta finally fell out into her giant hand with which he was engulfed and brought up to the giantess' face.<br>\r\n<br>\r\n\"Hello Vegeta!\" Pan said gleefully \"Aren't your impressed-here you spend day and night training and now with my new size given to me by a growth machine-I've acquired more power than you'll ever have!\"<br>\r\n<br>\r\n\"We'll see about that!\" said Vegeta. He then ripped from her grasp and launched a full strength galick gun at Pan's face. The light was blinding and everyone, including Trunks and Vegeta lost sight of things for a few minutes. However, when the smoke cleared-Pan's figure was still there except now she had a small burn on her face and her playful expression was now a furious glare.<br>\r\n<br>\r\n\"How dare you, prince!\" she screamed \"You know I was going to let you ride alongside with your son here inside my giant bellybutton while I tour the world that I now possess, but I guess we'll have to do this the hard way.<br>\r\n<br>\r\nWith that she swatted the prince like a fly-completely surprising him and sending him hurdling towards the ground. After his explosive impact with the ground-Vegeta lay in the dirt half dazed clutching his leg in a manner that implied that it had been broken. The giant girl then swooped upon the prince and brought him level to her mouth. <br>\r\n<br>\r\n\"If you won't be my super saiyan slave-then I guess you'll have to be my super saiyan sandwich\" she smirked. With that she started licking and caressing the stunned prince with her tongue before shoving him into her mouth entirely. After a few minutes of sucking on Vegeta like a jawbreaker-she swallowed the prince whole and then patted her belly\"<br>\r\n<br>\r\n\"Well-I guess your dad is kind of riding too-except you, Trunks, get a view of the world from my navel whereas your dad will have to settle for a dark dreary view of his final resting place\" she laughed.<br>\r\n<br>\r\nTrunk thinks quickly and then...</span></div></div>",
            "created":1552798800,
            "id":2631264,
            "title":"Arrive at Briefs house"
        },
        "123111111":{
            "author_id":"rampage77",
            "author_name":"rampage77",
            "choices":[
                "Decides that Pan needs to be stopped",
                "Decides to join Trunks"
            ],
            "content":"<div class=\"\"><div> <span>Deciding it best not to question this all powerful warrior goddess-Trunks submitted and stayed inside Pan's navel. She then resume walking across the earth, her huge footsteps covering miles. After a couple of hours, they came to the ocean and Pan stepped in. Luckily, it only came up to her knees and as she waded through the current Trunks noticed something in the distance-it was Kame House!<br>\r\n<br>\r\nAs they approached the familiar house, Trunks suddenly realized what Pan was doing now-she was off to find Goku to eradicate her last remaining opponent. When they neared the island, Trunks could recognize what was Goku's form through the window. As usual when Goku wasn't fighting, he was stuffing his face at the table with bowls of white rice and fried chicken.<br>\r\n<br>\r\nAs Pan closed in on the house, she yelled out with a sonicboom \"Hey Grandpa! Why don't you come out and play with your little granddaughter\" After a few minutes, a puzzled Goku made his way to the door and then stopped in amazement when he beheld his gargantuan granddaughter standing before him. \"Holy Crap, Pan!\" he screamed \"What happened and, wait, is that Trunks in your belly button?\" <br>\r\n<br>\r\n \"It sure is grandpa\" she cackled \"he is my compliant little slave and you're welcome to join him if you'd like!\"<br>\r\n<br>\r\nGoku then...</span></div></div>",
            "created":1552885200,
            "id":2631653,
            "title":"Submit and stay with Pan"
        },
        "1231111111":{
            "author_id":"rampage77",
            "author_name":"rampage77",
            "choices":[
                "Take her to the Briefs compound",
                "She's too dangerous-finish her off"
            ],
            "content":"<div class=\"\"><div> <span>Goku realized that Pan was out of control. He had heard a report just recently from King Kai that a monster was terrorizing the earth and had even eaten Vegeta, but hadn't realized it was his own granddaughter doing the damage.<br>\r\n<br>\r\n\"Look Pan-this has gotten out of hand\" he said \"Let's go back to the Brief compound and maybe Bulma can shrink you back to normal. If you don't come willingly then I'll be forced to make you!\"<br>\r\n<br>\r\n\"HAHA-silly little grandpa\" Pan laughed \"You won't be taking me anywhere-in fact-the only one who's going to be shrinking is you-when I CRUSH YOU LIKE A BUG!\"<br>\r\n<br>\r\nShe then lunged out of the water at Goku-crushing Kame House beneath her. Goku used instant transmission to bolt before her giant foot landed on top of him. Trunk-sensing the opportune moment then bolted from Pan's navel to help Goku. Flying high up into the air the reconvened with each other to discuss battle strategy. \"Ok-Goku-you're the one who provoked her so now how do we beat Pan\" Trunks asked anxiously.<br>\r\n<br>\r\nGoku replied with a small laugh \"Yeah-she's stronger than us-which is why we'll have to be smarter-we'll use a solar flare to blind her and then double team her with the strongest energy waves we both have to see if we can knock her unconscious and then bring her to the Briefs compound to shrink her down.<br>\r\n<br>\r\nThe two warriors then descended to see an intent giantess leering at them licking her lips \"I wonder which is tastier, super saiyan full-bloods or the half breeds!\" she laughed and then flew up into an attack on the Z warriors. <br>\r\n\"Ready, Trunks\" Goku yelled \"Ok-now-SOLAR FLARE\" he cried as a blinding flash of light blinded the giantess stunning her and forcing her to back off. <br>\r\n<br>\r\nScreaming in agony, Pan held her eyes in frustration realizing that her grandpa had outwitted her. Then Goku and Trunk both came near the giantess' head and powered up to their maximum. They then simultaneously launched two powerful Kamehaha blasts right at Pan's forehead. The blasts made a direct hit and sent Pan careening down to the ground. When the dust cleared she seemed unconscious but then started moving again. \"Wow-that's incredible\" gasped Trunks \"Normally two energy waves from Saiyan of our strength would have annihilated anybody-but with her new super strength-it didn't even completely knock her out!\" \"Let's finish the job then\" yelled Goku and with that the 2 warriors again let loose two energy blasts which this time succeeding in fully knocking out Pan.</span></div></div>",
            "created":1552885200,
            "id":2631657,
            "title":"Decides that Pan needs to be stopped"
        },
        "12311111111":{
            "author_id":"rampage77",
            "author_name":"rampage77",
            "choices":[
                "Arrival at the Brief",
                "Pan wakes up before they arrive!!"
            ],
            "content":"<div class=\"\"><div> <span>\"Ok-let's get her to the Brief's before she wakes up\" said Goku. The two then descended and crawled beneath the giantess. Goku lifted her up under the shoulder blades and Trunks lifted her up right above her ass crack. Even with the super saiyan strength-lifting the female titan was no easy task and the moved slowly in the air towards the Briefs compound..<br>\r\n<br>\r\nAfter a few hours-Trunks heard what sounded like a growling coming from Pan's body. \"Huh-poor father\" he thought to himself \"I guess we'll have to wish him back with the Dragonballs because it sounds like he's being digested\". Suddenly the sound got louder like to was moving towards him and then he realized what it was. \"Oh crap, Goku-she about to..\" and before he could finish Pan unconsciously let out an enormous fart that made a direct hit on Trunks. The smell was so overpowering that it temporarily caused him to lose his grip and cause the two to lose their precarious balance over the giantess' body. \"Trunks-hurry help me\" said Goku as Pan falling threatening to crush Goku under her. Trunks summoned up all his strength and lifted Pan up by getting under her ass again. The smell was bad but they were only a few minutes from the Brief's compound. </span></div></div>",
            "created":1552885200,
            "id":2631660,
            "title":"Take her to the Briefs compound"
        },
        "123111111111":{
            "author_id":"rampage77",
            "author_name":"rampage77",
            "choices":[
                "Back in her navel",
                "further north (her chest)",
                "further south (her pants)"
            ],
            "content":"<div class=\"\"><div> <span>Arriving at the Brief's compound the two laid the giantess down in the backyard and then Goku went to look for Bulma. Trunks stayed and watched guard over the giantess in case she should wake up. He hovered over her face and stared and her giant mouth and lips. \"Wow-if she wasn't so ferocious at that size-she almost be stunningly gorgeous\" he murmured to himself. Suddenly he felt a tremor beneath him and saw one of the giant eyes open \"Why thank you my sweet little slave\" Pan giggled. <br>\r\n<br>\r\nIn horror, Trunks jumped up, but was too late and was snatched up by the young giantess into her hand. She then lifted him to her face and gave him the biggest, wettest kiss of his life. \"Oh Trunk! I'm so disappointed that you turned on me after I was willing to let you be my slave but since you said I'm pretty-then maybe I'll give you another chance\" she laughed. She then turned serious \"You saw what happened to your father-so I'll give you one last chance\" she said lowering Trunks back down to being level with her giant belly button. \"You can join Vegeta in my stomach or be my good little slave and take your place by my side again\" she boomed. <br>\r\n<br>\r\nTrunk realized that it was really no choice since he couldn't beat her alone-so he again submitted. \"Good choice my cute slave\" she laughed \"Now go wait behind the house for when Goku comes out-I'll need you to surprise him so I can pound him into dust!\" <br>\r\n<br>\r\nTrunks then hid behind some trees and waited. Goku and Bulma emerged and immediately panicked. \"Oh no-she awake\" Goku yelled \"Wait-where's Trun...\". Suddenly the mighty saiyan was hit from the back by a powerful blue energy wave Trunks unleashed. It was only enough to temporarily stun Goku, but this was all the time Pan needed. She then descended on the saiyan stepping and punching on him relentlessly for a few minutes. Anyone lesser would have been instantly crushed-but Goku just knocked unconscious with some broken bones but still breathing. <br>\r\n<br>\r\n\"Ha my weak little grandpa is no match for me\" she bellowed \"I should finish him  off since he's the only one on earth that can stop me, but he is still my grandpa and I don't think that I can kill him just yet\" With that-she kicked Goku aside and then turned back to Trunks. \"Job well done my little slave!\" she chirped \"Well-don't just stand there looking at me-come one-we've got a world to rule-I'll even let you choose where on me you get to ride!\"</span></div></div>",
            "created":1552885200,
            "id":2631667,
            "title":"Arrival at the Brief"
        },
        "1231111111111":{
            "author_id":"rampage77",
            "author_name":"rampage77",
            "choices":[
                "Off to find Mr Satan",
                "Goku suddenly wakes up"
            ],
            "content":"<div class=\"\"><div> <span>Trunks though for a few minute and then replied \"Well you navel was actually pretty comfortable-I guess if I had to pick any part of you to ride on that would be the easiest\" he said.<br>\r\n<br>\r\n\"Excellent choice, slave\" she cackled grabbing him up and lowering the him down to her taught, sexy belly button \"Ok-in you go!\". She then shoved Trunks back inside his looking perch and then continued her rampage to the next location.</span></div></div>",
            "created":1552885200,
            "id":2631668,
            "title":"Back in her navel"
        },
        "1231112":{
            "choices":[
                "begins to Rampage.",
                "Grows even more!"
            ],
            "content":"<div class=\"\"><div> <span>Let's get a little comparison of Pan's height before continuing. She is currently at one-hundred feet in height. About two/thirds of the height of the Statue of Liberty in our world. Now...continuing. Meaning, Pan CONTINUES to grow. With a groan of pleasure the Saiyan focuses, and stops growing for a few seconds, then she lets out a yell and doubles to two-hundred feet in height. Trunks, at the ground near her feet, looked barely two inches tall from her perspective. Yet, she kept growing. \"I am...a Goddess!\" Yelled the Giantess, the ground shaking. As she hit three-hundred feet tall(About as tall as Big Ben in our world, by the way), she busted her way out of the building. As she continued to grow, reaching four-hundred feet, her top busted off completely, leaving her in nothing but a Bra. Her breasts had grown considerably-not even by proportion. If she was at normal size they would be considered an F, at least. At 400 feet tall, her breasts were 24 feet high, 22 feet wide, and 10 feet out from her chest. They both weighed a bit over 337 tons. With a grin, the Giant Pan made her way to the city. \"Hey, wait!\" Yelled Trunks, turning Super Saiyan and flying towards her face. He seemed less than an inch tall to her. \"What's that, a fly?\" Came her booming voice as she waved her hand, sending Trunks flying through several buildings. She then...</span></div></div>",
            "created":1198213200,
            "id":478122,
            "title":"That's BIG."
        },
        "12311121":{
            "author_id":"xtremeunivese3",
            "author_name":"XtremeUniverse3",
            "choices":[
                "Videl (her mom)",
                "Vegeta returns pissed off seeing what had happened!"
            ],
            "content":"<div class=\"\"><div> <span>    At 400 ft tall Pan begins here rampage upon the city as Trunks tries to regain his strength again after going through several buildings after being swatted by Pan like a fly, even at Super Saiyan he wasn't strong enough. He couldn't get get Goten to help out to stop his niece because he's out on vacation with his girlfriend. Vegeta, ehhh, he just simply doing training out of the city. But maybe, just maybe he could try...nope the city's doomed by a giant girl. So it is up to Trunks to save the world this time without Goku or anyone else. <br>\r\n<br>\r\n     Pan, is just destroying buildings, cars, gas stations, and stomping around everything in her path that gets in her way. Then she saw multiple citizens run away below her like the little ants they are and then, Pan puts her hand by her stomach and it starts to growl. \"Whoa! Looks like I'm hungry BIG time!\" (I know stupid pun... -_-) She then gets on her knees and crushes a few streets and building along the way and picks up a lot of citizens and she licks her lips to how appetizing they all are and by the time she opens her mouth, the citizens scream, and a Ki blast hits her mouth and it stung and as Pan looked on, it was Trunks and he recovered from the pain he took from her. Trunks kept on throwing blasts moves after blast moves as Pan kept on trying to swat him away but he was too fast for her, that is one of the downsides of being a giant, being too slow.<br>\r\n<br>\r\n      When Trunks tried to pull off one of his moves his special finishing move \"Finish Buster\", Pan pointed her finger at Trunks and made a giant Ki blast out of one finger and blew him away and he was down for the count. Outside the city, Vegeta sensed this and noticed it was Trunks' energy fading and flew to the city to see what the hell is going on and to save his son.<br>\r\n<br>\r\n       Pan got back to business as she became starving she just opened her mouth and dumped everyone in her mouth and swallowed all of them whole. Then Pan had an idea, \"Hmm, I've been itching to try this out as a giantess....\" and she took a fistful of people and she told them all \"all of you and more must pleasure the insides of your goddess! if you don't you will suffer the consequences! Where, you may ask? It is my big beautiful ass of course! Have fun....\" as she said that she shoved everyone inside her big ass, trapped for good. As all the people (available) were inside her, she was loving it, but someone came it to stop her. (or is it?? *hint: first choice*) [addition: the growth device now has young/older setting]</span></div></div>",
            "created":1408424400,
            "id":1844146,
            "title":"begins to Rampage."
        },
        "12311122":{
            "choices":[
                "Pan continues to rampage.",
                "Pan takes her growth to the max."
            ],
            "content":"<div class=\"\"><div> <span>clicked the grow button on the device which had obviously grown with her. \"I'll just hold it in and get so big...\" She whispered, halting the growth by holding in her Ki(Or chi) energy. However, the Whisper was clearly audible to the tiny people below. \"That I can stomp out this city with my foot!\" She yelled, releasing her energy and quickly jumping backwards out of the city. 500....600...700...800...Her pants bust, leaving her in her Bra and Panties. 900...1000. She didn't click stop yet, though. The growth speed returned to normal. 1100...1200.........1300................1400. She stopped at 1500 feet tall. \"Hm...not exactly big enough. It'll do, though.\" Said Pan cheerfully, as she began to destroy the city. The tallest building, at four-hundred feet, came up to her knee. </span></div></div>",
            "created":1198213200,
            "id":478125,
            "title":"Grows even more!"
        },
        "123111222":{
            "choices":[
                "Go Kill anybody powerful.",
                "Grow, then do the action in Option 1."
            ],
            "content":"<div class=\"\"><div> <span>Moving back from the City, Pan tried to grow more. Holding in her Ki energy, she pushed the grow button. She waited a full minute this time before letting it flow. This time it was in short, quick bursts instead of a constant growth, and each time she let out a groan of pleasure. This time she was doubling each time in size! 3000, 6000, 12000...and it continued! 24000, and finally 48000 feet...Nine miles tall! Pan didn't know, however, that the Troposphere ends at ten miles above the Earth's surface. However, there had been a Professor at Capsule Corp who made it so growth subjects did not have to breath. He had been planning to use it to take over the world himself. However, that didn't work so well, as Pan had gotten it. Moving on. As she had hit 24000 feet, both of Pan's bra straps had snapped. Her Breasts in proportion(As in, had she been normal sized) had far surpassed any letter that might describe them. \"Oh, my breasts are so swollen...I think this city needs to DROWN!\" Yells the Saiyan, nearly breaking everybody's eardrums. With a grin, she begins to let a Drop of Milk fall from both of her breasts. A single drop. One drop alone was 34,916,213 Gallons, and weighed 139,664 Tons. The Milk easily flooded West city, killing thousands. Pan's power was now atleast fifty times that of Super Saiyan Four Gogeta. Pan decides to...</span></div></div>",
            "created":1198213200,
            "id":478128,
            "title":"Big enough to stomp out the city. "
        },
        "1231112222":{
            "choices":[
                "Destroys everything.",
                "CONTINUE TO GROW!?"
            ],
            "content":"<div class=\"\"><div> <span>Pan lay on the ground, clicking the grow button. It was time to do the thing she had waited for for so long. An Orgasm...Hah. She let the growth come naturally as she began to have an orgasm, leaving deep welts in the ground. The longer she had the Orgasm, the more energy she had from the excitement and enjoyment. The more energy she had, the more she grew, and the more she grew, the hornier she got. With a deep groan of pleasure, she finally stopped and stood up. Her Panties had busted off a moment or two after she had started, so she was now completely naked at 800,000 feet tall...around 151 miles! She weighed 135 Trillion pounds, leaving very deep indents in the ground as she stood. At this height she could lift 506 Trillion pounds. All people looked completely insignificant to her and were out of her sight. Her breasts are 9 miles by 8 miles, and go 3 miles out from her chest! They weight 2.7 Trillion pounds, and a single drop of Milk from her breasts would be 161 Billion Gallons, with a weight of 646 Million pounds! Her Vagina was 13 miles deep, even...Every aspect of her body was gigantic. That wasn't it, though. \"HAAAA!\" Yelled the One/Fourth Saiyan girl, as she began to grow more...The strap of the Device around her neck suddenly snapped, and shrunk to its original size as it fell to the ground a good way away. However, she continued to grow...Naturally, now! Her size was incomprehensible as she reached 1.6 Million feet...3.2...6.4...and higher, higher! 12.8...All the way to 51.2 Million feet tall. 965 Feet. Almost as big as Japan in our world. At this height she began to have another Orgasm, and began to gain more energy and excitement, and began to grow faster...the cycle. 102.4...204.8...409.6 Million feet is where it stopped. 7746 Miles. Gigantic...Humongous! She then...</span></div></div>",
            "created":1198213200,
            "id":478133,
            "title":"Past the Max."
        },
        "12311122222":{
            "choices":[
                "The growth continues further!?",
                "Destruction begins."
            ],
            "content":"<div class=\"\"><div> <span>Takes her growth to the ultimate max. But someone was right behind her in growth. It was Bulla, Trunks' sister and Vegeta and Bulma's second child. She had found the device and saw Pan being so evil...she was the only one to stop it. Kind of valiant, really. <br>\r\n<br>\r\nThe Device had been being tested with Pan, testing out the heights for the first time. Bulla grew much faster, reaching a height of nearly 19000 Miles...over twice the mass of Earth. They had outgrown the Earth. It was time for a battle of the Goddesses...or it would be, if Bulla hadn't been turned evil too. The two continued to grow, letting out maniacal laughs that shook the universe. Nearly 190000 Miles. Another Zero already? They were growing insanely fast now. Their breasts were 11500 Miles or so high, around 10700 Miles wide...Larger than the Earth now! Even more they continued to grow...19000000 Miles, or around there. It was insane...The Daughter of Vegeta and Bulma, Sister of Trunks, and the Daughter of Gohan and Videl, Granddaughter of Goku and Chichi, were both the rulers of the Universe. The Irony was that all those people, their Fathers and Mothers and Grandparents, were good. </span></div></div>",
            "created":1198213200,
            "id":478135,
            "title":"CONTINUE TO GROW!?"
        },
        "123111222221":{
            "choices":[
                "Bulla and Pan continue growing and being allies.",
                "Pan tries to get rid of Bulla."
            ],
            "content":"<div class=\"\"><div> <span>Bulla and Pan both began to have orgasms in space. At a height of 151 Billion miles tall, the juices flowing from their 13 Billion Mile deep Vaginas destroyed the entire Universe. Earth, New Vegeta, New Namek...This destruction was ultimate. As they grew to 151 Trillion feet, their Orgasms destroyed the West, South, and East Universes as well. Bulla smirked, as she squirted Milk into the center of the Universe where the Afterlife was really located at. Her 459 Million Mile wide Milk stream destroyed it completely. The dead spirits had nowhere to go. However...What if they didn't want to share the universe?</span></div></div>",
            "created":1198213200,
            "id":478137,
            "title":"This is the REAL max of growth!"
        },
        "1231112222211":{
            "author_id":"awesomex18",
            "author_name":"awesomex18",
            "choices":[
                "Bulla's growth necklace breaks",
                "Pan is still too small...Bigger!"
            ],
            "content":"<div class=\"\"><div> <span>Pan and Bulla. Just an hour ago, they were both normal sized girls. Now, they were almost immeasurable in size.<br>\r\n<br>\r\nPan and Bulla continued to grow faster and faster...1 quadrillion miles, 10 x 10^15 miles, 10 x 10^20 miles tall, and still they grew. In a matter of seconds, Bulla and Pan outgrew the universe itself.<br>\r\n<br>\r\n\"HAHAHAHA!\" Pan laughed. \"Bigger than the universe already? That took way too long! Bulla, let's make sure nobody else can try to stop us.\"<br>\r\n<br>\r\nBulla then looked over at Pan. She knew what she was thinking. Pan placed one of her feet on the right side of the universe and Bulla did the same on the left side.<br>\r\n<br>\r\n\"NOW!\" Pan shouted.<br>\r\n<br>\r\nThe two girls pressed their feet together quickly and destroyed the universe once and for all.<br>\r\n<br>\r\n\"Now we're unstoppable!!!!!\" Pan laughed again. \"HAHAHAHAHAHAHA!!!!! But there's something that's bothering me Bulla.\"<br>\r\n<br>\r\n\"What is it Pan?\"<br>\r\n<br>\r\n\"I feel small...Too small. I NEED TO BE BIGGER!!!!! MUCH, MUCH, MUCH, MUCH, MUCH BIGGER!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\"<br>\r\n<br>\r\nWith that, Pan exploded with growth, her growth accelerating faster and faster. \"I'm so small...So very, very small. I just need to be bigger. Bigger, Bigger, BIGGER!!!!!!!\"<br>\r\n<br>\r\n\"Wait up Pan!\" Bulla said. She began to grow again but wasn't able to match Pan's speed. She began to dwindle in size to her fellow goddess.<br>\r\n<br>\r\n\"BIGGER!\" Pan yelled, \"BIGGER!!!!! I'M STILL TOO SMALL!!!!!\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1226206800,
            "id":605632,
            "title":"Bigger and Bigger and BIGGER!"
        },
        "12311122222112":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Pan began to pleasure herself and focus on growing more.",
                "Bulla catches up in size finally. Pan explains and they Grow more"
            ],
            "content":"<div class=\"\"><div> <span>Pan continued to grow her now bug sized by comparison but still growing partner nearly forgotten.<br>\r\n<br>\r\n\"STILL TOO SMALL!!!! BIGGER MUST BE MUCH MUCH BIGGER STILL\" yelled Pan into the darkness as she continue to grow spotting some planets here and there larger than herself though this didn't last as the shrunk before here. Each orgasm shrinking them before her in nearly an instant. First these planets became Boulder size then wrecking ball size then beach ball size then they were like tennis balls compared to her.<br>\r\n<br>\r\nStill she continued to grow and orgasm. \"BIGGER STILL NOT ENOUGH!!! MUST BE BIGGER!!! I'LL NEVER BE BIG ENOUGH\" said Pan pleasuring herself and growing. The planets turning to marbles then pea size then she lost sight of them all together. As she grew she was once more greeted by darkness.<br>\r\n<br>\r\n<br>\r\nAfter about five more minutes or so though this would pass. To her surprise she began to feel solid ground. Still growing the darkness opened up before her into light as her growth slowed for now. Finally the growth stopped and her mouth was agape in sheer disbelief. Somehow she was tiny staring up at beyond skyscraper sized flowers and blades of grass. There was even a nearby ladybug that from her perspective would put the Godzilla from movies in her former home to shame size wise.<br>\r\n<br>\r\n\"WHAT THE HELL GIVES?!! I'M FUCKING TINY AGAIN\" yelled a pissed off Pan. Then using reasoning and her smarts similar to Gohan's though none know where all them brains came from in either of their cases she thought about it. \"Wait a minute maybe that whole infinite universes bull crap Gohan once studied is true. Guess that means I outgrew my old universe obviously\" she reasoned.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n\"WELL THEN I GUESS WE BOTH WILL JUST BOTH HAVE TO OUTGROW THIS AND ANY OTHER FUCKING UNIVERSE WE PLEASE\" shouted Pan.</span></div></div>",
            "created":1352869200,
            "id":1467829,
            "title":"Pan is still too small...Bigger!"
        },
        "1231112222212":{
            "content":"<div class=\"\"><div> <span>Bulla let out a laugh as there was a tiny flash of lights indicating the Afterlife's destruction. However, she felt energy behind her. She turned to see Pan behind her...Or her finger, anyway. Pan was now 757575(Trillion is here)757(Billion)575(Million)757600000. Another finger appeared behind Bulla, and she was crushed by Pan. Powering up, Pan reached a height of 652975840644327889407458693679587380582 Miles tall. Pan, from there, floated through the Universe and continued to grow. She quadrupled in size every few seconds when she wanted until she exited the Multiverse* completely. A few minutes later, after Pan finished growing to a height of around...<br>\r\n1724622123642389731484312381711466410641256219519252921061623016016651294056 1205620561056216524056<br>\r\nmiles tall, the entire Multiverse collided with one strand of her hair and shattered. Completely blackness. <br>\r\n<br>\r\n<br>\r\n<br>\r\n-END-</span></div></div>",
            "created":1198213200,
            "id":478138,
            "title":"Pan destroys Bulla. "
        },
        "12313":{
            "author_id":"fxd-001",
            "author_name":"ForestFire5000",
            "choices":[
                "1000 feet tall",
                "Are you kidding me? That's way too small!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how much bigger will Pan grow?</span></div></span></div>",
            "created":1298782800,
            "id":1061615,
            "title":"WAY bigger!"
        },
        "123132":{
            "author_id":"nellyraimon",
            "author_name":"nellyraimon lover ",
            "choices":[
                "she tranform into a adult with a massive butt and boobs ",
                "she transform into a super saiyan ! "
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nPann grew in a few seconds larger than the city. I destroy all the buildings, cars and everything that was around them.<br>\r\n<br>\r\nbread continued to grow, becoming bigger and bigger and reaching the size of a continent.<br>\r\n<br>\r\nher bandana surprisingly supported all the growth but all her other clothes did not, but that did not matter, there would not be any clothes that came in.<br>\r\n<br>\r\nI'm huge! He said bread while admiring his huge body.<br>\r\n<br>\r\nbut suddenly bread began to feel another sensation different from before, is it going to grow? </span></div></div>",
            "created":1541826000,
            "id":2575694,
            "title":"Are you kidding me? That's way too small!"
        },
        "1232":{
            "author_id":"dansaltsc",
            "author_name":"danni",
            "choices":[
                "Another 6 inches!",
                "More than 6!",
                "Wait to grow more."
            ],
            "content":"<div class=\"\"><div> <span>She decides to zap herself a few inches, about 6 inches taller, then walk outside, with the growth ray in her pocket. She then proceeds to fly over to Dende's place, where she is promptly asked by Trunks \"Hey, did you hit a growth spurt?\" She smiles brightly, stretching, saying \"I was wondering if anyone would notice! I am a growing girl after all!\" with a soft giggle, thinking another 6 inches wouldn't hurt.</span></div></div>",
            "created":1491368400,
            "id":2300217,
            "title":"Wait and go outside"
        },
        "12321":{
            "author_id":"dansaltsc",
            "author_name":"danni",
            "choices":[
                "She grows again!",
                "She shows off her new size!"
            ],
            "content":"<div class=\"\"><div> <span>She zaps herself again when nobody was around. She grabs a measuring tape and measures herself, smiling as she saw. 5 ft 6 inches, an entire ft taller than she was when she began! She notices one flaw in the growth ray though.. Her shoes never grew with her! She's barefoot. She shrugs, she preferred being barefoot anyways.</span></div></div>",
            "created":1499058000,
            "id":2346431,
            "title":"Another 6 inches!"
        },
        "123211":{
            "author_id":"dansaltsc",
            "author_name":"danni",
            "choices":[
                "Grow more!",
                "Go show off to Trunks!"
            ],
            "content":"<div class=\"\"><div> <span>With a soft grin, she gripped the growth ray. \"I need to grow again..\" She says.<br>\r\n<br>\r\nAnd with the next shot of the growth ray, she grew to 7 ft! She let out a gulp.<br>\r\n<br>\r\n\"Oh crud.. Maybe this is too big to pass off as a growth spurt..\" She says.<br>\r\n<br>\r\nShe looks for a reverse switch, only to find there isn't one! \"Well.. Not like anyone will be too worried about me being super tall~\"<br>\r\n<br>\r\nShe then decides to..</span></div></div>",
            "created":1533963600,
            "id":2531957,
            "title":"She grows again!"
        },
        "1232111":{
            "author_id":"dansaltsc",
            "author_name":"danni",
            "choices":[
                "She went to the bullies!",
                "Time for a major growth spurt already!"
            ],
            "content":"<div class=\"\"><div> <span>She hit 10 ft! \"Awesome!\" She yells, putting the growth ray in her pocket, grinning as she stomps her huge bare foot. \"Perfect. Now those bullies will quit saying my feet are big.\" She says with a laugh. They never got to her too bad, but they were annoying.</span></div></div>",
            "created":1534136400,
            "id":2532775,
            "title":"Grow more!"
        },
        "13":{
            "choices":[
                "You get to her home and go to bed",
                "You get to her home, she wants to have some \"fun\"",
                "She wants to put you somewhere else",
                "....in the butt you go"
            ],
            "content":"<div class=\"\"><div> <span>You and Pan are walking in Balma's lab beside many thousands of chemicals all messily packed on to the shelves. You look down to see Pan looking up at you, wondering what you're thinking.<br>\r\n\"What do all of these containers do?\" You ask.<br>\r\n\"Don't know, let's find out\" She replies, just as she pushes you into the shelf. \"Aaa!\" you jerk as the shelf comes crashing down on you, all the chemicals mixing and merging with your body. Pan's looking a little shocked, she didn't mean to do any of that!<br>\r\n<br>\r\nPan quickly dashes in to reque you then flys you back to her house. But on the way over you feel different and everything seems different to you, you can see Pan's backpack but it seems so big - you assume it's because you're riding on Pan's back, but your wrong. You look at the distance between Pan's neck and her feet and it's growing more and more.<br>\r\n\"Pan, what's happening?\" You ask her. She turns to look<br>\r\n\"Wow, you're getting smaller eh i mean shrinking!\" Pan answers with astonishment.<br>\r\n<br>\r\nOnly a few minutes pass and already you're small enough to lie on Pan's shoulder but then you see a grin on her face. Her hand reaches out to grab you, she lifts you up and she sticks you in her breast cleaverage. You eventually stop shrinking around a couple inches and you're waiting for Pan to take you home but with a bra in your face it's hard to see anything.</span></div></div>",
            "created":1140930000,
            "id":303589,
            "title":"Pan's bra"
        },
        "131":{
            "author_id":"jikirauchiha",
            "author_name":"Aron Clancy",
            "choices":[
                "Dropped you into her shoe. ",
                "Dropped you into her mouth.",
                "Sat down on you."
            ],
            "content":"<div class=\"\"><div> <span>While you were riding on Pan's hand as she flew through the air, you start thinking about you and her met and the series of events that led to this predicament..........<br>\r\n<br>\r\n<div align=\"center\">-------------------------------------------------------------------- </div><br>\r\n<br>\r\nYou had been invited to some high class school in Satan City as part of some exchange system that swaps two student from different schools for a year. You have no idea why they would exchange a student from one of the biggest cities in the world with one that lived in the middle of nowhere, but they did and it was the beginning of a very close friendship. <br>\r\n<br>\r\nYour first week at the school was hell. Apparently the student that you exchanged with was really popular and not having them around for a whole year made almost everyone there hate you, so you were bullied heavily. Pan didn't like how everyone was treating you so she started hanging out with you to make you feel better. After she became your friend the bullies mysteriously stopped messing with you, but they still gave you angry looks when you passed them so they definitely weren't done with you. This lead to them cornering you in an alley and started beating you up, until Pan dropped from the sky as if she had been flying and beat all of them in less than a minute. You were shocked at how strong she was, and the bullies stopping their torture of you made so much more sense. Pan was worried that you would be scared of her and stop being her friend but you thought it was awesome that she was so strong and you were happy that she protected you from your bullies.<br>\r\n<br>\r\nPan was so happy that she finally had a friend that wasn't scared of her powers that she almost broke your ribs with the hug she gave you. Since then, you and her have been inseparable, even when the year was over she had her grandpa (who it turned out was the World Tournament Champion Mr.Satan so she was incredibly rich) spend a bunch of money to move you over Satan City and enroll you into the school that you met her at. <br>\r\n<br>\r\nEventually she took you to Capsule Corp to look at the inventions there and she jokingly pushed you into a shelf causing it to fall on you and your body to start shrinking to the size you are now. Pan then panicked, grabbed you and flew home so that she didn't get in trouble.<br>\r\n<br>\r\n<div align=\"center\">-------------------------------------------------------------------- </div><br>\r\n<br>\r\nPan made it back to Satan City, flew into the window to her room and put you down on her bed. \"Oh this is so bad! I didn't mean to do this!\" Pan was pacing around her room trying to figure out what to do about your new height. She was pacing so fast that she tripped and fell right on top of you! <br>\r\nYou were being crushed under Pan's big butt while she was trying to get back up. You weren't hurt though, it must've been the chemicals that fell on you making you small, they must've also made you invincible. Pan was happy to see that you were okay, but when you told her you might be invincible she gave you a mischievous grin that she always gave you before she started messing with you. She then............  </span></div></div>",
            "created":1512882000,
            "id":2426357,
            "title":"You get to her home and go to bed"
        },
        "1312":{
            "author_id":"buu3",
            "author_name":"Bunty",
            "choices":[
                "She swallows you alive ",
                "She spits you out "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pan's hanger </span></div></span></div>",
            "created":1603918980,
            "id":2930806,
            "title":"Dropped you into her mouth."
        },
        "1313":{
            "author_id":"jumbi",
            "author_name":"Jumbiman",
            "choices":[
                "Fart torture",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Now that Pan knew you were indestructable, she had an idea. She quickly lowered you down under her butt and sat on you. She then...</span></div></span></div>",
            "created":1562477520,
            "id":2683247,
            "title":"Pinned Under Pan"
        },
        "13131":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "Keep sitting on you and getting comfortable.",
                "Get up, she didn't want you to die from her farts.",
                "*Readers Choice*"
            ],
            "content":"<div class=\"\"><div> <span>Pan would feel her stomach rumbling for a bit, however it was not in hunger. \"Heh heh heh, hey little guy, I got a bit of gas I need to let out, I hope you don't mind!\" Pan teased. After hearing her say that, you tried squirming under the giant girl, but she was HEAVY, you had a better time moving a brick wall than her big butt.<br>\r\n<br>\r\nSoon, a gust of wind blew on you like a heavy breeze, and it didn't smell pretty. In fact, it was horrible, her fart was the worst thing you've smelled in a your life, the smell of her windy blast smelled like rotten eggs and cheese across the board. It was sickening, so much so that your eyes watered and made tears that went down your cheeks. Meanwhile, you could hear Pan laughing a bit. \"Ahaha, that smells horrible doesn't it!\" She teased and rhetorically asked and grinded her giant butt a bit, keeping you surrounded in her nasty smell.<br>\r\n<br>\r\nHowever, it got worse<br>\r\n<br>\r\nAnother warm gust of wind hit you, but it didn't make a sound. For the lack of sound, it made up for it by smelling EVEN WORSE than what you smelled earlier. \"MMMMMMMMMPPPPPPPPPHHHHHHHHH\" You muffled and twitched after your nose got a whiff of how TOXIC her fart smelled. Her butt went to smelling like rotten eggs to smelling like a sewer. It smelled that terrible. You could then hear Pan laughing at you as she could feel your reaction to both of her deadly farts. \"Did that stink? Ahahahahaha!\" She laughed, keep in her butt on your miniature face, making you only smell the farts she whipped up.<br>\r\n<br>\r\nShe would then...</span></div></div>",
            "created":1584465240,
            "id":2802796,
            "title":"Fart torture"
        },
        "131311":{
            "author_id":"goldenrp",
            "author_name":"CrazyNoisyGreatDays",
            "choices":[
                "\"My butt slave\"",
                "\"My new toy.\"",
                "\"My boyfriend  (or girlfriend)"
            ],
            "content":"<div class=\"\"><div> <span>\"Aaah, while you're under there, I think I might as well get comfortable.\" Pan said, shifting her giant weight on you and getting herself nice and comfy on her “seat.” <br>\r\n<br>\r\nWhile she was getting comfortable, you were suffering under her. Not only she unleash 2 giant farts on you, she has the right to make you her seat cushion? What is going on with her, she was nicer to you before, but now she was being this inconsiderate and apathetic to how much you're suffering because of her? These thoughts were on your mind as you were trying to think of a way to get away from being under Pan's rump and try to run away.<br>\r\n<br>\r\nHowever, your attempts at escape were on hold as you felt Pan's heavy butt shift in on you some more. You then heard a bit of noise, it sounded like a Television with how loud the noise was. You then hear clicking noise, it sounded like a remote or a controller, but all you could do was guess since you felt like she wasn't gonna get off of you for a while.<br>\r\n<br>\r\n“Hey little guy, I gotta game for ya.” Pan said. “I got to this level in a video game, but right now I'm kinda stuck on it. For every time I die on this level, you're gonna be smelling one of my farts. Do you accept, well, not like you have a choice anyway.” She said, the only thing you could pray is that she doesn't fail at the level too many times.<br>\r\n<br>\r\nHowever, you heard a noise<br>\r\n<br>\r\nYou heard something a small hinge after hearing some hops and jumps, and running. “Hahaha, You hear that? Get ready!” Pan would say before releasing a small fart on you. The fart smelled just as bad as it did the first time. Raunchy, eggy, what else could be used to describe the prison you're trapped under.<br>\r\n<br>\r\nAfter a few minutes, you heard the jingle again. “Oh no…” Is what you thought after hearing it. Soon, you would be greeted to another one of Pan’s nasty smelling winds. The smell of the big girl’s fart made you tear up due to its nastiness alone. You didn't know how much more you could take, and it was her second one.<br>\r\n<br>\r\nYou heard the Jingle For the third time and then felt a third wind blow directly on you. The even nastier smell of her toxic smelling farts made you want to throw up, it made you gag, twitch, and wish you weren't invincible so you wouldn't have to smell what this girl ate of lunch.<br>\r\n<br>\r\nSoon, even more minutes went by. You kept “lose a life” jingles, and Pan kept following it up with releasing another fart directly on you. After about 30 minutes, you were met with about 15 farts. Under her butt would be what you would call “Stinky Hell.” Even worse is that all you could smell was Pan’s nasty behind. “P-please……… stop.” You weakly said, you didn't know how much more of her gas you could take, not only did She get comfortable, it was twice that she surrounded you with only just her butt and giant, nasty farts. “Man, that level sucked anyway. What's that under m-, oh yeah, I forgot you were there.” Pan said, now rubbing her giant ass on you, going left and right in a rhythmic motion. Not only did it stink horribly, you were feeling a wall rubbing itself on you. “Mmmmm, I should keep you as…”</span></div></div>",
            "created":1584472080,
            "id":2802844,
            "title":"Pan's new seat."
        },
        "13132":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Choice 1.",
                "Choice 2."
            ],
            "content":"<div class=\"\"><div> <span>Pan then lifted her add up off u just long enough to take off her jean shorts and panties then she slamed her now bare add full force into u braking her bed in the process, she gets off u and ur flattened onto the now broken bed but u get up and r un-harmed and u r positive that u r invincible and ur bones r like rubber they flatten when u r and reform when ur free. Pan now understanding this asks u what do u wanna do next? As Pan asks u this all u can look at is her naked pussy.<br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\n1: ask Pan to let u sleep on the question and jump off the bed.<br>\r\n<br>\r\n2: ask Pan to let u into her pussy.</span></div></div>",
            "created":1576819440,
            "id":2761933,
            "title":"Something else"
        },
        "132":{
            "author_name":"rebel13",
            "choices":[
                "Hungry",
                "Horny"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As soon as you reach Pans house she stis you of your clothes and smiles. <br>\r\n<br>\r\nShes feeling kinda of</span></div></span></div>",
            "created":1165035600,
            "id":363016,
            "title":"What kind of fun"
        },
        "1322":{
            "choices":[
                "Poke your penis",
                "Give You A Blow Job",
                "Put you somewhere on her body"
            ],
            "content":"<div class=\"\"><div> <span>She's  feeling kinda of horny. After all she's young and it's the first time she sees a man naked.You try to cover your body as you can, especially your penis but she snatches your hands from it. You don't even resist because you don't want to make her angry. If this would happen she could kill you.<br>\r\nThen She...</span></div></div>",
            "created":1226120400,
            "id":605591,
            "title":"Horny Pan"
        },
        "13221":{
            "author_id":"dbzman315",
            "author_name":"dbzman315",
            "choices":[
                "Pan Decides to Keep Her New Slave",
                "Pan Wants to Toy with The Shrunken Guy"
            ],
            "content":"<div class=\"\"><div> <span>Pan was just walking down the hallway, when all of a sudden she noticed a small flash of light on the floor. She walked over to where the light had been shining and could not believe what she was looking at. Pan looked down at a shrunken boy who was around her age and stared, her eyes widened in shock. <br>\r\n<br>\r\nThe boy looked up at the towering young giantess standing over him. There was a moment of silence between them, during which, they stared at one another. And then without warning, Pan moved forward and snatched the tiny guy up off the floor.<br>\r\n<br>\r\nHolding the mini guy in her fist, Pan brought him up to her face, as they look each other in the eyes.<br>\r\n<br>\r\n\"Who are you ?\" Pan asked, opening her hand and allowing the tiny boy to sit in her palm. \"You must be about...1 inch, I'd say...\" she added, taking the little man's arm and lifting it up before letting go of it. She then gently prodded the shrunken guy's chest and belly with a finger.<br>\r\n<br>\r\n\"I-I dunno, the mini guy said, squirming a little as Pan continues to poke him. \"I just touched some strange watch that i found in a laboratory that I found and it...it shrunk me! Now i can't remember anything beyond that, Hey! What are you doing?!\" <br>\r\n<br>\r\nPan's finger had nudged the little guy's crotch area. So tiny said Pan with curiosity, but then her curious face turned into a mischievous grinned. She purposely started rubbing the shrunken guy's boyhood through his pants. <br>\r\n<br>\r\nWait... Plea...Ah,ah... no, not there the little man moaned as Pan continued to rub her enormous finger against the tiny, now slightly erect penis.  Pan then pulled the front of the mini guy's pants down a little, just enough for a peek at the shrunken man's penis. <br>\r\n<br>\r\nIn Pan's mind, she was thinking of what to do with her new toy, a devious smile stretched across her face that sent shivers down the little man's spine. Lets see, what should i do to you first little guy Pan said with a seductively mischievous sounding tone.   </span></div></div>",
            "created":1474347600,
            "id":2212489,
            "title":"Pan finds an inchling"
        },
        "132212":{
            "author_id":"dbzman315",
            "author_name":"dbzman315",
            "choices":[
                "Pan wants to play Vacuum Chase",
                "Pan wants him to be her foot toy"
            ],
            "content":"<div class=\"\"><div> <span>Pan Smiles down at her now tiny captive, the look in her eyes made the little man cower in fear as the towering young maiden looks down at him in her huge palm.<br>\r\nI'll give you two choices Pan said, One, we can play chase, two you can be my foot toy, which is it.</span></div></div>",
            "created":1474347600,
            "id":2212494,
            "title":"Pan Wants to Toy with The Shrunken Guy"
        },
        "1322121":{
            "author_id":"dbzman315",
            "author_name":"dbzman315",
            "choices":[
                "You Avoid Getting Sucked In the vacuum cleaner",
                "Pan Corners You"
            ],
            "content":"<div class=\"\"><div> <span>With one last mischievous grin, Pan places you on the floor of her carpet. Don't move, she says, i'll be right back, and she leaves out her room door to go to the <br>\r\nlaundry closet. As the shrunken boy looks around the young girls room, he starts to see just how small he truly is when Pan's carpet itself looks like tall waist high pink grass. <br>\r\n<br>\r\nHer bed looked liked it was made for a giantess of her stature compared to his diminutive size. Under her bed he could see sneakers and a few socks that looked liked she could have worn them recently, not an ideal, but probably a good place to hide in case if things start to get bad, the mini guy thought.<br>\r\n<br>\r\nA few minutes later, the inch-sized boy could not only hear, but feel what felt like a giants footsteps. Then Pan's head peeked inside as she smiled down at the little boy on her pink-forested carpet. I'm baaaaack, Pan said in a sing-song voice, as she stepped inside her room, now barefoot, and carrying a vacuum cleaner ( the type with the long hose-handle ) behind her.<br>\r\n<br>\r\nSince you chose to play chase, i thought i'd make it more interesting by adding the vacuum cleaner into the game, said Pan. Here's the rules, i'm going to chase you around with the vacuum cleaner and you have to try to escape from me before i suck you up. If you somehow manage to get past the vacuum, then its my feet that you'll have to avoid Pan said with a devilish grin on her face. <br>\r\n<br>\r\nDon't worry, i heard master roshi got sucked into a vacuum cleaner by Launch before and he survived, and he was really old, and as for if and when i do step on you, my carpet is soft and i'm barefoot, so unless you got a pretty weak body, i'm sure you'll live, maybe. Survive and win or get sucked up or stepped on and lose, it all depends on how fast you can get away from me, Pan said, as she puts her foot on the power button of the vacuum cleaner. <br>\r\n<br>\r\nOn your marks, get set, ( presses the button with her big toe ) GO, Pan said with mischievous enthusiastic. The shrunken boy looked up in fear at the colossal towering maiden, as the vacuum cleaner roars into life, with Pan, grinning devilishly, hovering the end of the gargantuan vacuum cleaner over his tiny body. <br>\r\n<br>\r\nBefore the vacuum could suck him up, the little man took off running as fast as he could, just before Pan lowered the giant vacuum hose onto the spot he was standing at. AHAHAHA, run little guy run, before suck you up! Pan was having the time of her life, chasing the helpless tiny guy around with the vacuum cleaner.<br>\r\n<br>\r\nPan would always keep the vacuum at a certain distance from the shrunken guy so as not to immediately end the game, she would hover it close overhead though, and every now and again, the little man felt himself being lifted off the ground and up into the vacuum cleaner, but then fall back down and kept running as to not be sucked up, since he wasn't too sure if he could survive be vacuumed up or not. <br>\r\n<br>\r\nSoon, the little man found himself in a corner of pan's room, as he looked on in fear, he saw Pan's enormous shadow loom from behind. He looked back and saw the young giantess grinning down at her now trapped toy. Looks like it's the end of the line for you little man, she said, as she place the vacuum close to the ground and began to slowly move it towards the shrunken guy. <br>\r\n<br>\r\nWith no where to run but forward, the one-inch boy charged towards Pan and the vacuum cleaner. Pan was caught off guard by this sudden action and couldn't react in time as the little man dodged to his left and managed to avoid getting sucked up even after Pan moved the vacuum back enough to hover over him, but not enough to suck him up. <br>\r\n<br>\r\nHowever, Pan was not worried in the least, in fact she was smiling even more now. Remember what said if you actually managed to get past the vacuum cleaner little guy, Pan said as she lifted her right foot and hovered it above the shrunken boy. Without another word, Pan stomped her right foot on the pink carpet, narrowly missing the mini guy by just a few centimeters.<br>\r\n<br>\r\nThe crash of Pan's foot had caused the little man to lose balance, as he tumbled forward. Looking up, he saw the gargantuan Pan Looming over him, with one hand on her hip and the other still holding the vacuum cleaner. You're in a pretty good range for me to step on you now, so i'd start running if i were you, Pan said as she lifted her left foot. <br>\r\n<br>\r\nStomp after stomp, Pan relentlessly chased the shrunken guy with her colossal soles looming over his helpless body as she tried to step on him time after time all the while smiling mischievously and coming very close to to actually stomping on him. It wasn't until he reached her bed that Pan decided to go back to using the vacuum cleaner to chase, as the shrunken guy dove under her massive bed.<br>\r\n<br>\r\nPan got on her knees and peered under her bed, eyeing the shrunken boy with her enormous eyes filled with mischief and playfulness. Hmmm, nice job on avoiding my feet little guy, but that doesn't mean i still can't catch you know Pan said, as the shrunken jump in side her left sneaker.<br>\r\n<br>\r\nNow i got him, Pan thought, as she reached for her shoe underneath her bed.</span></div></div>",
            "created":1474520400,
            "id":2213137,
            "title":"This Game SUCKS"
        },
        "1322122":{
            "author_id":"dbzman315",
            "author_name":"dbzman315",
            "choices":[
                "Barefoot",
                "Socked-Foot"
            ],
            "content":"<div class=\"\"><div> <span>How's about we have some fun with my feet, I'll even give you some choices. With that, Pan set the shrunken guy down right in front of her gigantic feet. First, Pan <br>\r\n<br>\r\ntook off both of her shoes, than took off her right purple sock and kept her left sock on. When she was done, she stood back at full height, towering above the small <br>\r\n<br>\r\nnaked guy, while grinning and wiggling giant toes in front of the him. Now then, Pan said with a booming voice from above, which do you prefer, socked-foot or <br>\r\n<br>\r\nbarefoot.  </span></div></div>",
            "created":1486270800,
            "id":2273905,
            "title":"Pan wants him to be her foot toy"
        },
        "13221222":{
            "author_id":"dbzman315",
            "author_name":"dbzman315",
            "choices":[
                "You Lick her foot clean like she told you to",
                "you refuse and are punished"
            ],
            "content":"<div class=\"\"><div> <span>The Shrunken guy pointed to Pan's left Socked-Foot. I see, Said Pan, then in that case, i'll do this, she said as she raised her socked foot above the shrunken guy, <br>\r\n<br>\r\nand then stepped on body, pinning him under her huge foot with his tiny head peeping out in front of her toes. That's right where you belong little man, Pan <br>\r\n<br>\r\nsaid as she was rubbing her giant all over his body. Pretty soon you smell just like my foot, i haven't washed my socks in over week so they must be pretty smelly <br>\r\n<br>\r\nby now. Then Pan noticed something poking her under the ball of her foot. Hey what's this tiny little prong poking me, are you actually erect right now she said and <br>\r\n<br>\r\nshe started rubbing her foot back and forth over the now erect penis. YOU ARE ENJOYING THIS AREN'T YOU, Pan said now giggling, let's see how you like this <br>\r\n<br>\r\nPan said as she took her big toe and was applying pressure on the shrunken guy's penis, as kept pressing on the penis with big toe, she felt it grow even bigger. <br>\r\n<br>\r\nPan was now blushed red in the face as she was teasing his penis with her big toe, you seem to like my toe teasing you huh, maybe i should finish you off right <br>\r\n<br>\r\nnow. Take this, Pan said as she started rubbing her big toe up and down the tiny shaft. The constant stroking of Pan's big toe was too much of a stimulation for the <br>\r\n<br>\r\nshrunken guy, and with his backed now arched, the tiny man cummed over pan's socked toe. EWWWW Pan said, you came on my toy, that's so gross, clean this<br>\r\n<br>\r\nright now Pan said pushing her socked foot in front of his face, You're not allowed to come out from under my foot until you clean up every bit of your mess little man Pan said.</span></div></div>",
            "created":1486270800,
            "id":2273913,
            "title":"Socked-Foot"
        },
        "132212222":{
            "author_id":"supermariobro8",
            "author_name":"Nate",
            "choices":[
                "You lost consciousness ",
                "She continued the fart torture."
            ],
            "content":"<div class=\"\"><div> <span>The shrunken guy refused to lick Pan's foot and she responded by laying the man down and sitting on him. \"As for not doing as I say you will be punished by being my personal seat cushion.\" she said angrily. you tried to squirm but she was to big and too strong. She started rubbing her butt  and bouncing on the poor guy enjoying every second of him being under her smelly ass.<br>\r\n<br>\r\nIt didn't get much better though. The shrunken guy heard her stomach growl then soon after she lifted up one ass-cheek and then released a loud sounding fart on the poor guy and continued to rub her butt on him to make sure he smelled all of it. \"Did you enjoy that little guy, Oh! I think I need to fart some more!\" *PPPPRRRFFFTTTTT* \"Ahh much better hehehe.\"<br>\r\n<br>\r\nAfter that smell torture....</span></div></div>",
            "created":1544763600,
            "id":2589232,
            "title":"Refuse and you are Punished!"
        },
        "13222":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "shoves you in her pussy",
                "shoves you up her ass"
            ],
            "content":"<div class=\"\"><div> <span>she suddenly shoves your whole body in her mouth and sucks you naked form over and over again causing you to get more turned on she lcks your penis and sucks you off youre in pure heaven she continues tou blow you for half an hour when you finally climax and blow your load all over her tounge she licks all your cum off and spits you out onto her hand you lay there panting in her palm feeling more satisfied than ever before she than</span></div></div>",
            "created":1301806800,
            "id":1081223,
            "title":"Give You A Blow Job"
        },
        "132221":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Choice 1.",
                "Choice 2."
            ],
            "content":"<div class=\"\"><div> <span>Pan then says 'ok my turn' u agree since its only fair. Pan then shoves u into her pussy and starts using u as a dildo and as shes doing this u kiss the walls of her pussy to add to her sensation. After about 2hrs straight she climaxes with u inside her u r blown out with her cum, she doesn't notice as shes panting and laying on her back on her bed.<br>\r\n<br>\r\nWhats next?<br>\r\n<br>\r\nChoice 1: u hide before she notices.<br>\r\n<br>\r\nChoice 2: she takes u up to her mouth and licks u clean and......</span></div></div>",
            "created":1576820040,
            "id":2761937,
            "title":"shoves you in her pussy"
        },
        "13223":{
            "choices":[
                "Push you all the way inside, before Videl notices",
                "Show you to Videl"
            ],
            "content":"<div class=\"\"><div> <span>With you clenched in one hand, Pan unbuttoned her jeans with the others, and slowly removed them, exposing her bare legs. Her panties followed suit, and her almost hairless pussy was in plain view. You can't do a thing as she pulls you closer and grinds you against her crotch, body sliding across her vaginal walls, and your head getting pushed into her already swollen clitoris. The rubbing sensation was giving her immense pleasure, which was justified by the loud moaning she was exhibiting.<br>\r\n<br>\r\nHer rubbing was speeding up, evidence that she was coming closer to climaxing, when suddenly, the door of her room creaked open, and Videl poked her head around the door. She must've been wondering what the noise was. With you still buried in her crotch, Pan has to act quickly. She decides to...</span></div></div>",
            "created":1264827600,
            "id":828086,
            "title":"Put you somewhere on her body"
        },
        "132231":{
            "author_id":"pickles1998",
            "author_name":"Pickles123",
            "choices":[
                "Wait",
                "Squirm!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She quickly shoves you in all the way and pulls up her pants. You here the two of them talking then the door close.</span></div></span></div>",
            "created":1364101200,
            "id":1557047,
            "title":"Push you all the way inside, before Videl notices"
        },
        "1322312":{
            "author_id":"jacob152009",
            "author_name":"jake2009",
            "choices":[
                "Videl leaves and Pan tries to get you out.",
                "Pan decides to leave you in until she is satisfied."
            ],
            "content":"<div class=\"\"><div> <span>You start to move around, but your movements are limited do to her tight walls clamping down on you. You hear faint sounds outside that could be pan and videl talking, but you can't make out what's being said.<br>\r\n<br>\r\nPan feels you squirming inside her and starts fidgeting, and rubbing her legs together. You feel yourself being pulled deeper into her. Her walls getting wetter from your squirming around.</span></div></div>",
            "created":1441429200,
            "id":2030206,
            "title":"Squirm!"
        },
        "13223122":{
            "author_id":"jacob152009",
            "author_name":"jake2009",
            "choices":[
                "Climb into pans womb",
                "Pan cums and you slide out "
            ],
            "content":"<div class=\"\"><div> <span>Videl walks out of the room. Pan quickly removes her jeans and panties to finish herself off. She rubs her clit and dives her figure into her hole. You feel her figure tickling your feet and you squirm more from being tickled. Pan pushed you deeper into her enjoying every bit of you inside her. She pushes you right up your her cervix, and rubs on it. </span></div></div>",
            "created":1441429200,
            "id":2030208,
            "title":"Pan decides to leave you in until she is satisf..."
        },
        "132231221":{
            "author_id":"jacob152009",
            "author_name":"jake2009",
            "choices":[
                "She thinks your dead and forgets about you.",
                "She is worried about both your and her well being"
            ],
            "content":"<div class=\"\"><div> <span>The pressure from pans figure is overwhelming. You reach foward until your hands are ducked into her cervix. You pull yourself foward until your body is being crushed by her cervix. You get your upper body threw and are struggling to get the rest of you into her womb. Your starting to get hard from the tight wet walls pushing on you that as you pull yourself threw her cervix you start to cum.<br>\r\n<br>\r\nMeanwhile as you are doing this Pan reaches her own orgasm  and pushes her head into her pillow so not to have her mother hear her again. As she comes down from her orgasm she reaches her fulingure in to pull you out but she can't feel you anywhere.</span></div></div>",
            "created":1441429200,
            "id":2030211,
            "title":"Climb into pans womb"
        },
        "1322312211":{
            "author_id":"jacob152009",
            "author_name":"jake2009",
            "choices":[
                "Cum on the egg and try to impregnate her",
                "Get grossed out and force your way out"
            ],
            "content":"<div class=\"\"><div> <span>You venture tree her womb to find it open enough to walk a few steps into each direction. It is warm and wet inside her and you are enjoying every bit.<br>\r\n<br>\r\nPan on the other hand is worried that she crushed you, and that you are dead. Time passes by and days turn to weeks. It turns out that Pan is around that age that she gets her period and it's approaching that time of month for her.<br>\r\n<br>\r\nYou are laying around inside her womb. Staring to get bored when you see something small coming down from the top of her womb. You guess that she is around that age and that it was her egg.</span></div></div>",
            "created":1441429200,
            "id":2030213,
            "title":"She thinks your dead and forgets about you."
        },
        "13223122111":{
            "author_id":"jacob152009",
            "author_name":"jake2009",
            "choices":[
                "She is having sex with someone",
                "You find another shrunken victim "
            ],
            "content":"<div class=\"\"><div> <span>You get hard thinking about her getting pregnant, and you start to climb up towards the egg. When you get there you start to stroke your staff until you are close to cumming. Finally you release your cum all over her egg. You decide to make your move and get out now so your not crushed by your unborn baby. So you jump down and force yourself threw her cervix to escape.</span></div></div>",
            "created":1441429200,
            "id":2030215,
            "title":"Cum on the egg and try to impregnate her"
        },
        "132231221111":{
            "author_id":"jacob152009",
            "author_name":"jake2009",
            "choices":[
                "Goku",
                "Trunks"
            ],
            "content":"<div class=\"\"><div> <span>You crawl threw her lobe tunnel. You see light at the end of the tunnel. Just as you are about to reach the end you see the light go out. You see something coming toward you. As it closes in you see its a giant penis. It hit you and pushes you back in against her cervix. The penis moves in and out of her love tunnel with great speed. It was just as you thought you were gonna be smashed against her cervix that the giant penis released a tidal wabe of seamen.<br>\r\n<br>\r\nThe giant penis softens and withdraws from pans love tunnel. You are covered in cum and are pushed out of pans lobe tunnel onto a soft surfaface. You look up to see _________ was the owner of the penis that was just onside her.</span></div></div>",
            "created":1441429200,
            "id":2030225,
            "title":"She is having sex with someone"
        },
        "132231221112":{
            "author_id":"gilligfan",
            "author_name":"PrincessKooh",
            "choices":[
                "Another Victim ",
                "Nothing ",
                "Nothing time skip to Pan impregnated by you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You find another shrunken victim or....</span></div></span></div>",
            "created":1441429200,
            "id":2030228,
            "title":"You find another shrunken victim "
        },
        "1322312211123":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Videl again",
                "Bulma"
            ],
            "content":"<div class=\"\"><div> <span>U make it out and Pan starts to feel something inside her so she reaches in and pulls u out and now Pan is shocked to see u alive! 'OMG R U OK? I THOUGHT U WERE DEAD! HOW DID U SURVIVE?!' u explain all but getting her pregnant. At that moment u r asked out of the blue 'Do u wanna return to normal?' Pan asks u. U say 'How?' Pan replies 'I talked to bulma and she said that u may have a rare side effect that will allow u to change ur size to normal and tiny at will' u look at her in confusion. 'How do I know if I have that side effect?' U ask. Pan says just think of being normal or think about the person u truly love with all ur heart and soul not just a crush.' So u say. 'Ok I will try' u try thinking about being normal size and nothing. So u try thinking about ur gf that is currently at ur house, nothing. And as u look up to Pan about to tell her it didn't work she smiles at u saying 'please let this work!' Under her breath. When u heard that all u could think of is being with Pan, And all of a sudden u open ur eyes and ur normal size again. Pan looks at u and says 'how? What did u think of?' U explain all but the true person u thought of instead of telling her u thought of her u said ur current gf. Pan says 'oh..' as if she's disappointed. But suddenly someone knocks at Pan's bedroom door so u suddenly think of being tiny again and hide behind Pan before she could say anything. Pan says 'come in' and in comes....<br>\r\n<br>\r\nWho comes in?</span></div></div>",
            "created":1576821420,
            "id":2761940,
            "title":"Nothing time skip to Pan impregnated by you"
        },
        "132231222":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "wants to play something else",
                "sends you back to her pussy",
                "puts you in another part of her body"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pan would then cum and you were sent flying out of her crotch. After that, Pan grabbed you and cleaned you off of her sex juice before she</span></div></span></div>",
            "created":1534309200,
            "id":2534254,
            "title":"Pan cums and you slide out "
        },
        "132232":{
            "author_id":"gokuman",
            "author_name":"goku",
            "choices":[
                "worship our feet",
                "pleasure us"
            ],
            "content":"<div class=\"\"><div> <span>pan what are you doing videl said surprised she turns around and shows you to her <br>\r\nis that a man  yes oan said and because hes really small we can make him worship us <br>\r\nhhm well ok said videl you couldnt beleive it now you would be a slave to two girls and one was a full grown women she probably would use you in more \"pleasurable\" ways videl walks over and grabs you well pan i think we should have him</span></div></div>",
            "created":1301893200,
            "id":1081784,
            "title":"Show you to Videl"
        },
        "1322321":{
            "author_id":"revani92id",
            "author_name":"revan92",
            "choices":[
                "Pan stops you and put you on Videl's foot",
                "Pan and Videl both play with you using their feet",
                "They force you to rub their feet"
            ],
            "content":"<div class=\"\"><div> <span>\"i think we should have him worship our feet \" Videl says. \" Oh yeees mom !! \" Pan replies. You are too scared by the size of the woman holding you in her hand to fully understand your situation, when she suddenly bend down to place you on the ground right between her feet. You realize how gigantic Videl is compared to her daughter who is already a giant to you !<br>\r\n\"look at how he is scared about you mom i'm almost jealous ! \" Pans adds while removing her shoes and socks. Then Videl started to do the same. You don't want to be a plaything for them so you try to run, when...</span></div></div>",
            "created":1493355600,
            "id":2312270,
            "title":"footplay"
        },
        "1322322":{
            "author_id":"pickles1998",
            "author_name":"Pickles123",
            "choices":[
                "Go along with it",
                "Attempt escape"
            ],
            "content":"<div class=\"\"><div> <span>Videl unbuttons her pants and pulls them down slowly to reveal her black panties. \"you like what you see?\" she asks. She the pulls down her panties and lays down on pan's bed. She puts you head first in the direction of her gaping wet vagina. As she parts her lips she lets out a soft moan and slides you inside of her.</span></div></div>",
            "created":1364101200,
            "id":1557186,
            "title":"pleasure us"
        },
        "13223221":{
            "author_id":"golden1987",
            "author_name":"golden1987",
            "choices":[
                "Mother and daughter time",
                "Mom goddess"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does pan join her mom or it's you and her?</span></div></span></div>",
            "created":1583717280,
            "id":2798605,
            "title":"Go along with it"
        },
        "133":{
            "author_id":"pickles1998",
            "author_name":"Pickles123",
            "choices":[
                "Crawl inside her vagina",
                "Wait"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She grabs you and proceeds to open up her panties and places you inside.<br>\r\n</span></div></span></div>",
            "created":1364101200,
            "id":1557044,
            "title":"She wants to put you somewhere else"
        },
        "1332":{
            "author_id":"jumbi",
            "author_name":"Jumbiman",
            "choices":[
                "You slide into her ass",
                "She takes you out"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to lie inside her panties, waiting for what would happen next</span></div></span></div>",
            "created":1540184400,
            "id":2567350,
            "title":"Wait"
        },
        "13322":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Choice 1.",
                "Choice 2."
            ],
            "content":"<div class=\"\"><div> <span>To ur surprise Pan takes u out almost imiditly after she droped u in. U look up to her and ask 'y?' She replied 'cuz u r shrinking again so we have to w8 till u stop to make sure of ur safty' at that moment u notice that shes telling the truth about u starting to shrink again. After about a minute or so u stop and u notice Pan grabed a magnifying glass with her other hand and held it above u and u realized u r... Pan interupts 'omg u stoped at less than an inch tall! This is gonna be harder than i thought let's tell Bulma and see what the side effects r and how long it will last.' U agree and Pan sets off to find and talk to Bulma.<br>\r\n<br>\r\nChoice 1: Does she make it? <br>\r\nOr <br>\r\nChoice 2: Does Pan get distracted and forget about u and finding Bulma?</span></div></div>",
            "created":1576818360,
            "id":2761931,
            "title":"She takes you out"
        },
        "134":{
            "choices":[
                "She let You in, for the moment",
                "She quickly get you out",
                "She goes to the toilet..... oh oh"
            ],
            "content":"<div class=\"\"><div> <span>\" You know I just think about something\" she said<br>\r\n\" What are you thinking about?\"<br>\r\n\"You, in my Ass, I'am sure you 've got a crush on my ass \" <br>\r\n\"What!!!!\" Hey No!!<br>\r\n<br>\r\nShe suddenly takes you out of her cleavage and put you in the crack of the ass. The Smell is unbearable and you feel a hand trying to push you further in the ass. You eventually faint, struggling against the odor. You think you're going to die in your friend's ass</span></div></div>",
            "created":1226120400,
            "id":605594,
            "title":"....in the butt you go"
        },
        "1341":{
            "author_id":"jumbi",
            "author_name":"Jumbiman",
            "choices":[
                "The basket is being taken to the laundry room",
                "Pan remembered you"
            ],
            "content":"<div class=\"\"><div> <span>Pan decoded to leave you in her ass for the time being.<br>\r\n<br>\r\nThe next time you gain conciousness, you're in a basket. It seems you fell out back into her underwear and she forgot about you, putting you into her dirty laundry basket. The odor was horrible. Suddenly, everything starts moving...</span></div></div>",
            "created":1541998800,
            "id":2577027,
            "title":"She left you in, for the moment"
        },
        "13411":{
            "author_id":"jumbi",
            "author_name":"Jumbiman",
            "choices":[
                "You lose conciousness",
                "You stay awake througj it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The basket you were in gets taken into the laundry room. You, her panties, and the other clothes, fall into the washer. The washer starts, and it seems you're in for a ride...</span></div></span></div>",
            "created":1541998800,
            "id":2577028,
            "title":"The basket is being taken to the laundry room"
        },
        "134111":{
            "author_id":"jumbi",
            "author_name":"Jumbiman",
            "choices":[
                "Socks",
                "Underwear"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You get knocked out as you are spun endlessly in the wash. Where are you when you wake up?</span></div></span></div>",
            "created":1552971600,
            "id":2632455,
            "title":"You lose conciousness"
        },
        "1341111":{
            "author_id":"jumbi",
            "author_name":"Jumbiman",
            "choices":[
                "Went home",
                "Went for a run"
            ],
            "content":"<div class=\"\"><div> <span>As you regain conciousness, you feel soft fabric around you. There's no light shining anywhere. Then, you are blinded from the hole on the top. You were in Pan's sock! She puts the sock on with you in it, ready for the day. Throughout the day, it gets hot and sweaty inside. Pan clearly didn't know you were in her sock. She then</span></div></div>",
            "created":1553049360,
            "id":2632457,
            "title":"Socks"
        },
        "1341112":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "pussy",
                "ass"
            ],
            "content":"<div class=\"\"><div> <span>When you woke up, you looked to see fabric all around you. From the looks of it, you’re right inside Pan’s underwear. You then see her legs coming through the holes and you were pulled straight up with her panties. You didn’t have time to react as you went straight into her</span></div></div>",
            "created":1554841920,
            "id":2642662,
            "title":"Underwear"
        },
        "13411121":{
            "author_id":"autobot20",
            "author_name":"Josimus Prime",
            "choices":[
                "She does",
                "She doesn’t"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You went up and up until you made contact with Pan’s vagina. You still feel dizzy as Pan fixes her panties before she puts on her jeans. After that, you felt a little better as you begin to squirm hoping that Pan would feel you down here.</span></div></span></div>",
            "created":1554843840,
            "id":2642672,
            "title":"pussy"
        },
        "134111212":{
            "author_id":"worker1398",
            "author_name":"Clear Diamond",
            "choices":[
                "Continue at school",
                "Continue at home/outside"
            ],
            "content":"<div class=\"\"><div> <span>Pan is completely unaware to u. As u try to struggle u notice that ur whole body and arms and legs r all embedded into the fabric of her panties (in other words u r now pretty much fused and r now part of Pan's panties).<br>\r\n<br>\r\nWhere does the story go from here?</span></div></div>",
            "created":1576822380,
            "id":2761945,
            "title":"She doesn’t"
        },
        "13411122":{
            "author_id":"halothecool",
            "author_name":"Halothecool",
            "choices":[
                "She knows your there ",
                "She dosnt know Shes forgotten about you ",
                "Other "
            ],
            "content":"<div class=\"\"><div> <span>As she finish putting on the panties you made contact with her ass it seems she just took a shower snice there was no smell at least for the moment and you struggle to get free you feel your arms and legs starting to get tangle into pieces of the fabric soon your in case in darkness as pan puts on her jeans and starts heading out<br>\r\n<br>\r\nYou feel her cheeks rub against you as she walks and today is a hot day so it's only a matter of time before things gets worse <br>\r\n<br>\r\nQuestion is does she know your there <br>\r\nOr is unaware of you </span></div></div>",
            "created":1563543000,
            "id":2689204,
            "title":"ass"
        },
        "14":{
            "author_id":"jsparrow3",
            "author_name":"Sparrow",
            "choices":[
                "Dragonballs",
                "Bulm"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What makes her shrink</span></div></span></div>",
            "created":1397624400,
            "id":1780520,
            "title":"Pan (Shrinking)"
        },
        "141":{
            "author_id":"jsparrow3",
            "author_name":"Sparrow",
            "choices":[
                "Have the power to shrink and grow back to normal size",
                "to slowly lose  weight until a 3 year old boy could lift me up with one arm ",
                "Magic Leather collars and and pendant specifically instructed"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pan gathered the Dragonballs.<br>\r\n\"Rise Shenron.\" Pan shouted.<br>\r\nDragon came and said.\" What is your wish?<br>\r\n<br>\r\n\"I wish to.....</span></div></span></div>",
            "created":1397624400,
            "id":1780534,
            "title":"Dragonballs"
        },
        "1411":{
            "author_id":"jsparrow3",
            "author_name":"Sparrow",
            "choices":[
                "Pan goes to school next day and tries her power",
                "Pan goes to a toy store",
                "Pan goes to a pet store"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Your wish has been granted. Just wish what size you wish to be\" Shenron instructed before the dragonballs scattered.<br>\r\n<br>\r\n</span></div></span></div>",
            "created":1397624400,
            "id":1780543,
            "title":"Have the power to shrink and grow back to norma..."
        },
        "14111":{
            "author_id":"jsparrow3",
            "author_name":"Sparrow",
            "choices":[
                "go see the shy intelligent boy who collect dolls",
                "locker room"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Pan went to school happily. She was eager to try her new power. <br>\r\nDuring lunch time, Pan decided to </span></div></span></div>",
            "created":1397624400,
            "id":1780548,
            "title":"Pan goes to school next day and tries her power"
        },
        "141111":{
            "author_id":"jsparrow3",
            "author_name":"Sparrow",
            "choices":[
                "Rito's home",
                "Pan shrinks to sneak into his back pack as a surprise"
            ],
            "content":"<div class=\"\"><div> <span>Pan wanted to go see Rito. Pan had played with him a lot in kindergarten to 2 grade. They both played with dolls back then.  They were best friends until his family moved away. She was devastated to lose her best friend. He showed at her school this year. Pan knew it was Rito because he had same necklace that she had him promise to wear. The necklace had mini replica of 4 star ball since it was kind of symbol of her family.<br>\r\n Rito had become gynophobic, but was little bit more comfortable to talk with Pan at first when he realized it was her. Over time he became nervous to come in physical contact, he wasn't exactly scared of Pan unlike the boys at his school. Sometimes he would even stutter when she comes too close to him. He even fainted  when his face got to close face. <br>\r\nRito remembered that Pan was much stronger than most people after seeing her lift a car in order to get a ball which freaked both the kids and teachers out. Rito first thought that she some sort super heroine.  Rito knew she won't hurt him and was happy to see her again. Rito studied a lot and played with female actions figures as way to cope with losing his best friend. He felt more comfortable to talk with female dolls than regular sized girls. Rito had been bullied by girls in the  schools he went to.  Rito  became too shy around Pan and there were few instances that he had ran away from her.<br>\r\nHe knew that he developed a crush on Pan, but he wished could build confidence to talk to regular sized girls. He practiced with dolls, but they don't interact. <br>\r\n<br>\r\nPan followed him one day to park at night to an isolated area. He was crying. Pan heard him say that he loves her to what looks like a miniature replica of Pan, then he threw the doll and this is hopeless and that he won’t be able talk to regular sized girls of his age.  Pan liked Rito, he was very good with animals and helped out at the school garden. He was a better chef than their cooking teacher even though he had to cook away from the girls and the teacher was aware of his issue. Pan had actually beaten up the boys that pick on him, but she does outside of school of property.  Pan realized that she might gradually build a relationship as well build his confidence up if she somehow became doll-sized and gradually grow in order to help cure his gynophobia.  <br>\r\n<br>\r\n\"Rito\" Pan hugged him from behind. This caused to lose his balance and fall to ground. <br>\r\nRito quickly crawled and leaning against the wall. \"Pa pa Pan, don't do that.:' Rito was panting with he face flushed.<br>\r\n\"Nearly gave me heart attack.' Rito said. Pan giggled.<br>\r\n<br>\r\n\"I'll be studying at your home today.\" Pan smiled<br>\r\n<br>\r\n\"What?\" Rito had his mouth wide open. <br>\r\n<br>\r\n\"I asked your mother if I could come over and she happily said. She agreed to keep it a secret from you and said 'make my son a man' with her fist held high.\" Pan said.<br>\r\nThe news caused him to faint.  </span></div></div>",
            "created":1397624400,
            "id":1780694,
            "title":"go see the shy intelligent boy who collect dolls"
        },
        "1411111":{
            "author_id":"jsparrow3",
            "author_name":"Sparrow",
            "choices":[
                "They have dinner ",
                "Rito goes to his room "
            ],
            "content":"<div class=\"\"><div> <span>Rito woke up in his room. \"What happened?\" Rito rubbed the back of his head. He couldn't recall what happened earlier. He simply shrugged left his room to smell of  food cooking. 'Mom must be making dinner. <br>\r\n\"Mom, what's for Dinner?\" Rito yawned and picked up book that he had been reading on his spare time.<br>\r\n\" Umm Your mother left for her model photography job and she will be gone for 3 weeks.\" Pan said with a school swimsuit on. <br>\r\n\"Pan. What are you doing here?\" He said walked over backwards falling on the couch. <br>\r\n\"Don't you remember?\"  Pan giggled. <br>\r\n\"Oh.\" Rito suddenly remembered.<br>\r\n<br>\r\nRito was trying stay calm and decided to ask question.<br>\r\n\"Why are you wearing a school swimsuit.\" <br>\r\n\"Your mother made had me cosplay in variety of outfits: maid, neko, bunny, demon, school swimsuit, and kindergarten. She even had me wear a wedding dress. I don't even know how I ended being her model, but it was fun and your mother left some photo on the table behind you along with a letter. Ironically, your mother apparently had taken photos of my mother when we were younger\" Pan said. \"Your mother had taken her clothes, yours, and mine when she told me stay in the photo room with school swimsuit on for 15 minutes.\" Rito sweat dropped at what her mother did. He was okey with his mother. His mother has been known to be eccentric and to be unexpected. <br>\r\nRito read the letter. The last part said \"I want you and Pan to make grandbabies soon while I'm still young and beautiful.\" Mom had sketched a chibi version of herself with two thumbs up saying \"Oh yeah\" with some fireworks in the background. His mother gave him a whole lot of money to spend that no parent with a middle income should give. His mother wants him to spend some money for Pan and if doesn't spend time with her, then he will never be permitted to have another female action figure. His mother can be scary at times and she has strange way to make people happy around her. His mother sometimes act more like a younger sister rather than an adult. Rito believes that this threat is for real. <br>\r\n</span></div></div>",
            "created":1397624400,
            "id":1780720,
            "title":"Rito's home"
        },
        "14111111":{
            "author_id":"jsparrow3",
            "author_name":"Sparrow",
            "choices":[
                "Pan asks if  he wants to play with dolls",
                "Pan confesses her love and wishes to help him. "
            ],
            "content":"<div class=\"\"><div> <span>\"Oh no my lasagna\" Pan cried. Pan apparently raised temperature of the oven too high. <br>\r\n\"My dish is ruined.\" Pan end up crying.  Pan's lasagna was burnt. <br>\r\nPan tend to try rush in cooking and tend to make mistakes. <br>\r\nPan is still my friend. <br>\r\n\"Pan, you tried best. Your one of the strongest girls that I have ever met.\" Rito looked at the opposite direction when he said with a blush on his face.<br>\r\n\"You can take most of my mother's treasured stash of ice cream.  We can have pizza tonight?\" His mother had a large stash. She can eat dozen of ice cream bars and still won't get sick. Plus this is also serves as payback to his mother for this situation. He is happy spend he is alone with Pan, but was still nervous. Pan looked really cut with a school swimsuit on. <br>\r\n\"Okey.\" Pan smiled. <br>\r\n\"I'll make a dress using my curtains.\" He said.<br>\r\n\"Don't you like seeing me in swimsuit.\" Pan  leaned down pulling the straps as a way to tease. <br>\r\nHe couldn't help, but blush. <br>\r\n\"I.......i....i   I....I\"ll call for delivery.\" Rito quickly fled to avoid situation. <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1397710800,
            "id":1780830,
            "title":"They have dinner "
        },
        "141111112":{
            "author_id":"jsparrow3",
            "author_name":"Sparrow",
            "choices":[
                "Rito wakes up with doll sized Pan in front of him. ",
                "Wakes on Pans lap"
            ],
            "content":"<div class=\"\"><div> <span>\"Thank you for dress. I'm sorry about your curtains\" Pan said. <br>\r\n\"I can't let leave with that on.\" Not looking directly. <br>\r\n<br>\r\n\"Will you please look at me.\" Pan said.<br>\r\nRito looked at her nervously.<br>\r\n\"I love you and I wish to help cure you of your phobia and confidence issue.\" Pan said with a blush on her face and eyes gazing away from his. <br>\r\n<br>\r\nHIs childhood friend had just confessed to him. Rito suddenly felt light-headed and fainted. </span></div></div>",
            "created":1397710800,
            "id":1780993,
            "title":"Pan confesses her love and wishes to help him. "
        },
        "1411111121":{
            "author_id":"jsparrow3",
            "author_name":"Sparrow",
            "choices":[
                "Pan tells him her plan ",
                "She wants to be his plaything for tonight"
            ],
            "content":"<div class=\"\"><div> <span>Cold water was splashed on his face and woke up with doll sized Pan floating with a cup and she was wearing a tissue. <br>\r\n\"Pan,\" he jumped up out his bed and his head came contact with ceiling.. <br>\r\n\"Rito, Are you okay\" Pan flew to him to check his head.<br>\r\n\"My head hurts.\" Rito said.    <br>\r\n\"I'll go get you some ice for your head.\" Pan flew out his room to grab some ice from the kitchen.<br>\r\n\"What is going on? Why is she the size of a doll\" He mumbled to himself. He was confused on what is going on. His face was really red when he remembered Pan's confession. <br>\r\nPan placed a bag ice on his head from behind. <br>\r\n\"Is this a dream or am I see things?\" He asked. <br>\r\n\"Nope, this is for real.\"  Pan smiling and sat at other side of his bed to give him space. <br>\r\n\"Why are you so small?\" He shouted.<br>\r\n\"I shrunk myself\" Pan shouted. <br>\r\n\"Huh.'</span></div></div>",
            "created":1397710800,
            "id":1781006,
            "title":"Rito wakes up with doll sized Pan in front of h..."
        },
        "14111111211":{
            "author_id":"jsparrow3",
            "author_name":"Sparrow",
            "choices":[
                "Next day",
                "Bra spends the night as well"
            ],
            "content":"<div class=\"\"><div> <span>\"I wish to cure you of gynophobia and confidence with girls around and we're going to do it in three weeks. \" Pan said<br>\r\n\"Uum, okey.\" He still freaked of what is going on.<br>\r\n\"I gained the ability to shrink myself and grow back to normal. I won't tell you how I gained this ability\" Pan said. <br>\r\nPan decided to shrink herself as a demonstration. The napkin became too big for her wear and she fgrew back to doll size. <br>\r\n\"I plan to make you get used to girls from small to big.\" Pan said. <br>\r\n\"Wha Why are you doing this?' Rito asked.<br>\r\n\"Because I care about you and you shouldn't have to be afraid to interact with girls.\" Pan said with a determined look on her face. <br>\r\nRito thought about of what she said for few minutes. Pan's might plan is highly unusual like his mother, but this might  work. He is still nervous around her, but he felt a little bit more comfortable talking to her. He does want to spend more time with Pan and confess his feeling without having a nervous breakdown, but at  her normal height. <br>\r\n<br>\r\n\"Alright, I'll go with your plan.\" Rito looked down. He knew he had to build confidence around girls.<br>\r\n\"Great. Operation \"Small\" officially begins\" Pan leaped into air.<br>\r\nRito felt embarrassed.  Pan flew to restroom and grew back to normal. <br>\r\n\"Oh, I forgot to mention this, but your mother is well aware of this plan.\" Pan said. <br>\r\n\"Well that explains what was written on letter that she left,\" he thought.<br>\r\n\"My father is gone on a business trip for 3 weeks and mother is fine if I spend the night here. She promised that she won't tell papa.\" Pan said. <br>\r\n\"Pan's father is really nice, but he is insanely strong and could crush his skull using his bare hands if he found about this. Father's are supposed to protect their daughters.\" He thought nervously. <br>\r\nThey heard door bell ring.<br>\r\n\"That must be Bra with the clothes for me.\"<br>\r\n\"Huh, you mean Bra Briefs.\"  He remembered playing with her as well at park alongside Pan. She has very beautiful hair, but her father is scariest man that he had ever met on earth. He remember that he accidently wet himself when he first glimpsed at the man's eyes. Mom recognized him from the cell games. Mom knew that Hercule wasn't the one who defeated Cell. Mom is actually a master of martial artist and she could kick butt when she wants to. His grandfather owned a dojo that only certain students to enter and had actually trained Hercule himself. Her father knew he was a bit of liar, but knew he had a good heart.Mom said that she had kicked his butt a lot. My mother may appear harmless, but she is very strong. His grandfather had trained him very hard, especially during the summer when they had to survive in wild with little supplies. His grandfather may be insane since they had to run and fight hungry wolves as well as other animals, but he is kind and understandable man.  Martial arts couldn't help with his confidence with girls though.  It is funny though how his mother managed to get him to model with his wife once. <br>\r\nPan opened the door, Rito decided to keep his distance. <br>\r\n<br>\r\n\"Pan here's some spare clothes that should fit,\" Bra said and handed some bags of clothes.<br>\r\n\"You look cute with that swimsuit on.\" Bra took a picture of Pan.<br>\r\n\"Wow, Rito is that you. You're quite handsome.\" Bra said. He is getting nervous with two girl in his home.<br>\r\n\"Hey hey hey Bra,\" he stuttered.<br>\r\n\"You right Pan, he seriously needs help.\" Bra said. <br>\r\n\"Luckily you'll have two cute girls to help you.\" Bra winked at him.<br>\r\n\"You're in this as well.\" Rito pointed his fidgeting finger at Bra.<br>\r\nBra nodded. <br>\r\nPan got dressed  and said. \"Let's get started on our studies.\" Pan said. <br>\r\n</span></div></div>",
            "created":1397710800,
            "id":1781048,
            "title":"Pan tells him her plan "
        },
        "141111112112":{
            "choices":[
                "He reluctantly agrees",
                "He refuses"
            ],
            "content":"<div class=\"\"><div> <span>For the first few hours of the night, the three kids worked in their homework. Of course, Rito was uncomfortable the whole time, especially since both Pan and Bra were there.  I forgot it were only Pan, he might have been a bit more comfortable, but Bra being there was just torture for the boy. Once they had finally finished their work, Rito simply headed to bed, shyly saying goodnight to Pan and Bra, who decided it would be best to give him some time to calm down. <br>\r\n<br>\r\nA few hours later, Pan finally decided to go check on Rito. Shrinking down and quietly flying to Rito’s room, Pan peaked through the small crack of his door. Rito was laying in his bed, twisting and  turning. He was obviously unsettled. As Pan watched the boy, she noticed he was holding something in his arms. She pulled the door open a little and swiftly flew over to get a better view. To her shock, he was was holding a doll she recognized. It was one of the dolls she had got him when they were younger. She left the room and returned to Bra, pondering something.<br>\r\n<br>\r\nThe next day was mostly uneventful. As usual, Rito was his shy self, although he wasn’t as sheepish as he usually was around Pan. Throughout the day, Pan worked on something for later. At the end of the school day, Pan and Rito walked to Rito’s house together. He seemed more relaxed, at least walking a foot away from Pan, but he obviously was still very fearful of her.<br>\r\n<br>\r\nAs the two entered the house, Pan decided to put her plan into motion. Heading into the bathroom for a few minutes, she emerged, shrunken down to the size of a doll. She was wearing similar clothes to the doll she saw last night. She flew down the hall and enter Rito’s room. As he looked over at her, he almost fainted again, only being caught at the last second by Pan.<br>\r\n<br>\r\n“Ok, you seriously need to stop doing that. This much fainting cannot be good for someone.”<br>\r\n“P-p-p-p-p-p Pan? W-w why are you small and...wearing those?”<br>\r\n“Remember what I told you yesterday?”<br>\r\n“Well...Yeah, but...why are you wearing that clothing?”<br>\r\n“I remember giving you a doll who wore a dress just like this. Don’t you remember?” She winked slightly.<br>\r\n“You saw me last night, didn’t you?”<br>\r\n“Yeah. I know I shouldn’t have, but hey, maybe this might help. I do like like the doll, right?”<br>\r\n“Yeah...”<br>\r\n“Good. Look, just pretend I’m one of your dolls. Can you trust me?”<br>\r\n“N...n...ok, I’ll do it.”<br>\r\n<br>\r\nAs you would think, it was very much awkward at first. Every time Rito tried talking to Pan, he got very flustered, not quite adjusted to the whole thing yet. After a while though, he did start to warm up to her a bit. As they worked on some school work, it was almost if she really was one of his dolls. He was actually talking to her, not even stuttering. <br>\r\n<br>\r\nMuch later, it had gotten dark out and both of them were ready to go to bed. However, before Rito was even in bed, he noticed a certain doll was missing. As he frantically looked for it, Pan flew in. Rito looked over at her, wondering what she was doing.<br>\r\n<br>\r\n“Rito, I have a bit of an idea: since you like that doll so much and I look just like that doll...maybe we could...sleep together?” <br>\r\n“P-p-p-p-p Pan...are you s-serious?”<br>\r\n“Well yeah, I mean I know you like that doll so much and I think me just being here might help you. It’s up to you though.</span></div></div>",
            "created":1517115600,
            "id":2446125,
            "title":"Bra spends the night as well"
        },
        "1412":{
            "author_id":"jsparrow3",
            "author_name":"Sparrow",
            "choices":[
                "Yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yes or no?</span></div></span></div>",
            "created":1409547600,
            "id":1850221,
            "title":"to slowly lose  weight until a 3 year old boy c..."
        },
        "14122":{
            "author_id":"jsparrow3",
            "author_name":"Sparrow",
            "choices":[
                " magic ring that allows one to shrink people and grow them back to normal ",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>something else</span></div></span></div>",
            "created":1512795600,
            "id":2426087,
            "title":"no"
        },
        "1413":{
            "author_id":"tzertz",
            "author_name":"why",
            "choices":[
                "shrink self",
                "shrink others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so isnt this GIANTESS Pan so shrinking others option</span></div></span></div>",
            "created":1563744240,
            "id":2690329,
            "title":"Magic Leather collars and and pendant specifica..."
        },
        "142":{
            "author_id":"jsparrow3",
            "author_name":"Sparrow",
            "choices":[
                "yes",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does Bulma's invention shrink her?</span></div></span></div>",
            "created":1397624400,
            "id":1780521,
            "title":"Bulma Invention"
        },
        "1422":{
            "author_id":"dean3",
            "author_name":"Sean",
            "choices":[
                "Pan shrinks someone with her ki",
                "Pan shrinks with capsule corp item",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe point of view for pan as she shrinks someone?</span></div></span></div>",
            "created":1534136400,
            "id":2532735,
            "title":"something else"
        }
    },
    "info":{
        "author_id":"jpelchat",
        "author_name":"Jpelchat",
        "brief_description":"Son Pan of Dragonball Gt has turned into a giantess! You decide what she does.",
        "created":1123995900,
        "description":"<td align=\"left\" class=\"norm\">This is my second interactive and there will be more to come. I don't mind what you put in this story (I'm not really a foot person, but... thats just me) so put whatever you want in this story.</td>",
        "id":1001178,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1603918980,
        "modified":1603918980,
        "pretty_title":"Giantess Pan"
    }
}