{
    "chapters":{
        "1":{
            "choices":[
                "Whatever Happened to Susan Salt?",
                "The Plague of the Pestering Prince",
                "The Trail at the Tickleversity",
                "The 20% Naked Dilemma",
                "The Other Ticklish Tales Of Summer Salt"
            ],
            "content":"<div class=\"\"><div> <span>(~Where did the old poet live? I asked around, nobody knooows!~<br>\r\n<br>\r\nSo, its been a good while since this was first posted, yet there isnt even an opening page yet. This is not my story nor are any of the other Summer Salt series, I just thought that finnaly getting this running would be a good idea since I believe whade is gone and people post alotta things that are kinda iffy for a bunch of minors to be doing in the other tales.<br>\r\n<br>\r\nAll charecters are of legal age, all but Susan(Mouse) are over the age of 20. Yes, this means sexual encounters are allowed, but try and use them to supplement the tickling and follow the consent guidlines Whade set up in a story he posted on his bio. Don't forget the primary focus of this story is tickling, not vore, expansion, diapers, or any of the other popular fetishes on this website, theres already more then enough of those.<br>\r\n<br>\r\nIf you see this whade, feel free to do whatever, I know your a better writer.)<br>\r\n<br>\r\n<b>Whatever Happened to Susan Salt?</b>:<br>\r\nThree years ago Mouse had left for college, one year ago she had stopped calling. Yesterday she called, leaveing an ominous message.<br>\r\n<br>\r\nTime to do what Summer Salt did best.<br>\r\n<br>\r\n<b>The Plague of the Pestering Prince</b>:<br>\r\nThe clown had been a threat upon Summers town and career ever since that fateful summer, and now its time to banish him.<br>\r\n<br>\r\n<b>The Trail at the Tickleversity</b>:<br>\r\nA university whose one claim to fame is its odd decision to run group tickling classes. Summer &amp; gang have been sent in to find out its many secrets.<br>\r\n<br>\r\n<b>The 20% Naked Dilemma</b>:<br>\r\nAn anonymous hint is given to Summer, Rolling Heights sister city, Stopped Lows, has had a oddly rapid growth in its nudist population which threatens to expand into other cities.<br>\r\n<br>\r\n<b>The Other Ticklish Tales Of Summer Salt</b><br>\r\nWhat else lies in wait for our ticklish heroine? You decide!</span></div></div>",
            "created":1525496400,
            "id":2488876,
            "title":"Summer back in action!"
        },
        "15":{
            "choices":[
                "Give me the tickles.",
                "Additional content."
            ],
            "content":"<div class=\"\"><div> <span>We all know these stories are written by and for people with tickle fetishes, so if your reading this theres a good chance you're fine with sex. However attempting to write good erotica can often lead to lower quality story telling.<br>\r\n<br>\r\nSo<br>\r\n<br>\r\nDo you want non tickling or are you intrested in the narrower field of tickling?</span></div></div>",
            "created":1525496400,
            "id":2488908,
            "title":"A fork in the woods"
        },
        "151":{
            "choices":[
                "Author Choice 1",
                "Author Choice 2",
                "Author Choice 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The author may choose the content for each branch, please do not go into too many sub options or else this story may loose cohesion.</span></div></span></div>",
            "created":1525496400,
            "id":2488912,
            "title":"Give me the tickles."
        },
        "152":{
            "choices":[
                "Author Choice 1",
                "Author Choice 2",
                "Author Choice 3"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><a rel=\"nofollow\" href=\"https://www.writing.com/main/books/item_id/2094132-A-Guide-to-Summer-Salt-Stories\" target=\"_blank\">https://www.writing.com/main/books/item_...</a></span></div></span></div>",
            "created":1525496400,
            "id":2488917,
            "title":"Additional content."
        },
        "1521":{
            "choices":[
                "Tickle game.",
                "Tickle fight.",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The bi-monthly salt fun-night has arrived! Summer Salt has spent the last few hours setting up the house for a...</span></div></span></div>",
            "created":1525922820,
            "id":2491002,
            "title":"A normal tuesday night for Shia LaBeouf"
        },
        "15211":{
            "choices":[
                "Flustered.",
                "Defend"
            ],
            "content":"<div class=\"\"><div> <span>Summer spent a while thinking about new games to play aince the last group meeting and has decided on one of two games.<br>\r\n<br>\r\n<b>Flustered</b>:<br>\r\nA four sided die is rolled to decide who goes. The chosen person strips down to under garments and tied to a chair, they then have to read a chapter from a book that will be displayed on the tv while everyone tickles them. Slowest to read will be tied on Summer's bed for ten minutes while everyone tickles them, and will also go first on the next game.<br>\r\n<br>\r\n<b>Defend</b>:<br>\r\n<br>\r\nTwo people will have to guard an object while the other two have to get it to the front door. If 10 minutes go by without the attackers winning, they will be tied and tickled, vise versa for defenders.</span></div></div>",
            "created":1525923480,
            "id":2491006,
            "title":"Tickle game."
        },
        "152112":{
            "choices":[
                "Summer",
                "Mouse"
            ],
            "content":"<div class=\"\"><div> <span>Mouse arrives early and helps Summer set up the various items and equipment that would be used later into the night, as well as the ropes for Summers bed.<br>\r\n<br>\r\nEventually Chris and Jamie show up together, over the last few years they hade grown closer and eventually made their realationship official.<br>\r\n<br>\r\nAfter a while of talking and catching up the games began, with summer as the host throwing the first die.</span></div></div>",
            "created":1525923840,
            "id":2491008,
            "title":"Defend"
        },
        "1521121":{
            "choices":[
                "Skip to the end.",
                "Mouse."
            ],
            "content":"<div class=\"\"><div> <span>The die landed squarely on Summer, who's eyes dropped at the sight. For the most part she had recovered from her mild tickle phobia, but even now she much rather be giveing then takeing.<br>\r\n<br>\r\nNever the less fairs fair, and Summer took off her shirt and pants and sat down in the folding chair she had set up infront of the tv, letting Chris' talented fingers work their magic on the silk rope. Each ankle was secured to a chairleg, and her hands were tied behind the back of her chair, she could struggle, but not get anything off.<br>\r\n<br>\r\nThe other three went over to the laptop she had hooked into the TV and debated on what she should read before the first segment of \"the worlds longest joke\" was decided on. The TV flicked on and Summer decided to start reading before they even reached her.<br>\r\n<br>\r\n\"So, there's a man crawling through the desert.\" Summer began, \"He'd decided to try his SUV in a little bit of cross-country travel, had great fun zooming over the badlands and through the sand,\" her friends had almost made it back to her from the TV, \"got lost, hit a big rock, and then he couldn't get it started again.\"<br>\r\n<br>\r\nMouse positioned herself at Summer's toes, slipping her hands under Summer's feet and waiting for the other two to be ready. Chris and Jamie got on either side of Summer and hoverd their hands over her ribs. \"There were no cell phone towers anywhere near, so his cell phone was useless.\" Summer managed to squeeze in before the tickling started.<br>\r\n<br>\r\nMouse spidered her fingers along Summer's feet as Jamie and Chris digged their fingers into her sides, breaking her concentration into a howl of giggles and shuddering. Summer tried to lean forwards but her tied hands stopped her from escaping the hands at her sides.<br>\r\n<br>\r\n\"He-he-heh had no family-he, his parents had-ah died a few years before in an auto accident-uh, and his few friends had no idea he was out here-ere-ere.\" Summer tried to focus on the words on screen to blot out the spasms of her sides on feet. \"He stayed with the car for a day or so, but his one bottle of water ran out and he was getting thirsty. He thought maybe he knew the direction back, now that he'd paid attention to the sun and thought he'd figured out which way was north, so he decided to start walking. \"<br>\r\n<br>\r\nChris brought one hand away from her side and began tickling Summers stomach, quickly followed by Jamie. This drove Summer into the chair and she tried to shift away from the hands coming from all directions but behind. \"He figured he only had to go about 30 miles or so and he'd be back to the small town he'd gotten gas in last.\" She managed to get out the final words in between breaths.<br>\r\n<br>\r\nHer friends untied her as her round ended, her final time was 3:24. She took a breather on the couch as mouse was tied up.</span></div></div>",
            "created":1525925580,
            "id":2491016,
            "title":"Summer"
        },
        "1523":{
            "choices":[
                "A chamber covering most of the room",
                "A set of brief cases and boxes"
            ],
            "content":"<div class=\"\"><div> <span>Summer Salt had been on the trail about reports of the recent bankruptcy of a moderatly crazed inventor who had managed to complete his final project with the last of his funds. What that final project was, was of little importance, all Summer knew was that he had stored it away before joining the general workforce. After some digging Summer had found out which storage center the inventer had used to keep the machine as well as when the storage garage was going to be auctioned off.<br>\r\n<br>\r\nAfter some haggling she had won the lot and now 2 days later all the paperwork had been signed and the time to finally see what she had gotten had come.<br>\r\n<br>\r\nShe drove out to the lot with a small camera and a voice logger. She opened the garage door and looked inside but the early morning sky didn't illuminate whatever was inside, so she steped in and closed the garage behind her before turning on the lights.<br>\r\n<br>\r\nOn the other side of the room was...</span></div></div>",
            "created":1525569360,
            "id":2488970,
            "title":"The strange machine."
        },
        "15231":{
            "choices":[
                "Just mouse for now.",
                "Whole crew."
            ],
            "content":"<div class=\"\"><div> <span>Covering all but three or four feet of the room was some sort of chamber. It had a large grey wall and there was a metal door on the far left. Summer photographed the outside of the chamber before heading through the door.<br>\r\n<br>\r\nIt lead into a tight hallway that extended 6 or 7 feet before making a 90* right turn and going for the 8 or so feet that made up the width of the storage room.<br>\r\n<br>\r\nA slideing door with a nameplate which said 'CONTROL'  was directly to the right when you entered the room, she had planned on leaving this room for last but the three doors which were spaced out along the far side of the corridor were all locked.<br>\r\n<br>\r\nInside the control room were four monitors which were off, along with a mouse and keybord, a cabinent, and a mechanics kit. Looking in the drawer she found a key and a overpacked envelope.<br>\r\n<br>\r\nShe opened the envelope and found several folded pieces of paper which she laid out on the desk and began reading.<br>\r\n<br>\r\n&lt;hr&gt;<br>\r\nToo whom it may concern,<br>\r\n<br>\r\nWelcome to the room 1.1v! If you are reading this note then I must assume that you have through some means gained access to the room and as such you are now the new owner!<br>\r\n<br>\r\nI reccomend activating the camera monitors (2,3, and 4) before reading any further, it is much easier to explain through a personal viewing what this facility is then anything else.<br>\r\n&lt;hr&gt;<br>\r\nSummer activated the second monitor first and saw a while tiled room, kind of like a showering room, in the middle of which was a wooden horse. Where ones ankles would rest there were iron clamps, and a bit higher then where ones head was were another set, likely for hands.<br>\r\n<br>\r\nThe third monitor showed a moderatly larger room which had the same style of walling. In the center was a table shaped like a human silouette covered with various straps. Along the walls of the room were robotic arms with various tools, most of which she recognized as the tools she and her friends used in their tickle games.<br>\r\n<br>\r\nThe fourth camera showed a smaller room which had a comfy looking chair that was raised higher then most chairs and which had an equal number of straps as the second rooms table had.<br>\r\n<br>\r\nWhere had the inventor even gotten this stuff? Yet another question for her to find the answer to.<br>\r\n<br>\r\nThe next paper she read explained that the function of the first monitor was to control various operations of the three rooms, which would be explained in each article.<br>\r\n<br>\r\nNext she read the article on the first room<br>\r\n&lt;hr&gt;<br>\r\nHidden Operations:<br>\r\nThis room was a test in hidden panels and blending in various objects into the walls of the room and the wooden horse. The horse and clamps are also a part of this in that they are each set along two sets of discrete rails, alowing two dimensional movement of limbs and up/down forward/backward movement of the horse. <br>\r\n<br>\r\nItems: context based, check control w/ subject inplace and ensure liquid levels are topped off if possible.<br>\r\n<br>\r\nTicklish: 0-6<br>\r\nStimulation: 3-8<br>\r\n<br>\r\nCLOTHING NOTES: undergarments can and should be worn, disposible sets can be found by opening the cabinet at the base of the horse, there are also towels.<br>\r\n&lt;hr&gt;<br>\r\n<br>\r\nShe would have to see about finding someone to test this later, no doubt any of her friends would be willing to be her test subject<br>\r\n<br>\r\n&lt;hr&gt;<br>\r\nTickler:<br>\r\nThis room has only one objective, to tickle whoever is locked into the restraints. Straps auto-lock around a subject via electro-variable power magnents (ROOM NOT FOR USE IF SUBJECT HAS METAL IMPLANTS) which can be set to various tightness levels to prevent or allow more struggling. <br>\r\n<br>\r\nI've devised a formula which acts with the slipperyness of oil but moderatly increases sensitivity. This can be sprayed from one of the arms, allowing selected aplication. If you run out just refill with normal oil instead.<br>\r\n<br>\r\nTicklish: 4-10<br>\r\nStimulation: 1-4<br>\r\n<br>\r\nCLOTHING NOTES: same as above.<br>\r\n&lt;hr&gt;<br>\r\n<br>\r\nNow thats something that mouse would love to be behind the wheel of, the question remains about who would be inane enough to subject themselves to that.<br>\r\n<br>\r\nShe read through the file on the last room<br>\r\n<br>\r\n&lt;hr&gt;<br>\r\nCustom Room:<br>\r\nThis room is designed for max changibility. The two cabinets on either side of the chair contain more attachments then any other room. A total of eight arms can be extended from the roof and a further two from the floor. The items in the cabinets can be snap locked onto each arm then will register with the main console and also will recive power if needed via the arms.<br>\r\n<br>\r\nYou can of course also choose to just use the items on the subjext yourself, however this will limit control over the room.<br>\r\n<br>\r\nTicklish: 1-10<br>\r\nStimulation: 1-8<br>\r\n<br>\r\nCLOTHING NOTES: Do whatever you want, but I suggest taking off atleast something so the arms can do their work.<br>\r\n&lt;hr&gt;<br>\r\n<br>\r\nSounds like something Chris or Jamie would love, and you're sure Mouse would support them if they decided you should be their subject.<br>\r\n<br>\r\nOne final passage remains about general usage across all rooms and additional features.<br>\r\n<br>\r\n&lt;hr&gt;<br>\r\nAll rooms bindings will close automatically once the computer has been primed and it detects pressure. Only rooms 2,3 have variable tightness as room 1 has instead taken the feature of rail based movement. A slider allows changing in this feaure, while room one's feature is controled via four interactable boxes; The dead center of each box represents the default position of the bindings, they may be moved by clicking on the box where you want the binding, from the position of the camera and door, right on the box brings the binding towards you, left away, lower brings it closer to the floor, and higher to the roof. Double click to move fast, three times for max safe speed. <br>\r\n<br>\r\nAll misters are set up to avoid eyes and sensitive areas, some liquids may react with bruised or cut skin.<br>\r\n<br>\r\nPain causing implements should be carefully monitored.<br>\r\n<br>\r\nRapid clothing cleaner accessed by a chute behind chair in control room, objects will be dropped on desk.<br>\r\n<br>\r\nHandle all chemicals with care, none should damage skin in arm dispersed form due to dilution but concentrate may cause minor chemical burns and fog of mind.<br>\r\n<br>\r\nUse control monitor to open chemical stores, you'll see it when it opens.<br>\r\n<br>\r\n&lt;hr&gt;<br>\r\n<br>\r\nNow it comes down to if she calls just Mouse to check this out or if she should call the whole crew.</span></div></div>",
            "created":1525575660,
            "id":2488988,
            "title":"A chamber covering most of the room"
        },
        "152312":{
            "choices":[
                "Jamie rolled a 1.",
                "Chris rolled a 1."
            ],
            "content":"<div class=\"\"><div> <span>(Due to plot needs, both jamie and chris will be assumed to be female)<br>\r\n<br>\r\nIt wouldn't be right not to show everyone this, and might as well play a game while they were at it. She began to write up her plan as she phoned mouse, \"Hey mouse I can't explain it right now but you have got to come check this out.\", she heard mouses voice on the other end, \"Did you find that machine you were on about last week? Whatever i'll be there soon . Where are you?\". Summer told her and phoned up the other two.<br>\r\n<br>\r\nAn hour later and they had all arrived at the garage. \"I knew this was going to be big, but I think this may just be my best find so far. I can't even explain it, just follow me\" she told her friends as she lead them inside.<br>\r\n<br>\r\n\"God damn.\" Mouse said in an awe struck voice. \"Yeah, hot damn, how the hell did you land this one Summer?\" Jamie asked from her spot in the cramped control room. \"Pure luck, just heared the rumor and, bam, here it was.\". She turned to the others and continued, \"So i've planned a game...\"<br>\r\n<br>\r\nShe hadnt mentioned why the first panel was off, she would leave the true wealth of this find a secret till it was time.<br>\r\n<br>\r\nShe laid out the plan, it would be a classic interrogation game, one that they had played dozens of times. All four would roll dice until one rolled a 1 to be the interrogatee, and one rolled a 6 to be the interrogator. The other two would act as the grunts to handle the interogatee. Summer had long been practicing dice tricks and ensured she rolled a 6.</span></div></div>",
            "created":1525577040,
            "id":2488995,
            "title":"Whole crew."
        },
        "1523121":{
            "choices":[
                "Start"
            ],
            "content":"<div class=\"\"><div> <span>Jamie then had to roll 4 more dice, this was her code she had to try to protect (4625) for as long as possible.<br>\r\n<br>\r\nShe tended to enjoy the roleplaying element of it the most out of the four and even though she was of smaller frame then both Chris and Mouse she tried to fight them off. Mouse managed to get behind her and get her arms under her armpits while Chris  managed to pick up her feet and hold them around one arm, effectively taking her off the floor and preventing useful struggle. Chris used her free arm to remove Jamies shoes and socks before they carried her out of the control room feet first, Chris taking the lead. Chris used the key Summer had given her to unlock the first door and they began moving Jamie in. Mean while Summer closed and locked the soundproof door of the control room, totally sealing herself off. <br>\r\n<br>\r\n\"Can you hold her up for me? Summer said we need to strip her.\" Mouse did her best to lift Jamie up as Chris got to work getting Jamies pants off. \"Do we need to do her panties as well?\" Mouse asked from behind the struggling Jamie. \"Yeah, were supposed to replace them with somesort of tearable ones under the horse\" Chris got the pants off her legs and returned for the panties, \"You still shave Jamie?\" Jamie spat back, \"Wouldn't you like to know?\" Chris pulled them down and responded, \"I see you still are, never got why you always bothered\" then she tossed them next to the pants. She walked over to the horse and located the cabinet. Inside were two clear plastic dividers splitting the container in two. The first section had roughly 40 neatly folded black panties, the largest middle segment had white towels, and the final had an equal amount of bra's made out of the same lacy materials. The undergarments were clearly there as more of a formality to hide the flesh then as actual useful clothing. She returned with one of each and worked the underwear onto Jamie before they began the attempt to get her shirt off.<br>\r\n<br>\r\nChris had to grab Jamies wrists and hold them above her head while Mouse worked off the shirt. Once she got it up to where Chris was holding her hands they switched off againand Chris got it the rest of the way. The bra was easier, Chris undid the strap the pulled it off, then Mouse forcesd her arms slightly away from her body while Chris put the bra on.<br>\r\n<br>\r\nMeanwhile Summer was checking out the controlls she would be useing. From what she could tell, once she hit the red REGISTER button, the computer would somehow make a 3d model of whoever was on the horse. From here Summer could choose which arm to use and then she would select context based tools to draw a plan on the 3d model which the computer would either confirm and allow her to add to a list of actions which she could choose when to activate as well as make to repeat in a loop. Or if not safe or if the arms couldn't manuver in a certain way, it would simply prevent her from trying. She went back to watching the camera.<br>\r\n<br>\r\nChris had grabbed each of Jamie's legs in either hand and was trying to force them apart so they could put her on the horse but Jamie was resisting suprisingly well. Deciding that a change of plans was in order Chris let go and started digging her fingers into Jamie's sides. Jamie burst out laughing and tried to pull in her legs and kick Chris away, who in turn took the opportunity to grab one of her extended legs, then forcing it to the side before grabbing the other. Now with a better grip, Jamie had no chance of escape and finnaly gave up her struggle.<br>\r\n<br>\r\nChris lifted Jamie's body via lifting up her legs and Mouse did her best to follow suit, Jamie now being lifted about a foot over the horse with her legs at a 45* angle. \"You know what jamie? I think you deserve a little punishment for making this so hard!\" Chris told Jamie as she carefully lined Jamie's body up so she would be put down roughly in the middle of her vagina.<br>\r\n<br>\r\nJamie grunted as Chris and Mouse worked to slide her down slowly onto the wood beam, preventing her from adjusting her couse. Both girls then stopped supporting her weight, now they began working to get her arms and legs into the bindings.<br>\r\n<br>\r\nJamie could tell that the wooden horse had a curved ridge to part the labia rather then a pointed ridge to direct weight onto a point, but the ridge still fiy between her labia and as such it was quite un-pleasant as the entirety of her body weight was focused on her slit, and she couldn't help but wiggle in an attempt to move off of it, which just made her press her body more into the ridge.<br>\r\n<br>\r\nJamie's hands were pulled above her head and loced in while her upper legs were made to straddle the horse and her knees bent so her feet were behind her. \"You think she's secured\" Mouse asked. \"I honestly don't know how she could be more secure.\" Chris responded as they both headed out the room.</span></div></div>",
            "created":1525582620,
            "id":2489008,
            "title":"Jamie rolled a 1."
        },
        "15231211":{
            "choices":[
                "Cont 1",
                "Cont 1"
            ],
            "content":"<div class=\"\"><div> <span>Summer looked back over at the first monitor, whos normally grayed out \"REGISTER\" button had lit up to be a deep shade of red. Summer clicked the button and sat back to enjoy the show.<br>\r\n<br>\r\nJamie had been contemplating the unusually sexual nature this run of her groups common game, she didn't mind, the others in the group were attractive to her and she could honestly say she had showed the most intrest in making the games have a bit more naughty. But sitting on a wooden horse in tearable lingerie was quite the extreme change, yet it was quite welcome.<br>\r\n<br>\r\nShe was exitedly awaiting for Summer's entry to the room, when the room went black and a second later dozens of flashes light up the room like a rave.<br>\r\n<br>\r\nSummer watched as the progress bar on her monitor ticked. The monitor was split in two with a gray line acting as a seperator, on the left was a crude 3d model of Jamie which was growing more detailed with each photo it took, on the right was a mostly blank list selector with her two options of \"Tools\" and \"Liquids\" not giving her any suboptions, and in the center was the progress bar which was slowly filling up.<br>\r\n<br>\r\nAt around 500 the camera lowered to the base of the horse and began circleing it, which in turn transformed the t-posed Jamie into a model which represented Jamies actual position in the room. The final 25 photos or so had a much longer delay and the camera spent a while positioning each. Summer added this onto the list of things she would need to check out.<br>\r\n<br>\r\nThe lights in the chamber came back on and a list of sub items began to pop into her list as the camera stopped. The tools list gave her a wide range of items, feathers, dusters, brushes, and more. There were also several more sexual items on the list but she decided she didn't want to pull those out in the first round. The liquids list gave her a list of liquids and a set of choices to either apply on the horse or on the entire body. The liquid selections consisted of lube, baby oil, an aphrodesiac, and something labled \"hot\". Two additional options had been added, \"Horse\" and \"Shackles\", which she assumed controlled movement.<br>\r\n<br>\r\nShe selected two feather arms and programed them to tickle her sides while another drew large circles on her stommach. She hit the \"commit\" button and watched as three arms extended from their hidden places in the walls. The tickling took Jamie by suprise and she shouted out, \"Summer, what the h-hell!\" As she tried to lean her body away from the tickle arms but could only pull her chest back due to her position.</span></div></div>",
            "created":1525750740,
            "id":2489892,
            "title":"Start"
        },
        "152312111":{
            "choices":[
                "Mouse",
                "Chris"
            ],
            "content":"<div class=\"\"><div> <span>Summer added two brush arms to her 'program' which would tickle Jamie's feet, then hit confirm and sat back in her seat. Jamie would break eventually under even this light torture simply due to the consistency of it.<br>\r\n<br>\r\nShe was right, as soon as the brushes made contact with Jamie's feet she was flopping around in her tight restraints. In a few seconds Jamie was begging for the arms to stop and she gave up the code quite quickly when they did.<br>\r\n<br>\r\nChris and Mouse were sent back in to get Jamie who had been coverted into a sweating mess in only the three minutes they had been outside the room. <br>\r\n<br>\r\n\"What happened to you Jamie?\" Chris asked with noticeably less teaseing then was normal.<br>\r\n<br>\r\n\"Arms came out of the walls...\" Jamie took a breath, \"Ticked the shit out of me\"<br>\r\n<br>\r\nSummer remotely turned off the bindings and the pair set about getting her down and dressed. Summer was waiting for them in the hallway as they exited the room.<br>\r\n<br>\r\n\"You didn't tell me there were arms in that room!\" Jamie said.<br>\r\n<br>\r\n\"Thought you knew to be honest, all the other rooms had them\" Summer shrugged and replied.<br>\r\n<br>\r\n\"You clearly didn't think she did, infact I think that counts as cheating. We talked, and we've decided your up next. The question is, whos gunna tickle you? Me or Mouse.\" Chris responded.</span></div></div>",
            "created":1525914300,
            "id":2490947,
            "title":"Cont 1"
        },
        "1523121112":{
            "choices":[
                "Just tools",
                "Just Mouse and Chris"
            ],
            "content":"<div class=\"\"><div> <span>\"You know, I hate all three of you sometimes\" Summer said defeated, she could normally pull Mouse or Jamie to her side but if the three had decided then there wasn't much she could do.<br>\r\n<br>\r\n\"Head off too the computer room Jamie, i'll go once Summer's got her comeuppance\"<br>\r\n<br>\r\nMouse and Chris grabbed either of Summers arms and lead her off to the third chamber, Summer grumpily followed their lead.<br>\r\n<br>\r\nJamie had a choice to make, she could have Chris and Mouse attach some of the tools to the arms and torture Summer by wire, or she could also add in Mouse &amp; Chris along the tools.</span></div></div>",
            "created":1530070920,
            "id":2512381,
            "title":"Chris"
        },
        "15231211121":{
            "choices":[
                "Just tools",
                "Tools & goons"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I missclicked, so heres the proper chapter options</span></div></span></div>",
            "created":1530070980,
            "id":2512382,
            "title":"Technical problems"
        },
        "152312111211":{
            "choices":[
                "She does just that.",
                "She put on the bra as well."
            ],
            "content":"<div class=\"\"><div> <span>Mouse inspected the items in the drawer as Chris struggled with an annoying button on Summer's shirt. Each drawer was labeled with a vague and broad descriptor scrawled on what looked like sticky name tags. Things such as 'Tickle' 'Tickle' 'Tickle' 'Stimulation' provided a strong idea of what was inside, but Mouse wanted to confirm what she guessed.<br>\r\n<br>\r\nEach 'Tickle' drawer had a wide assortment of tickle tools. All three had similar items in similar sections but each drawer had even more advanced versions of the gear than the last, Mouse decided to make a mental note of the types and versions of the various tools:<br>\r\n<br>\r\nFeathers: First there were standard bird feathers which had their stems affixed to a connector point, then what seemed to be rubbery bristles affixed to a connector point much like the feathers, and finally what seemed like the tough bristle you would see used in a chemistry lab to clean vials and tubes.<br>\r\n<br>\r\nBrushes: Wide brushes affixed to connector points, metal looking brushes with thinner endpoints, and what seemed to be larger versions of the chemistry bristles affixed to a small motor.<br>\r\n<br>\r\nTounges: Mouse didn't really know how to categorize these, they seemed to be designed to act like tongues. The first drawer had what seemed like crude replica's of human tongues, the second drawer had rougher sandpaper/animal like tongues, and the third was an oddball, it had what seemed like tentacles in it.<br>\r\n<br>\r\nMouse opened the 'Stimulation' drawer, and yep, it was sex toys. Mouse quickly closed the drawer and returned to organizing the tickle tools. Chris yelled and Mouse snapped back to focus, Chris had more or less gotten Summer's shirt and jeans off and Summer had taken to sitting on the edge of the table waiting.<br>\r\n<br>\r\n\"Can you go get the clothes? I'll get her ready\"<br>\r\n\"Yeah sure, be right back.\"<br>\r\n<br>\r\n\"So Summer, you could commercialize this place. A hole in the wall dungeon! Bring in me and Mouse as your gimps, and have Jamie run behind the scenes.\" Chris said while helping Summer onto the table proper.<br>\r\n<br>\r\n\"You're not exactly in the position to request gainful employment from me Chris\"<br>\r\n<br>\r\n\"Well you're not exactly in a position to be so smarmy\"<br>\r\n<br>\r\n\"Besides Chris, I doubt Mouse would look good in latex\"<br>\r\n<br>\r\n\"So you're saying its a maybe?\"<br>\r\n<br>\r\n\"Yeah, its a maybe, now come on lets get this over with.\" Summer finished as she began slipping her legs under the loose staps. Chris helped Summer slip her arms under the hard to use arm straps, leaving only the chest and stomach support straps undone. Chris began un-doing Summers bra, \"Chris, do you ever just think for a moment, 'We are a seriously fucking weird group of people'?\"<br>\r\n<br>\r\n\"Nah, I know what i'm getting into whenever I get a call from y'all crazies\"<br>\r\n<br>\r\n\"Well.. yeah but I mean on more of a general level. I'm a detective, Mouse faked her death, and who even knows whats going on with you two. Don't you ever wonder what the hell were all doing in one building?\"<br>\r\n<br>\r\n\"Never really thought about it like that. But I guess the one thing that brings us together is our collective fucking weirdness\"<br>\r\n<br>\r\nSummer now laid totally nude on the soft material of the table, it seemed to be some type of leather casing around about an in' of memory foam. Chris leaned against the tiled wall and together in silence the two waited.<br>\r\n<br>\r\nMouse returned shortly with the undergarments but froze in the door way and turned her head away from Summer's form on the table.<br>\r\n<br>\r\n\"Aww, what the hell Chris!\"<br>\r\n<br>\r\n\"Whats up? Did something happen?\"<br>\r\n<br>\r\n\"No it's just, I thought she would still be in her clothes Chris.\"<br>\r\n<br>\r\n\"Really Mouse? You're okay with all this shit but your sister being naked makes you turn a cheek?\"<br>\r\n<br>\r\n\"Just get some underwear on her would you?\" Mouse demanded.</span></div></div>",
            "created":1530077940,
            "id":2512421,
            "title":"Just tools"
        },
        "1523121112111":{
            "choices":[
                "Design 1",
                "Design 2",
                "Design 3",
                "Design 4"
            ],
            "content":"<div class=\"\"><div> <span>\"Fine Mouse, hand me that.\" Chris retrieved the garments and tied the underwear onto Summer<br>\r\n<br>\r\n\"Okay Mouse, you can come out now.\"<br>\r\n<br>\r\nMouse returned to the chamber and looked at Summer, then returned her gaze to Chris with an unamused expression, \"You know that wasn't what I mean Chris.\"<br>\r\n<br>\r\n\"Oh come on, it isn't like they were going to stay on for long anyways Mouse\"<br>\r\n<br>\r\n\"Yeah yeah, lets just get this done with\" Mouse sighed as she went over too the drawers with Chris.<br>\r\n<br>\r\n\"Okay, so we have a total of ten arms to use. I made a list of all the tools we have and I have a few ideas on what the loadout should be, what about you?\"<br>\r\n<br>\r\n\"You know I ain't good with choices Mouse, i'm sure whatever you decide on will be great.\"<br>\r\n<br>\r\n\"Yeah okay, let's see here...\" Mouse's voice trailed off as she examined the arms, the eight in the ceiling were on rails in such a way that any one of them could move about the table without interfering with the others, while the two on the floor at the front of the table were mounted in place. Exact positioning wouldn't matter, just what tools she decided to use.<br>\r\n<br>\r\nDesign 1: Mouse could simulate human tickling by only using tools that stimulate basic tickling, so feathers on the lower arms, 6 upper arms, and 2 tounge tools on the upper arms.<br>\r\n<br>\r\nDesign 2: Mouse would use the automation of some tools to her advantage by having two motor bristle on the lower arms, <br>\r\ntwo feather attachments, two of the small bristles, two brushes, and two of the rough tongues.<br>\r\n<br>\r\nDesign 3: A less advanced design based around broad tickling rather than small surface area tickling, two brushes on the lower arms, four brushes on the upper arms, two rough tongues, and two feathers.<br>\r\n<br>\r\nDesign 4: After messing around with the weird tentacles Mouse realized there was a small object lodged in each suction cup, she pulled on one and a small feather looking thing extended about a half inch out of the pod. So this design is based around those. Two feathers on the lower legs, four feathers on the upper arms, and four of the tickle tentacles.<br>\r\n</span></div></div>",
            "created":1530127200,
            "id":2512595,
            "title":"Half of no dignity"
        },
        "15231211121112":{
            "choices":[
                "No you didn't, Good luck",
                "Oh right, lets roll one"
            ],
            "content":"<div class=\"\"><div> <span>She muled it over for a minute before deciding on the automation approach, she gathered her tools and set to work. The tools clicked in easy enough, but a loud locking noise and the slight shudder in each arm as she locked in a tool told her that they were deeply secured.<br>\r\n<br>\r\n\"You can head out mouse, i'll get the last few straps\" Chris said as she took one of the stomach straps and latched it into the strap on its opposite side.<br>\r\n<br>\r\n\"Okay, i'll go tell Jamie were ready\"<br>\r\n<br>\r\nChris' work was soon finished and she headed over to the door, but a exadurated 'Ahem' from Summer got her attention.<br>\r\n<br>\r\n\"I don't believe I ever got a code?\"</span></div></div>",
            "created":1530127920,
            "id":2512596,
            "title":"Mercy of Computers (hint there is none)"
        }
    },
    "info":{
        "author_id":"whade",
        "author_name":"Whade",
        "brief_description":"The 6th Summer Salt story (for now;portfolio's full :p). !Warning: tickle fetish ahead.",
        "created":1471515240,
        "description":"<td align=\"left\" class=\"norm\">Featuring an even older cast (with flashbacks!), this collection of Summer contains the following stories:<br>\r\n<br>\r\n<b>Whatever Happened to Susan Salt?</b> (Mouse's reappearance in Summer's life brings tickles with a twist)<br>\r\n<b>The Plague of the Pestering Prince</b> (Summer &amp; friends attempt to purge the Clown Prince once &amp; for all)<br>\r\n<b>The Trail at the Tickleversity</b> (Summer &amp; co. choose to enroll in a tickling university to unveil its secrets)<br>\r\n<b>The 20% Naked Dilemma</b> (Summer's first big post-grad case)</td>",
        "id":2093734,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1586434020,
        "modified":1586434020,
        "pretty_title":"Whatever Happened to Susan Salt?"
    }
}