{
    "chapters":{
        "1":{
            "author_id":"peterpan1",
            "author_name":"Mermaid 10",
            "choices":[
                "Girl (18 or under)",
                "Boy ( 18 or younger) ",
                "Teenage Alien ( just putting the choice out there)",
                "Adult male ( 19 & up)",
                "Adult female (19 & up)"
            ],
            "content":"<div class=\"\"><div> <span>Your eyes shoot open and you sit up breathing heavy in a cold sweat. The room is pitch black and smells of a strong mix of dirty gym clothes and air freshener. You feel around till you determine your laying on a large cot. Stumbling, you manage to stand up and you somehow know you are alone.<br>\r\n<br>\r\nBefore you continue, can you remember your gender?</span></div></div>",
            "created":1346986440,
            "id":1422528,
            "title":"Awaken"
        },
        "11":{
            "author_id":"peterpan1",
            "author_name":"Mermaid 10",
            "choices":[
                "Go out and explore",
                "Stay in the safety of the room"
            ],
            "content":"<div class=\"\"><div> <span>Okay, so you're a girl. You try to think about how you got to this strange room but you nothing comes to mind in fact, you can't even remember your age! You feel around till you find a metal door with the lock busted. You place your ear to the door and can faintly hear a crowd cheering outside. This could be good because maybe some can tell you where you are. But... What if that cheering crowd is the reason for you being here? Should you just stay in here where you're pretty sure is safe?</span></div></div>",
            "created":1346995800,
            "id":1422600,
            "title":"Girl (18 or under)"
        },
        "111":{
            "author_id":"peterpan1",
            "author_name":"Mermaid 10",
            "choices":[
                "Go up up the stairs",
                "Grab some food",
                "Go back to the room and take a nap"
            ],
            "content":"<div class=\"\"><div> <span>You can't stay around here, you need to know what's gong on. You cautiously push open the door to reveal sun light. You squint your eyes as you take a moment to adjust to the light. You look behind you back to the room you occupied and it looks like a small storage room or something. The smell of frying foods and hot dogs hits you and your stomach growls loudly at you. You take look around to see food carts scattered all around with people mulling around wearing their team's colors. You hear cheering again from above you, you must be in a stadium. you locate the stairs to go up and start to head up when your stomach growls in protest. Do you ignore your empty belly or do you head to a food stand?</span></div></div>",
            "created":1347030060,
            "id":1422727,
            "title":"Go out and explore"
        },
        "1111":{
            "author_id":"peterpan1",
            "author_name":"Mermaid 10",
            "choices":[
                "The truth",
                "Lie",
                "Demand answers"
            ],
            "content":"<div class=\"\"><div> <span>You head up the stairs two steps at a time as the sounds of the crowd gets louder. When you reach the top you find yourself indeed in a very crowded baseball stadium. As you take in your surroundings, you feel a small tug in the back of your brain like you should recognize this place as you make your way through the rows of crowded bleachers. You finally find a spot next to a boy with short blond hair and you sit. After a few minutes, I guess his team makes a home run because the boy jumps up with thousands of other fans cheering. After a moment of you watching him he turns to you with a smile. \" best game of the season right?\" you shrug not sure how to answer. \" umm... Right... Who's playing again?\" the boy laughs but stops when he takes in your confused face. He sits back down and looks at you intensely. \" your serious? You really don't know who's playing but, yet you're sitting here at the stadium watching?\" he's right, its pretty stupid. you feel embarrassment hit your face and hesitate before answering.<br>\r\n<br>\r\nDo you explain the situation or do you act like you know what's going on?</span></div></div>",
            "created":1348124400,
            "id":1431483,
            "title":"Go up up the stairs"
        },
        "11111":{
            "author_id":"peterpan1",
            "author_name":"Mermaid 10",
            "choices":[
                "Tell him about the room",
                "Tell him he knows enough"
            ],
            "content":"<div class=\"\"><div> <span>You need answers and maybe this guy can help you, plus it could help cover up the stupidity of being here.  You look the boy straight in the eyes. \" I don't even know where this stadium is or how I got here. Can you tell me where we are?\" the boy watches you then slowly nods.\" yea, we're in san Francisco.  6th inning and san Francisco is whooping our opponents. And you probably got here like everyone else by driving and...\" he stops and studies you. \" what's  your name anyway?\" you open your mouth to respond feeling sure of yourself but nothing comes out and not a single letter comes to mind. Seeing your shock and frustration the boy grows grim. \" let me guess you don't know?\" numbly you shake your head slowly. The boy thinks for a second. \" do you know today's date?\" instantly you answer feeling so positive. \" September 19, 2012\" your feelings of triumph dersaperates when his frown deepens. \" umm.. No, that was two days ago. Today is the 21st. Where have you been?!\" <br>\r\n<br>\r\nDo you explain more to him or do you think he knows enough?   </span></div></div>",
            "created":1348126200,
            "id":1431490,
            "title":"The truth"
        },
        "12":{
            "author_id":"arbiter42",
            "author_name":"PsiWarp",
            "choices":[
                "14",
                "15",
                "16",
                "17",
                "18"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old are you?</span></div></span></div>",
            "created":1348425420,
            "id":1433521,
            "title":"Age?"
        },
        "125":{
            "author_id":"peterpan1",
            "author_name":"Mermaid 10",
            "choices":[
                "Go out and explore",
                "Stay here and sleep"
            ],
            "content":"<div class=\"\"><div> <span>Okay, so you're a boy. You're 18 years old. You try to think about how you got to this strange room but you nothing comes to mind in fact, you can't even remember your own eye color! You feel around till you find a metal door with the lock busted. You place your ear to the door and can faintly hear a crowd cheering outside. This could be good because maybe some can tell you where you are. But... What if that cheering crowd is the reason for you being here?  You also feel tired even though you just woke up. Should you just stay in here where you're pretty sure is safe?</span></div></div>",
            "created":1348426740,
            "id":1433535,
            "title":"18"
        },
        "1251":{
            "author_id":"peterpan1",
            "author_name":"Mermaid 10",
            "choices":[
                "Go up the stairs",
                "Grab some food",
                "Head back to the room and sleep"
            ],
            "content":"<div class=\"\"><div> <span>You can't stay around here, you need to know what's gong on. You cautiously push open the door to reveal sun light. You squint your eyes as you take a moment to adjust to the light. You look behind you back to the room you occupied and it looks like a small storage room or something. The smell of frying foods and hot dogs hits you and your stomach growls loudly at you. You take look around to see food carts scattered all around with people mulling around wearing their team's colors. You hear cheering again from above you, you must be in a stadium. you locate the stairs to go up and start to head up when your stomach growls in protest. You also have a headache. Do you ignore your empty belly or do you head to a food stand?<br>\r\n</span></div></div>",
            "created":1351144800,
            "id":1453306,
            "title":"Go out and explore"
        }
    },
    "info":{
        "author_id":"peterpan1",
        "author_name":"Mermaid 10",
        "brief_description":"What happens when you wake up with amnesia? And how do you get home?!",
        "created":1346985180,
        "description":"<td align=\"left\" class=\"norm\">What if you woke up without any memory of who you are or where you are? Who do you trust? Who is th mysterious boy in your dreams? What happend to you, and most importaint ... How do you get you memories back?<br>\r\n<br>\r\nNo dying, cursing, sex, or same gender attraction. Keep this PG. </td>",
        "id":1889969,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1351145040,
        "modified":1351145040,
        "pretty_title":"Forgotten. ( what if...)"
    }
}