{
    "chapters":{
        "1":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Giant (male)",
                "Giantess (Female)",
                "Mulitple giants (males)",
                "Multiple Giantesses (females)",
                "Couple"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The first choice is if you want a giant, giantess or multiple.</span></div></span></div>",
            "created":1557118800,
            "id":2655995,
            "title":"So It Begins"
        },
        "11":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Toddler (2-5)",
                "Child (6-12)",
                "Teen (13-18)",
                "Adult (18+)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old is the giant?</span></div></span></div>",
            "created":1557118800,
            "id":2655999,
            "title":"Giant (male)"
        },
        "111":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Spunky the saber tooth tiger.",
                "Salty Dog A.K.A the incredible growing puppy.",
                "Open Choice Chapter."
            ],
            "content":"<div class=\"\"><div> <span>Here are two giant babies that you can pick from.<br>\r\n<br>\r\nFirst up is my original character Spunky the saber tooth tiger who happens to be a 2 year old giant baby who happens to be quite mature for his age as he grows bigger fatter and stronger while channeling his inner superhero as he wears an Superman like costume with an giant sized Huggies giant movers diaper that he wears underneath his costume.<br>\r\n<br>\r\nNext up is another original character of mine in other words the mascot for Salty Dog surf shops Salty dog himself, as Salty Dog also known as the incredible growing puppy goes on an eating rampage as he grows bigger and fatter by eating everything in sight as no city will be safe from the incredible growing puppy.<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1558400520,
            "id":2662050,
            "title":"Toddler (2-5)"
        },
        "1113":{
            "author_id":"giantlolikaiju",
            "author_name":"UltimateGiantess",
            "choices":[
                "Toshio the giant toddler monster",
                "Max the hyper kid",
                "More Options"
            ],
            "content":"<div class=\"\"><div> <span>Toshio: He is a 3 year old Japanese toddler who is truly in love with the old Japanese giant monster movies like Gamera and Godzilla among others. He is always been in awe for a kid his age on how the monsters destroy those cities and one day imagines himself as a giant toddler in a diaper kaiju terrorizing the city. He usually plays and acts around like a giant monster when he plays with his toys and sand castles. He currently lives in Tokyo, Japan. Well soon the entire city will feel his wrath when he somehow one day grows into a giant toddler.<br>\r\n<br>\r\nMax: A 4 year old boy who is a pure gentle heart and soul, but also super hyper and playful. Basically give him any sort of sugar and he would really start going all out. No wonder why he wets himself so much to wear diapers and what not. Well if he grew into a giant, well imagine the chaos.<br>\r\n<br>\r\nSo what do you wanna do, Toshio the giant toddler monster, or Max the hyper kid.</span></div></div>",
            "created":1560518940,
            "id":2673108,
            "title":"More Options"
        },
        "114":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Get his revenge at Smith Industries",
                "Just start destroying",
                "Create a new giant"
            ],
            "content":"<div class=\"\"><div> <span>Once upon a time there was a young man named Brian. Brian was 25 years old and about 6 feet tall with brown hair and eyes. He had a good office job at Smith Industries. He seemed like an average guy, but nobody knew he had a couple secrets. The first was that he had a diaper fetish and wore diapers whenever he was at home. One day he was running late and decided to wear his diaper to work thinking that nobody would find out. He would come to regret this decision. The day was going normal; until he dropped a pencil. He reached down to pick it up not realizing that his shirt slid up a bit exposing the waistband of his diaper. A sly coworker was able to take a photo and proceeded to text the photo to everybody in the office. The rest of the day for Brian was torture as coworkers made fun of him because of his diaper. They would soon regret this because Brian’s other secret was he had special powers that allowed him to grow to any height he wanted.<br>\r\n<br>\r\nBy the time Brian got home, he was seething with anger and desire for revenge. An idea also popped into his head that he could become huge and conquer the world. An evil smile crept onto his face at this thought. He decided to wait until morning to grow and get his revenge. He went about his day as normal and went to bed.<br>\r\n<br>\r\nHe woke up around 7:00 the next morning. He got up and said to himself, “My conquest of this planet begins”, and he started growing. He ended up growing to 200 feet tall and only his diaper grew with him. As he grew, his house and the houses on either side of his own were destroyed. He looked out into the street at the many people staring at him <br>\r\n<br>\r\nPeople on the street just looked up in awe at this giant. They looked him up and down and a few started laughing when they saw the giant with a 5 O’clock shadow and wearing a diaper. Brian quickly noticed this and quickly grabbed them all and lifted them up to his face. “You must be really stupid to laugh at me when I can crush you like bugs\", he boomed. This sent a shiver of fear through their spines. They immediately apologized and begged Brian for their lives. Brian felt a slight growl in his stomach because he hadn’t had breakfast. He told his captives that he wasn’t going to crush them. The people in his hands were relived thinking that they were going to live. Brian just smiled and opened up his mouth. The people started panicking again as they realized what was going to happen. Brian tossed them all into his mouth and sucked on them to taste their flavor. He tilted his head back and swallowed the bugs whole with a gulp. People looked on in horror as a bulge appeared in Brain’s throat and slid into his stomach. Brian just smiled and rubbed his stomach as the bugs squirming inside were tickling him. A few minutes later, the bugs had been digested by his stomach. “Those people were delicious” Brian boomed.<br>\r\n<br>\r\nHe then stood up and walked to the outskirts of the city. He left several footprints in the roads and had squished a few people. Once he reached the outskirts, he started walking around the city dragging his foot. His foot was creating a ditch several feet deep. His dragging foot was destroying roads, bridges, tunnels, and train tracks, anything that could be used to escape the city. Once he completed his encirclement of the city, he walked over to the airport.<br>\r\n<br>\r\nHe arrived at the airport and stomped the runway so no plane could escape. He grabbed the first plane and lifted it to his face. His stomach growled again as he was still hungry. He smiled and took a bite out of the plane. He started chewing the chunk in his mouth and swallowed. He continued to eat the plane one bite at a time. After he had finished eating the first plane, he grabbed the next plane and proceeded to eat it. By the time he was full, he had eaten several planes. He started stomping on the next few planes. He grabbed another plane and flew it into the front of his diaper. He started crawling and crushing planes beneath his hands and knees.<br>\r\n<br>\r\nHe stood up and walked over to the airport building. He lifted his foot above one terminal and stomped it down. He lifted his other foot and stomped it in front of his other. He continued until the terminal was crushed. It took him a few times to crush the next terminal beneath his diaper. The next terminal was crushed between his hands. He got back on his hands and knees and crawled through the next terminal. He lay down on his stomach and destroyed what was left of the airport. He stood up and walked over to the control tower and smashed through it. He looked around the city and smiled. He boomed “Now these people have no escape, so my fun can really begin\". What happens next.<br>\r\n</span></div></div>",
            "created":1559192220,
            "id":2666434,
            "title":"Brianzilla"
        },
        "1141":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Continue with Brian",
                "Continue with Brian",
                "Continue with Brian"
            ],
            "content":"<div class=\"\"><div> <span>Brian looked at the destroyed airport with pride. “Now nobody can escape me,” he yelled. He began wondering if he wanted to get revenge now or later. Then he reminded himself about what happened at work the previous day. “Time for my so called coworkers to learn actions have consequences” he thought to himself. He started walking over to his former office. He crushed buildings, cars, and people along the way, but he didn’t care.<br>\r\n<br>\r\nWhen he got to Smith Industries, he pulled down the buildings on either side. He told everybody inside to come out immediately. People began pouring out of the building and saw the road blocked by rubble. His former coworkers were terrified as they looked up at Brian’s smiling face. He ordered them to tell him who took the photo. Everybody started looking at each other wondering what to do.<br>\r\n<br>\r\nAfter a few minutes, Brian was done waiting. He told them that if nobody wants to talk, he’ll just punish everybody. Everybody screamed as he scooped up several people. “So you think my diaper is so funny. Let’s see if you think this is funny.” With that he dropped them into his diaper. He scooped up several more people and dropped them inside with the others. He kept going until all of them were trapped in his diaper. Brian laughed as he had dozens trapped in his diaper. Some landed on his dick and others were staring at his semi-truck sized dick and his car sized balls.<br>\r\n<br>\r\nSome of his captives started kicking and punching his dick and balls to get Brian to let them out. What they didn’t realize was their squirming was actually pleasuring him. He pulled out the front of his diaper and told his captives to keep it up. Most started rubbing and caressing his dick and balls. Those on his dick started rubbing and grinding on it.<br>\r\n<br>\r\nBrian put his hands on the crotch area on his diaper and started rubbing. Those beneath his balls were pressed into his flesh. Brian positioned himself above the Smith industries building. He smiled as he sat down and crushed the building. There was also a crunch as many people were crushed beneath his crotch. Brian just laughed and crushed a few more buildings as he lay down on his back. He started rubbing the blood stained diaper against his balls again. Brian was grunting and moaning as he was rubbing his crotch and many others were rubbing his dick. It wasn’t long before he had to unload. He let out a loud moan as he started spewing cum into his diaper. His captives were panicking as he kept unloading his cum. <br>\r\n<br>\r\nIt took a couple minutes before he was spent. One he was, he pulled out the front of his diaper. Most inside had drowned in his cum. The people on his dick were the only survivors, but they were still soaked in cum. Brian had an idea for those few survivors. He sat up which threw those on his dick off. He held open his diaper as he started to piss. His captives tried to swim in piss but it was futile as they all drowned. He just laughed as he let his diaper snap back onto his waist. With his revenge compete, he sat there contemplating what he would do next.<br>\r\n</span></div></div>",
            "created":1560798660,
            "id":2674833,
            "title":"Brian's Revenge"
        },
        "11411":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Continue",
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Brian stood back up and looked over his diaper. He looked over and rubbed the soaked front while laughing. He felt that he wasn’t done yet. He walked over to another building that reached a little above his knees. He ripped off the roof and smiled at the terrified people inside. He turned around and squatted onto the building resting his diaper just onto the building. The people just started at his massive diaper. Brian began pushing and a log pocked out is butt. The semi sized turd landed into his diaper making the people panic. He kept pushing several more logs into his diaper which made the diaper sag. Those inside the building were pinned to the floor. They could hear the building creaking and really started panicking. Brian just laughed as he felt the building collapse into rubble.<br>\r\n<br>\r\nHe shook his butt on the ground to be sure he completely destroyed the building. He noticed a terrified group of people nearby and smiled. He stood up and walked over to the terrified people. “Seems I filled my diaper, can you help change me” he said with a mock child-like voice. These people were screaming and started running. Brian got really upset and started stomping after them. As he caught up with the back of the group, he stomped on them and smiled as several people were squished. He lifted his other foot and stomped it down, killing several more. He kept going until they were all crushed beneath his feet. “You should’ve changed my diaper when you had a chance.”<br>\r\n<br>\r\nHe smiled as another idea popped into his head. “I think all of you need a lesson in listening.” He looked into a 5 story apartment building and smiled at the terrified people inside. He put his hand on the other side and pushed the building over. He laughed as it fell and exploded when it hit the ground. He walked up at another building and stomped it into rubble. The next building he put his hands on the roof and pushed down, crushing it. He walked up to a small store and got into a squat. He swung his hand forward and smashed it through the building. He stepped over to the store next door and gave the building a firm kick. <br>\r\n<br>\r\nHe noticed a long line of a few dozen buildings and another idea popped into his head. The building ranged from being level with the waistband of his diaper to his shoulder. He walked up to the first building which was the shortest of them all. His bulging diaper was pressed into the building making people gag. He ripped off the roof and smiled at the people inside. He waved and said bye-bye to the little bugs. He stepped forward and smashed through the building. He laughed as it crumbled. The next building was a little bit taller, but his diaper was still pressed against it. He smiled as he just stepped forward and destroyed it. He started walking casually along destroying buildings with each step.<br>\r\n<br>\r\nA while later Brian smashed through the last building. He looked back at the line of rubble directly behind him and the destroyed buildings around the city. He walked over to another building. He squatted onto the building and put his full weight on it. The building collapsed and Brian landed with a loud boom. “Maybe next time you bugs will think twice before disobeying me.” He put his feet out and smashed through a couple buildings. He looked around and smiled. He was thinking about what to do next.<br>\r\n</span></div></div>",
            "created":1562873880,
            "id":2685398,
            "title":"Brian's Rampage"
        },
        "114111":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Continue",
                "Continue",
                "Continue"
            ],
            "content":"<div class=\"\"><div> <span>Brian was smiling as he looked at the destruction around. He stood up and brushed the rubble of his diapered rear. Now he felt his dick was starting to get hard in his diaper again. He thought that it would be fun to jack off with a few people. Then he saw a nearby building that matched his height. He smiled as a new idea popped in his head.<br>\r\n<br>\r\nHe walked over to the building and ripped a hole in the front of his diaper. There were over a dozen people staring at the head of his dick. He grabbed the corner offices of the building to steady himself. He pulled back a bit and rammed his dick into the building. His dick pile driving through the wall. When the debris stopped falling, dozens in the building looked up to see the underside of his mighty dick. He started humping the building. He moaned as he fucked the building as if it was a women’s pussy. He fucked the building for several minutes until he was close to climax. He moaned loudly as he unloaded his load into the building. His cum started flooding the floor below his dick making people panic. His cum filling the floor until it reached the underside of his dick forcing everybody to be submerged in his cum and eventually drown. As he climaxed, he clenched his hands into fists and crushed the top corners of the building.<br>\r\n<br>\r\nHe fell to the ground when he was spent, crushing a few more buildings. He lay amongst rubble panting in pure bliss. After a few minutes he sat back up and looked up at the mangled building. He smiled with pride at the damage he caused. He got up so he could look into the hole his dick made in the building. He laughed as he saw several bodies floating in his cum. He stood back up to his full height and reinserted his dick into the building. He swung it side to side smashing through the side walls. The building collapsed into rubble making Brian smile. “These buildings are so weak that even my dick can destroy them with ease.”<br>\r\n<br>\r\nWith his diaper full and with a hole in it, he looked for a place to get changed. He found a Walmart and ripped off the roof. He was a bit surprised that the place was abandoned, but he had more important problems to deal with. He reached into the baby section and grabbed a skull printed diaper, wipes, and powder. He took the supplies out and grew them so they were large enough for his needs. He placed a foot on either side of the building. He undid the tapes on the diaper and let it fall to the ground. There was a loud crash as the diaper landed on the store and completely crushed it. “Even my full diaper can destroy buildings on its own” he said with a laugh. <br>\r\n<br>\r\nHe sat down on the diaper and laid back, crushing several more buildings. He used the full diaper and wipes to clean himself up. He slid the diaper out from beneath him. He sprinkled some baby powder on his crotch. He pulled the diaper up to his waist and taped it on tight. He folded the old diaper into a ball. He stood up and walked over to the dump and dropped the diaper inside. He looked around thinking about what else he could do with this city.<br>\r\n</span></div></div>",
            "created":1569906240,
            "id":2726187,
            "title":"Brian Fucks A Building"
        },
        "12":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Toddler (2-5)",
                "Child (6-12)",
                "Teen (13-18)",
                "Adult (18+)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old is the giantess?</span></div></span></div>",
            "created":1557118800,
            "id":2656001,
            "title":"Giantess (Female)"
        },
        "13":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Toddler (2-5)",
                "Child (6-12)",
                "Teen (13-18)",
                "Adult (18+)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old are the giants?</span></div></span></div>",
            "created":1557172440,
            "id":2656003,
            "title":"Mulitple giants (males)"
        },
        "132":{
            "author_id":"arthurweston",
            "author_name":"arthur",
            "choices":[
                "6-8",
                "9-10",
                "11-12"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What particular age?</span></div></span></div>",
            "created":1574362620,
            "id":2749781,
            "title":"Child (6-12)"
        },
        "1323":{
            "author_id":"arthurweston",
            "author_name":"arthur",
            "choices":[
                "Ten minutes later..."
            ],
            "content":"<div class=\"\"><div> <span>It was a warm summer afternoon, and two eleven-year-old boys were kicking a soccer ball around the yard to each other. The pair had been doing this for around thirty minutes now, waiting on the third friend in their little trio, Jackson, to arrive. The shorter of the two kicked the ball one last time before sighing, \"It's <i>so</i> hot. I just wanna go inside and play <i>Halo</i> already. Where's Jackson?\"<br>\r\n<br>\r\nPicking the ball up, a brown haired boy responded, \"I don't know dude. He's taking forever.\" <br>\r\n<br>\r\nThe duo decided to take a break and sit on the steps of the front porch, as the temperature was getting close to a hundred degrees again. They sat in silence for a minute, before the shorter lad spoke up again, \"Do you ever wonder what it what be like to be a bug?\" he said, chasing a big black ant around the wood with his index finger, \"Think about it dude, we must be real-life giants to them!\" He exclaimed.<br>\r\n<br>\r\nThe other boy smiled as he watched his friend chase the ant around, \"Yeah. It would be cool to be a <i>real</i> giant.\"<br>\r\n<br>\r\nAs the two watched the ant scurry back down from the steps and onto the concrete sidewalk, the bug was suddenly enveloped in a familiar shadow before being squashed flatter than a pancake underneath a big barefoot. <br>\r\n<br>\r\n\"Braxton! Eli! Guess what I got!\"<br>\r\n<br>\r\nThe barefoot was traced up to the excited face of none other than their best friend Jackson, who had finally decided to make an appearance. <br>\r\n<br>\r\n\"Hopefully a new diaper.\" Braxton, the shortest of the trio, said while plugging his nose. <br>\r\n<br>\r\n\"Yeah dude, go to the bathroom.\" Said Eli, who followed Braxton's lead and covered his nose. <br>\r\n<br>\r\n\"You guys are lame. I'll be right back.\" Jackson said, running up the steps and into the house.<br>\r\n<br>\r\nThe two followed him inside, sprawling out lazily on the sofa in the living room while waiting for him to come back and show them this big surprise. They heard Jackson racing down the steps after changing his diaper. He stood in front of the sofa. <br>\r\n<br>\r\n\"Okay guys, you ready for this?\" <br>\r\n<br>\r\n\"Yeah, what is it?\" Eli asked. <br>\r\n<br>\r\n\"Show us already!\" Braxton exclaimed. <br>\r\n<br>\r\nDigging into the pocket of his red gym shorts, the boy produced vial with a faint-green liquid inside. It was plugged with a single cork at the top. It almost looked like something out of a movie. The pair on the couch looked at it momentarily, before giving each other a confused glance.<br>\r\n<br>\r\n\"Uh... What is it?\" Braxton asked.<br>\r\n<br>\r\n\"It's a growth serum!\" Jackson said with glee. \"This little bit could make all three of us grow up to almost two-hundred-feet!\"<br>\r\n<br>\r\n\"You can't be serious,\" Eli said nonchalantly.<br>\r\n<br>\r\n\"Dead-ass dude! I heard my dad talking about it last night on the phone! He said he finally finished it!\" Jackson said.<br>\r\n<br>\r\n\"Okay, so then how'd <i>you</i> get it?\" Braxton asked, glancing quizzically at Jackson.<br>\r\n<br>\r\n\"I may have taken it out of his briefcase this morning before he left for work,\" he said, rubbing the back of his neck nervously. \"Either way, once we drink this stuff, it won't matter if I took it or not! We'll be huge!\"<br>\r\n<br>\r\nThe trio smiled at each other for a moment.<br>\r\n<br>\r\n\"Well, only one way to see if this works I guess!\" Eli said. <br>\r\n<br>\r\n\"I'll go first!\" Jackson pulled the cork from the top after struggling with it for a moment. Tossing it aside, he tilted his head back and drank some down before passing it to Eli, who then shared the last of it with Braxton.<br>\r\n<br>\r\n\"It tastes sour,\" Braxton said, wiping his mouth with the back of his hand and giving the vial back to Jackson. <br>\r\n<br>\r\n\"How long 'for this stuff kicks in?\" Eli questioned.<br>\r\n<br>\r\n\"I don't know. I think we just gotta wait to see.\"<br>\r\n<br>\r\n\"Well... You guys wanna play <i>Halo</i>?\" Eli asked.<br>\r\n<br>\r\n\"I get the red controller!\" Braxton yelled, jumping out of his seat. <br>\r\n<br>\r\n\"No I get the red one!\" Jackson chased him up the steps. <br>\r\n<br>\r\nEli followed the pair up to Braxton's room, where they spent the next few minutes gaming.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1574365500,
            "id":2749792,
            "title":"11-12"
        },
        "13231":{
            "author_id":"arthurweston",
            "author_name":"arthur",
            "choices":[
                "\"You guys ready for some real fun?\"",
                "\"Should we go to the beach or the city?\"",
                "\"You guys wanna go to the school?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Aw, no fair! You stole my gun!\" Braxton yelled, tossing his controller aside.<br>\r\n<br>\r\n\"Uh... Guys, I feel something.\" Eli said, grabbing his stomach. <br>\r\n<br>\r\n\"Hey, yeah, me too.\" Jackson grabbed his as well.<br>\r\n<br>\r\n\"I think I feel it too! We should get outside! I don't wanna destroy my house!\" Braxton exclaimed, rushing out of the door with his two best friends in tow.<br>\r\n<br>\r\nAs soon as the three made it to the front lawn, the all hunched over and began trembling. Before they knew it, the trembling grew stronger and stronger, growing all of them very quickly without much pain at all. It was all very disorienting.<br>\r\n<br>\r\n\"Ahhh!\" Braxton groaned. <br>\r\n<br>\r\nAfter almost five minutes, the trembling and vibrations suddenly ceased altogether, and the three sat up and looked at each other. Their vision was blurry at first as they opened their eyes, but soon, none of them could believe what they were seeing. <br>\r\n<br>\r\n\"Whoa!\" Jackson exclaimed. \"Guys it worked! It really freakin' worked!\" <br>\r\n<br>\r\n\"We're so big!\" Braxton yelled, standing up to his feet.<br>\r\n<br>\r\nEli hadn't said anything yet, still sitting down in total shock. When he went to move, he felt something crumble beneath his jeans.<br>\r\n<br>\r\nLooking down, he immediately jumped up to his feet, crushing the neighbor's car and part of their driveway beneath his foot.<br>\r\n<br>\r\n\"Uh... Braxton...\" he said softly. <br>\r\n<br>\r\nTurning around, the giant boy looked down at what his friend was talking about. His entire house was destroyed, obliterated beneath his now-gigantic best bud's rear.<br>\r\n<br>\r\n\"My house!\" Braxton said. <br>\r\n<br>\r\n\"I'm sorry dude! I didn't meant to I promise!\" Eli said, placing a hand on his buddy's shoulder. <br>\r\n<br>\r\n\"It's okay dude... At least nobody was home.\" <br>\r\n<br>\r\nMeanwhile, Jackson had taken an interest in his own home across the street. Squatting down, he peered through the windows. He snickered at how tiny all of his stuff is now. Standing back up to his full height, he raised a foot and stomped down through the center of his former home. It crumbled to splinters beneath his heavy tread. Twisting his foot back and forth, he giggled happily at how easily he could destroy the once-big house.<br>\r\n<br>\r\nTurning back to his friends, he asked...</span></div></div>",
            "created":1574367360,
            "id":2749799,
            "title":"Ten minutes later..."
        },
        "132312":{
            "author_id":"arthurweston",
            "author_name":"arthur",
            "choices":[
                "The beach.",
                "The city.",
                "Explore the neighborhood."
            ],
            "content":"<div class=\"\"><div> <span>\"So guys, where should we go first? I <i>really</i> wanna go check out the beach.\" Jackson said.<br>\r\n<br>\r\n\"Are you sure about this dude? Braxton's house is gone, you just crushed <i>your own</i> house...\" Eli trailed off.<br>\r\n<br>\r\n\"Why are you always the downer, Eli? Think about it guys! None of that stuff matters anymore. We're giants! Gods! Everybody at our feet bows to <i>us</i> now, get it?\" Jackson rambled. <br>\r\n<br>\r\nEli and Braxton looked at each other for a moment before smiling back at Jackson.<br>\r\n<br>\r\n\"That's what I like to see!\" The black-haired boy exclaimed, clapping his hands together. \"Now, where to?\"</span></div></div>",
            "created":1574435220,
            "id":2750215,
            "title":"\"Should we go to the beach or the city?\""
        },
        "132313":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Follow Jackson's story",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>The three boys were all standing at 200 feet tall. Many people rushed outside of their homes and were gawking at these giant kids. Eli smiled at the tiny people at his feet. “Now we’re giant and we can do anything we want” said Jackson. This comment sent many tiny people running in panic. Braxton asked if his friends wanted to go to the school to have fun. Jackson told his friends to go but he wanted to get some more of the growth serum. Braxton and Eli walked off to the school while Jackson started walking to his dad’s work.<br>\r\n<br>\r\nEli and Braxton walked up to their school. They sat down with their feet on either side of the school so everyone was trapped. Together the two ripped the roof off the school and saw everyone still in their classrooms. They both reached in and grabbed one of the terrified students. “So Max and Noah, we are through with your bullying and now it is time for your comeuppance” said Eli. The two bullies just starred at the giants speechless. Then Braxton smiled as a new idea came to mind. He pulled out the waist of his pants and diaper and dropped Max inside. He laughed as Max was squirming inside and told Eli to do the same. Eli smiled as he dropped Noah into his diaper. “Still think our diapers are so funny” yelled Braxton to the others in the school.<br>\r\n<br>\r\nThis sent everybody in the school into a panic. The two giant boys just started grabbing handfuls of people and dropping them into their diapers. They laughed as they felt the people squirming in their diapers. Then they both felt familiar pressures inside their bodies. Both of them stood up and squatted above the school. Both of them started peeing into their diapers. Their captives were desperately trying to swim, but it was no use and all in the front drowned. They both ripped a fart making those in the back groan. Then a large log poked out of their butts making their captives panic. They pushed several more logs into their diapers and killed everyone inside. They sat down and crushed the school and everybody inside their diapers and just laughed.<br>\r\n<br>\r\nThey both stood up and smiled as they looked at the crushed school. Eli looked over at his friend and held his nose. “You stink man”, he said in kind of joking manner. Braxton gave him a friendly shove. “You’re not so fresh either man.” They noticed Jackson several blocks over doing his own thing. They started walking over to him so he could help them get their diapers changed.<br>\r\n</span></div></div>",
            "created":1583262900,
            "id":2796136,
            "title":"\"You guys wanna go to the school?\""
        },
        "1323131":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Reader's Choice",
                "Reader's Choice",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Jackson walked up to his dad’s work and ripped off the roof. He told everyone inside to show him where the growth serum was being held. At first, the small people were just staring at him terrified. He told them that they would live if they gave him the serum. A few ran to a large safe and opened it. They took dozens of vials out and Jackson put them all into his pockets.<br>\r\n<br>\r\nTrue to his word, he walked away without causing any further damage. He walked over to a Walmart and grabbed some diaper changing supplies and some frilly baby girl dresses. Then he walked over to a two story house down the street from his own. This is the house of James Smith who is the star athlete at Jackson’s school and the school bully. He constantly made fun of Jackson and his friends, especially after finding out about the diapers. Jackson sat down and ripped the roof off and saw James and his 4 friends, Brad, Seth, Adam, and Benjamin that are constantly by his side.<br>\r\n<br>\r\n“Still think you guys can kick my ass.” The boys started pleading with Jackson saying they would be his slaves if he let them live. Jackson liked the idea of his former bullies being his slaves. He told the bullies to strip and put these on as he took the diapers and dresses out of his pocket and put them inside the house. He took a vial of growth serum out of his pocket and put a drop on the diapers and dresses. They grew to the proper size for the bullies and Jackson put it back in his pocket. They were too terrified to disobey. After getting dressed they noticed the dresses still left the diapers exposed. Jackson then grabbed all 5 bullies in his hands. He stood up and sat down on the house which completely crushed the building. He smiled at the terrified bugs in his hands and put them down on the front lawn.<br>\r\n<br>\r\nHe told the bullies that his feet were sore and that they should get rubbing. They quickly ran to his feet and got to work. A few minutes later James and Seth needed to go to the bathroom. They knew that Jackson had them all in diapers for a reason. They relaxed and first both of them flooded their diaper with warm piss. Then they pushed a few logs out into their diapers. Their other friends quickly noticed their diapers sagging and backed away from them holding their noses. Jackson saw this and picked them up. “Awe, did wittle babies make a stinky in their diapees.” He looked at the other boys and told them to change James’s and Seth’s diapers. He looked at Adam and told him to continue rubbing his feet.<br>\r\n<br>\r\nJackson put the boys in his hand back on the ground. Jackson grabbed a package of diapers, wipes, powder and a growth vial from his pocket. Brad and Ben, grabbed a diaper and Jackson put a drop of the diapers so they would grow to fit James and Seth. Brad decided to change James and told Ben to help Seth. James and Seth lay down for a diaper change. Brad and Ben slid James and Seth’s dresses up. They undid the tapes and used the diapers to clean their friends as best they could. They finished cleaning them with a few wipes. They put the used wipes in the dirty diaper and slid them out and set them aside. They slid the clean diapers beneath their friends and taped the diapers up. James and Seth got up and their dresses slid back down.<br>\r\n<br>\r\nNo sooner had Brad and Ben finished changing their friends, Eli and Braxton arrived. They told Jackson that they needed their diapers changed. Jackson smiled at the bullies and told them to change his friend’s diapers. Eli and Braxton took their pants off, exposing their massive full diapers, and set them down on the ground. Eli and Braxton lay down on separate sides of the street and crushed several houses. Jackson grabbed a couple diapers from the previous package and grew them to size for Eli and Braxton. Jackson also grabbed a couple fire trucks from a nearby fire station. The five tinies undid the tapes on Eli’s diaper then on Braxton’s. They gagged at the sight and smell of the full diapers. They used the fire trucks to clean the human waste and remains from the kids. Jackson removed the used diapers, slid the clean ones beneath his friends, and velcroed the diapers in place. Eli and Braxton got up and put their pants back on. Eli grabbed the 5 tinies and put them in his pocket for safe keeping. The three kids looked around the city at the fun they could have next.<br>\r\n</span></div></div>",
            "created":1583263140,
            "id":2796137,
            "title":"Follow Jackson's story"
        },
        "14":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Toddler (2-5)",
                "Child (6-12)",
                "Teen (13-18)",
                "Adult (18+)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How old are the giantesses?</span></div></span></div>",
            "created":1557172560,
            "id":2656004,
            "title":"Multiple Giantesses (females)"
        },
        "15":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Straight (Loves opposite Sex)",
                "Gay (Guy loves another guy)",
                "Lesbian (Woman loves another women)",
                "Bisexual (Loves either same or opposite sex)",
                "Family option (Could be of same of opposite sex)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is the couple Straight, Gay, Lesbian, or Bisexual.</span></div></span></div>",
            "created":1557118800,
            "id":2655996,
            "title":"Couple"
        },
        "151":{
            "author_id":"1354bobby",
            "author_name":"giantharry",
            "choices":[
                "Rampage",
                "Have a feast",
                "Create a new story"
            ],
            "content":"<div class=\"\"><div> <span>Roy and Ruth seemed to be an average couple. They were both 25 years old and had been married for 2 years. They had been dating for 6 years before that. Roy had brown hair and blue eyes, he was 6 foot 4inches tall and very muscular from his job as a personal trainer. Ruth had blond hair and green eyes, she was about 6 foot 2 inches tall. She was very muscular as well and had breasts like a supermodel. Nobody knew that this couple were diaper lovers and constantly wore diapers when at home.<br>\r\n<br>\r\nIt began one day when Ruth was cooking chicken for dinner. It turns out this chicken had some experimental additives to boost flavor and nutrition. After they ate dinner, they sat down to watch TV together. Soon they began to feel strange and began growing. Their clothes were growing with them. When they finished, they were both standing at 200 feet tall. A couple homes had been destroyed along with their own. They smiled at the people gawking at them. Neither thought they needed clothes anymore and started stripping down until both of them were only wearing their diapers. Roy’s diaper was white with skulls printed on it and Ruth’s was pink with unicorns and princesses on it.<br>\r\n<br>\r\nPeople panicked and started running from these giants. Roy stepped on nearby house and laughed as it collapsed. Ruth also stepped on a building and laughed. The two started walking around and crushing buildings with their bare feet. Soon Ruth found a group of several dozen people. These people were begging for their lives. Ruth just smiled and lifted her foot above them which made them panic. She lowered her foot and trapped several people beneath it. She added pressure until she felt them crush into red paste. She laughed and crushed a few more with another step. She kept going until all of them were squished beneath her foot.<br>\r\n<br>\r\nWhile this was going on, Roy just continued crushing houses. When he was done, he walked over to his wife just as she was finishing of the last few victims. He looked at the gore on the street and smiled. “Did you have fun honey” he asked jokingly. Ruth just smiled and nodded her head. With the neighborhood destroyed, the giants started walking towards downtown. They each walked up to a building that reached their abdomens. They peaked over the buildings at the terrified people in the streets. Dozens in the buildings were looking at massive diaper. They both stepped forward and smashed through the buildings and the people began running away in panic.<br>\r\n<br>\r\nThe two giants felt nature calling and walked to another building. They told everyone to get out before they destroyed the building. People began running out in mass panic. Roy and Ruth scooped them up and shoved them into their diapers. When they each had dozens trapped inside, they ripped the building to shreds. They both walked over to their own 50 foot building and ripped off the roofs. The people inside just looked up as the giants sat down on the buildings. First they started peeing and the people inside their diapers desperately tried to swim in pee but they all drowned. Both Roy and Ruth looked into the diaper and smiled at the dead bodies inside. The diapers sagged a few feet into the building. The buildings groaned and crumbled to the ground. There was a crunch as most people inside the diapers were squished. The two giants squished around in their wet diapers, squishing any of the bodies that were left.<br>\r\n<br>\r\nThe two giants laughed as they caused death and destruction with a wet diaper. They stood back up and let their diapers sag several feet. They patted the seats of their diapers. They enjoyed the warm feeling of their blood stained diapers. They looked down at a group of little bugs and smiled. These people started running in a mass panic. The two giants started chasing after them, leaving footprints in the street. Ruth turned down a different street and walked until she passed them. She pushed a building into the street in front of them so they were trapped. She told Roy to crush them with his feet. Roy smiled and placed his foot on several little bugs. He added pressure until they popped like grapes. He started to stomp on the trapped bugs until they were all red mush on the concrete and Roy’s sole.<br>\r\n<br>\r\nThey noticed a couple nearby buildings that were about half their height and smiled. Roy walked up to one of the buildings and Ruth walked to the other. They ripped off the roofs and smiled at the terrified people inside. Most were staring into their eyes but a few were staring at their diapers. Both of them noticed this and placed a foot on either side of their building crushing the buildings that were there. Ruth shouted out, “Watch this” to Roy. She lowered her diaper onto the building and proceeded to gradually crush the building 1 floor at a time with her crotch until her diapered butt met the pavement. Roy’s dick was getting hard in his diaper watching his wife crush a building with her crotch. He quickly crushed his building with his diaper and then got up. He quickly walked over to Ruth who was still sitting amongst rubble.<br>\r\n<br>\r\nShe noticed that his dick was hard in his diaper. She smiled, stood up, and planted a long kiss on Roy’s lips as she cupped his diaper. After a few minutes of making out, she pulled out and gave Roy a sexy smile. “Let’s give these bugs a show” she said as she walked down the street a bit. She walked to a store and ripped off the roof and smiled at the terrified people inside. She got down on her hands and knees and shook her ass in a sexy fashion in Roy’s direction. He walked over to his sexy wife and ripped a hole in his diaper and let his hard dick spring out. He proceeded to rip a hole in her diaper.<br>\r\n<br>\r\nHe proceeded to ram his dick into his wife’s pussy. Ruth moaned as she was penetrated. Roy slowly retracted part of it, and thrust it back inside of her. This made Ruth scream even louder. Her breasts were swinging above the store as they fucked. Roy kept humping her, faster and faster, until he had established a steady rhythm. The fucking felt like it was never going to end. All the time the people were listening to Ruth scream dirty talk. <br>\r\n<br>\r\n“Oh, yeah! Such a nice big cock, fucking my pussy! Fuck yeah baby! That’s it! Oh yeah, don't stop fucking me baby! Oh, fuck! Oh, God! Yes Roy that feels so fucking awesome! You’re fucking my pussy real good! Oh yes, keep going baby! Oh, God, Ram that monster into my pussy! Oh, Jesus, you’re fucking that pussy deep! Oh yes cum into my pussy! Fill my fucking pussy with your gravy! FUCK, FUCK, FUCK!” Dozens around were watching as these giants fucked doggy style. The air was filled with the sound of their moans and crinkling diapers. Roy started humping her harder and faster. He started moaning that he was close to climax and Ruth told him to cum into her pussy. With a final moan, Roy unloaded gallons of seed into Ruth’s pussy. When he was finally spent, Ruth collapsed onto the store and crushed it. Roy fell on top of her and they ley there panting in their ecstasy. There was still plenty of fun for this giant couple to have once they got their breath back.</span></div></div>",
            "created":1572637200,
            "id":2741073,
            "title":"The Story of Ruth and Roy"
        }
    },
    "info":{
        "author_id":"1354bobby",
        "author_name":"giantharry",
        "brief_description":"People in diapers grow big.",
        "created":1557171360,
        "description":"<td align=\"left\" class=\"norm\">All giants have to wear diapers and the diapers grow with them. Why they wear diapers can be up to you and other clothing is optional.<br>\r\n<br>\r\nGiants can be male or female.<br>\r\n<br>\r\nThe age of the giants can be anything from 2 years old until adulthood.<br>\r\n<br>\r\nThere can be multiple giants.<br>\r\n<br>\r\nThe heights can range from 100 until 500 ft.<br>\r\n<br>\r\nAfter growing the giants can either act like toddlers or like their age.<br>\r\n<br>\r\nGiants can be straight, gay, lesbian, or bisexual.<br>\r\n               If you choose straight, gay, or lesbian all people who grow have to be the same sexual orientation.<br>\r\n<br>\r\nSex is okay but not involving anybody under 18 years old.<br>\r\n<br>\r\nThere is no length requirement, but please add chapters with content. Except for the first few choice chapters the set the storyline, write chapters with a few sentences.<br>\r\n<br>\r\nYou can have giants rampage, crush, vore, use diapers, basically anything goes that doesn't violate the above rules.<br>\r\n<br>\r\nI reserve the right to edit or delete chapters that violate the rules.</td>",
        "id":2190248,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1583263140,
        "modified":1583263140,
        "pretty_title":"Giants in Diapers"
    }
}