{
    "chapters":{
        "1":{
            "author_id":"grennd",
            "author_name":"Grennd",
            "choices":[
                "A scientist",
                "A magical individual",
                "A magical artifact",
                "It just happens",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>It was early afternoon in an idyllic neighborhood. The weather was warm, with just enough wind to make it pleasant. Except that something is strange about today: somebody, or perhaps multiple somebodies, is going to have an experience with age regression.<br>\r\n<br>\r\nHow does it happen?</span></div></div>",
            "created":1086498000,
            "id":201915,
            "title":"It Begins"
        },
        "11":{
            "author_id":"grennd",
            "author_name":"Grennd",
            "choices":[
                "The cute sorority girl",
                "The well-tanned beach boy",
                "The elderly couple",
                "Himself",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Dr. Augustus was a curious scientist, in either definition of the word. He was indeed strange, and indeed had a curiousity about the world. He was especially interested in the way humans aged, and wished to somehow control this process.<br>\r\n<br>\r\nA couple years ago, he got his wish. After striking his head on what he regarded as a particularly stupidly-placed wall, he had an epiphany. He understood how he could construct a device to manipulate the ages of living creatures. Taking two years off his job at a pharmaceuticals company, he ferverishly worked on this device, and now he had completed it.<br>\r\n<br>\r\nIt was a monstrously bulky contraption, full of exposed wires and mysterious blinking lights. It had a range of controls, which only Augustus knew did exactly what. Augustus walked out of his garage, eager to test this device on someone. He would have volunteered himself, but he didn't completely trust this device yet.<br>\r\n<br>\r\nWho does he pick for his first subject?</span></div></div>",
            "created":1086498000,
            "id":201916,
            "title":"Enter Augustus"
        },
        "112":{
            "author_id":"grennd",
            "author_name":"Grennd",
            "choices":[
                "His girlfriend's",
                "Elsewhere"
            ],
            "content":"<div class=\"\"><div> <span>Marcus sauntered down the street, feeling on top of the world. At twenty, he was quite attractive, featuring a well-proportioned face, muscled body, and a luxurious tan. He was wearing a faded pair of jeans, a tight-fitting white shirt, and a pair of sunglasses he thought made him look rather sharp. He knew he was irresistable, he saw the hot college girl checking him out as he passed by her on the sidewalk. Unfortunately for her, his affections belonged to another. But that isn't important right now.<br>\r\n<br>\r\nRunning his hands through his thick, windswept hair, Marcus moved his hand down to check on his stubble. He had been trying to grow it out to achieve a certain look, and was a little agitated to note that it hadn't thickened at all today. On top of that, his shirt didn't seem to be pressing up against his pectorals as much as he was used to. He straightened the shirt out a bit, hoping that would fix it.<br>\r\n<br>\r\nWhat Marcus didn't notice while he was busy fooling with his shirt was that his stubble was not growing like he hoped, but fading away. It vanished almost completely in the course of a few moment's walk, leaving a faint fuzz on his lip and chin. He also didn't notice his clothing growing looser as he waltzed down the street.<br>\r\n<br>\r\n\"Grr...\" Marcus growled as he lifted up his pants. They had begun to slip down as he walked, which was unusual. As he looked down to see what the problem was, his glasses slipped down the bridge of his nose. He angrily shoved them back up, and continued walking.<br>\r\n<br>\r\nMarcus's shirt was in no way tight-fitting now, as all the muscles that used to inhabit it had shrunken to their sixteen-year-old size. His pants continued to slip down his legs, and his sunglasses also had difficulty finding purchase on his rapidly dematuring face.<br>\r\n<br>\r\n\"Wha...\" Marcus said, observing the slackened nature of his shirt. He went to feel the shirt, and finally noticed his thinned physique. He snapped his gaze down so fast his glasses were flung off his face, but he caught them before they hit the ground. What he saw frightened him. He saw a shirt, moments ago tight-fitting on his muscular frame, hanging sadly on his skinny fourteen-year-old frame.<br>\r\n<br>\r\nMarcus yelped, his voice slipping to a high pitch at the end of the yelp. He had shortened noticeably by now, the legs of his pants were bunched up at his feet. Having been sliding down his legs for a few moments, Marcus's pants finally fell completely off, revealing smooth shins. Alarmed, Marcus tried to back up, as if that would save him from this horror. He only succeeded in completely stepping out of his too-large sandals, losing his balance and falling on his behind.<br>\r\n<br>\r\nContinuing to youthen, Marcus quickly slipped past puberty while sitting on the ground, shocked. His limbs thinned, his face regained a boyish appearance, leaving him a skinny little kid sitting on the sidewalk pathetically.<br>\r\n<br>\r\nBut the process wasn't yet finished. He shrunk even more, heading into early gradeschool years. His cheeks fattened, leaving him a truly childish look. His overlarge shirt washed over him, becoming like a giant tent over his youthful frame.<br>\r\n<br>\r\nSoon it was over. Marcus was left a child, five years old at most, sitting on his old shirt like a picnic blanket, wearing only the swimming trunks he had underneath his pants. He stood up unsteadily, holding his shorts (which now fit him like pants). Looking around unsurely, he soon took off running, crying at a childish pitch.<br>\r\n<br>\r\nDr. Augustus looked at the weeping child, who had a minute ago been a confident young man. He then looked to the bulky device in his hands and smiled. He would have fun with this later, but first the child...<br>\r\n<br>\r\nWhere does little Marcus run?</span></div></div>",
            "created":1086498000,
            "id":201963,
            "title":"Marcus: Experiment One"
        },
        "1122":{
            "author_name":"Entropic",
            "choices":[
                "Transferral",
                "Regress to Infancy"
            ],
            "content":"<div class=\"\"><div> <span>No one took much notice of the bare-foot little boy with the baggy pants as he ran down the street as if his life depended upon it. \"High-spirits\" they said to themselves, chuckling at the cute kid before continuing on their way. Only Dr. Augustus knew the truth, and he certainly wasn't going to point out that the lad's pants were so baggy he had to hold them up.<br>\r\n<br>\r\nHis vision blurred with tears of humiliation, and unused to the new perspective with which he now viewed the world, little Marcus very nearly crashed into several people. Augustus, keen to observe his little experiment, followed at a casual pace - how far could a lost little boy get? Marcus didn't care if you got anywhere, he merely pounded down the side-walk with yelps of despair. His little sprint came to an end, however, as he attempted to dash around the corner at the end of the street. His small body slammed hard into a massive, seemingly immovable object, and he fell hard onto his rear.<br>\r\n<br>\r\n\"Ah, hey...careful there, little guy!\" The dark-haired young man exclaimed, reaching down to help the sniffling Marcus up onto his shaky feet. In the fall, Marcus's hands had jerked out of their grip on his shorts, and as he was pulled up his shorts stayed down. He was so preoccupied with rubbing his stinging backside he hardly noticed he was totally exposed before this stranger, and the fact his eyes were instinctively filling with tears didn't help.<br>\r\n<br>\r\n\"Aw, don't cry!\" said the stranger gently, trying to sooth the little boy. The fact that the child appeared to be very inadequately clothed raised a few red flags in the teen's mind, but he didn't like seeing a kid distressed. He gingerly pulled the shorts up from Marcus' ankles, first checking to make sure no one was watching; he didn't want to be accused of some kind of molestation.<br>\r\n<br>\r\n\"Shh, shh...\" he intoned, trying to figure out why the kid was running around without his parents and wearing a pair of shorts that came up past his belly-button. As if to solve the problem, Marcus reached to clutch a hold of the excess fabric, holding the shorts up for himself - they still drooped down past his knees. He gave a pronounced sniffle, rubbing his eyes clumsily with his free hand in an attempt to stifle the sobs. Looking up - way up - at this giant stranger, Marcus's eyes widened through his tears, and his mouth dropped open, <br>\r\n<br>\r\n\"T..Tom?\" Marcus stammered, before he realised what he was saying. The teen arched an eye-brow, staring down at the child before him with suspicison.<br>\r\n<br>\r\n\"Hey...how do you know my name, kid?\" He quickly cast a look around again, wondering if this was some kind of set-up.<br>\r\n<br>\r\n\"I...I...\" spluttered Marcus, really not wanting to admit to this guy, one of his work colleagues, that he had been turned into a little boy and managed to forget his clothes. \"MOMMY!\" he bawled at the top of his little lungs.<br>\r\n<br>\r\n\"Hey, hey, take it easy!\" hissed Tom, reaching out to clamp a hand over Marcus's mouth. A second later he realised what he was doing and jerked his hand away, stepping backward. \"Who are you?\" he demanded, sternly. Marcus just stood there, staring at Tom like a rabbit caught in headlights, panting a little from his outburst.<br>\r\n<br>\r\nThankfully, only one person had been on hand to witness this scene - a certain Dr. Augustus. Watching the interactions intently, the scientist felt that it would be beneficial to experiment a little more with the unwieldy device in his hands - test the parameters, so to speak. Aiming it at the pair, he pressed a different button:</span></div></div>",
            "created":1095656400,
            "id":217368,
            "title":"Observing the Effect"
        },
        "11221":{
            "author_name":"Entropic",
            "choices":[
                "Marcus takes pity on Tom",
                "Marcus takes Tom's clothes"
            ],
            "content":"<div class=\"\"><div> <span>A faint glow enveloped the young man and the young boy, and, in their heightened state of suspicion, both of them noticed it.<br>\r\n<br>\r\n\"Who are you?\" demanded Tom once more, with a greater force. Marcus just stood whimpering, fighting back the urge to break down into childish wailing.<br>\r\n<br>\r\n\"Answer me!\" Tom bellowed. Marcus's lower lip wobbled dangerously, indicating an imminent tantrum. Tom sighed, taking his intent gaze of the poor little guy as his mind raced to think off a way to avert that eventuality.<br>\r\n<br>\r\n\"Look,\" Tom said softly, smiling a little. \"Why don't you tell me your name, and maybe we can find your mommy, okay...?\" Marcus's lip was still trembling, although he forced his lips into a little pout.<br>\r\n<br>\r\n\"...my mommy said I had to meet her,\" he finally piped up, wondering if he could trick Tom into leaving him alone.<br>\r\n<br>\r\n\"Yeah, little guy?\" Tom said, reaching up to rub his chin; and odd sensation was buzzing through his face, like pins and needles, which he put it down to the fearful adrenaline rush invoked by this situation. Strangely, something actually felt physically wrong with his chin as his hand brushed over it - the stubble that usually covered it felt wrong, somehow, sort of...finer. Softer. It irritated Tom, and he wrenched his hand away to focus on the situation.<br>\r\n<br>\r\n\"Okay then, where did you mommy say you had to meet her?\" Marcus churned internally, just wanting Tom to scram. However, he also felt strangely nauseaous...kind of like the feeling he had experienced a short while before. The realisation hit him like a brick - he must be getting younger again!<br>\r\n<br>\r\n\"...NO!\" he suddenly screamed, pushing at Tom's leg and darting past him at an impressive pace.<br>\r\n<br>\r\n\"Hey!\" yelled Tom, turning to jog after him, but as he did so he realised more than just his facial hair was different - his whole body was tingling now, and looking down at himself he saw some odd changes. His usually tight-fitting T-shirt hung loosely across his chest, and his black cargo-shorts felt strangely loose. His feet no longer felt snug in his boots - his heels no longer felt the usual pressure, and his toes seemed to have a great deal more freedom.<br>\r\n<br>\r\n\"Come back!\" he called after the fleeing child, reaching up to feel his chin again - the hairs, now soft and fine had also become sparser, and shorter. In fact, his chin was largely devoid of hair, as if he had shaved it perfectly, and only the area below his nose felt vaguely mature.<br>\r\n<br>\r\nMarcus, on the other hand, was experiencing some very different changes. As he ran, on thin little legs, a strange feeling overtook him  - each step seemed more powerful, each stride longer. The posters on the wall he was passing were also moving more and more into his line of vision. He pounded on still, although he was rapidly becoming aware that he wasn't growing younger - he was growing older. He clutched tightly to his shorts as he slowed to a jog, panting. Looking down at himself he saw that he was holding his shorts up above his belly-button, but they now hung to knee-level, not below. A wave of excited relief ran through him as he realised he was regaining his maturity. His body proportions rapidly changed as he approached puberty once more, his shorts finally able to hang - although still loosely - on his hips with no support. His chubby limbs became firmer and longer, his feet becoming thinner and longer as they crept outward as he watched.<br>\r\n<br>\r\nMarcus had slowed to a walk as he watched the changes, and finally ground to a halt to watch with joy as he reclaimed his age. Suddenly, he remembered Tom, and span around to see if he had kept up. His joy turned into a mixed fear as he surveyed the scene in front of him.<br>\r\n<br>\r\n\"Wait, kid!\" screeched Tom, his voice cracking horribly. He looked like a young-teen now, no longer the well-built stranger Marcus had slammed into minutes before. The sleeves of his T-shirt were past his elbows, no longer tight-fitting and visibly sagging beneath his arms. Beneath his shirt Tom felt more changes taking place - his chest was collapsing into itself, the hair that covered it sinking back into his skin and disappearing as he grew younger and younger. The hair beneath his armpits likewise retracted, as did the hair on his shins - shins that were gradually being obscured by shorts that sank ever lower. His shoulders narrowed and his arms became scrawny as he was dragged back across the threshold of puberty, becoming just a 10-year-old boy. His facial hair was no more; a smooth-cheeked wild-eyed youth stared in absolute horror at Marcus.<br>\r\n<br>\r\n\"M...marcus?\" Tom squeaked, finally, recognising his colleague...and forced to look up at him. By now, Marcus had just re-entered puberty, hair sprouting across his whole body. His torso expanded, returning his lost muscles and masculinity. His shorts now sat properly on his waist, and his face had recaptured its fine, manly features. He looked down at the rapidly regressing Tom, torn between grinning and looking concerned.<br>\r\n<br>\r\n\"Yeah...that's right, Tom,\" Marcus said softly, as Tom's regression gradually slowed. His shorts lost all hold on his diminished waist, sliding down to sit atop his boots. Tom stared down at them, his mind reeling. He hastily stepped out of the shorts, as if he had the idea that is clothes were the cause of his regression. He stumbled out of his adult boots, his bare-feet slamming down on the hot concrete. His boxer shorts slithered down his smooth legs - he watched them in terror. His whole life, his masculinity, his very worth was all just slithering from his body. He was now just five-years old, his shirt reaching down to his knees and covering the palms of his hands. He crouched down, clutching desperately at his boxers.<br>\r\n<br>\r\n\"Help me!\" he pleaded, staring up Marcus with impossibly large eyes set beneath a mop of light-brown hair and above the cutest little button nose. Marcus stared back with sharp features, a blank face and lips slightly parted.</span></div></div>",
            "created":1095656400,
            "id":217373,
            "title":"Tom: Experiment Two"
        },
        "112211":{
            "author_name":"Gamble",
            "choices":[
                "The scientist returns Tom to his adult state.",
                "The scientist regresses Mark again by mistake, and Tom panicks."
            ],
            "content":"<div class=\"\"><div> <span>Shocked and humiliated from a sudden return to kindergarten age, confused by the sheer impossibility of the situation and terrified of what Marcus might do to him now, Tom just sunk into his clothes with growing tears in his eyes and cried, \"Help me!\"<br>\r\n<br>\r\nAt first it looked like Marcus would just shake his head, steal the clothes and walk off... or worse, that he might humiliate him further. But as young Tom sat lying in a massive pile of his own clothes, helpless as his immaculate five-year-old body suggested and waiting for his fate to be decided, Marcus said, \"All right.\"<br>\r\n<br>\r\n* * *<br>\r\n<br>\r\nStanding at a safe range, Dr. Augustus watched as Mark extended a hand in Tom's support. Neither of them were aware of why this had happened or whether or not it would stop, yet Mark's courage was admirable. The last thing the scientist would have done in his place would be to HELP the seemingly infectious victim of an age regression, not knowing whether or not he'd end up in the same state again. Maybe it was time for a little leniency.<br>\r\n<br>\r\nBut as he primed the device, both males rounded the next corner... out of range.<br>\r\n<br>\r\n* * *<br>\r\n<br>\r\nTom had a hand clutched to Mark's as though his life depended on it, while the other held up the massive T-shirt. Mark himself had slipped into Tom's underwear... not a pleasant option, but the only one available nonetheless. As he strode through the streets and entered the beach area with Tom in an all-out run just behind, people started to take notice, turn and stare.<br>\r\n<br>\r\nThe fact that Tom was opening up the waterworks didn't help. Mark imagined what it would look like to see a grown man dressed only in underwear half-dragging a cute, crying little boy with a comically oversized shirt through the streets. They needed to get somewhere safe before he was arrested.<br>\r\n<br>\r\n\"I don' understand,\" Tom said through a sniff. \"How'd it happen? What'd you do?\"<br>\r\n<br>\r\n\"Look, I don't know, but I want to get to a restroom or something,\" Mark said. \"You need some clothes.\"<br>\r\n<br>\r\nLooking across the two-metre-high stone wall blocking the streets from the beach, he spotted a public toilet. \"There.\"<br>\r\n<br>\r\nTom still had no idea what was going on. He managed to gather from his new perspective, the pitch of his voice and Mark's previous predicament, that he was young. Very young. A helpless child with a smooth, hairless face and the big frightened eyes to match. Lost in a world of adults. Without Mark he wouldn't last a second, so his little body clung to an instinct of survival and held on as they hurried towards the restrooms.<br>\r\n<br>\r\nIf the crowd thought Mark and young Tom had been a strange sight to be, they weren't ready for the stereotypically dressed scientist who came bolting after them, wheeling his mechanism along as best he could.<br>\r\n<br>\r\n* * *<br>\r\n<br>\r\nMark got his first dash of luck outside the changing rooms. The pair of boy's pants lying draped against a pole were a little big, but they'd at least fit Tom better. He checked to ensure no one was watching (most eyes were trained on the latest spectacle to hit the street) and swiped them, ushering the child with him into the restrooms.<br>\r\n<br>\r\nAs humiliating as it was for Tom's previously attractive form to be able to fit into these kid's pants, he was glad that at least he wasn't wearing the giant shirt now lying discarded beside him. Finally pausing for a rest, he even got to examine the situation. It was bizarre - almost amusing - to note just how small he'd become. His bare chest led down to a cute pair of jeans and feet fresh from running in the sand. To anyone else he looked like a typical five-year-old kid enjoying a day at the beach.<br>\r\n<br>\r\nWhat if, unlike Mark, he was stuck like this?<br>\r\n<br>\r\nTom couldn't bare the thought. The idea of losing his maturity, charm and history all in one fell swoop, trading it for this adorable little five-year-old's body with nothing to attract but the smiles of much older women, was too much.<br>\r\n<br>\r\nBeside him, Mark had finished putting on Tom's clothes. \"You okay?\" There didn't seem to be anyone else to hear them.<br>\r\n<br>\r\nTom felt the intolerable tears produced from a body longing for any form of conflict coming on again. \"I'm scared, Mark.\"<br>\r\n<br>\r\n\"Listen,\" he replied, \"it's okay. Same thing happened to me and it just wore off after five minutes. You'll be fine.\"<br>\r\n<br>\r\n\"But it's been five minutes!\" Tom surprised himself with the desperate whining sound of his new voice. \"What if I don't change back?\"<br>\r\n<br>\r\nMark didn't have a whole lot to say to that and in the end, didn't have to say anything. Outside they heard someone panting, and a huge computer device rolled on out, followed by a balding, fat man in a dirty lab coat.</span></div></div>",
            "created":1114923600,
            "id":247835,
            "title":"Generosity Is The Best Defense"
        },
        "1122111":{
            "author_id":"seraphnordelf",
            "author_name":"Seraph",
            "choices":[
                "Marcus is aged to 27",
                "Marcus is regressed to 13"
            ],
            "content":"<div class=\"\"><div> <span>\"Who are you?\" asked Marcus. He exchanged a look with Tom. This balding, overweight man in a dirty old lab coat's appearance seemed to bring more sense into the situation. His appearance so soon after Tom and Marcus had entered the restroom couldn't be a coincidence. <br>\r\n<br>\r\n\"What?\" asked the Doctor, \"oh, you mean me. Yes, I'll explain that in a moment. First things first, however.\" This weird man had some sort of bulky contraption that looked like a plastic x-ray machine from the '60s... on wheels. He aimed the machine at Tom and then fiddled with some dials before a bright light emitted from the machine. Marcus didn't feel the now familiar pins and needles sensation he'd felt before both growing down and growing up, so he sighed a bit in relief. He did, however, take note of Tom, who had now obviously been the target of this odd device.<br>\r\n<br>\r\nTom already looked 7 or 8 now, a massive grin growing ever wider as he grew. His pants were terribly high watered as he'd already grown a number of inches in height. He took on a leaner, longer appearance as he approached ten years old. His legs and arms were longer, thinner, and a bit lanky. Baby fat disappeared entirely as he grew. His face grew longer, more defined, and less chubby. His pants must've been incredibly uncomfortable and they started to rip, unable to take Tom's growing legs and hips. They began ripping at the seams and Tom, now about 11, was blushing at this altercation. He tried to hold up the tattered ruined pants over his private parts as the pants ripped off. Twelve year old Tom was beginning to enter puberty. Skinny, long arms, legs, and chest all continued to grow, his height inching upward a bit faster. Soon he was about 14, his voice would start cracking and get deeper if he spoke. Light fuzz was beginning to appear on the growing teenager's lip and then chin. He was beginning to fill out and by 16 was budding quite a physique. His fuzz turned to proper stubble, getting longer and thicker as he aged. He continued to grow taller more slowly now and grew more muscular as he did. Soon he was back at 20 years old, where he'd started. He was Marcus's height once more, or thereabouts, and he had a strong, muscular body to rival his co-worker. His short, moderately thick beard was back to the way it was, a source of some jealous to Marcus.<br>\r\n<br>\r\nTom looked around, holding onto the shattered ruins of the pants that had once fit his much smaller self a matter of minutes ago. He looked at the crazy man who'd done this accusingly. \"Who are you?\" he asked, his voice returned to it's proper grown man's baritone.<br>\r\n<br>\r\n\"Here,\" said Doctor Augustus. He tossed the two men the various clothing each had dropped, humorously giving Marcus the rest of Tom's clothes and Tom the rest of Marcus's clothes. \"You dropped these,\" he said, taking a moment to wipe his bald head of sweat. \"Go and change and I'll explain.\"<br>\r\n<br>\r\nThe two 20-year-olds sighed and went into two adjacent bathroom stalls. They tossed each other their proper clothing, Tom had to deal with the fact that Marcus had worn his clothes. \"My name is Doctor Augustus,\" said the Doctor to the two young men, \"you both have just taken part in an experiment of my latest creation, a device capable of aging or de-aging the subject at will. I... uh... haven't come up with a name for it quite yet. I'm pleased to say that it works well, however.\"<br>\r\n<br>\r\n\"So you decided to test this thing out on two unsuspecting, innocent young men on the street not even knowing if it worked or not?\" asked Marcus. He came out of the stall, fully dressed in his previous wardrobe, and outraged. \"You could've left us as freaking kindergarteners! You monster!\" He started coming towards the Doctor.<br>\r\n<br>\r\nDoctor Augustus held the machine between him and Marcus, \"Don't take that tone with me, young man,\" he said, \"or you'll be in diapers before your friend there gets fully dressed in the stall. I did what was necessary to further science. Aren't you glad you didn't get stuck at 5 years old?\"<br>\r\n<br>\r\nMarcus eyed the old fart angrily. Tom got out of the other stall and faced the Doctor. Doctor Augustus continued, \"I was going to reward the two of you for your trouble, if you like.\"<br>\r\n<br>\r\n\"With what?\" asked Marcus.<br>\r\n<br>\r\n\"My machine, of course. Is there any requested age you'd want to be, either older or younger, that my machine can make you?\" asked the Doctor.<br>\r\n<br>\r\n\"No thanks,\" said Tom, \"I want no part in this crap any more. Let me out of here.\"<br>\r\n<br>\r\n\"Just a minute,\" said the Doctor, aiming the device at Tom, who gulped at the thought of being any younger than he was now again.<br>\r\n<br>\r\nMarcus had been looking at himself in the mirror. He liked his big, muscular self... but that stubble. It still wasn't growing out a lot. He couldn't grow a decent beard yet, even at 20 years old, which made him jealous of his co-worker. He reckoned he wasn't even done growing yet, either. \"Well, Doc... I'd like to be a little more mature, if you don't mind. Unlike last time, I think I might volunteer for a little aging.\"<br>\r\n<br>\r\nThe Doctor, eager to see his device at work once more, was delighted, \"Very well, my boy! Just stand there, like that.\"<br>\r\n<br>\r\n\"I want no part in this, scoot over, Doc,\" said Tom, positioning himself behind the Doctor so there wouldn't be a possible way for him to get hit by the infernal contraption.</span></div></div>",
            "created":1381813200,
            "id":1679471,
            "title":"Generosity Can Save One's Bottom"
        },
        "11221111":{
            "author_id":"seraphnordelf",
            "author_name":"Seraph",
            "choices":[
                "He wants to see himself at 35.",
                "It's a bit much for him, he wants to be 20 again."
            ],
            "content":"<div class=\"\"><div> <span>The beam hit Marcus once more and he felt the usual pins and needles feel again. He felt his body stretch and grow in more subtle ways now. He was still getting bigger, though. His muscles swelled a moderate bit as he matured through his twenties. His stubble grew thicker and longer until it was a full short beard like Tom's. He got a decent bit taller too, surprising himself by gaining 3 or 4 inches in height. At last he stood before the mirror at 27 years old. His pecs and biceps made his shirt seem a little small. His jeans were a little tight and small and his sandals looked a bit too small for his feet. He was stronger and more mature now than he was at 20.</span></div></div>",
            "created":1381813200,
            "id":1679472,
            "title":"Experiment One: Trial Three"
        },
        "112211111":{
            "author_id":"seraphnordelf",
            "author_name":"Seraph",
            "choices":[
                "He wants to be even older",
                "He decides that's enough and to be changed back to 20"
            ],
            "content":"<div class=\"\"><div> <span>\"This is cool, Doc,\" said Marcus, his voice a little deeper and more mature, \"can you keep going?\"<br>\r\n<br>\r\n\"Really, Marcus? Really?\" asked Tom, wanting to leave.<br>\r\n<br>\r\n\"You're just jealous,\" laughed Marcus.<br>\r\n<br>\r\n\"Certainly, I can make you older still, Marcus,\" said the Doctor, aiming his machine again.<br>\r\n<br>\r\nAnd again the light hit Marcus. He couldn't decide if he was beginning to enjoy the pin and needle sensation on his body or not. He didn't have much time to ponder, however, as he felt himself mature. It wasn't the drastic feeling of growing upwards from a little boy through puberty until 20, but the subtleties were just as apparent. At 35 he stopped. He seemed a little more muscular and didn't yet show any signs of aging. His beard was a bit thicker. Marcus seemed to have a feel about him, he felt like a mature grown man, not quite so young any more. It was fascinating to see what was in store for Marcus in 15 years. He realized he wouldn't quite let himself go and would be just as much the hunk in 15 years as he was now, if not more. </span></div></div>",
            "created":1381813200,
            "id":1679475,
            "title":"Experiment One continues..."
        },
        "1122111111":{
            "author_id":"seraphnordelf",
            "author_name":"Seraph",
            "choices":[
                "Marcus decides that that's enough, he wants to be young again",
                "Marcus wants to be even older..."
            ],
            "content":"<div class=\"\"><div> <span>\"Can you make me even older?\" asked Marcus. His voice was a tad deeper even, taking on a tone that would be described as fatherly, calm.<br>\r\n<br>\r\n\"Marcus, what the hell are you doing?\" asked Tom, \"you've already lost 15 years of your life, dude!\"<br>\r\n<br>\r\n\"C'mon, you can't blame my curiosity,\" said Marcus, \"besides, I'll get most of it back in a minute. You gotta admit this is pretty damn awesome.\"<br>\r\n<br>\r\n\"I can age you further, Experiment One... I mean, Marcus... So sorry,\" Augustus blushed. He pushed a few dials and the beam hit Marcus another time.<br>\r\n<br>\r\nAgain, Marcus felt the strange sensation. He watched himself age in the mirror before his very eyes! As the years passed and Marcus became middle aged, he saw the first signs of aging on his face. His eyes started wrinkling with crow's feet just a bit, his face hardened a lot from his previously youthful smooth features. He was even starting to go grey. The grey hairs multiplied on his mustache. His temples were grey and spreading when he stopped. He was 45 now, but still a heavily muscular man. He was still well toned and his muscles were massive as ever. It seemed he wouldn't ever let himself go, despite growing old. He had to be one of the best looking middle aged men on Earth, he counted himself somewhat lucky that he'd spent most of his life (now at 45) as a handsome man, growing from a young innocent man to a mature, strong, wise looking fellow in the span of 25 years.</span></div></div>",
            "created":1381813200,
            "id":1679479,
            "title":"Continue, Experiment One..."
        },
        "11221111111":{
            "author_id":"seraphnordelf",
            "author_name":"Seraph",
            "choices":[
                "20 years old",
                "25 years old"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay, that's enough,\" said Marcus, his voice deep, calm, and sounding identical to his father's. \"It's good to know I'm not going to let myself go, but I'd really rather be younger again.\"<br>\r\n<br>\r\n\"You should think of yourself as lucky, Marcus,\" said Augustus, \"I myself am 45 and I would kill to be in as good a shape as you are.\"<br>\r\n<br>\r\n\"And not bald either, I'd bet?\" chuckled Marcus, still with a full head of hair.<br>\r\n<br>\r\n\"That's beyond my control,\" Augustus lamented, \"for now, at least... Anyway, how much younger did you want to be?\"</span></div></div>",
            "created":1381813200,
            "id":1679480,
            "title":"Young again, please"
        },
        "112211111112":{
            "author_id":"seraphnordelf",
            "author_name":"Seraph",
            "choices":[
                "\"No, let's get out of here!\"",
                "\"Sure, I guess it's not so bad.\""
            ],
            "content":"<div class=\"\"><div> <span>\"25's fine,\" said Marcus.<br>\r\n<br>\r\n\"Very well,\" said Augustus. <br>\r\n<br>\r\nOnce more, Marcus felt the tingling sensation and he knew he was growing younger. The grey hair disappeared and he noticed only now that a little bit of a widow's peak had formed on his forehead as he put a hand through his hair. The hair that had slowly fallen out over 20 years was beginning to replenish itself. Marcus's face firmed up a bit, wrinkles disappeared. His heavy set middle aged features loosened a bit and he took on a younger appearance in the face. At last, he was 25, 5 years older than he was before. He still was a few inches taller than himself at 20, quite a bit more muscular, his voice a little deeper, a nice full beard on his chin and neck. He was a matured, grown man, but a young man. He was pleased with this.<br>\r\n<br>\r\n\"So, Tom,\" said Marcus, \"you want to try the Doc's machine?\"</span></div></div>",
            "created":1381813200,
            "id":1679482,
            "title":"25 year old Marcus"
        },
        "1122111111121":{
            "author_id":"seraphnordelf",
            "author_name":"Seraph",
            "choices":[
                "He will now try it on himself",
                "He'll look for someone else to try it on"
            ],
            "content":"<div class=\"\"><div> <span>\"No thank you,\" said Tom finally. He turned to Doctor Augustus, \"Will you let us go now?\"<br>\r\n<br>\r\nAugustus sighed, \"Fine, have it your way now.\"<br>\r\n<br>\r\n\"You're lucky we don't go to the police with what you've done to us!\" cried Tom.<br>\r\n<br>\r\n\"At least I've been kind, haven't I?\" asked the Doctor.<br>\r\n<br>\r\n\"Kind?!\" cried Tom, \"you experimented on us against our will! You turned me into a little boy all for stopping to help a crying little boy who happened to be my co-worker who'd been turned into a little boy himself not more than a moment before! I call that torture, you mad scientist!\"<br>\r\n<br>\r\n\"Please,\" said the Doctor, \"if I were only out to hurt you I would've left the both of you as crying babies in the middle of the road, hoping that a truck might run you over. Look at you, you're fine, back to your 20 year old self. That's generous, in my book.\"<br>\r\n<br>\r\n\"Look, Tom,\" said Marcus, the now older man approaching his co-worker, \"let's just go. We got to be a kid again for a moment and then were changed back and now we're all the wiser for it. I know my girlfriend's going to love the older me,\" he chuckled.<br>\r\n<br>\r\nTom sighed, \"Let's just get away from here,\" he said. He left the restroom at that with not so much as a goodbye.<br>\r\n<br>\r\n\"Thanks, Doc,\" said Marcus, \"for everything.\" He shook the Doctor's hand, \"Don't mind Tom...\"<br>\r\n<br>\r\n\"Not to worry, my boy,\" said the Doctor. He examined his first experiment carefully, \"will you be alright?\"<br>\r\n<br>\r\n\"Me?\" asked Marcus, \"I'm fine. Don't worry, I can still say I'm 20, right? It's only a 5 year difference, no problem.\"<br>\r\n<br>\r\n\"Very well then, have fun,\" said the Doctor.<br>\r\n<br>\r\n\"Bye, Doc,\" said Marcus. He walked out of the restroom, once again feeling on top of the world with his now bigger, stronger self.<br>\r\n<br>\r\nThe Doctor sighed with relief. \"Finally those fools are out of my hair,\" he said out loud to himself. He chuckled, \"Oh yes, very funny, Augustus.\" He felt his bald scalp. He sighed again, \"Well, now that I know this works...\"</span></div></div>",
            "created":1381813200,
            "id":1679485,
            "title":"Tom and Marcus take their leave"
        },
        "11221111111211":{
            "author_id":"seraphnordelf",
            "author_name":"Seraph",
            "choices":[
                "He stops regressing at 18",
                "His regression continues"
            ],
            "content":"<div class=\"\"><div> <span>Doctor Augustus looked at himself in the mirror. At 45 he looked much older. \"Well, time to give myself a break now, hmmm?\" he said to himself. He turned the machine on himself and zapped. He felt the sensation he'd only witnessed in other people prior. The hair on his head repopulated his scalp. His mustache hairs grew brown once more and grey also faded from his head. Wrinkles diminished as the Doctor took note that his big, portly stomach began to deflate. He was in his 30's once more. The bald spot on his head was getting smaller and smaller. His mustache grew shorter. His muscles grew firmer as his fat grew sparse.<br>\r\n<br>\r\nHe was in his 20's again. His head was full of hair again, his mustache becoming short. He was once again skinny, no ounce of flab penetrated him as he grew younger into his early twenties. He wasn't exactly a muscular fellow, more along the lines of a lanky thin young man. He was 20 again, a young, anemically thin man with a small thinly bristled mustache. \"Hmm, perhaps I should get out more and work on these muscles...\" he pondered, taking note of the higher pitched and slightly nervous tone his voice had taken.</span></div></div>",
            "created":1381813200,
            "id":1679487,
            "title":"Let's not let ourselves go."
        },
        "112211111112111":{
            "author_id":"seraphnordelf",
            "author_name":"Seraph",
            "choices":[
                "See if the machine can make him into a hunk",
                "Test the machine out on somebody else..."
            ],
            "content":"<div class=\"\"><div> <span>His age stopped at 18. He was only guessing based on how he set his dials, of course. He didn't have a counter or anything ticking off the years, unfortunately. But he definitely looked 18. He was tall, only an inch or so shorter than his final height, and terribly thin. His face was a bit boyish and he didn't need his glasses at all. His mustache had disappeared and Augustus recalled he'd been a late bloomer of sorts. He envied Tom and Marcus a bit, they were young adults but they were well built hunks. Augustus was, for lack of a better term, a pip-squeak (a tall pip-squeak, but still thus). \"I still look better than I did before,\" he concluded to himself as he stared in the mirror, despite the fact that he still wore the now baggy, dirty, and smelly shirt, trousers, and lab coat of a much older and much fatter man. \"Alas, muscles grow in the right environment,\" he said to himself, \"now I have time to build all that up and so forth... And lay off the fattening food too.\" He sniffed himself and found the odor of his clothing to be disgusting for the first time in a while. \"Goodness, how did I live with <i>that</i>?\"<br>\r\n<br>\r\nHe sighed, feeling a bit of the old teen apathy and attitude set in (a bit of which to his delight). He decided what to do next...</span></div></div>",
            "created":1381813200,
            "id":1679488,
            "title":"18 year old scientist"
        },
        "1122111111121111":{
            "author_id":"nana2015",
            "author_name":"Derek Robson",
            "choices":[
                "IT DOES",
                "Augustus becomes a 10 year old"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>'Maybe I can make myself more hunkier with the machine...' he thought.</span></div></span></div>",
            "created":1480157460,
            "id":2242053,
            "title":"See if the machine can make him into a hunk"
        },
        "1122112":{
            "author_name":"Gamble",
            "content":"<div class=\"\"><div> <span>Marcus stared at the nutter, assessing the situation. Here he was wearing someone else's underwear and T-shirt, with the owner now a five-year-old who relied on him not to get lost on the beach. And now, this bolding, oddly man blocking the exit with a computer that looked like it belonged back early in the last century.<br>\r\n<br>\r\nThis was getting weirder by the minute.<br>\r\n<br>\r\nDr. Augustus was sweating from wheeling the machine across the beach, which didn't do much to add to the smell of paint and burned acids all over his lab coat.<br>\r\n<br>\r\nMark was already nervous from the thought of suddenly getting younger again, and the 'scientist' only helped to further his suspicions. If ANYONE was responsible for today's events, it'd be him.<br>\r\n<br>\r\n\"Who are you?\" he asked.<br>\r\n<br>\r\n\"What?\" Augustus puffed, halfway through taking another breath. \"Oh. Me. Well never mind that...\" His fingers tapped furiously as he configured the controls to get Tom back to his default age, all the while wondering why he was putting so much on the line for a bunch of kids he didn't even know.<br>\r\n<br>\r\n\"Hey,\" Mark said, taking a step towards him. \"Step away from that thing.\"<br>\r\n<br>\r\n\"Got it!\" Augustus said, and Mark felt that familiar pins-and-needles feeling run all over his body. Next to him, Tom only needed a quick glance to certify he was getting younger again. A slight drop in height, shrinking of hair all over his legs and face...<br>\r\n<br>\r\nAugustus was just starting to notice that not only did he have the wrong target, but somehow he'd screwed up the settings, when the panicked young boy Mark was escorting barged into the machine.<br>\r\n<br>\r\nHad it been stationary, Tom would've been too light to harm the machine. He was only just over a metre tall with almost no effective muscles and twenty kilograms of weight to back him off... but in a panicked flurry, and with wheels attached to the machine, he managed to nudge it and set it on its course.<br>\r\n<br>\r\nAugustus watched it tip over the edge of the wall blocking off the beach, hit the sand below and shatter. The product of two year's work and a possible cure for ALL diseases worldwide was wasted in a single second. He stared down to see the machine in ruins.<br>\r\n<br>\r\nBehind him, Marcus was just leaving puberty again. His facial hair was gone to reveal a fine, smooth chin. Once again his clothes had become too large for him and they draped over like a cape, then a tent as he shrunk further. Within seconds he found himself right back where he'd been before; a five-year-old dressed in a T-shirt that almost covered his entire fragile body.<br>\r\n<br>\r\nTom was looking over the massive cliff wall, realising the purpose of the machine and the enormity of his mistake. Understanding he must be stuck this way now, tears formed in his eyes while his lips trembled. His old life was over.<br>\r\n<br>\r\n\"Er... there, there,\" Augustus said, patting him on the back. The situation was awkward - he'd just lost the greatest invention known to man, and now he had to comfort the two children who really had to cope with it. \"If it consoles either of you two, I found you and you didn't get lost. Now if you just give me their numbers, I can phone your parents and have you back with them in no time...\"<br>\r\n<br>\r\nMark took a look around him. The restroom was enormous. Sinks and showers loomed before him, impossible to reach. The entire world seemed to zone around him, like he was trapped in the corner of a massive room, crouching down. Except he wasn't crouching - this was as tall as he stood now. Because he was five years old a third time, and this time, stuck that way unless the professor wanted to dedicate another two years of his life fixing that machine.<br>\r\n<br>\r\nIn the meantime, attending kindergarten with Tom was going to be a major pain.</span></div></div>",
            "created":1115096400,
            "id":248233,
            "title":"Disaster Strikes Again"
        },
        "114":{
            "author_id":"grennd",
            "author_name":"Grennd",
            "choices":[
                "The regression stops",
                "Something goes wrong"
            ],
            "content":"<div class=\"\"><div> <span>After scanning the street for a few minutes and not seeing anybody walk down it, the doctor elected to test the device on himself. <br>\r\n<br>\r\n\"What is the worst that could happen?\" He said to himself. Talking to oneself is a habit of those who live in seclusion. Augustus hit a button on his remote control, and the door to his garage shuddered down to its closed position with a grinding noise that he found pleasing. Augustus often pretended he was in a high-tech laboratory, surrounded by swirling vats of serum and dangerous-looking Jacob's ladders, rather than in his garage surrounded by dried-stuck tubs of paint and faulty electrical outlets.<br>\r\n<br>\r\nAugustus carefully calibrated the controls of his creation, not willing to take any chances. After about five minutes of work, he considered his work satisfactory. He set the device down on a rickety table, took a quick breath, and activated it.<br>\r\n<br>\r\nThe forty-five year old doctor had set the device to return him to twenty years of age. He didn't feel anything as the device's processes changed him, but he could see its effects.<br>\r\n<br>\r\nAugustus's noticeable belly started to become less noticeable, affording the old shirt stretched over it some relief. Hair sprouted on his balding head, while his liverspots faded away. All over his body, fat disappeared while the underlying muscle became firmer. The thick white mustache on his face turned back to its old brown, then started thinning to a younger style.<br>\r\n<br>\r\nAugustus readjusted his belt, as his slacks were slipping down his waist. A few moments afterward, he had to adjust it again. A youthful glow came back to the doctor's skin. His belly entirely departed, leaving his abdomen flat. His wrinkled face tightened back up, changing it into the handsome visage of a twenty-something.<br>\r\n<br>\r\nSoon the doctor was twenty again: a young, attractive man in a shirt for a man much larger than him, and with his glasses slipping down his face. He removed the glasses and saw that he didn't need them as much anymore. Then he tightened his belt again.<br>\r\n<br>\r\nNow what happens?</span></div></div>",
            "created":1098766800,
            "id":222809,
            "title":"Augustus the Youthful"
        },
        "1141":{
            "author_name":"Gamble",
            "content":"<div class=\"\"><div> <span>Dr. Augustus paused for a moment, almost expecting something to go wrong. With such a machine, it was almost expected. He had visions of himself continuing to shrink, perhaps even into babyhood, but he instead remained a twenty-year-old man.<br>\r\n<br>\r\nTo ensure the device could continue the aging process, he punched a few digits into the device and aimed at himself again.<br>\r\n<br>\r\nHe watched as he grow older again. Black hair started to silver while his gut expanded underneath him. He heard a ping as his belt buckle burst and shot to the other end of the room. White hair shrunk into his head again, leaving only a small cliff of it running around the back, surrounding his shining bald scalp.<br>\r\n<br>\r\nAugustus sighed as he stared at his forty-five-year-old self in the mirror. The device worked, allowing him prolonged life among all the rest. Furthermore, once he won a few awards with it and it attracted attention, he would become rich and famous.<br>\r\n<br>\r\nAnd over the period of the next few months, that's exactly what happened. Dr. Augustus (now a handsome man of twenty again) found himself on a stage in front of a crowd of thousands, shaking hands with the representative of a health company as he handed over the device for the billions of dollars to ensue from it. Further study allowed it to be reproduced.<br>\r\n<br>\r\nPatients with any critical illnesses could be regressed slightly in order to avoid it. The elderly and middle-aged could relive the better times of their old lives for as long as they wanted. Retrophiles all around the world were finally satisfied!<br>\r\n<br>\r\nTruly a HORRIBLE ending! Having taken the safe way out, you ensured that there was only ONE scene of regression/progression throughout the ENTIRE story!<br>\r\n<br>\r\nNext time, please choose more wisely.</span></div></div>",
            "created":1115096400,
            "id":248220,
            "title":"Dr. Augustus Succeeds"
        },
        "1142":{
            "author_id":"nana2015",
            "author_name":"Derek Robson",
            "choices":[
                "he turns into a age-regressing supervillain",
                "he gets younger by the minute",
                "he regresses to a 10 year old boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>omg something went wrong!<br>\r\n<br>\r\nbut...<br>\r\n<br>\r\nwhat was it.</span></div></span></div>",
            "created":1476971460,
            "id":2226031,
            "title":"Something goes wrong"
        },
        "11421":{
            "author_id":"nana2015",
            "author_name":"Derek Robson",
            "content":"<div class=\"\"><div> <span>Dr. Augustus paused for a moment, almost expecting something to go wrong. With such a machine, it was almost expected. He had visions of himself continuing to shrink, perhaps even into babyhood, but he instead remained a twenty-year-old man.<br>\r\n<br>\r\nSUDDNELY!<br>\r\n<br>\r\nHis clothes began to change into a dark purple spandex jumpsuit, complete with white underpants, pink gloves, and black leather boots. a mask formed on his eyes, and his personality changed.<br>\r\n<br>\r\n\"Mu-ha-ha-ha-ha-haaaaa!\" he cackled evilly. \"All part of my plans! Dr Augustus is no more! From now on, I am... The Regressor!\"<br>\r\n<br>\r\nThe symbol appeared - a white minus symbol in a red diamond, on his chest.<br>\r\n<br>\r\n\"Attention, townsfolk,\" he boomed. \"I am now The Regressor, and I rule your town now! Anyone who objects me....\"<br>\r\n<br>\r\nhe zapped some citizens of the crowd, regressing them to babyhood.<br>\r\n<br>\r\n\"They will be babies! I rule this town now! I will turn everyone on the whole planet to babies! This is WHO I AM! \"Mu-ha-ha-ha-ha-haaaaa!\" he cackled evilly.<br>\r\n<br>\r\n<i>'And so The Regressor engulfed the world with his foul regressing powers.'<br>\r\n'For everyone in the world, and the whole planet too, it was...'</i></span></div></div>",
            "created":1493056860,
            "id":2310052,
            "title":"he turns into a age-regressing supervillain"
        },
        "11422":{
            "author_id":"nana2015",
            "author_name":"Derek Robson",
            "choices":[
                "he regresses to teen age"
            ],
            "content":"<div class=\"\"><div> <span>Dr. Augustus paused for a moment, almost expecting something to go wrong. With such a machine, it was almost expected. <br>\r\n<br>\r\nSuddenly, he felt himself losing weight. He noticed from the device that his current age was now...<br>\r\n<br>\r\n\"19?\" he exclaimed.<br>\r\n<br>\r\nThen he saw it counting down, one month at a time, one drop per minute.<br>\r\n<br>\r\n\"GAH!\" He screamed. \"I'm getting younger by the minute!\"</span></div></div>",
            "created":1480087740,
            "id":2241639,
            "title":"he gets younger by the minute"
        },
        "114221":{
            "author_id":"nana2015",
            "author_name":"Derek Robson",
            "choices":[
                "he regresses to a 10 year old boy",
                "he turns back to normal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Augustus regressed younger and younger till he reached 13 years old.</span></div></span></div>",
            "created":1480087920,
            "id":2241642,
            "title":"he regresses to teen age"
        },
        "1142211":{
            "author_id":"nana2015",
            "author_name":"Derek Robson",
            "choices":[
                "he regressed to babyhood",
                "he turns back to normal"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Upon regressing to 10 years old, his pants fell down.<br>\r\n<br>\r\nHis huge shirt now completely dwarfed his naked boy body.</span></div></span></div>",
            "created":1481795340,
            "id":2250220,
            "title":"he regresses to a 10 year old boy"
        },
        "11422111":{
            "author_id":"nana2015",
            "author_name":"Derek Robson",
            "choices":[
                "Augustus regresses "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Augustus regressed to a 2 year old baby, and crawled around his huge lab.</span></div></span></div>",
            "created":1481795520,
            "id":2250221,
            "title":"he regressed to babyhood"
        },
        "114221111":{
            "author_id":"nana2015",
            "author_name":"Derek Robson",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Augustus regressed till he became a fetus, then, a fertilized egg, then... <i><b>POOF.</b></i> he vanished out of existence!<br>\r\n<br>\r\n<span class=\"clred\"><font class=\"size5\" style=\"\"><u><b>DEATH BY REGRESSION!</b></u></font></span></span></div></span></div>",
            "created":1481795640,
            "id":2250223,
            "title":"DEATH BY REGRESSION!"
        },
        "11423":{
            "author_id":"nana2015",
            "author_name":"Derek Robson",
            "choices":[
                "Augustus looks at the machine",
                "Augustus's brain changes"
            ],
            "content":"<div class=\"\"><div> <span>Dr. Augustus paused for a moment, almost expecting something to go wrong. With such a machine, it was almost expected. With such a machine, it was almost expected. He had visions of himself continuing to shrink, perhaps even into babyhood, but he instead remained a twenty-year-old man.<br>\r\n<br>\r\nTo ensure the device could continue the aging process, he punched a few digits into the device and aimed at himself again.<br>\r\n<br>\r\nBUT! Instead of growing, he started shrinking!<br>\r\n<br>\r\nHe realized his mistake; he wasn't getting older: he was getting <b>younger</b>!<br>\r\n<br>\r\n\"GAH!\" He screamed, his voice cracking. \"I-I feel weird!\" he shrunk down to 15 years old.<br>\r\n<br>\r\nThen, down to 10 years old. \"Oh my!\" he said.<br>\r\nUpon regressing to 10 years old, his pants fell down.<br>\r\n<br>\r\nHis huge shirt now completely dwarfed his naked boy body.</span></div></div>",
            "created":1503920100,
            "id":2376010,
            "title":"he regresses to a 10 year old boy"
        },
        "12":{
            "choices":[
                "They found a magical spellbook",
                "Made a wish",
                "Born with the gift",
                "A curse",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>There is someone who has the power to control age. How did they obtain this ability?</span></div></span></div>",
            "created":1086584400,
            "id":202346,
            "title":"Magical Individual"
        },
        "122":{
            "author_id":"jonathan_davis",
            "author_name":"Jonathan",
            "choices":[
                "He goes to sleep but accidently changes his age",
                "Someone knocked on the door"
            ],
            "content":"<div class=\"\"><div> <span>Henry was a 10 year old boy with scruffy brown hair. He is 5 feet 7 inches and he has hazel eyes. As our adventurer was going through the woods, he found a lamp. It looked like the ones from those genie movies. He gave it a good rub and blue smoke slowly came out of the bottle. <br>\r\n<br>\r\nThe smoke created a silhouette of a man. <br>\r\n<br>\r\n\"Who has awakened me from my slumber?\" He asked in a booming voice.<br>\r\n<br>\r\n\"I did. So are you a genie that grants wishes?\" Henry asked.<br>\r\n<br>\r\nThe genie got lower to reach eye level with henry. <br>\r\n<br>\r\n\"Listen kid. I'll grant you one wish, but that can't be more wishes. Got it?\" He asked.<br>\r\n<br>\r\nHenry nodded his head in responce.<br>\r\n<br>\r\n\"What is your wish?\"<br>\r\n<br>\r\n<br>\r\n15 years later<br>\r\n<br>\r\n<br>\r\n<br>\r\nA man in a full black outfit was running from the cops. He had a gym back filled with something. Henry had no choice to run into the alleyway. It was small enough for 2 people to stand next to each other and still have room. <br>\r\n<br>\r\nHe took a sharp turn to the left and snapped his fingers. He started to slowly go from a run to a walk. Some cops came out of the alleyway and looked around, but they couldn't find 25 year old henry. The only people they can see is a business man and a kid in his sports uniform. The kid had a gym bag the same color of Henry's robbing bag.<br>\r\n<br>\r\n\"Let's go check that kid's bag for the money.\" A officer said.<br>\r\n<br>\r\n\"That's a kid Roberts, and that bag brand is very popular with the athletic kids.\" Another officer said, \"let's look in the alleyway for any hiding spots he may be in.<br>\r\n<br>\r\nThe two officers ran back and out of sight of 10 year old henry.<br>\r\n<br>\r\nHenry snapped his fingers again and he returned back to his normal age. He got home and he threw the bag on the floor. He laid on the couch and decided to relax.<br>\r\n<br>\r\n\"Having the power to change my age and clothing can tire a man out.\" He said.</span></div></div>",
            "created":1508504280,
            "id":2403842,
            "title":"Made a wish"
        },
        "1221":{
            "author_id":"jonathan_davis",
            "author_name":"Jonathan",
            "choices":[
                "Stay 5",
                "Return back to 25"
            ],
            "content":"<div class=\"\"><div> <span>Henry decided to take a small nap. He layed back in his recliner and went to sleep. When he awoke, he felt very warm. It was as if he had a blanket on him. <br>\r\n<br>\r\nWhen he opened his eyes, he saw that his clothes were as big as a blanket. He moved around and attempted to get out of the chair. He struggled, but he did get out. <br>\r\n<br>\r\nHe stood there naked trying to look around for his emergency change stash. He went into the guest room and looked in the closet. He found sole clothes for someone his size. Suddenly he stopped moving<br>\r\n<br>\r\n\"I could stay 5, or I can just go ahead and return back to my normal age</span></div></div>",
            "created":1508676240,
            "id":2404834,
            "title":"He goes to sleep but accidently changes his age"
        },
        "1222":{
            "author_id":"jonathan_davis",
            "author_name":"Jonathan",
            "choices":[
                "Heads",
                "Tails"
            ],
            "content":"<div class=\"\"><div> <span>Henry got up and looked through the peephole in the door. It was his \"work\" buddy Jared. He opened the door and Jared welcomed himself with rage.<br>\r\n<br>\r\n\"Why didn't you tell us you were doing another job?\" He asked.<br>\r\n<br>\r\n\"Because I needed money fast.\" Henry said<br>\r\n<br>\r\n\"We had a full on plan. Just because you have magical powers don't mean shit. It's either we all work or youre out.\" He said.<br>\r\n<br>\r\n\"Fine, just calm down. What was your plan?\"<br>\r\n<br>\r\n\"Do you promiss to work with us?\"<br>\r\n<br>\r\n\"Yea, anything for money.\"<br>\r\n<br>\r\nJared pulled up the blueprints of a bank on his phone. He pointed out two places; the daycare and the janitor closet.<br>\r\n<br>\r\n\"Ok so what we were thinking is that you can apply for a job as a janitor, then sneak us in when it's late at night.\"<br>\r\n<br>\r\n\"That is a horrible idea. There are guards late at night at that bank.\"<br>\r\n<br>\r\n\"Fine what's your idea Mr. Magic?\"<br>\r\n<br>\r\n\"We get one of the guys to get the janitor job, but they will leave their \"son\" in the daycare till it starts to get late. That is when I will climb through the vents that lead into the vault. That is when I take the money and get out.\" <br>\r\n<br>\r\n\"Your plan is just about you again.\" <br>\r\n<br>\r\n\"Both of your plans are trash, but we need to choose one.\" Someone at the door said.<br>\r\n<br>\r\nHenry turned over and saw his other work friend Gary. <br>\r\n<br>\r\n\"So how are we going to decide?\"<br>\r\n<br>\r\n\"Flip a coin. Heads for going to the daycare, tails for becoming janitors.\"<br>\r\n<br>\r\nGary pulled out a coin and flipped it. He grabbed it mid air and turned it. It landed on</span></div></div>",
            "created":1508653560,
            "id":2404760,
            "title":"Someone knocked on the door"
        },
        "123":{
            "author_id":"grennd",
            "author_name":"Grennd",
            "choices":[
                "A pair of brothers",
                "Some snobby females"
            ],
            "content":"<div class=\"\"><div> <span>A woman quickly strided down the sidewalk, looking for something. If there was something nearby, she'd know about it. Her name was Hellen, and she was a psychic. Not the variety of psychic that can tell the future (she could do that too, to a tee), but the kind that could read minds, control minds, and a bit more. She preferred to think of herself as a \"mentalist\".<br>\r\n<br>\r\nHellen had an attractive body, but her stern face and severe mannerisms deflected most male attention (that, and her powers had something to do with it). She was dressed in a swishing black trenchcoat, high-heeled boots, and she wore an elaborate necklace around her neck. She had long, shiny hair, which was unusual in the fact that it was a distinctive silver-white color.<br>\r\n<br>\r\nHaving worked on and abused her prodigious powers for a long time now, Hellen had gotten quite good at it. Having peeked into her share of minds, she noticed a tendency of people who knew her (if only loosely) to refer to her inwardly as \"Helle\". She thought this was quite appropriate, and liked to call herself that.<br>\r\n<br>\r\nAs said before, Helle had become quite powerful with her gift, and now had made a breakthrough. Previously she could only control minds, but she had discovered a way to shape the bodies of others, if only in a limited fashion. The one facet of a person's body she now knew how to change was a person's age. <br>\r\n<br>\r\nHelle notices a presence, what is it?</span></div></div>",
            "created":1086670800,
            "id":202230,
            "title":"Hellish Hellen"
        },
        "1231":{
            "author_id":"grennd",
            "author_name":"Grennd",
            "choices":[
                "Turns the tables back on Budd",
                "Nothing, or regresses Bill some more"
            ],
            "content":"<div class=\"\"><div> <span>Reaching her mind out to investigate this presence, Helle found it was in fact two presences. It was a pair of males, apparantly brothers. One was quite older than the other, and Helle grinned devilishly to herself. She entered a secluded alley and stretched her senses to the brothers. It was time for some fun.<br>\r\n<br>\r\n\"Aww, come on.\" Whined Budd, the younger of the brothers. He was about ten, nearly eleven, had a tangled mop of brown hair, and a charming little face. He was pulling fruitlessly on his brother's sleeve.<br>\r\n<br>\r\nBill, who was walking an expensive-looking bike, looked down at his little brother disdainfully. \"No. You have your own bike to ride.\" The eighteen-year-old said stiffly. He was a thin, tall type, without a lot of muscle on his bones. His longish hair was brown, like his brother's.<br>\r\n<br>\r\n\"But my bike's not here.\" Whined Budd.<br>\r\n<br>\r\n\"Well, you should have thought to bring it.\"<br>\r\n<br>\r\n\"Your bike's a lot cooler than mine! Just let me ride it once!\"<br>\r\n<br>\r\n\"No, not after what happened last time.\"<br>\r\n<br>\r\n\"Come on!\" Budd shouted, trying to wrestle the bike's handlebars from his brother. Bill's face instantly contorted into an angry expression, and he violently tugged Budd's hands off. He gave his brother a quick shove, sending him sprawling onto the street pavement.<br>\r\n<br>\r\nBudd stood up, glaring at his brother. Bill just looked at him coldly. \"One of these days, I'm going to get big, and then I'll beat you up.\"<br>\r\n<br>\r\nBill laughed sardonically. \"Yeah, that's going to happen. And by then, you'll have a pet pig that can fly.\" With that, he grabbed his brother's arm and twisted it behind his back painfully. \"Uncle.\"<br>\r\n<br>\r\n\"No!\" Budd replied, tears forming in his eyes.<br>\r\n<br>\r\n\"Uncle.\" Bill said calmly.<br>\r\n<br>\r\n\"No!\" Budd shrieked. He struggled with his clearly stronger brother for a few moments, then gave up. \"Uncle.\"<br>\r\n<br>\r\nBill gave him a last twist and shoved him forcefullly. Budd looked back with pure venom boiling in his eyes.<br>\r\n<br>\r\nHelle thought this a good time to act.<br>\r\n<br>\r\nIt happened so fast, neither Budd nor Bill remembered the process much. One moment Bill is standing there, sneering tauntingly at his little brother. The next moment Bill begins to shorten, his clothes begin to loosen. His face instantly loses the little mustache he had been trying to grow. He continues to shrink smaller, losing the little telltale signs of maturity as he goes. His shirt billows around him, his pants become baggy and comical. Soon he is a fresh-faced youth exactly Budd's age, looking thoroughly confused.<br>\r\n<br>\r\nThe whole thing happened in less than ten seconds. Budd just watched his brother's eyes sink lower and lower until they were at the same height as his, and then slip downward by a couple inches.<br>\r\n<br>\r\nBill stood there gaping up at his brother, who was advancing towards him. \"Uh...\" He squeaked, appalled at his childish voice. His jeans fell down in a heap at his feet with a rustle.<br>\r\n<br>\r\nBudd grinned, and shoved his shrunken brother with both arms. Bill, shocked, fell down quite hard on his ass. He lost his underpants as he fell, and his bare bottom was scraped painfully on the unforgiving asphalt.<br>\r\n<br>\r\n\"Ow...\" He whined pitifully, struggling to his feet. Almost immediately, Budd pushed him back down again.<br>\r\n<br>\r\n\"See? How do you like it?\" Budd mocked gleefully.<br>\r\n<br>\r\n\"Cut it out!\" Bill pleaded, crawling away backwards. He crawled a distance away from his brother, then stood up. He was a pathetic site; a child dressed in nothing but an adult's sweater, forcing back tears. Budd advanced towards him again, and engaged him in a grapple. Bill, always a slightly built child, was helpless against his brother, even though they were now of the same age. He couldn't even rely on his height, as he was short for his age up until puberty. Budd wrestled him into a position similar to the one Bill had forced on him earlier, with his hand behind his back. <br>\r\n<br>\r\n\"Uncle!\" Budd said savagely.<br>\r\n<br>\r\n\"Uncle!\" Bill repeated.<br>\r\n<br>\r\n\"I want to hear it! Say uncle!<br>\r\n<br>\r\n\"Uncle!\" Bill said, louder.<br>\r\n<br>\r\nBudd was satisfied, and shoved little Bill, who was crying in earnest now, onto the ground.<br>\r\n<br>\r\nHelle thinks about interfering now. What does she do?</span></div></div>",
            "created":1086670800,
            "id":202232,
            "title":"Brotherly Love"
        },
        "12312":{
            "author_id":"grennd",
            "author_name":"Grennd",
            "choices":[
                "Stay tied to the tree",
                "Escape the tree, shedding his shirt"
            ],
            "content":"<div class=\"\"><div> <span>Budd dragged Bill by the hand to a nearby tree. Bill kicked and struggled, but was overpowered by his larger brother. Taking the sleeves of Bill's sweater, he wrapped them around the thick trunk of the tree.<br>\r\n<br>\r\n\"What are you doing?\" Bill asked fearfully.<br>\r\n<br>\r\n\"Tying you to this tree.\" Budd replied simply, tying the ends of his sweater sleeves together in a tight knot. <br>\r\n<br>\r\nBill, who was constricted quite tightly by this, yelled and kicked.<br>\r\n<br>\r\n\"Don't worry, you can get out easy. But that would mean leaving your shirt behind.\" Bill cackled, walking over to Budd's pants and retrieving his wallet. \"And thanks for the money,\" He paused to eye at Bill's bike, which was lying on the street. \"And the bike.\"<br>\r\n<br>\r\n\"No!\" Bill protested, trying to struggle free. He found it was quite difficult unless he left his shirt behind as Budd suggested.<br>\r\n<br>\r\nBudd watched his reduced brother's struggling with amusement, and picked up the clothes he had left behind. He threw them over a nearby, tall picket fence so Bill couldn't get them. He hopped up on the bike and rode off, laughing to himself.<br>\r\n<br>\r\nWhat does Bill do?</span></div></div>",
            "created":1086670800,
            "id":202460,
            "title":"The Tree"
        },
        "123122":{
            "author_name":"Entropic",
            "choices":[
                "Budd has brought one of his friends along",
                "Budd has brought one of Bill's friends along"
            ],
            "content":"<div class=\"\"><div> <span>Bill struggled in vain, but he knew deep down that his little (now physically bigger) brother was right. He eventually stopped struggling and looked around nervously, thankful that nobody appeared to be in the vicinity. The fabric of his sweater brushed against his smooth thighs and backside, making him feel horribly exposed even beneath his covering. Checking once more that no-one was about, he wriggled out of his adult sweater and darted, totally naked, around to the other side of the tree.<br>\r\n<br>\r\nHe paused before the arms of his once well-fitting sweater, tied in a tight knot by his brother. He had subconsciously covered his privates with his hands when he had slipped out of his only article of clothing, and know stood, shivering slightly, before the knot. He peered down at his hands, knowing he would have to reach up and try and undo the knot if he was planning on walking around in something other than his birthday suit. He gingerly raised his hands, revealing his puny genitals. He stared down at his tiny nub of a penis, and felt like bursting into tears - after all, it would be a completely natural action for a little boy that he now clearly was.<br>\r\n<br>\r\nA pathetic, naked little boy - the realisation that that was all he now was struck Bill hard, and he felt like balling his little fists and pounding the tree with all his tiny might. However, he managed to resist that infantile urge and reached up to try and pry the knot apart. His chubby fingers just could not succeed, however, and his brother, fueled by a vindictive revenge, seemed to have tightened the knot with a giant's strength - although, as a small child, Bill sensed that the world around him was suddenly a bigger, scarier place, filled with 'giants'. He finally gave up on the knot, unwanted tears struggling to cascade down his smooth cheeks once more, and turned his attention to the immense picket-fence over which his vengeful brother had tossed his other clothes. Those clothes were his only other chance - his only chance of clinging to some semblance of his swiftly lost maturity.<br>\r\n<br>\r\nTottering over to the fence, Bill winced as his tender, bare feet encountered all manner of tiny stone fragments. Upon reaching the fence, Bill realised it was impossible - there was no way he could ever scale such a height in his present condition. His hands, once again cupped over his private parts, fell away in defeat, as he began to weep softly. Soon his torrent of tears increased to childish sobs and, eventually, the hearty bawl of a distraught little boy. He plopped backward onto his exposed backside and cried his little lungs out.<br>\r\n<br>\r\nHe was crying so hard that he didn't hear the footsteps approaching. It was only until the obnoxious cackle of his brother issued forth, along with a softer laugh, that he realised his tirade had an audience.</span></div></div>",
            "created":1086843600,
            "id":202505,
            "title":"Defeat"
        },
        "1231221":{
            "author_id":"kaskay",
            "author_name":"Kalek",
            "choices":[
                "Make Bill younger",
                "Make Budd Younger as well"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly Bill was hoisted up from the gravel and was starring in the face of one of Budd's friends. His eyes came level to Ben's only due to the fact that Ben was lifting him from under his armpits, which made his hanging feet seemed to confirm to Bill how small he had become. Ben looked at the red eyed, sniveling, boy in front of him and felt sorry for him. Ben was 14, but was Budd's best friend, he also tended to be the more mature of the two and quite often had to fix Budd's mistakes. Bill didn't struggle against this monster force holding him captive, just hung limp in the behemoths grip. Ben turned him over examining the situation and saw the Road Rash on the boy's back side. He had his suspicions about how Budd's now younger brother became hurt but needed to make sure first.<br>\r\n<br>\r\nHe looked Bill in the eye and said in a soothing voice, \"How'd you get the scratches on your back side?\". Bill looked to his brother and shuddered and clung to Ben's chest in fear of answering. Unfortunately this answered the question for Ben and he looked at Budd judgmentally. \"Budd you crossed a line, he may have been your brother but that doesn't give you the right to hurt him. He is younger than you now and you should take care of him. He is so scared of you he'd rather stay with me.\"<br>\r\n<br>\r\nHellen got an idea just then</span></div></div>",
            "created":1272517200,
            "id":875459,
            "title":"Benevolent Ben"
        },
        "12312212":{
            "author_id":"dracter",
            "author_name":"dracter",
            "choices":[
                "To their Parents House, this will be an Interesting story for Mom and Dad",
                "Let's follow them elsewhere"
            ],
            "content":"<div class=\"\"><div> <span>          Helle grinned as the thought formed in her mind. She looked with her mind’s eye at the now regressed boy, no more than nine years old, and at his brother, ten years old and definitely taller. He who had so easily turned on his older brother. It looked as if he definitely wasn’t ready to be a responsible older brother. Budd was now looking down out of shame, away from his regressed brother, and older friend. And as he looked down he was greeted with a shocking sight as the ground was seeming to rise to meet his gaze. It didn’t take long for the startled boy to realize what was happening. <br>\r\nHis clothing grew looser as his limbs retracted, growing shorter, and his height rapidly dropping. <br>\r\n<br>\r\n“HELP ME!” Budd cried, as his voice jumped a little higher, his cargo shorts now pooled around his waist. His shirt reaching his knees even as his underwear slipped off his thinning waist. <br>\r\n<br>\r\n          The other two boys gazed in horror. Ben set Bill down, and the fourteen year old and ten year old watched as Budd continued to shrink, no older than five now, as baby fat began to pool into his limbs, giving him a chubby cherubic appearance. He shrank a little more as his shirt slipped off one shoulder, no more than three years old. Budd felt warmth near his waist and looked down to see that he was wetting his shirt. Seeing this was too much for the now little boy and he began to cry. <br>\r\n<br>\r\n          Bill smirked, “Serves you right you little cry-baby, that’s what you get for tying me to a tree. Helle ground her teeth in annoyance at the once-again-older-brother. Apparently Bill had still not learned his lesson. “Bill, I don’t think you should say that,” Ben said quietly, “If you became little for being mean to Budd, and Budd became littler for being mean to you, you might want to stop while you’re ahead” the older boy added wisely. But it was too late for that.<br>\r\n<br>\r\n“Much too late for that,” Helle thought to herself, grinning like a she-devil. She reached out to Bill, and began to siphon years from him rapidly. The newly-minted nine year old looked at Ben to respond, but his face turned into a mask of horror, as the horribly familiar sensation of shrinking returned to his limbs. Naked and without any form of clothing, the changes that occurred to bill were even more apparent. His minor scraps faded from his skin as he aged backwards, and old scar from a dog bite fading from his ankle. His limbs grew even smaller, his hair finer and blonder, matching his younger brothers as he neared him in height. His stomach began to round outwards into the potbelly of a young child, his cheeks and fingers plumping. And as he stops shrinking he resembles his younger brother so closely, they could almost be twins <br>\r\n<br>\r\n“Nooo, I don wanna be a wittle kid!” Bill lisps even as Budd continues to bawl uncontrollably at their situation. “Hmm, it looks like you two are about two or three years old. There’s a Walmart right around the corner, I can run and grab you guys some clothes, and maybe a stroller too,” Ben said looking down at the two regressed boys. <br>\r\n<br>\r\n“You’re gonna need more dan dat,” Bill said, trying to sound angry, but as his voice is now a falsetto, the effect is not very strong. “Bof of us weren potty twained till we was five. You’re gonna need Diap-Diap-Diapers,” Bill spat fighting his lisp. “Diapers!” A shocked Budd yelled, “I don want diapers, I don wann em, I don wike it!” He yelled becoming even more hysterical as tears continue to stream down his face. Bill’s face which had been screwed up in a three-year old scowl, which only made him seem even younger, softened and he toddled over to his wet and terrified little brother patting him on the shoulder. “Well, it don matter if we wan ‘em or not,” he said, trying to sound brave, “We are jus gonna hafta deal wit it for a wittle bit, I’m sure we can find a way to change back!” He smiles trying to cheer his brother up, finally giving up his anger now that they were both in the same predicament. <br>\r\n“You go an get us somefink to wear, Ben,” Bill told the now-oldest boy, “An we’ll stay wight here waiting for you”<br>\r\n<br>\r\n“Okay, I’ll be right back, it won’t take five minutes,” Ben replied before rushing off. The two brothers sat down together, Budd only just starting to get control of himself again. “What if we’re stuck like this Billy?” Budd asked fearfully. “We’re gonna be fine Buddy,” Bill replied to his younger brother, and hugged him. “I’m sorry for how I tweated you before, it wasn wight for me to do dat. I been a weal jerk wately” Bill said into Budd’s shoulder. “I forgive you, an  I’m sowwy I tied you to dat twee, I shoulda helped you.” “Forgiven? Fwiends?” Bill asked his brother, looking him in the eye. “Fwiends” Budd said.<br>\r\n<br>\r\n          Just then Ben returned, pushing a double stroller which held two bags. “Good you guys are still here, I was really worried, we need to get you two dressed quickly so we can get outta here. There are some people said they heard strange noises coming from the alley,” he said breathelessly, “Well let’s get this over with, I had to guess at your sizes, but I think I got somethings that will fit. He pulls out a package of diapers and baby powder and opens it. Revealing the cartoon animals that frolicked on the outside of the diaper, he took one out and unfolded it. “I think these will be fine,” Ben said as he pulled off his own shirt to use as a changing matt. “You two owe me for the stroller though, I’m broke now,” he said. Grabbing Bill, much to the regressed boy’s protesting, and laying him down on his shirt, he deftly powdered his front, and flipped the regressed toddler over gently to dust his rear. “Dis is absowutely humiwiatin!” Bill grunted between clenched teeth. <br>\r\n<br>\r\n“Yeah, yeah stop squirming I’m almost done!” Ben said as slid the diaper under Bill and brought it up between his legs tapping the bulky article of clothing in place. “Looks like baby sitting has paid off after-all,” Ben joked as he rummaged around in the second bag a pulled a small t-shirt from it, and brought it down over Bill’s head. “No pants?” Bill asked alarmed, as Ben moved to disentangle Budd from his clothes, still damp with pee. “After the stroller and the diapers I had barely any money left. Be glad I got you shirts at all. It isn’t abnormal to see toddlers with just diapers on, especially on a hot day like today,” Ben finished as he freed Budd from his oversized t-shirt. He quickly treated Budd to the same as Bill, and quickly had the two of them strapped into stroller. He stored the diapers and Budd clothing in the bottom of the stroller. “I think we’re ready to go” he said, shaking off his shirt and pulling it back on. “But Where are we going to go? Your parents?” he asked. <br>\r\n</span></div></div>",
            "created":1432270800,
            "id":1981427,
            "title":"Another Twist of Fate, Another Change of Veiw"
        },
        "1231222":{
            "author_name":"Entropic",
            "choices":[
                "Steven is turned into a little boy",
                "Steven and Bill swap ages"
            ],
            "content":"<div class=\"\"><div> <span>Stumbling to his feet, Bill stared up, through blurry eyes, at his brother and the newcomer. He rubbed his teary eyes with a fist, trying to glare at his brother, who was currently perched on a bike that wasn't his. His other had had darted to cover himself, especially from this tall stranger Budd had bought along, obviously to humiliate him. Looking down at Bill's tear-streaked face, Budd just smirked.<br>\r\n<br>\r\n\"Aw, poor little cry-baby!\" he crooned, patting the handles of Bill's bike. \"Don't worry, I bought you a friend to play with! You remember your big boy friend, Steven, right Bill?\" Bill turned his attention to the stranger...and realised he wasn't strange at all. It was indeed Steven, his friend from college - now he seemed like a giant.<br>\r\n<br>\r\n\"Hey there, little guy,\" said Steven, chuckling. \"Remember me?\" Steven approached Bill, bending down to get a closer look. Bill backed away, backing into the fence and using both hands to cover himself. \"I'm not gonna hurt ya, little guy...\" Steven paused a short distance from Bill, studying him. His eyes alighted on the small birthmark on Bill's shoulder. \"...dude, it really is him, isn't it?\"<br>\r\n<br>\r\n\"Yep,\" said Budd simply, still smirking.<br>\r\n<br>\r\n\"He's...he's a fucking kid!\" yelled Steven, his face splitting into a grin. Bill darted a look to the side, wondering if he could make a dash for freedom from this torment, but as he turned back Steven lunged at him and grabbed him beneath his armpits, lifting him into the air with ease.<br>\r\n<br>\r\n\"Hey!\" Bill squeaked as his tiny body was hoisted skyward, his hands being forced away from his childish genitals, displaying them for the whole world to see. \"Leggo!\"<br>\r\n<br>\r\nSteven swung little Bill through the air, whooping with delirious enthusiasm. \"Look at you, man; you're a little kid!\" Bill was dimly aware of Budd, still smirking, rushing past in the background as he squirmed in Steven's hands. He wanted Steven to let him go, but at the same time he realised he was scared of falling.<br>\r\n<br>\r\nSteven finally stopped, his breathing slightly heavy. His grip on Bill was as strong as ever though, as he stared at his diminished friend, his eyes scanning his smooth, hairless body. Bill could only endure the humiliation, as Steven turned him at an unceremonious angle to inspect his smooth, round little ass and squirming feet.\"Dude...\"<br>\r\n<br>\r\n'Dude'; that seemed to be all Steven could say and, quite frankly, Hellen was getting sick of it.</span></div></div>",
            "created":1086843600,
            "id":202512,
            "title":"A Friend in Awe"
        },
        "12312221":{
            "author_id":"grennd",
            "author_name":"Grennd",
            "choices":[
                "Stays with Steven",
                "Leaves"
            ],
            "content":"<div class=\"\"><div> <span>Dude.<br>\r\n<br>\r\nHelle was tired of the word. Deciding it was time for some negative reinforcement, she resolved to regress this Steven character a bit every time he said it. <br>\r\n<br>\r\n\"Dude,\" (Steven's stubble disappeared) he said, putting the little boy back down on the ground. \"You really are a little guy. Look, dude!\" (his physique slimmed a bit) \"Look at how short you are!\"<br>\r\n<br>\r\nBill barely came up to his friend's chest. He looked up at Steven's gleeful face. \"Aren't you going to help me?\" he said indignantly.<br>\r\n<br>\r\n\"Later, dude.\" (Steven's arm hair vanished) \"This is too much fun.\"<br>\r\n<br>\r\n\"It's not fun! Look, I'm a little kid! I can't live like this!\"<br>\r\n<br>\r\n\"Chill out, little dude.\" (Steven shrunk visibly, his feet no longer filling out his Huarache sandals properly) \"Like, look, dude,\" (he shrunk even shorter, and his shorts started to creep down his now hairless shins. He looked like he was fourteen again) <br>\r\n<br>\r\nSteven took off the hooded sweatshirt he was wearing and jammed it onto protesting Bill. The sweater swallowed up his tiny frame, covering all of his little body except for his lower legs. His arms were invisible inside the billowing sleeves, and even his head couldn't be seen for a moment, as the hood flopped comically over it.<br>\r\n<br>\r\nSteven laughed heartily. \"Dude!\" (he became a good four inches shorter, and his next words came out in a prepubescent squeak) \"It's fucking huge on you!\" Steven paused, confused by his voice. \"My voice... dude?\" (he shrunk some more, and now his clothes were quite loose on him. His shorts looked huge on him, and threatened to fall off at any moment. His undershirt hung loosely on his thin frame)<br>\r\n<br>\r\nBill managed to pull the hood away from his face and saw the barely-pubescent Steven looking worriedly at his reduced body. He only had to look up slightly at his face, because Steven was only about a head taller now.<br>\r\n<br>\r\n\"Oh my God! Dude!\" (all traces of puberty vanished from Steven as the few hairs around his underarms and groin dissipated. He felt his testicles retract, and let out a little yelp)<br>\r\n<br>\r\n\"Aah!\" Steven squeaked as he reached down to feel his member. As he did so, his shorts and briefs fell down around his ankles. He put his hand to his groin and stared meekly ahead. \"Dude...\" (he shrunk some more, his shoulders becoming so narrow his undershirt had difficulty finding purchase)<br>\r\n<br>\r\nNow it was Bill's turn to be ecstatic. \"Ha! It's happened to you now!\" His friend was only a few inches taller than him now, and just as much a boy as he.<br>\r\n<br>\r\n\"Dude,\" (he regressed some more, becoming almost eye level with Bill) \"why is his happening?\"<br>\r\n<br>\r\n\"How should I know?\"<br>\r\n<br>\r\n\"It's not fair... help me, dude!\" (Steven was now just as tall as Bill, and his undershirt fit like a sheet on him)<br>\r\n<br>\r\n\"Hmm, I seem to remember an older yourself thinking this was 'too much fun' a little while ago. By the way, thanks for the sweater,\" Bill said, walking away from the former adult.<br>\r\n<br>\r\n\"No, wait, help!\"<br>\r\n<br>\r\nWhat does Bill do?</span></div></div>",
            "created":1095483600,
            "id":217010,
            "title":"Dude!"
        },
        "123122211":{
            "author_name":"Entropic",
            "choices":[
                "The three torment Budd and Steven",
                "Budd gets his comeuppance"
            ],
            "content":"<div class=\"\"><div> <span>Bill strode away from Steven as purposefully as a little boy can, wriggling his arms a little to shift his newly acquired sweater into a better position on his narrow shoulders.<br>\r\n<br>\r\n\"...dude, you can't leave me!\" whined Steven pitifully, regressing to a younger age than Bill in the process. His adult undershirt finally lost its hold on his child-sized torso and slipped clean to his ankles. \"Ah!\" he moaned as he hurriedly struggled to scoop his briefs back up, entangled as they now were with his fallen undershirt. Feeling so much excess material as he pulled his adult briefs up his hairless little legs to his painfully thin waist only made him feel even more of a helpless kid, but at least it provided cover.<br>\r\n<br>\r\n\"Yeah, I can,\" yelled Bill in his now soprano voice, tramping away at a more determined pace.<br>\r\n<br>\r\n\"But...dude...\" mewled Steven, sinking back into a toddler as he stumbled out of his sandals. His limbs had become soft and chubby, but now he felt a much greater fear as he realised his locomotion had just degenerated to a wobbly trot. \"Pwease...\" he begged, his now disproportionately large eyes brimming with tears.<br>\r\n<br>\r\n\"No!\" bellowed Bill, looking comically angry for such a small child. \"You're just a big cry-baby!\" Indeed, Steven had begun to sniffle, and couldn't hold back the tears as they trickled down his chubby cheeks.<br>\r\n<br>\r\n\"Oh, but you can, Billy!\" The voice stopped Bill dead in his tracks, feeling like a scolded child: Budd was still there, looming above the two. \"I think you two make the best of buds!\" And with that, Budd simply grabbed Bill by the arm and dragged him back to the pint-sized Steven. \"Now, play nicely!\" Budd said, cackling.<br>\r\n<br>\r\n\"...pwease, help me Budd!\" wailed Steven, collapsing onto his chubby backside.<br>\r\n<br>\r\n\"Fuck you!\" shrieked Bill, lashing out at Budd. His attempt was futile, and Budd blocked it easily, laughing cruelly.<br>\r\n<br>\r\n\"Hey, take it easy little guy!\" Budd mocked. \"You know, I kinda thought you wouldn't play nicely. That's why I thought we'd baby-sit...\"<br>\r\n<br>\r\nStifled chuckles soon erupted into full-blown, inanely childish laughter, as James and Matt, Budd's best friends, appeared from behind the fence.<br>\r\n<br>\r\n\"Yeah, let's sit the babies...on potties!\" cracked James, who had enjoyed seeing the teens go down. Bill and Steven had constantly put Budd and his friends down, but now that would change.<br>\r\n<br>\r\n\"Maybe we'll need to change their diapers!\" joked Matt, slapping Budd's shoulder. Budd just stared on with a gleeful twinkle in his eyes, as Steven broke into sobs and Bill glared up at the three with a vicious, if absolutely adorable hatred.<br>\r\n<br>\r\nHelle yawned.</span></div></div>",
            "created":1095570000,
            "id":217273,
            "title":"Tears  and a Triumph"
        },
        "1232":{
            "author_id":"grennd",
            "author_name":"Grennd",
            "choices":[
                "Jennifer",
                "Britney"
            ],
            "content":"<div class=\"\"><div> <span>Helle walked for a few blocks before detecting a presence. Not long after she did that, she heard the chatty, obnoxious voices of these presences.<br>\r\n<br>\r\n\"Great,\" she muttered to herself. \"Some stuck-up high school princesses.\"<br>\r\n<br>\r\nHelle imagined they were the clique of attractive, snobbish girls in the school who didn't know that everyone else hated them. Peeking into their minds, she realized they didn't know everyone hated them, but it was clear that was true. Helle waited until they rounded a corner, so she could see them.<br>\r\n<br>\r\n\"Yeah, so like, that math test was like, totally gay, huh?\" Complained one (whose name, Helle found, was Britney), smacking on a piece of gum annoyingly. She was the shortest of the three, and had blonde hair tied up in pigtails. She walked along with a rhythmic click of her high heels which was almost as annoying as her gum-popping. She was wearing a bright blue dress that was about the same color as her eyes, and it showed off her impressive cleavage well.<br>\r\n<br>\r\n\"Yeah, no kidding.\" The second girl (named Tiffany) said. \"Mrs. Anderson is such a bitch. I wish she'd get run over by a truck or something.\" This girl was taller than the rest, and had penetrating green eyes. Her black hair was cut short, her physique toned, and her midriff-revealing tube top was a dark shade of emerald.<br>\r\n<br>\r\n\"I didn't mind it.\" The last girl (Jennifer) said defiantly. Her most distinguishing feature was her thick brown hair that went the entire length of her back. She wore a simple outfit of jeans and a red T-shirt that couldn't hide her curvy figure. She had a bossy, stern face dotted with freckles and completed with brown eyes.<br>\r\n<br>\r\n\"But you're the damned goody two-shoes.\" Tiffany said aggressively.<br>\r\n<br>\r\n\"Shut up.\" Jennifer replied just as menacingly.<br>\r\n<br>\r\n\"Please stop!\" Britney said suddenly. \"You're always fighting, I hate it!\"<br>\r\n<br>\r\nBoth Jennifer and Tiffany looked at her cruelly, but only Tiffany spoke. \"Why should we listen to you? You stay the hell out of it!\"<br>\r\n<br>\r\nThat's it, thought Helle. The black-haired one goes first.<br>\r\n<br>\r\nBritney shot Tiffany a dirty look; Tiffany looked almost pleased by this.<br>\r\n<br>\r\nHelle concentrated, and learned that all three of the girls were currently age seventeen. She also discovered that Tiffany hadn't had to wear a training bra until she was fourteen, and this gave her an idea.<br>\r\n<br>\r\nTiffany's breasts weren't much, but she was proud of them all the same. As they were on prominent display because of her tight top, both Britney and Jennifer noticed right away that they looked somehow different suddenly. They said nothing, however.<br>\r\n<br>\r\nAs the trio walked along in silence, Tiffany's assets began to deflate noticeably, making the top sag. Not only that, but youthful features began to return to her face, and her skirt slipped lower down her legs. Britney and Jennifer couldn't help staring as they saw Tiffany's top hanging loosely on what was obviously a very flat chest.<br>\r\n<br>\r\n\"What are you guys-\" Tiffany said, her blood running cold. She had felt a peculiar feeling at her chest, and now her friends were staring...<br>\r\n<br>\r\nShe glanced down, and couldn't believe her eyes. Pulling the top open to look at her bosom, she screamed. Her breasts were almost completely gone, leaving little but feeble swellings. \"My... My, they're...\"<br>\r\n<br>\r\n\"Gone?\" Prompted Britney. She somehow knew that Tiffany was now getting younger, and didn't think it that strange. Her eye drifted down to Tiffany's skirt, which was hanging low due to her diminished hips. She was going to say something about it, but Jennifer beat her to it.<br>\r\n<br>\r\n\"Hey, your skirt isn't fitting too well either.\"<br>\r\n<br>\r\nTiffany glared at the two with pure malice. The two, who seemed to have a strange knowledge and nonchalance about the whole experience, both agreed inwardly that right now would be a good time for her to get younger again.<br>\r\n<br>\r\nHelle picked up on these thoughts easily, and willed Tiffany younger. \"Say goodbye to puberty, girly.\" She muttered to herself.<br>\r\n<br>\r\nIn the span of about three seconds, Tiffany shrunk from a freshman-age teenager to about the age of a second grader. She shortened drastically, her toned, full legs compacted into tiny, thin sticks, and her body lost every hint of the curves she had only moments earlier. During this process, her skirt fell swiftly to the ground in a silent heap. Her bright green thong soon followed. After that, the tube top slid down her body and into the pile. She stood, quivering, a naked little girl standing in shoes many sizes too large for her feet.<br>\r\n<br>\r\nJennifer and Britney smiled to each other, not knowing one of them would receive the same treatment very soon.<br>\r\n<br>\r\nWhich one gets it first?<br>\r\n <br>\r\n</span></div></div>",
            "created":1086843600,
            "id":202481,
            "title":"The Trio Loses a Member to Gradeschool"
        },
        "12321":{
            "choices":[
                "Britney joins her friends",
                "Helle Leaves them be"
            ],
            "content":"<div class=\"\"><div> <span>Although nither of them knew why, it seemed very natural to be baby-sitting young Tiffany. The girl's memories were a little hazy, but they were sure that while they took their eye off Tiffany for a moment she had managed to escape bath-time in what could only be her big-sister's shoes. Helle had done a number on their minds, only Tiffany knew what she really was, a 17 year old, in a 7 year old body. \"C'mon\" said Jennifer, \"let's get you clean, and if you were a big girl, then we wouldn't have to wash you.\"<br>\r\nThis was Helle's cue to go on. \"Maybe if you were a big girl too...\" As Biritney grabbed the arm of the still shcoked newly 7 year old, and they began to start walking, Jennifer suddenly tripped over her jeans. \"Ha!\" Laughed Britney \"You're just like a clumsey Guy! You even got the pants for one!\" This last part got to Jennifer, she looked down at what should have been hip-hugging jeans, but they were baggy, like they were a few sizes too large. She got up and said \"If I'm a guy what do you call these?\" She then pulled her T-shirt back so it would stretch against her clevage, Tiffany, who finally got some courage, pointed out the problem with this. \"Those mosquito bites don't really make the girl.\" Even Tiffany's old chest was bigger then Jennifer's current one. \"WHAT!?\" screamed Jennifer, as she looked at her dwindeling assets. Now she tripped over herself again, from surprise more then anything else, but she lost her shoes in the fall. She reached for them when she saw something that wasn't right. It was her hands, these hands were tiny, not hers, the nails were less pointed then hers, and they certainly were not connected to the same pale arms as hers. She hurried into her shoes, but her feet just couldn't stay inside. The panic in her mind of what was happening to her just made Helle so happy she had to speed the process along. When She tried to get back up, her jeans didn't follow her, and in a few secconds her pink panties joined them With her shoes, disgarded for their over-size. \"What's happening to me!?\" Jennifer squeeked, her voice pre-pubdecent. \"You're cold\" was the responce from britney, \"That's what happened when you go outside in nothing but a nightee.\" Jennifer looked down and saw her T-shirt's revenge for trying to make it hide her figure, it was hiding it now alright, and it even invaded her legs to just at the knee. \"Such brats\" remarked Britney, noticing how they were both in tears now, \"Your moms don't pay me enough, a 7 and a 5 year old are so much harder then 15 a hour.\"</span></div></div>",
            "created":1105506000,
            "id":231997,
            "title":"Don't quit your dayjob"
        },
        "13":{
            "author_id":"grennd",
            "author_name":"Grennd",
            "choices":[
                "Alexander",
                "Winston",
                "Both of them",
                "Somebody passing by"
            ],
            "content":"<div class=\"\"><div> <span>\"Dammit, Winston, are you sure about this?\" Said a man, who was currently digging into the ground feverishly<br>\r\n<br>\r\n\"Yeah, yeah, this is exactly where he said.\" Came the response, from a man with a sharp face and oily, slicked-back hair.<br>\r\n<br>\r\nThe pair were underground, in the old mine that had been abandoned for years. It had been abandoned because of various safety reasons, and this was why the one digging was so concerned. He was a man of medium height, but was well built. He had a roundish, pleasant face which featured a pair of glasses with circular frames.<br>\r\n<br>\r\n\"Here,\" continued Winston in a lazy drawl, \"is where ol' Stutter said the artifact is. Pity he couldn't come get it himself...\"<br>\r\n<br>\r\n\"Yeah, because you cut his brakes and he's in the hospital now!\" Was the angry response.<br>\r\n<br>\r\n\"Details, details, my dear Alexander. Just keep digging, and we'll get it soon.\"<br>\r\n<br>\r\n\"What is this 'artifact', anyways?\"<br>\r\n<br>\r\nWinston shook his head vaguely. \"Who knows? But it's supposed to have great magical powers.\"<br>\r\n<br>\r\n\"Magical powers?\" Snorted Alexander. \"Yeah, right.\"<br>\r\n<br>\r\n\"Patience.\" Winston said, casually watching Alexander dig. After a few minutes, he struck something hard with his shovel. The two exchanged glances, and Alexander hastily dug the item up. It was a battered wooden chest, with a lock that had rusted off long ago.<br>\r\n<br>\r\n\"This is it!\" Said Winston excitedly, prying open the lid.<br>\r\n<br>\r\n\"It's a damn Ouija board!\" Exclaimed Alexander.<br>\r\n<br>\r\n\"No, I'd say more of a feng shui compass.\" Winston said nonchalantly, turning over the object in his hands. It was an octagonal board, with a strange crystal in the middle. Various colorful runes were spaced about it in patterns.<br>\r\n<br>\r\n\"Well, what does it do?\" Alexander said impatiently.<br>\r\n<br>\r\n\"Hmm. Don't know. Let's bring it outside where there's more light.\"<br>\r\n<br>\r\nThey went back outside, and Winston looked over the device. He twisted and turned parts of it while Alexander watched, tapping his foot impatiently. Eventually he twisted a couple parts of it so some matching runes were parallel from each other, and the crystal in the middle glowed.<br>\r\n<br>\r\nA bright flash of light shot toward somebody, regressing them. Who was it?<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1087794000,
            "id":204053,
            "title":"Winston and Alexander, Treasure Hunters"
        },
        "131":{
            "author_id":"yankeedingo",
            "author_name":"Yankee Dingo",
            "choices":[
                "It hits Alexander in an impulsive attempt to fix him",
                "It hits Winston, affecting him now"
            ],
            "content":"<div class=\"\"><div> <span>     “Ah, god, my eyes!” screamed Alexander as the light hit his face. “Watch where you’re aiming that-“ He paused, observing how Winston gawked at him, mouth open wide. “Geez, man, what’s gotten into you? You look like you’ve seen a ghost!” <br>\r\n<br>\r\n     Winston slowly reached into his back pocket, pulling out a handheld mirror he kept with him. “Not a ghost,” he stuttered, placing the mirror in Alexander’s hands, “but something even stranger... maybe you’d like to see it yourself.”<br>\r\n<br>\r\n     Curiously, Alexander opened the mirror and gave himself a look. Why did he even need it, anyways?<br>\r\n<br>\r\n     But then he saw.<br>\r\n<br>\r\n     “Holy- I- Is that acne!?” he gasped, recoiling in shock. “Oh, Winston, it has to be! And my hair- it’s so long! Why, with this mane I could be the fourth Bee Gee if I wanted to!”<br>\r\n<br>\r\n     “There’s already four Bee Gees,” Winston informed him, if you count Andy.”<br>\r\n<br>\r\n     “Wha- well, then, I guess I don’t!” Alexander whipped out his wallet and fingered through it, muttering to himself. <br>\r\n     <br>\r\n     “Aha!” he yelled at last, tapping frantically on a picture he found. “See this? This is me in high school! As a sophomore! And this is me now! I can’t even see a difference!”<br>\r\n<br>\r\n     “H-hold on, Alexander, no need to get so worked up!” Winston spoke. “I’m sure we can fix this somehow. There’s gotta be a way, I know it!”<br>\r\n<br>\r\n     Alexander glared at his partner. “Fix me?”<br>\r\n<br>\r\n     He raised his hands, the artifact cupped in his palms, ready to fire.<br>\r\n<br>\r\n     “Alexander, no!”<br>\r\n<br>\r\n     For the second time that day, a brilliant flash lit up the sky. But what did it do this time?<br>\r\n</span></div></div>",
            "created":1550715180,
            "id":2620609,
            "title":"Alexander"
        },
        "14":{
            "choices":[
                "Naomi, age 27",
                "Paul, age 27",
                "Sasha, age 50",
                "Kevin, age 50",
                "Create someone of your own making"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sometimes things just happen, even when you're told all your life that all that matters in life is money and fame, there's more that goes on that can't be explained by our so-called rational times.  Like this for example:</span></div></span></div>",
            "created":1175403600,
            "id":394646,
            "title":"Things just happen"
        },
        "141":{
            "choices":[
                "Something is very different",
                "Nothing's changed...or has it?"
            ],
            "content":"<div class=\"\"><div> <span>Naomi Tarin, her parents liked to do something different, is just having another normal day in her life.  Her life isn't anything remarkable, the same thing as anyone else in the world who's not got any painful memories to deal with in life.<br>\r\nHer job is at her local day care centre and while she loves working with children, she does wonder if there could be something else she could do in case working with children wasn't going to last forever.<br>\r\nMaybe she should have heeded the saying, be careful what you wish for.<br>\r\n<br>\r\nIt's a normal day at the day care centre where Naomi works, Naomi and her co-workers are looking after the children in their care, playing games with them and just generally making sure their young charges have fun.  Sometimes Naomi wonders if she could be a good parent if she ever had kids at some point in her life.<br>\r\n\"Up, up and down we go, up, up and down we go\"  Naomi says as she gently lifts and lowers a young boy of about three years old at his insistence.<br>\r\n\"And up again and down again, okay, I think you should stay on the ground for now.  That's enough flying for today\"  Naomi sets the young boy down and he runs off to play with a few kids near the sand pit.<br>\r\nGlad to take a few minutes to try and get the pain in her back to go away, Naomi sits down to watch over the kids as they play.<br>\r\n\"You're getting old, you know that, right?\"  Jake, one of her co-workers and one of only two male child carers in the day centre, sits down beside her.<br>\r\n\"We're all getting old, just got to feel young at heart, well that's what my mum tells me a lot anyway.  Doesn't it make you feel good to see children playing happily?\"  She asks as she rubs her back.<br>\r\n\"Most of the time, yeah, but when it comes to changing the nappies?  That can take a lot of breath holding\"<br>\r\n\"It's not that bad, and anyway, we used to be that young, don't forget that.  So how's things with whatshername?\"  They talk for a while and then return to work.<br>\r\n<br>\r\nThe hours pass and soon it's time for the parents to pick their kids up, an hour later Naomi switches off the lights after everyone else has left and she heads to the bus stop.  Naomi's been saving up for a car, but she's been wondering just when she'll ever have enough, especially with cars being so expensive as well as the fuel and other costs.<br>\r\nNot that she hates the bus, but it would be nice to not have to endure all the drunks and other rowdy problems who tend to make the trip unbearable.<br>\r\nThankfully there aren't any problems and she gets home with no problems.  Naomi decided to move back in with her parents when she started saving up for her car, her parents don't mind as long as she doesn't make too much of a mess and at least pays her way.<br>\r\n\"That you, dear?\"  Her mum calls through from the living room.<br>\r\n\"Yes, mum.  Just going to take a bath if that's alright\"<br>\r\n\"Of course, dear, go ahead\"<br>\r\n<br>\r\nFinding the water to be at a nice heat, Naomi runs herself a bath, yawning a little while doing so.<br>\r\n\"<i>As rewarding as the job is, there has to be something a little more I can do, I should be making my way in my life on my own, not having to rely on my parents to help me</i>\"  After checking on her bath, Naomi undresses and lowers herself into the hot water, sighing with relief as her body heats up gently.<br>\r\n\"<i>Now this is pleasure</i>\"  After half an hour of a relaxing soak, Naomi gets out, dries off and slips into her favourite fabric pjs and a dressing gown.<br>\r\nNaomi spent a few hours with her parents talking about her day and listening to them talk about their's and shortly after ten she decides to get some sleep.<br>\r\n<br>\r\nJust another day...Next morning however:</span></div></div>",
            "created":1175403600,
            "id":394653,
            "title":"Just a normal day"
        },
        "142":{
            "choices":[
                "His sister, also unaware, wakes up in his guest room ",
                "His sister wakes up, sees the changes and freaks out",
                "His sister wakes up, and is unchanged"
            ],
            "content":"<div class=\"\"><div> <span>Waking up in his bed, Paul felt something that was ... different.  Sitting up, he looked around at his room, everything was still the same, pile of dirty laundry, his suit hanging on the closet door for work tomorrow, his computer still in sleep mode.  Tossing off the covers as he swung his legs off the edge of his bed, he noticed that his legs didn't touch the ground, they just dangled there about halfway down.  Oh well, he hopped off, and his sole garment, his boxers, slid off in one swift moment.<br>\r\n<br>\r\n\"Must've stretched my boxers out too much.\"  He grumbled to himself as he wandered down his apartment hall, bare feet plodding down the wooden floor before sitting at his kitchen counter and starting up his coffee machine.  \"Yikes!\" He yelled, hopping off the cold seat, rubbing his bare bottom to warm it back up, \"Man that's cold!\"  Looking down at his crotch he noticed that now not only was he hairless down there, but was now a prepubescent, looking at the mirror across the hall, he saw what appeared to be his nine-year old self.<br>\r\n<br>\r\n\"I think my sister must've swapped out my mirror, reflections not right.\"  He said to himself as he plopped on the couch, warmer than the plastic stool in the kitchen, and flipped on the news.<br>\r\n<br>\r\nThe news lady looked somewhere around 10, her blouse draped over her like a dress, while her coanchor had his sleeves rolled up to an almost comedic level.  When they jumped to the weather lady, she looked somewhere around 6, her dress pooled at her feet, but she didn't seem to mind that's she was standing in front of state-wide TV in her birthday suit.<br>\r\n<br>\r\nFlipping through the other stations to see if anything good was on TV, he saw more kids that's looked like they were playing dress up in their parent clothes, or simply going about their business without them.  Sports, News, talk shows, sitcoms, everyone was no older than 11, but no younger than 4, oddly enough, the only ones with proper fitting clothes were the ones who were supposed to be kids, and they didn't see anything strange either.<br>\r\n<br>\r\nHearing the *ding* from his coffee machine, Paul hopped up and started making himself a cup, something was off, it felt different today.  He just couldn't place it, but he figured that he'd find out eventually.</span></div></div>",
            "created":1555941300,
            "id":2648433,
            "title":"Paul, age 27"
        },
        "145":{
            "author_id":"nana2015",
            "author_name":"Derek Robson",
            "choices":[
                "he gradually regresses",
                "he discovers a fountain of youth",
                "he gets cursed"
            ],
            "content":"<div class=\"\"><div> <span>There was once a man called Lance, about 52 years old. he had a good life, a good family, and a great house.<br>\r\n<br>\r\nbut he was quite fascinated with age regression. \"Imagine,\" he thought, \"being able to regress to your younger days!\"<br>\r\n<br>\r\nbut how does he regress?</span></div></div>",
            "created":1476971100,
            "id":2226028,
            "title":"Create someone of your own making"
        },
        "15":{
            "author_name":"rate",
            "choices":[
                "become a test Subject",
                "visit a magic shop",
                "Recieve a package",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You have an ar/ap adventure when you..</span></div></span></div>",
            "created":1092978000,
            "id":213176,
            "title":"AR adventure"
        },
        "151":{
            "author_id":"grennd",
            "author_name":"Grennd",
            "choices":[
                "Male",
                "Female"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one are you?</span></div></span></div>",
            "created":1095570000,
            "id":217287,
            "title":"Test Subject"
        },
        "1511":{
            "author_id":"grennd",
            "author_name":"Grennd",
            "content":"<div class=\"\"><div> <span>“Huh,” you say to yourself as you tear a strip off the poster. <br>\r\n<br>\r\n“Volunteers Wanted For Clinical Research Study,” it reads. It continues below, in a smaller font, “individuals aged 19-23 wanted for new study, titled ‘Regenerative Effects of Bichlorificated Benzothermoclenzonelonese on the Human Body’. Risks and details to be given in interview. Compensation available.”<br>\r\n<br>\r\nYou don’t care about any of it, except what counts: the compensation. As a poor college student, you need all the dough you can get. You whip out your cell phone out of your pocket and dial the number, walking down your dorm hall as you do so. <br>\r\n<br>\r\nThe phone rings, is picked up, and the voice on the other end is energetic. “Brington Medical Building. Can I help you?”<br>\r\n<br>\r\n“I’m calling about the research study volunteering.”<br>\r\n<br>\r\n“You’d like to make an appointment for an interview?”<br>\r\n<br>\r\n“Yeah.”<br>\r\n<br>\r\n“Okay,” comes the peppy voice, and she gives you a date and a time. You thank her, hang up, and think to yourself: I bet she’s hot.<br>\r\n<br>\r\nA few days go by, and now it’s time for the interview. You enter the medical building, which is just as sterile and quiet as any other hospital. The front desk points you to the office where the interview is to take place. Arriving at the office, you are surprised by the name: a Dr. Brington. You knock on the door, and a man’s voice ushers you in.<br>\r\n<br>\r\nSitting at the desk is a young-looking man. His most distinguishing feature is his long, bright blonde hair that is tied in a ponytail. He seems nice, but you think he looks a little effeminate. “You’re here for the research study?”<br>\r\n<br>\r\n“Yep.”<br>\r\n<br>\r\n“Please sit down,” he says, and you do so. “The study is simple. We’re going to give you a shot, and we’re going to run a few tests. We might need to bring you back in for another dose.”<br>\r\n<br>\r\n“And what about the risks?” you ask, folding your arms in front of you.<br>\r\n<br>\r\n“Oh, right. Well, the test is on a new compound we think might be able to reverse the physical aging process, in other words, make somebody younger. We’ve used it on older people with limited results, but we think younger people might respond to it better.”<br>\r\n<br>\r\n“Okay then,” you say, satisfied. This guy’s a quack, anyways. You can’t make people younger, that’s impossible.<br>\r\n<br>\r\n“And how old are you?”<br>\r\n<br>\r\n“Nineteen.”<br>\r\n<br>\r\n“May I see your ID?”<br>\r\n<br>\r\nYou hand him your driver’s license and he looks it over.<br>\r\n<br>\r\n“Looks good. Any questions?” he says, handing your license back.<br>\r\n<br>\r\n“What’s the compensation?”<br>\r\n<br>\r\n“One thousand dollars, and five hundred more for each additional test if we have to run them.”<br>\r\n<br>\r\n“Okay.” you say curtly, but you’re quite excited. A thousand dollars can buy a lot of food.<br>\r\n<br>\r\n“So, will you do it?”<br>\r\n<br>\r\n“Sure, when will the test be?”<br>\r\n<br>\r\n“What time works best for you?”<br>\r\n<br>\r\n“Whenever..”<br>\r\n<br>\r\n“How about now?”<br>\r\n<br>\r\n“Alright..”<br>\r\n<br>\r\nHe slides you a clipboard with a waiver on it. You don’t bother reading the whole thing; what could convince you away from a thousand dollars? You sign it, he looks it over, and then guides you into another room. This room looks like a hospital room, with steel trays, sinks, and various liquids about. A nurse is there, and she instructs you to sit on a steel table. You think she’s pretty hot, with a nice ass.<br>\r\n<br>\r\n“Before we give you the shot, we have to put these on you,” she says, holding a few suction cup-like things attached to strings.<br>\r\n<br>\r\n“Fine,” you reply, and she sticks them to your temples, your wrists, and your calves. You wait a few minutes, and Dr. Brington comes back in with a syringe full of a blue liquid. He approaches you and squirts a bit out of it. <br>\r\n<br>\r\n“Roll up your sleeve, please,” he says. You pull up the sleeve of your shirt and allow him to swab your forearm. You flex your forearm, hoping to show off your muscles to the nurse. He then gently inserts the needle in and sends the blue liquid surging through your veins.\t<br>\r\n<br>\r\n“Now just wait a few minutes. You might feel a little strange, that’s normal.”<br>\r\n<br>\r\nYou sit on the cold steel, thinking about your thousand dollars. The nurse is looking at a computer screen with a green mesh outline of a male figure. You realize that’s you. She points to a table of data and motions the doctor over.<br>\r\n<br>\r\n“Very unusual this time.”<br>\r\n<br>\r\nYou don’t hear her, you’re busy looking at her butt as she leans over the computer.<br>\r\n<br>\r\n“Well, it should be. I used a double dose this time.”<br>\r\n<br>\r\nThe doctor’s voice jolts you out of your reverie. Double dose? What does that mean?<br>\r\n<br>\r\n“Look, doctor, it’s starting,” the nurse says, looking at the computer screen then at you.<br>\r\n<br>\r\nWhat’s starting? Suddenly you feel strange. A feeling washes over you, a feeling that encompasses your whole body.<br>\r\n<br>\r\n“Body hair is already thinning,” the nurse says again, pointing at a display on the monitor.<br>\r\n<br>\r\nYou feel a faint tingle in your face, then the same feeling around your stomach and chest areas. Curious, you massage your chest and notice your pectoral muscles aren’t quite as firm as you remember.<br>\r\n<br>\r\n“Interesting. It’s going even faster than I expected,” the doctor says, looking over at you. You feel the now-familiar tingling, on your arms now. You look down at your forearm and notice things are amiss: your dark arm hair is gone, replaced by light, wispy hairs. You also notice that the muscular forearm you were trying to impress the nurse with doesn’t seem quite as thick now.<br>\r\n<br>\r\n“What’s going on?” you ask angrily.<br>\r\n<br>\r\n“Well, I think it should be obvious. You’re getting younger,” the doctor says.<br>\r\n<br>\r\nYou feel your shorts become loose around your waist and your shirt fitting strangely. You realize that these guys are serious. You’re getting younger, and you don’t know when it’s going to stop.<br>\r\n<br>\r\n“He’s sixteen now; we should see some real shrinking now,” calls the nurse.<br>\r\n<br>\r\n“How young am I gonna get?” you ask.<br>\r\n<br>\r\n“That’s what we’re finding out,” replies the doctor.<br>\r\n<br>\r\nYou raise a hand to your face and it feels smooth, smoother than you have ever shaved it. You look down and see your legs. The hair on them has thinned considerably. Like the nurse said, you’re shrinking now. Your shorts are beginning to cover more of your legs, and your narrowing shoulders are making your shirt’s sleeves obscure your hands.<br>\r\n<br>\r\nPlease stop, you think to yourself. The process doesn’t listen, and you’re shrinking faster now. Holding up your arms for investigation, you see embarrassingly thin limbs covered by too-large sleeves. Your legs are almost hairless now, not to mention pale and skinny. Your sneakers slide off your feet and hit the ground with a clap. It seems that your feet are now a few sizes smaller.<br>\r\n<br>\r\nLooking over at the computer screen, you see your estimated age to be fourteen. You’re barely old enough to be in high school, much less college! You look back over at the nurse you were ogling earlier. Before, she seemed like such a pretty little thing, sweet and unintimidating. Now she seems kind of daunting, and not as short as you remember. She seems to be about the same height as you. Everything else in the room seems larger, and it’s still growing. <br>\r\n<br>\r\n“Make this stop!” you say. You try to sound threatening, but your higher voice prevents that.<br>\r\n<br>\r\n“Sorry, can’t do anything. Plus, you signed the waiver,” comes the cold reply from the doctor. He turns back to the computer and the nurse. “He’s going back through puberty now, make sure it records everything.”<br>\r\n<br>\r\nAnd he’s right. You feel a bizarre tingle at your crotch, and you realize that’s your pubic hair starting to vanish. You feel the same feeling under your arms. Stealing a quick glance at the nurse, you see she’s immersed in the computer readout. You thrust a hand down into your loosening pants and feel for your genitals. A completely unfamiliar feeling greets you: a small, hairless thing has replaced the bulging member you once boasted. Your arms and legs are bald, and tiny, thin imitations of what they were a few moments ago. Your shorts and shirt are huge on you, reminding you forcibly of playing dress-up with your dad’s clothes so long ago.<br>\r\n<br>\r\nThe room continues to expand around you as you exit puberty the wrong way. The doctor is watching you with interest, and the nurse has turned away from the screen to see the diminished you. They both look so big! You feel completely helpless, a child in an adult’s life. The rest of your transformation is a blur, you just remember your viewpoint sinking lower and lower, and everything becoming bigger and bigger.<br>\r\n<br>\r\n“I think he’s stopped,” says the nurse, who sounds so intimidating to you. The doctor looks over at you and smiles. He pulls out a mirror and lets you look into it. You can hardly believe your eyes: it’s a little boy, not a day older than five. You try to raise a hand to your face, but it’s covered by the sleeve of an adult-sized shirt. You look down to the ground, which now seems to be a formidable distance. You see an empty pair of shorts, just as your legs used to be positioned. You wiggle your feet, and see them just peeking out of the legs of the shorts.<br>\r\n<br>\r\n“Let’s get you out of those clothes,” the nurse says sweetly. She reaches her gigantic hands toward you, and lifts you in the air with ease. Your pants and boxers fall to the floor in a heap, but you’re still covered by your shirt. She sits you down on another table and strips the shirt off you.<br>\r\n<br>\r\n“Hey!” you protest in a high-pitched squeal. You’re completely naked, with this woman looking at you! Of course, this is a highly enviable position for a college guy like yourself, but now you have the body of a child. The nurse holds out a pair of childish white briefs and slips them up your legs and to your waist. “I can do it myself!” you say indignantly. She smiles and hands you the rest of your outfit. It’s a pair of overalls and a shirt, appropriately sized. You slip it on.<br>\r\n<br>\r\n“Now, come with me,” she says. She lifts you off the table and places you on the ground. Now you realize how small you have become. Everything is so tall and scary! You can’t imagine how you’d be able to reach anything on the counters, or sit in any of these grown-up chairs. The nurse motions for you to follow her, and you grab her hand. She smiles and squeezes it lightly. <br>\r\n<br>\r\nThe nurse walks with you to another place where a new life awaits you, and you do have the thousand dollars. Maybe it won’t be so bad.</span></div></div>",
            "created":1095570000,
            "id":217288,
            "title":"Man to Boy"
        },
        "1512":{
            "author_id":"grennd",
            "author_name":"Grennd",
            "content":"<div class=\"\"><div> <span>“Hmm,” you say to yourself as you tear a strip off the poster. <br>\r\n<br>\r\n“Volunteers Wanted For Clinical Research Study,” it reads. It continues below, in a smaller font, “individuals aged 19-23 wanted for new study, titled ‘Regenerative Effects of Bichlorificated Benzothermoclenzonelonese on the Human Body’. Risks and details to be given in interview. Compensation available.”<br>\r\n<br>\r\nYou don’t understand most of it, except what counts: the compensation. As a poor college student, you need all the dough you can get. You whip out your trendy, colorful cell phone out of your purse and dial the number, walking down your dorm hall as you do so. <br>\r\n<br>\r\nThe phone rings, is picked up, and the voice on the other end is unenthusiastic. “Brington Medical Building. Can I help you?”<br>\r\n<br>\r\n“Yeah, I was calling about the research study volunteer thing...?”<br>\r\n<br>\r\n“You’d like to make an appointment for an interview?”<br>\r\n<br>\r\n“Yes, please.”<br>\r\n<br>\r\n“Okay,” comes the drawling voice, and he gives you a date and a time. You thank him, hang up, and think to yourself: what a jerk.<br>\r\n<br>\r\nA few days go by, and now it’s time for the interview. You enter the medical building, which is just as sterile and quiet as any other hospital. The front desk points you to the office where the interview is to take place. Arriving at the office, you are surprised by the name: a Dr. Brington. You knock on the door, and a man’s voice ushers you in.<br>\r\n<br>\r\nSitting at the desk is a young-looking man. His most distinguishing feature is his long, bright blonde hair that is tied in a ponytail. He is handsome, but is a little too skinny for your tastes. “You’re here for the research study?”<br>\r\n<br>\r\n“Yeah.”<br>\r\n<br>\r\n“Please sit down,” he says, and you do so. “The study is simple. We’re going to give you a little shot - just a little one, and we’re going to run a few tests. We might need to bring you back in for another dose.”<br>\r\n<br>\r\n“And what about the risks?” you ask, noticing he hasn’t actually said what he’s going to do.<br>\r\n<br>\r\n“Oh, right. Well, the test is on a new compound we think might be able to reverse the physical aging process, in other words, make somebody younger. We’ve used it on older people with limited results, but we think younger people might respond to it better.”<br>\r\n<br>\r\n“Okay then,” you say, satisfied. This guy’s a quack, anyways. You can’t make people younger, that’s impossible. Even if it did work, who wouldn’t want to look a bit younger?<br>\r\n<br>\r\n“And how old are you?”<br>\r\n<br>\r\n“Nineteen.”<br>\r\n<br>\r\n“May I see your ID?”<br>\r\n<br>\r\nYou hand him your driver’s license and he looks it over.<br>\r\n<br>\r\n“Looks good. Any questions?” he says, handing your license back.<br>\r\n<br>\r\n“Umm, what’s the compensation?”<br>\r\n<br>\r\n“One thousand dollars, and five hundred more for each additional test if we have to run them.”<br>\r\n<br>\r\n“Great!” you say, unable to suppress your excitement. A thousand dollars can buy a lot of food.<br>\r\n<br>\r\n“So, will you do it?”<br>\r\n<br>\r\n“Yeah, when will the test be?”<br>\r\n<br>\r\n“What time works best for you?”<br>\r\n<br>\r\n“Uh, anytime, I guess.”<br>\r\n<br>\r\n“How about now?”<br>\r\n<br>\r\n“Uh, sure.”<br>\r\n<br>\r\nHe slides you a clipboard with a waiver on it. You don’t bother reading the whole thing; what could convince you away from a thousand dollars? You sign it, he looks it over, and then guides you into another room. This room looks like a hospital room, with steel trays, sinks, and various liquids about. A nurse is there, and she instructs you to sit on a steel table.<br>\r\n<br>\r\n“Before we give you the shot, we have to put these on you,” she says, holding a few suction cup-like things attached to strings.<br>\r\n<br>\r\n“Kay,” you reply, and she sticks them to your temples, your wrists, and your calves. You wait a few minutes, and Dr. Brington comes back in with a syringe full of a blue liquid. He approaches you and squirts a bit out of it. <br>\r\n<br>\r\n“Roll up your sleeve, please,” he says. You pull up the sleeve of your sweater and allow him to swab your forearm. He then gently inserts the needle in and sends the blue liquid surging through your veins.\t<br>\r\n<br>\r\n“Now just wait a few minutes. You might feel a little strange, that’s normal.”<br>\r\n<br>\r\nYou sit on the cold steel, thinking about your thousand dollars. The nurse is looking at a computer screen with a green mesh outline of a female figure. You realize that’s you. She points to a table of data and motions the doctor over.<br>\r\n<br>\r\n“Very unusual this time.”<br>\r\n<br>\r\nYour heart skips a beat. Sure, these people aren’t serious, but it is still frightening to hear.<br>\r\n<br>\r\n“Well, it should be. I used a double dose this time.”<br>\r\n<br>\r\nDouble dose? What might that do?<br>\r\n<br>\r\n“Look, doctor, it’s starting,” the nurse says, looking at the computer screen then at you.<br>\r\n<br>\r\nYou begin to worry. What’s starting? Suddenly you feel strange. A feeling washes over you, a feeling that encompasses your whole body.<br>\r\n<br>\r\n“Breast reduction is already beginning,” the nurse says again, pointing at a display on the monitor.<br>\r\n<br>\r\nIt is then that you notice that the bra you bought a couple months ago is feeling strange, as if it were a size or two too large.<br>\r\n<br>\r\n“Hmm, it’s going even faster than I thought,” the doctor says, surveying you. Your bra feels even looser now, and the cool breeze hitting your buttocks tells you that those hip-hugging jeans you squeezed into this morning aren’t quite the right size anymore.<br>\r\n<br>\r\n“What’s going on, doctor?” you almost shout, alarmed.<br>\r\n<br>\r\n“Simple. You’re getting younger, of course.”<br>\r\n<br>\r\nAs you feel your receding hips create even more space between themselves and your pants, you realize that this guy was serious. You are getting younger, and you don’t know when it’s going to stop.<br>\r\n<br>\r\n“She’s sixteen; we should see some shrinking now,” calls the nurse.<br>\r\n<br>\r\n“How young will I get?” you ask desperately.<br>\r\n<br>\r\n“That’s what we’re finding out,” he says with a little smile.<br>\r\n<br>\r\nYour breasts are still shrinking, the cups of your bra hardly even touch them anymore. You can tell you’re getting shorter, as your feet are starting to slide up and into your pants. Your shoes start to feel loose.<br>\r\n<br>\r\nPlease, please, just stop, you think to yourself as you continue to regress. Your butt and hips must be shrinking away, because your jeans feel huge. The sleeves of your sweater are creeping down your hands, hands that don’t look quite like your own anymore; they are softer, and the nails aren’t quite as pointed now. Looking at the computer screen, you see that your estimated age is fourteen. You’re hardly old enough to be in high school, much less college!<br>\r\n<br>\r\nA peculiar feeling is in your chest. You can literally feel your boobs shrinking, the mounds beneath your nipples melting away. Soon everything starts to grow around you as you shrink. Your shoes fall off your feet and onto the floor, and your now-skinny legs are covered more and more by your pants. Your sweater is huge on your dwindling frame.<br>\r\n<br>\r\n“Please! Stop this!” you cry out. Your voice has become higher in pitch.<br>\r\n<br>\r\n“Sorry, can’t do anything. Plus, you signed the waiver,” comes the cold reply from the doctor. He turns back to the computer and the nurse. “She’s going back through puberty now, make sure it records everything.”<br>\r\n<br>\r\nAnd he’s right. You feel a bizarre tingle at your crotch and realize that was your pubic hair vanishing. Your already dwarfed breasts retract all the way back into your chest, leaving boyish nipples. You’re shrinking even faster now, everything starts to look so big. Your hips no longer even touch the waist of your pants, you only feel the silky seat of your too-big panties. You’re officially prepubescent now, completely sexless. And you’re still regressing. Your sweater becomes larger and larger on your girlish body. The room becomes huge. You hardly even register the rest of the ordeal.<br>\r\n<br>\r\n“I think she’s stopped,” says the nurse, who sounds so intimidating to you. The doctor looks over at you and smiles. He pulls out a mirror and lets you look into it. You can hardly believe your eyes: it’s a little girl, not a day older than five. You try to raise a hand to your face, but it’s covered by the sleeve of an adult-sized sweater. You look down to the ground, which now seems to be a formidable distance. You see two empty jean legs dangling from the table, just as your legs used to be positioned. You wiggle your feet and see the motion in the thigh area of the pants.<br>\r\n<br>\r\n“Let’s get you out of those clothes,” the doctor says soothingly. He reaches his gigantic hands toward you, and lifts you in the air with ease. Your pants fall to the floor in a heap, but you’re still covered by your sweater. You feel your panties slip down to your ankles, where they hang for a brief moment, then fall to the ground. He sits you down on another table and strips the sweater off you.<br>\r\n<br>\r\n“Hey!” you protest in a high-pitched squeal. You’re completely naked, with this man looking at you! Of course, this is nothing new to a college girl like yourself, but now you have the body of a child. The doctor holds out a pair of childish white cotton panties and slips them up your legs and to your waist. “I can do it myself!” you say indignantly. He shrugs and hands you the rest of your outfit. It’s a yellow dress, appropriately sized. You slip it on.<br>\r\n<br>\r\n“Now, come with me,” he says. He lifts you off the table and places you on the ground. Now you realize how small you have become. Everything is so tall and scary! You can’t imagine how you’d be able to reach anything on the counters, or sit in any of these grown-up chairs. The doctor motions for you to follow him, and you grab his hand. He smiles and squeezes it lightly. <br>\r\n<br>\r\nThe doctor walks with you to another place where a new life awaits you, and you do have the thousand dollars. Maybe it won’t be so bad.</span></div></div>",
            "created":1095570000,
            "id":217289,
            "title":"Woman to Girl"
        }
    },
    "info":{
        "author_id":"grennd",
        "author_name":"Grennd",
        "brief_description":"Various items capable of altering the ages of people are introduced, wreaking havoc.",
        "created":1086517680,
        "description":"<td align=\"left\" class=\"norm\">This is an AR-based interactive story I made for the AR Story Archive. Please add anything you like, as long as it has AR/AP, or sets the stage for it. Go ahead and add characters and whatnot as you like.</td>",
        "id":855553,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1555941300,
        "modified":1555941300,
        "pretty_title":"Continuous Age Regression Story"
    }
}