{
    "chapters":{
        "1":{
            "author_id":"nokokomomo",
            "author_name":"Nokokomomo",
            "choices":[
                "The magic enchants a polished dumbbell at a gym...",
                "The magic enchants one of the girls' swimsuits at the beach...",
                "The magic enchants one of Twilight's inventions in her lab...",
                "The magic enchants a body-altering computer program...",
                "The magic enchants a beaker with the cold flu in it..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When nobody was watching, a small sliver of magic shot out of the cracked statue in front of Canterlot High. The magic hovered in the air for several seconds before shooting through the air towards...</span></div></span></div>",
            "created":1524636420,
            "id":2484174,
            "title":"New Magic Enters Canterlot City..."
        },
        "13":{
            "author_id":"goldscout",
            "author_name":"GoldScout",
            "choices":[
                "A batch of experimental seeds",
                "An 'improved' VR device ",
                "A prototype disease-examiner",
                "A device to 'safely' extract magic from where it doesn't belong"
            ],
            "content":"<div class=\"\"><div> <span>The small sliver arched about the city, it's final destination brining what appeared to be a simple house in town. Continuing on it's way, it sparked and stuttered along the walls before finding an open window.<br>\r\n<br>\r\nThe alarm over Twilight' s head flashed red, causing the purple teen and her dog to jump out of bed and land right on the floor. \"Ugg...\" Twilight moaned as she untangled her body from the state she was in before glancing to the alarm. \"Spike! We have an intruder in the lab!\" With a nod, the dog bounded off towards the area in question with Twilight close in tow. With her shivering hands glowing in a magical aura ready to strike whoever was in the room, she opened the door and rushed in. \"Alright, whoever is in here just give up now.\" The nerd' s eyes darted about the room, trying to find whatever could have tripped the alarm. After finding nothing over the course of multiple deep breaths, her eyes finally settled on the window, open only enough for some small insect to get in.<br>\r\n<br>\r\n\"Uggg, false alarm again. I really need to recalibrate the system sometime.\" Twilight calmed her magic down, flicking a switch beside her to end the warning . \"Take a look around though Spike, you never know.\" The duo began glancing over the benches and burners in the lab. As Twilight continued her search, she began to notice a strange glow coming from the table behind her. Turning around, she found the glow was coming from....</span></div></div>",
            "created":1544798940,
            "id":2589026,
            "title":"The magic enchants one of Twilight's invent..."
        }
    },
    "info":{
        "author_id":"nokokomomo",
        "author_name":"Nokokomomo",
        "brief_description":"Strange magic finds its way into Canterlot City, causing sudden muscle growth all over.",
        "created":1524633000,
        "description":"<td align=\"left\" class=\"norm\">Some rules to read if you want to add some chapters to this Equestria Girls FMG interactive story.<br>\r\n<br>\r\n-All the MLP characters are allowed to be used but only characters present in the MLP universe. So no comic characters like Powergirl, Hulk, or anything like that. Only MLP characters. You can reference them but they will stay fictional characters in the story and won't make appearances.<br>\r\n<br>\r\n- Sex is allowed.<br>\r\n<br>\r\n- Nothing dark like sudden death, one of the girls going homicidal (cough-Pinkie Pie-cough), or something like that.<br>\r\n<br>\r\n- Please keep them in-character and no OOC.<br>\r\n<br>\r\n- Canon of the story is set during the Equestria Girls Digital Series.<br>\r\n<br>\r\n- Girls can grow as big as you like but please stay within reason. No \"Her muscles and breasts grew as big as the universe in seconds\" kind of stuff.<br>\r\n<br>\r\n- Males are allowed to grow too but girls have to be the main focus. If a guy grows, there has to be some female growth as well.<br>\r\n<br>\r\n- Don't worry if you're a bad writer. With my experience as an editor, I'll edit your chapter to make it as best it can be.<br>\r\n<br>\r\n- There will be spoilers for all the Equestria Girls movies and episodes inside. Don't proceed if you don't like spoilers. Then again, why are you here if you haven't watched all of MLP FIM and it's Equestria Girls spinoff? Go and watch them. They're all amazing.<br>\r\n<br>\r\n- Further rules will be written here in case they come up.<br>\r\n<br>\r\nHope you enjoy this interactive story and decide to add some of your own written chapters to the story.</td>",
        "id":2156377,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1544798940,
        "modified":1544798940,
        "pretty_title":"Equestria Girls- A New Kind of Magic"
    }
}