{
    "chapters":{
        "1":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Scavenge the wreckage",
                "Try to build a signal fire",
                "Head into the jungle",
                "Go for a swim",
                "Stay put"
            ],
            "content":"<div class=\"\"><div> <span>Scarlett Johansson awoke with a moan.<br>\r\n<br>\r\n\"What happened?\" She asked herself as she sat up. The last thing she remembered she was on a yacht out at sea where she was doing a photoshoot for Esquire when a massive storm hit. Snapping fully awake she looked around her surroundings and realized she was no longer on the yacht. Instead she was on a beach with ocean before her, and a jungle to her back. In distance to her left Scarlett could see the wreckage of the yacht. Examining herself she saw that was still completely dressed in the outfit she wore for her photoshoot. A sleeveless tan top and white under shirt that exposed her cleavage, gray shorts that left little to the imagination, and she was completely barefoot.<br>\r\n<br>\r\n\"Now what do I do?\" Scarlett again asked herself as she slowly got up on her feet. She actually had a few options. She could try and scavenge the wreckage for supplies, but who knew if there was still anything useful on board. She could try and start a fire to try signal any passing ships for a rescue, but who knew what else it might attract. She could head into the jungle to try and find food and shelter, but who could say what dangers lurked in there. She could go for a swim and try to get her mind off of things for a little bit, but was now really the best time for it? There was also the possibility she wasn't the only survivor and the others might be searching for her, so it might be best to stay right where she was.<br>\r\n<br>\r\nIn the end Scarlett decided to...</span></div></div>",
            "created":1478235600,
            "id":2232593,
            "title":"Stranded"
        },
        "12":{
            "choices":[
                "Try and and find more wood and kindling on the beach",
                "Check the jungle's edge for coconuts or fresh water",
                "Wade into the shallows to find large rocks for a sign",
                "Settle for what little firewood she had and wait for dusk",
                "There's no time - she's interrupted by something else"
            ],
            "content":"<div class=\"\"><div> <span>As the mid-day sun bore down on Scarlett, she frowned, briefly considered her predicament. \"Weather's obviously cleared, so I must have been drifting for some time after the storm...\" She sighed deeply and fidgeted with the hem of her shirt, trying not to dwell on the likelihood that all the ship's crew and photographers had just perished in the ocean. \"Not how I'd expected the day to go...\"<br>\r\n<br>\r\nA gentle breeze swept across the beach, dusting her exposed calves with fine white sand, and she felt her lips drying in the wind. \"I'm going to find myself quite thirsty pretty soon, but it'll be best if I can get a fire built before nightfall.\" Quickly scanning the beach around her, she was frustrated to find only a few sparse twigs laying about and a single piece of driftwood. \"Not much for a proper fire...\" Her eyes flickered inland to the hard line of the jungle's edge, but the idea of venturing into those dark, shadowy trees unsettled her.<br>\r\n<br>\r\n\"I'll just have to wait for dusk then, and try to light these twigs and whatever other kindling I might find... <i>someone</i> will come looking for me... right?\" The reality and peril of her situation suddenly settled on her, and she had to fight down a sob. A few rapid breaths later, Scarlett had collected herself, \"keep your cool, girl. Just... <i>focus</i>. I need to find water, but I also need to find more wood if I want to make a large enough fire. I could try gathering stones to make some kind of message on the beach, too. What to do?\" In the end, Scarlett decided to...</span></div></div>",
            "created":1478581200,
            "id":2234456,
            "title":"In Search of Materials"
        },
        "123":{
            "choices":[
                "A massive sixteen-foot tiger shark is circling her",
                "She's being hunted by a startling huge water snake",
                "[Reader's Choice]"
            ],
            "content":"<div class=\"\"><div> <span>Deciding in favor of the permanence of a stone S-O-S sign, Scarlett tried to lighten her own mood, smirking slightly to herself, \"at least I get to walk on a tropical beach, and I'm already in the perfect outfit - and there's not a single paparazzi for miles...\" Stepping down the gentle slope of the beach, she dipped a toe into the surf and found the water warm and inviting. \"Alright, let's gather up some rocks then.\"<br>\r\n<br>\r\nScarlett set to work, wading out into the gentle waves usually no further than knee-deep until she found a sizable stone, hefting it, and then returning it to a steadily growing pile on the sandy shoreline. As she worked, she let her mind wander, humming tunes and daydreaming beneath the slowly descending sun. Before long, her rock pile could easily have filled a respectable wheelbarrow, and she was having to wade out deeper into the waters to find good-sized stones.<br>\r\n<br>\r\nOn what must have been her hundredth trip out into the shallows however, something happened. She had waded out from the shoreline a good hundred feet and was scanning the waist-deep water for a last stone when she felt something brush against the back of her thigh. Spinning about quickly she tried to locate the source of the intrusion, but the lapping waves and reflecting sunlight made it hard to see properly. Still, it only took her a moment to spot the animal. Her heart froze in her chest...</span></div></div>",
            "created":1478581200,
            "id":2234470,
            "title":"A Quick Dip In The Shallows"
        },
        "1231":{
            "choices":[
                "The shark knocked her forward into the water (soft vore)",
                "The shark's jaws closed sharply around her legs (hard vore)",
                "She reached the shallows - she had made it to safety!"
            ],
            "content":"<div class=\"\"><div> <span>Scarlett felt her breaths coming in short, panicked gasps at the sight of the monstrous predator as its grey dorsal fin cut smoothly through the belly-deep water around her. For a moment she could do nothing but stare in terrified awe at the circling animal, her fear holding her solidly in place. The shark seemed impossibly large - from its cold, black eyes to the tip of its tail it spanned a length three times Scarlett's own height, and it could very easily have weighed a ton.<br>\r\n<br>\r\nLike a shell-shocked soldier returning to their senses, reality came sweeping back to the petrified actress, and her eyes darted to distant shoreline. Her mind was racing. <i>Can I make it? The water is shallow - if I can get far enough, it'll beach itself. Shit! What was I thinking!?</i> Scarlett whimpered with fear, her legs trembling as the patient predator completed another circle around her.<br>\r\n<br>\r\nSuddenly, on impulse, she made her move - the water that had once seemed so inviting now felt like molasses, slowing her as she frantically half-ran-half-swam toward the shore. <i>Ohh god, please... pleeease...</i> She lost track of the shark in her panic, focusing only on each stride carrying her to safety. <i>Come on girl, -move- your ass!</i> Was the beast behind her? Was that its nose prodding at her legs? <i>Fuck! Oh no, no, no no nooo...</i> The shoreline was drawing nearer, and a glimmer of hope flickered in Scarlett's mind, when suddenly...</span></div></div>",
            "created":1478581200,
            "id":2234481,
            "title":"Nature's Perfect Hunter"
        },
        "12311":{
            "content":"<div class=\"\"><div> <span>The shark knocked her over onto her stomach. Before Scarlett could react, the shark grabbed her side and pulled her away from the shore. Scarlett could see the side of the shark and the shore getting smaller. The shark eventually let her go and started to swim around her again. Scarlett's side hurt, but it wasn't too bad. However, she knew what was coming, and the shore was too far away from her. After the shark circled around her once, it charged at her head. The shark grabbed Scarlet and started to swallow her, being careful not to bite. This shark in particular loved to feel prey struggling in its stomach. It kept moving forward, eventually swallowing Scarlett's legs. She had soon gotten to its stomach. It was dark and cold. As the poor girl began to lose consciousness, she beat on the walls, hoping to upset the stomach. After what felt like hours, Scarlett couldn't fight anymore and fell into a deep slumber. She would never wake up again.</span></div></div>",
            "created":1491282000,
            "id":2299641,
            "title":"The inside of a shark's stomach"
        },
        "12312":{
            "content":"<div class=\"\"><div> <span>Pain like Scarlett had never felt before lanced through her legs and up her spine like a white-hot lance as the shark surged forward, sinking its teeth into her lower thighs and calves. For the briefest moment she could see palm trees swaying lazily on the beach, and then the shark thrashed violently, sweeping her underwater. Her nostrils and mouth filled with water and she screamed uselessly, streaming bubbles into the red, churning water.<br>\r\n<br>\r\nIn the back of her mind, she felt the bones in her legs crunch and crack in the shark's jaws as it pulled her back out into the deeper water before suddenly releasing her. Flailing her arms, Scarlett breached the surface of the water, loosing a gargling, coughing shriek of agony as the predator circled 'round again. <i>Oh jesus, ohh fuck no no no please...</i> Her vision blurred and faded slightly as the pain pulsed through her, and she couldn't bring herself to look down at what was surely the mangled remains of her once-famous legs.<br>\r\n<br>\r\nIt happened like a flash. The snap-away at the of a film scene. Cut. End take.<br>\r\n<br>\r\nOut in the deeper waters, the tiger shark was free to move at its normal striking speed. As Scarlett floundered in the water, doomed and bleeding profusely, the predator struck like a freight train. Its jaws gaped wide, pearly teeth glinting in the sunlight at the edge of its maw, and then they sank deep into the flesh of Scarlett's torso and waist as she was plunged underwater. The sheer violence of the attack was immediately fatal. A few quick, utterly destructive bites from the shark and the once Hollywood starlet's body was crushed, eviscerated, and swallowed whole. Then silence.<br>\r\n<br>\r\nA few floating scraps of Scarlett's silken outfit and a cloud of dissipating red were all that remained in the deep, unforgiving ocean.</span></div></div>",
            "created":1478581200,
            "id":2234489,
            "title":"A Surf-Side Massacre"
        },
        "1233":{
            "author_id":"friedcats222",
            "author_name":"None",
            "choices":[
                "It did",
                "It didn’t, and it wanted to be friends",
                "It didn’t, and it swam away"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Suddenly a water snake popped out of the water. The snake look at her. The war a bit snake, and it could probably eat her whole if it wanted to. Scarlett was wondering if it did. She got her answer when...</span></div></span></div>",
            "created":1542372540,
            "id":2578547,
            "title":"A water snake"
        },
        "13":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Head down the path covered in vines",
                "Head down the clear path",
                "Nothing, a series of tremors start coming towards her",
                "Nothing, something pulls her up into the trees"
            ],
            "content":"<div class=\"\"><div> <span>\"I can't just stay here,\" Scarlett said. \"I have to find food and shelter.\" With that she turned around and walked into the jungle.<br>\r\n<br>\r\nShe searched the jungle for what seemed like hours, but had yet to find anything. Through the trees she could see the sun getting lower in the sky. If she didn't find shelter soon she would be subjected to the trials of the night such as the cold, darkness, and maybe even predators.<br>\r\n<br>\r\nThat last thought made Scarlett stop dead in her tracks. She hadn't considered the possibility of predators on the island. The very idea that something could attack and eat her at any time sent a chill down her spine. Becoming the world's sexiest dinner definitely  wasn't how she would want it to end. It was to late to change her mind now though. She had not been keeping track of where she was going, and the shoreline was nowhere in sight. So with a sigh Scarlett continued to move forward.<br>\r\n<br>\r\nAfter an hour of walking, Scarlett came across two paths. One that was covered in vines and one that was clear. Realizing that this was her best bet to find shelter she decided to take one of these paths and see where it leads, but which one? The path covered in vines might not only lead to shelter but possible a source of fruit as well, but those vines made her nervous. The other path was neater, but what if it was a game trail? She pondered over this a bit, and eventually Scarlett decided... </span></div></div>",
            "created":1478494800,
            "id":2233953,
            "title":"Head into the jungle"
        },
        "131":{
            "choices":[
                "...the thick vines around her began to move",
                "...there was an animalistic noise behind her",
                "...she thought better of it, deciding on caution"
            ],
            "content":"<div class=\"\"><div> <span>Scarlett stood for a moment, considering her options as the sounds of the jungle echoed around her. Before long however, her musings were interrupted by a low gurgle coming from her belly. She sighed exasperatedly, running her hands through her  now slightly dampened hair, \"I'm going to <i>have</i> to trudge through that overgrowth... I've never hunted anything in my life, so foraging is really my only hope of getting food.\" She glanced down at her belly as another short gurgle cemented her choice. \"Well, best get to it then...\" Scarlett steeled herself, and then plunged into the thick, leafy vines, determined.<br>\r\n<br>\r\nAs the former actress padded along through the foliage, she became increasingly aware of just how exposed she was. The occasional twig or thorny vine would scratch at her shoulders and midriff, and her periodic yelps of pain punctuated the general quiet of the jungle each time she stepped on a sharp stone or root. Just when her patience and her optimism were beginning to falter, she stopped in her tracks, focusing on a sudden new smell. It was sweet, like some fruity syrup almost, and the scent was a fresh relief in the otherwise muggy atmosphere of the jungle.<br>\r\n<br>\r\nStepping off to the side of what could barely be called a path that she had been following, Scarlett pushed aside more vines and ferns, moving toward the smell. Shoving a final large vine out of her way, her gaze fell upon a most unusual bit of vegetation - in the center of a small clearing, suspended from the canopy by thick, coiling trailers, was an immense pitcher plant.<br>\r\n<br>\r\nThere wasn't any question in Scarlett's mind; this plant was surely the source of that delicious smell. Her hand moved to the smooth curve of her belly as her stomach gurgled again. \"I just have to cut it down, or tip it over or something... it must be some sort of sweetened rain water in there. <i>Gods</i>, I could go for a drink right now.\" Mouth watering at the thought of sating her thirst and hunger, Scarlett stepped further into the clearing toward the plant, when suddenly...</span></div></div>",
            "created":1478494800,
            "id":2233985,
            "title":"Foray into the Foliage"
        },
        "1311":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Tried to climb up the vine",
                "Continued tearing at the vine",
                "Got saved by something else"
            ],
            "content":"<div class=\"\"><div> <span>\"What in the world?\" Scarlett said as the vines around her started to move. The closest one to her quickly wrapped itself around her legs and pulled her feet out from under her. She hit the ground hard enough to knock the wind out of her. As she recovered the vine began to pull her upwards.<br>\r\n<br>\r\n\"No, no, no,\" Scarlett cried out as she felt her legs being lifted off the ground. She clawed at the ground for any kind of purchase, but it was no use. Before she knew it she hanging upside down at least a good five off the ground, and rising. She looked up at the vine that had grabbed her, and could see no end to it.<br>\r\n<br>\r\n\"Let me go!\" Scarlett yelled as she began to struggle and tear at the vine to get free. Eventually, the vine began to lower her back down.<br>\r\n<br>\r\n\"Ha, giving up I see,\" Scarlett laughed. She looked back down and her heart sank at the sight before her. The vine was lowering her into the pitcher plant. \"This was a trap,\" Scarlett realized. \"I'm about to become plant food!\"<br>\r\n<br>\r\nShe had to do something and quick. So she...</span></div></div>",
            "created":1478581200,
            "id":2234357,
            "title":"Wrapped Up"
        },
        "13111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yes, the vine secrets a slippery substance",
                "No, she makes it"
            ],
            "content":"<div class=\"\"><div> <span>\"It can't end like this,\" Scarlett said as tried to figure out what to do. She was almost to the lip of the plant when she got a desperate idea. Reaching up as best she could Scarlett grabbed hold of the vine and started pulling herself up. She gained one foot then another.<br>\r\n<br>\r\n\"Yes, it's working,\" Scarlett exclaimed as she continued to pull herself up and away from the pitcher plant. However, was she celebrating too soon?</span></div></div>",
            "created":1478581200,
            "id":2234359,
            "title":"Tried to climb up the vine"
        },
        "131111":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>Scarlett's smile faded as the vine began to secrete a honey like substance the made her start to loose her grip. Then the vine unwrapped itself from her legs. Unable to hold on any longer, she screamed as she fell into the pitcher plant.<br>\r\n<br>\r\nScarlett landed in the plant's sweet smelling digestive juices with a splash. She quickly got back on her feet. The pool of digestive juices came up to her waist and her skin tingled were they made contact. To think she had wanted to get to them earlier, but now all she wanted was to get out before she was digested. Scarlett looked up at the mouth of the pitcher plant. It was a good six feet above her head. There was no way she'd be able jump up to it. Her only option was to try and climb out, and try she did. Unfortunately, every time she gained a foot or so, she would slide back down into the digestive juices. After a few minutes it didn't matter anyway as the lid of the pitcher plant closed, thus trapping the former actress inside. Despair washed over her as she collapsed to her knees, thus bringing the digestive juices up to her neck.<br>\r\n<br>\r\n\"So this is how it ends,\" Scarlett began to cry. \"All that hard work just to become plant food?\" Tears rolled down her face. Eventually, the tingling sensation of the digestive juices turned into a burning one. Scarlett screamed and thrashed in pain as she was slowly digested alive. Over the course of the day she was turned into nothing more than a nutritious soup. The mush that had once been Scarlett Johansson was absorbed by the pitcher plant before it reopened its lid to wait for its next meal.</span></div></div>",
            "created":1478581200,
            "id":2234365,
            "title":"Plant Food"
        },
        "132":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "A series of caves",
                "A mysterious compound",
                "A lake"
            ],
            "content":"<div class=\"\"><div> <span>\"It's possible that the clear path might be a game trail, but I don't like the look of those vines,\" Scarlett said, and started walking down the clear path.<br>\r\n<br>\r\nAs she walked down the path she become slightly unnerved by it. There was little to no vegetation on it, and she noticed that from time to time there were flat stones embedded in the ground as if the path had been paved at one point. The only sound she could hear as walked was the sound of her feet hitting the ground as walked. Just as Scarlett was thinking she had made the wrong choice the end of the path came into view. It turned out the path led to...</span></div></div>",
            "created":1478840400,
            "id":2235523,
            "title":"A Well Maintained Path"
        },
        "1321":{
            "author_id":"gavrelov89",
            "author_name":"Gavrelov89",
            "choices":[
                "A giant ogre",
                "A dragon",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>The entrance of the cave was large. Scarlett Johansson estimated it was at least fifty feet in height. Worse yet, it seemed artificial in construction. There were stones stacked into a perfect archway over its entrance.<br>\r\n\"Does that mean there are other people here?\" she said to herself. \"Or something else. \" She sighed. \"Well, it can't possibly be more dangerous in there than it is out here.\"<br>\r\nStill nervous, she walked towards the entrance of the cave. She noticed that the grown had a slight downward slope. At this point, she was far enough from the cave's entrance that it had become pitch black. That was, until, a light appeared. In the new dim light, she could see that she had reached a corner of the cave and that something was coming around it. It was...</span></div></div>",
            "created":1498712400,
            "id":2344638,
            "title":"Colossal Cave"
        },
        "13211":{
            "author_id":"gavrelov89",
            "author_name":"Gavrelov89",
            "choices":[
                "Ate her then and there",
                "Took her to his lair"
            ],
            "content":"<div class=\"\"><div> <span>Around the corner came a giant ogre carrying a torch. In the new bright light Scarlett Johansson could see that he had a fat, sagging gut covered in hair. His mouth hung open, his tongue drooling. He had crooked, yellow jagged teeth. She noticed, with fear, that his grinning mouth was more than large enough to fit.<br>\r\nShe gulped and ducked behind a rock, hoping the the giant had not seen her. But it was too late. The next thing she knew, she felt a big, strong, meaty hand wrap around her. She was once more engulfed in darkness as the giant conveyed her to its face. Its fist opened and she gazed out at his beady eyes, each bigger than her head.<br>\r\n\"Human,\" he said.<br>\r\nScarlett gulped in fear once more. \"Yes.\"<br>\r\n\"Woman,\" said the giant.<br>\r\n\"Yes,\" she said.<br>\r\n\"Human,\" the giant said. \"Human woman. Human woman, tasty food!\"<br>\r\n\"No!\" said Scarlett Johansson.<br>\r\n\"Yes,\" he said.<br>\r\nNext, the giant...</span></div></div>",
            "created":1498712400,
            "id":2344642,
            "title":"The Giant "
        },
        "132111":{
            "author_id":"gavrelov89",
            "author_name":"Gavrelov89",
            "content":"<div class=\"\"><div> <span>Scarlett Johansson tried in vain to escape his outstretched palm. Falling to her death would be preferable to digesting in his stomach, she thought. But the ogre was far quicker than his appearance would suggest and his hand closed tightly around the gorgeous actress.<br>\r\nThe hand carried her up further. Soon, she was dangling by one of her feet above his mouth. It was wide open beneath her. She could see his long, salivating tongue and his jagged, dirty teeth. She began to flail her arms about.<br>\r\n\"No!\" she said. \"No! Please!\"<br>\r\nBut the ogre didn't care. All he cared about was his next meal, and that was Scarlett Johansson. As far as he was concerned, the only place the beautiful, sexy young woman belonged was in his stomach, and it was beginning to grow restless with hunger.<br>\r\nHe lowered her in. His lips clamped around her waist, leaving her legs kicking outside his fat lips. His tongue began working on her, licking her all over, taking in her taste. Indeed, the woman was the best thing he had ever tasted. But his growling gut far below reminded him of his need for food. With a moist slurp, he too the rest of her into his mouth. With a light gulp, her head entered his throat.<br>\r\nScarlett screamed, but it was muffled by the flesh of his esophagus. She continued to kick, knowing it was futile and that she was running on pure survival instinct. With a few more gulps she was completely in his esophagus. Another, more powerful swallow squeezed her through a sphincter and into the ogre's stomach.<br>\r\nThe first thing that hit her was the smell. The indescribable stench hit her nose immediately and her eyes began to water. The next thing she noticed was the complete darkness, even darker than the cave. Next the sounds. The deeper parts of his digestive tract rumbled, anticipating the hearty dose of protein her sexy and delicious body would provide the giant.<br>\r\nFar above her, the giant burped. The air in his belly grew thinner. She began to feel lightheaded. Soon, she ran out of oxygen and passed out before his belly bgan to digest her.</span></div></div>",
            "created":1498712400,
            "id":2344646,
            "title":"The Ogre's Meal"
        },
        "132112":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yep! (Yum)",
                "Nope, she's dessert"
            ],
            "content":"<div class=\"\"><div> <span>The ogre's fingers once more wrapped around Scarlett as he took her to his lair. Inside the giant's fist Scarlett could feel the ogre walking back to his lair as she desperately squirmed in a futile attempt to escape before her captor ate her. After about twenty minutes the former actress suddenly felt a decrease in the ogre's movements.<br>\r\n<br>\r\n\"Are we at his lair?\" Scarlett wondered. She didn't have to wait too long to find out as the ogre's fingers once again unwrapped themselves from her. The next thing the shapely blonde knew she was screaming as she fell through the air. She landed with an 'oof' on a hard glass surface. Getting back on her feet Scarlett found herself in a giant glass jar, the walls of which were to steep for her to climb. Looking through the walls of her prison Scarlett was able to see just what the ogre's lair was like.<br>\r\n<br>\r\nAll in all it wasn't that different from a modern kitchen. Cabinets, fridge, sink, and a counter where the former actress's prison rested. The only real difference was that it was in a cave it lit by torches. However, Scarlett's attention was mainly on the giant sandwich ingredients the ogre had set next to her prison. The young woman's heart pounded triple time as she saw him begin to construct the massive sandwich. Was she going to end up as Scarlett Johansson sandwich?</span></div></div>",
            "created":1558450860,
            "id":2662224,
            "title":"The Ogre's Lair"
        },
        "13212":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "I'm A Famous Celebrity",
                "I'm a Better Slave Than Meal",
                "I Haven't Been Properly Prepared",
                "I'm Another Dragon's Pet"
            ],
            "content":"<div class=\"\"><div> <span>Scarlett stared up in terror as the massive green dragon came around the corner. She couldn't help but scream at the sight, bringing the dragon to a halt right in front of her. The Dragon looked down at the blonde woman and seemed to smile.<br>\r\n<br>\r\n\"Well, well what have we here?\" The dragon said in a masculine voice as he licked his lips. Scarlett didn't like where this was going on since he could easily devour her. \"It seems a tasty meal has come to me.\"<br>\r\n<br>\r\nScarlett's heart pounded in her chest. The dragon opened his mouth wide and lunged at the former starlet. She squeezed her eyes shut and turned her head and cried out, \"BUT YOU CAN'T EAT ME!!!\"<br>\r\n<br>\r\nShe waited to feel the dragon's maw clamp down on her, but it never came. Catiously, Scarlett opened her eyes and turned her head back around only to find herself inches from the massive creature's maw. The dragon slowly closed its maw and looked at the gorgeous woman with curiosity.<br>\r\n<br>\r\n\"Odd,\" The dragon said somewhat confused, \"I've had many meals beg for their lives over the years, but you're the first one to ever suggest that I wasn't allowed to eat her. Tell me what exactly makes it so I can't eat you?\"<br>\r\n<br>\r\nScarlett gulped and said... </span></div></div>",
            "created":1519850520,
            "id":2458997,
            "title":"The Dragon"
        },
        "132121":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>\"I'm a famous celebrity,\" Scarlett said. She looked at the dragon nervously as she hoped he would decide not to eat her. However, her heart sank as the dragon let out an amused chuckle. <br>\r\n<br>\r\n\"All that means to me my tasty morsel is that you'll taste better than the usual maidens I eat,\" The dragon said licking his lips. \"Now if don't mind I'd like to get back to eating you now.\"<br>\r\n<br>\r\nThe dragon opened his maw once more and lunged at the former actress once again. Scarlett tried to think of something else to say that might save her life,but all that came out of her mouth was a scream of terror as the dragon's maw came over her. Then her screams were silenced as the dragon's lips sealed around the gorgeous woman's ankles. Dragon lifted his head back up into the air, and the only part of Scarlett Johansson that was still visible to the outside world were her barefeet. All the former actress turned food could do to struggle was wiggle her feet and toes. Inside the dragon's maw though she was constantly being assaulted by the dragon's tongue as he tasted her. Scarlett was certain the fantastical reptile found her to be delicious as moans of pleasure rose from his throat and she became covered in saliva. After about ten minutes of tasting the tongue slid out and licked each of the lovely lady's toes and the soles of her feet. She squeaked and wiggled her feet and toes harder in response, but it was useless. With one slurp Scarlett felt her heels, soles, and finally toes squeeze past the dragon's lips as she was brought completely into his mouth. Then the dragon tilted his head back and with a mighty 'GULP' a bulge that was once Scarlett Johansson could be seen traveling down his long neck.<br>\r\n<br>\r\nInside the esophagus the powerful muscles slowly massaged Scarlett down to her slow demise of digestion. A mixture of saliva and mucus covered her from head to toe. The former actress squirmed in the constricting tube but gave up have way down as she realized it was pointless and that she was dragon food now. All too soon though Scarlett's journey came to an end when she came to the stomach sphincter. It recognized the former starlet as found and squeezed her into the stomach with a plop. Scarlett sat up in the fleshy chamber that was to be her end and looked around her dark surroundings. No longer was she one of the sexiest women alive, but instead a tasty meal for a hungry dragon. This realization hit her so hard that Scarlett brought her hands up to her face and began to weep. She wept as the digestive juices began to flow. She wept even as her bare flesh tingled where it was met but digestive enzymes. Scarlett only stopped weeping when she started screaming in agony due to the tingling turning into a horrible burning as she was slowly digested alive.  </span></div></div>",
            "created":1523898480,
            "id":2480402,
            "title":"A Meal is a Meal Even if it's Famous"
        },
        "13213":{
            "author_id":"friedcats222",
            "author_name":"None",
            "choices":[
                "Helped her",
                "Left her alone"
            ],
            "content":"<div class=\"\"><div> <span>It was a giant salt water crocodile. This thing was big enough to fit two people around Scarlett’s size in its mouth, and it hadn’t eaten in a while. Obviously, it’s first instinct was to find food, and for him, Scarlett was just that. It started to move towards Scarlett, and she tried to back away. “No, no, please. I’m not filling. I’m way too thin.” The crocodile didn’t even try to understand what she was saying, because crocodiles don’t speak English. The crocodile backed her to the side of a lake. Suddenly, a gigantic person popped out of the lake. Scarlett turned to this person. “Please, take me with you, save me.” The giant heard this and...</span></div></div>",
            "created":1542370800,
            "id":2578533,
            "title":"A Crocodile "
        },
        "132131":{
            "author_id":"friedcats222",
            "author_name":"None",
            "choices":[
                "Hello dear mortal friend",
                "Finally, food"
            ],
            "content":"<div class=\"\"><div> <span>The giant heard this and quickly picked her up. He stared down at the hungry crocodile, and then crushed it beneath his foot. He then looked down at Scarlett, as if to make a decision. Scarlett was confused what he was doing. Suddenly, the giant spoke up, and said...</span></div></div>",
            "created":1542370980,
            "id":2578534,
            "title":"Helped her"
        },
        "1321312":{
            "author_id":"friedcats222",
            "author_name":"None",
            "choices":[
                "Alright",
                "I’d rather eat you than be your friend "
            ],
            "content":"<div class=\"\"><div> <span>“Wait, what? No, no, no, I’m not food! I’m living!” The giant stared down at her and said “who said that food can’t be living?” Scarlett stared up and said “Wait, I can give you something you want!” “And what might that be?,” asked the giant. “Friendship,” replied Scarlett. The giant heard this and responded with...</span></div></div>",
            "created":1542371880,
            "id":2578541,
            "title":"Finally, food"
        },
        "13213122":{
            "author_id":"friedcats222",
            "author_name":"None",
            "content":"<div class=\"\"><div> <span>“No, please don’t! I can give you a different type of food!” The giant sighed at the stupidity of this woman. “Let’s just get this over with now.” Before Scarlett could say anything else, the giant tossed her into his mouth and swallowed her whole.</span></div></div>",
            "created":1542372060,
            "id":2578542,
            "title":"I’d rather eat you than be your friend "
        },
        "132132":{
            "author_id":"friedcats222",
            "author_name":"None",
            "content":"<div class=\"\"><div> <span>The giant heard this and left her alone. “No, please,” she yelled, falling to her knees. As she sat there pleading for the giant’s help, the crocodile slowly wrapped his tongue around her waist and dragged her into its large mouth. Soon, Scarlett was in its stomach lying down on her back, finally ready to just get it all over with.</span></div></div>",
            "created":1542371640,
            "id":2578537,
            "title":"Left her alone"
        },
        "133":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "A giant lizard",
                "A giant woman",
                "A giant cat",
                "A Giant Rabbit",
                "More options"
            ],
            "content":"<div class=\"\"><div> <span>Just as Scarlett was about to choose a path a tremor shook the entire area.<br>\r\n<br>\r\n\"Was that an earthquake?\" She wondered. She soon got her answer as more tremors shook the area accompanied by the sound of cracking trees. It took Scarlett no time at all to realize that the tremors were no doubt being caused by some massive creature. However what drove fear into the former actress's heart was the fact that the tremors were coming straight towards her location. Panicking Scarlett quickly looked for a place to hide. Noticing a particularly thick area of underbrush, she quickly dived into it.<br>\r\n<br>\r\nLaying flat on her stomach she only lifted head up enough to see out of the underbrush. The former actress's heart pounded in her chest as she watched for the source of the tremors. Then Scarlett's eyes widened in horror as the tremors were revealed to be coming from...  </span></div></div>",
            "created":1478581200,
            "id":2234405,
            "title":"Incoming Danger"
        },
        "1331":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Yes, and it looks hungry",
                "No, it keeps moving",
                "Doesn't matter, something forces her out of hiding"
            ],
            "content":"<div class=\"\"><div> <span>Scarlett had to clasp a hand over her mouth just to keep from screaming. The sight before her was that of a massive monitor lizard, easily four times her size. It stopped not more than five feet from her hiding spot, and Scarlett held her breathe as it seemed to start looking around the area.<br>\r\n<br>\r\n\"Is it looking for me?\" she whispered. She prayed not. The last thing she wanted was to be a giant lizard's lunch. It probably wouldn't even have to chew her. She shivered at the thought of that. Suddenly, Scarlett's heart froze in her chest as the lizard's gaze lingered on her hiding spot. Had it noticed her?</span></div></div>",
            "created":1478581200,
            "id":2234516,
            "title":"Monstrous Reptile "
        },
        "13311":{
            "choices":[
                "She leaps to the side and desperately tries to climb up a tree",
                "She dives under the roots of a tree and tries to hide herself",
                "Too late - the lizard overtakes her and knocks her to the ground"
            ],
            "content":"<div class=\"\"><div> <span>As Scarlett lay prone in the limited cover of the underbrush, the colossal monitor lizard's gaze suddenly settled in her direction. Her lips clamped shut as she subconsciously held her breath, utterly terrified at the prospect of being discovered.<br>\r\n<br>\r\nThe great lizard was equally still and calculating, its eyes were like pale yellow orbs, watching. Its long, forked tongue flicked out of its mouth and disappeared again, tasting the air for any sign of its prey. Scarlett could hear the reptile's heavy breaths like the sighs of a giant bellows. Her face was reddening, her body aching for the reprieve of oxygen. She bit her tongue, desperately trying to focus, but it was no use - her will failed, and she cringed as she gasped, her body betraying her as it sucked air into her lungs. She could hear the earth crunching beneath the monitor lizard's claws as it tensed - she was hidden from it no longer.<br>\r\n<br>\r\nThe game was up, and only her instincts had any hope of saving her. In an instant, the massive jungle predator was surging toward her, raw power surging through the muscles beneath its leathery skin. Rolling to her side, Scarlett felt her arms and legs scraping against the twig-strewn ground as the beast came inches from snapping its jaws around her. Like lightning she was on her feet, driven by fear and adrenaline as she took off running, ducking in between trees and vines, leaping overgrown roots. She could hear the lizard just feet behind her. She couldn't outrun it. She had to do something, or face becoming its next meal.</span></div></div>",
            "created":1478754000,
            "id":2235126,
            "title":"Prey On The Run"
        },
        "133112":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "The lizard finds her",
                "The lizard leaves",
                "Scarlett feels something touch her"
            ],
            "content":"<div class=\"\"><div> <span>As Scarlett ran for her life she noticed that several trees had enough roots above ground form mini caves for lack of a better. Realizing this an idea formed in her head. So as soon as there was a break in the lizard's line of sight and her Scarlett dived under a tree's roots. Like lightning she sat up and backed up to the very back of her hiding place. She quickly clasped her hands over her mouth to muffle the sound of her breathing as she listened to the lizard's approach. Scarlett nearly gasped when she saw the lizard's clawed foot right outside her hiding spot. It seemed that it was confused by her sudden disappearance, and was now looking for her. Her heart pounded so loudly in her chest she was terrified that the lizard would hear it. Yet somehow she manged to wait to and see what her predator would do. Then all of the sudden...</span></div></div>",
            "created":1478840400,
            "id":2235517,
            "title":"Prey in Hiding"
        },
        "1331121":{
            "choices":[
                "The lizard wastes no time and consumes Scarlett whole",
                "The lizard seems somehow playful and even... aroused? ",
                "[Reader's Choice]"
            ],
            "content":"<div class=\"\"><div> <span>Scarlett pressed herself as far back into the safety of the root-cave as she could manage, smearing mud into her scant clothes as she tried desperately to remain silent. The enormous monitor lizard had been thrown off her tail, but only briefly. Listening intently, she could hear the animal sniffing about for her, its tongue once again flicking the air as it searched for its prey.<br>\r\n<br>\r\nAll at once, the clawed foot that had been sitting at the entrance to Scarlett's hiding spot disappeared. <i>Is it... is it leaving...?</i> The actress moved her hands away from her mouth, hesitantly optimistic, and then allowed herself relax and let out a sigh of relief.<br>\r\n<br>\r\nThe monitor lizard seized the opportunity.<br>\r\n<br>\r\nBefore Scarlett could so much as react, the giant lizard's nose slammed into the dirt-and-root entrance to her sanctuary, no more than a foot from the actress's feet as her panic renewed. Scrabbling at the dirt wall behind her, the blonde starlet tried desperately to place some distance between herself and the predator's muzzle, but there was nowhere to go.<br>\r\n<br>\r\nSlowly, almost methodically, the lizard's forked, slimy tongue extended from between its lips, confirming the presence of its prey. Scarlett froze in fear as the eight-inch-thick slimy appendage snaked its way toward her and then, like a boa constrictor lazily grabbing its victim, it wormed its way around her calves.<br>\r\n<br>\r\nThere was nothing the starlet could do but watch, squirming as the tongue wrapped itself around her legs clear up to just below her waist, and then it happened - like the inexorable force of an industrial winch, the lizard's nose and tongue retreated from thr cave, pulling Scarlett back out onto the open, exposed ground.</span></div></div>",
            "created":1478926800,
            "id":2235837,
            "title":"Plucked Out From Safety"
        },
        "13311211":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>Scarlett watched in horror as the lizard opened its maw and started pulling her in. First her barefeet entered, and then her legs. Then the lizard gently clamped its jaws shut around her waist and lifted the former actress into the air. Not willing to die just yet, Scarlett began to pound her tiny fists on the lizard's snout in order to gain some freedom, but they had no effect.<br>\r\n<br>\r\n\"Let me go!\" she cried out as she felt the lizard's tongue unwrap itself from her legs. However, the lizard ignored her continued to lift her up into the air until she and its snout were pointing straight at the sky. Then it opened its maw and allowed gravity to let her slide the rest the way in. The blonde starlet's screams of terror were cut off by the lizard snapping its jaws closed, thus sealing her in darkness.<br>\r\n<br>\r\nInside the mouth Scarlett was beyond words and screaming now. She was quickly becoming covered from head to toe in the lizard's slimy saliva, and when she looked down her own body she could see that her feet were only inches away from the lizard's throat. Tears began to roll down her cheeks as she realized that she was no longer Scarlett Johansson, one the sexiest women alive, but instead a tasty meal. Hell the tasty part might not even be accurate since as far as the lizard may be concerned she was smaller than it, thus she was food. All too soon though she felt the lizard's tongue pressing down on the top of her head and she knew what was about to happen.The former starlet watched her feet enter the throat as she was pushed into it, and then she felt the lizard swallow her whole with a loud 'Gulp'.<br>\r\n<br>\r\nThus, Scarlett's journey through the esophagus began. The fleshy tube squeezed and compressed her downward's to her fate of digestion, as a mixture of mucus and saliva gathered onto her. Oddly enough though she found it to be quite relaxing. It was as if her entire body was being massaged. The beating of the lizard's heart as she passed by it was so soothing as well. Scarlett almost didn't mind the gurgling of the stomach below her as it became louder and louder. Soon her relaxation came to an end when she felt her feet hit a wall of flesh. It was none other then the stomach sphincter, and recognizing the former actress as food it quickly opened up as she was squeezed into the stomach.<br>\r\n<br>\r\nScarlett landed in the stomach with a splash. It was already filled with digestive juices ready to digest her. When standing up she noticed that they only came up to about her neck. Her skin tingled where the digestive juices touched her skin. Despair gripped her heart as she realized she was already being digested alive. She was lizard food now and there was nothing she could do about it.<br>\r\n<br>\r\n\"I guess there are worst ways to go,\" Scarlett said with a sigh. So she leaned back against one of the stomach's walls and closed her eyes. Sleep over took her almost immediately. Thus she was saved much pain as she was slowly digested alive over the course of the whole day.   </span></div></div>",
            "created":1479358800,
            "id":2238304,
            "title":"The lizard wastes no time and consumes Scarlett..."
        },
        "1331122":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "She continues to risk the jungle",
                "She tries to make it back to the beach",
                "She decides to allow something to eat her"
            ],
            "content":"<div class=\"\"><div> <span>Scarlett waited for what felt like an eternity as she stared at the lizard's foot. She could hear it trying to find her again. The thought of it finding and eating her was almost too much for the blonde starlet to bear. She was certain it would find her any second as the lizard's forked tongue tasted the air for her. Then just as Scarlett was considering coming out from hiding and getting it over with the lizard's foot disappeared from view.<br>\r\n<br>\r\n<i>Is it leaving?</i> She wondered. Her answer came when she felt the lizard's footsteps moving away from her until they disappeared altogether. Slowly removing her hands from her move she let out a sigh of relief. The she crawled to the entrance of her sanctuary and cautiously stuck her head out.<br>\r\n<br>\r\n\"That was too close,\" Scarlett whispered to herself as she made sure the coast was clear before completely emerging from safety. The thought that she had almost been eaten made her tremble. She still need to decide what to do next though. She could continue exploring the jungle and risk almost being eaten again with the root cave acting as her shelter. Though she could also try and make it back to the shoreline and wait for rescue there. However, there was also a third option that Scarlett wasn't too fond of. If the lizard was any indication the on this island she was no longer one of the sexiest women alive, but instead the sexiest main course in the world. It could only be a matter of time before something ate her. Maybe it would be best to just find another predator and allow herself to be eaten. Scarlett tried to shake that last thought from her head as she tried to decide what to do.</span></div></div>",
            "created":1479099600,
            "id":2236958,
            "title":"Safe for Now"
        },
        "13311221":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "Looks for the sweet scent",
                "Looks for thee water",
                "Is found by a predator"
            ],
            "content":"<div class=\"\"><div> <span>\"This little root cave should make a save enough shelter for now,\" Scarlett told herself. \"I just need to find food and water now.\" <br>\r\n<br>\r\nWith that the blonde starlet once again braved the jungle. As she walked she made sure to leave behind enough of a trail make sure could find her way back to the root cave in case she had to avoid another hungry predator. After about half an hour of exploration Scarlett noticed two things. One was sweet scent, and the other was the sound of running water. However, as far as the lovely actress could tell the sources of both were in opposite directions. On one hand the sweet scent could mean food that Scarlett could eat, but on the other hand the water meant she could get something to drink. Question was was Scarlett more hungry or thirsty? Scarlett...</span></div></div>",
            "created":1600098600,
            "id":2902857,
            "title":"Risking The Jungle"
        },
        "13311223":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "choices":[
                "A Lake",
                "A Cave",
                "A Carnivorous Plant",
                "A Hungry Predator"
            ],
            "content":"<div class=\"\"><div> <span>\"I can't take this,\" Scarlett said collapsing to her knees with a sob. \"It would have been better to let that lizard eat me.\"<br>\r\n<br>\r\nSurely it was only a matter of time before she found herself digesting in a stomach. Getting back to her feet, Scarlett resolved herself to find another predator and go on ahead and get her fate over with. With a sigh she proceeded further into the jungle. After about an hour of walking Scarlett came across...</span></div></div>",
            "created":1519848780,
            "id":2458972,
            "title":"Scarlett Decides to Contribute to the Food Chain."
        },
        "133112234":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "a gray wolf",
                "an asiatic cheetah",
                "Other (reader's choice)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what is the predator?</span></div></span></div>",
            "created":1520810520,
            "id":2463267,
            "title":"A Hungry Predator"
        },
        "133113":{
            "author_id":"model7",
            "author_name":"Gojira6",
            "content":"<div class=\"\"><div> <span>Before Scarlett could do anything she felt the lizard's snout slam into her back. She landed on the ground with a thud, the air forced out of her lungs. By the time she recovered her entire view was taken up by the sight of the lizard's open maw coming towards her. She screamed in terror as the reptile's jaws clamped shut around her waist.<br>\r\n<br>\r\nWith its prey now helpless the lizard lifted its head back up as Scarlett's legs kicked in the air as the former actress tried to gain her freedom. Unceremoniously the lizard slurped her legs into its maw like a pair of noodles. Then the lizard tilted its head back back and with a loud gulp  it swallowed the starlet whole. The bulge that was once Scarlett Johansson could be seen traveling down the lizard's neck.<br>\r\n<br>\r\nMeanwhile on the inside Scarlett was having a terrible time as the esophagus squeezed and compressed her downwards to her tomb. Saliva and mucus covered her from head to toe.She could hear the beating of the heart as she passed by it, but what unnerved her was the gurgling of the stomach as she came closer and closer to her demise. Soon she came to a wall of flesh that was none other than the stomach sphincter. It quickly opened up to accept her as food and she was pushed into the stomach.<br>\r\n<br>\r\nOnce inside the stomach Scarlett stood up as best she could, but the stomach was so cramped that she had to arch her back in order to stand. She started to punch and kick the stomach walls in order to get the lizard to let her out to no effect. Before long though she started to feel a tingling sensation on her feet, and she looked down only to scream in terror once again. The digestive juices had started to seep in and were rising. Scarlett's struggles became more desperate, but it was no use. Soon the digestive juices were up to her waist, and the tingling sensation had turned into a severe burning. She screamed in pain as she was digested alive. Her only salvation that day was that she quickly passed out from the pain before she was completely digested.     </span></div></div>",
            "created":1478840400,
            "id":2235501,
            "title":"Lizard Lunch"
        },
        "1332":{
            "choices":[
                "Try to move away from the giantess quietly",
                "Go up to the giantess and greet her",
                "Too late, the giantess reached out and grabbed Scarlet"
            ],
            "content":"<div class=\"\"><div> <span>The giantess in front of her had long pink hair and blue eyes. The only thing the giantess was wearing was a bra and underwear, both made of some kind of fur. The barefooted giantess stopped just a few feet away in front of Scarlet. She didn't seem like she was doing much, but Scarlet was careful to stay as still as possible. The giantess got onto her hands and knees and looked around. Scarlet could see her giant mouth salivating a little. After a minute, the giantess looked towards Scarlett's direction.<br>\r\n<br>\r\n\"I smell you human. I know you are there.\" She said in a soft and gentle voice, but Scarlet had a feeling the giantess was trying to find her for something bad. Scarlet had no idea if she should try to move or not.</span></div></div>",
            "created":1490850000,
            "id":2297586,
            "title":"Suspicious giantess"
        },
        "1333":{
            "author_id":"friedcats222",
            "author_name":"None",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Scarlett walked up to this cat. “Well, aren’t you cute. Who’s a good girl?” She went over to pet it, but the cat had other intentions. It quickly picked her up in its paw and dropped her into its mouth before she could even comment.</span></div></span></div>",
            "created":1542372300,
            "id":2578543,
            "title":"A giant cat"
        },
        "134":{
            "author_id":"friedcats222",
            "author_name":"None",
            "content":"<div class=\"\"><div> <span>As Scarlett pondered what to do next, she was unaware of her surroundings. Suddenly, from the tree behind her, a long, green wire shot out and wrapped around her torso, pulling her into the trees. It was an anoconda. Scarlett tried to escape, but couldn’t, and was promptly swallowed by the giant snake.</span></div></div>",
            "created":1542370140,
            "id":2578529,
            "title":"Nothing, something pulls her up into the trees"
        },
        "14":{
            "choices":[
                "She made it back to land",
                "A giant squid girl grabs her",
                "A shark  grabs her",
                "A female harpy pulls her into the sky",
                "A pelican grabs her"
            ],
            "content":"<div class=\"\"><div> <span>Scarlett really liked to swim and she was very good at it. She took off all of her clothes and got into the water. The water was cool and she felt calm. As she swam, she looked around. Only the island was visible, no other islands or boats. She turned onto her back and floated for a while, listening to the quiet water. She breathed softly, relaxed and feeling safe. . . For the moment.<br>\r\n<br>\r\n\"Ah, this is nice.\" She said, closing her eyes. Unknowingly to her, something was currently looking at her. As it moved closer, Scarlett heard a sound. \"Hm?\" She looked around, but didn't see anything. However, she realized she wasn't in the best position. After all, she was a defenseless naked girl, alone, in the water where she was easy to get. A predator would have little problems grabbing and devouring her.Whatever was after her made another sound. She quickly started to swim back as fast as she could. Whatever was coming after her was moving faster now. She was getting close to land.</span></div></div>",
            "created":1490850000,
            "id":2297488,
            "title":"Defenseless in the water"
        },
        "144":{
            "choices":[
                "Tracy decided to eat Scarlett now",
                "Tracy decided to save Scarlett for now.",
                "Another harpy showed up"
            ],
            "content":"<div class=\"\"><div> <span>She was almost to land, she could make it. Suddenly, something grabbed her and pulled her naked body out of the water and high into the air. She looked up to see a giant harpy had her in her claws.<br>\r\n<br>\r\n\"Wha . . Who are you? Where are you taking me?\" Scarlett yelled to it. The harpy stopped and hovered in the air. She then looked down at Scarlett and smiled.<br>\r\n<br>\r\n\"Hi there. My name is Tracy. Don't blame me for picking you up, I needed a tasty fish to eat.\" Tracy said, licking her lips.<br>\r\n<br>\r\n\"But . . But I'm not a fish.\" Scarlett starts to struggle, Tracy doesn't even flinch.<br>\r\n<br>\r\n\"I'm pretty sure you are. After all, you were in the water with no clothes. Fish don't wear clothes. You were also swimming and you're squishy like a fish.\" Scarlett couldn't believe what she was hearing. This harpy couldn't tell the difference between a human female and a fish. As the harpy started to fly again, Scarlett started to cry.<br>\r\n<br>\r\n\"Please look closer. I'm not a fish! I breathe air, and I have hair!\"<br>\r\n<br>\r\n\"Oh, so you're a mermaid then. Good, those are extra tasty,\"<br>\r\n<br>\r\n\"No! I have legs and no scales!\" Scarlett was trying to do her best, but Tracy wasn't listening. Soon Scarlett could see a nest coming closer. She was dropped in and Tracy got comfortable.<br>\r\n<br>\r\n\"All right Ms. Mermaid, I'm getting hungry so no more struggling.\" Tracy came closer to Scarlett.<br>\r\n<br>\r\n\"Please, wait until tomorrow, look, the sun is even setting! You could eat me for breakfast!\" Tracy put one claw on Scarlett and thought about it.</span></div></div>",
            "created":1490936400,
            "id":2297937,
            "title":"Taken to a nest"
        },
        "15":{
            "author_id":"friedcats222",
            "author_name":"None",
            "content":"<div class=\"\"><div> <span>Scarlett chose to stay put. Little did she know that on vore island, this was one of the stupidest things you could do. Unfortunately for her, she found out quickly as a big, toothless bear with a mouth big enough to fit a helicopter and a throat big enough to swallow a whole car picked her up. “Please,” Scarlett said in pure shock, “please don’t eat me.” The bear had no reaction, and it quickly tossed the beautiful woman into its gaping large mouth.</span></div></div>",
            "created":1542371340,
            "id":2578535,
            "title":"Stay put"
        }
    },
    "info":{
        "author_id":"model7",
        "author_name":"Gojira6",
        "brief_description":"Will she survive or become a tasty meal?",
        "created":1478213460,
        "description":"<td align=\"left\" class=\"norm\">Scarlett Johansson ends up stranded on an uncharted island where everything wants to eat her. Can she make it back to civilization? Or will she become a sexy meal?<br>\r\n<br>\r\nRules:<br>\r\n1.) This is a vore story so most story lines must end with Scarlett getting eaten.<br>\r\n2.) Soft vore only.<br>\r\n3.) Be as descriptive as possible.<br>\r\n4.) Have Fun!<br>\r\n<br>\r\nScarlett Johansson as seen in this story: <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://esq.h-cdn.co/assets/cm/15/05/54cad2e2cdea1_-_scarlettjohansson10.jpg\" target=\"_blank\">http://esq.h-cdn.co/assets/cm/15/05/54cad2e2cdea1_-_scarlettjohansson10.jpg</a></td>",
        "id":2101741,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1600098600,
        "modified":1600098600,
        "pretty_title":"Scarlett Johansson On Vore Island"
    }
}