{
    "chapters":{
        "1":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Red continued down the road to her Grandmother immediately",
                "Red decided to take a quick look at the new path.",
                "Red  decided to eat a little of the spinach first before continuing."
            ],
            "content":"<div class=\"\"><div> <span>Red Riding Hood was taking a short trip on the path on her way to her Grandmother's. She had to take the path that took her through the woods. Before she left, her mom told her to be careful even though the hunters tried to be sure that no wild animals are in the immediate area of the woods. Red Riding Hood hugged her mom and told her that she would be careful.<br>\r\n<br>\r\nHer mom gave Red the basket of spinach and apples to give to her grandmother. Red Riding Hood (RRH) wondered what was inside. But she did not want to look right away. RRH waved goodbye as she headed down the path. After halfway, she stopped to take a rest. She looked around her surrounding to see if there is anything different there. There was not much there but a new path being developed. It was not quite ready but still usable. Red Riding Hood was not sure where it went. But she knew that her Grandmother was probably waiting for her. </span></div></div>",
            "created":1338786000,
            "id":1352413,
            "title":"On my way to Grandma's"
        },
        "11":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Where are you going, little girl",
                "Hey, you know that it is not safe traveling alone here.",
                "I am hungry. I am going to eat ya!",
                "(something else)"
            ],
            "content":"<div class=\"\"><div> <span>Red was whistling a tune and skipping down the road until she stopped to encounter a wolf. The wolf was standing up and just watching her. It had a blue jacket on and a derby hat on its head. Red stopped suddenly to see what the wolf was going to do.  She did not want to try anything foolhardy at first. After all, Red did not know what the motive of the wolf was going to be first.<br>\r\n<br>\r\nThe sly Wolf looked at her and tried to say in a relaxed voice.</span></div></div>",
            "created":1338786000,
            "id":1352444,
            "title":"Red continued down the road to her Grandmother ..."
        },
        "111":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "I am going to my Grandmother's House.",
                "I am going to my Advanced Judo class.",
                "She said something else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Red looked at the wolf and sensed something was wrong. But she wondered on what to say. The eyes of the wolf was on her- trying to get her to tell the truth.<br>\r\nRed tried to resist it. Will she succeed ?</span></div></span></div>",
            "created":1352437200,
            "id":1464505,
            "title":"Where are you going, little girl"
        },
        "1113":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Yes. The wolf decides Red is too tough to deal with and move on.",
                "No. The wolf laughs and continues questioning her.",
                "Yes. The wolf is intrigued and asks for more details."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"I am on my way to the gym to pump iron. I need to get in shape for my wrestling match this afternoon.\" The wolf blinked at her a few times and said nothing. Does he believe her?  </span></div></span></div>",
            "created":1594466280,
            "id":2865916,
            "title":"She said something else."
        },
        "11131":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "She was glad she remembered Granny asked her to train. Her story was true! "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The wolf decided he believed her and backed off. Red thought about what she had said and came to a conclusion. What was it?</span></div></span></div>",
            "created":1594466580,
            "id":2865925,
            "title":"Yes. The wolf decides Red is too tough to deal ..."
        },
        "111311":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Goldilocks",
                "Someone else."
            ],
            "content":"<div class=\"\"><div> <span>Red arrived at her Grandma's gym and saw Hansel and Gretal working on the treadmill to lose their candy guts, Jack working to improve his candlestick leaping and several other fairytale characters. She looked over to the weights and saw her future opponent. Who was it?</span></div></div>",
            "created":1594466940,
            "id":2865935,
            "title":"She was glad she remembered Granny asked her to..."
        },
        "112":{
            "author_id":"cloudz74",
            "author_name":"Cloudz74",
            "choices":[
                "Follow his brain and strike in the best opportunity",
                "Eat her right now and please his stomach",
                "Follow his heart and try to win her trust... and something else."
            ],
            "content":"<div class=\"\"><div> <span>The wolf asked the Little Red Riding Hood, the Wolf shows himself with a friendly presentation, the little girl know her mother advice to not trust strangers, the wolf at the same time notice this. To be honest the hunters always try to hunt him all the time, he may not be some kind of innofensive creature but he did hunt because of hunger not by bloodlust, always mistaking him with some kind of monster and if he was honest he was getting tired of that. \"Erm.. excuse me\" asked the little girl apparently he was lost in his thoughts for too long. The wolf ask himself what to do. She may not be some kind of menace but the wrong approach could be his end, if he passed other day without food he would die. But his feeling like he is conflicted his stomach growled so loudly that make the girl jump a little bit from her place.\"Silly you almost scare me, anyway I need to continue my way to my grandmother's house.\" \"Wait!\" before the little red riding hood could give another step the wolf ask for his attention \"Uhm..\" he couldn't deny it his conflict about what to do is getting out hand his mind say it could be better to let her live a little longer to strike in a good opportunity, his stomach said to devore her right now, but his heart said something different... it was more confusing than the other two his heart to not only let her live but make sure that never leave her side. Heh it's funny he didn't feel this for anyone not even for his own race. At this moment he could only ask himself a question what is he going to do? The wolf open his mouth to speak while the younger girl looked curios to the wolf, making his brain calculatin, his stomach growling, and his heart pounding like all of them were working on their own. Finally he says......</span></div></div>",
            "created":1557381120,
            "id":2657269,
            "title":"Hey, you know that it is not safe traveling alo..."
        },
        "113":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Red decided to give the wolf an apple",
                "The wolf tried to eat her and Red decided to fight back",
                "Red distracted the wolf and ran quickly down the path."
            ],
            "content":"<div class=\"\"><div> <span>Red heard him say that he was hungry. HoweverRed was not trusting of this wolf. But she did feel that it was not that dangerous.<span class=\"cindigo\"><i> Unknown to the wolf, Red was the regional Judo female champion in her age group. So Red knew that she was not that helpless. However Red knew that she was not that strong and never faced an opponent that big.</i></span><br>\r\n<br>\r\nThen on the other hand, she thought it might be wise to keep her judo skills a secret. Maybe the wolf was just hungry for an apple. If she was nice to the wolf, maybe the wolf would be nice to her.<br>\r\nShe was unsure if the wolf was truly hungry or if the wolf actually meant to eat her.</span></div></div>",
            "created":1338786000,
            "id":1352457,
            "title":"I am hungry. Could you spare something for me t..."
        },
        "1131":{
            "choices":[
                "The wolf falls into a deep slumber",
                "The wolf snatches Red's basket and starts devouring the apples",
                "He turns to stone?"
            ],
            "content":"<div class=\"\"><div> <span>\"Would you like an apple Mr. Wolf? I bought it this morning.\"<br>\r\n<br>\r\nThe wolf stares at the apple and then at Red. He then snatches it and scarfs it down.<br>\r\n<br>\r\n\"Mmm... This is the best apple I had. Thanks kid.\"<br>\r\n<br>\r\n\"Your welcome Mister Wolf. I have to get going now...\"<br>\r\n<br>\r\nRed pauses as she notices something strange with the wolf. Besides the fact that tonight was a full moon it seemed like the wolf was reverting to his human form. But there was something else. Something was off...</span></div></div>",
            "created":1432098000,
            "id":1980749,
            "title":"Red decided to give the wolf an apple"
        },
        "11311":{
            "choices":[
                "Her father, the Woodsman",
                "someone else"
            ],
            "content":"<div class=\"\"><div> <span>The wolf who just recently turned into his human form passed out and started sleeping. Red was concerned. She had no ideas that the apples were enchanted through magic, yet her best friend was Snow White and Snow's mother has been known to have a bad case of insanity. Snow's mother first became insane shortly after Snow's birth. She started to hallucinate that everyone was out to get her. Snow's father locked his wife in a tower for her own safety, but she has managed to escape once in a while and disguise herself. Red shook off the thought as she pondered how she would get the wolf and her goodies to her grandmother'rs house. Red's grandmother was a powerful wizard who used her magic to cure the ill and to bless the weapons of heroes. Unfortunately it was dark out and Red was only a 13 year old girl who was taught judo from her mother. Also not many people traveled the woods except her father who woke at the crack of dawn to cut down some trees to ensure the forest doesn't get too out of hand and to hunt for wild game during hunting season.<br>\r\n<br>\r\n<i>What can I do? The wolf would be too heavy to carry and only Grandmother would know how to wake him up.</i><br>\r\n<br>\r\nRed scanned the area to see if anyone could help her. She soon spotted...</span></div></div>",
            "created":1432357200,
            "id":1981982,
            "title":"The wolf falls into a deep slumber"
        },
        "113111":{
            "choices":[
                "Evacuate the Three Pigs",
                "Tie him up"
            ],
            "content":"<div class=\"\"><div> <span>She soon spotted her father, the Woodsman. Now Red's father was a tall and musclebound man with black hair, sharp green eyes, and had great humor followed with a jolly but serious demeanor.<br>\r\n<br>\r\n\"Father!\" Red yelled hoping to catch her father's attention.<br>\r\n<br>\r\nThe Woodsman stops and notices Red standing by an unconscious man.<br>\r\n<br>\r\n\"Red tell me what happened and who this man is.\" The Woodsman said as he walked towards his daughter.<br>\r\n<br>\r\n\"It all happened while he was a werewolf. I gave him an apple that mother and I bought from a kind apple saleswoman. Little did I know that these apples we bought were cursed apples.\"<br>\r\n<br>\r\n\"I see... So that man is a wolf and he ate an enchanted apple. Good thing I was on my way over. Huh? What happened to the Wolf?\"<br>\r\n<br>\r\n\"He's sleepwalking! We have to catch him before he harms himself or anyone.!\" Red yelled as the Wolf began eating a squirrel.<br>\r\n<br>\r\n\"Well it looks like we have to...\" </span></div></div>",
            "created":1432702800,
            "id":1984211,
            "title":"Her father, the Woodsman"
        },
        "1131111":{
            "choices":[
                "When they get there another wolf is impersonating Red's grandmother",
                "Red's grandmother welcomes them in"
            ],
            "content":"<div class=\"\"><div> <span>\"Well it looks like we have to evacuate the three pigs. He already made it to the first pig's house.\"<br>\r\n<br>\r\nAs they arrived they found the sleepwalking wolf banging on a house made of straw.<br>\r\n<br>\r\n\"Zzz... Let me in...\" The wolf said in his sleep.<br>\r\n<br>\r\n\"Never!\" the pig yelled.<br>\r\n<br>\r\n\"Zzz.. *snore*... Zzz.\"<br>\r\n<br>\r\nThe Wolf blows the house down. The terrified pig runs from the sleepwalking wolf. The Woodsman readies his net launcher and tries to catch the Wolf. He almost had the Wolf until he chased the pig to his brother's house. Red and her father follow the Wolf to a house made of sticks. The Wolf begins knocking on the door of the second pig's home.<br>\r\n<br>\r\n\"Zzz... Let me in...\" The wolf said in his sleep.<br>\r\n<br>\r\n\"Go away wolf! Find someone else to eat!\"<br>\r\n<br>\r\n\"Zzz.. *snore*... Zzz.\"<br>\r\n<br>\r\nThe Wolf blows the house of sticks down. The two pigs run to their older sister's house. Red tries to use her judo moves on the Wolf, but he just kept on sleepwalking.<br>\r\n<br>\r\n\"Sister! There's a terrible wolf outside! He destroyed both of our houses!\" the pig brothers cried.<br>\r\n<br>\r\nThe pig sister looks out of her window and sees the sleepwalking werewolf.<br>\r\n<br>\r\n\"You're afraid  of that? He's not even awake. Why are you boys always acting like idiots. I told you to use better building material, but you ignored me. Looks like I have to do this myself.\"<br>\r\n<br>\r\nRed and the Woodsman spot the wolf knocking on a brick house.<br>\r\n<br>\r\n\"Zzz... Let me in...\" The wolf said in his sleep.<br>\r\n<br>\r\nThe eldest pig opens the door and hits the wolf with a frying pan.<br>\r\n<br>\r\n\"Thank you Ms. Pig for helping us capture this wolf. We were about to take him to the healer to lift his sleeping curse.\"<br>\r\n<br>\r\n\"Pfft... Next time do your dang job and get rid of pests like him.\" The pig said before slamming her door.<br>\r\n<br>\r\n\"Now its off to your grandmother's house. Hopefully he doesn't try sleepwalking again. Red help me tie him up.\"<br>\r\n<br>\r\nRed and her father tie up the wolf and head towards Red's Grandmother's house.</span></div></div>",
            "created":1432789200,
            "id":1984440,
            "title":"Evacuate the Three Pigs"
        },
        "11311111":{
            "choices":[
                "The Miller",
                "The Dwarves"
            ],
            "content":"<div class=\"\"><div> <span>When they arrive they notice that the door is open. Normally Red and her father would knock before entering.<br>\r\n<br>\r\n\"Strange? Grandmother usually locks her door at this hour of the night? Could she have gone out to the garden?\"<br>\r\n<br>\r\n\"It's possible Red. I'll lay this wolf on the sofa. Look around and yell if you see something suspicious.\" The Woodsman says as he scans carefully for footprints.<br>\r\n<br>\r\nAs Red's father placed the sleeping werewolf on the sofa, Red went to her grandmother's bedroom. When she entered she saw someone sleeping in her grandmother's bed and wearing her grandmother's gown. Red knew that woman in her grandmother's wasn't her grandmother but she thought she might as well tease her.<br>\r\n<br>\r\n\"Grandmother you look so young. Have you perfected that youth potion.\"<br>\r\n<br>\r\nThe woman yawns and sits up in the bed.<br>\r\n<br>\r\n<i>What can a werewolf do to get some sleep around here? I was lucky that the old woman went on a stroll to her garden to check her beans and other crops. If I didn't find the key under the rug I would not have a comfy new home. I'll scare her off. Humans are too bland to eat. I would rather eat forest life and gingerbread men. Huh? Why do I smell another werewolf. I hate when men come to crash my plans.</i><br>\r\n<br>\r\n\"Grandmother what beautiful eyes you have.\" Red said while trying to provoke the woman into a conversation.<br>\r\n<br>\r\n\"All the better to see you with.\" The werewolf replied as she gritted her teeth.<br>\r\n<br>\r\n\"Grandmother, what sharp teeth you have.\" Red said as she suspected that the woman was a werewolf.<br>\r\n<br>\r\n\"Well, the better to eat you with!\" The woman yelled as she transformed into her werewolf form hoping to scare Red away.<br>\r\n<br>\r\nUnfortunately for the werewolf, Red punched her in the stomach. The werewolf clutched over in pain as she looked at Red.<br>\r\n<br>\r\n\"Where's my grandmother wolf!\"<br>\r\n<br>\r\n\"I don't know and I have a name you little twerp! All I know is that she went to go check on her garden. My pals call me Ginger Spring.\" the woman replied as she reverted to human form.<br>\r\n<br>\r\nRed noted the woman's ginger hair and yellow eyes before resuming her interrogation.<br>\r\n<br>\r\n\"Do you know anything about the other werewolf I met tonight?\"<br>\r\n<br>\r\nThe woman growls as she sees that she won't be getting back to sleep soon.<br>\r\n<br>\r\n\"Show me the other werewolf so I can give him a piece of my mind.\" Ginger grumbled.<br>\r\n<br>\r\nRed and Ginger walk out of the bedroom and into the living room where they see Red's father and grandmother looking at the sleeping wolf and then in her direction.<br>\r\n<br>\r\n\"Red it's good to see you and who let her in here?\" Red's Grandmother asked.<br>\r\n<br>\r\n\"I found this other werewolf trying to impersonate you.\" Red replied.<br>\r\n<br>\r\n\"I was trying to get some sleep until this little brat woke me up.\"<br>\r\n<br>\r\n\"Well might as well find out if true love will wake him up.\" Red's grandmother said as she sighed.<br>\r\n<br>\r\n\"You want me to kiss that guy? I barely know that wolf.\"<br>\r\n<br>\r\n\"I was afraid of that. Guess we'll need the golden harp. Jack, can you, Red, and that woman climb up the beanstalk and retrieve it. But before I can give you this bean I need one cow. I can't make my winning recipes without fresh milk.\"<br>\r\n<br>\r\n\"Sure, but its been a long time since me and Jill went up to fetch a goose that could lay golden eggs.\"<br>\r\n<br>\r\n\"A goose that lays golden eggs? I could really use a few of those,\" Ginger said as she imagined building a castle for herself. \"Where do we find this cow?\"<br>\r\n<br>\r\n\"Just follow this map to...\"</span></div></div>",
            "created":1432875600,
            "id":1984971,
            "title":"Another Wolf?"
        },
        "113111111":{
            "choices":[
                "Red and her companions are thrown into jail",
                "The judge declares Red and her friends not guilty"
            ],
            "content":"<div class=\"\"><div> <span>\"Just follow this map to the Miller.\"<br>\r\n<br>\r\n<i>Why did it have to be him? I would rather die than to speak to my father.</i> Ginger thought.<br>\r\n<br>\r\n\"You have our word.\" Jack said.<br>\r\n<br>\r\n\"Thank you and take this.\" Red's grandmother said as she used her magic to hand them a bottle. \"You can never be too prepared for a journey.\"<br>\r\n<br>\r\n\"Thanks Grandma!\"<br>\r\n<br>\r\n\"See you later and take care Red!\"<br>\r\n<br>\r\nRed, the woodsman known as Jack, and Ginger make their way to the Miller. As they were travelling they were passing through a town called Nottingham. It is said that a corrupt duke rules the town, by imposing affordable taxes. As Red and her companions were passing they noticed a group of boys stealing from a bunch of soldiers.<br>\r\n<br>\r\n\"Someone stop those kids!\" the tax collector yelled.<br>\r\n<br>\r\nRed and her group stop in their tracks as the sheriff approaches them.<br>\r\n<br>\r\n\"Hold it right there! You travelers were suppose to pay at the toll booth!\" the sheriff said as she flashed her badge.<br>\r\n<br>\r\n\"What toll booth goldi? We didn't see any when passing through.\" Ginger snapped.<br>\r\n<br>\r\n\"That's Sheriff Goldilocks to you and just for insulting me I'll have to put you in jail.\"<br>\r\n<br>\r\n\"We didn't do anything!\" Jack protested.<br>\r\n<br>\r\n\"Tell it to the judge.\" Goldilocks sneered.</span></div></div>",
            "created":1433048400,
            "id":1985939,
            "title":"The Miller"
        },
        "1131111111":{
            "choices":[
                "a boy named Robin Hood comes to the rescue",
                "What's a genie bottle doing in this jail?"
            ],
            "content":"<div class=\"\"><div> <span>Red and her companions were brought to the courthouse. Inside there was an eerie young man. Over his shoulder was a precarious bag. Out from the bag he pulled out a pipe and then a judges hammer. He then stops when he notices Red and her companions.<br>\r\n<br>\r\n\"What brings you her Sheriff Goldilocks?\"<br>\r\n<br>\r\n\"Judge Piper, these folks did not pay the toll to travel through our dearest Nottingham. That blasted Robin Hood and his Merry Men escaped as well.\"<br>\r\n<br>\r\n\"Get to the point, you know Duke John will not tolerate such contempt,\" The Pied Piper responded. \"How do you all plead?\"<br>\r\n<br>\r\n\"Not guilty, we weren't informed of such a toll.\" Jack said.<br>\r\n<br>\r\n\"Is that so? According to Statute 189: 'All travelers must give the tolls to the tax collector or sheriff if a toll booth is not in sight. That will be 2,500 gold coins.\"<br>\r\n<br>\r\n\"We don't have that much!\" Ginger yelled.<br>\r\n<br>\r\n\"That's too bad, I might let you off if you can say my real name.\" the Piper mocked.<br>\r\n<br>\r\n\"How are we supposed to know your name?\" Red asked. \"That's unfair Mr. Piper.\"<br>\r\n<br>\r\n\"You are thereby to spend two weeks in jail. Get out of my sight.\"<br>\r\n<br>\r\nThe Piper starts playing on his pipe. Red and her companions pass out. When they wake up they find themselves in a cell with a family of bears. In the cell across from them is a woman with a bunch of children.<br>\r\n<br>\r\n\"Let me guess, the sheriff took you to that crooked judge.  Hopefully Duke Richard returns. Duke John has really screwed us over with his taxes. He even kicked Maid Marian out of the shoe she was living in. Yet it was the duke's fault that she had yo move the orphanage into a giant shoe.\" the papa bear said.<br>\r\n<br>\r\n\"Giant shoe... Reminds me when Jill and I cut down the beanstalk to escape the giant.\" Jack mused.<br>\r\n<br>\r\n\"Grrr. I hate it when I don't remember names right off the bat. The judge's name is R...\" Gingered said before being cut off.</span></div></div>",
            "created":1433221200,
            "id":1986873,
            "title":"Red and her companions are thrown into jail"
        },
        "11311111112":{
            "choices":[
                "Red and her companions are successful",
                "They are blocked by the Pied Piper"
            ],
            "content":"<div class=\"\"><div> <span>\"What's this bottle doing here?\" Red asked.<br>\r\n<br>\r\nGinger rolls her eyes at Red due to the interruption.<br>\r\n<br>\r\n\"Darn it! I forgot the Piper's name! I can never finish saying his name without an interruption.\"<br>\r\n<br>\r\n\"Something feels magical about it.\" Jack said as he pick up the bottle.<br>\r\n<br>\r\nHe then rubs the bottle. After he does so blue smoke starts filling the room. Then a bright light explodes. Red, Ginger, her father Jack, and the bears stare in awe as a blue skinned man emerges from the smoke.<br>\r\n<br>\r\n\"*Yawn* That was the worst sleep I've had in a thousand years. Oh, sorry to keep you waiting. The name is Alijar Fontayun. I am obligated to grant whoever freed me three wishes.\"<br>\r\n<br>\r\n\"Three wishes eh. I think we might have to wait. We have bigger problems to deal with.\" Jack said as he heard the guards marching with a handcuffed boy.<br>\r\n<br>\r\n\"We finally got you Robin Hood. Who would of thought that a little boy caused all this trouble. Say your prayers boy for you're going to die with your cousin tomorrow.\"<br>\r\n<br>\r\nThe guard throws Robin into the same cell as Marian.<br>\r\n<br>\r\n\"Robin!\" Marian cries as she embraces her cousin.<br>\r\n<br>\r\n\"Well there goes any hope.\" the baby bear says in a down trodden tone.<br>\r\n<br>\r\n\"It's alright my little one. We wouldn't be here if the sheriff didn't break into our house and rob us of everything.\" the mama bear says to reassure her child.<br>\r\n<br>\r\n\"We can't lose hope! We must escape! I wish that everyone would stop moping and think of a way out.\" Red said as she sighed.<br>\r\n<br>\r\n\"The girl is right. We must escape! My merry men are still out there. There's no way that Goldilocks can catch them all.\"<br>\r\n<br>\r\n\"If you guys don't mind I think I have an idea. Even though this really doesn't count as a wish used I can offer some insight. Every night around 1:00 A.M. the guards leave for a drink. They always forget to take the keys to the cell with them. If we can snatch the keys then we'll be good to go.\" Alijar said as he paced about. </span></div></div>",
            "created":1433739600,
            "id":1989694,
            "title":"What's a genie bottle doing in this jail?"
        },
        "1131111112":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "tied to a tree.",
                "grinding corn in the shop in the back."
            ],
            "content":"<div class=\"\"><div> <span>Jack,Red, and Ginger soon found themselves before the Judge.  They was feeling uncomfortable about being in such a corrupt town. By happenstance or Providence, they were in luck.  The Judge was Jonathan- Red's favorite cousin.  Red managed to smile slightly at her cousin.  They were close growing up and tried to keep in touch.  The judge listened to Goldilocks tell of the toll booth law and how they insulted her.<br>\r\n<br>\r\nWhen Goldilocks showed a copy of the law, Jonathan noticed that Goldilocks forgot the sign all three lines to the law.  Jonathan pointed the regulation to her.  Goldilocks gasped that she forgot to sign in all three places. But she did say ' But they did call me Goldi, that is a fine too.'<br>\r\n<br>\r\nThe judge asked the trio if that was true.  Ginger admitted it and apologized,  The judge said 'Well, since the signature was not properly signed, I will declare you not guilty on the first part.  Then the judge reached in his pockets and dropped 4 gold coins in a jar.  Since I paid the insulting fee myself.  I will declare you not guilty on the second part. Just say ' I am sorry, Sheriff Goldilocks'  And they did so to Goldilocks<br>\r\n<br>\r\nGoldilocks could not believe it but was civil since the  insulting fine was paid and they apologized .<br>\r\n<br>\r\nOn the way, Jack, Red, and Ginger encountered no more trouble.  They finally arrived at the miller's house.  They searched around the place for the miller about buying the cow.  They found him finally</span></div></div>",
            "created":1434258000,
            "id":1992586,
            "title":"The judge declares Red and her friends not guilty"
        },
        "11311111121":{
            "choices":[
                "Jack volunteers to become a werewolf",
                "Red volunteers to bribe the dragon"
            ],
            "content":"<div class=\"\"><div> <span>They finally found him, but he was tied to a tree. As the moon rose they saw that the Miller was actually a werewolf. The Miller tried to break free of the bindings but it was no use. The bindings were laced with silver rendering him to be as weak as a puppy.<br>\r\n<br>\r\n\"Father! Hold still while I fetch a knife!\" Ginger yelled as she ran towards the barn house.<br>\r\n<br>\r\nRed and her father Jack were surprised that Ginger referred to the Miller as her father. Ginger returned and cut the rope binding her father. Jack Red and ginger helper the miller to his feet. The older werewolf brushed himself off and twitched his ears.<br>\r\n<br>\r\n\"Thank you. Tell me what you have come for.\" The miller said in a monotone voice.<br>\r\n<br>\r\n\"Father, remember our reward winning cow, La'Bella? The Wise Wizardess of the Forest requires the cow so my fellows and I can awaken another werewolf who is under a sleeping curse.\"<br>\r\n<br>\r\n\"Unfortunately La'Bella has been stolen by a dragon. I didn't know that the person was a dragon until he tied me up and took flight with La'Bella trapped in his claws.\"<br>\r\n<br>\r\n\"That sucks.\" Ginger responded.<br>\r\n<br>\r\n\"We can't give up! There must be something we can do!\" Red said in an energetic tone.<br>\r\n<br>\r\n\"Dragons as fast and stealthy, unless they have been gorging on cows everyday. The point is we need someway to defeat him or at least offer him a bribe.\" Jack said as he leaned against the tree.<br>\r\n<br>\r\n\"I think I have an idea. It would help to have another werewolf, but the process to turn someone into a werewolf doesn't work well on children.Hey woodsman what do you say? You look like a strong man. How would you like to get stronger? I'll even give you this bottle of silver water just in case you feel like undoing the transformation. Or you could opt for that little girl of yours to sweet talk the dragon. So what do you choose?\"</span></div></div>",
            "created":1434258000,
            "id":1992609,
            "title":"tied to a tree."
        },
        "113111111211":{
            "choices":[
                "They beat the dragon with ease.",
                "The dragon plays a trick on them"
            ],
            "content":"<div class=\"\"><div> <span>\"I'll do it. If it's to help that will get us the cow.\" Jack said.<br>\r\n<br>\r\n\"Excellent choice. This might sting.\"<br>\r\n<br>\r\nThe Miller bites Jack's arm. Jack grits his teeth in pain. After being bitten his bite mark heals and his muscles start growing. As his muscles grew his body hair got thicker until it became a furry pelt. Jack's head became wolf-like and he now had a strong and fluffy black tail. Jack lets loose a howl.<br>\r\n<br>\r\n\"Talk about being a ripped wolf.\" Ginger said with a hint of jealousy.<br>\r\n<br>\r\n\"Har har! This feels great. I'm sure the misses back home would enjoy this.\" Jack said as his tail started wagging.<br>\r\n<br>\r\n\"Easy there lad, just because you were transformed doesn't mean all will be fine and dandy. If you ever want to be a normal human again just drink this silver water and you should be your old self again.\" The Miller said as he gave Red the bottle due to Jack being a bit too hyper.<br>\r\n<br>\r\n\"Hop on my back Red! I'll get us to the dragon's cave in no time!\" Jack said as his tail wagged wildly.<br>\r\n<br>\r\n\"Wait father. We can't just rush into the dragon's cave. We need a strategy.\"<br>\r\n<br>\r\n\"I get it. We can make a plan outside of the cave.\"<br>\r\n<br>\r\n\"Works for me.\"<br>\r\n<br>\r\nRed climbs onto her father's back. Jack then takes off. Ginger grudgingly follows. When they arrive...</span></div></div>",
            "created":1437973200,
            "id":2013183,
            "title":"Jack the Werewolf Woodsman"
        },
        "113111111212":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Professor Lupin (although not in his werewolf form)",
                "Frodo Baggins ( the Hobbit)"
            ],
            "content":"<div class=\"\"><div> <span>Red stepped forward before Jack could say anything.  Jack hollered ' No, Red, no need for you to be a werewolf'<br>\r\n<br>\r\nRed laughed and replied \" Relax,  I am just here to bribe the dragon with something. I just hope that it works.  But I am quick and nimble and should get away if needed. Besides I got some spinach in my basket...just in case.  \"  Red said in such a calm voice; Jack calmed down.<br>\r\n<br>\r\n<br>\r\n<br>\r\nRed then went to a local market and bought plentiful supply of Milk Dud candy bars to last a few month along with a 6 pac of ButterBeer.   Then she fixed her hair to make herself more attractive before heading to the Dragon's Lair. She even planned to offer the dragon a comb that contained a small amount of gold. Maybe those three items would be enough to interest the dragon.<br>\r\n<br>\r\nShe was almost there when Red heard someone approaching from behind her.  Red did not sense any danger but the mystery man hid himself behind some trees. Red said in a normal voice.  \" Mister whomever you are, I know that you are hiding there.  Why don't you just come out and assist me?'<br>\r\n<br>\r\nSlowly the man came out. The man just happened to be<br>\r\n<br>\r\n[google if you are unfamiliar with the names]</span></div></div>",
            "created":1435640400,
            "id":2001492,
            "title":"Red volunteers to bribe the dragon"
        },
        "113111112":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "that evil witch from Snow White.",
                "Professor Remus Lupin. (from Hogwarts)"
            ],
            "content":"<div class=\"\"><div> <span>Jack, Red, and Ginger was on their way to the Dwarves' hut. But looking from the map, it was going to take longer since a recent flood blocked one of the paths. Red frowned and said ' Looks like we may have to take the other one. It is supposed to be more dangerous but the authority said that it was just rumors.<br>\r\n<br>\r\nJack and Ginger said ' What rumors,' at the same time.<br>\r\n<br>\r\nRed frowned and said ' There is supposedly shrieking noises being heard roughly a few days a month. One rumor said that a witch lived in that shuttered house by the decaying pine tree. But another rumor said that another rumor said that a werewolf live there in that shuttered house.  But the first rumor ever said that a ghost lived there.  But nobody ever died there that the town knows about.'<br>\r\n<br>\r\nJack said 'But there is three of us that will band together if needed. We better not bother investigating it.  We need to get to the Dwarves' hut. When they got closer, there were moaning sounds like one in pain than shrieking. But it did sound like a blend of moaning and shrieking.<br>\r\n<br>\r\nRed said ' We are capable to challenge what is going on.'<br>\r\nGinger said ' When I get to the door, I could sniff out what it or he/she is. But let us not be rash.'<br>\r\n<br>\r\nRed and Jack stood back about 30 yards while Ginger sniffed at the door. When Ginger returned, Ginger said ' I know who is behind that door. It is <br>\r\n<br>\r\n</span></div></div>",
            "created":1433134800,
            "id":1986467,
            "title":"The Dwarves"
        },
        "1131111121":{
            "choices":[
                "A giant gingerbread house",
                "Oz?"
            ],
            "content":"<div class=\"\"><div> <span>\"It is the queen.\"<br>\r\n<br>\r\n\"That's Snow's mother! Isn't she supposed to be locked up due to her mental illness!\" Red gasped.<br>\r\n<br>\r\n\"Not too loud Red. We must capture the queen and return her to the palace. If we can do that then hopefully the king's men will get her to take her medication that your grandmother prescribed.\" Jack said to his daughter.<br>\r\n<br>\r\n\"Guys we better hide. I think she just got done talking to her reflection.\"<br>\r\n<br>\r\nRed, Jack, and Ginger hide in the bushes. Once the cabin door opens the queen walks out. She was as beautiful as her people described, but also as insane as well.<br>\r\n<br>\r\n\"I thought I heard people conspiring to kill me. It's not only them but my own daughter as well,\" the queen said in a paranoid manner. \"According to my reflection I must neutralize them before they can hurt me. Piper! Play your flute to draw out the conspirators!\"<br>\r\n<br>\r\n\"Certainly milady.\"<br>\r\n<br>\r\nThe Pied Piper starts playing on his flute. Red and her companions feel their bodies moving. Red and her companions are forced from their hiding place.<br>\r\n<br>\r\n\"So you were the ones speaking about killing me.\" Snow's mother said under the influence of a hallucination.<br>\r\n<br>\r\n\"That's not true! We are trying to help you!\" Red shouted at the queen.<br>\r\n<br>\r\n\"So you admit that you were trying to kill me. Get out of my sight you nasty little girl.\"<br>\r\n<br>\r\nThe queen snaps her fingers. Red and her companions are teleported to...</span></div></div>",
            "created":1433134800,
            "id":1986524,
            "title":"The Psychotic Queen"
        },
        "11311111211":{
            "choices":[
                "She plans on turning them into test subjects",
                "She plans on fastening them up so she can consume their energy"
            ],
            "content":"<div class=\"\"><div> <span>The queen snaps her fingers. Red and her companions are teleported to a giant gingerbread house. Upon awakening Red and her companions see what looks like a couple. The woman was tall and dressed in an apron with a chef's hat. Her piercing blue eyes showed concern. She had a tuft of blonde hair peeking out of her hat. The man was the largest that anyone dared to lay eyes on. Not only was he extremely fat, but he had an insane amount of muscle. He wore shorts and a white shirt. He dull green eyes had an intimidating presence. His dark red hair was of medium length followed by a short beard.<br>\r\n<br>\r\n\"Looks like we have guests. What should we do Gretel?\"<br>\r\n<br>\r\n\"Make them comfortable. Get them something to eat Hansel.\"<br>\r\n<br>\r\n\"Alright Gretel, I'll give them your specialty.\"<br>\r\n<br>\r\nHansel lumbers off to the kitchen to fetch some food for Red and her companions. Gretel then walks over to Red and her group.<br>\r\n<br>\r\n\"Welcome to our home. My husband should be back soon. So what brings you kind folks around here?\"<br>\r\n<br>\r\n\"We just had a run in with the queen. She apparently needs to get some rest. She's hallucinating that we were trying to kill her.\" Jack replied.<br>\r\n<br>\r\n\"I see, but that's probably not the only reason. You look like you need to find the Dwarves.\" <br>\r\n<br>\r\n\"That's right. How did you know?\" Red asked.<br>\r\n<br>\r\n\"Let's just say I found this map on the floor. You are welcome to stay the night. Looks like Hansel has come with your dinner. Sweet Potato Surprise served with cheese steak and a bowl of candy and gingerbread men. Enjoy.\"<br>\r\n<br>\r\nRed and her companions dig in. What they didn't realize was that the candy and gingerbread men were spiked with an appetite stimulant. As they ate they lost track of time. Gretel smiled wickedly as she saw her evil plan come to fruition. </span></div></div>",
            "created":1433566800,
            "id":1988574,
            "title":"A giant gingerbread house"
        },
        "12":{
            "choices":[
                "A tiny fairy trapped in a cage!",
                "A scroll on which is written a magic formula!",
                "A Lamp (That Aladdin!)",
                "A mysterious leather pouch!",
                "Choice of the Reader!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Red decided to give a rapt look at the new location yet to be completed at all! Maybe it was a good shortcut to the first grandma's house! When Red came to that path, he noticed a strange object on the ground!</span></div></span></div>",
            "created":1356066000,
            "id":1492164,
            "title":"Red decided to take a quick look at the new path."
        },
        "121":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "have an IQ of 200",
                "can fly at high speed",
                "( reader's choice)"
            ],
            "content":"<div class=\"\"><div> <span>Red rubbed her eyes in disbelief. She always thought that fairies were just stories and myths. The sad blue fairy looked like a younger Hannah Montana. The fairy begged to be freed from her cage. The fairy said in a whiny tone <b>'  My name is Tanepale An evil wizard trapped me in here. Let me go and I will grant you an special ability. I can not guarantee what will be that ability. I can not control my magic that well. But I am almost sure that you will like it  Either way, you will find it useful '</b><br>\r\n<br>\r\nRed had a compassionate heart and decided to free the fairy. Red found a rock and bashed the lock until it broke off. The fairy flew out and said <b>Thanks, and now it is time to give you an ability.</b> Taneplae sprinkled some magic dust on Red. When the magic started working, the fairy flew away.<br>\r\n<br>\r\nAfter a minute, Red realized what new gift/ability  was granted to her. She ______</span></div></div>",
            "created":1356757200,
            "id":1497498,
            "title":"A tiny fairy trapped in a cage!"
        },
        "1213":{
            "choices":[
                "Can become great and muscular, as and when she wants!",
                "Possesses the magical powers of a powerful sorceress!",
                "(Choice of the reader!)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>After a minute, Red realized what new gift/ability was granted to her. She ______</span></div></span></div>",
            "created":1357189200,
            "id":1500845,
            "title":"( reader's choice)"
        },
        "12132":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "About being a sorceress",
                "That her omelette were delicious "
            ],
            "content":"<div class=\"\"><div> <span>Red was wearing something very similar to what wizards from Hogwarts would wear. Instead of a black pointed hat, it was red instead. The hat could easily be converted into her regular red hood at anytime. Even though she had a wand, Red did not actually need one. Red could simply wave her hand just as well.<br>\r\n<br>\r\nRed Riding Hood was amazed at her new abilities.  Then she decided that it was time to visit her grandmother now. Red transported herself just a 1/4 mile from her Grandmother's house and walked the way to her front door. Then Red quickly changed herself back to normal.<br>\r\n<br>\r\nHer grandmother opened the door and happily let her granddaughter Red in. After some tea and cheese, they chatted about various things. Meanwhile Red was trying to decide if she should tell her grandmother her new powerful abilities.<br>\r\n<br>\r\nThen Red told her grandmother </span></div></div>",
            "created":1366520400,
            "id":1576262,
            "title":"Possesses the magical powers of a powerful sorc..."
        },
        "12133":{
            "author_id":"sizewatcher",
            "author_name":"SizeWatcher",
            "choices":[
                "Nothing now but later her gift/ability activates ",
                "She can change her or other sizes",
                "No her gift/ability is something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Little Red Riding Hood realizes that her gift/ability is ________________.</span></div></span></div>",
            "created":1592750940,
            "id":2854493,
            "title":"(Choice of the reader!)"
        },
        "121332":{
            "author_id":"sizewatcher",
            "author_name":"SizeWatcher",
            "choices":[
                "Log didn't grow it shrinks! (Little Red Riding Hood can only grow herself)",
                "Log is now few times bigger than it was before(LRRH can change only other sizes)",
                "Something else or Little Red Riding Hood and the log both grew bigger."
            ],
            "content":"<div class=\"\"><div> <span>Little Red Riding Hood cannot believe this!<br>\r\n<br>\r\nHow size changing will help her? She want to test this size changing. She looked around and sees a huge and old fallen tree trunk few feet or meters away her position. She rises her left arm and closes her eyes and thinks \"BIGGER\". Then she felt how some-kind of energy moves inside of her body and soul.<br>\r\n<br>\r\nLittle Red Riding Hood opens her eyes and see _________________!</span></div></div>",
            "created":1592751480,
            "id":2854498,
            "title":"She can change her or other sizes"
        },
        "124":{
            "author_id":"robbie014",
            "author_name":"Sapphire",
            "choices":[
                "Go to the island",
                "Go to the town",
                "Go to the woods"
            ],
            "content":"<div class=\"\"><div> <span>Inside the pouch was an old worn pirate map.  Red unfolded the map and held it up to the sunlight.  In the center was an island just off the coast not so very far from where Red stood.  On the island a question mark was drawn.  The map also showed a town to the north with a diamond drawn next to it and an X in the woods miles south of here.  </span></div></div>",
            "created":1366779600,
            "id":1577986,
            "title":"A mysterious leather pouch!"
        },
        "1241":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "a dairy farm in the state of Montana in th United States",
                "somewhere in London , England, United Kingdom",
                "more choices"
            ],
            "content":"<div class=\"\"><div> <span>RRH decided to see her grandmother later. She was too curious to see what the ? was symbolizing on that island. She jogged to the shore where a rowboat was abandoned.  RRH got in and managed to row to the Island which was just barely under a mile away from shore. And she arrived there all by herself. Red was happy with her own rowing skills.<br>\r\n<br>\r\nRed got out the boat and scanned the island. She then examined the map again. Then Red looked around to where she felt was the location of the ? symbol.<br>\r\nThere was a sign on the ground with a ? on it next to a mystical tunnel. There were some words underneath it.<br>\r\n<br>\r\nThe words said  ' Travel at your own Risk. This Tunnel will take you anywhere in the world. It is only for those who love adventures or risk.'<br>\r\n<br>\r\nRed looked at the tunnel.  She could see something similar to a spinning wheel from the inside. Red thought that maybe that was a magical transporter of some kind. Some slightly eerie music could be heard too from within.<br>\r\n<br>\r\nRed Riding Hood then had to make a choice. After some thought, Red grabbed her basket firmly in her hands and decided go inside the tunnel.<br>\r\n<br>\r\nQuickly, she felt dizzy while she appeared to spin around to a place unknown. When her vision cleared, Red found herself at/in </span></div></div>",
            "created":1367038800,
            "id":1579726,
            "title":"Go to the island"
        },
        "12413":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "west",
                "east"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Somewhere in the west, or east?</span></div></span></div>",
            "created":1421470800,
            "id":1919327,
            "title":"more choices"
        },
        "124131":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "little red riding hood introduces herself.",
                "little red riding hood faints upon meeting the two celebrities."
            ],
            "content":"<div class=\"\"><div> <span>In this case the western united states of america mainly Hollywood California as little red riding hood couldn't help but feel completely amazed at beautiful Hollywood itself was.<br>\r\n<br>\r\n\"So this is Hollywood which in our world is a completely mythical place. It's beautiful and all that but wait a minute i can feel the ground rumbling like its something straight of tiny toon adventures.\" little red riding hood said.<br>\r\n<br>\r\nIndeed the ground was rumbling not because of an earthquake which commonly happens in and around the state of California itself, but in reality it was a couple of gigantic massively Sumo wrestler like animated prairie dogs from little dogs on the prairie consisting of both scout and sport who were indeed Hollywood's commonly seen giant monsters as they noticed someone who was not from around here.<br>\r\n<br>\r\n\"Who's the little lady with a red hood? I haven't seen her around here before have you?\" Scout asked looking right towards sport's direction.<br>\r\n<br>\r\n\"Who knows? But i think we should try to introduce ourselves anyway.\" Sport replied.<br>\r\n<br>\r\nEventually the two heavily stomped towards little red riding hood herself and kindly introduced themselves.<br>\r\n<br>\r\n\"Greetings my name is Scout and this is my fellow co star Sport. Who are you?\" Scout asked after introducing himself and his fellow co star Sport.<br>\r\n<br>\r\nThen at that moment....</span></div></div>",
            "created":1421470800,
            "id":1919364,
            "title":"west"
        },
        "13":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "14 inches long",
                "19 inches long",
                "2 feet long",
                "reader's choice "
            ],
            "content":"<div class=\"\"><div> <span>Red felt somewhat uneasy on what might be down the path to her grandmother's. She planned to ask her grandmother about the developing new path. But she was homesick to see her Grandmother. <br>\r\n<br>\r\nRed knew that the spinach were for her grandmother. But Red also knew that she was free to take some too. Red wanted to feel safer too in spite of her knowing judo. She grabbed one handful of spinach and forced it down her mouth. It felt awful and gross. But Red managed to get it down her throat.<br>\r\n<br>\r\nBLEAAAH. THAT TASTES SO BAD. She thought in her mind as she continued on her way. As she walked, Red noticed some changes in her muscles. Even though she did not grow, her muscles started to grow and she became stronger. And she felt far more alert and not tired. When she walked halfway, Red stopped to look at her flexed biceps. Smiling, she realized that her biceps was NOW</span></div></div>",
            "created":1339822800,
            "id":1360921,
            "title":"Red  decided to eat a little of the spinach fir..."
        },
        "132":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Grandmother working out in a home gym.",
                "the Wolf  snarling at Grandmother -about to eat her.",
                "- something else- YOU decide."
            ],
            "content":"<div class=\"\"><div> <span>Red smiled at her improvement and thought excitedly  Wow, I am one STRONG girl. I bet that I can do the chores easily and quickly now. But now I need to get over to Grandma's house. She jogged so quickly that she was there much sooner that expected.<br>\r\n<br>\r\nRed knocked on the door but there was no response. Red knocked a little louder and used her improved hearing to find out if there was anything wrong.  She heard some grunting inside.<br>\r\nFearing the worst, Red walked inside to find</span></div></div>",
            "created":1355893200,
            "id":1491024,
            "title":"19 inches long"
        },
        "1322":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Killing him so he can be made into a rug or coat.",
                "Threw the wolf WAY WAY out the door, unconscious."
            ],
            "content":"<div class=\"\"><div> <span>Red Riding Hood was furious at the wolf. Normally she was passive, but not now.  She snarled at the wolf and said LEAVE MY GRAMMA ALONE! and flexed her biceps to show that she meant business.  The wolf turned to look at Red's muscles and analyzed his next move. Not being too smart, the wolf decided to try to eat Red Riding Hood instead. Red was stronger than the wolf but not in the range of Superman. Yet, she was winning her fight against the wolf easily. The wolf was determined not to be beaten by a girl. Yet Red won and </span></div></div>",
            "created":1383368400,
            "id":1687768,
            "title":"the Wolf  snarling at Grandmother -about to eat..."
        },
        "13222":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "Red's grandma eats the spinach with her.",
                "Grandma only eat a couple of leaves from the spinach."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Red's grandma was very grateful to her for defeating the wolf. She looked on in amazement at her granddaughter's muscles and wondered just how she got them. Red told her it was the spinach and gladly offered her some. </span></div></span></div>",
            "created":1387342800,
            "id":1710047,
            "title":"Threw the wolf WAY WAY out the door, unconscious."
        },
        "132221":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Gather and chop some firewood. Winter is coming.",
                "Let us go for a swim in the creek nearby."
            ],
            "content":"<div class=\"\"><div> <span>Red's Grandma almost wanted to cook it first but she grabbed a handful and swallowed it. It took about a few seconds before anything happened. Then Gramma 's biceps became to grow to 14 1/2 inches. Her somewhat fat belly shrank until she looked trim.<br>\r\nIn addition, some of her own red hair returned, restoring some of her youth. She was able to straighten her back again, giving her some much needed energy. Finally some of Grandmother's wrinkles disappeared too, making her look no older than 40.<br>\r\n<br>\r\nRed was happy to see her grandmother much more lively again. Her grandmother asked Red what she would like to do today. Red paused a moment. Winter was coming soon in another month. But she wanted to have fun too.<br>\r\nFinally Red said...<br>\r\n<br>\r\n</span></div></div>",
            "created":1389157200,
            "id":1724221,
            "title":"Red's grandma eats the spinach with her."
        },
        "1322211":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Thanks but I can handle this.  I need the workout.",
                "Thank you, my dear Red. You are so sweet to help."
            ],
            "content":"<div class=\"\"><div> <span>Grandma grabbed an ax. Grandmother ran the 50 yards into the woods and started chopping down a couple of the hardened pine trees. It was not too hard.  Meanwhile Red used her karate chops to break down the remaining firewood  that was in the woodpile into smaller pieces.  Her hands were not even bleeding after her work.  Red made sure that there were plenty of various sizes of firewood.<br>\r\n<br>\r\nThen Red noticed her grandmother was finished chopping down the trees and was dragging the two trees back. She had the tip of each tree in her hands..One was in her left hand and one was in her right hand.  But she was struggling a bit.  Red ran up to help her grandmother and said  \"Let me take one of those, please.\"<br>\r\n<br>\r\nGrandmother said <br>\r\n'</span></div></div>",
            "created":1452461040,
            "id":2087290,
            "title":"Gather and chop some firewood. Winter is coming."
        },
        "134":{
            "author_id":"batboyjw",
            "author_name":"Jokermask18",
            "choices":[
                "The Wolf",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Red was amazed at her now twenty inch arms. She felt strong enough to take on anything! With newfound courage, she continued on the path until she saw... </span></div></span></div>",
            "created":1387342800,
            "id":1710051,
            "title":"reader's choice "
        },
        "1341":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "Punched the Wolf hard back 100 yards away.",
                "Let the Wolf try to bite her",
                "reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>The Wolf smelled the human flesh from at least 100 yards away.  He was hungry since the food supply was starting to get scarce. The Wolf thought that his sharp teeth was good enough to penetrate through her tough skin.  ARGGG he growled in a foolish attempt to scare her. The Wolf thought that she would be a tasty meal.<br>\r\n<br>\r\nRed laughed as he approached her to bite and devour her.<br>\r\nWhen the Wolf got within inches of her, Red</span></div></div>",
            "created":1416114000,
            "id":1887387,
            "title":"The Wolf"
        },
        "13412":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "go with classics",
                "somewhere unusual (pecs or feet)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Were to? Maybe she could just go with the plain butt taunt or go somewhere more excentric.</span></div></span></div>",
            "created":1486925460,
            "id":2276685,
            "title":"Let the Wolf try to bite her"
        },
        "134121":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "bandit queen",
                "barbarian man"
            ],
            "content":"<div class=\"\"><div> <span>Red just giggled at the big bad wolf as she patted her own rear \"here doggie, show me what you got\". The big bad wolf just proceeded trying to chew on red's buttocks. But they were now hard as nails... literally.<br>\r\n<br>\r\nFor poor wolf, this pantied butt gave him the worst toothache of his life, but things were just going to get worse for him. \"My turn...\" sentenced Red as she grappled the wolf with both hands. Red also took off her constraining shoes revealing a size 22 feet encased in her branded knee socks \"and remember this... i fight like a little girl\" she taunted the wolf as she kicked him with her massive uncanny muscle legs.<br>\r\n<br>\r\nThe wolf was kicked off like 72 yards away, probably breaking the field goal record in the process. After this nuissance dealt she just kept on the road, but she heard the lumberjack screaming for help. He was being attacked by a...</span></div></div>",
            "created":1486927080,
            "id":2276694,
            "title":"go with classics"
        },
        "1341212":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "armwrestle her",
                "punch her in the abs with a hammer",
                "your choice."
            ],
            "content":"<div class=\"\"><div> <span>The Lumberjack was fairly strong but he could not compare to that barbarian man beating him up.<br>\r\n<br>\r\nRed ran like the breeze and jumped a few spins in the air. She screamed like a warrior.  The Barbarian turned to see Red bearing down on him feet first.<br>\r\n<br>\r\nBAM Red hit the barbarin in the chest and he fell over.<br>\r\n<br>\r\nCorby the Barbarian screamed  IMPOSSIBLE You're a little girl.<br>\r\n<br>\r\nRed smirked and said But I fight like a real barbarian.  i was on my way to my grandmother's. But looks like this man needs my help.<br>\r\n<br>\r\nCorby growled in a foolish attempt to scare her. Red just giggled and dared him to</span></div></div>",
            "created":1512754320,
            "id":2425475,
            "title":"barbarian man"
        },
        "13412122":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "towards granny house",
                "and fell into an elven trap"
            ],
            "content":"<div class=\"\"><div> <span>Red lfted her skirt all the way up, showing her rock hard abs and training bra covering her pecks in the process \"here, big guy, swing there\"<br>\r\nCorby equipped his rock hammer and swung into little red's abs. But they were like solid steel and the hammer broke into peebles.<br>\r\n\"What the...?\" Said the barbarian.<br>\r\nRed took a big log and said \"my turn\" then hit the poor Corbin and home runned him 64 yards away. The humiliated lumberjack could not believe what he saw. He thanked Red and continued his foraging wood chores.<br>\r\nRed kept walking down the trail...<br>\r\n</span></div></div>",
            "created":1513023360,
            "id":2426792,
            "title":"punch her in the abs with a hammer"
        },
        "134121221":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "all of it.",
                "1/2 of it for now.",
                "a few leaves to see if it was enough."
            ],
            "content":"<div class=\"\"><div> <span>Red finally arrived at her Grandmother's House.  But her grandmother did not feel too well.<br>\r\n<br>\r\nRed almost panicked and said ' Grandma !!!!!'  when she almost fainted.  Red almost was in tears.  Then Red realized that she had some spinach in the basket.<br>\r\n<br>\r\nRed gave her</span></div></div>",
            "created":1513201140,
            "id":2427673,
            "title":"towards granny house"
        },
        "1341212211":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "go fish for ugly, slow fishes",
                "go fish for the big Sherman"
            ],
            "content":"<div class=\"\"><div> <span>\"Chew this\" said Red at the same time she gave her all of the spinach in the basket. But she did not got well, it was not working. Red took a look to the windows and saw a big lake, some fishes were floating slowly, others were a bit faster.<br>\r\nWithout thinking twice, Red stripped down to only her panties and training bra. She took a dive into the lake and went fishing in Goku style.</span></div></div>",
            "created":1513676100,
            "id":2429916,
            "title":"But nothing happens."
        },
        "134122":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "chiseled chest",
                "muscled feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>so where will it be?</span></div></span></div>",
            "created":1487142600,
            "id":2277796,
            "title":"somewhere unusual (pecs or feet)"
        },
        "1342":{
            "author_id":"hawksoup",
            "author_name":"Moe",
            "choices":[
                "She ran away..not strong enough",
                "She yelled at it, flexing her muscles.  I can kick his butt.",
                "She quickly ate some more spinach."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Red felt so confident until she heard noise nearby. She flexed her muscles and approached the noise. It was Bigfoot, nearly 10 ft tall.<br>\r\n<br>\r\nRed gasped at first at the hunky Bigfoot</span></div></span></div>",
            "created":1595602800,
            "id":2874132,
            "title":"Other..Bigfoot"
        }
    },
    "info":{
        "author_id":"hawksoup",
        "author_name":"Moe",
        "brief_description":"Most of us know about the children story \" Little Red Riding Hood\"  - Have fun RPing.",
        "created":1338842580,
        "description":"<td align=\"left\" class=\"norm\">We are familiar with the story Little Red Riding Hood, the Wolf, the Grandma, and the Woodsman/Lumberjack.<br>\r\nI am sure that we enjoyed it growing up. But could we have her have a different adventure. It can start out normal but it can vary later on. I am making the rating no higher than <b>PG13.</b> Please no sex, bad words, gore, or anything not PG13.  (update: No body swap or transgender either. This one is for a broader range of audience. But we still <b>can give her an adventure<i></i></b> ( or even let her take a boring walk to her Grandmother.....if that is what the readers want. LOL and YES, she can fight too IF she wishes. LOL )<br>\r\n<br>\r\nPlease <b>no</b> killing Red Riding Hood. She is the star of the story. It can include Muscles Growth and/or Shrinking. But that is <b>not required</b> at all either.</td>",
        "id":1871710,
        "image_url":"https://www.Writing.Com/main/images/action/display_cover/id/101198.jpg",
        "last_full_update":1595602800,
        "modified":1595602800,
        "pretty_title":"Red Riding Hood 's  strange adventure"
    }
}