{
    "chapters":{
        "1":{
            "author_id":"jdf318",
            "author_name":"Exodiac",
            "choices":[
                "Hide in the purse",
                "Stay on her foot",
                "Wait here"
            ],
            "content":"<div class=\"\"><div> <span>\tYou arrived first to English class, as usual. The class before lunch, it always got you excited to go, and the class it self wasn’t bad as well.  As usual, Mr. Mullen wasn’t in the classroom, and the lights were off, presumably because his last class takes place in the school’s library. Hitting the light switch to turn the lights on, sends a course of electricity throughout your body. You couldn’t handle the sudden shock, and passed out. Presumably a minute or so later, you get up, only to realize you had know clue where you were. All around where impossibly large walls, with large plains held up by giant metal rods extending to the sky. Then it dawned to you. You were still in class. Just a lot smaller.<br>\r\n<br>\r\n\tSuddenly, the ground shook, and you realize that someone was coming, and that you needed to move. Before you could even move a couple yards (from your perspective) though. the intruder had already passed, just barely missing you. Whoever it was, was wearing flip flops, so you assumed it was a girl. Looking up was no use, you had forgotten your glasses, so you could not tell who it was, until they sat down at their seat. It was your friend Alyssa, and you knew she could be trusted to help me. First however, you needed to move, cause pretty soon more people would be coming in the room, and there was a good chance at least one of them would accidentally step on me, something which I could only imagine being fatal.<br>\r\n<br>\r\n\tSticking to the wall to maximize your chances of not being crushed, you inch your way to Alyssa, inching being in a normal sized person's terms. Of course she sits in the back of the room, so by the time you get to her, the class had started, and the seats were all filled. Luckily you managed to take a path not crossing anyone, so you get their with little trouble. The trouble never really was to get to Alyssa, but what to do when there.<br>\r\n<br>\r\n\tThere isn’t much more demeaning then standing there, completely dwarfed by a single flip-flop clad foot. Let alone two of them. Let alone the whole, completely enormous person they are attached to. Hell, you are dwarfed by her big toe. And there lies the problem; at this size, how do you get her attention at all, let alone not being classified as a wayward itch, or worse, a bug. Alyssa doesn’t like bugs much, so being mistaken for one would be the end of you, fast.<br>\r\n<br>\r\n\tTentatively, you approach one of her feet, and poked her big toe. Nothing happened. Again you poke her toe, progressively harder, until the point where you are punching it. This managed to get a response from her, but not one you were aiming for. Instead of looking down, she brought the other foot over to get rid of the itch you had caused. Luckily for you, you see this coming, and manage to jump off before the massive flip-flop came down upon you. After she was satisfied with dealing with the itch, she returned her foot back to it’s own side. This clearly isn’t working well<br>\r\n<br>\r\n\tYou had to think of a new way to get her attention. Pulling out your phone, you checked to see if it had service and… yes! Even near microscopic size, your phone could still get a signal. You quickly write out a text to Alyssa. “Alyssa! Look down!”. About a minute later, she managed to text back, with “?”, and without looking down. Annoyed, you send her another text, which said “Just look down on the ground please!” And stood firmly in front of her chair. Of course she didn’t look down though. In fact, the only thing that happened was Mr. Mullen came over and took her phone away. Whoops. Only a couple minutes are left in class, and you needed to think of something fast. From what you can see, you have two options, to attempt holding on to her foot when she gets up, or to wait in the classroom for someo-<br>\r\n<br>\r\n\tSuddenly a loud bang startles you into turning around, instinct taking over and mind intent of fleeing. Before you can run however, you realize it was just Alyssa dropping her... Purse! You could jump in and hide in her purse, and wait till she opens it next, of course assuming you survive inside the purse. Well, with about 30 seconds left of class, you decide to...</span></div></div>",
            "created":1344374280,
            "id":1399697,
            "title":"The beggining"
        },
        "11":{
            "author_id":"etcetera",
            "author_name":"Neon",
            "choices":[
                "You fall off of the purse entirely, only to land in Alyssa's palm. (She saw you)",
                "You struggle to survive in the purse as Alyssa heads to her next class.",
                "Alyssa is held after class because of her phone. (Send her another text)"
            ],
            "content":"<div class=\"\"><div> <span>The clock was ticking. Quite literally, in fact. At your size, all sounds were amplified manyfold, including the hands of the clock, which hung high above you like a distant sun. The ticking was maddening, and the room was fraught with distractions, but you knew you had to focus. With just thirty seconds left until class ended, it was do or die. About twenty bored classmates leaving the room after class was already chaotic enough when you were normal-sized, but at your current \"disadvantage\" you could easily be trampled by the ensuing stampede. The purse plan had to work, right? Okay, so maybe you thought the texting idea was gold when it'd actually turned out to be a flop, but you knew this was definitely a surefire way to make sure you didn't lose Alyssa. That gigantic purse was the last flight off an island doomed by a tsunami, as far as you were concerned.<br>\r\n<br>\r\nSure enough, your hunch was correct. She was reaching down to put one of her pencils back into the purse. Now was your chance! Feeling a rush of energy you never knew you possessed, you charged headlong toward the monolithic bag, almost unable to skid to a halt before crashing into it. So this was what true adrenaline felt like. The purse was slumped over in your direction, leaving a relatively easy and direct path to the lip from where you had just begun climbing. After a good thirty seconds of scampering, you found yourself just shy of the top as the shrill school bell rang out, sending a jolt through your body that froze you. Alyssa was about to take off, and you weren't safely inside her purse yet! As you crane your neck to look up, you start to curse your awful luck as you notice how much ground you still have to cover. How could you already be out of time?!<br>\r\n<br>\r\nIt hadn't dawned on you how truly objective the rest of the world was to your plight. This wasn't some movie where last minute escapes were always handed out to the protagonist. You had to make your own luck. Alyssa, still blissfully unaware of the fact that she was her shrunken friend's only hope for survival, absentmindedly began to scoop up her purse, slinging the strap over her arm as you desperately scampered up the last few remaining inches. A purely instinctual leap landed you right on the lip of the purse, and to that you clung for dear life as the entire purse lifted off from the ground like a space shuttle. Although your grip was solid, there was no way you were going to be able to hold on now that your unwitting savior was going to be carrying her bag and jostling it around. As gravity reeled you in, all you could see was the yawning mouth of the purse displaying its inky black recesses.</span></div></div>",
            "created":1344382560,
            "id":1399823,
            "title":"Last Flight"
        },
        "111":{
            "author_id":"ianimeyou",
            "author_name":"iAnimeYou",
            "choices":[
                "...that might've been me.\"",
                "..blame Allisa!\"",
                "....you just look so adorable like that! *squeal!*\""
            ],
            "content":"<div class=\"\"><div> <span><span class=\"cplum\">(Note: Poster of this interactive story didn't give the main character we play as a name, so I just went with one of my OC's names. If you don't like it, then choose the *Other* option on the options below if you would like to add this with a different name, although please keep what I've typed and just replace the name. Thanks. ~iAnimeYou)</span><br>\r\n<br>\r\nUnluckily, you soon lose grip because of your weariness from the adrenaline run and land in her hand just as she was putting it under her bag to hold onto it. She closes her hand around the band strapped to her shoulder, squeezing you against the band and dreadfully irritating your back. <span class=\"cplum\"><b><font class=\"size1\" style=\"\"><i>So bad, it's probably gonna come up as a problem in a later chapter..</i></font></b></span><br>\r\n<br>\r\nAs she gripped her band squishing you even more, and further irritating your back, she went to her locker, and felt something irritate her hand on her bag, and she let go of the band dropping you ontop of her purse. \"Hey! Ashlyn, is that really you?\" says Alyssa. \"Yeah, I was going to sit down, and I just shrunk, ya know? I was trying to get your attention by texting, but it looks like you just lost your phone for the day. Sorry about that..\" you shout as loud as you can, hoping she won't have to struggle to hear you due to your miniature size. Luckily, she heard you just fine. Infact, she heard you as if you were just standing beside her talking at a normal voice. \"Yeah, that wasn't my phone, it was my sisters. Mine's in my purse, she left it in my room last night and I picked it up by accident. I was gonna give it back to her, but oh well for now. But hey, I noticed you're a bit smaller. About when you shrunk..</span></div></div>",
            "created":1431999600,
            "id":1979986,
            "title":"Hey, friend! How's.. uh.. life..?"
        },
        "12":{
            "author_id":"jdf318",
            "author_name":"Exodiac",
            "choices":[
                "Stay on her foot",
                "Squeeze between her toes",
                "Jump into the locker"
            ],
            "content":"<div class=\"\"><div> <span>You decide that staying with Alyssa is your best bet at surviving this whole ordeal, even if that means hitching a ride on her foot. It wouldn't be for too long, you figure. She has lunch next, which will give you much more time to get her attention. Now however, you need to figure out how you are going to manage this... and fast, as she was already getting up.<br>\r\n<br>\r\nWith no time to spare, you make a mad dash onto her foot, and clasp your arms around her big toe, the only thing you figure that you can manage to hold onto when in motion. Even her big toe was bigger then you, so you could only get your hands halfway around it. The dark paint was chipping, to your eyes anyway, and the rough texture stopped you from slipping around. Then she took her first step, and you were not prepared.<br>\r\n<br>\r\nSuddenly you were high in the air, almost instantly, and again on the ground. Each step was a blur of movement, and you close your eyes in fear, gripping her toe with everything you have. Though about three steps in, it's clear that you are losing the battle. You begin to tire, and you can feel your grip loosening, each step jolting you, as if her toe was a mechanical bull trying to throw you off. eleven steps.... twelve steps... twenty steps and you feel like you can't take it anymore. Just as your body is ready to give in... she stops.<br>\r\n<br>\r\nIt was too soon to be in the cafeteria. Looking up to the heavens above, you realize she is simply at her locker, probably to get out homework to do for her study period. This gives you a chance to come up with a better strategy on how to survive the journey. For one, you can continue holding on to her big toe, you must be over half way there to class and if you made it this far you should be ok. On the other hand, your already very weary from the journey, and if your strength fails you during the trip, the results would be disastrous. <br>\r\n<br>\r\nAnother, if not a more disgusting way, would be to try to get between two of her toes, keeping you secure and safe from being lodged off during the ride. This could also catch her attention, potentially saving you much faster, if you can deal with the smell. Both of those seem reckless and dangerous, and so you realize you could also jump into her locker. You could climb up to the top while she was in classes, and when she comes back to her locker, you would be in easy sight range. This is much safer then the other routes, but might take longer to get help. You need to once again choose fast though, as she won't stay at her locker for long.</span></div></div>",
            "created":1346996340,
            "id":1422605,
            "title":"Stay on her foot"
        },
        "121":{
            "author_id":"jdf318",
            "author_name":"Exodiac",
            "choices":[
                "You are in the hallway.",
                "You are somewhere pitch black and can't see."
            ],
            "content":"<div class=\"\"><div> <span>You decide you don't want to squeeze between her toes, and that you need to stick with her, not just wait in her locker. Unfortunately, you've lost most of your strength, and are flown off after a couple steps. You fly through the air, losing conciseness upon impact.<br>\r\n<br>\r\nWhen you wake up....</span></div></div>",
            "created":1347261900,
            "id":1424497,
            "title":"Stay on her foot"
        },
        "122":{
            "author_id":"jdf318",
            "author_name":"Exodiac",
            "choices":[
                "Squeeze between her big toe and second toe.",
                "Squeeze between her second and third toes."
            ],
            "content":"<div class=\"\"><div> <span>You figure as gross as it is, you'll have a better chance at holding on if you squeeze between her toes. However, you have a couple options here. You can squeeze between her big toe and her second toe. This requires you to hold on still, as it isn't as tight. You also could squeeze between two of her other toes. It would be tighter, and would get rid of any chance of falling out.</span></div></div>",
            "created":1347259620,
            "id":1424479,
            "title":"Squeeze between her toes"
        },
        "1221":{
            "author_id":"jdf318",
            "author_name":"Exodiac",
            "choices":[
                "Try to hold on",
                "Bite her toe",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You decide that the best option would be to squeeze between her big and second toes.  Quickly, as she began to take her first step, you grab hold onto her big toe and swing your body to slide onto the side, by the divider on the flip flop. Each step she takes shakes your body, but positioning yourself behind the divider, you are safe from being launched off. However, as she continues to walk, you realize you have another problem on your hands. <br>\r\n<br>\r\nEvery stime she begins to take a step and brings her foot up, gravity pulls you down the flip flop. Realizing this you grab and pull yourself towards the divider, but not before her foot lands on your legs, causing pain to shoot up your legs. Your leg might be broken.<br>\r\n<br>\r\nYou can hold on for now, but the g force tests your grip, ebbing away strength as time goes on.  You figure she must be nearly there to lunch, and you might be able to hang on until then. On the other hand, if you can’t, you could try to get her attention now, though that would mean biting her for the quickest reaction. You decide to…<br>\r\n</span></div></div>",
            "created":1354240740,
            "id":1478467,
            "title":"Squeeze between her big toe and second toe."
        },
        "12212":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide for the quickest route, biting her toe. The thought repulses you but you dig your teeth in to her smelly second toe.<br>\r\n<br>\r\nDoes she feel it?</span></div></span></div>",
            "created":1412555040,
            "id":1867336,
            "title":"Bite her toe"
        },
        "122122":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "tickle her. It's super effective",
                "tickle her. It still does nothing."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>It tastes alluring, but your teeth are to weak and small to cause her any damage or even feelings. She obviously does not notice. Maybe you should try something else</span></div></span></div>",
            "created":1517590800,
            "id":2448426,
            "title":"no"
        },
        "1222":{
            "author_id":"jdf318",
            "author_name":"Exodiac",
            "content":"<div class=\"\"><div> <span>You decide to squeeze yourself between her second and third toes. Alyssa finishes up in her locker, and you are safely, if squeezed, between her toes. However, as she takes her first step, a lot more pressure is put on your body, and you realize this isn't going to be a good ride. Each step she takes continually squeezes you. You attempt to climb out of her toes, but to your dismay you find the pressure is too much to break free. <br>\r\n<br>\r\nYou don't know how much more you can take. Slowly your body starts breaking from the pressure, and not even halfway to her destination you pass out. Eventually your body is completely crushed, and your body is cleaned from between her toes later.</span></div></div>",
            "created":1347261180,
            "id":1424492,
            "title":"Squeeze between her second and third toes."
        }
    },
    "info":{
        "author_id":"jdf318",
        "author_name":"Exodiac",
        "brief_description":"You are shrunken in English class and need to get help to survive.",
        "created":1344374160,
        "description":"<td align=\"left\" class=\"norm\">Additions welcome, but will be modified to my satisfaction</td>",
        "id":1884118,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1517590800,
        "modified":1517590800,
        "pretty_title":"Shrunken in English Class"
    }
}