{
    "chapters":{
        "1":{
            "author_id":"prototype3",
            "author_name":"Issunboushi",
            "choices":[
                "A sua insaputa ero un esperto in poteri psionici",
                "A sua insaputa conoscevo un genio dell'elettronica",
                "Sapendo cosa la eccitava decisi di giocare una carta pericolosa",
                "Un giorno mi accadde una cosa incredibile che mi cambio' completamente",
                "Mentre preparavo la mia vendetta, lei mi contatto'..."
            ],
            "content":"<div class=\"\"><div> <span>Mi chiamo Tony e da poco sono stato lasciato in malo modo da Eva, 34enne, bellissima ma in preda a gelosia e psicosi varie che solo lei forse conosce.<br>\r\n<br>\r\nDopo quasi sette anni di relazione a distanza (si, lo so, era una cosa un po' insolita) lei ha deciso che non ero l'uomo della sua vita, anzi, che ero esattamente come tutta la feccia maschile che ogni giorno se la mangia con gli occhi incollati al culo mentre passa, vestita con stile da prostituta d'alto borgo e quel fisico femminile che ti dice \"portami a letto e dominami\". Ma a Eva non piace essere dominata. A lei piace dominare.<br>\r\n<br>\r\nMi ha raccontato della sua fantasia sul comandare degli omini rimpiccioliti come schiavi giorni dopo che mi aveva 'stracapito' e lasciato la prima volta, a due mesi da quando mi ha avvicinato lei. Il fatto che fosse anche complementare alla mia fantasia di omino rimpicciolito mi aveva reso l'uomo piu' felice del mondo.<br>\r\n<br>\r\nCome tutte le storie apparentemente perfette pero', Eva mi arreco' anche molti danni, tradendomi, lasciandomi e poi ritornando. Sapendo che non era perfetta una volta mi ero lasciato andare anch'io, quasi finendo in pasto a una psicopatica, e quando fu proprio Eva a tirarmi indietro mentre barcollavo sul ciglio della disperazione mi giurai che sarei rimasto con lei per sempre. Non importava a quale prezzo.<br>\r\n<br>\r\nFu cosi' che dopo un anno quasi esatto, lei mi lascio'. Di punto in bianco. A pochi giorni da Natale. Con una scusa insulsa, dettata dalla sua gelosia irrefrenabile verso una mia fidata amica che viveva molto piu' vicina di lei, aveva buttato nel cesso quella che era la storia piu' perfetta e stabile tra tutte quelle che ho mai avuto o conosciuto da altri, e aveva tirato l'acqua, bloccandomi da ogni contatto.<br>\r\n<br>\r\nEro distrutto, ero stato infamato, ero incazzato per l'ingiustizia dopo che lei aveva pure avuto una figlia nel tempo in cui eravamo stati 'insieme', che io avevo accettato nonostante il dolore di non averla piu' potuta sentire come parte della famiglia che volevo costruire con lei.<br>\r\n<br>\r\nEro deciso a fargliela pagare, in un modo o nell'altro.<br>\r\n<br>\r\nNon avendola mai toccata, ma desiderandola ora piu' che mai, forse, mi decisi a usare una risorsa che lei non si sarebbe mai aspettata...</span></div></div>",
            "created":1588654800,
            "id":2830559,
            "title":"Caduto In Disgrazia"
        },
        "14":{
            "author_id":"prototype3",
            "author_name":"Issunboushi",
            "choices":[
                "...rimpicciolirmi a piacimento e diventare virtualmente indistruttibile",
                "...controllare la mente di chiunque e riscriverne i pensieri",
                "...trasformarmi in qualsiasi insetto o animale",
                "...trasformarmi in qualsiasi oggetto, anche commestibile",
                "Decisi di provare a chiedere due poteri insieme"
            ],
            "content":"<div class=\"\"><div> <span>Ormai ero determinato a fargliela pagare, ma ogni piano che formulavo mi rendevo immediatamente di come non avrei potuto attuarlo senza un enorme rischio. Che sia stata un'operazione di furto con scasso rubandole tutte le scarpe e mutandine o qualcosa di simile, non avrei fatto che incappare in qualche complicato momento in cui avrei perso il controllo della situazione e lei mi avrebbe colto con le mani nel sacco.<br>\r\nE poi non volevo piu' solo annusare le sue scarpe e mutandine, o venderle su ebay a qualche maniaco. Volevo proprio lei.<br>\r\nMa come avere una donna che ti odia e ti evita come la peste?<br>\r\n<br>\r\nFu allora, dopo quel pensiero, che un bagliore di luce dorata si genero' davanti a me nel mio salotto.<br>\r\nPreso dalla sorpresa e dal panico pensando solo a una granata accecante arrivata da chissa' dove, mi buttai a terra coprendomi la testa.<br>\r\n<br>\r\nDopo quelli che sembrarono solo due secondi, una voce soave mi rincuoro'.<br>\r\n<br>\r\n\"Alzati. Non temere\" disse una voce che sembrava echeggiare da parete a parete.<br>\r\n<br>\r\nGuardai in alto e la vidi.<br>\r\n<br>\r\nL'essere che aveva parlato era un mix tra una creatura mitologica e una pornostar. Volteggiava senza peso nell'aria a un metro da terra, era donna fino ai fianchi e da li' in giu' aveva l'addome di un'enorme ape con riflessi d'oro. L'unico indumento che aveva era un copricapo che sembrava fatto di foglie di una pianta gigante, capelli bianchi corti, e dondolava nell'aria, le braccia ciondolanti ai lati, e quelle tette abbronzate e nude in netto contrasto con i chiarissimi capelli.<br>\r\nVidi i suoi occhi di un rosa pallido fissarsi seri ma gentili nei miei.<br>\r\n<br>\r\nTirandomi in piedi e cadendo in ginocchio davanti a tanta maestosita', farfugliai.<br>\r\n<br>\r\n\"C-Chi sei?\" ebbi il buon senso di non usare 'cosa' ma 'chi' per non offenderla.<br>\r\n<br>\r\nL'aliena creatura sorrise sottilmente, poi comincio' a spiegarmi. Ma non parlo'. La sua voce si confondeva nella mia testa, stava letteralmente trasferendo le informazioni telepaticamente nel mio cervello, senza perdere tempo in chiacchiere.<br>\r\n<br>\r\nNei pochi secondi in cui avvenne questo contatto capii che ero stato scelto come 'sperimentatore' di poteri della mente latenti, che una razza aliena (che apparentemente aveva creato la razza umana partendo dal proprio DNA e a quello delle scimmie terrestri) non aveva avuto il tempo di sbloccare nella specie umana dal momento che era stata attaccata e obbligata a una guerra inaspettata contro un'altra razza aliena che si opponeva alla nostra creazione e al nostro sviluppo spirituale.<br>\r\n<br>\r\nQuando la comunicazione fini' e mi fu tutto chiaro, capii che era il mio giorno fortunato. Dovevo solo scegliere.<br>\r\n<br>\r\nCosa fareste se aveste solo un minuto scarso per prendere una decisione che potrebbe portarvi ad avere sia il potere di un dio in terra, sia la capacita' di ridurvi allo schiavo piu' inerme e debole? Nessuno sceglierebbe la debolezza di fronte al potere, ma dipende tutto dalla situazione in cui ci si trova. Dipende da cosa ci si e' addestrati a volere.<br>\r\n<br>\r\nE io avevo sempre voluto rimpicciolirmi e spiare una donna come Eva, come una formica ai suoi bellissimi piedi, senza che lei potesse farmi niente (a meno che non mi avesse visto). Visto e riconosciuto, direi, dal momento che Eva aveva ammesso di non uccidere niente, nemmeno gli insetti. Avrei potuto trasformarmi in insetto, e mi avrebbe dato briciole da mangiare, ma avrei voluto questo? Farla innamorare di una minuscola creatura e farmi accudire magari mentre era in completino intimo come spesso girava per casa? Avrei potuto diventare anche il suo padrone, mi sarebbe bastato modificare i suoi pensieri, ma l'enorme falla di quel piano sarebbe stata non vederla piu' come una vera vendetta. Volevo che continuasse a odiarmi, a evitarmi, ma avere la possibilita' di averla ogni volta che volevo, a sua insaputa. Cosi' tante possibilita' e un minuto per decidere...<br>\r\n<br>\r\nAlla fine mi chiesi \"che cosa voglio davvero? Piu' di tutto?\"<br>\r\n<br>\r\nMossi le labbra e la mia voce, quasi in modo automatico, parlo'.<br>\r\n<br>\r\n\"Scelgo il potere di...........................................\"</span></div></div>",
            "created":1588654800,
            "id":2830860,
            "title":"Dejavu Di Un'Altra Realta'"
        },
        "141":{
            "author_id":"prototype3",
            "author_name":"Issunboushi",
            "choices":[
                "Qualcuno busso' alla porta",
                "Ricevetti un messaggio al computer",
                "Decisi di scrivere un altro capitolo della storia fetish sulla mia ex",
                "Decisi di fare due passi al parco vicino casa",
                "Decisi di provare a usare quel fantomatico potere..."
            ],
            "content":"<div class=\"\"><div> <span>Una creatura con poteri immensi arriva dallo spazio, ti offre la possibilita' di avere qualsiasi potere desideri e tu cosa scegli?<br>\r\nIl potere di diventare quasi completamente senza potere, alla stregua di un insetto, forse facilmente annientabile pure.<br>\r\n<br>\r\nMa non potevo fare altro, era la scelta che avrei voluto fare tutta la vita. Avevo letto libri, siti internet, di antiche culture e tutto l'esoterismo possibile. Non c'era niente. Solo un accenno a un potere Yoga, \"Anima\", che avrebbe conferito la capacita' di miniaturizzarsi. E solo dopo decenni di meditazione, se non secoli, ovviamente, quindi discutibile e forse molto improbabile.<br>\r\n<br>\r\nQuesta possibilita' mi era stata offerta in un istante, e quell'istante l'avevo afferrato.<br>\r\n<br>\r\nLa strana ragazza-ape aliena annui', apri' le braccia leggermente e un'aura dorata si espanse da lei a me, irrorando il mio corpo e rendendomi quasi estatico, sebbene confuso. Dopo che dovetti chiudere gli occhi per la luce troppo intensa, il bagliore calo' di colpo, e riaprendoli non la trovai piu'.<br>\r\n<br>\r\nMi guardai attorno cercandola con lo sguardo, ma capii che doveva avermi fatto qualcosa. \"E il potere?\" mi chiesi, non sentendomi minimamente diverso, ma solo il verso degli uccelli estivi fuori dal balcone mi rispose.<br>\r\n<br>\r\nPer un attimo restai immobile riflettendo sulla visione che avevo appena avuto, ma via via mi convinsi che ero stato vittima di un sogno a occhi aperti o un'allucinazione molto vivida.<br>\r\n<br>\r\n\"Pffft.. seee, certo.. il potere di rimpicciolirmi.. come no..\" risi da solo per la mia ingenuita' e mi sedetti sul divano accendendo la televisione.<br>\r\n<br>\r\nDopo qualche minuto di zapping...</span></div></div>",
            "created":1588654800,
            "id":2830916,
            "title":"Rimpicciolirsi"
        },
        "1411":{
            "author_id":"prototype3",
            "author_name":"Issunboushi",
            "choices":[
                "Anna, la vicina di casa",
                "Aela, dell'agenzia immobiliare",
                "Milena, la pulitrice dell'Est",
                "Nessuno?",
                "Eva???"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Assorto com'ero nei miei pensieri quasi sussultai quando sentii bussare alla porta. Non avendo la minima idea di chi potesse essere mi alzai e chiesi chi era.<br>\r\n<br>\r\nUna voce femminile dall'altra parte mi rispose...</span></div></span></div>",
            "created":1588654800,
            "id":2830956,
            "title":"Visita Inattesa"
        },
        "1414":{
            "author_id":"prototype3",
            "author_name":"Issunboushi",
            "choices":[
                "1",
                "2"
            ],
            "content":"<div class=\"\"><div> <span>Il parco distava nemmeno cinque minuti e una volta raggiunto ci si poteva dimenticare di essere in citta'. Completamente circondato da fogliame, l'unico ricordo della citta' era il rumore delle auto, ma in questo periodo estivo mentre quasi tutti erano in vacanza o al mare regnava un ipnotico silenzio.<br>\r\n<br>\r\nUn sentiero di cemento battuto affiancato da fiori e siepi raggiungeva un piccolo laghetto artificiale e delle panchine di legno in piccole aree appartate. Decisi di andare a sedermi su una di queste e rilassarmi un po' al sole.<br>\r\n<br>\r\nSvoltato l'angolo di una siepe piu' alta, vidi che la panchina era gia' parzialmente occupata.<br>\r\nUn'attraente mora in vestito leggero blu e sandali col tacco basso sedeva con a fianco un passeggino coperto, gli occhi fissi su qualcosa che stava leggendo con attenzione, le gambe accavallate.<br>\r\n<br>\r\n(Una giovane madre, eh? Va beh, vedo se posso sedermi lo stesso e magari mi rifaccio gli occhi..)<br>\r\n<br>\r\nMi avvicinai alla panchina e quando alzo' lo sguardo dal cellulare parlai.<br>\r\n<br>\r\n\"Mi scusi, posso?\" chiesi indicando il lato vuoto della panchina.<br>\r\n<br>\r\nLa donna, con un sorriso educato, rispose. \"Prego, e' libero.\"<br>\r\n<br>\r\nRingraziandola mi sedetti e mi appoggiai con la schiena chiudendo gli occhi per il sole.</span></div></div>",
            "created":1597554000,
            "id":2886668,
            "title":"La Passeggiata"
        },
        "1415":{
            "author_id":"prototype3",
            "author_name":"Issunboushi",
            "choices":[
                "Dei boati che fecero tremare il pavimento si fermarono davanti alla mia porta.",
                "Dovevo trovare qualcuno con cui sperimentare la mia resistenza.",
                "Sentii il mio cellulare vibrarmi in tasca. Era rimpicciolito ma funzionava.",
                "Decisi di esplorare fuori dal mio appartamento...",
                "Le scarpe della pulitrice!"
            ],
            "content":"<div class=\"\"><div> <span>Se era stata un'allucinazione l'avrei capito subito. Decisi di provarci.<br>\r\n<br>\r\nMi misi in piedi tra il divano e l'ingresso in modo da avere piu' spazio, e chiusi gli occhi. Non avendo idea di come fare, focalizzai la mia attenzione su una statura minuscola, un paio di centimetri. Cosi', tanto per decidermi alla svelta.<br>\r\n<br>\r\nMi scappo' una risatina mentre mi visualizzavo cosi' piccolo, sentendomi stupido per averci provato, quindi lasciai perdere e aprii gli occhi.<br>\r\nLo scenario che mi trovavo davanti pero' non era niente di cui ridere.<br>\r\n<br>\r\n\"Ma che...?\"<br>\r\n<br>\r\nIl mio appartamento si era espanso in tutte le direzioni. La pianura bianca fatta di piastrelle grandi come piazze si estendeva a non finire coprendo per meta' il mio campo visivo a meno che non guardassi verso l'alto. Il soffitto era cosi' alto che l'umidita' dell'aria era quasi visibile in forma di foschia. Girai la testa verso il mio divano ma vidi solo una parete nera alta come un grattacielo; una corrente d'aria fresca che profumava di pelle mi muoveva i capelli. E di fronte a quella montagna di pelle, la porta d'ingresso era un legnoso cancello che si estendeva quasi fino al cielo, imponente e invalicabile. Tranne che per quello spazio sotto di esso, largo abbastanza perche' potessi passarci senza nemmeno strisciare, mi sarebbe bastato abbassarmi.<br>\r\n<br>\r\n\"Assurdo... sono davvero piccolissimo.. il potere funziona!!!\"<br>\r\n<br>\r\nSbraitai in una risata che mi sembro fortissima, ma una persona di dimensioni normali non avrebbe sentito che un verso stridulo e debole, e avrebbe immaginato che provenisse da fuori.<br>\r\n<br>\r\n\"Aspetta, aspetta.. cos'ha detto l'aliena? Che sarei diventato virtualmente indistruttibile? Significa che anche se mi schiacciano non mi sarei fatto niente??\"<br>\r\n<br>\r\nNella sicurezza del mio appartamente, invalicabile per chiunque di normali dimensioni a meno che non avesse la chiave, non mi spavento' nemmeno l'idea di venire schiacciato. Era un'idea lontana, remota, non..</span></div></div>",
            "created":1589086800,
            "id":2833632,
            "title":"Mini Me"
        },
        "145":{
            "author_id":"prototype3",
            "author_name":"Issunboushi",
            "choices":[
                "Rimpicciolimento e controllo della mente",
                "Rimpicciolimento e teletrasporto",
                "Rimpicciolimento e rallentare il tempo",
                "Rimpicciolimento e rigenerazione totale (anche dopo schiacciato completamente)",
                "Insettificazione e rigenerazione totale (anche dopo schiacciato completamente)"
            ],
            "content":"<div class=\"\"><div> <span>Volevo rimpicciolirmi ad ogni costo, ma sapevo benissimo che avrei rischiato costantemente la vita se non fossi stato in grado di avere qualche vantaggio degno di quel nome oltre a una semi-invisibilita' sul pavimento.<br>\r\n<br>\r\n\"Due poteri?\" la voce mentale mi risuono' nella mente. Dopo una pausa, l'aliena annui'. \"Accetto\" disse.<br>\r\n<br>\r\nEbbene? Quale vantaggio puo' aiutarmi a non essere proprio indifeso come un insetto ai piedi di una donna che con tutta probabilita' mi schiaccerebbe sotto al piede?</span></div></div>",
            "created":1588654800,
            "id":2830965,
            "title":"Due poteri?"
        },
        "1454":{
            "author_id":"prototype3",
            "author_name":"Issunboushi",
            "choices":[
                "Decisi di provare subito",
                "Decisi che era tutta un'allucinazione",
                "Decisi di provare in un luogo pubblico",
                "Decisi di fare due passi al parco vicino casa",
                "Altre scelte"
            ],
            "content":"<div class=\"\"><div> <span>Stavo quasi per cedere alla tentazione di volermi trasformare in insetto, con in mente il fatto che Eva non avrebbe mai ucciso volontariamente una creatura indifesa, ma volevo \"prenderla\" da uomo. Degli organi sessuali da insetto forse avrebbero anche potuto farmi sentire di piu', non lo sapevo, ma lei si meritava la MIA vendetta come tutto quello che ero.<br>\r\n<br>\r\nCosi' decisi.<br>\r\n<br>\r\nUn bagliore accecante mi costrinse a chiudere gli occhi un istante dopo che la mia mente aveva scelto. Non avevo nemmeno dovuto dire il desiderio a parole, il mio pensiero era gia' sufficiente.<br>\r\n<br>\r\nUn fruscio come d'ali e il bagliore era sparito.<br>\r\nAprii gli occhi per ritrovarmi come prima da solo nell'appartamento.</span></div></div>",
            "created":1588827600,
            "id":2832004,
            "title":"La Fantasia Piu' Pericolosa E Sicura"
        },
        "14545":{
            "author_id":"prototype3",
            "author_name":"Issunboushi",
            "choices":[
                "Anna, la vicina di casa",
                "Una venditrice porta a porta",
                "Due ragazzine minorenni dei boyscout",
                "Emily, la figlia della scienziata stangona del piano di sopra",
                "Quella stronza dell'amministratrice del palazzo"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Chi poteva essere ora?</span></div></span></div>",
            "created":1588827600,
            "id":2832007,
            "title":"Qualcuno suono' al campanello"
        },
        "145451":{
            "author_id":"prototype3",
            "author_name":"Issunboushi",
            "choices":[
                "...ero in mano ad Anna",
                "...ero in mano a Nerissa, la sorella bionda di Anna",
                "...ero sdraiato su un panno sul divano",
                "...ero sdraiato sul letto di Anna, alle mie normali dimensioni",
                "...ero ...dov'ero?"
            ],
            "content":"<div class=\"\"><div> <span>Ero ancora spaesato per l'evento a cui avevo preso parte.<br>\r\n<br>\r\n(Ma che cazzo di allucinazione...?)<br>\r\n<br>\r\nDRIIIIN!<br>\r\nIl citofono mi fece fare un salto per i nervi a fior di pelle.<br>\r\n<br>\r\n\"Si? Chi e'?\" risposi.<br>\r\n<br>\r\n\"Ciao, sono Anna, scusa ho lasciato le mie chiavi da te e sono appena tornata con la spesa..\"<br>\r\n<br>\r\nFeci una risatina mentre aprivo il portone. Anna era.. come dire.. era una gran figa per essere la mia vicina, era amichevole, onesta, ma era anche proprio sbadata. Cercai sul mio bancone in cucina e trovai le sue chiavi semi-infilate sotto a una cesta di frutta.<br>\r\n<br>\r\n(Anna.. Anna.. non e' che lo farai apposta per avere una scusa per parlare con me? Mica ti piaccio, vero?)<br>\r\n<br>\r\nMentre la mia mente faceva delle ipotesi convenienti, mi infilai le mie chiavi in tasca e scesi per aiutarla.<br>\r\n<br>\r\n\"Oh grazie! Non serviva!\" disse con un pacco di carta igienica che le rotolava fuori da sotto un braccio.<br>\r\n<br>\r\nLe presi tutte le borse e anche quella che aveva abbandonato nel sottoscala e le diedi in mano solo il pacco di carta e le chiavi.<br>\r\n<br>\r\n\"Eccole qua.. hai altro in macchina?\"<br>\r\n<br>\r\n\"No no, ho tutto qua..\" farfuglio un po' imbarazzata.<br>\r\n<br>\r\nPer un attimo l'idea di essere suo marito e trattarla con gentilezza mi diede un certo piacere. Era una donna dolce, come chiunque forse desidera ma che in pochi apprezzerebbero davvero, e che in molto avrebbero probabilmente perduto in qualche anno, non essendone all'altezza e considerandola inferiore. Uomini di merda.<br>\r\n<br>\r\nSorrisi facendo gli scalini dandole le spalle. In un minuto eravamo a casa sua e le mettevo le borse in cucina.<br>\r\n<br>\r\n\"Sid, io non so come ringraziarti.. sei sempre cosi' premuroso.. magari il mio ex marito fosse stato come te, ha ha ha!\"<br>\r\n<br>\r\nRisi ma parte di me voleva abbracciarla e chiederle se volesse essere mia. Ero piu' giovane solo di un paio d'anni e non ero certo un dirigente di banca ne' mai lo sarei stato, ma l'avrei trattata bene e lei mi avrebbe apprezzato.<br>\r\nPeccato come i soldi comunque tendano a rovinare sempre tutto. Avevamo solo questi momenti io e Anna e, forse capendo che non ci sarebbe stato di piu', almeno per ora, ce li godevamo come due innamorati che non si confidano perche' pensano che l'altro non sia interessato.<br>\r\n<br>\r\n\"Ma figurati..\" le dissi \"..sai che ogni volta che ti serve basta che mi chiami, si? Sempre al suo servizio, signora..\" le feci un inchino esagerato e lei rise.<br>\r\n<br>\r\n\"Dai, non fare cosi' che arrossisco... e ora sono signorina comunque, puoi anche essere piu' informale, dai. In fondo ci conosciamo da un po' ormai..\"<br>\r\n<br>\r\nLa guardai per un attimo, non capendo bene se volesse passare a un tipo di rapporto piu' intimo o..<br>\r\n<br>\r\nFu allora che Anna fece due passi verso di me, mi prese il viso tra le mani calde e morbide e mi bacio gentilmente.<br>\r\n<br>\r\nQuando mi lascio' andare dovetti deglutire per la sorpresa. Giuro che non mi sarei aspettato mai una reazione del genere, non che non mi fosse piaciuta ma ero completamente preso alla sprovvista.<br>\r\nLei si fermo' a guardarmi un attimo, compiaciuta e un po' maliziosa, ma sempre dolce.<br>\r\n<br>\r\n\"Madonna come sei tenero con le guance rosse... eh eh\" disse, e immediatamente sbiancai per l'imbarazzo, rendendo le guance al confronto ancora piu' rosse al confronto.<br>\r\n<br>\r\nVedendo Anna divertita dalla mia reazione mi sentii un po' troppo sconfortato per i miei gusti. Avrei voluto sparire e avere il tempo di pensare a come reagire in un modo che non fosse da coglione. Avrei voluto..<br>\r\n<br>\r\n\"Ma che...?? Ti senti bene Sid? Sei... piu' basso?\"<br>\r\n<br>\r\nIl tono immediatamente cambiato della donna mi sembro' allarmato, sorpreso, ma quello che diceva.. come era possibile?<br>\r\nEppure lo era.<br>\r\nLa mia visuale di Anna stava crescendo lentamente, era come se qualcuno stesse forzando la mia testa sempre piu' in basso, tanto che dovetti alzare lo sguardo per continuare a guardarla negli occhi... lei invece stava abbassando la testa, allarmata...<br>\r\n<br>\r\n\"Ma cosa sta succ.... oh no.... non mi sto mica rimpicciolendo???\" dissi in un modo che sembro' ridicolo anche a me, anche in quella situazione. Eppure stavo rimpicciolendo.<br>\r\n<br>\r\n\"Anna! Io non...\"<br>\r\n<br>\r\nVidi come la donna, sempre piu' sorpresa, si era abbassata in avanti. Le sue grosse tette premevano contro il tessuto tiratissimo della camicetta bianca, la mia visuale ormai partiva da sotto i suoi fianchi.. poi vidi la penombra sotto la sua gonna....<br>\r\n<br>\r\nBarcollai. Ero stremato dal fortissimo cambiamento e non riuscivo a fermarlo.<br>\r\n<br>\r\n\"Stop! STOP! Fermati!! ORA!!!\"<br>\r\n<br>\r\nSentii come un blocco di energia prendere posto nel mio corpo, fermando la mia discesa, ma alzando lo sguardo...<br>\r\n<br>\r\n\"Sid! Stai bene? Oddio sei piccolissimo... ma come puo' essere...\" la voce piu' intensa, echeggiante della mia attraente vicina sembrava amplificata. Non sapevo quanto fossi alto, ma ero ormai certo che la mia 'allucinazione' di poco prima non era stata affatto uno scherzo della mia mente. Era vero. Mi ero rimpicciolito.<br>\r\n<br>\r\nIpotizzai velocemente di aver subito questo cambiamento per via dell'emozione di quel bacio inaspettato. Quando pero' alzai lo sguardo di nuovo, troppo velocemente, per dirlo ad Anna e metterla al corrente, una montagna umana in tacchi neri e gonna si stagliava sopra la mia testa.<br>\r\n<br>\r\nNon riuscendo piu' a quantificare la mia statura e sentendomi perduto, per il momento, persi i sensi e svenni sentendo l'eco della voce della gigantesca donna che mi intimava di risponderle.<br>\r\n<br>\r\nQuando riaprii gli occhi...</span></div></div>",
            "created":1588827600,
            "id":2832008,
            "title":"Anna, la vicina di casa"
        },
        "1455":{
            "author_id":"prototype3",
            "author_name":"Issunboushi",
            "choices":[
                "...come una formica. Decisi di cambiare forma.",
                "Non finii la frase che dei nuovi, imponenti passi raggiunsero la mia porta!",
                "Tornai normale per calmarmi. Era troppo spaventoso per ora."
            ],
            "content":"<div class=\"\"><div> <span>Pensavo e ripensavo al rimpicciolimento.<br>\r\n<br>\r\nIn realta' non volevo affatto rimpicciolirmi per venire sottomesso da una donna. Non ero mai stato in quel genere di feticismo, non volevo una 'padrona' che mi comandasse. Volevo solo sapere cosa si prova a essere di fronte a tonnellate di figa sapendo che lei puo' schiacciarmi con il suo bellissimo piede. Volevo esplorare, farmi catturare forse, arrampicarmi e spiare. E un insetto passa molto piu' inosservato di un'impossibilita' fisica ambulante come un omino rimpicciolito.<br>\r\n<br>\r\nScelsi.<br>\r\n<br>\r\nLa ragazza-ape spiego' le braccia come fossero ali e un'energia dorata mi invase. Quando il bagliore diminui' e smisi di schermarmi il viso con le mani, aprii gli occhi e tutto era normale. Lei era svanita.<br>\r\n<br>\r\nRestai un momento a pensare. Non era stata un'allucinazione. Avevo pensato, avevo ragionato, avevo ...davvero rinunciato al rimpicciolirmi???<br>\r\nBeh, non proprio. Potevo rendere il mio corpo piccolissimo, in teoria, ma non avrei mantenuto la forma umana. Se tutto questo non era un sogno...<br>\r\n<br>\r\n[Formica.]<br>\r\n<br>\r\nIl pensiero si formo' da solo e un balenare di colori e sfumature mi ballo' davanti agli occhi per un istante, solo il tempo di realizzare che qualcosa stava accadendo, accompagnato da una sensazione di precipitare che mi fece sfuggire un verso strano, come uno stridulissimo squittio.<br>\r\n<br>\r\nQuando l'istante dopo tutto fini', mi ero stranamente teletrasportato in una grandissima piazza.<br>\r\n<br>\r\n(Ma dove cacchio sono!?)<br>\r\n<br>\r\nIl pavimento era bianco e tortuoso, ma altrimenti lucido. I miei occhi dovettero' abituarsi a mettere a fuoco la distanza. Seguii il pavimento bianco fino a quel muro di legno, quella colonna che diventava... occazzo....<br>\r\n<br>\r\n(La mia sedia!)<br>\r\n<br>\r\nEra piu' immensa di un palazzo, piu' alta della Torre Eiffel, piu' imponente di qualsiasi monumento avessi visitato nel mondo!<br>\r\nEd era solo una sedia. Non immaginai che cosa avrei provato di fronte a un'essere umano.<br>\r\n<br>\r\nMi grattai la testa con una mano che resto' incagliata e quasi mi strappai un'antenna... (ma che... aaaahhhh!!)<br>\r\n<br>\r\nPreso dall'enormita' dell'ambiente in cui mi trovavo non avevo nemmeno controllato il mio corpo. Era il corpo di una formica. Sentivo le mie forti zampette posteriori tenermi ben ancorato al pavimento, i miei organi sessuali sconosciuti ma molto pronti ad attivarsi a un mio semplice comando, senza dovermi nemmeno toccare! Erano molto piu' efficienti di quelli umani, almeno in quanto a velocita'.. Bene, pensai, cosi' non dovro' perdere tempo in una situazione pericolosa.<br>\r\n<br>\r\nFocalizzai la mia attenzione sulle antenne. Mi accorsi di come riuscivano a carpire movimenti dell'aria e tremori del terreno al punto da indicarmi la presenza di chiunque si trovasse in un raggio di diversi metri. Sentivo perfino gli zoccoli di Anna in cucina nell'appartamento accanto. Erano lontani ma per la mia percezione era come se fossero boati spaventosi. Probabilmente il mio corpo di formica stava avendo una reazione primordiale a questa potenziale minaccia. Paura. Paura di Anna. Terrore di Anna. Terrore di vederla camminare. Terrore di vederla alzare un piede e pressarmi sul pavimento, schiacciandomi come....<br>\r\n</span></div></div>",
            "created":1588914000,
            "id":2832711,
            "title":"Una Scelta Un Po' Kaftiana"
        },
        "14552":{
            "author_id":"prototype3",
            "author_name":"Issunboushi",
            "choices":[
                "\"Sono Aela, sono qui per l'ispezione mensile. C'e' nessuno?\"",
                "\"Sono Ania. Apri porta?\"",
                "\"Aprimi. Sono io.\" disse la mia ex.",
                "I passi si allontanarono.",
                "\"Apri la porta, insetto. So che ci sei.\" disse la voce misteriosa."
            ],
            "content":"<div class=\"\"><div> <span>La mia mente stava ancora facendo i conti con l'irrazionale paura di Anna, la mia vicina di casa, nonostante non fosse nemmeno presente nel mio appartamento e non potesse entrare a meno che non le avessi aperto io, che una nuova serie di tremendi boati mi fece girare verso la porta urlando con una vocina da insetto che nessuno avrebbe sentito nemmeno accovacciandosi per ascoltarmi.<br>\r\n<br>\r\nDal suono, sebbene amplificato di un centinaio di volte e piu', riconobbi che erano delle scarpe col tacco, e inaspettatamente il pensiero mi riusci' sia a terrorizzare (dopo troppi video di troie russe che schiacciano insetti per il piacere di maniaci sadici, o masochisti estremi tra i quali mi ritrovavo anch'io mio malgrado) sia ad eccitare in modo morboso, al punto da sentire i miei organi sessuali attivarsi come se stessi per scopare tra pochi secondi.<br>\r\n<br>\r\nDopo essermi detto che la mia reazione era esagerata e che dovevo calmarmi, una possente coppia di tuoni mi fece tremare le zampe posteriori e vacillare nella mia posizione a due metri scarsi da quella pericolosissima femmina umana gigante da cui la porta fortunatamente mi separava.<br>\r\n<br>\r\n\"C-Chi e'??\" dissi, sentendomi un tale cretino dopo un istante. Chiunque fosse non avrebbe mai potuto sentirmi. Tuttavia, la sua voce mi rispose per annunciarsi.</span></div></div>",
            "created":1589173200,
            "id":2833888,
            "title":"Al Di La' Della Porta"
        }
    },
    "info":{
        "author_id":"prototype3",
        "author_name":"Issunboushi",
        "brief_description":"Eva mi ha lasciato in modo patetico. Ora sta a me mettere in atto una insolita vendetta.",
        "created":1493877060,
        "description":"<td align=\"left\" class=\"norm\">[[[[UNICA REGOLA: NON AGGIUNGERE CAPITOLI. CAPITOLI AGGIUNTI DA ALTRI UTENTI VERRANNO RIMOSSI.]]]]<br>\r\n<br>\r\nMi chiamo Tony e da poco sono stato lasciato in malo modo da Eva, 34enne, bellissima ma in preda a gelosia e psicosi varie che solo lei forse conosce.<br>\r\n<br>\r\nDopo quasi sette anni di relazione a distanza (si, lo so, era una cosa un po' insolita) lei ha deciso che non ero l'uomo della sua vita, anzi, che ero esattamente come tutta la feccia maschile che ogni giorno se la mangia con gli occhi incollati al culo mentre passa, vestita con stile da prostituta d'alto borgo e quel fisico femminile che ti dice \"portami a letto e dominami\". Ma a Eva non piace essere dominata. A lei piace dominare.<br>\r\n<br>\r\nMi ha raccontato della sua fantasia sul comandare degli omini rimpiccioliti come schiavi giorni dopo che mi aveva 'stracapito' e lasciato la prima volta, a due mesi da quando mi ha avvicinato lei. Il fatto che fosse anche complementare alla mia fantasia di omino rimpicciolito mi aveva reso l'uomo piu' felice del mondo.<br>\r\n<br>\r\nCome tutte le storie apparentemente perfette pero', Eva mi arreco' anche molti danni, tradendomi, lasciandomi e poi ritornando. Sapendo che non era perfetta una volta mi ero lasciato andare anch'io, quasi finendo in pasto a una psicopatica, e quando fu proprio Eva a tirarmi indietro mentre barcollavo sul ciglio della disperazione mi giurai che sarei rimasto con lei per sempre. Non importava a quale prezzo.<br>\r\n<br>\r\nFu cosi' che dopo un anno quasi esatto, lei mi lascio'. Di punto in bianco. A pochi giorni da Natale. Con una scusa insulsa, dettata dalla sua gelosia irrefrenabile verso una mia fidata amica che viveva molto piu' vicina di lei, aveva buttato nel cesso quella che era la storia piu' perfetta e stabile tra tutte quelle che ho mai avuto o conosciuto da altri, e aveva tirato l'acqua, bloccandomi da ogni contatto.<br>\r\n<br>\r\nEro distrutto, ero stato infamato, ero incazzato per l'ingiustizia dopo che lei aveva pure avuto una figlia nel tempo in cui eravamo stati 'insieme', che io avevo accettato nonostante il dolore di non averla piu' potuta sentire come parte della famiglia che volevo costruire con lei.<br>\r\n<br>\r\nEro deciso a fargliela pagare, in un modo o nell'altro.<br>\r\n<br>\r\nNon avendola mai toccata, ma desiderandola ora piu' che mai, forse, mi decisi a usare una risorsa che lei non si sarebbe mai aspettata...</td>",
        "id":2120622,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1597630740,
        "modified":1597630740,
        "pretty_title":"La Vendetta dell'Ex"
    }
}