{
    "chapters":{
        "1":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "No, you have to go down the alleyway! It's the only way to make it on time!",
                "No way man. There's something creepy in there and I know it. *",
                "*make your own choice*",
                "*make your own choice*",
                "Why am reading this crap!? I just wanna see a pokemon morph!!1 >3("
            ],
            "content":"<div class=\"\"><div> <span>You begin to worry as you keep nervously glancing at your watch.<br>\r\nHolding your shiny black camera in your hand, you rush through a local park, and dash across the street.<br>\r\n<br>\r\nYou see, you're about to be late for an appointment. You recently moved to the city of New York, and you have an interview to be an assistant photographer.<br>\r\nAs a 16 year old boy, you don't have a car yet. This is the best job around, and you can't afford to miss it.<br>\r\n<br>\r\nThat is, not if you don't want to earn the money for one of those brand new Playstation fives..............<br>\r\nQuickly, you turn the corner and jab the walk button on a traffic light impatiently. You'll never make it to the interview at this rate!<br>\r\n<br>\r\nYou start to think angrily to yourself. How come your alarm clock had to be broken this morning? Seriously, it's the year 2019............ you'd think that technology would be better by now for alarm clocks.<br>\r\n<br>\r\nYou then sigh to yourself. Who are you kidding? Who cares about alarm clocks? Suddenly, a horn snaps you out of your train of thought.<br>\r\n\"Move it kid!\" a driver calls impatiently. \"Are you gonna cross the street or not?!\"<br>\r\n<br>\r\nYou shake your head, and scold yourself as you scury across the street. How come you always seemed to do that? Every time something important was happening, you somehow always found yourself daydreaming. Anyway, no time to worry about that now. Only 15 minutes till the appointment, and you still had a couple of blcks to go.<br>\r\n<br>\r\nSuddenly, you see a thin space between two buildings. Perfect! A shortcut! You'll be on time for sure now!<br>\r\nAs you approach this alleyway, you notice it seems kind of dark.............. and spooky. Maybe you shouldn't go down the alleyway..............?</span></div></div>",
            "created":1242536400,
            "id":692943,
            "title":"the beggining of our story"
        },
        "11":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "speed up and run like hell! This place is gonna eat you alive if you don't!",
                "slow down and relax. it's just abunch of garbage, and the interviewrequires calm",
                "wait, is that a door right there?",
                "*make your own choice*",
                "*make your own choice*"
            ],
            "content":"<div class=\"\"><div> <span>You glance around quickly. Is this really the best way?<br>\r\nYou take another look at the alleyway, and sigh. It is the ONLY way.<br>\r\n<br>\r\nNaturally you want to move slowly and cautiously, but you know you shouldn't. If you do, going through this place will be in vain.<br>\r\nSo, against your will, you pick up the pace and plunge into the dark alley.<br>\r\n<br>\r\nAs you skitter by, you see all sorts of things that disgust you. There are rotting cow bones, dirty ashes, old cobwebs, and black lumps of who-knows-what lining the incredibly thin gap between the buildings. And worst of all, there was a certain sort of evil, dark aura in the air that makes every single crack and shadow look like something straight out of a horror movie.<br>\r\n<br>\r\nYou begin to lose your cool and sweat forms around your brow. How long have you been in here? How long will it take to get out? What kind of of awful place is this? Is this even human-made? Quickly, you shake your head and take a breather. You just need to calm down and walk a little slower through this nightmare of an alleyway, or you'll lose your cool and never make it to your interview on time......................................right?</span></div></div>",
            "created":1242536400,
            "id":692946,
            "title":"No, you have to go down the alleyway! It's ..."
        },
        "111":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "Run back where you came from, it's less scary, and a shorter distance",
                "Just dash through the alleyway and get it over with!",
                "*make your own choice*"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You feel your heartrate begin to increase, and sweat starts to form all over your body. <br>\r\nYou've gotta get outta here!</span></div></span></div>",
            "created":1242536400,
            "id":692947,
            "title":"speed up and run like hell! This place is gonna..."
        },
        "1112":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "Caterpie!",
                "A different bug type pokemon!",
                "*make your own choice*"
            ],
            "content":"<div class=\"\"><div> <span>You take a look at both ends of the alleyway, and then make your decision.<br>\r\nYou didn't come in here for nothing!<br>\r\n<br>\r\nMadly, you dash down the alleyway, knocking down trash cans and kicking lots of waste around. You've gotta make it to the end! You've just gotta!<br>\r\nSweat starts forming in all sorts of places, and you keep on trucking trough. Where was the end of this stupid alleyway!?<br>\r\n<br>\r\nYou keep on going, and you feel like your about to die of exauhstion. You just can't seem to reach the exit!<br>\r\nSuddenly, you trip. You fall over on a bone or something, and you just land flat on your face.<br>\r\n<br>\r\nYou lay there in a daze, and try to get control of your short and gasping breaths. 'no.....................' you moan to yourself. \"NOOOOOO!!\"<br>\r\nYou just lay there with no sense of direction from all of that spinning, and your body aches, probably from banging the concrete so bad.<br>\r\n<br>\r\nYou give out a little whimper, and curl up. Why did you ever think fleeing down this alleyway would do any good? If only you'd known..................<br>\r\nThe darkness in the alleyway seems like a thick wall that's slowly suffocating you to death. You're terrified to death, you're minorly injured, you're trapped in an evil alleyway in a fetal position, and to make things worse, you missed out on breakfast this morning.<br>\r\n<br>\r\nYou curl up even tighter, sweat pouring down your body and your teeth chattering with fear. Did you just hear something? What was that?<br>\r\nThese questions keep on playing through your mind as you curl up tighter and tighter, just wishing you could dissapear.<br>\r\n<br>\r\nIf only you could curl up so tight that you shrunk down and down, until you were only as big as the bugs on the ground.............. that becomes your deepest wish at the moment. Nothing really matters anymore, just escaping this terrifying place.<br>\r\n<br>\r\nAs you curl up into as tiny of a ball you can be, you close your eyes, trying to block out the terrifying darkness.<br>\r\nYou can't think straight, and all you do is wish you could become smaller and smaller. You'd rather be dead than be stuck in this place.<br>\r\n<br>\r\nAfter several tense moments of pure horror, you actually start to feel smaller. This makes your spirits sky-rocket, but you still hang on tight- you want to become smaller. Soon, you feel a ton smaller, and and in other words, your confidence is restored. You are still curled up in a small position, but you actually lift up your head and see something- the exit.<br>\r\n<br>\r\nYou smile, and start inching your way to the exit in your curled up position. It takes a while, but you finally reach the exit.<br>\r\nYou are just about to stand up when you see the trees at a nearby park, and strangely start to feel very hungry all over again.<br>\r\n<br>\r\nYou then look at some rotting food at your side, and realize something disturbing- it looks delicious to you too! Your mind becomes somewhat scared and you can only think of how weird everything seems to be right now. You try to be stand up........ but you can't!<br>\r\n<br>\r\nStarting to panic, you look at your body and realize you've transformed into a-</span></div></div>",
            "created":1242536400,
            "id":692949,
            "title":"Just dash through the alleyway and get it over ..."
        },
        "11122":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "yeah, i did",
                "nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>did you transform into a volbeat or a paras?</span></div></span></div>",
            "created":1242536400,
            "id":692950,
            "title":"A different bug type pokemon!"
        },
        "111221":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "volbeat",
                "paras"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok, which one?</span></div></span></div>",
            "created":1242536400,
            "id":692951,
            "title":"yeah, i did"
        },
        "111222":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "yep",
                "no, neither one of them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>spinark or venonat?</span></div></span></div>",
            "created":1242536400,
            "id":692952,
            "title":"nope"
        },
        "1112221":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "spinark",
                "venonat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>k, which one?</span></div></span></div>",
            "created":1242536400,
            "id":692953,
            "title":"yep"
        },
        "1112222":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "sure",
                "nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>nincada or ledyba?</span></div></span></div>",
            "created":1242536400,
            "id":692954,
            "title":"no, neither one of them"
        },
        "11122221":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "nincada",
                "ledyba"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1242536400,
            "id":692955,
            "title":"sure"
        },
        "11122222":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "yes!",
                "nope......"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>cricketot or shuckle?</span></div></span></div>",
            "created":1242536400,
            "id":692956,
            "title":"nope"
        },
        "111222221":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "cricketot",
                "shuckle"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1242536400,
            "id":692958,
            "title":"yes!"
        },
        "111222222":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "fine.....",
                "no, more options!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>combee?<br>\r\nVespiqueen?!<br>\r\nJust choose one!!</span></div></span></div>",
            "created":1242536400,
            "id":692961,
            "title":"nope......"
        },
        "1112222221":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "combee",
                "vespiqueen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>good.<br>\r\nwhich one?</span></div></span></div>",
            "created":1242536400,
            "id":692962,
            "title":"fine....."
        },
        "11122222211":{
            "author_id":"nikolaj1998",
            "author_name":"biolaj1998",
            "choices":[
                "male",
                "famel (if you choose this you can later on become a vespiqueen)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>male or female</span></div></span></div>",
            "created":1388785440,
            "id":1720844,
            "title":"combee"
        },
        "1112222222":{
            "author_id":"benjamin510",
            "author_name":"Benjamin!",
            "choices":[
                "Beedrill or Nothing ",
                "Scyther."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Scyther or Beedrill?</span></div></span></div>",
            "created":1276059600,
            "id":897054,
            "title":"no, more options!"
        },
        "112":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "Absol, the dark type pokemon!",
                "No, a different one!",
                "*make your own choice*"
            ],
            "content":"<div class=\"\"><div> <span>You take a long, deep breath, and slow down to a decent walking pace. See? Now was that so bad?<br>\r\nGrinning at your own foolishness, you continue to calmly stroll down the alleyway.<br>\r\n<br>\r\nAll it was was a bunch of garbage, right? Sure the air was a little darkish, but now that you slowed down a bit, you actually LIKE it.<br>\r\nThe dark air seems cool, and you feel a sense of calmness wash over your entire body. Besides the garbage that was laying around, the alleyway was actually a little peaceful!<br>\r\n<br>\r\nYou smile in pleasure and gently close your eyes as you walk, allowing a complete sense of calmness to wash over you.<br>\r\nYou let the darkness guide your way............ it made you feel pleasurefully calm, and the alleyway was straight anyway. <br>\r\n<br>\r\nSoon, you lose yourself in a sensation of calmness, and darkness............ yes, nothing but darkness. Darkness means there is nothing, and nothing means no worries. Nothing but peace.............. and as long as nothing gets in your way, you can feel just fine.<br>\r\n<br>\r\nSoon, the darkness of the alley seems to sink into your soul. But you let it do so. More darkness means more power, and more calmness.<br>\r\nNothing must move. You will destroy anything that moves, anything that dare defies the soothing calmness of the darkness.<br>\r\n<br>\r\nYour mind seems to grow in power, and you feel yourself becoming much stronger. Yes............ more darkness! You find yourself beggining to crave the darkness, the need for everything to go black. Also, you gain powerful feelings of hate towards those who dare defy it. Pathetic creatures.......... how could they dare disturb your perfect darkness!?<br>\r\n<br>\r\nYou feel powerful changes rippiling through your body, and an evil grin turns up on your face. <br>\r\nDarkness is your friend............... you love darknes......................................................................... ........................<br>\r\n<br>\r\n<br>\r\nSuddenly, a gleam of light touches your face! Your eyes fly open in suprise, and you stumble backwards and fall on your butt.<br>\r\nUgh, light! Just the thought of light makes you want to spit in disguist. Not only had this 'light' disturbed your perfect darkness, but it had also caused you land on your tail!<br>\r\n<br>\r\nWait a minute.........tail!?<br>\r\nQucikly you look down at yourself, and gasp in horrow when you see you've transformed into.................</span></div></div>",
            "created":1242536400,
            "id":692969,
            "title":"slow down and relax. it's just abunch of ga..."
        },
        "1121":{
            "author_id":"assassination1",
            "author_name":"Dan",
            "choices":[
                "a little boy ( age 7)catches you as a pokemon",
                "a little girl (age 7)catches you for her pokemon",
                "or 2 twins( age 14)catch you for their Pokemon "
            ],
            "content":"<div class=\"\"><div> <span>          You have to implant this into your brain. You are an absol, you are an absol, you are an absol. You repeat it then think, you go through alley, Pokemon, go in reverse and you become hand. You test it by running back, but it doesn't work. You don't have a wallet or anything so you can't buy food or berries or anything really. <br>\r\n<br>\r\nYou walk around the city until you see something. You find nothing. You just walk out of the city when you see a tree with berries. You can't quite reach it. You use your human brain to move things under the branch for you to step on, you reach the food and eat, but then a trap springs. A net comes from beneath and you are caught, the owner/owners watched you use your brain, and...</span></div></div>",
            "created":1462648200,
            "id":2144457,
            "title":"Absol, the dark type pokemon!"
        },
        "1122":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "yea!",
                "nope",
                "*make your own choice*"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about poochyena or houndoom?<br>\r\n</span></div></span></div>",
            "created":1242536400,
            "id":692970,
            "title":"No, a different one!"
        },
        "11221":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "poochyena",
                "houndoom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?<br>\r\n</span></div></span></div>",
            "created":1242536400,
            "id":692972,
            "title":"yea!"
        },
        "11222":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "yea",
                "nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about a murcrow?</span></div></span></div>",
            "created":1242536400,
            "id":692974,
            "title":"nope"
        },
        "112222":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "yea!",
                "nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>sneasel or weavile?</span></div></span></div>",
            "created":1242536400,
            "id":692977,
            "title":"nope"
        },
        "1122221":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "sneasel!",
                "weavile sounds cool"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1242536400,
            "id":692978,
            "title":"yea!"
        },
        "11222211":{
            "choices":[
                "Go back in and try to find the cause of this.",
                "somthing else"
            ],
            "content":"<div class=\"\"><div> <span>You recoil. Your are covered in green/black fur, and protruding from your rear are three red feathers, a \"tail\" of sorts. You are also shorter. You feel shocked and numb. Slowly, you reach out to touch them, noting your new claws in the process. to make sure you arent dreaming or hallucinating. You pull one, and are in turn greeted by a sharp pain in your rear. You yelp and curse. Well, at least you can still talk. Scared and unsure of  what happened, (Or Even what you are) You look around. A few feet behind you in the darkness lie the remains of your tattered clothes. You scan the rest of the alleyway, and spot a window next to some boxes. You climb up to them, and look in.... <br>\r\nonly to see a pokemon stare back at you. You almost fall off the box. You have red eyes, and your two pointed ears on top of your head, one significantly taller then the other and tapering off into another feather. Your nose and mouth have formed into a muzzle full of sharp teeth. You have two teardrop shaped yellow markings, one on your face, another on your chest, and you look like some sort of weasel. It takes a second, but you recognize your appearance as that of a sneasel. Among your many thoughts, Is of what to do now?</span></div></div>",
            "created":1265518800,
            "id":831938,
            "title":"sneasel!"
        },
        "1122222":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "yes.... that sounds good",
                "bope (the awesome form of nope)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>how about houndoom?</span></div></span></div>",
            "created":1242536400,
            "id":692980,
            "title":"nope"
        },
        "11222222":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "yea!",
                "nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>sableye or umbreon?</span></div></span></div>",
            "created":1242536400,
            "id":692983,
            "title":"bope (the awesome form of nope)"
        },
        "112222221":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "OMG OMG OMG UMBREON!!!!",
                "sableye is cool......"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1242536400,
            "id":692984,
            "title":"yea!"
        },
        "1122222211":{
            "choices":[
                "Run away to scary!!!!!!",
                "WHO IS THERE *brave face*"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>*you see the area around you turning dark as you vision is suddenly cut shirt and you pass out for a minute as you wake up you feel different and you hear rustling in the bushes*<br>\r\nwhat do you do?</span></div></span></div>",
            "created":1366188060,
            "id":1573413,
            "title":"OMG OMG OMG UMBREON!!!!"
        },
        "1122222212":{
            "choices":[
                "Im the alley",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>Your vision starts to clear, but your mind feels odd and murky. You try to get up, but as you do so, you hit your head and black out. You wake up...<br>\r\n<br>\r\n(Sorry for short length, first chapter and I thought someone else might want to spring off from here.)</span></div></div>",
            "created":1265518800,
            "id":831925,
            "title":"sableye"
        },
        "112222222":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "cool!",
                "nah......."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>ok, now for stronger ones........<br>\r\ntyranitar or darkrai?</span></div></span></div>",
            "created":1242536400,
            "id":692986,
            "title":"nope"
        },
        "1122222221":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "tyranitar! duh!",
                "darkrai is so cool :D"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one?</span></div></span></div>",
            "created":1242536400,
            "id":692987,
            "title":"cool!"
        },
        "1122222222":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "omg, why didnt you offer those guys earlier?",
                "no, more options!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>drapion...... skuntank.......... come one, just pick one!</span></div></span></div>",
            "created":1242536400,
            "id":692989,
            "title":"nah......."
        },
        "11222222221":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "skuntank, duh!!",
                "drapion is so cool :D"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>cool<br>\r\nwhich one?</span></div></span></div>",
            "created":1242536400,
            "id":692990,
            "title":"omg, why didnt you offer those guys earlier?"
        },
        "11222222222":{
            "choices":[
                "illusion time!",
                "nooooooooo!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>man this is getting old how about Zoroark or Zoura?</span></div></span></div>",
            "created":1369026720,
            "id":1593352,
            "title":"no, more options!"
        },
        "112222222221":{
            "author_id":"nikolaj1998",
            "author_name":"biolaj1998",
            "choices":[
                "zorua",
                "zoruark"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one then</span></div></span></div>",
            "created":1388785320,
            "id":1720843,
            "title":"illusion time!"
        },
        "11223":{
            "author_id":"assassination1",
            "author_name":"Dan",
            "choices":[
                "they show themselves as ghost or dark type pokemon",
                "another few types"
            ],
            "content":"<div class=\"\"><div> <span>          It can't be that bad, I mean, you can at least use illusions. Instinct takes over and you steal, trick, and make fun of just about everyone being the menace of the town. But somewhere else, there is some Pokemon, who don't like competition.....</span></div></div>",
            "created":1462648500,
            "id":2144458,
            "title":"Zorua, illusions"
        },
        "1123":{
            "choices":[
                "Gengar",
                "Dusknoir",
                "*second set of spooks*"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A ghost pokemon, more specificly a....</span></div></span></div>",
            "created":1251867600,
            "id":754655,
            "title":"spooky spectral spirit"
        },
        "11233":{
            "author_id":"nikolaj1998",
            "author_name":"biolaj1998",
            "choices":[
                "murkrow",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>then this one maybe</span></div></span></div>",
            "created":1388785260,
            "id":1720842,
            "title":"*second set of spooks*"
        },
        "113":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "Go to the left- anything to avoid creepy darkness",
                "Go right- anybody living here HAS to be creepy ",
                "*make your own choice*"
            ],
            "content":"<div class=\"\"><div> <span>Suddenly, you notice something to your right that makes ou sigh in releif- a door!<br>\r\n\"thank goodness\" you say aloud, \"anywhere is better than THIS place\"<br>\r\n<br>\r\nYou walk up to the door, and notice something odd- there are hinges on the door, but no knob.<br>\r\nGroaning, you try pushing on the door, and to your suprise it swings right open! Since you figured it would be sealed shut, you charge right through and smack into a wall.<br>\r\n<br>\r\n\"Ow.......\" you say, rubbing your head. You are a little dizzy from crashing through, so you get up and take a better look around.<br>\r\nYou are right in the middle of a hallway, and apparently the door was in the middle of it.<br>\r\n<br>\r\nYou turn around, and look back at the door. For some odd reason, it was shut again.<br>\r\nNaturally, you check to see if the door will open again, and that's when you start to panic- it isn't opening.<br>\r\n<br>\r\nGetting all panicky again, you turn around quickly and take a better look at your surroundings.<br>\r\nYou're in a musty old hallway, with peeling wallpaper that's stained brown. There is a single lightbulb in th middle, slowly flickering on and off.<br>\r\n<br>\r\nThe building you're in is old........................very old. It looks like some sort of old-fashion haunted house from the 30's. There are cobwebs everywhere in here too, and the place looks like it's about to fall apart any second now. Or at least, that's what it looks like from the hallway.<br>\r\n<br>\r\nLooking down the hallway you see two directions you can go- left or right. To the left, there seems to be some sort of glowing, like from a TV or something. Also, you have a feeling that someone is over there. In the other direction, all you can see is darkness, but it doesn't seem like anybody is over there.<br>\r\n<br>\r\nWhich way will you go?</span></div></div>",
            "created":1242536400,
            "id":692992,
            "title":"wait, is that a door right there?"
        },
        "1131":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "ya, do it!",
                "no, someone might hear",
                "*make your own choice*"
            ],
            "content":"<div class=\"\"><div> <span>You look around catiousley for a while, and then your decision becomes final: you will go to the left.<br>\r\nAfter all, who wants to walk into complete darkness? That would just be stupid! And besides, maybe the person to the left will help you.<br>\r\n<br>\r\nAs you start to make your way down the hallway, the floor makes a giant creak. Your eyes fly wide open and you step back in fear- did the person in the other room hear you? You focus on the other room, and see a shadow moving against the wall in there.<br>\r\n<br>\r\n\"Oh crap!\" you think to yourself. The other person must've heard you! Quickly you turn around to run, only to realize something else- you have nowhere else to run.<br>\r\nAll you can do is stand there and wait for the person for discover you.<br>\r\n<br>\r\nAfter several tense moments, you look at the room and realize that the person left, but not into the hallway.<br>\r\nYou take a deep breath, and continue on to the room. Luckily, there are no more squeaky boards along the way.<br>\r\n<br>\r\nAs you enter the room, you intake as much info as you can about it.<br>\r\nIt's old and falling apart, but somewhat creepy, just like the hallway. There is a single TV in the middle just like you suspected, and it has black and white fuzz on the the screen.<br>\r\n<br>\r\n\"Hello?\" you call nervously. No answer.<br>\r\nYou figure the person in here must've left the room until you realize a disturbing fact that sends chills down your spine- the only exit ou of the room is the hallway.<br>\r\n<br>\r\nYou decide to inspect the room a little more- it's not like you can leave whenever you want to.<br>\r\nYou see a plush looking chair in the positioned to face the TV, and it looks brand new and out of place with the rest of the room.<br>\r\n<br>\r\nNext to the chair is polished wooden table, which also looks out of place. On top of the table is a purple bottle with a note attatched to it.<br>\r\nSo naturally, you pick up and read the note. The note says \"Inside this purple bottle is a remote to the tv. Please don't *********************-e tv. Thankyou.\"<br>\r\n<br>\r\nYou take another look at the note and get frustrated. Someone had scratched out part of it!<br>\r\nYou take the remote out of it's bottle, and look at the TV. Should you use the remote on the TV?<br>\r\n<br>\r\nOr maybe you should just keep looking around?</span></div></div>",
            "created":1242536400,
            "id":692993,
            "title":"Go to the left- anything to avoid creepy darkness"
        },
        "114":{
            "author_id":"treevis121",
            "author_name":"Treevis121",
            "choices":[
                "a Lucario!",
                "a Mudkip!",
                "another thing!"
            ],
            "content":"<div class=\"\"><div> <span>You begin to walk to what you thought was the exit, but you couldn't really tell. It was really disorienting in this place, making you a bit dizzy as you drift off from side to side. You clumsily bump into a nearby trash can and cause it to fall over, giving off a loud bang as it hit the concrete. It gave you a bit of focus to stand up straight and to proceed forward, saying to yourself \"This is only a stupid alley, I've got better things to do other than be here!\" With determination you walk forward with a stern grip on your camera, finally seeing the exit after rubbing your eyes which still had a slight bit of crust from waking up this morning.<br>\r\n<br>\r\n....But still, the alley WAS disorienting and all, so you felt as if you were getting smaller and smaller the closer you made it to the exit. Not too small, though...or was it much smaller? The sudden pressure on your head made it hard to tell if you were still your same height. Talking to yourself to keep your cool, you say \"Gah! I must've caught something yesterday, that could explain why I'm dizzy. Not to mention this headache and the pressure on getting an interview.\"<br>\r\n<br>\r\nWere you actually getting really small, or was there not too much of a change of height? Putting forth the rest of your energy into your legs, you finally were able to make it out!<br>\r\n<br>\r\n...Something's not right, though...<br>\r\n<br>\r\n...Something, something, something, anything...<br>\r\n<br>\r\n...You don't seem to notice immediately your change in height...<br>\r\n<br>\r\nTaking a photo of yourself, you saw something rather odd. You weren't yourself anymore, you were something else. It's still you, but not physically; Gazing into the digital image of yourself, you were actually a....</span></div></div>",
            "created":1265518800,
            "id":831958,
            "title":"Disorienting, Smelly, and....Different?"
        },
        "1143":{
            "author_id":"treevis121",
            "author_name":"Treevis121",
            "choices":[
                "Riolu!",
                "Buizel!",
                "something else!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, what about one of these?</span></div></span></div>",
            "created":1265518800,
            "id":832100,
            "title":"another thing!"
        },
        "11433":{
            "author_id":"nikolaj1998",
            "author_name":"biolaj1998",
            "choices":[
                "female gardevoir",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about this then</span></div></span></div>",
            "created":1388924220,
            "id":1721937,
            "title":"something else!"
        },
        "115":{
            "choices":[
                "Roar...",
                "Screech...",
                "Something different..."
            ],
            "content":"<div class=\"\"><div> <span>You keep walking, although something isn't right. The traffic and sound from the next block seems to be...repeating...over and over again. The same family goes past the same spot in the same direction every 10 seconds or so, the same with the cars, and the sound.<br>\r\n<br>\r\nThe sound is the most annoying though, repeating again and again and again and again, until eventually you get a nasty headache. \"Man, am I ever gonna get to this interview?!\" You say wearily. The noise gets so repetitive you shut your eyes in fustration and sit down. <br>\r\n<br>\r\nAfter about a second, you open them again, only to squint at a blank whiteness around you. You can't see a thing but white...plain white. Then you suddenly get pinned to the floor. You manage to get up but something appears to be dragging you back down. You pull against the invisible force touching the walls to find the nearest exit, but fail, and collapse of exaustion and fall into a deep sleep. <br>\r\n<br>\r\n***<br>\r\n<br>\r\nYou wake up in a warm room, your vision is fine again, but you are still pinned down again, this time on something...metal, like a operating  table. You have full colour vision like before, but something seems different. you find ease bending you neck up, unlike ever before. You look down at your body and</span></div></div>",
            "created":1289710800,
            "id":993368,
            "title":"Repitition..."
        },
        "1151":{
            "choices":[
                "Find your family and/or home...",
                "Live a new life...",
                "Get revenge on the scientist..."
            ],
            "content":"<div class=\"\"><div> <span>You hyperventilate, as you see your new shape -  A tail with blue spikes on the end, a blue belly, and, looking in the mirror, a long neck and a beak with teeth and blue plates around the eyes..  You appear to have turned into...a Lugia! But how is this possible? Pokemon are fake, and so are transformations, they are stuff of fiction, or are they? Your thoughts are interrupted by someone coming into the room. <br>\r\n<br>\r\nIt is a scientist wearing a lab coat and carrying some kind of whip, whith sparks fizzing out of it. \"Ah, the victim is awake.\" He says and grins maliciously. He looks at you dead in the eyes.\"So, how does it feel, to be my new pet.\" He  laughs. You growl and prepare to attack him but he hits you with his whip. \"No no no, bad! You must listen to my every command.\" You get really angry and something snaps inside. The scientist prepares his whip again, but you quickly jump out of the window and fall down towards the street below. You flap your wings rapidly and get some lift until you get stable. <br>\r\n<br>\r\nWhat to do now? </span></div></div>",
            "created":1289710800,
            "id":993381,
            "title":"L...L...Lugia?!"
        },
        "11513":{
            "author_id":"nikolaj1998",
            "author_name":"biolaj1998",
            "choices":[
                "shoot a hyper beam right at the building destroying it",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>but how will you take revenge</span></div></span></div>",
            "created":1388924160,
            "id":1721936,
            "title":"Get revenge on the scientist..."
        },
        "1153":{
            "author_id":"nikolaj1998",
            "author_name":"biolaj1998",
            "choices":[
                "scream like a girl",
                "yell in panic",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>do you then do this</span></div></span></div>",
            "created":1388924040,
            "id":1721935,
            "title":"Something different..."
        },
        "13":{
            "choices":[
                "Everything seems much bigger...",
                "Your face feels funny...",
                "Its very dark....",
                "Readers choice",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>You decieded that an alley may not be the way to go, after all... Gangs have been rumoured to gather there so you began to run across the city streets, you spotted an old warehouse that hadn't been used in years and decieded to cut through it! your interveiw would start in less than 15 minutes! you dashed towards the old building and litterally knocked the door down Before rushing inside!<br>\r\n<br>\r\nIt's dark and kinda creepy you thought, it was littered with old junk and graffitti, you began to feel strange, kinda sick even before blacking out.<br>\r\n<br>\r\nWhen you wake up hours have passed you spot your watch laying away from you and panic, It's 1:45! Oh god i'm so late! you thought! now you'll never get a playstation five! you thought before you noticed something strange.....</span></div></div>",
            "created":1309869360,
            "id":1140727,
            "title":"An old warehouse"
        },
        "132":{
            "choices":[
                "A Quilava",
                "A Smeargle",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You placed a hand on your chin.....Strange it feels sorta....Furry before you looked down towards you body and Began to absolutly freak out.....<br>\r\nWhat have you become?</span></div></span></div>",
            "created":1309869600,
            "id":1140728,
            "title":"Your face feels funny..."
        },
        "1322":{
            "choices":[
                "Someone emerges from the shadows!",
                "you have an Idea!",
                "Another pokemon aproaches!"
            ],
            "content":"<div class=\"\"><div> <span>You gasped when you realised what you had become!<br>\r\nYour face was now a creamy colour...... your ears were now brown and floppy..... You had what seemed to be a Beret on your head...... you had a paintbrush tail that was covered in blue paint and yor nose had been replaced by a muzzle!<br>\r\nYou had become a smeargle, How could this happen?! you thought to yourself! Now I can't go to my interveiw! and I can't go home either!<br>\r\n<br>\r\nYou were deeply upset.....You would never be able to see your mother or father again, and they would wonder what had happened to you....<br>\r\n<br>\r\nyou began to ponder deeply onb what your next action would be when......</span></div></div>",
            "created":1309870020,
            "id":1140731,
            "title":"A Painting Dog"
        },
        "1323":{
            "author_id":"nikolaj1998",
            "author_name":"biolaj1998",
            "choices":[
                "charizard",
                "gardevoir",
                "others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what about these then</span></div></span></div>",
            "created":1388785140,
            "id":1720840,
            "title":"Something else"
        },
        "15":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "Um.......................uh.......................................... crap.",
                "Hey! I'm the one controlling the story not you!",
                "CLICK HERE FOR MAJOR LOLCATS",
                "I suppose the only solution to all of our problems is to bomb a k-mart",
                "*make your own choice*"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>lol.<br>\r\nthen why the heck are you on this sight?<br>\r\nthis is a STORY site.<br>\r\n</span></div></span></div>",
            "created":1242536400,
            "id":692994,
            "title":"Why am reading this crap!? I just wanna see a p..."
        },
        "151":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                "k",
                "time to eat spaghettios!!",
                "im sleepy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Exactly.<br>\r\nNow head back to path #3 like a good little person, k?</span></div></span></div>",
            "created":1242536400,
            "id":692995,
            "title":"Um.......................uh......................."
        },
        "1512":{
            "author_id":"pokemon-lover",
            "author_name":"pokemonlover",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>i poisoned ur spaghettios u faggot. stay on topic.</span></div></span></div>",
            "created":1288846800,
            "id":987000,
            "title":"time to eat spaghettios!!"
        },
        "153":{
            "author_id":"yoshimaster",
            "author_name":"yoshimaster",
            "choices":[
                ">3) (smiles sheepishly) ",
                "your the one who's being random, not me",
                "what is the topic?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>getting a little off topic, aren't we? 8(</span></div></span></div>",
            "created":1242536400,
            "id":692997,
            "title":"CLICK HERE FOR MAJOR LOLCATS"
        },
        "1533":{
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Good question, too bad i don't have an answer. lets go back and find out, shall we?</span></div></span></div>",
            "created":1252818000,
            "id":759861,
            "title":"The past holds many answers, lets go see some."
        },
        "155":{
            "author_id":"logannoops195",
            "author_name":"pokemon man194",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>never mind</span></div></span></div>",
            "created":1309223760,
            "id":1135940,
            "title":"*make your own choice*"
        }
    },
    "info":{
        "author_id":"yoshimaster",
        "author_name":"yoshimaster",
        "brief_description":"You are a kid who is late to something. Chances are, you wont arrive as a kid.",
        "created":1242611940,
        "description":"<td align=\"left\" class=\"norm\">In this story you are a photographer who is late to an interview. Rushing allong, you see a shortcut- a dark alley. mA dark alley that, to the reader, just screams 'pokemon morph'. Possibly even inflation O.o<br>\r\nThis story is the result of a lot of time spent writing, and a bit of inspiration. Hope you enjoy! :D<br>\r\n(please write a review, it really helps. ive even put out a reward for it. if the story seems to short, that means i am not done wth it yet. I plan to make the story huge, which will take a long time.)</td>",
        "id":1561555,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1462648500,
        "modified":1462648500,
        "pretty_title":"Pokemon Trasnformation"
    }
}