{
    "chapters":{
        "1":{
            "author_id":"aow4321",
            "author_name":"aow4321",
            "choices":[
                "Find Dana",
                "Find Donna",
                "Find Essie",
                "Go find Dana's dirty laundry",
                "Go to Dana's Sandels"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your at your friend Dana's house and you get shrunk, what do you do.</span></div></span></div>",
            "created":1157346000,
            "id":344366,
            "title":"Shrunken choices"
        },
        "11":{
            "author_id":"samuelorona",
            "author_name":"Samuel Orona",
            "choices":[
                "...to one inch tall!",
                "...to less than an inch tall!",
                "1 1/2 inches tall!",
                "2 inches tall!",
                "2 1/2 inches tall!"
            ],
            "content":"<div class=\"\"><div> <span>While you're at your friend Dana's house, the military is conducting a top-secret experiment with a neutrino dissimilator cannon in orbit above North America. One of the computer programmers typed in one wrong numbers for the latitude and longitude, and instead of the dissimilator pointing at the target in New Mexico, it is pointed directly at the front living room window of Dana's house! The beam will fire in twenty seconds...<br>\r\n<br>\r\n<b>Five seconds later...</b><br>\r\n<br>\r\nDana asks you if you want a smoothie, because her mother just bought some fresh raspberries from the organic health food store, and you say, \"Sure!\"<br>\r\n<br>\r\n\"Okay,\" Dana replies, \"stay in here and watch TV while I make them. It should only take a few minutes.\"<br>\r\n<br>\r\n<b>Ten seconds later...</b><br>\r\n<br>\r\nDana is in the kitchen, while you sit and watch TV.<br>\r\n<br>\r\n<b>Fifteen seconds later...</b><br>\r\n<br>\r\nYou hear a car backfire out on the street in front of Dana's house, so you go to see what happened. You open the living room window to get a better look.<br>\r\n<br>\r\n<b>Twenty seconds later...</b><br>\r\n<br>\r\nThe neutrino dissimilator up in orbit fires, and the beam shoots through the open window and hits you square in the chest! The quark and gluon particles composing the protons, neutrons and electrons of every atom in your body are stripped of over 99 percent of their matter; this matter is transformed into neutrino particles. You are instantly reduced in size...</span></div></div>",
            "created":1158987600,
            "id":363098,
            "title":"Neutrino Dissimilation of Ryan!"
        },
        "111":{
            "choices":[
                "\"Dana, did you hear something?\"",
                "\"Dana, your rooms a mess!\""
            ],
            "content":"<div class=\"\"><div> <span>You feel really tiny.  Cause you are.  Dana comes in and sees you \"Oh my gosh! What happened to you!?!\"  <br>\r\n<br>\r\n\"I don't know, one second I'm looking out the window, the next second I'm an inch tall!\"<br>\r\n<br>\r\n\"Oh, gosh.  How did this happen...\"<br>\r\n<br>\r\nIt was then when Dana's mom started walking down the hall to where you were.<br>\r\n<br>\r\n\"Oh, no!!  I can't let your mom see me!\"<br>\r\n<br>\r\n\"Don't hide, my cat will get you, get in my pocket!\"<br>\r\n<br>\r\nShe picks you up and tries to put you in her pocket when she remembers her pants don't have pockets<br>\r\n<br>\r\n\"Oh, no! I don't have any pockets, here hide in my pants!\"<br>\r\n<br>\r\n\"Yey!\"<br>\r\n<br>\r\nYou jump in and mom comes.</span></div></div>",
            "created":1180069200,
            "id":410930,
            "title":"In her pants"
        },
        "1111":{
            "choices":[
                "\"what ever you want to do. \"",
                "\"I"
            ],
            "content":"<div class=\"\"><div> <span>\" UH no mom....\" Dana says shaking a bit.  Her mom goes away, and Dana decides to go to her room. She then takes you out of her pants and places you on her desk. \"Oh no... if mom catches me... ah, that wont happen, and if she does, we will all have fun... Ah... so... Ryan... What do you want to do?\" she asks. You reply:</span></div></div>",
            "created":1320469200,
            "id":1218645,
            "title":"\"Dana, did you hear something?\""
        },
        "11111":{
            "choices":[
                "gets naked as a treat with being nice",
                "asks you to tickle her feet and she would sit on you with her naked butt later."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"ok, what ever i want\" she says. \"Lets see...\"</span></div></span></div>",
            "created":1320469200,
            "id":1218653,
            "title":"\"what ever you want to do. \""
        },
        "11112":{
            "choices":[
                "Dana's mom",
                "Dana's maid."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Before you can say I'm Hungry, Dana Rushes off to the bathroom. you suddenly hear a loud fart. Soon the door starts to open. the person entering is...</span></div></span></div>",
            "created":1320469200,
            "id":1218646,
            "title":"Opps..."
        },
        "1112":{
            "choices":[
                "I found him, he's mine!",
                "Share this, it's too cool"
            ],
            "content":"<div class=\"\"><div> <span>\"Dana! Your room's a pit! Go clean it right away!\" Dana's mom yells. \"Yes, mom,\" Dana obliges, secretly happy her mom told her to go clean her room. She heads upstairs. Before going to her room, she decides whether to share this with her older sister, or keep it to herself. She decides...</span></div></div>",
            "created":1237784400,
            "id":665586,
            "title":"\"Dana, your rooms a mess!\""
        },
        "11121":{
            "choices":[
                "Strips",
                "Your Choice"
            ],
            "content":"<div class=\"\"><div> <span>Dana decides that she's not quite ready to share you yet. She enters her bedroom, closing the door behind her. she pulls you out of her pants and places you on the bed. you look at your surroundings. the walls are pink and everywhere you look, there are bras, panties, and dirty clothes lying about. <br>\r\n<br>\r\nDana looks down at you. \"Sorry about the mess,\" she says to you. <br>\r\n\"Don't worry about it.\"<br>\r\n\"So, what do you want to do.\"<br>\r\n\"Why don't you decide? Be as creative as you can get.\"<br>\r\n\"Really?\" she asks, her eyes gleaming at the possibilities. She gets up and...</span></div></div>",
            "created":1237784400,
            "id":665592,
            "title":"I found him, he's mine!"
        },
        "111211":{
            "author_id":"abqgolfer",
            "author_name":"rob",
            "choices":[
                "blows you",
                "her mom comes in after she heard voices"
            ],
            "content":"<div class=\"\"><div> <span>She smiles down at you and says \"Ryan you have always been so nice to me so i will do you a favor. I...will...be tonights entertainment.\" You cant believe you get to see her, all of her beautiful giant body, uncovered. You say \"ok, i think i can handle that\" She laughs and says \"You are so funny.\" Now she sets you on her hand, she reaches for you with the other hand and says,\"no looking just yet though, we are going to make this exciting.\" She set you down on the bed again, grabbed some clothes, hopefully lingerie you think, changes in the other room and when she comes out, you say \"WOW!\" as you see her come out in white lacy panties and a matching bra. She picks you up and says, \"Before i give you some of me, I want you to know that you are the first guy to see me naked.\" You are touched by this, and happy too. She has you in her hand, reaches around to her back where her bra strap is and aks\"ryan, will you be a doll and undo my bra for me? You say \"Hell Yes!\" You unbuckle it, see it fall to the ground and can't wait to see the other side. But then she lowers you to her panties and says \"now can you pull down my panties, please?\" You do it and when you pull them down you see her lovely ass, and her huge pussy. She grabs you, covers you up again, takes off her panties, then she puts you on her boob, finally what you have been waiting for. She loves the way you feel on her boob. You are making her tit hard, and it is making you hard. She says \"Aaww how cute, is that for me? You shouldnt have ryan.\" You blush. She picks you up and </span></div></div>",
            "created":1266296400,
            "id":837478,
            "title":"Strips"
        },
        "1112111":{
            "choices":[
                "has the urge to go to the bathroom",
                "puts a bottle around her vagina so her body fluid doesnt spill over onto the bed"
            ],
            "content":"<div class=\"\"><div> <span>she picks you up and puts your tiny penis to her mouth,and starts blowing you. soon, she gets tired of this, and brings you down to her crotch. She sticks you in it, and says \"I hope you like whats next...\" she starts rubbing you around in there, her own body fluids flooding on you. Suddenly dana...</span></div></div>",
            "created":1320555600,
            "id":1219218,
            "title":"blows you"
        },
        "11121111":{
            "author_id":"terra7538",
            "author_name":"PenName",
            "choices":[
                "She needs to pee",
                "She needs to poop"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You crawl into her vagina when she lets you after getting wet, but then her vagina closes up on you as she needs to pee, half of you sticking out. She runs to the bathroom.</span></div></span></div>",
            "created":1347685200,
            "id":1428537,
            "title":"Technical Difficulties"
        },
        "111211112":{
            "author_id":"joylovejoy",
            "author_name":"5803",
            "choices":[
                "It sure did ",
                "he come tumble out of Dana vagina"
            ],
            "content":"<div class=\"\"><div> <span>And quickly sit on the toilet as Her anus squeeze out the poop but as it did Ryan was struggle tried get Dana attention when Dana vagina muscle slowly squeeze him complete inside Dana Vagina, (After few min) Dana was done going poop as she went back into her room as she lay on her bed and she quickly remember Ryan as in her vagina, as she spread her legs part and use her two finger to open her vagina. <br>\r\n(Did Dana's vagina muscle squeeze Ryan toward her uterus?)</span></div></div>",
            "created":1442898000,
            "id":2038290,
            "title":"She needs to poop"
        },
        "11121112":{
            "author_id":"dragonskatana",
            "author_name":"Dragon",
            "choices":[
                "\"Now, to get rid of my mess.\" Dana grins, licking her lips and raising the cup ",
                "\"What else can we do with that tiny body of yours?\" she giggles, picking you up."
            ],
            "content":"<div class=\"\"><div> <span>Dana moans, feeling her pleasure grow as you squirm inside her wet pussy, loving every second. When she feels that she's close, she reaches over to her bedside table, grabbing a cup and placing it underneath her wet dripping lips, still rubbing and fingering herself as you slip and slide around, your hard on rubbing against the soft wet walls surrounding you. Dana's breathing becomea more erratic, her fingers skipping inside in front of you faster as the walls clench and squeeze around you, until finally she climaxes, squirting a gush of her cum and you out into the waiting cup between her thighs. After a few seconds of catching her breath, Dana grips the cup, liftin it up towards her smiling face. \"That-that was fantastic!\" </span></div></div>",
            "created":1432702800,
            "id":1983717,
            "title":"puts a bottle around her vagina so her body flu..."
        },
        "111211121":{
            "author_id":"dragonskatana",
            "author_name":"Dragon",
            "choices":[
                "there's no discomfort, no stinging, nothing! You seem to be imune to acids!",
                "Dana begins feeling ill, gagging. When was the last time that cup was washed?"
            ],
            "content":"<div class=\"\"><div> <span>\"Wait a minuet, I'm in here too!\" You say to her, waving your arms as you float in her sweet sticky cum, the cup being raised to Dana's smiling lips. \"I know Ryan, but you're apart of my mess, so I gotta clean you up too!\" She giggles, looking at your shocked face and parting her lips in front of you, tipping the cup of cum in and draining it, her lips sealing behind you with the flood. Dana begins sloshing it with you around her mouth, loving and savouring the taste before tilting her head back and making a loud gulping swallow, sucking you with her cum down her dark throat, sliding you along until you splash inside her empty belly. \"Mmm, so yummy!\" You could hear her voice echo around you, your hands and feet sinking down into the soft flesh of her belly. That's when you realised-</span></div></div>",
            "created":1432702800,
            "id":1983720,
            "title":"\"Now, to get rid of my mess.\" Dana grin..."
        },
        "1112112":{
            "author_id":"abqgolfer",
            "author_name":"rob",
            "choices":[
                "tease you more, maybe have a foursome?",
                "feed you"
            ],
            "content":"<div class=\"\"><div> <span>Donna opens the door and asks\"Dana, who are you talking to?\" Then she sees you and screams. Which brings Essie up to see what is going on. Dana has no choice but to show them you now. She lays you down back on her bed. Donna asks \"How did he get so small?\" Dana replies \"I dont know but i like him small. I have so much control over him, its awesome\" That jolts you a little but you trust Dana not to harm you. Dana continues \"I showed him my boobs and he showed me his little present by accident.\" The girls laugh, then donna points to you and says \"Look he is still hard, we should savor the moment.\" She reaches down toward you with her pointer finger and thumb. She goes for your crotch, she is giving you a HANDJOB! She is smiling and laughing. You are loving this, then you cum all over her fingers. She licks them off and says \"Good job ryan, i bet that felt good huh.\" You nod. You are naked on a bed with three giantesses, all hot, right above you. What do they do with you next?</span></div></div>",
            "created":1266296400,
            "id":837486,
            "title":"her mom comes in after she heard voices"
        },
        "11121121":{
            "author_id":"dragonskatana",
            "author_name":"Dragon",
            "choices":[
                "Youngest first, Donna and Essie pleasure Dana, using you as a toy on her.",
                "Mother knows best! She sticks you in her slit, telling Dana to eat her out !"
            ],
            "content":"<div class=\"\"><div> <span>With Dana sitting next to you half undressed, the maid Essie is the next one to decide to begin removing her clothes, looking over at your tiny body with a hint of lust shining in her eyes. \"Ryan does look very...useable now.\" Essie says, swaying her hips aa she walks over towards Dana and you, pulling off her shirt and letting her skirt slide down her legs after unbuckling it, looking over her shoulder at Donna. \"What do you think?\" she asks, smirking as she waits for a response. Donna was pretty taken back from catching her daughter and Ryan like this, but couldn't deny that she was ptretty turned on at the thought of a tiny man at her finger tips, as well as the forbidden lust of playing with her daughter's body. \"You know, you're right Essie, he does look pretty fun.\" She grinned, giving in to her lust and tugging off her shirt, displaying her bra covered breasts to the room before undoing her pants and letting them fall to her feet, sauntering over to you as well. Dana was nervous, being unexperienced but more than willing to try, since she wanted to enjoy using your tiny body too, having already getting a taste of your cum and wanting more. \"Sooo, what should we do?\" Dana asks, looking between the two half naked women before returning her attention to you.</span></div></div>",
            "created":1432702800,
            "id":1983735,
            "title":"tease you more, maybe have a foursome?"
        },
        "111211212":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "Donna keep Ryan inside her vagina!! and refuse ",
                "Dana told her mom that she right to lick Ryan out now!"
            ],
            "content":"<div class=\"\"><div> <span>Donna slowly smirk and know what is best for Dana, and with that she pick up you and  shove you into her vagina! You start freak out because you were in vagina which belong to Dana Mother! As you struggle get out when her vaginal muscle quickly suck you inside! Dana gasp and said Mom let Ryan out right now! Donna giggle and pat her head and said Oh Sweetie I only do what best for you and what better way enjoy him as your toy then tried use your tongue to drug him out from my wonderful vagina! Dana look at her mother and said Mom Please just get Ryan out of your vagina! Donna look at her daughter Dana and said Sweetie if you not want to do this then you not have to but as for Ryan? He get stay inside my vagina until you are ready, As she got up and slowly put her clothes back on! and leave the room (What happen next?)<br>\r\n<br>\r\n</span></div></div>",
            "created":1466226000,
            "id":2166179,
            "title":"Mother knows best! She sticks you in her slit, ..."
        },
        "1112112121":{
            "author_id":"lovezoo",
            "author_name":"ray",
            "choices":[
                "She won't do it which mean you have live inside of me",
                "She do it very soon "
            ],
            "content":"<div class=\"\"><div> <span>Donna keep Ryan inside her vagina!! and refuse let him out until her daughter lick him out of her vagina!<br>\r\n<br>\r\nRyan yell \"Miss Donna let me out\" as he struggle toward exist of her vagina and he almost make it out until she push him back inside her vagina and said \"Now now little Ryan you must remain inside me until my daughter Dana come and lick you out but I think?</span></div></div>",
            "created":1475557200,
            "id":2219072,
            "title":"Donna keep Ryan inside her vagina!! and refuse "
        },
        "111212":{
            "author_id":"stewey77",
            "author_name":"halo3",
            "choices":[
                "Takes you out and swallows you",
                "Takes you out and wantes you to pleasure her"
            ],
            "content":"<div class=\"\"><div> <span>She pickes you up and says im going to sick you in my ass ok you sed with exitment she pull back her wastband to her panties and lowers you in right betteen her butt cheeks this is going to be fun you hear her say she starts to grunt and push she lets out a fart right on you did you like that sha asks ya do it again realy she says ya i liked it ok and she lets nother one out but this time it was a little wet it hit you in the face as soon as you wipe it off she gets up and runs to the bathroom she pulls down her pants but forgot about you and her panties but before she cpould get back up she shit in her panties with you stil in them its so warm you say to your self the smell wasent realy bothering you so you just injoued it sorry she sayed are you ok ya im fine it nice in here you llike that well if you want to stay in it for awhile thats fine with me she was one of those girls that liked gross stuff so she dident mind you hear her mo, say im going out for a couple of hours be back later this is perffet she says and get up were alone so i can walk around with my panties full of shit she says she gets up and walks to her room she startes to squish her shit around this fells great she says you were having fun in her panties to she was starting to get aroued by you and her shit in her panties she.</span></div></div>",
            "created":1240376400,
            "id":680237,
            "title":"Your Choice"
        },
        "11122":{
            "author_id":"godofwrite21",
            "author_name":"Imagery ",
            "choices":[
                "Wiggle out of Dana’s grip and try to escape",
                "Don’t bother and wait to see"
            ],
            "content":"<div class=\"\"><div> <span>Dana instead of cleaning her room decides to go to her sister Tina’s room, Tina was at least one month younger than Dana, she had brown hair similar to her sisters a nice round ass and C cup breasts. Luckily for Dana, Tina hadn’t left for her sorority meeting. Dana then Knocks on Tina’s door to see if she’d answer. Whilst Dana was knocking on Tina’s door you decide to</span></div></div>",
            "created":1566431940,
            "id":2705921,
            "title":"Share this, it's too cool"
        },
        "112":{
            "choices":[
                "Avoid Dana as long as possible",
                "Try to talk to Dana"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You've been shrunk to less than an inch tall! You look exactly like a bug to normal people, and that's bad. You need help, but the only person in the house is... Dana.</span></div></span></div>",
            "created":1176008400,
            "id":396817,
            "title":"Shrunk"
        },
        "1122":{
            "choices":[
                "Ryan?",
                "Yum a Bug!!!!"
            ],
            "content":"<div class=\"\"><div> <span>You run over to Dana's bare feet.<br>\r\n<br>\r\n\"Ryan,\" she booms, \"Ryan, where did you get to?\"<br>\r\n<br>\r\nYou reach her bare feet and manage to clamber on to them.  You scream up at her, but you are too small and to far away for her to hear you.  She can, however, feel you as you scramble about on her toes.<br>\r\n<br>\r\nShe looks down to she you, and you realize just how much trouble you could be in if she does not recognize you.</span></div></div>",
            "created":1179550800,
            "id":409306,
            "title":"Taking Chances with Dana"
        },
        "11221":{
            "author_id":"musibrique",
            "author_name":"musibrique",
            "choices":[
                "OMG! Ryan!",
                "nothing more than a bug"
            ],
            "content":"<div class=\"\"><div> <span>As Dana begin to look down trying to figure out what is between her toes thinking it was probably a tiny bug, she saw a tiny, dark-looking speck between her toes. In Dana's giantess perspective, the speck was as tiny and dark as a baby flea. <br>\r\nDana did not hesitate to pick you up with her right, massive, flesh hand even though she does not realize it's you.<br>\r\n<br>\r\nAs Dana was slowly lifting you up to get a good look of you, you managed to see her massive breast slowly coming down to you. In fact, you were turned on by her breast and wanted to jump down there. However, you realize it's too risky since she might accidentally or purposely flatten you like a 2-D character between her two boobs. <br>\r\n<br>\r\nAs Dana finally managed to get a good look of you, she realize you're...</span></div></div>",
            "created":1357534800,
            "id":1503825,
            "title":"Cross-fingers"
        },
        "112211":{
            "choices":[
                "In her bra?",
                "In her panties?"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As Dana realised this bug is you, she hears a voice Dana hurry up remember we are going to the salon to get our hear done.<br>\r\n<br>\r\nWell Ryan I can't leave you here, where does she put you to keep you safe?</span></div></span></div>",
            "created":1451624400,
            "id":2082508,
            "title":"OMG! Ryan!"
        },
        "1122111":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Between the breasts, in the middle of the two mountains.",
                "Inside the bra cup, close the nipple"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Dana was amazed but at the same time curious, without hesitation and with a little haste she coaxed you into her bra.<br>\r\nRyan realizes when two giant masses are approaching, he could see sweat dripping.<br>\r\nWhere Dana puts little Ryan.</span></div></span></div>",
            "created":1554231120,
            "id":2638693,
            "title":"In her bra?"
        },
        "11221111":{
            "author_id":"dumbkaktoos",
            "author_name":"Kaktoos",
            "choices":[
                "Call out for her attention",
                "You're too busy trying not to get completely engulfed, can't speak that loudly"
            ],
            "content":"<div class=\"\"><div> <span>The squishy and cozy consistence of her plump breasts was soft enough to make the impact after Ryan's fall in between insignificant. He fell head down right between the two mountains, and took a serious effort to get back with his head upwards. <br>\r\n<br>\r\nThe little boy was having the ride of his life, cuddled by the warm embrace of his friend's breasts, when he started to feel how strong the pressure of those wrecking balls could get at every bounce caused by her walking. That movement was both crushing his ribcage and making him sink down between her breasts, more and more. The worst part? A malicious smirk on Dana's face made him think she might be aware of it.<br>\r\n<br>\r\nYou...</span></div></div>",
            "created":1597760340,
            "id":2887429,
            "title":"Between the breasts, in the middle of the two m..."
        },
        "11221112":{
            "author_id":"dunamis",
            "author_name":"Jameskii",
            "choices":[
                "Ride her nail",
                " Ride the lips"
            ],
            "content":"<div class=\"\"><div> <span>Once you where put into your fleshy prison, she told you this: \"Have fun in there, but stay quiet.\"she side as she sealed your prison. once you were sealed in, you couldn't here much of what they where sayin. all you know that you were bouncing up and down with the biggest tits you'll ever see! Your even took a nap in there at one point.  Once they got to the salon they split. She goes to the bathroom, to take you out. \"Oh man you felt really good on the tip of my nip! Of on the way over I thought of something fun for both! Since Im planning on getting a nail painting, hair wash, braiding and custom makeup, I have two options for ya. you can hang onto my nail and get panted on with the paint, or become stuck onto my lips. If you do this for me ill do what ever you want me to do for you for the next week. So, what will you choose?</span></div></div>",
            "created":1566313380,
            "id":2705237,
            "title":"Inside the bra cup, close the nipple"
        },
        "112211121":{
            "author_id":"dunamis",
            "author_name":"Jameskii",
            "choices":[
                "Hair wash and doing",
                "Custom make-up"
            ],
            "content":"<div class=\"\"><div> <span>You shrugged and told her that you would like to be useful and see what's it's like to be a nail. she giggled and played you on the other side of her palm. you quickly decide it would be the most scenic to be her middle nail. You look at her nail and saw that they were as sharp as daggers. With you in place she makes her way to her seat. all you could see is various makeup and styles items. The very next thing you know, the lady of the hour comes forth and grabs the nail paint\" alright madam, what kind of color are you wanting: purple or hot rod red?\" \"I think I'm gonna go for some of the purple. might match my shirt!\" she says. Just like that, she begins to paint the nails on her other hand you can just tell what exactly the color is, lavender. after about five mins she goes onto the side of you. Nail movement after nail movement, it goes on. Then, she finally gets to you, unawarely. Once it hit you you knew what dana was gonna do with you. She was gonna make you her nail for the next 10 hours. you sickly look up and see that she has a big smile on her face. The next thing you know, the stylist started to please the newly freshened nail paint brush onto your fragile little body. At first it was painful, feeling the ends of the bristles meeting your back, but once she started moving it, it was Gucci as all things considered. Before you knew it, your bare back, and her nail were lavender as lavender can get. With that the coloring of her nails were done. And you were stuck there, for quite some time! All you could see is what the tipoffs her nail could see, and nothing else. And with that in mind what did the stylist do next?</span></div></div>",
            "created":1568218620,
            "id":2716677,
            "title":"Ride her nail"
        },
        "11222":{
            "choices":[
                "...she does!",
                "...she stops"
            ],
            "content":"<div class=\"\"><div> <span>\"Hmmm a tasty little bug........and nobody around to see..........perfect.\"<br>\r\n<br>\r\nThis does not look good, Dana could get wierd around bugs, she always seemed to take a perverse pleasure in smashing them, but what did she mean by tasty and...oh.<br>\r\n<br>\r\nYou try to run away but she reaches down and plops you into her mouth.<br>\r\n<br>\r\nShe doesn't swallow you right away, she plays around with you first.  Jolts of what you assume to be joy are shaking through her body as she does this.  She moves you around her mouth with her tongue and gently grips you with her teeth rolling you around in her mouth.  Finally she begins to move you to the back of her throat.  You open your mouth to scream and gag on a rush of saliva coming in.  The one thing you wanted to do before you died was swap spit with Dana just once, funny how life works out, isn't it?<br>\r\n<br>\r\nDana is about to swallow when....</span></div></div>",
            "created":1179550800,
            "id":409308,
            "title":"Inside her mouth"
        },
        "112221":{
            "author_name":"GueastPass",
            "choices":[
                "You find a way to her small intestines",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Then she suddenly swallows, and ur left to yel curse words b4 hitting her soft lethal stomache!</span></div></span></div>",
            "created":1186030800,
            "id":431443,
            "title":"Where no man has gone before!"
        },
        "1122211":{
            "choices":[
                "You are dead sorry he's gotta die",
                "Go to heaven its not dying"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You go into her intestinesand get crapped out.</span></div></span></div>",
            "created":1378011600,
            "id":1655709,
            "title":"You find a way to her small intestines"
        },
        "11222111":{
            "author_id":"numerio",
            "author_name":"Tex",
            "content":"<div class=\"\"><div> <span>You are massaged in a most uncomfortable way along her large intestine.<br>\r\n<br>\r\nDana starts feeling like it's time to go to the washroom. She goes to the bathroom, closes the door, pulls down her panties and sits down. She grabs a fashion magazine from the basket of reading material, and starts reading it, knowing it may be a few minutes.<br>\r\n<br>\r\nYou, meanwhile, were slowly reaching the end of the large intestine. You stopped moving along, and all at once, all moisture was sucked out of your body, leaving a brownish husk.<br>\r\n<br>\r\nDana was reading about tote bags when she heard the plop.<br>\r\n<br>\r\nYour last thoughts were gratitude that you had given your life to your crush.<br>\r\n</span></div></div>",
            "created":1539727980,
            "id":2564635,
            "title":"You are dead sorry he's gotta die"
        },
        "112222":{
            "choices":[
                "Dana decides to help you",
                "Dana likes the new you"
            ],
            "content":"<div class=\"\"><div> <span>Dana stops from swallowing all of a sudden, before you can begin to rest up for a bit, Dana begins to speak.<br>\r\n<br>\r\n\"Strange...\"<br>\r\n<br>\r\n(Every. Single. Movement. Of. Her. Tongue. Smacks. You. Against. Her. Mouth.  You are barely even able to make out what she is saying, it does not actually hurt so much because her tongue and mouth are soft, put it hits you with a pressure that is simply....thought halting.  But back to the conversation at hand.)<br>\r\n<br>\r\n\"This doesn't taste like any bug that I've ever eaten\"  (Whack! Whack! Whack!)<br>\r\n<br>\r\nShe sticks her tongue out of her mouth and takes a look.<br>\r\n<br>\r\n\"Oh!!\" and you fail to hear the rest as you are flung through the air.<br>\r\n<br>\r\n\"Ryan!\" screams Dana, as you fall to the ground, she dives to catch you but misses.<br>\r\n<br>\r\nAs any first year physics student knows however, such a slight fall for a person, no matter the size, will only leave a slight bruising.  However, a much larger object, say a person quite a bit bigger than you would squash you flat, luckly in this instance Dana barely manages to miss you as she completes her dive onto the ground.<br>\r\n<br>\r\nYou notice two large heaving masses, which seem to you to be inches, from your perspective.  Dana's breasts are hoisted into the air as she gets up, checking to see if she smashed you.<br>\r\n<br>\r\n\"Ryan\" she shouts from joy<br>\r\n<br>\r\nBefore you can move Dana has grabbed you and is smothering you into a collosal hug, you are pressed into her soft, warm breasts and are barely able to make out her next sentence.<br>\r\n<br>\r\n\"Ican'tbelieveIalmostateyouhowdidyougetsosmallyoulookedlikealittlebu ghowcomeyoudidn'tdiefromthatfallareyouokay?<br>\r\n<br>\r\n\"Mfffff\" you state into her chest.</span></div></div>",
            "created":1179550800,
            "id":409323,
            "title":"And she goes for the catch!"
        },
        "1122222":{
            "choices":[
                "Put you in her panties",
                "she has something else planned"
            ],
            "content":"<div class=\"\"><div> <span>\"Aw, you're so CUTE\" she cooed<br>\r\n<br>\r\n\"Dana, please, help me!\" you implore her<br>\r\n<br>\r\n\"But Ryan sweetie, don't you realise what this means? You get to be my little pet! I'll look after you and change your clothes and give you baths........\" she breaks into girlish giggles<br>\r\n<br>\r\nYou think fast<br>\r\n<br>\r\n\"So, what....are you planning to keep me like this forever?!\" you shout, shocked and scared<br>\r\n<br>\r\n\"Well, I don't know how to reverse whatever's happened to you. Face it hunny, you're better off with me than out in the land of big people all by yourself\" sahe giggles and you burn with hatred at the childish way she is talking to you\"<br>\r\n<br>\r\n\"So, now that you're here, let's have a little fun\" She winks at, and you can see an evil gleam in her eye. She then proceeds to...</span></div></div>",
            "created":1195102800,
            "id":464628,
            "title":"Dana likes the new you"
        },
        "11222221":{
            "choices":[
                "You start to struggle against her hand, trying to get out.",
                "She takes matters into her own hands"
            ],
            "content":"<div class=\"\"><div> <span>You struggle a bit, nervous about that gleam.<br>\r\n<br>\r\nSuddenly, you feel your stomach lurch into your throat as you descend rapidly. Dana lets go of you, and you see her skin flowing past you as you slide down something.<br>\r\n<br>\r\nYou hear a snap as she lets go of the band of her panties, and you are sent flying against her skin. You turn your head, trying to breath as the world starts to move. Her legs brush by you rhythmically, and you slide a bit further along with each step. You start to struggle again, trying to climb back up, deciding you would rather not meet your crush's private parts this way, even if your own lower half does't believe that to be the case.<br>\r\n<br>\r\nHer legs move further around you for a while, making it hard to do anything as your bare feet slip along her womanhood. You feel her shudder just before her legs stop their exaggerated movements and start a rhythmic pace once again.<br>\r\n<br>\r\nYou stop moving, becoming very awkward as you slip further along her private parts.<br>\r\n<br>\r\n\"Dana!\"<br>\r\n<br>\r\nYou surprise yourself with how loudly you can shout despite your shortness of breath. Dana, however, ignores you or didn't hear you in the first place.<br>\r\n<br>\r\nSomewhere in the outside, you hear a door open and close. Dana stops moving. You feel her lay down, and everything is still.<br>\r\n<br>\r\nAfter a moment, you start to try to climb out once again, a task that proves a lot easier now that she's stopped moving. Her body shudders again, and you hear her whisper somewhere ahead of you.<br>\r\n<br>\r\n\"Oh, come on, Ryan. I know that's not the way you want to go.\"<br>\r\n<br>\r\nYou hear Dana undo her pants, and your vision starts to focus on sudden light lighting the area around you in a dark blue haze of her panties. A hand appears above you, and you flinch away. A small laugh rumbles along Dana's body, and she pushes you further down her panties, until you are surrounded by her womanhood. The smell is nearly overwhelming, and you quickly discover how wet she is as your clothes become soaked.<br>\r\n<br>\r\nBut, now what?</span></div></div>",
            "created":1337749200,
            "id":1344007,
            "title":"Not sure if want."
        },
        "112222211":{
            "choices":[
                "Keep tying to escape ",
                "Stay there"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You try to wiggle out but every time you do you go deeper in her panties.</span></div></span></div>",
            "created":1364446800,
            "id":1559501,
            "title":"You start to struggle against her hand, trying ..."
        },
        "11222222":{
            "choices":[
                "Tortures you with her feet",
                "Tortures you in some other way"
            ],
            "content":"<div class=\"\"><div> <span>As she continues to stare at you, never once removing the ridiculous grin from her face, you begin to realise your predicament. You were trapped, shrunken and helpless, at your best friend's house, and she is planning to keep you as her pet! Your head aches from the information, you know it's real, but your insides are squirming<br>\r\n<br>\r\nPart of you wishes that all this is just some crazy dream; you were into the whole giantess/shrink thing and you have had a HUGE crush on Dana for as long as you can remember, never telling her because she's your best friend and it might ruin your friendship. \"She's my best friend!\" you think \"how could she do this to me?\"<br>\r\n<br>\r\nBut then...<br>\r\n<br>\r\nThe other part of you stats to get turned on<br>\r\n<br>\r\n\"Hey\" you think. \"I could get used to this. Maybe she'll even....\"<br>\r\n<br>\r\nBut you think of your family, waiting at home, probably worried sick and you get yourself together. It was time to act. But before you can even sa a word........<br>\r\n<br>\r\n\"Guess what? I'm going to give you a sponge bath Ryan!\" she says, gleeful and squealing<br>\r\n<br>\r\n\"wouldn't that be cool? You're so dirts, being out on the floor then into my mouth. Now I get to clean you all up\"<br>\r\n<br>\r\n\"Now hold on just a minute! If you think for one moment that I'm going to let you do that you stupid so.......\"<br>\r\n<br>\r\n\"EXCUSE me?!\" Dana raised her eyebrows at you, the smile gone from her face<br>\r\n<br>\r\n\"But were you questioning me? I'm not the inch-tall guy here. I have you under my control and when I SAY I'm gonna give you a bath\" She raises you directly in front of her frowning face now \"It means that I AM going to and there's nothing you can do to stop me! GOT THAT?\"<br>\r\n<br>\r\n\"y-yes\" you say, scared. Why was she suddenly so cold<br>\r\n<br>\r\n\"You have NO IDEA what you've put me through, Ryan. All those times you were out looking at other girls, you never noticed me. I was just one of the guys to you!\"<br>\r\n<br>\r\n\"Dana, no, it wasn't like tha...\"<br>\r\n<br>\r\n\"Yes it was! Never once did you stop and think that maybe.......maybe I like you back\"<br>\r\n<br>\r\nYou gasp<br>\r\n<br>\r\n\"That's right, I knew. But I also overheard you telling Eric that you're over me and......something about me being too CHILDISH?! UGLY?! DO YOU KNOW HOW MUCH THAT HURT\"<br>\r\n<br>\r\nThe last words were shouted in your face, almost splitting your eardrums<br>\r\n<br>\r\n\"Well, now it's time to teach you a lesson, tiny....\"</span></div></div>",
            "created":1195102800,
            "id":464778,
            "title":"Bath Time for little Ryan"
        },
        "112222221":{
            "choices":[
                "Punishes you ",
                "feels sorry for you"
            ],
            "content":"<div class=\"\"><div> <span>You remain almost petrified as she drop you in front of her bare feet. Luckily you landon a soft carpet so you arn't suriously injured from the fall. \"They stink don't they?\" Dana says sadisticly. \"They've gathered a lot of dirt and sweat from my morning jog. And you are going to lick them clean.\" You stare in disbelief at what she just told you. \"This can't be happening.\" You think to yourself. \"She's my best friend. And she had a crush on me. How can this be happening?\" Your trail of thought is soon interrupted by Dana's impatient tone. \"If you don't start soon I'll make the punishment worse.\" she warned. You couldn't move, you could only stand and whimper pitifully. <br>\r\n<br>\r\nDana notices this and...</span></div></div>",
            "created":1202965200,
            "id":498113,
            "title":"From best friend, to pet, to foot slave. "
        },
        "1122222211":{
            "author_id":"sarashrunk",
            "author_name":"sarashrunk",
            "choices":[
                "Dana puts on a sweaty stocking, catching you inside.",
                "Dana removes you with the fingers, another punishment"
            ],
            "content":"<div class=\"\"><div> <span>Dana notices that you're not struggling, she starts to get irritated and slowly steps down, kneading you on the rug, she puts little pressure on you not to crush.<br>\r\nDana starts to lift her foot and realizes that Ryan was not on the rug with a giggle ... Dana lifts her foot and watches you stick to the sweat. She says: I have the perfect punishment</span></div></div>",
            "created":1554238680,
            "id":2638783,
            "title":"Punishes you "
        },
        "112222222":{
            "author_id":"readerman",
            "author_name":"readerman",
            "choices":[
                "she says time for play with her new dildo",
                "she says time for play with her new dildo and invites her sister in and they pld"
            ],
            "content":"<div class=\"\"><div> <span>she says time for the new bath tub puts you in her toilit and says now to add the water and soap and she pees all over you and then you thout she was done peeing you opend your mout to say something and she pees in your mout and you swallow you say jold up and she is still going and you keep talking y she pauses for a moment and said she alway wanted to pee you out after making you swallow abunch of her piss so she drinks abunch of water when she does that she say you stay in da toilit and wait for her to come back so your waiting whaen her sister comes in annd starts to pee you get ready to say some thing when you notice your thirst and since she was peeing you might as well injoy it so you start yo drink her pee and thimk hey this tastes good after 20 or 30 minutes she starts taling about you saing how she wishes she could just have you swallow all her pee and get peed out of her vagina she stans up pulls up her pants when she gets ready to flush then she notices her sister nokeing saying dont flush i got to go so she say ok and goes out and then dana comes in and siad she just ate and drank so she wanted to have some fun and she starts to pick you uo and stick you in her ass crack you go in pretty deep and she then starts to take a shit  you come out   she adds fresh water to clean you off then picks you up and said time for fun for both of us she putts you in her vagina an starts to push you in and pull you out when shes doing this she starts to masterbate and then you get stikey in her vagina fluids so then she starts to pee you go out she says all clean that way and takes you out of the toilit and gives you a sponge bath</span></div></div>",
            "created":1197435600,
            "id":475857,
            "title":"Tortures you in some other way"
        },
        "12":{
            "choices":[
                "try to pinch her",
                "bite her",
                "just wait"
            ],
            "content":"<div class=\"\"><div> <span>you are very worried and scared.You think to your self you need to find donna,you start looking for her,you then come in to her bedroom.You see her giant bed and cuboards,you decide its best to climb on her bed to wait for her.You climb donna bed and you get to the top.You here footsteps coming in to the donna bedroom.Its donna who comes in,she is wearing a tight mini white skirt with a white top.As she comes in you shout''hey i am up down here''.She can,t here you.Suddenly you see her ass coming down on top of you,you scream very lode but she still can,t here you.Its to late,she has sat on top of you...what do you do now</span></div></div>",
            "created":1157691600,
            "id":345313,
            "title":"big time"
        },
        "121":{
            "choices":[
                "try to escape",
                "just stay in the bathroom"
            ],
            "content":"<div class=\"\"><div> <span>You pinch her ass but its no afect on her huge ass,theres nothing you can do about it apart from just wait.Suddenly Donna starts to get comforble and wrigling.She then lets out a massive fart on top of you.You some get sucked in her pants to her ass crack,you are now facing her giant crack.Shes lets out a few massive farts on top of you but you are still alive.You are also suffacing under donnas ass.She then gets up and you here the toilet sit go down,you then fall in to freezing water.You look up and see donna ass siting on the toilet.You pray she is going to pee but shes not.Shes starts to pee on top of you and you see a massive log come down next to you.Donna is taking a shit with you in the toilet.Lots of shit and piss is hiting you and also donna is farting as well.When shes done you try to climb the toilet but she wips her ass and the toilet paper hits you and you go back down in the shit.donna then flushes the toilet but you don,t go down you go flying out of the toilet on to the batroom floor...what do you do now </span></div></div>",
            "created":1157691600,
            "id":345317,
            "title":"shit time"
        },
        "1211":{
            "choices":[
                "I wish a girl to become my size, grow a long thick dick, and **ck me.",
                "I grow smaller, so the pleasure would be greater, and wish to jizz more."
            ],
            "content":"<div class=\"\"><div> <span>You try to escape from the toilet. You see floss hanging down into the bowl, and climb up to the sink. You see a tube of lotion, and stand on top of it, yelling, trying to get her attention. Unknowing of your presence, she picks up the lotion, as he hangs on for dear life, and squirts it on her already big, plump, breasts. You fall on them, slipping around, as she massages them. He catches a glimpse at the label of the unknown lotion. It reads, enlargement cream. You look down. Donna's tits start to grow, very slowly. Her clothes start to become tight, and her ass, and breasts slowly grow. You fall onto the counter, watching in amazement. Soon, Donna's buttons start to catapult themselves all across the room, because of the strain put on them, her boobs become an astounding EE size, as her giant tits start outgrowing her already enormous bra. Donna says to herself \"I'm feeling so horny right now...\" As her nipples start to harden, expanding slowly. Now she was in her underwear, with only threads of clothing left...Her ass, now bursting the final threads of her undergarmets, each cheek is now the size of a basketball, her breasts still growing, her bra still straining, ripping the cloth very slowly. I look down, and realize how much cream has landed on my penis. In amazement, I see it dissapearing, as I start to obtain long, blonde hair, thick eyelashes, a big ass, and disapointing A cups. I start to grow my normal size, as my legs become long, and slender. I dive into the enlargement cream, as my whole body starts growing. My ass, and A cup breasts, growing faster with the rest of my body. Donna looks up, as my now girlish underwear, and bra start tearing. I'm now as big as the whole house, now compleatly nude in the streets. I sit down on my large ass, next to Donna, hoping for my punishment. I see her running to me, entering my vagional area, and sitting down next to the wet hairy mass. I still think as a guy, so I don't mind very much. As Donna's tits are still growing, as are mine, I see her dialing on her cellphone. WIthin minutes, I see a mass of girls, running to me, telling me to lay down, as they climb up my vagina, some staying there, and licking it, as a mass of jizz squirts out, soaking the crowd of people. Others, suck on my now expanding nipples, as they become hard and long. Everyone takes out their cellphones, and calls the next group of girls, and the next, and the next, until everywhere I looked, a mass of women, waiting for a free spot on my body, waited. This wasn't enough...I said to myself. I wish every girl here had an breast expantion of a size HH. As the girls were licking pussy and sucking ass, they realized the growth in their bust, but didn't care, still treating me as a sex toy. I soon feel soft balls rubbing against myself. </span></div></div>",
            "created":1273381200,
            "id":880696,
            "title":"try to escape"
        },
        "1212":{
            "author_id":"akplez",
            "author_name":"Mr. Phorcys",
            "choices":[
                "Dana (unaware)",
                "Essie (unaware)",
                "Dana (aware)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who enters after Donna?</span></div></span></div>",
            "created":1498614360,
            "id":2343726,
            "title":"just stay in the bathroom"
        },
        "122":{
            "author_id":"musibrique",
            "author_name":"musibrique",
            "choices":[
                "Move on and try to get her attention",
                "Climb on one of her colossal feet."
            ],
            "content":"<div class=\"\"><div> <span>As you are being compressed by the massive flesh of Donna's massive ass on her bed, you suddenly couldn't breathe anymore. Her ass is simply too big for the oxygen molecules to remain under her ass. Even if you were in microscopic size, you still wouldn't be able to fit under her ass. Suddenly you realize that you will suffocate to death if you don't do anything about it. The only option you had for a hopeful chance of survival is to bite her ass. For the sake of your life, you bite her ass as hard as you can. Fortunately, your hope of survival finally came true. Donna quickly said, \"Ouch!\" and lifted her ass. <br>\r\n<br>\r\nDonna quickly inspected her bed to see what bit her in the ass and surprisingly she didn't found anything. Why didn't she found anything? Simple! You still remained on her ass. Maybe if you didn't got stuck in her ass after all, you might had the chance to be spotten and saved by her.<br>\r\n<br>\r\nDana quickly touch the part where she got bitten and you eventually started to fall toward the ground. Fortunately, for you, the ground is actually a soft carpet; otherwise, you would probably hit the ground to death like jumping out of a skyscraper. You slowly got back up and got shocked by the fact that you are standing between her colossal feet. In your baby flea-sized perspective, you can even see the light being reflected on her dark-brown toe-nails which are almost the size of a football stadium! You are trying to get Donna's attention, but you also have this feetish habit. You decide to... </span></div></div>",
            "created":1357534800,
            "id":1504322,
            "title":"Cheating Death"
        },
        "1222":{
            "author_id":"musibrique",
            "author_name":"musibrique",
            "choices":[
                "Donna's bare-foot hovers what seems to be above you!",
                "You climbed one of the mountain-size trees"
            ],
            "content":"<div class=\"\"><div> <span>You're trying to get help from Donna, but you just couldn't resist her dark brown field of nail polish. You are completely hypnotized by her beauty!  \"At last,\" you said cheerfully. \"After all these years my dream of shrinking myself and climbing on a giantess' feet has finally came true,\" you said yourself with pleasure.<br>\r\n<br>\r\n As you ran toward one of her bare-feet, an unexpected thing happens. You suddenly begin to shrink inexplicably. You quickly notice the floor, room, Donna, and anything but you getting massive and even more massive. It is clear to you that you are shrinking. Then, all of a sudden you stop shrinking and saw something shocking. You see what seems like a never ending maze of trees, except that they are oddly soft and brownish. Suddenly you found out where you are: you have shrunken so small that the carpet itself where Donna's bare-feet stand miles away compared to your insignificant size became a jungle to you! The soft, brownish trees are in fact so massive that they prevent you from seeing Donna's bare-feet. You suddenly realize that a tip of her toe-nail, or even more scary, her bare-feet can perhaps effortlessly flatten you to a bloody stain. You just hoped to yourself that will never happen.<br>\r\n<br>\r\nAll of a sudden...<br>\r\n<br>\r\n</span></div></div>",
            "created":1357880400,
            "id":1506105,
            "title":"The Microscopic World of Giantess"
        },
        "12222":{
            "author_id":"musibrique",
            "author_name":"musibrique",
            "choices":[
                "Go for the door",
                "Stay "
            ],
            "content":"<div class=\"\"><div> <span>You realize that staying in the massive land of carpet doing nothing won't take you anywhere, especially when you are trapped in the house of three giantess with mountain-sized breasts. Not only are you trapped in the house of three sexy giantess, but your odds of at least getting out of the carpet is astronomically small. Due to your insignificant size, you know that guessing your way out of the carpet/jungle is like finding a needle in a haystack. You better be pretty damn lucky to get out of the jungle. Suddenly, you thought of something that might help. If you managed to reach the tip of a soft, brownish tree, you can most likely get a clear view of Donna's room and figure out what is safest place to go. <br>\r\n<br>\r\nYou quickly climbed the soft, brownish trees from Donna's carpet without hesitation. You had no choice but climb and climb because otherwise you're just going to get lost in the jungle not knowing where to go like a blind bat without sonar. Climbing was your only choice if you want to survive rather than remaining an insignificant pipsqueak in Donna's carpet or worse, flatten like a pancake. <br>\r\n<br>\r\nAfter five minutes of climbing, you finally managed to reach the tip. From your micro-sized perspective, you can see everything so big that you can't even describe how big it is. Fortunately, Donna doesn't seem to be in her room and her door that leads to the hallway seems to be closed. You begin to wonder whether it is worth it to get out Donna's room and enter the hallway. You decide to...</span></div></div>",
            "created":1358226000,
            "id":1509234,
            "title":"You climbed one of the mountain-size trees"
        },
        "123":{
            "author_id":"mikelam",
            "author_name":"33",
            "choices":[
                "start jumping and yelling",
                "try to climb her"
            ],
            "content":"<div class=\"\"><div> <span>You bide your time under the huge ass.  You hear the TV click on, and Donna wriggles to get comfortable, setting you free.  You're between her legs, and you look up in awe of how big she is - you can barely see her face.  She brings a cigarette to her mouth and lights it, exhaling lazily into the air.  The good news is she looks relaxed and doesn't appear to be going anywhere, so you can try to get her attention.  The bad news is, at about only an inch tall, you're not sure if she'll notice you... what is the best way to get her attention?<br>\r\n</span></div></div>",
            "created":1330578000,
            "id":1286958,
            "title":"just wait"
        },
        "1231":{
            "author_id":"musibrique",
            "author_name":"musibrique",
            "choices":[
                "Donna lifts both of her legs on the bed",
                "She heard something"
            ],
            "content":"<div class=\"\"><div> <span>Right when you are about to climb Donna's massive body, timidity strikes. You're simply too scared to climb on her not because she is massive, but because of her juicy ass. You didn't want to risk getting trapped under her ass again and probably suffocating to death, so you had no choice but yell. You jumped and yell \"Donna, I'm down here, Donna\" as loud as you can many times, but she couldn't seem to hear you. You try again and suddenly...</span></div></div>",
            "created":1358226000,
            "id":1509237,
            "title":"start jumping and yelling"
        },
        "12312":{
            "author_id":"veig",
            "author_name":"Regrettable",
            "choices":[
                "She doesn't see you because you shrink even more!",
                "She sees you",
                "She sees you but thinks you are a bug"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Donna thinks she hears a high pitched squeak below her. She removes her cigarette and looks down at the sofa between her legs. You continue screaming and jumping as her gigantic faces peers down at you...</span></div></span></div>",
            "created":1418360400,
            "id":1901380,
            "title":"She heard something"
        },
        "13":{
            "author_id":"aow4321",
            "author_name":"aow4321",
            "choices":[
                "go to laundry",
                "go on the vacuum",
                "go on the dinner table",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you think essie would have a better chance finding you since she does the chores and see pretty much every thing.<br>\r\nbut wat to do is the problem, should you...</span></div></span></div>",
            "created":1167800400,
            "id":409687,
            "title":"How to find her"
        },
        "133":{
            "choices":[
                "Throw something",
                "Venture into the Food"
            ],
            "content":"<div class=\"\"><div> <span>You climb on to the top of the table.  Suddenly, Essie appears out of nowhere and is about to set down a huge plate right where you are standing.  You jump away just in time, but now she won't pay attention to you at all.<br>\r\n<br>\r\nShould you play it safe and try to get her attention by throwing something at her or get dirty and jump into the food.?</span></div></div>",
            "created":1194584400,
            "id":462295,
            "title":"go on the dinner table"
        },
        "1332":{
            "choices":[
                "dana",
                "donna"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>you think going onto the food and jumping up and down plus shouting will get her to see you you do it and see still does't see you then you hear someone come in<br>\r\n<br>\r\nwho is it</span></div></span></div>",
            "created":1377579600,
            "id":1652455,
            "title":"on the Food"
        },
        "134":{
            "choices":[
                "Yes, she sees that you're Ryan",
                "No, she still doesn't notice you",
                "She thinks you're an insect"
            ],
            "content":"<div class=\"\"><div> <span>You decide to go in the kitchen; she's sure to be there. Fortunately, you were shrunk in the dining room, which is adjacent to the kitchen. In about two minutes you're in the kitchen.<br>\r\nYou see Essie at the sink washing dishes. She seems to like the color yellow; she's wearing a yellow apron, yellow boots (<a rel=\"nofollow\" href=\"http://images.buycostumes.com/mgen/merchandiser/31643.jpg\" target=\"_blank\">http://images.buycostumes.com/mgen/merch...</a>), and yellow dishwashing gloves (<a rel=\"nofollow\" href=\"http://www.hospeco.com/_images/photos/products/safety/hand_protection/yellow_gloves.jpg\" target=\"_blank\">http://www.hospeco.com/_images/photos/pr...</a>). First thing you try is to climb Essie while she's washing the dishes.<br>\r\nYou start on the boot, work your way onto her leg, and up to her torso. She doesn't seem to notice you, which isn't surprising as you're only a fraction of an inch tall. Luckily, she just started the dishes, so she won't move for a long time.<br>\r\nFinally, you're up to her head, and she still doesn't notice you. You try waving in front of her face and yelling in her ear. Does she notice you?</span></div></div>",
            "created":1239858000,
            "id":677254,
            "title":"something else"
        },
        "1341":{
            "choices":[
                "She shows you to Donna. ",
                "She keeps you to herself. ",
                "She gives you to her twin daughters. "
            ],
            "content":"<div class=\"\"><div> <span>When Esperanza hears some kind of high-pitched shouting in her ear, she suspects it's a mosquito, and hits her ear hard with her left hand. When she pulls her hand back, however, she sees a tiny figure on her yellow-gloved palm that doesn't look like a bug. Examining you closer she realizes it's Ryan, that guy who comes by to see Dana a lot. She first wants to show you to Donna and tell her about you, but for a second, she doesn't see the harm in just keeping you to herself. After all, she has two twin girls at home, and you could be a great plaything for them; this means bad news to you, if she decides to do that. <br>\r\nWhat does she do eventually?</span></div></div>",
            "created":1240117200,
            "id":678708,
            "title":"Yes, she sees that you're Ryan"
        },
        "14":{
            "author_id":"aow4321",
            "author_name":"aow4321",
            "choices":[
                "Panties",
                "Bra",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You get to Dana's room and there it is, mt. laundrymore. Your key interests are the pretty big G-sting and a gigantic bra for a normal sized person  especially for a 16 year old girl. So now another choice. </span></div></span></div>",
            "created":1157346000,
            "id":344370,
            "title":"Jackpot!!!!!"
        },
        "141":{
            "author_id":"thewriter",
            "author_name":"B$fan",
            "choices":[
                "takes off her soiled panties and throws them on him",
                "Puts the panties he's in on and soils them more."
            ],
            "content":"<div class=\"\"><div> <span>Ryan stumbles into the g-string and trips falling face first into a little present Dana left in her undies.<br>\r\n<br>\r\nRyan frantically wipes the crap off her face he is disgusted and yet aroused by the thought of Dana walking around in soiled panties. He continued to smell when he saw Dana walk in. She....</span></div></div>",
            "created":1157691600,
            "id":345331,
            "title":"Soiled Panties: Dana's little present"
        },
        "1412":{
            "choices":[
                "Dana is constipated",
                "Dana has diarrhea"
            ],
            "content":"<div class=\"\"><div> <span>Dana loved the horrid toilet stuff. As soon as she saw the dirty underwear on the floor she just had to put them on. The G-string gave her a pleasureable wegie.<br>\r\n<br>\r\nAroused, she went to the bathroom. She'd been holding out on shitting for a whole week, but now she could hold on no further. Leaving her Gstring on, she sat down on the toilet and began to squeeze....</span></div></div>",
            "created":1160888400,
            "id":352909,
            "title":"Soil some more"
        },
        "14122":{
            "choices":[
                "Jump out of there!",
                "Stay "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Diarrhea sqeezes around the string.<br>\r\nRyan was looking up during this and got a mouthful!<br>\r\n<br>\r\nIt tasted awful.  Dana says to herself, \"Shouldn't of eaten all that Mexican food.  Worst is yet\"<br>\r\n</span></div></span></div>",
            "created":1198299600,
            "id":478431,
            "title":"Dana has diarrhea"
        },
        "141222":{
            "author_id":"princess408",
            "author_name":"Scarletta Carlope",
            "choices":[
                "he stays",
                "he jumps out!"
            ],
            "content":"<div class=\"\"><div> <span>Ryan swallowed some of the poop and tried not to make any noise. Next, Dana began to pee into her panties, and Ryan felt even more disgusted. So he slowly crawled out... at least he tried to. Unfortunately, he ended up squeezing into Dana's ass. At last, Dana stopped. Ryan gave a sigh of relief, but the worst was to come...</span></div></div>",
            "created":1361682000,
            "id":1538670,
            "title":"Stay "
        },
        "142":{
            "author_id":"brianuk",
            "author_name":"briankuk",
            "choices":[
                "jump from Dana bra",
                "stay in the bra"
            ],
            "content":"<div class=\"\"><div> <span>as Ryan walked up to Dana's giant size bra thinking they could get a town of tiny people in them, but he wasn't looking where he was going and fell head frist in Dana's giant bra, but as he was liking being in there he didn't hear Dana walk in but then he heard Dana say theres my lucky bra as she she took her top off and the bra she had on.<br>\r\n<br>\r\nbefore Ryan could do anything the bra he was in was picked up into the air as Dana was putting the bra on to play a game with some friends, Ryan didn't know was she was going to do where he was thinking of jumpping to safed or stay here he is hoping Dana will find him. </span></div></div>",
            "created":1161061200,
            "id":353646,
            "title":"dana bra"
        },
        "1421":{
            "author_id":"ganon",
            "author_name":"Naraku",
            "choices":[
                "What  the,    Ryan!?!",
                "Your a keeper!"
            ],
            "content":"<div class=\"\"><div> <span>As appealing as being pressed against Dana's giant boob all day is. The fear of being crushed by them is more than enough motivation to make Ryan run for dear life. So he ran as fast as his tiny feet wold go to the edge closest to him.<br>\r\nAs Dana was about to put her lucky bra on she noticed a strange 1 inch bug run across the inside of her bra, jump off the edge closest to her.<br>\r\nAS Ryan jumped off the bra he flew forward for a short moment before crashing into Dana's bare slender stomach and slid down into her pants and into her panties. When you git inside you feel Dana jump in surprise to what just happened. This motion coses you to be sling'ed against her pussy so hard that your right arm gets stuck.<br>\r\nYou hears soft moans outside when light starts to come threw the fabric. Dana has taken off her pants and sat down on her bed. Forget the game you hear her say this is way beater. All of a sudden a pare of giant fingers come in and push you all the way into her. Wile inside, Dana's fingers have pressed you against the walls of her pussy and started rubbing hard and fast. You start getting hit with Dana,s juices and Dana starts rubbing harder. Then your hit with a massive amount of her female juices. Then every thing just stopped. You can hear and feel Dana breathing heavily as her fingers leave her pussy.<br>\r\nWhen Dana pulled her fingers out of her panties she saw that the strange bug that had gotten into her pants was stuck to her fingers. Have fun? she asks with a giggle as you try to git up. All of a sudden you hear her say-</span></div></div>",
            "created":1176008400,
            "id":396865,
            "title":"Getting into Dana's pants :)"
        },
        "14211":{
            "author_name":"Eketsu",
            "choices":[
                "\"You heard me\"",
                "\"Nah, just kidding\""
            ],
            "content":"<div class=\"\"><div> <span>Dana notices Ryan and knows who he is.<br>\r\n<br>\r\nDana: Wh-what the?! ....Ryan? Is that you?<br>\r\nRyan: Finaly you noticed<br>\r\n<br>\r\n'Dana starts to giggle'<br>\r\n<br>\r\nRyan: What?<br>\r\nDana: So....did you like the ride?<br>\r\nRyan: Are you nutz?! I could of died in there!<br>\r\nDana: Is that so..*Puts ryan down on the floor*<br>\r\nDana: So you didn't like my fun?<br>\r\nRyan: Well actually.....I kinda did like it.<br>\r\nDana: Good, now its time for another one.<br>\r\nRyan: What?!</span></div></div>",
            "created":1180069200,
            "id":410917,
            "title":"Dana notices Ryan"
        },
        "142111":{
            "choices":[
                "Donna walks in just after having a wash",
                "nobody there you carry on with your fun"
            ],
            "content":"<div class=\"\"><div> <span>Before you had time to react you were shovelled forward's and are smacked head on into danas pussy.Holding on for dear life you grab the rim of her pussy and try to avoid the inebitable , even though you were holding on with all your might you were no match for dana's giant fingers.<br>\r\n<br>\r\nThe soft cushion like side's of her pussy rub against you as both of you moaned in comfort once you were begining to enjoy it you heard the rushing of liquids again and soon enough you were soaked in fluids.<br>\r\n<br>\r\nEven though you been in there a while you still hadnt noticed the giant prick poking up your trousers.<br>\r\nOh well you think as you begin to remove your clothes whill still inside danas pussy.<br>\r\n<br>\r\nYou hear her voice rumble down to you and ask if you want to do anything else but then suddenly the door creaks open.</span></div></div>",
            "created":1265864400,
            "id":834637,
            "title":"\"You heard me\""
        },
        "1422":{
            "author_id":"tinyevergreen",
            "author_name":"Evergreen",
            "choices":[
                "Struggle in an attempt to get Dana to notice you",
                "Stay where you are and wait for an opportunity to escape"
            ],
            "content":"<div class=\"\"><div> <span>   Before you could move, Dana strapped the bra on. It seemed like it was too small for her, as every part of you was pressed tightly against her humongous breasts. You struggled to breath, but it wasn't painful yet. As you attempted to come to terms with your situation, you could hear Dana's voice boom out a question to herself, \"Hmm...I have a few hours until the game, what should I do? Actually, I know exactly what I can spend time doing!\" <br>\r\n   All of a sudden, your soft prison began to move, bouncing up and down. As the bra was two or three sizes too small, you were able to stay in place and simple rubbed against her moving breasts. Just as you started to get used to the feeling of rubbing against such a soft yet firm chest, she stopped. The next thing you knew, both you and the bra lifted in the air slightly, giving you the ability to move again. You shouted in surprise as you saw her breast coming near you again, and while shouting you attempted to propel yourself to get out of the bra. Unfortunately all you succeeded in doing was moving slightly, and ending directly above her nipple as the bra snapped back in place again. This resulted in you being pressed face first against the nipple, and because you were shouting in the moments you were airborn, your mouth was still open, meaning you were now both crammed against the center of the nipple, but your mouth was also being crammed with the skin. After a few moments, you decided to try to calm down and figure out what happened. You seemed to be lying down instead of in a standing position, so it didn't take a genius to figure out that Dana was currently lying in bed. <br>\r\n <br>\r\n    What should you do?</span></div></div>",
            "created":1498539600,
            "id":2343712,
            "title":"Stay in the bra"
        },
        "14221":{
            "author_id":"tinyevergreen",
            "author_name":"Evergreen",
            "choices":[
                "Front of her panties",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>          In an attempt to get Dana's attention, you began to squirm as much as possible, as well as attempt to shout although your mouth was crammed with her nipple flesh. Continuing to do so for what seemed like a few minutes, you instantly stopped in dismay as you heard a noise from Dana. But, not the sound you wanted to hear. She was moaned to herself, it appears the simple act of squirming pleasured her nipple. Sure enough, it was getting harder. Also, if your senses were a good judge, it seems that she decided to further pleasure herself, as you can feel her quivering and her arm rubbing against her breast once in a while, reaching for her \"other area.\" This was not good at all. Your mouth still crammed with her flesh, you attempted to scream but it just resulted in a louder moan, and a rustling noise from above you. Wait-a rustling noise from above you?!? Before your thoughts can go further, an object covered in something sticky slammed against you and began to play with the same nipple you were on. You were pressed deeper into it as her moans grew louder. Meanwhile, your mouth was still open resulting in sticky saliva covering her nipple, and you.<br>\r\n           Suddenly you begin to rise as your own saliva and the sticky liquid already on her fingers seemed to have attached you to Dana's finger. Not wanting to be brought to her \"other region\", you grab at her chest desperately. The only result? A louder moan from her as she gets turned on even more. You were slowly being lowered towards Dana's womanhood, if not for a loud beeping noise. She cursed, it was time to get ready for the game. Looking at her fingers but not noticing you, she rubs you onto the-</span></div></div>",
            "created":1498539600,
            "id":2343717,
            "title":"Notice Me, Dana!"
        },
        "142212":{
            "author_id":"tinyevergreen",
            "author_name":"Evergreen",
            "choices":[
                "Back of her panties",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where else?</span></div></span></div>",
            "created":1498539600,
            "id":2343718,
            "title":"Other"
        },
        "1422122":{
            "author_id":"tinyevergreen",
            "author_name":"Evergreen",
            "choices":[
                "Front of her thong",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where else possible?</span></div></span></div>",
            "created":1498539600,
            "id":2343719,
            "title":"Other"
        },
        "143":{
            "author_id":"aow4321",
            "author_name":"aow4321",
            "choices":[
                "Esperanza picks you up with the laundry",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More choices.</span></div></span></div>",
            "created":1157346000,
            "id":344371,
            "title":"Choices choices"
        },
        "1432":{
            "choices":[
                "Dana puts sock on",
                "the vaccum gets turned on"
            ],
            "content":"<div class=\"\"><div> <span>so as i get closer to the lundry i can see some socks. I decide that would be alot of fun so i run over to them.They are massive and some smell is coming from them. It almost lures you towards them. You then here someone coming. You jump into the sock not wanting to been see yet in fear of someone killing you. Then suddenly.. </span></div></div>",
            "created":1159074000,
            "id":348566,
            "title":"inside socks"
        },
        "14321":{
            "author_name":"PG13",
            "choices":[
                "You find a hole and exscape",
                "You get traped between her foot and the sock"
            ],
            "content":"<div class=\"\"><div> <span>You here footsteps getting louder. Then suddenly you are lifted of the ground with the sock and you see through a tiny crack that Dana has you. You scream as she brings it down and brings it closer and closer to her foot. You struggle to get out, but its to late. The sock is on the ground with you in it, and your girlfriend is sticking her foot in it. You run to the other side, and look for holes....</span></div></div>",
            "created":1160370000,
            "id":351631,
            "title":"Close Call"
        },
        "143211":{
            "choices":[
                "She goes on a run",
                "She puts you...."
            ],
            "content":"<div class=\"\"><div> <span>You see a small hole, just big enough for you to fit through. You run to the hole and dive through it. You look up, and see Dana looking down at you.<br>\r\n<br>\r\n\"What the...Ryan, is that you?\" she said.<br>\r\n<br>\r\n\"Ya Dana, I shrunk somehow, and I ended up in your sock.\"<br>\r\n<br>\r\n\"So you were in my laundry, YOU PERVERT! I'll forgive you, but you need to be taught a lesson.\"<br>\r\n<br>\r\nDana then grabbed you, and took off her shirt.<br>\r\n<br>\r\n\"You like my clothes so much, then you'll be spending today next to my clothes.\"<br>\r\n<br>\r\nDana then put you on the floor, and took off her shirt. It revealed 2 giant mountains covered with a small bra. She then grabbed you with one hand and stretched out the bra with the other.<br>\r\n<br>\r\n\"You'll be spending awhile in my bra, Oh, and sorry if I hurt you a little.\"<br>\r\n<br>\r\nShe then dropped you in her bra, and let go of the bra. It instantly snapped back to position, and pressed you against her soft boobs...</span></div></div>",
            "created":1169269200,
            "id":375252,
            "title":"Teaching a Lesson"
        },
        "143212":{
            "author_id":"uglybull",
            "author_name":"Comrade Banana",
            "choices":[
                "Squirm to get her attention",
                "Try to wait it out"
            ],
            "content":"<div class=\"\"><div> <span>Much to your despair, there are no holes. You watch in terror as her massive toes come hurtling towards you. You try to back up, but you are already at the toe of the sock. Dana’s foot finally reaches the end of the sock, slightly touching you. Dana tightens her sock, firmly pressing you into the ball of her foot between her big and second toe. <br>\r\n<br>\r\nSeemingly unaware that her friend is trapped beneath her foot, Dana begins putting a pair of shoes on. As her socks slide in, she stands up, sandwiching you between her foot and the inside of the shoe. You scream in pain as her foot presses onto you, but there’s no way she could hear you from inside the shoe. She begins walking, further pressing you into her foot. You feel as if you won’t survive any longer, and need to get her attention. <br>\r\n<br>\r\nYou could aggressively squirm beneath her feet in hopes she feels something. However, she might think you are a bug and  squish you. You could just remain still, brace yourself beneath her foot and try to weather it out, but one wrong step could kill you.</span></div></div>",
            "created":1583031420,
            "id":2794968,
            "title":"You get traped between her foot and the sock"
        },
        "1432121":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Torture you along with her boyfriend",
                "Eat you",
                "Torture you under her bare foot"
            ],
            "content":"<div class=\"\"><div> <span>It was unbearable! Not only is the heat utterly stifling and the humidity beyond oppressive, but covering you is the warm, and pungent foot of Dana! You're under the ball of her foot, with just your head between her second and third toes. You decide to wiggle - not that you needed much coaxing in your predicament - and hope that it's enough to tickle her, and that she decides to see what's amiss.<br>\r\n<br>\r\nAfter 5 minutes of wiggling, Dana decides to check it out. After removing her shoe and sock, she notices you, but thinks you're a bug, and not her friend.<br>\r\n<br>\r\nDana decides to...</span></div></div>",
            "created":1591290960,
            "id":2845811,
            "title":"Squirm to get her attention"
        },
        "15":{
            "choices":[
                "Felt you",
                "Think your a bug",
                "Sees you and Squished you with her big toe",
                "Dosent notice a thing"
            ],
            "content":"<div class=\"\"><div> <span>You see Dana's Sandals 3 feet away from you<br>\r\nits like a Huge Truck Parked...<br>\r\nYou went close to it.. you smelled the sweet scent<br>\r\ncoming from the sandals.. it got u turned on...<br>\r\nYou suddenly Climbed on it...<br>\r\nYou reach the Toe section part... <br>\r\nYou kneel down and start smelling the sandal..<br>\r\nyou did a Quick lick and walked to the Sole<br>\r\nArea of the Sandal you lie down there for a couple of minutes enjoying the sweet scent of dana's sandals..<br>\r\nYou suddenly laid with your stomach facing the sandal's sole section and start licking it... it taste like salt mixed with foot flesh.. but for you<br>\r\nits tasted good...<br>\r\nRyan: mmm..! i never knew dana's Feet can be so tasty<br>\r\nYou licked for 10 minutes...<br>\r\nthen u rest and lie down facing the ceiling..<br>\r\nYour eyes was closing your feeling tired....<br>\r\nYou suddenly go to sleep...<br>\r\nBefore you closed your eyes...<br>\r\nYou here a BOOM sound coming closer...<br>\r\nYou opened your eyes and saw the biggest thing u ever saw...<br>\r\nYOu saw dana!!!.. she was enormous!!....<br>\r\nShe then said to her self...<br>\r\nHmm i wonder wheres my sandal? dana said<br>\r\nOh there it is!!...<br>\r\nYou then panic and ran as fast as u can to the toe section!!...<br>\r\nYou reached the toe section and Dana suddenly slips on her sandals causing you too hit her Big toe...<br>\r\nShe then?</span></div></div>",
            "created":1157346000,
            "id":351800,
            "title":"Sandal Paradise"
        },
        "152":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "eat you",
                "squish you",
                "torture you"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"EWW... A BUG!!!\" <br>\r\n<br>\r\nWhat does Dana do?</span></div></span></div>",
            "created":1283662800,
            "id":950807,
            "title":"Think your a bug"
        },
        "1521":{
            "author_id":"steelwoolll",
            "author_name":"Epiclawn",
            "choices":[
                "Dana throws you up",
                "Continue your journey"
            ],
            "content":"<div class=\"\"><div> <span>     The last time you saw the clock, it was 11:55. Usually, you wouldn't care, but since you were shrunken, this was a big problem. That means it was lunch time. Dana's stomach rumbles above you. <br>\r\n     \"I didn't know what to do with you, but I think my stomach is giving me a hint,\" she winked. With her hand, she picks you up without a second thought; her grip was took the breath out of me. You soar higher and higher until you're above Dana's head. Looking down, a black pit awaited for you. The height didn't make you feel so good.<br>\r\n     \"Don't worry, you're not the first bug to be eaten,\" she rubbed her torso, \"You'll soon join them, but If you don't want to, oh well.\" With that, you feel her release you, dropping a hundred feet, in your perspective, downwards. You begin to go into EXTREME panic. You'll never make it out. Was this how your life would be? An protein and energy boost for your friend?<br>\r\n     You crash-land hard into something pink. Touching it, it is unmistakably her tongue. Looking back, her mouth closes, leaving pitch black darkness. With upmost glee, Dana flings you around causing immense pain throughout your body. It also leaves you with a massive headache. Inside, you could hear a moan, not of sadness, but pure delight. \"You taste way better than any other bug I've ever eaten.\"<br>\r\n      Suddenly, you feel the pull of gravity hit you. She was actually swallowing you! You scream at the top of your lungs, but to no avail. You're squeezed down, the slimy walls engulfing you. Actually, this was quite relaxing, but not enough to sooth your beating heart. Finally, you feel your tunnel widen and land in the liquid below. Acid.<br>\r\n      Oddly enough, it didn't burn you. This didn't make sense. <img loading=\"lazy\" style=\"\" class=\"emoteZ\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/confused.png\" alt=\"*Confused*\" title=\"Confused\" border=\"0\" width=\"15\" height=\"15\"> It was suppose to feel like fire. Now though, it felt like your swimming pool back home. I guess whatever shrunk you, it made you indestructible. </span></div></div>",
            "created":1304830800,
            "id":1102742,
            "title":"eat you"
        },
        "1522":{
            "author_id":"zbaird",
            "author_name":"zbaird",
            "content":"<div class=\"\"><div> <span>Dana looked down and smirked. \"Ooooohh this should be fun.\" She tilted her sandal back, leaving just enough room for you to slide between her foot and the leather insole. You could feel the soft ball of her teenage feet start to press down upon you, and for a moment, you were in heaven. Until she decided to stand up and send you straight to hell. SPLAT!.<br>\r\nYou end up a little smudge on this gorgeous giantess' foot, never to be seen again.</span></div></div>",
            "created":1353301200,
            "id":1471188,
            "title":"squish you"
        },
        "1523":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "anal ",
                "foot",
                "other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>what kind of torture?</span></div></span></div>",
            "created":1317877200,
            "id":1201782,
            "title":"torture you"
        },
        "15231":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "Space mission: Black hole",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>then she knocks you out with her toe. when you wake up you see her big butt waving in front of him like the moon. Hello cockroach. You then see your in her chair and she says \"It's nice to see your awake roach. You see I am not going to kill you. However my fans love to see my butt,\" she farts \", and I will torture you with it.\" she then scream and she says \"I knew you would love it!\" she gets out a camera and says \"hello my lovely but fans!\" she turns around spreads apart her cheeks and puts two fingers too er lips ans kisses them, she then takes the fingers and rubs her anus with them. \"I found a queer bug on my sandle ready for torture! today were are going to do...</span></div></div>",
            "created":1317877200,
            "id":1201793,
            "title":"anal "
        },
        "15232":{
            "author_id":"carnaj1",
            "author_name":"carnaj",
            "choices":[
                "Dana looks down and sees Ryan...",
                "Dana looks down, sees Ryan and doesn't care..."
            ],
            "content":"<div class=\"\"><div> <span>Dana looked down as she settled her feet into her favorite sandals. She had had them for years and even she had to admit that they were old and reeking of her perspiration; the leather was frayed and worn, the soles thin, the little toe strap about to snap. She didn't care. One more trip...<br>\r\n<br>\r\nDana's big green eyes grew wide as she saw something squirming down by her toes.She leaned in with a grin watching as the little thing scrambled to get out of the way of her invading toe, flexing her foot and scrunching just as it seemed it mi ght escape. Her toes drew it back and she giggled.<br>\r\n<br>\r\n\"Not so fast, Bug!\" Dana laughed as she pressed down with her big toe little realizing that it was not a bug in fact, but her best friend that she was tormenting. Truth be told, if Dana actually knew that it was her friend Ryan under her toe she would not have cared. She loved bugs; Squishing them underfoot, or unde5r her big ass... eating them even. She shivered at the though of the tiny helpless creature totally at her mercy. What a rush!<br>\r\n<br>\r\nMeanwhile Ryan cowered and screamed as Dana's huge toe came down pressing him into the insole of the sandal. He pushed on the massive weight, pressing hard as Dana simply relaxed her toe and forced him into the leather of her old, smelly shoe. She could not imagine the stench the bug was experiencing but she knew it had to be gross; the sandals were so old. Tough, she finally thought. Your problem, Bug, not mine. Suffer.,..<br>\r\n<br>\r\nDana pressed her toe into the sandal and Ryan screamed in agony...<br>\r\n<br>\r\n</span></div></div>",
            "created":1487221200,
            "id":2278536,
            "title":"foot"
        },
        "152322":{
            "author_id":"uglybull",
            "author_name":"Comrade Banana",
            "choices":[
                "Dana completely squishes Ryan",
                "Dana offers to let Ryan live as her personal insole"
            ],
            "content":"<div class=\"\"><div> <span>Upon hearing a scream that sounded a lot like her friend Ryan’s scream, Dana briefly raised her toe and moved her face closer to get a better look at the bug. Upon having the pressure of Dana’s massive toe relieved, Ryan stands up, looks up and makes eye contact with his friend Dana.<br>\r\n<br>\r\nDana clearly sees that the bug she tortured under her toe was in fact her friend Ryan. However, the pleasure of her torturing and crushing a bug outweighed what she cared about Ryan. Looking at him, she let out a sadistic grin. Ryan watched in horror as her colossal toe came down, knocking him off his feet, now lying face-up with his back on her sandal.<br>\r\n<br>\r\nDana giggles “you’re just a bug now” as she slowly descended her toe. Ryan let out a scream but was soon silenced as Dana’s massive toe covered his entire body and face, pressing part of Dana’s toeskin into his mouth, muffling his scream. Ryan helplessly tried to squirm but due to the pressure of Dana’s toe, he was unable to move.<br>\r\n<br>\r\n Ryan felt betrayed as he was further compressed between Dana’s toe and the leather sandal. Dana laughed at the joy of crushing her now former friend. Ryan felt as if his body would cave in at any moment.<br>\r\n<br>\r\n</span></div></div>",
            "created":1582700280,
            "id":2793025,
            "title":"Dana looks down, sees Ryan and doesn't care..."
        },
        "1523221":{
            "author_id":"uglybull",
            "author_name":"Comrade Banana",
            "content":"<div class=\"\"><div> <span>Overcome by the joy pf crushing bugs, Dana presses her toe all the way down. Unable to move or scream, Ryan can only have thoughts of horror as the pressure of Dana’s toe slowly increases. His mouth is completely forced open by the sheer pressure of her toeskin, and he feels his ribs start to crack. <br>\r\n<br>\r\nSPLAT!<br>\r\n<br>\r\nRyan’s body caves in under the pressure, and all that remains of him is a bloody smear, partially on Dana’s sandal and partially on her big toe.</span></div></div>",
            "created":1582700640,
            "id":2793026,
            "title":"Dana completely squishes Ryan"
        },
        "153":{
            "author_id":"pokefan2",
            "author_name":"Ponymon",
            "content":"<div class=\"\"><div> <span>\"EEEWWWW!\" Dana squeals. \"That bug is disgusting!\" she says. Before you could even get up, Dana's big toe is already on top of you and your are pushed against the surface of then sandal. The last words you ever hear are horrifying, \"DIE YOU DISGUSTING BUG!\" After that, the only memory of your life on earth is a stain on Dana's big toe.</span></div></div>",
            "created":1353474000,
            "id":1472656,
            "title":"Squished under her big toe!"
        },
        "154":{
            "author_id":"uglybull",
            "author_name":"Comrade Banana",
            "choices":[
                "Dana doesn’t feel you and stands up",
                "Dana feels you and realizes it’s you",
                "Dana feels you and thinks you’re a bug"
            ],
            "content":"<div class=\"\"><div> <span>The impact of Dana’s toe causes you to fall forward on the hard, sweaty leather of her old sandal. Before you have the chance to get up, her big toe descends on you, compressing you beneath its soft but heavy flesh. It’s evident Dana didn’t feel you, and has no clue you are completely at her mercy. Dana merely rests her toe while she buckles the straps on her sandal, but its weight alone makes it nearly impossible for you to move.<br>\r\n<br>\r\nWhile you enjoy the sensation of her soft toe encasing your tiny body, you are also filled with panic. Dana will finish buckling her sandals soon, and will likely stand up and start walking. You have no clue if you can survive the weight of her toe if she puts real pressure on it. Your mobility’s limited, but you could try to wiggle to get her to feel you. If she realizes it’s you, she might let you indulge beneath her toe. she might even want to toy with you beneath her toe without the risk of crushing you. However, she might also think you are a bug, which will probably result in her crushing you to a smudge. Still, you need to get her attention, so you start wiggling.</span></div></div>",
            "created":1596790680,
            "id":2881736,
            "title":"Dosent notice a thing"
        },
        "1541":{
            "author_id":"uglybull",
            "author_name":"Comrade Banana",
            "content":"<div class=\"\"><div> <span>You wiggle and try to do anything to get Dana to notice you, but it has no effect. As Dana begins to stand up, the pressure of her toe quickly rises. The pleasant sensation of being under her soft toe is replaced with pain and fear as its crushing weight bears down on you. You try to wiggle, but her toe is forcing your face, arms, and legs into her smelly leather sandal, rendering it impossible to move. You try to scream out, but your head is encased by her toe, and it’s impossible for Dana to hear you. <br>\r\n<br>\r\nAs Dana finishes standing up, she has no clue that she is torturing her friend, she doesn’t even know he’s beneath her toe. You’re barely able to breathe and maintain consciousness. Suddenly, you feel her sandal lurch into the air, and you realize she has started walking. You don’t have time to panic as her foot comes crashing down. The pressure of her toe increases tremendously as she puts all of her weight on it to take her next step. All the air is forced from your lungs, and you feel your ribs and legs starting to crack. Her foot rises for the next step, but you’re too weakened to move or scream. Her foot hits the ground again, and the last thing you feel is her toe cracking and crunching your bones.<br>\r\n<br>\r\nDana continues walking, completely unaware that her friend is now a bloody splat on the bottom of her toe.</span></div></div>",
            "created":1596874380,
            "id":2882150,
            "title":"Dana doesn’t feel you and stands up"
        },
        "1542":{
            "author_id":"uglybull",
            "author_name":"Comrade Banana",
            "choices":[
                "Dana toys with you",
                "Dana has you indulge under her foot ",
                "Dana bosses you around"
            ],
            "content":"<div class=\"\"><div> <span>As Dana finishes buckling her sandals, she feels something wiggling under her toe... you. While briefly tempted to just squish whatever it is, Dana instead reaches down and grabs what it is with her fingers... if it’s a bug she’ll bite it in half. She brings the thing closer to her mouth before she realizes it’s not a bug, but you. <br>\r\n<br>\r\nHer eyes immediately widen... “Ryan? Is that really you?”<br>\r\nYou nod.<br>\r\n“I’m glad I found you. If I didn’t realize it was you, I could have crushed or eaten you!”<br>\r\nDana thinks for a moment before asking, “What were you doing in my sandal, anyways? You know I love to crush bugs... I could have killed you!” <br>\r\nYou are to embarrassed to explain to her, but she sees you blush. Dana sees this and lets out a smirk.<br>\r\n“You... you love my sandals, don’t you? You couldn’t resist them even if it could have killed you, isn’t that right?” Dana lets out a full smug grin, “Well perhaps you should stay with them! My feet could use company.” <br>\r\n<br>\r\nBefore you can say anything, Dana tilts her sandal back, and lowers you into it. She lowers her sandal back onto the floor, pinning you beneath the soft ball of her foot. You don’t want to admit it, but you love feeling the soft ball of her giant foot pin your legs and chest. You reach out with your hands and push against it, even though you know this won’t do anything. Your head is not covered, and you can see her smug grin staring down at you.<br>\r\n<br>\r\n“Enjoying it down there? Relax, I won’t squish you. That’d end the fun too early and we’re friends after all.” Dana says, “Even if you’re a bit strange and would risk your life to feel my sandals.”<br>\r\n<br>\r\nDana thinks about what to do with you beneath her foot.</span></div></div>",
            "created":1596875460,
            "id":2882156,
            "title":"Dana feels you and realizes it’s you"
        }
    },
    "info":{
        "author_id":"aow4321",
        "author_name":"aow4321",
        "brief_description":"You are shrunk at your friend who is a girl's house.",
        "created":1157349120,
        "description":"<td align=\"left\" class=\"norm\">Your over your friends house who is a girl.  You always think she had a crush on you. Anyway you shrink while your their, so you have to watch out for her, her mom, and thier maid. heres the descriptions...<br>\r\n<br>\r\nRyan(you):16 years old, brown hair brown eyes, always liked Dana and is pretty sure she liked you cause shed always stuff her feet in your face and sit on you.<br>\r\n<br>\r\nDana(your friend):17 years old, brown hair, green eyes, perfect body, nice big ass, and a D sized breast. She loves to torture bugs by eating them, sitting on them, and stepping on them.<br>\r\n<br>\r\nDonna(Dana's mom):37 years old, brown hair, blue eyes, normal body, DD sized boobs and a giant ass.<br>\r\n<br>\r\nEsperanza[Essie](Donna's maid):29 years old, spanish, black hair, dark eyes, D sized boobs, a nice body, and an ass a little not by much smaller then Donna's.<br>\r\n<br>\r\n<br>\r\n<br>\r\nbra, boobs, panties, g-string, ass, sit, toilet, feet, eating, and more are ok.  no giants and Ryan can't die. Enjoy</td>",
        "id":1152495,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1597760340,
        "modified":1597760340,
        "pretty_title":"Shrunk!!"
    }
}