{
    "chapters":{
        "1":{
            "author_id":"halothecool",
            "author_name":"Halothecool",
            "choices":[
                "Story 1",
                "Story 2",
                "Story 3",
                "Story 4",
                "Story 5"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Have fun making your own interactive </span></div></span></div>",
            "created":1527656400,
            "id":2500613,
            "title":"Starting iff"
        },
        "11":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Angela is  exposed to a chemical ",
                "Angela was born with this ability but only just now unlocks it ",
                "She gains the ability from a magical item she buys ",
                "She earns a wish from a witch",
                "She volunteers for a science experiment  "
            ],
            "content":"<div class=\"\"><div> <span>This is a Trait stealing story <br>\r\n<br>\r\nAngela is a ordinary college student who’s life changes suddenly when she gets the ability to steal other women’s traits.<br>\r\nAngela traits<br>\r\nHeight: 5’6<br>\r\nHair: brunette and long<br>\r\nAge: 23<br>\r\nBreast: 38DD<br>\r\nAss: bubble butt</span></div></div>",
            "created":1527915600,
            "id":2502254,
            "title":"Angela’s growth "
        },
        "115":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Stick with traits theft",
                "Natural growth ",
                "More options "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I was thinking of different ways for her to grow instead of just having the thrift option, so here’s a few more </span></div></span></div>",
            "created":1533704400,
            "id":2530816,
            "title":"She volunteers for a science experiment  "
        },
        "1152":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Walks around town ",
                "Goes shopping ",
                "Decideds to stay home "
            ],
            "content":"<div class=\"\"><div> <span>Angela wake up on a Saturday morning and thinks about what to do this today. She goes and showers and gets dressed, she picks out a pink bra and matching panties with a white t-shirt that showed a little midriff and a pair of black jogger shorts. She felt the bra a little tighter then it was the day before so she checked the tag to make sure it was a 38dd which it was “must have shrunk a little in the wash.” So she ignored it for now and put the shirt and shorts on to go out for the day.</span></div></div>",
            "created":1535432400,
            "id":2539952,
            "title":"Natural growth "
        },
        "11522":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "She grows while trying her new bra’s on ",
                "2 weeks later and Parker visits",
                "Goes to the park and finds a busty jogger to bring home "
            ],
            "content":"<div class=\"\"><div> <span>She decides to head out and do some clothes shopping since she thinks hers shrunk in the wash. Getting to the mall she feels her clothes get a little tighter but shrugs it off and walks inside. She notices a boy about 16 years old staring at her as she walks by, not wanting to miss a chance to become a boy’s fantasy for the night she walks up to him and bends over giving him a perfect view of her cleavage. “If you help carry my bags when I’m shopping I’ll give you a reward.” The boy immediately got up and agreed to. For the next hour Angela went around buying clothes and other stuff while this kid who’s name she learned was Parker carried her bags around. Then she got to the store she saved for last, her favorite store to buy her bra’s from. Parker was hesitant to follow at first but eventually followed. Angela looks around and picks a few bras out, a pink one, a white one, a pink lace one and a black one with pink lacing around the cups and a pink bow in the middle. Once she purchased the bras she pulled Parker into one of the dressing rooms and started to take her shirt off. “Pants off, I told you I would reward you if you were a good little boy.” For the next few minutes Angela gave the best tit fuck she ever had. She unclasp the bra and hands it to Parker with a piece of paper with her number and address on it “you can keep it if you want and if you ever want to help again just give me a call” she winked at him as she put her shirt back on but notice it took a little bit more effort. Parker could have sworn he saw her breast grow a little bit during the tit fuck but didn’t pay to much attention as he put his pants back on and carried the bags out to her car. Without her bra Angela’s breast jiggle and bounced with every step and she loved the stares she got from guys and girls with smaller breast. She says bye to Parker and drives off back home.</span></div></div>",
            "created":1559278800,
            "id":2667323,
            "title":"Goes shopping "
        },
        "115222":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Angela burst out of the bra ",
                "Angela and Parker have sex ",
                "Angela’s sister comes over "
            ],
            "content":"<div class=\"\"><div> <span>2 weeks have passed since Parker had finally got a tit fuck from the girl of his dreams. Parker couldn’t hold his lust in and went to pay her a visit. Knowing her bra size from the bra she gave him, he went out and bought her another bra with this one being a purple lace one with little fluffs around the cups. When she answered the door Parker thought he had the wrong address as the lady who answered had breast about 2 cup sizes larger and a more plump ass with thicker thighs. It was only when this woman said “oh hello Parker, been a while since I last saw you. Dropping by cause you wanted more? Well come on in” that he knew it was Angela. <br>\r\n<br>\r\n“What.....” was all Parker could say as he entered the house. Angela was in one of the bra’s she had bought at the mall, the pink one that she bought to replace her old one. Parker also noticed that most of the bras she had bought were on the floor around the house with the straps snapped or the middle snapped. “Is that for me?” Angela said whole pointing towards the bag. Quickly he hands the bag over and she takes out the bra and reads the tag. “Such a cute bra, but I think I’ve gotten bigger then a 38dd since I last saw you. But I’ll still try it on.” She tries to unclasp her bra but is having a little trouble, so she decides to take a deep breath. The already strained bra couldn’t take the pressure and snaps. The bra lands on Parker’s head. <br>\r\n<br>\r\nAngela puts her breasts into the cups and tugs on the straps to clasps it but can’t quite reach it herself so she asks Parker for some help. Instead of going behind her he wraps his arms around her while pressing his chest into hers, it takes a few moments but they finally get the bra on.<br>\r\n<br>\r\n“It’s a snug fit but it’s pretty nice feeling bra, now come have a seat” Angela points towards the couch. Parker walks over and sits down in the middle of the couch. “As you can see I’ve been growing a little, I don’t know why I am but I do know that when I grow I become very horny. I know how much you love my body so I’m willing to make a deal with you. You keep buying me clothes and I’ll keep fucking you.” Angela then sits on Parker’s lap, feeling his boner through his pants. Parker can’t help himself and grabs her thighs but can’t get a good grip since they’ve gotten a lot thicker. It’s only now that Parker also notices all the pairs of shorts and panties all over the floor, Angela’s ass had double in size since the mall incident. </span></div></div>",
            "created":1559278800,
            "id":2667384,
            "title":"2 weeks later and Parker visits"
        },
        "1152221":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Angela continues to grind until he cums ",
                "Angela has Parker go get some clothes for her ",
                "“Are you getting taller Angela?”"
            ],
            "content":"<div class=\"\"><div> <span>While Parker tries to get a good grip on her thighs Angela leans in while grinding a little on his lap for a kiss. After a few minutes of this Parker motions Angela to get up. When she gets up he gets his pants and boxers off, but before she could get back on his lap she feels the bra tighten more.<br>\r\n<br>\r\n“Parker I don’t know how much longer this bra is gonna last. I know you picked it out for me so I don’t want to snap it but I don’t think we can get it off now.” So standing in front of him she takes in a deep breath. The bra strains but doesn’t doesn’t snap instantly, her breast were slowly bulging out the cups. Smiling a little Angela mentions “the fluffs kinda tickles a little, feels kinda nice.”<br>\r\n<br>\r\nFinally the bra couldn’t take anymore pressure and snaps off, landing on Parker’s head. Now with the bra off Angela sits back down “here let me help you” she removes the bra from his head and starts grinding against his lap again. This time Parker couldn’t concentrate as her breast bounced around as she moved back and fourth.</span></div></div>",
            "created":1559538000,
            "id":2668489,
            "title":"Angela burst out of the bra "
        },
        "1152222":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Puts on the nightgown ",
                "Burst out of the bra ",
                "Parker has to go home "
            ],
            "content":"<div class=\"\"><div> <span>Angela leaned in and kissed Parker as he was grabbing her thighs and ass. This went on for a few moments before Angela got up and motioned Parker to her bedroom. Not wanting to ruin the bra Parker had bought her she had him help take it off. She had a hard time but eventually got her panties off that Parker didn’t even know she was wearing since they were lost in her ass.<br>\r\n<br>\r\nAngela took off Parker’s shirt while he took off his pants and boxers. Once his clothes were off Angela hopped onto her bed on her back, her breast wouldn’t stop jiggling back and fourth from the vibration. Parker not wasting a moment quickly followed suit and started to thrust into her. Not wanting him to cum inside her right away she took his manhood and squished it between her breast and starting going up and down. As soon as he said he was gonna cum he shot his load all over her breasts. Angela just moaned when he laid her down and started thrusting inside her again as he kissed her breast. Having already ejaculated one time not as much came out this time but Angela felt it and organism.<br>\r\n<br>\r\n“Angela, I don’t know what to say, that was fantastic and I’m glad you were my first.” <br>\r\n“We should probably clean up but I’m feeling a bit tired so why don’t we rest for right now.” Angela replied through her breaths as she was coming back from it all. Parker just took her offer and used her breast like pillows.<br>\r\n<br>\r\nFew hours later<br>\r\n<br>\r\nParker woke up first and started to lightly play with Angela’s breasts as she slept. She felt her breast being touched in her sleep as her hand slowly went down to her vagina to masturbate in her sleep. Once she finished she had woken up and smiled at Parker. They both got up and took a hot shower together. <br>\r\n<br>\r\nHaving him help again she was able to get the bra back on and got the panties back on. “So do you have any clothes that fit you or are completely out of clothes?” Parker asked while he stared at her. She goes to the closet and pulls out a nightgown, pair of black jogger shorts and a crop top. “I’m not completely out, I got these.”<br>\r\n </span></div></div>",
            "created":1559365200,
            "id":2667463,
            "title":"Angela and Parker have sex "
        },
        "11522221":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "They go to the beach ",
                "They go to the park ",
                "Before out the door Angela grows again "
            ],
            "content":"<div class=\"\"><div> <span>Upon seeing the nightgown Parker asks if he could see Angela in it. “It’s gonna take a minute or two to get on with the bra on” Angela takes it out and struggles to get it over her breast and bra but eventually gets it.<br>\r\n<br>\r\nThe lace nightgown is light black lacing with the edges being pink lacing. Before her growth it reached down to her knees but now it barley reached over her ass. <br>\r\n<br>\r\nAngela tried to pull it down a little more but almost pulled it over her breast so she stopped. After a few minutes of Parker and Angela talking and playing with her new curves Angela decides they should go out on a walk or something. She takes off the nightgown without ripping it and puts on the crop top and shorts, she would be better off without the top as it basically looked like a second bra at this point and her shorts held by some miracle.</span></div></div>",
            "created":1559624400,
            "id":2669122,
            "title":"Puts on the nightgown "
        },
        "11522222":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "“Angela are you getting taller?”",
                "Decides she needs new clothes ",
                "Knock knock "
            ],
            "content":"<div class=\"\"><div> <span>While Parker looked over what clothes she said she could still fit Angela was looking at all the clothes snapped or ripped around her room. <br>\r\n<br>\r\n“Angela how big were you in high school?” <br>\r\n<br>\r\nThat question caught her off guard for a second. “Freshmen I was about a B but by senior year I was a firm DD.” While talking about her breast size in high school she felt the bra snap. <br>\r\n<br>\r\nHearing the snap Parker turns around and sees the most beautiful site he had ever seen. The bra had snapped at the straps and fallen to the floor while the breast were bouncing all over the place as Angela slowly brought her hands up to hold them.<br>\r\n<br>\r\n“I’m really sorry about the bra, I really did like it.” As Angela apologized about the bra Parker saw her thighs thicken and her ass push out a little more as her panties snapped too. Without thinking Parker pushes her back onto the bed and starts playing with her, staring with her ass and moving to her breast. </span></div></div>",
            "created":1559624400,
            "id":2669125,
            "title":"Burst out of the bra "
        },
        "115222222":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Parker goes go and buys her just the clothes on the list ",
                "Parker buys the clothes on the list and some extras ",
                "Parker only buys some of the clothes on the list"
            ],
            "content":"<div class=\"\"><div> <span>Moaning from the sensation of Parker fucking her breasts Angela looks around again at the bra and panties that had just snapped. She realizes she won’t be able to go out and buy herself new clothes since none of her things would fit her now. <br>\r\n<br>\r\n“Parker I’m gonna need you to go out and buy me some clothes, I wanna go out tonight but I don’t think I’ll fit into anything now.” Angela says as Parker cums on her breast.<br>\r\n<br>\r\n“Could you try to get the nightgown on? Even if you don’t fit in it I would love to see it struggle to hold you” Parker replied as he leaned in to kiss Angela. “I guess I could try for you.” Angela gets up and walks over to the nightgown and is able to get it over her breast and that’s it. <br>\r\n<br>\r\n“Ok enough messing around, I need you to go and get me some clothes. Here’s a list of the clothes I use to have and my guess of my new measurements.” Angela said while handing Parker her credit card.</span></div></div>",
            "created":1561352400,
            "id":2678005,
            "title":"Decides she needs new clothes "
        },
        "1152222221":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Meet your family ",
                "I want you to meet my family ",
                "Meet your coworkers and how much you outclass them"
            ],
            "content":"<div class=\"\"><div> <span>Parker gives her one more kiss before heading out to the store. Looking at the list he sees she listed a few t-shirts, crop tops, jeans, shorts and mini skirts before he gets to the underwear list. On the underwear part she listed all the bra’s she got at the mall plus a couple other ones that include a plain red one, a red lace one and the one Parker had bought for her plus a few bikinis and nightgowns.<br>\r\n<br>\r\nArriving at the store and going around finding the clothes Parker brings it all to the cashier who takes a keen interest on the purchases. “Lot of clothes for a women, where’s the lucky lady?” The cashier was a pretty busty woken herself but looked only about half of Angela’s new size which she wrote down as 32FF. “At home since none of her clothes fit her.” <br>\r\n<br>\r\nOnce he finished the transaction Parker got back to Angela as fast as he could and have her the clothes. Angela reached into one of the bags and pulled out a black bra with pink lacing “For being such a good boy you get to pick what I wear today.” <br>\r\n<br>\r\nParker picks out the bra she has with matching panties and a red mini skirt. “No top? I guess you love seeing them so much” Angela dresses and notices the mini skirt was a little too mini, she guesses she got her size wrong by a little. Parker had hoped she wouldn’t notice he got the skirt a little smaller then what she had written down.<br>\r\n<br>\r\n“So what do you want to do today?” Angela asks as she struts towards Parker.</span></div></div>",
            "created":1561784400,
            "id":2680107,
            "title":"Parker goes go and buys her just the clothes on..."
        },
        "11522223":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Parker, he realized he had the day off ",
                "Her sister",
                "Coworker model "
            ],
            "content":"<div class=\"\"><div> <span>Looking at the time Parker realizes he has to get home if he wants to get ready for work. Getting dressed he looks over at Angela who had gotten up on the bed, stretching her arms out above her head. “When you get off we’re going to s lingerie shop.” <br>\r\n<br>\r\nParker gives Angela a kiss goodbye and her breast a squeeze before he left leaving Angela alone for the time being. Walking through her house she picked up all the clothes strung all over the floor. She notices a few of the bra’s were missing and smiled to herself knowing were they went.<br>\r\n<br>\r\nAngela was making her way back to her room to play with herself when she heard a knock on the front door.</span></div></div>",
            "created":1560229200,
            "id":2672115,
            "title":"Parker has to go home "
        },
        "1152223":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Wendy is calm ",
                "Wendy is freaking out ",
                "Wendy notices Parker under Angela "
            ],
            "content":"<div class=\"\"><div> <span>As Angela and Parker were feeling each other up there was a knock on the door followed by a familiar voice to Angela “Angela i thought I would stop by, hope you don’t mind.” The door opened and in walked in this women who looked like Angela but not exactly as her face was a little different and her hair was shorter. Before Angela has grown her and her sister shared the same measurements so Parker knew almost instantly that she was somehow related to Angela. <br>\r\n<br>\r\n“Angela what hap......” <br>\r\n<br>\r\n“Hey Wendy, long time no see sis”</span></div></div>",
            "created":1559365200,
            "id":2667468,
            "title":"Angela’s sister comes over "
        },
        "11522233":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Angela refuses ",
                "Angela asks Wendy ",
                "Parker and Angela bear ripping coming from Wendy "
            ],
            "content":"<div class=\"\"><div> <span>Wendy notices that Angela is moving like she’s riding on someone’s lap and sees Parker under her ready to cum in her sister’s ass which seems a lot bigger then she remembers. “Um who’s that Angela” Wendy points at Parker as he cums. “Oh this guy? He’s my new boyfriend. Parker meet my jealous sister Wendy and Wendy meet my new boyfriend Parker.”<br>\r\n<br>\r\n“So why did you stop by Wendy? You wanna borrow one of my bra’s again?”<br>\r\n<br>\r\n“No, I came to return the last one I borrowed as it’s a little tight for some reason now. I think it shrunk in the wash.” Wendy takes her crop top to reveal a white bra that’s straining a little to hold her breast in and unclasps the bra setting her breast free. Walking over to Angela her breast jiggled up and down, handing the bra to Angela who knew she wouldn’t fit in it again and put her crop top back on which looked a little tighter even though she wasn’t wearing a bra now “Huh my top must have shrunk too.” As Wendy was turning around to walk out Angela called her back over after seeing her strained shorts as her ass also looked bigger then the last time Angela saw her. <br>\r\n<br>\r\nHolding the bra up “care to help your big sis out?” Wendy looked delighted as she tugged on the bra to clasp. By some miracle they are able to get this bra that shouldn’t fit on Angela as her breast spilled out of every corner of it.<br>\r\n<br>\r\n“Angela I have a idea, why don’t we have a threesome with your sister.”</span></div></div>",
            "created":1561784400,
            "id":2680118,
            "title":"Wendy notices Parker under Angela "
        },
        "11523":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "She outgrows her bra first ",
                "She out grows her shorts and panties first "
            ],
            "content":"<div class=\"\"><div> <span>Deciding to stay home instead of going out Angela took off her shirt and walked around the house in her bra and shorts which she felt her tighter. “Did my shorts shrink in th wash too?” As she grabbed a one of her ass cheeks with a hand. What surprised her was she felt more flesh then usual but didn’t think to much of it since she thought she just gained a few extra pounds. As the day went on she felt her shorts get tighter. “Ok am I just imaging things or is my ass getting bigger???” She tried to take her shorts off but was unable to since her ass had gotten much bigger over the course of the day. She then felt her bra get tighter so she looked down to see her breast starting to bludge over the cups. So she went to try and unclasp the bra but with no provale. “If I can’t get this bra off soon it’s gonna snap and I really like this bra.” She grabbed her breast in each hand and gave them a good squeeze sending pleasures down her back. </span></div></div>",
            "created":1535605200,
            "id":2540688,
            "title":"Decideds to stay home "
        },
        "115231":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Free those glorious cheeks ",
                "Play with herself ",
                "Knock knock "
            ],
            "content":"<div class=\"\"><div> <span>Angela felt her breast bulge out the cups as she groped herself. The straps were starting to strain against her shoulders. She didn’t know how much longer it would last as her breast were growing bigger and little stitches were starting to snap.<br>\r\n<br>\r\n“Ok at least now I know they didn’t shrink in the wash.” Angela was trying to distract herself when the bra snapped. Now free from the constraint her breast bounced and jiggled with every little movement she made.<br>\r\n<br>\r\nShe goes over to her dresser and looks through her bra’s. She knew different brands of the same size were a little bigger or a little smaller then other brands. She finds her black bra with pink lacing and puts her breast into the cups and strains to get it on. Eventually she managed but the bra wouldn’t last if she grew again at all or made any sudden movement.</span></div></div>",
            "created":1559797200,
            "id":2669861,
            "title":"She outgrows her bra first "
        },
        "115232":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "She outgrows the bra quickly ",
                "She outgrows the bra slowly "
            ],
            "content":"<div class=\"\"><div> <span>As the shorts got tighter Angela started groping her ass not believing that this was really happening. Her shorts soon started to rise up get cheeks and her ass was starting to hang out of them. She tried to pull them over her cheeks but only cause more strain on them as they started to rip down the back. The black shorts finally ripped all the way and she was left in her very tight panties that only lasted a few seconds after her shorts and fell to thre ground. Grabbing her ass with her hands feeling how big and round it is now. She goes and grabs a pair of the same shorts but a bigger pair she had Incase she gained weight in the future, she had a lot of trouble but manged to get them on but they were extremely tight. While getting the new shorts on she felt the tingly in her breast.</span></div></div>",
            "created":1536642000,
            "id":2546554,
            "title":"She out grows her shorts and panties first "
        },
        "1152322":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "she continues to grow ",
                "Her growing stops"
            ],
            "content":"<div class=\"\"><div> <span>While her ass was getting bigger she had forgotten about her breast and looked down at them to see them slowly getting bigger in her favorite pink bra that was trying to hold on her big firm and squishy breast. Like her ass, she didn’t believe what she was seeing and grabbed her breast with both hands giving a squeeze that sent pleasures down her back. She tried to unclapse the bra but it wouldn’t budge and the straps were to tight. She wanted the bra off but didn’t want it to snap since it was her favorite one. The bra didn’t last much longer for her since the straps snapped a few moments later and falls to the ground while her breast bounce and jiggle for a few seconds.</span></div></div>",
            "created":1542862800,
            "id":2580781,
            "title":"She outgrows the bra slowly "
        },
        "1153":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Splash ",
                "Lust ",
                "More options "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When she gets splashed with water does she grow or does a boy’s lust for her make her grow</span></div></span></div>",
            "created":1533704400,
            "id":2530817,
            "title":"More options "
        },
        "11533":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Jealousy ",
                "More options "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When another women gets jealous of her she grows a cup size and a waist size </span></div></span></div>",
            "created":1542949200,
            "id":2580886,
            "title":"Jealousy inflation "
        },
        "115332":{
            "author_id":"shooter243",
            "author_name":"Death",
            "choices":[
                "Start groping her",
                "More options "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When ever someone gropes her breast or ass the part groped grows </span></div></span></div>",
            "created":1542949200,
            "id":2580887,
            "title":"Grope"
        },
        "12":{
            "choices":[
                "Story ",
                "Other story",
                "More story",
                "Story story",
                "Cheddar"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>I claim this for myself and Lonly Wanderer this will be stories focusing on Morgan and Ren and other people. <br>\r\n<br>\r\n<br>\r\nI should of thought of an idea for a storyline before doing this but what the heck</span></div></span></div>",
            "created":1532149200,
            "id":2522813,
            "title":"I claim this land"
        },
        "121":{
            "choices":[
                "Ren and Zero ",
                "Pyro and Azure",
                "Chihiro and Loyd"
            ],
            "content":"<div class=\"\"><div> <span>There were a whole bunch of beings standing around at some sort of park like area. “Okay, okay everyone listen up!” Primus said talking into one of those cone things that magnify your voice. <br>\r\n<br>\r\n“So what’s going on?” Ren said currently being pressed against Tali. “I noticed that between with you and the others boys there isn’t that much, interaction? I think that’s the right word, between you guys and the ascended and apprentices and whatever else there is. So we are having a scavenger hunt!” Primus cheered, some people in the audience groaning.<br>\r\n<br>\r\n“Now, now it’s going to be fun. Here is how it’s going to work: you will be paired up with someone and that will be decided by pulling names out of this awesome top hat I found in the dungeon. Each team will be given a slip of paper. You have to find something that matches that description and bring it back to me. If I think it works I will give you another slip of paper. This will repeat fifteen times, the first person to bring back the fifteen things get to go on an awesome vacation.” Primus explained, Tali fantasizing in her head going on a vacation <b>alone</b> with Ren.<br>\r\n<br>\r\n“Now to make sure there isn’t too much chaos I’m going to set down some ground rules. First, you can’t switch partners, get what you get and don’t throw a fit. Second, no leaving the park, don’t worry this place is big there are lots of different environments to it. Third, you have to stay within thirty feet of your partner. Fourth, no killing, maiming, or doing any kind of harm that would require immediate medical attention, I know you ascended and apprentices are immortal and junk but I want this to be fair. You can slow down your opponents in other ways. Fifth, no removing things that are stuck to the ground, you have no idea what kind of hoops I had to jump through to organize this. You can’t use any objects that you didn’t find in this park. Any questions?” Primus asked, noticing Light Blue Diamond raising his hand. “Yes?” “Where are Jerry, Teddy, Leroy and Alfalfa?” The smallest Diamond asked. “Very good question, I have people spread out as referees to make sure no one cheats, also cheating will result in being kicked out and no desert, this applies to everyone. Now for the pairings.”<br>\r\n<br>\r\nPrimus pulled out a top hat and reached his hand down. “Century and Elsa”  the two people named looked at each and nodded recognizing each other’s prescience. “Light Blue Diamond And Black Diamond” Light Blue looked over to the older diamond and blushed, Black Diamond not noticing (or did she?). “Ren and-“ <br>\r\n<br>\r\n<i>’Please say Tali, please say Tali’</i> Tali thought closing her eyes. “Zero!” Tali looked down and saw Ren was now gone. She looked up seeing Zero holding Ren like a sack of potatoes. Zero using one finger to pull her eyelid down and sticking her tongue out. “Morgan and Tali” Tali looked over to Morgan who smiled waved before going over. Tali did admit Morgan was cute but not as cute as her Ren.<br>\r\n<br>\r\n“Pyro and 3” Snaky appeared and whispered into Primus’ ear before disappearing again. “It has come to my knowledge that 3 has been mauled by a fire breathing bear and will not be able to participate. Pyro you can be with Azure. Loyd and Lena.” Primus saw that Loyd had headphones on and motioned for him to take them off. Loyd lifting up one of the muffs. “Loyd you’re with Lena.” Loyd gave a thumbs before releasing the muff. “Chihiro and 10. Mickey and Sakura, and finally Platinum and 4.” Primus gave time for the groups to get together. “Ready. Set. Go!” Primus called.<br>\r\n<br>\r\nWhich groups shall we focus on first?</span></div></div>",
            "created":1532149200,
            "id":2523030,
            "title":"Madness between dimensions interactive edition"
        },
        "1213":{
            "choices":[
                "Eating Ice Cream",
                "At a resturaunt",
                "Continue with what was before"
            ],
            "content":"<div class=\"\"><div> <span>Morgan was an angel, he didn’t have wings as those didn’t appear on an angel until they turned 18 (although it is possible for some angels to sprout wings earlier or later) and he didn’t have a halo as halos were like jewelry for angels and like tattoos you couldn’t get one until you were eighteen unless you had your parents permission, (which he didn’t but he didn’t care)  but he did have blue hair. As you know there are the regular angels, dark angels, guardian angels and shoulder angels. Now most people think shoulder angels are just hallucinations when someone was under intense pressure to do the right thing, they are semi-correct. Shoulder devils were just holograms done by demons as a way of screwing with the angels, who were invisible to everyone but the ones they were trying to help. But nowadays demons don’t do that much regarding making humans or most mythical beings do the wrong thing. The thing with shoulder angels was that they are normally tiny, there are times angels are born tiny for reasons currently unknown and they found a use for them helping people make the correct choices. Morgan himself was a tiny angel being twelve years old (a rather young twelve mind you). <br>\r\n<br>\r\nAll young angels take an exam to see how talented they are and what do you know he was a genius. So the person in charge of the shoulder angels, Matt, offered Morgan a job being a shoulder angel. Morgan accepted without hesitation. His family was concerned about him getting hurt despite the fact angels are extremely durable.<br>\r\n<br>\r\nMorgan was reading the packet he was given to see who he would be giving guidance to. All it said was the name “Zero” Morgan was slightly worried as normally the packets would have much, much more information. Morgan pulled out a small white device in the shape of pen with a red button on it. Pressing it would send Morgan to Zero’s location. <br>\r\n</span></div></div>",
            "created":1536037200,
            "id":2542815,
            "title":"Shoulder Angel"
        },
        "12131":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "She decides to let Morgan have a go at angeling",
                "She's rather keep him as a pet"
            ],
            "content":"<div class=\"\"><div> <span>Zero sighs as she munched through her extra large ice cream tub, it had been a while since she'd had proper human interaction, sure it was self imposed as Robyn was getting older and she didn't like goodbyes, sitting by Z's deathbed nearly killed her but she did it anyway for the silver haired formerly fiery red headed witch. Not that her kid would notice, she had Alice to keep her occupied and the twins, the problem was her. She was bored and she had no missions from the boss as she had the week off, not even 10 was around for her to piss off, usually by sending 32 at her, it gave her, her monthly dose of Super/Luther collateral damage, though she wasn't allowed do that in the castle/home base any more because Kaos and TARDIS got tired of having to put the building back together after the feuding duo tear it down around them.<br>\r\n<br>\r\nShe was pulled from her boredom by a pulse of light magic and twitched, Kaos and through him the Apprentices and Ascended were technically Chaotic Neutral, but again through his blood they were at least 20% demon, with Zero it was probably closer to 65%, so an angelic being would cause her to twitch and itch. Frowning and turning she saw a little, cute blue haired boy sitting on the table beside her, he was adorable and she smirked when she realised she could fit him in her ice cream tub.<br>\r\n<br>\r\n\"Hi, can you see me? If so then you must be Zero. Allow me to introduce myself properly; Hello I'm Morgan your shoulder angel\" the blue haired boy greets politely, making the mother in Zero coo, he had clearly been raised to be courteous and mannerly. It was then his greeting fully caught up to her and she laughed out loud, laughed until tears dripped down her cheeks<br>\r\n<br>\r\n\"Seriously kid, I'm several thousand years old, considered a sociopath on the earths I'm not considered and psychopath and I quite like killing and eating people, I think it's a little late for a voice in my head saying <i>'I don't think this is a good idea Azula'</i> do you?\" she asks sarcastically, watching Morgan pale and twitch, though that might have been the slight release of her dark magic into the air, mostly to see what happens really<br>\r\n<br>\r\n\"But don't you see, this is why you need a shoulder angel most of all. Plus this is my first case, please just give me a chance, I'm sure I can make your life better really easily if you let me try' Morgan pleads, and Zero clicks her teeth and mandibles as she considers the option.<br>\r\n<br>\r\nWhat's her decision?</span></div></div>",
            "created":1536037200,
            "id":2542883,
            "title":"Eating Ice Cream"
        },
        "121311":{
            "choices":[
                "Zero decides to go do something",
                "Skip to the end of the day when Morgan goes back home"
            ],
            "content":"<div class=\"\"><div> <span>Zero had just about decided to laugh at the kid, place him in her ice cream and then it eat. However there was small voice in her head <i>“Just give the kid a chance. What’s the worst that could happen?</i>” Zero then remembered that even for an apprentice she did cause a lot of problems. On top of that while angels were generally nice if you messed with an angel you could expect the whole family to go after you.<br>\r\n<br>\r\n“Fine, I’ll give you chance.” Zero said innerly cooing when she saw Morgan’s excited look. “Really? Thank you thank you! You won’t regret this!” Morgan said and to Zero’s surprise he jumped up onto Zero’s right shoulder and kissed it? “If you wanted to kiss me there are a lot of other places I would let you kiss.” Zero teased to the small angel who blushed. “No-no it’s not like that. By kissing your shoulder it establishes a connection allowing me to appear on your shoulder whenever I want.” Morgan explained to the apprentice. “So is there anything I should know?” Zero asked wondering how the process would go. “I’ll spend each day with you, I won’t interfere unless if there’s opportunity for you to commit something I deem bad enough that I’d have to talk you out of it. At the end of each week I have to go back to headquarters to give a report on how the week went.” Morgan explained, Zero nodding in understanding. “Where are you going to sleep?” Zero asked already having some ideas in mind of where to keep the young angel. “Oh yes, at 9 P.M everyday I will leave you and I’ll come back each morning.” Morgan answered, “Why is that?” “Well as I am younger than the average shoulder angel my supervisor said that I should sleep at my own home.” Morgan said disappointing the apprentice. “Well what if I want you stay with me at night?” Zero asked with a wicked grin. “W-w-well that would be something I would have to talk to my supervisor about.” Morgan answered biting his lip.<br>\r\n<br>\r\nWhat now?<br>\r\n</span></div></div>",
            "created":1536296400,
            "id":2544424,
            "title":"She decides to let Morgan have a go at angeling"
        },
        "1213111":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Morgan asks for a transfer",
                "Morgan gets to do some more day to day stuff with Zero."
            ],
            "content":"<div class=\"\"><div> <span>(Note: This probably crosses over with something, I just can't remember what, plus it's another reality so who really cares all that much?)<br>\r\n<br>\r\n\"Die already bitch\" Zero has to pull what little self control she has not to roll her eyes as she sidesteps the knife, seriously why did the boss think they needed someone of her calibre to deal with some human idiots, didn't Unohana and Magneto basically get paid for this shit? At least Miranda and Hook did, she never understood where the Boss got his funds and considering how he has casually mentioned working for both HYDRA and the Death Eaters in the past, she probably doesn't want to know, instead focusing on taking off the serpent's head as the metaphor goes.<br>\r\n<br>\r\nDisarming was a technique several apprentices and ascended took rather literally, mostly just because they could, in this case after a bounce that moved her behind her attacker, her long fingers dug into his shoulder joint and ripped the arm with the weapon right off. She then kicked out his stance and wrapped her arms around his neck about ready to snap it....<br>\r\n<br>\r\n\"Stop, don't kill him\" Zero stops and flicks her head around so quick her hair glitches through her shoulder angel, who looked unfazed by the minor inconvenience of solid matter passing through him<br>\r\n<br>\r\n\"What?\" she hisses quietly, her victim a little busy trying to breathe despite her vice like grip so wasn't going to notice her talking to <i>'herself'</i><br>\r\n<br>\r\n\"You've ripped his arm off and beat him up, do you really need to kill him? Isn't that a little much? Can't you just let him off with a warning and a painful reminder not to do this again?\"<br>\r\n<br>\r\nZero actually does roll her eyes this time \"The only thing that stopped me going monster point and chewing my way through this level 1 Magikarp's internal organs was you, the fact you'd be disturbed and I didn't want to spend tomorrow killing the angels that your report send to purge me\" she whispers, then a wide grin appears on her face \"One moment please\" she then pulls the human so both are staring eye to eye \" Hey Diaz. I've thought about trying out a little bit of a Ghostrider battle plan, so any chance you could tell me who you've killed, who's lives you've ruined, that kind of thing?\"<br>\r\n<br>\r\nThe man chuckles and spits in her face, the frown now on her face makes even Morgan grimace<br>\r\n<br>\r\n\" I don't have to kill you quickly you know, I just need you dead. I can rip off all your limbs break your jaw, tear open your guts and feed you your intestines if I wanted to, and if you piss me off. So answer the bloody question\" she orders, grinning when she see's the fear in his eyes before he also smiles<br>\r\n<br>\r\n\" I don't fucking know\" he says with a laugh \" You hear those screams? Smell the burning?\" he asks and Zero wrinkles her nose, having just noticed<br>\r\n<br>\r\n\"Huh, so it is. I've always been more a Cetral than Starling girl and the things I've heard made me think this place was just always a shithole. What's the point?\"<br>\r\n<br>\r\n\"That's all because of me, It was a means to an end and got me to my target but a lot of people are dead, dying or suffering because of me. Was that what you wanted to hear?\"<br>\r\n<br>\r\nZero's eyes flick over to Morgan who looks conflicted, on the one hand he'd be taught killing was very wrong, and as a shoulder angel should argue against killing in anything other than self defense. On the other hand the person here was clearly a very bad person, someone who could become a demon if left unchecked. This was really a seraphim job not a child angel's and even Zero sympathised with him for getting someone like her as his 1st assignment.<br>\r\n<br>\r\n\"And let's not forget the kids..\" even as an angel Morgan didn't see Zero's hand tear his head off and throw it through the reinforced doors she'd phased through like 10 minutes ago<br>\r\n<br>\r\n\"The fuck?\" Morgan swore accidentally, it seemed Zero was rubbing off on him in a bad way<br>\r\n<br>\r\n\"The boss has very few rules, and with the exceptions of like 5 reality types, children are not to be harmed (For the record, worlds like Avatar and Pokémon where the fighters are kids are examples of those exceptions), and only him being on his honeymoon with the new ladies is stopping the Boss himself atomising this bastard if he were to know. I actually did him a favour\" Zero spits before with a click of her fingers produced a royal purple flame at the tips which she drops on the body that erupts into flames as if doused in gasoline.<br>\r\n<br>\r\nThe portal jump back to the EU was silent, though Zero could still feel Morgan's prescience on her shoulder so knew he hadn't left yet. It was then she saw the time \"ah shite, it's 5 to nine. There anything I need to do so you can get home, punch in void gate co-ordinates? Tear open a Garganta?\" she asks with a tilt of her head to the angel who shakes his<br>\r\n<br>\r\n\"No I'm good, I've got a teleporter, it'll bring me straight home\"<br>\r\n<br>\r\nZero blinks but then shrugs \"Okay, then we just need to go onto the balcony, Miri's security system means non terrestrial... if you can call a pocket dimension built by an Eternal being terrestrial... warp tech can't function as a way out. Way in is fine as the other security systems, aka anyone in the castle at the time, make short work of any intruders\" she explains before moving to the balcony at the top of the tower. From there she gently moves him from her shoulder to the railing at which point he removes his clicker and disappears<br>\r\n<br>\r\nTomorrow?</span></div></div>",
            "created":1536382800,
            "id":2545005,
            "title":"Zero decides to go do something"
        },
        "12131111":{
            "choices":[
                "“I’ll see what you can do”",
                "“I’m sorry transfers aren’t allowed”"
            ],
            "content":"<div class=\"\"><div> <span>Morgan was at headquarters, he didn’t bother talking to his family because he didn’t want them asking how his first day was, as he technically witnessed a murder.<br>\r\n<br>\r\nMorgan was at the receptionists desk, there was a blond woman with green eyes. “Oh you must be the new kid, Morgan, right?” “Uh, yeah I know that I’m not supposed to give my report till Sunday but it’s somewhat of an emergency.” Morgan said timidly, the woman smiled “Of course it’s fine” The woman looked down and pressed a button “Hey Matt, Morgan would like to see you, is that okay?” <b>”Sure thing Mallory”</b> “Okay, he’s ready for you.” Mallory said Morgan nodding and going over to the door, thankfully there was a smaller door for Morgan.<br>\r\n<br>\r\n“Hello Morgan, here to give your report?” Matt asked Morgan nodded with a solemn look using a small elevator attached to the desk. “It’s just, I think the person you have assigned me is more suited for a more advanced angel, I was wandering if I could be given a transfer.” “May I ask why exactly?” Matt asked, Morgan explaining what happened yesterday.<br>\r\n<br>\r\nWhat does Matt say?</span></div></div>",
            "created":1536382800,
            "id":2545038,
            "title":"Morgan asks for a transfer"
        },
        "121311112":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Eating",
                "Sleeping"
            ],
            "content":"<div class=\"\"><div> <span>Matt frowns \"I'm sorry but transfers are not allowed unless your charge dies... hold it one moment\" he then turns to his computer and frowns as he clicks<br>\r\n<br>\r\nMorgan tilts his head \"Something wrong?\"<br>\r\n<br>\r\n\"Just got the transfers from Ryuk, some of these people are sick fucks. Hey does the name Diaz sound familiar?\"<br>\r\n<br>\r\n\"Um, I think Zero called that guy she killed Diaz\" Morgan hums<br>\r\n<br>\r\n\"How about cause of death, being the top half of his head separating from the bottom?\" Morgan grimaces but nods, not that he saw anything as one moment there was a smug prick in a headlock and then a body on the ground missing most of his head \"That'll do. I might actually need to thank your crazy charge, this fucker was a bad person, if he had any magic we'd have sent Seraphims after him,\" Morgan remembers Zero's complaints about if she'd torn the man to shreds she'd have then had to kill any angels that were sent after her \"but he's just a normal human so we couldn't do anything about the guy, so the fact Zero put him in Hell is a really good thing\"<br>\r\n<br>\r\nMorgan blinks \"She did something right?\" he asks<br>\r\n<br>\r\nMatt tilts his hand side to side \"Eh, not exactly, just we're not going to have a problem with her anytime soon\" at this Morgan hums \"Now off you go little one, back to work before Zero does something she probably shouldn't\" At this Morgan frowns but nods and runs off to the teleporter<br>\r\n<br>\r\nWhat's Zero doing when he gets there?<br>\r\n<br>\r\n1) Eating, luckily something normal people would eat (So no people then)<br>\r\n2) Sleeping, Morgan appearing on her chest, rising and falling as he waits for her to wake up.</span></div></div>",
            "created":1536469200,
            "id":2545436,
            "title":"“I’m sorry transfers aren’t allowed”"
        },
        "1213111122":{
            "choices":[
                "Zero wants to play",
                "Black Diamond needs help find a small LB"
            ],
            "content":"<div class=\"\"><div> <span>Morgan appeared somewhere soft and squishy, which didn’t make sense as the teleporter was supposed to put him directly on Zero’s shoulder. Morgan then saw why he wasn’t on the apprentice’s shoulder. Zero was sleeping snoring rather quietly contrast to her personality. Morgan realized that his platform was unsteady, rising up and down. Morgan looked down and realized he was on Zero’s chest. Morgan squeaked and fell down landing on Zero’s neck.<br>\r\n<br>\r\nZero made some strangled coughing noises before waking up. “What the-- Oh, mornin’ Morgan.” Zero then yawned, her mouth opening dangerously wide. Zero picked up Morgan and left her room not bothering to get changed.<br>\r\n<br>\r\nZero was in her own small kitchen munching on bacon. Which she stole from Tali, she was getting big enough as is with that kid she adopted twelve years back, that for whatever reason sparked a fire in the ascended for the desire to get bigger. No one really knew why but no one was complaining.<br>\r\n<br>\r\nZero noticed that Morgan was staring longingly at her bacon. “Here have some” Zero said pulling on a small portion of one of her bacon strips. “Thank you, Zero.” Morgan started chewing on the piece. “Sure thing kid.” Zero responded smiling at the small angel.<br>\r\n<br>\r\nWhat now?<br>\r\n</span></div></div>",
            "created":1536555600,
            "id":2545874,
            "title":"Sleeping"
        },
        "12131111222":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Morgan makes a new friend",
                "Zero gets distracted and BD finds LBD."
            ],
            "content":"<div class=\"\"><div> <span>Zero had planned to just laze around for the day, but the hum of the void gate told her something was happening she was probably going to have to deal with. When a tall, bony woman with ebony coloured skin, a black suit, a jewel in her throat, midnight coloured hair and charcoal grey eyes with a diamond pupil walked in Zero began swearing mentally in every language she could and attempted to swear in Poneglyph, but she couldn't pronounce any of that crap so she just had text inside her mind.<br>\r\n<br>\r\n\"Hi 13, what do you want?\" she asks sounding bored in the hopes she'd annoy Tali or better yet 4<br>\r\n<br>\r\n\"13? Are all of you people numbered?\" Morgan asks in confusion, causing the woman to roll her eyes<br>\r\n<br>\r\n\"You know exactly who I am 0, 13...\"<br>\r\n<br>\r\n\"Is the Boss with a pale version of your face, I know BD I'm just having a little fun\" Zero teases, then a moment later both Morgan and her look up at the Diamond and yell \"You can see him/me?\"<br>\r\n<br>\r\nBlack Diamond laughs \"Of course little one, we're all linked her through our lord and master: Demon Lord, and Eternal of Madness Serpens Kaos. Therefore what she can see the rest of us can see\" she explains, Morgan looks confused but nods anyway<br>\r\n<br>\r\n\"So what do you want? Again\"<br>\r\n<br>\r\n\"I need help finding Light Blue Diamond. The little one has disappeared on us and the whole family is worried\" BD explains, and Morgan whimpers worried about the little guy<br>\r\n<br>\r\n\"Where was he last seen?\" Zero asks<br>\r\n<br>\r\n\"On earth with his nephew Steven\" Zero groans, can't she stay off earth for a single day, she keeps having to kill shit there, she's not even allowed to eat them afterwards and that was before she got a child for a moral compass.<br>\r\n<br>\r\n\"You should help her, it's the right thing to do\" Morgan says, doing his thing to BD's amusement and Zero's annoyance<br>\r\n<br>\r\n\"Fine, we'll help, just make sure I don't have to fight anyone, this guy is too young to experience death more than once a year and I already did that yesterday\" Black Diamond nods and leads the woman and angel back to the gate, typing in the location before activating the device, a dark void forming in the centre of the metal/stone ring.<br>\r\n<br>\r\nWhat happens when they land?<br>\r\n<br>\r\n1) With Zero's help they find Light Blue, and Morgan makes himself visible in order to make friends with the lonely gem being<br>\r\n2) Zero being Zero gets distracted, going off on a tangent and BD finds him without them.</span></div></div>",
            "created":1536555600,
            "id":2545954,
            "title":"Black Diamond needs help find a small LB"
        },
        "121311112221":{
            "choices":[
                "Zero and Morgan",
                "Flash Back of LB"
            ],
            "content":"<div class=\"\"><div> <span>Zero landed on a sandy beach, a temple engraved into a mountain. Zero looked over to make sure Morgan was still there, which he thankfully was. \"Okay now lets go find the little one.\" Zero said walking down the beach towards the temple.<br>\r\n<br>\r\n\"Huh, empty\" Zero stated scratching her head before shrugging and leaving the temple.<br>\r\n<br>\r\nNow on the board walk Zero saw an arcade, while normally Zero would of just passed by Morgan spoke up. \"I sense something coming from the arcade.\" Zero looked at Morgan with a look of confusion, Morgan just pointed towards the arcade not saying anything, the apprentice sighed before entering the building. <br>\r\n<br>\r\nSitting in the corner was a boy the same size as Morgan and appeared to the same age as well. \"Who are you?\" The boy had light blue skin and a darker blue hair and diamond shaped pupils. \"I'm Zero, Black Diamond sent me, where's Steven?\" Zero said to the gem. \"He saw Connie and decided to go hang out with her.\" Light Blue sighed, Morgan decided to make himself visible. \"Hi, I'm Morgan.\" The angel said jumping down from Zero's shoulder and walking over to small Diamond. \"I'm Light Blue Diamond\" The boy said standing up and shaking Morgan's hand.<br>\r\n<br>\r\n\"Thank you for finding him\" Zero turned around seeing Black Diamond. \"Hello little one, we were getting worried.\" Black said walking over and picking up the young gem. \"While Light Blue looks young in reality he is around 6,000 years old\". (I did research on the Steven Universe timeline).  Black Diamond then vanishes into thin air. Zero sighs and decides to go back home.<br>\r\n<br>\r\nWhat now</span></div></div>",
            "created":1536642000,
            "id":2546295,
            "title":"Morgan makes a new friend"
        },
        "121312":{
            "choices":[
                "Morgan is released",
                "Something Else"
            ],
            "content":"<div class=\"\"><div> <span>Zero looked down at Morgan with a wicked grin, Morgan shivered with a terrified look on his face. “Like I said before I am happy where I currently am. I don’t need a little kid to whisper in my ear. However, I think you would make a good pet.” Zero said, Morgan’s face turned grim, but before he could do anything her was grabbed and dropped into Zero’s ice cream.<br>\r\n<br>\r\nMorgan’s life flashed before his eyes; more specifically the day he became a shoulder angel.<br>\r\n<br>\r\nMorgan was called to the principal’s office during class. He was currently waiting in the front office to be called in. Morgan heard doors open and he turned around seeing his parents, Robin and Chrom, who unlike Morgan were normal sized. The secretary Miss Candle (Wicke) noticed the arrival of the adults. “Oh good, you are here, Mrs. Aether will see you now.” Robin picked up Morgan and the three walked into the room. <br>\r\n<br>\r\nInside was a tall blond woman with long hair that covered one of her eyes. “Oh hello Mr and Mrs. Exalt I am so pleased that you could make it, please sit down.” The woman said with a pleasant tone, Robin setting Morgan on the desk as she and her husband sat down in chairs.<br>\r\n<br>\r\n“Is Morgan in trouble?” Robin asked even though she knew Morgan was a good kid. “No, no, not at all. As you know the exams were yesterday and we were reviewing Morgan’s scores and were astounded about how well he had done.” Miss Aether explained, Morgan doing a silent sigh of relief.<br>\r\n<br>\r\nThe exams were sort of a combination of an IQ test and a career placement test to see what were the best possible careers for the kids and how well they would be at them.<br>\r\n<br>\r\n“How well did Morgan do?” Chrom asked feeling proud of his youngest child. “I believe Mr. Meese can answer that.” The principal said; there was a poof and a short angel wearing a white T-shirt and white shorts appeared in the room. He had brown hair and brown eyes and was short but if you looked closely he was somewhat muscular. “I am Matthew Meese, I am the head of the shoulder angel department, Morgan here got a perfect score on the shoulder angel section of the exam. So I have decided to offer him to become an official shoulder angel.” The short angel said with a twinkle in his eye. “I accept!” Morgan said without hesitation. “Morgan, sweetie what if you get hurt?” Robin asked with concern. “Not to worry, all shoulder angels are equipped with an emergency button in case if things south. If the button doesn’t work there is a separate button that sends a distress signal to headquarters and we’ll send a team of highly qualified angels to assist.” This seemed to sooth the worries of Morgan’s parents, “Well if Morgan wants to do it and Morgan will be safe I will allow this.” Robin said Chrom agreeing.<br>\r\n<br>\r\nMorgan was pulled out of his flashback. He was somewhere dark, damp, both warm and cold at the same time. Morgan patted his sides to see if he could find the distress signal or the emergency teleporter. They were both gone.<br>\r\n<br>\r\nWhat Now?<br>\r\n</span></div></div>",
            "created":1536210000,
            "id":2543914,
            "title":"She's rather keep him as a pet"
        },
        "1213121":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Zero has him massage her",
                "Morgan meets another being, back from a mission"
            ],
            "content":"<div class=\"\"><div> <span>Zero smiles sweetly as she saunters into her quarters, sitting down on the bed before putting the bowl on her lap and allowing her jaw to split, her mandibles spreading as far as they could allowing the ice cream angel to fall into the bowl with a wet splat.<br>\r\n<br>\r\nMorgan manages to peak out of the gooey ice cream in time to yelp in shock, Zero's cataract white eyes were mildly creepy before but coupled with her painfully stretched skin and a mouth that wouldn't look out of place on a necromorph or Volatile Zombie, he watched, mildly traumatised as the bony mandibles slotted back together and then her skin repaired itself as though she had a human jaw. It was then he realised Zero's eyes were on him the entire time.<br>\r\n<br>\r\n\"Well little one I'm glad to see you have quite a nice taste, once I had time to assimilate your magical aura so it no longer itches my throat. So pet, what can you do besides be a tiny voice in my head or try to circumvent my broken beyond repair moral compass?\" Zero asks, resting her chin on the heel of her hand<br>\r\n<br>\r\nMorgan wriggles then pulls himself out of the ice cream so he can sit on the lip of the bowl \"Um, I can bake, I've been told I have magic hands whaever that means, so I can perform massages. You said I taste good so as long as you don't chew I could be like a sweet treat or something, and I like to cuddle, Mom says I'm the best cuddler she knows and her sister was a BIG cuddler when they were young\" he explains ,Zero smiles and pets him on the head<br>\r\n<br>\r\n\"Well it sounds like I made the right choice for a pet then, so many things we could do little one\" she purrs and bats her eyes, mostly just because it confused the little angel as she picked him up and properly put him on her lap<br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\n1) She decides to start with the massage, having a few years of tension locked up in her thin frame<br>\r\n2) Another Apprentice or Ascended comes back from a mission and comes check on/annoy Zero, getting introduced to Morgan in the process.</span></div></div>",
            "created":1536210000,
            "id":2544001,
            "title":"Morgan is released"
        },
        "12131211":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Time for food",
                "New job, 'nother form of pleasure",
                "More friends, maybe?"
            ],
            "content":"<div class=\"\"><div> <span>Zero's lips curl into a smile, which for the first time in a while wasn't cruel, nor was it followed by bloody violence. Instead what followed was her picking Morgan up and shifting for she was lying on her front, setting the angel on the base of her neck. Resting her chin on her crossed arms Zero finally speaks \"Time to see if your massage skills are as good as you make them sound. I probably have a few centuries of stress and kinks back there so do what you can\" she orders playfully, but Morgan took it as a challenge, especially when with a flick of her wrist her clothes seemed to burn away to nothing, revealing bone white skin, as well as noticeable shoulder blades and even a rib or 2.<br>\r\n<br>\r\n\"You don't eat much do you?\" Morgan mutters mostly to himself but Zero still chuckles<br>\r\n<br>\r\n\"Bitch I eat people\" she growls, then cackles, making Morgan think she was quoting something rather than simply answering his question \"Doesn't change this form. This body is the closest I'll ever come to being human again, it's not even alive, not really and my old skin was warped when I made it fit my new body even compressed\" she sighs deeply, then inhales sharply as Morgan runs his small hands along her spine, feeling the bumps of each vertebrae if he applies even a little pressure.<br>\r\n<br>\r\n\"You are a very strange being\" he says more conversationally than his last comment, which clearly amuses the... whatever she is these days<br>\r\n<br>\r\n\"You don't know the half of it. I'm a template, the name I took is rather literal: As the 1st apprentice, formed by my need to be prefect leading me to gorge on the Bloodrayne and bastardise my form to something beyond human comprehension. I am Subject Zero, or maybe Patient Zero given the number of bodies in my wake due to the Apprentice project itself. I only look human because Lucifer made me a ring to contain and turn my old skin as well as any I rip from my victims into what is best described as a suit, even had Arla Cogan show me how to do it properly before sending her on her way.... and I mean that literally, didn't kill the crazy blond serial killer, she was allowed walk away after helping me with my monster issues\" Zero explains, her story only interrupted by little grunts and hisses while Morgan works<br>\r\n<br>\r\n\"You have a lot less tension than I expected, might be because you think you're dead...\"<br>\r\n<br>\r\n\"I never said that\" Zero defends, leaving out her lack of heartbeat, mostly because the Boss doesn't have one either last anyone checked<br>\r\n<br>\r\n\"But still you are much more relaxed than you seemed to believe. Any idea why?\"<br>\r\n<br>\r\nZero shrugs \"Z and I were  VERY sexually active, when your wife is a hot red head and a witch it makes sense, and I suppose I've always enjoyed causing mayhem and killing things, makes me a monster but I don't really care\" she sighs deeply as Morgan reaches the end of her spine, sitting at the base of her tailbone to take a break.<br>\r\n<br>\r\nWhat now?<br>\r\n<br>\r\n1) Zero decides to feed her little masseur as a reward<br>\r\n2) The pleasure from Morgan's massage has gotten Zero hot and bothered, time to make an angel fall the fun way<br>\r\n3) Zero senses another apprentice, and decides to see if the others can see Morgan too, through their shared link via Kaos. Turns out they can and they find Morgan adorable :D</span></div></div>",
            "created":1545195600,
            "id":2590962,
            "title":"Zero has him massage her"
        },
        "122":{
            "choices":[
                "They are all giants",
                "They are all amazons",
                "Nothing or something else"
            ],
            "content":"<div class=\"\"><div> <span>Today we will tell the story of kingdom of Bux and it's inhabitants, but before we do that here is our starting cast of characters.<br>\r\n<br>\r\nBlack Diamond: The Queen of Bux and eldest of the Diamond family, specializes in dark magic, the most dangerous of her siblings.<br>\r\n<br>\r\nWhite Diamond: The second oldest of the diamond family, specializes in wind magic, the most serious of her siblings.<br>\r\n<br>\r\nYellow Diamond: The middle child of the diamond family, specializes in electric magic, the most aggressive of her siblings.<br>\r\n<br>\r\nPink Diamond: The second youngest of the diamond family, specializes in light magic, the most curious of her siblings.<br>\r\n<br>\r\nLight Blue Diamond: The youngest of the diamond family, specializes in time magic, the most insecure about himself out of his siblings.<br>\r\n<br>\r\nChrom: Captain of the royal gaurd, a bit of a dork but an incredible swordsman.<br>\r\n<br>\r\nRobin: Chrom's wife, a powerful mage and a great tactician.<br>\r\n<br>\r\nMorgan: The son of Chrom and Robin, works part time at a bakery.<br>\r\n<br>\r\nLucina: Morgan's older sister, can be overprotective at times but means well, a great swordswoman.<br>\r\n<br>\r\nGrima: Robin's identical twin sister, she has red eyes as opposed to Robin's hazel, a major fun lover, one of the Queen's adivisors.<br>\r\n<br>\r\nAversa: Robin and Grima's older sister, loves to tease her siblings but is also very protective of them.<br>\r\n<br>\r\nRen: A painter who works part time at the same bakery as Morgan.<br>\r\n<br>\r\nTali: Ren's \"caretaker\" whether or not she's his adoptive mother is for you to decide.<br>\r\n<br>\r\nZero: One of Tali's closest friends, a bit wild.<br>\r\n<br>\r\nLivewire: Another one of Tali's closest friends, a bit quirky.<br>\r\n<br>\r\nChihiro: Livewire's son, incredibly timid.<br>\r\n<br>\r\nCentury: A young musician, his living situation is currently unknown.<br>\r\n<br>\r\nGaius: A former thief who owns the bakery Morgan and Ren work at.<br>\r\n<br>\r\nKiran: A regular at the bakery, a glutton for foods with frosting and icing, Morgan has a crush on her.<br>\r\n<br>\r\nCordelia: Gaius' wife, used to have a crush on Morgan's father.<br>\r\n<br>\r\nSevera: Gaius' and Cordelia's daughter, Morgan and Lucina's mutual friend.<br>\r\n<br>\r\nSully: A member of the royal guard, a tomboy.<br>\r\n<br>\r\nRicken: Sully's husband, was cursed to look like a fourteen year old.<br>\r\n<br>\r\nKjelle: Sully and Ricken's daughter, Is in Lucina's group of friends, training to become a member of the royal guard.<br>\r\n<br>\r\nTharja: A dark mage, Robin's best friend, can be creepy at times.<br>\r\n<br>\r\nHenry: Tharja's husband, also a dark mage, incredibly cheerful.<br>\r\n<br>\r\nNoire: Tharja and Henry's daughter, part of Lucina's friend group, is both an archer and dark mage.<br>\r\n<br>\r\nLoyd: A rookie to the royal guard, incredibly calm and a fan of music.<br>\r\n<br>\r\nMickey: A rookie to the royal guard, loves to fight.<br>\r\n<br>\r\nNow there is something special about the women of the kingdom of Bux but what is it?<br>\r\n</span></div></div>",
            "created":1532322000,
            "id":2523833,
            "title":"The Kingdom of Bux"
        },
        "1221":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Baking!",
                "Mayhem!",
                "Fighting!"
            ],
            "content":"<div class=\"\"><div> <span>Queen Black Diamond grins wickedly as she surveys her territory, her large, purple eyes flash with magic<br>\r\n<br>\r\n'Aunt BD' she turns, surprised to hear a voice in her room<br>\r\n<br>\r\n'Lapis, you're not meant to be in here' Black Diamond chuckles as Blue, Yellow's twin and an experienced water magic user rushes in after her daughter Lapis, oddly enough unlike the other females of the Court of Bux she was the size of a normal human, making her practically a doll to her favourite aunt, or a baby to the Queen's younger siblings<br>\r\n<br>\r\n'Hello my dear, why are you sneaking into my chambers?' the Queen asks<br>\r\n<br>\r\n'Can we have cakes? You said <i><b>'The Sweet Tooth' </b></i>had the best cakes ever, please can we send for some?' the blue skinned princess pleads, big puppy eyes blink up at her obsidian skinned aunt, while her mother prays her sister wasn't having a bad day or she'd be missing out on a few hours of study (Diamonds can't be digested, neither can humans provided they have certain talismans or runic tattoos on their person when they get swallowed)<br>\r\n<br>\r\nBlack Diamond smiles as she picks her niece up and places her on her shoulder 'That sounds like a brilliant plan, I'm glad I thought of it' she says, pausing when Lapis tries to stifle her giggle fit and Blue sighs in relief 'Do you think we should get a cake for Mommy, she has been a bit of a stick in the mud recently?'<br>\r\n<br>\r\nLapis chuckles 'Nope, more cakes for us!' she squeals<br>\r\n<br>\r\nBD gasps 'Just us, none for Pink or Yellow or White or Jazz?' she adds the last just to see the purple blush, in any other kingdom a princess falling for her bodyguard would be scandalous, but in Bux it was just cute, it was also not something Blue knew about or else she'd have had the woman sent to the front line, annoying both Lapis and Yellow as she'd trained the orange skinned axe wielder herself specifically to protect The Family.<br>\r\n<br>\r\n'Cake for Jazz, she has to put up with a lot' Lapis mumbles and both elder royals know she's talking about herself, given the size difference between herself and the other women in the kingdom Lapis liked to explore and Royal Guardian Jasper could at one time have often be seen running after the annoyingly bouncy water elemental or else frantically searching for her, with her wild grey hair slicked back due to nervous sweat. It had gotten a lot calmer these days, mostly because the woman had taken to shoving Lapis in her cleavage when she got energetic, which oddly enough made her think of Pink and Pearl, seriously if they were any other country they'd be a disgrace to nobility with all the staff screwing.<br>\r\n<br>\r\n'Okay then, I'll send someone to collect some cakes fit for the most important people... and Blue' she teases, getting chuckles from Lapis and an eye roll from Blue, as well as a weak water whip which bounced of Black's barrier spell. The Queen to a nation of millions, sticks her forked tongue out and laughs before walking out the door, luckily Blue was the calmest of her sibling, and was used to Black's random nature and possible insanity,<br>\r\n<br>\r\nWhere to next?<br>\r\n<br>\r\nThe bakery, where Morgan and Ren have to make a selection of treats not just for the customers in the mixed size bakery, but also fulfil the royal request<br>\r\nThe court, where Black Diamonds loyal advisors... argue like children and tell jokes like they're all still in their teens. God how is this kingdom functioning? Oh yeah magic.<br>\r\nThe barracks, Yellow's own personal kingdom, and the day to day lives of such hard workers as Kjelle, Lloyd, and Luicna, and such loons as Pyro (rookie royal guard member, as expected a fire magic specialist) and Micky</span></div></div>",
            "created":1532494800,
            "id":2524672,
            "title":"The kingdom of Bux, a Female Elbaf"
        },
        "12211":{
            "choices":[
                "Follow light Blue",
                "Follow Morgan and/or Ren"
            ],
            "content":"<div class=\"\"><div> <span>Ren and Morgan were currently at the bakery with the assistance of Light Blue. Now you might be thinking wouldn’t he get noticed as he is the prince of Bux.  But considering the fact almost all of the women of Bux were giants he was often overlooked, most people not knowing what he looked like or even knew there was a prince of Bux.<br>\r\n<br>\r\nRight now they were crazy busy because of an order from the queen, which was delivered by some regular servant guy. <br>\r\n<br>\r\n“I blame Lapis for this”Light Blue mumbled, while it was easier to do this with his time magic speeding up his movement speed.<br>\r\n<br>\r\nOnce everything came out of the oven they were all the exhausted. “Light Blue, if White knew you helped out around here she wouldn’t be happy. Light Blue looked up saw Black with Lapis onher shoulder. “Don’t worry I’ll help.” Black Diamond said grabbing her brother and eating him before grabbing her the cakes and leaving.<br>\r\n<br>\r\nWhat happens next</span></div></div>",
            "created":1532667600,
            "id":2525603,
            "title":"Baking!"
        },
        "122112":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "The treat is done, Kiran leaves with it",
                "There's an extra surprise for her, as Morgan falls into the cake"
            ],
            "content":"<div class=\"\"><div> <span>Morgan pouts as the giantess leaves with the youngest diamond 'Well there goes a good portion of our workforce, and at rush hour too'<br>\r\n<br>\r\nRen sighs in agreement 'I know, makes me wish you're cousin Century was allowed leave the castle'<br>\r\n<br>\r\n'Yeah, but after Uncle Sans died Aversa got really overprotective of Century. I think some days he doesn't see the world outside her cleavage, a feeling I'm sure you're used to' Morgan teases<br>\r\n<br>\r\n'Hey!' Ren squeaks, flicking flower at Morgan<br>\r\n<br>\r\n'It's true though, if Tali had her way those big purple boobies of hers would be the only thing you ever saw, not at anyone would complain'<br>\r\n<br>\r\n'Dude! She's my mom, I don't need to be reminded she's really hot' Ren hisses with a ruby red blush, Tali having found him abandoned as a 3 year old in the street and raised him as her own, and given her size and body type Ren spent a lot of time curled up against her bouncy bust and massive rear as her grew.<br>\r\n<br>\r\n'I know, but not by blood. Anyway we have another customer looking for treats' Morgan says, heading to the order station while Ren barrels to the main baking area. When it got there Morgan felt a little tongue tied, their next customer was Kiran, a young-ish Maleficarum that Morgan had a really deep crush on, but never even tried to act on due to not thinking the girl would want someone like him, that and he's sure his overprotective sister would scare the kind dragon-woman away<br>\r\n<br>\r\n'Oh hey Morgan' the woman greets with the voice of an angel (or at least in Morgan's opinion it was) 'I was wondering if I could have a Mystic special, to go?' she asks and Morgan fights a blush: the mystic special was a treat that had an enchantment added during the process to enhance the eater's assets, and while Morgan liked her the way she was, Kiran was rather flat for her species.<br>\r\n<br>\r\n'Um sure, will you be paying in beri or rupees today?' he asks, due to the large port and closeness to an island chain all businesses had the prices in the local rupee as well as the island currency of the beri<br>\r\n<br>\r\n'240 beri, exact' Kiran smiles widely as she passes the money over, Morgan nods before dropping it into the hole sending it into the register for sorting later by Gaius<br>\r\n<br>\r\n'Okay, it should take about 10-15 minutes Kiran, if you don't mind waiting' Morgan explains before running to get to Ren<br>\r\n<br>\r\n'Ren! 1 mystic special to go for Kiran' he yells, to which the other boy smirks<br>\r\n<br>\r\n'Oh, you're girlfriend is trying to make herself bigger to catch your eye then' he teases, glad to get a chance to strike back at his friend<br>\r\n<br>\r\n'She's not my girlfriend and what she does is her decision' Morgan argues back, Ren rolls his eyes but the 2 get to work quickly<br>\r\n<br>\r\nWhat now?</span></div></div>",
            "created":1532667600,
            "id":2525618,
            "title":"Bakery life"
        },
        "1221121":{
            "choices":[
                "A Drunk Kiran Stumbles into the neighborhood (Oh boy)",
                "Zero plays keep away with Tali, using Ren "
            ],
            "content":"<div class=\"\"><div> <span>Once the treat was finished, Ren ringed a bell dragging Morgan out of his daydreams while he was staring at an oblivious Kiran. \"Morgan I can't move this thing myself.\" Ren said Morgan holding up a finger to Kiran. \"Just a second\" Morgan walked up to the cake and touched it focusing his magic into it before it floated into Kiran's arms. \"Thanks Morgan, thanks Ren, I'll see you later!\" Kiran called before leaving the building.<br>\r\n<br>\r\nOnce rush hour was over Gaius sent the boys homes. \"I wander what Light Blue's doing right now?\" Ren asked, \"No clue, maybe sharing some cake with his sisters?\" Morgan suggested before the boys entered the neighborhood they lived in, passing by several giant women who were too busy with their own thing to notice the boys. \"Have you ever wondered why is it the women in Bux tend to be giants, I did research on other countries but none of them of have giants who don't have buxan blood in them.\" Ren said to his blue haired friend. \"Hmm, I don't really think about those kinds of things as its not really important, I just accept the things that happen in my life and carry on.\" Morgan said as he saw his house in view. \"I'll see you tomorrow Ren\" Morgan waved before entering the house which had a portal to the castle.<br>\r\n<br>\r\nWhat happens now?</span></div></div>",
            "created":1532667600,
            "id":2525653,
            "title":"The treat is done, Kiran leaves with it"
        },
        "1221122":{
            "choices":[
                "Ren's Origin Story",
                "Go t "
            ],
            "content":"<div class=\"\"><div> <span>During the process of the cake being made Morgan fell in and was taken away by an unaware Kiran. Ren not doing anything as he knew that Morgan would be fine because of his magic birthmarks. As well Kiran was Morgan's next door neighbor. <br>\r\n<br>\r\nRen made his way home, he knew that his Mom would be back from doing Yoga with some of friends.<br>\r\n<br>\r\nRen opened the door and went inside and saw his mom was lounging on the couch. Tali was quite pudgy as she kept on eating the treats Ren made, and while Ren didn't take pleasure in fattening up women like Morgan, he did enjoy making gis Mom happy.<br>\r\n<br>\r\n\"Hi Renny\" Tali said lowering her arm to grab Ren. \"Hey Mom, since the day you found me is coming up, can you tell me the story of how you got me again?\" Ren asked, \"Of course baby\"<br>\r\n<br>\r\nwhat now?</span></div></div>",
            "created":1533618000,
            "id":2530430,
            "title":"Sorry For this being Short"
        },
        "12212":{
            "choices":[
                "With one of his sisters",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>While Black and Lapis went to go get cakes (which may or may not of been accidentally enchanted), the youngest of the diamond family Light Blue (Lght Blue was twelve while Lapis was only a year older, a fact she liked to mention a lot) was doing his own thing watching Black’s advisors discuss stuff, more like them behaving like goofballs.<br>\r\n<br>\r\nLight Blue was perched upon a wooden beam (like the ones you see on cabins that keep the ceiling up) secretly watching the council. He tried to stay silent as the meetings were supposed to be very inclusive.<br>\r\n<br>\r\n“Grima we can’t simply blow up bandits!” White was saying to her fellow advisor, why black chose Grima over Robin or even Aversa was a mystery. “Comeone it’s the simplest thing thing we can do, right Sans?” Grima looking over to the mage one the table....who fell asleep. “Sans wake up before I go your house and spit on your brother.” Grima yelled waking the white haired mage. “I agree with whatever Grima says.” Sans said before flopping over. White sighing pinching her nose. <br>\r\n<br>\r\n“I recommend we stop trading with Hyrule.” CIA said getting a groan from everyone else. “Stop flip flopping, first you don’t want link to marry princess Zelda but now that she dumped him you get all hissy, make up your mind.” Grima said<br>\r\n<br>\r\nThe meeting continued on for hours Light Blue eventually fell asleep. When he wakes up where is he?</span></div></div>",
            "created":1535432400,
            "id":2540180,
            "title":"It’s sort of like watching a sitcom!!"
        },
        "122121":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Light Blue spends the day with his sisters",
                "He goes out with his friends Morgan and Ren."
            ],
            "content":"<div class=\"\"><div> <span>\"Hello little bud\" LB's eyes fly open when he hears the smoky purr of his eldest sister, seeing her grinning face just inches from his own. He yelps and flails, only then realising he was lying on her bed \"What the...\"<br>\r\n<br>\r\nBlack smirks \"You fell asleep and fell off the beam... landing on my lap. So I decided the best response to that was to take you to bed with me\" she chuckles when light blue pales and tries to run off \"Hold it little one, you're going to be my cuddle bug tonight\" grabbing Light blue then holding to her chest, at that moment the bluenette realising they were both in their sleepwear.<br>\r\n<br>\r\n\"Um no thanks BD, I'll just go to mt bed\" LB says, trying to squirm his way out of her grip but failing, allowing her to squeeze him closer to her chest as she pulls back the sheets and slides back in, shifting her position so that Light Blue was held like a teddy bear, the prince sighs and just goes with it as she clearly wasn't going to let go of him. Closing his eyes Light Blue nuzzles into Black and quickly falls asleep.<br>\r\n<br>\r\nThe next morning<br>\r\n<br>\r\n\"Hey sleepyhead\" Black coos as Light Blue snores lighting into her chest, only waking up at that very moment<br>\r\n<br>\r\n\"Um hey sis, why are you in my bed?\" LB asks sleepily, to which Black laughs<br>\r\n<br>\r\n\"Silly muppet, you're in my bed because you snuck into the meeting and fell asleep into my lap. Now it's time for breakfast, so let's go\"  She pushes herself out of bed and carrys a still squirming LB to the dining room, where Yellow, White, Blue and Lapis were already sitting \"Hi guys\"<br>\r\n<br>\r\n\"Hey Black, Light Blue\" they greeted as Black put him down so they could finally eat<br>\r\n<br>\r\nWhat is Light Blue going to do today?</span></div></div>",
            "created":1536642000,
            "id":2546468,
            "title":"With one of his sisters"
        },
        "1221211":{
            "choices":[
                "To spend one on one time with LB",
                "To the barracks"
            ],
            "content":"<div class=\"\"><div> <span>“I don’t see why you are so hung up on not having a role.” Black said to Light Blue as they were having breakfast with their other sisters. “Well everyone else has a role, Yellow handles the royal guard, White is your second in command and the treasurer. Blue and Pink are diplomats, Blue being the ambassador” (An ambassador is apparently the highest ranking diplomat.). Light Blue sighed as he continued eating his breakfast. <br>\r\n<br>\r\n“You’re good at cuddling.” Pink pointed out, Light Blue made a choking sound before blushing. “As nice as cuddling is, there isn’t really a position I can give to Light Blue for cuddling.” Black said eyeing her younger brother to make sure he’s okay. “Just so you know Light Blue, just because you don’t have a role it doesn’t mean we don’t respect and love you, isn’t that right Yellow?” Black said looking over to her younger sister. “What are you talking about I do love and respect the kid.” Yellow said getting aggravated. “Prove it by spending the day with him and Light Blue will give me a report.” Black said with a small smile. “I will!” Yellow yelled grabbing Light Blue and storming off.<br>\r\n<br>\r\nWhere does Yellow go</span></div></div>",
            "created":1536728400,
            "id":2546802,
            "title":"Light Blue spends the day with his sisters"
        },
        "12212111":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Stealth training",
                "Shared love of sweets"
            ],
            "content":"<div class=\"\"><div> <span>Yellow grumbles to herself as she treks through the castle, wondering what the Hell she was supposed to do with the little one? She couldn't even think of a single thing they had in common: she liked to fight, LB was a bit of a pacifist, she was massive and he was teenie, she was a grown woman who liked to drink herself to sleep once a month with Grima, Cia and Kaos, while her brother was still a child.<br>\r\n<br>\r\n\"We don't have anything in common, how are we supposed to do anything together\" Light Blue states from her shoulder, surprising the woman she didn't think the kid was so perceptive so soon, maybe Grima's joke about a spy network of minizora would work, which made her think training LB to be a spymaster would serve a dual function, give them something to bond over and give Light Blue a role.<br>\r\n<br>\r\n\"That's not true, I don't have anything in common with Black either, plus I'm pretty sure she's not mentally sound, also I discovered that you can neither organise a coup nor have someone abstain due to being completely insane. The more you know I guess\" Yellow shrugs and Light Blue actually smiles, it seems to be a running gag that the people in power seem to have a noticeable lack of sanity throughout the history of Bux, so did a sweet tooth it would appear.<br>\r\n<br>\r\nThat thought put an idea in her head, they could go over to the bakery, eat some delicious cakes and try talk about their week, let them see how the other spent their day.<br>\r\n<br>\r\nSo what could they do?</span></div></div>",
            "created":1536728400,
            "id":2546907,
            "title":"To spend one on one time with LB"
        },
        "122121111":{
            "choices":[
                "He can't grow back",
                "He grows back (you can decide if there is a side affect or not)"
            ],
            "content":"<div class=\"\"><div> <span>Yellow thought about it and realized that the dessert thing was something that all of the siblings had in common. As well Yellow realized she did have something in common: both were merciless fighters (well of course during training they didn’t kill anyone but other than that they didn’t hold back). Yellow thought it would be best to try and get Light Blue to become a spymaster. <br>\r\n<br>\r\n“You know, Light Blue I think I have an idea of getting you a role.” Yellow said watching LB’s interest peak. “What is it, what is it?” Light Blue asked excitedly. “How would you feel about being a spymaster?” Light Blue tilted his head. “Well, it sounds neat but Bux is the only kingdom that has more giants then normal sized people” (as in they have more women of course but the ratio of men to women was very close but compared to other countries their giant to normal ratio was at least 20 times higher). “I have heard from Grima that Tharja’s potion shop does have several interesting things, maybe we could find a potion that allows you to shrink and grow back so that the training I give you would still apply. On top of that your time magic would be useful even when you are normal sized” Yellow points out. Light Blue contemplated before speaking “I’ll do it!” Getting a smile from his sister.<br>\r\n<br>\r\n“Well out of all the siblings I never thought I’d see the ‘Titan of Lightning’ in my shop.” Tharja mused with a dry tone, as Yellow walked up to the counter. “Hi princess, hi Light Blue” Yellow looked down seeing Morgan on the counter. “I’m looking for a potion.” Yellow said, setting the prince by Morgan. “My, oh my, if it isn’t the ‘Time Magician’ Tharja said with a creepy smile. Yellow slams her hand on the table, causing the blunettes to fall over. “I said I’m looking for a potion.” Yellow growled, Tharja chuckling as she turned around facing a large shelf filled with potions. “I heard you, everyone who comes here wants a potion, what kind of potion do you want, something to give you big muscles, a potion that allows you to consume larger quantities of alcohol without getting a hangover?” Tharja asked with a sly grin. “I need a potion that allows the person who drinks it to shrink and grow back to normal size.” Yellow says surprising Tharja but thankfully for her she was facing the opposite direction so no one saw her reaction. <br>\r\n<br>\r\n“I do believe that I have the potion in stock, 175 coins.” Tharja said, the sound of money being placed on the counter being music to her ears. Tharja grabbed a small bottle (well small to her, it would be the size of those science bottles with round bottoms) with her fingernails and placed it by Light Blue. “How do I know that it works?” Yellow asked with suspicion, Tharja sighs before shrinking down to twice Morgan height. Somehow standing on the counter. Tharja then grabs Morgan and hugs him to her chest. “You see it works, right Morgan?” Tharja asks teasingly pressing Morgan closer to her. “Anything I should know about the potion before I leave you to do who knows what to Morgan, who by the way is the son of the captain of the guard.” Yellow asks, while she thought that Chrom was too much of a pansy (AKA nice) she did respect him and thought of him as a good friend (Yellow is the general, Chrom is the captain of the guard). “Yeah, once someone drinks it, while they will be able to manipulate their size right away it would be best to wait three hours before doing so or it will cause some unintended side effects.” Tharja said still not releasing her grip on Morgan. Yellow motions for Light Blue to grab the potion before grabbing him and leaving.<br>\r\n<br>\r\nYellow and Light Blue were in the meeting room. “Okay drink the potion and we’ll start the training. Light Blue nods before drinking the potion, which tasted like a combination of honey and cinnamon. “Now while I don’t specialize in stealth, my idea is that I close my eyes and I’ll count to a 200 like in a game of hide and seek. Your job is to sneak out of the room without getting caught, I set up a bell outside which you’ll ring.” Yellow explains before closing her eyes, her younger brother going off to hide.<br>\r\n<br>\r\nWhen Yellow stopped counting she searched the entire room and kept a vigilant eye searching for her brother. Two hours later, she heard the bell ring. She left the room and saw LB. “Good job kid, now let’s get some grub.” Yellow said with a proud grin before grabbing LB and shoving him down her shirt.<br>\r\n<br>\r\nYellow walked into her favorite tavern “Hell and Heaven” (The naming behind is because there has been an equal amount of deaths and marriage proposals that took place at the tavern, that number is currently 35) At the counter was Yellow’s favorite person who worked there: Tifa Lockhart. (Note: I have never played a Final Fantasy game, I watched a death battle that had Tifa in it and I remember it said she worked at a bar.) “The usual” Yellow said placing the money on the counter and going over to a private booth (By private it just means there was a fancy curtain that blocked it off from the other booths.) Yellow sat down and took LB out of her shirt and placed him in front of her. Coincidentally Tifa opened up the curtain and set down a large steak and a large mug of mead. “Thanks Tifa” Yellow says, the woman nodding before leaving and shutting the curtain.  Yellow cut up the meat allowing to Light Blue to take some, her brother deciding not to mention her preferred chicken over beef. Yellow ate some of her steak before downing her mug and slamming it on the table. “Has it been three hours yet?” Yellow asked, with a tint of red on her face, impatiently wanting her brother to test out the potion. “I don’t think so, I think I’m pretty sure I have twenty minutes left. “Test it out now, you’re a Diamond, nothing is going to go wrong. “Okay, sis, whatever you say.” Light Blue concentrated before he shrunk to only a couple of inches tall. “Nice, now change back” Yellow says with a wide grin. <br>\r\n<br>\r\nLight Blue takes a deep breath before concentrating once more.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1536814800,
            "id":2547268,
            "title":"Stealth training"
        },
        "122121112":{
            "choices":[
                "Her stomach and rear expands, her skin becomes extremely sensitive",
                "Her stomach and chest expands, she's starting crave some alcohol "
            ],
            "content":"<div class=\"\"><div> <span>\"Maybe we could go over to the bakery?\" Yellow asked Light Blue's eyes sparkled. \"That's a good idea Yellow!\" LB  said with a smile, Yellow walking off.<br>\r\n<br>\r\nAt bakery LB and Yellow were greeted by some workers at the bakery (Morgan and Ren only work part time after all). \"I'd like one everything.\" Yellow sets down a large bag filled with money. Now normally the workers would of warned Yellow about how mixing all of those sweets (a good amount of them were enchanted) could cause some unwanted side affects, however they were distracted by the immense amounts of money.<br>\r\n<br>\r\nThe siblings were in Yellow's room, on her bed, Yellow munching on all of the stuff meant for women (remember all of the women in Bux except Lapis, Lissa and some others are giants) \"So I have been hanging out with Ren, Morgan, Chihiro and Century; we sometimes practice a little bit of fencing but we just do that in case of emergencies.\" Light Blue said secretly enjoying watching his sister eat and while its not often that he sees Yellow drunk/drinking he oddly enough gets some weird pleasure for it. \"It's good that you do recognize the possibility of where you'd have to fight yourself. Yellow says before shoving another treat in her mouth. She swallows and then starts groaning, she then falls laying on her back on the bed. \"Yellow!\" Light Blue cries out concerned climbing over trying to get to her face but when he's at her stomach things start to change.<br>\r\n<br>\r\nWhat happens?</span></div></div>",
            "created":1536728400,
            "id":2546910,
            "title":"Shared love of sweets"
        },
        "1221211121":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "She has him give her a massage",
                "She uses him as a seat cushion instead"
            ],
            "content":"<div class=\"\"><div> <span>When Light Blue reached her stomach it grumbled and shook, LB dropping to his knees as it began to inflate like a balloon, even when it stopped expanding he continued to rise as her ass cheeks each grew to the size of a small watermelon \"Yellow?\" Light Blue calls as all he hears is her shallow breath, rubbing her stomach and surprised when a loud, guttural moan escaped from beneath him, before Yellow's hand pins him to her belly, then rubbed him across her skin<br>\r\n<br>\r\n\"So good\" Yellow purrs, slowly sitting up and moving LB from her belly to her chest as she hugged him \"You feel really good against my skin, so little and cuddly\" she coos and grins worrying LB who squirms and tries to escape<br>\r\n<br>\r\n\"Yellow you're not acting like yourself, it's the cakes I think you ate a weird mix of enchantments and your brain is trying to catch up with itself\"<br>\r\n<br>\r\nThe princess scoffs \"I'm not some weak willed idiot I could handle enchanted cakes in my teens given how much of a freak Black was back then so what's the difference now, plus we finally have something to do together\" she smiles before tightening her grip pulling LB into a firm embrace \"You make such a lovely cuddle buddy, I can see why Blue loves to hug you, it makes me feel so very warm inside\" she gently rocks him, humming as he rubs against her body, until she yelps and releases, causing LB to fall into her lap coughing heavily \"You bit me\" Yellow growls<br>\r\n<br>\r\n\"Yes, well you were suffocating me\" LB replies, sounding uncomfortable as he sat up<br>\r\n<br>\r\nYellow frowns \"Fine, I guess you have a point, but I still think we can have fun together\" her evil grin made Light Blue worry, but better a sneaky Yellow than an angry one.<br>\r\n<br>\r\nWhat's her idea?</span></div></div>",
            "created":1536814800,
            "id":2547295,
            "title":"Cuddler"
        },
        "12212111211":{
            "choices":[
                "\"More treats\" (Big Yellow is about to get bigger)",
                "\"You\" (They both enjoy it; a LOT!)"
            ],
            "content":"<div class=\"\"><div> <span>Out of all of his sisters Yellow was the one Light Blue was most afraid. Most people were afraid of Black for several very good reasons. However for Light Blue, Black never showed any sign of wanting to harm him. In fact when Light Blue was four he was kidnapped by a group of female Buxans (That is what the people of Bux were called) who believed the Diamond family didn’t deserve to rule the kingdom. Rather than send out members of the royal guard (oddly enough this was the year Chrom was appointed, just a disclaimer, Chrom is the captain of the royal guard, Yellow is head of the military and does have control the Guard,) Black took care of it herself, she stormed their base and only two people left that building alive, Black and Light Blue. For two weeks Black didn’t let Light Blue leave her sight. The point was while Black was scarier when she was angry Yellow was more likely to get angry.<br>\r\n<br>\r\nBack to what was currently happening Yellow smiled a wicked grin as she picked up Light Blue as she laid down. She gently placed the youngest diamond upon her stomach. “I would like you to massage my stomach.” Yellow purred, Light Blue closed his mouth to prevent any form of weakness from showing. However he couldn’t help protesting. “T-t-that’s more of Morgan’s thing, I’m just the youngest prince who isn’t good at anything.” Light Blue stuttered trying to throw Yellow off. Yellow pet Light Blue’s head with her index finger. “Oh don’t be silly, Black told me all about Morgan’s classes.” Light Blue was nervous.<br>\r\n<br>\r\nA couple of months ago for whatever reason Morgan convinced his friends to take a class taught by him about how to massage. It only lasted a week and they practiced on dummies (they were very life like  thought) and on the last day was a test, which was to demonstrate what they learned on an actual person. Black was the person Light Blue was assigned to. That happened because, Grima was the person Morgan used when he gave demonstrations during class. Apparently Grima told Black about it. Everyone passed the test, except Chihiro but that’s only because he passed out before he even began. Black said that she wouldn’t tell the others. Apparently that wasn’t the case.<br>\r\n<br>\r\nKnowing resistance was futile the Prince knelt down and began to work. Light Blue he wasn’t as good as Morgan, but according Yellow’s noises he was doing a good job. Light Blue would admit that Yellow’s skin was soft. Light Blue would’ve enjoyed his sister’s affection earlier if she didn’t suffocate him. Light Blue looked over and saw Yellow’s arms stretched out behind her and her tongue lolling. Light Blue smiled and and continued his ministrations. Yellow’s stomach growled loudly causing the young diamond to fall over. Yellow sat up and licked her lips looking at her brother. “I’m hungry, dear Little blue. Do you know what I’m hungry for?” Yellow asked talking slowly, Light Blue shook his head. “Well, right now I really want to eat…”<br>\r\n</span></div></div>",
            "created":1537765200,
            "id":2553029,
            "title":"Jeg Elsker Stor Gul"
        },
        "122121112111":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "got really sensative and require a delicate touch to releive ( cough LB cough)",
                "begin to lactate, dribling down her hill like chest"
            ],
            "content":"<div class=\"\"><div> <span>\"More sweets\" the larger woman cheers, pulling out another cake and shoving it in her mouth LB glad it was a normal treat as the only magical sense he got was a rune of preservation glazed into the bottom of the sweet not that it needed it around the Diamond family as anything from that bakery lasted 2 days at most, rather than the month the charm/rune was meant to enable. He was surprised when she offered the end of another normal one to him, which was about the size of his head but he could see she was trying so accepted and began to munch, surprised she managed to find a vanilla cake to share with him, though given the look she gave him as was intentional, which made him smile a little wider.<br>\r\n<br>\r\n\"So are you okay Yellow?\" he asks, worried about the effect the more actively enchanted sweets had on his sister, not really expecting the woman to answer though as she was always the least approachable, well 2nd as White could be quite alouf at times, Yellow was just... Black called it prickly, Jasper called it being a cunt when the woman wasn't within earshot, a statement mirrored by Grima regardless of where the General was at the time.<br>\r\n<br>\r\n\"Don't worry squirt I'm fine, I would never be beaten by cake, that would be a shitty way to go\" she chuckles before pulling out an éclair and Light Blue tenses, seeing the spiral aura of a very familiar enchantment and waited for the inevitable.<br>\r\n<br>\r\nHe didn't have to wait long as Yellow let out a pained hiss followed by pawing at her shirt, which didn't exactly last very long against her rapidly swelling breasts. Light Blue looked away and covered his ears but could still hear the mix of pained groans and passionate grunts and moans, till all that came from her was shallow breaths.<br>\r\n<br>\r\n\"Is it safe to look?\" he asks after giving her a minute to calm herself<br>\r\n<br>\r\n\"Of course cutie\" Yellow coos, ruffling his hair with her finger, \"In fact there's something you could help me with right about now\"<br>\r\n<br>\r\nLight Blue grimaces before turning around, what could possibly have happened now? It turned out Yellow's breasts had not just ballooned but also...</span></div></div>",
            "created":1537765200,
            "id":2553114,
            "title":"Milseáin"
        },
        "1221211121111":{
            "choices":[
                "Snoring, Yellow had fallen asleep",
                "Stomach Growling, Yellow's hungry, again"
            ],
            "content":"<div class=\"\"><div> <span>Light Blue saw that Yellow's chest hadn't changed other than the fact they were larger. \"What's the problem Yellow?\" Light Blue asked softly, \"Well, you see my chest as become extra sensitive, more sensitive than the other parts of my body, and I think I need you to help out.\" Yellow said grabbing the small prince and laying down. She set Light Blue onto her chest. \"Get to work, Little Blue, don't disappoint me.\"<br>\r\n<br>\r\nLight Blue started rubbing, gently, slowly. However this still made Yellow moan. He didn't know how to handle this. If he kept working on Yellow she'd keep him as a pleasure slave, if he tried to run away Yellow would get angry. Light Blue then realized something from Morgan's class might actually be useful here. <b>\"The Overload\"</b> Morgan told the class that this technique was only for emergencies or if you were married (How Morgan knew that besides emergencies you should only use it when married was beyond Light Blue). This was an emergency<br>\r\n<br>\r\nLight Blue increased his rubbing speed, squishing, squeezing, licking, kissing. Light Blue did all of this all over Yellow's chest hoping that she would pass out. Light Blue blushed as he heard Yellow's animalistic moans. He continued nonetheless.<br>\r\n<br>\r\nAfter an unknown amount of time, Light Blue lost the energy and slumped, he then was shaken by a loud noise.<br>\r\n<br>\r\nWhat was it?</span></div></div>",
            "created":1537938000,
            "id":2554605,
            "title":"Delicate Touch"
        },
        "12212111211111":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "LB spends time with his friends",
                "Another sister wants their Light Blue time."
            ],
            "content":"<div class=\"\"><div> <span>Despite the pain to his eardrums, Yellow's chainsaw impression meant the woman had passed out, not that anyone but Black could tell her about her little habit as <i>'a princess doesn't snore'</i> they apparently don't fart either but Light Blue didn't have any reason to disprove that and wasn't brave enough to bring up the snoring to Yellow so just took it for what it was, a reprieve.<br>\r\n<br>\r\nGiven his body was protesting any movement Light Blue decided the best plan was to just let go of her and slide into her cleavage, with the magical sweets her bosom were actually softer and plumper than his own bed. Smiling despite himself Light Blue cuddles up and his exhaustion causes him to pass out. As Yellow sleeps she rolls over, pinning LB in her deep cleavage and continues to snooze.<br>\r\n<br>\r\nWhen morning came Yellow groans and sits up, running her hand through her hair she tries to put the thoughts back together from the day before... at which point she feels something wriggle between her breasts 'Hm?' she reaches into her cleavage, pulling out a still sleeping LB and cooing sweetly 'You're so cute when you sleep, less annoying too' she thinks smiling almost sweetly<br>\r\n<br>\r\nLB grunts and rolls over, seeing Yellow smile over him \"Yahhhh!\" he screams, wriggling until her fingers clench around him<br>\r\n<br>\r\n\"Stop it, relax little one\" Yellow hisses, and the prince does, but still looks twitchy \"Hey LB, thanks for the day, it was actually kind of nice\" she says almost begrudgingly, but Light Blue can see she was fighting a smile \"Well better bring you back to bed so nobody knows you stayed with me tonight\" she shushes him and quickly sneaks from her room to his, leaving him on the bed and getting back to her room before anyone noticed.<br>\r\n<br>\r\nWhat is Light Blue's plan for the day?</span></div></div>",
            "created":1538110800,
            "id":2555849,
            "title":"Snoring, Yellow had fallen asleep"
        },
        "122121112111111":{
            "choices":[
                "Yellow",
                "Jasper",
                "White"
            ],
            "content":"<div class=\"\"><div> <span>\"So I was wondering what exactly is your dads job.\" Ren asked Century, as they were laying on the grass and looking at clouds at one Bux's parks (I have no idea when this takes place but magic is my excuse). \"You know what, I'm not entirely sure, I tried asking Mom and Dad about it but they seem pretty hush hush about it besides the fact they say he is a judge.\" Century says shrugging \"Do you know anything Blue?\" Century asked the prince, \"I tried asking Black but she said it's nothing to worry about and that he's doing a good job. \"That all seems pretty suspicious if you ask me, as long as no ones starting any wars its not necessarily my problem.\" Chihiro says before yawning. \"I once asked my dad how Yellow decided to make him the captain and all he said was he had to fight to someone. I tried asking who he had to fight and all he answered was that it was another man. I have seen Uncle Sans' magic but I still don't understand what it has to do with his job.\" Morgan states before getting up, the other boys getting up as well. <br>\r\n<br>\r\nAfter playing a variety of games including tag, frisbe and something Century called \"Ultra Tag\" which almost resulted in the destruction of the park.<br>\r\n<br>\r\nExhausted Light Blue made his way to his room. \"And where do you think you're going\" Light Blue heard a female voice say and he turns around and sees...</span></div></div>",
            "created":1538974800,
            "id":2561222,
            "title":"LB spends time with his friends"
        },
        "1221211121112":{
            "choices":[
                "Yellow's Gluttony",
                "Light Blue's Gamble"
            ],
            "content":"<div class=\"\"><div> <span>Light Blue's eyes widened as he saw milk start come out from his sister's chest. Thankfully it was just slowly trickling out rather than just gushing out like a waterfall. \"I'll go get you a towel Yellow,\" Light Blue assures, turning around once more before being grabbed and press up against Yellow's chest. \"That'll take too long little bud, you'll have to clean this up.\" Yellow says with a faux sweet smile. Light Blue sighs \"Okay, I'll clean it up.\" \"Delightful, thank you for being so cooperative.\" Yellow says, depositing the smaller royal on her milk filled chest.<br>\r\n<br>\r\nLight Blue moved around lapping the liquid, it had a bit of a spark to it. Light Blue noticed some of it dripped onto Yellow’s stomach, so he traverses the squishy landscape to lick up the rest of the milk. “Thank you so much bud.” Yellow grabs her chest and shakes. “Hmm, there’s still lots of milk left, Luckily I know how to handle it.” Yellow says, grinning at Light Blue, who hoped it wasn’t what he was thinking.<br>\r\n<br>\r\nWhat does Yellow do?<br>\r\n<br>\r\n1. She begins to start drinking her own milk, further increasing the size of her stomach. As well enticing Light Blue<br>\r\n<br>\r\n2. She wants Light Blue to drink even more milk, however it could have some unintended side affects.<br>\r\n<br>\r\n</span></div></div>",
            "created":1537851600,
            "id":2553888,
            "title":"I'll go grab a tow- never mind"
        },
        "12212111211122":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "starts rubbing against the pale hill/ Yellow's boob",
                "shrinks to half his size."
            ],
            "content":"<div class=\"\"><div> <span>Yellow smirks, before grabbing Light Blue and pressing him against her nipple \"Come on LB, drink\" she orders, Light Blue gulps as he can feel the unstable magic in his sister, worrying what it might do to him if he drunk too much. When the pressure began to increase LB had to open his mouth and suckle, which causes Yellow to release his head and toss her own back as she moans, fondling her free breast and pinching the nipple, which leaked gently through her fingers and running down her torso.<br>\r\n<br>\r\nLight Blue gulped until he felt he was going to burst, at which point he unclenched his teeth from her teat, and slid down her left breast, looking down he noticed with a chuckle he had bloated quite a bit from all that milk, he better not become a blob from all this or he was killing Yellow and Morgan.... just because really, plus he was the reason they knew the bakery existed.<br>\r\n<br>\r\nTapping his fingers along his belly like a drum LB's eyes widen when the melon sized bump recedes, getting rather close to his original mostly flat stomach with a little extra 'weird' Light Blue thinks before doubling over in pain as he felt the magic coursing through him, it's unstable nature messing with his own much more violently than normal enchanted sweet effects.<br>\r\n<br>\r\nLight Blue was uncomfortable and his head was spinning, but what really told him things were going to end badly was when he...</span></div></div>",
            "created":1537851600,
            "id":2553959,
            "title":"Light Blue's Gamble"
        },
        "12212111212":{
            "choices":[
                "She Obliterates her Clothes",
                "Only two parts of her grow"
            ],
            "content":"<div class=\"\"><div> <span>Yellow grinned as she got off the bed and stood up. Light Blue was confused until she turned around giving Light Blue a clear view of her two moons. No, scratch that these things were planets. They threatened to destroy Yellow’s pants, she sat down giving Light Blue only enough time to squeak before he was engulfed in soft flesh. “You see Blue, you make a great cushion.” Yellow chuckled grinding her rear end onto the prince.<br>\r\n<br>\r\nAfter sometime Yellow stopped, this was nice but Light Blue was too small to be a cushion, and there was another problem. Yellow wanted to be bigger. For whatever reason Yellow wanted to get bigger, softer. She wanted Light Blue to please her, to worship her. A part of her wanted to make Light Blue feel good, feel safe. <br>\r\n<br>\r\nYellow’s stomach grumbled, “It seems my tummy needs more food. You don’t mind if I eat some more Little Blue?” Yellow asked grinding her rear more, before grabbing more treats and shoving them in her mouth.<br>\r\n<br>\r\nYellow begins to moan as she feels another wave of growth happen. Yellow decides to reach under and grab Light Blue, he deserved to see his sister grow. She sets him in front of her right before she starts to grow.<br>\r\n<br>\r\nHow does Yellow grow?<br>\r\n</span></div></div>",
            "created":1538024400,
            "id":2555134,
            "title":"She uses him as a seat cushion instead"
        },
        "12213":{
            "choices":[
                "Lucina spends some time with Morgan",
                "Lucina spends some time with Morgan and her friends."
            ],
            "content":"<div class=\"\"><div> <span>Today Lucina and Kjelle were to be tested to see if they can go into to the royal guard. <br>\r\n<br>\r\n\"Today girls the test will contain four sections, the first three the two of you will do within the same room, the last one you will be separated.\" Yellow Diamond explained before leading the girls to what appeared to be an obstacle course. \"For the first test, the two of you shall go through this obstacle course as fast as you can. Ready? Begin!\"<br>\r\n<br>\r\nLucina and Kjelle ran as fast as they could, Lucina going faster as she was more flexible and did more cardio compared to Kjelle. Kjelle wasn't necessarily flexible but she was tough being able to take blows from the traps (non-lethal traps, they weren't monsters, and plus they didn't want a rebellion, they definitely could of handled one but it just had too many drawbacks).<br>\r\n<br>\r\nLucina waited about two minutes till Kjelle made it to the finish line. \"Very nice, I believe it's time for the second test.\" Pink Diamond said with Light Blue on her shoulder. \"Yellow decided to combine our tests which is why there are four instead of five.\" LB explained to the girls who nodded. \"Now for this test there are time when there are attacks that occur while you are asleep and you don't have time to get dressed.\" Pink started off \"As well there are times you are surrounded and they won't fight fair and will fight you all at once.\" Light Blue continued \"So the two of you will have endure one minute of fighting against a horde of enemies while wearing what you wore while you were sleeping last night.\" Pink explained, she and her brother both snapped their fingers.<br>\r\n<br>\r\nTime was re-winded fourteen hours (it being two in the afternoon) for the girls so they were now in their pajamas (they still knew what was happening and stuff) Kjelle was just wearing underpants, Pink making a dumb face when she saw her six pack. Lucina was wearing actual pajama's,  but they were a couple of sizes two small on her. The reason for this was Lucina was allowed a certain number of nights when she was allowed to sleep with Morgan but since her maternal aunts (Chrom had two sisters, an elder one and a younger one who was normal sized like lapis) and Tharja and occasionally Noire (the Nocturnes had to live with Lucina and her family after a spell went wrong and their house imploded...and then exploded.....and it started raining pugs, it was a very weird day) were somewhat needy/selfish and would steal Morgan in the middle of the night. Because of this Lucina bought a pair of pajama's that were too small so it would make much more difficult to steal Morgan. And Lucina slept with Morgan yesterday. A dozen of holo Pearls (yes LW those are a real thing, look it up) appeared holding swords and were surrounding the girls.<br>\r\n<br>\r\nThis time Lucina and Kjelle were tied as they both defeated the same amount of holograms in the same amount of time. Once all of them were gone the girls were wearing their normal outfits.<br>\r\n<br>\r\nThey went into a another room where Blue Diamond was standing by three podiums (like those fancy ones in museums or in that spongebob movie with Neptune). \"Hello girls, a part of being in the royal guard is choosing who is the best person for a specific task, however if you do get accepted you will start off as rookies but once you have a couple of years under your belts you could be assigned your own platoon. For today's test you will have to decide which tasks you believe would be best for some of our rookies.\" Blue moved out of the way revealing that on the pedestals were Loyd, Mickey and Pyro.<br>\r\n<br>\r\n\"Well this is easy, the green haired guy would be a messenger, black haired guy would be cannon fodder and the one who looks like he wants to start a fire would clean the stables.\" Kjelle said matter of factly (fun fact while all of the horses are normal sized, occasionally they would have size magic used on them so they can be used by female members of the royal guard, other fun fact most of the royal guard are women for obvious reasons which means all of the men who are in it have to be <b>REALLY</b> talented to be a member, so you know that Chrom is a tough mother trucker if he's the captain).<br>\r\n<br>\r\n\"Just so you know you only have one guess, you just used it Kjelle.\" Blue said with a twinge of disappointment, not that Kjelle noticed. Lucina hummed, biting her lip before speaking. \"I believe that Loyd would be good when dealing with a raid as he is good at setting traps, Mickey would be best suited for hunting down people in a chase while Pyro would be best suited for taking out multiple enemies at once.\" Lucina said, getting a smile from the boys. \"Now for your final test I would like Kjelle to go in the white door and Lucina to go in the black door.\" Blue explained to the girls.<br>\r\n<br>\r\nLucina saw Black Diamond (she also had a bit of chocolate on her face) when she entered the room. \"Hello Lucina, for your final test we asked Morgan for his assistance which he agreed to lend. What you have to do is to identify which Morgan is the real one, as cloning is a fickle thing all of the clones are capable of saying one thing, in return I used a spell on the real Morgan so he can only say that word also. Once you believe you have found the real Morgan you will kiss him and all of the fake Morgan's will disappear and the spell on Morgan will be broken.\" Black diamond explained before fading.<br>\r\n<br>\r\nLucina than noticed that on the ground were hundreds of Morgans. <font class=\"size5\" style=\"\"><span class=\"cblue\">\"LUCY!</span></font> The Morgans cried before swarming the giant Blunette. Lucina tensed up at the Morgan's swarming her body saying her name over and over again. Lucina closed her eyes and focused before getting an idea. Lucina laid down on the floor before speaking \"The real Morgan is the one who will go as close as close to me as physically possible.\" Lucina felt the Morgan's crawling over her body but she only felt one go on her lips. While Lucina's magic knowledge wasn't as great as some other members of her family (oh yeah Lucina can use magic, and so can Chrom) she knew two things about clones, one they weren't as durable as the real thing, two they would do anything they can to live. So only the real Morgan would go near her mouth. Lucina puckered her lips and pressed Morgan down as she made dramatic kissy noises to be funny. Lucina felt all of the other Morgans' disappear.<br>\r\n<br>\r\nLucina stood up and shared a smile with Morgan. \"You know I would of been really sad if you didn't choose the real me.\" Morgan said with a cute smile. \"Well it's a good thing she did.\" Lucina turned around and saw a smiling Black Diamond (the chocolate on her face was now gone.) \"The testing is over, Myself, Yellow, your father and some of the members of my council and the higher ranking members of the guard will discuss whether or not you and Kjelle passed or not, for the time being go home and rest.\" Black Diamond said, Lucina and Morgan both bowing before leaving.<br>\r\n<br>\r\nWhat now?</span></div></div>",
            "created":1533099600,
            "id":2527822,
            "title":"Initiation "
        },
        "122131":{
            "author_id":"waluigi99",
            "author_name":"ButterBazooka",
            "choices":[
                "Morgan wants to play with Lucina's butt",
                "Noire knocks on the door"
            ],
            "content":"<div class=\"\"><div> <span>Lucina was now in her room with Morgan who was in her bust. \"Morgan, you can get out if you want to.\" Lucina said but Morgan shook his head and went deeper so he was no longer visible \"It's so soft and warm in here.\" Morgan said, Lucina rolling her eyes but then decided to have a bit of fun by squeezing her breasts together and rubbing them up and down, causing Morgan to yelp in surprise.<br>\r\n<br>\r\nEventually Lucina decided to stop allowing Morgan to come out for fresh air. The two looked at each other and shared a laugh.<br>\r\n<br>\r\nWhat now?</span></div></div>",
            "created":1563598800,
            "id":2689804,
            "title":"Lucina spends some time with Morgan"
        },
        "1222":{
            "choices":[
                "Follow the royal family",
                "Follow Lucina, Morgan and their family",
                "Take a peek on Ren and/or Chihiro"
            ],
            "content":"<div class=\"\"><div> <span>Light Blue ran, he dodged three blasts of electricity before jumping up and slashing down at his adversary who blocked it with her long sword (not a long sword, the type of sword a long sword). “Oh little brother did you think you can get me with a simple slash?” The twelve foot tall yellow diamond asked mocking the younger diamond. “Well......time magic doesn’t work on you so much....so I thought I could at least try.” Light Blue said sheepishly before being blasted away by electricity.<br>\r\n<br>\r\nHis friend Morgan wasn’t having a good time either. “Lucy, I don’t want to do this.” Morgan said sidestepping away from a couple of sword beams. “Yellow Diamond said we have to learn our own families techniques in the event of shapeshifters or mind control, I don’t understand the purpose exactly but what she says goes.” The eight foot Lucina said before using her own variety of magic before dashing towards the small boy. <br>\r\n<br>\r\nMorgan sighed before focusing on what was coming towards him <span class=\"cbyellow\">”REFLECT!l</span> . A wall of energy appeared in front of Morgan reflecting the magic back to Lucina who used her blade to block the spells before piercing through the barrier and pinning Morgan to the ground. “I have finished my diamond.” Lucina said before turning around and seeing Yellow sitting on a blushing Light Blue. “This isn’t funny!” LB said wriggling in protest. “Oh stop complaint you know you like it. Anyway well done Lucina the training is over, take the scamp home and relax.” Yellow said waving Lucina on, the brunette sighed before throwing Morgan over her shoulders like a sack of potatoes.<br>\r\n<br>\r\nWhat now</span></div></div>",
            "created":1535173200,
            "id":2538848,
            "title":"They are all amazons"
        },
        "12221":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Morgan and Lucina",
                "Next day: LB hangs out with Morgan, Ren and Chihiro"
            ],
            "content":"<div class=\"\"><div> <span>Yellow was still grinning as she bought Light Blue into the dining hall where the rest of her family was eating<br>\r\n<br>\r\nQueen Black Diamond smirks, revealing pointed teeth 'I presume everything went as expected?' she asks, spearing some meat on her knife.<br>\r\n<br>\r\nYellow laughs as she drops LB into a child's seat, much to his annoyance 'You mean I kicked his ass, then yes' she then tilts her head, avoiding the water whip from her twin Blue, the attack drilling a hole through the back of her chair<br>\r\n<br>\r\n'No swearing in front of the child' Blue hisses while White sighs and scribbles down <i>chairs</i> on the bottom of her list, knowing Black will want the damaged furniture repaired and as the one she picked as the Treasurer it would fall to her.<br>\r\n<br>\r\n'Mama! I'm not a little kid anymore' her daughter Lapis whines, slamming her bony fist into the table<br>\r\n<br>\r\n'True but you are still my daughter and are petit like me and your aunt BD, I worry about you' Blue attempts to deflect thought she does have a point: Blux was a county of Amazon's and while all the female royals had the height of at least 10 ft tall, (Well Lapis was 7ft but she'd only 16 so has time to grow) only Yellow and White had the traditional muscular frame that was associated with the word itself, Blue had the proportions of a normal, slightly top heavy female, while Black and Lapis had thin lithe feature, though Lapis at least was considered elven in appearance, where as Black had a very gaunt form, as far as most outside the family knew her magic compensating for her lack of physical power, though that was deceptively false.<br>\r\n<br>\r\n'I though that's what Jazz was for' Lapis jokes, referring to the grey haired, muscular women Blue had chosen to be her royal protector, at least until she was strong enough to look after herself. This was mostly due to Lapis not only being petit but an only child, as otherwise the elder siblings would fulfil that duty (it's why LB doesn't have one, his sisters do the job for him)<br>\r\n<br>\r\nBlue rolls her eyes, regretting letting Black spend so much time with her daughter, the girl was becoming as much of a snarky pain as the Queen had been as a child... as well as right now 'Yes, but you still need to be able to defend yourself and your build works against you a lot'<br>\r\n<br>\r\n'I could start proper training tomorrow if you're that worried' Yellow offers, unsurprised by the arctic glare she received<br>\r\n<br>\r\n'I don't want her to be another soldier Yellow, and you're an all or nothing woman, always have been. Besides I've already been training her in her magic as well as using her slighter frame effectively'<br>\r\n<br>\r\nYellow smirks and mouths <i>'I'm sure Jasper likes that'</i> to Black who returned it with her own, while White nearly chokes on her wine. The 2 were unsurprised, after Pink, White was the prude of the family, and their youngest sister was only absent due to the fact she was courting Prince Universe of the neighbouring kingdom. Black knew the lad liked giant women and was sure a Blux Amazon would do the trick. Also helped Pink was he nicest of the family, and was also the smallest at exactly 10ft so was least likely to break the human, unlike 20ft Queen Black, or the others.<br>\r\n<br>\r\nWhat now?</span></div></div>",
            "created":1535173200,
            "id":2538877,
            "title":"Follow the royal family"
        },
        "122211":{
            "choices":[
                "Lucina who is beneath Morgan",
                "Aversa who is on top of Morgan"
            ],
            "content":"<div class=\"\"><div> <span>Meanwhile the Exalt family were having dinner.<br>\r\nThey had a large table to fit all of the members of the family. Morgan was sitting next to Lucina, and Aversa. On the other side of Lucina was Grima. Chrom was between his wife and Grima. Aversa was on the other side of Robin. The reason why Grima and Aversa lived with their sister was because it was a tradition in the Necrophage family that all the siblings would live together and raise their children together. Robin was the only one with children. Aversa has gone on a handful of dates with Sans, Grima’s coworker, if you could even call it working. (in this Century has not yet been born). While Grima was the most social of the sisters ironically she had the least going on for her romance wise, Robin and Grima have been trying to get her to go on at least one date.<br>\r\n<br>\r\n“So, why did Yellow want Morgan to come for your one on one training?” Chrom asked cutting some food. “For whatever reason she had me fight Morgan, well it wasn’t much of a fight. Yellow beat up Light Blue.” Lucina said sighing, while she did respect Yellow, she was sort of like Kjelle on steroids and then the roided up Kjelle had a baby with Jasper. Although Yellow was older than both of them.<br>\r\n<br>\r\n“That sounds like Yellow.” The thirteen foot tall Grima said applying butter to a slice of bread. “Poor Light Blue, it doesn’t really seem like Yellow cares about him that much.” Robin said, looking at her almost identical twin. “I’m sure it’s just an act, maybe she is much more kinder to him when in private. Black acts all queen like and serious when doing important things in public but Black acts like a weirdo as much as she can.” The seventeen foot tall Aversa said, Aversa was the second tallest woman in the kingdom, beaten only by Black. However Aversa was the heaviest woman in Bux.<br>\r\n<br>\r\nSeveral hours later Morgan went to bed, when he woke up he was in his own bed but someone was in it with him. But who?<br>\r\n</span></div></div>",
            "created":1537938000,
            "id":2554554,
            "title":"Dinner"
        },
        "1222111":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Family fun time",
                "Morgan already had plans for the day, but Lucina could come along if she wants"
            ],
            "content":"<div class=\"\"><div> <span>Morgan awakens to see he was lying on something much more squishy than his mattress had been when he fell asleep, that was because his head was resting on Lucina's large chest as she cuddled him like a teddy bear, something which would probably make the boy blush were it not something Luci did quite often, if seemed to be some kind of rotation he woke up on top of or under quite a few of his relations or friends when they slept over, technically even Ren but that was more because he never usually sleeps alone (he would probably tease the artist for Tali's clinginess, but he's currently the Morgan filling of a boobie sandwich so he couldn't say anything) so Morgan has a spare pillow for him to use and they stay on opposite sides of the bed. Noire liked him using her bosom as a bed much like Lucina did, while Robin has him use her belly and Aversa her butt.<br>\r\n<br>\r\n\"Luci!\" Morgan calls, the snoring tells him the older girl was still asleep so he started shouting louder before grabbing her nipple and giving it a sharp pinch.<br>\r\n<br>\r\n\"Yow!\" Lucina yelps, smothering Morgan when she clenches her arms and presses him deeply<br>\r\n<br>\r\n\"LUCI!!!\" Morgan's muffled scream draws her attention back on her brother<br>\r\n<br>\r\n\"Oh, hey Morgie\" she coos, petting his head and smiling sweetly<br>\r\n<br>\r\n\"Hey Luci, um why are you in my bed?\"<br>\r\n<br>\r\n\"Cause I missed you, I've been busy working under Yellow so we hardly get to spend any time together, so I thought the best way to start a day together is by waking up together\" Lucina explains simply<br>\r\n<br>\r\n\"Oh\" Morgan hummed<br>\r\n<br>\r\n\"So ready to have a day of brother/sister fun time?\" Lucina asks as she smiles </span></div></div>",
            "created":1537938000,
            "id":2554597,
            "title":"Lucina who is beneath Morgan"
        },
        "12221111":{
            "choices":[
                "Special treatment",
                "Feed the Amazon",
                "Pranks"
            ],
            "content":"<div class=\"\"><div> <span>\"Sure sis!' Morgan says with a wide grin, Lucina nods and gets up, gently setting her much smaller brother down on the bed.<br>\r\n<br>\r\nThe two siblings got ready for the day: eating breakfast, making beds, brushing teeth.<br>\r\n<br>\r\n\"Hey Morgie, do you want to spar for a little bit?\" The blue hair girl asked. Morgan frowning in response. \"While I do like sparring I don't like doing it with family as while I know you're tough I don't want to hurt you. \"No one is going to get hurt Morgan, how about this whoever loses has to do what the other person says.\" Lucina says Morgan's eyes lighting up. \"I accept!' Morgan knew there was no way in heck he was going to lose but he knew that his sister would pick something that the both of them would enjoy.<br>\r\n<br>\r\nThe two siblings sparred for a bit using magic before Lucina managed to close the gap and pin Morgan's arms together. \"Well Morgan looks like I win... I wonder what I should make you do?\"<br>\r\n<br>\r\n1. Lucina hasn't had a massage from Morgan in a while and she's looking for some TLC<br>\r\n2. Lucina hasn't eaten Morgan's treats in a while and she doesn't care if they make her expand.<br>\r\n3. Lucina decides to do her first prank in 10 years, feeding other girls treats Morgan enchanted.</span></div></div>",
            "created":1538542800,
            "id":2558312,
            "title":"Family fun time"
        },
        "122212":{
            "choices":[
                "No (the treats were enchanted)",
                "Yes (the treats are not enchanted)"
            ],
            "content":"<div class=\"\"><div> <span>“I know I don’t necessarily expect to beat any of my sisters while I sparring but I would at least would like to last at least five minutes, I mean sometimes I feel like they don’t notice me, yesterday Yellow sweared, and Blue said ‘don’t swear in front of the child’ and she was referring to Lapis, she’s sixteen, I’m twelve, I’m younger than my own niece. It’s embarrassing.” Light Blue confided as he was fencing with Morgan, Chihiro and Ren fencing beside them. “Well Blue Maybe didn’t you think you were paying attention,  as for sparring with them, I don’t necessarily last long against Lucina. Although that’s because most of the time o don’t try as hard because I don’t want to hurt her.” Morgan said dodging a blow.<br>\r\n<br>\r\n“But magic doesn’t work on them most of the time, but when it does it uses a lot of energy and it doesn’t do that much.” Light Blue said frowning “Maybe you should practice your magic and try to find ways to use it without stopping or slowing down time for your opponent. “Chihiro suggested, “Seems like a good idea, but not today. Another thing that bothers me is that Black hasn’t found a use for me, I know I can’t really do anything important like handling the kingdoms finances or training soldiers but I want to be useful.” “I used to be like that but my mom told me that I should just do whatever I can when the opportunity arises and just be kind to the people around me.” Ren said with a small smile.<br>\r\n<br>\r\n“Maybe I can whip up some enchanted treats to make your sisters soft and squishy and their skin extra sensitive so that they’ll want to cuddle and then you’d be the ultimate cuddler.” They all stared at Morgan. “We are not fattening up my sisters!” Light Blue said and Ren sighed, “it might be too late this morning I found Morgan in the bakery and he had apparently baked a bunch treats in his sleep and it’s too risky to throw them all away and your sisters already ordered a good amount of treats.” Ren said and at that Light Blue widened his eyes and ran towards the castle hoping his sisters (minus pink as she was out of the country) hadn’t started eating the treats.<br>\r\n<br>\r\nLight Blue thought about what Chihiro he said and focused his magic into making himself go faster, which he did. Light Blue made it to the dining hall panting but did arrive in time to stop his sisters from eating the treats?</span></div></div>",
            "created":1535346000,
            "id":2539787,
            "title":"Light Blue might need a therapist"
        },
        "1222121":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Black Diamond",
                "White Diamond"
            ],
            "content":"<div class=\"\"><div> <span>Light Blue enters the room to munching and his heart dropped... before being shot up when he was pulled into a crushing hug by a much pudgier Blue<br>\r\n<br>\r\n'Oh I knew it, he is a wonderful cuddle buddy' she coos, running her fingers through his hair, to which the others sniggered. LB would have tried to see them or respond in some way, but the sweets clearly had an effect on Blue's breasts and belly, meaning he was trapped by a large wall of soft fatty flesh which he was slowly sinking into.<br>\r\n<br>\r\n'Give him here, I doubt he's that great' Yellow grumbles but Blue clearly ignores her twin<br>\r\n<br>\r\n'Oh you're so adorable, it's always so hard to treat you like my brother, rather than my son' at this Light Blue squirms his way up so he could look her in the eye, even if his only response was<br>\r\n<br>\r\n'Hm?'<br>\r\n<br>\r\nBlack laughs, and LB was surprised that the cake's magic actually managed to make Black look healthy in terms or weight rather than death's door level emaciated 'Mother died giving birth to you little squirt, Blue as a mother to a 4 year old child was the most experienced, I'm sure you know we all tried raising you, but it was always Blue who did the bulk of the work. Naming you Light Blue Diamond was Queen Prisma's last act, Blue clearly took it to heart, especially as even Yellow knows she's your 2nd favourite sibling, she'd prefer fav, but who can really compete with Pink eh?' he smile was gentle and Light Blue knew she was telling the truth, it had always just been him, his sisters and his niece, he didn't have any memories of parental figures and none of the others ever talked about them, other than Black when giving him and Lapis their history lessons. Thinking back, Blue did treat him similarly to how Robin and Tali (Morgan's mom and Ren's adopted mother) did, she was being a mother hen. He laughed just a little, how could he think she of all people didn't care about him?<br>\r\n<br>\r\n'My turn, stop hogging the brat' LB's pleasant experience was ruined the moment things turned from blue to yellow: Yellow had the Amazon physique, muscles on muscles, which meant even Morgan's sweets couldn't stop her solid abs from being rather uncomfortable to be rubbed against, at least she had a soft bosom atop her pecs. With an unsatisfied grunt she moves him to her now much plumper ass, LB holding in any screams as he was rubbed against a wall with the consistency of jello 'He might make a nice cushion though' Yellow teases, getting slapped for her troubles<br>\r\n<br>\r\n'He's still our brother, even if he's small and fragile' Blue scolds 'He needs to be protected, you swore an oath to the family when Black made you Captain of the Guards and I shouldn't NEED to remind you of that to stop you trying to torture your own blood'<br>\r\n<br>\r\n'Are you saying my ass is that bad, bitch? At least it has shape and is firm, you'll need a wheelbarrow before LB's of age' Yellow sneers, then both older diamonds gasp when tendrils of shadow wrap around their throats, Light Blue dropping to the ground, luckily landing on his feet.<br>\r\n<br>\r\n'Sisters please, don't fight like this' Black sighs 'At least use the arena like normal people if you want to beat the shit out of each other so badly. Besides, LB still has other sisters that want to show him we care...' her smirk turns feral and LB curses Morgan and Ren for good measure.<br>\r\n<br>\r\nWho's closest to LB, and therefore gets to play with him first?</span></div></div>",
            "created":1535432400,
            "id":2540142,
            "title":"This can't end well"
        },
        "12221212":{
            "choices":[
                "All of Black grows",
                "One part of black becomes HUGE"
            ],
            "content":"<div class=\"\"><div> <span>Black Diamond smiled at her smallest sibling, with a wicked grin. “White you get to be with LB!” Black said nonchalantly, Light Blue looked over and his jaw almost dropped. <br>\r\n<br>\r\nOut of all the sisters White was the one who had grown the most. Her rear end was even larger than Yellows and her stomach and chest put Blue’s to shame. However she had not grown in height at all. “W-w-what, you’re the older sister you can have him first. “White said embarrassed by her growth. “Nonsense, you are closer to him and I’ll just watch and take him off your hands once you’re done.” Black said, White sighed, picked up Light Blue and sat down in a chair that squeak adding more to White’s embarrassment.<br>\r\n<br>\r\nWhite agreed with Blue about LB being a good cuddle buddy even if there wasn’t any movement. White calmed down and looked down at Light Blue. “Don’t worry about Yellow, she’s a bit of a tsundere so she likes to show her love in strange ways.” White comforted knowing Light Blue had mixed feelings when it came to the aggressive diamond.<br>\r\n<br>\r\n“Oooh, look a cookie.” Black said grabbing a stray cookie and shoving it in her mouth. Black swallowed it and then started groaning and she wrapped her arms around herselves.<br>\r\n<br>\r\nWhat’s happening to Black<br>\r\n</span></div></div>",
            "created":1536555600,
            "id":2545899,
            "title":"White Diamond"
        },
        "122212121":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Both shades of Blue",
                "Escape and restoration"
            ],
            "content":"<div class=\"\"><div> <span>Black groans as her entire body expands, luckily not equally across her form or she'd have blown up like Violet from Charlie and the Chocolate Factory. So luckily even though she is now twice her size, she retained her proportions of being the thinnest of the royal diamonds.<br>\r\n<br>\r\n\"Whoa, I think Morgan made this one\" Black chuckles as she manoeuvres into a comfortable position, grinning down at her little siblings \"Hey LB, want to cuddle with you big sis?\" she teases with a smirk Light Blue gulps before White lets go of him and shadows pull him over to Black who cuddles him to her now very large bust, to which LB squirms and tries to escape to the point, causing Black to giggle<br>\r\n<br>\r\n\"Not only are you cuddly, you're ticklish too\" Black says before she finally lets him go, allowing him to breathe once more \"I see a future minister of cuddles eh Blue?\" she teases, making the younger princess grin and nod, while Light Blue blushes and stutters as Yellow and White roll their eyes at their other siblings.<br>\r\n<br>\r\n\"Please don't\" Light Blue meeps, to which the 2 smirk and laugh, then pull him into a double bosom hug, once more smothering him as both blues are lifted by their big (in every way) sister.<br>\r\n<br>\r\n\"We're just kidding with you kiddo, we'll find you something, even if it's Minister of sweets like that Pudding Charlotte lady from the neighbouring archipelago\" Black comforts after letting both go and she can see LB visibly relax.<br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\n1) Blue wants to have some fun with Light Blue, mothering him more obviously while they do<br>\r\n2) Light Blue escapes, going to find Morgan and get him to fix this problem</span></div></div>",
            "created":1537074000,
            "id":2548648,
            "title":"All of Black grows"
        },
        "1222121212":{
            "choices":[
                "Milk (You gotta be kidding me!)",
                "Sweat and Saliva"
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nLight Blue remembered about what he was told about finding other means to use his time <br>\r\nmagic. The prince focused on the location where he was before heading to the castle and he <br>\r\ndisappeared. “What just happened?” Blue asked out of concern, Black just smiled “I believe our <br>\r\nlittle brother realized there are more to his abilities than meets the eye.  <br>\r\n <br>\r\nLight Blue realized it worked and went off to find Morgan.  <br>\r\n <br>\r\nAfter some searching Light Blue found Morgan at the most unexpected place, the beach. The <br>\r\nreason it was so unexpected was one, it was September and two he wasn’t even swimming he <br>\r\nwas just watching the waves. “Change them back.” Light Blue said, Morgan turned around and <br>\r\nsmiled. “Hey Light Blue how’s it going?” Morgan asked ignoring the princes previous statement. <br>\r\n“Morgan change them back, Yellow, has an even bigger butt than before, White is now fat, Blue <br>\r\nhas lost a good amount of self-control and Black is forty feet tall. She now classifies as a <br>\r\ngiantess. Light Blue said to his fellow blunette. Morgan frowned “I’m afraid I can’t change them <br>\r\nback, sorry, howe-. Morgan then had to jump back because Light Blue launched a ball of gray <br>\r\nenergy at Morgan’s feet. “Change them back or I’ll make you change them back.” Light Blue <br>\r\nsaid fiercely pulling out his rapier from his gem and pointing it at Morgan. Morgan sighed and <br>\r\nshook his head. “I don’t want to fight my friends but if it’s going to be like this I suppose I don’t <br>\r\nhave any choice.” The birthmarks on Morgan’s hands started to glow as he got into a fighting <br>\r\nposition. <br>\r\n<font class=\"size4\" style=\"\"><b> <br>\r\nNobody Blink! <br>\r\nENGAGE!</b></font> <br>\r\n <br>\r\nLight Blue did several slashes launching sword beams at the tactician. Morgan in response used <br>\r\nwind magic to launch himself in the air over the projectiles and when he got close enough kicked <br>\r\nthe royal in the chest with both legs sending him away.<b> ​53...52...51…</b> <br>\r\n <br>\r\nLight Blue got to his feet and sped up his movement speed and dashed towards Morgan. To <br>\r\nMorgan Light Blue was a blur constantly striking Morgan at all angles. Morgan took a deep <br>\r\nbreath, his hands engulfed in flames, he then clapped them ​<b>“Set!”</b> ​there was a fiery explosion <br>\r\nthat once more knocked away the royal. Morgan launched a ball of light magic while Light Blue <br>\r\nwas bouncing off the ground. LB managed to steady himself and deflect the energy ball <br>\r\nresulting in a game of dead man’s volley, the light projectile speeding up until Morgan got hit in <br>\r\nthe face with his own projectile. ​<b>39..38..37… <br>\r\n </b><br>\r\nMorgan lifted his arm in the air causing several orbs of electricity to form in the air. Morgan then <br>\r\nlowered his arm facing Light Blue <b>​“Raijin!”</b> ​The electric balls shot forward, Light Blue ran as fast <br>\r\nas he could without magically increasing his speed, he managed to avoid all of the projectiles <br>\r\nwhich when they hit the sandy beaches, created many patches of glass. When Light Blue was <br>\r\nalmost within stabbing distance of Morgan golden rings formed around Morgan (the weird fancy <br>\r\nstuff that forms around tome users in Awakening) ​<b>“Terminus”</b> ​There was a blast of energy that <br>\r\nsent Light Blue flying and he landed on one of the glass patches. He then got an idea. Several <br>\r\ngold energy chains formed from LB’s hand which attached themselves the other patches of <br>\r\nglass and ripped them out of the ground, which was then thrown at Morgan.​ <b>30...31...29…</b> <br>\r\n <br>\r\nMorgan formed a small black hole which absorbed the glass, when the black hole faded away <br>\r\nhe was struck by a flying kick to the face. Morgan turned around to face Light Blue and created <br>\r\ntwo swords, one made of light magic the other made of dark. They clashed blades several <br>\r\ntimes. Light Blue attempted a downward slash which was caught when Morgan crossed his <br>\r\nblades. Morgan swung upwards sending LB’s sword flying away. Morgan was then able strike <br>\r\nhis fellow blunette several times.​ <b>15...14...13… <br>\r\n </b><br>\r\nOnce Light Blue found an opening he pushed his hand forward<b> ​“Stasis!</b>” ​Six gold chains went <br>\r\nthrough Morgan freezing him in time. Light Blue formed several gray and blue orbs of energy <br>\r\naround the frozen tactician, Light Blue closed his hands making them go hit  Morgan. Light Blue <br>\r\nthen pulled another sword from his gem and performed an endless amount of slashes before <br>\r\nbacking up and gathering energy into the sword until it was glowing bright blue. Light Blue then <br>\r\nlunged forward and stabbed Morgan before quickly pulling the sword out. ​<b>3…​ </b>Morgan unfroze <br>\r\n<b>2…</b> ​He gasped and his eyes widened.<b> ​1....​ </b>Morgan was then launched 20 feet before hitting the <br>\r\nground.<b> ​0… KO! </b><br>\r\n <br>\r\nLight Blue walked over to the incapacitated Morgan. “Now are you going to fix my sisters?” Light <br>\r\nBlue asked with a determined tone. “You didn’t let me finish earlier, I am incapable of doing so, <br>\r\nbelieve me. You know my Aunt Aversa?” Morgan asked as Light Blue helped him up. “Well she <br>\r\ndidn’t alway have that fat squishy belly, originally she asked me to make her an enchanted treat <br>\r\nso she could have a larger chest than her friend Helena. Wanting to make her happy I <br>\r\naccidently enchanted the treats to much making not only her chest grow but also her stomach <br>\r\nand rear. I tried to find a way to reverse the effects but to no avail. So while I can’t make your <br>\r\nsisters have their original shape back I can however make their skin less sensitive, it will still be <br>\r\nmore sensitive than originally but it won’t be as bad as how it currently is now.” Morgan <br>\r\nexplained. “Is there anything I can do to help, as way of apologizing for beating you up, which <br>\r\nI’m sorry about.” Light Blue asked, “Well, the remedy comes in the form of balm which you will <br>\r\nhave to apply to your sisters, but it takes a week to properly create, the only thing I need from <br>\r\nyou is the that some of the ingredients are samples of your sisters DNA. But it can’t be any old <br>\r\nthing like hair or nail clippings, it has to be _____.” Morgan said, Light Blue flinching, it will be <br>\r\nawkward to get that from his sisters but it is better than Black actually making him the Minister of <br>\r\nCuddles. <br>\r\n <br>\r\n<b>This Melees Winner Is: Light Blue Diamond! </b><br>\r\n <br>\r\nWhat are the DNA samples Light Blue has to collect? <br>\r\n</span></div></div>",
            "created":1537160400,
            "id":2549095,
            "title":"One Minute Melee"
        },
        "12221212121":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "Blue",
                "Yellow"
            ],
            "content":"<div class=\"\"><div> <span>\"You need to get samples of their breast milk\" Morgan explains, Light Blue looked both horrified, squicked and angry<br>\r\n<br>\r\n\"Seriously, I have to get my sister's breast milk!\" he yells<br>\r\n<br>\r\n\"Yep\" Morgan chirps like that's an easy task, as well as not being weird at all \"I don't need much, just enough I have a good DNA base for the salve\"<br>\r\n<br>\r\nLB sighs, Morgan's not beign difficult on purpose and he knows more about this than he does \"Can you at least make the stuff while I get the milk, please?\"<br>\r\n<br>\r\nMorgan shakes his head \"I can't, a few of the materials need to be gathered fresh in order to be effective, so I need the milk before hand in order to make them. Sorry\"<br>\r\n<br>\r\nLight Blue groans and pinches the bridge of his nose \"Okay, I'll try get this over and done with as quickly as I can, just gather anything that doesn't require to be fresh when making\" he speeds off, leaving Morgan to sit watching the waves for another few minutes before going to find his aunt's spellbook.<br>\r\n<br>\r\nLB managed to reach the palace with little trouble, the guards nodding as they let him in, Jasper even playfully ruffling his hair (he blames Lapis for that), and was on his way to the main hall when he hears a \"Hey Uncle Blue\" directly behind him, causing the prince to hop into the arms of a suit of armour \"Ops, sorry\"<br>\r\n<br>\r\nLight Blue huffs before with difficulty gets back tot he ground, \"It's fine Lapis, just a bit jumpy\" he says, grimacing slightly when he see's that Lapis may have also had some of the sweets as she was now sporting a C cup bust, held tightly by the midnight blue formal wear. He really hoped he didn't have to retrieve a sample from her too, if it was needed he'd get Blue to do it later down the line.<br>\r\n<br>\r\n\"So, what are you doing sneaking around?\" Lapis asks, leaning against the wall with a grin<br>\r\n<br>\r\n\"Looking for ,my sisters, last I saw them they're in the dinning room and they're not there anymore\" Light Blue explains, both relieved and annoyed they had split up as it would have been easier and harder to explain and harvest milk from them all at once than separately.<br>\r\n<br>\r\n\"Oh, that's a problem, actually there's one right behind you\" Lapis says with a grin just before LB yelps as he gets pulled into the embrace of...<br>\r\n<br>\r\nWhich sister is his first extraction?</span></div></div>",
            "created":1537160400,
            "id":2549129,
            "title":"Milk (You gotta be kidding me!)"
        },
        "122212122":{
            "choices":[
                "\"get more treats to balance my body out\" (and still keep the belly)",
                "\"My room so you can rub my belly\""
            ],
            "content":"<div class=\"\"><div> <span><br>\r\nLight Blue watched in amazement as Black’s stomach started to swell. Once it reached to a size that would make Black appear heavily pregnant The siblings thought it would stop growing. They were wrong, Light Blue watched with a mixture of worry and intrigue. Black made noises that no one was sure if they were groans or moans (moaning is more for pleasure while groaning is for distress or pain, that is your mini grammar lesson for the day.) <br>\r\n<br>\r\nEveryone was too afraid to move as they watched their oldest sister’s stomach continue to expand, it reached to the point where Black’s shirt ripped was obliterated revealing her bare stomach and it kept growing until it reached to the size of a bean bag chair. “Black; are you okay?” Light Blue asked, when his sister heard him she locked eyes with him, and with surprising amount of ease she walked over to White and Light Blue, and pressed her stomach against them squishing her two siblings. “You know, I always felt bad because I was thinnest out of all my siblings, the only reason why I was so emaciated was because I worked so much I didn’t have much time to eat and even when I did eat, no matter how much I ate I never gained any weight.” Black confessed enjoying the feeling of Light Blue being pressed up against her and White’s stomachs. Black backed away and grabbed Light Blue and walked off to leave the dining hall. “Where are we going Black?” Light Blue asked nervously. Black giggled “Well isn’t it obvious little guy we are going to-<br>\r\n</span></div></div>",
            "created":1537160400,
            "id":2549098,
            "title":"Black's Big Beautiful Bulging Belly"
        },
        "123":{
            "choices":[
                "A Minor God with a father and sister ",
                "A Demi-God with a father and sister",
                "A minor god born from Robin alone"
            ],
            "content":"<div class=\"\"><div> <span>In this realm here are many gods and goddesses but today we shall focus on these three sisters who are all goddesses of magic.<br>\r\n<br>\r\nAversa: Goddess Of Beauty, Power and Gluttony<br>\r\n<br>\r\nGrima: A party Goddess shares, the title “Guardian of Childhood” with her twin, Robin.<br>\r\n<br>\r\nRobin: War Goddess, inspires tacticians and strategists has the title “Guardian of Childhood”<br>\r\n<br>\r\nMorgan: Robin’s son,<br>\r\n<br>\r\nNow what is Morgan’s status</span></div></div>",
            "created":1533186000,
            "id":2528194,
            "title":"Gods and Goddesses"
        },
        "1232":{
            "author_id":"pokeprof",
            "author_name":"Lonly Wanderer",
            "choices":[
                "They head straight to the Valley, focused on their quest",
                "They stop to help a village in trouble",
                "They run into Morgan's sister Lucina on her own quest (with S&K)"
            ],
            "content":"<div class=\"\"><div> <span>Morgan Nylock was a special person, he was a demigod, the son of a human and a god in this case his father Chrom Nylock and War Goddess Robin. He wasn't the only demigod Robin produced, nor was he her only dalliance with his father, his sister was also a demigod and an accomplished monster hunter and fighter, while Morgan was more of the tactical side of his mother's godly heritage..<br>\r\n<br>\r\nWhich was what lead to the current moment we were at now, Morgan was given a quest, retrieving the Goddess Grima's saddle, which she had used to tame the great Dracolisks like the creatures named after her and pull her chariot, from <b>Ganon</b>, the Great Demon, and what many consider the Father of Monsters. Strapping his sword <i>'Pure Falchion' </i>to his hip he jumps when he sees the dark shadow in the mirror right behind him<br>\r\n<br>\r\n'Hello kid' the shadow purrs before solidifying, Morgan sighs in relief when he realises who it was: Serpens Kaos, God of insanity, darkness and as his mother called it when he was younger 'Big, Scaly Critters'. He was also the father of fellow demigod and Morgan's best friend Noire, the mystic archer having the dark purple hair of the Great Old One's human form, though for Morgan's sanity she didn't have his blood red eyes or mildly scaly skin, instead having amethyst coloured eyes like her mother Tharja, and the body of a 20 year old at age 15, not that Morgan can say much, given his divine blood gave him the lean build of a boy of around 15, despite being 12.<br>\r\n<br>\r\n'Yes Lord Kaos?' Morgan greets, the way he did all the Gods except Robin who insisted he call Mom (not that he had a problem with that)<br>\r\n<br>\r\n'Grima is getting antsy, she's worried what Ganon will do with the power to tame Dracolisks, so she's added a couple other demigods to your quest: Noire and Century'<br>\r\n<br>\r\nMorgan blinked, it made sense Noire would be involved in this, Serpens would have no reason to interfere if it didn't, but playing messenger was odd, even if it were for Aversa, who was the godly parent of Century Comic, making them cousins, though the slightly older boy looked much frailer, most likely due to his father San Comic as well as the rest of his family being quite skin and almost skeletal. 'Okay, anything else?'<br>\r\n<br>\r\n'Just that Ganon has been seen near the Valley of Maleficent, so unless you hear otherwise that's the best place to start' Morgan groans internally, the Valley was on the other side of the region to the Demigod camp and was the site of Grima's taming of her steed of which the Valley got it's name. it was also basically a dragon preserve, meaning if he got there, he would have plenty to chose from in terms of 'scaly critters'<br>\r\n<br>\r\n'Thank you' Morgan replies with a nod to which Serpens smiles before turning serious<br>\r\n<br>\r\n'You get my daughter killed on this quest because you weren't ready to lead and got over eager, I'll tear out your eyes and heart' he hisses before fading into black smoke, Morgan shivers because despite being Robin's son, Kaos was on another level, having been old when the Gods were still maturing (Basically he's a titan to the sister's Greek Gods, he's part of the old guard so to speak)<br>\r\n<br>\r\nSighing deeply he rechecked his supplies, weapon and armour before meeting up with his team, all who were ready to fulfil the will of the Goddess Grima, slayer of Naga the child eater (just kidding... or am I? Yeah I'm taking the piss). Retrieve her enchanted saddle from a monster following the orders of Ganon before he tames his own dragons and the Gods have to interfere themselves<br>\r\n<br>\r\nSo what happens next?</span></div></div>",
            "created":1533186000,
            "id":2528372,
            "title":"Demi-God Morgan: A questing we shall go!"
        },
        "124":{
            "choices":[
                "Queen and Prince",
                "Party Recovery",
                "Sketchy Spell"
            ],
            "content":"<div class=\"\"><div> <span>Morgan was the son of Robin and Chrom the Queen and King of Ylisse-Plegia (the two countries merged after the two royals were married, oh yeah this an AU where the Grima stuff never happened)<br>\r\n<br>\r\nThe Twelve Year old Prince awoke, did his morning stretches and went off to eat breakfast, Morgan was unaware of the fact it was only five in the morning, when Morgan went into dining hall who did he run into?<br>\r\n<br>\r\n1. His mother Robin who is an early bird like him, she's reading a book by some candle light, she seems pretty interested with it, Morgan hasn't seen the book before.<br>\r\n<br>\r\n2. His sister Lucina and her friends Noire, Severa and Kjelle, they partied pretty hard last night and they passed out in dining hall, no one wanted to move them back to their rooms.<br>\r\n<br>\r\n3. Morgan's Aunt Aversa, she might want to borrow Morgan to test out some spells she found in an ancient spell book she found.</span></div></div>",
            "created":1536296400,
            "id":2544428,
            "title":"Normal Sized Morgan"
        },
        "13":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Paw Patrol Weight Gain Inflation Etc II.",
                "Cartoon Dogs WG Inf Growth Etc II.",
                "Rounding Rovers II.",
                "Toon Wrestling League.",
                "Open Choice Chapter."
            ],
            "content":"<div class=\"\"><div> <span>I thought I'd try and make some sequels to some interactive stories that used to be here on Writing.com along with one other interactive story that's still on here as there will be also be a never before seen interactive story that you'll definitely like.<br>\r\n<br>\r\nNow here are some interactive stories that deserve to have some sequels along with a never before seen interactive story.<br>\r\n<br>\r\n<br>\r\nPaw Patrol Weight Gain Inflation Etc II: In this sequel the Paw Patrol's pups are back as they once again gain weight inflate transform grow and or shrink as well along with a whole bunch of fantasy situations that you can all come up with.<br>\r\n<br>\r\nCartoon Dogs Weight Gain Inflation Growth Etc II: In this sequel your favorite cartoon dogs gain weight inflate and grow as you get to choose what kind of scenario they'll go through.<br>\r\n<br>\r\nRounding Rovers II: In this sequel the Road Rovers are back as they'll gain weight and or inflate in other words they'll be bigger and better than ever before.<br>\r\n<br>\r\nToon Wrestling League: In this never before seen interactive story cartoon characters from all around the world compete in the Toon Wrestling League as a heroic group of face toon wrestlers take on their archenemies mainly the league's heel cartoon wrestlers.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1532149200,
            "id":2522829,
            "title":"Story 3"
        },
        "14":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "choices":[
                "Jack and Jill, Genies At Large",
                "Being in Possession of Good Clothing",
                "The Mitosis Experiment",
                "The Retribution Game",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>This is what I'll use to make my interactive stories.  I have several ideas, but I probably won't work on all of them at the same time.  More likely I'll go one at a time.<br>\r\n<br>\r\nJack and Jill, Genies At Large: Twin genies grant two different peoples' wishes simultaneously.  This is the fourth high school they've been to in four years, which only means one thing — fresh, new, unaware victims.<br>\r\n<br>\r\nBeing in Possession of Good Clothing: People turn into clothing and possess people, switching back when they take off the clothes.  It… gets more complicated than that, and those complexities  influence every aspect of life.<br>\r\n<br>\r\nThe Mitosis Experiment:  In a low-gravity world where nanobots have made people's bodies squishier and allowed vore to replace sex as the primary means of reproduction, the only constant is change.<br>\r\n<br>\r\nThe Retribution Game:  When people get mad (or aroused), they reflexively cast spells that can only be undone when the victim does something to make up for whatever caused the person's anger.  These spells can range from making someone mute, to making them only compliment you, to turning them into different people or even objects.  Kendo Barnes, a Japanese-American PI, is responsible for adjudicating retributions and seeing if there's any fault, but usually just ends up getting caught in the middle.</span></div></div>",
            "created":1533531600,
            "id":2529878,
            "title":"Paul M"
        },
        "141":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "choices":[
                "…I had a girlfriend to talk it over with.” (genderbend Tyler)",
                "…I could spend the day in someone else's shoes.” (body swap Tyler & Georgia)",
                "…I had panties that fit.” (transform Tyler)"
            ],
            "content":"<div class=\"\"><div> <span>Jill was hanging out with her new friend Georgia, talking with her in the locker room after a volleyball meet.  Jill had no interest in volleyball, but there was something about Georgia she liked, so on a whim she decided to meet up with her here.  Georgia was an attractive girl, with dark skin and a tall stature from her father and curly hair and brown eyes from her mother.  She had an athlete's build, lean and muscular, although already her metabolism was starting to mature and deposit some cellulose in her buttock area.  She was going on and on about timing requirements and breathing techniques, but Jill was only half-listening.  She was more interested in Georgia's sidelong glances, the way she hesitated when she mentioned certain peoples' names, the decorations on her locker.  The windows to the soul, which would signify to Jill what wishes Georgia had locked deep in her heart.<br>\r\n<br>\r\n“I just don't know if I want to do this forever,” said Georgia.  “I mean, the window for scholarships is closing, and if I don't get that, then I'll need something a bit more practical.  Trouble is, I don't know what it would be.”<br>\r\n<br>\r\n“Well, what were you thinking of?” prompted Jill.  “Like, right now, off the top of your head.  What would help you get a different perspective?”<br>\r\n<br>\r\n---<br>\r\n<br>\r\nJack was hanging out with Tyler, who as he was learning was a bit of a shallow person.  He was only interested in satisfying his immediate urges, and would probably go to school the next day without doing even the highly-perfunctory homework assignments that were being given out this early in the school year.  Jack knew the type; if his life continued the way it is, he'd end up cut off from all social contact.  Jack liked people like this; they presented him with a vacuum in which he could build anything he wanted.<br>\r\n<br>\r\n“Damn,” said Tyler, watching footage from the day's volleyball game.  His identical twin sister Hannah was on the team, and she had gotten him to record it for her.  “That one girl's super hot.”<br>\r\n<br>\r\n“Which one?” asked Jack.  He wasn't the type to grade people on appearances, as he was more interested in examining their psyches, like his sister.<br>\r\n<br>\r\n“That one in the middle, the black girl with the big ass.  I wish I could get into her pants.”<br>\r\n<br>\r\nJack smirked.  He knew it was only a matter of time.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nGeorgia though about Jill's question.  It had come out of nowhere.  She didn't know whether to answer in the immediate or long-term sense.<br>\r\n<br>\r\nWith her next words, she unknowingly prompted Jill to immediately begin coordinating with Jack to concoct an appropriate spell.  “I wish…</span></div></div>",
            "created":1533531600,
            "id":2529901,
            "title":"Jack and Jill, Genies At Large"
        },
        "1411":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "choices":[
                "Hannah, Teagan's now-more-identical twin and Georgia's friend",
                "Josh, Teagan's former bro",
                "Ms. Mable, a teacher who already thinks Georgia needs to focus more on academics"
            ],
            "content":"<div class=\"\"><div> <span>Jack watched as Tyler's body began to change.  His chest expanded into breasts, his hair grew, and freckles popped up on his face.  His clothes morphed slightly to match his new physique.  Looking at the footage, Jack realized that Tyler hadn't just become a girl, he — no, she — hadd become exactly identical to her twin sister.<br>\r\n<br>\r\n“This is weird,” said Tyler.<br>\r\n<br>\r\n“What should I call you?” asked Jack, as the new Tyler examined her body in a mirror.<br>\r\n<br>\r\n“Teagan,” she said.  “Wait, did this just happen because I wished to get in Georgia's pants?”<br>\r\n<br>\r\nJack nodded.<br>\r\n<br>\r\n“Sweet, that means she's a lesbian.”<br>\r\n<br>\r\n<i>Or bisexual,</i> thought Jack, but he didn't vocalize that part.  “I granted your wish.”<br>\r\n<br>\r\n“Neat.  I'm gonna go over to the school and see if she's still in the locker room.”<br>\r\n<br>\r\n---<br>\r\n<br>\r\nIt wasn't long before Teagan arrived, since she lived very close to the school.  Jill and Hannah were just exiting.  As soon as Georgia saw Teagan, she ran over to her, excited.<br>\r\n<br>\r\n“Hannah?” she asked, quizzically.  Jill knew the cause of this — when Tyler had become Teagan, she had also become attractive to Georgia.  However, Hannah was <i>not</i> attractive to Georgia, so when Georgia saw Teagan, the mix of emotions confused her.<br>\r\n<br>\r\n“Nope,” said Teagan.  “Wanna go make out?”<br>\r\n<br>\r\n“Um, sure,” said Georgia, not sure why she was so willing to go along with this.<br>\r\n<br>\r\n“What's our next move?” asked Jack as the two raced to the stalls.  “Teagan knows I'm a genie.”<br>\r\n<br>\r\n“I'll stick with these two lovebirds, then.  They'll probably make another wish in a few days, tops.  You go find someone close to them.”<br>\r\n<br>\r\nWhom should Jack tag along with?</span></div></div>",
            "created":1533531600,
            "id":2529906,
            "title":"Teagan"
        },
        "1412":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "choices":[
                "Jack helps Georgia and Tyler, Jill hangs out with Rika",
                "Jill helps George and Tyler, Jack hangs out with Josh",
                "Jack hangs out with Josh, Jill hangs out with Rika, G&T left to figure it out"
            ],
            "content":"<div class=\"\"><div> <span>Jack and Jill spent the night planning for the next day.  With the way the wish would work, the two would wake up the next morning swapped bodies, and swap back the morning after that.  During that time, Jack and Jill would need to take advantage of the chaos to cause some additional mischief.  They had targeted two potential vectors: Josh, an old friend of Tyler's who was a bit creepy around girls, and Rika, a shy geek girl who had an unrequited crush on Georgia.  Sadly, there were only two of Jack and Jill, and things would go more interestingly if one of them stuck with the newly-swapped people and aided their disguise.</span></div></div>",
            "created":1533531600,
            "id":2529935,
            "title":"A Day in the Life"
        },
        "1413":{
            "author_id":"pablo360",
            "author_name":"Paul M ~",
            "choices":[
                "Hannah, who would probably be confused at Tyler's absence",
                "Josh, a dude who used to hang out with Tyler until they had a falling-out",
                "Rika, a shy nerdy girl with a crush on Georgia"
            ],
            "content":"<div class=\"\"><div> <span>Tyler was somewhere else in an instant.  He was in the lap of the girl he's infatuated with.  He could see all around him; there was another girl in the locker room with her, but otherwise it was empty.  Georgia started talking, but he wasn't paying attention to her voice; he was paying attention to her crotch as she took off her pants, then her underpants.  Tyler wanted to reach for his penis, but he couldn't move.  He felt Georgia pick him up and put first one leg, then another, through his body.  She pulled him up and he hugged her crotch.  He tasted her butt and her vagina, felt the warmth of her thighs.  He felt the satisfaction of sexual release, though no physical reaction accompanied it.  He was in ecstasy.<br>\r\n<br>\r\n---<br>\r\n<br>\r\n“Wow,” said Georgia, pulling her pants back on over her new panties.  “So you can just summon clothes?”<br>\r\n<br>\r\n“Yep,” replied Jill, not technically lying.  “I grant wishes.”<br>\r\n<br>\r\n“I promise not to abuse this power,” said Georgia.<br>\r\n<br>\r\n<i>They all say that,</i> thought Jill.  She would crack this one yet.<br>\r\n<br>\r\n---<br>\r\n<br>\r\nThat night, Jack and Jill had a strategy meeting.  They had decided that Jill would stick with Georgia and try to tempt her to make more wishes, but they didn't know whom Jack would tail.</span></div></div>",
            "created":1533531600,
            "id":2529932,
            "title":"Tyler's Object of Affection"
        },
        "145":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "More Paul",
                "My stories",
                "Another chance for somebody else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>May as well take this opportunity to set up a chance to have my own interactive, but since Paul got here first, and there are still three options left, I’ll give a chance for somebody else.</span></div></span></div>",
            "created":1536901200,
            "id":2547689,
            "title":"other"
        },
        "1452":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Limitless Futa",
                "Super Fetish Land",
                "Mire stories"
            ],
            "content":"<div class=\"\"><div> <span>Alright, time for my ideas for interactive stories.<br>\r\n<br>\r\nLimitless Futa: Fictional characters (and maybe even some celebrities) undergo futanari transformations, and pretty much any other fetish is allowed, except for underage characters, although aged up versions of characters that are normally underaged are completely fine. As long as you keep dickgirls involved, there should be no problems.<br>\r\n<br>\r\nSuper Fetish Land: Original characters get involved in all sorts of situations, and they’re guaranteed to be sexy for at least somebody.</span></div></div>",
            "created":1536901200,
            "id":2547693,
            "title":"My stories"
        },
        "14521":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Naruto",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, chosing categories will take too long, so why don’t we just have it be freeform.<br>\r\n<br>\r\nI’ll start with Naruto, because I already have an idea for it, and it’s probably the most likely to have other people add to it.</span></div></span></div>",
            "created":1536901200,
            "id":2547694,
            "title":"Limitless Futa"
        },
        "145211":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Tayuya",
                "somebody else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, I’ll start with my idea, a story about Tayuya.</span></div></span></div>",
            "created":1536901200,
            "id":2547695,
            "title":"Naruto"
        },
        "1452111":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Alright",
                "different story."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, now I’ll give readers a choice to make their own story, but first I’ll let you follow my idea: Demon Goddess Tayuya!</span></div></span></div>",
            "created":1536901200,
            "id":2547696,
            "title":"Tayuya"
        },
        "14521111":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Breaking Temari",
                "Skip ahead"
            ],
            "content":"<div class=\"\"><div> <span>After her battle with Shikamaru was interrupted by Temari, Tayuya seemingly died, but this was not the case, for she had actually achieved a far greater power than she had even known before, the power of a goddess. Now she has a monstrous cock, with massive balls hanging underneath, big and juicy tits, DD cup, her armpits have jungles of hair, the same reddish pink as the hair on her head, and her crotch is also covered in it, especially her scrotum. She can expand or contract her foreskin at will, or form a vacuum seal to act as a sort of condom, capable of being filled with anything that comes out of her urethra. Her ass is also quite huge, and her pubes stretch across her taint and reach to circle her anus. She has amazing powers too, being able to alter her own body any way she sees fit, or changing someone else’s body with a single touch. During the Fourth Shinobi World War, instead of being reanimated with her former teammates, because she still lived on, she decided to reveal herself, anding the war and subjugating all. She was the undisputed goddess of the world, and her first act was to dominate the bitch who nearly killed her.</span></div></div>",
            "created":1536901200,
            "id":2547697,
            "title":"Alright"
        },
        "145211111":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>“It can’t be, you’re supposed to be dead!”<br>\r\nTemari didn’t know what to do, that sound girl she killed a few years ago was back, and now she was demonstrating an unbelievable power. “Sorry, but all you did was pin me down and piss me off! Now allow me to return the favor,”<br>\r\n<br>\r\nTemari’s clothes disintegrated, leaving her completely naked, desperately trying in vain to cover her shame. Tayuya laughed at how embarrassed her new fucktoy was becoming, “Now how should I start? I could stick your face in one of my pits, or I could pin you under my big fucking balls, but I’d love to have you eat all my dickcheese!”<br>\r\n<br>\r\nAs she said this, her foreskin pulled back, revealing an ungodly amount of reeking smegma. Temari tried to pinch her nose, but her fingers didn’t clamp her nostrils shut, they stopped just before making contact with her nose. “Maybe I’ll do all of that in order, now come sniff, bitch.” Temari couldn’t control herself, she began walking towards Tayuya, and despite her best efforts not to, stuck her face right into her right armpit. The stench was overwhelming, yet she was compelled to inhale the odor and even start licking the hairy underarm. After a few minutes, she switched yo the other pit, which was just as horrible, even though she had experienced one already.<br>\r\n<br>\r\nTemari finally removed herself from the armpit, and now had another look at the monster cock of her tormentor, the foreskin had once again covered the end, and in fact had stretched, and like a condom, seemed to be filled with something that stretched it out, “You’re pretty good at tonguing armpits, that was one of the hest orgasms I’ve had in a while. Ahhhhhh,” so her foreskin actually was holding in her jizz? And it began expanding again, but based on the satisfied noise she was making, and the fact that she wasn’t erect again yet, “Are you pissing yourself?!” “Why the fuck not! There’s nobody to stop me!”<br>\r\n<br>\r\nSpeaking of which, everyone else seemed frozen in time. Either she had somehow placed everybody under a massive genjutsu, or she actually stopped time! Tayuya’s foreskin suddenly began contracting, yet none of the fluid that was sloshing around inside seemed to be spilling out. Soon her smegma coated glans was once again visible, and now had even more vile cocksludge caked on, “Now lie down and let me teabag you, if you liked my pits, you’ll LOVE my ballsweat!” Tayuya said somewhat sarcastically.</span></div></div>",
            "created":1536901200,
            "id":2547715,
            "title":"Breaking Temari"
        },
        "1452111111":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Sakura Haruno",
                "Sasuke and Tobi"
            ],
            "content":"<div class=\"\"><div> <span>Temari couldn't stop herself from doing as her mistress ordered. She simply couldn't stand, and fell onto her back. Tayuya stepped over to position her sack above the sand kunoichi's face, \"This is perfect, there's no way your mouth can fit my nuts, but you'd better open wide anyway.\" And as she said, Temari's mouth opened, just in time for Tayuya's scrotum to cover most of her face. The blonde's nostrils were infiltrated by pubes, forcing her to smell the rank ballsweat. Her mouth couldn't fit much, but it made for an easy sweat receptacle. Tayuya shifted herself from time to time to change which parts of her balls were where, as well as raising and lowering them. Eventually, she was done using her unshaved nutsack to torment her current plaything, now it was time for the main event. Temari rose to her knees, her face only 3 inches from the tip of Tayuya's schlong, \"Hope your stomach isn't too full from all of my sweat, cause that was just an appetizer, you've just won an all you can eat serving of dickcheese!\"she shoved her stinking rod towards the sand slut's face, causing her to reel back, \"The longer you put this off, the nastier my cock gets, so unless you're already a perverted whore who WANTS me to be as stinky as possible, you'd better hurry up. I know your mouth isn't big enough yet to get around my shaft, so you'll have to lick every square inch of smegma off with just your tongue.\"<br>\r\n<br>\r\nTemari reluctantly leaned in, and stuck out her tongue. When her tastebuds reached the foul substance, she felt the urge to vomit, as if she had just tasted poison, but nothing came out of her mouth but distressed sounds, unable to stop herself from licking away the rancid filth from the behemoth of a penis she had been so unfortunate to have encountered. Nearly an hour after she started, Temari had finished, Tayuya's previously smegma coated wasteland of a cock had been licked spotless, but this was still only the beginning of Tayuya's dominance. \"How are you feeling, Bitch? Bet you wish I never returned, but I don't really care what you want, I care about what <i>I</i> want, and right now I want that whorish mouth of yours to fit anything I decide to put in it,\"<br>\r\n<br>\r\nTemari was changing. Her lips and jaw became numb, and when Tayuya thrust her cock at the gaping maw, it slid in effortlessly, despite how thick it was. Tayuya then pulled her cock out and instead had Temari's mouth envelop her scrotum, a previously impossible task. \"I wonder who I should fuck next?\"</span></div></div>",
            "created":1536987600,
            "id":2547969,
            "title":"continue"
        },
        "1453":{
            "choices":[
                "Enter Adula",
                "Other stories",
                "Other stories"
            ],
            "content":"<div class=\"\"><div> <span><b>Hero vs Hero</b><br>\r\n<br>\r\nWelcome to the fantasy world of Adula, where heroes, monsters and deities wage a daily battle for supremacy. Create your character and test them against challengers to see who'll come out on top.<br>\r\n<br>\r\nBasically as the summary said, this is a vs interactive where you create a character and have them fight against characters.<br>\r\n<br>\r\n<b>Rules...</b><br>\r\n<br>\r\nCharacters are divided into categories. Currently, there's three; deities, monsters and heroes (I'll let people add other categories). Some categories may have special rules of their own to make things interesting. You can challenge someone from any category.<br>\r\n<br>\r\nYou're not required to accept a challenge.<br>\r\n<br>\r\nNo ending chapters, we have limited room to work with after all. When a battle ends post an updated version of your character's bio in the next chapter.<br>\r\n<br>\r\n<i>Example:</i><br>\r\n<br>\r\n<i>Character A has defeated Character B!<br>\r\n<br>\r\nChoice 1: Character A's Updated Bio<br>\r\n<br>\r\nChoice 2: Character B's Updated Bio</i><br>\r\n<br>\r\nOn the updated bio, you can give your character new abilities they gained by winning the fight. Or, if they lost the battle, you can detail what abilities they lost.<br>\r\n<br>\r\nDon't make your character unbeatable.<br>\r\n<br>\r\nDon't self-proclaim your victory and always give your opponent a chance to respond.<br>\r\n<i>What not to do: \"My character punches yours in the face and knocks them out, I win!\"</i><br>\r\n<br>\r\nRespect and abide by a person's Battle Conditions, which I'll go over in the bios themselves.<br>\r\n<br>\r\nNo one line entries.<br>\r\n<br>\r\nYou can find a categories special rules and the character bio's on their main page.<br>\r\n<br>\r\nFeel free to message me if you have any questions.<br>\r\n<br>\r\n</span></div></div>",
            "created":1537851600,
            "id":2553858,
            "title":"Hero vs Hero"
        },
        "14531":{
            "choices":[
                "Deities",
                "Others"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Welcome to Adula, begin by choosing your category.</span></div></span></div>",
            "created":1537851600,
            "id":2553872,
            "title":"Enter Adula"
        },
        "145311":{
            "choices":[
                "Create a Deity",
                "Other deities"
            ],
            "content":"<div class=\"\"><div> <span>The Deities of Adula re among the most powerful beings in the world. But even they aren't above being usurped or defeated. If you want to embark down this path, know that it'll be a constant struggle to stay on top. Do you think you're up for the challenge?<br>\r\n<br>\r\n<b>(Special Rules…)</b><br>\r\nDeities are organized by a power level system that determines the amount of abilities you can have. Your level is determined by how many worshipers you have.<br>\r\n<br>\r\nIf you defeat a deity you can steal up to half their worshipers, or none at all if you prefer.<br>\r\n<br>\r\nIf you defeat a monster, all the people who were afraid of it will start worshiping you.<br>\r\n<br>\r\nIf you gain enough worshipers, you’ll move up a level.<br>\r\n<br>\r\nEach deity has a domain, whether literal (The sun, fire, ice) or abstract (war, death, love).<br>\r\n<br>\r\nDeities can’t die, they can only lose all their worshipers.<br>\r\n<br>\r\nYou can start with a maximum of 50,000 worshipers.<br>\r\n<br>\r\n<b>(God Levels…)</b><br>\r\nKing/Queen of the Gods: A title given to whoever’s the strongest deity. If you character currently has this title you’re rewarded with this special ability.<br>\r\n<i>King/Queen’s Decree: If you defeat a deity you can take all their worshipers if you want.<br>\r\n</i><br>\r\nYou lose this ability if someone surpasses you.<br>\r\n<br>\r\nSupreme Deity: 1,000,000+ Worshipers <br>\r\nMaximum abilities: 14<br>\r\n<br>\r\nLegendary Deity: 500,000-1,000,000 Worshipers<br>\r\nMaximum abilities 12<br>\r\n<br>\r\nHigh Deity: 150,000-500,000 Worshipers<br>\r\nMax abilities: 10<br>\r\n<br>\r\nDeity: 50,000-150,000 Worshipers<br>\r\nMax abilities: 8<br>\r\n<br>\r\nLesser Deity: 10,000-50,000 Worshipers<br>\r\nMax abilities 6<br>\r\n<br>\r\nIdol: 1,000-10,000 Worshipers<br>\r\nMax abilities: 4<br>\r\n<br>\r\nSpiritual Guide: 1-1,000 Worshipers<br>\r\nMax abilities: 2<br>\r\n<br>\r\n<br>\r\n<b>Deity Bio</b><br>\r\n<br>\r\nName:<br>\r\n<br>\r\nGender:<br>\r\n<br>\r\nAppearance:<br>\r\n<br>\r\nPersonality:<br>\r\n<br>\r\nDomain:<br>\r\n<br>\r\nNumber of Worshipers:<br>\r\n<br>\r\nAbilities:<br>\r\n<br>\r\nHistory:<br>\r\n<br>\r\n<b>Battle Conditions</b> (What you're willing to let happen in battle or after it. Answer \"allowed\" or \"disallowed.\")<br>\r\nTorture:<br>\r\nEnslavement:<br>\r\nExcessive violence:<br>\r\n(You can add anything else you are/aren't willing to have happen to this list.)</span></div></div>",
            "created":1537851600,
            "id":2553887,
            "title":"Deities"
        },
        "1453111":{
            "choices":[
                "Challenger 1",
                "More Challengers"
            ],
            "content":"<div class=\"\"><div> <span><b>Name</b>: Hilda<br>\r\n<br>\r\n<b>Gender</b>: Female<br>\r\n<br>\r\n<b>Appearance:</b> A suntanned woman with blue eyes and long black hair that she keeps wild and free. She wears dark blue armor and a matching crown. She carries a silver trident.<br>\r\n<br>\r\n<b>Personality:</b> She's a woman with a relaxed and easygoing attitude until someone manages to annoy her. When angered she's a merciless force that doesn't care what gets in her way.<br>\r\n<br>\r\n<b>Domain</b>: The Sea<br>\r\n<br>\r\n<b>Number of Worshipers</b>: Lesser Deity, 25,000 Worshipers<br>\r\n<br>\r\n<b>Abilities:</b><br>\r\n<br>\r\n<b>Underwater Breathing (passive)</b>: She can breath underwater.<br>\r\n<br>\r\n<b>Supernatural Speed (passive)</b>: She has superhuman speed and agility.<br>\r\n<br>\r\n<b>Swimming Speed (passive):</b> In water, her speed is further increased.<br>\r\n<br>\r\n<b>Water Manipulation:</b> She can control any seawater that's around her to an extent.<br>\r\n<br>\r\n<b>Pull of the Abyss:</b> Once somebody falls into water she can will the ocean itself to pull them underneath.<br>\r\n<br>\r\n<b>Tsunami:</b> She causes a great tidal wave to wash over the shore.<br>\r\n<br>\r\n<b>History:</b> Once a small idol on a seashore village, Hilda has since grown and gained new worshipers as the village expanded until she became a Lesser Deity. She could gain more if she wasn't so lazy.<br>\r\n<br>\r\nBattle Conditions<br>\r\n<b>Torture:</b> Allowed<br>\r\n<b>Enslavement:</b> Allowed<br>\r\n<b>Excessive violence:</b> Disallowed</span></div></div>",
            "created":1537851600,
            "id":2553953,
            "title":"Goddess of the Sea"
        },
        "1453112":{
            "choices":[
                "Create a deity",
                "More slots"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Another slot.</span></div></span></div>",
            "created":1537851600,
            "id":2553958,
            "title":"Other deities"
        },
        "145312":{
            "choices":[
                "Monsters",
                "Other categories"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More categories!</span></div></span></div>",
            "created":1537851600,
            "id":2553890,
            "title":"Others"
        },
        "1453121":{
            "choices":[
                "Create a Monster",
                "Other monsters"
            ],
            "content":"<div class=\"\"><div> <span>The world of Adula is filled with many frightful monsters of many different shapes and kinds. Unlike deities who thrive off devotion and love, monsters thrive off of the terror and hatred they inspire. But be careful, no one's afraid of a monster after it's been defeated.<br>\r\n<br>\r\n<b>(Special Rules)</b><br>\r\n<br>\r\nMonsters are divided into power levels that determine their maximum number of abilities. Their level is determined by how many people fear them (AKA: the Fearful).<br>\r\n<br>\r\nYour number of fearful increases depending on who you defeat. If you defeat a fellow monster, you can steal up to half it's fear rating.<br>\r\n<br>\r\nIf you defeat a deity, all their worshipers will become fearful of you.<br>\r\n<br>\r\nIf you defeat a hero, you gain fearful depending on their fame.<br>\r\n<i>Example: If you defeat a hero with 100 Fame, you add 100 to your number of fearful.</i><br>\r\n<br>\r\nYou can start with a maximum of 50,000 Fearful.<br>\r\n<br>\r\nAny defeat causes you to lose a minimum of 5,000 Fearful (This doesn't apply to monsters who don't have that many).<br>\r\n<br>\r\n<b>Monster Levels</b><br>\r\n<br>\r\nKing/Queen of Monsters: A special title given to whoever's the most feared monster.<br>\r\nReward: One extra ability<br>\r\n<br>\r\nApocalypse Bringer: 1,000,000+ Fearful<br>\r\nMax abilities: 14<br>\r\n<br>\r\nDemon: 500,000-1,000,000 Fearful<br>\r\nMax abilities 12<br>\r\n<br>\r\nDestroyer: 150,000-500,000 Fearful<br>\r\nMax abilities: 10<br>\r\n<br>\r\nMonster: 50,000-150,000 Fearful<br>\r\nMax abilities: 8<br>\r\n<br>\r\nCreature of Nightmares: 10,000-50,000 Fearful<br>\r\nMax abilities: 6<br>\r\n<br>\r\nBoogeyman Figure: 1,000-10,000 Fearful<br>\r\nMax abilities: 4<br>\r\n<br>\r\nUrban Legend: 100-1,000 Fearful<br>\r\nMax abilities: 2<br>\r\n<br>\r\n<br>\r\n<b>Monster Bio</b><br>\r\n<br>\r\nName:<br>\r\n<br>\r\nGender:<br>\r\n<br>\r\nAppearance:<br>\r\n<br>\r\nPersonality:<br>\r\n<br>\r\nNumber of Fearful:<br>\r\n<br>\r\nAbilities:<br>\r\n<br>\r\nHistory:<br>\r\n<br>\r\nBattle Conditions (What you're willing to let happen in battle or after it. Answer \"Allowed or \"Disallowed\")<br>\r\nDeath:<br>\r\nEnslavement:<br>\r\nTorture:<br>\r\nExcessive violence:<br>\r\n(You can add anything else you are/aren't willing to have happen to this list.)</span></div></div>",
            "created":1537851600,
            "id":2553929,
            "title":"Monsters"
        },
        "1453122":{
            "choices":[
                "Heroes",
                "Other categories"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even More categories!</span></div></span></div>",
            "created":1537851600,
            "id":2553939,
            "title":"Other categories"
        },
        "14531221":{
            "choices":[
                "Create a Hero",
                "Other heroes"
            ],
            "content":"<div class=\"\"><div> <span><b>(Special Rules)</b><br>\r\nHeroes work differently from deities and monsters as their power is determined by experience, rather than devotion or fear. Positive experience will make them stronger while negative experience may give them a new weakness.<br>\r\n<br>\r\nWhenever you win a battle you gain an ability.<br>\r\n<br>\r\nWhenever you lose a battle you gain a weakness.<br>\r\n<br>\r\nYour abilities and weaknesses can be physical or magical.<br>\r\n<br>\r\nIn addition to experience, heroes have fame. Which they gain through defeating others, whether they be heroes, deities or monsters. For every 10,000 Fame you gain you can choose a weakness to get rid of.<br>\r\n<br>\r\nDefeating a deity/monster with 10,000 points or less earns you 5,000 Fame.<br>\r\n<br>\r\nDefeating a deity/monster with 10,000 to 150,000 points earns you 10,000 Fame.<br>\r\n<br>\r\nDefeating a deity/monster with 150,000 to 500,000 points earns you 15,000 Fame<br>\r\n<br>\r\nDefeating a deity/monster with 500,000+ points earns you 20,000 Fame<br>\r\n<br>\r\nDefeating the King/Queen of the Monsters/Gods earns you 25,000 Fame<br>\r\n<br>\r\nBeing defeated by a monster/deity costs you 10,000 Fame.<br>\r\n<br>\r\nDefeating a hero with more fame than you puts you on their level.<br>\r\n<i>Example: If you defeat a hero with 25,000 Fame your fame also becomes 25,000</i><br>\r\n<br>\r\nBeing defeated by a hero with less fame than you brings you down to their level.<br>\r\n<i>Example; If you're defeated by a hero with 5,000 Fame your fame also becomes 5,000</i><br>\r\n<br>\r\nYou can start with a maximum of 10,000 Fame.<br>\r\n<br>\r\nYou start with at least one weakness and a maximum of five abilities.<br>\r\n<br>\r\n<br>\r\n<b>Heroes Bio</b><br>\r\n<br>\r\nName:<br>\r\n<br>\r\nGender:<br>\r\n<br>\r\nAppearance:<br>\r\n<br>\r\nPersonality:<br>\r\n<br>\r\nFame:<br>\r\n<br>\r\nAbilities:<br>\r\n<br>\r\nWeaknesses:<br>\r\n<br>\r\nHistory:<br>\r\n</span></div></div>",
            "created":1537851600,
            "id":2553947,
            "title":"Heroes"
        },
        "15":{
            "author_id":"karateboy124",
            "author_name":"XenoWolfHybrid",
            "choices":[
                "Shrinking storyline",
                "Absorption storyline",
                "Strange Device storyline",
                "Wishing storyline",
                "Power storyline"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>A breast vore and pregnancy story. Have Fun.</span></div></span></div>",
            "created":1533618000,
            "id":2530438,
            "title":"Story 5"
        }
    },
    "info":{
        "author_id":"halothecool",
        "author_name":"Halothecool",
        "brief_description":"For those who wish to make one but dont have member ship",
        "created":1527660780,
        "description":"<td align=\"left\" class=\"norm\">Create your own interactive obviously i cant make the rules cause then it wouldn't be yours <br>\r\nSo anything goes no rules at least from me <br>\r\nHope you take advantage of this</td>",
        "id":2159579,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1563646200,
        "modified":1563646200,
        "pretty_title":"Make your own interactive "
    }
}