{
    "chapters":{
        "1":{
            "author_id":"wgfan",
            "author_name":"WGfan",
            "choices":[
                "Follow Pevin at work",
                "Follow Levan at work",
                "At their home in the evening",
                "They are both summoned to the kings court in the middle of their work",
                "The city is attacked"
            ],
            "content":"<div class=\"\"><div> <span>Pevin and Levan were walking hand in hand through the forest right outside the city wall. It was early morning and the morning fog was still thick in the air and the trees were moist with dew. The only sounds made were the birds singing and the soft sound of the elves walking. They were both dressed in the current fashion. Tight red coats made of good wool that fit tight. A brown leather belt placed just below the hip on the sword side and just above the hips on the other. Both elves carried their swords.<br>\r\nTheir trousers were made from doe and were smooth and gave them both good use of their agility if they needed it. It to was tight fitting, so it wouldn't get in the way or get caught in something if they were climbing or walking in rough terrain. Elf fashion had always been practical.<br>\r\n<br>\r\nThey reached their destination. a small lake where a flock of geese were still sleeping on a small island. Pevin laid down, leaning against a tree and Levan laid down partly next to him, partly on him, resting his head on Pevins chest, feeling it rise and fall with his breathing, and hearing his heart beat. None of them said anything, they just enjoyed the beutifull morning, watching the sun rise rise over the distant mountains. As the sun rose higher the fog disappeared and the chilled air began to warm. When the sun reached them Levan began to unbutton his coat. Pevin stroked his toned chest muscles gently. Levan had a lean muscled build with a toned chest and slight abs, beeing an archer for a hobby and working as a carpenter had given him some impressive arms and Pevin enjoyed having Levan flex them while he was holding them, but for now he was satisfied just admiring his torso.<br>\r\nLevan placed his coat on the ground next to them and began unbuttoning Pevins. Pevin was a scribe and worked at the palace copying important documents and was a lot skinnier than Levan. Lean and a bit lanky he was not as strong as Levan, but took pride in being faster and far more agile.<br>\r\n<br>\r\nLevan finished the buttons on Pevins coat and tossed it to the side. He pulled of his trousers while Pevin took of his He then wrapped his arms around Pevin and the kissed deeply. Still not a word had been uttered. Levan stroked Pevins strong tights and buried his nose in his long brown hair. Pevin gently caressing Levans tight ass, enjoying the shape and feel of it. Still not a word. They laid there fondling each other for almost an hour. This was how the both liked to start a nice summerday. The sound of the morning bell soon broke the silence, telling everyone that it was soon time to go to work. Pevin and Levan let go of each other and got dressed.<br>\r\n\"I often wish we could just lie like that for all time.\" said Pevin.<br>\r\n\"I do to, but thats not how life is.\" Levan replied, giving Pevin a kiss on his cheek<br>\r\nPevin, who was slightly taller, gave Levan a kiss at the top pf his pointy ear before he began walking back to the city.<br>\r\nLevan waited a few moments before sprinting up to Pevin, jumping up on his back, and started to tickle his sides and nibbles on his left ear: \"You little tease.\" he said.<br>\r\nPevin quickly lost balance and the two laughing elves rolled around on the ground tickling and kissing each other before Pevin placed himself firmly on Levans chest and said: \"We will be late for work if you continoue like this.\"<br>\r\n\"Let's be late, one day won't hurt.\"<br>\r\n\"We were late yesterday, remember?\"<br>\r\n\"Of yeah.\" Levan gave him a sheepish grin.<br>\r\nPevin rolled of Levans body and got up. He brushed of his coat.<br>\r\nThe bell struck again, meaning they were both about to be late, specially Pevin, who had to go all the way to the palace across the city.<br>\r\n\"I am looking foreward to see you this evening.\" Pevin said, kissing Levan on his cheek before sprinting off.<br>\r\nLevan saw Pevin run around the city wall corner to the gate. His tight trousers let him see how the muscles in his legs worked, how Pevins butt moved with his fast strides. He then began running himself.</span></div></div>",
            "created":1307300340,
            "id":1120346,
            "title":"Pevin & Levan"
        },
        "12":{
            "author_id":"wgfan",
            "author_name":"WGfan",
            "choices":[
                "Pevin walking towards him",
                "Pevin running towards him",
                "The guard surround him",
                "His boss looking at him",
                "A fire"
            ],
            "content":"<div class=\"\"><div> <span>Levan reached his work just in time. He pulled off his belt, sword and red coat, folded it and put it away. He then took on a more sturdy work shirt. He and five other carpenters were working on a new home near the east wall. He jumped up, grabbed hold off the scaffold and pulled himself up. He adjusted his tool belt before walking round til the corner where he was almost finished.<br>\r\nHe liked being a carpenter, he was outside, he did something truly usefull and he got to use his muscle, not to mention how much muscle he had thanks to his work. His co-workers were working siliently around him, everyone knew what to do and elves don't belive in making conversation while working.<br>\r\n<br>\r\nAfter three hours of working Levan was sweat and warm, working in the sun, and was just about to take a break and get himself some cold water from a nearby well. He put his hammer away and was just about to jump down when he saw...</span></div></div>",
            "created":1310138400,
            "id":1143186,
            "title":"Follow Levan at work"
        },
        "14":{
            "author_id":"wgfan",
            "author_name":"WGfan",
            "choices":[
                "\"We are at war\"",
                "\"It has come to my attention that you two are lovers\"",
                "\"Please, have some tea\"",
                "\"So, there you are\"",
                "\"I need you to go on a quest for me\""
            ],
            "content":"<div class=\"\"><div> <span>Pevin was looking through a shelf full of old scrolls when a royal page appeared in the doorway. The page looked around for a moment before he hurried over to Pevin.<br>\r\n\"You are expected at court. Please follow.\" Then the page began walking. Pevin hurriedly put down the scrolls he was holding and followed. What could the king possibly want with him? He hoped it wasen't something serious.<br>\r\nThey entered the palace square. The square was huge and cobblestone marked an intricate pattern all over it. According to rumors it looked like a dragon from the palace towers, but only the royal familiy knew if that was true. Not even servants were allowed into the highest tower.<br>\r\nIn the middle of the square there was a fountain, not very big, but very beautifull. It was a detailed statue of King Ervin the 1st, the founder of the kingdom, who united the elves more than 3000 years ago. Legend had it he was 300 years by the time he died, while most elves never lived past 215.<br>\r\nThe palace was a huge building. Three large domes marked the corners of the triangular construction. Each dome was connected by wide buildings, leaving a triangular open area in the middle. In the of this area was the tower. The highest building ever made. It was connected to the palace by narrow buildings, hardly wider than an average corridor, one from each of the three buildings connecting the domes, dividing the open space in the middle into three equal parts completly divided from each other. One was the royal garden, one contained a well and was used by servants for drying washed clothes, and it also contained a stable. The last was used by the guard. It contained their barracks and the practicing field. Of course, this was not visible from the palace square. One of the straight buildings ran the entire lenght of the place, so that of the two domes marked one end of the square each. That was the northern dome and the southern dome. The one on the far side was the kings dome.<br>\r\nAs they neared the huge entrance gates Pevin saw another page appearing at the other side of the square with another elf following, it only took him a moment to recognise Levan.<br>\r\nPevins page stopped and waited for Levan and his page to catch up with them before the entered the gate. Pevin and Levan did not talk as the walked through the huge ornate doors and into the palace. The only exchanged confused looks. Inside the palace was pure beauty. Gigantic tapestries covered the walls. The columns supporting the roof was made to look like trees with branches spreading out across the ceiling. The tapestries mostly had images of nature and the floor was covered with green carpets, making the inside resemble the forest around the city. There were only a few guards to be seen, and no defences at all. The thought behind the construction was that if the enemy had managed to reach the palace, then the fight was lost anyway.<br>\r\nOnce inside one page, Levans, ran ahead to announce their arrival while the other one led Pevin and Levan through the straight corridor. There were doors on both sides with uneven distance and Pevin was very curious as to what might be behind them. There were a few servants walking around doing there tasks, but the palace wasen't exactly crowded. They reached the southern dome and kept walking on towards the kings dome.<br>\r\n\"What do you think the king wants with us?\" Levan broke the silence giving Pevin a worried glance.<br>\r\n\"I do not know Levan. But it must be important since the king sent pages to summon us from work.\" Pevin meant to say something reassuring, but couldn't think of anything to say.<br>\r\nThe doors leading into the kings dome was about 50 meters away when the page suddenly turned right and walked through a doorway. They pased through what looked look like a small ballroom and out an ornate wooden lattice door and found them self in the royal garden. Small gravel roads led between decorative flowerbeds, small goldfish ponds, shrubberys cut into great figures and small trees. At a little gazebo they found the king. Levan and Pevin both bowed deeply. The king was a large man. Unlike most elves, who were lean and athletic, the king was a rather fat elf. His huge belly covered most of his lap and his gold embroided tunic looked strained.<br>\r\nThe King motioned for them to sit. Once seated the king pulled out a scroll and looked at them and said...</span></div></div>",
            "created":1307311020,
            "id":1120441,
            "title":"They are both summoned to the kings court in th..."
        },
        "145":{
            "author_id":"wgfan",
            "author_name":"WGfan",
            "choices":[
                "They are awaken by their horses and gear arriving",
                "They oversleep and wake at noon",
                "Levan is awakend by Pevin making breakfast"
            ],
            "content":"<div class=\"\"><div> <span>The King motioned for them to sit. Once seated the king pulled out a scroll and looked at them and said:\" I need you to go on a quest for me.\"<br>\r\nPevin and Levan looked at each other, then at the king.<br>\r\nThe king sees there confusion and continues: \"According to legend, King Silivian the 3rd dispatched a caravan containing his most precious belongings off to safety when it seemed that the trolls would attack the city 1200 years ago. As we all know the trolls forgot the time and turned to stone just as they breached the city wall, and was then used in rebuilding the wall. But the caravan was lost. A few months ago one of our scholars discovered a scroll, this scroll actually (he waved the scroll in his hand), and he believes, from whats written here that king Silivan the 3rd knew all the time where the caravan was, but kept it secret in case he would need to flee the city. We all know he wasen't exactly popular. However, the revolt never came and Silivan died somewhat peacefully when he drowned in the fountain (the king pointed towards a small fountain) after falling asleep in it drunk. Anyway. We believe the caravan was hidden in the mountains in one of the newly abandoned troll caves. Your task is to go there, see if the caravan is there and return here to tell about your discovery.\"<br>\r\n\"We are honored your majesty,\" Pevin began, but before he could continue Levan broke in: \"But your highness, why us?\"<br>\r\n\"I have very good reasons. Pevin, you are said to be one of our best climbers and a tremendous runner. Levan, I have seen your archery myself at the summer festival and know you to as good an archer as any one in the army. I'm also told you two are lovers, and lovers tend to have a formidable way of looking after each other. Also, I know you two can be trusted, I have a hunch about that, and my hunches are never wrong in this things. Now, off with you, I want you out of the city by noon tomorrow. You will be provided with horses and gear. And of course, this is secret. Your official task is to investigate a rumor about troll activity i had planted last week.\"<br>\r\n<br>\r\nPevin and Levan left the palace a bit baffled. None of them knew quite what to think. Once home, Pevin found a map and began plotting their route.<br>\r\n\"Can we stop by Pasva? I would like visit my sister. Levan asked.<br>\r\n\"That can be done, Pasva will be a practical place to buy more supplies. And it will take us by the fields, safe ways and inns to stop at.\"<br>\r\nLevan put his arms around Pevin and said: \"I am actually looking foreward to this. The two of us, alone for weeks. Out on adventure.\" He began to snuggle Pevins neck. Pevin grabbed Levans head and pulled him into a kiss. Still kissing, Levan pulled Pevin up off the chair and began taking of his coat, Pevin was already unbuttoning his trousers. Soon the lay naked in bed. Pevin was kissing his way up Levans left thigh. Levan was laying still letting out small moans of pleassure as Pevin was getting closer to his cock. When Pevin reached it he began to lick and suck it making Levan curl with pleasure. when Pevin felt Levan was about to come he stopped and continued kissing his way up. He took a pause at Levans naval to lick it. He than kissed his way up to Levans mouth and they locked in a long kiss, rolling around and touching all over each others bodies. After some minutes of kissing and twisting they unwrapped each other and Levan pushed Pevin down into the madras. He pushed his stiff cock into Pevin and began to ride him. They both moaned and grunted and breathed loudly, faster and faster until they both came, almost simultaneously. Afterward they lay caressing each other as sleep slowly came over them.</span></div></div>",
            "created":1307313840,
            "id":1120467,
            "title":"The quest begins"
        },
        "1453":{
            "author_id":"wgfan",
            "author_name":"WGfan",
            "choices":[
                "Say goodbye to their friends",
                "Take a walk around the city",
                "Leave early"
            ],
            "content":"<div class=\"\"><div> <span>It was dawn the following day. Levan opened his eyes for a brief moment before snoozed off again. Lost in the comfortable stage halfway between asleep and awake he reached out for Pevin, but his hand just found air. The surprise of finding his boyfriend gone woke him up immediately. He looked around a bit confused but the smell of frying bacon soon calmed him down.<br>\r\nHe got out of bed and walked to the kitchen. The kitchen was not huge, but big enough for two elves. A small stove stood by the outer wall right under the rooms only window. A bench stood to the left of it while the wall separating the kitchen from the living room was to the left. The room also held two cupboards and a sink. A bucket of water from the well in the backyard was placed on the floor, next to the hatch that led down to the cool cellar storage, at the other end of the room was a small table with two chairs.<br>\r\nPevin was fully dressed and was making breakfast, egg, bacon and fresh bread from the bakery. Levan, still naked after sleeping, went to set the table.<br>\r\n\"Morning dear.\" Pevin said.<br>\r\n\"Good morning. Been awake long?\" Levan said.<br>\r\n\"Just over an hour. I went to get our supplies. We get one riding horse each, and one pack horse.\"<br>\r\n\"That is good. I was slightly worried we would have to carry everything on our backs\"<br>\r\n\"Your back looks perfectly able to me.\" said Pevin, looking at Levans bare defined back. Levan noticed and flex his back smiling at Pevin. Pevin placed the now done bacon and eggs on the bench and leaped at Levan, clinging to his back.<br>\r\n\"You are a cute little tease.\" He said jokingly before kissing the back of Levans neck, \"I love the way I can feel your muscles tense to support me, the way your muscles pumps up from the strain.\"<br>\r\nPevin slid a bit down Levans back, using his left hand to hold onto Levan across his chest while his right hand began gently touching his cock. It only took a few strokes before Levans body responded to the touch and sent blood to erect his cock. Pevin chuckled gently as Levans breathing became heavier and began going over to small groans.<br>\r\nLevan gently dropped to his knees reached for a towel that lay just within reach on the back of a chair.He got it just in time to keep his semen from spilling over the floor. He let out one last passionate moan before letting himself fall forward, careful not to crush his still erect cock.<br>\r\nPevin, still on his back, began to stroke his sides and trace the middle of his back.<br>\r\n\"The bacon is getting cold.\" said Levan.<br>\r\n\"I could use something cold.\" Said Pevin. Levan could feel Pevins hard cock through his trousers.<br>\r\n\"Would you like to play now, or eat first?\"<br>\r\nPevin thought for a moment: \"Eat I guess. I'm starved, and we still have another 5 hours before we must leave.\"<br>\r\n<br>\r\nThey ate in silence because none of them could think about anything to say. They did not really talk much, they mostly understood each other without words.<br>\r\n<br>\r\nAfter breakfast they went back to bed and spent the next two hours with passionate sex, often stretching their agility in order to find new exciting ways to achieve pleasure.<br>\r\n<br>\r\nIt was still some hours till noon so the two elves decided to...</span></div></div>",
            "created":1307480940,
            "id":1121551,
            "title":"Levan is awakend by Pevin making breakfast"
        },
        "14533":{
            "author_id":"wgfan",
            "author_name":"WGfan",
            "choices":[
                "Levan throwing him in the lake",
                "Levan screaming"
            ],
            "content":"<div class=\"\"><div> <span>The time was only 10 am, but since neither had anything more to do, Pevin and Levan decided to get going. It was a fine day, the sun was shining and there were only a few white clouds in the sky. The city was crowded with elves going about their business and noone paid any attention to two young elves leaving town.<br>\r\nThey weren't the only ones traveling out of time. A steady stream of travelers was going out the gates, but none arrived. It was to early for that. Most travelers would have spent the night the closest village, Grenvale. The arrivals usually came closer to 3pm.<br>\r\nOutside the city wall a few meters of forest was removed to make some view for the guards, but not much. Elves dislike to chop down trees and never took down more than they had to.<br>\r\n<br>\r\nPevin and Levan traveled in silence, neither felt like talking. They just enjoyed the soft wind, the singing birds and the steady movement of their horses. After about one hour of riding Levan jumped of his horse and began jogging next to it. Pevin just smiled and followed, Levan had never liked to sit still for long, and Pevin also felt the need to stretch his legs a bit. They kept a decent pace jogging beside their horses for about 40 minuttes, then they reached a lake called Fog Lake, since the morning mist always lingered til long past noon on it. It had been some hours since their breakfast and both elves was getting hungry and a bit tired so they lead their horses down to the shore to let them drink, then they tied them off to a tree. Pevin was finding some bread and cheese when Levan threw off all his clothes and jumped into the lake. Pevin wasen't so found of bathing so he just cut himself some bread and ate as he watched Levan play in the water, his long hair soaked and heavy clinging to his face and shoulders. He finished his lunch and leaned against a tree and enjoyed the scenery and ambience of the place. As he sits there he starts to doze off and is awakened by...</span></div></div>",
            "created":1308443940,
            "id":1128991,
            "title":"Leave early"
        },
        "145331":{
            "author_id":"wgfan",
            "author_name":"WGfan",
            "choices":[
                "You are to cute to be mad at",
                "I haven't forgiven you yet"
            ],
            "content":"<div class=\"\"><div> <span>As he sits there he starts to doze off and is awakened by Levan throwing him in the lake. Pevin screams from the shock and his mouth fills with water. He surfaces with a gasp and sees Levan laughing.<br>\r\nhe stands up, he can just touch the bottom and half swims, half walks towards land. Once there, Levan helps him up, still laughing.<br>\r\n\"Idiot.\" Pevins says, taking of his coat and hanging it in the tree to dry.<br>\r\n\"Are you not going to dry the rest?\" Levan asks.<br>\r\nPevin takes a look at his soaked shirt, trousers and shoes: \"You did that just to get me naked?\"<br>\r\n\"Not just.\"<br>\r\n\"You could have asked me you know.\"<br>\r\n\"Yes, but it seems weird to ask someone to undress.\"<br>\r\n\"Even your boyfriend?\" Pevin asks as he starts taking off the rest of his clothes.<br>\r\n\"Sometimes, like when he is sleeping.\" Levan says with a grin.<br>\r\n\"Well, remember this for the future, if you like your boyfriend to wake up in a good and cozy mood, don't throw him in the water.\"<br>\r\n\"I'll try my best.\" Levan said, walking up to Pevin and placing his hands on his shoulders.<br>\r\nPevin embraces him and says: \"...</span></div></div>",
            "created":1315250700,
            "id":1181702,
            "title":"Levan throwing him in the lake"
        },
        "1453312":{
            "author_id":"wgfan",
            "author_name":"WGfan",
            "choices":[
                "They arrive at Grenvale",
                "Levan wants to travel off the road to avoid the crowd"
            ],
            "content":"<div class=\"\"><div> <span>Pevin embraces him and says: \"I haven't forgiven you yet\" Then he shoves Levan into the water.<br>\r\nLevan surfaces with a huge grin and begins to swim around.<br>\r\n\"I don't see why you are complaining, the water is lovely.\" He says.<br>\r\nPevin gives him a flat stare before taking off the rest of his clothes, hanging them to dry. Then he finds a dry loincloth in the clothing sack. After putting it on he sits down in the sun to dry properly.<br>\r\nAfter about half an hour Levan comes out of the water and sits down next to him.<br>\r\n\"Are you not going to put something on?\" Pevin asks.<br>\r\n\"I'm soaked, can't put on anything now.\"<br>\r\n\"Someone might come\"<br>\r\n\"That's okay, I'm not shy.\"<br>\r\n\"They might be.\"<br>\r\n\"Well, then they will just leave us alone again I hope. Are you still mad at me?\"<br>\r\n\"Slightly, never do that again.\"<br>\r\n\"I wont. Sorry honey.\" Levan says, then planting a soft kiss on Pevins cheek, \"Shall we get going?\"<br>\r\n\"We should,\" Pevin says, getting up, checking his clothing, \"It's dry, got find some clothes yourself and we will be going.\"<br>\r\n<br>\r\nAfter a few minutes the elves are back on the road. It is still a steady stream of travelers, both ways now, making the road rather crowded.</span></div></div>",
            "created":1323202440,
            "id":1235749,
            "title":"I haven't forgiven you yet"
        },
        "15":{
            "author_id":"wgfan",
            "author_name":"WGfan",
            "choices":[
                "Humans",
                "Ogres",
                "Rebels",
                "Another elven kingdom declaring war",
                "Their own slaves"
            ],
            "content":"<div class=\"\"><div> <span>Pevin was copying a supply list from the Royal Army, calmly making sure his copy was as close to the original as possible. He had to make 7 copies in total. He finished the copy and began on a new, number four. He had just written the first line when the alarm bells begun to ring. The sound filled the entire palace and suddenly the calm and quietness of the scribes hall was gone as everyone ran to their battle positions. Most scribes was supposed to guard the paperwork, burning and hiding secret information should the enemy breach the inner wall that separated the royal palace, the scribes hall, the academy and the nobles district from the rest of the city. But Pevin was not guarding any secrets so his place was at the wall with the archers. He wasn't very skilled, Levan was the good shooter of the two, but civilians were placed where they would not be in the way, specially scribes, who lacked the brute force needed to be a warrior.<br>\r\n<br>\r\nPevin ran as fast as he could to the wall, taking the stairs up in long strides. At the top he was handed a bow and quiver and given a place to stand. He could hear the sound of fighting, but no smoke. That meant the outer wall wasen't breached. Pevin wondered where Levan was. Levan was a skilled archer and had earned himself a place on the outer wall during the annual archery contest.<br>\r\n<br>\r\n<br>\r\nLevan stared out across the short open field that kept the forest away from the city wall. The first wave of attackers was outside his reach, but he saw movement among the trees knowing that another wave would come soon. He had an arrow ready and stood ready to shoot on a moments notice.<br>\r\nThe first wave had passed his point of view before he arrived, but he knew who it was, messengers was running all over the place and one had taken the time to tell Levan and the other archers with him that it was...</span></div></div>",
            "created":1308606360,
            "id":1130372,
            "title":"The city is attacked"
        }
    },
    "info":{
        "author_id":"wgfan",
        "author_name":"WGfan",
        "brief_description":"Pevin and Levan are two gay elves living and having adventures in the elven kingdom",
        "created":1307297220,
        "description":"<td align=\"left\" class=\"norm\">Pevin and Levan live in the magical elven kingdom of Dorast. A kingdom filled with adventure, fun and danger.<br>\r\n<br>\r\nThis story is mostly a fantasy story, but with gay elf maincharacthers this is a bit erotica also, but it shall be a storyline here. Chapters havimg just sex are of course allowed, but remember to keep the story going.<br>\r\n<br>\r\nWhen writing sex, write it in a intresting way and do it good so we can really feel with the characters as much as one can when just reading, at leaat try your best. Remember descriptions.<br>\r\nPevin and Levan, being 18 year old elves are of course beutfull, lean and athletic with cute pointy ears.<br>\r\n<br>\r\nRated GC for more freedom.<br>\r\n<br>\r\nSo now, what will happen? Must Pevin and Levan lead a revolt against an evil king? Will they rise through the grades of society to nobles? Will they go on a long magic quest? Or will they just find a nice place to fuck? It's all your choice, the only limit is your imagination.<br>\r\n<br>\r\n<br>\r\nI will edit, rewrite or delete all chapter I feel are substandard.<br>\r\n<br>\r\n<br>\r\nP.s. Pevin and Levan does not have to be the good guys, they might very well be evil.</td>",
        "id":1782513,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1323202440,
        "modified":1323202440,
        "pretty_title":"Pevin & Levan"
    }
}