{
    "chapters":{
        "1":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Examine the Fat statue",
                "Examine the statue with the large breasts",
                "Examine the statue that was pregnant",
                "A different Statue",
                "A Combination of Statues"
            ],
            "content":"<div class=\"\"><div> <span>Sunlight trickled through the trees, changing as with the gentle breeze. Birds could be heard off in the distance, mingling with the trickle of water.  <br>\r\n\"It's not too much further.\" came Nathan's voice from behind Kat.<br>\r\n<br>\r\n\"How did you even find this place?\" Kat asked, being careful of her footing as she jumped over the stream as it crossed her path again. She turned back towards Nathan.<br>\r\n<br>\r\n\"I was doing research in the library, when I came across reference to some sort of temple or something in this forest. Doing some cross referencing, I was able to deduce the rough location of where it'd be.\" Nathan said, carefully stepping over the stream with his long legs.<br>\r\n<br>\r\nKat turned to continue walking, \"And you're sure we're getting close?\" <br>\r\n<br>\r\n\"Positive.\"<br>\r\n<br>\r\nKat smiled and kept walking. This wasn't the first time that her brother had invited her to explore some ruins with him, and she had to admit that he had a knack for finding some pretty cool places. She had no idea that there were ruins in the forest that was only an hour away from her home, as usually they had to travel to some other country to find them. Her brother had been research a civilization that was only recently re-discovered.<br>\r\n<br>\r\n\"Wow! There it is!\" Kat was brought back to the present by her brother's shout of glee, and him pushing past her suddenly.<br>\r\n<br>\r\n\"Hey! Watch it\" Kat said, punching him in the arm.<br>\r\n<br>\r\n\"Sorry, it's just so amazing!\"<br>\r\n<br>\r\nKat looked at the stone structure before them, that had just seemed to appear from nowhere. A large stone wall was set with pillars that were crumbled and cracked. Two waterfalls fell from above the large opening that had to be the entrance, creating the stream they'd been following. There were also several statues, though they were too worn to make out what they were supposed to be. <br>\r\n<br>\r\n\"This is incredible! And still in such good shape\" Nathan said, walking through the clearing towards the large structure.<br>\r\n<br>\r\nKat ran a couple of steps to catch up, continuing to look up at the building in amazement. Usually when her brother took her some place, it was to see a broken wall or statue, but never a complete building. \"This really is awesome Nathan!\" Kat mused.<br>\r\n<br>\r\nNathan whipped around to look at her, \"So should we go in?\"<br>\r\n<br>\r\nKat smiled, \"I thought you'd never ask!\"<br>\r\n<br>\r\nAs they walked into the large opening, it became clear that the temple seemed to consist of one large room. It was illuminated by several holes in the ceiling with rubble beneath them. Most of the temple seemed to be bare, except for three pedestals at the far end.<br>\r\n<br>\r\nWatching Nathan go to investigate some markings on one of the walls, Kat began to make her way towards the pedestals.<br>\r\n<br>\r\nAs she approached, she noticed that there seemed to be a statue on each pedestal. The statues were each of women, but one was fat, another had a very well endowed chest, and the third was very pregnant.<br>\r\n<br>\r\nMoving closer, she could tell that they were very detailed stone carvings. <br>\r\n<br>\r\n</span></div></div>",
            "created":1518152400,
            "id":2451063,
            "title":"The Forgotten Temple"
        },
        "11":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "full, but she felt different somehow",
                "still hungry",
                "Sluggish and heavy"
            ],
            "content":"<div class=\"\"><div> <span>Kat looked at the fat statue, intrigued that such a large woman was still able to look attractive. She took a few steps closer, but stopped when she heard a noise behind her.<br>\r\n<br>\r\nTurning suddenly to see what it was, she relaxed when she noticed Nathan holding his foot and silently cursing.<br>\r\n<br>\r\n\"Be careful over there.\" She yelled back to him, her voice echoing around the stone room.<br>\r\n<br>\r\n\"Tripped over a rock. It's kind of dangerous in here.\" He hollered back, and gingerly tried putting some weight on his foot. <br>\r\n<br>\r\nKat smirked slightly and turned back towards the pedestals, taking another couple steps towards the one with the fat statue on it. It seemed almost to be calling to her. Carefully, she stopped in front of the pedestal, and examined the statue. Even though she was incredibly fat, she still seemed to be quite beautiful with almost ageless features. Slowly, Kat reached out for the statue.<br>\r\n<br>\r\nShe recoiled her hand as an almost electric feeling filled her hand as she touched the statue. \"Ouch\" she yelped.<br>\r\n<br>\r\n\"Are you okay?\" came a voice behind her, causing her to jump. She whipped around and saw Nathan standing behind her.<br>\r\n<br>\r\n\"Yeah\" she said, looking at her hand, \"I must of pricked myself or something.\"<br>\r\n<br>\r\nNathan smiled knowingly, \"That's Yondela, the goddess of bounty. It's said that she would choose an avatar to represent her here, and that they would become the pure image of bounty. This civilization believed that they could only have good harvests by appeasing the avatar, and thus also the goddess of bounty.\"<br>\r\n<br>\r\n\"So what is the image of pure bounty?\" Kat asked, as Nathan picked up the statue to examine it closer. <br>\r\n<br>\r\n\"I'm not entirely sure. It was customary for each farmer to bring some of his harvest to the avatar in offering though.\" Nathan said quietly, continuing to examine the statue. <br>\r\n<br>\r\nBoth of them jumped slightly as Kat's stomach let out a loud growl, and Nathan almost dropped the statue.<br>\r\n<br>\r\n\"Wow, I didn't realize how hungry I was.\" Kat said, rubbing her stomach. It felt like she hadn't eaten in ages, though that could be because she'd skipped breakfast that morning in her rush to get ready. <br>\r\n<br>\r\n\"Good thing we brought some food with us.\" Nathan said, letting his backpack slip off his back.<br>\r\n<br>\r\nKat did the same and opened the big pocket. Inside was plenty of supplies for dealing with almost every possible situation imaginable. Digging around inside she soon found what she was looking for. She pulled a lunch bag out and opened it, revealing the contents of it. It wasn't long before she had finished the peanut butter sandwich, the homemade brownie, and drank the soda she'd packed. Setting down the lunch bag, she felt...</span></div></div>",
            "created":1518152400,
            "id":2451069,
            "title":"A sudden hunger"
        },
        "111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Start snacking",
                "Do homework"
            ],
            "content":"<div class=\"\"><div> <span>Kat leaned back, patting her full stomach, \"Ah, much better.\" She never realized that feeling full could feel so good. She shivered just from how good it felt.<br>\r\n<br>\r\n\"Well that's what you get when you skip breakfast,\" Nathan laughed, packing his lunch bag into his backpack, \"Although I suppose I was kind of rushing you this morning.\"<br>\r\n<br>\r\n\"Yeah, so it's your fault!\" Kat shot back, a mischievous smile on her lips as she too packed up her lunch bag. As she stood up, she felt another shiver run down her spine as her full belly made its satisfaction known. She couldn't believe how good it felt to be full.<br>\r\n<br>\r\nKat jumped as her brother tapped her on her arm, \"Are you okay?\"<br>\r\n<br>\r\nShaking her head she smiled at him, \"Yeah, I'm fine.\"<br>\r\n<br>\r\n\"You just had a weird look on your face is all.\" Nathan said, shouldering his pack.<br>\r\n<br>\r\n\"Just got cold, probably just a cross breeze.\" Kat replied, trying not to shiver again from how good her full belly felt. <br>\r\n<br>\r\n\"Alright. It is starting to get later. We should probably start heading back.\" He said, looking through one of the holes in the ceiling at the darkening sky.<br>\r\n<br>\r\nKat looked up too, wondering why she'd never realized how good it felt to be full. It was probably just because she had been starving and she was just really satisfied now that she had food in her belly. <br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- --------<br>\r\n<br>\r\nA couple hours later they were pulling into the driveway of a two story house on a quiet street in Nathan's Jeep. They both grabbed their bags and got out of the jeep, walking in silence towards the front door. Kat glanced at the immaculate flowers and other plants that filled the front yard. They always made her think of those fantasy stories where everything was so beautiful it almost didn't seem real, but here it was. After a few seconds she followed Nathan inside, shutting the front door behind her.<br>\r\n<br>\r\nInstantly her nose was greeted by the smell of lasagna coming from the kitchen. A melodic voice called from the kitchen, \"Ah, just in time you two, I just pulled dinner out of the oven.\"<br>\r\n<br>\r\n\"Hey mom-\" Nathan said as he walked into the kitchen. Kat made her way upstairs and went into her room throwing her backpack onto the floor near her writing desk. Sitting on the desk was a few books, and some unfinished homework. <br>\r\n<br>\r\nShe frowned at the thought of having to finish her homework. She'd much rather be watching tv or playing video games, but she had school in the morning. She caught sight of her thin frame in the full length mirror in the corner as she was about to leave. She'd always been thin even though she really wasn't the most active girl. Most of her physical activity was just following her brother on his adventures. Otherwise, she was usually playing video games, which was where most of the content on the posters around her room originated from. <br>\r\n<br>\r\nShe rushed downstairs, her stomach letting out a growl as she entered the kitchen. Fortunately, no one else seemed to notice it as they were already sitting around the table eating. <br>\r\n<br>\r\n\"Hey honey,\" Kat's dad said, looking up from his lasagna, \"did you two find anything cool?\"<br>\r\n<br>\r\nKat sat down, dishing up a large piece of lasagna, \"Yeah, we found what seemed like a temple.\"<br>\r\n<br>\r\n\"It has got to be one of the most important finds I've ever had,\" Nathan interrupted, \"This will really help me with my thesis paper.\"<br>\r\n<br>\r\n\"Really now. I'm so happy for you!\" their mom chimed in.<br>\r\n<br>\r\nKat dug into her food ravenously, as Nathan began explaining the significance of everything he'd found to their parents. As she started to get full, she couldn't help but realize that it just made her feel so good. She loaded up another piece of lasagna onto her plate, and devoured it too.<br>\r\n<br>\r\n\"Hungry tonight?\" Her dad asked, bringing her back to the table.<br>\r\n<br>\r\n\"Yeah, I skipped breakfast thanks to someone not giving me a chance to eat, and I guess my body's just trying to get caught up.\" Kat said as she realized how much she'd eaten, but it felt so good to be stuffed full. <br>\r\n<br>\r\n\"It's good to see you actually eating food for a change,\" her mom said, \"You could use a bit more meat on your bones.\"<br>\r\n<br>\r\n\"Yeah.\" Her dad agreed, \"we just get worried you're not eating enough most of the time.\"<br>\r\n<br>\r\nKat looked down at her thin frame feeling annoyed at her parents bringing this up again, \"I'm fine. I'm not anorexic if that's what you're worried about.\"<br>\r\n<br>\r\n\"No, of course you're not. We're just worried about you is all.\" Her mother said sheepishly.<br>\r\n<br>\r\nHer dad and Nathan were both looking at their plates, playing with their food. <br>\r\n<br>\r\n\"Well I have homework I need to work on. \" Kat said, standing up and taking her plate to the sink. She almost shivered again with how good it felt to be so full, and she could feel a tingling in her groin. She quickly ran upstairs and closed her door as she entered her room. She immediately undressed to just her bra and panties, trying not to touch her groin as she didn't want to send herself off. She spied a bag of chips she'd left by her desk thinking how good it felt to feel stuffed full. However, she should really do her homework, but it couldn't hurt just to eat some more could it?</span></div></div>",
            "created":1518238800,
            "id":2451368,
            "title":"Satisfied"
        },
        "1111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Ask for seconds",
                "Stop eating"
            ],
            "content":"<div class=\"\"><div> <span>The bag crinkled in Kat's hand which had a slight weight to it as she picked it up. The smell of barbecue wafted from the almost full bag, as Kat brought it closer to her. She flopped back onto her bed with a sigh.<br>\r\n<br>\r\nThe chips smelt so good and she could already imagine the delicious flavor. She grabbed a chip and stuck it in her mouth enjoying the salty taste that filled her mouth. She then grabbed another chip, and another, and another, with each causing the pleasurable feeling in her groin to intensify. Finally, as she finished the last chip she felt herself go over the edge to orgasm, shivering slightly. Panting slightly she closed her eyes as the feeling lingered. <br>\r\n<br>\r\nShe'd masturbated a couple of times in her life, so she knew what it felt like, but she'd never had it last this long before. Unlike a normal orgasm, this one wasn't stopping, not that she wanted it to. It was getting harder to concentrate on not just devouring any food she could find the longer it went on though, and she soon found herself opening her eyes, looking around ravenously as she wanted to feel more full. <br>\r\n<br>\r\nShe jumped from her bed as she spied a candy bar on her desk that had been under the bag of chips. She rushed over, stumbling several times as her muscles felt weak from the perpetual orgasm that was filling her body. Unsteadily she ripped the wrapper from the bar and shoved it in her mouth, almost falling over as a stronger wave of pleasure washed over her body. <br>\r\n<br>\r\nMaking her way carefully back to bed she tried to ignore the constant pleasure as a feeling of worry came over her. This definitely wasn't normal, though she had no idea what would be causing it. Most people didn't have orgasms just from eating, but it was so hard to concentrate with the unrelenting feeling radiating from her wet groin. <br>\r\n<br>\r\nTrying to clear her mind, she started taking deep breaths as she attempted to calm her body down. As she felt her body starting to digest the food she realized that the feeling was starting to subside, until eventually she breathed a sigh of relief as the orgasm finally came to an end. Breathing heavily, she continued staring at her ceiling as she tried to figure out what had caused that while simultaneously trying to resist the urge to eat more to bring the feeling back. Weakly, she turned to the alarm clock and sighed as she realized that her orgasm had lasted almost an hour.<br>\r\n<br>\r\nIt definitely hadn't felt like it had lasted that long, maybe 10 minutes or so, but it wasn't like she was in a state of mind to keep track of the time. There definitely wasn't time to work on her homework now if she wanted to get a decent night's sleep before school. She'd have to try to get it done during her lunch at school, which meant she'd probably have to skip eating she thought disappointingly. Though maybe it might be best if she did. She didn't know what she'd do if she had an orgasm at school in the lunchroom. <br>\r\n<br>\r\nShe glanced at the empty bag of chips and felt a stirring in her groin. She couldn't deny that a part of her wanted to eat more just to feel that amazing orgasm again, but the other part of her was telling her that something was seriously wrong. Besides, if she kept eating as much as she'd done tonight there was no way that she'd be able to keep her weight down, she thought as she looked at her firmly bloated belly.<br>\r\n<br>\r\nReaching over, she shakily turned off the lamp on the bedside table, casting the room into darkness with the only light coming from the lamppost outside her bedroom window.<br>\r\n<br>\r\nTossing and turning, she tried to get to sleep, but the thought of what had happened that night kept crowding into her head. She wondered if it would happen again, or if she should tell someone. She wanted so bad to see what would happen if she stuffed herself even more, but she also thought about how bad that would be for her waistline. Then again, she thought, maybe it wouldn't be so bad to put on a little weight, especially if it got her parents off her back about being too thin.<br>\r\n<br>\r\nShe glanced at the bag of chips, crumpled up on the ground. Well maybe it would be okay, but only if she saved it for when she was all alone, because then no one would see her orgasm from food, and she wouldn't blow up like a balloon. Yet as the thought of herself becoming huge and fat entered her mind, she found her groin growing moist again. <br>\r\n<br>\r\nShe shook her head at that thought. Why would anyone want to purposefully get fat, she thought, but a part of her seemed really interested in what it would be like, whispering to her of the happiness that it would bring. She would be able to enjoy stuffing herself as much as she wanted if she didn't worry so much about her weight, and that would bring the possibility of that perpetual orgasm.<br>\r\n<br>\r\nThese thoughts and more filled her head until she finally managed to fall into a dream-filled sleep. Numerous dreams of eating and getting fatter filled her night, and she found she had a moist groin when she woke up the next morning. She tried to resist touching herself as the memory of the dreams lingered in her head. Remembering her amazing experience the night before, she opened her eyes wondering if that had all been a dream.<br>\r\n<br>\r\nHer room was cast in golden light from the early morning sun, and the slight smell of bacon came wafting in from the crack under her door. Her stomach growled loudly at the thought of the delicious bacon that was no doubt waiting for her in the kitchen.<br>\r\n<br>\r\nHoping out of bed, she looked down at her flat midsection, remembering how bloated it had been the night before. She should probably be careful not to stuff herself too much lest she have an orgasm in front of other people, but that seductive voice in her head kept telling her to let go and enjoy herself. <br>\r\n<br>\r\nAfter she finished getting ready, she went down to the kitchen where her mom was cooking, \"Hello hunny! I figured I'd make you breakfast before school. I figured you must be really hungry, and I wanted to make sure that you got a nice hot meal.\"<br>\r\n<br>\r\n\"Thanks\" Kat said as she sat down at her spot and her mother put a heaping plate of food in front of her. She devoured it ravenously, savoring the bacon and eggs with toast. As she ate, she felt the feeling of pleasure slowly starting to build as she got closer to being full. Though as by the time she finished she was content, but not particularly full. She knew she could easily eat more, which would get her closer to the point of orgasm again, but it definitely wouldn't be good for her waistline if she kept doing that.</span></div></div>",
            "created":1520658000,
            "id":2462903,
            "title":"Experimentation"
        },
        "11111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Agree, and risk another binging session",
                "Politely decline, and try to salvage it later",
                "Ask if they can go to another place"
            ],
            "content":"<div class=\"\"><div> <span>Staring at her empty plate, Kat tried not to dwell too much on the building feeling in her groin. Yet that small voice in her head kept whispering sweet words to her. Finally, she made up her mind.<br>\r\n<br>\r\n\"Can I have another plate?\" she asked her mother who was still over by the stove. <br>\r\n<br>\r\n\"Of course dear.\" Her mom said pleasantly, \"It's so nice to see you finally have an appetite.\"<br>\r\n<br>\r\nKat's cheeks felt warm, and she found herself staring intently at her empty plate. At least she wouldn't have to explain to her parents that she wasn't anorexic if she kept this up. She wondered how long it would be before they started complaining she was getting fat? She'd probably never know since she had no intention of getting to that point. This was just an experiment to see if being full really was what was causing that amazing feeling. Then she'd do better at watching what she ate.<br>\r\n<br>\r\nA few minutes later another heaping plate was placed in front of her, almost appearing like more food than her first serving. <br>\r\n<br>\r\nHer mouth began salivating at the thought of all the delicious food, and a fluttering sensation filled her stomach momentarily at the thought of what this might do to her. Picking up her fork, she began shoveling the food into her mouth, feeling the sensation in her groin growing as she began to feel full. Each bite added to the pleasure that was building inside her, fueling her desire to eat more and more, until finally the plate was empty. She was teetering on the edge of having an orgasm and the temptation to push herself over was overwhelming. <br>\r\n<br>\r\nSometime during her feast her mother had placed a plate of bacon in the center of the table, the delicious scent now a forbidden temptation of what could be. Her mother had left to finish getting ready for work, and no one else could be heard, meaning they were probably gone already. <br>\r\n<br>\r\nGlancing around anxiously, Kat reached for the plate of bacon and selected a rather large piece. Each bite was euphoric, and it wasn't long before she felt her full belly push her over the edge of an orgasm. She gasped at how good it felt and closed her eyes as the first wave of her orgasm filled her entire body. Instinctively she grabbed another piece of bacon and downed it in record speed, adding to her already full belly, and causing the feelings of pleasure to grow stronger. Uninhibited, she grabbed another piece, followed by another until the entire plate was empty and she felt quite stuffed and happy.<br>\r\n<br>\r\nThe sound of the front door closing and her mom yelling that she was heading to work barely registered in her pleasure filled brain, and it took her far to long to realize that she needed to be heading for school too.<br>\r\n<br>\r\nTrying to focus on gathering her school supplies with the constant orgasm was proving to be difficult and she found herself grabbing bits of food at every opportunity just to keep the feeling going. She could tell she was absolutely stuffed so full that there was a strong feeling of discomfort, yet it still felt so good. <br>\r\n<br>\r\nIt took her noticeably longer than normal to gather her supplies and head out the front door into the cool morning air. She shakily began the short walk towards school, hardly paying any attention to what was going on around her. Occasionally, she would rub her stuffed belly and feel how hard it felt to the touch as it poked out ever so slightly.<br>\r\n<br>\r\nHer face burned with embarrassment as she realized she was out in public having an orgasm that just wouldn't stop until she digested the food in her belly. She had only wanted to see if the food was really causing it, and while she was now sure of that, she had let herself go way to far. She'd turned into a huge glutton once she'd gone over the edge. She'd been completely unable to stop herself from gorging herself even more. She was definitely going to have to be much more careful about how much she ate now. Even as she was walking here beating herself up, she still couldn't help but want to eat more food. She really would get fat enough that people would think she was a glutton if she didn't reign herself in.<br>\r\n<br>\r\nIn response to this, the mental image of her being so fat she didn't fit in her school desk came unbidden to her mind, causing her to blush deeply. It would definitely be interesting to be that large and soft, she thought, and began contemplating what it would feel like to be that fat. Images of her getting exhausted at the simplest of tasks and people going out of their way to help her since she was so big began to flow throw her mind, adding to the already strong orgasm she was experiencing. She imagined herself getting so fat that she had to sit on two chairs at the dinner table as she cleaned plate after plate of food. This moved to thought of being so big that she wouldn't even fit through the doorway of her bedroom, and people would just bring her everything she needed as she ate and ate.<br>\r\n<br>\r\nShe shook her head, wondering why she was feeling so aroused by the girl in her imagination. There was no way that she'd let herself get that big. Yet she just couldn't shake those images from her brain as that small whispering voice continued telling her how happy she'd be if she just gave in to her desires.<br>\r\n<br>\r\nStopping momentarily, she looked around as she heard someone call her name and realized she'd made it all the way to school. Most of the kids were already inside, though there were a few stragglers hanging around, and one of them seemed to be waving at her, but it was so hard to think of anything except food with the perpetual orgasm raging inside of her. <br>\r\n<br>\r\nThe figure was starting to approach her and she could heard her name again, but it just didn't seem to be registering what was going on. The figure was getting closer, it was a... a what? What was the word? Girl! It was a girl. Not just any girl, she knew this one. This one was... was who? More food. She needed more food. NO! She needed to resist. She didn't want to get... get... get what? It was something that was bad, or was it? Fat. She didn't want to get fat, but food made her feel so good.<br>\r\n<br>\r\n\"Hey Kat! You okay?\" the tall girl asked worriedly as she brushed her shoulder length blond hair from her face.<br>\r\n<br>\r\n\"Y-yeah. Just a bit sick is all,\" Kat mumbled trying to focus through the orgasm that seemed to be turning her brain to mush.<br>\r\n<br>\r\n\"Yeah, you look a bit tense. Do you think it might be something you caught while you were out with your brother?\" the girl asked as she and Kat began walking towards the school.<br>\r\n<br>\r\nCaught something? From the forest? That could be it! Who knows what sorts of things had been lurking in that temple, and on those statues. She stopped dead.<br>\r\n<br>\r\n\"Are you sure you're okay?\" the girl asked again.<br>\r\n<br>\r\n\"Yeah I'm fine, I'll see you at lunch, Brittany.\" Kat said, her mind snapping back together as something clicked. Perhaps it was that the orgasm was finally starting to lessen as she digested the food, but she felt that she was starting to get herself back together. <br>\r\n<br>\r\nShe left Brittany standing confused in the hallway as she rushed to her first class, her mind already mulling things over. <br>\r\n<br>\r\nShe had felt that weird feeling when she'd picked up the statue of the fat woman, and she was beginning to think that might have something to do with it. However, she'd have to visit her brother to see if she could find out any more information after school. First though she needed to make it through the day without letting herself go on anymore binging sprees. <br>\r\n<br>\r\nAs time passed the orgasm eventually faded and she was back to normal, though she couldn't shake the desire to stuff her belly. Her classes passed mostly uneventfully until lunch.<br>\r\n<br>\r\n\"Hey Kat. How's it going?\" a voice came from behind her, causing her to spin away from her open locker to find the source.<br>\r\n<br>\r\nThere was a boy in typical punk clothes standing behind her.<br>\r\n<br>\r\n\"Hey Theo.\" Kat said smiling slightly at the handsome boy. <br>\r\n<br>\r\nTheo put his hands behind his back, and looked at the ground sheepishly, \"Did you, uh, want to go get some lunch with me? I was thinking we could go to that buffet place down the road, since lunches are an hour long now.\"<br>\r\n<br>\r\nKat had always had a crush on Theo, but had always been afraid to act on it. As such they'd always been mostly just friends, and they'd hang out occasionally, but this seemed different somehow. This was pretty much a dream come true, but there was no telling what she'd do at a buffet place.</span></div></div>",
            "created":1520744400,
            "id":2463329,
            "title":"Forbidden Desires"
        },
        "111111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Accept him as her boyfriend",
                "Politely reject him as her boyfriend",
                "Get off me"
            ],
            "content":"<div class=\"\"><div> <span>\"Sure! I'd love to!\" the words were out of her mouth before Kat even realized what was happening.<br>\r\n<br>\r\nTheo looked at her excitedly, \"Great! Let's go!\"<br>\r\n<br>\r\nShe followed Theo to his car, chatting excitedly with him. It seemed as if they never ran out of things to talk about whenever they hung out. That and she didn't feel like she needed to act like someone she wasn't around him. They'd been friends for years, and while she'd always found him attractive, she had no idea if he felt the same way. Most of her friends saw her as extremely self confident, however, when it came to boys, especially Theo, she just couldn't bring herself to act on her feelings. <br>\r\n<br>\r\nA few minutes later they were pulling up to the buffet place Theo had been talking about. It wasn't very busy, despite being lunch time, but that was probably because most people were opting for the fast food places. <br>\r\n<br>\r\n\"Well, shall we go in?\" Theo said, opening the door for Kat.<br>\r\n<br>\r\n\"Of course,\" she had butterflies in her stomach as they began making their way inside. If she wasn't careful about how much she ate, she might push herself into gorging herself again, and she didn't want to do that in front of Theo. Though a part of her couldn't wait to push her limits even more, and see how much food she could down.<br>\r\n<br>\r\nInside were a few people grabbing food or sitting at tables eating, while a college aged boy greeted them, \"Welcome. Just two today?\"<br>\r\n<br>\r\n\"Yep,\" replied Theo, who promptly paid for both of them, \"I figure I'll pay since I was the one to invite you.\"<br>\r\n<br>\r\nKat's heart skipped a beat, if he was paying did that mean that he meant this as a date. She didn't know what to do, and so she just timidly thanked him as they made their way to a table. They each loaded up a plate and returned to their table.<br>\r\n<br>\r\nKat had probably grabbed twice as much food as Theo, although he didn't seem to be paying attention. Kat was glad though, because she didn't want him to think she was a glutton. Soon they were both chowing down on their food, and enjoying talking with each other. However, Kat couldn't shake that growing feeling of pleasure building in her groin as she put down more and more food. <br>\r\n<br>\r\nBoth of them grabbed a second plate when they had finished their first, although Kat's second plate was probably piled higher with food than her first, which she immediately regretted once she noticed that Theo's plate was less full this time around. However, she couldn't stop herself from devouring the food. Theo finished his plate long before her thought they kept chatting as she shoveled mouthful after mouthful into her eager belly. She wasn't sure, but it seemed like Theo kept glancing at her bloated belly, which was making her extremely self conscious of the fact that she could actually see her stuffed belly lifting her shirt ever so slightly. He probably thought she was such a pig for eating so much, but if so he gave no indication.<br>\r\n<br>\r\nShe was in no way fat, but she'd never been so full that her belly became noticeable, however slightly, until just the last couple of days. She blushed, and put one arm in front of her belly as her second continued to feed the beast inside her. Before she had even finished the plate she knew she was going to let herself go over the edge, and then he'd see the girl who enjoyed stuffing her belly for pleasure.  <br>\r\n<br>\r\n\"Are you okay? You looked like you just zoned out there for a moment,\" Theo said still glancing at her belly every few moments.<br>\r\n<br>\r\n\"Y-yeah, I'm fine. Just enjoying the food.\" Kat said, trying to stay focused as the wave of euphoria washed over her as she continued shoving food into her mouth with renewed vigor. <br>\r\n<br>\r\n\"I'm sorry if I'm boring you,\" He said, looking down at the table sheepishly.<br>\r\n<br>\r\n\"You're not boring me, Ahhh,\" she stifled a moan of pleasure as she finished her plate, already standing to get another.<br>\r\n<br>\r\nWhen she returned with another heaping plate of food, the look of surprise on Theo's face was obvious, mixed with, was that a smile. No, it couldn't be. <br>\r\n<br>\r\n\"You really are enjoying the food today,\" he said.<br>\r\n<br>\r\nShe was sure he was looking at her belly this time, but that thought was quickly replaced by her desire to devour more food, \"Ever since I got back from the expedition with my brother yesterday, I've been really hungry.\"<br>\r\n<br>\r\n\"Really, that's strange,\" he said, almost sounding excited. <br>\r\n<br>\r\n\"Yeah, maybe, ahh,\" another moan, \"maybe I caught something, is what I'm thinking.\"<br>\r\n<br>\r\n\"A disease that makes you hungry? Huh.\" Theo said, seeming to go deep in thought. <br>\r\n<br>\r\nShe was trying so hard to stay focused with the growing feeling of pleasure in her belly, and the feeling of being painfully stuffed full. She didn't know how much more she could eat before she exploded, but she just kept putting more and more food into her already tight stomach. <br>\r\n<br>\r\n\"Hey Kat,\" Theo said suddenly, causing her to look up from her plate of food, \"I know we've been friends for a while, but I, uhh, have a bit of a confession to make.\"<br>\r\n<br>\r\nKat's heart skipped a beat at these words, her heavenly dining momentarily forgotten, \"What is it?\"<br>\r\n<br>\r\n\"I, uhh, I think you're really beautiful.\" the last part came out in a hurried rush, and his cheeks turned crimson.<br>\r\n<br>\r\n\"Really?\" Kat said, feeling her own face turning red, it was so hard to stay focused with her building arousal, \"I- I always thought you looked good too.\"<br>\r\n<br>\r\nHe perked up noticeably, but then looked down embarrassed, \"That's not all though, I, uhh, have a thing for, how to put this, chubby girls.\"<br>\r\n<br>\r\nKat's heart dropped at this, \"What do you mean?\"<br>\r\n<br>\r\n\"I, uh, like girls with a little bit of meat on them, and when I saw you this morning eating on your way to school, I realized how beautiful you were, and uh,\" He trailed off looking down at his empty plate of food.<br>\r\n<br>\r\nKat tried to focus through the pleasure in her groin, instinctively lifting another bite of food to her mouth as she mulled over what he was saying. It sounded like he was saying that he had asked her out because he'd seen her bloated belly that morning, and had been turned on by it, but did that mean that he was only asking her out because he thought she was fat? <br>\r\n<br>\r\nShe quickly finished her food before replying, \"Do you think I'm fat?\"<br>\r\n<br>\r\n\"NO!\" He turned a darker shade of red, \"That's not what I'm saying at all! I just, I've always wanted to be more than friends, but I've never had the courage to ask you until today.\"<br>\r\n<br>\r\n\"Oh.\" was all Kat could say. She knew that feeling of wanting to tell him, but being unable to. If her bloated belly could lead to a good thing then maybe it wasn't all that bad, \"I've always liked you too. I just, ahh, haven't had the courage to ask you either.\" <br>\r\n<br>\r\nIt was her turn to feel her face burning as she looked down, spotting her stuffed belly she wondered what it would be like to let herself put on a little bit of weight. Not tons, just enough that she wouldn't be considered anorexic anymore. She pictured herself with a more normal body with a little more softness. That wouldn't be such a bad thing, would it? Especially if it let her be more than friends with Theo. <br>\r\n<br>\r\nThe rest of lunch they hardly spoke, both wondering where this was going to go, and neither wanting to ruin the chance they had now. She knew that he'd want her to put on some weight if she agreed to be his girlfriend, but on the other hand she'd be with him. Yet what would she do if they broke up and she was too fat to find anyone else. However, if he liked fat girls, then there were probably other guys who did too. <br>\r\n<br>\r\nShe was doing her best to think things through despite the raging orgasm that was still going in her groin, and she kept thinking even as they got into his car and headed back towards school. She kept glancing down at her stuffed belly, feeling conflicted. She didn't really want to gain weight, but it felt so good just to stuff herself with food. However, there was still that part of her whispering that she should give in and let herself become the woman he wanted. <br>\r\n<br>\r\nWhen they arrived at school, they sat in the car for a few minutes in silence. As Kat was about to get out, Theo grabbed her arm and pulled her close, turning her head he leaned in and kissed her right on the lips. </span></div></div>",
            "created":1520830800,
            "id":2463591,
            "title":"Admirer"
        },
        "1111111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Enjoy herself (1 week later)",
                "Try to fight it (1 week later)",
                "Let what happens happen (1 week later)"
            ],
            "content":"<div class=\"\"><div> <span>The smell of books and paper surrounded Kat and the sound of a page turning split through the silence. The large library was empty except for her and Theo. He had offered to accompany her to her brother's research lab after school to keep her company.<br>\r\n<br>\r\nHer lips tingled as she remembered the kiss. She had hesitated at first, then wrapped her arms around him and pulled him in closer. They had stayed locked that way for almost 5 minutes, until they said their goodbyes and planned where to meet after school. Now he was right next to her, occasionally their arms would touch lightly, sending shivers up her spine. Glancing outside, Kat sighed and closed the book she had been skimming through.<br>\r\n<br>\r\n\"Nothing in this one either,\" she said dejectedly, breaking the silence, \"and I don't know how much longer I can keep looking through these. They're not exactly best sellers.\"<br>\r\n<br>\r\nClosing his book, Theo looked at her, \"Nothing in this one either.\"<br>\r\n<br>\r\nThey both leaned back in their chairs, Kat folding her arms over her stuffed belly while Theo rubbed his eyes before staring at the ceiling. <br>\r\n<br>\r\nShe adjusted her shirt slightly, feeling her face growing red again. After school they had gone back to the buffet for round two of letting her gorge herself. If she wasn't careful she might just start enjoying the constant eating, or at least the royal treatment she'd gotten from Theo. He had let her sit and eat, while he brought her plate after plate of food, until she couldn't eat any more.<br>\r\n<br>\r\nShe frowned slightly. Even though it had only been a day, it already seemed like she was able to eat more food than she had before. Not a whole lot more, but enough to be noticeable to her. It was taking slightly longer to reach the point of orgasm from being full, which was one thing she still hadn't told Theo about. Although she might have to if he was going to continue helping her try to find out what was going on. <br>\r\n<br>\r\nThe minutes ticked by, until Kat finally stood up, taking the book back to the shelf where she'd found it. Theo followed suit, grabbing his book bag from beneath the table they'd been at. Taking her hand in his, they left the library in silence, feeling the cool night air as they left. <br>\r\n<br>\r\nClosing her eyes and sighing, Kat stopped for a moment. She always had loved the night. It made her feel so safe and disconnect from the world. At night, nothing bad could happen and the world was hers alone. She glanced over at the boy beside her as they walked, feeling her heart skip a beat.<br>\r\n<br>\r\nBesides helping her get food at the buffet, he'd made no indication that he actually wanted her to gain any weight. He hadn't put any pressure on her at all. Although, they had only been a couple for about 9 hours now. Still, at least he was showing some restraint unlike her, and her waistline was going to show it if she kept it up. Of course that would probably make him happy, she thought, feeling slightly aroused at him rubbing a chubby version of her on her bed. <br>\r\n<br>\r\nAs they were getting in his car, he asked, \"So where to now?\"<br>\r\n<br>\r\nShe buckled herself in, biting her lip slightly, \"I'm not sure. I am a bit hungry, but I probably shouldn't eat any more...\"<br>\r\n<br>\r\nGlancing to see how he reacted, he didn't even seem phased, \"So home then?\"<br>\r\n<br>\r\nHe was definitely showing more restraint than she was, but she wasn't going to admit that. The truth was that she was hungry though. It seemed like she was digesting food faster than she used to, which wouldn't be good for her weight if she always gave in to her cravings. <br>\r\n<br>\r\n\"Actually, lets stop at McDonald's on the way for a light snack.\" She said, feeling butterflies in her belly at the thought of what she was suggesting.<br>\r\n<br>\r\n\"You sure? You have eaten a lot today, and I don't want you to regret it,\" He said, starting the engine of the car and starting to pull out of the parking lot. <br>\r\n<br>\r\nLooking down at her belly, which was thankfully hidden by her shirt again, she nodded.<br>\r\n<br>\r\n\"Alright, McDonald's it is, my lady.\" he said, causing them both to laugh. <br>\r\n<br>\r\nA few minutes later, they were pulling into the parking lot at the restaurant. There weren't very many people inside, but the line at the Drive-thru was rather long.<br>\r\n<br>\r\n\"Maybe we should go inside,\" Kat suggested, trying to ignore the gnawing feeling in her stomach. <br>\r\n<br>\r\n\"Alright. Sounds good.\" Theo replied as he found an open parking spot.<br>\r\n<br>\r\nHe got out and opened the door for Kat while she was making sure she had her purse. Helping her out, he shut the door behind her and escorted her into the restaurant. The smell of fast food hit them as they entered, and Kat's stomach let out a small gurgle of anticipation. They stepped into line behind an older couple, who was having trouble deciding what to have.<br>\r\n<br>\r\n\"Hmm, I'm thinking the Double Quarter Pounder,\" Kat mused to herself, as she glanced at the menu, \"And definitely fries!\"<br>\r\n<br>\r\n\"I think that's what I'll get too,\" Theo said, pulling his eyes away from the menu to look at her. <br>\r\n<br>\r\nShe smiled, running her hands through her long black hair, she tilted her head a little to the side. Theo shifted slightly, glancing away from her, but not before she saw the red in his cheeks. <br>\r\n<br>\r\n\"You're, uh, really beautiful,\" he said sheepishly, shifting again.<br>\r\n<br>\r\nNow she was blushing too. It still felt amazing when he told her how good she looked, \"Thanks. You look quite handsome yourself.\"<br>\r\n<br>\r\nHe turned towards her, and gave her a quick peck on the cheek before turning away quickly.<br>\r\n<br>\r\nHer cheek tingled where his lips had touched, and her heart was racing as she turned to look outside. She took a couple of deep breaths to calm herself, and almost jumped when the cashier called out to them that he was ready to take their order. <br>\r\n<br>\r\nThey quickly ordered, and found a clean, open table and sat down. They kept chatting even after their food had been delivered, reminiscing about things they'd done together, and their feelings towards each other. <br>\r\n<br>\r\nKat found herself laughing at all his stupid jokes, and telling him how many times she'd wanted to ask him out. They got a good laugh that all it had taken to get them to finally open up was Kat having a big breakfast. They kept talking long after they'd finished eating, Kat felt comfortably full, but not to the point of pure pleasure. However, she didn't want to spoil the mood with that right now.<br>\r\n<br>\r\nEventually, they were told that the lobby was closing and that they needed to leave. Still enjoying themselves, Theo drove her back to her house. He again escorted her to the front door, giving her a light kiss on the lips, they parted ways as Kat headed inside, waving to him as he pulled out of the driveway. Closing the door, she leaned her back against it, letting the feeling of that kiss radiate into her body. <br>\r\n<br>\r\nThe house was quiet, and there didn't seem to be any lights on, which meant everyone else was probably asleep. <br>\r\n<br>\r\nAfter several moments, her thoughts turned towards food, and stuffing her belly. Once more wouldn't hurt. It wasn't like one day of heavy eating would make her fat. <br>\r\n<br>\r\nShe made her way into the kitchen, opening the stainless steel fridge, she spied the leftovers from dinner. Heating them up in the microwave, she did her best not to let it beep and wake everyone up. Then making her way up to her room, she set the large plate of food on her desk and stripped to her underwear, and grabbed the food.<br>\r\n<br>\r\nShe pictured every bite being fed to her by Theo, as he rubbed her fat belly. His hand sunk into her soft flesh, feeling every inch of her swollen figure. She savored every bite going into her growing body, giving him more of her to rub. When the orgasm hit, she imagined he had moved his hand from her belly to between her meaty thighs, fingering her.<br>\r\n<br>\r\nWhen the food was gone, she crawled into bed still imagining him caressing her fat body. She wondered what it'd be like to be that fat, not that the girl in her imagination was enormous, but it was definitely chubby. Maybe it would be good to put on a little weight. She still didn't want to be fat, but maybe pleasantly plump wouldn't be that bad.<br>\r\n<br>\r\nShe fell asleep to dreams filled with Theo and food, wondering what she would do. Should she let herself gain some weight, or try to reign herself in.</span></div></div>",
            "created":1520830800,
            "id":2463605,
            "title":"Sweet Seduction"
        },
        "11111111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Decide to gain a bit more weight",
                "Try to limit her growth"
            ],
            "content":"<div class=\"\"><div> <span>125.<br>\r\n<br>\r\nA mix of emotions filled Kat as she stepped off the scale, including embarrassment and excitement. After the massive amounts of food she'd eaten, it was no surprise that she had gained 10 pounds in just one week. She couldn't believe how quickly she was gaining weight. Her appetite was definitely increasing, and it was getting harder to resist food. Even now she was snacking on a box of cupcakes. Every bite sent a wave of euphoria through her, making her feel happy and relaxed. It was getting to the point where anytime she felt stressed or down, she'd just grab some food since it seemed to make her feel better. <br>\r\n<br>\r\nPutting on her clothes, she felt the familiar tight feeling that she'd started feeling near the end of the week. A very slight bulge could be seen where her belly was, and her pants felt like they were starting to hug her a bit too tightly. Her phone buzzed on the counter.<br>\r\n<br>\r\nPicking up her phone, she saw she had a text from Theo saying he was on his way to pick her up for school. He had been giving her rides to school, which had significantly cut into the little exercise she had been getting, which probably was helping contribute to her expanding waistline.<br>\r\n<br>\r\nShe frowned slightly, thinking how she hadn't intended to gain weight this quickly. Though no one had really mentioned her increased weight, she chalked that up to the fact that she'd been able to mostly hide it with baggy clothes. It wasn't like her weight gain was extremely noticeable either. You'd really have to be looking carefully to notice that her once flat belly now had a small layer of pudge, or that her flat chest was starting to develop. Even her slight double chin was only noticeable if she turned her head the wrong way. <br>\r\n<br>\r\nStill, she thought, I really should try to reign myself in. I don't want to become a blob. Though as she thought of herself so fat she couldn't move, she felt a stirring in her groin. Although, maybe a few more pounds wouldn't hurt. If anything, the weight seemed to be making her look more beautiful, she thought as she examined herself in the mirror. She was starting to get some curves on her body which accentuated her feminine appearance. <br>\r\n<br>\r\nMaybe I should gain some more weight?</span></div></div>",
            "created":1520830800,
            "id":2463612,
            "title":"Happy"
        },
        "111111111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Suggest a day of eating",
                "Suggest they go do something intimate",
                "Suggest they go do something outside"
            ],
            "content":"<div class=\"\"><div> <span>The girl in the mirror turned a few times, examining herself from every angle as her hands caressed her body.<br>\r\n<br>\r\nShe was definitely still thin, but now she looked healthier if anything. A few more pounds might actually be good for her, Kat thought as she rubbed her belly. There was just a hint of softness beneath her hands as her hands moved over her smooth skin, hiding the firm muscles and bones beneath ever so slightly. She smiled as she looked herself over; perhaps a little more weight would do her some good.<br>\r\n<br>\r\nGlancing at her phone, she got dressed and made her way downstairs to where her mother was cooking breakfast. After greeting her mother, she sat down at the table and began to dig in to the plate that was set in front of her. Quickly finishing, she asked for a second plate. Her mother happily obliged her, setting another heaping plate in front of her. Half way through, Theo texted her saying he was outside. She shoveled the rest of the food into her mouth, grabbed her things and quickly left, still not quite at the point of pure pleasure. <br>\r\n<br>\r\nAs she opened the car door, the smell of fast food hit her, \"Hey, I decided to get us some food for breakfast, hope you're hungry.\"<br>\r\n<br>\r\n\"Starving,\" she replied, moving the bags from her seat to her lap as she sat down. <br>\r\n<br>\r\nQuickly peaking inside the bags, she pulled out a sandwich, feeling a flutter of excitement as she opened the wrapper. Greedily, she began devouring the breakfast sandwich, each bite a little bit of heaven in her mouth. The sausage was moist and delicious, with just a hint of maple flavoring. The bacon was cooked to perfection, and the eggs topped it all off nicely. <br>\r\n<br>\r\nShe shivered as she was getting close to finishing the first sandwich, a wave of euphoria filled her body as she went over the edge. Smiling slightly, she realized how good she was getting at hiding her frequent orgasms. Even Theo still didn't know about that little secret. Most of the time, the only sign she gave that she was having one was that little shiver when it started.<br>\r\n<br>\r\nTaking a deep breath, she shoved the rest of the sandwich into her mouth before grabbing another from the bag, \"You were pretty hungry this morning.\"<br>\r\n<br>\r\n\"I skipped breakfast,\" she replied, just a little white lie, \"I didn't have time.\"<br>\r\n<br>\r\n\"Running late again?\" Theo joked.<br>\r\n<br>\r\n\"Uh-huh\" she mumbled through a mouthful of sandwich, starting to feel uncomfortably full. <br>\r\n<br>\r\nShe really was able to eat a lot more food she thought as she finished the sandwich. Just a week ago two plates had breakfast had pushed her over the edge, and while she had kept stuffing herself after, she still hadn't eaten as much food as she had today. She just found it hard to stop eating once she started, only quitting once she felt like she was going to explode if she ate another bite. <br>\r\n<br>\r\nBy the time they made it to school, and were parked, she' eaten three of the four sandwiches. Patting her full belly, she kissed Theo and they went their separate ways as they headed to class.<br>\r\n<br>\r\nAt lunch they went back to the buffet where she stuffed herself ravenously, all the while Theo waited on her every desire. He kept bringing her plate after plate of food so she didn't have to break away from eating, all the while a smile split his face. <br>\r\n<br>\r\nSmiling back, she continued eating, knowing that he was enjoying the show just as much as she was enjoying putting it on. She realized how happy and satisfied she was being here with him and stuffing herself with food. It wouldn't be that bad if she put on a few more pounds, just so that she looked a bit healthier. She would stop before she started looking fat, she thought as she shoveled more food into her mouth. <br>\r\n<br>\r\nAfter she was finished, they returned to school, discussing where to meet afterwards. That evening, they went to her brother's research library after stopping at the buffet again to continue their research on what could possibly have caused her massive appetite. <br>\r\n<br>\r\nEach passing day was close to the same, with only slight variations in where they would eat at each meal. Every day, Kat found she could eat more food than the last, while her clothes continued to tighten on her. It was getting harder and harder to hide her bloated bellies and expanding waistline as she made her way towards the upper limit of being an average weight. <br>\r\n<br>\r\nHer breasts were staring to fill out, and even when her belly was empty it was starting to stick out slightly. Her face was getting rounder, and her double chin was becoming more noticeable. Her thighs were definitely starting to rub together as they became thicker with each passing day, and her butt was also starting to become more prominent. On top of all that, it seemed as if none of her clothes fit anymore, always exposing her softer belly.<br>\r\n<br>\r\n167.<br>\r\n<br>\r\nThe scale didn't lie, she'd really been letting herself go lately she sighed. She just didn't seem able to resist anymore. No matter how hard she tried, she just couldn't seem to resist stuffing her face at every opportunity. Even her friends had commented on her rapid weight gain, yet it seemed as if everyone was conspiring to make sure she always had food. Looking at her soft belly, she frowned at the light stretch marks that were starting to show on her skin. <br>\r\n<br>\r\nShe'd really been gaining weight quickly, and if she didn't reign herself in now, she probably wouldn't be able to stop herself. However, her softer body did feel really nice, and she'd put weight on in all the right places to really accentuate her womanly shape.<br>\r\n<br>\r\nClosing her eyes, her hand drifted towards her wet groin as she imagined what she'd look like in another 20 pounds. She was definitely starting to look slightly chubby now, but in another 50 pounds she'd be fat. There was no way she'd let herself gain 100 pounds, yet as she imagined herself getting bigger and bigger, she found herself growing more and more aroused. <br>\r\n<br>\r\nPanting at the self-induced orgasm, she looked at the beautiful girl in the mirror with a slight belly and perky breasts, moving her hand from between her thick thighs. What was wrong with her? Why was she getting so much enjoyment out of watching herself blow up like an elephant? <br>\r\n<br>\r\n\"Hunny, breakfast is ready, but I have to leave for work early. There should be plenty of food for you,\" Kat's mother called from downstairs.<br>\r\n<br>\r\n\"Thanks! You're the best!\" Kat called back through the bathroom door. <br>\r\n<br>\r\nTurning back towards the slightly chubby girl in the mirror, she grabbed her love handles. Though they weren't huge, they were definitely starting to be pinch-able at least.<br>\r\n<br>\r\nThinking about the delicious breakfast downstairs, she frowned. She still hadn't told Theo the truth about why she kept stuffing herself, though he definitely seemed to be enjoying the results. <br>\r\n<br>\r\nKat finished getting ready, mulling things over in her mind as she went downstairs and loaded up a massive plate of food, and began eating it greedily. She was about half through, when Theo walked into the kitchen, \"Hey. Still having breakfast? It always amazes me how you're able to eat so much food.\"<br>\r\n<br>\r\nLooking down at the food guiltily, she kept eating as she tried to avoid looking him in the eyes. She always hated when he brought that up, because it reminded her that she wasn't being entirely honest with him. She didn't know why either. It wasn't like it was something too horrible. It was just that she didn't want him to think that she was only doing it because she was selfish for wanting to feel the amazing sensation of that perpetual orgasm. <br>\r\n<br>\r\n\"So what did you want to do today?\" Theo asked, grabbing himself a small plate of food, \"We've got a whole Saturday together.\"<br>\r\n<br>\r\nShe looked at her handsome boyfriend, as she felt her arousal building. Her really was good looking, though she didn't know if it was too soon to suggest some more intimate activities they could do. They had definitely became much closer over the last few weeks, and he always loved rubbing her growing belly. What should she suggest?<br>\r\n</span></div></div>",
            "created":1521003600,
            "id":2464473,
            "title":"Curvy"
        },
        "1111111111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Try to eat the burger",
                "Change mind and suggest the buffet instead"
            ],
            "content":"<div class=\"\"><div> <span>Despite her growing arousal, she found herself longing for more food. Pushing her empty plate aside she turned towards Theo, and grabbed her belly \"I was thinking maybe we let you see how much food you can put into this belly since you seem to be so intrigued by it.\"<br>\r\n<br>\r\nTheo blushed, and looked away, \"Well, um, if you're sure. I mean, I guess we could.\"<br>\r\n<br>\r\nShe smiled at his stammering. Despite his confession that he liked chubby girls, he still seemed to get really embarrassed whenever she brought it up to him, and she honestly thought it was pretty cute. After a moment she stood up, patting her belly, \"Let's go get something really fattening. Shall we?\"<br>\r\n<br>\r\nStill looking embarrassed, he replied, \"Yeah, do you want to go to the buffet\"<br>\r\n<br>\r\n\"I was thinking something really greasy and delicious,\" Kat said, trying to sound seductive.<br>\r\n<br>\r\n\"You mean...\" Theo looked at her surprised.<br>\r\n<br>\r\n\"I do.\" Kat said, leaving the kitchen, \"They say it would take an army to finish it, but I want to see if that's really true.\"<br>\r\n<br>\r\nAlready she had butterflies just thinking about what she was suggesting. There was no way she wouldn't be fatter if she managed to finish it. However, Theo was already out the front door, heading towards his car. She looked in the mirror in the front room, examining her softer frame, she didn't have to finish it if she didn't want to. That was the problem though, a part of her really wanted to do it. To see how big she could get. <br>\r\n<br>\r\nTheo honked the horn, and shouted into the house, \"YOU COMING?\"<br>\r\n<br>\r\nRushing outside, she jumped in the car, striking up conversation with Theo to keep her mind off of what she was about to attempt. However, all too soon they were pulling into the parking lot of the local burger joint.<br>\r\n<br>\r\nThe smell of grease and fat, hit Kat's nose before she even entered the restaurant, and her stomach let out a loud growl in anticipation. She couldn't deny that she was excited to try it, and there it was on a small flyer in the window as they entered the building. The world's biggest burger, guaranteed to make you 10 lbs heavier. The challenge was that if you could eat it, then you would get unlimited food for the next month, but so far no one had been able to do it. <br>\r\n<br>\r\n\"Hey, are you sure about this? That's a huge burger.\" Theo said.<br>\r\n<br>\r\nKat looked at the flyer. It might be better just to go to the buffet, however, she also really wanted to try the burger and see if she could finish it with her increased capacity for food.</span></div></div>",
            "created":1521176400,
            "id":2465423,
            "title":"Enough for an Army"
        },
        "11111111111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "She finishes it",
                "She does not"
            ],
            "content":"<div class=\"\"><div> <span>Kat nodded to Theo, who approached the counter to order the burger while Kat hung on his arm. The clerk behind the counter looked surprised at their order, glancing both of them up and down.<br>\r\n<br>\r\nKat smiled, he probably was surprised that someone so small would even try the challenge. She'd seen most of the people who'd tried it and they weren't small people. Though, at this rate, she wouldn't stay small either, she thought as she adjusted her tight jeans that were definitely too small for her.<br>\r\n<br>\r\nShe followed Theo to a table after he paid, and sat down to wait.<br>\r\n<br>\r\n\"Even with your appetite, it will be pretty impressive if you can eat that whole burger.\" Theo said from across the table. <br>\r\n<br>\r\n\"I mostly just want to gauge how much I can actually eat.\" Kat said, \"I've been kind of curious.\"<br>\r\n<br>\r\nLaughing Theo kicked one of her feet, \"Well I have to say, you've definitely become a lot more confident over the last few weeks. It almost seems like you're enjoying your bigger b-, uh, appetite.\"<br>\r\n<br>\r\nTheo turned a bit red, looking down at his feet, at his almost slip-up. Kat just smiled, \"You know, I think I might be. At first I just wanted to find some way for things to go back to normal, but I have to say, I kind of like how I look.\"<br>\r\n<br>\r\n\"Really?\" Theo asked, a hint of excitement in his eyes.<br>\r\n<br>\r\n\"It definitely is nice not really having to worry so much about what, or how much, I eat, and honestly, as long as I don't grow huge, I think I actually look a bit better with some curves.\"<br>\r\n<br>\r\n\"I didn't want to say anything,\" Theo said, \"but I definitely think you look better now. I love the softer you.\"<br>\r\n<br>\r\nKat felt a flutter in her chest, as she glanced away, trying to hide her red face. That was the first time, he had really commented on her weight gain. Well the first time anyone had commented on her weight gain. She felt happy that he liked the way she looked. She began to realize how much she was really enjoying her new body too. <br>\r\n<br>\r\nA massive burger suddenly was plopped down between them, while a smaller one was set in front of her<br>\r\n \"Hear you go sir,\" an older gentleman said to Theo, nudging the burger closer to him.<br>\r\n<br>\r\n\"Uh, actually the burger is for me,\" Kat said timidly.<br>\r\n<br>\r\n\"Oh,\" the man said, seeming surprised, \"All right then, my mistake.\"<br>\r\n<br>\r\nHe quickly switched the plates, \"Now if you can finish that entire thing yourself, you get unlimited food for a month.\"<br>\r\n<br>\r\n\"Oh, I plan on it.\" Kat replied confidently.<br>\r\n<br>\r\nHe chuckled, \"Many people have said that, but so far, no one has been able to. I'll be watching though to make sure you eat it all.\"<br>\r\n<br>\r\nHer response was to lift up the massive burger and take a big bite. She followed it up with another and another, though she quickly found her arms getting tired from the weight of the massive burger. <br>\r\n<br>\r\nTheo and the man watched in awe as the burger slowly began to disappear into Kat's eager belly, both seeming surprised at the ravenous girl before them.<br>\r\n<br>\r\nEach bite was delicious, and she almost felt like she couldn't stop even if she wanted to, as her belly felt fuller and fuller. Her pants were starting to dig into her waist, creating a deep grove, while her shirt seemed to be stretching more and more, slowly exposing the bottom of her belly.<br>\r\n<br>\r\nStill she kept eating and eating and eating. It occurred to her how much of a glutton she was becoming, but she didn't care, she was getting close to the tipping point, and she wanted to see what would happen if she really stuffed her belly.<br>\r\n<br>\r\nBy the time she was half-way through, she was really starting to feel stuffed. The button on her jeans had popped off, relieving her swelling belly, and her belly was clearly visible between her shirt and pants.<br>\r\n<br>\r\nA small crowd had gathered to watch her eat, most of them surprised she'd eaten so much already. After all, she definitely wasn't really fat, maybe slightly chubby, but definitely not fat. At least not yet. Though she was starting to wonder if she'd be able to finish the burger at this point.</span></div></div>",
            "created":1522904400,
            "id":2475214,
            "title":"Just one more bite"
        },
        "111111111111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Suggest something more intimate",
                "Continue enjoying time with Theo"
            ],
            "content":"<div class=\"\"><div> <span>Kat closed her eyes as she put bite after bite of the burger into her mouth, savoring the meaty juices that sloshed around her mouth. Swallowing, she grimaced slightly before shivering in pleasure. She adjusted herself in her chair, juice dripping from the corner of her mouth as she took another bite, followed by another and another. She was tried adjusting the food in her mouth, her cheeks stretched like a chipmunk's. A few moments later, she swallowed, grimacing again before shivering at the strongest pleasure she'd ever felt.<br>\r\n<br>\r\nShifting slightly again, her solid belly seemed pushed out slightly. She took another large bite, feeling more relieved as a slight pop came from her pants as the zipper came completely undone, and her belly surged forwards slightly. Her shirt was stretched tight over her round middle, starting to ride up more and more with each bite.<br>\r\n<br>\r\nWith renewed vigor, the bites came quicker now that her belly was freed focused only on getting the food to her belly as fast as she could. She ate bite after bite after bite, panting as goosebumps erupted on her skin. Rubbing her legs together, she kept eating, grimacing with each swallow. <br>\r\n<br>\r\nFinally, she leaned back on the bench, closing her eyes as she felt the strongest feeling of pleasure coursing through her that she'd ever felt. Patting her stomach, it felt unbelievably firm, despite having a layer of fat on it.<br>\r\n<br>\r\n\"I- I can't believe it. Someone actually did it.\" The older man said, his eyes wide.<br>\r\n<br>\r\nKat covered her mouth, blushing as she let out a small burp causing several people to chuckle, \"Th- that w- was g-good.\"<br>\r\n<br>\r\nIt was so hard for her to focus as her raging orgasm continued to cloud her mind. Voices spoke around her, but she couldn't tell what they were saying. Something bumped her arm, causing her to sway slightly as she tried to stay up. Again, something bumped her arm, as more noise seemed to come at her and a blurry shape came closer. <br>\r\n<br>\r\n\"Are you okay?\" it was faint, but this time she could make it out.<br>\r\n<br>\r\n\"Y-yeah, I feel g-great.\" She mumbled, struggling to form the words.<br>\r\n<br>\r\n\"Let's get you home.\" The voice came as if from the other side of the world.<br>\r\n<br>\r\nSlowly she was lifted to her feet and almost fell over, her legs shaking beneath her as several hands caught her. Unsteadily, she was led towards Theo's car, where she plopped down in the passenger's seat. The ride home went by too quickly and Theo helped her towards her room once they arrived. The stairs were a struggle for her as she tried lifting her shaky legs up each step.<br>\r\n<br>\r\nAfter a few minutes, they finally made it to her room where Theo helped her lay on her bed, while her belly rose up above her. She couldn't believe that she'd actually been able to finish the burger. She was going to be huge at this rate. She just couldn't seem to keep herself in check, though a part of her was definitely enjoying the new found freedom she had. <br>\r\n<br>\r\nShe glanced at the clock, surprised that it was still so early. Her family wouldn't be home for quite some time still. Theo was sitting on the side of her bed, obviously entranced by her belly.<br>\r\n<br>\r\nShe smiled, taking his hand in hers, she placed it on her stuffed belly. She closed her eyes as he began massaging her swollen abdomen. Enjoying his warm hands against her skin, she just wanted it to last forever.   </span></div></div>",
            "created":1526274000,
            "id":2493185,
            "title":"Triumph"
        },
        "1111111111111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "A week Later"
            ],
            "content":"<div class=\"\"><div> <span>Opening her eyes, she looked up at Theo, \"Do you, uh, do you maybe, um, want to get a better view?\"<br>\r\n<br>\r\nTheo's eyes went wide as his hands stopped on her belly. His face turned red as he glanced at her already undone pants.<br>\r\n<br>\r\nShe smiled at his obvious excitement, \"Maybe you could help me get this shirt off first.\"<br>\r\n<br>\r\nHesitating for only a moment, Theo began helping her to remove her shirt, practically falling over himself.<br>\r\n<br>\r\nLaughing slightly, Kat nudged him in the ribs, \"It's like you've never taken a shirt off before.\"<br>\r\n<br>\r\n\"I've taken shirts off before,\" he stammered, \"No wait! I've taken my own shirts off before, but never someone else's.\"<br>\r\n<br>\r\nHis face turned red as he glanced at the ground. <br>\r\n<br>\r\nKat just smiled, \"It seems like you're only part way done helping me. I want all of you.\"</span></div></div>",
            "created":1526274000,
            "id":2493197,
            "title":"Icing on the Cake"
        },
        "11111111111111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Push her food limits again",
                "Do the deed again",
                "Suggest something else"
            ],
            "content":"<div class=\"\"><div> <span>Morning sunlight streamed into the room casting a golden glow as Kat began to stir in her bed. Sounds of her mother in the kitchen echoed through her closed door as the smell of bacon reached her nose. The cool air tickled her belly as she threw the sheets from herself, and hung her legs over the side of the bed. <br>\r\n<br>\r\nShe rubbed her eyes as she stood up, taking a moment to tug on her shirt as she walked towards the bedroom door. Her belly jiggled slightly with each step and her thighs rubbed together while a slight growl emanated from her empty belly. She gave a tug on her waistband, trying to get it to sit more comfortably on her frame as she opened the door and made her way across the hall.<br>\r\n<br>\r\nThe bathroom door closed with a click behind her, leaving her temporarily in the dark before she turned on the light and turned to face the mirror, frowning at what she saw.<br>\r\n<br>\r\nThere was no mistaking that she was chubby now, maybe even borderline fat. Her hands grabbed her love-handles, feeling the soft flesh in her hands as she moved them under her slightly hanging belly. Her soft breasts hung down towards her stretch-marked belly, resting lightly against the top of it. Her eyes moved towards her round face sporting a noticeable double chin. She stepped onto the scale, dreading what it would say.<br>\r\n<br>\r\n198<br>\r\n<br>\r\nHer groin started to tingle as she looked herself over, thinking about how she'd gained 30 pounds in a week as her hand moved into her panties. Despite her weight gain, she was still rather beautiful, perhaps better looking than she'd been before. However, that probably wouldn't last if she kept gaining. Her free hand began tracing one of her stretch marks, feeling the slight indentation of the skin. She'd never thought she'd have stretch marks. Yet even they seemed rather beautiful as they accented all her curves in perfect symmetry.<br>\r\n<br>\r\nTaking a few more minutes to admire herself, she made her way downstairs where her mother had left her a large plate of breakfast, and Theo was waiting for her.<br>\r\n<br>\r\nDespite her obvious weight gain, her family almost seemed to be encouraging her to continue gaining weight. They always tried to make sure she had plenty of food at every meal. Her mother had also taken her clothes shopping, where she discovered she'd definitely gone up a few sizes. However, her mother had made her get clothes a couple sizes bigger than even what she thought she needed. <br>\r\n<br>\r\nShe kissed Theo before sitting down at the table, where he brought her the large plate of food, \"So Kat, what should we do today? We have another Saturday. Did you want to try the burger for the seventh time in a row, or something more pleasurable?\"<br>\r\n<br>\r\nShe smiled thinking of the first time they'd done the deed and how good it had felt. After that she'd really seemed to let herself go when it came to food, as she'd insisted that they go back for the massive burger every day at lunch. It was definitely getting easier for her to eat it, and her waistline was definitely starting to show it. Though, Theo seemed to be thoroughly enjoying watching his girlfriend blow up like a whale. She paused after taking a bite, trying to decide what to do...<br>\r\n<br>\r\n</span></div></div>",
            "created":1526274000,
            "id":2493227,
            "title":"Aftermath"
        },
        "111111111111111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "was surrounded by empty food packages",
                "felt really nauseous ",
                "Heard her mother call that breakfast was ready"
            ],
            "content":"<div class=\"\"><div> <span>Slowly chewing the piece of toast in her mouth, Kat glanced towards Theo. He was leaning against the counter watching her eat.<br>\r\n<br>\r\nShe smiled at him, tugging slightly on her shirt to reveal a sliver of belly before taking another bite of toast. She really was starting to get comfortable with her larger body, though she was definitely going to have to be careful if she didn't want to keep getting fatter. Though at this point there was no denying that she probably wouldn't ever get back down to being a twig again. It probably would be okay if she let herself get a bit fatter as long as she stopped herself before she got huge. After all, she did look really good with the extra weight.<br>\r\n<br>\r\n\"How about we go back for the burger,\" Kat said as she swallowed her mouthful of food, \"Then we can do whatever you want to do.\"<br>\r\n<br>\r\nTheo smiled, \"Hey, I'm happy as long as you're happy. Besides, I definitely have to say that I'm enjoying the new you.\"<br>\r\n<br>\r\nKat blushed slightly as she took another bite. She was still embarrassed when he mentioned her weight gain, but at the same time it seemed to give her butterflies in her stomach. It was proof that she really was gaining weight. However, the bigger she got the happier Theo seemed to be.<br>\r\n<br>\r\n\"Do you really like seeing me get fatter?\" Kat mumbled, glancing at her soft belly.<br>\r\n<br>\r\nTheo laughed, and walked over towards her, placing his hand on her belly, \"I do. Honestly though, I just want you to be happy. Even if you hadn't put on any weight I still would want to be with you.\"<br>\r\n<br>\r\n\"How big would you like to see me get? And be honest.\" Kat said, looking into his eyes.<br>\r\n<br>\r\nHe went red, glancing at the ground, \"Well, uh, if I was being honest, I, uh, would like to see you get so big that you became immobile, and I could just spend all day feeding you and spending time with you, but, uh, I guess another 50 pounds or so.\"<br>\r\n<br>\r\nTheo shuffled his feet, obviously uncomfortable sharing this piece of information. He seemed to be waiting for Kat to blow up at him as he continued staring at the ground.<br>\r\n<br>\r\nShe couldn't believe it. She'd never pictured herself being so fat that she couldn't even move, however, the thought of it seemed to be making her wet. There was no way she'd let herself get that big though, but 50 pounds wouldn't be too hard for her to do. That actually sounded like a good weight to maintain. That would put her at about 250 pounds. She could live with that.<br>\r\n<br>\r\nShe smiled, putting her hand on his, pressing it into her soft belly, \"How about this, I'll gain another 50 pounds, but then you have to help me maintain that. I don't really want to be immobile, but I don't think a little more weight will be that bad at this point.\"<br>\r\n<br>\r\nHe glanced up at her sheepishly, \"Really?\"<br>\r\n<br>\r\nKat pulled him into a hug, \"Of course silly. Now I'm starving so lets go get a burger.\"<br>\r\n<br>\r\nTheo smiled at her, almost bouncing with joy, \"Alright, lets go.\"<br>\r\n<br>\r\nShe put her empty plate in the sink, and followed Theo out to his car, plopping down in the passenger seat. The whole car ride Kat kept asking Theo more about his weight gain fetish. She knew that he liked fat girls, but when he had told her he wanted to see her immobile it had taken her by surprise. Now she was curious about this fetish. She was surprised when he told her that it was actually a really big thing on the internet, and that girls would get paid tons of money just to eat and get fatter. However, the more she learned about it, the more it intrigued her. Theo also seemed to become more comfortable talking about it once he realized that Kat wasn't going to blow up at him about it. <br>\r\n<br>\r\nAfter a short ride, they arrived at the burger place. Theo opened Kat's door for her, letting her out into the cool spring air. The smell of fried food mingled with the smell of fresh cut grass from one of the nearby houses, as the hum of a lawn mower created a perfect white noise.<br>\r\n<br>\r\nThe couple continued talking as they made their way inside the restaurant, the sound of people socializing replacing the lawn mower. The cashier behind the counter waved at them as they entered a knowing smile on his face, \"Should I get the usual?\"<br>\r\n<br>\r\nThey both smiled as Kat replied, \"Of course. Although I'm extra hungry today, so could you add another double burger or too?\"<br>\r\n<br>\r\n\"And I'll just have a double burger\" Theo said, smiling at Kat.<br>\r\n<br>\r\n\"Of course, it'll be right out\" the cashier called to them as they moved towards an empty booth. <br>\r\n<br>\r\nThey kept chatting, Kat continuing to grill Theo on this weight gain thing, thoroughly intrigued by it as they waited for their food. The more he told her about it, the more she wondered what it would be like to just keep getting fatter and fatter until she couldn't move anymore. As she thought more about it, she found herself becoming more and more aroused until she finally had to stop herself. Why was she even considering becoming that big?<br>\r\n<br>\r\nFortunately, at that moment a large burger was placed in front of her, along with two smaller burgers. Her and Theo both thanked the old man who had set the plates there, before he walked back towards the kitchen. They both dug into their food, the conversation on hold for the time being as they both ate hungrily. <br>\r\n<br>\r\nAs the food disappeared from in front of her, Kat could feel her belly swelling up with food. Her pants began feeling tighter and tighter, and her shirt started stretching slightly. She was surprised how quickly she was outgrowing her clothes considering that earlier this week they'd been a bit big on her. She kept eating, enjoying the feeling of stuffing herself as Theo continued to eat his food as well. <br>\r\n<br>\r\nAfter they ate they went back to her house, where they found themselves doing the deed again before Theo finally left to go home. Once he was gone, Kat locked her bedroom door, and got her laptop out, laying on her bed.<br>\r\n<br>\r\nHer eyes went wide in surprise at the first few images that popped up on the web. These girls were huge! And sure enough, there was a ton of them. She couldn't help notice just how happy they all seemed to be with their massive bodies as they ate or played with their bellies. Kat found herself fingering her lubed pussy as she wondered what it would be like being as big as some of these girls. It was interesting to see the progressions on some of them as they went from twigs to hardly able to fit through a door. She wondered what it would be like to get that fat, watching her body grow and grow as she became a whale. <br>\r\n<br>\r\nShe gasped as she pushed herself over the edge, panting as she lay back, closing her eyes. She couldn't believe that she'd just masturbated to fat girls, but part of her really enjoyed the sight wanting to see them get bigger and bigger. As she lay there, she wondered if there was something wrong with her. Why was she so turned on by girls getting fat? Was it because she was becoming one of them? Or was she just twisted? <br>\r\n<br>\r\nShe closed out of the browser, and shut down her laptop before setting it on the floor beside her bed. Pulling up her shirt she looked at her soft belly rising and falling as she tried to get her breathing back under control. Taking it in her hands, she began kneading it, feeling the fat in her hands as she imagined it bigger. She imagined what it would be like to be able to fit her whole arm under her belly. She imagined how heavy it would feel as she walked, each step causing her to jiggle. Her thoughts drifted to what it would be like to feel both sides of her butt brush against the door frame as she tried to squeeze her massive body through. Finally, her thoughts turned to being so big that she couldn't even get out of bed as Theo fed her everything that she wanted. <br>\r\n<br>\r\nShe didn't know when she fell asleep, but when she awoke she remembered all her dreams of becoming fatter and fatter, as she gorged herself. However, her thoughts were interrupted as she... </span></div></div>",
            "created":1526360400,
            "id":2493484,
            "title":"Challenge"
        },
        "1111111111111111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Appologize and tell her no to a diet",
                "Ask for a diet",
                "Ask for help gaining"
            ],
            "content":"<div class=\"\"><div> <span>Something cold touched brushed Kat's side, crinkling slightly.<br>\r\n<br>\r\nJumping slightly, her hand reached for the object. A moment later she pulled an empty chip bag from under her.<br>\r\n<br>\r\nKat scrunched up her face, wondering how it had got there. She threw it towards her trash can, her eyes following it through the air. However, that was when she noticed that it was not alone. Numerous empty packages littered the floor and her bed, strewn haphazardly across the room. She slowly sat up, feeling heavy and sluggish as she did. She glanced down at her belly, confirming her suspicion.<br>\r\n<br>\r\nHer belly was bulging more than it had the day before. It was noticeably softer, with a couple new rolls forming as it hung over her tight panties. Her breasts seemed to be trying to escape her bra, which seemed a bit tight on her this morning. <br>\r\n<br>\r\nUnsteadily, she got to her feet, feeling as if her balance was off, she started making her way towards the bathroom. She opened her door a crack, making sure no one would see her as she darted across the hall, shutting the bathroom door behind her, she leaned against it for a moment, panting in exertion. She flipped on the lights, and turned towards the mirror.<br>\r\n<br>\r\nHer heart seemed to stop for a moment, and her breath caught in her throat. There was no way that was her. However, the image in the mirror mimicked her every move as she looked herself over. <br>\r\n<br>\r\nA soft belly stuck out from between her shirt and pants, red stretch marks emphasizing its surface, while her love handles had almost become the thickness of a tire. Her thighs pressed firmly together while her thick arms caressed her plush body. Her face was round with a large double chin. Her breasts seemed almost two cup sizes too big for her bra, as she felt their weight in her hands. <br>\r\n<br>\r\nMoving almost on instinct she stepped onto the scale, knowing already the truth.<br>\r\n<br>\r\n225<br>\r\n<br>\r\nA flutter of excitement filled her, quickly replaced by dread. How was she going to explain that she'd gained 25 pounds in a day? The better question, How did she gain 25 pounds in one day? There was no mistaking that she was fat now, but this wasn't how she had planned it at all. So much for keeping herself in check.<br>\r\n<br>\r\n\"Kat! Breakfast is ready\" her mom called up from the kitchen, the unmistakable smell of bacon wafting through the door. <br>\r\n<br>\r\n\"OK. I'll be down in a minute.\" Kat yelled back, her voice almost cracking as she tried not to panic. <br>\r\n<br>\r\nWhat would her mom think when she saw her? She couldn't expect her to buy her new clothes just a week after she'd already bought a new wardrobe. She took a few deep breaths, trying to calm herself.<br>\r\n<br>\r\nSlowly, she opened the door, stepping into the hallway as her belly gave a growl of anticipation. She walked towards the stairs, feeling herself jiggle with each step. Slowly she made her way closer to the kitchen, trying to think of what she was going to say when her mom freaked out. However, thoughts of gorging herself kept popping into her head, stuffing her belly, watching herself get fatter and fatter. Despite what had happened she still wanted to eat that delicious breakfast she knew would be waiting for her. Her mouth started salivating, and her pace quickened towards the sustenance she needed.<br>\r\n<br>\r\nShe rounded the corner into the kitchen taking in the scene before her. <br>\r\n<br>\r\nHer mother was standing at the stove, back to the door, working on more cooking. A massive plate of food sat at Kat's spot at the table, while her brother had his head in a book with a much smaller portion in front of him. Neither of them looked up as Kat made her way to her spot, plopping down in her chair, which groaned in protest of the plump girl. <br>\r\n<br>\r\nShe scooted her chair in as far as she could, trying to hide her swollen belly, as she instinctively started shoveling food into her mouth. <br>\r\n<br>\r\n\"It's good to see you eating so much now.\" Kat jumped as her mother placed another plate in front of her, \"You are definitely looking much healthier.\"<br>\r\n<br>\r\nKat looked at her plate, feeling her face grow red. She hesitated, before taking another bite, almost losing her appetite.<br>\r\n<br>\r\nHer mom put her hand on Kat's shoulder, \"Looks like we need to get you more clothes. We must not have gotten them big enough for you. After all, you are a growing girl.\"<br>\r\n<br>\r\n\"You don't think it's weird that you just bought me clothes last week?\" Kat mumbled, feeling her face flush.<br>\r\n<br>\r\n\"Of course not!\" her mother said, \"Why would I think that? Because you're finally not looking so anorexic?\"<br>\r\n<br>\r\nKat put her silverware down, turning to face her mother, \"Do you think I'm putting on too much weight?\"<br>\r\n<br>\r\nHer mother looked at her surprised, \"Of course not! You're starting to develop into a fine young woman, that's all.\"<br>\r\n<br>\r\n\"Really? I don't look fat to you?\" Kat shot, raising her voice slightly.<br>\r\n<br>\r\nHer mother took a step back, \"Kat! What's gotten into you? Don't take that tone with me!\"<br>\r\n<br>\r\nKat shrunk away from her mother who kept right on going, \"Yes you're starting to look a little on the plump side, but I thought as long as you're happy, then that was enough. You've seemed so much more confident in yourself, that I was just happy to see you finally opening up. Now if you want, I can put you on a diet, is that what you want? Otherwise, I'm more than happy to indulge you with the food that you desire.\"<br>\r\n<br>\r\nKat stared at the floor, trying to think what to say. On the one hand she'd never felt so confident in herself, but if she didn't rein herself in soon, she didn't think she'd be able to stop. However, another thought occurred to her that perhaps her mother could help her gain weight.</span></div></div>",
            "created":1526360400,
            "id":2493793,
            "title":"Sleep Eating"
        },
        "11111111111111113":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "25 pounds",
                "100 pounds",
                "Want to be the fattest girl"
            ],
            "content":"<div class=\"\"><div> <span>The silence stretched on, each moment seeming to last forever as Kat tried to decide what to say. The sound of Nathan turning one of the pages in his book seemed far louder than it should be, as Kat continued staring at the floor.<br>\r\n<br>\r\nFinally, she looked up at her mother, who had her hands on her hips, \"Well Kat? I'm waiting.\"<br>\r\n<br>\r\nKat's face was on fire, as she opened her mouth, trying to find the words, \"H-honestly, I have been happier lately, and I am kind of enjoying myself.\"<br>\r\n<br>\r\n\"So why this sudden outburst?\" Her mother said, seeming to relax.<br>\r\n<br>\r\n\"I guess I was just worried about what everyone would think of me,\" Kat said quietly.<br>\r\n<br>\r\nHer mother put an arm around her shoulder, bringing her in for a hug, \"What other people think shouldn't matter. After all, they don't know you or your situation, whatever it may be. What is important is that you are happy.\"<br>\r\n<br>\r\n\"Thank you,\" Kat said as she leaned into her mother, \"There was one thing I'd like to ask though.\"<br>\r\n<br>\r\nTaking a step back, Kat's mother looked her in the eyes, \"Anything.\"<br>\r\n<br>\r\nKat took a deep breath, glancing at her belly before looking back at her mother, \"Would you help me get fatter?\"<br>\r\n<br>\r\nHer mother looked surprised for a moment, then smiled, \"Of course. It has been so nice seeing you happy finally. Did you have any particular weight in mind?\"<br>\r\n<br>\r\nKat thought for a moment before replying...</span></div></div>",
            "created":1527483600,
            "id":2500062,
            "title":"Ally"
        },
        "111111111111111133":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Get a \"snack\" and risk being late for school",
                "Make it to school on time",
                "Skip school and go out to eat"
            ],
            "content":"<div class=\"\"><div> <span>\"I want to be the fattest girl ever!\" Kat was surprised to hear those words come out of her mouth. Though she had definitely fantasized about it, she never thought she'd act on it. She was sure she'd say something like 10 pounds or even 100, but not what had come out of her mouth. She glanced at her mother trying to tell what she was thinking.<br>\r\n<br>\r\nHer mother was just standing there, a slight look of surprise on her face, \"Are you sure? That's a lot of weight, and there would be a lot of things you wouldn't be able to do.\"<br>\r\n<br>\r\nKat relaxed, trying to figure out when she'd tensed up in the first place. She took a deep breath, thinking about what she really wanted before responding confidently, \"Yes. That's what I want.\"<br>\r\n<br>\r\nHer mother smiled, \"Alright, if that's really what you want.\"<br>\r\n<br>\r\n\"It is.\"<br>\r\n<br>\r\n\"If you change your mind just let me know sooner rather than later, because it will probably become impossible for you to lose the weight once you get too big.\" Her mother said.<br>\r\n<br>\r\n\"I will.\"<br>\r\n<br>\r\nHer mother strode back to the stove, turning it on again, \"Then let me make sure that you are getting plenty to eat. And I'll also have to run to the store and make sure you have plenty of snacks for between meals.\"<br>\r\n<br>\r\nBy the time Kat had finished the first plate, another large plate was placed before her as delicious smells filled the air. Her mother excused herself after Kat had only taken a couple bites, and she noticed that Nathan must have snuck out of the kitchen at some point, leaving only his closed book as evidence he'd been there.<br>\r\n<br>\r\nShe seemed to lose control of herself, shoveling the food into her waiting mouth, hardly chewing before swallowing. Eager to devour another mouthful. She smiled at the delicious flavor filling her mouth, as her groin seemed to be stirring awake. Once she was finished, she leaned back in her chair, feeling like she could still go for more food.<br>\r\n<br>\r\nLater that day she let Theo know about her new plan, and he seemed eager to help her. With the help of her family and Theo, each day was filled with food and stuffing as she let herself enjoy her new body. She felt happier and freer than she'd ever felt before, and had no desire for it to stop. Fortunately, everyone seemed more than eager to oblige the growing girl. Theo seemed especially happy at his growing girlfriend, having a harder and harder time keeping his hands off her soft belly. However, she really enjoyed it when he would play with her gut, massaging it and jiggling it in his hands. <br>\r\n<br>\r\nThe girl in the mirror was hardly recognizable from the Kat she used to know, with a large belly resting in the sink as it cupped it gently. Stretch marks covered her skin, seeming to accentuate her femininity as a testament to her massive gain. Her face was round and soft with a noticeable triple chin. Her large breasts rested on her fat stomach like two large melons. Her large thighs seemed constantly pressed together, jiggling with each move she made. She took a few careful steps towards the scale, gently stepping on it, she tried to peer past her belly.<br>\r\n<br>\r\n330<br>\r\n<br>\r\nHer heart skipped as she saw that, and a smile cracked her face. Over 100 pounds in about a month. At this rate it wouldn't take long for her be the fattest person ever. However, she did seem to be slowing down in her gaining, despite the fact that she was eating more. Though that could be due to the fact that she was having to work a lot harder just to move around or anything like that. Gym class especially was becoming a pain. Sighing, she stepped off the scale as she set her belly back on the counter. It felt good when she could take even a little of the weight off her thick legs.<br>\r\n<br>\r\n\"Kat, breakfast is ready. I have to go to work early, so I can't take you to school.\"<br>\r\n<br>\r\n\"Alright! Thanks Mom!\" Kat shouted through the bathroom door, her belly gurgling at even the mention of food. However, she frowned at the other thing her mother had said. Normally Theo would just give her a ride to school, but he was out of town on vacation and so her mother had been giving her rides to school so she didn't have to make the walk despite it only being a few blocks away. Her father and brother had already left, leaving her with no way of getting a ride to school.<br>\r\n<br>\r\nShe hoisted her belly in her arms, before letting it fall with a jiggle as she waddled out of the bathroom, closing her door behind her. She loved how her belly could cover her arms now and often found herself lifting her belly as she imagined it flowing over her plump arms. She wondered how long it would be before her belly was too heavy for her to lift anymore as she pulled her pants up, letting her massive gut hang over the tight waist. It was almost time to get new clothes, despite having got some just the other day. She pulled on a shirt, feeling it hug to her every curve as she pulled it over her belly. The fabric stretched tightly as it tried to accommodate a larger girl than it was made for.<br>\r\n<br>\r\nFinally dressed, she made her way down to the kitchen as her body jiggled with each step and her thighs rubbed together, teasing her wet pussy. She plopped down in her chair, a massive spread of food already laid out as the chair groaned in protest of the young girls weight. She greedily began devouring the food, feeling it filling her growing belly as she became more and more aroused with each bite, imagining what it was doing to her body.<br>\r\n<br>\r\nShe imagined every bite slowly expanding her body while she grew heavier and heavier. Her belly spreading out before her as it became massive, extending over her knees and making its way towards the ground. However, too soon she ran out of food having eaten enough for about 10 people. She rubbed her stomach which growled, eager for more food. She glanced at the cupboard, wondering what to do...</span></div></div>",
            "created":1527483600,
            "id":2500122,
            "title":"Ambition"
        },
        "1111111111111111331":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Run to school",
                "Walk to school",
                "Skip School"
            ],
            "content":"<div class=\"\"><div> <span>The chair creaked in relief as the large teen stood up, each step towards the cupboard accompanied by the loud thump of her feet. Numerous bags of snacks filled her view as she threw open the doors, and she instinctively reached for a box of girl scout cookies. The top of the box ripped as she tried to break the fresh seal on it, but it didn't matter. She had no intention of leaving any cookies to spoil or stale. <br>\r\n<br>\r\nAn explosion of flavor filled her mouth as she put the first cookie in her mouth, followed by another, then another. The empty box clattered on the floor as she reached for another, the top ripping as she eagerly attacked the morsels inside. That box landed next to the first as she grabbed for another to fill her waiting belly. Box after box landed unceremoniously on the floor, their contents devoured by the greedy teen.<br>\r\n<br>\r\nAfter about 10 boxes, Kat glanced at the clock<br>\r\n<br>\r\nHer heart skipped as she realized how late she was. She might be able to make it if she ran, but running had proven to be harder since she'd become so large. On the other hand, she would definitely be late if she didn't hurry.</span></div></div>",
            "created":1528088400,
            "id":2502831,
            "title":"Get a \"snack\" and risk being late for s..."
        },
        "11111111111111113312":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Ignore her",
                "Confront her",
                "Set her up to get in trouble"
            ],
            "content":"<div class=\"\"><div> <span>After grabbing her supplies for school, Kat left through the front door, closing it with a click behind her as she began waddling towards school. It had been a long time since she'd done this walk, and she could tell from her heavy breathing by the time she'd made it to the end of her street. <br>\r\n<br>\r\nThe air was warm, but fortunately a cool breeze helped her from overheating as she trudged along. Her footsteps were loud and heavy on the sidewalk, while the sound of her heavy breathing filled her ears. Occasionally a car would pass her on its way to some other destination, making her long for Theo to return so he could give her a ride again. <br>\r\n<br>\r\nShe smiled as she felt her belly in her hands, glancing around to make sure no one was watching. She still remembered when she had been that thin girl who had no problems doing physical activities, but that girl hadn't been happy. She'd always been so concerned with her appearance and what others would think of her, that she hadn't really enjoyed what she'd had. However, now that there was no mistaking her as one of the fattest girls in school, she found herself enjoying life so much more despite her new physical limitations. <br>\r\n<br>\r\nFinally, the school came into view. She was panting heavily, feeling completely out of breath from the short walk, but she loved that feeling. She knew she was definitely late now, but there was no way she could've run the whole way. She really needed to invest in a car for herself. <br>\r\n<br>\r\nShe grudgingly climbed the few steps to the front door, and went inside, glancing around the empty halls. She trudged towards her locker, opening it she pulled out a cupcake and started eating as she made her way towards first period. <br>\r\n<br>\r\n\"Nice of you to finally join us.\" Said a balding man standing at the front of the room as she walked in, \"Now, take your seat so that we can get back to the lesson.\"<br>\r\n<br>\r\nKat hung her head, plopping into her chair at her desk as it creaked in protest of the massive teen. She adjusted her belly, setting it on top of the desk, as she started digging around in her book bag for her notebook. <br>\r\n<br>\r\n\"What, are you too fat to make it to class on time?\" a quite whisper came from beside Kat.<br>\r\n<br>\r\nShe glared at the thin blond girl sitting in the seat next to her's, continuing to look for her notebook.<br>\r\n<br>\r\n\"Oh, I get it, you're too fat to talk now.\" The girl giggled, kicking Kat's bag away.</span></div></div>",
            "created":1530075600,
            "id":2512564,
            "title":"Walk to school"
        },
        "111111111111111133121":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Agree to go to lunch",
                "Decline politely",
                "Get mad at the mere suggestion"
            ],
            "content":"<div class=\"\"><div> <span>Kat glared at the girl, before reaching for her bag which had slid a couple feet away. She grunted in exertion as she tried to bend around her large belly, while also trying not to fall out of her desk. <br>\r\n<br>\r\nShe frowned, as she brushed the bag with her finger tips trying to ignore the quiet laughter coming from beside her. Susan had always teased Kat, even before she'd started blowing up like a blimp. Though, that was probably because Susan had always been part of the popular crowd, and had been jealous of how easily Kat had managed to stay thin. So, now that she was starting to get huge, it was kind of a dream come true for Susan. Kat had just learned to ignore her, and she would usually grow bored of not getting a response after a couple minutes.<br>\r\n<br>\r\nFinally, Kat managed to grab her bag and resumed her search for a notebook while the teacher just kept droning on about the structure of a sentence. Kat opened her notebook and began taking notes, listening to the scratching of pencils around the room doing the same. <br>\r\n<br>\r\nShe nibbled on her eraser, wishing she'd had time to eat more. Despite the fact that she'd been late because she had wanted a snack, she was still hungry. Though, she really needed to be focusing on what the teacher was saying. Since she'd slowly been losing her physical prowess, she'd been trying harder to be a better student. Though it was hard to focus when she was so hungry. <br>\r\n<br>\r\nKat glanced disappointingly at the rather empty page of her notebook as the bell rank. She'd spent most of class daydreaming about food, as her stomach had continued to voice its disapproval at not being fed more. She slowly stood up, grabbing her bag from the ground with some difficulty as she started towards her next class.<br>\r\n<br>\r\nShe smiled as she felt the way her body jiggled with each step. She'd never imagined that she'd love being fat so much, but now she didn't want to stop. She often found herself fantasizing about what it would be like when she couldn't move anymore because she was so fat. She was so much happier now that she was really embracing this part of herself.<br>\r\n<br>\r\n\"Hey! Wait up Kat!\" she turned to see a chubby guy jogging towards her, his unkempt hair bouncing as he did.<br>\r\n<br>\r\nShe smiled and waved at Steve as he jogged towards her, \"What's up?\"<br>\r\n<br>\r\n\"I just wanted to say, I don't know how you can put up with Susan. She's gotten so mean since y-... lately.\" Kat smiled as Steve's face turned dark red. It was obvious that he was going to say, 'gained weight'. Still, the thought that others were really starting to notice how big she was excited her.<br>\r\n<br>\r\nThey walked in silence for a few minutes, and Kat was about to ask if there was anything else Steve had wanted to say, when he spoke up, \"So, um, since, uh, since Theo isn't here, I was, um, wondering if you wanted me to take you out to lunch?\"<br>\r\n<br>\r\nKat was so surprised that she stopped walking, or at least attempted to. Her weight carried her forwards another couple steps as she turned to look at the nerdy kid. On one hand she was really hungry and she definitely wanted more food than they offered here at the school. On the other, she'd never really eaten in front of anyone besides Theo, and she didn't want Steve to think she was a huge pig. Although another part of her wanted everyone to thing she was a huge pig.</span></div></div>",
            "created":1531976400,
            "id":2522079,
            "title":"Ignore her"
        },
        "1111111111111111331211":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Go all out and eat as much as she can",
                "Eat a large amount",
                "Try to restrain herself"
            ],
            "content":"<div class=\"\"><div> <span>She smiled at Steve, \"Sure. I'd love to. I'm absolutely starving.\"<br>\r\n<br>\r\nSteve let out a sigh of relief, as color returned to his face, \"Okay, I'll meet you in the parking lot at lunch.\"<br>\r\n<br>\r\nShe smiled, and agreed as he waved at her, striding off towards his next class with an obvious bounce in his step. They'd always been friends, though not nearly as close as her and Theo. She was sure that he had a bit of a crush on her, especially since she had started gaining weight. Maybe he felt more like she was in his league now that she was part of the fat crowd.<br>\r\n<br>\r\nShe smiled more, at that thought. She'd never really thought about it, but she was definitely part of the fat crowd now. She had overheard some of the other students talking about her as one of the fat girls now, though she'd never really given it much thought. She knew she was fat, but it had finally dawned on her that people were probably starting to really associate her as one of the fat girls. She found herself growing moist in the groin as she thought about it more.<br>\r\n<br>\r\nFinally, she shook her head, making her way towards her next class. She was panting hard by the time she'd made it up to the second floor of the school and plopped down in her desk, which was really starting to feel small to her large frame.<br>\r\n<br>\r\nWhen it was finally time for lunch, she made her way towards the parking lot, meeting up with Steve who took her to her favorite buffet place. Pulling into the parking lot, they made their way inside and found a booth. Now it was time to decide on how she was going to handle herself here with someone other than Theo.</span></div></div>",
            "created":1531976400,
            "id":2522080,
            "title":"A lunch date"
        },
        "11111111111111113312111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Return to school",
                "Stay and keep eating",
                "Ask to go home so she can digest, and raid her cupboards."
            ],
            "content":"<div class=\"\"><div> <span>Not wanting to waste any time, Kat went and loaded up a plate full of food, plopping her large body back down in the booth as she began devouring the massive portion. It didn't take her long to finish the first plate, and start on another. Then another. And another, and another and another. <br>\r\n<br>\r\nShe turned red as she realized that Steve was watching her with a shocked expression on his face. She'd let any semblance of self control slip away from her the moment she had food in front of her. Even feeling embarrassed at how much she was eating, she couldn't stop herself. Yet part of her was enjoying the thought that he must think that she's such a fat cow. He was probably realizing right about now why she had been blowing up like a blimp, but she just couldn't stop herself as she went back for another plate.<br>\r\n<br>\r\n\"Wow, you, uh, must have been really hungry.\" Steve finally says, watching Kat devour another plate of food into her greedy belly.<br>\r\n<br>\r\nShe felt her face turn red again, though she didn't slow down as she continued to ravage her current plate, \"Yeah, I had a small breakfast.\"<br>\r\n<br>\r\n\"So, um, I just wanted to let you know, that, um, I think you look a lot better like this.\" Steve said, his face turning red, \"I mean I know you have a boyfriend, but, um, you look more like, well, um, you.\"<br>\r\n<br>\r\n\"What does that mean?\" Kat asked through a mouthful of potatoes. <br>\r\n<br>\r\n\"Well, you never really struck me as the thin, athletic type to me.\" Steve said, \"with how much you loved food, I'm surprised you didn't look like this earlier.\"<br>\r\n<br>\r\nShe paused for a brief moment, before continuing her feast. This wasn't the first time she'd heard that from someone, but it was interesting how many people were actually enjoying watching her fatten herself up like a prize pig. Still, they weren't necessarily wrong. She was definitely a lot happier now that she had stopped worrying so much about staying thin, or how she could lose the weight. Not that she thought it would be possible to lose all this weight now. She was too much of a greedy cow to ever be thin again. <br>\r\n<br>\r\nThey chatted casually for the rest of lunch as Kat continued devouring plate after plate of food. Even when it was time to go, she was still hungry, but they had to get back to class. Although, maybe she could just tell Steve to let her stay so she can keep eating.</span></div></div>",
            "created":1532062800,
            "id":2522398,
            "title":"Can't contain this"
        },
        "111111111111111133121112":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "to the kitchen for a snack",
                "to take a shower",
                "to take a nap"
            ],
            "content":"<div class=\"\"><div> <span>Steve got to his feet, leaving a couple empty dishes on the table as he took a few steps and stopped. He turned around, looking at Kat as she continued devouring her plate of food. A small look of astonishment flashed across his face at how much she could eat, and she showed no signs of stopping. <br>\r\n<br>\r\n\"We should, um, we should probably get back to class.\" Steve said, fidgeting as Kat turned to look at him.<br>\r\n<br>\r\nNow that someone had indulged her belly, she was finding it really hard to stop as she glanced at the endless food at the buffet. Glancing at the empty plates in front of her, she made up her mind.<br>\r\n<br>\r\n\"Actually, I think I'm going to stay here. I've already got the homework done for my next couple periods and I'm still pretty hungry.\" She said. She emphasized this by pulling herself to her feet and waddling towards the buffet to load up another plate, leaving Steve with an awestruck face.<br>\r\n<br>\r\nShe was kind of disappointed to see that he'd left by the time she returned to the table, as she plopped down heavily to continue her meal. She'd kind of hoped that he'd stay and watch her continue to stuff herself like the fat pig she was. Besides, now she would have to walk home.<br>\r\n<br>\r\nSighing, she began digging into her current plate of food. She couldn't believe how big she was getting. To think that she'd been a thin girl once, though there was no trace of that girl any more. She hadn't been lying when she'd told her mother that she wanted to be the fattest girl ever. Still it surprised her at just how big she was getting, she thought as she grabbed another plate loaded with food. Her appetite seemed like it was almost limitless now as she constantly pushed her bounds to the absolute maximum of how much she could eat. <br>\r\n<br>\r\nGetting up, she grabbed another plate of food, and returned to her table to devour it before repeating the process again, and again, and again until finally she stopped after several hours of eating constantly. She looked over the mountain of plates that covered her table, while her stuffed belly filled the space between her and the table. She slowly struggled to her feet and started waddling slowly towards the door.<br>\r\n<br>\r\nShe shielded her eyes from the sun as she stepped out of the dimly lit restaurant and into the bright light of the outdoors. Instantly she felt a wave of heat wash over her, dulled only slightly by the cool breeze that ruffled the leaves in the trees as she began walking back towards her home. Within moments she found sweat beginning to bead on her brow as she hauled her heavy body through the parking lot and towards the sidewalk. Her body felt noticeably heavier after the large meal that she'd consumed, which wasn't good for her already overtaxed legs. <br>\r\n<br>\r\nShe breathed heavily as she tried to ignore the burning in her legs from the exertion of walking home. She couldn't wait for Theo to get back so he could give her rides again. Though if she had actually gotten her driver's license she wouldn't be in this situation in the first place. Still, she was finding it harder to fit in even the passenger seat, let alone the driver's seat. Soon, she might have to start riding in the back just because of how fat she was. <br>\r\n<br>\r\nFinally after an hour, her house came into view as she trudged towards it, her feet dragging on the ground by this point. Slowly she made her way inside, throwing her book bag onto the floor as she made her way...</span></div></div>",
            "created":1534136400,
            "id":2532784,
            "title":"Stay and keep eating"
        },
        "1111111111111111331211121":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Keep eating from her place on the floor",
                "Take a nap on the floor and wait for someone to help her up",
                "Keep trying to stand up"
            ],
            "content":"<div class=\"\"><div> <span>Her feet seemed to move on their own as they carried her towards the kitchen, despite her massive meal she'd just consumed. Her previously tight shirt had ridden up on her belly, leaving her belly button exposed after her massive meal. Her hands moved her soft belly, reaching for the button of her pants, releasing the tension with a small pop.<br>\r\n<br>\r\nShe smiled at the struggle. It was definitely getting harder to reach around her belly. <br>\r\n<br>\r\nShe grabbed her chair from her spot at the table, and moved it over towards the cabinet that was loaded with fattening snacks. She opened the doors and plopped down in her chair, feeling it shift uneasily as it creaked and groaned under the massive teen. Without hesitating, she grabbed the first thing she could and shoved it into her hungry mouth. Devouring it in an instant before moving onto the next.<br>\r\n<br>\r\nShe couldn't stop herself. Her hands kept feeding her more and more food, as the chair continued to groan under her. She'd never been this desperate for food before, and it kind of scared her a little. Though it also excited her. She was a slave to her desires now. <br>\r\n<br>\r\nHer belly slowly pushed forward as it filled with more and more food. Her shirt continued to ride further and further up as it revealed her massive stomach. Still, she kept shoveling as much food as she could into her mouth. <br>\r\n<br>\r\nShe didn't know how long she sat there, unable to stop eating, but she was finally brought back to her senses as she heard a loud crack. Suddenly, she found herself falling backwards as the chair gave way beneath her enormous weight. <br>\r\n<br>\r\nShe stared at the ceiling, trying to comprehend what had happened. She rubbed her sore backside, her hand sinking into the soft flesh. She must have eaten so much that the chair couldn't support her weight any longer. She found herself growing wet at the prospect of how much she must've eaten today as she glanced at her swollen body. There was no doubt that she was getting fat now.<br>\r\n<br>\r\nShe tried to push herself to her feet, but found she was too heavy. Slowly, she rolled onto her belly. Despite being on her hands and knees, her belly rested comfortably on the ground. She looked around trying to decide what to do.</span></div></div>",
            "created":1534222800,
            "id":2533586,
            "title":"Gluttony"
        },
        "11111111111111113312111211":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "One Month Later"
            ],
            "content":"<div class=\"\"><div> <span>Slowly, she crawled towards the cupboard as she tried to adjust to a sitting position. It took some effort, but she was able to get her legs beneath her, though they were spread wide by her large belly which rested between them. She couldn't stop herself as she grabbed more food and kept stuffing her face. <br>\r\n<br>\r\nShe couldn't believe how hungry she was. It was kind of scaring her a little as she continued shoveling food into her mouth. She'd always thought that she'd been in control of herself, even when she was binging, but this was different. She couldn't stop herself as she devoured more and more food. However, part of her was enjoying the helpless feeling. It wanted her to become a slave to her desires.<br>\r\n<br>\r\nHer belly was slowly expanding with food as her shirt rode further and further up on her stretching belly. Meanwhile, her pants were starting to become uncomfortably tight even though they were undone. Finally, after over another hour of stuffing she was able to stop herself. She was panting as she rubbed her globular belly.<br>\r\n<br>\r\n\"Kat, what are you doing down there?\" your mother said, entering the kitchen with an armful of groceries.<br>\r\n<br>\r\nKat turned quickly, looking at her mother and smiled, \"I was having a snack and the chair broke.\"<br>\r\n<br>\r\nHer mother just chuckled to herself, \"Well that's what happens when you get as fat as you are. Here let me help you up.\"<br>\r\n<br>\r\nHer mother set the groceries down, and Kat took her hand as she tried to help her rise, grunting with the effort. <br>\r\n<br>\r\n\"Well, it looks like for now you might need to use two chairs.\" her mother said as Kat finally rose to her feet, \"And it looks like it might be time for more clothes again. Though at the rate your going, you might be immobile soon. Are you sure that's what you want? I don't think you'll be able to change your mind once you get much bigger. I mean, I'm happy that you're so happy right now, and if you still want to get that fat, I'll help you as best I can. I just don't want you regretting it and not being able to change your mind.\"<br>\r\n<br>\r\nKat glanced down at her massive belly, her hands rubbing the exposed flesh. On the one hand, she was definitely starting to struggle physically. However, it was true that she had never been happier. Actually, she was enjoying the physical struggle, since it was a sign that she really was getting fat.<br>\r\n<br>\r\n\"I want to keep getting fatter. This is the happiest I've ever been, and if it means I become immobile, that's what I want. I don't ever want to stop growing fatter.\" Kat finally said, looking her mother in her eyes.<br>\r\n<br>\r\n\"I just want you to be sure, because I think that you're at the point of no return.\" she replied, starting to take the groceries out of the bags. <br>\r\n<br>\r\n\"I'm sure.\" Kat replied.<br>\r\n<br>\r\nShe smiled, \"Well then I guess we'll have to start getting sturdier furniture to support my growing girl and her growing appetite.\"<br>\r\n<br>\r\nKat did her best trying to clean up the numerous rappers and boxes that littered the floor while her mother brought in more and more food.<br>\r\n<br>\r\nShe grunted as she tried bending over, her massive belly getting in her way as she tried to clean up. She couldn't believe how hard it was getting just to reach the floor while standing. She found herself growing moist in the groin as she thought about how big she was really getting. She couldn't wait until she could actually say she was immobile. Still, she also couldn't forget the feeling of helplessness as she'd binged today. She'd been completely unable to stop herself. Though it wasn't like she really wanted to stop. After all, eating was how she would continue getting fatter.<br>\r\n<br>\r\n</span></div></div>",
            "created":1535000400,
            "id":2537854,
            "title":"Unstoppable"
        },
        "111111111111111133121112111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Ask to stay home from school",
                "Go to school"
            ],
            "content":"<div class=\"\"><div> <span>Kat stretched her heavy body, turning onto her side as her body jiggled with each movement. She could feel the warmth of her massive breasts touching the underside of her round face. Her sausage sized fingers fumbled with her alarm clock as she attempted to stop the incessant beeping. Birds could be heard singing outside her window which was letting in a soft golden light. She could smell food cooking in the kitchen causing her stomach to growl in anticipation.<br>\r\n<br>\r\nShe licked her lips, laying back in her bed. She was panting slightly from the exertion of turning off her alarm. It had been one month since she'd broken the chair in the kitchen while she binged uncontrollably, and she'd felt fear at her inability to stop herself. However, now she realized that was because she hadn't wanted to stop. She'd been trying to fight her own desires. Since that incident, she'd approached gaining with a new vigor. Her mother had stayed true to her word, and continued helping Kat on her journey to become fatter. Every morning she would cook Kat a large meal, and always made sure to have plenty of snacks available for her. <br>\r\n<br>\r\nKat turned towards the door as she heard a light rap. After a moment, the door creaked open a crack as Theo poked his head in.<br>\r\n<br>\r\n\"I thought I heard your alarm.\" he said, stepping fully into the room.<br>\r\n<br>\r\nKat smiled, laying back on her bed, \"Yep.\"<br>\r\n<br>\r\nTheo made his way across the room, sitting on the side of the bed as he leaned over her body to kiss her.<br>\r\n<br>\r\nShe blushed, feeling his body pressing into her soft one. He had really been enjoying watching her getting fatter, and she had really enjoyed all the affection he'd been giving her. He seemed especially eager for her to reach the point where she was immobile, since he seemed to be treating her like she was already.<br>\r\n<br>\r\nAs if on queue, he asked, \"Do you want me to bring you your food so you don't have to get out of bed?\"<br>\r\n<br>\r\nKat smiled, before pulling him in for another kiss, \"I'm fine. I might as well enjoy my mobility while I have it.\"<br>\r\n<br>\r\nHe stood up, reaching out an arm to help her to her feet. She took it, scooting her large body towards the edge of the bed, and hanging her legs over the edge. Her belly covered most of her legs, coming over halfway to her knees, making her thighs warm as she sat on the edge of the bed. She rocked back and forth a few times, using her momentum to get to a standing position with Theo's help.<br>\r\n<br>\r\nShe pulled him into a hug, pressing him into her soft body as she felt his rod starting to press into her.<br>\r\n<br>\r\nShe smiled and winked at him. They had been fairly sexually active lately. Her parents were pretty accepting of this, as they knew it wasn't like she was going to be getting out much soon. <br>\r\n<br>\r\n\"I'm going to head down and see if your mom needs any help. See you down there. And of course I'll give you a ride to school.\" Theo gave her another kiss on the cheek before leaving the room, and shutting the door behind him.<br>\r\n<br>\r\nShe stood watching the closed door for a minute, before waddling over towards the stand mirror in her room. Her body was getting so big that it was getting harder for her to fit herself in the mirror. Her face was nice and round, with incredibly chubby cheeks, framed by her long dark hair. Her neck seemed to be shrinking as her face got rounder and her torso got bigger. Her breasts rested against her bulging belly which rested against her thighs, even while standing. Several large rolls of fat accented how big she was starting to get. Her arms were probably as thick as most people's legs, and her legs were getting close to waist sized. <br>\r\n<br>\r\nShe smiled as she struggled to get her arms around her belly, trying her best to get them underneath. She loved how big she was getting. She often spent lots of time admiring her growing body in between meals and snacks and school. She didn't know how much longer she'd be able to get out of bed, and she wanted to enjoy how large she was. She loved seeing how out of shape she was, and how she was starting to become unable to do certain activities. She still wasn't fat enough though. She wasn't going to stop, ever. <br>\r\n<br>\r\nFinally, she waddled towards the door. A wave of delicious smells hit her nose as she stepped out of her room, making her way slowly towards the kitchen. The floor creaked with every heavy step she took as she shambled along. She took the stairs one at a time, getting both feet on each step before moving to the next. <br>\r\n<br>\r\n\"Hey honey. How are you today?\" Kat's mom said, placing a heaping plate of food at her place on the table as Kat entered the kitchen.<br>\r\n<br>\r\n\"Great! Starving.\" Kat said, moving towards the sturdy looking chair that had replaced the one she'd broken a month prior.<br>\r\n<br>\r\nThe chair creaked an groaned as she plopped her heavy frame down in it, but it held up. She ravenously began shoveling food into her waiting mouth, hardly tasting the food as ate. <br>\r\n<br>\r\n\"It always surprises me just how much food you can eat.\" Her mother said, placing another plate in front of Kat as she emptied the first.<br>\r\n<br>\r\n\"Me too.\" said Theo from his place by the stove, \"Though it's no wonder she's been growing so fast.\"<br>\r\n<br>\r\nKat just grunted in acknowledgement as she continued her massive binge. Plate after plate after plate made its way towards the gluttonous teen as she cleared each one of food. They had figured that she was probably eating between 50 and 100 thousand calories a day with how much she could eat. Still, she had never been happier.<br>\r\n<br>\r\nFinally, she finished her meal, sitting back in her chair. She patted her exposed belly, as she tried to ignore the fact she was still starving. She knew she had school, but she didn't really want to go even though she was doing better than she'd ever done before. It was getting so hard for her to even leave the house with how big she was getting, let alone spend a whole day at school. Maybe she could ask to take the day off. It was Friday, so that would give her the whole weekend off of school. Though she probably should go to school. </span></div></div>",
            "created":1535055720,
            "id":2537915,
            "title":"One Month Later"
        },
        "1111111111111111331211121111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Go with him, and bring Theo",
                "Go with him alone",
                "She'll have to think about it"
            ],
            "content":"<div class=\"\"><div> <span>With a grunt of exertion, Kat got to her feet and rested her belly on the table. She was breathing heavily, her face slightly red as she struggled to keep her legs from buckling. Her hands slowly kneaded her soft belly as she stared at it longingly.<br>\r\n<br>\r\n\"Are you about ready to go?\" Theo asked, coming to stand behind her as he placed his hands around her thick middle.<br>\r\n<br>\r\nKat smiled and closed her eyes. It was always so comforting to feel him holding her or snuggling with her. She chuckled slightly as she realized how hard it was getting for him to reach all the way around her. He really had to press into her just to get his hands to touch. Who knew how much longer he'd be able to do that though.<br>\r\n<br>\r\n\"Actually. I was thinking of staying home today.\" Kat said, wrapping her arms over Theo's.<br>\r\n<br>\r\n\"Are you feeling sick?\" her mother asked, taking the stack of dishes to the sink to be washed.<br>\r\n<br>\r\n\"No. I already turned in all the school work that was due today, and I just didn't see much point in going.\" Kat said, slowly rubbing Theo's arms.<br>\r\n<br>\r\nHer mother turned towards her, \"Alright. Just don't make a habit of skipping school. I know it's getting harder for you to go, but it's important.\"<br>\r\n<br>\r\n\"Well I guess I might as well take the day off as well then.\" Theo whispered into her ear, his breath warming the back of Kat's neck. <br>\r\n<br>\r\nShe smiled as she tried to pull him closer, feeling him sink deeper into her flesh, \"I think I need to lay down for a bit.\"<br>\r\n<br>\r\nTheo kissed her neck, sending shivers down her spine as he released her. Slowly she began waddling back towards her room with her heavy footfalls easily heard around the house. She found her breathing growing heavier and beads of sweat starting to gleam on her body as she struggled to climb the stairs to her room. <br>\r\n<br>\r\nPanting, she stopped for a break about halfway up. She couldn't believe how out of shape she was now, when even a flight of stairs was a heavy workout for her. Still, she couldn't wait until the day she couldn't even make it out of bed. Though with how fast she was growing, it might not be that much longer. Her groin began growing moist as those thoughts bounced around in her head, and she felt a tickle of excitement that almost caused her to touch herself right there. There was no turning back for her now. She couldn't restrain her appetite anymore, which meant there was no way she could stop herself from getting fatter. Not that she wanted to.<br>\r\n<br>\r\nShe was almost to her room when her brother ran up the stairs after her, panting hard, \"Hey! I'm glad you're still here.\"<br>\r\n<br>\r\n\"I was going to stay home from school today.\" Kat said, her hand on her door knob as she looked back at Nathan.<br>\r\n<br>\r\n\"Well, that's even better. I've been doing more research into the temple that we found and those statues since you didn't seem interested in them anymore. Anyway, I think I might know why you've been so hungry lately.\" He said, a look of excitement on his face.<br>\r\n<br>\r\n\"Really?\" Theo said, coming to stand beside Kat, who was thoroughly interested now.<br>\r\n<br>\r\n\"Yes. I think it has something to do with that statue that you touched. My research seems to indicate that somehow, it must have caused your appetite to grow. However, I won't know for sure unless we go back to the temple. I think I discovered an entrance to a secret part of the temple that only you can open.\" Nathan said, a pleading tone in his voice.<br>\r\n<br>\r\n\"Why me?\" Kat asked, a bit skeptical.<br>\r\n<br>\r\n\"It seems to be opened by your changing body. You were too thin to open the door previously, but now that you're heavier, the door should open for you.\" Nathan replied.<br>\r\n<br>\r\n\"So you're telling me that this is all because I touched some statue?\" She asked.<br>\r\n<br>\r\n\"Yes. I know it's hard to believe. But I'm certain that is the case.\" He said, looking at her with a look of determination.<br>\r\n<br>\r\n\"I've never been happier though. Why would I want to stop now.\" Kat asked.<br>\r\n<br>\r\n\"I never said you had to stop. I just can't get in without your help.\" Nathan pleaded.<br>\r\n<br>\r\nShe frowned slightly. If what he was saying was true, then maybe there was a way to get her old life back. Though she didn't really want to. Still, he didn't say that she had to stop, just that he needed her. Although, tracking through the forest would definitely be a lot harder now that she was a lot heavier. Still, maybe there was something there that would allow her to gain weight even faster. Or something that would allow her to keep her mobility longer while still getting fatter. If that was the case, it could definitely be worth it.</span></div></div>",
            "created":1536088860,
            "id":2542810,
            "title":"Lazy Day"
        },
        "11111111111111113312111211111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Start stripping and unlock the door",
                "Force Nathan to leave before opening door",
                "Don't mention the door"
            ],
            "content":"<div class=\"\"><div> <span>Kat's hair whipped behind her as she rode in the back of Nathan's Jeep. The smell of pine filled the air as the went deeper into the thick forest, following the worn service road. Kat could feel every bump jiggling her massive body as she found herself trying not to get too turned on by the thought of how big she was.<br>\r\n<br>\r\nShe'd been too big to fit in the passenger seat of Nathan's jeep, and so had been forced into the back. It wasn't exactly comfortable, but there was no other way to get her into the jeep. She could see Theo and Nathan chatting, but couldn't really hear what they were saying over the wind in her ears. Despite how big she was getting, she'd never had a problem like this before. Though it wasn't like she was too far off with Theo's car, since her belly was touching the dash, even with the seat pushed all the way back. Still, she knew that it was bound to happen eventually that she'd start getting too fat to do things besides physical activity. <br>\r\n<br>\r\nFinally, the jeep pulled to a stop in a small clearing. Theo and Nathan hopped out of the front, and made their way back to help Kat from the jeep. <br>\r\n<br>\r\n\"Alright. Shall we get going?\" Nathan asked over his shoulder, as he strode into the dense trees. <br>\r\n<br>\r\n\"I don't think I've ever seen your brother this excited.\"<br>\r\n<br>\r\n\"Me neither.\" Kat panted as she began waddling into the woods after the two boys. <br>\r\n<br>\r\nShe could feel sweat beading on her brow almost instantly as she made her way into the forest, despite how cool it was. Her once tone legs now struggled to keep up with the other two on the uneven ground as she felt them burning with exertion. She was wide enough that she was finding herself struggling to fit through some of the gaps that she had cleared easily the first time she'd come out here. <br>\r\n<br>\r\nStopping frequently to rest, they slowly made their way towards the temple that may have started it all. Theo and Nathan seemed to be getting along really well as Nathan told Theo all about the ancient civilization that once inhabited this region. It was hard to believe that she might be this fat because she touched a statue, but it might explain why she'd suddenly started having orgasms when she ate. It must have been encouraging her to show her real self. <br>\r\n<br>\r\nFinally, the temple came into view as the three of them pulled to another stop. Kat's shirt was plastered to her with sweat as she plopped down on a stone to rest her aching legs. She was going to have to eat a mountain of food to make up for all the calories that she was burning on this trip. There was no way that she was going to let Nathan convince her to get thin again. She was here to see if she might be able to speed up the gaining process, not reverse it. <br>\r\n<br>\r\n\"Let's head inside.\" Nathan said, reaching out to help Kat to her feet. <br>\r\n<br>\r\nShe took his and Theo's hands as they hefted the large girl onto her feet. <br>\r\n<br>\r\n\"I can't believe how heavy you are.\" Nathan groaned.<br>\r\n<br>\r\n\"Hey! I'm not even four hundred yet!\" Kat shot back. <br>\r\n<br>\r\n\"Yeah, well you feel like a ton.\"<br>\r\n<br>\r\nKat glared at Nathan as he walked towards the temple, while Theo put an arm around her broad shoulders, \"I love how big you've gotten, and I can't wait to see how big you're going to get.\"<br>\r\n<br>\r\nKat just smiled as Theo followed after Nathan, and began waddling after them. She would never tell Theo, but even if he didn't like how big she was, she didn't think she'd stop gaining at this point. At first she may have been gaining for him, but now she was doing it for herself. <br>\r\n<br>\r\nKat shivered slightly, as they entered the cool interior of the temple. Their footsteps echoing around the empty chamber as Nathan made his way towards the back wall. It didn't really surprise Kat that there could be a hidden part of the temple, considering how large it looked from the outside. Theo was sticking close to her as they made their way after Nathan.<br>\r\n<br>\r\nKat froze for a moment as her eyes caught sight of the pedestals that had once held the three statues. The pedestals looked pretty bare with their statues in a lab back at the local university, but it hadn't been her choice to remove them from the temple. The stone was cold under her hands as she ran them over the spot were the fat girl statue had once rested, untouched until she had been lucky enough to pick it up. Back then she hadn't ever dreamed that she would be this fat. However, she also hadn't been happy. <br>\r\n<br>\r\n\"Was this where the statue was?\" Theo said, causing Kat to jump slightly in surprise, which resulted in a lot of jiggling, \"Sorry. Didn't mean to scare you.\"<br>\r\n<br>\r\n\"Yeah. You've seen it at my brother's lab, but this was where I found it. And according to my big brother over there, started to become this.\" she said, gesturing to her massive frame. <br>\r\n<br>\r\n\"Well if that's true, then I'm glad that you were the one that found it.\" Theo said, leaning in for a quick peck on the lips. <br>\r\n<br>\r\nKat blushed slightly, \"Makes me wonder though what would've happened if I'd touched the other ones.\"<br>\r\n<br>\r\nTheo took a step back, looking at the ground \"I dunno.\"<br>\r\n<br>\r\n\"I guess I'll never get the chance to find out.\" Kat said, trying to hide the disappointment from her voice. Part of her wondered what would've been different in her life if she'd touched one of the other two first. Still, she was happy with how things had turned out. <br>\r\n<br>\r\n\"Hey. I think I found it!\" Nathan's voice echoed through the empty room, seeming out of place in the abandoned temple. <br>\r\n<br>\r\n\"Alright, be right there!\" Theo shouted back, before gesturing to Kat's brother with his head, \"I guess we should go see what he found.\"<br>\r\n<br>\r\nTheo started picking his way through the debris strewn floor, with Kat following closely behind. Every step she took was deliberate as she struggled not to trip on anything. It would be hard for her to get back up once she was down. <br>\r\n<br>\r\nNathan was looking at something on the floor, brushing dirt and debris away with his hands as they stopped beside him, \"This is it. This is where the secret entrance is. Although, I have to admit that I'm not sure how to open it.\"<br>\r\n<br>\r\nKat looked around the area, trying to see what he was talking about. The floor was littered with debris making it hard to discern anything that might give away a secret door, but then again, this was what Nathan did for a living. Although she still didn't know how she was supposed to fit into opening the door. Fortunately, it seemed like she wasn't the only one confused.<br>\r\n<br>\r\n\"I don't see anything.\" Theo said, staring intently at the wall.<br>\r\n<br>\r\n\"That's because time hasn't been kind to it, but trust me it's here.\" Nathan said, still studying the floor, \"I'm not exactly sure how to open it, but I do know that Kat is the key.\"<br>\r\n<br>\r\n\"And how am I supposed to be a key?\" Kat shot, placing her hands on her hips in annoyance.<br>\r\n<br>\r\n\"I'm not sure.\" Nathan said, looking up at her, \"But, everything I discovered about this place seems to indicate that you are the key, since you touched the statue.\"<br>\r\n<br>\r\n\"And how is it supposed to know that she was the one who touched the statue?\" Theo shot, struggling to keep the annoyance out of his voice. <br>\r\n<br>\r\n\"I told you, I don't know!\" Nathan said, exasperated.<br>\r\n<br>\r\nSomething had caught Kat's attention as she was looking at the wall. She took a few steps towards what she saw, leaving the two boys to continue bickering. What she had originally thought were just marks from were the stone had fallen out of the wall seemed to be very uniquely shaped. There were three sections of wall that had indentations in them. One looked a lot like large breasts, the second looked like a large pregnant belly, and the third looked like a rather fat woman had stepped partially into the wall. All three also had a protruding surface that almost looked like a cock.<br>\r\n<br>\r\nHer eyes went wide as she realized what her brother meant when he said that she was the key. Still, there was no telling what would happen if she unlocked the door. Besides, it looked like she would have to strip her clothes off to make it work. That wasn't a problem for Theo, but she didn't know if she could stand her brother seeing her naked.</span></div></div>",
            "created":1538790660,
            "id":2559720,
            "title":"A long Trek"
        },
        "111111111111111133121112111111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Ask for help getting out, this is dangerous",
                "Let it keep filling her"
            ],
            "content":"<div class=\"\"><div> <span>She didn't know what came over her as she stood there looking at the door. She wanted so badly for there to be something behind it that would help her on her journey to get fatter. She threw her shirt to the floor, and began working on her bra.<br>\r\n<br>\r\n\"Kat! What are you doing?!\" Nathan shouted, noticing what she was doing, as he turned away.<br>\r\n<br>\r\nTheo spun around, mouth agape as he noticed his half naked girlfriend working on undoing her pants, \"Kat! What's gotten into you?!\"<br>\r\n<br>\r\n\"I figured it out! I know how to open the door!\" Kat said excitedly, as she kicked her pants away.<br>\r\n<br>\r\n\"But why are you stripping?!\" Nathan said, trying not to look at his nude sister.<br>\r\n<br>\r\n\"My body is the key! Just like you said!\" Kat said, taking a step towards the fat indent.<br>\r\n<br>\r\nNathan rushed over to her, catching himself on the wall as he tripped on a piece of rubble. His eyes went wide as he noticed the wall, and he placed a hand on her arm, stopping her, \"Are you sure you want to do that?\"<br>\r\n<br>\r\nKat was beaming, \"Yes, this might help me get even fatter!\"<br>\r\n<br>\r\n\"If you're sure.\" Theo released her arm and took a step back.<br>\r\n<br>\r\n\"Is someone going to explain what's going on?\" Nathan was tapping his foot as he tried desperately not to turn around.<br>\r\n<br>\r\n\"You'll see in a moment.\" Kat replied as she eased herself into the groove.<br>\r\n<br>\r\nHer body felt squished as it seemed to bulge out of the groove. She shivered as the cold stone engulfed her before moving to insert the rod into her wet pussy. The stone was smooth and cold as it filled her loose slit. She let out a gasp as the stone seemed to swell inside her, growing tighter and tighter as it stretched her slit.<br>\r\n<br>\r\nTheo took a step closer, \"What's wrong?\"<br>\r\n<br>\r\n\"The stone is growing! It's getting so big it hurts!\"<br>\r\n<br>\r\nA look of panic hit Theo, and Nathan couldn't restrain himself anymore as he rushed over to his naked sister, \"Maybe you should step away.\"<br>\r\n<br>\r\n\"I can't! It's too big! I can't get it out!\" Kat was trying desperately not to panic as the stone continued swelling inside her. She could feel it pushing into her womb now, swelling her insides with its massive size. Finally, just when she thought she couldn't take any more, she felt the stone pulse as fluid began to fill her insides, pumping her fuller and fuller. <br>\r\n<br>\r\n\"Kat! You're growing!\" Nathan said from behind her.<br>\r\n<br>\r\n\"What?\" She said, feeling her stone confines getting tighter.<br>\r\n<br>\r\n\"You're getting fatter!\" Theo said, sounding dumbfounded. <br>\r\n<br>\r\nThe groove was feeling tighter and tighter as a warmth seemed to fill her body. The stone in her pussy was starting to feel smaller as it continued pumping her full of whatever was fattening her up. With help she might be able to get off it at this point, though if it really was fattening her up, maybe she could see how much bigger she could get.</span></div></div>",
            "created":1538841540,
            "id":2559953,
            "title":"Drastic Measures"
        },
        "1111111111111111331211121111112":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Change Mind and suggest going home before her legs give out",
                "Walk down the tunnel",
                "Ride the cart into the unknown"
            ],
            "content":"<div class=\"\"><div> <span>Kat's heart skipped a beat as she realized she really was fattening up. It was hard to see anything being pressed up against the wall, but she could feel her body changing in response to whatever liquid was filling her. This was exactly what she'd hoped would happen when she came here, and there was no way that she was going to stop now. <br>\r\n<br>\r\nThe two boys just watched on as the girl in front of them slowly expanded, getting fatter by the moment. She couldn't bring herself to stop as her legs began shaking from the increased weight on them. She could feel her belly starting to push her further away from the wall, until the stone between her legs flipped down with a loud crack.<br>\r\n<br>\r\nA loud grating sound filled the air as the wall in front of her began moving away from her, as dust filled the air. The three of them tried covering their faces as they coughed on centuries old dust. When they could finally see what was happening, they found a new passage had appeared where the wall had been, stretching deep underground. <br>\r\n<br>\r\n\"Would you look at that...\" Nathan said, almost to himself as he stepped past the two teens, \"Kat really was the key.\"<br>\r\n<br>\r\n\"Are you okay?\" Theo said, stepping over to Kat, his eyes still watering from the dust. <br>\r\n<br>\r\n\"Yeah. Actually I feel great.\" Kat said, feeling noticeably heavier. <br>\r\n<br>\r\nTheo slipped his hand beneath her hanging belly, giving it a tentative heft, \"I can't believe how much bigger you are. I bet you're past 400 now.\"<br>\r\n<br>\r\nKat laughed, \"I feel like I weigh a ton. Honestly, I love it.\"<br>\r\n<br>\r\n\"Well maybe you should at least get your clothes back on.\" Theo laughed, reaching for the clothes on the ground, \"Honestly, I can't believe that just happened.\"<br>\r\n<br>\r\n\"Me neither.\" <br>\r\n<br>\r\nKat smiled as she glanced down at her noticeably larger body. Her belly was sticking out quite a bit further than before, and seemed to be getting another roll of fat. Vibrant red stretch marks had appeared on her swollen body next to the ones that had started to fade. Her breasts were massive with fat, hanging down to either side of her. Her legs were pressed tighter together than they'd been just a few minutes earlier, and even her fingers had swollen considerably, decreasing their dexterity. <br>\r\n<br>\r\nTheo helped her gather her clothes, though it quickly became apparent that it was a losing battle. She couldn't even get her jeans past her thighs, and her shirt seemed more like a loose bra on the obese girl. Fortunately, she could still get her panties on, though they were digging uncomfortably into her soft flesh. <br>\r\n<br>\r\nJust the act of putting on her clothes had completely worn her out, as she sat on a large piece of rubble to catch her breath, \"I can definitely tell I'm even fatter now.\"<br>\r\n<br>\r\n\"Well just be careful, if you get much fatter, you might not be able to make it back to the jeep.\" Theo said, standing in front of his massive girlfriend. <br>\r\n<br>\r\n\"Forget making it back to the jeep. If I get much bigger I might not even be able to fit in the jeep.\" Kat said, realizing just how much bigger she was now. She had to have gained at least 50 pounds of pure fat.<br>\r\n<br>\r\n\"Hey! Are you two coming?\"<br>\r\n<br>\r\nKat had completely forgotten about Nathan as she turned to see him gesturing from the new passageway.<br>\r\n<br>\r\n\"Aren't you even remotely concerned about Kat?\" Theo said striding over to where Nathan was standing, \"What if there's something down there that will make her even fatter?\"<br>\r\n<br>\r\n\"As I understand it, she wants to get fatter. Besides, who knows how long this passage will stay open?\" Nathan said, staring intently at Theo.<br>\r\n<br>\r\n\"I'm fine to keep going. I'll just have to be careful not to get too much fatter.\" Kat said, trying to stand. <br>\r\n<br>\r\nTheo, glared at Nathan before turning to help Kat to her feet. She was too fat to get up on her own now. She felt her stretched slit growing moist as she realized just how big that must make her. She'd been wondering what it would be like to be immobile, and if she got too much bigger she might just get to find out. She couldn't help getting turned on by the thought that she was just too fat to get to her feet by herself now. Though that was probably temporary until her legs could build some more muscle to handle her heavier frame. Unless, she allowed her legs to lose their tone by being even lazier. <br>\r\n<br>\r\nShe shook her head, now wasn't the time to be fantasizing about becoming immobile. Unless there was something down there that would push her over that edge. <br>\r\n<br>\r\nHer legs burned after only walking a few feet as they struggled to support her heavier frame. She made it to the doorway and glanced into the darkness. The tunnel slopped gently downwards, however, not far from the entrance looked like a primitive cart. It was old and worn, but could provide her a means down without expending too much energy. Though who knew what was at the end of the tunnel and whether she'd be able to stop it. Or even if it would support her massive weight.</span></div></div>",
            "created":1538865240,
            "id":2560110,
            "title":"Heavy as Stone"
        },
        "11111111111111113312111211111123":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Open the door",
                "Leave",
                "Try one of the other slots"
            ],
            "content":"<div class=\"\"><div> <span>Kat waddled towards the cart, feeling her body jiggle with each step that she took. It wasn't an uncommon feeling for her, but it was definitely stronger than it had been before. Her legs were straining under the new weight that had been recently added as she breathed heavily after the short distance.<br>\r\n<br>\r\nKat peered at the strange looking cart, furrowing her brow as her eyes moved over the stone wheels supporting the heavy wooden frame and single seat. Nathan joined her, carefully examining every minute detail of the decaying cart.<br>\r\n<br>\r\n\"So, uh, do you think it's safe?\" Kat asked, causing Nathan to jump slightly.<br>\r\n<br>\r\nHe ran a hand through his hair, \"This one is in the best shape I've ever seen, but I don't know if I would exactly call it safe. Wait... Why?\"<br>\r\n<br>\r\n\"I was thinking of taking a shortcut. I mean, if you want me to be able to keep up with you two, I need all the help I can get.\"<br>\r\n<br>\r\n\"Well, everything looks like it's in working order, but I'm not sure if it could support a, uh, I mean, I don't think....\"<br>\r\n<br>\r\n\"I get it. I'm fat.\" Kat tested what she assumed was the brake lever before gingerly starting to climb onto the seat.<br>\r\n<br>\r\n\"Hey! Be careful.\" Theo grabbed the brake as the cart started moving slightly, \"I don't want you to get hurt.\"<br>\r\n<br>\r\n\"Why you being such a worry wort today?\" Kat asked, settling into the large seat as the cart creaked and groaned under her weight. <br>\r\n<br>\r\n\"I just want to make sure you're okay. I don't want you to feel like you're being forced to do anything.\" He said quietly, trying not to disturb Nathan who had gone back to examining the walls. <br>\r\n<br>\r\n\"Look. I wouldn't be doing this if it wasn't something that I wanted to do.\"<br>\r\n<br>\r\n\"I know. It's just... When I first asked you out and told you about my... fetish, you were so hesitant to gain any weight at all. Now you're rushing to get as fat as you can.\"<br>\r\n<br>\r\n\"Hey! I thought you liked me like this!\"<br>\r\n<br>\r\n\"I do! I just don't want you doing it if you're not okay with it.\"<br>\r\n<br>\r\nKat smiled, pulling Theo in for a kiss, \"I promise. This is what I want. I may not have realized it at first, but I've never been happier. I am actually excited to become immobile. I just want you to be there to help me when I am. I mean, who else is going to stuff me until I can't fit  in my room?\"<br>\r\n<br>\r\nTheo chuckled, \"I would be surprised if you ever got that big. Although, I think I would really like that. I've always wondered what it would be like to have to climb up your belly just to reach you.\"<br>\r\n<br>\r\nKat had to restrain herself from reaching a hand to her nether regions. Although, she didn't even know if she could reach it anymore with her massive gut in the way, \"I so want that.\"<br>\r\n<br>\r\n\"Alright. Well try not to become immobile in here. I don't know that we'd be able to get you out if you did.\" Theo gave her another kiss before turning towards Nathan, \"Alright I think we're good to go. Hopefully, Kat's transportation still works as intended.\"<br>\r\n<br>\r\n\"Yeah, try not to break it. It would look great in a museum.\" Nathan said.<br>\r\n<br>\r\n\"Yeah, you know, it's not like I could get hurt or anything if it does break.\"<br>\r\n<br>\r\n\"Well, um, yeah, um, that too.\" Nathan said, looking around nervously before shining his flashlight down the dark tunnel, \"Anyway, just take it slow, and if it seems like it's going to break, get out.\"<br>\r\n<br>\r\nSlowly, Kat released the brake, as the sound of stone on stone echoed around them as Theo and Nathan gave the cart a little push to get it moving. The sound of the cart creaking and moaning filled the chamber as she slowly let it pick up speed. Nathan and Theo began to fall behind as they jogged to keep up with her.<br>\r\n<br>\r\n\"Hey, don't get too far ahead! You don't have a flashlight!\" Nathan shouted down the hallway as the cart continued to pick up speed.<br>\r\n<br>\r\nKat smiled, letting fully releasing the brake as the cart moved faster and faster. There was no way to steer it, but there seemed to be some grooves in the floor to guide the cart on its journey. The stale air began rushing past her as the cart continued to bump and roll down the ancient passageway. The air was growing cooler as they descended, but fortunately, all of Kat's extra weight was proving to be good insulation. She could hear Nathan and Theo's footsteps echoing behind her as they rushed to keep up with the cart, the light from the flashlight bobbing this way and that. <br>\r\n<br>\r\nSuddenly, Kat threw on the brakes, filling the air with the sound of grinding stone as the cart lurched to a stop moments before hitting a wall. <br>\r\n<br>\r\n\"Are you alright.\" Theo panted, leaning against the cart.<br>\r\n<br>\r\n\"Yeah, I'm fine. These brakes work great.\" Kat replied, her heart pounding in her ears as she took a deep breath. <br>\r\n<br>\r\n\"It looks like it's another one of the doors like up above.\" Nathan said, pointing at the three indentations.<br>\r\n<br>\r\nKat felt her heart skip at the thought of filling herself with more fat again. Though she also felt the flutter of anxiety as she glanced at her large body.<br>\r\n<br>\r\nNathan bit his lip, looking torn, \"Kat, you don't have to open it if you don't want to. I don't want you getting stuck here.\"<br>\r\n<br>\r\n\"Yeah, I don't know if opening this door would be a great idea.\" Theo said, placing a hand on her shoulder.<br>\r\n<br>\r\nShe licked her lips, feeling her groin getting moist at the thought of getting fatter. However, she was already really struggling to carry her weight as it was. Who knew if she'd be able to walk after this door? And what if there was another door and another? How many would she be able to make it through before she was stuck? </span></div></div>",
            "created":1538878200,
            "id":2560168,
            "title":"Joy Ride"
        },
        "111111111111111133121112111111231":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Take vial home with her",
                "Drink from the fountain",
                "Drink vial now"
            ],
            "content":"<div class=\"\"><div> <span>\"We've come this far, why stop now?\" Kat said, steeling herself for what she was about to do.<br>\r\n<br>\r\n\"Uh because you could get stuck here.\" Theo said, though he moved to help her to her feet with some help from Nathan.<br>\r\n<br>\r\n\"Uhh, you really are getting heavy.\" Nathan said, as the two of them hoisted her to her feet.<br>\r\n<br>\r\n\"You two haven't seen nothing yet.\" Kat said, starting to strip her clothes.<br>\r\n<br>\r\n\"You really don't have to do this Kat.\" Nathan said, a look of concern on his face, \"You're getting huge!\"<br>\r\n<br>\r\n\"I know. That's why I have to do this.\" Kat said, stepping up to the door, \"This is what I want. I love being this big, and I want to get bigger.\"<br>\r\n<br>\r\n\"I know, and I'm not telling you to stop, but if you get stuck here, we won't be able to get you out.\"<br>\r\n<br>\r\nKat closed her eyes, and lifted her belly to better get the cock into her pussy. This groove was about the same size as the one before, which meant it was a very tight fit for the massively obese girl. Almost instantly, the stone cock started to swell stretching her more and more. She scrunched up her face in pain as it stretched her more than the one before. Finally, the warm fluid started to fill her, spreading through her body as the door felt tighter and tighter. <br>\r\n<br>\r\nWarmth filled her body, as she closed her eyes, savoring the feeling coursing through her. She felt an overwhelming calm come over her as the world seemed to disappear around her, and a feminine voice echoed both within her and without her.<br>\r\n<br>\r\n\"Welcome avatar of bounty to this sacred place. You have come so far in your journey, though it is far from over. I see that you have a desire to grow bigger, and yet you fear what is to come. You should not fear the bounty that will be offered you for I will provide you strength to return to your home, though it will still not be easy. Once home, you may partake of the fluid that is in the vial at my altar and your real journey will begin. You must push through the growth that you will experience as long as you can so that you may see the outside world, for once my gift overwhelms you, your fantasies will be reality. Do not fear, for I will provide the means by which you may continue to grow to your hearts content. However, if you should choose to leave this gift, you must drink of the water of the fountain in the sacred chamber. It will not return you to how you were, but will remove my gift so that you may return to that if you desire. Now go. I will give you the strength that you need, though be careful not to partake of my gift too quickly. Patience is a virtue.\"<br>\r\n<br>\r\nA loud crack filled the air as the stone cock flipped into the door. Kat staggered backwards under her new weight as the door began to open in front of them. All three of them stood mouth agape as a pale blue light illuminated the scene before them. Three large statues stood against the domed walls, mirroring the ones that had been on the pedestals in the other room, while an intricate fountain spewed water endlessly into a shallow pool between them. The walls sparkled and shimmered with what appeared to be crystals that were emitting the light. Each of the statues had a small pedestal in front of it with a single vial of liquid on it. <br>\r\n<br>\r\n\"Wow...\" whispered Nathan, taking a few tentative steps forward.<br>\r\n<br>\r\n\"Wow is right.\" Theo said, following right behind Nathan as they entered the room.<br>\r\n<br>\r\nKat's legs burned under her new weight as she took a few wobbly steps inside the room. Her center of gravity felt different with all the weight she had just put on as her belly swayed from side to side with each step, threatening to drag her over if she wasn't careful.<br>\r\n<br>\r\nThe three stood in silence, the only sounds were the fountain and Kat's heavy breathing. Finally, Kat broke the silence, \"I think I need to sit down, I feel so heavy.\"<br>\r\n<br>\r\n\"Yeah, you definitely are a lot bigger than when you came into the temple.\" Nathan said, looking at the ball of lard that was his sister. <br>\r\n<br>\r\n\"You're huge. I wonder what you weigh now.\" was all Theo could say.<br>\r\n<br>\r\n\"We'll have to see when we get home. Hopefully I don't break the scale.\" Kat said, sitting on the edge of the pool. Her belly was hanging slightly past her knees, looking like a giant pancake of flesh and stretchmarks. <br>\r\n<br>\r\n\"This room seems almost untouched by time. I've never seen anything like it.\" Nathan said, moving to look at one of the statues, \"Though I wonder what's in the vials.\"<br>\r\n<br>\r\n\"While I was unlocking the door, a voice came to me and said that if I drank the potion next to the fat statue, my dreams would become reality.\"<br>\r\n<br>\r\n\"Wait! What? You heard a voice? What did it sound like? What did it say-\"<br>\r\n<br>\r\n\"Hey slow down there, let her at least answer one of your questions.\" Theo sat down beside Kat.<br>\r\n<br>\r\n\"It just said that if I wanted to go back to how I was, I could drink the water of the pool, and if I wanted to get bigger to drink the liquid in the vial when I got home.\" Kat said, kneading her belly slightly. It felt so good to have such a large belly to play with.<br>\r\n<br>\r\n\"So, any idea what you're going to do?\" Nathan asked.</span></div></div>",
            "created":1538882220,
            "id":2560190,
            "title":"Where Gods have tread"
        },
        "1111111111111111331211121111112311":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Drink it now",
                "Wait"
            ],
            "content":"<div class=\"\"><div> <span>\"Obviously I'm going to take the vial. This is exactly what I was hoping to find here.\" Kat said as she continued to massage her massive belly.<br>\r\n<br>\r\n\"But who knows what could be in there? Maybe you should let me do some tests? Besides, don't you think you're fat enough?\" Nathan objected.<br>\r\n<br>\r\n\"Maybe you should let Nathan run some tests first, just to see if it's safe.\" Theo said, rubbing her shoulders.<br>\r\n<br>\r\n\"It will be fine. I mean it couldn't be any more dangerous than opening the doors. And you didn't mind me doing that. You care more about your research than my happiness. And you. I thought you'd love the idea of me getting fatter.\" Kat shot at both of them.<br>\r\n<br>\r\n\"I would love to see you get fatter. I just want you to be careful.\" Theo said, trying to stay calm.<br>\r\n<br>\r\n\"Look, if it really means that much to you, you can have the vial. I can study the other ones. Just don't come crying to me when you're too fat to move.\" Nathan said, snatching up the vial from in front of the fat statue and handing it to Kat.<br>\r\n<br>\r\n\"I support you. Just be careful. I want to see you get fat as much as you do, but I don't want you to regret your decision.\" Theo whispered in her ear as Nathan went off to examine the statues.<br>\r\n<br>\r\n\"I know. I... I just have never been this happy before, and I don't want to waste this opportunity.\" Kat said, examining the vial in her hands. <br>\r\n<br>\r\nThe glass was thin near the bottom and top, swelling near the middle. The liquid had a slightly yellowish tinge to it, and seemed to shimmer as the bottle was moved. A crystal stopper prevented the liquid from flowing out, though it seemed like it would be easy to remove it. Kat had never felt glass so smooth before in her life, as she rubbed her sausage-like fingers over it.<br>\r\n<br>\r\n\"So, what do you think will happen when you drink it?\"<br>\r\n<br>\r\n\"I dunno.\"<br>\r\n<br>\r\n\"If it makes you too much bigger, you really will be immobile.\"<br>\r\n<br>\r\n\"I hope so.\" Kat laughed, \"but I don't think so. The voice said that I should hold onto mobility as long as I could.\"<br>\r\n<br>\r\n\"Not bad advice.\"<br>\r\n<br>\r\n\"I just get so excited thinking about what it will be like when I can no longer move, and I want it now.\" Kat continued looking over the vial in her hands, wondering what would happen, \"I'll admit it's tempting just to drink it now.\"<br>\r\n<br>\r\n\"You might want to hold off until your legs grow more used to the bigger you.\"<br>\r\n<br>\r\n\"I know. Doesn't mean I don't want to drink it now though.\"<br>\r\n<br>\r\nIt was a long trek back through the forest to the jeep, with Kat having to stop frequently to give her thick legs a break from carrying her swollen body. It was well past dark by the time they finally arrived. Kat was sweating profusely despite the drop in temperature. After struggling to hoist her heavy body into the jeep, they finally succeeded after almost 20 minutes. Kat was thankful her fat provided such good insulation from the cold as they drove back, the wind whipping over her now exposed body, while she used her clothes as a small blanket. Fortunately, Theo said he'd pick her up some new clothes tomorrow since there was no way she could fit into any of her current ones.<br>\r\n<br>\r\nWhen they got back home, Kat slowly lumbered inside, making her way to her room. She was surprised to notice that the doorway seemed smaller than it had before as she went through it. She plopped down on her bed, which creaked and groaned in protest of the massive teen. She swore she could feel it bending under her weight as she shifted around, trying to get more comfortable. Theo, joined her, sitting on the side of the bed and rubbing her enormous belly.<br>\r\n<br>\r\nSmiling, she took the vial out of her bag, and held it up to the lamplight.<br>\r\n<br>\r\n\"Are you sure you want to drink it?\" Theo asked, continuing to rub her belly.<br>\r\n<br>\r\nShe looked at the vial in her hands. Should she drink it now, or wait?</span></div></div>",
            "created":1539023880,
            "id":2561134,
            "title":"Patience"
        },
        "11111111111111113312111211111123111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Tell Theo",
                "Don't tell Theo",
                "Get breakfast first"
            ],
            "content":"<div class=\"\"><div> <span>\"I'm sure.\" Kat said, unstopping the bottle.<br>\r\n<br>\r\n\"Alright. Then I support you.\" Theo said.<br>\r\n<br>\r\nShe took one last look at it, before quickly emptying the contents into her mouth. It was sweet like nectar, though it was slightly thicker than she'd thought it would be, having almost the constancy of honey. She closed her eyes as she savored the lingering flavor, swallowing the contents.<br>\r\n<br>\r\nA few moments passed, before she suddenly let out a gasp. A wave of pleasure enveloped her, like no orgasm she'd ever had. The world seemed to drift away as she felt a warmth flowing through her. A soft voice seemed to echo around her, coming from everywhere at once.<br>\r\n<br>\r\n\"My chosen, you have partaken of the nectar of the gods. You have decided to accept the role as Avatar of Bounty. You have a desire to expand your flesh, and that will be granted to you. Do not worry, your body will have no ill effects from its growing size. If you desire to become a mountain, so you shall. A warning though, do not try to indulge yourself too quickly, for you must first learn what it is like to walk this world, burdened by your blessing. Savor the things you can do now, for soon you will find them slipping away. You must also maintain your mobility long enough to carry the child that is growing in you back to the temple, for it must be born there, if you desire it to maintain any control over the gift that you will impart to it. Do not fear, the child was conceived with the one that you love, for I have seen it. In seven months, you must trek back to the temple to have the child, or it will be consumed by my gift with no ability to control it.\"<br>\r\n<br>\r\nKat shielded her eyes as light filled the air around her, and the world began to return. She opened her eyes to a bright morning. Theo was sleeping on the floor beside the bed as she lay staring at the ceiling, the words the voice had spoken were still echoing in her mind. She was pregnant... with Theo's child. On top of that, she needed to maintain her mobility for the next seven months, or the child wouldn't be able to control the gift that it was to be given. She was almost immobile now, how was she ever going to last seven months without becoming immobile. <br>\r\n<br>\r\nShe stretched, feeling her body jiggle with each movement as she swung her legs over the side of the bed. Her belly hung over her knees and sides, hiding her legs from her completely as she stood up with great difficulty. She carefully manuvered around Theo, trying not to wake the sleeping boy as she made her way towards the bathroom. She shut the door behind her as she turned on the light, finally getting to see herself in all her fatty glory.<br>\r\n<br>\r\nShe almost didn't recognize herself as she looked at how round her face had become, a massive double chin almost closing the gap with her torso. Her breasts, now just looked like more folds of fat, resting on her protruding belly, which hung to her knees. Her thighs seemed to overlap each other with how big they were, and her butt was almost shelf like. Red stretchmarks covered the massive teen as she turned this way and that in the mirror. <br>\r\n<br>\r\nShe smiled as she took in her massive body, placing her huge belly on the counter, and watching it fill the sink. She'd never imagined that she'd be this fat, but this wasn't near big enough for her now. She was going to be a mountain. <br>\r\n<br>\r\nShe frowned as she placed her hands on her soft belly, feeling them sink into the fatty flesh. However, there was the fact that she was apparently pregnant, and that she needed to maintain her mobility long enough to make it back to the temple. She hadn't really had any of the signs of pregnancy though. Maybe she had just imagined that.<br>\r\n<br>\r\nKat shook her head, squeezing her belly uncomfortably as she reached for the scale. Panting, her fingers brushed it a couple of times before she was finally able to move it into position. Sucking in her belly as much as she could, she stepped onto the scale. The numbers flashed on the screen as she tried peering around her belly as best she could.<br>\r\n<br>\r\n498<br>\r\n<br>\r\nHer heart skipped a beat as she almost jumped. A fluttering feeling filled her as a smile split her face. Releasing her breath, she watched her belly hide the scale from view as she stood there panting, her legs shaking slightly, causing her body to jiggle.<br>\r\n<br>\r\nShe stepped off the scale, turning to face herself in the mirror, no longer seeing the thin girl that used to stand there. She placed her belly back in the sink, breathing a little easier. It was going to be a long seven months if she wanted to avoid becoming immobile. Still, how bad would it be if her child was fat too. Though there still wasn't any proof that she was pregnant. Perhaps she should talk to Theo about it.</span></div></div>",
            "created":1539026580,
            "id":2561155,
            "title":"A wonderful Start"
        },
        "111111111111111133121112111111231111":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Get fat and try to get to the temple",
                "Get fat and don't worry about returning to the temple",
                "Stay mobile"
            ],
            "content":"<div class=\"\"><div> <span>With some difficulty Kat bent over and picked up the scale, finding herself growing wet from how much trouble she was having just in reaching something from the floor. She was definitely one of the fattest girls she knew, and there was no denying that now. Still, she was going to get bigger.<br>\r\n<br>\r\nSlowly, she opened the door, her mouth watering as she caught the scent of something cooking in the kitchen. She found herself incredibly tempted to make a pit-stop at the kitchen before talking to Theo, but there was no way she trusted herself to follow through if she didn't do it now. Food had really become her life and if she let it get in the way, there was no way she could convince herself to stop long enough to tell Theo.<br>\r\n<br>\r\nClosing her eyes, she steeled herself with her hand on the knob of her door. She hadn't imagined that it would be this hard just to tell Theo that they were probably pregnant, and that she needed to stay mobile long enough to take the child to the temple in seven months. Though, he would probably be the best person to help her have the strength to last that long.<br>\r\n<br>\r\nShe opened the door, exhaling deliberately as she stepped inside and shut the door behind her. Theo was lounging on her bed, checking his phone.<br>\r\n<br>\r\n\"So,\" Kat started, \"What do you  think?\"<br>\r\n<br>\r\nTheo's eyes seemed to go wide as he finally got a good look at his girlfriend, \"Wow....\"<br>\r\n<br>\r\n\"I know. I'm pretty big. Almost 500 pounds.\"<br>\r\n<br>\r\n\"Really!?\"<br>\r\n<br>\r\n\"Yep. And if you don't mind, I think I need to sit down. This body is really heavy.\"<br>\r\n<br>\r\n\"Oh yeah,\" he moved so she could sit on the side of the bed beside him.<br>\r\n<br>\r\nThe two of them sat in silence for a while, both looking at the ground. It was so hard to tell him what the voice had told her. Still, she needed to do it. If only to prove to him that she really did care. <br>\r\n<br>\r\n\"Look...\" They both said finally, \"Sorry, you first.\"<br>\r\n<br>\r\nThey chuckled slightly. Theo took Kat's hand in his, spreading his warmth to her soft flesh, \"You go first.\"<br>\r\n<br>\r\n\"Alright.\" Kat said, taking a deep breath, \"So I had another vision last night after I took the liquid, whatever it was.\"<br>\r\n<br>\r\n\"Really? What did you see?\"<br>\r\n<br>\r\n\"Well, I didn't see too much, but I did hear that voice again.\"<br>\r\n<br>\r\nTheo scoffed a little, \"This is just getting too weird.\"<br>\r\n<br>\r\n\"I know. And you're probably going to freak out when I tell you what it said.\"<br>\r\n<br>\r\nHe smiled, \"Look. I already told you I'll still love you no matter how big you get, and nothing some disembodied voice says is going to change that. Honestly, that was mostly what I wanted to talk to you about. I wanted to apologize for questioning you so much. I guess I just never imagined that you might actually get the point of being immobile, and I didn't know how to react. I mean it was kind of like a dream come true when you said you wanted to get that big, but I just didn't want you to be unhappy. Still, I can see now that you're happier than you've ever been, and I just wanted to say that, I support you in whatever you decide to do. If you want to get immobile by next week, then lets do it. If you want to lose weight, we'll do that to. I don't care if some voice says that it isn't possible.\"<br>\r\n<br>\r\nKat just looked at him as he spilled what was on his mind. She smiled, pulling him closer to her soft body and giving him a light kiss on the forehead, \"You're going to be a father.\"<br>\r\n<br>\r\nInstinctively he pulled away, eyes meeting hers, \"WHAT!?\"<br>\r\n<br>\r\n\"Oh, what, uh, so, uh, surprise....\" Kat said, realizing what had just come out of her mouth, \"Well, um, actually, I'm not sure about that, but probably.\"<br>\r\n<br>\r\n\"What is that supposed to mean?\"<br>\r\n<br>\r\n\"Well the voice came to me last night and said that in seven months I need to return to the temple to have our baby. Otherwise it will be fat and won't be able to get thin ever. Or something.\"<br>\r\n<br>\r\n\"Or something?\"<br>\r\n<br>\r\n\"Yeah, um, I don't actually know the specifics. The, um voice just said that it would be overpowered by its gift. The same gift that made me fat. So, um please don't be mad. I just thought you'd want to know.\"<br>\r\n<br>\r\nTheo took a deep breath, as the color seemed to drain out of his face, \"Honestly, after everything I've seen. I'm inclined to believe whatever voice is talking to you. So, if you don't have the baby at the temple then it will be fat it's whole life with no choice?\"<br>\r\n<br>\r\n\"Pretty much.\"<br>\r\n<br>\r\nTheo bit his lip, as he squeezed Kat's hand almost uncomfortably tight, \"What do you want?\"<br>\r\n<br>\r\n\"Well, I want to hear your opinion first.\" It was getting easier to talk about now that the truth was out in the open, and Kat found that she was starting to relax muscles she hadn't even realized she'd tensed.<br>\r\n<br>\r\n\"Honestly, I want whatever you want. If you're strong enough to be honest, then so am I. I love how big you're getting, and I think I was mostly just afraid that you were getting fat for me, and not because you wanted it. That's the real reason I was so pushy about making sure you were sure. Though, if it's really what you want, then I want you to know that I love your body, and I want you to get fatter and fatter. I want you to keep growing and to be there to take care of you after you can't do it yourself anymore.\"<br>\r\n<br>\r\n\"But wha-\"<br>\r\n<br>\r\n\"I'm not finished. Honestly, I want to see the baby get fat to. Just the thought of it growing fatter and fatter, makes me happy. Again, I want what you want though. If you want to have the baby at the temple, then we'll make it happen. Even if you're too fat to move. Honestly though, I just want you to get fat and immobile as fast as you can. Just let me be there for you.\"<br>\r\n<br>\r\nKat smiled, pulling Theo in for a hug, \"Thank you. That's exactly what I needed to hear. How would I get to the temple if I'm too fat to walk though?\"<br>\r\n<br>\r\n\"Even if I have to carry you. If it's what you want. It will happen.\"<br>\r\n<br>\r\nKat chuckled, \"I don't even think you could lift me now.\"<br>\r\n<br>\r\n\"That's not the point.\" Theo punched Kat's arm lightly, \"You knew exactly what I meant.\"<br>\r\n<br>\r\n\"Yep. I just can't help, but tease you.\"<br>\r\n<br>\r\n\"Anyway. Now that you know what I think. What do you want?\"</span></div></div>",
            "created":1549509660,
            "id":2613907,
            "title":"Reining In"
        },
        "1111111111111111331211121111112311112":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Have breakfast at home",
                "Go out for something more filling",
                "Why not both?"
            ],
            "content":"<div class=\"\"><div> <span>Kat sat for a few moments, trying to ignore her ever growing hunger as she enjoyed the warmth of Theo against her soft body. He was really starting to look pretty small next to her, despite the fact that he was definitely taller than her. Though, that was probably due to the fact that she was at least 3 times his weight. Still... It wasn't enough. She wanted more. And she didn't want to have to wait for it.<br>\r\n<br>\r\n\"Honestly, I mostly was just worried that you'd want the child to not be fat too, but since you're okay with it... I think that I want to just let myself get fatter.\"<br>\r\n<br>\r\nShe paused as Theo pulled her into a tighter hug, struggling to get his arms around her thick body, before continuing, \"I probably won't gain as fast as I've been gaining since there's still a few things I want to do before I'm too fat, but I really don't care if I make it back to the temple or not.\"<br>\r\n<br>\r\nThey stayed locked together for a while until a loud growl brought them both back to the present. Kat looked down at her soft middle, gritting her teeth as a wave of hunger washed over her. She really should get some food before she stared to death, she thought. Still, what should she have? Her mother was obviously cooking a large meal downstairs, but maybe she should aim for something a little more filling. Of course there also wasn't a reason she couldn't have both.</span></div></div>",
            "created":1549589940,
            "id":2614268,
            "title":"Growing Out"
        },
        "11111111111111113312111211111123111123":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "A bully appears",
                "A freind Appears",
                "Skip to Lunch"
            ],
            "content":"<div class=\"\"><div> <span>\"Sounds like someones hungry.\" Theo joked, standing up, and offering his hands to Kat.<br>\r\n<br>\r\nShe took his hands and used them to help pull herself to her feet, \"I really hope my mom cooked enough food, I could probably eat a whale.\"<br>\r\n<br>\r\n\"I would think you were joking if I didn't know you so well.\" Theo said as he put his arm around Kat's broad shoulders.<br>\r\n<br>\r\nSmiling, the two of them made their way downstairs, following the smell of delicious food to the kitchen where they found Kat's mother cooking a massive feast of food. She smiled as the two teens entered the kitchen, \"How's my two lovebirds this morning?\"<br>\r\n<br>\r\n\"Starving.\" Kat said, plopping down on the large wooden chair at her spot, and pulling the first plate towards her.<br>\r\n<br>\r\n\"Kat, your clothes look so small on you this morning, have you grown again?\"<br>\r\n<br>\r\n\"I'm always growing,\" Kat said through a mouthful of food.<br>\r\n<br>\r\n\"No, I mean more than usual. You look like you've put on quite a bit of weight.\" Kat's mom said, placing another plate in front of her massive daughter.<br>\r\n<br>\r\n\"Well I have been eating even more lately. So, I guess it's possible.\"<br>\r\n<br>\r\nKat really didn't want to explain about what happened at the temple the day before. Especially when she was eating such a delicious meal. So, she was glad when her mother didn't push the issue anymore, leaving her to eat in peace as Theo struck up a conversation with her mother while he ate the normal sized plate she had prepared for him.<br>\r\n<br>\r\nHowever, all too soon, Kat found herself looking at a pile of empty plates while her belly let out another soft growl. She couldn't believe how much food she could eat now. She'd probably eaten enough for 10 people and she was still hungry. Of course it was really showing in how fat she was getting. She remembered when she had almost been underweight just a few months ago. Now she was definitely the fattest girl at school, possibly the whole city. <br>\r\n<br>\r\nOver the next couple of months, Kat kept up her dizzying pace of eating and growing. It didn't take very long before she grew immobile, and was forced to stay in bed. However, that didn't stop her as she continued to binge constantly. Theo stayed true to his word and stayed with her constantly, and cared for his massive girlfriend.<br>\r\n<br>\r\nFinally, the day came that Kat had her baby, who they named Veronica. Afterwards, Theo and Kat got married and lived happily together. However, it didn't take them long to realize that Veronica was getting quite chubby. As the years went on Veronica stayed chubby, no matter what they did to try to limit her growth. Still, she seemed pretty happy, though she often lamented that she was the fattest of her friends. Though she would often blame genetics, and point to the fact that Kat was enormous and still growing.<br>\r\n<br>\r\nVeronica grit her teeth as she laid on her bed, sucking in her gut as best she could as her fingers struggled with the button on her jeans.<br>\r\n<br>\r\n\"Come on. Just a little... more... and...  got it.\" She relaxed her gut, feeling her jeans cutting into her fat waist as she lay panting from the struggle. She didn't know how she could have gained weight despite putting herself on a diet, but her jeans didn't lie. And the scale didn't either. She'd gained ten pounds over the last month. And that was with practically starving herself. Though, most of her friends said that her definition of dieting, was eating regularly for other people. She couldn't help that she'd gotten such crappy genetics.<br>\r\n<br>\r\n\"Come on Veronica, you're going to be late.\" Theo called from downstairs, \"Come get your breakfast.\"<br>\r\n<br>\r\nVeronica rolled her eyes as she got up, tugging on her shirt as she struggled to get it to fit right around her protruding belly. She didn't know why she still had to go to school on her birthday, but her parents had insisted that school was important. To be fair, even Kat had finished her schooling despite being unable to go. Veronica looked down at her soft frame and frowned. There was no way she'd ever let herself get as fat as her mom. Still, at the rate she was growing, it might be unavoidable.<br>\r\n<br>\r\nShe made her way down to the kitchen where she found a plate of pancakes waiting at her spot. Her mouth started salivating as she looked down at the butter and syrup drenched dish, and took a bite. She closed her eyes as she savored the sweet taste of the meal. She had been going to skip breakfast, but she might as well eat it since it was made for her. Besides, being full felt so good. Ever since she was young, she found herself filled with pleasure the more she stuffed her belly. Over time she had learned to resist it mostly, but she still found herself indulging her belly occasionally. However, it had definitely made it hard to resist food.<br>\r\n<br>\r\nFinished with her meal, she pushed herself away from the table and went to finish getting ready. Her belly jiggled with each step as she rushed up the stairs to grab her bookbag and brush her teeth, causing her shirt to start riding up. She pulled it down around her pale skin, feeling her face turn a bit red. She rushed to finished getting ready, before shouting out her fairwell's to her family, and rushed into the brisk morning.<br>\r\n<br>\r\nThe trees were covered in bright green leaves, and multicolored flowers lined the driveway as she began walking towards the sidewalk. She glanced at another girl who was approaching her from further down the street and waved. The girl smiled and quickened her pace to meet up with Veronica. She had almost pitch black hair that came to her waist, and her tan face was obviously Asian in origin. She was wearing a pink, puffy jacket that did a good job of hiding her chubby belly.<br>\r\n<br>\r\n\"Are you cold?\" Veronica teased, nodding at the pink jacket.<br>\r\n<br>\r\n\"Yes! It shouldn't be this cold in April!\" the girl said, adjusting the jacket to better contain herself, \"The better question is; why aren't you cold?\"<br>\r\n<br>\r\n\"I guess being fat does have its advantages, though it sucks in the summer.\"<br>\r\n<br>\r\n\"Well it doesn't seem to be helping me any.\" The girl said shrinking into her jacket as she pulled a tan scarf out from her pocket and wrapped it around her neck.<br>\r\n<br>\r\n\"That's because I'm probably fifty pounds heavier than you.\"<br>\r\n<br>\r\n\"Well, right now I wouldn't mind if you would share some of that with me.\"<br>\r\n<br>\r\n\"I wish I could. I've gained ten pounds over the last month despite being on a diet.\"<br>\r\n<br>\r\nThe girl chuckled, \"That's because every day is a cheat day for you.\"<br>\r\n<br>\r\nVeronica's face turned red as she glanced at the ground and mumbled, \"It's just my stupid genetics.\"<br>\r\n<br>\r\n\"So, are you ready for the test in Chemistry?\" the girl asked, \"I've been studying all weekend and I still don't understand it.\"<br>\r\n<br>\r\n\"Ughh, me too. I'm sure I'm going to bomb it.\" Veronica said kicking a rock down the sidewalk as they continued on towards the school.<br>\r\n<br>\r\n\"Well, at least your parents haven't threatened to ground you for a month if you fail.\" the girl said, slouching her shoulders as she pouted with her lips.<br>\r\n<br>\r\n\"Really? That sucks, May. I'm sorry.\" Veronica said, pulling May into a side hug as they walked.<br>\r\n<br>\r\n\"You know. I'm really glad to have you as a friend,\" May said, smiling at Veronica, \"I'll just have to make sure I don't fail.\"<br>\r\n<br>\r\n\"Definitely!\"<br>\r\n<br>\r\nThe two girls walked on in silence for awhile, May seemed to be enjoying the warmth of Veronica holding her close to her side. Veronica smiled at the short Asian girl, glancing at the top of her head. She really hoped that May could pass the test. Still, she should probably be more worried for herself since she hadn't really been able to figure out the material.<br>\r\n<br>\r\nFinally the school came into view as they rounded a corner. Numerous students were milling about in front of the school as they waited for class to start. </span></div></div>",
            "created":1549822140,
            "id":2615662,
            "title":"Another Generation"
        },
        "111111111111111133121112111111231111231":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Carry Cassy's things to her locker",
                "Refuse",
                "Drop Cassy's things on \"Accident\""
            ],
            "content":"<div class=\"\"><div> <span>Veronica turned her attention to May as they continued their trek towards the school. She smiled as the Asian girl began chewing on her lip. She'd known May long enough to know that meant she was deep in thought. However, she honestly thought it made May look even cuter than she already was. <br>\r\n<br>\r\nSuddenly, Veronica found herself colliding with something, as she struggled to keep her balance.<br>\r\n<br>\r\n\"Ugh, watch where you're going you fat cow.\"<br>\r\n<br>\r\nVeronica felt her face turn red, and she didn't even have to look to know who she'd run into. Still, she turned to face the thin girl in front of her, wearing a designer jacket over a cheerleader outfit. Her blond hair was pulled into a ponytail, and she had enough makeup on that it was hard to tell what her real skin color actually was. She leered down at Veronica with a look of contempt.<br>\r\n<br>\r\n\"Sorry Cassy.\"<br>\r\n<br>\r\n\"You better be, Cow.\" She said, folding her arms as she continued to glare at the fat girl, \"You almost made me spill my Vanilla Frap, and there's no way I'd be able to change before cheer!\"<br>\r\n<br>\r\n\"Look, I said I'm sorry.\" Veronica said, trying to shuffle around Cassy towards the door.<br>\r\n<br>\r\n\"Well, I think that you should show how sorry you are by carrying my things to my locker!\" Cassy said, cocking  her head to the side as she smiled deviously at Veronica.</span></div></div>",
            "created":1549910580,
            "id":2616217,
            "title":"Sassy Cassy"
        },
        "112":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Get a meal for the road",
                "Stay and get some more food",
                "Go home and get some sleep"
            ],
            "content":"<div class=\"\"><div> <span>Despite the fairly decent meal she'd devoured, her stomach let out another growl. It was strange, but she almost felt more hungry now than she had before eating. She decided to check her lunch bag again and see if maybe she'd missed something, but it was empty. She couldn't believe how hungry she still felt. She spent the next couple of hours only partially paying attention to what her brother was doing. Here she was, somewhere that no one had been in, she didn't no how long, and all she could think of was what she was going to eat for dinner. <br>\r\n<br>\r\nAfter what seemed like forever, they finally began making their way back to Nathan's jeep. Kat stayed mostly quiet on the way back, though her brother was enthusing about all the wonderful artifacts he had found, one of which was the fat statue which was tucked away in her bag, though he had the other two in his bag. <br>\r\n<br>\r\nIt was almost completely dark by the time they had loaded up the jeep and were on the road, and she almost felt weak from how hungry she felt. <br>\r\n<br>\r\n\"Hey, would you mind dropping me off at the burger place near our house?\" Kat asked, unable to resist her hunger any longer.<br>\r\n<br>\r\n\"Sure, you must be starved.\" Nathan said, smiling.<br>\r\n<br>\r\nA few minutes later they were pulling up to the restaurant where Kat hopped out and waved bye to her brother as he drove away. It was only a couple blocks from her house, and it was an easy walk so she wasn't concerned about getting home. She made her way inside the almost empty building, and walked up to the counter to place her order.<br>\r\n<br>\r\nShe sat down at a table moments later with a huge burger, two large fries and a large drink, which she began to dig into ravenously. She had always been skinny, no matter how much she ate, so she wasn't too concerned about her figure. Besides her parents thought she was anorexic as it was, so maybe putting on some weight wouldn't be a bad thing. By the time she finished though, her pants felt tight on her bloated belly, and she sat rubbing it.<br>\r\n<br>\r\nShe jumped slightly as her stomach let out a loud growl. How could she still be hungry, when her belly was stretched tight like a beach ball? She really should get home and get to bed as she had school in the morning, but she was still so hungry...</span></div></div>",
            "created":1519275600,
            "id":2456200,
            "title":"Ravenous Appetite"
        },
        "1122":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Get the shake for the road",
                "Leave without the shake"
            ],
            "content":"<div class=\"\"><div> <span>She found herself walking up to the counter and ordering another meal before she even realized what she was doing. She wasn't used to stopping herself from eating, and it was showing in her lack of self control right now. Although, she had often wanted to be able to eat more, but she seemed to have been cursed with a rather small appetite. <br>\r\n<br>\r\nShe grabbed the tray from the cashier, taking it back to her table. Her pants were digging uncomfortably into her waist, and her skin felt sore from being stretched so much. She lifted the large burger in her hands, feeling some of the grease drip onto her hands as she took a large bite.<br>\r\n<br>\r\nShe sighed, trying to savor the flavor for a moment before swallowing. She had always loved food, but her tiny stomach had often prevented her from really enjoying as much as she would've liked. However, today she seemed to have an almost endless appetite, and she loved it. Though, the tightness of her skin was definitely starting to get uncomfortable. <br>\r\n<br>\r\nShe slowly devoured the meal, trying to savor this one after downing her first meal so quickly. She glanced around quickly, making sure no one was watching, and undid her jeans as she tried to relieve some of the pressure on her swelling midsection. Her face turned red slightly as she took another bite of her burger, uncomfortably aware of the feeling of having her pants undone in public. <br>\r\n<br>\r\nShe kept glancing around, as she continued shoveling food into her mouth. She must look like such a pig right now, but part of her was really enjoying being able to stuff herself. She had always loved food, and honestly it was a surprise that she wasn't fat with how often she pushed herself. Though her fast metabolism and relatively small stomach probably helped with that. Besides, she'd never really been scarred of being overweight. Honestly, it didn't really matter to her what size she was as long as she got to enjoy herself and her food. <br>\r\n<br>\r\nKat leaned back on the bench, staring at the empty tray in front of her. There were only a couple of people left in the dining room, and several of the employees were busy cleaning up as they prepared to close. Her belly was obviously swollen and protruding slightly, though she still pulled down her shirt as she tried to hide the fact her pants were undone as she stood up. She grabbed the tray and started making her way towards the garbage can, when she stopped.<br>\r\n<br>\r\nHer stomach let out another low growl, as her eyes took in the large shake that had appeared on the menu. She was finally feeling pretty full, but she had to admit that the shake looked really good. Besides, she could just eat it on the way home. Though, she wasn't sure if she could shove any more food into her already overstuffed belly. She felt like she was going to explode.</span></div></div>",
            "created":1531976400,
            "id":2522061,
            "title":"Just one more..."
        },
        "12":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Her flat chest was still the same",
                "Her erect nipples were visible through her shirt"
            ],
            "content":"<div class=\"\"><div> <span>Looking over the statues, Kat found her eyes drawn to the one with the large breasts. Instinctively she looked down at her own flat chest. While all her friends had developed breasts, she could almost pass for a boy with how flat she was. She wondered what it would be like to have breasts large enough they'd hang below her waist like the statues.<br>\r\n<br>\r\nFeeling oddly guilty, she looked around and saw that Nathan was still examining something on the wall. She turned back towards the statues and took a few steps towards the busty statue. The woman was very beautiful, though her back was arched under the implied weight of her bosom. Carefully, Kat reached towards the statue and closed her hand around the cold stone. It was surprisingly heavy, but very well crafted.<br>\r\n<br>\r\nShe jumped, almost dropping the statue as she heard a voice right behind her, \"That's Helona, the goddess of Femininity. Suppossedly, she was the one who first created women, according to this civilization. If a woman ever felt that she wasn't womanly enough, she would pray to Helona for a blessing.\"<br>\r\n<br>\r\nNathan was peering over her shoulder at the statue, obviously fascinated.<br>\r\n<br>\r\n\"Helona, I don't have big enough boobs, make mine enormous.\" Kat mocked, handing the statue to Nathan. As she said that though, she got a weird tingling sensation in her chest causing her to shiver.<br>\r\n<br>\r\n\"Haha, very funny. You have to remember though, this was an entirely different civilization. Their customs and culture were probably entirely different from ours.\" Nathan said, examining the statue he didn't notice Kat glance down at her chest, where she saw...</span></div></div>",
            "created":1518152400,
            "id":2451072,
            "title":"A tingling sensation"
        },
        "121":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Get some food",
                "Go to bed and figure it out in the morning"
            ],
            "content":"<div class=\"\"><div> <span>Her heart sank slightly. She didn't know what she had expected. It was just a stupid story anyway. Although, she had to admit that part of her had hoped that it would be true. She'd always been self conscious about how small he breasts were compared to the rest of her friends.<br>\r\n<br>\r\n\"Kat? Kaaat?\" She shook her head, realizing that her older brother must have been talking to her the whole time.<br>\r\n<br>\r\n\"Sorry, \" she said, \"I just kind of zoned out there for a minute.\"<br>\r\n<br>\r\nNathan smiled at her, \"It's okay. I know you're not as interested in this as I am.\"<br>\r\n<br>\r\n\"No! It's not that!\" Kat shot back.<br>\r\n<br>\r\n\"Then what is it?\" Nathan pressed jokingly.<br>\r\n<br>\r\n\"It's nothing,\" Kat could feel her face growing red as she tried to think of a better answer than that she was thinking of her boobs, although she was finding it hard to think with the tingling in her chest. <br>\r\n<br>\r\n\"It's okay to admit that you aren't as interested in this stuff as I am,\" Nathan said, handing the statue back to Kat, \"How about you keep that as a souvenir.\" <br>\r\n<br>\r\nKat blushed more, but took the statue in her hands. She stared at it for a few more moments, wondering what it'd be like to have breasts. Reluctantly she put the statue in her backpack and pulled out her lunch bag, wishing she wasn't so flat chested. She was so flat that she didn't even have to wear a bra, she thought as she bit into her peanut butter sandwich. How she wished that she had breasts that her friends would be envious of.<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- ----------<br>\r\n<br>\r\nKat flopped onto her bed, feeling full from the lasagna she'd had for dinner. The rest of her trip with her brother had been fairly uneventful, though the tingling in her chest hadn't gone away and she was starting to worry a bit. She'd also been especially hungry at dinner and had eaten almost twice what she normally did. That had elicited an excited response from her parents who both thought that she was anorexic and needed to put on weight.<br>\r\n<br>\r\nShe took a minute to rub her full belly, before reaching over the side of her bed and grabbing the statue from her backpack. Laying on her back, she held it above her as she admired the breasts. <br>\r\n<br>\r\n\"I wish I had breasts as big as yours.\" She said to the statue.<br>\r\n<br>\r\nShe almost dropped the statue as her stomach growled at her. She felt hungry even though she'd just had a huge dinner. She frowned and set the statue on the nightstand beside her bed.<br>\r\n<br>\r\nGlancing over, she noticed that the bag of chips was still on her desk. Hopped out of bed and began ravenously devouring the bag. Before she knew it the bag was empty, but she was still feeling hungry. She turned to look at the clock and felt a weird sensation in her chest, like it was taking slightly longer to follow her. <br>\r\n<br>\r\nShe almost screamed as she looked down at her chest and her heart started racing. Where her once flat chest had been their was now two tiny mounds visible through her shirt. They definitely wouldn't win her any awards for size, but she had never been able to see her breasts through her shirt before. <br>\r\n<br>\r\nThrowing off her shirt she took her bare breasts in her hand, feeling a soft weight that had never existed before. She was brought back to reality by the sound of her stomach growling. She looked down at the two small bumps that were her breasts, wondering if maybe she was so hungry because the food was going to her boobs. She wondered what she should do?</span></div></div>",
            "created":1518325200,
            "id":2451908,
            "title":"Patience"
        },
        "1211":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Try to hide her new boobs",
                "Flaunt her new assets"
            ],
            "content":"<div class=\"\"><div> <span>The gnawing feeling in her stomach made her choice for her, as she slowly crept towards the door. Remembering her lack of shirt, she quickly threw it back on before continuing.<br>\r\n<br>\r\nThe hallway was dark with the only light coming from a small nightlight, and no light could be seen coming from any of the other rooms. In the silence of the night, it was easy to hear the refrigerator in the kitchen as well as the light sound of snoring coming from her brother's room. <br>\r\n<br>\r\nAs quietly as she could, Kat made her way downstairs. Though there was no rule in her house about getting food late at night, she didn't want to have to explain to everyone why she was still hungry after her large meal. It was hard enough for her to even comprehend, let alone someone else. <br>\r\n<br>\r\nThe kitchen was just as dark as the rest of the house, though Kat could easily picture it in her head. She deftly walked past the table on her way to the food on the other side, trying to be quiet as she opened the fridge.<br>\r\n<br>\r\nThe inside of the fridge was loaded with food, though most of it was just ingredients. However, hiding behind a head of lettuce was a large chocolate cake that had been for dessert.<br>\r\n<br>\r\nMouth watering as she thought about how delicious it was, she grabbed a small plate from one of the cupboards. Slicing herself a large piece, she grabbed a fork and began eating. However, she soon found herself disappointed that it was already gone. <br>\r\n<br>\r\nShe went back to the fridge and sliced herself another large piece, and quickly devoured that one as well, before grabbing a two liter of soda from the fridge. She put her plate in the sink and took the soda to her room, closing the door behind her. Breaking the seal on the soda she found herself guzzling it down greedily, feeling her stomach stretching with each gulp. <br>\r\n<br>\r\nA few minutes later, she was laying on her bed looking at her bloated belly as she tossed the empty bottle away. She had no idea what had come over her, she was never this much of a glutton. However, she couldn't deny that a part of her was enjoying this. Rubbing her swollen belly, she eventually drifted off to sleep. Her dreams that night were filled with food and overindulgence and guilty pleasures.<br>\r\n<br>\r\nAs her alarm went off, she slowly pulled herself out of bed, feeling sluggish and heavy. As she took a step, she felt a wrapper beneath her foot.<br>\r\n<br>\r\nThe floor was littered with wrappers and crumbs as well as another empty soda bottle. However, the thing that most surprised her was her noticeable chest, which was easily a C-cup. <br>\r\n<br>\r\nThrowing off her shirt, she cupped her breasts, feeling their weight in her hands. She couldn't believe it, she'd gone from having no boobs, to a C-cup in one night. There would be no hiding these new additions to her body. What was she supposed to do?</span></div></div>",
            "created":1519707600,
            "id":2458372,
            "title":"Filling Out"
        },
        "122":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Decides to wear the bra",
                "Decides not to wear the bra",
                "Decides to try to sneak one of her mom's bras"
            ],
            "content":"<div class=\"\"><div> <span>Turning away from Nathan quickly, she crossed her arms hoping that he hadn't noticed her erect nipples tenting her shirt slightly. That was the one downside to not wearing a bra, but usually they didn't get that erect. She could feel her face turn hot, and tried to act nonchalant. Fortunately, her brother seemed to be engrossed in the statue and wasn't paying any attention to her odd behavior.<br>\r\n<br>\r\nShe shifted slightly and almost gasped as her shirt rubbed against her sensitive nipples. Feeling embarrassed, she couldn't help thinking about how good it had felt and it was taking all of her will not to start rubbing them right there. She was so distracted, she hadn't even noticed that Nathan had wandered over to the pedestals and was examining the other statues. Figuring he would be distracted for a moment, she began picking her way towards the entrance to the ruins. <br>\r\n<br>\r\nAs she emerged into the small clearing, she felt the warm sun trickling down through the trees causing goosebumps on her arms and legs. An early spring breeze wandered through the forest rustling leaves, which blended with the sound of the waterfalls. She could hear a few birds chirping in the trees above her as she wandered around the side of the building where she wouldn't be disturbed. <br>\r\n<br>\r\nOnce she was sure she was out of view of the front of the building, she lifted her shirt and shivered as the fabric rubbed her sensitive nipples. Her dark areola surrounded her nipples which looked larger than normal, which could explain why they were so sensitive. It wasn't uncommon for her nipples to become erect when she was thinking about her breasts, but this was the most active she'd ever seen them. <br>\r\n<br>\r\nShe bit her lip to stifle a moan as she rubbed her hand across one of her rock hard nipples. Goosebumps rose again on her arms and legs, though for an entirely different reason this time. She felt herself growing moist in her groin as she rubbed both her nipples again. <br>\r\n<br>\r\nShe took a few deep breaths and slowly lowered her shirt, almost letting out a moan as it rubbed against her nipples. Her face felt flushed and she still felt aroused, but she figured her brother would start wondering where she was if she took too long. She glanced down again and frowned slightly.<br>\r\n<br>\r\nHer nipples were quite obvious through her shirt, tenting the fabric significantly they didn't seem to show any sign of letting up. If anything, they seemed ever so slightly larger after her playful experiment. <br>\r\n<br>\r\nSighing she did her best to hide them as she went back inside the ruins to help Nathan look for anything of value. It was a long few hours as anytime she accidentally brushed her nipples or something bumped them, she had to do her best not to show how sensitive they really were.<br>\r\n<br>\r\n---------------------------------------------------------------------------- -------------------------------------------------------------------------------- ------------------<br>\r\n<br>\r\nWhen they finally got home that night with the three statues and a few other artifacts, Kat immediately went up to her room and locked her door behind her. She threw off her shirt and glanced down at her still erect nipples as a gasp escaped her lips.<br>\r\n<br>\r\nHer areola seemed even darker and larger than she'd ever seen them, and her nipples were standing like twin peaks at attention. Rubbing one of her nipples she moaned at how sensitive it was, panting slightly. She frowned as she tried to figure out why this was happening, but all she could come up with was that maybe it was almost that time of the month. <br>\r\n<br>\r\nCarefully, she began getting ready for bed, throwing on a thin night gown she crawled into bed trying to be careful with her sensitive nipples. She tossed and turned throughout the night as every slight bump of her nipples elicited a pleasurable surge through her body.<br>\r\n<br>\r\nToo soon her alarm went off signaling it was time to get ready for school. Groggily she got out of bed and made her way to the bathroom, glancing at the closed doors of her parents and brother, envious that they got to sleep in. She shut the bathroom door behind her, and turned on the faucet in the shower to let the water heat up. She threw off her night gown and turned towards the mirror before stopping dead.<br>\r\n<br>\r\nHer nipples and areola had almost doubled in size overnight, looking puffy and engorged. However, the thing that really threw her off was her noticeably larger breasts. She cupped them in her hands, feeling her new weight. She winced slightly as her hands brushed her large nipples sending another wave through her body. <br>\r\n<br>\r\nHer worry was quickly replaced by pleasure at seeing her better endowed chest. She'd always felt she was too small and had always hoped that she would fill in eventually. She smiled, it looked like her nipples were erect because her breasts were finally starting to fill in. <br>\r\n<br>\r\nShe frowned though as she realized that she was definitely going to have to wear a bra now. There was no way people wouldn't notice if she didn't. After she showered, she made her way back to her room, hearing her mother cooking breakfast in the kitchen.<br>\r\n<br>\r\nShe immediately closed the door and went to her closet and pulled out a bra. Putting it on she tried to close the clasp, and frowned at how tight it felt. While it was definitely not at risk of bursting under her small boobs, it still wasn't comfortable. She wondered if it would really be that bad to skip wearing a bra today, especially since it seemed like her nipples were finally no longer erect. </span></div></div>",
            "created":1519362000,
            "id":2456763,
            "title":"Tenting"
        },
        "1221":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Try to make it through school without bursting her bra",
                "Try to get to the clothing store during lunch",
                "Head home and see about waiting it out"
            ],
            "content":"<div class=\"\"><div> <span>Leaving her bra on, she threw on a shirt which hid the recent growth of her breasts. Looking down at herself she frowned at how flat chested she still looked.<br>\r\n<br>\r\nAll her friends had developed fairly well in the chest, and while none of them were going to win any contests for size, at least they weren't always being mistaken for a cross-dressing boy. Though her friends always told her that she looked like a really beautiful boy at least. <br>\r\n<br>\r\nAfter a few moments of looking herself over she finished getting dressed, and made her way downstairs, the smell of bacon beckoning her to the kitchen. As she entered the kitchen her mother greeted her and set a plate of bacon and eggs at her spot of the table. She ate ravenously, devouring her meal in a matter of minutes, before grabbing her book bag and heading out the door. <br>\r\n<br>\r\nThe air was crisp and cool as a slight breeze stirred the small leaves that were budding on the trees. She walked in silence for the most part with only the occasional passing car, and before too long she was standing outside a large building that was her high school. <br>\r\n<br>\r\n\"Hey, Kat!\" A voice came from behind her, causing her to turn around quickly in search of the source.<br>\r\n<br>\r\nA tall girl was rushing towards her, Brittany. Kat waved and shouted back, \"Hey!\"<br>\r\n<br>\r\n\"How did your expedition with your brother go?\" the tall girl asked, coming to a stop in front of Kat, \"Did you find anything cool?\"<br>\r\n<br>\r\nSmiling Kat started walking towards the front of the school, Brittany walking along beside her, \"Yeah, we found this ancient temple thing. I'll have to take you there sometime.\"<br>\r\n<br>\r\n\"That would be so cool! How about this weekend?\" Brittany was practically bouncing.<br>\r\n<br>\r\n\"Sure. Anyway I need to head to class, don't want to be late.\"<br>\r\n<br>\r\n\"Alright, see you later!\"<br>\r\n<br>\r\nKat watched Brittany run down the hall towards her class and smiled. They'd been friends since elementary school, although they didn't have as much time to hang out and goof around like they used to. Brittany was always in a good mood and seemed ready to do something spontaneous all the time. <br>\r\n<br>\r\nAs Kat began making her way towards class she was becoming aware of how tight her bra felt on her breasts. She'd definitely have to go bra shopping soon. Although she couldn't help thinking that it also felt pretty good. The tight bra felt like someone giving her boobs a massage and she could feel her large, erect nipples pressing into the soft padding of the bra. Each step caused a feeling of pleasure from her breasts as she headed towards class. <br>\r\n<br>\r\nHeading into class she took her seat near the rear of the room, and pulled out her textbook. The lecture was boring and she found herself absentmindedly using her upper arms to massage the side of her breasts, trying to get them to sit more comfortably in her tight bra that just seemed to be feeling tighter as time went on. By the time class was over she was regretting wearing a bra today, but she figured that she'd just have to stick it out. <br>\r\n<br>\r\nThe next few classes passed in about the same way as her bra continued to feel more and more uncomfortable, distracting her from paying much attention in class. By the time lunch period started, it felt like her bra was cutting her in two. As she grabbed her bag she glanced down at her chest and almost squealed. <br>\r\n<br>\r\nTwo small mounds were visible through her shirt, which looked a little tighter around her chest. She rushed towards the restroom, shutting herself in one of the stalls. She took off her shirt, almost fainting in shock.<br>\r\n<br>\r\nHer breasts were practically bursting from her bra and her nipples were clearly visible through the padded fabric while her dark areola were visible as two large half circles almost 4 inches in diameter.<br>\r\n<br>\r\nReaching behind her she undid the clasp on her bra, which was barely holding. Lowering the bra she could feel the weight of her breasts, which were now on the larger size of C cups, pulling on her chest and back. Her nipples stuck out almost 2 inches, looking almost like tiny teats. Now that she was blooming, it seemed to be coming all at once, but what should she do? At this rate her bra wouldn't hold together much longer, but she really should stay to finish school. Though she could also try to make it to the clothing store and back before lunch was over. She had no idea why this was happening and it was starting to concern her. Most people's breasts didn't grow 3 cup sizes in one day.</span></div></div>",
            "created":1519621200,
            "id":2458080,
            "title":"A Tight Squeeze"
        },
        "13":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Starts feeling nauseous ",
                "Starts feeling horny",
                "Feels slightly bloated"
            ],
            "content":"<div class=\"\"><div> <span>As she looked over the statues, her eyes lingered on the pregnant statue. She took a few steps closer to the statue, almost mesmerized by the swollen belly. Her hands instinctively went to her toned belly below her flat chest as she felt her smooth skin. She wondered what it'd be like to be that pregnant. Smiling slightly, she stepped up to the pedestal to better examine the statue. <br>\r\n<br>\r\nGlancing behind her, she saw Nathan was still now examining a stone he'd picked up. She turned back towards the statue and picked it up. It was heavy in her hands and the stone was slightly cool. The statue was incredibly detailed as it even included stretch marks on her swollen belly and breasts. She had an ageless face with a large smile. One hand was supporting her large belly, while the other seemed to be caressing it.<br>\r\n<br>\r\nAs Kat examined it, she began to feel a strange feeling in her groin, almost like a tingling. \"Don't tell me this is turning me on.\" she thought to herself, but that's when she noticed she was rubbing her belly and immediately stopped. She had to admit that for a pregnant woman, the statue did look rather beautiful though.<br>\r\n<br>\r\nShe turned at the sound of footsteps approaching and saw Nathan walking towards her, \"What do you  have there?\"<br>\r\n<br>\r\n\"Just a statue I found.\" Kat said extending it towards her brother. <br>\r\n<br>\r\nHe took it in his hands, turning it this way and that, \"This is Onaria, the goddess of Fertility. From my research I learned that when this civilization's population began dropping they'd pray to her to increase their numbers. Supposedly, she'd pick an avatar to help repopulate the civilization.\"<br>\r\n<br>\r\nAs her brother was talking, the feeling in her groin began to change..</span></div></div>",
            "created":1518152400,
            "id":2451074,
            "title":"Fertility"
        },
        "131":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "She feels extremely nauseous",
                "Her pants feel a little tighter",
                "Her belly looks bloated"
            ],
            "content":"<div class=\"\"><div> <span>Her brother looked at her, a glimmer of concern in his eyes, \"Are you okay? You look really pale.\"<br>\r\n<br>\r\nA wave of nausea washed over her as sweat started beading on her brow, \"Just a bit nauseous. Probably because I didn't eat anything this morning.\"<br>\r\n<br>\r\n\"Maybe we should eat our lunches then,\" her brother said, still sounding worried.<br>\r\n<br>\r\nWobbling slightly as another wave of nausea washed over her, Kat lowered her backpack to the ground. Unzipping the large pocket, she began scrounging through the trail supplies until she found what she was looking for. Pulling out the insulated lunch bag, she pulled out her sandwich and sat on the ground to eat, while her brother did the same.<br>\r\n<br>\r\nThey ate in silence, though she still caught him watching her carefully a few times, though he'd quickly look away when he noticed her looking. After about 15 minutes, they'd both finished their meals, and Kat stood up feeling much better.<br>\r\n<br>\r\n\"You don't look nearly as pale,\" Nathan said as he got to his feet.<br>\r\n<br>\r\n\"Told you I was just hungry.\" Kat replied, turning to put her lunch bag back into her bag, though a bit of nausea still lingered. Her brother messed up her hair as he walked past her, \"I'm your older brother. It's my job to worry about you.\"<br>\r\n<br>\r\n\"Well I wouldn't have had to skip breakfast if someone wouldn't have been rushing me so much,\" she shot back, patting her black hair to make sure it wasn't too messy. <br>\r\n<br>\r\n\"Well I wasn't the one who decided to sleep in.\" <br>\r\n<br>\r\nShe shook her head and stayed quiet, she had completely forgot that they were going on an expedition and hadn't set an alarm that morning, which resulted in a very rushed effort to get ready to go. She followed her brother towards the pedestals with the remaining statues, grabbing the pregnant statue on the way. She placed it in her bag, knowing that Nathan would want to examine it at his lab later.<br>\r\n<br>\r\nThe next few hours passed without much event as her brother carefully examined everything and took numerous samples. Occasionally, she would be hit with a wave of nausea, though it was never as bad as the first time. She explored the building too, amazed that no one else had found this place before. <br>\r\n<br>\r\nFinally, they began making their way back through the forest with the sun beginning to set. They chatted casually about the things they found, their packs weighed down with the statues and several other artifacts they'd recovered. Her brother had a research grant and a lab at the university, which meant they could actually take things they found on these expeditions.<br>\r\n<br>\r\nThe sun had set, and darkness set in by the time they'd reached her brother's jeep and loaded everything into the back, and it was almost 10 when they finally pulled into the cozy two story house that was their home. They each grabbed their packs and made their way inside. Most of the lights were off, though the smell of lasagna lingered in the entryway causing Kat's stomach to growl hungrily. <br>\r\n<br>\r\nAfter running up to her room and depositing her bag, she made her way back downstairs to the kitchen where she found her brother reheating a plate of lasagna. She followed suit and then made her way to bed, dreading going to school in the morning. When she awoke...</span></div></div>",
            "created":1519275600,
            "id":2456154,
            "title":"Morning Sickness"
        },
        "1312":{
            "author_id":"hague94",
            "author_name":"D. Hague",
            "choices":[
                "Her tummy looked slightly bigger!",
                "She looked six months pregnant!",
                "Her tummy looked HUGE!"
            ],
            "content":"<div class=\"\"><div> <span>When Kat awoke the next morning, her pants felt uncomfortably tight. She looked at the clock, it was only 6am, she didn't need to get up for another hour at least.<br>\r\n<br>\r\nAfter tossing and turning for twenty minutes, she gave in and got up to go pee, hoping that would help.<br>\r\n<br>\r\nAs she sat on the side of her bed, the pinching feeling around her waist got worse, and she gasped at the pain of her pants digging in. She jumped up, hoping not to wake Nathan or her parents up and made her way to her bathroom, wincing every time she took a step. As she passed her full length mirror, she stopped in her tracks.<br>\r\n<br>\r\n<i>Wow, that lasagna has really made me bloated.</i> She thought to herself. She could help but caress the slight (yet firm) dome of her belly sticking out under her tank top. That's when she realised just how much her pants were digging into her. She traced her finger over the indent they were leaving, wincing as she prodded at it. <br>\r\n<br>\r\n\"Right, this is no good.\" She mumbled to herself, fumbling with the fabric as she tugged them off. When they were off she sighed contentedly, a smile growing on her face. She felt another sharp sensation in her lower abdomen and remembered exactly why she got up, dashing to the toilet.<br>\r\n<br>\r\nAfter what felt like forever, her bladder emptied and she felt much more comfortable. That was until the hunger pangs started while she washed her hands.<br>\r\n<br>\r\nHer stomach let out an audible growl, and if she didn't know any better, she'd say her bloated stomach visible shook.<br>\r\n<br>\r\n\"How can you be hungry when you're still bloated from last night's lasagna!\" She complained, mindlessly caressing her stomach. It grumbled again, but much quieter.<br>\r\n<br>\r\nSuddenly, a hunger came over her like nothing she felt before, and she couldn't control it.<br>\r\n<br>\r\n\"I. NEED. ICE CREAM.\"<br>\r\n<br>\r\nShe rushed downstairs, not caring if she woke up anyone else as she made her way to their freezer in the basement. When she got down there, she grabbed a tub of Ben&amp;Jerry's chocolate fudge brownie, bringing it back up to her room, grabbing a spoon on the way.<br>\r\n<br>\r\nWhen her alarm went off at 7am, she had finished the whole tub, ice cream smeared all over her tank top and mouth.<br>\r\n<br>\r\n\"Was that nice?\" She cooed as she caressed her bloated tummy.<br>\r\n<br>\r\nThen, Nathan burst through the door, half asleep.<br>\r\n<br>\r\n\"Are you going to turn your damn alarm off or not?!\" He grunted.<br>\r\n<br>\r\nKat snapped out of her ice cream trance...and then a wave of nausea came over her. She ran to the bathroom, puking sounds travelling through the half open door.<br>\r\n<br>\r\n\"Fine. I guess <i>I'll</i> turn it off.\" He shuffled through her room, not even noticing the empty tub as he went over to her nightstand to turn it off.<br>\r\n<br>\r\n\"What is going on here?!\" Sighed Kat's mom, exasperated.<br>\r\n<br>\r\n\"Kat's puking in the bathroom.\" Nathan mumbled. <br>\r\n<br>\r\nAs if on cue, Kat retched.<br>\r\n<br>\r\n\"Oh. I see. Are you okay sweetie?\"<br>\r\n<br>\r\nKat managed to groan before the wave of nausea hit her again.<br>\r\n<br>\r\n\"She must've caught a bug while you two were out yesterday. I'll call the school now and let them know she isn't feeling well.\"<br>\r\n<br>\r\nWhen the nausea subsided, Kat got up, stumbling. Her center of gravity felt off.<br>\r\n<br>\r\nShe grabbed the side of the sink with one hand, the other going straight to her belly as a sharp pain went through it.<br>\r\n<br>\r\nSuddenly it felt heavier, and she swore she felt it grow under her fingers.<br>\r\n<br>\r\nShe made it to the mirror and was shocked to see...</span></div></div>",
            "created":1532149200,
            "id":2522988,
            "title":"Her pants feel a little tighter"
        },
        "13121":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Go for the cake anyway",
                "Raid the cupboards",
                "Decide to go out and eat"
            ],
            "content":"<div class=\"\"><div> <span>Her belly was almost noticeably bloated, even with her shirt on it tented the fabric slightly. On top of that she still looked a little pale as another wave of nausea washed over her before quickly passing. Still, there was no denying that her belly was larger than it had been when she'd woken up, even if it was only marginal. If anything it looked pretty proportional for the tub of ice cream she'd just devoured.<br>\r\n<br>\r\nUnsteadily, she poked at her swollen belly and winced. Her skin was tight and firm, and poking it just made her feel worse. Maybe she had caught something on their trip yesterday. Though, eating an entire tub of ice cream probably hadn't helped her situation. As long as no one mentioned the empty tub, she wasn't going to say anything either.<br>\r\n<br>\r\nSighing as another wave of hunger seemed to start gripping her, she turned on the water and tried to clean as much of the ice cream off herself as she could.<br>\r\n<br>\r\nShe frowned at a stubborn stain in her shirt, as she scrubbed at it insistently. She had no idea what had come over her, but she had never been such a greedy pig with food before. She had no idea why, but she found herself starting to tear up, only resisting the urge to break down and sob through shear force of will.<br>\r\n<br>\r\nShe stared at herself in the bathroom, taking in the cute girl in the mirror with the slightly protruding belly as she tried to get her emotions under control. Finally, she made her way back to her room and changed into some clean clothes as her stomach let out a loud growl, and she grabbed her stomach at the gnawing hunger that gripped her. <br>\r\n<br>\r\nFrowning, she waited until she heard the others leave for their various destinations as she tried to resist her hunger until she could have some time to herself. She didn't want them to start questioning her if she lost control again and went on a food eating rampage. She couldn't believe how hungry she was, and if she didn't get it under control her stomach wouldn't just be bloated.<br>\r\n<br>\r\nFinally, everyone had left and she made her way down towards the kitchen and cautiously entered. There was a large cake on the counter covered in chocolate frosting, looking large enough for a large party. Though she should probably eat something a little less sugary, unless she wanted to spend the next hour puking.</span></div></div>",
            "created":1532149200,
            "id":2523007,
            "title":"Slightly Bloated"
        },
        "131211":{
            "author_id":"hague94",
            "author_name":"D. Hague",
            "choices":[
                "Her mom come home to check on her with lunch",
                "Someone else knocking on the door with food"
            ],
            "content":"<div class=\"\"><div> <span>Kat couldn't resist the delicious-looking cake in front of her, so much so she didn't even bother to slice it up - she simply shovelled handfuls of the moist, fudgy chocolate cake into her mouth with reckless abandon.<br>\r\n<br>\r\nMuch like the hunger haze she went through earlier, Kat seemed to forget about her surroundings, focusing solely on the cake and how each mouthful tasted. What she didn't realize was that this time, there were some subtle changes going on to her body as she ate.<br>\r\n<br>\r\nA layer of fat seemed to be forming all over her body, overall making her seem a little softer than she had been yesterday. Her arms were getting a little thicker, losing the tone they'd had as she explored the forest with her brother yesterday, and the same went for her thighs. Slowly but surely, the thigh gap she had disappeared as her thighs got thicker, and her hips got wider. Her stomach grew slightly, maintaining the bulge that had appeared overnight, and her breasts grew from a small A to a D cup.<br>\r\n<br>\r\nShe was by no means fat, if anything her new curves made her seem more womanly.<br>\r\n<br>\r\nBefore she knew it, all that was left of the cake were a few crumbs and yet more stains on her tank top and around her mouth. She didn't have much time to realize what had happened when two strong sensations came over her at once: her breasts were tingling and she desperately needed to pee again.<br>\r\n<br>\r\nKat just about made it to the downstairs bathroom. As she sat on the toilet, her hands yet again instinctively went to her bloated tummy. She was fascinated at the fact it seemed to be both rock hard and soft, and found herself kneading the doughy outer layer, not caring that her tank top was practically just a bra at this point, keeping her tender breasts off her swollen belly. After what felt like forever peeing, she felt exhausted.<br>\r\n<br>\r\n\"Jeez. I think I need a nap...\" She muttered to herself as she slowly made her way back to her bedroom.<br>\r\n<br>\r\nShe crawled back into bed, pulling the covers over her head and snuggled into a large body pillow. She thought nothing of the fact that, as far as she could remember, she'd never seen it before in her life as she drifted off into a heavy sleep, unaware of the final changes being made to her body as her 'bloated' belly grew one last time.<br>\r\n<br>\r\nThat wasn't the only thing that seemed to have been altered in the house.<br>\r\n<br>\r\nDownstairs on the counter where there once stood a large chocolate cake, was now a line of different vitamins with a note from her mother that said \"Don't forget to take these!\" In her neat cursive handwriting. On the refrigerator, there was a scan that, and if you looked at it closely, you could see the outline of a fetus still growing in its mother's womb. Next to the scan was a 'Congratulations!' card and a number of baby-themed magnets that surrounded a whiteboard that had '23/40' scrawled on it. The biggest changes were in Kat's bedroom though.<br>\r\n<br>\r\nWhat was only yesterday a typical messy teenage girl's bedroom was now almost completely spotless. The ice cream tub from earlier seemed to have vanished, as had the stain it had left on the carpet. Trashy teenage magazines had been replaced with baby books, like 'First Time Parent' and 'What to Expect when you're Expecting', along with a pregnancy journal. On her nightstand was another scan picture in a simple glass frame, with a tub of Tums and a glass of water. In her wardrobe, gone were her usual clothes, all replaced with either maternity tops and pants or clothes in sizes L and XL to fit her more comfortably.<br>\r\n<br>\r\nHer school uniform and books also seemed to be gone, replaced with books on how to pass your GED.<br>\r\n<br>\r\nIn the corner, tucked away behind her chair that was now covered in stuffed toys was a crib, still in its box, waiting to be put together.<br>\r\n<br>\r\nKat slept for a few hours, only waking up when she heard...</span></div></div>",
            "created":1532235600,
            "id":2523312,
            "title":"A warped reality"
        },
        "13122":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Go shopping for maternity clothes",
                "She's pretty hungry, so maybe she should focus on eating first",
                "Find Nathan at his lab and see if he has any ideas why this is happening"
            ],
            "content":"<div class=\"\"><div> <span>She wasn't imagining the growth that she had felt under her fingers, as she tried to stifle a scream. Her hands immediately went to the large bulge that was her stomach, feeling every tight inch of her stretched skin. She plopped down on the toilet, trying to stop from hyperventilating as she tried to process what was happening.<br>\r\n<br>\r\nShe couldn't tear her eyes away from her obviously pregnant belly as her mouth opened and closed silently, her breathing coming in short pants. She hadn't been pregnant yesterday, but as of a couple minutes ago she looked close to six months pregnant. There was no way that this could be happening, she thought. Yet, there was her protruding belly, complete with stretch marks and outie belly button. Her family would freak out when they saw her like this. Although she had no idea how she would explain her rapid pregnancy progression to them. <br>\r\n<br>\r\nFinally getting her breathing more under control, she stood up and moved in front of the mirror. Taking in her womanly body from as many angles as she could. Now that she was looking at more than just her belly, she realized that wasn't the only thing that had changed. Her hips and thighs were wider, looking more accustomed to a pregnant girl, and her breasts had swollen as well. Her hands instinctively tried testing their weight as she shuddered at their increased sensitivity. It was hard to tell since her pregnant belly threw off her concepts of proper proportion, but she was sure that she'd gotten fatter as well. <br>\r\n<br>\r\nShe was finally shaken to her senses as her mother yelled from downstairs, \"Don't worry about going to school, get feeling better. I have to run some errands. I'll be back soon.\"<br>\r\n<br>\r\nKat let out a sigh, both relieved and stressed that she didn't have to reveal her newfound body to her mother just yet. She definitely wasn't a virgin, and her family knew that. That had been a can of worms that she hadn't hoped to open, but once they'd gotten over the initial anger, they'd been pretty supportive that it was her life and she was allowed to make those decisions. They'd always stressed the consequences though, like pregnancy. Still, most women didn't suddenly become six months pregnant over the course of a couple of hours. Combine that with the fact that it had been a few months since the last time she'd done the deed, and she had no idea what was happening to her.<br>\r\n<br>\r\nShe did one last turn in the mirror, trying to adjust to her new center of gravity, before she went to her room, closing the door behind her. She stripped off her too tight pants and shirt, throwing them onto the ground as she continued caressing her pregnant belly. Finally, she decided to throw on some new clothes, however, as she slipped her shirt on, it became apparent that her wardrobe hadn't changed. She stood there in a shirt that seemed more like a large bra at this point, before deciding to try her jeans. <br>\r\n<br>\r\nShe grunted in exasperation as she struggled to pull her jeans up over her fatter thighs and hips, and couldn't even come close to getting the button done up with her swollen belly and wider waist. This definitely wasn't good. Still, she should probably try to figure out what to do next, she thought, as she looked at herself in the mirror in her room. </span></div></div>",
            "created":1532322000,
            "id":2523786,
            "title":"Unplanned Pregnancy"
        },
        "132":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Try to stick it out",
                "Ask to be let out"
            ],
            "content":"<div class=\"\"><div> <span>As her brother droned on about the history of the civilization they were investigating, Kat found her mind beginning to wander as a tingling filled her groin. Slowly the feeling began to change into an emptiness in her womb, and she could feel herself growing wet. <br>\r\n<br>\r\n\"Sorry. I didn't mean to bore you.\" Nathan said, causing Kat to jump slightly.<br>\r\n<br>\r\nHer face flushed, feeling like fire, \"You weren't boring me, I just... I just don't feel too good right now is all.\" She didn't want to admit to him that she'd suddenly wondered what it would be like to have his dick inside her, feeling it stretching her virgin pussy as he pumped his seed into her waiting womb. Growing redder at the realization that part of her was desperately wanting to do it with him, she tried to push the thoughts out of her mind. <br>\r\n<br>\r\n\"You really don't look very well. Perhaps we should head back home.\" Nathan said, pressing the back of his hand to her forehead.<br>\r\n<br>\r\nShe felt a tingle run through her body at his touch, as her groin tensed in anticipation. His hands were cool to the touch, a comforting feeling on her burning face.  After a moment, she quickly turned away, \"Yeah, that might be best.\"<br>\r\n<br>\r\nAt least if she got around other people, maybe it would be easier to control this growing hunger in her groin. She began walking towards the entrance to the temple waiting for the sound of her brother following her, but after a few moments of silence she turned back.<br>\r\n<br>\r\nHer brother was just standing in the same spot, a strange look on his face.<br>\r\n<br>\r\n\"Are you okay?\" Kat asked, a hint of worry in her voice.<br>\r\n<br>\r\n\"Ye-yeah, just thinking how... never-mind.\" he shook his head, and began following her towards the entrance to the temple.<br>\r\n<br>\r\n\"What? What were you thinking?\" Kat shot back, \"You can't just keep me hanging like that.\"<br>\r\n<br>\r\nIt was Nathan's turn to look away in embarrassment, his cheeks a dark red as he mumbled, \"I was just thinking how much of a beautiful woman you've become.\"<br>\r\n<br>\r\nHer heart skipped a beat, and she had to stop herself from rushing at him and tearing his clothes off. Panting slightly, she turned and started walking out of the temple, moisture beginning to build between her legs. There was definitely something weird going on, and she wanted to get as far away from here as possible before she let her brother be the one to pop her cherry. <br>\r\n<br>\r\nThe rest of the trip home went on mostly in silence, as both of them were too embarrassed to speak to the other. It was all Kat could do to keep the growing desire for sex under control as her groin longed to have a nice large penis filling it. Although, the thing that was really concerning was that she wanted someone to pump her full of cum, and fill her womb. Thoughts of being heavily pregnant kept wandering into her mind, increasing the desire to have someone fill her full of their juices. It was getting harder and harder to resist soliciting her own brother for sex.<br>\r\n<br>\r\nThey were getting pretty close to home, she could always ask to be let out at the Burger place nearby, or just try to stick it out for the next 10 minutes.</span></div></div>",
            "created":1522386000,
            "id":2472293,
            "title":"A Growing Desire"
        },
        "1322":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Start flirting with him",
                "Try to keep it in check"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey,\" Kat's voice cut the silence, feeling out of place, \"I'm pretty hungry. Could you drop me off at the burger place near our home?\"<br>\r\n<br>\r\nSilence filled the jeep for a few moments before Nathan nodded, \"Sure thing.\"<br>\r\n<br>\r\nThey rode another couple minutes in silence before the jeep was pulling up to the curb in front of a small restaurant. There were quite a few people at the drive through, and the lobby seemed fairly packed too with the diner rush.<br>\r\n<br>\r\nKat quickly hopped out of the vehicle, and started walking towards the building, turning to give a quick wave at her brother, who waved back before continuing on his way. <br>\r\n<br>\r\nOnce he was out of view, she stopped, taking a couple deep breaths to try to calm herself down. A sense of worry was starting to overtake her as she tried to figure out why she was so horny. Sure she'd been turned on before, but she'd never been so desperate for sex that she contemplated doing it with her own brother, and that definitely wasn't normal. However, even with him gone, she still had an ache in her groin telling her to find someone to fill her. <br>\r\n<br>\r\nAfter a few more minutes, she started walking towards the building, the sound of people talking and socializing growing louder as she approached. <br>\r\n<br>\r\nEven if her main goal had been to get out of the vehicle to prevent herself from having sex, she really should probably eat something. She'd missed breakfast that morning, and in her rush to leave the temple, hadn't eaten the lunch that she'd packed either. <br>\r\n<br>\r\nAs if to remind her of that fact, her stomach let out a small gurgle of anticipation at the thought of finally getting food. However, as she was about to open the door, she heard a voice behind her, \"Hey! Kat!\"<br>\r\n<br>\r\nShe turned quickly, scanning the parking lot for the source of the voice. After a moment she noticed the boy running towards her, waving his hands to get her attention.<br>\r\n<br>\r\nWaving back, she called out, \"Hey Theo!\"<br>\r\n<br>\r\nComing to a stop near her, he was panting slightly, \"Fancy running into you here.\"<br>\r\n<br>\r\n\"I know. I wasn't even planning on coming here tonight,\" Kat said, holding the door open for the handsome boy. <br>\r\n<br>\r\nWalking past her, he kept talking, \"Me neither. I just happened to be driving by when I saw you getting out of your brother's jeep, and figured you looked kind of lonely all by yourself.\"<br>\r\n<br>\r\nKat let the door close as she followed Theo into the restaurant, feeling her face blushing as her groin began yelling at her to have him fill her up with his seed. <br>\r\n<br>\r\n\"Thanks,\" she mumbled, \"I'm glad you stopped.\"<br>\r\n<br>\r\n\"Hey, anything for a friend,\" He said, giving her a little punch on the arm that sent a shiver of excitement coursing through her.</span></div></div>",
            "created":1522472400,
            "id":2472807,
            "title":"A Chance Encounter"
        },
        "13221":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Go with Theo",
                "Go home"
            ],
            "content":"<div class=\"\"><div> <span>You don't know why, but even just that little punch sent shivers down your spine in anticipation. You smiled as him, feeling yourself growing aroused as you followed him into the building.<br>\r\n<br>\r\nDespite how late it was, the place was still fairly busy, though there never seemed to be a time it wasn't busy. Theo started making his way towards the counter to order as your eyes seemed to follow hungrily follow every move he made. You followed him, a slight swagger in your step, your hips swaying seductively. You came up behind him, casually slipping an arm around his shoulders<br>\r\n<br>\r\nYou felt him tense for a minute before relaxing as he smiled at you, turning back to place his order. <br>\r\n<br>\r\nA few minutes later they were sitting at a table, talking about what had been going on in their lives. Despite being the same age and being childhood friends, you hadn't really spent much time together lately. However, as you talked you found it hard to keep from staring at his toned body and handsome face, as thoughts of desire kept filling your head.<br>\r\n<br>\r\nAfter about an hour, Theo stood up, \"Hey, I was wondering if you wanted to come over to my place. There's no one home right now, and I was thinking that it would give us a chance to catch up in private.\"<br>\r\n<br>\r\nYour face went red as his hand brushed your back, almost touching your butt. You looked him in his beautiful brown eyes, wondering what you should do. You'd never been this horny before, and you weren't sure that you'd be able to contain yourself if you were alone with him. However, this was the boy you'd been crushing on for years, but had never been brave enough to tell. Maybe this was your chance.</span></div></div>",
            "created":1528261200,
            "id":2503650,
            "title":"Start flirting with him"
        },
        "132211":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Text him back",
                "Call him",
                "ignore it for now, you have plans with your friends"
            ],
            "content":"<div class=\"\"><div> <span>The rest of the night seemed to pass as a blur. You remember getting in his car and going to his house where he took you to his room, which seemed almost the same as the last time you'd been there a few months ago. Then he had confessed that he had a crush on you, and you'd started making out with him, unable to contain yourself. After that everything became hazy, as your lust had taken over. Though you were fairly certain that you'd done the deed.<br>\r\n<br>\r\nYou lay in your bed, staring at the ceiling. You had no idea what had come over you the night before. You had been so horny, that you didn't think you'd have been able to resist it no matter what you did. However, where did that leave you and Theo? You knew that he had a crush on you now, but things had gone so differently than you'd imagined them going. <br>\r\n<br>\r\nA buzzing sound came from the nightstand beside your bed, causing you to glance at your phone, the screen lit up with a notification. Reaching for it, you hesitate for a moment then look at the notification. Your heart skips a beat, and you find yourself unlocking your phone to read the text from Theo.<br>\r\n<br>\r\n<i>I really enjoyed last night. I hope this doesn't make it weird between us.</i><br>\r\n<br>\r\nYou read the text several times, as you try to think about what to do...</span></div></div>",
            "created":1528261200,
            "id":2503680,
            "title":"Doing it"
        },
        "1322113":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Go Clothes Shopping",
                "Go back to your house",
                "Ditch Maddie and go to Theo's house"
            ],
            "content":"<div class=\"\"><div> <span>You set your phone down on the nightstand, deciding that now isn't the time to respond. You need more time to think about what to say or do. Fortunately, you have plans with your friends to go shopping at the mall in about an hour.<br>\r\n<br>\r\nAs if on queue, your phone buzzes again and you respond that you're still on for going to the mall.<br>\r\n<br>\r\nAbout an hour later you were sitting in the food court with two of your friends. Maddie was a short plump girl though that just seemed to make her look even cuter. The other was a lean girl who kept brushing her long blond hair out of her face, despite it not really being in her face. Though that probably had something to do with the hot guys sitting at a nearby table who couldn't keep their eyes off the bronzed girl. Stacey always seemed to have a way with the guys, however, it usually never ended the way the guys wanted. <br>\r\n<br>\r\nYou had to admit, the guys definitely were hot, and you were definitely feeling aroused. You shake your head, trying to clear your horny desires. You'd just done it with your childhood crush and you were already contemplating doing it with others. There really is something wrong with you, you thought. Though it wasn't like you were technically in a relationship. At least you didn't think that you were.<br>\r\n<br>\r\nHowever, suddenly a wave of nausea washed over you as you found yourself struggling not to hurl. After a few moments, the nausea started to pass and you realized that the boys were gone, along with Stacey. You jumped as a voice came from beside you.<br>\r\n<br>\r\n\"So what do you want to do now?\" Maddie said, looking at you quizzically<br>\r\n<br>\r\nYou sighed and looked around, trying to decide what to do. </span></div></div>",
            "created":1528261200,
            "id":2503703,
            "title":"Friendly Bonding"
        },
        "13221133":{
            "author_id":"malchior",
            "author_name":"Malchior",
            "choices":[
                "Discuss the relationship",
                "Jump right in",
                "This was a mistake"
            ],
            "content":"<div class=\"\"><div> <span>You find your hand starting to creep towards your lower regions, and you find yourself growing more and more horny as you turn to Maddie, \"I actually forgot that I have some things that I need to do. I'll catch you later.\"<br>\r\n<br>\r\nMaddie looked a bit dejected as she replied, \"Ok. I should probably work on my homework too.\"<br>\r\n<br>\r\nAbout a half hour later you found yourself in front of Theo's house, his car was in the driveway, but it seemed like everyone else was still gone. You quickly walked up to the front door and rang the door bell, waiting for him to answer the door.<br>\r\n<br>\r\nJust when you were about to ring the bell again, you could hear the door unlock as it was opened to reveal a groggy looking Theo. <br>\r\n<br>\r\n\"Hey! What you doing here?\" <br>\r\n<br>\r\n\"I, um, I was wondering if we could maybe continue where we left off last night.\" You looked at the ground, wondering how he was going to respond.<br>\r\n<br>\r\n\"Sure. I was hoping that it wasn't a one time thing.\" he stepped aside to let you enter into the nice cool home, \"So do we want to discuss what we are first, or just get right into it?\"</span></div></div>",
            "created":1528261200,
            "id":2503709,
            "title":"Return"
        },
        "14":{
            "author_id":"jawsometeeth",
            "author_name":"Goodvibes",
            "choices":[
                "Examine the statue with the big lower half",
                "Examine the statue with the big face lips",
                "Examine the statue that was very tall",
                "A combination of two",
                "Going to the final floor"
            ],
            "content":"<div class=\"\"><div> <span>          \"Hey, Kat there is something that you might want to see!\" Nathan's voice echoing in the chamber. Kat quickly turned from the three stone carvings and left towards her brother. Meeting with him at the marking on the wall.<br>\r\n<br>\r\n          \"Here, do you see something that looks interesting?\" Nathan looked at Kat intently. Kat looked at her brother and then at the wall. Divided into three panels horizontally, each wall had intricate marking carved into them. Kat couldn't wrap her head around what he was talking about; wait a minute, there's something familiar about the walls. Something that was nagging at Kat in her mind.<br>\r\n<br>\r\n          She suddenly shook herself in exclamation, the very top most panel had an interesting design. A long corridor with seven dots in front of it, said corridor leading to a large, almost block like, room. It was a map, Kat looked at her brother, both of their faces were plastered with grins. They had a map, this wasn't the only room! <br>\r\n<br>\r\n          Kat looked around the chamber and then back to the panels \"If the first panel is a map for here, then i'm guessing the bottom two represent lower floors.\"<br>\r\n<br>\r\n           Quickly scouring the area for an opening, Kat and Nathan spent a fair amount of time trying to find a hidden passage. \" Found it\" exclaimed Nathan, standing by a door that one could easily have missed. Various flora was currently covering it from view. Kat quickly trotted over and both siblings traveled down the stairwell. Their flashlights blaring across the darkness, Kat and Nathan carried onward ignoring everything.<br>\r\n<br>\r\n          Finally at the base of the stairs, Kat and Nathan were in a large room just like the one before. Although, it wasn't as illuminated as the previous one, with the statues on their bases being the only source of light. Wait, why were they illuminated? Kat and Nathan quickly walked over to these three statues<br>\r\n<br>\r\n          One statue was the completely different from the one higher up; it possessed a large lower half and Kat was reminded of a bowling pin. The second Kat mistook as having a large head, but quickly noted it was only converging at the chin area. It had a slit in the area, did it represent lips?Finally, the last statue was bigger than the rest; while most of them could fit in one hand, this one was Kat would have carry under her armpit.</span></div></div>",
            "created":1544899140,
            "id":2589412,
            "title":"A different Statue"
        },
        "141":{
            "author_id":"jawsometeeth",
            "author_name":"Goodvibes",
            "choices":[
                "Kat ignores the feeling of tightnesss.",
                "Kat and Nathan discover a tight entrance, for Kat that is.",
                "Kat goes and sees if she has a larger pair of pants"
            ],
            "content":"<div class=\"\"><div> <span>Kat made her way over to the statue with the large lower half, intrigued by its design. Could it be like those neolithic statues from other sites? Still, its unique shape focusing on the rear was a new one.<br>\r\n<br>\r\n\"That is Indradel, a goddess of endurance and thunder.\" Nathan said, interrupting Kat's thoughts. \"I can clearly see that\" Kat mocked. No doubt referring to the mass located at the statue's base.<br>\r\n<br>\r\nRegaining her momentum, Kat walked ever so closer to the statue.Little by little did Kat notice more details on the statue. Like, for example, the fact that a little indent indicated a thigh gap. Going around the base of it, Kat also noticed that the butt-cheeks of the statue was clearly defined. Which in her opinion was strange, most statues didn't have this much focus on it. Here was an outlier right in front of her however. Almost as if the people who made it wanted a onlooker to know what they meant in the statues construction.<br>\r\n<br>\r\nReaching forward to touch it, Kat felt a shock pulsing through her hand. \"Fuck, that hurt.\"<br>\r\n<br>\r\n\"You okay?\" Nathan questioned, concern showing in his voice.<br>\r\n<br>\r\n\"Yeah..just a terrible buzz\" Kat replied, when suddenly she felt her pants tighten around her. Shifting a little, Kat looked down and noticed how her pants were now covering her lower half.Taking off a button, Kat maneuvered her hips a little. Her legs muscles must've cramped up when she was shocked by whatever that was, right?<br>\r\n</span></div></div>",
            "created":1549565280,
            "id":2614131,
            "title":"Pant Problems"
        }
    },
    "info":{
        "author_id":"malchior",
        "author_name":"Malchior",
        "brief_description":"Kat's brother invites her to explore some ruins that will change her life forever",
        "created":1518206040,
        "description":"<td align=\"left\" class=\"norm\">This story is about Kat, I might add additional characters to follow at another point. The story is fairly simple, After exploring some ruins, Kat begins to have some physical changes, as chosen by you.<br>\r\nSeveral Rules:<br>\r\n1) No male expansion. Period.<br>\r\n<br>\r\n2) No killing of main character(s)<br>\r\n<br>\r\n3)No gender changing of characters<br>\r\n<br>\r\n4)Only add well written chapters. Follow the basic grammar rules you learned in school, and re-read it a couple of times just to be sure you didn't miss anything.<br>\r\n<br>\r\n5)Please only continue the current story arc, and don't jump to random scenes, etc.</td>",
        "id":2148613,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1549910580,
        "modified":1549910580,
        "pretty_title":"Kat's Growing Adventure"
    }
}