{
    "chapters":{
        "1":{
            "author_id":"oruamm",
            "author_name":"Alex",
            "choices":[
                "a jockstrap ",
                "Boxer briefs ",
                "tighty whiteys",
                "a thong "
            ],
            "content":"<div class=\"\"><div> <span>your name is Dan, you’re at Hunters house helping him out with his little dilemma....<br>\r\n<br>\r\n<br>\r\n“I just don’t know what to get him!” said Hunter, “Marcos birthday is literally tomorrow and i have nothing.” . you think about what to say, “well, what does he like?” <br>\r\n<br>\r\nHunter thinks for a minute. “Hm well i’ve only been dating him for a while but i do know he loves video games. He also likes sports! maybe i’ll get him tickets....”.<br>\r\n<br>\r\n“That’s perfect! sounds like you have it all planned out” i said happily. Hunter then starts rummaging through his closet, “You know.... he also needs some new clothes. He’s been talking about how he’s been bulking up and nothing fits him anymore.” <br>\r\n<br>\r\n“If you think that’s what he needs then you should get it! it’s probably better since he can wear it whenever he wants!” i said, “well then let’s not waste time and head out and find him some new outfits!” i turned around to start heading towards the door when suddenly i hear this weird noise.<br>\r\n<br>\r\ni turn around and see this bright light and everything goes blank. I open my eyes and all i can see is the ceiling. “what happened” i said but nothing came out, “huh? why can’t i speak?”. suddenly i see Hunter looking down at me. <br>\r\n<br>\r\n“wow would you look at that it worked!” Hunter gloated “you know Dan when i said he needed new clothes...i really meant he needs some new underwear, and thanks to you now i don’t have to waste my money!”. Hunter then picks me up and holds me infront a mirror. I look into the mirror and see i got turned into.....</span></div></div>",
            "created":1600775280,
            "id":2907997,
            "title":"Help!!"
        },
        "11":{
            "author_id":"farsight07",
            "author_name":"D J Fletcher",
            "choices":[
                "Wrap you up and stick to his plan.",
                "Wear you properly, at least for a while."
            ],
            "content":"<div class=\"\"><div> <span>Looking in the mirror, you see your friend holding up a black leather jockstrap.  You're not sure how you are \"seeing\" anything without eyes, but you can definately see his grin.<br>\r\n\"Damn, Bro. You're kinkier than I expected.\" He laughs, turning you over in his hands, you feeling everything.  \"The spell said everyone turns into 'their true self' or some bullshit.\"<br>\r\nTurning you inside out, he finally finds your mouth.  Currently held closed by a cunning fold in the fabric, which he opens up to see your plump lips raised from the dark leather.<br>\r\n\"Dude, what the fuck, man?!\" You shout.<br>\r\nHe lands on the bed laughing.  \"Oh man, this is better than I thought.  You know where your mouth is, right?\"<br>\r\nYou flex, trying to feel around.  Your leather and elastic body makes tiny movements, but barely noticable.  \"No...\"<br>\r\n\"Let me show you...\"  Lifting his legs, he pulls you on without ceremony, raising his butt to adjust you against his crotch.  Thankfully he kept his shorts on.  \"Is my ball sweat giving you a hint?\"<br>\r\nStanding up, he stood infront of the mirror again.  Posing, showing you how you cupped his junk and lifted his butt cheeks a bit.  Your muffled protests were lost, and worse, you could feel a growth in his shorts.<br>\r\n\"Damn, you fit pretty well.  It's almost a shame to give you away...\"<br>\r\nHunter decides to...</span></div></div>",
            "created":1600892700,
            "id":2908775,
            "title":"a jockstrap "
        },
        "12":{
            "author_id":"oruamm",
            "author_name":"Alex",
            "choices":[
                "Hunter decides to gift you early",
                "He waits till tomorrow "
            ],
            "content":"<div class=\"\"><div> <span>i was in shock, i was turned into white boxer briefs!!!!! “Hunter what’s the meaning of this!” i shouted, but again the words failed to reach his ears. Hunter starts laughing “Ah Dan i can only imagine what’s going through your head right now.... that’s if you can even think!” <br>\r\n<br>\r\nHe sets you down and then looks at the device, “Hmm if i did everything right then i think you should at least be able to have all your 5 senses”. I feel like crying but no tears come out, “why did you do this?” i said only to get no response. Hunter then looks at me again, “Well i’m gonna have to assume you’re wondering why i did this since you cant speak.... i know you’ve been eying my boyfriends ass ever since we started dating. You thought you were so slick but i caught you! and i thought to myself.... if you like looking at it so much maybe you should be up close and personal! so i found this device online and wanted to try it out with you and it worked!”<br>\r\n<br>\r\n“Hunter you’re insane! i can’t believe this...” i thought. He picks me up again and starts folding me,” It’s a shame you can’t speak, i bet you’re thanking me right now for being so generous. and who knows maybe i’ll turn you back to normal but not like anyone’s going to miss you... i’m the only friend you have since you got disowned by your family” <br>\r\n<br>\r\nHe places me in a bag and my vision goes dark. I hear Hunter speak, “You’ll be the best underwear he’ll ever get.... and just so you know this is the last time i will be speaking to you directly because after all who has a conversation with underwear?” he starts laughing, “but i will give you this warning as my last words.... Marco has been grinding really hard at type gym these last days, so expect to be tasting a lot of sweat and protein farts!” <br>\r\n<br>\r\n“oh god... i can’t believe this is happening to me.” i thought myself” i hear Hunters footsteps slowly fade away and i’m left with my own thoughts dreading tomorrow.</span></div></div>",
            "created":1600776480,
            "id":2908006,
            "title":"Boxer briefs "
        },
        "121":{
            "author_id":"oruamm",
            "author_name":"Alex",
            "choices":[
                "Marco continues farting ",
                "Marco heads to bed"
            ],
            "content":"<div class=\"\"><div> <span>what seems to be hours pass by when i hear someone come into the room<br>\r\n<br>\r\n“Hey babe! come into the room i have a little surprise for you!” Hunter said. “oh god please Hunter don’t do this...” i said to myself<br>\r\n<br>\r\ni hear heavier foot steps come in, “What is it?” questioned Marco. Hunter then grabs the bag i was in. everything around me is moving so fast. Hunter hands the bag to Marco. i see a hand reach down for me, he then takes me out the bag and i see him staring down at me.<br>\r\n<br>\r\n“Surprise! i got you some special underwear! i know you’ve been needing some and i thought i should get you one “ Hunter said. “Wow thanks! i think ill change into tonight to sleep in. the ones i have right now are too tight on me..” <br>\r\n<br>\r\n“Well don’t be shy go ahead and change into them!” with that Marco leave the room and goes into the bathroom. He sets me down in the counter and i’m able to see him standing. Slowly he starts to unbuckle his belt and i get a glimpse of his underwear he has on. It was stretch out to its limit with holes in the back! i started to panic when i then saw him take off his boxers. I was amazed! His ass was bigger than what i had thought, and his dick was also pretty impressive but it was nothing compared to his bubble butt.But my excitement was short lived when he picked me up and started putting me on <br>\r\n<br>\r\nOne by one his out his legs in and i got a view of my new life, i look up to see two huge mounds of fresh rapidly getting close and closer. He pulls me up all the way and starts adjusting his bulge. Instantly the smell of sweat and dank farts hit me. If i could i would be gagging right now.  Your Nose seems to be near his ass hole <br>\r\n<br>\r\nMarco check himself out in the mirror. “Hm these fit pretty good. very snug and tight but still comfortable. hopefully i don’t blast a hole in these like all my other underwear...” with that thought he lets out a 5 second fart. All you can do is smell it in disgust.<br>\r\n<br>\r\n“I cant smell a thing!” Marco says. “Maybe this is one of these high quality filter underwear....” <br>\r\nhe starts putting his shorts back on and everything becomes dark again. With every step my “face” gets deeper and deeper into his ass. he begins to sit down and starts stretching me out! “oh god this hurts!” i said <br>\r\n<br>\r\nHunter sits next to Marco and asks “How do you like your new boxers?” <br>\r\n<br>\r\n“They’re great! just ripped a nasty fart in the bathroom and didn’t smell a thing. might have to keep these on for a while to see how well they work” Marco says “this is the best pair i’ve ever had, thanks babe!” <br>\r\n<br>\r\n“Anything for you “ Hunter says, smiling to himself knowing i’m the one filtering his farts <br>\r\n“We should probably head to bed now.” Hunter says <br>\r\n<br>\r\n“ok i’ll be there in a bit, gonna watch some tv for a while” Marco says. With that i hear Hunters get up and start walking away. <br>\r\n<br>\r\n“this is the worst! i have to find a way to get back to normal” my thought was interpreted by another fart. somehow it was worse than the last one.</span></div></div>",
            "created":1600778280,
            "id":2908016,
            "title":"An early gift"
        }
    },
    "info":{
        "author_id":"oruamm",
        "author_name":"Alex",
        "brief_description":"a friend needs a last minute gift, little do you know the gift is you ",
        "created":1600773240,
        "description":"<td align=\"left\" class=\"norm\">Your friend Hunter needs help finding a last minute gift for his boyfriend Marco. Hunter comes to you for help, you try your best to help him when suddenly everything turns for the worse. you black out and wake up as an article of clothing !<br>\r\n<br>\r\nTreat this story as a canvas for your deepest fantasies, whatever they may be. Nothing is too wild, too mild or unheard of. Just no one-liners, kids or GTS. you can add whatever characters you want as long as 18+ and pls try to keep it male on male </td>",
        "id":2232961,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1600892700,
        "modified":1600892700,
        "pretty_title":"unaware wearer "
    }
}