{
    "chapters":{
        "1":{
            "author_id":"falcon",
            "author_name":"Falcon",
            "choices":[
                "Tim",
                "Panthera"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will you be?</span></div></span></div>",
            "created":1421730000,
            "id":1920512,
            "title":"chosing a character"
        },
        "11":{
            "author_id":"blader",
            "author_name":"blader",
            "choices":[
                "I think your parents should hear about your staring\" (wait what?)",
                "I saw you staring, bad students need to be punished\" ",
                "I'd like you to come back to my place\"",
                "She doesn't say anything and just tackles him",
                "Other..."
            ],
            "content":"<div class=\"\"><div> <span>Tim sighed as he walked into his usual place right in the front of the classroom, in fact he was the only one in the front row of the classroom, everyone of his classmates having scattered behind him into their various cliques and groups. His lanky form falling slightly in his seat as he waited for the class to begin 'another year, another boring class' he thought to himself. While Tim wouldn't be one to call himself a geek his classmates were a different matter, his stereotypical horned-rimmed glasses, his place in the class, and his general achievement were just a few pieces of \"evidence\" used against him. This didn't mean that Tim was unpopular, he just wasn't popular with the right people the cheerleaders, jocks...etc. a gentle sigh escaped his lips before a sound reached his ears \"clack, clack, clack\" it sounded like something plastic tapping on the tiled hall of the school and it was rapidly getting closer. Suddenly the door of the room burst open and in strode the strangest sight Tim had ever laid eyes on. He rapidly sat up to get a better view of the woman who now stood at the head of the classroom.<br>\r\n<br>\r\nWhile Tim was no slouch at 5ft 8 inches tall, the woman in front of him towered over him by an entire foot if not more. His eyes slowly traced up her body, her feet covered in black heels were the obvious source of the clicking sound that had first alerted him to her presence. As his eyes traveled up her long luxurious legs they fell upon her red skirt, the closed business-styled attire fighting to contain the woman's wide hips. Yet as his eyes drew higher up her body Tim realized her lower her ass wasn't the only thing that needed to be contained. While he had heard of women's breasts compared to watermelon's before this was the first time he had ever seen any pair that came close to the comparison. The woman's suit top straining to contain the firm bountiful orbs, a large line of cleavage clearly showing due to their sheer size alone. What was most interesting about this woman besides her figure were the more...pronounced features of her physiology. Every inch of her was covered in thick silken black fur, from the triangle-shaped ears on top of her head down to her clawed toes. A thick foot long tail swayed lazily behind her, amber eyes staring over her open-rimmed silver spectacles as a domineering grin adorned her muzzle as she sized up the class.<br>\r\n<br>\r\nTim stared wide eyed at the goddess of a woman in front of him, to his surprise no one else seemed to find her appearance strange, and then her gaze fell upon him, their eyes meeting for a moment as a jolt of electricity made its way though his body. Smiling the panther goddess disguised as his teacher turned and grabbing a marker began to write on the white board. <br>\r\n<br>\r\n\"Hello class, my name is Ms. Liara Panthera\" she said turning to face the class, her voice smooth and seductive as her body hung over the desk revealing her beautiful breasts. \"I'm going to be your history teacher for the rest of the year, so hopefully we'll be able to get along, and by the end of the year we'll hopefully all have learned something, oh and just because my history class is the end of the day don't think you can slack. As for things to know...short of parking a nice red Ferrari in my driveway I can't be bribed, however I love sweet things and they are \"appreciated\", oh and don't worry I might look like a predator but I won't eat anyone\" she said, that dominant grin returning to her face. There were a few nervous chuckles across the room including from Tim. <br>\r\n<br>\r\n\"Now, class let's begin with today's lesson...\" The lesson continued on and Tim couldn't help but take a few chances during the lesson to \"admire\" his teacher's form despite how wrong he knew it was. He swear that she caught him staring at her ass as she bent over to get a marker, and again when she was leaning forward on her desk emphasizing her breasts and cleavage as she was describing some historical event, but she never reacted to it. Finally the lesson came to a close as the final bell of the day rang and everyone started to get up and head home. \"I want everyone to read chapter 1 by next class, there might be an in class quiz...oh and Mr. Everett, I'd like you to stay behind for a few minutes.\" The rest of the class giggled as Tim hung back waiting for everyone to leave. Ms. Panthera sat at her desk and waited for several minutes like she was waiting to make sure everyone had gone home. She slowly sauntered over to the door before shutting it and after producing a key from between her breasts locked it. \"Now Mr.Everett...</span></div></div>",
            "created":1422162000,
            "id":1923277,
            "title":"Tim"
        },
        "111":{
            "author_id":"gigastar",
            "author_name":"Gigastar",
            "choices":[
                "Ms. Panthera appeared in disguise at my home later that afternoon.",
                "I received an email from Ms. Panthera with instructions about meeting up.",
                "Ms. Panthera appeared in my room in the middle of the night!"
            ],
            "content":"<div class=\"\"><div> <span>(Note: the intro asked to keep things in first-person perspective so that's how I'm writing.)<br>\r\n<br>\r\n\"Now, Mr. Everett,\" Ms. Panthera began as she turned back to face me, \"I couldn't help but notice that you were staring at me during class today. Is this something your parents need to hear about?\"<br>\r\n<br>\r\nI gulped. It looked like I was caught in the act! The cat had my tongue, so to speak; I couldn't think of anything to say as she looked me down.<br>\r\n<br>\r\n\"Well, Mr. Everett,\" she continued, \"do you have anything to say for yourself?\"<br>\r\n<br>\r\nI figured that I had better say something. I tried to come up with a reason to make it sound like I wasn't just leering at her voluptuous body.<br>\r\n<br>\r\n\"I'm sorry Ms. Panthera,\" I said. \"I've just never seen a panther woman before?\"<br>\r\n<br>\r\n\"Panther wo...\" Ms. Panthera said as she brought her hand to her face and then to the diamond-studded collar around her neck. \"Oh, dear, the owl woman who sold this to me did say that 99.99999999999% of humans would fall for my disguise. It looks like you're the 0.00000000001% who wouldn't, Mr. Everett.\" <br>\r\n<br>\r\n\"Come again?\" I asked.<br>\r\n<br>\r\n\"I should explain,\" Ms. Panthera said as she walked back over to her desk and sat down on it. \"As you've clearly seen, I'm not a human. I'm not even native to your dimension. I'm from a parallel universe populated with anthropomorphic animals. We've mastered magic and inter-dimensional travel, and I thought that I might use those things to my advantage to make a dream of mine come true: teaching history.\"<br>\r\n<br>\r\n\"Oh, well, couldn't you have done that in your own dimension?\" I asked.<br>\r\n<br>\r\n\"Of course I could have,\" Ms. Panthera answered, \"but I thought it might be easier to be one here. Anthro children can be such animals sometimes.\"<br>\r\n<br>\r\n\"I can imagine,\" I said while trying to stifle a chuckle.<br>\r\n<br>\r\n\"I've managed to forge documents of my identity and learn about your world's history; all so I could follow thought with my dream. This magical collar is what allowed me to do it; I can use it to conjure clothes and make myself appear as I wish to humans. Well, most humans, anyway,\" she sighed. \"I thought the odds that the one person who could see through the ring's illusion would be one of my students were so astronomically low as to be insignificant, but that it happened on my first day? Ugh! And now I'm sure you're going to tell people about my secret as well and I'll have to go away. So much for my new career. I'm actually starting to wish you were just leering at my body.\"<br>\r\n<br>\r\n\"Well, I was,\" I sheepishly admitted.<br>\r\n<br>\r\n\"Oh, really?\" Ms. Panthera said as one of her eyes raised, which reminded me that I just admitted to lusting after a woman who could probably disembowel me with her claws if she was so inclined.<br>\r\n<br>\r\n\"NOT GOING TO TELL!\" I immediately blurted out. \"I WAS NOT GOING TO TELL!\"<br>\r\n<br>\r\n\"Ha ha ha,\" Ms. Panthera laughed. \"It's okay, Tim. I wasn't actually planning on contacting your parents. The fact is I find you attractive as well.\"<br>\r\n<br>\r\n\"Uh, really?\"<br>\r\n<br>\r\n\"Yes, I have a bit of a thing for awkward nerd boys,\" my teacher said while eyeing me up and down. I'm sure she could see my face turning red at her words and I was grateful that I had my desk in front of me to conceal the swelling that was going on in my pants.<br>\r\n<br>\r\n\"Tim, I have a proposal for you,\" she said as she hopped off her desk. \"If you're really willing to keep my secret, I can make it worth your while.\"<br>\r\n<br>\r\nWorth my while? What did she mean? Was she saying what I think she was saying? I thought that I better make sure that was what she was talking about.<br>\r\n<br>\r\n\"Ms. Panthera, I'm actually a good student,\" I nervously stated. \"I don't need you to fix my grades for me.\"<br>\r\n<br>\r\n\"Ha, not what I meant,\" she laughed as she walked to my desk and leaned over me, giving me a close-up of her ample assets. \"What I'm proposing is we could get to know each other, outside of the classroom.\"<br>\r\n<br>\r\nAgain, I was really glad that desk was there when Ms. Panthera confirmed my suspicions.<br>\r\n<br>\r\n\"Ms. Panthera, do you mean...?\"<br>\r\n<br>\r\n\"Now, I know that a student/teacher relationship is highly unethical, not to mention illegal given your age, Tim,\" Ms. Panthera explained. \"But on the other hand, screw that. With this collar, I can appear to be your dorky teenage girlfriend or something when we're together in public, and I can also always take you back to my dimension where nobody will ask us any questions.<br>\r\n<br>\r\n\"If you will keep my secret, I'm sure we'll have lots of fun together. What do you say, Tim?\" the panther asked, adding a wink as she said my name.<br>\r\n<br>\r\nTruth be told, I would have kept Ms. Panthera's secret anyway. I was perfectly happy to fantasize about this woman and having her around would have made that a lot easier. But now that she was offering to make those fantasies a reality?<br>\r\n<br>\r\n\"Yes! Your secret is safe with me, Ms. Panthera!\"<br>\r\n<br>\r\n\"Excellent,\" Ms. Panthera said as she pulled back from me and reached for the key she deposited in her bosom earlier. \"I'm glad we had this discussion.\"<br>\r\n<br>\r\n\"Wait, aren't we supposed to do something now?\" I asked as she walked back over to the door to unlock it.<br>\r\n<br>\r\n\"You have a lot to learn about keeping things on the down low,\" she said as she began to unlock the door. \"Don't you have parents at home waiting for you to return? They'll get suspicious if you don't show up soon enough.\"<br>\r\n<br>\r\n\"Oh, right,\" I said, embarrassed that I didn't even consider that. I began to gather my things to leave.<br>\r\n<br>\r\n\"There'll be time to do something later,\" Ms. Panthera reassured me. \"In fact, you can look forward to hearing from me later, Tim.\"<br>\r\n<br>\r\n\"Thank you, Ms. Panthera,\" I said as I walked over to the door.<br>\r\n<br>\r\n\"You can call me, 'Liara' if you like,\" she said as I approached her. \"When we're alone anyway.\"<br>\r\n<br>\r\nI look outside the door into the hallway and I see a few teachers walking around.<br>\r\n<br>\r\n\"I'll see you later, Ms. Panthera,\" I say, not wanting to draw suspicion.<br>\r\n<br>\r\n\"You can call me that if you want, too,\" she whispers.<br>\r\n<br>\r\nI nod and walk away, using my book bag to conceal my erection from the passers-by.<br>\r\n<br>\r\n---------------------------------------------------------------<br>\r\n<br>\r\nLater...</span></div></div>",
            "created":1427950800,
            "id":1957695,
            "title":"Busted and Counter-Busted"
        },
        "1111":{
            "author_id":"thecanadian",
            "author_name":"Canadian",
            "choices":[
                "A family member",
                "Herself!",
                "Someone else!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hours later you're sitting in your bedroom at home, you hear the door knock and tell whoever it is to come in.<br>\r\n<br>\r\nMs. Panthera comes in looking like...</span></div></span></div>",
            "created":1431234000,
            "id":1975973,
            "title":"Ms. Panthera appeared in disguise at my home la..."
        },
        "11111":{
            "author_id":"thecanadian",
            "author_name":"Canadian",
            "choices":[
                "Human (mother, sister...)",
                "Pet (Cat or Dog)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But what kind of family member?</span></div></span></div>",
            "created":1437973200,
            "id":2012971,
            "title":"A family member"
        },
        "111111":{
            "author_id":"thecanadian",
            "author_name":"Canadian",
            "choices":[
                "Your loving mother.",
                "Your sultrily sister!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which human family member?</span></div></span></div>",
            "created":1437973200,
            "id":2012972,
            "title":"Human (mother, sister...)"
        },
        "111112":{
            "author_id":"jobobo19",
            "author_name":"carl.a.pruuitt",
            "choices":[
                "cute cat",
                "playful dog"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which one? your cute cat or your playful dog?</span></div></span></div>",
            "created":1452748920,
            "id":2088988,
            "title":"Pet (Cat or Dog)"
        },
        "113":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "Make you her lover",
                "Make you do chores",
                "Something else in mind"
            ],
            "content":"<div class=\"\"><div> <span>Ms. Panthera Stood before you and gave you a pretty good sign that she noticed you oogling her, or maybe even more. She approached you and from her breast pocket she pulled out what looked like a bussiness card and placed it in front of you. You picked up the still warm piece of paper. All there was on it was an adress.<br>\r\n<br>\r\n\"I'll be waiting for you around 6, don't be late. Oh, and if your parents ask, tell them it's a \"school assignment.\" she said and walekd away, quite intentionally swaying her hips and tails directly at you.<br>\r\n<br>\r\nLater that day you arrive at the adress. It looks pretty much, like any, although maybe a bit larger, suburbian house. You don't see anyone around, altough you're guessing that this is a \"furry\" part of town. It's a bit of a shame, cause you rerely see them in your neighbourhood.<br>\r\n<br>\r\nYou peak through the window, looking into the living room. You can see Ms. Panthera bending over cleaning the floor. You get a good look at her voluptuous figure. Her blue dress hugged every curve. Her thigh high boots seduce your gaze up her legs to her swaying hips with only her tail being the slightest of obstructions. Her black hair draped gracefully over her shoulders. You feel a bulge begin to form in your trousers. Time to go inside.<br>\r\n<br>\r\nYou knock on the door. Within moments the door swung open. Ms. Panthera has a wide grin on her face. Thanks to her high heels she stands head and shoulders above you. “You’re finally here!” she exclaims, reaching both arms around you and pulling you in for a hug. Before you can respond your face is engulfed in her chest. The low cut dress pushes her cleavage against your lips. She loosens her grip and you pull away slightly.<br>\r\n<br>\r\n“Come inside” she says, grabbing your wrist and pulling you into the house. Inside it looks a bit more luxurious than you might expect. Ms. Panthera is tanding right next to you, still holding her palm on you shoulder, your face inches away from her humongous and barely covered breasts.<br>\r\n<br>\r\n\"I have a small assignment for you.\" she said, almosr purring through her white teethy grin. <br>\r\n</span></div></div>",
            "created":1429506000,
            "id":1967321,
            "title":"I'd like you to come back to my place\""
        },
        "1133":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "Make you her guest",
                "Meet some of my friends",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What else could she have in mind?</span></div></span></div>",
            "created":1429506000,
            "id":1967322,
            "title":"Something else in mind"
        },
        "11333":{
            "author_id":"blacksmith121",
            "author_name":"Blacksmith",
            "choices":[
                "I can't remember",
                "Would you date an Anthro"
            ],
            "content":"<div class=\"\"><div> <span>\"Tell me what you think of Anthropomorphics in human society\", she asks. <br>\r\n\"What\", I questioned. <br>\r\nShe removes her hand from my shoulder and walks over to her couch, beckoning me to sit next to her. It's hard to resist her invitation. \"Only recently were selected Anthros like me allowed to be admitted into human society, and never was one allowed a job as a teacher until me. I want to know, what do you think of my being in human society\", she asks placing a hand on my thigh. The warmth and pressure of her hand feels good on my leg, even the tiny claws inching out of her fingers as she grips. <br>\r\nI think for a moment, \"Well, I've never really thought about it much\", I say. She inches closer and I use all of my self control not to look down at the cleavage beneath the open top of her white button up blouse. \"I grew up knowing they existed, unlike my parents, but I never understood why. I mean, Anthros are just as smart as humans, I thought, and have never really been violent to humans. I think it's great that some of them are finally coming to our society\", I say. <br>\r\nMs. Panthera smiles happily at hearing this. Her toothy grin is oddly not unsettling, even though it is very catlike. \"I'm glad you feel that way\", she says with her eyes looking down nervously. <br>\r\n\"And if your wondering, I know I'm not alone in thinking like that. Most everyone I know feels that way, too\", I say. <br>\r\n\"That's nice to hear, but I was more interested in knowing how you felt about it\", she says as she gets up from the couch and walks over to her kitchen. <br>\r\n\"What do you mean\", I ask. <br>\r\nThe panther woman smiles as she walks behind her counter, \"Well...I was curious\", she says cautiously. \"You seemed like you would be someone welcoming to new things.\" <br>\r\nI think for a moment about what she said, unsure what she means by that. Is she trying to divert the conversation? I get up from the couch and walk a bit closer to the counter between me and her. \"Why were Anthros kept out of human society for so long, Ms. Panthera?\"<br>\r\n\"Oh, well if you must know\", she says as she reaches up above her to get something out of a tall cabinet. She is still facing me so I get an unbelievable view of her thrusting her chest out at me in that thin white blouse. The fabric stretches on her breasts to the point of tearing. \"I believe the main concern was actually interbreeding between the species, but no one had the gall to say it out loud so they finally began trickling us in.\" She brings down a glass from the cabinet and looks back at me, \"Something wrong, your face is awfully red?\"<br>\r\nIt's at this moment I realize how flushed my cheeks are after staring at my teacher's amazing rack. Despite being covered in fur, they're spectacular. \"Oh, no just a little warm I guess.\" I laugh nervously trying to play off my arousal. She shrugs and turns towards her fridge behind her. \"So why is it you asked me to come here, it wasn't just to ask me questions I'm guessing?\"<br>\r\nShe opens up her fridge and bends down to grab something on the bottom shelf. Her tail sticks up in the air and her heart shaped rear sways side to side. Her skirt can barely contain her. \"Well, I suppose it was to just ask you a few questions and a few other things\", she says. She walks back over to the counter with a soda in hand, 'Care for one\", she asks me. <br>\r\n\"Uh...sure\", I say. <br>\r\nShe reaches back up into the cupboard to retrieve another glass, \"Well, Mr. Everett, I wonder would you ever consider an Anthro as a...potential partner\", she asks. As she speaks her blouse stretches once again. She inhales and the meager fabric is stretched beyond it's limit. A single button is suddenly launched off of her shirt and flies straight at me. It impacts right between my eyes and with enough force that I stumble. She gasps suddenly, \"Tim, are you alright\", she asks as she runs around the counter over to me. <br>\r\n\"Yeah, I'm fine, I'm alright\", I say. <br>\r\nShe examines the bruise left by her buttons impact, \"I'm so sorry.\" <br>\r\n\"Don't worry, it's alright. I guess that blouse was a little too small\", I say gesturing towards Ms. Panthera's bust. <br>\r\n\"Oh\", she chuckles. \"The shirt fits, but I can never find them big enough around my...chest area\", she says carefully. Due to her height and the particular button that flew off, I now have a perfect window into her cleavage just above her undershirt beneath her blouse. Her beautiful, silky black coat shines along her breasts as they jiggle while she examines the gap in her blouse. She turns away, \"Well, I might as well get rid of this thing. You don't mind do you\", she asks as she unbuttons it. <br>\r\n\"Uh...\", I stammer, \"Not at all. Your house, your rules\", I say. She chuckles and unbuttons her shirt. Ms. Panthera removes the blouse from her shoulders and is now clad in her thin undershirt and skirt. The thin white straps of her tank top undershirt are a stark contrast to the shiny black fur of her shoulders. <br>\r\n\"Well, looks I'll need to sew on another button\", she sighs as she tosses the shirt on a nearby chair. <br>\r\n\"Maybe a stiffer bra or something could help\", I suggest. <br>\r\nShe chuckles, \"Well, if you must know, I don't wear bras\", she says. I give a surprised look, given the perkiness and firmness of her bust it seemed she did. \"I always found the clasps to pull on my fur.\"<br>\r\n\"Oh...I see\", I say awkwardly. <br>\r\nShe kicks off her high heels, \"Oh, I was getting you a drink where are my manners\", she says.<br>\r\nShe walks back over to the fridge and bends over once more, giving you a splendid view of her backside. \"So, what was it you were asking me before\", I ask. <br>\r\nShe turns back around. \"Oh-\"</span></div></div>",
            "created":1479788100,
            "id":2240257,
            "title":"Something else"
        },
        "113331":{
            "author_id":"blacksmith121",
            "author_name":"Blacksmith",
            "choices":[
                "The next day in class",
                "You try to call her"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh, I....can't remember now\", she says as she walks to the counter and pours the soda into the glass. She's talking odd, as if she's trying to change the subject of conversation. \"So...have you ever met Anthros besides me\", Ms. Panthera asks.<br>\r\nShe hands me my glass and stares at me with those deep emerald eyes, they're catlike yet still human in some way. \"Uh...no, not before you\", I manage to say and tear my gaze away from her face. <br>\r\n\"Oh, well is there anything you'd like to ask me then\", she asks. <br>\r\n\"Uh, where are you from\", I ask her. <br>\r\nShe smiles, \"My family is originally from the Congo, but moved to this country when I was very little\", she says. <br>\r\n\"Oh, okay\", I agree. Both of us are getting a little flustered. This is obviously not where the conversation was meant to be going. We're starting to get awkward silences and giving each other uncomfortable stares. I can't imagine why she would have me meet her at her home just to ask me what I thought about Anthros in society. \"Is there anything you needed me to do with you tonight\", I finally ask. <br>\r\n\"Oh, um, yes there was something\", she says and turns around very quickly. Her long tail whirls around and smacks me like a whip in the cheek. She doesn't seem to realize. \"What was it now\", she thinks. <br>\r\nThere's another awkward silence, \"What was it you were going to ask me there, before...you know?\"<br>\r\n\"Oh, don't worry about that\", the panther woman says and sits down on the couch stiffly. Since I'm standing and she's looking away I can't help but look down at the cleavage she bears in her low cut undershirt, with her black fur shining in the low light of her living room. <br>\r\nFinally, I just take a chance. I know what I heard, but I've got to word this right or it's going to come out really weird and pervy. \"I'm thrilled the uh...government is letting Anthros work with humans more. I had always seen pictures of them and heard about them and wanted to meet them in person one day. For the sake of honesty, I ...a lot of my friends think the women are absolutely gorgeous\", I say almost slipping up. <br>\r\nShe looks up interested, \"Really, they do\", she asks. <br>\r\n\"Oh, yeah. I can see why, I haven't seen a single Anthro woman that wasn't\", I say and immediately regret it. \"That came out wrong.\"<br>\r\nShe laughs awkwardly, \"That's alright...I was actually wanting to ask because a friend of mine\", she says carefully, \"Was wanting to know how humans felt about dating Anthros. She was just too nervous to ask one.\"<br>\r\n\"Oh, yeah\", I think I'm getting this, \"My friends at school are always saying how they'd love it if a hot Anthro girl came to school one day, especially Josh. He never shuts up about it.\" <br>\r\n\"Oh, good I'll be sure to let her know then\", Ms. Panthera says jumping up from her couch.  <br>\r\nA short awkward silence sets in and I have nothing else to say in order to keep the conversation going. I try to think for a few seconds and stupidly come up with, \"Well, I guess it's getting late. My parents will be wanting me home.\" <br>\r\n\"Of course, yes\", she says a little deflated. \"Oh, one more thing\", she turns around and bends over to reach the table beside her couch. Once again her long tail whips me across the cheek and she doesn't notice. I stare at her shapely rear as it is barely contained within the tight confines of her blue skirt. It rocks side to side as she does whatever it is she's doing. \"This is in case you ever need help in history class\", she turns back around and her tail smacks me a third time. She hands me a small piece of paper, \"Or in case you might find a good guy for my friend she's high school aged\", she chuckles. \"It's my personal cellphone so don't be giving that number away.\" <br>\r\n\"Oh course, I always had trouble in history. Thank you so much, Ms. Panthera\", I lied. I love history, it was always my best subject, but with this opportunity I might have to do something about that. \"Well, I guess I have to get going. I'll see you in class tomorrow\", I say. She nods and smiles. I walk over to the door and open it sadly. Stepping out into the night I wave to my sexy Anthro history teacher and walk towards my car. She waves goodbye and shuts the door. As I sit down in my car I sit in silence thinking, <i>\"Was she hitting on me?\"</i> I sit thinking for a moment until I grasp my wheel in anger and thrash myself about. \"What is wrong with you, you idiot?!\" I stare at myself in the mirror, \"You had a chance you had a chance and you blew it!! You're killing me\", I scream. Reluctantly I start the car and pull away from Ms. Panthera's house. <br>\r\n<br>\r\nInside, the panther woman watches Tim leave. Once he pull onto the road and is off she steps away from the window and walks over to the wall. She forcefully smacks her forehead into the wall of her house multiple times, \"Damn it, Liara what is wrong with you\", she asks herself. \"You could have just asked him and he wouldn't have told a soul. He was hot for you. You saw him staring at your boobs the whole time. Damn it, why wouldn't he try anything\", she rants. She goes over to her bedroom and flops onto her fluffy bedspread, \"My 'friend', that was the best I could come up with?\" She rolls on her bed, \"Why do young humans have to look like adult Leos?\" </span></div></div>",
            "created":1479873720,
            "id":2240727,
            "title":"I can't remember"
        },
        "1133311":{
            "author_id":"blacksmith121",
            "author_name":"Blacksmith",
            "choices":[
                "\"TIm, wait\"",
                "Reader choice"
            ],
            "content":"<div class=\"\"><div> <span>I sit in my desk at school the next day, bored as ever. I don't have any of my friends in this class, so I find the class itself more interesting than the people around me. That is, except for one person in this class I am interested in. Suddenly the door of the loud classroom opens up and in walks the voluptuous figure of my history teacher, Ms. Panthera. The same gorgeous panther woman that invited me to her home the night before and gave me her number. \"Sorry, I'm a little late class\", she says. Most of the class quiets down, especially the boys. Quickly, she scans the room. Her emerald eyes meet mine and she stares at me for a brief moment before she pulls her eyes away. No one else takes notice. \"Well, I guess we can begin\", she says and begins her lecture. I don't really care what it is about. I don't pay a single bit of attention to the history class she's giving as I'm way too focused on the curves of her body. She's wearing a dark red skirt that hugs the shape of her hips and dark colored button up blouse underneath an open jacket. I can tell why she's wearing a dark shirt. It's less noticeable against her dark fur, but she has the first few buttons undone on her blouse to alleviate the stress on her buttons. From the events of last night I know why. She turns and writes on the whiteboard and I can't help but stare at her perfect derriere as it shakes while she writes. It doesn't help that her tail swishes back and forth and draws attention to her. Suddenly I'm pulled out of the hypnosis her tail has put me in by a question, \"Tim, what about you?'<br>\r\nCrap, I have no idea what she's asking me. I need a word any word, \"What was the question, ma'am?\" Thank you, brain, thank you. <br>\r\n\"Mercenaries paid by the British, who were they\", she asks. <br>\r\n\"Hessians\", I answer quickly. I narrowly escaped that one. I had better keep some level of focus in this class. Most of the hour goes without incident and eventually the bell rings and everyone scrambles to get out. As it is the last class of the day, no one takes their time except for me. I put my textbooks away at a snails pace so that I'm intentionally the final person in the room, and am left alone with Ms. Panthera. The last student leaves and the door finally swings itself shut. The classroom is empty except for the two of us. I look over to the beautiful panther woman sitting at her desk in the classroom. With my heart racing I walk up to her desk and smile, \"Hey, Ms. Panthera.\" <br>\r\n\"Tim, how are you doing\", she says with her catlike grin. <br>\r\n\"I uh got you something\", I said. <br>\r\n\"Oh, what is it?\"<br>\r\nI dig into my pocket and hold out a small handful. She takes it in her soft palm and laughs. \"Buttons, thread, and safety pins.\" <br>\r\n\"I thought it might help with...you know. I saw you had to leave a few unbuttoned today\", I say referring to her blouse. <br>\r\n\"Oh, you noticed\", she says and grasps either lip of her blouse holding them up and out. I stare at her cleavage as her breasts bounce when she pulls on her shirt. \"I figured this was better than risking a button fly off. You're so thoughtful\", she looks back up to me and I tear my gaze away from her hypnotic breasts. <br>\r\nShe stares up at me with her big green eyes and toothy smile. I had a plan and I have to stick to it at this point. \"So I was meaning to ask you a question\", I say. <br>\r\n\"What's that?\"<br>\r\n\"Your friend, you mentioned she wanted to know if humans wanted to date Anthros. I was wondering if maybe she would want to meet me\", I barely muster to drool out those last few words. <br>\r\n\"Oh, really\", she says with a sudden change in her voice. <br>\r\n\"I mean, I'm single and would love to get the chance to meet someone new\", I say trying to sell it. <br>\r\n\"I-I'll be sure to let her know\", she says. <br>\r\n\"Great...should I call you later tonight or I can give you my number to give to her\", I say. <br>\r\n\"Um...you can leave me your number\", she says. <br>\r\n\"I'll text you, so that you'll have it\", I say.<br>\r\n\"Excellent\", she smiles. It's a forced smile, even I can tell that. With nothing else to say I simply say my goodbye and walk towards the door with a tent in my pants. </span></div></div>",
            "created":1480048320,
            "id":2241498,
            "title":"The next day in class"
        },
        "11333111":{
            "author_id":"blacksmith121",
            "author_name":"Blacksmith",
            "choices":[
                "Picking up Liara",
                "Liara comes up with other plans"
            ],
            "content":"<div class=\"\"><div> <span>\"Tim, wait\", I hear behind me. I turn back around and see Ms. Panthera stand from her desk and walk towards me with her heels clicking on the tile. Her hips sway to either side as does her tail and her breasts ever so slightly bounce with her steps. She stares at the ground and fumbles with her hands as she walks which gives me free reign to look her up and down. She gets a few feet from me and stops still looking at the ground and holding her hands together, \"I don't have a friend that was looking to find someone\", she says. \"I don't want you to be waiting for me to tell you about someone, I feel that's cruel.\" She pauses for a moment and looks back at me with her piercing eyes. \"I didn't ask you about how you felt about Anthros because of a friend wanted to date a guy. I was just too nervous to ask if you wanted to date me\", she says barely managing to get the words out. <br>\r\nI stand there at a complete loss for words. The hands down sexiest creature to ever walk the earth just asked me out, and she's my teacher on top of that. She actually looks nervous standing in front of me. I can hardly breathe, let alone hear my thoughts over the sound of my heart that is either beating so fast I can no longer distinguish the noise or has stopped entirely. Either way, I force myself to speak. \"Yes\", I is all I can come up with. <br>\r\n\"Huh\", she looks at me puzzled. <br>\r\nOnce again I'm forced to make my brain work when all the blood is elsewhere in my body. \"I want to date you.\" She goes from nervous to happy as a smile starts to spread across her cheeks. \"I would want nothing more than to go out with you.\" She smiles and turns away sharply. I feel her tail smack me across the cheek but shrug it off. She walks back to her desk and I unintentionally follow her swaying backside. <br>\r\nShe turns back to me with an ear to ear grin and I smile back. She giggles and sits down against her desk, bringing her face down to my height. She looks back at me again and laughs. This time crossing her legs when she looks away. I can't help but stare at the shiny black coat of her thighs. \"I feel like I'm an adolescent cub again\", she says. <br>\r\n\"Why's that\", I ask stepping closer. <br>\r\n\"One of the goals I had was to go out with a human\", she says staring at the ground, \"I didn't think I would be so nervous.\" <br>\r\n\"A goal I always had was to go out with an Anthro girl, especially one that looked like you\", I say. \"I didn't have the nerve to make a move at your house, otherwise I would have tried.\" <br>\r\n\"I didn't have the nerve either\", she says, \"But I doubt I would have stopped you.\" Not missing I chance again, I take this as a hint in the empty class room and rush up to her while she isn't looking at me. I plant a kiss on the panther woman's lips before she has a chance to speak again. She instinctively puckers for the brief moment but when I pull away she is looking at me with nothing but surprise in her massive green eyes. A few blinks and her surprised expression slowly starts to fade. I feel her hands on my back and she pulls me in towards her and closes her eyes. I close mine and wrap my arms around her, sliding my hands beneath her jacket and feeling the smoothness of her back through her blouse, no bra strap. Those big melons press against my chest and I instinctively pull the panther woman in tighter so I can feel the soft masses mash into me. Ms. Panthera stands from her desk but keeps me held tight to her. She's probably half a foot taller than me naturally, so with her heels my face is in her chest. I don't slow down at all and simply hold my breath and hug her tight. I bury my face in the exposed cleavage of her blouse and feel the soft flesh of her breasts covered by the smooth coolness of her fur mashed on either side of my face as I push her back against the wall. She breathes deep and wraps her arms around me, pushing her soft bust up and around my face to the point my ears are covered and I can hear nothing but the sound of her heartbeat. She releases my head from her bosom and allows me to breath once again. My lips are met with hers, which are surprisingly soft and fleshy for having a catlike mouth, and we stay locked for a few more seconds with her rough tongue invading my mouth and mine feeling around inside hers. Suddenly I feel her push me away and we stand there panting for a moment. \"Oh, that got out of hand.\"<br>\r\nI take the hint and don't try to advance on her again, \"Wow, you're amazing\", I say. She looks back at me with a smile and winks. \"So...uh\"<br>\r\nShe places her finger on my mouth, \"We'll have time later. This isn't the place\", she says almost sadly.<br>\r\n\"Well, in that case\", I say, \"Would you like to go on a date?\" <br>\r\nShe smiles, \"I thought you'd never ask\", she says sensually. She lays her hand on my chest and stands close to me, thrusting her chest out. \"We'll have dinner tonight. You can pick me up at seven, I think you know my address\", she coos, \"It'll have to be somewhere out of town, I'm still your teacher. Once we're done though, you can stay the night at my place\", she suggests. <br>\r\n\"Sounds good to me\", I say already fantasizing. \"I can't wait.\" <br>\r\nMs. Panthera cups my chin and leans down to me. She gives me a single sensual kiss and my hands naturally float up to her waist. \"Neither can I\", she purrs, \"And call me Liara outside of class.\" <br>\r\nI break from my hypnosis and step back from the panther goddess. \"See you tonight\", I manage to say. <br>\r\n\"See you then\", she waves goodbye. <br>\r\n</span></div></div>",
            "created":1480053000,
            "id":2241530,
            "title":"Best history class ever"
        },
        "113331111":{
            "author_id":"blacksmith121",
            "author_name":"Blacksmith",
            "choices":[
                "An unexpected friend of Liara's shows up",
                "A romantic evening unfolds"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh my God, oh my God, oh my God\", I keep saying to myself as I drive down the road. I have a date with the goddess of my wildest dreams. I went home and got ready as fast as I could and simply waited for the time to leave. Thank God it's Friday. I pull around the corner and enter the small housing development that Ms. Panthera lives in. A few turns later and I reach her house. It's a simple suburban home on the outside, but I already know how different it looks on the inside with the distinct African accents, exactly what one would expect from a woman who said her family was from the Congo. I pull into her driveway and take a deep breath to try and calm my racing heart. I hope I look appropriate for what she had planned. She said she would pick the place but nothing after. I only put on my best pair of jeans and a collared dress shirt, nothing fancy but I know from past experience I look good in it. I still have to keep smacking myself to remind me this is real and not some wild fantasy. I also have to tread carefully not to mess this up. Kissing her was a leap of faith, but I'm glad I took it in the end. I still feel proud and turned on as hell that I got to make out with my sexy Anthro teacher. <br>\r\nApparently, I was waiting longer than I expected as I see her front door open. Ms. Panthera walks out of her home and towards my car. She's wearing a pair of tight, form fitting jeans or possibly leggings by how snug they are on her hips and a revealing, cleavage bearing white tank underneath an open red jacket. She locks the door behind her and deposits the key into the purse on her shoulder. She walks up to the car and I barely manage to remember to unlock the door as I am so distracted by the way her hips sway and her breasts bounce. She opens up the door of my car and sits down in the passenger seat. \"Right on time\", she says. <br>\r\n\"How could I not be, Liara\", I say clearing my throat. <br>\r\nShe chuckles, \"I like that much better than Ms. Panthera.\" <br>\r\n\"I would've walked up to the door and met you\", I begin. <br>\r\n\"Don't worry about it\", Ms. Panthera says. \"It's a mess inside anyway.\" <br>\r\nShe doesn't realize that I power cleaned my car before I left today. \"So, where to?\"<br>\r\n\"Oh, of course. Ever heard of Furtown, it's a little out of the way but they have a great restaurant up there\", she says. <br>\r\n\"Yeah, I've heard of it\", I say not informing her of the fact that I have researched that town to an unbelievable extent because of the sexy Anthros I know live there. \"That's a good hour away, isn't it?\"<br>\r\n\"Yeah, I was really hoping you wouldn't mind. No one will hopefully recognize us there either, you understand.\" <br>\r\n\"Oh, no I understand\", I say as I put the car into gear and pull out into the road. \"You look absolutely spectacular, by the way\", I tell her as I glance over at the generous cleavage that her white tank allows to be visible. She might have taken notice. <br>\r\n\"Thanks, you don't look so bad yourself\", she says. I look over at her and she winks at me. \"Nice car\", she purrs. The drive is mostly uneventful until we get into the borders of Furtown. Immediately I am bombarded with sights of gorgeously well endowed Anthropomorphic women, but seeing how I have the most beautiful one in my car sitting next to me I could honestly care less. Still, I can't help but stare at some of these women, especially the cowgirls just for the fact I can't understand how they remain standing. Apparently, Liara takes notice. \"Never been to Furtown have you?\"<br>\r\n\"Uh, no could you tell\", I ask laughing nervously. <br>\r\nShe smiles, \"I suppose I couldn't expect much else from an adolescent\", she surmises. \"Turn right here.\" <br>\r\n\"What you think I can't handle the women out here\", I question. <br>\r\n\"Another right\", she directs. \"I know you can't resist them for long, which is why I had second thoughts of coming up here for our first date. Make a left.\" <br>\r\n\"Well, Ms. Panthera\", I say mockingly, \"I might just surprise you.\" She directs me to turn again. <br>\r\n\"Oh, and why is that\", she asks as we pull into a parking lot. I stop the car and she turns towards me in her seat, I do the same. <br>\r\n\"Because as long as your next to me I don't care what they look like. They can strip down nude and prance around all day but you're my only concern and there's nothing some cowgirl or shewolf could do about that\", I say smooth enough that I'm surprising myself. <br>\r\n\"Awh\", she moans. \"Come here\", she says and reaches for my face. I lean forward and close my eyes when she does. Liara's lips meet mine and we sit for a few seconds in a passionate kiss. I feel a brief brush of her tongue in my mouth and relish the rough texture. She breaks our kiss and leans back into her seat. \"You better watch yourself or you might not make it all the way back to my place\", she winks. I smile awkwardly at what the sexy pantheress is implying. She opens her door and I stop out with her, locking them behind me. \"This place has a steak that'll melt in your mouth, trust me\", she says as I walk over to her. She takes my hand as we walk towards the building and I feel her soft fur gripping my fingers. I try not to let her notice my sudden increase in heart rate as I hold hands with my teacher. She wears shorter heels than earlier today but she still stands at least eight inches taller. It almost makes me feel like a child, but when she looks back at me and I see the look in her eyes I feel otherwise. This is going to be a fun night. </span></div></div>",
            "created":1480307280,
            "id":2243059,
            "title":"Ms. Panthera no more"
        },
        "1133311111":{
            "author_id":"blacksmith121",
            "author_name":"Blacksmith",
            "choices":[
                "\"You know, we're busy.\" ",
                "\"I think that sounds like fun.\""
            ],
            "content":"<div class=\"\"><div> <span>I get a few odd looks from the various patrons and staff of the restaurant. I don't see many other men around in the whole place, so I'm not sure if I'm getting these looks because I'm human or because I'm a guy. Either way, it makes me a little uncomfortable even if the looks don't look hostile in the least. We're guided to a small booth in the steakhouse and take a look at the menu. \"Huh\", I grunt in surprise. <br>\r\n\"What is it\", Liara asks. <br>\r\n\"All the food is normal, for the most part at least\", I say. <br>\r\n\"Expecting something different\", she asks me with a wry smile. I simply blush and look away. \"I'm sure you've noticed the many odd looks you've been getting out here.\" <br>\r\n\"I didn't think people would be so upset with a human being here with an Anthro\", I say. <br>\r\nShe chuckles slightly, \"It's not because you're human\", she says. I look a little confused. \"Men are born less often in Anthro species, an unfortunate side effect from generations of domination by alpha males in ancient times. Males are uncommon enough that females will breed whenever the opportunity arises, Anthros don't go into heat like animals do.\"<br>\r\n\"So that means they're all staring at me because they want...\"<br>\r\n\"Your baby gravy\", Liara finishes abruptly. <br>\r\nBefore anything else is said the waitress arrives at our table, \"Hi there, can I start you off with an...appetizer\", she pauses when she looks at me. She's a tall anthropomorphic gazelle with tan fur and long brown horns growing vertical from her forehead. She's thin, appearing very athletic and toned, but still curvy wherever it counts with wide hips, large thighs, and an impressive bust for someone as fit as her. Of course, her figure pales in comparison to the pantheress Liara. I stare up at her dumbfounded by the hungry look in her eye. <br>\r\nLiara clears her throat, \"Actually, I think we're ready to order. Right, baby\", she coos sensually, probably trying to pull my attention back to her. <br>\r\nIt works of course, \"Oh yeah, I'll have the steak\", I say quickly. <br>\r\n\"Make that two\", Liara hands the waitress her menu smirking at me. <br>\r\n\"We'll have that right out\", the gazelle woman says, \"And let me know if you two need anything else, absolutely anything\", she says winking at me. <br>\r\nThe waitress walks back to the kitchen and I stare at her the whole way, up to the point she enters the door of the kitchen, hits her horns on the top of the frame and I hear her mutter curses from across the restaurant. \"Okay, I'm usually bad at this but, did you get a vibe from her because I got a vibe?\"<br>\r\nLiara looks at me with an incredulous scowl on her face, \"Is every girl going to distract you that much, sweety? It looks like I'm going to have to keep reminding you I'm here.\" <br>\r\n\"I was not distracted, okay. You have my complete atteeehhh\", I trail off when I feel Liara's long leg rubbing up to my thigh.<br>\r\n\"Better now\", she winks. <br>\r\nI smile, \"Wasn't necessary, you know, I like the idea of dating an apex predator anyway.\" Liara growls like a literal panther and scratches the air with her claws in a playful motion. <br>\r\nSuddenly, another waitress approaches the table a large tray blocking her face. \"Okay, two steaks, right?\"<br>\r\n\"That's us\", I say. <br>\r\n\"Alright then\", she sets the tray down and hands out the plates. She gives Liara hers and pauses when she sees her, \"Oh my GOD\", the waitress exclaims. The new waitress is a leopard woman, with the signature yellow coat and circular spots all over. She has a figure like Liara's, generous in all the right places, although I still think Liara is the more attractive. A noticeable difference is that Liara has long, silky black hair from her head flowing past her shoulders while the leopard is what I would guess to be the equivalent of bald headed out here. \"Liara\", she exclaims. <br>\r\n\"Do I...\" <br>\r\n\"Don't tell me you don't remember me. We had every class together back at the university\", the leopard argues. <br>\r\n\"Pardia\", Liara shouts. \"It's so good to see you\", she says and stands to hug her. While the two curvy felines embrace each other in a long awaited reunion I simply sit there smiling with my eyes darting between the two. Liara sits back down, \"Oh, Alice this is Tim\", she says suddenly a bit nervous. <br>\r\n\"Oh, Tim\", Pardia says seductively. <br>\r\n\"Hi, nice to meet youUU\", I begin and wave my hand but feel it get snatched up by the strong leopardess. She's just as tall as Liara which makes me wonder if Liara is this strong. I'm once again surprised as when I expected a hug like Liara's I am instead greeted by the Anthro woman's lips on my own. She holds me tight moaning into the sensual kiss. I feel a bit of her tongue forcing its way into my mouth before she releases my face from hers. <br>\r\n\"Nice to meet you, too\", she says grinning. The leopardess lets go of me and I fall back into my seat. Pardia leans over our table and thrusts her chest out for all to see, or more likely for me to see. \"I'm getting off in an hour and then a few friends of mine are going to the club. You two should come along\", she offers. Pardia looks down at me with an irresistible look in her eye that tells me she's not just willing, she's demanding. I glance down at Liara, who is now darting her eyes back and forth like I was a minute ago. I could have a guaranteed wild night with this leopard and whatever of her 'friends' she was talking about, maybe even at the same time. I could also stick with Liara. </span></div></div>",
            "created":1480480080,
            "id":2243870,
            "title":"A tempting main course"
        },
        "11333111111":{
            "author_id":"blacksmith121",
            "author_name":"Blacksmith",
            "choices":[
                "You go inside",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"We actually have to get going once we're done\", I say with great concentration to avoid looking at Pardia's unbelievable cleavage. <br>\r\n\"Awh, are you sure\", she shoots me big puppy eyes and squeezes her boobs together in my direction, paying no heed to Liara. <br>\r\nI grit my teeth hard, \"Yeah\", is all I manage to say without my voice cracking.<br>\r\n\"Well, in case you change your mind\", she says and pulls a pen out of her cleavage. She writes something on a napkin and presses the paper against her lips, imprinting her lipstick on it, \"Here's my number.\" <br>\r\nI take the napkin and she walks away with her hips swaying. Liara stares at me with a Cheshire grin, and considering she's a cat I mean a literal Cheshire grin, \"What\", I ask. <br>\r\nShe brings cupped hands to her mouth, \"Do you have any idea what you just did\", Liara asks ecstatic. <br>\r\n\"No, what?\"<br>\r\n\"You just denied Pardia Felisia\", she says, \"I've never seen a single guy resist her no matter who he was with.\" Liara can barely contain her smile. <br>\r\nI chuckle, \"I told you, when I'm with you it doesn't matter who they are\", I say smoothly and lying through my teeth to suppress my blushing. <br>\r\n\"Oh, Tim\", she reaches across the table and places both her hands on my cheeks, pulling me forward. She kisses me as if she intends to suck the breath out of my lungs, and that's exactly what the Anthro history teacher is doing to me. Her eyes are closed but mine, due to surprise, are still open. Upon seeing that no one else is reacting to this I am more than willing to participate in the pantheress' embrace. Her rough tongue wedges it's way into my mouth and I press mine into hers, feeling the sharp teeth in her maw. We lean deeper into each other and I press in deeper. I rub along the roof of her mouth and feel the jaggedness of her feline molars and press all the way to back of her throat, relishing every moment of the kiss. Liara seems to enjoy my little exploration of her mouth as she pushes her tongue farther back as well, the rough texture scraping my mouth and feeling better than any human girl's kiss. We suck on each other's lips for a few more seconds until she finally breaks the kiss and sits back into her seat. <br>\r\n\"What was that for\", I ask dazed. <br>\r\n\"Just for being you\", she says. We begin eating our steaks that I honestly forgot about and sit in silence for a few minutes. Liara keeps sending me hungry looks every time I look at her, a lot like some of the women that were watching me earlier. After a while we finish and the waitress returns with our ticket. She sends a disappointed look in my direction before she leaves. \"I got it\", Liara reaches. <br>\r\n\"No, no\", I snatch the ticket up, \"I'll take care of it\", I say wanting to pay as this is a date and I feel obligated to pay. <br>\r\nLiara reaches and places two fingers on the little clipboard, \"Don't worry, you've done plenty for me tonight\", she purrs. I let her take the ticket and pay the bill. We walk to the door of the restaurant and see outside that it has turned into an absolute gully washer while we were eating. She stares out at the parking lot under the pouring rain, \"Ugh, I hate the rain\", she moans. <br>\r\nI smile, \"Wait, here\", I say and jog through the downpour. I very quickly reach my car and climb inside, shaking some of the water off. I pull it up to the front of the restaurant and find a waiting Liara at the door. <br>\r\nShe runs up and hops in the passenger seat, \"What a gentlemen\", she coos to me. <br>\r\nShe directs me back to the interstate and I drive through the storm back to her house. Unfortunately, the rain hasn't let up in the slightest. I get as close to her door as I can and shut the car off. \"I don't have any umbrellas, looks like we're both getting wet\", I say. <br>\r\n\"I don't think we'll be staying in wet clothes very long anyway\", she says. I giver her a curious look. \"You're getting laid tonight\", she purrs. Liara leans in and pecks me on the lips before she gets out of the car and runs to her door. I'm still a little struck by what she just said. It takes a clap of thunder to snap me back into reality and I hop out and follow the sexy Anthro. </span></div></div>",
            "created":1480482600,
            "id":2243894,
            "title":"\"You know, we're busy.\" "
        },
        "113331111111":{
            "author_id":"blacksmith121",
            "author_name":"Blacksmith",
            "choices":[
                "The next morning",
                "Readers choice"
            ],
            "content":"<div class=\"\"><div> <span>I follow a laughing Liara into her house and shut the door behind me. We're both dripping wet and cold. I lock the door and look back at her. The tall Anthro woman smiles at me coyly. She brings up a finger and beckons me closer. I hypnotically walk towards the sexy pantheress as she kicks off her shoes, allowing me to a little closer to her height. Her hair is wet and clingy, and so are her clothes. Her fur all over her is dripping with rain water. I walk up to her and she lays both her arms on my shoulders, her breasts pressing into my chest. I grip her waist and rub along her back. We just stare into each other's eyes for a moment until I finally push forward and kiss her. She moans into the kiss and I wrap my arms around her. She pulls me in tight to her and squeezes her chest into me. I absentmindedly rub my hands up her back and lift up her unzipped jacket. Without breaking the kiss she raises her arms and allows me to lift the jacket off of her. Now she wears only her skintight tank top that is also partially transparent due to the rain. I feel her run her hands down my arms while I concentrate on the texture of her tongue until I feel a very soft and squishy piece of cloth in my hands. I break the kiss and open my eyes to see Liara's smiling face. I look down and see her hands holding mine against her perky breasts. I look back up to her emerald eyes and she grins, \"Yes\", she whispers to me. I let my hands fall down the front of her body until my fingers reach the hem of her jeans. She pushes my hands beneath her shirt and lets go, resting her arms back on my shoulders. She resumes French kissing me and for a moment I'm so enthralled I don't know what to do. Instincts quickly take over and I run my hands up her belly beneath her shirt, feeling her soft coat and toned muscles, until I feel the undersides of two soft orbs on her chest. I take a shaky breath in the midst of kissing her and feel Liara smile. I push my hands up farther and feel warmth and firmness of Liara's breasts in my hands. I feel the top of her blouse on the back of my hands as I gently feel her chest while kissing her. I give a light squeeze to feel the soft flesh of Liara's boobs squish into my hands. Liara lets a soft squeal at my touch and wraps her arms around my shoulders, pulling me in tight. I let go of her breasts and slide my hands around her back squeezing hard. She pulls her head back and pants for a moment, \"Come on\", is all she says before she steps back and pulls my hand with her down a hallway through her house. She walks into a dark room and lets go of me, leaving me blind. She turns on a single lamp and fill the room with soft orange light. <br>\r\nI gasp with joy and awe when I see that I'm in Ms. Panthera's bedroom. She makes a sultry walk back over to me in the barely lit room, her predatory eyes almost glowing in the dark. Liara reaches out and grabs my shirt from the bottom. She pulls it up and lifts it over my head, tossing it aside. She pushes me down on the bed and stands in front of me smiling. Her tail is whipping side to side wildly. I sit back up and reach for her waist. She smiles and raises her arms. I push the thin white tank up to her chest, only pausing to mentally prepare myself for what I'm about to release, and lift it over her massive chest. The two furry orbs bounce and jiggle in freedom and Liara sighs sensually as I push her tight blouse the rest of the way off. I toss her blouse and she grips my head and pulls it into her chest. I wrap my arms around her thin waist while she squeezes my head with her soft breasts, jiggling them and massaging them on my face. The entirety of my head is lost from view within the confines of Liara's soft bosom I rub my hands up and down her back, from her shoulders to her tail, and listen to the echo her purring makes when her boobs are my ear muffs. She releases my head and I take a deep breath of fresh air. She giggles and pulls my hands towards her pants. I unbutton her jeans and she quickly turns around, wrapping my head with her long tail. I pull on the hem of her jeans and begin to feel the denim slide down her massive hips. Liara's huge rump looms in front of my face as I pull her pants off. I savor the moment and let the jeans slide gently down and slowly reveal the two shiny cheeks of the panther goddess. Her jeans begin to fall with gravity and I push them to rest of the way and proceed to rub and caress her ample bottom, even leaning forward and kissing the perfectly shaped cheek. Liara purrs loudly and kicks her pants the rest of the way off. She turns to me and pushes me down on the bed so that she can remove the last of my clothing as well. She tears at the button of my jeans and pulls my pants off my legs. Both of us nude, I crawl backwards onto the bed while the curvy pantheress slinks over top of me like she was catching her prey. She lays her body on top of me and I groan at the weight of her softness on my body. She locks her lips onto mine and I run my hands down every curve of her body. Rubbing her sides and caressing her rump, squeezing it and shaking it, and sliding down and up her thick thighs. She sits up on top of me grinning down at me. I smile and grip her hips tightly. She lifts up and grips my member, pressing it against her lips. I and Liara both moan as she sits back down and I slide deep inside her. She starts to bounce up and down on me driving me wild. I buck my hips into her and watch her massive chest bounces uncontrollably. Her squeals gradually grow louder as she rides me into her bed and I feel my whole body tense. I squeeze her hips in my hands and feel her body tense as I release deep inside her. We relax and she falls back down, letting her face hang above mine. Her hair surrounds my head, making her face take up all of my vision. She kisses me as she pulls her hips off of me and separates us. She lies down on the bed and maneuvers her backside against my still tense crotch. I slide my arm beneath her and hug her tight against me, feeling her breasts in my arms. Though I begin to relax, my member stays hard wedged between her cheeks where it is. She chuckles at this and wiggles against it. I shudder and hold her tight. Soon enough, we both fall asleep in Liara's bed. </span></div></div>",
            "created":1480486620,
            "id":2243917,
            "title":"Spending the night with Liara"
        },
        "1133311111111":{
            "author_id":"blacksmith121",
            "author_name":"Blacksmith",
            "choices":[
                "How can I say no",
                "How could I have said no"
            ],
            "content":"<div class=\"\"><div> <span>I slowly begin to wake up after the night's activities. Everything floods back into my mind when it dawns on me that it wasn't a dream. My eyes start to open and I can see it's already morning outside. My face is partially buried in a mass of long hair. It takes a moment for me to remember that I fell asleep spooning a naked Liara Panthera. I take a deep breath of her hair and recall her scent, wrapping my arms tight against her. I feel her soft, volleyball sized breasts squish into my arms as I hug. I hear and feel Liara start purring in her sleep. The warmth and vibrations coming from her body start to make me grow hard. Snuggled up to a creature as gorgeous as Liara it is impossible for me to will my erection back down. I recall how exactly she positioned herself against me last night and get more turned on. As I begin to harden I feel the softness of her rear enveloping me. I am in absolute euphoria as my erection is lost within the darkness of her generous rump. I sigh quietly and hug her harder as she purrs. She moans softly, \"I was wondering when you would wake up.\" <br>\r\n\"Good morning\", I whisper groggily. <br>\r\n\"Ready to go again, I see\", she says. I chuckle nervously. \"Did you think I wouldn't notice you poking me back there\", she asks clenching her cheeks and making me shudder.<br>\r\n\"Hard to keep it down when I'm around you\", I defend. <br>\r\nShe giggles, \"Oh, I don't mind. I think it's cute.\" I chuckle and kiss the back of her neck through her hair. She purrs loudly rolls herself over to face me. Her massive presses into me. \"Quite the charmer aren't you?\"<br>\r\n\"Not usually, I've been surprising myself lately\", we both laugh. Her breasts bounce against me. \"I meant to ask you something earlier\", I say. <br>\r\n\"Oh, what is it?\"<br>\r\n\"Was all this because Pardia hit on me but I stuck with you instead\", I ask wincing at how blunt it came out. <br>\r\nShe sighs, \"Sort of.\" That was a surprise. \"You know how college is supposed to be your time to blossom and have fun. She was more 'fun' than I was.\"<br>\r\n\"What do you mean\", I ask. <br>\r\n\"All Anthro women are...full figured compared to human girls, even the less attractive ones. I was a bit of a late bloomer\", she tells me. <br>\r\n\"I take it she wasn't?\"<br>\r\n\"Every guy wanted her, and as most girls do, she wanted every guy. I had a couple boyfriends through my college time but every one of them blew me off for a special time alone with her, not that I couldn't have participated, but that's not what I wanted.\"<br>\r\n\"Well, they were a bunch of jerks\", I say. <br>\r\n\"She had everyone she wanted and no one resisted Pardia, even other girls. Meanwhile, I couldn't keep a guy to myself for more than a night or two\", she says, \"And then there's you.\" <br>\r\nLiara stares at me smiling warmly, not the hungry look she gave me the night before. It's a genuine look of happiness. I lean closer and kiss her briefly. \"Between you and me, the inside of your mouth tastes a lot better than the inside of hers\", I say. <br>\r\nLiara laughs and kisses me back. She licks my lips with her tongue playfully. \"Well, I can tell from the feel of things your still ready to go.\" Liara rolls me over and straddles me once again. She sits up high on my hips and swings her chest side to side, \"I was going to hop in the shower. Want to join me?\"</span></div></div>",
            "created":1480622160,
            "id":2244439,
            "title":"Liara's confession"
        },
        "11333111111111":{
            "author_id":"blacksmith121",
            "author_name":"Blacksmith",
            "choices":[
                "Later on, meeting for the party",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>\"You know I can't say no to that\", I say grinning. <br>\r\nLiara laughs and hops up off of me. She stands, stretches, and yawns. It's a view I happily take in as she breathes deep. \"I'll be in there waiting\", she turns and winks over shoulder. The gorgeous pantheress sway her naked hips as she walks towards her bathroom. I just sit there hypnotized by the swing of her rump and tail until she's finally out of sight. <br>\r\nI roll back over onto my back, \"This is officially the best day ever\", I say to myself. I pull myself up from bed, still having difficulty feeling my stiff legs, and take a moment to locate all my articles of clothing strewn across the bedroom floor.<br>\r\nI hear the phone ring in the house and look over to the small handset beside on Liara's nightstand. \"I got it\", she shouts from in the bathroom. I hear her run a few steps into her living room and answer the phone. Her voice takes a very surprised tone, \"Pardia\", she asks. \"No, you didn't wake me. Yes, he did take me home last night...and yes he is still here\", she says annoyed. \"Tonight, really? Well, I'll ask him\", she says and hangs up the phone. <br>\r\nI make my way into the bathroom and meet Liara, wet and wrapped in a white towel that hardly covers her chest and hips, as she's walking back in. \"Who was that?\" <br>\r\n\"That was Pardia, actually. She was asking if you and I would want to go to a party she is attending, just a few old college friends of ours\", she says brushing it off, \"I was going to call back in a little while and say we couldn't make it.\" Liara opens up the door of her already warm shower and drops the towel from her perky bosom. I stare at her dripping wet glory and feel my eyes glaze over. She swings her tail and pushes my chin up to pull my eyes away from her gargantuan breasts and back to her green eyes. \"I doubt you would want to have to see her again, or be stuck with a bunch of old college grads\", she finishes and steps into the shower, making your heart jump as she runs her fingers through her long hair. <br>\r\n\"I don't know, I love to hang out with you\", I joke and she whips me with her tail as I step in. \"I wonder if you're worried whether I can resist Pardia twice\", I say. <br>\r\nLiara clears her throat and loses a bit of her seductiveness, \"Well, I wasn't going to say it\", she begins but is cut off when I stand on my toes to meet her lips, surprising her.<br>\r\nOnce back to being face to her throat I assure her, \"You are the most gorgeous girl I have ever seen. I'm not going to deny that the other Anthro girls turn me on, because you would know I was lying, but I want you, not Pardia\", I say and grab her waist gently. <br>\r\nShe smiles and rests arms on my shoulders, pushing her breasts up mere millimeters from my nose. \"So what should I tell her?\"<br>\r\n\"Well\", I begin, \"today's a Saturday, there's nothing I'd rather do than something with you\", I say making her chuckle and cause her breasts to bounce and brush against my nose and lips, \"And you didn't give me any homework\", she laughs and pulls me in to her cleavage, only letting my head emerge from the wet, furry canyon so that she can lock onto my lips and suck for a few moments.<br>\r\n\"I'll let her know\", Liara says laughing and shaking her breasts on either side of my head as she still holds me tight against her. \"I'm sure you'll have to head home to get a change of clothes.\"<br>\r\n\"I'll leave after breakfast\", I say, \"But first I'll wash you off\", I say as I reach around and grab two handfuls of her soft rump. <br>\r\n\"Oh\", Liara jumps, \"In that case would you mind getting my back\", she asks and turns around placing her hands against the wall of the shower.<br>\r\nI reach for the soap and look around confused, \"Where's the soap?\"<br>\r\n\"Oh, right. No soap, just lots of shampoo and conditioner\", she says chuckling.<br>\r\n\"I think I know what to get you for Christmas\", I say and pour a hefty amount of shampoo across her back before rubbing it in all over her body. I hug her tight and lean in against her as she purrs. I reach my hands all over her waist and up her sides. I rub down her thighs and over her round butt thoroughly before sliding up her belly and slathering her soft breasts, causing her to moan. <br>\r\n\"You're getting everywhere\", she coos, \"I should let you wash me more often.\"<br>\r\n\"I wouldn't let you shower alone ever again\", I say as lean against her and massage her breasts from behind.<br>\r\n\"I didn't take your virginity last night, did I?\"<br>\r\n\"Well, you were a close second and much more enjoyable than my last experience.\"<br>\r\n\"Ever done it in the shower\", Liara asks standing up straight and holding my hands against her abs.<br>\r\n\"No\"<br>\r\n\"Who's stopping you\", she asks as she leans forward into the wall again. She raises her tail and wiggles her rear against my throbbing crotch, spreading her legs, inviting me in. I grasp her hanging breasts again and position myself behind her. Slowly, I slide inside her and she purrs, vibrating her whole body against me. I thrust into her wet body again and again, holding onto her breasts, and then her shoulders like handle bars. Liara begins to grunt along with me at ever thrust I make, penetrating deeper. I don't know if I'm thinking this with my mind, my heart, or something else, but I think I might have fallen in love with this woman. </span></div></div>",
            "created":1484250540,
            "id":2262704,
            "title":"Liara Panthera's trust"
        },
        "113331111111111":{
            "author_id":"blacksmith121",
            "author_name":"Blacksmith",
            "choices":[
                "Pardia's not done with you for tonight",
                "She keeps her promise"
            ],
            "content":"<div class=\"\"><div> <span>I drive up to Liara's house later on that afternoon. She steps out in a gorgeous white, two piece gown. She wears a ankle length dress with a slit that goes all the way to her hip and a cleavage bearing blouse that looks more like two sashes cupping each breast and tied at the bottom. She has her long, toned legs, thin waist, and voluminous bust on full display. \"You look absolutely amazing\", I tell her. <br>\r\n\"Despite how it might look, I'm actually very modest in my taste, and you don't look so bad yourself\", she says and kisses me. I'm only wearing a nice button down with a pair of good jeans, so hers is more of a compliment. \"I thought we would drive separate in case you needed to leave\", she says.<br>\r\n\"Alright, I suppose that works\", I say as she walks over to her car. I cant help but stare at her swinging hips and tail as she walks and bends over to climb into her modest coupe. We start our engines and drive out to the highway. Fortunately, the address for the party wasn't too far away apparently. Also good, it's not any kind of club or rager from what it looks like from the outside. It's just another home like Liara's, although slightly larger and this one is farther out in the country.<br>\r\nLiara meets me outside my car, \"Well, this is it\", she says smiling. <br>\r\n\"Why do you look nervous\", I ask.<br>\r\n\"I'm not nervous\", she says blushing under her fur.<br>\r\n\"Yeah, you are I can tell\", I say as I take her hand and pull her towards the house.<br>\r\n\"Alright fine, I suppose you deserve to know\", she says.<br>\r\n\"Know what?\"<br>\r\n\"Some of the most attractive Anthros to females, are Leos\", Liara begins like a girl talking about Channing Tatum, \"They always have slim but toned bodies and tan fur. Some would grow manes but the ones with the strong jaws would trim their manes back like a human's hair.\"<br>\r\n\"Wait, are you saying-\"<br>\r\n\"I'm kind of showing you off tonight\", she grabs my hand pulls me towards her to peck my cheek.<br>\r\nShe knocks on the door and a familiar face opens it and lights up with surprise, \"Liara, and...Tim\", Pardia says happily. \"I was hoping you two would make it\", she says. She reaches out and grabs me by the shoulders, pulling me away from Liara and into a tight hug. Liara wasn't kidding about the modesty thing. Pardia is wearing nothing but a mid riff blouse that's so tight on her bust it's see through and skin tight skirt that manages to stay halfway down her thick thighs. \"Cmon in\", she says and pulls us into her house. I'm tossed into a spacious living room that's filled with around four or five other Anthropomorphics of various species. Of course, they are all female. \"There's food in the kitchen if your hungry. Everyone's been dying to see you\", Pardia says shutting the door behind us. Liara lets go of my hand and goes to greet some of her friends. A slim wolfess and a very curvy cowgirl jump up to meet her and they begin immediately catching up on old times. You feel Pardia latch on to your arm in surprise, \"I'm glad you decided to show up I was worried I wouldn't get a chance to meet Liara's new boyfriend. Let me give you the tour\", she says and begins pulling me around the house. I look back at Liara worriedly as she chats with her friends and she looks back up to me for a brief moment. I wave with my free hand before Pardia pulls me out of sight. Liara gives a weak wave while her friends talk to her.<br>\r\nPardia pulls me through her kitchen, that looks like she spent all day cooking, and then to her garage to show off her nice car, and to her patio out back. I saw various other Anthro girls through Pardia's house that all gave me very kind smiles, but hinted at a bit more with their eyes. I didn't feel worried until Pardia directed then directed me upstairs. I remember what Liara told me about Pardia's habits with her boyfriends. I'm not about to screw things up with my sexy as hell anthro teacher, but I don't want to be rude to Pardia so I walk with her upstairs. She takes me to her balcony that looks out on the road we drove up on. She leans back against the railing, seductively eyeing me. \"It's a beautiful house\", I say nervously.<br>\r\n\"I'm glad you like it\", she says.<br>\r\n\"How do you afford it waiting tables?\"<br>\r\n\"Oh, that's just my job in between studies to kill time.\" She walks towards me with a sway in her hips, \"So how did you and Liara meet\", she asks.<br>\r\nI scoot away from the curvy leopard, \"I met her at school.\"<br>\r\n\"Don't think I don't know what's going on\", Pardia says, \"She doesn't go to classes anymore and you look to young to be a teacher. You know she's thirty-two, right?\"<br>\r\n\"I did know that, actually.\"<br>\r\n\"She must be your favorite teacher\", Pardia says grinning.<br>\r\n\"What?\"<br>\r\n\"I'm not an idiot, you know. Liara might have gotten the job that everyone wanted, a representative to the humans, but I good grades too. So, how far have the two of you gone?\"<br>\r\n\"What do you mean?\"<br>\r\n\"Liara always took things a bit slower. Have the two of you done it yet?\" I start to blush. \"You have, oh that dirty girl.\"<br>\r\n\"Can we please talk about something else, anything else?\"<br>\r\n\"Okay, if you don't want to talk about sex with Liara, talk about sex with me\", Pardia purrs. I turn to her and take a couple steps back. \"If you thought her pussy felt good just wait until you feel mine.\"<br>\r\n\"Hang on.\"<br>\r\n\"You didn't think the house was the only thing that was beautiful. I saw you staring at these every chance you had\", Pardia says as she crosses her arms over and pulls her tight blouse up. Her enormous spotted breasts bounce freely once the restricting fabric is pulled off of them. I'm unable to tear my gaze away from them as thr bounce and shake on the leopard woman's chest. They are even larger than Liara's, and just as perky. They only lack the shine that Liara has with her luxurious coat. \"Go ahead, I won't say anything\", Pardia says as she steps closer.<br>\r\nI back away, \"No, no, I can't. I won't do that to Liara.\" <br>\r\n\"You do like her. This is more than banging your hot teacher isn't it\", Pardia gasps.<br>\r\n\"Yes, now please let me go\", I say as I reach for the door but the leopard is like lightning compared to me. She brings herself between me and the door and blocks my path.<br>\r\n\"Here's the deal, Tim. I'm not going to ask you to screw me, not tonight at least, but I always get something from the guys that I'm hunting.\"<br>\r\n\"What kind of something?\"<br>\r\n\"Just a kiss.\"<br>\r\n\"No\"<br>\r\n\"Then I go tell Liara that you ravished me on this balcony\", she grins, \"Given her history with guys and the usual weak will of humans around Anthros, which yours is impressive by the way, she'll believe me.\" I stare at her thinking. \"I wouldn't go to the police, that would put her in too much danger, but she'll never trust you again.\"<br>\r\n\"...just one kiss.\"<br>\r\n\"But it's got to be real one. I want you to curl my paws\", she says and scoots closer to me, hovering her breasts before my face. I sigh and place my hands on her waist. She giggles and brings her arms around my shoulders. Pardia leans down and I lean up and our lips meet with open mouth. She wanted it to be good, so I do what I know Liara likes. I puch my tongue into her mouth and listen to the leopard moan in delight. Her rough wriggling tongue pushes past mine and tickles me. I press in deeper to the felines lips, squeezing her breasts into my chest, and trace the length of her cat-like tongue to the back of her throat thanks to my practice. I pull myself out from between her lips, tracing the roof of her mouth the whole way, and look up to her dreamy eyes. \"No wonder Liara likes you. Shame your faithful, I'd rock your world and you might just rock mine.\"</span></div></div>",
            "created":1484283660,
            "id":2262898,
            "title":"Later on, meeting for the party"
        },
        "1133311111111111":{
            "author_id":"jcmsrules",
            "author_name":"Gentle Giantess's Rule",
            "choices":[
                "She decides to have sex",
                "Some other thing."
            ],
            "content":"<div class=\"\"><div> <span>Oh shit this has gone crazy. I can't (can) believe that she would go back on her promise. Well it looks like this is gonna be a crazy night. Good luck dealing with Pardia. Now the question of this chapter is quite simple.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhat does she do to you?</span></div></div>",
            "created":1554479280,
            "id":2640460,
            "title":"Pardia's not done with you for tonight"
        },
        "114":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "I got much more in me!",
                "I'd like you to COME home with me.",
                "Almost like if I'm in a dream."
            ],
            "content":"<div class=\"\"><div> <span>I didn't know what to do. Before I noticed we were both on the floor looking at each other, waiting for the other to do something. So I did something... I started to kiss her, but she said \"I want to suck your cock.\"<br>\r\n<br>\r\nSlowly, she unzipped my pants and pulled my shorts off, exposing my 8\" cock. She got on her knees and put her wet, warm mouth around my pole. I moaned as she took more of my massive dick into her mouth. I moved in and out easily of her mouth. Her sandpaper-like tongue wrapped around the head licking and tasting the pre-cum that came out. She took my bulging dick into her mouth almost all the way and moved her left hand up and down very fast. She's sucked hard, playing with my cock with her tongue. I was moaning in pleasure. But I knew I was now close to cumming.<br>\r\n<br>\r\nShe knew it too. She started sucking harder and harder. I exploded inside her mouth, it seemed like I kept cumming without stopping, but Liara swallowed all of it without any problem. I looked down at her and she smiled back at me.<br>\r\n<br>\r\n\"Fuck me\" she said.<br>\r\n<br>\r\nI replied \"You got it.\"<br>\r\n<br>\r\nBefore I took a second glance over she ripped open her shirt, revealing her large black fur coverend breasts and lifted up her skirt, exposing her dripping vagine . If she hadn't just blown me, I could have came right there. She was so HOT. Perfect breasts...Perfect everything. She was leaned face against the chalkboard...waiting. I got up to my feet and postioned myself behind her. I slowly started pushing my penis inside her hot pussy. <br>\r\n<br>\r\nShe was moaning loudly \"Tim, OH Tim, FUCK ME HARDER\" So I did, harder, faster and deeper.<br>\r\n<br>\r\nI gave her all 8 inches with 1 thrust, listening to her groan in pleasure. Then I thrust back and forth. \"Oh YES baby, Yes. HARDER...HARDER...HARDER.\" She yelled. I went back and forth using all my energy, in and out of her soft wet hot pussy. I knew I was going to cum soon so I said, \"I want you to be on top.\" I got off of her and she pushed all the papers off her desk and I layed down. She straddled on top of me.<br>\r\n<br>\r\nShe started slowly at first, then faster and faster. Her breasts were dancing up and down. Liara kept orgasming continuously moaning in delight. She was SCREAMING my name in Ecstasy. Finally the feeling I had from all of her juices was too much and I yelled \"I'M gonna cum!!!\" That didn't stop her, she went faster than ever, She orgasmed 1 more time before I came. I grabbed her and EXPLODED deep inside her wet dripping pussy.<br>\r\n<br>\r\nOh god I moaned as I felt my orgasm. \"Liara OH Liara!\" She was screaming too.<br>\r\n<br>\r\nWhen I pulled my dick out, I saw her gaping pussy dripping with my cum.<br>\r\n<br>\r\nShe asked if I was ready to go again.</span></div></div>",
            "created":1431147600,
            "id":1975549,
            "title":"She doesn't say anything and just tackles him"
        },
        "1143":{
            "author_id":"dsfuchs",
            "author_name":"DSFuchs",
            "choices":[
                "Take a day off",
                "The next day...",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Wake up!!!\"<br>\r\n<br>\r\n\"Wake up!!\", a voice called. I opened my eyes, and realized I?d been lying in my bed all along. I looked toward my bedroom door, and saw my mother standing in the doorway. \"Tim, time to wake up!!\"<br>\r\n<br>\r\n\"Mom, I don?t wanna get up!\", I called back, not telling her the reason was to hide the morning wood I got during my dreamt experience.<br>\r\n<br>\r\n\"But you have to get up. You have School today\"<br>\r\n<br>\r\n?Mom,..\" I said. \"Can't I take just one day off school?!\"<br>\r\n<br>\r\n\"Take a day off?\", she asked me. \"Yeah, sure. I'll just need to call your teacher, Ms Panthera, was it!?\" Then you realise that perhabs your dream might have abeen something more..\"<br>\r\n<br>\r\nNah... It couldn't be like that. Or could it?</span></div></div>",
            "created":1431147600,
            "id":1975554,
            "title":"Almost like if I'm in a dream."
        },
        "115":{
            "author_id":"jackswager123",
            "author_name":"jackswager123",
            "choices":[
                "She unbottons her shirt",
                "Eats him (a blowjob)",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about one of these </span></div></span></div>",
            "created":1480860960,
            "id":2245621,
            "title":"Other..."
        },
        "12":{
            "author_id":"itisits",
            "author_name":"itisits",
            "choices":[
                "Made it on time.",
                "Was running late!"
            ],
            "content":"<div class=\"\"><div> <span>As I was leaving for my first day of teaching I had noticed that I was missing something. I searched my pockets and found that my car keys aren't where I thought they'd be. \"Oh right I'm going to need those if I want to get going to work.\" I said, sarcasm evident in my voice. I ran back up to my front door and went inside to find my keys. 'Now... where are they?' I thought standing in my living room. <br>\r\n<br>\r\nI looked for them on the end tables, under the couch cushions and even on top and under the coffee table. It was beginning to become a bad habit of not putting them on my hook by the front door. I looked at the clock and knew that if I didn't leave soon I wasn't going to make it onto the freeway to the south end of the city in time before the morning rush which meant an embarrassing start to the school day. <br>\r\n<br>\r\nFranticly I ran to kitchen looking around the fruit bowl on the island, on dining table they were no where to be found and lastly not on the kitchen counter. I was beginning to loose hope of even making it out of the drive way at this point. 'How could I have let this get so out of hand.' I thought scolding myself. Then in a beautiful epiphany I remembered that they were probably in my jeans when I took them off to get changed for bed last night. <br>\r\n<br>\r\nI went past my home office and bathroom to my bedroom at the back of the hall and there they were, crumpled on the floor. Sauntering up to them I bent down, picked them up and felt around the pockets. Nothing in either of them. Slumping to the floor I could swear I was on the verge of tears, when I looked up and on the corner of the dresser was my car keys. Elated with joy I snatched them running out the bedroom and down the hall to the front door, I glanced at the clock before I left. I had 10 minutes to get to the freeway.<br>\r\n<br>\r\nI hoped in my car and backed out if the driveway. It took me less time than I thought to reach the freeway, though all of those green lights definitely helped speed things up and made it with two minutes to spare. I played my toll and proceeded to just get in the lane I needed to be in and cruise to work.<br>\r\n<br>\r\nIt had been a year ago that I had finished studying for my degree in teaching and I finally found a school that would hire me. You can imagine that this morning I was feeling excited about the prospect of living out my career as early as I could, shaping the minds of the future young men and women for generations to come. Though at the same time, I was also very nervous. This was a school of which very few of the furry species attended and no furry teachers had ever been on staff. I how ever have broke that tradition. I am the first of the furry species to teach full time at Dr. Ronald C. Schmetzfeld high school, a school that, thankfully, had become more open minded by the time I had chosen to apply to be a teacher there.<br>\r\n<br>\r\nSegregation had been so much a part of society for humans and furries for so long, especially in schools, that one thought that the day they would integrate peacefully would never come. Though that was 45 years ago and times have thankfully gotten better. Many people, whether they be human or furry, live around and amongst one another, even as roommate's too. But, I still knew that there would be a bit of trepidation to me teaching there since this was so new.<br>\r\n<br>\r\nTurning off to the exit, I made my way to the school which was 10 blocks away. Stopping at a red light I checked myself out in the sun visor mirror. Nothing strange or out of place on my face, so I closed the visor and checked my blazer and blouse. No stains or lint. 'Good, I've got to make a good first impression!'<br>\r\n<br>\r\nPulling into the faculty parking lot, I found my parking space, pulled in and went inside the school. I pulled out my phone and found I had...</span></div></div>",
            "created":1535602320,
            "id":2540660,
            "title":"Panthera"
        }
    },
    "info":{
        "author_id":"falcon",
        "author_name":"Falcon",
        "brief_description":"A human student is gonna get hot for the sexy, furry teacher.",
        "created":1421772300,
        "description":"<td align=\"left\" class=\"norm\">Tim Everett is a 16-year-old high school student who is shy when it comes to girls. Liara Panthera is a 32-year-old teacher who happens to be a furry panther and starting her first day as teacher at a new school. When she enters, their eyes meet, and they´re immediately hot for each other!<br>\r\n<br>\r\n<br>\r\nRules:<br>\r\n<br>\r\n1. Panthera has a body of goddess; Huge breasts, big ass, thin waist and wide hips!<br>\r\n<br>\r\n2. This story will have romance, sex and other mature content, furries, love and anything else you come up with<br>\r\n<br>\r\n3. Try to add long chapters (a paragraph at least)<br>\r\n<br>\r\n4. Try to keep it in first person<br>\r\n<br>\r\n5. Enjoy!<br>\r\n<br>\r\n<br>\r\nReward: 1000 Gps per chapter</td>",
        "id":2026825,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1561195980,
        "modified":1561195980,
        "pretty_title":"A Student and his Furry Teacher"
    }
}