{
    "chapters":{
        "1":{
            "author_id":"shadowpup",
            "author_name":"Moody Blue: Needs an Upgrade",
            "choices":[
                "Put the memory out of mind",
                "Get the phone book and start  searching",
                "Get on the computer to start searching."
            ],
            "content":"<div class=\"\"><div> <span>           Christine sat watching a talk show that she  was very fond of.  Today's topic for viewing was \"Are you Looking for Someone?\"  This intrigued Christine.  She watched the show with great enthusiasm. One of the stories featured was that of two girls who were in the same class in grade school.  Christine's mind went back in time.  She wondered whatever happened to the kids she knew in elementary school.<br>\r\n<br>\r\n           This wondering opened some very painful memories for Christine.  Were these kids the same as adults as they were as kids?  How do they treat people who are \"different\"?  Did she dare try to reconnect with some of them?  Would they want to hear from her?  What type of response would she receive?<br>\r\n<br>\r\n           It took about a week for Christine to make the decision as to whether she wanted to start searching.  What would she do?</span></div></div>",
            "created":1078953240,
            "id":191437,
            "title":"Thinking back"
        },
        "11":{
            "author_name":"QΔŻŻ",
            "choices":[
                "Christine takes a risky trip to her old school",
                "Christine's fear of risk leads her to find some other way to track down her",
                "Christine Guilts her Husband, Tony, into taking her where she needs to go"
            ],
            "content":"<div class=\"\"><div> <span>          The light from the south window was dusty, and maybe even a bit reluctant where it entered the dining room. It shone, sure, but it was as if, given a choice, it would have preferred to avoid that window altogether, the whole room, in fact.  It was a tightly packed little room, with a once-elegant set that had become little more than a prop for papers, books, boxes, dusty knick-knacks whose only sentimental value now was in having to admit that they'd lost their sentimental value. The books and debris that had come to infest the dining room had spawned up and into the china cabinet, pushing back the plates and cups and the crystal bell collection mother had left Christine in the will. It was this room that challenged the light from that south window as it begrudgingly lit the one clear spot on the table in front of Christine, who was parked at the hole where Tony had maimed the set to accomodate her chair.<br>\r\n          <i>How stupid</i>, she thought, the show still on her mind, why would she want to find any of <i>her</i> old classmates? If anything, she would <i>avoid</i> them, and in the most visible, obvious way. She poked at the sandwich with her fork then paused to examine it, turning it tines-up and from different angles. She loved that fork. They'd lost four of it's mates at Tony's company picnic. That'd been in early summer a few years earlier. She'd really preferred not to risk any of the elaborate forks that summer, but Tony had pursuaded her, and look what happened. She'd been right about the forks, about them having an incomplete, unusable set, and she'd gotten mile after mile after mile out of it with respect to being right on future disagreements. She turned the fork and noted how the tines were still evenly spaced, even after such a time.<br>\r\n          Tony didn't try to pursuade her of too much after that summer, the fork incident having become the perpetual trump in all disagreements over risks great and small. It was invoked so easily, \"... Just like that summer, Tony, remember?\" Yes, she'd been right, and that was no small thing for a woman for whom it was important not only to <i>be</i> right, but to have it <i>acknowledged</i> as well, as if somehow being right or wrong preserved or denied some greater validation. And now that the elegant formal set was incomplete, it wasn't useful. But still, the piece had value to <i>her</i>; it was the evidence that she'd been right to call for caution, and Tony had been wrong that summer, he'd been wrong, and because of it, what was once beautiful and elegant was now incomplete and useless.<br>\r\n          Christine rested the fork next to the sandwich, as if in a place of honor, and looked around at the books that were arranged so she could reach them. <i>Old classmates</i>, she thought, <i>How stupid...</i> Her next thought, though, was to wonder what those young classmates would say to her now. Would they see her and come to know what had happened, then reflect back on how they'd treated her? And would they, there and then, learning of her horrible circumstances, fill with regret and flood shame for themselves? Even at that young age, Christine had told them, <i>warned</i> them, actually, that their cruelty would lead to trouble if they didn't stop--which they didn't, not that year or the ones that followed, as Christine recalled.<br>\r\n          She tentatively reached for a box, then pushed it aside in favor of another, then another, then another, until she found the one she'd collected after the funeral along with the crystal bells. Soon ancient papers and crude tempura paintings were covering the last of the visible wood on the once-elegant table. Mother had kept everything, even the old school records, and for the first time that Christine could remember, it had actually been beneficial. Just like that show, Christine could look up <i>her</i> old classmates, too.<br>\r\n          After all, it was not enough to <i>be</i>, it had to be <i>acknowledged</i>, as well.</span></div></div>",
            "created":1079529240,
            "id":192076,
            "title":"Sentimental Value"
        },
        "12":{
            "author_id":"shadowpup",
            "author_name":"Moody Blue: Needs an Upgrade",
            "choices":[
                "Richard Burrows",
                "Frank Chefton",
                "Kevin Corbin",
                "Kevin Dunne",
                "Brian Lafferty"
            ],
            "content":"<div class=\"\"><div> <span>           Christine went to find her book.  The chances of any of these kids still living in the area are now slim to none.  The female students may be married now.  It may be easier to look for any of the boys.<br>\r\n<br>\r\n<br>\r\n           Christine was able to have a claim to fame that not many could equal.  She was able to remember each and every one of the kids who treated her with distane and disgust.  Thinking of this made her wonder if she really wanted to reconnect.  She thought for a minute, then decided to forge ahead.<br>\r\n<br>\r\n           She started trying to remember some of the names.  While doing this, she also remembered what they did to her.  Tripping her, stealing her hats in the winter, pulling a chair out from under her, and calling her\"Limp Along\" were some of the things that made her life terrible.  Still, she went ahead.  Who would she find?</span></div></div>",
            "created":1078960560,
            "id":191452,
            "title":"Finding Needles in Haystacks"
        },
        "121":{
            "author_id":"mesonali",
            "author_name":"Thankful Sonali WDC POWER!",
            "choices":[
                "Richard returns home and is delighted to see her there.",
                "Richard doesn't recognise her.",
                "She makes friends with the child, but leaves before Richard returns."
            ],
            "content":"<div class=\"\"><div> <span><i>\"Burrows, Alf. Burrows, George. Burrows, Howard. Burrows, Richard\"</i> ... Richard Burrows! She'd found Richard Burrows!<br>\r\n<br>\r\nShe took a deep breath, steadied her trembling fingers, and dialled.<br>\r\n<br>\r\n\"Hello, Mommy and Daddy aren't home now. I'm with the babysitter but she's in the kitchen. Daddy said he'd be home at five o'clock. Bye bye.\"<br>\r\n<br>\r\n\"Wait, kid, wait, don't hang up.\"<br>\r\n<br>\r\nBut it was too late, the child - probably four years old, had already disconnected the phone. Sounded like a girl. <br>\r\n<br>\r\nFive o'clock. That gave her an hour. Quickly, she double checked the address. Yes, still the same, just two streets away.<br>\r\n<br>\r\nInstantly, she made up her mind. Throwing on a coat, she walked to the store down the street and purchased a big teddy bear. Then, she went back home, and got the car out. With her disability, it was faster to drive down, even two streets. Teddy comfortably perched next to her, she drove to the Burrows' home.<br>\r\n<br>\r\nCarrying Teddy, she walked up the Burrows' driveway and rang the doorbell. The babysitter answered the door - thank goodness, it was Trehana, who knew her! \"Hi Trehana, I was in school with Richard, and I thought I'd get a Teddy for his daughter!\"<br>\r\n<br>\r\n\"Oh, Hi, Aunt Christine, sure, come in. Kid is really nice. Parents are great people, too. She'll so love the Teddy! Hey, Molly, come see what you got as a surprise gift!\"</span></div></div>",
            "created":1193505780,
            "id":457438,
            "title":"Richard Burrows"
        },
        "122":{
            "choices":[
                "hang up",
                "talk more to Frank"
            ],
            "content":"<div class=\"\"><div> <span>Christine heard a soothing voice on the other end of the line say, \"'Ello?\"<br>\r\n<br>\r\n\"...Hi...Do you remember a Christine from elementary school?<br>\r\n<br>\r\n\"gimme a sec...Where you the girl all alone at the lunch table?\"<br>\r\n<br>\r\n\"Yes...\"<br>\r\n<br>\r\n\"Ah, I remember you.\"<br>\r\n<br>\r\n\"And I remember how you used to tease me. Tell me, do you feel the same way about me now?\"<br>\r\n<br>\r\n\"No.\"<br>\r\n<br>\r\nChristine breathed a sigh of relief. <br>\r\n<br>\r\n\"But is that a good thing? All through fourth grade...I was secretly in love with you. I only teased you to try and cover it up.\"<br>\r\n<br>\r\nTears welled up in Christine's eyes. Maybe her relationships with her classmates were not what she thought they were!<br>\r\n<br>\r\nBut could she stand to stay on the line?<br>\r\n<br>\r\n</span></div></div>",
            "created":1079211900,
            "id":191696,
            "title":"The Confession"
        },
        "124":{
            "author_id":"shadowpup",
            "author_name":"Moody Blue: Needs an Upgrade",
            "choices":[
                "The Information matches and she finds him",
                "The information is not a match"
            ],
            "content":"<div class=\"\"><div> <span>           Kevin Dunne was the ring leader of the boys who taunted Christine. Thinking back on him reminded her of \"Spanky\" from the Little Rascals.  The difference is that Spanky was nice, Kevin wasn't.  Should she try to see if he's listed in the book?  Should she reopen old wounds?  <br>\r\n<br>\r\n           Christine takes the bull by the horns and starts flipping through the book.  Low and behold, his name is there, or so she thinks.  She decides to go the computer and type in the info to see if this really is him.<br>\r\n<br>\r\n           What will she find?</span></div></div>",
            "created":1079213880,
            "id":191700,
            "title":"The Grade School Bully"
        },
        "13":{
            "author_id":"themilkman",
            "author_name":"The Milkman",
            "choices":[
                "Does she find The Milkman?",
                "Does The Milkman want to be found?",
                "Does another name appear that interests her?",
                "Does she give up her search for classmates?"
            ],
            "content":"<div class=\"\"><div> <span>The first person she remembered was the person they all called \"The Milkman\".  She thought about that crazy nickname for a ten year old boy and she recalled the rumors that this boy's father was a door-to-door delivery person.  Kids can be cruel.<br>\r\n<br>\r\n\"The Milkman\" was a boy with curly blonde hair, large smile and an off-the-wall sense of humor.  She knew that if she did find this person he'd probably be the first one to forgive her of her past transgression; the name calling and the spilt milk all over him.<br>\r\n<br>\r\nShe turned on her computer, typed in \"Finding Classmates\" and a list of websites magically appeared.  She chose one, typed in her city and the school she went to and...</span></div></div>",
            "created":1078959600,
            "id":191449,
            "title":"The First Soul"
        },
        "131":{
            "choices":[
                "Does the Milkman answer?",
                "Does the e-mail come back undeliverable?"
            ],
            "content":"<div class=\"\"><div> <span>She scrolls down the list of names from her class, each one bringing a painful memory to life.  Then she spots the one she's looking for...Todd Needlemire.  The Milkman.  Beside his name there is the familiar blue click to send an e-mail link.  She moves her pointed to the link, then hesitates.  Will he want to hear from her?  Will he even remember?  She sits that way for a long time, then finally presses the mouse button and types a short e-mail message, pressing the send button....</span></div></div>",
            "created":1079020260,
            "id":191533,
            "title":"Connection"
        },
        "1311":{
            "author_id":"themilkman",
            "author_name":"The Milkman",
            "choices":[
                "How does Christine respond",
                "Does she continue to stare at the screen"
            ],
            "content":"<div class=\"\"><div> <span>Christine was shocked when she noticed a new email from a Todd Needlemire.<br>\r\n<br>\r\n<i>Dear Christine,<br>\r\nThanks for your letter.  I haven't given much thought into my Elementary days and I must admit I don't remember too much of those times.  I do remember a disabled girl who, was to strong to admit she needed a friend, who would chime in with \"The Milkman\" nickname.  If this person is you I am glad you are finally trying to face the demons in your life.  I also know, like me, our classmates weren't to kind to you either.<br>\r\n<br>\r\nWhat do you say we try to bridge that gap and try and become friends.<br>\r\n<br>\r\nWrite back soon,<br>\r\nTodd</i><br>\r\n<br>\r\nOnce again Christine stared at a blank screen not knowing what to write.</span></div></div>",
            "created":1079368980,
            "id":191871,
            "title":"The Letter"
        },
        "1312":{
            "author_id":"starr.r",
            "author_name":"Starr* Rathburn",
            "choices":[
                "Find another way to get in touch with him",
                "Decide to try to find someone else"
            ],
            "content":"<div class=\"\"><div> <span>For a minute, she was on pins and needles, wondering what the reply would be. Then she couldn't wait any more--she clicked on Inbox to see if any of her other emails had been answered. Her heart fell when she saw in the message line <i>Undeliverable</i>. Hoping it was from someone other than the Milkman, she held her breath, then clicked to open the message.<br>\r\n<br>\r\n<i>Your e-mail is undeliverable. No such mailbox at this address.</i><br>\r\n<br>\r\nFigures. I should've known something like this would happen, she thought.<br>\r\n<br>\r\nWhat will she do next? </span></div></div>",
            "created":1193606460,
            "id":457978,
            "title":"Undeliverable"
        },
        "132":{
            "choices":[
                "What happens if she goes on looking for Milkman?",
                "Does she give up and look for other familiar names in the data banks?"
            ],
            "content":"<div class=\"\"><div> <span>She finds a list of school mates who went to her school and notices that \"The Milkman\" alias Danny White, was listed as being in the site's data bank.<br>\r\nShe brought the data to the screen and saw that his last known address was not far from where she lived.  There was also a phone number too.<br>\r\n\"I'll give it a try tomorrow,\" she thought to herself, \"perhaps someone could tell me where he is if he doesn't live there any longer.\"  She nodded to herself with satisfaction that she had made the decision to go ahead.<br>\r\nThe next day she rang the number and a woman answered.  <br>\r\n\"I..am..looking for Danny White please? Does he still live there?\" she asked unsteadily.<br>\r\n\"What for?  Are you a cop or something?\" came the woman's rasping voice through the mouthpiece.<br>\r\n\"No, no.  I think I may know him from school.  I am just looking for old friends to talk to, that's all.\"<br>\r\n\"Well, you're more as likely as not find him at the cop station or holed up somewhere, honey.  I sure as h--- don't know where he is right now.  Left here a year ago, something to do with his work he said.  Work!  That's a laugh!  He's a delivery man for the mob you know, dealing with the white stuff if you get my drift?  They call him The Milkman, the name certainly fits.  That's all I can tell you, shall I let him know you called if I hear from him?\"<br>\r\n\"No, no thank you.  I'll try and find him myself,\" Laura lied and replaced the receiver.<br>\r\nWhat to do now? she mused.  Should I continue looking for him or start looking for someone else to chat with?</span></div></div>",
            "created":1079633580,
            "id":192210,
            "title":"The Milkman's Revelation"
        },
        "133":{
            "author_id":"sneezy",
            "author_name":"ACE",
            "choices":[
                "Should she go ahead and introduce her to the mailman?",
                "Or should she continue searching for other friends?"
            ],
            "content":"<div class=\"\"><div> <span>           Christine goes to computer to search for more people whom she met in school. A name appears on the screen whom she has seem to met when she was in scholl. The site has the persons email and phone number. This person she knew was known at eht Mailman, whom delivered mail to her on a daily basis. She did not recogize him at all. He had changed drastically since they were in school.<br>\r\n<br>\r\n          Should she introduce herself to the mailman when she sees him the next day? Or should she just continue to go on search for more people she should meet? Or what should she do now?</span></div></div>",
            "created":1078961400,
            "id":191456,
            "title":"New Search"
        },
        "1332":{
            "author_id":"dynomitenag1",
            "author_name":"lioness",
            "choices":[
                "Marsha responds to Christine's e-mail",
                "Marsha receives, but never answers the e-mail"
            ],
            "content":"<div class=\"\"><div> <span>As Christine continued her search, she came across the name of a girl with whom she had been quite friendly in second and third grades.  She pondered a few moments and then decided to e-mail her.  <br>\r\n<br>\r\nThey were very close friends at a time when she only had one other friend her age to pal around with.  They had enjoyed many hours of play at each other's homes.  They had even written each other letters so they could experience receiving mail! <br>\r\n<br>\r\nChristine was really quite enthusiastically awaiting a response from her old friend.  If anyone would respond to her, surely Marsha would.</span></div></div>",
            "created":1088203080,
            "id":204659,
            "title":"Old pal found!"
        }
    },
    "info":{
        "author_id":"shadowpup",
        "author_name":"Moody Blue: Needs an Upgrade",
        "brief_description":"Search for grade school classmates, and seeing if opinions are same after thirty years.",
        "created":1078951140,
        "description":"<td align=\"left\" class=\"norm\">           This is about a woman, in her mid-forties, who tries to find classmates from elementary school.  The woman's purpose for her search is to see if these classmates still feel the same way about her now as they did then.  <br>\r\n<br>\r\n           The searcher is disabled, now married, and the mother of a three year old boy.  She has a great deal of pain when she thinks of her younger days.  All she ever wanted was a friend then.  She felt that she never had a safe place to fall.  Her family only \"tolerated\" her.  She had no friends in the neighborhood.  School was an unsafe place for her.  Teachers were not her allies.  She was truly alone.<br>\r\n<br>\r\n</td>",
        "id":825772,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1460485080,
        "modified":1460485080,
        "pretty_title":"The Arithmetic of Life"
    }
}