{
    "chapters":{
        "1":{
            "author_id":"nemryn",
            "author_name":"nemryn",
            "choices":[
                "Try it at home",
                "Try it with Sarah",
                "Try it at school",
                "Try it somewhere else",
                "Read the instructions first"
            ],
            "content":"<div class=\"\"><div> <span>Jake Miller was bored. Bored, bored, bored. He was bored at school, bored at home, and bored <br>\r\neverywhere else. His family was always the same, his friends were always the same, and his <br>\r\nclasses were always the same. He often wished that things would change. Little did he <br>\r\nknow...<br>\r\nOne boring day, Jake was walking home when something strange caught his eye. He looked <br>\r\naround, and discovered a scrap of color, almost obscured by a large bush, lying in the ditch <br>\r\nat the side of the road. Intrigued for some reason, Jake moved closer to it, so he gould get <br>\r\na better look. It was a light blue shoebox, with 'X-39' sloppily scrawled on it in black <br>\r\nmarker. Jake knelt down to pull it out of its spot in the bush, and as he touched it, he <br>\r\nfelt a strange sense of... rightness. Somehow, he knew that this was what he was looking <br>\r\nfor. This was the answer to his boredom. Excitedly, Jake stuffed the box into his backpack <br>\r\nand hurried back to his house.<br>\r\nOnce he got home, he ran straight up to his room, ignoring his father's greeting from the <br>\r\nother room. He shut the door to his room, ensuring that his bratty sister wouldn't bother <br>\r\nhim while he examined his discovery. Gingerly, he opened the box and dumped its contents <br>\r\nonto his bed. Inside was a strange device, about the size and shape of a TV remote, but a <br>\r\nlittle lighter. It had three buttons, marked 'Gender', 'Swap', and 'Copy/Paste', as well as <br>\r\na number of smaller buttons. There was also an illuminated screen, divided into five <br>\r\nsections- 'Body', 'Clothes', 'Mind', 'Life', and 'Other'. Also inside was a small sheet of <br>\r\npaper and a large instruction manual. Jake picked up the paper and read it.<br>\r\n'Congratulations! You are now the proud owner of an X-39 Attribute Alterator, the latest in <br>\r\nalteration technology! The X-39 is an amazing and powerful device, capable of changing <br>\r\npeople in a limitless number of ways. And the best part is, they won't even realize it! The <br>\r\nX-39's patented RealityLok(tm) feature ensures that the people you change think they've <br>\r\nalways been that way. Only you know the difference!'<br>\r\n<br>\r\nJake grinned. This was an amazing find. He wouldn't be bored now!</span></div></div>",
            "created":1289451600,
            "id":992096,
            "title":"The Beginning"
        },
        "11":{
            "author_id":"nemryn",
            "author_name":"nemryn",
            "choices":[
                "Himself",
                "Zach",
                "Allison",
                "His mom",
                "His dad"
            ],
            "content":"<div class=\"\"><div> <span>Jake decided he would try his new find at home first. But who would he use it on? If he altered something about himself, he could keep it a secret if it didn't work. He could use it on Zach; he'd always wondered what having an older sister would be like. Or he could use it on Allison, and hopefully make her less annoying. Or he could use it on him mom or his dad, maybe make them a little more interesting.<br>\r\n<br>\r\nWho would he try it on first?</span></div></div>",
            "created":1295931600,
            "id":1042104,
            "title":"Try it at home"
        },
        "111":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Gender",
                "Copy/paste",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Whih option will he try first?</span></div></span></div>",
            "created":1395291600,
            "id":1763593,
            "title":"Himself"
        },
        "1111":{
            "author_id":"rosenheim34",
            "author_name":"rosenheimer",
            "choices":[
                "it worked",
                "it went wrong",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Always curios Jake decided on the gender option and pressed the according button…</span></div></span></div>",
            "created":1479272400,
            "id":2237831,
            "title":"Gender"
        },
        "1112":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "He copies himself",
                "He copies someone female",
                "he copies someone male"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jake looked at all the features on the remote, but he became most intrigued by the copy and paste aspect of the remote...</span></div></span></div>",
            "created":1554094800,
            "id":2638097,
            "title":"Copy/paste"
        },
        "11122":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "He copied his sister",
                "He copied his mother",
                "He copied the jogger (will add reader's choice options here)"
            ],
            "content":"<div class=\"\"><div> <span>There were some people to choose from at his house, but he worried about copying himself. His father and brother were at his football scrim, so he couldn't choose them. Jake looked around his house. His sister was in her room doing who knows what, his mother was in the kitchen preparing something, and outside a jogger was stretching before starting her jog</span></div></div>",
            "created":1554094800,
            "id":2638100,
            "title":"He copies someone female"
        },
        "111221":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "He pasted her onto himself",
                "He pasted her on his mom",
                "He pasted her onto the runner outside"
            ],
            "content":"<div class=\"\"><div> <span>Allison was in middle school, so she had gotten significantly worse since starting puberty. Before she was merely a bother to Jake, but now she wanted nothing to do with Jake and still managed to bother him. While using having two of her around seemed annoying it could also be hilarious. He copied her currently. She was wearing a light blue blouse, a matching skirt, and black thigh high socks. </span></div></div>",
            "created":1554094800,
            "id":2638105,
            "title":"He copied his sister"
        },
        "1112211":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "He pasted only her body/clothes onto himself",
                "He pasted her life onto himself",
                "Other options (accidents)"
            ],
            "content":"<div class=\"\"><div> <span>Allison stopped suddenly stopped moving on her bed; her legs kicking up and down frozen in mid-air. Jake looked around to see this was the same everywhere. He was a bit freaked out, so he decided to quickly paste her onto himself to start time again.</span></div></div>",
            "created":1554094800,
            "id":2638109,
            "title":"He pasted her onto himself"
        },
        "11122113":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "It pasted her mind onto him",
                "It pasted her life onto him",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Right before he chose, he fumbled with the remote landing on an unexpected option.</span></div></span></div>",
            "created":1554094800,
            "id":2638110,
            "title":"Other options (accidents)"
        },
        "111221133":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "It pasted her entirely over him, except her life (makes him her clone)",
                "It pasted her entirely over him, (makes him her twin)",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Somehow, it was able to choose an option listed under other onto him. </span></div></span></div>",
            "created":1554094800,
            "id":2638111,
            "title":"Other"
        },
        "1112211331":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Let's test each other's knowledge of ourselves",
                "Let's look at each other's body, are we identical",
                "Other options?"
            ],
            "content":"<div class=\"\"><div> <span>The last thing Jake saw was a bright flash of light as the X-39 remote went off. Jake raised his arms and a leg to guard himself from whatever the remote was going to do.<br>\r\n<br>\r\nAllison suddenly found herself in her weird brother's room. <br>\r\n<br>\r\n\"Why am I here?\" she thought to herself confused. She was just reading her phone in her room, and now she was standing on one foot and arms covering her face. What was she guarding herself from? <br>\r\n<br>\r\n\"Whatever...\" she mumbled. Her prude of a brother would probably get angry at her for being in his room anyway. Not that she really cared. <br>\r\n<br>\r\nWalking out of his room, she headed for the bathroom. As she went to open the door, it slammed into her face. Her brother probably just broke her nose.<br>\r\n<br>\r\n\"Idiot watch where you're doing,\" Allison growled.<br>\r\n<br>\r\n\"I'm not an idiot, you should've been more... \" Another Allison responded aggressively. <br>\r\n<br>\r\nThey looked at each other,  two Allisons wore the same surprised expression, light blue blouse, matching skirt, and black socks.<br>\r\n<br>\r\n\"Who are you?!\" Allison pointed from the ground at herself in the bathroom.<br>\r\n<br>\r\n\"I'm Allison Miller! Who are you?!\" Other Allison replied.<br>\r\n<br>\r\n\"No, I'm the real Allison Miller! You must be a identity stealer!\" Allison accused.<br>\r\n<br>\r\n\"Honey, I heard a loud slam are you OK?\" Her mother asked.<br>\r\n<br>\r\n\"Yep, everything's fine!\" They responded simultaneously. <br>\r\n<br>\r\n\"Ok...\" Her mother responded confused. She could swear she heard two voices.<br>\r\n<br>\r\n\"Let's go to my room, we can figure this out there.\" Other Allison responded.<br>\r\n<br>\r\n\"Wait, I have to pee first, and you know.\" Allison informed her other.<br>\r\n<br>\r\n\"Ok, I left them on the counter.\" Other Allison told her.<br>\r\n<br>\r\n\"Oh, cool.\" Allison said.<br>\r\n<br>\r\nAllison grabbed the box and replaced her tampon. She then peed, wiped, flushed, washed her hands, and hurried to she her other. Where she found her laying on the bed continuing to read her phone. <br>\r\n<br>\r\n\"Ok, where do we start?\" Other Allison said putting down her phone.</span></div></div>",
            "created":1554094800,
            "id":2638119,
            "title":"It pasted her entirely over him, except her lif..."
        },
        "1112211332":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "\"Found a remote\" (reveal the remote to your sis)",
                "\"Found this outfit on sale\" (hide the remote from your sis))"
            ],
            "content":"<div class=\"\"><div> <span>The last thing Jake saw was a bright flash of light as the X-39 remote went off. Jake raised his arms and a leg to guard himself from whatever the remote was going to do.<br>\r\n<br>\r\nSlowly opening her eyes, she found herself relatively unharmed. Julia took a quick look over herself. She was the same as always. <br>\r\n<br>\r\nHer room was now set up more similarly to Allison's, but nothing else seemed to have changed. Until she noticed her outfit. Her outfit was one she did not own; it was her sister's outfit.<br>\r\n<br>\r\n\"Oh, that's lucky.\" Julia thought aloud. She deduced that the remote must've only given her the outfit of her twin.<br>\r\n<br>\r\n\"What is lucky?\" a similar voice asked from her doorway.<br>\r\n<br>\r\nStepping in front of the remote on the ground, Julia obscured the remote from sight. \"I just got something good.\"<br>\r\n<br>\r\nAllison narrowed her eyes, \"Really well... When did you get a matching outfit to mine?\" <br>\r\n<br>\r\nJulia brushed her hair subtlety, bit her lip, and said \"Well, I...\"</span></div></div>",
            "created":1559883600,
            "id":2669966,
            "title":"Jake is now Julia (Allison's twin)"
        },
        "1112212":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "He pasted Allison's body on her",
                "He pasted a mental attribute onto her",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>No way was he going to be her, but if he pasted her onto the jogger; he might lose track of her. That left one possible candidate. <br>\r\n<br>\r\nPeaking in on her, Jake saw her watching TV as she cooked her pasta dish. Aiming the remote at her...</span></div></span></div>",
            "created":1554094800,
            "id":2638151,
            "title":"He pasted her on his mom"
        },
        "11122123":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Jake pasted Allison's entire life onto her",
                "Jake pasted only an aspect of Allison's life on her",
                "Other "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jake didn't want to mess up his mom's cooking, so at most he wanted to only paste a part of Allison's life onto her. If he could do it right...</span></div></span></div>",
            "created":1554094800,
            "id":2638152,
            "title":"Other"
        },
        "111221233":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Pasted Allison fully onto his Mom",
                "Made An Allison his Mom's age",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Or at least he thought he found a custom setting to allow him to paste only part of her, instead it...</span></div></span></div>",
            "created":1554094800,
            "id":2638154,
            "title":"Other "
        },
        "1112212331":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Allison wins the tug of war",
                "Jake wins the tug of war",
                "The tug of war is a draw sending the remote flying somewhere else"
            ],
            "content":"<div class=\"\"><div> <span>As he searched through the settings he wanted, his mom moved away from the stove, to change the channel on the TV. His sister busy on her phone didn't notice him pointing it at her.  His mother started to shout up to him, when he clicked copied.<br>\r\n<br>\r\n\"Jake do you know where you...\"  <br>\r\n<br>\r\nJake quickly headed downstairs to find his mom frozen in place. Thus, he rushed to pick a custom option and aimed at his mother. <br>\r\n<br>\r\nMartha was focused when Jake copied Allison. Her mouth wide open to ask him a question. In an instant, his mother's kind face turned into an annoyed pout. Her warm eyes and pleasant tone became cold and agitated.<br>\r\n<br>\r\n\"... put the remote dumbass?\" The new Allison sneered, <br>\r\n finishing her Mom's question.<br>\r\n<br>\r\nWell, that didn't quite work as he thought. <br>\r\n<br>\r\n\"Uh, Mom you alright?\" Jake asked.<br>\r\n<br>\r\n\"What? Do I even remotely look or sound like Mom?\" Allison two replied offended slightly.<br>\r\n<br>\r\n\"Just a joke, Ally, cool it,' Jake said worried.<br>\r\n<br>\r\n\"Whatever, but let me  have the remote for a sec,\" demanded Allison grabbing at it.<br>\r\n<br>\r\n\"Wait! That isn't the TV remote!\" Jake tried to explain to deaf ears.<br>\r\n<br>\r\nAllison, too stubborn to listen him, pulled even harder on the remote. Jake was now locked in a tug of war over his new remote. </span></div></div>",
            "created":1554267600,
            "id":2639208,
            "title":"Pasted Allison fully onto his Mom"
        },
        "11122123313":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Why are you asking me? I don't know! (play dumb)",
                "This is... mom (truth route)"
            ],
            "content":"<div class=\"\"><div> <span>His sister's clone had caught him off guard, her grip on the remote was much better than his. He tried to use his size and strength to muscle it off her, but she held on. They went in circles trying to use their momentum to shake off the other.<br>\r\n<br>\r\n In a final pull from both of them, they were sent crashing onto the couch with the remote sent down the hall to the stairs. Both of them quickly got up the floor and looked at where it landed. Allison picked it up.<br>\r\n<br>\r\n\"Jake! Who's that!\" Allison original asked pointing the remote at her duplicate.<br>\r\n<br>\r\n\"Who is she Jake?\" Allison two asked. <br>\r\n<br>\r\n</span></div></div>",
            "created":1554699600,
            "id":2642109,
            "title":"The tug of war is a draw sending the remote fly..."
        },
        "1112212333":{
            "author_id":"crocodile",
            "author_name":"Crocodile",
            "choices":[
                "Jake pastes Allison's clothes onto his Mom",
                "Jake pastes Allison's hobbies onto his Mom",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What did Jake paste of Allison's onto his mother?</span></div></span></div>",
            "created":1554094800,
            "id":2638306,
            "title":"Other"
        },
        "1112213":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "The Jogger was now physically Allison",
                "The Jogger was now wearing Allison's clothing",
                "Mind/life pastes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He didn't want his mom or himself to be Allison.<br>\r\n<br>\r\nJake decided that the jogger would be the best test subject. </span></div></span></div>",
            "created":1554094800,
            "id":2638113,
            "title":"He pasted her onto the runner outside"
        },
        "11122132":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "He decided to use the remote again ",
                "He waited to use the remote tomorrow at school ",
                "He shared the remote with someone else"
            ],
            "content":"<div class=\"\"><div> <span>Jake didn't want to do anything too drastic, so he played it safe and only pasted Allison's clothing on to the jogger. Mental changes to her memory was made to make sure that the jogger would not notice anything different or unusual about the situation<br>\r\n<br>\r\nJake pasted his sister's clothing exactly.<br>\r\n<br>\r\nThe Jogger's clothing was instantaneously replaced with his sister's outfit. Her height was difficult to tell from a far, but now he was certain she was quite a bit taller with a built frame to his sister's skinny body. <br>\r\n<br>\r\nHis sister's blouse looked closer to a tank top than a belly shirt on the Jogger. The skirt barely covered her butt, allowing any person to see his sister's underwear. The thigh high socks were about knee high now on the now shoe-less jogger. With certain stretches, you could see that his sister's bra could barely contain her boobs. <br>\r\n<br>\r\nThe Jogger finished her warm up, but the wind outside on her bare skin was making her uncomfortable. However, she still decided headed out in his sister's outfit.<br>\r\n<br>\r\nAs the Jogger left, his father and brother came back to the house giving him more test subjects.</span></div></div>",
            "created":1554267600,
            "id":2639220,
            "title":"The Jogger was now wearing Allison's clothing"
        },
        "111221321":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Yes (Multi-select option is not what he thought it was)",
                "No "
            ],
            "content":"<div class=\"\"><div> <span>His first test with the remote went perfectly well, but what were the limits? He was too excited to stop using the remote tonight. Copying his sister again, he looked at his options. <br>\r\n<br>\r\nMental, physical were probably a good start to test. Could this device really do more than change people's clothes? <br>\r\n<br>\r\nHe chose in the target category the multi select option, then he picked both physical and mental changes.<br>\r\n<br>\r\n\"Do you wish to confirm settings?\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1559883600,
            "id":2669969,
            "title":"He decided to use the remote again "
        },
        "1112213211":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Each family member had the memories and thoughts of the original Allison",
                "Each family member kept their original role, but thought like Allison"
            ],
            "content":"<div class=\"\"><div> <span>When Jake pressed confirm, he didn't realize the implications of the multi select option. Multi select was meant to describe multiple targets, not multiple categories. Thus, everyone within the Miller household in that instant changed, except Allison. <br>\r\n<br>\r\n5 Allisons now occupied the Miller home, and only one was wearing properly fitting clothing. <br>\r\n<br>\r\nThe Allison in Jake's old clothes was stunned and confused.  </span></div></div>",
            "created":1559883600,
            "id":2669971,
            "title":"Yes (Multi-select option is not what he thought..."
        },
        "11122132112":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Jake tells Allison what happened and asks for her help",
                "Jake is envious of Allison and decides to copy parts of Allison's life",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Jake looked down at himself. \"Gah, I'm such a dumbass.\" If only he was a bit more careful, he wouldn't have made such a stupid mistake like usual. <br>\r\n<br>\r\n\"Are you just realizing that now? My son might be a bigger idiot than I thought,\" an Allison in his dad clothes retorted. <br>\r\n<br>\r\nOuch, Jake thought. His father was usually out of touch and wrong in his comments, but that was a pretty good burn. Jake couldn't come up with a comeback at the time, so he just stuck his tongue out at him. His father wore a satisfied smirk with Allison's face.<br>\r\n<br>\r\n\"Dinner's ready, everyone, and I'm hungry! So I'm not waiting; hurry if you want to eat.\"  Some Allison said in the kitchen. <br>\r\n<br>\r\nJake and his father were also quite hungry, so they quickly made their ways to the dinner table. Where an Allison in his mother's business suit had started eating. Jake looked at his plate to find spaghetti and meatballs. <br>\r\n<br>\r\nHe looked at it in contempt. If mom wasn't so lazy, she wouldn't force her family to eat this crap. <br>\r\n<br>\r\n\"Gosh, what a tasty meal we have here.\" Jake said sarcastically. His father snorted than covered his face in an attempt to stifle his laugh, <br>\r\n<br>\r\n\"Jake, you're so annoying, can you for once in your life respect and appreciate me? I swear you don't even realize the how difficult you are!\" His mom almost screamed.<br>\r\n<br>\r\nHe could be a bit annoying sometimes, but his mother never listened to him.<br>\r\n<br>\r\n\"Ugh, why are we eating this again!\" Allison groaned. <br>\r\n<br>\r\n\"Seriously! We should have like chicken salad or something,\" Zach added walking in with his sister. <br>\r\n<br>\r\nThat sounds sooooo good right now, Jake thought.<br>\r\n<br>\r\nHis mother in a much different tone replied, \"Oh, you're totally right, I'm sorry Allison; I don't listen to you enough.\"<br>\r\n<br>\r\nJake's draw nearly dropped to the floor. \"UGH!\" He could not believe his mom right now. \"You are so unfair!\" How could she treat her children so differently. \"I'm not hungry.\"<br>\r\n<br>\r\n\"Don't soil your panties over something so trivial Jake!\" Allison quipped producing laughter from his entire family. <br>\r\n<br>\r\nAfter Jake stomped back to his room, he pulled out the remote. I was having a good day till the change. I have to change this back. <br>\r\n<br>\r\nWhen Jake attempted to turn himself back however, all he felt was disgust at his old form. <br>\r\n<br>\r\n\"Oh crap!\" Jake realized how much Allison's mind was impacting him. This was officially the shittiest day of his live... ever. Maybe even the worst day of any person's life in history.</span></div></div>",
            "created":1559883600,
            "id":2669984,
            "title":"Allison in every role"
        },
        "111221321121":{
            "author_id":"goryu",
            "author_name":"Feros",
            "choices":[
                " Alisson helps to reverse the whole situation",
                "Alisson family",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Hey Ally, I need to talk to you.<br>\r\n<br>\r\nHuh? What do you want your loser? Says Alisson<br>\r\n<br>\r\nListen, I know I'm a loser, but can you shut up and listen to me for a few minutes? (Wow, I don't remember ever doing that to her)<br>\r\n<br>\r\nAlisson was visibly surprised by the answer and nodded<br>\r\n<br>\r\nWell, didn't you notice anything different about this meal? Ask Jake<br>\r\n<br>\r\nBesides the fact that the mother finally agreed with me that the food she makes is always the same crap? Oh, you embarrassed yourself in front of everyone and they laughed with me, normally the mother would have told me to be quiet. Says Alisson<br>\r\n<br>\r\nArgh, exactly and do you know the reason for this? Question Jake<br>\r\n<br>\r\nDid they recognize that I am the best person in this house? Says Alisson with little confidence<br>\r\n<br>\r\n\"You really are the best compared to the rest\" In fact, it's all the fault of this, said Jack, showing the remote.<br>\r\n<br>\r\nHuh? A tv control? What are you talking about, you nerd. Alisson ask.<br>\r\nShut up and listen to me, short version, this control can copy anything from one person and paste it on another, this includes appearance, clothes and personality as far as I found out and unintentionally I copied your  appearance and personality for everyone in the family. Explains Jake in the same tone that his sister uses when she doesn't wanna explain something.<br>\r\n<br>\r\n<br>\r\nWhat the hell are you talking about, Jack?<br>\r\n<br>\r\nLook at us, you idiot, don't you think it's strange that we all have the same body as you? And suddenly we agree with you? Points Jake<br>\r\n<br>\r\n“Alisson noticed that something was really wrong, but ... Didn't everyone always look the same?”<br>\r\n<br>\r\n<br>\r\n<br>\r\nOkay, did you say you're thinking the same as me? Prove it! I will speak the name of someone in the family and you will have to answer what I think of them. Challenged Alisson<br>\r\n<br>\r\nBe my guest! \"It will be easy, I just need to let my\" Alisson \"side tell me\".<br>\r\n<br>\r\nWhat do you think of our mother? The one you always defend? Ask Alisson<br>\r\n<br>\r\nA lazy woman who never wants to do anything different and always makes the same foods. I know she works, but it wouldn't take a little more effort to do something different?. \"Jack always had a problem with his mother, she never tried to understand him ... right?\"<br>\r\n<br>\r\nAlisson raised an eyebrow in doubt because that is exactly what she thinks of their mother, but as has been said, Jack has always defended her.<br>\r\n<br>\r\nOkay, next question and our father?<br>\r\n<br>\r\nHe lacks attitude! He is always lost if he is pressured a little more, the remote has made an incredible improvement on him for having finally given the courage to respond. Jack answers without noticing that he’s speaking more and more like Alisson.<br>\r\n<br>\r\nAlisson was impressed, either Jack is an excellent actor and he never told or that remote is true. But one final question was missing.<br>\r\n<br>\r\nRight…. Last question, what do you think of Jack?<br>\r\n<br>\r\n<br>\r\nAt that time, Alisson's personality completely dominated Jack's brain: Argh I'm an idiot, a nerd, a lazy person who can only complain. My god, how unbearable I was before the remote.<br>\r\n<br>\r\nAlisson was legitimately impressed that Jack would never agree with her and described to himself exactly how she thinks of him. It seems that this remote is true, in this case ...<br>\r\n<br>\r\nOk, Jack, I believe you for now and I can see that you have made great improvement, that was the best thing that happened in your life. Alison said admiringly her new “brother”<br>\r\n<br>\r\n<br>\r\nLook, I have to agree with you but I need to get back to normal with our family. Jack explained and sighed.<br>\r\n</span></div></div>",
            "created":1597108500,
            "id":2883684,
            "title":"Jake tells Allison what happened and asks for h..."
        },
        "1112213211213":{
            "author_id":"goryu",
            "author_name":"Feros",
            "choices":[
                "Jake agrees",
                "Jake thinks this is absurd",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>It makes sense ... but let me see this remote, I want to confirm something. Ask Alisson<br>\r\n<br>\r\nJack reluctantly passed the control over to Alisson.<br>\r\n<br>\r\nAlisson studied for a few minutes and then concluded.<br>\r\n<br>\r\n<br>\r\nNice work Jack, you made a complete physical and mental copy of me, tastes, personality, just a lack of memory, you really are \"me\" but with other roles. Exclaimed Alisson after the analysis.<br>\r\n<br>\r\nArgh, I know I know I'm an idiot! Jack complained to his sister.<br>\r\n<br>\r\nCorrecting, you were an idiot, because that was before the transformation, but now you evolved.<br>\r\n<br>\r\nBut anyway, let's see what we can do here. Said Alisson, analyzing the remote again. She thought her family was fine agreeing with her, but after Jack showed the reality, she started to find it very strange, so using the remove, she  quickly reversed the transformations EXCEPT Jack's.<br>\r\n<br>\r\n<br>\r\n<br>\r\nHmm? You did something? Jack said after seeing his sister use the controller.<br>\r\n<br>\r\nI just reversed the transformations ... except yours. Alisson said with a slight smile on her face.<br>\r\n<br>\r\nWhy didn't you undo mine ?? Jack exclaimed indignantly, unaware that he was acting like his sister when she was upset<br>\r\n<br>\r\n<br>\r\nVery simple Jack, I see a situation here where we can be great friends, understand each other, so I propose that you live your life like me for a day, see how pathetic you really were and then at the end of the day, we'll see if you still want to go back to normal. She said, challenging Jack<br>\r\n<br>\r\n<br>\r\nAlisson was always a privileged girl, with grades above average and high intelligence, she always saw herself \"above\" the rules, as they only served those who could not circumvent them. And as much as she liked the people she considered friends, she always felt superior, beyond what she really was, that's why she never found someone she could really call ‘equal”, to share her difficulties, but now that chance existed.<br>\r\n<br>\r\nShe could just copy everything from herself and paste it into Jack, but no ... she wanted more, she wanted to see him admit that he would much rather be like her and abandon his old life and soon she would have that pleasure.<br>\r\n</span></div></div>",
            "created":1597108680,
            "id":2883687,
            "title":" Alisson reverses everyone except jack"
        },
        "11122132112131":{
            "author_id":"goryu",
            "author_name":"Feros",
            "choices":[
                "Old Friends  New Point of View",
                "Old Friends New likes",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Looking closely at his sister, Jack pondered before answering, but he knew he didn't have much of a choice knowing her.<br>\r\n<br>\r\nOk Alisson, I spend more time \"being you\", it shouldn't be that difficult. Jack said.<br>\r\n<br>\r\nWith a smile on her face, Alisson exclaimed: You will see how boring your old life is, believe me.<br>\r\n<br>\r\nAs it was already night, Jack decided to go straight to his room and go to sleep, but he had a feeling of discomfort when looking at his pajamas.<br>\r\n\"Urgh, was it always that ugly?\" Well, I see that tomorrow, it will do for today, thought Jack.<br>\r\nWhen changing he ended up looking at her appearance in the mirror and felt a strange pride for her body.<br>\r\nHeh, it's more developed than many girls and I still have a few years to go ... Wait, ugh, stop it ... Alisson side of my head. Jack complained to himself and then went to sleep.<br>\r\n<br>\r\nWhen he woke up ... Jack looked around and wondered why he was in his brother's strange room ... until he remembered that he IS the brother.<br>\r\n<br>\r\nDamn, well, let's start, let's get some clothes first. Jack muttered.<br>\r\n<br>\r\nWhat Jack did not expect is that he went looking for clothes after clothes, but he did not find the ideal. The transformation made him have the same tastes as Alisson and she found her brother's clothes “horrible and dull as the owner”.<br>\r\n<br>\r\nGahh, I can't find anything!<br>\r\n<br>\r\nProblems getting dressed \"big brother\". Alisson's voice came from the hall.<br>\r\n<br>\r\nYes, I can't find anything decent here, how did I manage to use it before? Jack returned.<br>\r\n<br>\r\nIt's a good question, but I can help you, ”said Alisson, entering the room and not at all surprised to see Jack naked.<br>\r\n<br>\r\nWhat are you going…? Jack asked, equally unsurprised to be undressed and his sister seeing him, after all their minds are \"the same\" at the moment.<br>\r\n<br>\r\nAlisson just smiled, pointed the remote at her and then at Jack, giving a copy of the same look.<br>\r\n<br>\r\nOhh this is so much better than I have here! Jack exclaimed, walking around the mirror and admiring the look.<br>\r\n<br>\r\nIt is not? Have you ever imagined what practice it will be? Only one of us needs to get dressed and the controller can copy the look, said Alisson excitedly<br>\r\n<br>\r\nReally ... Wait, no ... That was just now, I'm going back to normal tonight! Jack said in agreement and stepped back a moment later.<br>\r\n<br>\r\n<br>\r\nOf course you will, Jack ... said Alisson \"agreeing\" with his brother.<br>\r\n<br>\r\nAfter that Jack went down to the cafe with his sister where two bowls of cereal were waiting for them.<br>\r\n<br>\r\nKids, I have to leave earlier today so please contain yourself with the cereal ok? Said their mother, explaining the reason for the simplest breakfast.<br>\r\n<br>\r\nBoth Jack and Alisson made a face of disgust, let out a grunt and continued to eat without even saying good morning.<br>\r\n<br>\r\nDid it cost her to wake up early to prepare something decent? Muttered Jack<br>\r\n<br>\r\nArgh what a horrible thing, we could even be eating eggs with bacon, but our mom is too lazy for that. Muttered Alisson.<br>\r\n<br>\r\nAnd everyone is smiling and enjoying her \"effort\", what a bunch of two-faces. Jack complained again.<br>\r\n<br>\r\nSee? Now you understand how I feel in this house. Said Alssion.<br>\r\n<br>\r\nI am agreeing more and more with you my sister. Jack agreed.<br>\r\n</span></div></div>",
            "created":1597278480,
            "id":2884817,
            "title":"Jake agrees"
        },
        "111221322":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Keep the remote to use in class",
                "Place the remote in sentry mode"
            ],
            "content":"<div class=\"\"><div> <span>Waking up early, he decided to head to school early for the first time in his life.<br>\r\n<br>\r\nAt school, the usual people were around. The girl's swim team were practicing, some teachers were arriving, and some of his friends were around.<br>\r\n<br>\r\nJake wanted to continue using the remote during class today, or he could try another feature he found that morning, on the remote. <br>\r\n<br>\r\nThis feature was called the sentry mode in a stationary position the remote would continually follow a pattern of specific instructions and not stop till a specific combination of buttons were pressed.<br>\r\n<br>\r\nThe instructions could be as simple as swap the hairstyles of the next two people to pass through the remote's range.<br>\r\n<br>\r\nThe instructions could also be to copy the first person's clothing to pass through it, then paste it on every following person to pass by it.<br>\r\n<br>\r\nJake decided to....</span></div></div>",
            "created":1567042800,
            "id":2709435,
            "title":"He waited to use the remote tomorrow at school "
        },
        "1112213222":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Option 1: Teacher's lounge",
                "Option 2: Swim pool locker room ",
                "Option 3: Front Entrance"
            ],
            "content":"<div class=\"\"><div> <span>Jake decided to try using sentry mode, he locked the remote to a certain set of instructions:<br>\r\n<br>\r\nOption 1. The remote copied the clothing of a person, then pasted it on to the next person to pass by. He set the remote in front of the teacher's lounge.<br>\r\n<br>\r\nOption 2. The remote copied every female individual to pass it once, then pasted them onto the next male to walk through it, in order of copying, making them their twin. He set the remote in front of the locker rooms to swim teams.<br>\r\n<br>\r\nOption 3. The remote copied the first person to pass by it. Every subsequent person to pass by would get a copy of their body, but Nobody would think anything is wrong. Their clothes and mind would adjust the best it could to adapt. He set the remote at the opening door.</span></div></div>",
            "created":1567043640,
            "id":2709441,
            "title":"Place the remote in sentry mode"
        },
        "11122132222":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Mylee was the only one copied",
                "The entire female swim team was copied",
                "Only a few female people were copied"
            ],
            "content":"<div class=\"\"><div> <span>Jake set the remote in front of the locker rooms. The remote was mostly hidden in a crack in the wall, but it had a clear view of the locker rooms. Jake was satisfied with his ploy and decided to watch to make sure it worked. He walked a safe distance away and casually sat around waiting. Since, he was the one who locked the device; he would be able to notice any changes, but no one else would. <br>\r\n<br>\r\nMylee Decker, the red headed ace swimmer for his school's team, was the first to pass by in her one-piece suit. She was only a sophomore, but her 6 foot height and perfect swimmer build made her seem much older. Mylee didn't need to put her hair up for her swim cap like other girls on her team because she had a pixie cut.<br>\r\n<br>\r\nThe next person to pass by was the janitor who's blue uniform quickly shifted into the skin tight suit Mylee had on. His ever present frown from working a dead end job turned into Mylee's determined smirk. His height grew to 6 feet and his body fat shifted location to his rear and chest. Some fat turned into strong muscles, but the janitor was now a identical to Mylee. He was no longer cleaning the locker rooms but was now heading to her swim practice.<br>\r\n<br>\r\nJake left to head to class waiting to see the results once school started...<br>\r\n<br>\r\n</span></div></div>",
            "created":1567044900,
            "id":2709451,
            "title":"Option 2: Swim pool locker room "
        },
        "111221322222":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Jake notices the differences in his first class",
                "Jake's PE class was swimming today"
            ],
            "content":"<div class=\"\"><div> <span>Mylee was only the first girl to pass by the remote. All her teammates and 3 coaches arrived after her and her twin had started. There were about 25 of them, and they were significantly smaller than other girl swim teams. This was not gonna be the case for long however, the boys swim team, which started after the girls' team, arrived. The boy's team was larger with 40 members with 4 coaches. <br>\r\n<br>\r\nThus, after the boy's team passed by the girl's team had a whopping 63 members and 6 coaches. With each member of the team being either a twin or triplet. The boy's team faded out of existence with the girl's team adding their resources to their own.<br>\r\n<br>\r\nThese massive changes all happened before school had even rang its first bell.<br>\r\n<br>\r\nJake would soon see the remote's influence...</span></div></div>",
            "created":1567045980,
            "id":2709466,
            "title":"The entire female swim team was copied"
        },
        "11122133":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Jake pasted a mental aspect of Allison",
                "Jake gave the runner Allison's life",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jake decided to try the mental or life changes instead. Seeing two Allison's was a reality Jake would rather not be apart of.</span></div></span></div>",
            "created":1554094800,
            "id":2638114,
            "title":"Mind/life pastes"
        },
        "111222":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "He pasted her onto himself",
                "He pasted her onto his sister",
                "He pasted her onto the runner outside"
            ],
            "content":"<div class=\"\"><div> <span>It was the Friday, so his mother had time to make dinner tonight. She was making some simple spaghetti and meatballs and watching TV. Surprisingly, she had not gotten out of her work clothes yet. <br>\r\n<br>\r\nToday, she had chosen a black suit jacket with a red button down shirt underneath, and a business skirt that was about knee length over black tights.<br>\r\n<br>\r\nHer focus was currently on finding the TV remote, so Jake was easily able to copy her in that moment.  </span></div></div>",
            "created":1554699600,
            "id":2642101,
            "title":"He copied his mother"
        },
        "1112221":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "He pasted her body onto him",
                "He pasted her clothes onto him",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>He didn't want anyone to find out about his new remote, so he thought it be best if he only tested it on himself. </span></div></span></div>",
            "created":1554699600,
            "id":2642119,
            "title":"He pasted her onto himself"
        },
        "1112222":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "He pasted part of her mentally onto his sister",
                "He pasted a part of her life onto his sister",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>His sister never fully appreciated his mother. She took most of what she did for granted. If Allison got a taste of her life, then maybe she would be nicer to everyone. </span></div></span></div>",
            "created":1554699600,
            "id":2642102,
            "title":"He pasted her onto his sister"
        },
        "111223":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "He copied the jogger",
                "Reader's choice",
                "Reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>Jake didn't want to use his annoying sister and having a second mother around would be pretty weird. Thus, the random jogger would be perfect subject. She had blue eyes and long brown hair done up in a ponytail,  and she looked around the height of about 5' 8\". She was wearing gray yoga pants, a purple and black shirt, with matching purple and pink running shoes. </span></div></div>",
            "created":1554094800,
            "id":2638101,
            "title":"He copied the jogger (will add reader's cho..."
        },
        "1112231":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Jake pastes her onto himself",
                "Jake pastes her onto his sister",
                "Jake pastes her onto his mom"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The jogger is about to begin her run, but she suddenly stops when you click the copy button on her. Jake was uncertain of what happened. He decided if he pasted her; it would probably fix things.<br>\r\n</span></div></span></div>",
            "created":1554094800,
            "id":2638126,
            "title":"He copied the jogger"
        },
        "11122311":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "He pasted her body and clothes on him",
                "He pasted her life onto him",
                "He pasted a mental characteristic or other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The jogger was quite hot and examining her body would be nice for research on the remote.</span></div></span></div>",
            "created":1554094800,
            "id":2638127,
            "title":"Jake pastes her onto himself"
        },
        "111223111":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Jake opened the window and hopped out",
                "Jake opened the door and ran past Allison",
                "Jake let the door open and tried to talk to Allison"
            ],
            "content":"<div class=\"\"><div> <span>Jake went back to his room and closed the door. His first test was ready. After a deep breath, he pressed the button. <br>\r\n<br>\r\nThe first thing he noticed was the alien weight on his chest. The jeans and t-shirt he was wearing had changed to he form fitting yoga pants and elastic shirt. It made him obviously aware of the differences in his current body to his old body. He put down the remote in his desk and poked at his chest. A shiver went down his body. Cupping them with both hands felt strange.<br>\r\n<br>\r\nHe opened his door looking both ways and went to the bathroom, locking the door behind him. On the way to the mirror, he could feel the bob of his ponytail and chest. The jogger had a blemish free face with serious looking blue eyes. He let his new hair go midway down his back and left the headband on the sink. The brown hair ticked and was much heavier than he expected.<br>\r\n<br>\r\nSuddenly, there was a knock on the door. He whipped his head around only to get face full of hair in it. <br>\r\n<br>\r\n\"Open up, I need to go!\" his sister's voice demanded.<br>\r\n<br>\r\nAstutely aware of his situation, he reached for his phone to find it not in his pocket. Mostly because he had no pockets, he realized instead that on his butt was the jogger's phone. <br>\r\n<br>\r\n\"Come on! It's an emergency.\"<br>\r\n<br>\r\nIt could not be worse for Jake, then the Jogger's phone got a text message. <br>\r\n<br>\r\n\"UGH!\" his sister said in response. She started to jimmy the door lock with what Jake presumed was a bobby pin.<br>\r\n<br>\r\n</span></div></div>",
            "created":1554354000,
            "id":2640051,
            "title":"He pasted her body and clothes on him"
        },
        "111223113":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "He pasted a mental characteristic of her",
                "He pasted her entire mind into him by accident",
                "He used a other option"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jake reconsidered it. If he was caught in her body, that would be a big problem.  However, mental effects are obviously not visible, and it would provide him a lot of information on the mind change button.</span></div></span></div>",
            "created":1554094800,
            "id":2638128,
            "title":"He pasted a mental characteristic or other"
        },
        "11122312":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "The remote landed face up on top of her phone",
                "The remote landed face down pointed towards him",
                "The remote landed face down pointed towards Allison"
            ],
            "content":"<div class=\"\"><div> <span>\"Ooof,\" Jake said with his eyes down on the remote. Jake ended up running straight into his sister who had left her room. Like the runner, she was frozen stiff, so Jake felt like he had run into a brick wall with his momentum completely cut short by his sister. He landed straight on his butt. <br>\r\n<br>\r\nLike Jake, Allison's eyes were on the device in her hand. She had her phone in hand with her eyes down on the text she was crafting.<br>\r\n<br>\r\nJake's momentum caused the remote to go flying into the air and straight out of his hands. In frozen time, it fell right into his sister's hands and on top of her phone she was texting with.</span></div></div>",
            "created":1559710800,
            "id":2669495,
            "title":"Jake runs into his sister (runner copied)"
        },
        "11123":{
            "author_id":"interestedgaze",
            "author_name":"AltGaze",
            "choices":[
                "Jake copied Zach",
                "Jake copied his Dad",
                "Jake copied the neighbor boy (reader's choice option placed here)"
            ],
            "content":"<div class=\"\"><div> <span>His mother had dragged his sister Allison to the mall. Allison hated to be seen in public with any of them. <br>\r\n<br>\r\nZach was just chilling on his computer. He was probably playing some game or watching game tape of himself.<br>\r\n<br>\r\nHis dad was doing yard work and knowing him would probably injure himself.<br>\r\n<br>\r\nAcross the street, the young boy was practicing his 3 point shot in his driveway.</span></div></div>",
            "created":1554094800,
            "id":2638125,
            "title":"he copies someone male"
        },
        "12":{
            "author_id":"struiner",
            "author_name":"Struiner",
            "choices":[
                "Body transformations",
                "Mental changes",
                "Gender swap",
                "Life alterations",
                "More- a lot more-"
            ],
            "content":"<div class=\"\"><div> <span>Jake was standing in front of Sarah's house, waiting for someone to answer the doorbell. Finally the door swung open, revealing a very cheerful Samantha. Apparently she was expecting someone else. As soon as their eyes met, her cheerful mood made place for a disappointed scowl. <br>\r\n<br>\r\n-\"Oh hey. It's you. Sarah's up stairs.\" She said levelly, looking down the street to check if noone else was coming. <br>\r\n<br>\r\n-\"Hi Samantha. Another date with Dave.\" He inquired, taking off his coat.<br>\r\n<br>\r\n-\"Yeah, what's it to you?\" She said, growingly agitated. \"Just go upstairs already.\"  <br>\r\n<br>\r\nDoing as she asked, he went up towards Sarah's room. <i>what was her problem?</i> He suspected Dave was late for another date again, the wrong boyfriend showing up making it extra painfull. He shrugged, either that or her period.<br>\r\n<br>\r\nSarah was at her desk, writing something down. He gave  a slight knock on the door. <br>\r\n<br>\r\n-\"Jake! What are you doing here!\" She got up smiling broadly. They kissed firmly before sitting down again, she in her deskchair, he in an old lazyboy slowly gathering laundry in the corner. He got out the X-39, getting ready to use it on her.</span></div></div>",
            "created":1506056400,
            "id":2389726,
            "title":"Try it with Sarah"
        },
        "122":{
            "author_id":"struiner",
            "author_name":"Struiner",
            "choices":[
                "Make Sarah a smoker.",
                "Something else.",
                "Something else entirely."
            ],
            "content":"<div class=\"\"><div> <span>\"So what 's up with your sister?\" He said, letting the device rest in his lap, and added grimly. \"She seemed... down.\"<br>\r\n<br>\r\n\"Oh, don't mind her. Mom's cut her off from smokes again.\" She waved it off as an annoying little cloud. \"Who needs that kind of poison anyways.\"<br>\r\n<br>\r\nSo this gave Dave an idea. Something he had always wondered about, and this seemed like a perfect opportunity to try it out. </span></div></div>",
            "created":1523768400,
            "id":2480112,
            "title":"Smokes for Sarah"
        },
        "1221":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "\"Hey Jake, you want a cigarette?\" Sarah asked",
                "Suddenly, the friends were interrupted",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey Sarah, you mind if I use your toilet?\" Jake asked, as an idea formed in his mind.<br>\r\n<br>\r\nSarah shrugged as she sat at her computer desk checking emails.<br>\r\n<br>\r\nJake took out the 'X-39' device from his jacket and walked down the corridor towards the stairs.<br>\r\n<br>\r\nPeering over the bannister, he watched as Samantha and her mother argued about cigarettes, unaware he was looking on.  <br>\r\n<br>\r\n\"These things will kill you.  I wont let that happen while I am here.\" her mother shouted.<br>\r\n<br>\r\nWith the device, Jake set the device to <b>Mind</b> and pointed it towards the family members.  As he scanned the device over Samantha in her leather jacket, a submenu appeared, listing all traits of the girl.  As he tapped into Addictions, he saw Smoking appear.  Pressing Copy on the device, he walked away back into Sarah's room as the verbal fight continued.<br>\r\n<br>\r\n\"You were quick.\" Sarah moaned, as she focused on uploading Facebook photos from her PC.  <br>\r\n<br>\r\n\"Yeah.  So what do you fancy doing?\" Jake inquired, as he sat on the bed behind Sarah.  As he pointed the device at Sarah, he selected <b>Paste</b>.<br>\r\n<br>\r\n\"You know, I fancy a smoke.\" Sarah replied as she faced Jake.<br>\r\n<br>\r\n<i>Wow</i>, Jake thought, not expecting the change to work.<br>\r\n<br>\r\n\"C'mon - I know where Sam keeps her secret stash.\" Sarah replied.<br>\r\n<br>\r\nJake, bewildered, followed Sarah into Samantha's room, while the noises of argument echoed throughout the house.  Sarah removed a pack of Kools from behind her sister's wall mirror.<br>\r\n<br>\r\n\"Hey Mom, I'm heading out, down the park.\" Sarah shouted as the friends walked out as the fight raged on.<br>\r\n<br>\r\nTen minutes later, Sarah and Jake sat on the swings of the deserted play park.<br>\r\n<br>\r\nWithout further thought, Sarah removed the pack and placed a cigarette between her lips. Removing the zippo lighter from the pack, Sarah lit up and took a deep opening drag.  <br>\r\n<br>\r\n\"Oh my god, that's amazing!\" Sarah gasped as she exhaled a cone of smoke towards the sky.<br>\r\n<br>\r\nJake noted Sarah exhibited no negative reaction to the toxic smoke entering her pink lungs, while the nicotine surged through her veins like a freight train.  <br>\r\n<br>\r\nAs Sarah sat and smoked silently, Jake noted how different his best friend now appeared with a cigarette between her long fingers.  She looked like someone who had smoked for years, puffing clouds of smoke into the air casually.<br>\r\n<br>\r\n</span></div></div>",
            "created":1525323600,
            "id":2487595,
            "title":"Make Sarah a smoker."
        },
        "12211":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "He declines, feeling it's not worth the risk.",
                "He accepts, and tries a drag as a non-smoker",
                "He accepts, and quietly pastes the addiction onto himself first"
            ],
            "content":"<div class=\"\"><div> <span>As she exhaled contentedly once more, Sarah extended the pack to Jake.<br>\r\n<br>\r\n\"Want one?\" she asked, the lit cigarette bobbing in her lips.<br>\r\n<br>\r\nJake hesitated. He had never smoked in his life, and had never really been that curious about it. But he couldn't deny that Sarah was making it look good at the moment; she seemed so relaxed and cool. Still, he thought, it probably wouldn't have that kind of effect on him, as a lifelong non-smoker; he'd probably just cough out a lung.<br>\r\n<br>\r\nJust then a thought crossed his mind, though. He didn't have to be a lifelong non-smoker. The Smoking addiction was still loaded into the machine, and he could quietly paste it into himself, too, and see what it felt like to be a smoker. But was he willing to do something so risky to satisfy a moment of curiosity? After all, he wasn't sure he could remove the trait from himself so easily; he was still a novice at this.<br>\r\n<br>\r\nBesides, perhaps it was worth trying it in the traditional way, just for that experience? Sarah was looking a little impatient now. He had to decide.</span></div></div>",
            "created":1525323600,
            "id":2487931,
            "title":"Playing with fire."
        },
        "122112":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "The friends go in search of more cigarettes",
                "Jake goes home"
            ],
            "content":"<div class=\"\"><div> <span>Gingerly, Jake removes a cigarette from the pack, as Sarah inhaled deeply.<br>\r\n<br>\r\nAs he inspected the cigarette between his fingers, he noticed how light the object felt.  He had never smoked before, and had shown no interest in the habit itself. With his best friend smoking contentedly, Jake now regretted using the device to implant a smoking addiction.  If it wasn't for him, Sarah would have continued to be critical of her own sister's habit, and they wouldn't be sitting at the park with him being peer pressured into joining her.<br>\r\n<br>\r\nHe placed the butt between his lips and watched as Sarah offered a light towards the tip.<br>\r\n<br>\r\n\"Breathe in.\" Sarah instructed, smoke punctuating her commands.<br>\r\n<br>\r\nJake sucked lightly on the filter as smoke rushed into his mouth, the end glowed red.  Jake removed the cigarette from his mouth and spat out the uninhaled smoke.  <br>\r\n<br>\r\n\"What a wuss.\"  Sarah joked, \"Like this...\"<br>\r\n<br>\r\nSarah placed the cigarette between her lips and dragged deeply.  Her cheeks caved in as the smoke filled her mouth.  As Sarah took out the cigarette, a ball of smoke appeared and immediately disappeared down her throat.  After a few seconds, a smile crept across her face as the nicotine worked its magic throughout her body.  Sarah exhaled towards the sky a cone of smoke.<br>\r\n<br>\r\n\"You try.\" Sarah demanded.<br>\r\n<br>\r\nJake reluctantly raised the cigarette to his lips, the acrid smoke irritating his eyes.  Jake sucked on the cigarette and attempted to inhale the smoke into his virgin lungs.  His body rejected the smoke, and Jake almost fell from the seat into a deep coughing fit. <br>\r\n<br>\r\nThe X-39 device suddenly fell from Jake's pocket onto the ground between them.<br>\r\n<br>\r\n\"What is this?\" Sarah wondered, as she picked up the box from the ground.<br>\r\n<br>\r\n<b>Paste</b> flashed on the display as it was pointed inadvertently at Jake.<br>\r\n<br>\r\nAs soon as Jake heard the click of a button, the coughing fit dissipated.  Jake sat back up on the swing seat, and looked towards the burning cigarette between his fingers with new emotions.  The smoke no longer irritated his eyes, and the horrid taste of ash in his mouth had evaporated.  Jake could feel a voice inside his head instruct him.<br>\r\n<br>\r\n<i>Smoke</i><br>\r\n<br>\r\nJake tapped the ash from the cigarette and raised to his lips, as he attempted to fend off the new urges.  With the filter between his lips, Jake inhaled immediately, and could feel the nicotine surge through him.  The feeling was if electricity was passing through his body, elevating his all his senses.  Moments later, Jake exhaled a cloud of smoke towards his friend.<br>\r\n<br>\r\n\"What is this?\" Sarah repeated at her spellbound friend.<br>\r\n<br>\r\nAs Jake continued to devour each drag on the cigarette, feeding his new implanted addiction, he explained how he came across the X-39 Alterator.  <br>\r\n<br>\r\n\"So you used this on me?  How could you?\" Sarah dragged on her shrinking cigarette.<br>\r\n<br>\r\n\"I'm sorry Sarah, I was curious to see if the device could work.\" Jake inhaled again.<br>\r\n<br>\r\nSarah stared at the burning cigarette between her fingers, and took a final puff.<br>\r\n<br>\r\n\"I'm mad at you for using me as your guinea pig! However, it appears we are even.\" Sarah responded, nodding towards Jake's own new smoking habit. <br>\r\n<br>\r\n\"Hey you know, with the device, I can get rid of these addictions from ourselves.  Unlike real smokers, we are not stuck with this for life thanks to this device.\"  Jake inhaled again on the cigarette.<br>\r\n<br>\r\nAs Sarah looked at the half-empty pack of cigarettes, she reflected on her own change.<br>\r\n<br>\r\n\"I don't know about you, but I don't feel like quitting this anytime soon.  Right or wrong, I never understood my sister's habit until now. Now I get why she does it.  Smoking relaxes me, and gives me a chance to think.\" Sarah said, as she toyed with the pack and lighter between her hands.<br>\r\n<br>\r\n\"What about you?\" Sarah asked.<br>\r\n<br>\r\nJake nodded as he exhaled.<br>\r\n<br>\r\nAs Sarah watched Jake finished his cigarette, the friends considered their next options.<br>\r\n</span></div></div>",
            "created":1525842000,
            "id":2490705,
            "title":"He accepts, and tries a drag as a non-smoker"
        },
        "1221121":{
            "author_id":"wolfhowl19",
            "author_name":"Wolfhowl",
            "choices":[
                "Use the X-39 to score the cigars",
                "Talk to the clerk and see what they can do"
            ],
            "content":"<div class=\"\"><div> <span>Jake and Sarah started their search for cigarettes by starting to walk downtown.<br>\r\n<br>\r\nSarah looked over at Jake, and said \"Where are we going, should we head to a gas station or something?\"<br>\r\n<br>\r\nJake thought for a second, \"Nah, we both know that they would card there.  We will have better luck at a downtown convenience store.\"<br>\r\n<br>\r\nThey kept walking, and passed a plaza.  <br>\r\n<br>\r\nSarah then perked up, sniffing the air, \"Do you smell that?\"<br>\r\n<br>\r\nJake sniffed the air himself, and could detect the smell of smoke, but not quite the smell of cigarettes.  \"Yes, it smells wonderful, lets follow our nose\"<br>\r\n<br>\r\nThey followed the smell to a door of a small corner shop, called \"The Humidor\"<br>\r\n<br>\r\nOpening the door, they found a well appointed cigar shop, with a pretty Red Headed woman behind the counter, smoking a large cigar and reading a newspaper.<br>\r\n<br>\r\nSarah and Jake were both almost drooling at the sight and smell of the cigars.  That voice in Jake's mind is screaming <i>I want that!</i> The Red Head had not yet noticed they have entered.<br>\r\n<br>\r\nSarah leaned over and whispered in Jake's ear, \"How are we going to do this?  Use the X-39, or just try to talk her into selling us some cigars?\"</span></div></div>",
            "created":1526274000,
            "id":2493296,
            "title":"The friends go in search of more cigarettes"
        },
        "1221122":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "...but it would have to wait, because Jake had been seen!",
                "... he would restore his mother's smoking habit with the remote.",
                "... he would go back to bed, and make a different plan in the morning.",
                "something else."
            ],
            "content":"<div class=\"\"><div> <span>Feeling the nicotine coursing through his veins, Jake acknowledged that Sarah was right; he didn't want to quit any time soon, either. Besides, he knew in truth what most smokers only told themselves as a convenient lie: he could quit any time he wanted. In the meantime, why not enjoy his new habit?<br>\r\n<br>\r\n\"I do want to keep at this for a while, but I have a problem you don't have. Nobody smokes at my house. I guess eventually we'll have to work out a way to get our own supply, but just for now, could you give me some out of Samantha's pack?\" Jake asked sheepishly.<br>\r\n<br>\r\nSarah, already a zealous convert, tutted. With clear reluctance, she gave Jake two of the remaining cigarettes from the pack.<br>\r\n<br>\r\n\"Oh, come on, is that all I get?\" he asked petulantly.<br>\r\n<br>\r\n\"Yes. I want more for myself, and besides, you caused this. I get to keep the lighter, too.\" she added, a little defensively.<br>\r\n<br>\r\nJake began to formulate a counter argument, but stopped himself. This wasn't worth falling out over, and besides, two cigarettes was more than the none he'd have otherwise.<br>\r\n<br>\r\nWith that, the two set off in different directions for their respective homes. As Jake walked home, he began to wonder about the possibilities inherent in the remote. He also reflected on his new addiction; ironically, he and his sister Allison had just a few short years ago persuaded their mother to quit smoking herself, after years of pressure. He wondered how his mother would react to his hypocrisy, now he was a smoker? He hoped to delay that reckoning as long as possible.<br>\r\n<br>\r\nAs he entered his house, Jake realised he had underestimated the strength of his addiction. He already wanted another cigarette, but knew it would be some time before he got the opportunity. Throughout the family meal, he grew ever more preoccupied and irritable, and wished that his remote could make time go faster somehow. <br>\r\n<br>\r\nBy the time everyone else was safely in bed, Jake no longer wanted a cigarette, he NEEDED one. He had worked out his plan of attack: the family kept a lighter in the kitchen drawer to light candles on birthdays and such, so he would procure that as his new lighter. Then he would hide in the trees at the end of the garden.<br>\r\n<br>\r\nHe was less stealthy than he had hoped to be, as by now he was feeling desperate and uncoordinated. He was almost shaking; he had never known deprivation like this! Fumbling with his lighter briefly, he felt immense relief as his cigarette lit, and a sense of blissful well-being as the smoke entered his lungs. If he had never known what it was to be deprived until earlier, he had never know release until this moment. He devoured the cigarette almost without noticing, and as he crushed it out beneath his sneaker he realised he still did not feel quite right.<br>\r\n<br>\r\nFrowning, he examined the second cigarette. He knew he needed it, right now. He also knew that it represented the end of his supply. He momentarily considered saving it, but before he quite knew it his will had collapsed, the cigarette was lit, and he was exhaling his first drag. Had he once known freedom, willpower? All he knew in that moment was that he needed to smoke, and to solve the lack of cigarettes, fast.<br>\r\n<br>\r\nSuddenly, an idea hit Jake: his mother used to smoke! If he pasted the addiction back onto her, it would be reasonably assumed she'd just relapsed. Few eyebrows would be raised. That would give him a supply to loot, and also set a less contentious scene for his own inevitable debut as a smoker. And unlike with Sarah, his conscience would be clear; his mother chose to smoke already, so all he was doing was reinforcing that choice.<br>\r\n<br>\r\nHe'd half talked himself into this plan before the nicotine began to work it's magic, and return him to his senses. In a more rational state, he felt a little ashamed that he'd decided to do such a morally ambiguous thing simply to serve his own addiction. As he blew away the last of his smoke, he closed his eyes and made a decision...</span></div></div>",
            "created":1525842000,
            "id":2490964,
            "title":"Jake goes home"
        },
        "12211221":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "Sneak into Zach's bedroom, and Paste the smoking addiction into him ",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As Jake ground out his cigarette, he heard the rustling of leaves nearby.<br>\r\n<br>\r\n\"Hey!\" a voice echoed, as the figure emerged from the trees.<br>\r\n<br>\r\n\"Zach?\" Jake groaned.<br>\r\n<br>\r\n\"When did you start taking strolls in the middle of the night?\" Zach asked as he approached his brother.<br>\r\n<br>\r\n\"I couldn't sleep, and needed some fresh air.\" Jake lied.<br>\r\n<br>\r\n\"Really?\" Zach replied as he stood in front of him.<br>\r\n<br>\r\nThe older brother looked down at the cigarette butt between them on the ground.<br>\r\n<br>\r\n\"Mom and Dad are gonna go crazy when they find out.\" Zach shook his head.<br>\r\n<br>\r\n\"Are you really gonna squeal to them over this?\" Jake begged.<br>\r\n<br>\r\n\"It's my duty, dork.  Get back in the house before I kick your ass.\" Zach demanded.<br>\r\n<br>\r\nHaving left the X39 in his room, Jake felt powerless to save the situation.  He knew Zach took great delight in ratting out his fellow brothers and sister to their parents, whilst enhancing his own role model status in the family.  Jake envisaged divulging Zach's smoker status would further solidify his position within the family. <br>\r\n<br>\r\nWith Zach behind him, Jake was marched back into the house.<br>\r\n<br>\r\nSaturday morning soon arrived, and Jake awoke with a dry throat and a desperate craving for another cigarette.  As he read through the settings on the X39 for anything which might alleviate his nicotine fix, he realised being able to satisfy his urge was one of the major drawbacks of being a smoker.  In that moment, Jake realised the agony his mother went through when quitting at the mercy of her family.<br>\r\n<br>\r\nMemories of last night flooded back, and he knew his secret would soon be unveiled by his brother to the family.  Eventually, Jake emerged from the bedroom down the landing towards the stairs.  As Jake stood, he could hear no arguing or debating from downstairs - instead just snoring from Zach's room.          <br>\r\n<br>\r\n<b>He isn't up yet!</b> Jake beamed to himself.  <br>\r\n<br>\r\nSuddenly, a new plan to retain his secret and provide a steady source of cigarettes formed in his mind as he returned to his bedroom to retrieve the X-39...  <br>\r\n</span></div></div>",
            "created":1525842000,
            "id":2491015,
            "title":"...but it would have to wait, because Jake had ..."
        },
        "122112211":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "Approach the smokers. The cravings would become too much otherwise.",
                "Try and brave the day without smoking first, hoping another solution comes up.",
                "Something else",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Tiptoeing very carefully into his elder brother's room, Jake readied the X-39. This plan worked on so many levels: not only would it prevent Zach from telling Mom and Dad about his smoking, it would also likely provide a ready source of cigarettes, since Zach was 18 and could actually buy them.<br>\r\n<br>\r\nZach was sleeping peacefully as Jake aimed the device. With the click of a button, the deed was done, but Zach did not move or react at all. It was as though nothing had happened. Jake felt momentarily worried that his plan had failed, but reassured himself with the thought that the change was only immediately noticeable for himself and Sarah due to circumstances; in contrast Zach was sleeping. What was he expecting him to do, sit bolt upright and beg for a cigarette? Jake retreated, hoping that his plan would work.<br>\r\n<br>\r\nSitting at the breakfast table, Jake picked at his food and tried to ignore his ever growing craving. Allison was irritatingly chirpy today, but Jake could only hear her words as noise. His spirits lifted a little, however, when he saw that Zach was just as preoccupied and miserable. As his brother came downstairs, Jake had feared that he was about to immediately divulge his discovery from the night before, but he had instead took a seat opposite and sat sulking silently, likely tormented by his own sudden urge to smoke. Or maybe it hadn't worked, and Zach was just coincidentally ill or something?<br>\r\n<br>\r\nJake wondered what this must feel like for Zach, since he had no idea what had been done to him. The instructions on the device said that the target would not know they had changed; himself and Sarah were exceptions as they knew about the device, had both used it and told each other. Still, even Jake had noticed strange things following the paste; changes in his muscle memory, brief flashes of images he knew to be false of smoking before yesterday. Was Zach being plagued by similar symptoms?<br>\r\n<br>\r\nJake rushed to meet with Sarah to walk to school as soon as he could, planning to ask for another of her cigarettes. He was to be sorely disappointed.<br>\r\n<br>\r\n\"I smoked them all last night\" murmured Sarah awkwardly.<br>\r\n<br>\r\n\"All of them?! There was still just under half a pack!\" Jake gasped incredulously.<br>\r\n<br>\r\n\"I wanted all of them. In fact, I kind of wanted more...\" came her wistful reply.<br>\r\n<br>\r\nJake felt like screaming, but instead decided to distract himself by taking the opportunity to ask Sarah about her own experience of having been made into a smoker.<br>\r\n<br>\r\n\"When did you actually paste it?\" she asked him in response, a thoughtful look on her face.<br>\r\n<br>\r\n\"In your room, after you'd told me what Sam was arguing with your Mom about. You'd just told me it was a horrible habit, and then as soon as it was transferred, you wanted a smoke.\" <br>\r\n<br>\r\nSarah concentrated hard. \"Hmm... I remember saying that. But it's funny, I didn't feel like it was a new thing, wanting to smoke. And now I actually think about it, I remember secretly smoking for as long as Sam has been, but never telling anyone, or doing it in front of anyone. Nobody even suspected. If there is anything that doesn't add up about that story, it's that I suddenly felt fine doing it in front of you.\"<br>\r\n<br>\r\nJake felt a sense of recognition. \"Didn't we start together? Because I have a second set of memories where we tried it together and I smoked in secret ever since?\"<br>\r\n<br>\r\nSarah shook her head. \"Think about it Jake, where would you have been getting the cigarettes? You never smoked until yesterday, that's how I know the X-39 really works... I guess I never did either, as weird as that feels to acknowledge now I've really thought about it.\"<br>\r\n<br>\r\nJake nodded. \"So I guess that's what it does. It creates plausible new memories to justify the changes, but also adds caveats and excuses for why events weren't different for everybody else. It's kind of like dream logic. So I guess Zach...\"<br>\r\n<br>\r\nJake caught himself. He hadn't actually told Sarah that part yet. He hadn't been sure he wanted to.<br>\r\n<br>\r\n\"You guess Zach what?\" said Sarah in confusion, before it dawned on her. \"Oh, Jake. You didn't?\"<br>\r\n<br>\r\nLooking at the ground, ashamed, Jake replied. \"He caught me smoking. And he can buy cigarettes for us. So I thought it made sense...\"<br>\r\n<br>\r\nSarah grimaced. \"I want to feel annoyed at you, disgusted even, but at this point, anything than can get us cigarettes has to be a good thing. I'm gasping!\"<br>\r\n<br>\r\nJake gritted his teeth. He was desperate too. The two of them had reached the gates of their High School.<br>\r\n<br>\r\n\"Well, we might have a solution long term, but I only have one idea in the short term, and I don't much like it.\" said Jake, nodding in the direction of a cluster of students hiding around the corner.<br>\r\n<br>\r\nSarah shuddered. The established smokers. Those people were delinquents and future drop outs; neither Jake nor Sarah associated with any of them, or wanted to. They had absolutely nothing in common. But they had something both of them of needed. And besides, weren't they themselves smokers now too? As much as she hated the humiliating idea, the nicotine receptors in Sarah's brain screamed at her to just ask for one, or at least a drag. Paralysed, the best she could do was absolve herself of responsibility for the choice.<br>\r\n<br>\r\n\"I can't pick. It's up to you, Jake\"<br>\r\n<br>\r\nJake sighed. He'd been hoping Sarah would make the choice. Well, if he had to choose...</span></div></div>",
            "created":1525928400,
            "id":2491431,
            "title":"The Manchurian Smoker"
        },
        "1221122111":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "\"Meet me near the smokers corner at the morning break. I will show you.\"",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>\"Well?\" Sarah asked, as the cravings raged inside.<br>\r\n<br>\r\n\"Here goes nothing...\" Jake puffed, as he walked towards the smokers' corner.<br>\r\n<br>\r\nAt that point, the corner consisted of several smaller groups conversing in a constant fog of smoke.  With each step taken forward, his rational mind fought against the nicotine cravings, begging him to walk away and resist the voices inside.  As he got closer to the group, the smoke hung overhead, and his nostrils widened as he breathed the toxic smoke in to quench his hunger.  <br>\r\n<br>\r\nThere was one group in the corner that caught his attention - as he recognised two of the pupils; Vicky Darlington, who was in the year above and Mark Foy, whom he shared classes with.  <br>\r\n<br>\r\nStanding in front of the group, the smokers looked at Jake, while sucking on their cigarettes.<br>\r\n<br>\r\n\"H-Hiya.\" Jake stuttered nervously.<br>\r\n<br>\r\n\"What do you want?\" Mark grunted.<br>\r\n<br>\r\n\"Erm...I was h-hoping I could have a...\"<br>\r\n<br>\r\n\"A...a...a?\" one of the smokers teased.<br>\r\n<br>\r\nJake could feel the sweat run down his forehead, as he now noted he was way out of his comfort zone.<br>\r\n<br>\r\n\"A smoke?\" Jake responded as he looked towards the ground.<br>\r\n<br>\r\nThe group burst out laughing, soon attracting the attention of the others in the corner. <br>\r\n<br>\r\nSarah frowned as she watched Jake being teased mercilessly by the smokers.  <br>\r\n<br>\r\n\"Jake Miller wants a smoke?!\" Mark laughed.<br>\r\n<br>\r\n\"Are we on candid camera?\" Another joked as they inhaled.<br>\r\n<br>\r\n\"Are we being Punk'ed?\" Another joined in.<br>\r\n<br>\r\nVicky took a deep draw from her cigarette and approached Jake, who stared at the ground, wanting it to swallow him whole. <br>\r\n<br>\r\n\"Jake.  Look at me.\" <br>\r\n<br>\r\nJake looked up at Vicky as she towered over him. <br>\r\n<br>\r\nSuddenly, Vicky exhaled directly over his face to the laughter of her smoking peers.<br>\r\n<br>\r\n\"Now go and fuck off dweeb.  Leave us in peace.\" Vicky moaned as she walked back to the group.<br>\r\n<br>\r\nJake slowly retreated back from the corner towards Sarah as she looked on.<br>\r\n<br>\r\n\"Where's the X-39?\" Sarah groaned.<br>\r\n<br>\r\n\"Why?\" Jake asked as he handed over the device.<br>\r\n<br>\r\n\"I have another idea to get what we want....what we need.\" Sarah vowed.<br>\r\n<br>\r\nJust as Sarah was about to execute her plan, the school bell sounded to the disdain of the pupils in the playground.<br>\r\n<br>\r\nAs they made their way inside the building, Jake pressed his girlfriend on her plan.</span></div></div>",
            "created":1526101200,
            "id":2491979,
            "title":"Approach the smokers. The cravings would become..."
        },
        "12211221111":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "... to go with Sarah's enslavement plan, for elaborate revenge.",
                "... to go with his own Life swap plan, for efficiency.",
                "... to battle the cravings and follow Zach, potentially securing the long term.",
                "... to attempt something completely different."
            ],
            "content":"<div class=\"\"><div> <span>After an increasingly hellish morning, in which he was tormented both by his own cravings and by the mockery of Mark Foy, Jake met Sarah near the smokers corner as planned. She began to outline her plan:<br>\r\n<br>\r\n\"So, looking through the instructions of the X-39, it says that under 'Other' we can tweak specific attributes, right?\"<br>\r\n<br>\r\nJake was struggling to concentrate because he want to smoke so badly, a situation only exacerbated by watching the regular smokers light up in the distance, but he thought he remembered seeing that, so mumbled an affirmative.<br>\r\n<br>\r\n\"So, check this out: there's a 'will' attribute in there, plus 'loyalty' and 'obedience'. How about we target those bastards over there, dial down the 'will', dial up the 'obedience', and make them loyal to us? Then they'd give us anything we asked for. Happily.\"<br>\r\n<br>\r\nJake felt uncomfortable. \"I dunno Sarah, wouldn't that be kind of... enslaving them?\"<br>\r\n<br>\r\n\"Maybe, but they deserve it, the way they treated us earlier. There was no reason for them to be as cruel as that, and this gets us what we want as well as teaching them a lesson. Two birds with one stone!\"<br>\r\n<br>\r\nFor a moment, Jake could hardly recognise this girl as his kind-hearted Sarah, who just this morning had objected to what he'd done to Zach, something which seemed a much lesser sin than this suggestion. He felt kind of chilled to realise the X-39 could be used for something like this; why had he not realised sooner? But on the other hand, he was feeling desperate enough, and angry enough at the way he'd been treated, that he could almost see the wisdom in it; he reflected that Sarah was probably having her temper frayed by the new cravings too, which led to this idea entering her head. He had to at least try and talk her out of it.<br>\r\n<br>\r\n\"I'm not sure this is...\" he started.<br>\r\n<br>\r\n\"Then what the fuck is your solution?\"exploded Sarah, showing a thunderclap of a stormy temper Jake had never before seen in her.<br>\r\n<br>\r\nHe momentarily couldn't think of anything, and was about to concede, but then inspiration struck.<br>\r\n<br>\r\n\"Wait... we don't need to go anywhere near as far as that!\" he said with enthusiasm.<br>\r\n<br>\r\n\"Get on it with Jake, I feel like I'm dying.\" spat Sarah, shifting nervously.<br>\r\n<br>\r\n\"The way they treated us this morning was only possible because of our relative positions on the High School Caste System/Food Web. If that were different, we'd have interacted very differently, right? Well, the X-39 has a 'Life' option. All we do is target ourselves and any two of those delinquents over there, though for reasons of justice it should definitely be Foy and Darlington. Then we fire away and boom! Our positions, and the way everybody else reacts to us, are flipped.\"<br>\r\n<br>\r\nNow Sarah looked uncomfortable. \"I want them to give us something to smoke. I don't want to BE them. Eww.\" She shuddered.<br>\r\n<br>\r\nJake beamed: \"That's the best part: all it changes is other people's reactions, nothing mental or physical about us or them! So we get to smoke, and they get to walk a mile in our shoes instead.\"<br>\r\n<br>\r\nSarah looked thoughtful. \"Hmmm... I like that. But I still like my plan to. I'll let you pick, but do it quickly.\"<br>\r\n<br>\r\nJake thought carefully, and as he did, saw Zach walking out of the gates looking shifty. He'd almost forgotten his long term plan; would it be more rewarding to continue working on that instead of this? Jake's rational mind said yes, but just then he caught a whiff of the heavenly smoke that could be his much quicker by using the X-39 right now. He was torn, but finally decided...</span></div></div>",
            "created":1526101200,
            "id":2492382,
            "title":"Sarah's plan."
        },
        "122112211112":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "Maria, a hispanic model guidance pupil, whom was walking by.",
                "Trent, a butch high school quarterback, returning from the fields."
            ],
            "content":"<div class=\"\"><div> <span>\"OK let's try this Swap option.\" Jake affirmed as he aimed the X-39 in the direction of the smokers.<br>\r\n<br>\r\nBy chance, Mark and Vicky were standing together puffing away with abandon, while talking to their peers.  It was clear from their stances, that they were looked up to amongst their classmates, inside a blue ring of smoke overlooking them protectively.<br>\r\n<br>\r\nSarah noted keenly that Jake tapped a few buttons on the device towards Mark then Vicky, capturing their profiles, then proceeded to point the device towards Sarah.  <br>\r\n<br>\r\n\"You sure about this?\"<br>\r\n<br>\r\n\"Just do it already.  I can't stand not being able to smoke!\" Sarah demanded.<br>\r\n<br>\r\nAfter a few moments, he handed the device to Sarah.<br>\r\n<br>\r\n\"You will need to complete the profile store for me.\" Jake instructed.<br>\r\n<br>\r\nSarah complied, pointing the device at Jake and flicking through the options to store his profile on memory.<br>\r\n<br>\r\n\"Done.\" Sarah handed the X39 back to Jake as the nicotine cravings ramped up with each passing moment.<br>\r\n<br>\r\n\"OK.  Give me a moment.\" Jake insisted as he brought up options to complete the complicated Swap.  On screen, Jake could see a table of two columns, with the header titled <b>Swap Procedure</b>.  Underneath the columns was the names of those being transferred.<br>\r\n<br>\r\nJake turned to Sarah. <br>\r\n<br>\r\n\"Everything is ready to go. In the case this doesn't work, I wanted to say I love you, no matter what.\" Jake said as he held her hand with his left holding the device.<br>\r\n<br>\r\nSarah smiled back as he pressed the <b>Complete</b> button on the device.<br>\r\n<br>\r\nAs soon as the button was pressed, everything went dark.<br>\r\n<br>\r\nSlowly his vision returned, blurry to start with, as people came into focus.  <br>\r\n<br>\r\n\"What's wrong Jake?\" someone asked<br>\r\n<br>\r\n\"Yeah.  Seemed to lose you for a moment.\" <br>\r\n<br>\r\nJake soon realised he was now standing in the smokers corner, and could see the burning cigarette between his fingers.  Nicotine cravings soon kicked in, and he raised the cigarette for a deep, long satisfied draw.  His body shuddered in ecstasy as he could feel the smoke caress his deprived lungs. Tilting his head back, Jake exhaled towards the sky.<br>\r\n<br>\r\nAfter taking a second pull on the cigarette, Jake observed his surroundings with greater detail; Here he was, standing with the other smokers in one of the alcoves of his school building.<br>\r\n<br>\r\n\"Hey stranger.\" <br>\r\n<br>\r\nJake turned his head to see Sarah standing, cigarette dangling, caressing his new leather jacket.  Sarah herself stood with her blouse top buttons undone, revealing the strapline of her bra seductively, while her lips wore vibrant purple lipstick.  Her new look excited him in ways he never thought of before.  As they continued to smoke silently to the amusement of their new classmates, Jake looked out towards the spot they had been standing to see Mark and Vicky standing.  Their clothes and appearance now matched what Jake and Sarah had been wearing.  Mark was now even wearing the spectacles which Jake had been wearing out of necessity. <br>\r\n<br>\r\n\"You not talking to us?\" another smoking classmate muttered.<br>\r\n<br>\r\n\"Gavin.\" Jake responded as his memory adjusted to blend with the environment, recalling the names of the fellow student smokers puffing away.  Jake turned to the classmate, as he exhaled again, \"Shut the fuck up. All you do is yap.\" Jake added.<br>\r\n<br>\r\nSarah inhaled and smiled, noting Jake's out of character outburst.  Before the transfer, Jake was extremely timid in personality.  Sarah assumed new assertion was part of the transfer.<br>\r\n<br>\r\n\"So I like this new you.\" Sarah whispered.<br>\r\n<br>\r\n\"Aside from the physical stuff, are your memories intact?\" Jake responded as he tapped ash from his cigarette.<br>\r\n<br>\r\n\"I think so.  Samantha is my sister, Mark is my brother.  We live at home with Mom. Dad left us long ago.  I still have the same classes here.  What about you?\" Sarah recalled as she inhaled again on her cigarette.<br>\r\n<br>\r\n\"Yeah, I still live with Mom and Dad, and Allison and Zach.\" Jake replied.<br>\r\n<br>\r\n\"Look what I got here.\" Sarah smiled as she extracted a pack of Kools from her blouse pocket.<br>\r\n<br>\r\n\"Check your pockets.\" Sarah urged.<br>\r\n<br>\r\nJake felt around his leather jacket, and took out his own pack of Marlboros.  In the other pocket, he could feel the familiar feel of the X39 device, worried in case this remained with Mark and Vicky.<br>\r\n<br>\r\nThe two confused students approached the group of smokers.<br>\r\n<br>\r\n\"Er...what did you do to us Jake?\" Mark cried.<br>\r\n<br>\r\n\"What you talking about?  Once a nerd, always a nerd.\" Jake groaned in Mark's direction.<br>\r\n<br>\r\nSarah smiled as Jake stepped forward to continue his tirade, after taking a drag from his cigarette.<br>\r\n<br>\r\n\"One more thing, Vicky.  How does it feel being on the outside?\" Jake smiled as he exhaled straight into her face.<br>\r\n<br>\r\n\"Any chance of a smoke?  We are dying here.\"  Vicky inhaled the cloud.<br>\r\n<br>\r\n\"Hmm.  Answer is no.  You are not one of us, and will never be.  Now piss off the pair of you, before I kick your asses!\" Jake threatened them.<br>\r\n<br>\r\nAs Sarah burst out laughing at Jake's new attitude, he strolled back to the corner with purpose, smoke trailing him.<br>\r\n<br>\r\nWhile Vicky and Mark ran off, Jake turned to Sarah.<br>\r\n<br>\r\n\"Aside from instant access to cigarettes, I feel fucking amazing!  Like I am unstoppable.\" Jake beamed as he exhaled again.<br>\r\n<br>\r\n\"I know what you mean.  Before, I was driven purely by my need to smoke.  Now, I feel unstoppable and completely free of all fears.\" Sarah responded with her own inhale.<br>\r\n<br>\r\n\"Me too.  I was shitting myself about being found out as a smoker, but now?  Who gives a fuck!\" Jake replied, as Sarah noted his more vulgar vocabulary come into effect.<br>\r\n<br>\r\n\"Say folks, who wants to see us recruit a new member to our little smokin' posse?\" Sarah asked her smoking pupils as Jake had the same idea form.<br>\r\n<br>\r\nAt this point, the fellow smokers hung on every word of their new ringleaders Jake and Sarah.<br>\r\n<br>\r\nJake removed the X39 from his jacket pocket and tapped up the <b>Obedience</b> trait, now feeling the urge to brainwash someone else within the school.  <br>\r\n<br>\r\n\"Great idea Sarah!  Now who should we recruit?\" Jake wondered as they smoked and watched pupils walk by...<br>\r\n      </span></div></div>",
            "created":1526101200,
            "id":2492508,
            "title":"... to go with his own Life swap plan, for effi..."
        },
        "1221122111121":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "They ditch school and go into town.",
                "They carry on with the school day."
            ],
            "content":"<div class=\"\"><div> <span>Fiddling with the settings, Jake set Maria's <b></b>Obiedience<b></b> trait to 100%, and made himself the sole target of it: she would remain perfectly unchanged in every other way, but feel compelled to obey his, and only his, commands. He knew why he wanted to do this; he had always been a little envious of Maria's quiet self confidence, the way she simply lived her life the way she felt was right with no view to the opinions of others, of her peers. He was thrilled at the notion of forcing her to do things she didn't really want to, while having her remain painfully aware that she didn't want to do them.<br>\r\n<br>\r\nAs he pressed the button, he wondered why he suddenly didn't feel guilty about this. Part of him wanted to tell himself he had inherited some of Mark's cruelty, but in his heart he knew that wasn't true. The setting he had used didn't change anything mental or physical; the differences in his thinking now came only from his new found power and status. Now that everyone around him was reacting with fear and deference, and now he knew that the X-39 gave him power enough to never truly have to fear consequences again, he felt less morally constrained. All of this new attitude had always been inside him, held back only by his own fear. He felt half ashamed of this, but as he took another drag on his cigarette, he decided he was having far too much fun to care. And things were about to get even more fun.<br>\r\n<br>\r\n\"Hey, Maria! Come over here!\" he called tauntingly.<br>\r\n<br>\r\nMaria looked startled, and clearly didn't want to approach the group. She looked confused by the fact that she was approaching anyway, and a gathering panic was evident on her face. As she reached him, he very deliberately blew smoke in her direction, and noted with amusement that Sarah had had the exact same, simultaneous idea. Maria coughed nervously.<br>\r\n<br>\r\n\"W-what do you want, Jake?\" she stuttered nervously.<br>\r\n<br>\r\n\"I just want to talk is all. It strikes me that I've never really got to know you properly. Cigarette?\" he offered, holding his open pack out to her.<br>\r\n<br>\r\n\"No thanks, I don't smoke.\" she managed to say politely, struggling to keep her evident disgust in check.<br>\r\n<br>\r\n\"Take one.\" said Jake forcefully.<br>\r\n<br>\r\nMaria reluctantly extracted a cigarette with a frown, clearly very disturbed that she was doing so.<br>\r\n<br>\r\n\"Good, now put it in your mouth.\" said Jake.<br>\r\n<br>\r\nMaria obeyed without question but then began to speak, the unlit cigarette bobbing between her lips: \"Please Jake, I don't want to...\"<br>\r\n<br>\r\n\"Shut the fuck up, bitch!\" he spat. \"Good, now suck on that a little, and get ready for a whole new world...\" he said gently, extending his lighter.<br>\r\n<br>\r\nMaria dutifully did as Jake commanded, coughing slightly and spitting out the smoke that had flooded her mouth with a look of distaste.<br>\r\n<br>\r\n\"Now try again, and this time breathe the smoke in.\" he said.<br>\r\n<br>\r\nMaria inhaled for the first time, and went into a horrific coughing fit provoke paroxysms of laughter from everyone else present, except Jake, who merely cracked a cruel smile.<br>\r\n<br>\r\n\"Keep it up until it's all gone.\" came his next command.<br>\r\n<br>\r\nMaria smoked quietly and nervously, often coughing (although with ever less intensity). Every drag seem to be hellish to her, and at no point did she seem to be enjoying herself. By the end she was in tears, and Jake felt a pang of pity that he nonetheless suppressed. As she awkwardly stamped out the completely spent tip of her first ever cigarette, Maria softly asked \"Can I go now, please?\"<br>\r\n<br>\r\n\"Not just yet. First, some long term instructions: you have to come here every morning with a new pack of cigarettes. Without fail. You will report to this position during every break thereafter. Secondly, you will do all my assigned homework, and will present it to me here, every morning. Every time I get less than an A+, there will be consequences. And finally: you will kiss my feet. Right now.\"<br>\r\n<br>\r\nA stunned silence descended on the group. Nobody really believed that Maria would go through with this. But, wiping her tears and trying to maintain some kind of dignity, she knelt and kissed Jake's dirty boot. Everybody cheered in disbelief, and Maria scampered away, defeated.<br>\r\n<br>\r\nSarah grabbed Jake by the ass and pulled him around into a tight embrace, kissing him with a new passion; Jake enjoyed the taste of her smoke mingling with his, and as she pulled away to speak to him, he saw the animal lust he was feeling for her mirrored in her own eyes.<br>\r\n<br>\r\n\"That was fucked up!\" she said, admiringly. \"Fuck the rest of this day, let's hit the town, see what mayhem we can cause with the X-39!\"<br>\r\n<br>\r\nJake hesitated. The possibilities were endless! He could make the whole town his bitch in one way or another now. That was an attractive prospect, but...<br>\r\n<br>\r\n\"We both have classes with Mark and Maria, and I'm sure we'll see Vicky around. Don't you want you want to fuck with them some more?\" he said, and saw by her sadistic grin that she did.<br>\r\n<br>\r\nIt was a hard decision: the whole world was theirs to play with, after all.</span></div></div>",
            "created":1526274000,
            "id":2493062,
            "title":"Maria, a hispanic model guidance pupil, whom wa..."
        },
        "12211221111212":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "\"How about Sally and Jen?  Let's use the X-39 to make them passionate smokers.\"",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>The school bell rung, as Jake headed off to his next class - home economics. With his new-found attitude, thanks to the life swap, Jake felt more confident than he had ever done before. The change had shifted his moral compass in such a manner he never expected, although he embraced the new feelings building with him.  He could feel his mind still evolve, having been moulded on Mark's former lifestyle to begin with. <br>\r\n<br>\r\nAs the students gathered around their cookers awaiting instructions from their frail teacher, Dana Milton, Jake struggled to retain an interest as the lesson begun.  Ms Milton was serving her final year with the high school before retirement, but her traditional teaching format made her unpopular with the pupils.  Suddenly, a devious thought ran through his mind as Dana demonstrated a recipe for her class to copy.  Slipping the X-39 out of his pocket, he scanned the device, under the desk in the direction of the teacher, and began punching buttons relating to her <b>body</b>.  <br>\r\n<br>\r\nDana's wrinkles slowly began to recede and flatten from her face, whilst her bent over posture straightened out.  Her once blonde hair returned to its full glory whilst the rattle in her voice from years of smoking had dissipated.  As Dana continued to teach, she and the pupils were unaware of her transformation into a younger version of herself.  Jake went one further and increased the size of her breasts to a fuller figure as the class remained unmoved by the changes in front of them.  After making changes to the <b>body</b>, Jake made subtle changes to her <b>personality</b>.  As buttons were clicked and the device pointed in her direction, her demeanor adjusted to the new settings.  Dana now found herself referring to her pupils by name, and her tone was more engaging, improving the learning experience for all.  As the class began to copy the cooking recipe shown, Dana found herself inadvertently flirting with Mark - another change added to her personality.  By the time the bell went, Dana thought she would be reconsidering retirement as an option.<br>\r\n<br>\r\nLunch soon arrived, and Jake's nicotine cravings raged through him.  Sarah caught up with Jake and a few of his new disciples at the school gates, ready to head into town for the hour.  Once out of sight, they all lit up cigarettes (Maria reluctantly complied by command of Jake) and walked down the street.  Jake and Sarah caught up while walking and smoking with their new posse.  <br>\r\n<br>\r\n\"I can't be assed with classes now, I just couldn't focus.  I spent the duration of history watching poor Vicky squirm in her chair.  Thanks to your magic box, she is still struggling with her new reality, and I love it!\" Sarah beamed as she smoked.<br>\r\n<br>\r\nJake nodded in agreement as he sucked down on his cigarette forcefully - he loved the feeling of power at his fingertips.  They both acknowledged they felt their personalities still evolving as corrupt thoughts began filling their mind.  The blind fellowship of his new gang further emboldened them as they enjoyed the rebellious chill run through their bodies as much as the surging nicotine. <br>\r\n<br>\r\nAfter buying and consuming food from the bakery, Jake and the group strolled back towards high school, all smoking.  As Sarah inhaled, she noticed Maria continue to struggle with her new forced addiction, still coughing with each drag.  Inside, Maria was embarrassed to be associated with the group, and felt trapped, thanks to the obedience from the X-39.<br>\r\n<br>\r\n\"I love what you've done with Maria.  You have made her smoke <i>against</i> her will. I wanna have a go using the Obedience setting, but take it a stage further.  I don't wanna have a target struggle or attempt to resist...I want them to fully comply and immerse themselves to my will, while being fully obedient.\" Sarah insisted after one final drag on her cigarette.<br>\r\n<br>\r\nSarah's attention was on the students now approaching the school gate, returning from their travels during lunch. <br>\r\n<br>\r\n\"Well we got ten minutes left.  Who you got in mind?\" Jake inquired.</span></div></div>",
            "created":1526274000,
            "id":2493284,
            "title":"They carry on with the school day."
        },
        "122112211112121":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "They part ways and go back to class.",
                "They decide to skip class and use the X-39 more.",
                "Something else",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As Jake and Sarah approached Jen and Sally, returning from their lunch, the X-39 changed hands and Sarah felt anticipation building. Jake could see her enthusiasm, and thought he knew exactly where it was coming from.<br>\r\n<br>\r\nBefore the changes of today, in the old status quo, Jen and Sally had been Sarah's closest female friends since early childhood. Sarah had always been the most tomboyish of the trio as a little girl, which had led to her friendship with Jake sometimes being a stronger force in her life, even before puberty had shifted the nature of that particular bond, but she'd always needed these two for female companionship. <br>\r\n<br>\r\nIn a benign, unintentional way, they had always dominated and excluded Sarah. It wasn't a deliberate choice, and it had no malice in it, but the two were simply closer to each other than to her. It didn't help that they'd both grown to overshadow her in one way or another; Sarah was above average in all respects, but Jen was the smartest girl in the school (without ever being awkward enough socially to be seen as a dork) and Sally was the star of the Girl's Soccer team. Worse, both girls were physically stunning, in different ways: Jen was a slight, pale beauty with raven hair and dark eyes and a faux-shy, alluring smile, while Sally was an athletic, tanned blonde with striking green eyes. Sarah was in no way plain, but compared to these two?<br>\r\n<br>\r\nSo Jake knew Sarah had carried an unspoken resentment of her two friends in her heart, growing like a tumour, for most of her life. As the girls caught sight of her, their previously relaxed manner stiffened. To them, this wasn't a girl who had been their overlooked bestie just this morning. This was a childhood friend who had gone off the rails in an epic manner, some years previously. Jake knew from his shadow memories that in the version of events Jen and Sally would remember, Sarah had been a bitter, threatening presence for years. He could see in her face that she was enjoying seeing their fear, that she felt it made up for the years of hurt, but he also caught a glimpse of a fleeting sadness. Part of Sarah was still hurt and confused by seeing that reaction on the faces of people so close to her, even if the speed with which the look passed suggested it was a small, dying part.<br>\r\n<br>\r\n\"Umm... Hi, Sarah! H-how... How are you?\" said Jen in response to the long stare Sarah had given her, clearly unnerved.<br>\r\n<br>\r\n\"I'm great, Jess! How are you, Jess?\" said Sarah mockingly.<br>\r\n<br>\r\n\"It's... It's.... My name is Jen, Sarah, if you remember...\"<br>\r\n<br>\r\n\"Whatever, Jess.\" smiled Sarah. \"Now, I bet you're wondering why I've come over to you, right?\"<br>\r\n<br>\r\n\"Not really, I can guess. You came to be a bitch, right?\" scowled Sally, more assertive, although even she had to subtly steel herself first.<br>\r\n<br>\r\n\"Wrong, dumbshit. I'm here to do the greatest favour anyone will ever do you, in honour of how close we used to be in the pre-pube days! You should thank me in advance!\" beamed Sarah malevolently.<br>\r\n<br>\r\nSally rolled her eyes. \"And what would that be?\"<br>\r\n<br>\r\nSarah pulled out the X-39, and both girls flinched and ducked, clearly fearing that Sarah had pulled out a gun or some other weapon. Sarah laughed uproariously, and the panic receded as both girls saw that the X-39 was some sort of remote. Jen laughed nervously in relief, but Sally was furious.<br>\r\n<br>\r\n\"You asshole! What is that, some sort of toy? I'm not really getting the joke.\" she ranted.<br>\r\n<br>\r\n\"This... is your salvation.\" said Sarah in mock earnestness, before giggling derisively.<br>\r\n<br>\r\nSarah had obviously gone insane, they concluded. It made Jen more nervous, but Sally just tutted dismissively. And then Jen aimed the X-39 at one, and then the other, triggering the cocktail of settings she had built for them. Now, both simply looked dazed.<br>\r\n<br>\r\n\"Allow me to explain what just happened. I have made you both my slaves, but I also made it so obeying my commands will make you happy. Obedience, and Joy, both redefined. From now on, you will be my personal posse, my handmaidens... my bitches. Beyond that, I don't want to change your minds by force though; I'm sure they'll change in time. I just want you to be my friends... and occasionally polish my shoes for me. Maybe other stuff, if I'm the mood.\" she winked suggestively.<br>\r\n<br>\r\n\"So let's test this out, and your first command is to answer me truthfully... If I remember correctly, Sally, you come from a sporty family; none of them have ever smoked?\"<br>\r\n<br>\r\n\"No, none.\" said Sally, and then smiled very slightly at the small release of endorphins that came from obeying her new domina.<br>\r\n<br>\r\n\"And you, Jen, still a Mormon?\"<br>\r\n<br>\r\n\"Well, my family is. I don't believe in the religious aspects but I follow the lifestyle because I think...\"<br>\r\n<br>\r\n\"Didn't ask for your life story, moron.\" said Sarah dismissively. \"So, to the point, neither of you have ever even tried smoking?\"<br>\r\n<br>\r\n\"No\" they said in unison.<br>\r\n<br>\r\n\"Ever even thought about it?\"<br>\r\n<br>\r\n\"No\", said Sally with clear disgust, while Jen hesitantly said \"I have sometimes wondered what it's like. So there are times I've thought about it. Especially when you first started, Sarah. And there's a boy I like, too...\"<br>\r\n<br>\r\n\"Jesus Christ, Jen, there is no shutting you up all of a sudden. Shut. the. fuck. up.\"<br>\r\n<br>\r\nJen's expression was conflicted as she stopped talking. She clearly felt stung by the insult, and yet happy to obey. It more or less cancelled out.<br>\r\n<br>\r\n\"Well Jen, today is your lucky day! You get to find out what it's like to smoke!\" said Sarah, taking out her cigarettes<br>\r\n<br>\r\n\"I don't actually want to, I've just wondered about it...\" came Jen's response, as she looked at the ground while Sarah lit up, obviously ashamed to have admitted even her limited curiosity. <br>\r\n<br>\r\nExtending her cigarette, Sarah spoke with a cruel glint in her eye as she exhaled: \"Take it.\"<br>\r\n<br>\r\nJen took a cigarette and immediately felt happier, as Sally looked on open mouthed.<br>\r\n<br>\r\n\"You want to smoke it.\" said Sarah, and Jen knew it was true.<br>\r\n<br>\r\nShe took her first tentative drag, and coughed. She didn't seem sure about that experience; the obedience felt good but the smoking was a bit nasty.<br>\r\n<br>\r\n\"It's the best thing you've ever felt.\"<br>\r\n<br>\r\nJen took another drag and felt wonderful. She exhaled with a smile, and didn't need to wait for Sarah's instruction to take another drag; she did it of her own volition, and knew this would be a part of her life from now on.<br>\r\n<br>\r\nSally finally found words: \"Jen! What are you doing!\"<br>\r\n<br>\r\n\"I'm smoking, Sal. It's really nice.\" said Jen through another exhale, before extending it towards her friend. \"Do you want to try it? I promise it's better than you're expecting.\"<br>\r\n<br>\r\nBefore she could reply, Sarah interjected \"Yeah, Sally, you DO want to try. And you will find it to your liking.\"<br>\r\n<br>\r\nWith that, Sally took the cigarette, inhaled, and sighed with relief, the end of which was smoky.<br>\r\n<br>\r\n\"I'll leave you girls to adjust to this change first, but I hope you'll be ready to attend me as soon as I want you.\" said Sarah grandly, as she turned to leave. After a few steps, she half turned, as if remembering something.<br>\r\n<br>\r\n\"Oh, and Jen? Homework task: every thing you want that you've been forbidding yourself? Try it. All of it.\" she said with an evil smile.<br>\r\n<br>\r\nJen nodded happily; she'd enjoy that command, just like all of them.<br>\r\n<br>\r\nAs Sally and Jen passed their cigarette back and forth in the background, smoking and chatting happily, Jake and Sarah kissed passionately. Coming up for air, Sarah said \"Did you fucking SEE that!\"<br>\r\n<br>\r\n\"I did. Enjoy yourself?\" said Jake admiringly.<br>\r\n<br>\r\n\"Yeah, but I'm going to enjoy the fruits of it more. Just see.\" she said with a grin. Jake grinned too; he was also curious.<br>\r\n<br>\r\nAs the bell rang to call the students back to class, Sarah passed the X-39 back to Jake. Both of them looked at the remote longingly, and both knew what they were thinking. Could they really go back to class when they had this to play with?</span></div></div>",
            "created":1526446800,
            "id":2494206,
            "title":"Sarah's thralls."
        },
        "1221122111121211":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "He let's things take their natural course with Jen.",
                "He rejects Jen.",
                "He procrastinates: this choice is just too hard."
            ],
            "content":"<div class=\"\"><div> <span>Jake and Sarah embraced lustily one more time before parting for the first of their respective afternoon classes. Jake had Chemistry with Mr Rutherford (previously his favourite teacher), and received his paper back. It was, presumably due to a glitch, the exact paper he had written and handed in previously, which he knew he had aced. However, it was marked as a fail. <br>\r\n<br>\r\n\"Hey, what's this bull? I know this is high quality work Rutherford, why did you fail my ass?\" he asked indignantly.<br>\r\n<br>\r\n\"At least have the common sense to get whoever does your homework for you to produce work you possibly could, Mr Miller. At least then I can credit you with THAT.\" he said mockingly, to the laughter of the class.<br>\r\n<br>\r\nJake was in a fury. So THIS was the downside to Mark's position: lack of reputation for integrity. Constant prejudice. Why even bother trying to do anything better, nobler or harder, when this was all he'd ever get for it?<br>\r\n<br>\r\nAfter stewing for a while, concocting various revenges the X-39 would allow him to visit, Jake came to a decision in the last minute of the lesson and deleted Rutherford's ability to speak English and any other language he knew, except Klingon. That was going to be a fun one to watch the results of, long term, he thought.<br>\r\n<br>\r\nWalking to his next lesson (English), Jake suddenly found himself pulled into the girls toilets. Preparing to defend himself, he was stunned to turn and see the petite frame of Jen, who lept at him and kissed him passionately.<br>\r\nHe could taste the faint traces of her first ever cigarette on her tongue, although unlike the new Sarah she had taken pains to hide it under mints and strawberry lip gloss. As she kissed him, releasing years of sexual frustration, she pushed him into a cubicle, and locked it behind them.<br>\r\n<br>\r\n\"What the fuck, Jen?\" he said, stunned, pushing her away (a little reluctantly).<br>\r\n<br>\r\n\"I've always wanted you, Jake. You were the first boy I ever saw in that way, even back in Grade School when you were nice. And I want you all the more now.\" she said breathlessly. \"But back then you were all about Sarah and now, you're... you. And besides, I couldn't really have boyfriends and I had to be a virgin until marriage only now I can...\"<br>\r\n<br>\r\n\"Jen, shut up. Sarah will fucking kill you for this.\" said Jake reasonably<br>\r\n<br>\r\n\"Sarah told me to do this!\" she blurted.<br>\r\n<br>\r\nThere was an awkward silence followed by a confused reply.<br>\r\n<br>\r\n\"She told you to?\"<br>\r\n<br>\r\nJen bit her lip and looked away nervously.<br>\r\n<br>\r\n\"Well, not exactly, but she told me to do whatever I always wanted to. And what I want to do most is you.\" she sighed desperately.<br>\r\n<br>\r\nJake was torn. In his new position, he felt less need to be faithful, but he did still love Sarah. He'd also seen a new side to her, that he knew he didn't want to cross. But this was one of the hottest girls in school, throwing herself at him. What would he do?</span></div></div>",
            "created":1526446800,
            "id":2494208,
            "title":"Jake's Self Control"
        },
        "12211221111212111":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "Jake goes home to find Zach sneaking his first cigarette",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>As Jake attempted to debate the situation with Jen, he suddenly felt a hunger take over, as his eyes scanned up and down her body.  Jake could feel an attraction build up as Jen tried her best to seduce him, unbuttoning the top of her blouse to reveal a white bra.  <br>\r\n<br>\r\n\"C'mon Jake, you can't ignore me.  I want you now.\" Jen panted, her eyes widening with anticipation and lust.<br>\r\n<br>\r\nJen clutched the wrists of Jake and placed them on her hips, as she slowly gyrated against his body.  <br>\r\n<br>\r\n\"Fuck it.\" Jake said suddenly as the lust was unbearable, he moved in and leaned into kiss her passionately.  <br>\r\n<br>\r\n\"Oh Jake.\" Jen moaned as Jake kissed her neck, any inhibitions of cheating now pushed to the back of his lust-filled mind.<br>\r\n<br>\r\nThe toilet cubicle door closed and locked, as Jen and Jake were Engaged with each other for session of sexual exploration. <br>\r\n<br>\r\n<b>Ten minutes later...</b><br>\r\n<br>\r\n\"Jake, coast is clear.\" Jen whispered as she peered out from the bathroom door to the school corridor.<br>\r\n<br>\r\nJake pushed his shirt back into his jeans, as he emerged from the girls bathroom.<br>\r\n<br>\r\n\"I would like to do this again, Jake.  I love you.\" Jen blushed.<br>\r\n<br>\r\n\"I gotta go, Jen.  Teacher will be sending out the hunting party for us.\" Jake replied, avoiding Jen's confession.<br>\r\n<br>\r\n\"OK...but I want you....I need you.  Screw Sarah.\" Jen groaned, frustrated at Jake's apparent lack of interest.<br>\r\n<br>\r\n\"Listen Jen, the bathroom time was fun, but that's all it was.\" Jake replied.<br>\r\n<br>\r\n\"You think so? I wonder if that's how Sarah would see it?\" Jen threatened.<br>\r\n<br>\r\n\"You wouldn't dare do that.\" <br>\r\n<br>\r\n\"Watch me.\" Jen said as she paced down the corridor.<br>\r\n<br>\r\nJake looked out the X-39 and pointed it towards Jen, and went through the options on the device.  He found a menu with <b>Memory</b>, and selected <b>Delete</b>.  From here, he was able to program the time range he wanted removed, and press OK.<br>\r\n<br>\r\nAs Jen reached the school door, she stood, looking at her reflection momentarily.<br>\r\n<br>\r\n\"Everything OK, Jen?\" Jake approached, wondering if the X-39 was able to make changes long distance.<br>\r\n<br>\r\n\"Dunno, Jake.  Kinda wondering why I'm not in class.\" Jen blinked, trying to recall the last fifteen minutes of her life.  <br>\r\n<br>\r\n\"We've all had days like that.  What's last thing you remember?\" <br>\r\n<br>\r\n\"Outside with you guys, having my first smoke.  It was great!\" Jen replied, as the nicotine reminded her of her new addiction.<br>\r\n<br>\r\n\"Tell you what, take some of these.  Practice.\" Jake suggested as he handed a few cigarettes from his pack and placed in her backpack.<br>\r\n<br>\r\n\"Cheers Jake.\" Jen smiled as she walked through and joined her classmates.<br>\r\n<br>\r\nJake sighed as Jen sat in class; As he walked back down the corridor, he was briefly concerned about his behaviour.  The old Jake was fully committed to Sarah, and had never betrayed her ever before.  He reasoned that it may have been another of Mark's characteristics he inherited as part of the Life Swap.  Maybe Mark and Vicky were not faithful, he considered as he made his way down the corridor back to class.<br>\r\n<br>\r\nThe school bell sounded for the last time of the day, and the pupils streamed out.<br>\r\n<br>\r\nAs Jake and Sarah waved goodbye to their new posse of smoking friends, they lit up the last of their cigarettes and headed home. <br>\r\n<br>\r\n\"So how was your afternoon?\" Sarah asked as she inhaled, her free arm linked in with his.<br>\r\n<br>\r\n\"It was boring.  Since swapping livestyles with Mark, I have no appetite for studies.  What about you?\"<br>\r\n<br>\r\n\"Me too.  For some reason, I found myself fantasizing over my maths teacher.  I kinda wondered what he would look like naked.  I would never act on it, coz I'm with you, but I think Vicky maybe had a thing for Mr Hendry.\"<br>\r\n<br>\r\n\"I see,\" Jake nodded, as he inhaled.<br>\r\n<br>\r\n\"I like the cigarettes, the feeling of power, popularity, but lusting over older men was not something I was counting on.  You felt anything like that so far?\" Sarah asked as she exhaled towards the pavement.<br>\r\n<br>\r\n\"Nah, I've not lusted over men.\" Jake laughed nervously, his mind fresh from his involvement with Jen. <br>\r\n<br>\r\n\"No.\" Jake lied.  Thanks to the device, he appeared to get away with his cheating, which empowered him.  <br>\r\n<br>\r\n<i>I could have my way with anyone, and wipe their memories of it.  Sarah would never know.</i> Jake's mind considered, as Mark's mentality further tred on his personality.<br>\r\n<br>\r\nAs they took final drags from their cigarettes, they stood outside an Off-Licence and exhaled.<br>\r\n<br>\r\n\"I'm going in for smokes.\" Sarah declared.<br>\r\n<br>\r\n\"Not like that.\" Jake held his girlfriend back.<br>\r\n<br>\r\n\"I can take off my school blazer, you know.\"  Sarah said.<br>\r\n<br>\r\n\"Even doing that, you still look young.\" Jake said, as he took out his device.<br>\r\n<br>\r\nAs he started tapping buttons on the LCD display of the unit, he pointed at Sarah and clicked OK.  Sarah's body slowly started morphing before him; her height grew a few inches, her face matured, and her acne receded.  Her young body also altered, giving her curves and athletic, tanned legs.  Her ponytails disappeared, allowing her long hair to flow down her upper back. <br>\r\n<br>\r\nStanding before Jake, she now looked in her mid twenties at least.<br>\r\n<br>\r\nTaking a glance in the shop window at her reflection, Sarah smiled.<br>\r\n<br>\r\n\"I love it!\"  Sarah beamed.<br>\r\n<br>\r\nMoments later, the schoolgirl emerged from the shop, clutching two packs of cigarettes, giving one to her spellbound boyfriend.<br>\r\n<br>\r\nAs they walked down the street, Sarah's body reverted to its original shape and size.  <br>\r\n<br>\r\nAfter another round of cigarettes, Sarah arrived at her house.<br>\r\n<br>\r\n\"I better go in and face Mom, sis and brother.\" Sarah sighed.  <br>\r\n<br>\r\n\"I know how it feels, I dunno how I'm going to be able to go another night with a smoke.\" Jake considered.<br>\r\n<br>\r\n\"At least you got the X-39 to solve any issues.\" Sarah replied.<br>\r\n<br>\r\n\"I know.  But remember - get Sam on your side and your Mom is limited to what she can do.  At least with Sam, you will have an ally.\" Jake reasoned.<br>\r\n<br>\r\n\"OK honey, I gotta go.\" Sarah kissed Jake on the cheek, and walked through the front garden gate.<br>\r\n<br>\r\n\"I love you.\" Jake replied, as his earlier infidelity awakened a new lust within him.  As Jake began walking home, he lit up another cigarette, and began re-evaluating his relationship.  </span></div></div>",
            "created":1526792400,
            "id":2495956,
            "title":"He let's things take their natural course w..."
        },
        "122112211112121111":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "Turn Zach into a girl.",
                "Make Zach into a sensitive, effete pantywaist.",
                "Do nothing and walk away; this situation itself is the perfect punchline.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Walking into the house from the woodland side, at the bottom of the garden while openly and nonchalantly smoking his cigarette, Jake saw Zach nervously looking around from the same position he had been in the previous night. Amused, he realised what was about to happen; it had long since ceased to matter, as events had overtaken this old plan, but he could still have a little fun with this. He settled down to watch.<br>\r\n<br>\r\nZach had a box of matches and a Virginia Slim Menthol (why the fuck was he smoking a woman's cigarette?), and after lighting his cigarette, exhaled with a relieved look. However, the relief soon turned to confusion. He shook his head and dragged again. Jake decided to make his move.<br>\r\n<br>\r\n\"What are you doing out here, dipshit?\" he said mockingly, before making a huge show of 'noticing' the lit cigarette. \"Oh, this is great! Mom is going to fucking crucify you!\"<br>\r\n<br>\r\n\"Don't, man. It's my first one ever. I dunno why, but today I was feeling really weird and I just wanted to try it for some reason.\" Hmm. So Zach didn't get the false memories? Maybe the Paste function got a little glitchier each time a trait was pasted directly without copying it again first? So in this case the addiction was here without the rationalisations? That was worth remembering.<br>\r\n<br>\r\n\"You felt a little weird, huh? Maybe it's your period? Not to worry, I'm sure you've come a long way now, baby.\" said Jake sarcastically, enjoying this new power dynamic with his formerly dominant brother.<br>\r\n<br>\r\n\"I have no idea what the fuck you're talking about.\" said Zach nervously. That had been a little of the old Jake there; too smart for his own good, remembering and referencing things nobody else really got. That joke had been so bad anyway; dorky. He cringed inwardly.<br>\r\n<br>\r\n\"The fucking cigarette, dumbshit!\" said Jake in exasperation. Now THAT was all the new Jake. \"Why you smoking a woman's cigarette like some sort of faggot for?\" There; the old Jake would never have said that one. Either he was becoming more Mark like or overcompensating to prove to himself that he really was a different person. Nah, totally Mark, he thought.<br>\r\n<br>\r\n\"Oh this? I felt weird buying so I chickened out and had to sneak one of Mom's.\" said Zach defensively. \"Please don't tell her. And don't tell Emily; her Grandmother just died of lung cancer and she'll...\"<br>\r\n<br>\r\n\"Wait, what?\" said Jake, taken aback.<br>\r\n<br>\r\n\"Emily's grandmother just died of lung cancer so she's on this big anti-smoking kick...\" said Zach, puzzled.<br>\r\n<br>\r\n\"No, fucko, not some old bitch dying, who gives a quarter of the tiniest of shits about that? The bit about Mom.\" said Jake angrily.<br>\r\n<br>\r\n\"What about Mom?\" said Zach, perplexed now.<br>\r\n<br>\r\nJake thought hard. Of course. In the blended life that was part his (in family structure) and part Mark (in choices), he'd been starting smoking himself right around the time that he'd originally been teaming up with Allison to pressure Mom to quit; so of course he hadn't tried to cut off his own supply. Mom still smoked now. He grinned; that was good. He was an established smoker, and his Mom couldn't rag on him without being a hypocrite, but golden boy Zach still had a halo to taint. This was priceless.<br>\r\n<br>\r\n\"Please don't rat me out!\" said Zach desperately, a single tear literally coming to his eye as he took another drag on his incongruous feminine cigarette. Jake laughed at his brother hysterically for a full half minute before finally composing himself.<br>\r\n<br>\r\n\"You are such a pussy! Are you a fucking woman, Zach, between the bitching, whining and the girly cigs? Do I need to start calling you Zarah, sis? And to think you used to have such power over me!\" he managed to breathe out between bouts of laughter.<br>\r\n<br>\r\nJust then, a wonderful, terrible idea began to form in his head. The perfect joke. He grinned menacingly; Zach dragged on his cigarette nervously, a look of fear in his eyes. Jake's hand reached for the X-39.</span></div></div>",
            "created":1526878800,
            "id":2496715,
            "title":"Zach's new lifestyle choice."
        },
        "1221122111121211111":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "Jake has a \"Man to Man\" talk with Edgar",
                "Jake's grandparents arrive for the BBQ"
            ],
            "content":"<div class=\"\"><div> <span>As Jake tapped the buttons on the device, Zach took another weak puff from his cigarette.<br>\r\n<br>\r\nSuddenly, his fingernails began to grow, and black hair began to extend past his shoulders.  His six-pack torso receded and reformed as Jake continued programming the device to transform his athletic brother.<br>\r\n<br>\r\nZach's attire also altered to mirror his new gender, while he exhaled a small smoke cloud to mask the transformation in his sensitive area.<br>\r\n<br>\r\n\"What you doing?\" Zach queried, his voice far lighter as part of the physical restructure.<br>\r\n<br>\r\nJake smiled at his work, as Zach continued to struggle with his new tender body.  <br>\r\n<br>\r\n“I’m giving you the makeover you deserve, you wuss!” Jake declared as he watched his new sister take another tentative puff off the cigarette.<br>\r\n“I’m gonna get you for what you have done to me.  I look ridiculous!” Zach cried as he exhaled.<br>\r\n<br>\r\n“You’re gonna do nothing.  Now what name we gonna give you…How about Zoe?” Jake joked.<br>\r\n<br>\r\n“I’m Zach, you won’t get away with this you bastard.” Zach/Zoe shouted.<br>\r\n<br>\r\n“What’s all the noise out here?” Martha shouted from the porch.<br>\r\n<br>\r\n“I’ve already got away with it.” Jake responded as he reset Zach’s short term memory.  He reasoned the X-39 would “fill the gaps” if Zach’s immediate memory was wiped.  After several buttons were pressed, Zoe stood wide-eyed with the Virginia Slim between her fingers.<br>\r\n“I’ve just caught Zoe having one of your smokes!” Jake declared.<br>\r\n<br>\r\n“What the hell?  Zoe, give me that, and go straight to your room! You’re grounded.” Martha moaned, as she approached her offspring.  Jake smiled as his mother instantly referred to her former son as now an elder daughter.<br>\r\n<br>\r\nWith no memory of Zach, Zoe surrender the part-smoked cigarette to her mother, and walked inside the house.<br>\r\n“That lady should know not to steel from her mother.” Martha shook her head, before taking an unapologetic drag.<br>\r\nJake smiled at the development of his mother being open about her habit.  To further test the waters, Jake took out his Marlboros and placed one between his lips.  Any fear of reaction was quenched when Martha offered to light him up.<br>\r\n<br>\r\nThrough a fog of smoke between mother and son, Jake found out more about the new reality at home; Martha had tried to quit smoking but was too addicted, her only smoking ally in the family was Jake, whom she caught years ago sneaking about.  Edgar and Allison remained fully opposed to her indulging, and she had been forced to smoke outside after her last quit attempt failed.  Finding out Zoe was now sneaking cigarettes made Martha smile as she took another drag.    <br>\r\n<br>\r\nLater that night, after dinner, Martha headed out onto the patio to feed her addiction.  Jake soon followed her out to join her with an after meal cigarette to the disapproval of his father and younger sister.  With Martha now open with her smoking, the dynamics had now made it that Jake’s own burgeoning habit was now public knowledge in the family.  As Jake and Martha filled their bodies with smoke, they noticed Zoe look from her bedroom window in envy.  <br>\r\n<br>\r\n“Remember we have your grandparents staying with us over the weekend.  Try and keep your smoking to a minimal.” Martha advised as she exhaled.<br>\r\n<br>\r\nJake knew his grandparents loathed the habit, and were anti-smoking zealots, who constantly gave their own daughter a hard time over her addiction.  As Jake inhaled, he thought the forthcoming visit might bring an opportunity to bring much-need harmony within the Miller household.<br>\r\nAfter their smoke, Jake returned inside and went upstairs.  As he made his way to his room, he could hear Zoe cry from the landing.<br>\r\n“You OK?” Jake asked.<br>\r\n<br>\r\n“Fuck off!” Zoe cried.  Jake noticed the gender change had also altered the furnishings of his older brother’s bedroom; Gone were the posters of ska bands, replaced by paintings of butterflies and dolphins.  The dark blue wallpaper was replaced with floral design.  The changes made by the X-39 were far-reaching and could change reality beyond his understanding.<br>\r\n<br>\r\n“Hey, how long you been sneaking Mom’s smokes?” Jake queried the new reality.<br>\r\n<br>\r\n“About a few weeks, Mom seems so relaxed when smoking, I just got curious.  Me and her don’t really bond so I wanted something to bring us closer together.  Because you can’t keep your mouth shut, that won’t happen now.  On top of that, Dad is raging at me for smoking.  Says Mom and you are a bad influence.” Zoe moaned.<br>\r\n<br>\r\n“Open that window up.” Jake instructed as he closed and locked the bedroom door behind him.<br>\r\n<br>\r\nJake removed his Marlboros and offered the pack to his new elder sister.<br>\r\n<br>\r\n“Take it.” <br>\r\n<br>\r\nZoe complied, placing the cigarette to her lips as they leaned out the window and lit up.  Jake noted Zoe continued to struggle with inhaling, so used the X-39 to give another dose of the addiction trait.  As soon as the button was pressed, Zoe relaxed and sighed as the smoke worked its magic.  Her new breasts heaved as she inhaled into her lungs.  Without any signs of struggle, Zoe smiled and exhaled a perfect cone of smoke out of the window.<br>\r\n<br>\r\n“Feel better?” Jake asked as he inhaled.<br>\r\n<br>\r\n“Yeah.  I feel a lot calmer.  I like your cigarettes better.” Zoe considered as she stared at the burning cigarette.<br>\r\n<br>\r\nAfter another few drags, Zoe’s posture relaxed.<br>\r\n<br>\r\n“What am I gonna do?” Zoe asked, smoke punctuating her words.<br>\r\n<br>\r\n“I am gonna help you…after all I got you into this mess.” Jake said, as a new plan formed in his mind.<br>\r\n<br>\r\n\"How?\"<br>\r\n<br>\r\n\"Trust me.\" Jake insisted as he dragged again.</span></div></div>",
            "created":1526965200,
            "id":2496979,
            "title":"Turn Zach into a girl."
        },
        "12211221111212111111":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "... to kiss her immediately, before she could even exhale.",
                "... to walk away, acting on this once had been bad enough.",
                "... to reach for the X-39.",
                "... to do something else."
            ],
            "content":"<div class=\"\"><div> <span>Jake found his Dad in the yard, preparing for the BBQ later, for the scrutiny of his in-laws. Jake found that he had conflicting feelings towards his father; he had had a good relationship with him in his original memories, but also remembered the years of conflict in the new set of memories. Things like this were still disorienting.<br>\r\n<br>\r\n\"Hey Dad, got a minute?\" he asked, his tone uncertain, halfway between conciliatory and hostile.<br>\r\n<br>\r\n\"What do you want, Jake?\" asked his father without looking at him, speaking with a maddeningly dismissive tone.<br>\r\n<br>\r\n\"I wanted to talk to you about Zoe.\" said Jake, more steely now.<br>\r\n<br>\r\n\"Oh, about how you corrupted her?\" came the sarcastic, unfair response. Jake felt tempted to take a swing at his Dad, but lit a cigarette to calm himself. This did not help matters. Edgar wrinkled his nose and continued:<br>\r\n<br>\r\n\"Yeah, exactly that. That filthy habit of yours. It's contagious. What's your next trick? Are you going to get Allison hooked too?\" he snapped.<br>\r\n<br>\r\n\"Zoe is 18. She's an adult.\" exhaled Jake, keeping his cool as best he could. \"Nobody made her do this, she chose it. You should respect her decision.\"<br>\r\n<br>\r\n\"Yeah, she's so adult that she's made the dumbest decision she could have made. And I thought her head at least was screwed on straight. I don't have to respect stupid decisions, Jake. If somebody jumped off a building, I don't have to pretend that was a valid choice just because somebody chose it. So why should I respect Zoe's suicide method any more than that?\"<br>\r\n<br>\r\nCondescending prick, thought Jake. He'd initially considered just converting him to smoking too, but no, fuck this guy; why should he get to experience this feeling, he thought as he took another drag and felt a wave of calm spread out from his lungs?<br>\r\n<br>\r\nStill, his opposition would be a pain in the ass, and that needed to be dealt with. Taking the X-39 in hand, Jake scrolled through his father's stats. He dialed his Confidence and Bravery down to 0, and his Compliance up to 100: not quite the slavery that came with the Obedience trait, but possibly crueler, since it left his will theoretically intact. <br>\r\n<br>\r\nKnowing that now his father would be unable to threaten the dominance of the smokers of the house, Jake made one more spiteful alteration, going into \"Dislikes\" and moving \"Smoking\" from 73 to 100 strength. Now his Dad would despise smoking even more strongly but be utterly powerless to do anything to act on that dislike. It would be hell, thought Jake with a smirk as he aimed the remote and applied the new settings.<br>\r\n<br>\r\nHis Dad looked momentarily confused, as seemed to be the pattern as alterations were made, and Jake exhaled a huge cloud of smoke directly into his face, causing him to cough. His displeasure clear, Edgar could not muster the will to say a word in protest, shaking in impotent rage instead.<br>\r\n<br>\r\n\"Zoe can smoke in the house, as can we all, and you won't utter one single fucking word, old man.\" said Jake menacingly, turning to walk back to the house. \"And don't forget to make sure there are plenty of ashtrays out here unless you want butts all over your precious lawn.\"<br>\r\n<br>\r\nAs he walked towards the house, Jake noticed movement in the small patch of woodland at the yard's end, that he himself and Zoe had both used for their secret smoking. Curious, and worried, he made his way into the undergrowth.<br>\r\n<br>\r\nThere, crouching and watching him, was Jen. Jake groaned inwardly. He could see where this was going immediately.<br>\r\n<br>\r\n\"What the fuck are doing here, Jen?\" he asked wearily.<br>\r\n<br>\r\n\"I... I came here to see you. Because I want to...\" she paused and looked at the ground.<br>\r\n<br>\r\n\"You want to fuck me, right?\"<br>\r\n<br>\r\n\"That's right I want to fu... make love to you! I have to do whatever I want and I want to be with you. I'm a virgin, there's never been anyone else.\" she said, smiling shyly. You're half right, thought Jake, remembering the liason he had wiped from Jen's memory.<br>\r\n<br>\r\n\"But, uh... even if you don't want to make love to me, could you do me a favour? I smoked all the cigarettes you gave me, and I can't get any more. I got IDd: Sally didn't, but she only gave me one of hers and wouldn't share any more and I'd really like to...\"<br>\r\n<br>\r\n\"Here, just stop talking!\" spat Jake in exasperation, extending his pack to Jen. She took a cigarette with gratitude and lit up with her own lighter, flashing him her shy, sweet smile as she exhaled. Jake found that this unexpectedly turned him on; there was something about watching this girl, who would never have smoked willingly, smoking with the same mannerisms and sweet nature she had always had that was just as fascinating to him as the utter transformation Sarah had gone through.<br>\r\n<br>\r\nHe felt a flash of guilt (that he couldn't quite suppress) as he realised that he was interested in this girl too. He wasn't sure if he was just as attracted to her as he was to Sarah, or more, or less; what was certain is he was attracted to her. The thought crossed his mind that, with his absolute power now, he could have both girls if he wanted, he was sure there was some way.<br>\r\n<br>\r\nAs Jen shyly took another enthusiastic drag, watching him with a longing, Jake made a decision...</span></div></div>",
            "created":1527138000,
            "id":2498555,
            "title":"Jake has a \"Man to Man\" talk with Edgar"
        },
        "122112211112121111111":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "Suddenly, Allison barges in, disrupting her brother's plan...",
                "Later that evening, during family dinner with grandparents..."
            ],
            "content":"<div class=\"\"><div> <span>Overcome with lust, giving into temptation, Jake lunged at Jen, and placed his lips on top of hers.  He stuck his tongue down her throat, and could taste her inhaled smoke from her lungs.<br>\r\n<br>\r\nThey embraced passionately, as he ran the fingers of his free hand up and down her spine.  Eventually, they parted to allow Jen to exhale the last of her smoke.  <br>\r\n<br>\r\n\"Wow.\" Jen smiled at Jake while he took a quick drag from his cigarette to calm his emotions.<br>\r\n<br>\r\nJen returned the gesture with another drag from her own cigarette, noting how Jake's attention was now fully on her seductive act. <br>\r\n<br>\r\nAs she exhaled, Jake followed the cloud fly overhead into the sky. Jake couldn't help but be spellbound by the enchantress before him.  <br>\r\n<br>\r\n\"Come with me.\" Jake urged, as he motioned Jen to follow him into the house.  Both ground out their cigarette butts on the doorstep.<br>\r\n<br>\r\n\"Who is that?  Where did she come from?\" Edgar asked as he set up the BBQ.<br>\r\n<br>\r\n\"Fuck off!\" Jake shouted as he and Jen paced into the house towards his bedroom.<br>\r\n<br>\r\nAs much as Edgar felt he should punish Jake for his uncharacteristic outburst, he couldn't muster the assertiveness to exert his authority.  Instead, Edgar sighed, and returned to preparing the BBQ.<br>\r\n<br>\r\n\"Nice room.\" Jen beamed as Jake closed the bedroom door behind him.<br>\r\n<br>\r\nJake considered his next actions as Jen stood smiling at him at the foot of his bed.  <br>\r\n<br>\r\n\"Light up.\" Jake commanded as Jen complied, grabbing his pack and lighting up another Marlboro. As she took a deep drag, the smoke rose towards the ceiling, and Jake could feel a definitive stirring in his groin while she exhaled. Without doubt, Jake concluded that Mark must have had a secret smoking fetish, as he never got aroused by smoking before.<br>\r\n<br>\r\nBefore Jen could take a second inhale, Jake pounced on her, undressing her top and kissing her passionately.  As the embraced and frolicked on the bed, Jake felt animal instincts take over, and his lust was now fully blown.  <br>\r\n<br>\r\nHalf an hour later, the two friends lay on the bed, staring at the ceiling reflecting on their \"first encounter\".  Jake took two cigarettes from his pack, stuck them between his lips and fired them up.  Passing one to Jen, they inhaled simultaneously in silence.  <br>\r\n<br>\r\n\"That was amazing!\" Jen exhaled.<br>\r\n<br>\r\n\"It was.\" Jake agreed as he took another drag.<br>\r\n<br>\r\n\"I can't wait til we go exclusive.\" Jen said as she rubbed her free hand against his chest.<br>\r\n<br>\r\n\"What?\" Jake coughed.<br>\r\n<br>\r\n\"You see, we are meant to be.  Why hide it?\" Jen smiled as she inhaled.<br>\r\n<br>\r\nSarah suddenly entered his thoughts, and a pang of guilt - Jake's original trait - briefly returned.  Jake sat up and removed the X39 from his jacket.<br>\r\n<br>\r\nAfter scanning the device over Jen as she lay and smoked, Jake made some alterations, in particular, increasing her Obedience to him.<br>\r\n<br>\r\n\"Listen carefully, this was fun, I don't deny that.  However, we won't be going exclusive.  Never.  Sarah is my soulmate and I would never betray her.  However, you have shown me I could have some fun independently.  So, we might do this again, but you will never disclose this to anyone.  Do you understand?\" Jake commanded as he pressed the OK button.<br>\r\n<br>\r\nJen nodded, as she smoked.<br>\r\n<br>\r\nJake found a section on her profile marked <b>Anxieties</b> and added a stipulation that she feared disappointing Jake in any way. Jen took one last drag of the cigarette, ground it out on a used dinner plate, and walked towards Jake, pecking him on the cheek.<br>\r\n<br>\r\n\"Your secret is safe with me, Jake.  It is fun but I can also be discreet.\" Jen reassured.<br>\r\n<br>\r\n\"Hey kids, your grandparents will be here shortly.\" Jake could hear his mother shout from the foot of the stairs.<br>\r\n<br>\r\n\"OK Jen, you gotta go.  I got to spend some quality time with the family.  See you at school.\" Jake said as Jen smiled innocently.  Before Jen left, she wrote down her mobile number on his notepad.<br>\r\n<br>\r\n\"Thanks for everything.  Until next time?\" Jen kissed him.  <br>\r\n<br>\r\n\"Maybe.\"  Jake responded. <br>\r\n<br>\r\nAs Jen left the Miller household, Jake prepared for the arrival of his grandparents.  Lighting another cigarette, he considered the challenge they would face.  Like Dad, they were outspoken, and despised smokers.  Even though Dad would no longer openly challenge smoking in the household, the arrival of Dad's own parents could potentially act as a balance.  To make the forthcoming weekend tolerable, Jake knew he had to make further changes before and during their stay. <br>\r\n<br>\r\nUnder Jen's mobile number, Jake began noting ideas on his notepad while stealing glances at the X-39.  <br>\r\n<br>\r\nThere was work to do, he thought as he puffed deeply on his cigarette. </span></div></div>",
            "created":1527224400,
            "id":2498807,
            "title":"... to kiss her immediately, before she could e..."
        },
        "1221122111121211111111":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "The guests finally arrive for the BBQ, and the fun really begins.",
                "Meanwhile, Allison bravekt decides that she should tell Sarah the truth anyway.",
                "Meanwhile, Allison realises that she must play the long game to beat Jake.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>\"What did you do to Zoe?\" yelled Allison while storming into Jake's room, without so much as a hello.<br>\r\n<br>\r\n\"Fuck all.\" he lied transparently.<br>\r\n<br>\r\n\"Don't lie to me. I know our sister and I know she'd never start smoking unless you did something to her to make her do it!\" she shouted. Jake sighed; Allison was actually less than one year younger than him, only one school year below. But it never felt like that. She still had a kid's black and white morality, and was prone to sulks and irrational rages, such as this one. Still, in other ways she was wise beyond her years and had a strange tendency towards sudden outbreaks of wisdom and thoughtfulness. He had been close to her before, in spite of her being sometimes a little bit too much. The current dynamic, though, was very different.<br>\r\n<br>\r\n\"Just what in the fuck am I supposed to have done to her? Taped cigarettes to her mouth, held her nose until she inhaled? You can't force someone to smoke, retard.\" said Jake in a tone of mockery.<br>\r\n<br>\r\nAllison rolled her eyes. \"I don't know how you did it, but you did it. You did... something.\"<br>\r\n<br>\r\n\"Okay, I admit it. I did make this happen.\" said Jake, raising his hands.<br>\r\n<br>\r\nAllison looked triumphant. \"Aha! I knew it! How?\"<br>\r\n<br>\r\n\"I just made it look too cool to resist trying.\" he said, dragging. Allison rolled her eyes as he exhaled in her direction, before flinching away from the nearly spent cigarette thrust towards her face. \"Maybe you'd like to find out what the big deal is yourself?\"<br>\r\n<br>\r\nAllison looked furious and disgusted as she batted away the smoke and the cigarette alike. For a moment, she looked like she might storm out, but then she laughed.<br>\r\n<br>\r\n\"Nice try. You won't distract me like that, Jake. I know you've done something and I demand to know what.\"<br>\r\n<br>\r\nSighing again, Jake decided to try a double bluff.<br>\r\n<br>\r\n\"Okay, okay. You win. I have this remote. It's a magic remote.\" he said, producing the X-39 as he spoke. \"None of this is how it's supposed to be. I'm supposed to be this hopeless fucking nerd. You and I got Mom to quit smoking years ago; nobody in this house smoked until the last two days. Oh, and Zoe is really an athletic guy named Zach.\" he said in mock sincerity.<br>\r\n<br>\r\nHe fully expected an infuriated, incredulous response, but to his surprise saw that Allison was deep in thought.<br>\r\n<br>\r\n\"As crazy as all that seems, I believe you.\" she said softly.<br>\r\n<br>\r\n\"You do?!\" gasped Jake, open-mouthed. \"Why? Everything I just said is completely insane!\". Allison had always been oddly perceptive and strong willed, but surely she couldn't remember the other life?<br>\r\n<br>\r\n\"I know it is, but everything just feels... wrong. I can kind of half remember having two brothers. I remember one kind, smart one I looked up to, and one who was kind of a dick. It just felt like you were both of them somehow. And none of my memories of Zoe seem quite real to me...\" her eyes suddenly widened \"and my god, Sarah! I feel like there's some sweet side to her that's just gone. Is it all your fault, for real?\"<br>\r\n<br>\r\nJake found himself feeling strangely sad, ashamed. It moved him to hear his sister speaking of him in positive terms, even as a half remembered shade. Who would say that about the new him? He looked at the floor, which Allison took as an affirmative response.<br>\r\n<br>\r\n\"Jake, you have to set it all right. You can, can't you? So set it right!\" she implored.<br>\r\n<br>\r\nJake was torn. Part of him wanted to. Part of him loved the power too much. The latter side won, barely.<br>\r\n<br>\r\n\"I don't think I want to, sis.\" he said unsurely.<br>\r\n<br>\r\n\"Then I'm telling Sarah what you just did with Jen.\" came the cold, blunt response.<br>\r\n<br>\r\nJake felt his guts tighten. \"What?\" he asked, betraying his guilt as well as his confusion.<br>\r\n<br>\r\n\"Oh come on, she wasn't exactly quiet. I know what you just did.\" said Allison mockingly. \"And unless you put everything back, so will Sarah, very soon.\"<br>\r\n<br>\r\nA rage built within Jake. She'd just found out the power he held, and she thought THREATS were a good idea. That wouldn't do. Bitch had to learn.<br>\r\n<br>\r\nJake theatrically aimed the remote and started conspicuously applying settings. Allison looked nervous, but managed to remain assertive.<br>\r\n<br>\r\n\"What are you going to do Jake, make me a smoker like Zoe? I'll resist, I'm not so weak minded.\"<br>\r\n<br>\r\n\"Oh, I'm sure you could resist one or two things. But this won't be one or two, Ally. It'll be a cocktail. I'll make you into your own anti-thesis; you'll make me look like a saint. You'll be the dumbest, sluttiest, shallowest, druggiest girl in town, maybe the whole world. You'll smoke three packs a day, and when you can't get cigarettes you'll suck dicks for them. You'll reach ebbs so low that neither of us can imagine them, and you'll be too confused and addled to do anything about it. But like you say, you have a stronger will than most. Maybe you'll be strong enough to resist just enough to sometimes know how far you've fallen, how much you disgust yourself?\"<br>\r\n<br>\r\nAllison was crying silently now. All the confidence was gone, and it was clear the fate that Jake had outlined terrified her. He'd found the perfect threat to make.<br>\r\n<br>\r\n\"No Jake. No. Please.\" she begged quietly.<br>\r\n<br>\r\n\"Then fuck off and don't breath one word about what happened today to Sarah. Or I promise I'll be as good as my word.\"<br>\r\n<br>\r\nAllison backed out of the room in a panic, and Jake could soon hear her frantic footsteps and sobs as she ran away, utterly distraught. Part of him gloried in this, but some small part still felt ashamed.<br>\r\n<br>\r\nThat wouldn't be enough, of course. He'd stopped her from ratting, almost definitely, but the bitch had to pay for the threat she'd made. He resolved to change Allison forever, but without ever once pointing the X-39 at her. No, not her, but lots of other people.<br>\r\n<br>\r\nHe'd make all her friends start smoking and trying adventurous new activities, for one thing. Not so conspicuously or as instantaneously as usual; he'd just subtly nudge their traits towards it, make one or two recent secret smokers. Nothing so far removed from normal teenage experimentation that Allison would know that it wasn't exactly that. Of course, she'd still be just as sanctimonious about it all at first, but not to him.<br>\r\n<br>\r\nAnd as all her friends changed around her, let's see how well the little bitch handled good old fashioned peer pressure. She'd either eventually cave or end up totally alone and miserable. Either outcome was fine by him, thought Jake with a savage grin. <br>\r\n<br>\r\nHe could start today at the BBQ in fact: Allison was allowed to have her \"boyfriend\" Charlie over. He was among the most boring people Jake had ever met, and he'd formed that opinion as the old Jake. Which was probably why he was invited, along with Allison's best friend Lisa and Zoe's \"special friend\" Emily (she had been Zach's girlfriend, for sure, but now there were only unsubstantiated rumours that her very close friendship with Zoe was a little... sapphic), while Sarah wasn't. Sarah just wasn't the kind of friend Jesus would pick, after all, thought Jake angrily. God, he hated this fucking family sometimes.<br>\r\n<br>\r\nWith the distraction passed, Jake returned to his earlier planning. Even with the new sideshow with Allison, which would take some time to bear fruit, he could expect immediate satisfaction here. He twirled the X-39 happily and smiled a cold smile.</span></div></div>",
            "created":1527483600,
            "id":2500042,
            "title":"Allison"
        },
        "12211221111212111111113":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "Use the X-39 to corrupt Allison, turning her into a willing ally",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Ever since Allison's encounter with Jake, she struggled to process the new reality she was a part of.  Looking around the home, the signs of change were all around, from Martha unapologetic smoking behaviour to Edgar's subdued personality.  As she watched Zoe light up another cigarette with her mother, Allison frowned at the \"possibility\" she was looking at her older brother in another reality.  If Jake's story was true, then he truly was dangerous.  She vowed not to become part of his game, and was adamant she would find a way of restoring the natural order within the Miller household. <br>\r\n<br>\r\nEdgar called a \"family briefing\" later that day.  Prior to Edgar's transformation, the \"family briefings\" took the form of a one-dimensional tirade, threatening repercussions if the family unit didn't behave in front of guests.  In these days, no-one would dare challenge Edgar's authority.<br>\r\n<br>\r\nHowever, as Martha, Zoe and Jake all smoked around him, creating a dense fog of cigarette smoke, Edgar begged the family members not to refrain from smoking in front of his own parents during their stay.  <br>\r\n<br>\r\n\"If you really have to smoke, please do it in private.  They will go berserk if they find you all smoke.\" Edgar pleaded with the smokers.  Allison just shook her head in disarray while the rest puffed.<br>\r\n<br>\r\n\"OK, but we will do it for you, just to keep the peace.\" Martha responded, with a powerful puff on her cigarette.<br>\r\n<br>\r\n\"Right, last drags then we need to clean up before your grandparents arrive.\" Martha ordered her fellow smokers.<br>\r\n<br>\r\nWhile Edgar tended to the barbeque, Martha and the children hid all evidence of smoking within the house, removing all ashtrays, packs and lighters, overloading each room with air freshener. <br>\r\n<br>\r\nAs Jake was helping Zoe in the dining room polishing, Allison snuck back upstairs and into Jake's room.  She soon pocketed the device and text her best friend Lisa to meet her away from the house and compose a plan to reverse Jake's changes.  After the text was sent, she returned to help clean in the kitchen, hiding the remote in her pocket.<br>\r\n<br>\r\nGuests started arriving, with grandparents Jacob and Betty the main guests.  Margaret and Trevor, the neighbours, also invited, joined the Millers for the barbeque.   <br>\r\n<br>\r\n\"Hi Mom, how was your trip?\" Edgar hugged them while Martha took their coats.<br>\r\n<br>\r\n\"I wish I could spark up.  Cravings are killing me.\" Zoe confessed to Jake as they looked after the barbeque in the back garden.  Jake nodded in agreement, feeling the urge to light up intensify with each passing moment.<br>\r\n<br>\r\nJake wanted to make sure all guests had arrived before retrieving the X39 and making further changes.  Soon Jacob and Betty joined them out the back at the BBQ.<br>\r\n<br>\r\n\"How's my grandson?\" Betty asked as she hugged Jake.<br>\r\n<br>\r\nJake noted they hugged Zoe as if they always had another granddaughter.  <br>\r\n<br>\r\n\"Crap.  We are outta milk.  I will go and get some.\" Allison lied as she felt the time was right to plot her escape with the X39.  <br>\r\n<br>\r\nAs she walked towards the front door, she checked her phone to see if Lisa had replied.  <br>\r\n<br>\r\n\"C u soon.\" the message read.<br>\r\n<br>\r\nWhile Allison walked outside, she walked right into another guest, causing her to fall backwards.<br>\r\n<br>\r\n\"What you doing with this?  Does Jake know you have the X-39?\" Sarah stood over Allison, as she picked up the X39 which fell out of Allison's pocket.    <br>\r\n<br>\r\nAs Allison struggled to respond, Sarah considered her options...</span></div></div>",
            "created":1527483600,
            "id":2500170,
            "title":"Meanwhile, Allison realises that she must play ..."
        },
        "122112211112121111111131":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "Meanwhile, back at the barbecue, Jake finally enacts his plan.",
                "Meanwhile, back at the barbecue, Sarah takes control for herself.",
                "Lisa arrives at the park, and Allison has some persuading to do.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jake sat in the garden scowling at nothing in particular. He needed a cigarette badly and was beginning to feel a directionless misanthropy towards the world in general. He couldn't wait until he could go get the X-39 and unleash some more hell.<br>\r\n<br>\r\n\"Our Sunshine is taking a long time with that milk, isn't she?\" enquired Betty. Jake's Grandparents always called Allison their sunshine; they saw her as perfect and spoiled her. Probably where that bratty, sanctimonious self confidence came from, thought Jake furiously. It did occur to him that his sister WAS taking a long time, though: part of him worried that she'd decided to take her chances and told Sarah about Jen.<br>\r\n<br>\r\nSuddenly he had a strange feeling, like deja vu or lightheadedness, as though something wasn't quite right. A disturbance in the force, thought Jake, then immediately hated himself for the lameness of his silent reference. It soon passed, however, and everything seemed normal again.<br>\r\n<br>\r\nTime continued to pass slowly for Jake, and after another 5 minutes that felt like days he felt ready to scream. Suddenly he was aware of murmurs of disapproval from his grandparents.<br>\r\n<br>\r\nApproaching across the lawn was Sarah, accompanied by his little sister. Jake momentarily felt like he didn't recognise her, but that was absurd; she was definitely the same Allison as ever. Wearing vivid purple lipstick and a look of sullen dislike, her hair dyed jet black and her tight leather skirt ending well above her knee, it would already be clear that she was seeking to shock and offend even if she hadn't picked her most offensive band t-shirt and tied it open above her clearly pregnant belly. She made Sarah look tame in comparison.<br>\r\n<br>\r\nSitting down while every guest watched her with disapproval, Allison sat staring nonchalantly at her phone, sending texts. She did not engage with or look at anyone, and soon conversation began to awkardly pick up around her, as though everyone present was trying to pretend she wasn't there.<br>\r\n<br>\r\n\"Look what I have\" whispered Sarah to Jake, showing him the X-39.<br>\r\n<br>\r\n\"Where did you get that?!\" gasped Jake.<br>\r\n<br>\r\n\"From your little sister.\"<br>\r\n<br>\r\n\"Allison had it? Fuck, even I'M glad you got it back from her. I can't imagine what she'd have done with it.\" said Jake, relieved.<br>\r\n<br>\r\nSarah felt a little confused by that statement for a second, then realised that for Jake, this Allison was the only Allison that had existed. Whatever had gone on between them today, he had no memory of it.<br>\r\n<br>\r\n\"Can you remember what Allison was like before we changed our lives?\" she asked Jake, curious.<br>\r\n<br>\r\n\"Yeah, she was fucking terrifying! I can kind of relate to her now, but before I felt like puberty had replaced my little sister with some sort of demon; the way she changed so completely overnight. It was only a matter of time until she got in her current situation.\" he said, pointing towards his sister's swollen stomach. \"Why do you ask?\" he added, confused.<br>\r\n<br>\r\n\"Oh, just curious. It's hard to keep everything straight now everything keeps changing.\" she smiled. In fact, she'd frogmarched Allison to the store to equip her new recruit, refining her attributes the whole way. The pregnancy was pure luck, though; they'd passed a pregnant woman, and Sarah had recalled Allison's lectures about consequences and chuckled. She'd already dialled up her hedonism and promiscuity, so why not prove her right about those choices inevitably leading to bad outcomes using the Copy/Paste function?<br>\r\n<br>\r\nSuddenly another silence descended. Allison had taken out some cigarette papers and rolling tobacco, and was making herself a cigarette in silence. All eyes were on her, but nobody dared speak.<br>\r\n<br>\r\n\"You ought not be smoking, young lady!\" said Betty.<br>\r\n<br>\r\n\"I'm not smoking, I'm just rolling a cigarette.\" said Allison sardonically.<br>\r\n<br>\r\n\"Don't get smart with me! Not only are you too young, but the baby...\"<br>\r\n<br>\r\n\"The baby is a big reason why I'm smoking so much lately. Health warnings promise me that it reduces birth weight, and I don't want my vagina wrecking too badly; it's my favourite thing.\" interrupted Allison in a matter of fact tone. There were gasps of shock, and a deeper tension descended on all present.<br>\r\n<br>\r\n\"You are a monster.\" said Betty finally. \"Just the worst person I've ever known. I can't believe you're my granddaughter!\"<br>\r\n<br>\r\n\"I can't believe it either. I'm pretty sure somebody less lame just left me in the bushes, most of the time.\" spat Allison dismissively, rising as she did. \"Well, this has been fucking miserable, like always. I'm off to smoke my cigarette in peace.\"<br>\r\n<br>\r\nAs Allison drew further away, the tension began to lift and a nervous chattering returned. Jake smiled at Sarah; both had found that display to be awesome.<br>\r\n<br>\r\n\"Well, babe, give me the X-39. We can make that shit look dull by comparison.\" grinned Jake, keen to enact his plans at last.<br>\r\n<br>\r\nSarah looked at Jake; she was torn between curiosity about what he would do next and an unwillingness to relinquish the X-39 and the power it gave her. Why should he have all the fun, when her creation had made the biggest scene so far?<br>\r\n<br>\r\n<br>\r\n<br>\r\nOn an empty playground, the pregnant Allison walked uncomfortably across to the swings and took a seat. Taking out the cigarette she had rolled earlier, she lit it with her Zippo and took a deep drag. Holding in the strong, heavy smoke, Ally felt feelings of bliss before finally, reluctantly exhaling from her nose. After taking a second drag, she looked at the cigarette between her fingers and thought of her history with these beautiful things as she exhaled.<br>\r\n<br>\r\nShe remembered meeting a friend in the summer before high school who convinced her to take that fateful first drag, that showed her how wrong she'd always been. She remembered the new friends her habit had led her to fall in with when school started, and how all her old ones had fallen away. She remembered parties, sex,a whole new life and whole new outlook. And the party ending with a positive pregnancy test, nobody letting her smoke and drink in peace since then.<br>\r\n<br>\r\nAnd as she took another drag, frowning, she reminded herself that none of it had been real, that this was only her first cigarette ever. Her original memories had stayed in place, as she willed, but it was very hard to resist. She had to admit it was hard to keep straight what was real, and her memories of sex and debauchery did hold a certain base appeal to boot. And she loved this cigarette; she had to fight to feel disgusted by that fact. Had Jake enacted his threat, it doubtless would have been impossible to resist her new reality, but with fewer changes, she was managing. Maybe if Sarah hadn't gone too far and made her a teen mother, a fate she abhorred in either form, new or old, Allison might have just given in. <br>\r\n<br>\r\nBut now she could resist Jake without arousing his suspicion. She had felt awful about being this way in front of her grandparents, who adored her real self; that was why, as much as she needed to smoke, she had gone out of her way to not do it in front of them. And she had hopefully made an ally, even though the text chain had been an awkward and disbelieving one; a long lost best friend from years ago who had still been her best friend earlier today. She had arranged this meeting, and now Allison could only hope that Lisa would come and help her plan. Grinding out her cigarette, Allison immediately began to nervously roll another, and waited...</span></div></div>",
            "created":1527656400,
            "id":2500890,
            "title":"Corruption"
        },
        "1221122111121211111111313":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "Lisa and Angela return to the Miller BBQ, to action their plan to steal the X39.",
                "Back at the Miller household, Sarah has fun with one of their invited neighbors."
            ],
            "content":"<div class=\"\"><div> <span>Allison smoked silently, devouring each draw of her second ever cigarette.  As the smoke whispered around her, she could see someone emerge from the distance.<br>\r\n<br>\r\n\"Lisa!\" Allison smiled as she stood up, minding the bump she was now carrying.<br>\r\n<br>\r\nThe pair hugged awkwardly, as Lisa barely recognised her former best friend.  After Sarah's changes, the reality had shifted.  Now, Lisa and Allison had drifted apart years before, as Allison was a thrillseeker, and drawn to a bad crowd.  Together, they were infamous for trying everything, from drinking to drugs, and everything in between.   They both sat down on the brick wall, facing the deserted school.<br>\r\n<br>\r\nWatching as Allison puffed on her cigarette, Lisa could barely take her eyes away from the pot belly sticking out from Allison's tank top.<br>\r\n<br>\r\n\"How long has it been?  Two years?\"  Lisa joked.<br>\r\n<br>\r\n\"Just yesterday, actually.\" Allison corrected as she inhaled.<br>\r\n<br>\r\nRather than challenge, Lisa listened intently as Allison recapped the events over the last two days, emanating with Jake finding the X-39, and using it on his family, and concluding with her own transformation.<br>\r\n<br>\r\n\"This is not me, Lisa.  I need you to believe me.\" Allison begged.<br>\r\n<br>\r\n\"Is that wacky baccy you are on?  Am I being Punk'd?\" Lisa joked in disbelief.  She found Allison's story unbelievable.  <br>\r\n<br>\r\n\"It is true, my mind is completely clear. Can't say the same about my body though.\" Allison felt her stomach bump, carrying child, feeling their kicks.<br>\r\n<br>\r\n\"I gotta be honest, Ally, I'm struggling to get my head around this.\" Lisa confessed.<br>\r\n<br>\r\n\"Do you remember us meeting yesterday after school to talk?  You were teasing me about Charlie.  Does that ring a bell?\" Allison asked.<br>\r\n<br>\r\n\"No.\" Lisa replied.<br>\r\n<br>\r\n\"What do you remember about yesterday?\" Allison asked.<br>\r\n<br>\r\nLisa sat and thought for a moment.  Allison could see her friend struggle to recall events just 24 hours previously.  <br>\r\n<br>\r\n\"I can prove it.  You say we haven't spoken in years.  I can tell you a secret you told me just the other day.  Something no-one outside your family know about, apart from me.\" Allison suggested as she took another inhale.<br>\r\n<br>\r\n\"What?\" Lisa shrugged her shoulders.<br>\r\n<br>\r\n\"You told me last week about your crush on Derek in Maths class.  I told you to go for it as I know he is single.\" Allison replied.<br>\r\n<br>\r\n\"But how...?\" Lisa gasped.<br>\r\n<br>\r\n\"I told you.  Why the hell would you come to meet me without hesitation today, if we haven't spoken in years?  None of this was real.  Sarah made it so.\"  Allison explained as she dragged one last time on the cigarette.<br>\r\n<br>\r\nLisa placed her hand on Allison's bump, and could feel the child's kicking. This <i>felt</i> real, Lisa considered.<br>\r\n<br>\r\n\"So Lisa, have I convinced you yet?  What else do you need?\" <br>\r\n<br>\r\n\"Nothing, I guess.  So what now?\" Lisa responded, as she continued to imagine a life-altering device.<br>\r\n<br>\r\n\"We need to get the device back from Jake and Sarah.  I can only imagine the havoc they are causing with it.  But I need your assistance.  I have a plan, and think I could use my current predicament to my advantage.\" Allison said, gently stroking her stomach carrying the unborn child.</span></div></div>",
            "created":1527742800,
            "id":2501243,
            "title":"Lisa arrives at the park, and Allison has some ..."
        },
        "12211221111212111111113131":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "Jake had the X-39, and was ready to act.",
                "Sarah had the X-39, and was ready to act.",
                "Whoever had the X-39, they were still having fun without it; it wasn't out.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Lisa and Allison crouched in the bushes at the end of the family yard, scoping out the scene. They had decided it would look too suspicious if Allison had casually strolled back with a friend from years ago, that it might clue in Sarah at the very least; instead, Lisa would lie in wait while Allison looked for an opportune moment for them to take action.<br>\r\n<br>\r\nAs they crouched, they went over the risks some more together.<br>\r\n<br>\r\n\"The thing is, with the X-39, they have the power of gods\" frowned Lisa. \"If they have any inkling at all that we might steal or even just be onto them, they'll enslave us or worse, make us not even want to stop them, make us just like them.\" <br>\r\n<br>\r\nAs if to accentuate the point, Allison had taken out her papers and tobacco and was sat cross legged, rolling another cigarette. Lisa rolled her eyes, but Allison began to speak.<br>\r\n<br>\r\n\"Which of those happens depends on who has it, I'd say. So far, it seems like Sarah is mostly just loving the power, and she'll do whatever crosses her mind with no worries about subtlety or creativity, just as long as she gets to be boss. Jake though; it seems like he's already almost bored of that. Like he's got to the point that it needs to be this whole byzantine web to entertain him at all anymore\" she involuntarily shuddered at the memory of his earlier threat as she put her cigarette in her mouth. \"I'm not sure which one is more dangerous.\"<br>\r\n<br>\r\nThe sight of her old friend lighting up yet again while heavily pregnant made Lisa feel uncomfortable.<br>\r\n<br>\r\n\"Do you have to do that so much?\" she said with a sigh.<br>\r\n<br>\r\n\"Yes.\" came the curt response, followed by a more civil afterthought: \"Sorry, but yes. I can't help it.\"<br>\r\n<br>\r\nThere was a moment of tension and silence. Lisa decided to break it by moving focus back to the mission.<br>\r\n<br>\r\n\"Anyway, you go over there and send me a message as soon as you see an opportunity to act. I'll be down here watching and waiting. Sound good.\"<br>\r\n<br>\r\n\"Sounds good!\" smiled Allison through her exhale.<br>\r\n<br>\r\nAfter quietly finishing her cigarette (still unwilling to smoke in front of her grandparents), Allison began the plan. Taking her seat, she noticed...</span></div></div>",
            "created":1528606800,
            "id":2505192,
            "title":"Planning"
        },
        "122112211112121111111131311":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "Lisa takes the X39 from Jake's jacket for safe keeping",
                "Betty returns, and collects Jake's abandoned jacket before Lisa can react"
            ],
            "content":"<div class=\"\"><div> <span>\"Hey!\" Allison screamed as she burst through the back garden gate with everyone looking on in bewilderment.<br>\r\n<br>\r\n\"What's wrong?\" Edgar asked as he held his burger.<br>\r\n<br>\r\nAs planned, Allison stumbled towards her family, clutching her stomach in fake pain.  <br>\r\n<br>\r\n\"The baby is coming...\"  Allison lied.<br>\r\n<br>\r\nLisa sat patiently in the bushes, smiling to herself that her best friend's performance was award-winning.<br>\r\n<br>\r\n\"Get me to hospital!\" Allison panted.<br>\r\n<br>\r\nWhile Martha, Edgar and his parents were distracted, Lisa crept towards behind a tree at the back of the garden, where she could smell cigarette smoke.  From behind the hedge, she witnessed as Jake smoked in secret, unable to contain his cravings completely.  Lisa noted they appeared to take turns from the main group, trying to not arouse any suspicions.  <br>\r\n<br>\r\n\"Jake!  Your sis sounds like she is in trouble.  We better go help.\" Sarah instructed as she held out her hand to retrieve their shared cigarette from Jake, who took one last puff.  Leaving a trail of smoke behind them, they returned to the guests.<br>\r\n<br>\r\nWith a mixture of concern and dismay that their once-angelic daughter was about to give birth, Martha and Edgar guided their pregnant daughter towards the car in the driveway, followed by Jake and Zoe.  Edgar told his parents to stay by the phone inside, as the neighbors joined them for moral support.<br>\r\n<br>\r\nAs Allison sat in the front passenger seat, she could smell the fresh cigarette smoke emanating off her brother and his girlfriend.  <br>\r\n<br>\r\n\"Sorry but I'm dying for a smoke.\" Martha declared, as she took out a pack of cigarettes and rolled down her back seat passenger window, and lit up.  The first drag was relief having abstained during the visit of Jacob and Betty, and Martha followed the drag with others in quick succession. <br>\r\n<br>\r\nEdgar could see Jake and Zoe sneak puffs off their mother's cigarette while he drove down the highway.<br>\r\n<br>\r\n\"How could you smoke with your daughter here about to give birth? Shame on the lot of you.\" Edgar moaned.<br>\r\n<br>\r\n<i>I'm sick of my father's attitude.  Time for him to be adjusted again.</i> Jake thought as he reached into his pocket.<br>\r\n<br>\r\n<i>Oh crap!</i> Jake thought as he could not feel the X39.<br>\r\n<br>\r\nAt the Miller household, Lisa waited in the bushes, ensuring the garden was empty of people.  She could see Jake's jacket on the back of one of the garden chairs, containing the device.  Now was her chance to grab the device and save her friend.<br>\r\n       </span></div></div>",
            "created":1528606800,
            "id":2505271,
            "title":"Jake had the X-39, and was ready to act."
        },
        "1221122111121211111111313112":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "... and told a convincing lie with Oscar winning charisma and authenticity.",
                "...and tore into her hated brother.",
                "...and said something she hadn't even realising she'd been thinking.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Seeing the telltale outline of a remote in Jake's jacket pocket, Lisa quickly fired off a text to Allison: \"I think I've got it!\"<br>\r\n<br>\r\nMarching across the lawn, her heart beating ever faster, Lisa felt a rising sense of triumph. She grinned involuntarily at the thought that she'd get her best friend back: she'd never really replaced Allison with anyone else. Finally, she reached the jacket and picked it up. She was reaching for the pocket when she heard a voice.<br>\r\n<br>\r\n\"Just what do you think you're doing, young lady?\" asked Betty, sternly.<br>\r\n<br>\r\nLisa froze and turned. She had to think fast to come up with an excuse. Unfortunately, panic stalled her, and she could only stand with her jaw slack. Some small measure of recognition crossed Betty's face.<br>\r\n<br>\r\n\"Don't I know you?\" she asked.<br>\r\n<br>\r\nYes, perfect! Lisa knew exactly what to say.<br>\r\n<br>\r\n\"We have met, I'm a friend of Allison's! She told me her brother had forgot his coat so I should bring it to her at the hospital!\" she announced, a little too triumphantly.<br>\r\n<br>\r\n\"I wasn't born yesterday. I think I did see you with Allison before, but it was years ago. The old Allison. I know who my granddaughter is now, and I can tell by looking at you that you're no friend of hers.\" said Betty, icily, as Lisa's face dropped. \"and I'm supposed to believe that in the middle of the agony of childbirth, she noticed that her brother didn't have his jacket and sent you a text about it? And my grandson found it necessary to also call me and request I collect it in spite of that? No. I don't know what you're after and I don't care. Just give me the jacket and be on your way.\"<br>\r\n<br>\r\nLisa sighed. She'd been caught out. But wait... she had the X-39! All she had to do was use it on this woman. Her expression hardened, and she reached towards the pocket... but it was no use. She couldn't do it. She couldn't use the instrument of all this chaos, even if it was to fix it. She had to keep the high ground. Deflated, she handed over the jacket, remote and all.<br>\r\n<br>\r\n\"Good. Now be on your way before I call the police, and we'll forget this ever happened.\" said Betty evenly.<br>\r\n<br>\r\n<br>\r\n<br>\r\nLater, at the hospital, Allison stepped out of the front doors and immediately lit a cigarette, drawing many disapproving gazes. She didn't care; she'd been gasping, and it was heavenly. As she watched her exhale dissipate, she felt a pang of sadness that soon she wouldn't smoke anymore. She understood it better now, and almost wondered if she might start again, or even just keep the elevated hedonism and addictions when she put everything else back. It'd be nice to have a celebratory drink or twelve when there was no more baby.<br>\r\n<br>\r\nNo! That was the corruption subtly overriding her will. She knew that. She was glad she would soon be free, because eventually it might still win, otherwise. She looked at Lisa's message again and grinned, taking another drag as she did. Lisa had it in the bag! Soon all would be well.<br>\r\n<br>\r\nAllison heard the click of another lighter, and turned to see her brother lighting up at her side.<br>\r\n<br>\r\n\"Crazy night, huh, sis?\" he said sardonically.<br>\r\n<br>\r\n\"I know, right? Can't believe it wasn't the real deal.\" she said with a twinkle in her eyes.<br>\r\n<br>\r\n\"What did the white coat in there say it was? Braxy-Hiss contractions?\"<br>\r\n<br>\r\n\"Braxton-Hicks. I think it just means 'fake'\" she laughed. She realised that she was breaking character a fraction of a second too late, and saw her brother's eyes narrow.<br>\r\n<br>\r\n\"You didn't seem, like, all that surprised, though.\" he said, with a hint of suspicion.<br>\r\n<br>\r\n\"I guess I was just too busy being relieved that I didn't have to push a baby out of my pussy today after all.\" she said with a lopsided grin, hoping the vulgarity restored the facade completely. Her brother did let out a snort of laughter, and she relaxed inwardly.<br>\r\n<br>\r\n\"Funny story though; did you know I left my jacket at home?\" said Jake innocently. Allison stared at him in confusion.<br>\r\n<br>\r\n\"The fuck do you mean? You're wearing your jacket.\" she said, bewildered.<br>\r\n<br>\r\n\"I had Grandma bring it to me.\"<br>\r\n<br>\r\n\"What's so special about a dumb jacket? Didn't think fashion was such a big deal to you.\" she said dismissively, exhaling smoke mid-speech.<br>\r\n<br>\r\n\"But it's a really good jacket! Seriously, Grandma told me that she even caught some asian chick trying to steal it. Said she was a friend of yours and you'd texted her to ask her to get it. That was kind of you, sis. But wait... you didn't know I left it?\"<br>\r\n<br>\r\nAllison stared at him, trying to keep a poker face. She knew she was smarter than him. She knew she was a good enough liar to get out of this. But she also hated him, wanted to gloat. He didn't have the X-39 anymore, and he couldn't do anything. So why should she lie? Far better to tell him how dumb and beaten he was.<br>\r\n<br>\r\nIn the back of her mind, an alarm bell was ringing, but her impulsive side was driving her toward striking. The old, cautious Allison, though, was trying to puzzle this out. She opened her mouth...</span></div></div>",
            "created":1528606800,
            "id":2505453,
            "title":"Betty returns, and collects Jake's abandone..."
        },
        "12211221111212111111113131124":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "As the Millers return home, Jake turns his grandparents into smokers",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Fellow patients and visitors frowned as they passed brother and sister puffing away.  The image of a pregnant teen smoking disgusted the hospital staff as they moved between corridors.  Meanwhile, Martha, Edgar and Zoe were in the hospital reception discussing the near miss with the doctors.<br>\r\n<br>\r\n\"Game is up.  That is twice you have now tried to steal the X39.\" Jake declared.<br>\r\n<br>\r\n\"You are a shit liar, Ally.  No bullshit, what do you want with the device?\" Jake asked.<br>\r\n<br>\r\n\"I don't wanna be pregnant!  I don't wanna smoke! You changed me out of spite!  I want you to change me back!\" Allison cried as she took another drag reluctantly.<br>\r\n<br>\r\n\"Why didn't you say, Ally?  All you had to do was ask, not steal.  We are not monsters, ya know.\" Jake smiled as Allison struggled with the physical adjustments.<br>\r\n<br>\r\nRemoving the device from his jacket, he sneered at his sister.<br>\r\n<br>\r\nAs Jake punched settings into the device, Allison could feel pain shoot through her stomach.  The baby was without doubt kicking, and making her feel nauseous.  <br>\r\n<br>\r\n\"Don't...\"  Allison begged as she could feel her unborn baby grow inside.<br>\r\n<br>\r\n\"You know I can progress your pregnancy to any period.  Do you want to go back to how you were?\" Jake teased.<br>\r\n<br>\r\n\"Of course!\" Allison clutched her stomach.<br>\r\n<br>\r\n\"Then you will drop your attitude towards us as of immediately.  You wont oppose anything I choose to do with the X39.  I want your word you will accept everything as it is from now on.  Agree and I will change you back.\" Jake demanded.<br>\r\n<br>\r\nThe pain was unbearable - the contraptions now intense as Jake had advanced her pregnant state.<br>\r\n<br>\r\n\"OK you win.  Please stop this!\" Allison pleaded.<br>\r\n<br>\r\nTaking another deep puff, Jake pointed the device at Allison and started customizing the physical and mental attributes added previously.  Before their eyes, they could see Allison change;  The baby bump receded slowly into a flat stomach, her dyed jet-black hair returned to its auburn color, the purple lipstick also disappeared.  Her clothing attire also changed, from short tartan skirt to her conventional trousers, and white blouse.  <br>\r\n<br>\r\nAllison looked back at her reflection in a hospital window and smiled in relief.  No longer carrying a baby, she saw her appearance had reverted before she was changed.  However, she still felt something inside lingering, unchanged from her metamorphosis.<br>\r\n<br>\r\n\"Remember our agreement, Ally - if you plot against me, I can easily turn you back into teen mother, or worse.\" Jake warned.<br>\r\n<br>\r\n\"Right kids, let's go!\" Martha declared as they piled into the car.<br>\r\n<br>\r\nAs soon as they hit the highway, they family, with exception of Allison and Jake, had no recollection of why they had just been at hospital.  Collective amnesia, Jake smiled as he took out his cigarettes, desperate for another fix. Offering the pack around the passengers, they all accepted, with exception of Allison.  As each lit up, the smoke tickled her senses, and the lingering sensation raged within her.  Without thinking, she found herself inhaling the secondhand smoke as Martha, Zoe and Jake all smoked around her.  <br>\r\n<br>\r\n\"Want one?\" Jake teased as he offered to his sister.<br>\r\n<br>\r\n\"No.  I don't smoke.\" Allison replied, fighting the urges.<br>\r\n<br>\r\n\"Since when?\" Martha laughed as she dragged, thinking Allison had smoked for as long as Jake. <br>\r\n<br>\r\nAs the cravings raged, Allison gave in, taking a Marlboro from her brother and placing between her lips.  She accepted the light and sucked deeply, her eyes closing as the smoke worked its magic into her body.  After a few moments, she removed the cigarette and exhaled casually - at least it wasn't the rollups she was smoking, she considered as she took another drag.<br>\r\n<br>\r\nEdgar coughed as he fanned the smoke out the driver seat window. <br>\r\n<br>\r\nFeeling empowered by his victory over Allison, Jake pointed the device at the back of Martha and copied her addiction and devotion to smoking.  Thereafter, he pointed the device to the back of Edgar's head and Pasted the attribute into his father.  <br>\r\n<br>\r\n\"Bloody hell, doesn't the driver get a smoke?\" Edgar moaned suddenly, as the attribute kicked in.<br>\r\n<br>\r\n\"Sorry honey.\" Martha smiled as she removed her pack of Salems and placed a filter between Edgar's lips.  Lighting up her husband, Martha took a deep drag off her cigarette while he sucked deeply the smoke into his virgin lungs.<br>\r\n<br>\r\n\"I've been gasping for ages!\" Edgar declared, as he took another powerful pump from the cigarette.  Allison frowned at Jake for turning her father into a smoker, while nursing her own cigarette. <br>\r\n<br>\r\nThe Miller car sped down the highway, leaving a trail of cigarette smoke in its wake as the family now shared a mutual bond and love of tobacco.<br>\r\n</span></div></div>",
            "created":1529211600,
            "id":2508356,
            "title":"Something else."
        },
        "122112211112121111111131311242":{
            "author_id":"boethius88",
            "author_name":"Boethius",
            "choices":[
                "Lisa thinks it's a good plan.",
                "Lisa thinks it's a bad plan, but they should still resist in some way.",
                "Lisa thinks they should just leave Jake be.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>It was near midnight, and Allison once again sat on the swing set at the old park, silently sobbing with impotent fury. Things were worse than ever! Everybody smoked now, including her, and she'd lost the element of surprise. <br>\r\n<br>\r\nShe frowned at the sight of the pack of Marlboro in her hand; somehow smoking seemed so much worse now she was fully herself again. She wasn't sure if it was the loss of the enhanced hedonism trait or just that wearing her own clothes, having her old life mostly back, simply stripped away the insulating, dream-like haze that had made it seem less bad when she was pregnant and fighting against her personal corruption. On the whole though, effects of smoking aside, she felt so much better physically. She had never drank, and her virginity was restored. She found she couldn't even remember the backstory memories of her corrupted self, only the things that had actually happened to her while in that form.<br>\r\n<br>\r\nAs wrong as it felt, she'd taken the cigarettes and the lighter though. She remembered Jake gloating \"You'll be needing these\". She remembered hating him so much. But she had also known he was right, and had taken them with a feeling of shame and resignation.<br>\r\n<br>\r\nStill, she hadn't actually smoked. The cravings had been clawing at her soul for hours now, but she hadn't given in. She opened the pack and saw the 20 brown filters; her heart skipped in anticipation, knowing that all her anxiety could go away with one quick flick of the lighter in her other hand. Sobbing, she snapped the pack back shut, unwilling to give in. At least, not just yet.<br>\r\n<br>\r\nShe heard approaching footsteps, and began to feel nervous, twitchy. She turned and saw Lisa approaching, and sighed in relief.<br>\r\n<br>\r\n\"What's this all about, Al?\" said Lisa, clearly confused. Her friend sighed. This was complicated...<br>\r\n<br>\r\n\"Think Lisa, don't you know?\" pleaded Allison.<br>\r\n<br>\r\n\"I... sort of do. I feel like something weird happened today. But I don't remember what, I just have a bunch of confused images in my head.\" replied Lisa sadly.<br>\r\n<br>\r\n\"What images? Come on, Lisa.\" encouraged Allison.<br>\r\n<br>\r\n\"I... remember you being pregnant, and a burnout, and that we weren't friends anymore... but we always have been! And I remember some kind of magic remote... Did someone drug us?\"<br>\r\n<br>\r\n\"No, Lisa, it's all real. Jake has a magic remote. He changed me and the world changed around that. But then he changed me back, mostly, and that's why you remember the truth now.\"<br>\r\n<br>\r\nLisa paused, trying to digest this baffling information. She looked frightened.<br>\r\n<br>\r\n\"So... do we still have to stop him? If he changed you back, maybe that's our cue to leave him to it?\" came her eventual, cautious statement.<br>\r\n<br>\r\nAllison leapt to her feet, and started pacing angrily.<br>\r\n<br>\r\n\"How can you say that! No matter what he threatens us with, we have a moral duty to stop him! It'll take more effort now, more guile to be sure, but we still have to try! He can't be left to run amok! He can't be allowed to control everyone, just corrupting the entire world on a whim! He's already made my entire family smoke, which is such a filthy habit, and who knows where he'll stop, if we don't put a stop to this ourselves!\" ranted Allison. She felt better now, less tense.<br>\r\n<br>\r\n\"But Allison... if smoking is so awful to you, why are you smoking?\" said a puzzled Lisa after a pause.<br>\r\n<br>\r\nAllison took a drag and frowned. She had been so distracted, so stressed, that her body had gone into autopilot. She'd lit up as she spoke without even noticed, taken two drags, talked before exhaling. None of that had registered consciously, so natural was it. She exhaled, and began to think.<br>\r\n<br>\r\n\"Lisa... everything is back to normal now. We've been friends forever. I'm ME. Why do I smoke? Why did I start? There's no backstory it fits into anymore, is there?\"<br>\r\n<br>\r\nLisa looked puzzled. \"But... you've smoked for years. Nobody but me and your family know about it really, because you're so embarrassed about it and you're right, it doesn't fit your image, but you do smoke. I guess it is a little odd, and I admit it was weird to me at first but... you know, your whole family does, and so I guess it just made sense that you would too.\" said Lisa apologetically.<br>\r\n<br>\r\nAllison smiled. \"No, this is a good sign. That logic is so weak; maybe when the changes are hard to rationalise, the effect of the X-39 on reality is weaker? That would explain why you can kind of remember the other me; this trait belongs to that form, only really make sense there, so it echoes. Maybe if we can create enough inconsistencies, that could end this somehow?\"<br>\r\n<br>\r\nLisa wasn't convinced. \"How would that end this? It'd make everyone confused, sure, but past that?\"<br>\r\n<br>\r\nAllison took an enthusiastic drag on her cigarette, and visibly relaxed. She sighed with pleasure as she exhaled, and Lisa had to admit to herself that at times like this her friend made smoking seem appealing; she banished the thought that it made her a little curious from her head before it even took conscious form, and Allison opened her eyes and spoke again, beaming.<br>\r\n<br>\r\n\"I'm not sure exactly how yet, but I think I'm on to something. It means taking a different tack, though: instead of openly acting against Jake, stealing the X-39 or whatever, I'm going to have to pretend to be on his side. Manipulate him into overextending himself.\" Allison dropped her cigarette and crushed it out, letting out a huge, satisfied exhale as she did. \"So what do you think?\"<br>\r\n<br>\r\nLisa thought about the question. It seemed to her that there was a big risk of being corrupted in the same way Jake had been by this, but this was Allison; if anyone could resist temptation, it was her. Part of her wanted to just stay out of the way of all this. On the whole, though, the plan seemed good. She gave her reply.</span></div></div>",
            "created":1529211600,
            "id":2508668,
            "title":"Later that night..."
        },
        "1221122111121211111111313112421":{
            "author_id":"blackbladder",
            "author_name":"Blackbladder",
            "choices":[
                "\"Your partner in crime, Lisa.\" Jake smiled.",
                "\"Our Grandparents.  It's time to end their bickering.\" Jake suggested."
            ],
            "content":"<div class=\"\"><div> <span>Allison soon returned home, opening the door to the Miller household.  <br>\r\n<br>\r\nHer first reaction was to the stale smell of cigarette smoke permeating the atmosphere.  Debate could be heard in the living room next door.  As she creeped past the door, she could see her mother and father arguing with Betty and Jacob over smoking.<br>\r\n<br>\r\n\"How long you been smoking behind our back?\" Betty asked.<br>\r\n<br>\r\n\"I've done it for years!\" Edgar groaned, taking a puff of his cigarette to exclaim the point.  Since Jake turned him into a smoker, reality shifted to accept his new habit.<br>\r\n<br>\r\nBetty and Jacob shook their heads as Edgar explained how he kept his smoking habit secret from them for years, out of shame.  Contrary to the old reality where Edgar tried to get Martha to quit smoking, the new version was Martha seduced Edgar into taking up the habit when they first met.  Martha supported her husband as he chain-smoked in front of his parents for the first time.<br>\r\n<br>\r\n\"I thought I could be treated as an adult, for once.  It is our house, after all.  You will just have to respect our decision to partake, and we will respect your space while you are here.\" Edgar continued, as he lit up Martha's cigarette to the bewilderment of his parents. <br>\r\n<br>\r\n<i>The X39 is very powerful</i>, Allison thought as she continued upstairs to begin part of her plan. <br>\r\n<br>\r\nAllison tapped her brother's door.<br>\r\n<br>\r\n\"What you want?\" Jake asked as he saw his sister stand nervously.<br>\r\n<br>\r\n\"A truce.  Can we talk?\" Allison pleaded.<br>\r\n<br>\r\nAs Allison sat on Jake's bed, she took out her Marlboros and offered the pack to her brother.  Jake accepted, placing the filter between his lips before lighting up with his zippo.  Allison followed suit, taking a deep drag off her cigarette.  While her plan to intercept Jake's device was still in effect, she couldn't deny the joy that smoking was giving her.  Even with undoing the corruption thus far, she struggled to comprehend returning to her life as a non-smoker. <br>\r\n<br>\r\n\"You will have to be quick, I got Jen coming over soon.\" Jake exhaled.<br>\r\n<br>\r\nRather than comment on his infidelity, Allison took another puff off her cigarette.<br>\r\n<br>\r\n\"I want to apologize for trying to steal the X39 from you.  I was misguided.\"  <br>\r\n<br>\r\n\"You forgot mentioning the <b>two</b> attempts made to rob me off the device.  Why should I trust you ever again?\" Jake asked as he inhaled.<br>\r\n<br>\r\n\"You are my brother, I love you, and I don't want us to fight amongst each other as it is.  Family is very important, and its important we keep a close bond.\" Allison lied while exhaling towards the ground. <br>\r\n<br>\r\nOffering his sister the makeshift ashtray to de-ash, Allison continued.<br>\r\n<br>\r\n\"Instead of fighting you over the X39, I want to learn more about it.  In hindsight, I'm curious to see how the tool works in real-time.  Would you allow me to work with you?\" Allison asked as she exhaled a cloud of smoke towards him.<br>\r\n<br>\r\n\"How can I trust you?\" Jake asked.<br>\r\n<br>\r\n\"Faith?\" Allison blew another cloud of smoke towards her brother, provoking a reaction.<br>\r\n<br>\r\n\"Faith doesn't cut the mustard.  However, a test would.\" Jake replied as he returned the gift - a cloud of smoke aimed at his sister.<br>\r\n<br>\r\n\"I am thinking a challenge would be in order.  Pass the challenge and I will let you in.\" Jake suggested.<br>\r\n<br>\r\n\"So what do I have to do?\" Allison asked, exhaling yet again.<br>\r\n<br>\r\nWith cigarette dangling, Jake pressed buttons on the X39.<br>\r\n<br>\r\n\"I have set up the X39 to make changes.  All you have to do is approach the target, or targets, and <b>Apply</b>.  No questions asked, no tampering.  I will be with you during the challenge.\" Jake explained.<br>\r\n<br>\r\n\"Who is the target?\" Allison queried  <br>\r\n  </span></div></div>",
            "created":1529384400,
            "id":2509605,
            "title":"Plan B - The Olive Branch"
        },
        "12211221111212111111113131124211":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "She was at Lisa’s, and applied the changes",
                "She made her move, and hit apply while aiming at Jake",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>“L-Lisa?” Allison stuttered.<br>\r\n<br>\r\n“Is that a problem?” Jake smirked.<br>\r\n<br>\r\nAllison discreetly grit her teeth and shook her head. “Not at all.” She grabbed the X-39 and started walking out of the house, her brother close behind. Soon enough...</span></div></div>",
            "created":1604491500,
            "id":2934342,
            "title":"\"Your partner in crime, Lisa.\" Jake smi..."
        },
        "122112211112121111111131311242111":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "The same ones Sarah made to Allison before",
                "She was changed into either an elderly woman or a little child",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Soon enough, the pair arrived at Lisa’s. They saw her through the living room window, doing something on her phone while watching tv. Allison gulped, and mentally begged Lisa to forgive her, hoping she can still have Lisa as an ally, but worrying she can’t. She aimed the X-39 at Lisa, thinking about what changes Jake was making her apply to her best friend, and pressed the Apply button.<br>\r\n<br>\r\nWhat were the changes?</span></div></div>",
            "created":1604491740,
            "id":2934343,
            "title":"She was at Lisa’s, and applied the changes"
        },
        "1221122111121211111111313112421112":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Elderly woman",
                "Little girl",
                "Little boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one? Elderly woman or little child? If a child, is she still a girl, or is she now a little boy?</span></div></span></div>",
            "created":1604491860,
            "id":2934344,
            "title":"She was changed into either an elderly woman or..."
        },
        "122112211112121111111131311242112":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "The same changes Sarah made to Allison earlier applied to Jake",
                "Nothing. It was just a test, and since she failed, he snatches the X-39 back",
                "She merging else"
            ],
            "content":"<div class=\"\"><div> <span>Allison realized, how was her only chance. She didn’t know what changes Jake had set for her to make to Lisa, but it was a good bet that one of them was to erase her memory of the X-39. After all, she was a loose end. Since Jake couldn’t keep an eye on her, it would be best, in his eyes, to make her forget all about the X-39. Which means, if she applied the changes he set for Lisa on him instead, she might finally win, and be able to set things right. So before they even made it out the front door, she quickly spun around, and pressed the Apply button the exact second the remote aimed at Jake.<br>\r\n<br>\r\nWhat happened next?</span></div></div>",
            "created":1604492400,
            "id":2934345,
            "title":"She made her move, and hit apply while aiming a..."
        },
        "1221122111121211111111313112421121":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Jake, now Jane, asks what Allison is holding(memory of X-39 was erased)",
                "Jake, now Jane, grabs the X-39(she remembers the remote, but not being Jake)",
                "Jake grabs the remote, punishing Allison before undoing the changes to himself"
            ],
            "content":"<div class=\"\"><div> <span>A second later, instead of the formerly good, then power hungry brother standing before her, a pregnant girl around her age, with similar features to what she had earlier, courtesy of Sarah, including makeup and clothes. For a moment, Allison was stunned, and a little angry, that Jake would make her change her best friend in such a cruel way.<br>\r\n<br>\r\nIn Allison’s brief moment of being stunned by the changes...</span></div></div>",
            "created":1604492880,
            "id":2934347,
            "title":"The same changes Sarah made to Allison earlier ..."
        },
        "12211221111212111111113131124211212":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "She makes a booty call",
                "She starts using the remote to mess with people",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Jake, now Jane, immediately grabs the remote in Allison’s brief moment of being stunned by the changes made to ‘her’, and hits Apply while aiming the X-39 at Allison. She was immediately back to being the rebellious pregnant girl Sarah had previously turned her into. Jane then backed away while Allison once again took in her own changes, and she quickly made one more change to her, making her forget about the X-39. She then left, before she could ask her what the remote in her hand was. Once back in her room, alone again, she looked at herself. She remembered all the sex she has had as Jane, which eventually lead to her getting pregnant. She didn’t remember being a boy named Jake, but she knew something about her had changed. Considering the changes she was planning on having Allison make to Lisa, before the bitch betrayed her, she guessed what changed was the pregnancy. She guessed she never got pregnant in the original reality, so she quickly got rid of the pregnancy. Back to being the normal, sexy, rebel girl she remembered always being, she smirked at her reflection, thinking about how she beat her younger sister once again. “That bitch won’t fool me again. She got what was coming to her.” Jane touched up her makeup, blowing a kiss at the mirror, imagining the first boy that came to mind, her last hookup, and gave the most convincing fake grin she could. “There. Now, what to do?”</span></div></div>",
            "created":1604494560,
            "id":2934354,
            "title":"Jake, now Jane, grabs the X-39(she remembers th..."
        },
        "12211221111212111111113131124211213":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "Hid the X-39 away. She decided to stay this way. For now.",
                "Aimed the X-39 at herself, but only got rid of the pregnancy",
                "Aimed the X-39 at herself, changing back into Jake"
            ],
            "content":"<div class=\"\"><div> <span>Jake immediately grabs the remote in Allison’s brief moment of being stunned by the changes made to him, and hits Apply while aiming the X-39 at Allison. She was immediately back to being the rebellious pregnant girl Sarah had previously turned her into. He then backed away while Allison once again took in her own changes, and he quickly made one more change to her, making her forget about the X-39. He then left, before she could ask him what the remote was. “I knew I couldn’t trust her.” Now, both siblings were pregnant girls, and the only male left in the family was their father, Edgar. Once he was back in his room again, alone, he examined the changes to his room. There were only a few changes, with the main ones being the male clothes lying on the ground being replaced by their female equivalents, and a bra hanging from his, or rather her, bedpost. There was also a vanity by the bed now, and Jake, now Jane, looked at herself. She looked very similar to Allison did when Sarah changed her, and what she once again looks like, but she could see some slight differences in the face. She sighed as she took in her appearance. Looking back at the remote still in her hand, she realized she could easily change back. She looked back at her reflection again, and was now curious. She could experience being a girl for a while. She could change back whenever she wanted, especially now that Allison no longer remembered the X-39. However, she wasn’t so sure about remaining pregnant. If her water broke, and she couldn’t change herself back before giving birth, but then changed back afterwards, what would happen to the baby? Would it just cease to exist, or would it’s mother be changed to someone else and he would become the father? In any case, parenthood didn’t seem all that appealing to him, but still. There was a curiosity about parenthood, either as a mother or a father, just as there was a curiosity about being a girl. In the end, she...</span></div></div>",
            "created":1604493840,
            "id":2934350,
            "title":"Jake grabs the remote, punishing Allison before..."
        },
        "12211221111212111111113131124212":{
            "author_id":"mac001",
            "author_name":"Mac",
            "choices":[
                "She uses the X-39 and watches what happens",
                "She does not use the device and hopes she could lie and say she did"
            ],
            "content":"<div class=\"\"><div> <span>\"Our grandparents\", Jake told his sister. \"They have been on our and our parent's asses way too much since they have arrived.\"<br>\r\n<br>\r\nAllison thought back, her grandparents were quite prudish, the old her had always liked that, then the her of earlier that day had hated it, and the her of now, well she liked it, but not as much as she had. \"I imagine this is giving them the same habit all us Millers have, correct?\"<br>\r\n<br>\r\n\"You will have to find out.\" Jake said, a grin forming on his face. He then took a drag of his cigarette, drawing attention to it, and formed an even bigger smile.<br>\r\n<br>\r\nAllison looked down at her cigarette and took a drag. She crushed her completed cigarette in the ashtray her brother had provided and looked him in the eyes, trying to get a read on him. \"If I do this, I will be able to work with you and watch you do the magic?\" She asked.<br>\r\n<br>\r\n\"Well, I haven't one hundred percent decided, but you will have the inside track, I promise.\" He said, then took a drag of his cigarette.<br>\r\n<br>\r\nAllison weighed her options and had one last question. \"Will I regret what I am about to do?\"<br>\r\n<br>\r\n\"You'll have to find out.\" He answered back.<br>\r\n<br>\r\nAllison angrily sighed and took the device out of his hand, \"fine\", she said, anger in her voice, and grabbed the device then left the room.<br>\r\n<br>\r\nAs soon as she left the room she could hear the arguing that had not stopped while she was in her brother's room.<br>\r\n<br>\r\n\"We did not raise you to kill yourself and your whole family with those stupid cigarettes\", Jacob screamed. <br>\r\n<br>\r\nAllison gathered up her nerve and slowly walked to a place where she had a vantage point of her grandparents. She pointed the X-39 at them and </span></div></div>",
            "created":1604114340,
            "id":2932005,
            "title":"\"Our Grandparents.  It's time to end th..."
        },
        "12213":{
            "author_id":"varianm",
            "author_name":"varian",
            "choices":[
                "Jake hands over the device, letting Sarah give him a matching additiction",
                "Jake declines and then looks for a different setting to test out on Sarah"
            ],
            "content":"<div class=\"\"><div> <span>\"I have a confession to make,\" Jake said as he removed the X-39 from his pocket. \"I used this on you earlier today and it turned you into a smoker.\"<br>\r\n<br>\r\nSarah frowned at Jake and then looked at the cigarette burning between her fingers. \"Is that why I suddenly decided to start smoking? I've always hated the smell, but now I like it.\" She brought the cigarette to her lips and took a deep drag.<br>\r\n<br>\r\n\"You aren't mad?\"<br>\r\n<br>\r\nShe exhaled directly into his face, making him cough. \"I should be. I should take that thing away from you and use it to turn you into a smoker, too. But I don't like being mean to people.\"<br>\r\n<br>\r\n\"I'm sorry. I won't use it on you without your permission again.\" <br>\r\n<br>\r\n\"You better not. So, what else can it do besides turn people into smokers.\"<br>\r\n<br>\r\n\"Lots of things. If you're okay with it, I'd like to try and modify your addiction.\" Jake taped on the display, pulling up a sub-menu that would allow him to adjust the intensity of the addiction in the device's memory banks. At the moment it was set at a 10.<br>\r\n<br>\r\n\"If you're sure it's safe, then go ahead.\" <br>\r\n<br>\r\nAs Sarah took another drag, Jake adjusted her addition to a 1. She choked on the smoke.<br>\r\n<br>\r\n\"Eww, that tastes nasty.  I remember why I hate cigarettes again.\"<br>\r\n<br>\r\nBefore she could toss the cigarette away he quickly adjusted her addition up to 20. She took a massive drag, her cheeks hallowing as she sucked on the cigarette for a solid 5 seconds. Once she removed it from her mouth she breathed in deep and held the smoke in her lungs for another five seconds before finally exhaling.  <br>\r\n<br>\r\n\"Looks like you enjoyed that,\" Jake said with a smile on his face. <br>\r\n<br>\r\n\"I fucking love smoking,\" Sarah said with a sign as she extracted another cigarette from her sister's pack. She lit it with the butt of her first cigarette. \"You should try this. You'll love it.\"</span></div></div>",
            "created":1526187600,
            "id":2492713,
            "title":"Jake makes a confession"
        },
        "124":{
            "author_id":"struiner",
            "author_name":"Struiner",
            "choices":[
                "Switch her family's lives around",
                "Give her an entirely new life",
                "Something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of alteration?</span></div></span></div>",
            "created":1506056400,
            "id":2389772,
            "title":"Life alterations"
        },
        "1241":{
            "author_id":"struiner",
            "author_name":"Struiner",
            "choices":[
                "Switch her with Samantha",
                "Switch her with the mother",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>-\"So. What's up with your sister?\" He said, momentarily putting the device away again. \" She seemed more bitchy than usual.\"<br>\r\n<br>\r\n-\"She's just... dealing with some issues.\" She sighed. \"Mom is dating someone, and it's getting pretty serious. She's not taking it well\"<br>\r\n<br>\r\n\"And you? How are you taking it?\" He put a comforting hand on her knee.  Her dad had died about a decade earlier. <br>\r\n<br>\r\n\"I don't know. It changes stuff. Change usually sucks.\" She shrugged, then gave an impish look. \"But she lets me date you, so I don't see why she can't date someone.\"<br>\r\n<br>\r\nHe chuckled hesitantly, wondering what his next change would mean for their relationship's status. <br>\r\n<br>\r\n-\"I'm glad you're here. Mom and Sam were about to get in a row again...\" She trailed off. <br>\r\n<br>\r\nHe pointed the device at her and froze time as he pressed the first button. Downstairs he found a frozen Samantha standing by the door, angrily looking at her phone. <br>\r\n<br>\r\nSamantha was more than a couple years older than her younger sister. Early twenties, nicely curved and all made-up to impress her guy.  He had heard rumours about her, a taste for older men and rather slutty about it too. Wearing a clingy shirt and skin-tight skirt, she did look trampy. He wondered what those brightly colored lips tasted like.<br>\r\n<br>\r\nHe turned towards the livingroom, where her mother was lounging in front of the TV. Wearing joga-pants and a tank-top, she was enjoying a quick smoke-break from doing the laundry. An overflowing basket of dirty clothes next to her.</span></div></div>",
            "created":1506056400,
            "id":2389795,
            "title":"Switch her family's lives around"
        },
        "14":{
            "author_id":"nemryn",
            "author_name":"nemryn",
            "choices":[
                "The beach",
                "The mall",
                "The park",
                "Somewhere else #1",
                "Somewhere else #2"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jake thought about where to test his amazing new find.</span></div></span></div>",
            "created":1289451600,
            "id":992099,
            "title":"Try it somewhere else"
        },
        "141":{
            "author_id":"nemryn",
            "author_name":"nemryn",
            "choices":[
                "The family",
                "The volleyball players",
                "The college kids"
            ],
            "content":"<div class=\"\"><div> <span>Jake decided to try out his new find at the beach. It was a nice day, and there were sure to be a lot of people there to test it on. Plus, if this thing worked, he'd get the chance to see as many girls in bikinis- or out of them- as he wanted. Jake put on his swim trunks and a t-shirt and headed out. <br>\r\n<br>\r\nOnce he got there, Jake stood on the sand and surveyed his potential targets. There were indeed quite a few people, but three groups in particular stood out. There was a family at the water's edge; a young boy and girl were working on a sandcastle, while the mother napped and the father played Frisbee with a teenage son and daughter and their dog. Then, there was a group of about a dozen guys playing volleyball. In classic 'shirts vs skins' tradition, one team was wearing t-shirts over their trunks, while the other team sported bare chests. Finally, there was a group of college students lounging around in beach chairs and on blankets. Most of the guys were either making out with girlfriends or trying to attract new ones, while the rest of the girls were mostly reading or sunbathing.<br>\r\n<br>\r\nWho would his first victims be?</span></div></div>",
            "created":1295240400,
            "id":1037393,
            "title":"A day at the beach"
        },
        "1411":{
            "author_id":"nemryn",
            "author_name":"nemryn",
            "choices":[
                "The kids",
                "The teenagers",
                "The parents"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Jake wandered closer to the family and made his decision on who to alter first.</span></div></span></div>",
            "created":1295326800,
            "id":1037798,
            "title":"The family"
        },
        "14113":{
            "author_id":"nemryn",
            "author_name":"nemryn",
            "choices":[
                "The mother",
                "The father"
            ],
            "content":"<div class=\"\"><div> <span>Jake decided that he would mess with the parents first. The father was throwing a frisbee around with his older children and the family's dog, a large German Shepherd. He looked like he was in his early 40s; he was moderately in shape, with the beginnings of a small gut poking out over his dark blue swim trunks, and his brown hair was just starting to thin out. The mother was stretched out in a beach chair, napping. She looked a few years younger than the father; she wore a red one-piece suit and had longish blond hair under a straw hat.</span></div></div>",
            "created":1295326800,
            "id":1037972,
            "title":"The parents"
        },
        "141131":{
            "author_id":"nemryn",
            "author_name":"nemryn",
            "choices":[
                "This way",
                "Another way"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How does Jake alter the mother's attributes?</span></div></span></div>",
            "created":1295326800,
            "id":1037973,
            "title":"The mother"
        },
        "1411311":{
            "author_id":"nemryn",
            "author_name":"nemryn",
            "choices":[
                "Continue",
                "More changes"
            ],
            "content":"<div class=\"\"><div> <span>Jake decided that he'd start out small, by switching the lives of the mother and the father. Accordingly, he set the device to Swap and Life, and fired it at the father, then the mother. However, he didn't notice that when he was selecting the father, the dog jumped in front of him at the last moment. Thus, when time started up again, Jake was surprised to find that the former mother of four had now become their pet instead, and vice versa. Their personalities hadn't changed, though, so at first the woman remained asleep while the dog continued to play Frisbee with her husband and kids. Soon, though, the father announced that he was done with the game. As they returned to their seats, the son suggested to his father, 'Hey dad, I think I'm gonna go wake Susan up and take her for a walk. The vet did say she needed some exercise.' After he left, the father turned to his new canine wife. 'Aah, there they go, dear. The kids sure do love Susan, don't they? I'm glad we rescued her from the pound. And I'm glad I married you all those years ago, Daisy.' He leaned in and kissed her on her on her snout, then began chuckling as she started to vigorously lick his face. 'Whoa, slow down there honey, let's save that for tonight, okay?' he protested, and was met with a series of happy barks.</span></div></div>",
            "created":1295499600,
            "id":1038603,
            "title":"My mother the dog"
        },
        "14113111":{
            "choices":[
                "Visit with another dog owner",
                "continue"
            ],
            "content":"<div class=\"\"><div> <span>Jake watched as the teenager walked away with his mother on a leash. He couldn’t change them back until the pair returned, so Jake decided to stay close to the rest of the family and keep an eye on them. Perhaps he would use his device to make other changes in the meantime. <br>\r\n<br>\r\nTommy pulled on Susan’s leash, trying to slow her down. “Easy girl… heel”, but Susan continued to drag Tommy down the beach, her red collar, which matched her bathing suit, pulling tight around her neck, causing her to wheeze and gasp for air as her tongue hung from her open mouth.<br>\r\n<br>\r\nEventually Susan slowed her pace, as they walked along the waterline. Tommy noticed several other people out walking their dogs. Susan reacted to each of them as they came into view, sometimes growling, yipping with excitement at others.<br>\r\n</span></div></div>",
            "created":1323838800,
            "id":1239570,
            "title":"Continue"
        },
        "141131112":{
            "choices":[
                "He agrees ",
                "He turns you down"
            ],
            "content":"<div class=\"\"><div> <span>Tommy had led Susan into the water, where Susan had leapt in, paddling around with her head raised, keeping her nose high in the air. They swam around for a bit, before leaving the waves. Once Susan got back on the sand, she started to shake in an attempt to dry herself off, her long blond hair, lying soaked and matted about her face.<br>\r\n <br>\r\n“Okay, girl… you ready to go back to see Mommy and Daddy?” Tommy asked. Susan leapt up from the sand in excitement, barking and yipping, as Tommy held the leash and they began to walk back toward the family.<br>\r\nThey were walking along the waterline back toward the family when Tommy noticed Susan’s ear perk up, she began to get excited and stopped, turning to pull him in another direction. Tommy turned to see a large man jogging toward him, as he attempted to get his attention.<br>\r\n<br>\r\n“Hey Kid… Sorry to bother you. I wanted to ask you something” the large man slowed his gait, as he approached.<br>\r\n<br>\r\nSusan sniffed around the man, as he held out his hands for her to catch his scent, showing her that he wasn’t a threat. He then extended his hand to Tommy “I’m Bill, by the way”<br>\r\n<br>\r\n“Hi, Bill, I’m Tom, and this is my dog, Susan” Tommy advised, brushing the hair from Susan’s face, then placing his hand on her back, then patting her rear, as she continued to sniff Bill.<br>\r\n<br>\r\n“Yeah, she’s a beauty. Is she pure bred” Bill asked.<br>\r\n<br>\r\n“I think so, but my father would know for sure. I know she’s a rescue, but I think she had papers. Her owner died and his family couldn’t take care of her, so they had no choice but to put her up for adoption. Luckily, we got to her before anything happened. She’s a really good dog.” Tommy relayed.<br>\r\n<br>\r\n“Well, I’m happy she found a good home. Do you know if she was fixed, is there any way we could find out, and if she has papers. I’m looking to breed Shepards’ and want to have mine studded out. He’s got champion bloodlines.” Bill explained, “I saw you walking yours and just had to find out. She’s got great muscle tone and a beautiful coat”, as he rubbed Susan behind her ears, and belly. Susan immediately turned submissive, rolling onto her back and spreading her legs.<br>\r\n<br>\r\n“There’s a good girl… What’s her name, again?” Bill asked.<br>\r\n<br>\r\n“Susan” Tommy stated.<br>\r\n<br>\r\nBill got down into the sand and started rubbing Susan vigorously from her face, down her torso to her crotch. Susan pawed at Bill, as she barked her approval in a playful manner. This went on for several moments, until Bill got back on his feet. Susan turned back over, getting onto all fours. “My family is back this way, if you want to talk to my father” Tommy motioned.<br>\r\n<br>\r\n</span></div></div>",
            "created":1323838800,
            "id":1239573,
            "title":"continue"
        },
        "1411311121":{
            "choices":[
                "Arrengements are made",
                "something else"
            ],
            "content":"<div class=\"\"><div> <span>“Sure, let’s go find out.” Bill said, as they walked back down the beach.<br>\r\n<br>\r\nAs, they came upon the rest of Tommy’s family, Tommy let go of the leash and Susan took off, bounding her way to greet his brother and sisters who were playing in the sand. Tommy introduced Bill to his father, who introduced himself. Daisy barked at Bill, as he took her paw to shake it. After some small talk, the men walked over to the side where Bill proceeded to discuss matter with Tommy’s father. Daisy jumped onto the lounge chair, as she turned her attention to the children playing. A few minutes later, Tommy’s father walked back over to his family, sitting down in another chair and holding a business card.<br>\r\n<br>\r\nDaisy jumped down from the lounge chair, walking over to her husband and sitting beside him in the sand. Tommy walked over to his parents, as Susan continued to play with the children in the sand. “Everything okay, Dad?” Tommy asked<br>\r\n<br>\r\n“Yeah, fine… I never really thought about breeding Susan, but Bill seems to think she’d be a good bitch. I don’t know, Honey… what do you think?” he said, looking down at Daisy.<br>\r\n<br>\r\nDaisy barked several times, as she looked up at her husband, then over to Tommy and barked a few more times. They both looked at her as she did, then she placed her paw on her husband’s leg. “You’re right, Sweety. You’re always right” he replied, bending down, as Daisy licked his face.<br>\r\n<br>\r\n“So what happens now?” Tommy asked.<br>\r\n</span></div></div>",
            "created":1323838800,
            "id":1239574,
            "title":"He agrees "
        },
        "14113111211":{
            "choices":[
                "continue",
                "Jake turns his attention to other people"
            ],
            "content":"<div class=\"\"><div> <span>“Well, since you’re mother agrees, I’ll call Bill when we get home and we’ll be having him drop off his dog for the night. Hopefully, if everything goes right, Susan will get along with him and then she’ll have a litter” his father explained. <br>\r\n<br>\r\n“Really, so Susan is going to have puppies?” Tommy asked.<br>\r\n<br>\r\nDaisy looked at Tommy and let out a bark. “If everything goes right she will” his father said. Tommy smiled; as he looked down at Daisy, then back up at his father before turning to look at Susan playing with his siblings; they took turns throwing a ball for her to fetch. His father looks at his watch, seeing that it’s time to go, gives the order to begin packing things up. <br>\r\n<br>\r\nJake overheard this and made his way back toward the parking area. Once there, he took a seat on a bench. He figured he could change the mismatched pair back before they left the beach. <br>\r\n</span></div></div>",
            "created":1323838800,
            "id":1239575,
            "title":"Arrengements are made"
        },
        "141131112111":{
            "choices":[
                "Jake leaves to cause more trouble",
                "Follow the family"
            ],
            "content":"<div class=\"\"><div> <span>Daisy takes off, picking up the kids things up in her mouth, bringing them back one at a time, as her husband places them in the totes. Out of breath, Daisy retrieves the last item, placing it at her husband’s feet. “Thanks, Honey” her husband says, as Daisy rears up on her hind legs. Her husband leans down and begins to kiss her, as she extends her tongue lapping his lips. <br>\r\n<br>\r\n“Aww, come on your guys, do you have to do that here?” Tommy said, as he watched the pair.<br>\r\n<br>\r\nDaisy and his father turned to look at Tommy, as Daisy barked at him. “Yes, Mom” Tommy responded, as he started to fold up the chairs. He took the chairs and stacked them, as he had been directed, then gathered the rest of the totes, bring them all together. Daisy barked several more times. “I did, Mom”, Tommy replied, as he dragged the last bag into place.<br>\r\n<br>\r\n“Alright kids, let’s get going” the father called, as the kids made their way to their parents. “Grab your chair and take a bag. Tommy, you hold onto Susan’s leash, I don’t want her running off.”<br>\r\n<br>\r\n“I got her, Dad” Tommy advised, as he took his chair and tote in one hand, and held on to Susan with the other. She sniffed around the sand for a bit, leading Tommy away from the path the rest of his family had taken. “Come on, girl, it’s time to go home. You’re going to have a good time tonight”, he added.<br>\r\n <br>\r\nThe family loaded their things in the minivan. Tommy had opened the back hatch and had Susan jump in, before going around to the side door. Jake had gone to grab something from the snack bar. By the time he got back, he couldn’t get a clear view of the pair, since the mother was already in the front seat of the car. He quickly took down the license plate number, hoping he could do some research and find an address for them, so he could fix what he had done.<br>\r\n<br>\r\n</span></div></div>",
            "created":1323838800,
            "id":1239576,
            "title":"continue"
        },
        "1411311121112":{
            "choices":[
                "Bill wants to wait for his parents",
                "Agrees to meet him at the garage"
            ],
            "content":"<div class=\"\"><div> <span>Tommy’s family had dispersed around the house. His brother and sisters were in the family room watching television. His father had said that he should hold down the fort, which usually meant that he and his mother would be doing something upstairs. Tommy was having a snack in the kitchen when the doorbell rang. He got up to answer it.<br>\r\n<br>\r\nOpening the door, he saw Bill standing there. “Hi, Tom, remember me?” he asked.<br>\r\n<br>\r\n“Sure do, Bill.” Tommy replied.<br>\r\n<br>\r\n“You’re dad called and said it was okay that I bring Max over for the night. He said that Susan was going into heat, so I didn’t want to wait. Where’s your father?” he asked.<br>\r\n<br>\r\n“He and Mom are upstairs. I think they’re taking a nap or something. Where’s your dog?” Tommy replied.<br>\r\n “I have him in the car. I didn’t want to bring him in, just in case there’s a problem with your dog.” Bill explained.<br>\r\n<br>\r\n“Oh, well, Susan is in the garage. I can grab her leash and you can bring Max in through there, to see if they like each other.” Tommy advised.<br>\r\n<br>\r\n“Are you sure it’s okay, I mean, I wouldn’t want to do anything without your parents around?” Bill said.<br>\r\n<br>\r\n“No, Dad said you’d be coming by, and I can handle Susan. If you want, you get your dog, and I’ll meet you down by the garage, okay?” Tommy directed.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1323838800,
            "id":1239578,
            "title":"Follow the family"
        },
        "14113111211122":{
            "choices":[
                "The pair begin to fight",
                "The pair get along "
            ],
            "content":"<div class=\"\"><div> <span>“Sure. Let me get him, and I’ll see you there.” Bill said, as he exited the front door.<br>\r\n<br>\r\nTommy made his way down to the garage. He turned on the lights and opened the door. Susan was naked on her bed, in the corner of the room; several chew toys, a rawhide and a bowl of water and kibble were nearby. Tommy secured her collar around her neck, and then attached her leash.<br>\r\n<br>\r\n“Come on, girl. It’s time to get up. You have a new friend coming to visit.” Tommy said.<br>\r\n<br>\r\nSusan looked up from her bed and let out a bark, getting up from the small mattress and following Tommy. They walked over to the garage door, where Tommy pressed the button to start the electric door opener. Slowly, it clanged, making its way up. Standing there was Bill, with a thick leather leash in hand. Seated beside him was a large black and tan German Shepard. <br>\r\n<br>\r\nTommy held firm to Susan’s leash, as she made her way toward Max. Bill held Max back, as he got to all fours. Susan began to bark, as she was excited by the site of the other dog. Bill gave Max a little leash, so he could approach Susan. <br>\r\n</span></div></div>",
            "created":1323838800,
            "id":1239579,
            "title":"Agrees to meet him at the garage"
        },
        "141131112111222":{
            "choices":[
                "Inside Mom and Dad's Room",
                "The Next Morning"
            ],
            "content":"<div class=\"\"><div> <span>The pair circled each other, entangling the leashes. Susan stuck her nose into Max’s rear, as Max returned the gesture. Bill and Tommy began to untangle the leashes when Max got around Susan’s backside and jumped onto her back, as he attempted to mount her. Susan moved forward, thwarting Max’s attempt.<br>\r\n<br>\r\n“Well, I guess she’s in heat. Let’s let them off the leash and see how they act?” Bill said, as he bent down to release Max. Tommy followed suit and let Susan off her leash. Susan headed back into the Garage, as Max quickly followed, sniffing her backside, as they did. <br>\r\n<br>\r\nThe pair disappeared into the garage. Tommy entered and stood by the door button, as Bill followed. Tommy hit the button effectively locking the dogs inside. Tommy and Bill observed the pair frolicking for a bit, when they saw Susan head over to her bowl. She was lapping water when Max made a second attempt to mount her. This time she didn’t move and he was able to enter her. Susan was drinking from her bowl, as Max’s penis extended from its sheath. He pushed himself into Susan where his knot engorged, holding him firmly inside her until he had completed the task. Susan whimpered, as Max continued to thrust himself behind her.<br>\r\n<br>\r\n“I think they’ll get along fine” Bill said.<br>\r\n<br>\r\n“You think so?” Tommy asked.<br>\r\n<br>\r\n“Well, Susan seems to be accepting Max, so I figure they’ll be fine for the night. They’ll be at this until morning. Just keep an ear open, in case you hear them fighting, but that shouldn't happen,” Bill said, as he made his way over to the door. “Let’s leave them to their business.”<br>\r\n<br>\r\nTommy smiled, as he looked at the pair, as he closed the door. He was happy that Susan was with his family, rather than being in the pound or worse. If everything went well, he knew that Susan would be a mother.<br>\r\n<br>\r\nTommy showed Bill out, as his parents were still upstairs. Bill told him that he’d be back in the morning to check on things. Tommy acknowledged this, said goodbye and closed the door. He cleaned up the kitchen, and then headed up to his room.<br>\r\n <br>\r\nAs he passed his parent’s bedroom door, Tommy heard the sounds of moaning, howling and whining coming from inside. He smiled, knowing they weren’t the only ones going at it in the house. Tommy continued on to his room, wondering what the morning would bring.<br>\r\n<br>\r\n</span></div></div>",
            "created":1323838800,
            "id":1239580,
            "title":"The pair get along "
        },
        "143":{
            "author_id":"nemryn",
            "author_name":"nemryn",
            "choices":[
                "Wait for the wedding",
                "Mess with the joggers",
                "Go to the playground"
            ],
            "content":"<div class=\"\"><div> <span>Jake decided that he would test the device at the park. When he got there, Jake was amazed at his luck: a sign announced that an open-air wedding ceremony and reception would be held there in just under an hour. Aside from that, the park also featured a jogging track running around the outside, and a medium-sized playground area where some mothers were watching their kids.</span></div></div>",
            "created":1295326800,
            "id":1037801,
            "title":"The park"
        },
        "1431":{
            "author_id":"hawkcam1996",
            "author_name":"Hawkcam",
            "choices":[
                "The bride",
                "The groom",
                "Someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>When the wedding starts, who will Jake use the device on?</span></div></span></div>",
            "created":1479272400,
            "id":2237822,
            "title":"Wait for the wedding"
        },
        "15":{
            "author_id":"nemryn",
            "author_name":"nemryn",
            "choices":[
                "Keep reading",
                "Mess with some of the advanced settings",
                "Go ahead and use it"
            ],
            "content":"<div class=\"\"><div> <span>Jake opened the manual and began reading.<br>\r\n<br>\r\n'***WARNING: Use on non-human targets is not recommended! Attributes may not correspond <br>\r\ncorrectly, possibly leading to crashes and/or corruption of data.***<br>\r\n*NOTE: Upon initial activation, this until will bond itself to the user's unique neural <br>\r\npatterns. Most other people will not even realize you have it, and those that do realize <br>\r\nwill not be able to take it from you or use it in any fashion.*<br>\r\n<br>\r\nTo operate: First, use the touchpad to select the attribute you wish to alter. Four default <br>\r\noptions are provided; additionally, you may select the attribute from a list, or enter it <br>\r\nmanually. Next, aim the Attribute Alterator at the target and press the button corresponding <br>\r\nto the desired alteration. If Gender was chosen, the change will happen immediately. If Swap <br>\r\nor Copy/Paste were chosen, time will freeze until you choose a second target. (As a <br>\r\nfailsafe, time will unfreeze and the first target will be unselected if no second target is <br>\r\nchosen within five minutes of subjective time.)<br>\r\n<br>\r\nAlterations<br>\r\n<br>\r\nGender- Changes the gender associated with the selected attribute from female to male, or <br>\r\nfrom male to female. (For information on this function's interaction with transgendered, <br>\r\nneuter, or intersexed targets, please see Appendix G-6.)<br>\r\nSwap- Exchanges the selected attribute between the two targets.<br>\r\nCopy/Paste- Like Swap, but only one-way. Changes the second target's attribute to match the <br>\r\ncorresponding one of the first target. As a new feature in the X-39 model, the overwritten <br>\r\nattribute is stored in the Attribute Alterator for easy retrieval, as well as to enable <br>\r\n'chains' of copied attributes. The attribute belonging to the first target is not stored; if <br>\r\nyou wish to make a second copy, you must retarget the attribute's source.<br>\r\n<br>\r\nAttributes<br>\r\n<br>\r\nBody- The physical form of the target.<br>\r\nClothes- The attire of the target. The alteration also applies to apparel belonging to the <br>\r\ntarget but not currently worn. By default, accessories like jewelery and make up are <br>\r\nincluded; to change this setting, see Appendix B-12. <br>\r\nMind- The mentality of the target. This includes things like personality, knowledge, <br>\r\nbehavior, etc. If the user is a target, the alteration will take the form of a noninvasive <br>\r\nmental overlay.<br>\r\nLife- The target's role in life. If Swap was chosen, each target will live the life of the <br>\r\nother, and be treated appropriately by others. The targets' first names will not change, but <br>\r\ntheir last names will. If Gender was chosen, others will treat the target appropriately for <br>\r\ntheir new gender, and the target's first name will change. If the user is a target, a <br>\r\nnoninvasive mental overlay will be provided to allow the user to act appropriately for their <br>\r\nnew role. Note that only others' treatment of the target will be affected; no physical or <br>\r\nmental alterations to the target will be made. (See Appendix D-9 for more information.)<br>\r\nOther- Specific parts of attributes may also be altered, as well as any number of attributes <br>\r\nnot listed above. This includes things like age, relation to another person, job, etc. To <br>\r\nselect one of these, choose the 'Other' option on the touchscreen. Then, you may select the <br>\r\nattribute from a categorized list, or you may enter the desired attribute using the <br>\r\ntouchscreen keyboard, or you may designate an attribute verbally.'<br>\r\n<br>\r\nThere was more- a lot more- but Jake was getting eager to use the Alterator.</span></div></div>",
            "created":1289451600,
            "id":992103,
            "title":"Read the instructions first"
        },
        "153":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Swapped Dave with Allison",
                "Swapped Dave with Martha"
            ],
            "content":"<div class=\"\"><div> <span>As Jake walked out of his room he immediately bumped into his sister Samantha's boyfriend Dave. Jake and Dave never really got along. Dave was a jock, and a dumb jock at that. God gave him stunning looks with zero brain. He was seeming always trying to sneak into Samantha's room for a little teenage fun. His parents, mainly their mother would scold him every time and tell him to respect her wishes, but he never did. Looks like last night, he even spent the night.<br>\r\n<br>\r\n\"Dave what the hell are you doing here!\" Jake asked with an annoyance in his tone.<br>\r\n<br>\r\n\"Shhhhhh dude. You gotta get me out here before your mom catches me. Let me hide out in your room.\" Dave said trying to barge in.<br>\r\n<br>\r\n\"No way idiot. You are supposed to sneak out when people are asleep, or when the house is empty. Not when everyone is getting ready for the day.\" Jake said not caring if people heard their conversation. <br>\r\n<br>\r\n\"Look it you shit. Keep your voice down or I'll make certain everyone on the team has a chance to kick your ass.\" Dave said ready to pound his girlfriend's younger brother. <br>\r\n<br>\r\nJake looked at him and did a brief inspection. He really was in great shape. His hairy toned pecks showed as he flexed his fist with his strong arms. He barely had his jeans buttoned and his boxers hung out. With his undershirt half on and his sneakers in his left hand, he pinned Jake to the wall. \"Last chance Jake.\" <br>\r\n<br>\r\nIn a panick Jake activated the X-39AA and.....</span></div></div>",
            "created":1523854800,
            "id":2480495,
            "title":"Go ahead and use it"
        },
        "1532":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Lives",
                "Bodies",
                "Clothes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>But Jake had little time to plan. What ended up swapping?</span></div></span></div>",
            "created":1523854800,
            "id":2480498,
            "title":"Swapped Dave with Martha"
        },
        "15321":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "It's Samantha's",
                "It's Martha's"
            ],
            "content":"<div class=\"\"><div> <span>After the powerful bright flash Dave looked stunned. \"Jake sweetie, why was I pushing you?\" Dave said helping Jake to his feet. \"My oh my, my heart is fluttering. I don't know why I'm almost sweating. I'm sorry sweetie.\" Dave moved inform hug. <br>\r\n<br>\r\nJake recoiled and said, \"woah what are you doing Dave.\" <br>\r\n<br>\r\n\"Dave? Sweetie it's me Martha your mom. If you are too old for hugs that's fine, but don't mistake me for that hellain David.\" He said straightening his undershirt and buttoning up his jeans. \"Now finish getting ready, or we will be late.\" <br>\r\n<br>\r\nAnd with that, Dave but now Martha confidently walked down the hallway, sneakers in hand. Jake lost some of him after he entered his parents bedroom. \"Woah did that really just work.\" Just then he heard a whisper. <br>\r\n<br>\r\n\"Yo dude!\" He heard it from the other side of Samantha's room. \"Yo, you helping me or what.\" <br>\r\n<br>\r\nJake looked at his mom, now David and started to laugh. That's when Martha now David lept on him to shut him up. \"It's odd. My mother is trying to beat me up in her own night gown.\" Jake though, which made him smile more. The silky fabric of her gown rubbed on Jake's arms. He had enough and said \"ok ok\" when his Dave's breasts started coming out of the gown. <br>\r\n<br>\r\nDaved stood up. His gown with all loose and half falling off. His matching pink Soma panties could be seem through the thin fabric. \"So, you little shit. Help me.\" <br>\r\n<br>\r\n\"Did my mother just call me a little shit?\" Jake wondered. \"Just then another hallway door opened...</span></div></div>",
            "created":1523854800,
            "id":2480510,
            "title":"Lives"
        },
        "153211":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Change Samantha",
                "Tell your mom"
            ],
            "content":"<div class=\"\"><div> <span>\"Babe, what hell are you still doing here!\" Samantha said seeing Dave still hadn't successfully snuck out yet.<br>\r\n<br>\r\n\"Samantha, your mom is up and walking around. He is going to kill me.\" Dave said putting his right breast back in his nightie. \"And you bullshit brother is gonna rat on us.\" You watched your mother's body make a fist at you. \"I was about to smack him.\" <br>\r\n<br>\r\nSamantha stepped out in the hallway, still in her satin sleep shorts and tank top. She came behind Dave and held is waist. Then with her left hand she brushed back Dave's long hair the kissed him lovingly on the lips. \"Then you'll just have to wait in my room.\" Samantha said as she grabbed Dave's silky Milf ass with her right hand. <br>\r\n<br>\r\n\"Oh this is sick. My mom and sister are making out.\" Jake mumbled half in shock. <br>\r\n<br>\r\n\"Jake you are such a little bitch. Go in my room babe, I'll be right in.\" Samantha said letting her boyfriend in. \"...And you better not say a word!\"<br>\r\n<br>\r\n....</span></div></div>",
            "created":1523854800,
            "id":2480524,
            "title":"It's Samantha's"
        },
        "1532111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Clothes Swap",
                "Head swap"
            ],
            "content":"<div class=\"\"><div> <span>\"Say a word about what Samantha?\" Edgar, Jake and Sam's father questioned as he exited the family bathroom. He was the most dressed of any family member. He wore a full gray suit with a slick red tie. His light brown dress shoes were polished clean and even wore a new watch. It was engraved with, \"To my darling Ed, love your wife David\". <br>\r\n<br>\r\n\"Oh wow, must be Dave and Dad are married now. This is so funny!\" Jake thought to himself. He giggled a little which quickly drew the attention on him.<br>\r\n<br>\r\n\"You two had better get dressed. You'll make your mother mad if you are late.\" Edgar said as he walked away from his kids.<br>\r\n<br>\r\nSamantha snarled at Jake, but before she could close her door he activated the device again.....</span></div></div>",
            "created":1524114000,
            "id":2481805,
            "title":"Change Samantha"
        },
        "15321111":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Follow him",
                "Samantha's POV"
            ],
            "content":"<div class=\"\"><div> <span>Jake now watched his father walk down the hall in bright purple satin sleeping shorts. The hung tight to his male behind with it's white lace trim getting caught in his leg hair. As he turned back to Jake he said, \"I mean it Jake, don't make mom upset.\" <br>\r\n<br>\r\nJake had to hide his smile best he could. The white tank top Samantha was just wearing read \"Real Bitch.\" Now on his father, the term lost all meaning....</span></div></div>",
            "created":1524114000,
            "id":2481807,
            "title":"Clothes Swap"
        },
        "153211112":{
            "author_id":"zooot",
            "author_name":"Hanko",
            "choices":[
                "Ignore it",
                "See who's there"
            ],
            "content":"<div class=\"\"><div> <span>Now back in her room, Samantha locked the door with a sight of relief. \"Man my family is a drag.\" She said taking off her father sport coat, and loosing her tie. As she walked over to Dave, she started undressing. <br>\r\n<br>\r\nDave, formally Samantha's mother layed in bed in a seductively manner. His light pink nightgown only half covered both breasts. He had even slid it up slightly to flash his panties. <br>\r\n<br>\r\n\"Are all the other football players this horny\" Samantha said with a tease. Her fresh pressed shirt was off and her breasts hung free. She jumped back in bed and started making out with her mom's former body. <br>\r\n<br>\r\nDave un-zipped her father's suit pants and stuck his manicured hand in her breifs. \"Now you are really going to be late.\" Dave said as she began to stratle him.<br>\r\n<br>\r\nJust then there was a loud knock on the door....</span></div></div>",
            "created":1524114000,
            "id":2481808,
            "title":"Samantha's POV"
        }
    },
    "info":{
        "author_id":"nemryn",
        "author_name":"nemryn",
        "brief_description":"A bored kid finds a strange device",
        "created":1289532840,
        "description":"<td align=\"left\" class=\"norm\">Yes, it's yet another interactive with a reality-altering swapping device!<br>\r\n<br>\r\nCharacters<br>\r\nJake Miller- Our protagonist. A little bit nerdy.<br>\r\nAllison Miller- Jake's younger sister. Bratty.<br>\r\nZach Miller- Jake's older brother. On the football team, but not really a jock.<br>\r\nMartha Miller- Jake's mother. Secretary for a law firm.<br>\r\nEdgar Miller- Jake's father. Freelance architect.<br>\r\nLisa Wu- Allison's friend.<br>\r\nEmily Parker- Zach's girlfriend. Artist.<br>\r\nSarah Stevens- Jake's girlfriend.<br>\r\nMark Stevens- Sarah's younger brother.<br>\r\nSamantha Stevens- Sarah's older sister.<br>\r\nDave Benson- Samantha's boyfriend.</td>",
        "id":1723963,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604494560,
        "modified":1604494560,
        "pretty_title":"X-39 Attribute Alterator"
    }
}