{
    "chapters":{
        "1":{
            "author_id":"kaiblastx3",
            "author_name":"mason",
            "choices":[
                "Dragon magicains",
                "Performapals"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Dragon magicains or performapal </span></div></span></div>",
            "created":1558242000,
            "id":2661420,
            "title":"Deck "
        },
        "11":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Official, Dimesional Dragon themed",
                "Official, Vector Pendulum themed",
                "ADD: Cybveress",
                "Fan Made"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>So are we talking an original archetype, full of custom and broken cards, or the official ones, like Dragonpluse Magician, Double Iris Magician and Vector Pendulum, the Dracoverlord?</span></div></span></div>",
            "created":1577702820,
            "id":2766901,
            "title":"Dragon Magicians"
        },
        "114":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Firewall Archtype ",
                "Trickstars",
                "OTHERS"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hey, can we get some Link monsters up in here? Please? That seems like chaos waiting to happen!</span></div></span></div>",
            "created":1600178760,
            "id":2903425,
            "title":"Linku Shokkan!"
        },
        "12":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "\"LADIES AND GENTLEMEN!\"",
                "\"Speedroids, launch!\"",
                "\"My Phantom Knights burn for VICTORY!\"",
                "\"My Predaplants....they'll eat you up!\"",
                "(It's your choice.)"
            ],
            "content":"<div class=\"\"><div> <span>Hold up. It may not seem like you had much of a choice back there, so. Do you really wanna go with Performapals.....or would you rather try something else? Such as a different Yu-boy? Or something of your own choice? Decisions, decisions...<br>\r\n<br>\r\n(Anything else goes in the fifth one.)<br>\r\n<br>\r\n</span></div></div>",
            "created":1560056400,
            "id":2670731,
            "title":"A choice?!"
        },
        "122":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "-a rundown back alleyway. (Satellite)",
                "-the parking lot out front of a motorcycle shop. (New Domino City)",
                "-....WAIT, WHERE THE FUCK!? (Spirit World)"
            ],
            "content":"<div class=\"\"><div> <span>You wake with a painful start. Your head hurts like hell, and your body is stiff, sore, and not balanced right. What happened.....? You try to recall through the pain in your head. After a bit......ah.<br>\r\n<br>\r\nNo wonder your head hurts. 90 miles per hour on a bike into a concrete barrier headfirst after crashing your bike on a bad turn...that's the last thing you can recall.<br>\r\n<br>\r\nWait.<br>\r\n<br>\r\nWait for a goddam second.....that should have killed you. Even with a helmet.<br>\r\n<br>\r\nSo why the fuck are you...alive.......where are you, anyway? You look around and realize that this isn't the Suzuka Circuit. No, this is-</span></div></div>",
            "created":1600684380,
            "id":2907183,
            "title":"HASHIN!"
        },
        "125":{
            "author_id":"kaiblastx3",
            "author_name":"mason",
            "choices":[
                "Drago knights",
                "Cosmic dragon empire",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>More originality </span></div></span></div>",
            "created":1561270380,
            "id":2677388,
            "title":"(It's your choice.)"
        },
        "1251":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "FIRA AMBLAM HAROAS",
                "Original Flavor",
                "no i want something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>*breathes in* FffffFFFFEEEEEEHHHHHHHHHH-*slapped into a dumpster*<br>\r\n<br>\r\now<br>\r\n<br>\r\nAnyway, we could either base the deck off Fire Emblem Characters or original characters. Either way is fine.</span></div></span></div>",
            "created":1593854040,
            "id":2861155,
            "title":"Drago knights = FE?"
        },
        "1253":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Fish-Type Monsters",
                "Gimmick Puppets",
                "(It's your choice.)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here's two more, one is a canon archetype, the other is just fish.</span></div></span></div>",
            "created":1561534080,
            "id":2678677,
            "title":"Orewa Turn!"
        },
        "12533":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "START THE HUNT! ",
                "(It's your choice.)"
            ],
            "content":"<div class=\"\"><div> <span>Last one before I let other have a choice, and it's an original one: The Preadtors. A Dark Synchro focused Archetype, their lore is that the Preadtors are jet-like hunting machines made to hunt down sentient species for an unknown reason. They're based off various G2 Transformers, such as Hawk, Terra Dive, Jetstorm and Electro.</span></div></div>",
            "created":1567236660,
            "id":2710964,
            "title":"Mine"
        },
        "125331":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "....and someone walks in.",
                "....revealing a corridor beyond it. "
            ],
            "content":"<div class=\"\"><div> <span><u><i><b><font class=\"size35\" style=\"\">Anexplosionandsuddenlyeverythingsspiningandblaringandflashing youyanktheejectleverbutitfailstotrigger<br>\r\nyourheadfeelslikeit'sabouttocrackandourbodyfeelslikeit'sbeingcrushed asthegroundcomescloserandcloserandcloserandcloseratstarlingspeeds<br>\r\nandinyourlastmommentsavoiceringsthrougyourheadclearasday</font></b></i></u>&lt; br /&gt;\r\n<br>\r\n<font class=\"size5\" style=\"\"><b><u><span class=\"cmaroon\">YOU'LL DO.</span></u></b></font><br>\r\n                                                                                                    --------------+/<font class=\"size4\" style=\"\">5DS</font>+--------------------<br>\r\nAs you wake with a start, you realize that everything about the current situation feels....off. To start, you're in a white square room, with white furniture, and a padded door off to the left. Your body feels intact for a survivor of a jet crashing nosecone first into the ground at high speeds, and to add to that as you sit up, you feel like your body shape is....off. Your chest feels heavier, your limbs feel longer and down there........feels empty. Before you can investigate why, though, the door opens......</span></div></div>",
            "created":1567242900,
            "id":2710986,
            "title":"START THE HUNT! "
        },
        "1253311":{
            "author_id":"kaiblastx3",
            "author_name":"mason",
            "choices":[
                "Blue Flame Whirlwind dragon",
                "Energy blade turbo dragon",
                "Shadow breaker time dragon "
            ],
            "content":"<div class=\"\"><div> <span>Hello young mortal I'm am the goddess of the crimson dragon names flare anyway you have been chosen to be reborn with this new look as my master chosen for you you may choose a dragon of your choice anything you can think of to be your ace<br>\r\n</span></div></div>",
            "created":1567492740,
            "id":2712656,
            "title":"....and someone walks in."
        },
        "12533111":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "“This dragon is the one I want.”",
                "Flare has ‘answers’ for your ‘questions’."
            ],
            "content":"<div class=\"\"><div> <span>“Hold up. I have questions. First of all......why am I a girl? Why, just why? Secondly, you say you’re a Goddess.....and yet the Crimson Dragon is your master? Shouldn’t it be the other way around? And why is your name Flare, of all names? Why not something else real acting to fire or red that would suit a ‘Goddess of the Crimson Dragon’ more?” You question incredulously. If you hadn’t outright just been in a fighter jet crash, you would have thought this elaborate prank! Anyway, you think up a Signer Dragon for you to use.......<br>\r\n<br>\r\nBlue Flame Whirlwind Dragon<br>\r\n2500 ATK 1540 DEF LVL 6 Fire<br>\r\nDragon/Effect/Synchro<br>\r\n1 Tuner + 1+ non-Tuner monsters<br>\r\nWhen this card is Synchro Summoned: it gains 300 ATK. When this card destroys a monster in battle: deal half the ATK points of that monster to the controller of that monster.<br>\r\n<br>\r\n......oh hey, this seems like GX nostalgia. But aren’t you in the 5Ds era? Doesn’t matter.....if it gets you answers, you’ll take it. Dueling for your life sounds weird but fun.<br>\r\n<span style=\"text-decoration:line-through\">Itcantbeanyworsethenhavingyourwingsclippedbyenemyfireandthennosedivingstr aightintotheground......WhatAHorribleWayToDie.</span></span></div></div>",
            "created":1578322560,
            "id":2770165,
            "title":"Blue Flame Whirlwind Dragon....and questions,"
        },
        "125331111":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "Flare materialises a bunch of Duel Monsters Cards.",
                "You should ask about your old life."
            ],
            "content":"<div class=\"\"><div> <span>“This Dragon is the one that I want.” You say, keeping the thought of it in your head. “This one.....the one I just thought up. It’s-“ you start to say before Flare cuts you off.<br>\r\n<br>\r\n“It’s similar in design to Black Rose Dragon, but instead of petal wings, it has arms like Stardust Dragon has. It moves on all fours, is coated in blue flames, and has large flaming bat wings on it’s back.” She quickly utters before smiling at you. “Bang on, right? And I know you’re going to ask how, so I’ll say it simply. I can read thoughts and envisioned ideas like you can read a book. And....” She cracks a warring smile, and her tone takes on a kind, yet warning vibe. “It’s best not to question how exactly me or my master work. What we can do can’t really be comprehended fully by mortal brains. It’d make you go crazy, and well, you’ll need all your wits about you where you’re going.” Fair, but......<br>\r\n<br>\r\n“Why AM I a girl, though?” You question, honestly confused at why you’re now a female. Wait, where you a female before, though....? If you weren’t then, you definitely are one now. Flare’s expression changes slightly, and her cheeks take on a embarrassed tingle of red.<br>\r\n<br>\r\n“Well....my master was a tiiiiny bit too late in taking you from the crash. He intended to pull you before you hit the ground, but his timing was off and.....well, your old body got badly messed up to the point where if he hadn’t taken your soul and stuck it within a new body, you would have died. And this body was the only one he wasn’t using.”<br>\r\n<br>\r\nSo the reason you’re a girl is that this was the only spare body the Crimson Dragon had.......speaking of your new body, it’s starting to feel less off. You’re getting used to it, and all the changes that come with it. You do wonder about your old body, though....and your old life....</span></div></div>",
            "created":1593974040,
            "id":2861966,
            "title":"“This dragon is the one I want.”"
        },
        "1253311111":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "“...we can send you into the world of 5DS.”",
                "“...there’s one more thing.”"
            ],
            "content":"<div class=\"\"><div> <span>However, before you can ask about your past life to clear your head, Flare places her palm on your forehead. “Mortal...You don’t want to recall your past life.”<br>\r\n<br>\r\n“Why? Did I have a bad life or something?” You inquire. “Was I a subject of mass bullying? Dad or Mom beat me at a young age? Just unlucky?”<br>\r\n<br>\r\nFlare shook her head. “No, you had a good life, for what you lived. It’s just...you can’t go back.”<br>\r\n<br>\r\nAh. Yeah. That. The whole ‘my plane got shot down and the crash landing was fatal’ thing. You do your best to put the thoughts of your past life at the back of your mind....for now, at least. Meanwhile, Flare snaps her fingers, and a Duel Monsters card forms in mid air, which she catches. “Here you go.” she says as she hands it you, revealing it to be Blue Flame Whirlwind Dragon. You take the card from her, and once you do, you feel a great power surge from it. “This card is as much a Signer Dragon as the other six are. That includes it being alive.....or rather, him. Take good care of him!” Flare says, enthused. She goes to snap her fingers again, but suddenly, a powerful, urgent voice sounds out.<br>\r\n<br>\r\nFLARE.<br>\r\n<br>\r\nFlare stops suddenly and looks at furthest wall away from her. “Yes, master?” she speaks just as the the face of the Crimson Dragon appears, projected onto the wall.<br>\r\n<br>\r\nI AM AFRAID THAT THE SITUATION HAS ESCALATED. THE NASCA LINES ARE FAILING FAST AND MORE EARTHBOUND IMMORTALS ARE ESCAPING.<br>\r\nWE MUST TAKE DRASTIC MEASURES. GIVE OUR GUEST ‘THEM’.<br>\r\n<br>\r\n“Them, master? Are you sure?” Flare asks, suddenly worried.<br>\r\n<br>\r\nI AM SURE. HE WAS A FIGHTER PILOT IN HIS PAST LIFE, ALONG WITH A EXCELLENT DUELIST FOR THE TIME HE PLAYED. HE CAN HANDLE THE PREADTORS. <br>\r\n<br>\r\n“I understand.” As Flare says that, the projection of the Crimson Dragon’s face vanishes, and part of the wall slides up to reveal a sharp, jetlike Duel Disk, and a YuGiOh Deck. She motions for you to stand up and go get them. You get up, stumble due to your centre of gravity being off due to your new....missiles, and then carefully make your way over to the Duel Disk and deck. Once you get to them, you equip the Duel Disk, and picks up the deck and sift through the cards. Some of them are familiar, but most of them are new, mainly the monsters, a fair chunk of them jets that transform into super robots. Most notably, some of them have different colours then the browns, purple and white you know. Three are black, two are green, and one- a Stealth Bomber that transforms into a powerful, sleek super robot(it reminds you of Megatron, but he’s a Tank...or a gun....)- is blue with eight arrows surrounding the card art, three of them coloured in red.<br>\r\n<br>\r\n“I’ve never seen most of the cards before.....!” You say, stunned. Flare responds rather seriously. “This deck holds the Preadtors. They were a fleet of powerful, cruel, transforming living super robots that attacked planets for fun. My master fought them in a fierce space fight, and beat them, sealing them away in those Duel Monster Cards as punishment. And the reason we’re giving them to you? Well, we need their power, and my master thinks you can use them. Now....”</span></div></div>",
            "created":1593976560,
            "id":2861984,
            "title":"60 Cards + 15 Extra = 1 Duel Deck"
        },
        "12533111112":{
            "author_id":"kaiblastx3",
            "author_name":"mason",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><div> <span>There is something else you need to know you'll start your predator have been modified to become armor for your dragon by equipping it different armors will have differnt abilitys added on to your dragon<br>\r\n<br>\r\nBut you can only equip one<br>\r\n<br>\r\nShould this happen</span></div></div>",
            "created":1595947200,
            "id":2876956,
            "title":"“...there’s one more thing.”"
        },
        "12533112":{
            "author_id":"kaiblastx3",
            "author_name":"mason",
            "choices":[
                "Yes",
                "No"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lv 8 synchro dragon<br>\r\nEffect <br>\r\nDeals triple the damage when battling a lv 5 or higher monster <br>\r\nCan negate all lv 5 or higher monster effects on the field except this card<br>\r\nAtk 2800<br>\r\nDef 2200</span></div></span></div>",
            "created":1581225120,
            "id":2784672,
            "title":"Energy blade turbo dragon"
        },
        "12533113":{
            "author_id":"gpgclean",
            "author_name":"YugiohPKMN ",
            "choices":[
                "This one!",
                "Too broken...."
            ],
            "content":"<div class=\"\"><div> <span>5000ATK 3000DEF LVL13 Dark<br>\r\nDragon/Effect/Pendulum<br>\r\nLeft Scale 0     Right Scale 14<br>\r\nPendulum Effect: Flip a coin. If heads: skip your opponent’s next turn. If tails: your turn is over.<br>\r\nIf this monster successfully battles and destroys a opposing monster, your opponent takes the original ATK of this card in damage. If this monster is returned to the Extra Deck by being used in a Special Summon, that card gains 2500 ATK.</span></div></div>",
            "created":1577767980,
            "id":2767351,
            "title":"Shadow Breaker Time Dragon"
        }
    },
    "info":{
        "author_id":"kaiblastx3",
        "author_name":"mason",
        "brief_description":"Read description ",
        "created":1558248840,
        "description":"<td align=\"left\" class=\"norm\">Keep it under pg <br>\r\nYour a guy until you died the crimson dragon brings you to the world of yugioh 5ds unfortunately the said dragon did a gender swap on you now looking like akiza with blue hair and green eyes and having xyz and pendulum that aren't supposed to exist yet </td>",
        "id":2191340,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1600684380,
        "modified":1600684380,
        "pretty_title":"Yugioh 5ds + 1"
    }
}