{
    "chapters":{
        "1":{
            "author_id":"arbiter42",
            "author_name":"PsiWarp",
            "choices":[
                "The MADNESS begins!",
                "!, but different.",
                "Same as 2",
                "You pick",
                "Someone else gets to pick"
            ],
            "content":"<div class=\"\"><div> <span>The Stranger of Mankind was writing stuff about himself on writing.com in his timestarship's Library, in his private study on top of it, when Q showed up.<br>\r\nQ:\"Where am I? Who are you?\"<br>\r\nStranger closed his laptop and held it in the crook of his arm:\"I, for most intents and purposes, am the Strangeerr..... I've half-trapped you here, and I'd like to run around the universe with you, if you're up to it, that is...\" Q:\"Sure, I guess. But, where am I?\"<br>\r\nStranger:\"Well, first, you're in my dimension and time-travelling starwarship.\"<br>\r\nQ:\" Did you say...TIME TRAVEL?\"<br>\r\nStranger:\"Yes, and it moves through different dimensions and realities. And universes. Sound good, Q?\"<br>\r\nQ:\"Yeah, Stranger. Sounds good.\"<br>\r\nStranger:\"Great! &lt;Brings hands together&gt; Well, then, we're going to have SO MUCH FUN!\" He then snaps his fingers, and his casual T-shirt and jeans became his trademark golden power armor. He continues: \" Now, this is going to be a grand old time, yeah?\"<br>\r\nQ:\"Alright, Stranger, sounds good. By the way, what you did with your clothes, are you-\"<br>\r\n\"Like you? A little bit, but not by much. Yes, I'm a telepath. I'm also an omnikinetic. Try to figure THAT ONE out! Ha ha ha ha ha, I crack myself up! Now, Q, let's have some FUN!\"</span></div></div>",
            "created":1340512320,
            "id":1365959,
            "title":"Begin the INSANITY!"
        }
    },
    "info":{
        "author_id":"arbiter42",
        "author_name":"PsiWarp",
        "brief_description":"It's where my time and space travelling Stranger meets and hangs with 90s Star Trek's Q.",
        "created":1340502420,
        "description":"<td align=\"left\" class=\"norm\">In this, my character who only goes by the name of the Stranger, meets Star Trek TNG/DS9/Voyager, and they then travel through most of space and time, laughing the whole way, without end! It's going to be SO MUCH FUN!</td>",
        "id":1875531,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1340512320,
        "modified":1340512320,
        "pretty_title":"Stranger Q"
    }
}