{
    "chapters":{
        "1":{
            "author_id":"dannyboy135",
            "author_name":"Danielday Patron",
            "choices":[
                "Does the laser hits Sonic",
                "Or misses it and hit someone else"
            ],
            "content":"<div class=\"\"><div> <span>Dr. Eggman: I've had it Sonic the Hedgehog has humiliate me for the last time! <br>\r\n<br>\r\nCubot: What are you going to do about it, doctor?<br>\r\n<br>\r\nDr. Eggman: I need to figure out a way to keep Sonic from fighting. If I can do that then I'll be able to win once in awhile. <br>\r\n<br>\r\nOrbot: But why just Sonic why not with his friends too?<br>\r\n<br>\r\nDr. Eggman: Because Sonic is the real threat the others I can take them down easily. The real problem is how are we going to pull that off?<br>\r\n<br>\r\nOrbot: Well I don't know about you but we are out of groceries again can you go to the market and get some more please?<br>\r\n<br>\r\nDr. Eggman snatches the list and growls. Later at the market Dr. Eggman was checking over the shopping list.<br>\r\n<br>\r\nDr. Eggman: let's see eggs, butter, milk, all we need now is some makani Nia nuts. <br>\r\n<br>\r\nAs Dr. Eggman was grabbing a package of nuts. When a baby's cry begins to get on his nerves.<br>\r\n<br>\r\nDr. Eggman: (annoyed growl) Can someone quiet down that baby!<br>\r\n<br>\r\nMother: Sorry, sir. He just tried that's all.<br>\r\n<br>\r\nDr. Eggmen getting an idea.<br>\r\n<br>\r\nDr. Eggman: Wait a minute. That gives me an idea.<br>\r\n<br>\r\nLittle later back at dr. Eggman's headquarters.<br>\r\n<br>\r\nDr. Eggman: (To his robots) Riddle me this: what is the most useless and creature on the planet?<br>\r\n<br>\r\nOrbot: Uhh, Amm, is it a Beebot?<br>\r\n<br>\r\nDr. Eggman: No!<br>\r\n<br>\r\nCubot: Is it Big Bot?<br>\r\n<br>\r\nDr. Eggman: No!<br>\r\n<br>\r\nOrbot: We give up. We're out of guessing ideas.<br>\r\n<br>\r\nDr. Eggman: On the whole planet there is only one useless creature that I know of and also the most annoying of course. (Turns the dry erase marker board over.) A Baby! <br>\r\n<br>\r\nThe dry erase marker shows a picture of Sonic making look like an infant. The two Robots were confused.<br>\r\n<br>\r\nCubot: I have a question.<br>\r\n<br>\r\nDr. Eggman: (To Cubot) Save it till the end! The answer here is obvious. The reason why I can't keep Sonic from fighting is because he's in a proper age to fight.<br>\r\n<br>\r\nCubot: (sarcastically) Oh sure that makes more sense.<br>\r\n<br>\r\nDr. Eggman: So it comes to reason if I can make Sonic back into a infant again he won't be able fight and we'll do whatever we want and without him getting in the way.<br>\r\n<br>\r\nDr. Eggman turns the board over and to reveal the plans for a laser. <br>\r\n<br>\r\nDr. Eggman: This could take some work but it will be a lot faster with a montage.<br>\r\n<br>\r\nOrbot: (singing) Oh Mooon<br>\r\n<br>\r\nDr. Eggman: And no singing!<br>\r\n<br>\r\nOrbot was disappointed. Now that Montage song begins. First Doctor Eggman starts to hammer and drill the piece of metal. Then he used a blowtorch to mail them together. And the Machine flips over Eggman opens the door by pushing a button then place a burrito inside and then sets for a minute. <br>\r\n<br>\r\nDr. Eggman: As soon as my breakfast burrito is done we'll get to work.<br>\r\n<br>\r\nThen later Eggman who uses his telescope to look for the beach and there he sees Sonic and All His Friends having some fun.<br>\r\n<br>\r\nDr. Eggman: (evil chuckle) The preparations are ready!  (To the Robots) You two get the laser ready!<br>\r\n<br>\r\nOrbot and Cubot: Yes sir, right away sir!<br>\r\n<br>\r\nThey get the laser sticking out of the roof of headquarters. <br>\r\n<br>\r\nOrbot: I think we should point the laser more to the left.<br>\r\n<br>\r\nCubot: No! I want to point the laser more to the right.<br>\r\n<br>\r\nOrbot: I insisted we move it more to the left.<br>\r\n<br>\r\nCubot: well I insisted we move it more to the right!<br>\r\n<br>\r\nDr. Eggman: (annoyed) Both of you, knock it off!<br>\r\n<br>\r\nOrbot and Cubot: Sorry, sir.<br>\r\n<br>\r\nDr. Eggman: Get ready. Aim. Now, fire! (He notice he is not here in the laser being fire.)<br>\r\n<br>\r\nCubot: I want to press the firing button.<br>\r\n<br>\r\nOrbot: No it's my turn to press it.<br>\r\n<br>\r\nCubot: But you did it last time.<br>\r\n<br>\r\nOrbot: No I didn't.<br>\r\n<br>\r\nCubot: Yes you did.<br>\r\n<br>\r\nWhat happens next?</span></div></div>",
            "created":1550426340,
            "id":2619000,
            "title":"Sonic Boom: Baby"
        },
        "12":{
            "author_id":"dannyboy135",
            "author_name":"Danielday Patron",
            "choices":[
                "Amy",
                "Tails",
                "Knuckles",
                "Or Sticks"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who did the laser hit?</span></div></span></div>",
            "created":1550426460,
            "id":2619001,
            "title":"Or misses it and hit someone else"
        },
        "121":{
            "author_id":"dannyboy135",
            "author_name":"Danielday Patron",
            "choices":[
                "Amy turn into a baby by mentally",
                "Amy turn into a baby by physically.",
                "Or Both."
            ],
            "content":"<div class=\"\"><div> <span>As they continue to fight. Dr. Eggman got really annoyed.<br>\r\n<br>\r\nDr. Eggman: Just fire it!<br>\r\n<br>\r\nThey both jumped and accidentally press the fire button. The laser shoots but misses Sonic.<br>\r\n<br>\r\nOrbot and Cubot: (At the same time) Oops.<br>\r\n<br>\r\nDr. Eggman: \"Oops?\" What's an \"oops?\" What happen?<br>\r\n<br>\r\nOrbot: (worried)No-now, please don't get mad.<br>\r\n<br>\r\nCubot: We miss, Sonic.<br>\r\n<br>\r\nDr. Eggman: (Mad) What!?<br>\r\n<br>\r\nOrbot and cubot make themselves scarce.<br>\r\n<br>\r\nDr. Eggman: One thing. All you had to do was one thing to do. And you nimrods can't do that right! <br>\r\n<br>\r\nAs Doctor Eggman chases those two robots threatening to take them apart. The laser hits a couple of mirrors through town. Then it hits the mirror of Amy's bedroom. And finally hits Amy.<br>\r\n<br>\r\nAmy: What was that? <br>\r\n<br>\r\nSonic: what was \"what?\"<br>\r\n<br>\r\nAmy: Did any of you guys see that?<br>\r\n<br>\r\nTails, Sonic, and Sticks, says no and ecta.<br>\r\n<br>\r\nKnuckles: I couldn't see anything. Too busy making myself look good. (trying to impress the ladies)<br>\r\n<br>\r\nAmy: I have a bad feeling that Eggman behind it.<br>\r\n<br>\r\nTails: I'm pretty sure that was nothing. <br>\r\n<br>\r\nAmy: You're probably right, it was just nothing.<br>\r\n<br>\r\nThey all spend the day having fun. <br>\r\n<br>\r\nBut what happens next in the morning.</span></div></div>",
            "created":1550428560,
            "id":2619004,
            "title":"Amy"
        },
        "1211":{
            "author_id":"dannyboy135",
            "author_name":"Danielday Patron",
            "choices":[
                "Mind ",
                "Body",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Does her mind, or body gets affected by the laser?</span></div></span></div>",
            "created":1558852080,
            "id":2664246,
            "title":"Amy turn into a baby by mentally"
        },
        "12112":{
            "author_id":"dannyboy135",
            "author_name":"Danielday Patron",
            "choices":[
                "Barely able to walk",
                "Bathroom problems"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What happen to her?</span></div></span></div>",
            "created":1559509380,
            "id":2668328,
            "title":"Body"
        },
        "121122":{
            "author_id":"dannyboy135",
            "author_name":"Danielday Patron",
            "choices":[
                "Unable to control bladder",
                "Unable to control bowls",
                "Both"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of problems</span></div></span></div>",
            "created":1559509560,
            "id":2668330,
            "title":"Bathroom problems"
        },
        "1211223":{
            "author_id":"dannyboy135",
            "author_name":"Danielday Patron",
            "choices":[
                "Sonic",
                "Tails",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who does she ran into when the problems started to happen?</span></div></span></div>",
            "created":1559509680,
            "id":2668333,
            "title":"Both"
        }
    },
    "info":{
        "author_id":"dannyboy135",
        "author_name":"Danielday Patron",
        "brief_description":"After defeating Dr. Eggman. Eggman comes with idea of a way to keep sonic from fighting.",
        "created":1550425740,
        "description":"<td align=\"left\" class=\"norm\">Here are the rules of writing this story: <br>\r\n<br>\r\nRule number one: please no vore, no gore, no death of any of the sort.<br>\r\n<br>\r\nRule number two: Aging backwards can be allowed or or just mentally aging backwards is also allowed. <br>\r\n<br>\r\nRule number three: when writing this story please make it sound like a belongs in the actual show.<br>\r\n<br>\r\nRule number four: Please write in the same style I wrote it.</td>",
        "id":2182995,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1559522640,
        "modified":1559522640,
        "pretty_title":"Sonic Boom: Baby"
    }
}