{
    "chapters":{
        "1":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "choices":[
                "Scale the bed and climb to her face",
                "The alarm clock just went off"
            ],
            "content":"<div class=\"\"><div> <span>  (Read description for the plot! =p I know you probably skipped it, shame on you!  I bet you also click the Outline and look for the \"end\" scenes too, huh?  Nothing wrong with that, but I'd really like it if you read everything.  It'll be good, I like the same things as most all of you so.. yeah.  Endings won't be where all the good stuff is.  Anyways, hope you like it!)<br>\r\n<br>\r\n<br>\r\n  She was crazy, she was bitter, and most of all, she was sadistic.  You would scream as she held you by your feet and dipped you into scalding hot chocolate.  She would swish you around in the bowl, the bring you up to her mouth and toss you in.  She didn't take any concern for your well being, but only enjoyed the torture and the taste! <br>\r\n<br>\r\n   'Yeah,' you think, 'That was a good story.' You were still thinking about what Natasha told you last night. She was in the mood and wanted to turn you on and so told you of a story where she shrunk you after a fight and was torturing you.  You loved it, it had a lot of mouth play and in the end she just squished you between the soles of her feet.  Yeah, its not a normal sexual fantasy but she gets it.  Though it may seem weird to other people, for some reason unknown to you it gives you a boner faster than anything else, and she likes to take advantage of that fact.<br>\r\n<br>\r\n   On account of her being such an awesome and loving girlfriend, you've decided to surprise her.  She is really sexual, and loves spontaneous romances.  You aren't bring any candy nor flowers, no, you are just going to get naked and slide into her bed.  It doesn't sound too romantic, sure, but its something she would love and you know it.  In a matter of minutes, you have entered her apartment, locked the door behind you and began stripping.  You bundle up all your clothes and toss them into the laundry basket.  At both your places you have tons of each others' clothes just lying about, its no big deal.  With a grin on your face, you quietly enter her room and just as your about to slide under the covers of her bed where she lies sleeping, it hits you!  You feel like you've been punched in the stomach, but before you can make a sound your entire body shakes and it feels as if you're being electrocuted! Your head feels like its splitting open and you fall to your knees as your body folds in on itself before you pass out from the severe pain!<br>\r\n<br>\r\n     In what feels like eons but is actually five minutes, you wake up.  You look around and your heart seems to jump out of your chest.  The alien landscape around you takes just a matter of seconds to sink in.  You've shrunken!  Although you don't have an exact calculation, by comparison to her flipflips that are laying under the bed, you assume you are about half an inch tall.  Everything is just -too- big!  In youre head it looked nothing like this.  Even the shortest distances are going to take forever to cross now, and you have no idea how you are going to get Natasha's attention.  Uh-oh!  What if... no...  What if she thinks you did this on purpose?  How can you talk about exactly this happening every night for a year and then when it happens its totally unintentional?  No-no, shes a good girl, she'll believe you and help you.  But how are you going to get her attention?</span></div></div>",
            "created":1249448400,
            "id":739536,
            "title":"She'll Never Believe You"
        },
        "11":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "choices":[
                "You go unnoticed",
                "Natasha feels you, eventually"
            ],
            "content":"<div class=\"\"><div> <span>   The climb is more difficult than you had imagined.  Although there are plenty of footholds at your size, you don't seem to be covering much distance.  The top of the mattress is roughly two feet from the ground,and it takes you around an hour to get to the top.  When you finally do manage to pull yourself up and over the edge, you notice that Natasha is lying on her side and sleeping in only her panties. You elect to take the easiest and more importantly safest trek, and  travel along the bed sheet until reaching the fringe of her pillow.  With not many options viable, you scale the pillow and begin to close in on her cheek.  She is lying on one ear and the other is oppositely situated high above you. You realize now that in order to reach your goal (her ear), you'll need to scale her face completely. This gargantuan sleeping beauty's face at normal-size is very innocent and sensual, but the micro-version of you finds it a bit terrifying.  The giantess' powerful breath can be heard as it forcefully inhales and exhales, dooming any curious insect to either a hurricane or a vortex of hot humid air.  Taking no chances at traveling beneath her nose, you decide to ascend just below her bottom lip.  The rim of her mouth provides enough creases to make the climb less of a hassle, but just as you have latched onto the middle of her lip, the slumbering goddess begins to stir.<br>\r\n<br>\r\n   Natasha rolls over in her sleep, arching her back and then twisting her head until she is positioned facing the ceiling. Although this might seem a nonchalant albeit restless action on her part, the motion throws you from your grip and whips you about the air before landing you just in between both bottom and upper lips. Despite the lips being plush and soft, the landing gave you a bruise on your shoulder.  The good news is, you no longer have to climb so much as just amble towards the other side.  Unfortunately, when you crash landed, your mega-sized girlfriend felt a slight irritation.  Still dreaming, Natasha licks her lips before rolling onto her stomach to get more comfortable.<br>\r\n<br>\r\n     As you are just getting back up and wincing at your shoulder pain, the ground beneath you parts and out erupts a savage and slimy pink monstrosity.  In just a split second, the beast towers over you raining spittle before folding around you and the rest of her bottom lip, and rakes you into her cavernous maw!</span></div></div>",
            "created":1249707600,
            "id":741275,
            "title":"Scale the bed and climb to her face"
        },
        "111":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "content":"<div class=\"\"><div> <span>    Natasha is now lying peacefully on her stomach, head turned to the side against her cozy soft pillow.  The quiet little scene may seem innocent enough, but to a tiny man that has just been lapped up, its hell.  You are imprisoned in a dark, damp and ferociously hot dungeon.  The giant tongue that brought you into this madness lies atop of you, pinning you to the bottom floor of your girlfriend's mouth.  Thinking quickly, you run along the wet floor and slide up against  the inner wall of the mouth.  You have to get out of here and fast.  Only seconds have went by and already you are soaked in not only your own sweat by your girlfriends dripping saliva.  You realize it is futile to get through her teeth and so you can only hope that her taste buds will be sensitive enough to notice you.  As you climb onto her giant tongue, slipping and sliding as you go, you wonder how long you have before she will finally wake up.<br>\r\n<br>\r\n  As you reach the tip of the tongue, you trip and slide towards the middle.  As you land, you look around (your eyes have been adjusting ever so slightly) and notice the tongue in in a bowl shape, with the sides and tip a little more elevated.  You begin to jump up and down to get her attention when suddenly your feet feel funny. Standing still for a tiny second, you can feel as her taste buds absorb your flavor.  It at first feels like a tickling then it turns into a sucking sensation.  It itches your skin but at the same time it feels like a high powered vacuum is pull at your skin.  Not hurting too horribly, but very uncomfortable.  As you try to walk away, saliva starts to gather in more intense portions, dripping from the ceiling and flooding the bottom of her mouth and top of her tongue.  Already now, you are knee deep in a pool while your taste triggers more spittle.  Now realizing that the tongue was a bad move, you begin to run only to find out that you can't.  You aren't exactly stuck but it feels like running through what you image swamp water would feel like.  As your upper body attempts traveling faster than your lower will carry you, you trip and go head first into the nasty saliva.  Unfortunately for you, her tongue sucks your entire body like gravity, and her taste buds are now pinching, sucking ,tickling and shocking you.  Its starting to hurt, but worse than that, the suction on your face is holding you down as the acidic pools of drool cover you completely.  Not only is she tasting you, but she is going to drown you in her own spit!  You fight with all your might, and even as you manage to free yourself the situation only gets worse.  The saliva is now shoulder high and bubbling up all around you.  You half run/ half swim for your life but the suction pressure has now doubled and you go under!<br>\r\n<br>\r\n<br>\r\n     Just as you think its the end, light pours in from you ahead of you.  You can see it through the lake of spit, and are relieved that your loving girlfriend has finally noticed you.  Then you hear it.  The entire chasm fills with a deafening roar that sloshes you and the spittle, freeing you from what felt like certain agonizing death.  Unforunately, the mouth closed before you even got an attempt to escape.  Just as soon as it closed, it opened again and as the goddess smacks her lips, piercing echos swarm your ears and the organic cave around you. Before you even realize what is going on, the giant beast you've been riding rises to the ceiling and all the saliva in her mouth (you included) begins to swirl into decent.  You scream as loud as you can but the sounds are cut off as spit pours into your mouth.  This hurricane is over in just a split second as you are slid down her tongue and the ground suddenly drops below you.  You travel down her throat faster than even gravity could have pulled, and for you the adventure is over before it could really even begin.  <br>\r\n<br>\r\n  Natasha wakes up, sits up in bed and yawns.  Although she usually has dry-mouth most mornings, she smacks her lips to find that she has been drooling, or rather would have been if her mouth had been open.  Wrinkling her nose, she quickly swallows and goes about her business.<br>\r\n<br>\r\nYou were swallowed alive by your girlfriend, and she'll never even know.<br>\r\n<br>\r\n</span></div></div>",
            "created":1249794000,
            "id":741688,
            "title":"You go unnoticed"
        },
        "112":{
            "author_id":"obliviousnat",
            "author_name":"obliviousnat",
            "choices":[
                "wait.",
                "get out now"
            ],
            "content":"<div class=\"\"><div> <span>Natasha wakes up from a most extraordinary dream. It had been a very realistic enactment of one of the fantasies you and her had shared numerous times. She can taste you as she thinks about it.  She imagines you in her mouth and moistens her lips at the thought.  She slides her tongue slowly against the roof of her mouth forcefully, pretending you are stuck there, tortured screams barely escaping as you gasp for every breath. Stretching as she ambles out of bed, she giggles quietly and reaches for the phone.<br>\r\n<br>\r\nYou are drenched. Thankfully Natasha is a peaceful sleeper and you haven't been tousled about too much. You've actually had long stretches of no movement whatsoever. You use these times mostly to think of how you're going to get out. You're pretty sure she'll wake up soon and get that feeling that there's a pepper flake or something on her tongue and reach a colossal finger in to get the errant bit of food. Of course you'd be that crumb of \"food\" but you really want out of this dark, wet place.  <br>\r\nThe giantess is stirring again. You can't escape the grip of the great pink serpent as it glides forward. You are scraped against teeth for an agonizing second and, just as quickly, are pulled back. You think the worst is over but, no. The ground beneath you rolls and you fall on your face as the humongous tongue thrusts upward, sandwiching you between it and the top of the goddess' mouth. You are forced to endure tons of pressure while she slowly slides her rough tongue back and forth against the roof of the cave. Finally it's over and you hear a rumble of laughter as you feel the motions of your giant girlfriends footsteps.<br>\r\n <br>\r\nYou see flashes of light and hear her amplified voice as she opens and closes her mouth to talk. Do you try to make your way out at a time when her mouth is open during this conversation or, do you bide your time and wait for the pepper flake theory to kick in?</span></div></div>",
            "created":1250744400,
            "id":747458,
            "title":"Natasha feels you, eventually"
        },
        "1121":{
            "author_id":"obliviousnat",
            "author_name":"obliviousnat",
            "choices":[
                "on the bed (whew!)",
                "on the bookshelf"
            ],
            "content":"<div class=\"\"><div> <span> You decide to stick it out. She'll notice you soon enough. Your wait is a short one. Natasha's mouth opens flooding the confines of the cave with light.You make your way toward the opening, hopeful that she's finally going to fish you out of this hot, wet mess that you've gotten yourself into. Her mouth opens wider as she inhales deeply. It opens wider still, with another quick but powerful intake of air. Oh no, you know exactly what's about to happen. But it's too late for you to act on anything. The gargantuan goddess sneezes and you are propelled forward out of the perfect 'O' her lips form. You find yourself sailing through the air. Wherever will you land?</span></div></div>",
            "created":1250830800,
            "id":747641,
            "title":"wait."
        },
        "11211":{
            "author_id":"obliviousnat",
            "author_name":"obliviousnat",
            "choices":[
                "side",
                "back"
            ],
            "content":"<div class=\"\"><div> <span>You squeeze your eyes shut as you soar through the air with incredible speed that seems to occur in slow motion. Ahh, cloud-like surprise. Yay! Fate has landed you on the mattress.  Scrambling to get your bearings before something unfortunate happens, you barely escape Natasha's bum as she hops onto the bed. She is still deep in conversation with her friend. You take this opportunity to try and get some attention from your love. As luck would have it, this sizable woman is settling in for a long conversation. She always mindlessly plays with her hair on lengthy calls. You almost do a victory dance as you watch her snatch the green hair tie, let those lush black curls free, and lay back, relaxing. All you have to do is make it through the massive amount of hair while dodging her meandering fingers. Is Natasha laying on her side or on her back?</span></div></div>",
            "created":1302770580,
            "id":1087908,
            "title":"on the bed (whew!)"
        },
        "112111":{
            "author_id":"obliviousnat",
            "author_name":"obliviousnat",
            "choices":[
                "\" How the hell did this happen?\"",
                "\"Time for a little fun!\""
            ],
            "content":"<div class=\"\"><div> <span>You begin your trek across the bed. It doesn't take long. Natasha is very still aside from her hands tangling in her hair. You almost made it. Unfortunately you are wearing dark clothing and Natasha's bedding is pale yellow. Whack! You are smushed into the mattress with so much force it knocks the wind out of you.<br>\r\n<br>\r\nNatasha reaches for her foot and pulls off her flip flop. \"Hang on,Kita..\"  Whack! She keeps the pressure on for a while just to make sure the bug is dead. Unfortunately it is still moving. She squints at the creature.  Rubs her eyes and looks again. She sees that, sure enough, her boyfriend seems to have shrunk. \"Gotta go, Kita.\"<br>\r\n<br>\r\nNatasha scoops you up into her hand and says,</span></div></div>",
            "created":1302772440,
            "id":1087912,
            "title":"side"
        },
        "11212":{
            "author_id":"obliviousnat",
            "author_name":"obliviousnat",
            "choices":[
                "enough is enough!",
                "but she loves how patient you've always been"
            ],
            "content":"<div class=\"\"><div> <span>Natasha wraps up her conversation with Kita. They were old friends and it would be fun to catch up over dinner. Your girlfriend places the phone on its base and heads off to start cooking, wondering if she imagined that weird speck by the phone. Surely it wasn't moving.<br>\r\n<br>\r\nYou land agilely on your feet. You quickly asses the situation and find you're on top of the bookshelf right next to the phone base. Knowing she'll eventually hang up the phone, you stay right where you are. It's a rather short bookcase, in comparison to her. So, you are more than confident she'll finally notice you.  She makes conversation for a few minutes before heading toward you. As she places the phone on the base she stares right at you. You scream at the woman towering over you, jumping wildly, waving your tiny arms. You are certain she's finally spotted you and that everything is going to be alright. But your hopes are crushed as she exits the room. You know she'll be back... eventually, but you're starting to wonder if she'll ever see you.</span></div></div>",
            "created":1250830800,
            "id":747825,
            "title":"on the bookshelf"
        },
        "112121":{
            "author_id":"obliviousnat",
            "author_name":"obliviousnat",
            "choices":[
                "head for the left ear",
                "go for the right ear"
            ],
            "content":"<div class=\"\"><div> <span>You decide you've had enough of this bullshit. She's not going to just happen to notice some random dust bunny. It's time to take action. You walk to the back of the phone and glide down the cord. This course of action lands you on the plug. You mentally thwack yourself for not considering this before sliding down here. Oh well, too late now. You decide this 'do now, think later' thing is working out so far, and jump. You land with a thud and quickly check for any broken bones. It's a miracle! You have got to be the luckiest son of a bitch on the planet. So you're off to the kitchen, where you know Natasha's cooking. It takes quite a while but you manage to get there without a problem. Once you get to the kitchen you look around, assessing your surroundings. You notice a cord hanging from one counter, a string from another, and the table's ornately carved legs. But you bypass all that. You've got to get to Natasha. Scaling the giantess' clothes should be easy. You climb for hours while the goddess prepares a feast. Where do you go?</span></div></div>",
            "created":1251267540,
            "id":750423,
            "title":"enough is enough!"
        },
        "1121211":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "choices":[
                "Natasha scoops you up",
                "You catch a lucky break"
            ],
            "content":"<div class=\"\"><div> <span>  Although the climb was ridiculously difficult, the mobile mountain of a girlfriend couldn't manage to throw you off depsite how much it seemed she was trying.  Of course, that was all just in your head.  Natasha has innocently enough began to cook breakfast.  At first she was going to go with a simple bowel of cereal, but her tummy growled up at her and she decided on something a teeny bit more delicious.  She was actually done with the cooking part now, and was fixing herself a plate.  She walked over to the kitchen table and put down her meal of biscuits with chocolate gravy!  She had spread two biscuits open, and drenched them with the sugar-rich gravy.  This was one of her favorite things to eat, and she hadn't had it in a while.<br>\r\n<br>\r\n  You, on the other hand, had managed to make some progress.  Natasha had made the biscuits, the gravy, and got caught up on a few dishes that needed to be cleaned.  As accomplished as she felt, you had managed to climb a goddess from toe to shoulder.  Boo-yah!  Who else has ever done that?  You are on Natasha's left shoulder, hence you begin to climb through her hair to the left ear.  Unforunately for you, just as you approach her ear, the giantess turns her head and sneezes so violently that you are thrown off!!  You scream inaudibly before crashing into a mushy but still hard landing.  The floor beneath you had caved in from the force, but miraculously you were still intact.  Sore, but not broken bones, victory!  You are surrounded by hot white rocks.  Is this dirt.. no, its too soft.  What is ...  Natasha appears above you, looking straight at you, smiling.  You quickly manage to get to your feet and again, begin waving your arms and screaming for recognition.  Your girlfriend simply tilts her head, as if in contemplation.  Before you know whats going on, she fills in your section with the hot chocolate gravy.  It is scalding your skin, burning!  Not enough for permanent injury, but if it hadn't stained you brown, you'd be pink all over!  What is this!  The goop seems to be latched onto you as your body attempts to adjust to the temperature.  The weight has pinned you down, and its difficult to move.  A little taste comes to your mouth, and you realize where you are and what you're covered in.  <br>\r\n<br>\r\nHer face reappears, her lips are moistened, and her tongue sweeps across, hungry.  A giant fork appears up in the sky and swiftly plummets into the tasty biscuits.  Although it didn't catch you up, you could feel the vibrations of the earth being torn asunder at the delight of this giant woman!</span></div></div>",
            "created":1253207820,
            "id":761753,
            "title":"head for the left ear"
        },
        "112122":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "choices":[
                "Try to prove that you're not a bug!",
                "Run!"
            ],
            "content":"<div class=\"\"><div> <span>  You pace back and forth.  Its quiet.. a little 'too' quiet.. or at least, that's what they say in movies.  You decided that Natasha will eventually come back and it'll only take a little patience on your part.  Already, you have been waiting for half an hour.  You know this from the giant alarm clock nearby the phone.  You would think that with all this time, you would be able to formulate a plan.  You attempted to unplug the phone cord, attempting to sabotage anything you could in the hopes that she would realize something is off.  Unfortunately, your microscopic size may have increased your durability a teeny bit, but not your strength.  You have paced the surface area of the entire bookshelf, but it being on the small side even at your size,  made the trip pretty short.  Maybe this was a bad idea...  not exactly a bad idea, no, but not a good one either.  A useless idea, yeah, that describes it well enough.  You decided to wait, and in reward to your patience, nothing happened.  <br>\r\n<br>\r\n   Okay, so you've sized up the bedroom, and now you have to make a decision.  Should you find a different location or just --BOOM-- --BOOM-  --BOOM--<br>\r\n<br>\r\n    It turns out, you don't have to make a decision at all.  The sound of giant footsteps fill the air, and bring a smile to your face.  For multiple reasons: One, she truly is a goddess.  She is beautiful even when she is terrifying. Two, your patience truly did pay off as she is headed straight your way.  You look into her giant brown eyes as they softly scan the room at leisure until resting on the phone.  Miles of distance (from your perspective of course) are covered in mere seconds as the giantess stands directly over you.<br>\r\n<br>\r\n     You do the only thing you know best.  You start running towards the phone, jumping, screaming, and waving your arms like a madman! You have read a million shrinking stories, this stuff never works, but you're compelled to do it at any rate.  Your giant girlfriend bites her plump bottom lip as if in consideration, and then her eyes fall directly onto you.  It worked, she noticed you!  <br>\r\n<br>\r\n    Unforunately for you, her nose wrinkles and her lip pulls into a slight snarl.  She is surprised, curious, nor in shock.  She is disgusted.  Thats when you hear it, \"EW, WHAT THE FUCK IS THAT!?\"  <br>\r\n<br>\r\n  Time seems to freeze for this one second.  By the look in the eye of the person you adore most in this world, you understand that she doesn't register who or what you are, and its more likely that she will kill you very soon.  Should you try to do something to prove your human, or make an escape along the phoneline and hide behind the bookshelf?</span></div></div>",
            "created":1251426300,
            "id":751526,
            "title":"but she loves how patient you've always been"
        },
        "1121221":{
            "author_id":"obliviousnat",
            "author_name":"obliviousnat",
            "content":"<div class=\"\"><div> <span>Natasha quickly searches the area for a shoe and locates a flip flop. She raises it slightly and slams it hard against the top of the bookshelf. She pulls it up to examine the area for the squished insect and finds the damn thing is still moving. So she takes one deep breath and assaults the tiny bug again.<br>\r\n<br>\r\nYou roll over and try to discreetly check for injuries. So much pressure surrounding your body that quickly should have killed you the first time, but didn't.  Hardly a second passes before you feel, again, something you are ill prepared for. You are pressed into the hard surface of the bookshelf by the flip flop so fast it makes your head spin. You feel every fiber of your being flattened as thin as a crepe, then all is black. The giant sandal succeeds the second time around. You. Are. Dead.</span></div></div>",
            "created":1251855780,
            "id":754120,
            "title":"Try to prove that you're not a bug!"
        },
        "1121222":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "choices":[
                "you're behind the night stand, Nobody is home.",
                "you're somewhere you would have never expected."
            ],
            "content":"<div class=\"\"><div> <span>  You've read a million shrinking stories before.  As a matter of fact, so has she.  So how is it that she can't register what you are?  Is she too sleepy?  Is she....?  Dear God!<br>\r\n<br>\r\n  As you freeze in place, it doesn't take the beautiful Natasha but mere seconds to find a weapon of choice, her flipflop!  Hesitation no longer an option, you take off running as fast as you can.  You don't have a plan, you don't know where you're going, you're just getting away from this titanic woman and her flipflop of mass destruction.<br>\r\n<br>\r\nYour legs burn, pumping in a sprint they've never even realized they could accomplish, but its still not fast enough!  This isn't a movie, this isn't a story, this isn't a game.  The flipflop does -not- come down in slow motion, nor does it feel like it at all.  The shadow falls ontop of you, and in less than a second the massive footwear lands inches (your scale) behind you!  The thundering sound makes your ears ring while the force of the slam carries you off your feet and flying straight into the back wall.  Although the pain is surely less than what the flipflop could have accomplished, you are still sore and dazed by the contact.  Rebounding off the wall, you land back-first onto the phone-cord!  Your eyes are drooping and your mind can't process whats going on, and you may have a concussion.  You're body, luckily, is gliding along the cord as if its a water slide.  Unfortunately, you begin to pick up speed and race across a few loops.  Its dark behind the dresser/night stand, and as you lose vision, you throw up!  In just a second, you are launched off the cord and back into the wall, where you lose consciousness.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nWhen you wake up</span></div></div>",
            "created":1253206920,
            "id":761745,
            "title":"Run!"
        },
        "1122":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "choices":[
                "  You barely escaped and are on her bottom lip!",
                "You're falling down to her bosom!"
            ],
            "content":"<div class=\"\"><div> <span>  Natasha was talking on the phone to her best friend Kita.  The two went way back, but never really hung out any more and it was just really good to hear her voice.  She had been returning a missed call from her, and was anxious to see what the girl wanted.  Maybe she was back in town for a visit or something, that would be great.  As the two talk about both whats new in their lives and reminiscing about the past, Natasha feels a little speck of something brush to the inside of her cheek.  Squinting her nose a bit, she fishes around her mouth, prodding with her tongue at the crevice made between her gums and wall of her mouth.<br>\r\n<br>\r\n<br>\r\n  Your world has been turned upside down and back again.  You were slammed up into the roof of your goddess girlfriend's mouth, as the giantess took great pleasure in sucking you and tossing you about back and forth.  You banged against her teeth, her cheeks, her everything.  You were drenched and badly bruised and weren't even sure you could move on your own right now.  The mouth was so very humid and filled with pools of spit that you thought you would either suffocate, drown, be crushed to death by this monstrously playful tongue or just simply be swallowed.  When light poured in, and you heard the giant giggling, you were excited yet half curious.<br>\r\n<br>\r\n  Had she been dreaming?  Why was she laughing?  As you tried to situp on her tongue, you felt your entire body pulsing with ache.  Suddenly the giant cavern began to expand and shrink, opening and closing as light came in for a second and out.  Along with this came unrecognizable words, so loud that you couldn't hear the difference in covering your ears and doing nothing.  It made your head want to split and it was so blaring loud that it just sounded like garbled noise.  As the giantess' tongue articulated her words to whomever, you were thrown off and slammed into the slimey inners of her cheek.  Unforunately for you, your girlfriend had felt this slight disturbance.  The mouth closed with the light with it, and the giant menace of a toungue came searching for you.<br>\r\n<br>\r\n   Your body had slid down the wall and you were wading through saliva and gripping her gums to make sure you didn't fall.  The pink terror came from above and pushed you down into the drool mercilessly.  You scream out in pain but only get a mouthful of your girlfriend's mouth fluids.  The sinister lingua poked and prodded at you, then began to drag you highspeed across the bottom of Natasha's mouthfloor.  It was like an evil hot waterslide, only with a chance of being unknowingly eaten. <br>\r\n<br>\r\nNatasha was listening to her friend on the phone while half-consciously prodding at the piece of food in her mouth.  She managed to push to the the front of her teeth, then she lifted it up, balanced it onto the tip of her tongue, then flipped it back towards her throat.  With a soft swallow, she had only a tiny curious thought reguarding the teeny speck. 'I wonder if that had anything to do with last night's dream?'<br>\r\n<br>\r\n  You, in the meantime, had been beaten, drug and almost drown via the bully that is your girlfriend's tongue.  Unable to fight back, she glides you up along her teeth and manages to catch you on the top of her tongue.  She opens her mouth to reply with an \"Uh-huh\" to whoever it is she is talking to, before flicking her tongue harshly backwards in only a fraction of a second.<br>\r\n<br>\r\n  As luck would have it, that brief \"Uh-huh\" had been a window of opportunity that you took without hesitation.  Not even realizing you just barely escaped certain death, you had managed to use what little remained of your strength to jump from tongue to the light of your girlfriend's open mouth.  Only question is, where did you land?</span></div></div>",
            "created":1250744400,
            "id":747485,
            "title":"get out now"
        },
        "11222":{
            "choices":[
                "You slide down her leg, coming to rest on her toes.",
                "You hit the floor. Hard"
            ],
            "content":"<div class=\"\"><div> <span>You manage to land on your girlfriend's lower lip. The cool air in the room feels great after being trapped in her hot, wet mouth. Knowing that you must act quickly, you try to peer over the edge of her lip. Looking down you see that she is still dressed in her nightgown, and you watch fascinated as her breasts jiggle as she speaks. Suddenly she lets out a giggle which sends you tumbling from your perch. Flailing wildly, you fall down right into your girlfriend's cleavage.<br>\r\n<br>\r\nAlthough full and firm, her 'girls' aren't quite large enough to hold you securely between them. Normally you love her without a bra, but this is one time when you wish she had worn one. You desperately try to reposition yourself, somehow hoping to wedge yourself between her breasts. You manage to get yourself almost horizontal, but it's too late. You've already slide down too far. Looking down you can see that she's barefoot, pacing back and forth as she talks. Suddenly the inevitable happens and you fall.</span></div></div>",
            "created":1252114740,
            "id":791056,
            "title":"bosom"
        },
        "12":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "choices":[
                "Natasha loves her converse",
                "Sticking with flip flops"
            ],
            "content":"<div class=\"\"><div> <span>     Before you can formulate a plan to get noticed, the screeching sound of a giant alarm clock penetrates the silence.  Without missing a beat, Natasha slams her hand on the off button and sits up in bed.  Stifling a yawn, she scoots over to the edge of the bed and places her feet down on the carpet just in front of her flip flips.  Unfortunately, that was exactly where you were standing.  Looking up towards the curious rumbles, terror strikes your face as two giant soles come crashing down right on top of you.  The gust created by the force of such large objects managed to hurl you forward a bit and instead of being completely mushed, you are wedged in between two colossal toes as they land on either side of you.  Before you can count your blessings, her foot lifts up, you with it, and the giantess slips on her flip flops.  As Natasha goes about her morning ritual, you are screaming up at her, punching, kicking and even biting her toes in hopes of getting her attention. Of course its all in vain. As she moves at what feels like unfathomable speeds to you, you can only stay stuck and sick at your stomach as she puts on her clothes.  You are soon pinched tight as she slides her foot back out of the flip flop and puts on a pair of jeans.  Your lungs feels like they are collapsing and you think its a miracle in itself that you aren't goo at this moment.  Before you can tell whats going on, she is already making up the bed and fully dressed save for being barefoot.<br>\r\n<br>\r\n     With quiet contemplation, Natasha quickly debates whether she wants to wear her converse or just stick with sandals.</span></div></div>",
            "created":1249794000,
            "id":741300,
            "title":"The alarm clock just went off"
        },
        "121":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "choices":[
                "Natasha goes out",
                "Something unexpected happens!"
            ],
            "content":"<div class=\"\"><div> <span>  Although you should be attempting to catch your breath, you continue screaming up to the oblivious Natasha.  She has stopped moving around so much, yet you are still pinned in between her toes.  If you would have taken that chance to rest for a minute, you may have noticed that she is on the other side of the bed.  The side where her sock drawer is, and the side where her converse are tucked neatly underneath the bed.  If you would have actually took the time to catch your breath, you may have gotten that last clean gulp of fresh air that you will so desperately cry for soon.<br>\r\n<br>\r\n  Humming to herself, Natasha sits on her bed and pulls open her sock drawer.  She grabs a pair of short plain-white cotton socks and unfolds them.  She thinks about how she needs to check her missed calls and get something to eat, only barely glancing at her foot and then to the sock that is wide open just below it.  As her foot enters into the sock, sliding right up, she begins to think of you, missing you.  She knows you usually love watching her put her socks on, sometimes fantasizing about being in them.  Its not weird, she loves the idea of being an allpowerful goddess to you, and loves it that you would love to worship her.<br>\r\n<br>\r\n<br>\r\n  You feel yourself arise with this giant living vessel and in a flash, Natasha's hands and a streak of white fall below you.  You look up to notice she is looking right at you, but as you begin to wave your hands in the air, you feel her ginormous foot tilt down and her toes loosen their grip enough to have you freefall away!  Those big beautiful eyes are piercing right through you but not seeing you, and her haunting nonchalant humming destroys your hopes that she has noticed you.  In just a millisecond, you have crashed into a giant white wall, bounced onto another white wall, and slid along until you came crashing onto an all white floor.  This floor is made of tiny fibers and is swaying back and forth, and thats when you realize where you are.  You look up to see those brown eyes see nothing but a sock, and soon that vision is blocked out by green polished toenails that you've gotten very familiar with.  You attempt to run but you can't even stand up before her foot has slid down atop of you, your entire body fitting snugly below her third toe. Before you know whats going on, the light barely outlining the sock's cotton layer gets dark.  In moments, you are completely in the dark and jammed between the bottom of her sock, and a hard flooring.  It doesn't take long for you to realize she has put her shoe on, as the temperature starts to rise in a matter of moments.  <br>\r\n<br>\r\n  Natasha puts on one sock, then the appropriate shoe, and then does the same with her other foot.  As she stands up, she feels a little ball of lint under one of her toes.  Already having been thinking about you, she smiles mischievously before squeezing her toes repeatedly around the object.  She wishes you were here, but she can tell you about playing with her lint ball later.  Even though you're gone, she can keep her mind at ease and remember you just by torturing this little sock fuzz.<br>\r\n<br>\r\n  Your prison slams down hard, and the great weight of the toe is too great to even move.  Thank God you didn't land under the ball of her foot or you'd be dead right now.  In this enclosed space, in this heated temperature, and at your size, the smell of her foot begins to sink in.  She is a clean person, but this eerie and unfortunate combination are starting to get to you.  Its not quiet what it will become later on, but it smells almost like garbage.  You would plug your nose but that would on----- Without warning the toe you are under squeezes you into its skinfolds and into the ball of her foot.  Her toes seem to bounce and taunt as they squeeze the living shit out of you.  You can feel your bones bending and your muscles bruising, and just before you're squished flat it releases and you bounce onto the cotton floor, are pinned down by the same toe, and then the process repeats.  You're not sure how much more of this you can take.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1250744400,
            "id":747577,
            "title":"Natasha loves her converse"
        },
        "1212":{
            "choices":[
                "\"I'm sorry for that, I didn't know that it was you.\"",
                "\"Well, I guess now you know how I'd treat you if you were small.\"",
                "\"Well, I guess we've both got our wishes.\""
            ],
            "content":"<div class=\"\"><div> <span>Natasha was getting too much fun out of this! And you were getting too much of the exact opposite, intense pain. Her massive toes were refusing to relent, you were yelling and screaming, but you knew that if she couldn't hear you before, it was impossible that she would be able to hear you while you have a massive converse blocking any sound, except for the laugh you heard her give from the absolute pleasure she was having right now, the feeling of complete domination over the \"lint ball\" and how much she thinks you'd love to see how powerfull she is over smaller, weaker, worthless objects like you would be if you were small, but little did she know that you actually were small, little did she know... until you suddenly felt and saw her toes raise, suddenly, the hard ground that used to be under the sock felt very light, and the ground you were on actually started dropping.<br>\r\n<br>\r\nSuddenly, the darkness of the sock was filled with light pouring through the holes, and you felt the sock tighten at the end, and suddenly, her massive foot was receeding out of the sock, she was taking her sock off! You ran and tried and succeeded to grab onto a toe, but you couldn't get a good grip, so you ran right into the middle of two toes, you knew that was the area with the most grip since that area made the most sweat. You couldn't believe what was actually happening, you were in the middle of the toes of your giant girlfriend! You knew that if she knew, she would've taken advantage of your position and squeezed her toes together, and as you thought of that, it actually started happening! Her two massive toes (big and second toe) started moving closer together, you felt compressed and tried to squirm, but she only squeezed harder! Oh wait, you remember, you were the \"lint ball\" that she was going to show to you later, and she probably wanted to show you the most beaten up, abused, deformed looking lint ball she could possibly make, and then she'd probably tell you what a journey she made it take using only her massive toes.<br>\r\n<br>\r\nNatasha wanted to take a look at this lint ball she was torturing, she wanted to know how it looked now and how she could possibly make it look worse. She sat down on her bed and brought her foot closer to her, it was now resting on top of her other foot, she bent her face closer to the two toes you were in the middle of, and she stretched them open.<br>\r\n<br>\r\n\"Oh...\" was the only word she could say, obviously recognizing you and trying to muster up some words to say, and she repeated it \"Oh...\"</span></div></div>",
            "created":1252259700,
            "id":756489,
            "title":"Something unexpected happens!"
        },
        "12123":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "choices":[
                "You're her jolly rancher",
                "Don't you just love her ass?"
            ],
            "content":"<div class=\"\"><div> <span>  What started off as a little game of imagination grew too pleasurable too quickly.  Natasha's imagination got the better of her, as she pictured herself dominating her poor little speck of a boyfriend between her toes.  He would scream and plea, but secretly he would love it just as much as she did.  She didn't just want to play with the pretend-teenie, she wants to take him out and with a little imagination, abuse and torture him until she herself was exploding in pleasure!  Hurriedly, she stripped off her shoes, followed by her socks! Pulling her feet up onto the bed, she crossed her legs Indian-style before peering at whatever was caught between her toes.  She would have her way with it, and then save it on the dresser-top so show you later.<br>\r\n<br>\r\n  What she saw surprised her.  She squinted and drew closer, her breathing growing hot and heavy as her imagination attempted to play tricks on her.  But.. it wasn't her imagination. it was.. he was.. real... \"Oh...\"<br>\r\n<br>\r\n  A million thoughts raced through her mind all at once. 'My biggest fantasy has come true!  So has his! How did he get this way? He did it on purpose! Of course he did, but.. he didn't even ask my opinion.  Is there a reversal? Why didn't he tell me?  Because he wanted me to find him like this.  He wants me to dominate him, and he doesn't care what happens to himself.  Does he really care about my feelings if he could just allow himself to be killed unknowingly by me, and to just go missing and me none the wiser? How can he take care of me now?  Will I have to take care of him?  Does he want me to still play with him?  Yes... He knows what he wants.. and he knows what I -Ooohhhh-'<br>\r\n<br>\r\n  The tiny being was squirming in between her toes, forcing her eyes to roll back in their sockets, and sending a shiver down her spine.  This was not a ball of lint. This was her boyfriend.  He shrank himself for their mutual pleasure.  Lust and passion flooded her mind, throwing out logic and compassion! She allowed herself to completely submit to her raging hormones, allowing a sexual \"Oh...\" to escape.<br>\r\n<br>\r\n\"Well, I guess we've both got our wishes.\" she said with a giggle at the end.  It was the playful, devious laughter of a woman thoroughly enjoying a most wonderful predicament.  She eyed him like candy as she continued, \"I think you made the right decision, baby.\" <br>\r\n<br>\r\n  Her eyes scare the hell out of you.  All the love has been removed, and in its place is lust.  Not just in a sexual way, but her facial expressions read out that she has found a new toy.  You.  She thinks you did this on purpose, and it seems like she is either roleplaying with you or... no, surely she doesn't mean it.  Just to be safe, you start waving your arms and shaking your head 'no'.<br>\r\n<br>\r\n\"What? You don't want to play?  Well thats too bad.  You may as well enjoy it my little dustbunny.\"  Giggling again, she hovers her index finger over your body.  Humorously, she waves 'goodbye' with it, all the while smiling, before resting it on your puny form and grinding you into the space between her toes.  She bites her bottom lip, her neither regions quiver, and her fingers continues mushing you into her pretty little toes.  The reality is so much more tempting, so much more powerful than the imagination, and your body seems to pulse pleasure into hers.  <br>\r\n<br>\r\n  The finger was gigantic, and in only a matter of seconds it lands on you and rubs you into the fleshy ground thoroughly.  What seems like an inch to her is roughly twelve feet to you, and this relentless 'smushing' act is dragging your body back and forth along this 'inch' of skin.  You can feel the odor and heat flow from her foot and into your body, your entire being is pulverized and sliding, back and forth, back and forth.  You hear your bones creaking, shes putting too much pressure on you!!  If she continues this, your skin will fly off your bones, and you'll eventually become just a bug stain on your giantess girlfriend's foot.<br>\r\n<br>\r\n  Letting out a deep sigh, Natasha picks you up between two fingers and brings you up to her face.  Your torment is her pleasure right now, and as she smiles down at you, she begins to roll you between said two fingers.  She ponders what to do with you first.  Her biggest fantasy is vore, but she isn't sure if she wants to eat you.. just yet.  It would end it all too soon.  Maybe she should reenact one of your own fantasies, just to see how you 'really' like it.  As she is busy contemplating, the phone rings. Standing up she makes her decision.  She will either pop you into her mouth like the potential jolly rancher you are, or maybe she'll just drop you into the backside of her panties.  She was never much for butt pleasure and didn't really enjoy using her booty in roleplay despite how much you liked it.  Then again.. maybe now that its real, she would learn to.  She has to keep you somewhere anyways...<br>\r\n<br>\r\n</span></div></div>",
            "created":1252452780,
            "id":757755,
            "title":"\"Well, I guess we've both got our wishe..."
        },
        "121231":{
            "author_id":"obliviousnat",
            "author_name":"obliviousnat",
            "choices":[
                "Rest, please!",
                "Just kill me"
            ],
            "content":"<div class=\"\"><div> <span>Natasha indulges herself and excitedly places you on her tongue, letting her massive index finger linger a bit before slowly withdrawing it from her mouth. She lets you sit there for a minute, absorbing the taste of you, enjoying her juicy little jolly rancher. <br>\r\n<br>\r\nYou, however, did not enjoy yourself very much at all. Her finger crushed you into the slimy pink monstrosity of a tongue. Then you were enveloped in damp, sweltering darkness only to play a torturous  waiting game. After a few harrowing moments you feel movement. SPLAT. You are slammed into the roof of her mouth with just enough force to make you think you might die. Given no chance to recover, you find yourself being swished around in circles as she toys with you like a piece of candy just before thrusting you upward again. She torments you within her cavernous maw for hours. You are physically drained. But there is no rest for the weary. Or is there?</span></div></div>",
            "created":1260648120,
            "id":804726,
            "title":"You're her jolly rancher"
        },
        "1212312":{
            "author_id":"obliviousnat",
            "author_name":"obliviousnat",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She accidentally swallows you. Your life is over. She mourns your death for years. At least you died happy</span></div></span></div>",
            "created":1269894720,
            "id":858732,
            "title":"Just kill me"
        },
        "121232":{
            "author_id":"obliviousnat",
            "author_name":"obliviousnat",
            "choices":[
                "Escape",
                "Honesty"
            ],
            "content":"<div class=\"\"><div> <span>Natasha brings you up to her lips and darts out her tongue for a quick lick. You prepare yourself for the humid cavern of her mouth, but she surprises you. Your world goes topsy-turvy  and then completely black. You feel compressed between a rounded, slightly squishy surface and what feels like rough cloth with holes in it. Soon enough you figure out the cloth is her favorite green lace panties, which can only mean the round surface is that bodacious backside you so adored at your normal size. She is still for a long time, long enough to lull you into a false sense of security. You feel slightly more pressure as she begins to walk for a short time. Just as you adjust to the rythym, you feel as if you are in zero gravity before being slammed back into her cushy behind. Your world is spinning as she moves around and you feel nauseous.  Suddenly you are in her hand. <br>\r\n<br>\r\nNatasha slips you into her undies, knowing how much you love her butt. She stands still for just a minute, relishing the feeling of bliss. She can just barely feel your tiny movements against her left cheek. Giggling to herself, she makes her way to her bedroom, adding a little extra wiggle to her walk. Leaping onto the fluffy mattress and writhing around on the bed,she feels deliciously fiendish. She gets so turned on imagining you being squished into her butt, she lets out a moan.  After a few minutes of giving you vertigo, she fishes you out, lays you on her palm and blows you a kiss.  \"How was that?\"<br>\r\n<br>\r\n<br>\r\nIt is at this point you realize you've created a monster. Your girlfriend has clearly lost her mind. You can try to fake your way out of this situation and escape, or you can be honest with your lady love and hope she believes you.<br>\r\n<br>\r\n</span></div></div>",
            "created":1407825600,
            "id":1840457,
            "title":"Don't you just love her ass?"
        },
        "122":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "choices":[
                "  You attempt to climb Natasha",
                " Natasha starts bouncing her leg and you fall to the floor"
            ],
            "content":"<div class=\"\"><div> <span>  You stare up at the colossal beauty as she pauses for just a moment.  You scream and wave your arms, \"Natasha, you have to notice me, please!!!\" In response, you feel yourself and her foot elevate into the air.  You feel that loss of gravity in the bottom of your stomach and you begin to travel forward faster than the fastest race car, the wind whipping at your face.<br>\r\n<br>\r\n   Natasha casually slips her flip flops back on and walks out of her room and towards the kitchen.  Emitting a morning yawn, she pulls out a chair to sit in, and prepares a bowl of cereal.  She doesn't really have anything planned for today, and so she sits down for breakfast, waiting for you to come over and come up with something fun to do.<br>\r\n<br>\r\n   You'll never get used to this.  You're trying not to throw up as the rocketship of a foot throws you up and down, up and down, flying forward and then stomping on the ground.  Her toes never seem to lose their grip and with each step, the flip flops slam unto the underside of her foot so hard, the entire area quakes.  Before you know it, she has finally stopped!  She pulls out a chair and sits down at her kitchen table.  As you take a sigh of relief, you shoot off into the sky again with her foot.<br>\r\n<br>\r\n  Natasha had crassed her legs, and is now dangling her flipflop by her big toe.  Unfortunately, that is the exact same sandal you were riding.  You are still pinched inbetween her toes, but if you don't do something soon she may just flex and it would be a freefall to the floor.  As uncomfortable as this is, the floor is honestly more dangerous.  You would rather be squeezed and taken on a roller coaster ride than to be stepped on and squished flat underneath your giantess girlfriend's soles.  Then it happens!  Her grip begins to loosen and you feel yourself slipping!  This tiny meaningless fidget to her almost dislodged you to almost certain death!<br>\r\n<br>\r\n  Of course, now her toes aren't so securely wrapped around you.  You are practically holding yourself up and have to make a decision.  Should you attempt to climb her now that she is relatively still, or just stick it out with her toes and not risk falling.</span></div></div>",
            "created":1250744400,
            "id":747362,
            "title":"Sticking with flip flops"
        },
        "1221":{
            "author_id":"ijirashii",
            "author_name":"Iji",
            "choices":[
                " Natasha sits down to read her book!",
                "The phone rings!"
            ],
            "content":"<div class=\"\"><div> <span> You've seen her sitting a million times, and you can't recollect her ever being this still.  Without wasting a minute, you pull yourself up and manage to swing your legs up and over to the topside of her toes.  Her foot is resting in the air at a steep angle, her leg crossed over the other.  Thinking quickly, you allow yourself to slide down to her ankle.  You know it to be a matter of minutes before she'll start fidgeting again, and so you begin to climb the night invisible threads in her jeans.  Its actually a lot easier to climb than a ladder, but a fall from her could mean death to you.  Mayhap gravity won't pull you down that hard, or maybe your denser molecular structure would be more supportive, more endurable.. then again, you only know GTS story speculation and aren't willing to try out the crack-pot theories.<br>\r\n<br>\r\n     You have been steadily climbing for almost ten minutes now, and despite the occasional shifts and movements, you have made a lot of progress, relatively speaking.  You had fortunately made the right decision, for as soon as you venture up the steep area just below her kneecap, you feel the ground and entire leg quake uncontrollably.  Natasha has started bouncing her leg!  Your journey now is more horizontal, but the trembling ground makes it harder to stay standing.  You hear what sounds like a plan crash without the explosion, and then more fidgeting.  The fidgeting turns more violent and you are forced to hold onto the threads for dear life.<br>\r\n<br>\r\n  Natasha had begun absently bouncing her leg and swinging her flipflop as she went about her morning meal.  When she finished, her flexing toes accidentally dropped her sandal!  She uncrosses her legs and slips her flipflop back onto her foot before standing up.  Casually, she puts up her dishes and heads towards the living room.  With no plans and it still being early morning, she decides that now is a good time to catch up on her reading.  She picks out a romance novel she is in the middle of, and heads towards the couch.  With the book in her left hand, she smiles while swaying her arms slightly in glee and anticipation for a passionate chapter or two. <br>\r\n<br>\r\n  The world goes by in a blur! You are holding onto the jeans as tight as you can, placed somewhere between her knee and waist.  As the world lurches and leans, slows and hastens, and just about gives you a headache from all the rapid movement, you barely notice that the giant woman has grabbed a book.  Normally this wouldn't be a big deal, and even tiny-sized you might could see it as a bug-squasher, but you never expected what was to come.  As your gigantic girlfriend neared the couch, her swinging arm allows the book to brush against you, tearing you away from the jeans and sent flying!!<br>\r\n<br>\r\n    You land with a hard thud, yet the ground gives away just a hint.  You feel like your bones should be broken, and despite the massive amount of pain and swellings they're miraculously intact.  You are on your stomach, rising up to stand and wondering where you are exactly when the giantess turns in front of you.  You look up to see Natasha's eyes flicker past you, then her entire body turns until only her backside is showing.  Unfortunately, you have landed on the couch. \"Oh God....\" is all your breath allows you word before a shadow falls above you.  </span></div></div>",
            "created":1251855900,
            "id":754121,
            "title":"  You attempt to climb Natasha"
        },
        "12211":{
            "author_id":"obliviousnat",
            "author_name":"obliviousnat",
            "choices":[
                "you  head up a leg",
                "climb up the booty"
            ],
            "content":"<div class=\"\"><div> <span>You try to run but Natasha's gigantic ass comes to rest upon the couch, and you, before you get far. You've always loved her plump rump but right now it's too much to handle. You find it hard to breathe underneath all the pressure. But you manage to suffer through it. You thank the gods when she finally shifts her giant frame into a different position. Now you can breathe easier.<br>\r\n<br>\r\nNatasha enjoys her novel thoroughly. She is so wrapped up in the heated chapters that a shift in position goes unnoticed, causes no distraction. She reads for about an hour before getting up to fix herself a tasty beverage.<br>\r\n<br>\r\nFREEDOM. You run to the other side of the couch. The great and terrible beauty bounds back to the couch and resumes her reading. Now's your chance to continue the climb.<br>\r\nwhere do you go?</span></div></div>",
            "created":1252991760,
            "id":760724,
            "title":" Natasha sits down to read her book!"
        }
    },
    "info":{
        "author_id":"ijirashii",
        "author_name":"Iji",
        "brief_description":"You shrink to half an inch tall in your girlfriend's apartment!",
        "created":1249507980,
        "description":"<td align=\"left\" class=\"norm\">-Plot!-<br>\r\n<br>\r\n     You're girlfriend Natasha is a hot mixed 21yr old who lives alone in her apartment.  She is a very sweet yet sexual woman.  After the two of you got serious, you explored all your shrinking fetishes with her, and she loved it.  She would tell you stories about what she would do to you, and even confessed that though the idea never occured to her before, such power from being a giantess and knowing that any kind of torment she used on you would only turn you on... well, it gets her turned on more than anything else. She loves licking her lips at you and telling you how she would rape you with her tongue, and many other things.  Of course, she truly is the sweetest girl in the world, its just a shared fetish that you both love.  You've went over a million different scenarios and they are all pretty similar.  \"No baby, I never actually wanted to shrink!  It just happened!  Its scarier than I fantasized and everything hurts, please we have to get me back to normal!\"  Of course, you never mean it when you're fantasizing, but she knows this.  She loves to hear you beg and knows that if you did shrink, it would be no coincidence, and she would do everything to you.<br>\r\n<br>\r\n   Yeah, its a good life.  You're in love, and shes in love with you.  One early morning you decide to suprise her and sneak into her apartment with your spare key.  You slide into her room, the lights still off, when suddenly you shrink to half an inch tall!!!!  How can you get her to noticed you, and even then, will she believe your story?  <br>\r\n<br>\r\n<br>\r\n--------<br>\r\n<br>\r\n-Characters!-<br>\r\n<br>\r\nYou- You're you.  This is an 18+ story so you're at least that.  =D<br>\r\n<br>\r\nNatasha- Your girlfriend.  She is 21, she is a very light caramel color (shes mixed) and absolutely beautiful.  She keeps herself well pampered, she has big boobs, pouty luscious lips, beautiful brown eyes, smooth skin, and her biggest asset is her ass.  Its completely disproportionate to the rest of her body and you love it!  She stands 5'4'', a little on the short side but... yeah, not for long.<br>\r\n<br>\r\n  (Yeah, obviously we didn't want to be too descriptive on what she looks like for privacy sakes, -but- here is a link to a picture of someone very-very close to what she looks like. Story-wise, yeah this is her:  <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.yorapper.com/Photos/vanessa-veasley.jpg\" target=\"_blank\">http://www.yorapper.com/Photos/vanessa-veasley.jpg</a>   )<br>\r\n<br>\r\nKita- Your girlfriend's long-time friend that she hasn't seen in ages! She came into some money and moved away a few years ago ,and since then has become somewhat of a snob.  She gets what she wants, and isn't afraid to take.<br>\r\n     (image - <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://static.hometheaterforum.com/imgrepo/b/b6/htf_imgcache_17790.jpeg\" target=\"_blank\">http://static.hometheaterforum.com/imgrepo/b/b6/htf_imgcache_17790.jpeg</a>    hillary Tuck irl, can anyone guess where she's from?)<br>\r\n<br>\r\nMore characters can be introduced later.  This is actually a story I'm writing with my girlfriend, but anyone who wants to create extra characters are more than welcome!<br>\r\n<br>\r\n****UPDATE****<br>\r\n<br>\r\n  So... its been a long while since this was updated.  Natasha and I have been really busy lately.  I know that sounds life, but real life comes first 'eh?   Anyways, just poking around I noticed that for only 20 chapters (as of writing this), I have 4,501 views.  Wow.  Guess that means 'tasha n I will be writing again soon.  Thanks for the reviews/comments/additions.  Sorry if one or three were deleted/edited. &gt;.&gt;<br>\r\n</td>",
        "id":1588516,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1407825600,
        "modified":1407825600,
        "pretty_title":"Honestly, It's A Coincidence!"
    }
}