{
    "chapters":{
        "1":{
            "author_id":"commiemao",
            "author_name":"Bmao",
            "choices":[
                "Is jumping out the window",
                "Puts his hands over his head",
                "Praying to an altar",
                "Fights to the end",
                "Is nowhere to be found"
            ],
            "content":"<div class=\"\"><div> <span>You lifted your M16A2 rifle and fired down the streets of Fallujah. A jihadist fell clutching himself. Despite being Arab-American yourself, you held no sympathy for the cause they had pursued. Besides, all their efforts were going to naught anyhow, and things were looking good. The Iraqi government was stable, the insurgency was dying, heck, even the Saudis had lowered gas prices.<br>\r\n<br>\r\n\"Nice one Jawad!!\" screams your friend, grenadier Derrick 'bucktooth' Flosser as he reloaded his rifle.  Sergeant Lim, squad leader of delta team, interrupted the conversation. \"Keep at it men!! We got Zarqawi surrounded!! Once he's dead we get to go home men!!\" He was one to respect, despite being a unimposing Asian. Many had ridiculed him for his high-pitched, squeaky voice, only to discover how much of a mistake that was. <br>\r\n<br>\r\n\"Allah abu Ackbar!!\" screamed a voice. An insurgent emerged from a hole, holding an RPG over his shoulder, but right before he could fire, a friendly C130 bombed it into a nothing. You breathed a sigh of relief. <i>One more thing that'll haunt my dreams tonight</i><br>\r\n<br>\r\n\"Phew, gotta thank the airforce boys for that one, thought he had us for a second\" said bucktooth Flosser, grinding his already crooked teeth. \"Shut up bucktooth, I don't wanna think about that\" the automatic weapons man, Jacob Riddler, scowls deeply. Nobody messed with him, and his being black was only a small reason behind it. To your side, you notice sergeant Lim checking his electronic locating device.<br>\r\n<br>\r\n\"Recon indicates Zarqawi is holed up in a police station just a block north from here\" Lim explained. You brimmed with angry anticipation, becuse of him, many of your comrades had died, and now you could finally pay back the favor. <i>One shot in the head, and President Bush gives me 500 grand a year for the rest of my fucking life...</i><br>\r\n<br>\r\nAfter Lim gave his orders, your squad moved forth, massacring all insurgents who stood in your path. Upon arriving at the police station, Riddler kicks down the door and fires a burst inside the building, bellowing like a rhinocerous. You and the rest of the guys follow right behind him, gunning down those who survived.<br>\r\n<br>\r\n\"Don't give them time to regroup!! Up to the second floor!!\" Lim orders. You lean against the stairway and toss a grenade through the doorway. A second later, a chorus of screams erupts from the room above. <br>\r\n<br>\r\nNo sooner does it explode when the team rushes up the stairs firing. The terrorists resist to the end, but their efforts do not stop the team. <br>\r\n<br>\r\n\"Okay guys, there's only one more room in the station, Zarqawi's gotta be in there!! Move it!!\" Sergeant Lim orders.<br>\r\n<br>\r\nYou kick down the door, and before you, Zarqawi...</span></div></div>",
            "created":1123632240,
            "id":266546,
            "title":"Here we come Zarqawi!!"
        },
        "13":{
            "author_id":"commiemao",
            "author_name":"Bmao",
            "choices":[
                "Shoot Zarqawi",
                "Ask, what does he want?",
                "Run like hell!!",
                "The squad attempts to capture him.",
                "Shoot the Koran out of his hands"
            ],
            "content":"<div class=\"\"><div> <span>\"Put your hands over your head!!\" you scream in Arabic, your voice echoing through the walls of the barren room.<br>\r\n<br>\r\nZarqawi, bent before an a miniature statue of mohammed, holding the Qoran in his left hands, continues to utter a prayer as if there weren't any Americans pointing guns at him.<br>\r\n<br>\r\n\"Oh my great Prophet Mohammed, grant me the strength to vanquish the infidels who defile our lands, slay the jews who tarnish our holy soil...and feed them to the devil!!\" he prays in a hushed Arabic voice. Your comrades, unable to understand Arabic, simply gape in shock.<br>\r\n<br>\r\n\"I will not say it again!! Put your hands over your heads or we will shoot!!\" you repeat, inching closer.<br>\r\n<br>\r\nJust then, Zarqawi turns his head to face you. His eyes are glowing, an aura of energy is emanating from his body, as if caught in a exploding nuclear reactor. In one arm he holds an AK47, and the other arm holds the Koran as he stalks forward.<br>\r\n<br>\r\n\"What the hell? What just happened!!\" bucktooth blabbers.  You weren't sure, but you knew something was seriously not right. Normally, people didn't glow like that... not even in Angels and Demons...</span></div></div>",
            "created":1123634160,
            "id":266548,
            "title":"Wait, this ain't right"
        }
    },
    "info":{
        "author_id":"commiemao",
        "author_name":"Bmao",
        "brief_description":"You are fighting the insurgency in Iraq, but then Islam decides to take revenge...",
        "created":1123630080,
        "description":"<td align=\"left\" class=\"norm\">You, an Arab-American soldier named Krunal Jawad, and are fighting in Iraq against the insurgency. Jihadists of Al-Zarqawi are everywhere, fighting to defend their last stronghold. Victory seems close at hand, and maybe you could finally come home. Yet out of nowhere, the prayers of the radical islamists are answered when Muhammed himself rises from the ashes to unite all Arabs revenge on the infidels. <br>\r\n<br>\r\nSuddenly, America finds itself fighting a global war not only against a united Arabia, but also a spiritual war against yourself, for you are considered a traitor of Islam, and what worse enemy do the radical jihadists have then America?<br>\r\n<br>\r\nOne things for sure, that #2 Al Queda dude wasn't bs-ing when he said tens of thousands of Americans would die if they didn't leave Iraq soon.<br>\r\n<br>\r\n[Note, this interactive does not reflect my views in Iraq, nor would I ever wish this to occur to our troops. This is merely a fantasy and if you are offended by it then I am sorry] </td>",
        "id":999705,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1123634160,
        "modified":1123634160,
        "pretty_title":"Jihad strikes back"
    }
}