{
    "chapters":{
        "1":{
            "author_id":"ctopher",
            "author_name":"Lidort",
            "choices":[
                "High school nerd",
                "A personal trainer",
                "Worker who just got laid off",
                "A group of guys who finished a D&D campaign ",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You’ve walked by that empty store spare so many times you lost count. It used to be a blockbuster before everyone started online streaming. Now there is something there and it is the last thing you would think would go there a bakery. The sign says ‘Lidort’s Bakery: Baked goods that will transform your life!’<br>\r\n<br>\r\nYou glance at the large window in front of the store and you see the large display with the slanted shelves in front, showing off all the delicious baked goods which just make your mouth water. You stare at the cinnamon pastries and the raisin bread along with all the huge chocolate chip cookies which are just too much to bear. No, you just HAVE TO go inside now.  You just have to buy something in the store because it just seems like a crime to walk past the store without trying something. <br>\r\n<br>\r\nYou push the door open and walk in and right away you are greeted by a nice, friendly man behind the counter who smiles as you stare at the large board hanging from the wall which lists all the items and all the prices. All the prices are affordable so that won’t be an issue. So what will you order? <br>\r\n<br>\r\n(But first who are you?)</span></div></div>",
            "created":1510844040,
            "id":2416009,
            "title":"New Bakery"
        }
    },
    "info":{
        "author_id":"ctopher",
        "author_name":"Lidort",
        "brief_description":"A new bakery has opened up selling great tasting pastries with interesting side effects.",
        "created":1510843620,
        "description":"<td align=\"left\" class=\"norm\">Lidort's bakery is a place where you can eat something tasty and end up getting buff instead of fat. Most pastries involve muscle growth in some form. The customers tend to be male.</td>",
        "id":2140886,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1510844040,
        "modified":1510844040,
        "pretty_title":"Lidort's Bakery"
    }
}