{
    "chapters":{
        "1":{
            "author_id":"up2nogd1",
            "author_name":"Lvmsclgrls",
            "choices":[
                "Head to her room to try the device",
                "Sit down and show it to Erin and Leah",
                "Head over to see Josh",
                "Go for a walk outside",
                "RESERVED by author"
            ],
            "content":"<div class=\"\"><div> <span>Grace walked down the hallway toward her first floor apartment room, her long dark hair clipped in the back, but it was still messy.  She had on a loose fitting dark sweatshirt, jeans and some athletic shoes.  Her backpack was swung on her left shoulder as she was getting back from her morning classes.<br>\r\n<br>\r\nGrace pulled out her keys and opened the door.  Walking into the hallway, she dropped her keys in a bowl and tossed her backpack to the side.  She slipped off her shoes and turned into the kitchen.  A package was sitting on the table and Grace looked at it to see it had her name on it.<br>\r\n<br>\r\nGrace peaked out of the kitchen into the living room.  Erin was sitting there in gray sweatpants and a loose pink sweatshirt eating a bowl of cereal.  Grace looked around the room.<br>\r\n<br>\r\n“Where’s Leah?  Doesn’t she have class next hour?”<br>\r\n<br>\r\nErin looked up.  “No, not today.  We don’t a class until later this afternoon.  She’s still in bed.”<br>\r\n<br>\r\nGrace thought about that for a moment and shrugged her shoulders.  “When did this package arrive?”<br>\r\n<br>\r\nErin continued to eat her cereal and watch TV.  “About an hour ago.”<br>\r\n<br>\r\nGrace turned back into the kitchen and pulling out some scissors from the drawer opened it up.  She pulled out a small device with a keypad and a small window.  It looked like a Blackberry.  She pulled out the paper and read it.<br>\r\n<br>\r\n“Dear Grace.  You were always the kindest person in our family.  You always called me on my birthday and gave me Christmas presents even though you knew how rich I was.  You visited as often as you could when I was sick and for that I am forever grateful.  As you are receiving this gift I have unfortunately passed away.  This device holds great power and should be used with care.  But it also can give you the opportunity to do things you never dreamed possible.  Make sure to have fun, but to keep things in perspective.<br>\r\n<br>\r\nIn short the device is a link to alternative universes.  You have the ability to make changes that can either drive you to another universe or make changes to this one.  Be aware of the sphere of influence as you can pull others along with you.  I know this sounds crazy, but be assured, it is very real.  I won’t bore you with origins of the device, but it can do whatever you would like.<br>\r\n<br>\r\nLove, Aunt Susan”<br>\r\n<br>\r\nGrace could hardly believe what she was looking at.  Could this really be true?  She could do anything she wanted.  Maybe go anywhere as well.  But Grace was as practical as her aunt.  She would need to be careful.  At least that was her initial thought.  Looking at the device she found the “On” button and started up the device.<br>\r\n<br>\r\nThe screen lit up and the word “Calibrating” blinked on the screen.  The date and time then came up and a small red light shined briefly.  The screen then said, “Welcome Grace Swanson.”<br>\r\n<br>\r\nSome type of default screen then came up and Grace noticed the menu included tabs such as Historic Change, Sphere of Influence, and Alternate Universes.  It was enough to make her head spin.  Sighing, she saw a small Help Icon and moving the pointer toward it, was a bit disappointed when she read the short descriptions.<br>\r\n<br>\r\nHistorical Change.  Make a change that occurred in the past, thus potentially changing the present.  The historical change can also be set to zero so the effects occur in the present.<br>\r\n<br>\r\nSphere of Influence.  Making changes either historically or making changes that drive to alternate universes or affecting alternate universes can include the user of the device or others.  Memories will be affected accordingly or as defined.  In addition, attitudes and emotions can be changed.<br>\r\n<br>\r\nAlternate Universes.  Review the basic designs of alternate universes and find a different you.  You can then insert yourself there, explore the differences and make changes.<br>\r\n<br>\r\nThere were a few warnings attached at the end, but no real instructions.  Apparently the only way she was going to see if it actually worked was to try it out.<br>\r\n<br>\r\nPicking up the device, she walked into the living room.  Leah stumbled into the same room from the other direction where the bedrooms were and plopped down on the couch next to Erin.  She had on shorts and a t-shirt and her long blonde hair was a mess.  She wasn’t wearing a bra and her large breasts pushed out against the material of her shirt.  Grace sighed at the sight.  Were those things filled with anti gravity material?  Leah looked up at Grace.<br>\r\n<br>\r\n“What’s going on?”<br>\r\n<br>\r\nGrace paused.  Should she tell her roommates about the device or should she just head into room to try it out alone?  Grace thought about how much she’s like to show it to Josh as well.  On the other hand, if it was some type of alternate universe device, perhaps she should go for a walk and see what could happen with it.<br>\r\n<br>\r\nSmiling back at Leah, Grace decided to:<br>\r\n</span></div></div>",
            "created":1357448400,
            "id":1503247,
            "title":"The Device is Delivered"
        },
        "11":{
            "author_id":"up2nogd1",
            "author_name":"Lvmsclgrls",
            "choices":[
                "Stick to the normal results",
                "Ensure a high end fitness body",
                "Go for the bodybuilding babe",
                "Become a Supergirl with massive muscles",
                "Change her roommates as well"
            ],
            "content":"<div class=\"\"><div> <span>Grace smiled at Leah.  “Oh nothing much.  I just got back from class.  My aunt left me her old Blackberry.  I was going to check it out in my room for a while.”<br>\r\n<br>\r\nLeah yawned and nodded her head.  Erin looked up and smiled.<br>\r\n<br>\r\n“No problem, we need to change anyway.  Maybe we can get some lunch somewhere soon.”<br>\r\n<br>\r\nGrace smiled and shook her head at the fact that Erin was currently eating.  “Sure, that sounds like fun.”<br>\r\n<br>\r\nWith that Grace walked into her room and shut the door behind her.  She sat down at her desk and began to think about what she could do.  To test it out it would be best to try something simple to start.  That would at least seem prudent.  So without really knowing what would happen, Grace punched the Historical button and she was a bit surprised when the screen came up with nothing more than “Enter Description of Desired Change”<br>\r\n<br>\r\nGrace sat back and smiled.  She wasn’t prepared for that.  Looking down at her blue socks, she looked back at the screen.  Keep it simple to start.<br>\r\n<br>\r\nShe typed in “I put on white socks this morning instead of the blue socks.”  She shrugged her shoulders and hit Enter.<br>\r\n<br>\r\nThe screen went blank for a moment and came back up.  “Related changes to this universe negligible.  Hit Enter again to make change.”<br>\r\n<br>\r\nGrace looked down at her socks again, looked at the screen and with another shrug, hit Enter.  A quick bright light caused her to shut her eyes.  Blinking slowly she looked around and everything looked the same.  Almost not wanting to look at her feet, she slowly tilted her head down.  Her socks were white.<br>\r\n<br>\r\n“No Way!”<br>\r\n<br>\r\nShe sat back in her chair, her head spinning.  So many opportunities, so many things to change.  Looking at the poster on her wall of an 80’s Era Rachel McLish, Grace looked at her own arm.  She had signed up at the gym but had only gone a few times.  Gaining any muscle would be a challenge.  Smiling, Grace looked at the device again.<br>\r\n<br>\r\n“If this thing can change my socks, I wonder if it can change me.”<br>\r\n<br>\r\nShe rubbed her chin and thinking for a moment, hit Historical Again on the device and started typing.  “I started working out with weights a year ago.  I worked out at least 5 days a week and grew stronger and more muscular.”<br>\r\n<br>\r\nGrace paused as she knew she wasn’t being very specific, figuring this would test the device.  She also knew that she could cancel out if it gave an undesirable response.  So when she hit enter, this time there was more of a delay.  The device came back with an expected follow up.<br>\r\n<br>\r\n“Define stronger and more muscular.  Note that the device can take your body type and create a normal progression based upon your DNA.  However, more dramatic changes are possible, but with a related historical change and the possibility of a shift or creation of an alternate universe.”<br>\r\n<br>\r\nGrace smiled.  So that’s how this thing works.  You can make adjustments to keep things in perspective.  She suspected that’s how her Aunt did so well in life, but now she had to wonder why she didn’t do more, or why she didn’t figure out a way to cheat death.  Scrunching her small nose as she normally did when she was thinking through a tough problem; Grace took her time before she began to type again.  As she typed, Grace knew she was about to start an adventure and hopefully have a little fun.<br>\r\n<br>\r\nSo with a smile on her face, Grace decided to:<br>\r\n</span></div></div>",
            "created":1357448400,
            "id":1503249,
            "title":"Head to her room to try the device"
        },
        "113":{
            "author_id":"gunslinger1999",
            "author_name":"GrowingNikki",
            "choices":[
                "No changes yet. Grace goes with the flow. ",
                "Change Erin's past so she started working out with Grace a year ago.",
                "Change Leah's memories so she is interested in female muscle too."
            ],
            "content":"<div class=\"\"><div> <span>Grace started typing then stopped. Her original intent was to just see what kind of body she would have naturally acquired over the past year of exercise, but then she began to wonder how far she could push things. Why settle for merely fit when she could push some limits? After all, wouldn't it be beneficial to see what changes resulted from a rather large change? It was purely scientific, Grace told herself. If she didn't like the results or the changes were too drastic she could always return things. Couldn't she?<br>\r\n<br>\r\nGrace thought for a few moments and then decided to define what \"stronger and more muscular\" meant:<br>\r\n<br>\r\n “I started working out with weights a year ago. I worked out at least 5 days a week. From that time to now I added 110 pounds of muscle and increased my strength by ten times.\"<br>\r\n<br>\r\nGrace read over the last sentence a few times then shivered with excitement. She knew that doubling her body weight was pretty extreme. She wasn't sure, but she was fairly confident that would make her bigger than any other woman out there. This clearly went well beyond her original goal of enhancing her body to Rachel McLish proportions, but the chance to out grow every other woman alive was too good to pass up. Even more exciting than her impending size was her strength. As painfully thin as she was now she could manage to curl 25 pounds in each arm, but she was about to be able to handle 250 pounds instead. She'd been impressed at her ability to bench press 70 pounds for several reps, soon she'd be pressing 700 pounds.<br>\r\n<br>\r\nWithout another moments hesitation Grace pressed enter on her new device. It processed for a bit longer than it had with her change of socks, but after a few seconds the screen said, \"“Related changes to this universe minimal. Press Enter again to make change. Press See More for details of changes.\" Grace quickly pressed Enter. A moment later her vision was once again filled with blinding white light.<br>\r\n<br>\r\nAs her eyes readjusted and her vision cleared Grace felt energized. She could actually feel her new power flowing through her body; she couldn't remember the last time she'd felt so good. Then she looked down and felt even better.<br>\r\n<br>\r\nHer chest was now a 7 inch thick wall of pure muscle and blocked her view of the rest of her new body. Fortunately Grace found that she now had a full body mirror attached to her wall which gave her the full view. She was enormous. Just as she had guessed 220 pounds at her height of 5' 9\" made her bigger than any other woman out there. She wore a pink t-shirt that was tight ebough across her wide shoulders and pumped pecs that the outline of her sports bra was clearly visible. The bottom of the shirt had been torn off so that her deeply cut abs were displayed. Grace marveled over these running her fingers through the deep grooves in the six solid bricks on her tummy then over the piano key bumps that were her obliques. Next Grace raised one of her arms and flexed her mighty bicep. Her arm swelled to such incredible size that Grace couldn't believe it was her own. For a second she wondered how big it was but then she knew.<br>\r\n<br>\r\n\"21 and three quarters inches.\" She said aloud. \"I just measured them five days ago.\" But that wasn't possible, she'd only just grown into this body moments ago. However she could clearly remember all the hard work she had put in over the last year. She remembered the laughs and snickers at the gym when she first arrived and started working with the weights. She remembered how the laughter stopped after a few months when her body began swelling rapidly and her strength shot through the roof. She could remember having to buy new clothes frequently and the joy of exploding right out of old ones.<br>\r\n<br>\r\n\"This is so weird. It's like the last year of my life was all some movie that I just watched. Except it's real.\" Grace ran her hand over the giant peak and gave the plump muscle a hard squeeze. There was no give at all.<br>\r\n<br>\r\nGrace continued taking stock of her new physique with her legs. She wore black tights that ran from her waist to just above her ankle, but the material was so tight that every groove, every bulge and curve, every vein was clearly visible. She slid her right foot forward and flexed her thigh. The tights began to stretch so much that they became less opaque.<br>\r\n<br>\r\n\"33 inches,\" Grace told herself. \"With 20 inch calves.\"<br>\r\n<br>\r\nGrace was overjoyed. She looked incredible. She felt invincible. And this was only the beginning. She admired the magical device that made her fantasies a reality for a moment before hiding it in her backpack. \"Now, let's go see if the girls still want to have lunch. I want to take this body for a test drive and see how it feels.\"<br>\r\n<br>\r\nGrace, without even thinking about it, picked up a protein shake that was sitting on the bookshelf next to her door and took a long sip. She didn't think its appearance strange because she could vividly remember making it just after arriving home from her morning classes.<br>\r\n<br>\r\nGrace returned to the living room where she found Leah sitting exactly where she'd been before. Grace sat in the easy chair across from Leah and half expected her friend to freak out at the sight of Grace's giant muscles. Instead Leah simply glanced at Grace and returned to watching TV.<br>\r\n<br>\r\n\"How can you drink that stuff?\" Leah asked pointing to the protein shake in Grace's hand.<br>\r\n<br>\r\nGrace shrugged. \"You get used to it. Some flavors really aren't bad at all.\" She took a deep gulp. \"Besides, I love the thickness. I can almost feel the weight of it flowing right into my muscles making them even bigger.\" Grace giggled at the thought.<br>\r\n<br>\r\nLeah rolled her eyes. \"How can you guys be so proud of those ugly muscles. Blech!! You look like guys.\"<br>\r\n<br>\r\nGrace was about to ask what Leah meant by \"you guys\" when Erin emerged from her room in a new outfit ready to head out and find lunch. Grace had to make a serious effort to keep her jaw from hitting the floor. Erin had always been fit from her high school days on the volleyball team, but now she was downright buff.<br>\r\n<br>\r\nErin wore a tiny tank top that left her meaty shoulders and developed arms bare. But it was to Erin's legs that Grace's eyes were drawn. Erin wore denim shorts that showed off her dynamite thighs and gorgeous calves. Each of Erin's legs were coated with thick slabs of sinew that pumped with each step she took. She didn't have the cut or definition that Grace and, nor the size, but there was obvious power in Erin's legs which looked like they'd been transposed from a gymnast.<br>\r\n<br>\r\n\"So, who's hungry,\" the adorable redhead with the killer physique asked.<br>\r\n<br>\r\n\"Didn't you just finish eating?\" Leah asked.<br>\r\n<br>\r\n\"Yeah, I had a snack. Now I'm really hungry. Gotta feed a growing body.\" Erin flexed her 15 inch biceps which popped like baseballs. \"Right, Gracie?\"<br>\r\n<br>\r\nGrace smiled and nodded. She was thinking back over the past year and remembering (for the first time) how impressed Erin had been with Grace's growing muscles. About six months ago Erin had joined her in her near daily work outs and now Grace was witnessing the fruits of her labor. \"You know it. Growing muscles need fuel. I was just telling Leah that myself.\"<br>\r\n<br>\r\nLeah shook her head. \"Ug!! You two!! I'll never understand your muscle fetish.\"<br>\r\n<br>\r\nThe trio gathered their things and left their apartment. As they walked to the diner on the corner they frequented Grace began to think about her next move. A part of her just wanted to enjoy the day and see where her bodacious body took her. Another part of her wanted to see what would happen if Erin had started working out with her right at the start a year ago. How much bigger would she be? Would having a friend with her have made her own growth even more extreme? Lastly Grace wanted to see if she could use the \"sphere of influence\" function to figure out why Leah was so against female muscle. Maybe she could even change her opinion and get her body pumped up as well.</span></div></div>",
            "created":1357966800,
            "id":1506833,
            "title":"Grace the Bodacious Bulging Bodybuilding Babe"
        },
        "1132":{
            "author_id":"atccsc",
            "author_name":"atc",
            "choices":[
                "Continue (Chapter's too long)"
            ],
            "content":"<div class=\"\"><div> <span>At the diner, Grace noticed another side effect of the device’s work; without even ordering the waitress brought Grace her new “usual”: a giant 10 egg white omelette, with a similar 6 egg version for Erin. As she wolfed down her breakfast, Grace decided to see how the rest of the day went before making any other changes.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nGoing to the gym just felt weird. She’d only been there a couple times, but everything felt so routine. When she stepped out of the locker room, she found Erin already waiting for her at the weight benches, waving her over. <br>\r\n<br>\r\nShe counted up the plates on the bar in her head and reeled: 400 pounds.<br>\r\n<br>\r\nEven though she feigned confidence to Erin as she laid down on the bench, inside, Grace was terrified. She’d never done a real bench press before, just once or twice with a machine. And even at her new size this was nearly twice her weight. <br>\r\n<br>\r\nGrace took a deep breath and let instinct take over. She placed her hands precisely where they were supposed to go, and with a small grunt pushed the bar up off the rack and lowered the massive weight onto her chest. <br>\r\n<br>\r\nAnd Grace pushed it back up! And again. And again! Grace grinned as the 400 pound barbell hardly felt heavy at all. So this was what it felt like to be strong. After 12 perfect reps, Grace racked the weight and sat up on the bench.<br>\r\n<br>\r\n“Do you need another warmup set, or are you ready for the real weight?” Erin asked.<br>\r\n<br>\r\nA cocky grin broke across Grace's face.<br>\r\n<br>\r\n\"Let's do this!\"<br>\r\n<br>\r\nGrace pushed out several more progressively heavier sets, each one a bit harder as weight and fatigue took its toll. She started to falter a bit at 675 pounds.<br>\r\n<br>\r\nGrace could feel the burning in her pecs as she struggled through the last couple reps. Grace racked the weight and sat up on the bench, panting and dripping with sweat, Grace was amazed at her fantastic strength, but in the back of her head, she felt... disappointed?<br>\r\n<br>\r\n\"Take an extra minute to rest. I'll add another 10 pounds,\" Erin said, handing Grace her water bottle.<br>\r\n<br>\r\nGrace turned to look at her workout partner in shock. Erin put her hand on Grace's pumped shoulder and smiled.<br>\r\n<br>\r\n\"Don’t worry, I’ll be here to spot you.\"<br>\r\n<br>\r\nIt took four more sets before Erin let her stop, adding a little more weight each time. By then, Grace had grit out 3 reps at 725 pounds, a new personal best.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nGrace laid in her now somewhat undersized bed that night, still marvelling at the weight and heft of her pecs, feeling them bob up and down with minimal effort. It was too bad that she seemed to have lost what little amount of breasts she had, but maybe that was something the device could fix.<br>\r\n<br>\r\nThe device. <br>\r\n<br>\r\nGrace pulled out the small object and reflected on all it had given her. And how much had also come from Erin. Grace typed in a new command:<br>\r\n<br>\r\n<span style=\"font-family:courier new, monospace\">Erin started working out with me from the beginning.</span><br>\r\n<br>\r\nLike before the device said the changes to the universe were minimal. Grace hit enter on the device before drifting off to sleep.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nAs the early morning sunlight filtered in through the blinds, Grace’s thoughts returned to her one by one as she slowly regained awareness on the world around. She noticed how heavy her muscled body felt. <br>\r\n<br>\r\nShe noticed that she had apparently went to sleep in the nude, which was something she never did. <br>\r\n<br>\r\nShe noticed that her normally shoulder-length hair was hanging down in her face, obscuring her vision.<br>\r\n<br>\r\nShe noticed that her bed felt bigger and softer than it should’ve.<br>\r\n<br>\r\nAnd she noticed that she wasn’t the only person in her bed.<br>\r\n<br>\r\n“Morning, lover.”<br>\r\n<br>\r\nA hand pushed aside Grace’s stray bangs as Erin leaned in for a passionate morning kiss.<br>\r\n<br>\r\nGrace tried to move, but her arms were tangled up in the plush duvet that now covered her bed. She wasn’t into girls and neither was Erin. What the hell is going on?!<br>\r\n<br>\r\nAs her roommate's tongue pushed past her teeth Grace felt an odd familiarity, like this was normal. She felt her resistance soften as she found herself kissing back.<br>\r\n<br>\r\nThe now queen-sized bed creaked as Erin shifted around until she was straddling Grace’s hips.<br>\r\n<br>\r\nGrace’s eyes widened in shock. Erin was huge! At least as big as Grace was yesterday, if not a little bigger.<br>\r\n<br>\r\n“Oooh! I love seeing you first thing in the morning. Your abs are just a little bit tighter then.”<br>\r\n<br>\r\nGrace couldn’t even see her abs over her massive pecs, but she could feel Erin’s fingers run over the hard ridges on her stomach. Erin rocked her hips. Smooth, freshly-shaven skin tugged at Grace’s labia, sending tingles of pleasure up her spine.<br>\r\n<br>\r\nGrace arched her back in response, taking in the new body of her new lover. With the additional 6 months of training from the device Erin was easily as big as Grace. Erin noticed Grace’s glances and gave her bulging arms a playful flex.<br>\r\n<br>\r\n“22 inches as of yesterday,” Erin said before dropping her head with a coy smile.<br>\r\n<br>\r\n“But no matter how hard I work, I can never seem to catch up to you.”<br>\r\n<br>\r\nAnd just like before, new recollections of Grace’s measurements popped into her head. The one that came to the forefront was her arms: “26 inches cold, 27 pumped.”<i> Was that true</i>, she thought. Was she bigger too?<br>\r\n<br>\r\nSuddenly, scores of new memories from the past year flooded into Grace’s mind. Their first day at the gym. Trying to figure out the machines. The soreness of those first few weeks. How they celebrated when their abs first started to show. <br>\r\n<br>\r\nIntense, late night workouts. Gorging on protein bars and shakes. Urging Erin on through grueling bench presses. Sitting on each other’s backs while grinding out calf raises. The conversations between sets.<br>\r\n<br>\r\nThe awkward first kiss. Eventually taking it farther and farther over the weeks until they’d made it official and started sleeping in the same bed about four months ago.<br>\r\n<br>\r\nGrace was snapped out of her spontaneous recollection by the alarm on Erin’s phone.<br>\r\n<br>\r\n“Oh, dang. We’re gonna be late.“<br>\r\n<br>\r\nGrace looked to the clock. It’s 6 am. They didn’t have class for four hours.<br>\r\n<br>\r\n“C’mon. I know how long it takes to work your legs. If we don’t hurry, you won’t get a good pump before we have to go to class,” Erin said, nudging, Grace out of bed. “Now, hurry up and get changed.”<br>\r\n<br>\r\nErin slipped on a robe, picked out some clothes for Grace and tossed them on the bed before heading to the kitchen. Grace finally escaped the mass of sheets, bedspreads and fluffy pillows that had confined her. She could instantly tell she was heavier as she stepped over a full length mirror that was now in <span style=\"text-decoration:line-through\">her</span> their bedroom.<br>\r\n<br>\r\nGrace gasped in amazement. She was definitely bigger than yesterday. Additional pounds and inches of muscle bulged out in all direction, making her look like she was carved out of granite.<br>\r\n<br>\r\nThe next thing Grace noticed was that she now had a light tan. She could clearly remember arguing with Erin about the dangers of tanning. And how Erin had won her over by telling her how great it would make her abs look. And now that Grace could see them, she had to admit, Erin was right. As Grace shifted her hips, her deeply etched 8 pack and thick obliques looked amazing, especially offset by her meaty glutes and 38” thighs.<br>\r\n<br>\r\nGrace’s hair was also at least 3 inches longer than she normally wore it. Before she could even question it, the answer bubbled up into Grace’s mind; “Erin likes it longer.”<br>\r\n<br>\r\nGrace wriggled into the tiny bike shorts and sports bra Erin had laid out for her. For some reason the barely adequate clothing felt completely normal. Grace pulled her lengthened locks into a ponytail, marveling at the cantaloupe-sized bicep that twitched to life with the slightest flex and her massive wing-like lats that pushed her arms away from her torso. She was truly gigantic.<br>\r\n<br>\r\nGrace slipped into the bathroom and stepped on the scale to see the true measure of Erin’s assistance. <br>\r\n<br>\r\n260. Erin’s help had netted her another forty pounds of muscle.<br>\r\n<br>\r\nGrace stepped out of the bedroom and into the kitchen. Without saying a word, Erin handed her a huge protein shake and stole a kiss on her way to get changed herself. As she took a pull on the thick chocolate shake, Grace finally noticed Leah sitting at the kitchen table, nursing a cup of coffee and looking generally haggard.<br>\r\n<br>\r\n“Um... morning. uh... late night?”<br>\r\n<br>\r\nLeah just sat a glowered at her for several seconds before speaking.<br>\r\n<br>\r\n“You know, you two can have all the freaky muscle sex you want, but can you at least try to keep it down during the week? I bet I’m not the only in the neighborhood you’re waking up every night.”<br>\r\n<br>\r\nBefore Grace could respond, Erin stepped out of the bedroom wearing an identical outfit as Grace. Grace gulped down the rest of her shake a headed out the door with the gym bag Erin had already packed for her.<br>\r\n<br>\r\nGrace stepped outside and received another shock. Her car was gone! <br>\r\n<br>\r\nBefore she could fully panic, Grace again got that feeling that this was normal. She took a deep breath and thought, searching for a new memory to explain this. And there it was. Grace and Erin had both sold their cars a couple months ago in order to cover supplements and other expenses like the fancy new bed.<br>\r\n<br>\r\nGrace turned around to see Erin’s smiling face as walked up wheeling a pair of heavy duty mountain bikes.</span></div></div>",
            "created":1372914000,
            "id":1622388,
            "title":"Change Erin's past so she started working o..."
        },
        "11321":{
            "author_id":"atccsc",
            "author_name":"atc",
            "choices":[
                "Make more adjustments to Grace and Erin’s histories.",
                "Alter Leah’s history and make it a threesome."
            ],
            "content":"<div class=\"\"><div> <span>The three mile bike ride up the steep campus hills should’ve been hell, but with Grace’s new body it was barely enough to work up a sweat. And even if it wasn’t so easy, Erin’s spandex-clad ass was ample encouragement to push onward. By the time they got to the gym, Grace’s legs were good and warmed up.<br>\r\n<br>\r\nWith Erin’s encouragement, Grace pounded out set after set of every leg exercise the well equipped gym had to offer. As Grace rested and sipped a protein shake between sets, Erin quietly went to work with sets of her own; notably lighter than what Grace was moving, but still more than anyone else in the gym could ever manage.<br>\r\n<br>\r\nAfter nearly two hours of torture, Grace was screaming her way through one last set of squats. The whole gym looked on and cheered as she racked a new personal best: 3000 pounds! <br>\r\n<br>\r\nGrace walked on wobbly legs to the locker room to get ready for class. Erin insisted on measuring Grace’s quads while they were still fully pumped. She pulled her trusty measuring tape around Grace’s blood-engorged tree trunk thigh, letting out more and more slack as she went. As she pulled the tape tight, Erin dropped her head in shame.<br>\r\n<br>\r\n39⅞” I’m so sorry.  <br>\r\n<br>\r\nBefore Grace could even react, Erin wrapped her powerful arms around Grace’s waist in an apologetic hug.<br>\r\n<br>\r\n“We’ll get it next time. I promise.”<br>\r\n<br>\r\nGrace was speechless. Erin had pushed her farther than should be humanly possible, and here she was apologizing for not being able to give her more. Even if it seemed new and weird, Grace could feel genuine love welling up in her heart.<br>\r\n<br>\r\nWithout saying a word, Grace scooped up Erin’s 215lb. frame in her arms and kissed her on the forehead.<br>\r\n<br>\r\nEvery head turned as the couple strutted across the campus quad. Grace hadn’t even thought to look at what clothes Erin had packed for her to wear to school. Before, Grace would have been self conscious in such a flimsy tank top and mini skirt, but now that she had this body, she was going to flaunt it.<br>\r\n<br>\r\nEven weak and heavy with fatigue, the feeling in Grace’s legs was euphoric. Every muscle fiber was pumped to the limit, forming clear separation between the muscle groups in her hamstrings and quads. Her ass, as round and firm as two halves of a basketball, swayed under the sheer fabric. Erin even packed a pair of high heels to fully show off Grace’s bulging 25” calves.<br>\r\n<br>\r\nThose who didn’t stare in awe or lust simply turned away from sheer intimidation.<br>\r\n<br>\r\nAs the day wore on, Grace noticed another unexpected change. Grace and Erin used to only share one or two classes together. Now their schedules were identical. Grace could remember classes she’s never actually taken, and just like now Erin was always by her side, taking notes and silently handing passing Grace a protein bar every now and then, as if she could sense when Grace was getting hungry.<br>\r\n<br>\r\nAs evening approached, Grace followed Erin on her bike, simply reveling in how good she felt. Despite the boring classes, despite the heavy fatigue in her legs, Grace felt like she was on cloud 9. She was the biggest, strongest woman in the world and in love with the only one who could even come close to matching her.<br>\r\n<br>\r\nAnd her memories were almost completely caught up. After a huge dinner and a playful study/makeout session, Grace wasn’t even surprised when instead of going home they were back at the gym for another mammoth workout; this time on their shoulders.<br>\r\n<br>\r\nThe gym was almost completely empty at this hour. The two amazons had an entire dumbbell rack to themselves, and they used it to pound their delts into submission.<br>\r\n<br>\r\nAnd just as this morning, Erin was a diligent taskmistress, pushing Grace to do more and more reps of lateral raises and military presses with more weight than she thought possible. By the end, her shoulders were swollen bowling balls of muscle. Grace couldn’t even lift her arms enough to wash herself off, something Erin was more than happy to help with in exchange for some oral attention of her own.<br>\r\n<br>\r\n...<br>\r\n<br>\r\nThe two staggered through the front door, trying to oblige Leah and keep quiet for once. As Erin lay asleep on her massive chest, Grace looked down at her little muscle muse, thankful for giving her the best day of her life.<br>\r\n<br>\r\n<i>Of course</i>, Grace thought as she slipped the device out of her bag,<i> it could always be a little better...</i><br>\r\n</span></div></div>",
            "created":1372914000,
            "id":1622389,
            "title":"Continue (Chapter's too long)"
        },
        "1133":{
            "author_id":"up2nogd1",
            "author_name":"Lvmsclgrls",
            "choices":[
                "Stick with her friends",
                "Go see Madison",
                "Go see Josh"
            ],
            "content":"<div class=\"\"><div> <span>Grace was taking in the stares and whispers of those around them as they walked into the diner.  Not all of them were positive sounding, but there was a group of guys who didn’t seem to mind.  The girls were all good looking, with Leah still the prettiest.  And while she and Erin were dressed in tight workout outfits, Leah had on dark blue shorts and a form fitting pink top that showcased a body to shame any Sports Illustrated swimsuit model.  And for someone who proclaimed not to like the muscles of her roommates, Leah had firm, strong looking legs, a killer behind and a shapely upper body.  Leah wasn’t visibly hard with a normal amount of fat for her shapely figure, but it was difficult not to jealous of someone who could look like that without having to work for it.<br>\r\n<br>\r\nAs they sat down at a table, Grace sat across from Erin, while Leah sat down between them.  Erin smiled.  “I think the guys find our muscles intriguing Leah.  You’d be surprised how many men in the gym find us sexy.”<br>\r\n<br>\r\nLeah shook her head.  “Well maybe a few I suppose.  But besides Josh, are the guys really chasing after you Grace?”<br>\r\n<br>\r\nGrace blushed.  It was amazing that the memories crowded her head as two lives seemed to fight for space.  The comment jarred her thoughts and yes, Josh and her were now an item.  She would need to make sure to stop by his apartment when they got back.  Grace smiled sheepishly.<br>\r\n<br>\r\n“I don’t know.  When I work out I’m kind of focused.”<br>\r\n<br>\r\nErin chuckled.  “Well I know that guys in the gym like what they see from me.”<br>\r\n<br>\r\nErin lifted up her right arm next to Leah and flexed her bicep into a hard baseball sized mound of muscle, split cleanly and peaked nicely.  It was bigger than most bodybuilding women her size.  Leah grunted and pushed Erin’s arm away.<br>\r\n<br>\r\n“Well those are the guys in the gym.  I prefer to have a bigger fan base.”<br>\r\n<br>\r\nErin shook her head.  “We all how you like to impress the men, but don’t you want to slow down a bit and stick with someone a little longer?”<br>\r\n<br>\r\nLeah frowned for a moment, giving Erin’s comment some thought.  She then smiled again and giggled.  “Nope!”<br>\r\n<br>\r\nErin smiled and shook her head.  “Well you know how Grace and I worry.  We don’t like it when you get hurt.”<br>\r\n<br>\r\nAs Erin and Leah talked, Grace was focusing on fiddling with her gift.  Grace had thought about Leah and typed in “A year ago Leah started working out with me and really liked the results.  Boys liked her new physique so she kept going.”<br>\r\n<br>\r\nGrace hit enter and looked up at Leah.  Grace agreed with Erin that they worried about Leah being a bit boy crazy.  If guys gave her complements about an outfit, she’d go get two more just like it.  And while she wasn’t overly promiscuous, Leah had no problem jumping into bed with different men.  The problem was she’d buy into the guy’s sweet talk and then once they got what they wanted she’d get upset with them when their true nature came out.  But Leah seemed to bounce back each time and maintained a positive attitude, even though Grace and Erin concerned about how long that could last.<br>\r\n<br>\r\nWhat Grace hadn’t known was that Leah had been into gymnastics when she was young and her body quickly grew hard and very strong, adding dense muscles at an astounding rate.  Instead of being impressed, the other girls made fun of her and those at school mocked her.  So Leah quit gymnastics soon after and never worked out again.  As Leah grew older her body filled in with killer curves and enough natural muscle to give her a little hard body and to keep her boobs high on a strong chest, even though Leah didn’t do anything extra to help.<br>\r\n<br>\r\nThe device came back with “Related changes to this universe increasing beyond nominal.  Press Enter again to make change. Press See More for details of changes.”<br>\r\n<br>\r\nGrace crinkled her nose.  Why would having Leah work out cause a problem?  She was tempted to hit the See More for the details when the waitress came to the table.  Grace and Erin ordered two egg white vegetarian omelets each while Leah ordered pancakes.<br>\r\n<br>\r\nErin shook her head again.  “How can you keep your figure when you eat stuff like that?”<br>\r\n<br>\r\nLeah shrugged her shoulders.  “I don’t know, just lucky I guess.”<br>\r\n<br>\r\nGrace smiled at Leah and she glanced back at the device, contemplating what to do next.  As they talked about schoolwork Grace reached up to scratch the back of her neck, popping her massive bicep into a hard ball of rippling muscle.  Leah frowned as she looked at Grace’s bicep.  Taken aback by Leah’s negative reaction, Grace moved her eyes to match Leah’s focus.  Grace sighed and pulled her arm down.  Grace looked at the device and without giving the consequences further thought pushed the enter button.<br>\r\n<br>\r\nThe bright light flashed and Grace was a bit surprised when time seemed to slow down around her.  What had she done?  Were changes beyond normal distorting her perceptions?  Grace looked over at Leah and watched with fascination as Leah’s body slowly changed right in front of her, while the events played out in her head.<br>\r\n<br>\r\nGrace started to understand the gravity of the changes.  The perception of female muscle had been altered so that it was more than just a few who found it appealing.  And when Grace started working out and getting more attention, Leah had joined in during their senior year of high school.  Erin joined in soon after, altering her past as well.  Within a few months it was evident who had the best genetics.  While Erin and Grace seemed to match each other with their incredible gains, Leah was nothing short of a machine.  Once Leah started working out in earnest, the muscles started piling on her frame in extreme fashion.  Even though she was the shortest of the trio, her muscles bulged bigger, her lifts were larger and the attention from the men grew greater, fueling Leah’s desire.  Within 6 months, Leah was hoisting weights to match any man in the gym and flexing muscles to match.<br>\r\n<br>\r\nLeah’s strength seemed to drive her sexual frenzy, but she was now the one dumping the men to move on the next conquest.  Leah enjoyed her friends, but her attitude toward men continued to evolve the stronger and bigger she grew.  Nine months in Leah was the strongest woman on the planet and as strong as any man.  She enjoyed showing up the men in the gym as they drooled after her, often interrupting their lifts to easily press a weight over her head that the men were bench pressing.<br>\r\n<br>\r\nGrace could feel her own body grow stronger and larger as she stared with wide eyes at Leah’s changing form sitting next to her.  Leah’s shoulders and back continued to widen with added muscle as her top morphed into a low cut, thick athletic top, pushing her large breasts forward as more and more pectoral muscle stacked on top of each other.  Grace could now see Leah’s densely cut, yet seemingly impossibly narrow abs writhe beneath her skin like shifting tectonic plates.  And Grace started to gasp as she saw the muscles on Leah’s arms balloon forward, jumping outward like miniature boulders.<br>\r\n<br>\r\nGrace could feel her own muscles continue to build as well and her head throbbed with the memories of three different lives converging.  Even through the fog, the new memories continued to build and Grace knew that what had happened was all but impossible.  Her initial change to give herself more muscle than her body would normally be able to build had apparently started the chain of events now playing out in her head as the device continued to press toward the present.<br>\r\n<br>\r\nTwo months ago Leah was proclaimed the strongest person on earth and still Leah grew stronger.  The gym had to order special equipment to handle not just her, but her sidekick friends who were growing stronger than any man in the gym as well.  Soon Leah was bench pressing a ton, then more.  She was flexing muscles to shame most any man.  And as Grace’s memories caught up to the present she gasped as she realized that Leah was 3 times stronger than the strongest man with sexy bulging muscles bigger than anyone.  Grace’s ears popped and suddenly she was back in the present.<br>\r\n<br>\r\nThe boys who had looked at them when they came in the door were still there, only now they were staring openly at the three muscle girls.  As Grace reached for her purse to get some aspirin, Leah stood up and walked over toward the boys with a smile on her face.<br>\r\n<br>\r\nErin turned to watch.  “Oh boy, here we go.”<br>\r\n<br>\r\nGrace looked up to see Leah place her massive frame between two of the boys, reach down and gripping the metal chairs, slowly lift them into the air.  Everyone in the diner gasped at the incredible feat of strength and Leah smiled casually as if lifting 200 pounds with each arm into the air at an awkward angle was as easy as lifting their lunch plates.  After the patrons clapped their approval Leah placed the chairs down, whispered into one of the boys ears and sauntered back to her seat.  Grace was reaching for the water, but could only stare at the comic book super hero version of her friend.<br>\r\n<br>\r\nErin smiled at Leah.  “Nice.  I assume one of those three will be your guest tonight.”<br>\r\n<br>\r\nLeah nodded.  “Yeah, he seems healthy enough.  For now anyway.”<br>\r\n<br>\r\nErin and Leah both giggled as Grace swallowed her aspirin.  She definitely needed to take stock of the situation.  She heard her phone chime with a text notice and looked at it.  It was from her younger sister wanting to meet her this afternoon.  What could Madison want?  Her head still pounded with the mixed memories as she decided what to do next.</span></div></div>",
            "created":1358053200,
            "id":1507698,
            "title":"Leah rethinks muscle"
        },
        "11332":{
            "author_id":"up2nogd1",
            "author_name":"Lvmsclgrls",
            "choices":[
                "Go ahead and give me a demonstration",
                "I don't know what you're talking about"
            ],
            "content":"<div class=\"\"><div> <span>Texting back, Grace sent out “Sure.  Where do want to meet?”<br>\r\n<br>\r\nThe response was “At the school gym in the weight room.”<br>\r\n<br>\r\nGrace was sorting through memories since in her initial life she had never stepped into the gym, then in her next life she had, then in her current life she was frequently there with Erin and Leah.  Sighing, Grace texted an acknowledgement without asking why.  Better to do that in person.<br>\r\n<br>\r\nSince she was done with classes for the day and Erin and Leah had classes that afternoon, she promised to get back together for dinner in the apartment.  That would give Grace the opportunity to catch up.  Grace headed to her car and climbed in.  The old car was the same at least, giving her some added comfort that perhaps things hadn’t changed too much.  Driving to her old school felt odd, like it would for any recent graduate, but as memories of this reality soaked in, she and her friends had left as sort of legends, having grown bigger and stronger so fast and sparking other girls to start lifting as well.  And then Grace remembered Madison being one who started at the end of the term, not liking how her bookworm older sister was showing her up in the muscle and strength department.<br>\r\n<br>\r\nGrace pulled into the parking lot and noticed it was already clearing out.  School was just getting out, so when she walked into the entrance near the gym the hallways were empty.  Turning toward the gym she thought she heard some noises that sounded like boys complaining or…. Pleading?<br>\r\n<br>\r\nPushing the door open Grace was stunned by what she saw.  Several large boys, likely football players, were on the ground, obviously in pain.  And one more hit the ground hard to her left, pulling her attention in that direction.  It was then that she saw her sister.  And she could no longer call her little!<br>\r\n<br>\r\nThere standing with a smug smile on her pretty young face was Madison, but this was nothing short of the Hulk version of Madison.  She was standing there practically naked except for a stressed bikini top and some type of black bikini briefs.  Her upper body was gigantic, with pulsing muscles that had to rival Leah, if not exceed them!  Her chest was seemingly all muscle, but the pecs were so oversized that she appeared to have tits bigger than any porn start alive!  And her arms hung down to her side like two sides of beef.  If Grace wasn’t staring at her she wouldn’t have believed it.<br>\r\n<br>\r\n“Hello Grace.  It’s been a while.”<br>\r\n<br>\r\nGrace continued to stare with wide eyes at the 5 foot 5 inch vision in front of her.  “Uh yeah.  It has been.  What did you want to talk about?”<br>\r\n<br>\r\nMadison continued to smile as her muscles twitched and swelled with seeming anticipation.<br>\r\n<br>\r\n“Ever since you left I had to listen about how my big sister was so strong and so muscular.  Funny how you were able to pile on muscles so quickly.  So when I started lifting around the time you left it seemed even stranger that I was able to add muscle much faster than ever before.  As if by magic.  And thanks to that magic and my more natural athletic abilities, just look at what has happened.”<br>\r\n<br>\r\nMadison pulled up her right arm, tensing her forearm into the size of a ham hock with ropes of muscle pressing to the surface.  She flipped her long, wild dark hair over her shoulder and tensed her fist, causing her bicep to jump upward into a mountain of girl muscle that started to cause Grace to sweat as she could see it was outclassing her 26 inch biceps half way into her flex.  And then to Grace’s growing horror Madison bulled her forearm up to vertical and her bicep exploded upward and outward with more muscle than Grace thought was humanly possible!  Several veins snaked their way around the bowling ball sized bicep, across the deep split and up to a rock hard peaked that pulsed up to Madison’s wrist.<br>\r\n<br>\r\n“I mean, really Grace, does any of this seem normal to you?  I’m having the time of my life right now, what with taking on 10 football players at once and none of them having a chance against my superior girl strength and rock hard, mega sized muscles.  But for some reason I seem to remember this not being normal.  I couldn’t quite put my finger on in, so I wanted you to stop by.”<br>\r\n<br>\r\nMadison took a step toward Grace with a sly smile and look of superiority.<br>\r\n<br>\r\n“So Grace, care to fill me in?  Or would you like a demonstration so you can see which sister is now the muscle queen?<br>\r\n<br>\r\nGrace’s pulse raced.  She hadn’t considered the effects of changing her genes would have on her sister.  And while Madison must have kept her massive muscles and strength hidden up to this point, Grace was more than just concerned about what Madison had in mind.  She wanted to buy some time to think things through.  She would have liked her Leah and Erin to be here.  She also figured if she could get a distraction that perhaps she could use the device to fix things.  But she needed to respond to Madison now.  So with as calm a demeanor as she could muster, Grace looked at Madison and replied….<br>\r\n</span></div></div>",
            "created":1358658000,
            "id":1512245,
            "title":"Go see Madison"
        },
        "114":{
            "author_id":"thenn",
            "author_name":"TheMM",
            "choices":[
                "Captain America level",
                "Superman/Hulk level (or more)",
                "Something else, perhaps choosing a greater being for her change."
            ],
            "content":"<div class=\"\"><div> <span>She decided that if she was going to do it, why not go for broke...figuratively speaking of course. Why should she only keep it to 'normal' standards? If this thing could alter her as much as she thought, Grace figured that she should really go for the big stuff.<br>\r\n<br>\r\nSo Grace began to add to her description, \"As I worked out, my body rapidly gained large amounts of muscle and strength, far beyond what any normal human had accomplished, to the point I could be considered a 'superhero'.\"<br>\r\n<br>\r\nMaybe it was a bit wordy, but Grace felt that was pretty good for the device to go on, as she hit Enter. It paused for a couple minutes, popping up with a message:<br>\r\n<br>\r\n\"Warning: Extreme unknown and dangerous changes to universe, it is not recommended that these changes are made...Hit 'Enter' if you wish to ignore these warnings.\"<br>\r\n<br>\r\nOf course she hit Enter, and the device went silent again, before coming with another message:<br>\r\n<br>\r\n\"Description 'superhero' is too vague. Change requires a more specific wording. Note: An example of the level of change will also work\"<br>\r\n<br>\r\nWell...an example? The geekier side of Grace was coming out now. She wasn't a huge comic book fan, but she knew the heroes and the larger universe behind them. In both DC and Marvel were tons of choices of varying levels she could go with. She'd recently seen The Avengers when it came out on Blu-ray, so they were kind of on her mind. She could be as strong as Captain America, or maybe even the Hulk...or, Grace thought giddily, as strong as 10 Hulks! But there were plenty of others, like Superman or Wonder Woman.<br>\r\n<br>\r\nBut there weren't only superheroes, and not just one universe in any of them as well. There were numerous examples of beings that put even the superheroes to shame in terms of power. Grace was a bit undecided where to go.</span></div></div>",
            "created":1358830800,
            "id":1513941,
            "title":"Becoming Super, but...how much Super?"
        },
        "1142":{
            "author_id":"wonderwoman68",
            "author_name":"fmggirl",
            "choices":[
                "The device overloads and were did grace end up in her new realitly",
                "The program changes grace but she is the opti-woman of the future",
                "The changes are out of this world and grace is massive and supersized"
            ],
            "content":"<div class=\"\"><div> <span>Grace's hand started to tremble as she held the device, The many ideas she had were just unbelieveable , then she started to type.\" As I continued to workout over time the energy drink I was using ,turned out to be unstable and mutate me, with this I started to grow stronger than 100 superman , my body started to grow and change as more superpowers started to develop . Over the course of time , I was taller than shehulk ,more beautiful and endowed than wonderwoman ,  powergirl and supergirl combined. My intelligence will climb to superhuman levels and I was able to develop a chamber to create more superpowers for myself and others if I choose. Grace stopped typing and the device went silent and the enter button appeared . Without any caution Grace took a giant breath and hit the button .</span></div></div>",
            "created":1502644680,
            "id":2368652,
            "title":"Super(wo)man/(She)Hulk level (or much more)"
        },
        "11423":{
            "choices":[
                "Grace powers herself up",
                "Grace powers her friends up"
            ],
            "content":"<div class=\"\"><div> <span>After Grace confirmed the changes, time seemed for her to stop. New memories were filling her mind while the world around was changing.<br>\r\n<br>\r\nOne year ago, Grace joined the gym for the first time. She adored muscular women for a long time and wanted to become at least partially as good looking as them some day. But miraculously, she didn't wait long. Contrary to the \"original timeline\" (as she started calling the world before any changes), she gained muscle and strength easily. In a two months or so, she became 200 pounds, 6 ft tall bodybuilder babe, and that was just the beginning.<br>\r\n<br>\r\nPuzzled by the impressive outcome, she soon discovered that it was probably boosted by her favorite energy drink, due to its experimental status. And her assumptions proved to be true, when it got withdrawn from the market with health organizations warning about its potentially harmful effects. But because Grace experienced only beneficial effects of that drink, she didn't stop using it. She stocked up as much of it as she possibly could and returned to the gym, eager to grow much bigger. <br>\r\n<br>\r\n4 months passed and Grace's extraordinary growth slowed down. Well, that wasn't so bad - she was already 7 ft tall, 400 lbs of granite-tough muscles powerhouse, bigger and stronger than any being, but for the last month she didn't grow an inch. Did she reach the limit? She often got headaches, caused by mutagen drink abuse. But after a few days, the headaches stopped and Grace uncovered additional drink's effects - she was much, much more intelligent than before. In fact she was a genius! She could remember anything, from the most scientific things she read on the Internet, to contents of bulletin boards caught with the corner of her eye. Her vision seemed much clearer, and her thoughts were processed immediately.<br>\r\n<br>\r\nWhile not hitting the weights in the gym, Grace spent lots of time in a local university's library. In no time she gained an knowledge of a Doctor of Science, Medicine etc. and then even more. She conducted her own private research on the forbidden energy drink, and found what was the most important mutating factor in it. Then she created her own, countless times more potent potion. And boosted with that, she continued her growth routine.<br>\r\n<br>\r\n<br>\r\nBut this time, even more side effects appeared. Grace's body, though inhumanly giant and ripped beyond any imagination, gained more and more feminine shape. Her waist narrowed down, her butt plumped out. Boobs returned on the flat surface of her firm pecs, gaining breast tissue rapidly, growing beyond any bra's capacity. <br>\r\n<br>\r\nTwo months before present day, Grace was lazying around. After serious workout, she just got out of shower and laid on her bed, naked, going through her comic books. She was godlike - 7'6\" tall, weighing 2 tons of titanic muscles and feminine body with outrageous curves (her boobs were at least three times bigger than her head), she could lift fifty times her mass and was the most intelligent person in the world. She was popular, but it peaked some time ago and was now stabilizing in form of devoted fandom. Lately she was getting bored with lifting with ease more and more, because now big trucks were no match for her strength. She asked herself \"Am I bored of my superpower?\"<br>\r\n<br>\r\nAnd that last word ringed a bell in her head. She looked at her comics and immediately knew what to do. With her intelligence she'll build the superpower giving machine! Unfortunately, even though the inhumanly complex project took her less than a day to create, the parts to that were so rare and unique, she had to wait for deliveries a long time. <br>\r\n<br>\r\nBut the wait was worth it. Exactly one week before now, she completed the machine. It looked quite like lamp, but with ray on its top, and after choosing a superpower from the computer's menu it was supposed to shoot the target with its ray, mutating them with chosen power. For the testing, she chose most typical one - flight. The beam hit her, making her body hot and itchy for a while, and then it stopped. <br>\r\n<br>\r\nAnd just like that, Grace gained her first superpower. It was amazing - even though she was too big to be carried in public transport or cars, she could fly with the speed of the sound. <br>\r\n<br>\r\nAnd at that point, the flashbacks stopped. Grace looked at her body - it was real! All the changes really happened! She couldn't contain her joy. <br>\r\nAfter long hours of testing her new (though in fact gained during last year) strength and flying around a house, she stopped in front of her miraculous machine. She couldn't wait to use it and power up again. But maybe she should invite her friends and make them into superheroes too?</span></div></div>",
            "created":1502997600,
            "id":2370553,
            "title":"SuperMassive"
        },
        "114232":{
            "choices":[
                "The girls",
                "The boy"
            ],
            "content":"<div class=\"\"><div> <span>One of changes in Grace's life caused by her wish was the necessity to move out of small apartment she shared with her friends, Leah and Erin. With her current size she was pretty sure she would fill most of the space in the room, assuming somebody would make an entrance for her, because there was no way she would fit her body through small door there.<br>\r\n<br>\r\nBut she didn't move far and kept in touch with her former roommates and geeky Josh, so only thing she had to do now was to invite them over.<br>\r\n<br>\r\nShe grabbed her phone and opened contact book. But who should she invite? <br>\r\n<br>\r\nThe girls, who had no idea about comics, superheroes and all that stuff? Or Josh, who was the only person that could challenge Grace's own geekiness?<br>\r\n<br>\r\n</span></div></div>",
            "created":1503067920,
            "id":2370918,
            "title":"Grace powers her friends up"
        },
        "1142321":{
            "choices":[
                "Hulking out, with multiple stages of size",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh hey Grace, how are you?\" answered the voice belonging to Leah, coming from Grace's phone.<br>\r\n\"Yeah, nothing much. Except...\" she became silent for a while, building tension \"I finished IT!\"<br>\r\nShe heard loud gasp from the other side, followed by muffled squeaks \"Really? Does it work?\"<br>\r\n\"Like a clockwork\" Grace smiled, floating two feet above the ground.<br>\r\n\"Okay, we'll be there in few minutes!\"<br>\r\nThen the other voice, Erin's, could be heard in a distance saying \"But I don't wanna gooo...\", before Leah hung up.<br>\r\n<br>\r\nGrace prepared her apartment for visitors, but before coffee was ready, Leah stormed inside, almost dragging Erin behind her. It was amazing view, considering Erin was taller and stronger than Leah.<br>\r\n<br>\r\n\"So? So? So? Where is it? Does it work? Did you change yourself?\" Leah ran around Grace's massive body, looking for changes.<br>\r\n\"You grew even bigger, am I right?\" Leah was so excited she could explode any moment.<br>\r\n\"Yes, I grew... but not with this, you know\" Grace laughed while Leah pouted.<br>\r\n\"Okay, big girl - stop teasing and show us everything you got\" Erin smiled.<br>\r\n<br>\r\nGigantic girl just smiled and floated. Her friends thought that maybe she was growing right in front of their eyes, but no - she was flying! <br>\r\n<br>\r\nBoth Grace's friends just froze for a second, shocked by sight of mass of muscles heavier than a car flying around them like balloon with no string.<br>\r\nErin just concluded this with a quiet \"Nice\".<br>\r\n<br>\r\n\"So\" Grace landed \"It's all thanks to that\" she pointed to the machine in a corner of her room, then explained how to use it.<br>\r\n<br>\r\n\"Who wants to go first?\"<br>\r\n\"MEMEMEMEME!\" Leah recovered from the initial shock of seeing the machine's effects.<br>\r\n\"Then go on, surprise us\" Grace encouraged her.<br>\r\n<br>\r\nLeah started typing into computer... and then approved the changes.<br>\r\nThe ray hit her, making her groan from the weird feeling.<br>\r\n<br>\r\nWhat did Leah choose?<br>\r\n</span></div></div>",
            "created":1503075360,
            "id":2371032,
            "title":"The girls"
        },
        "11423211":{
            "choices":[
                "Erin makes a change!",
                "Leah wants to have a word with Grace, privately..."
            ],
            "content":"<div class=\"\"><div> <span>\"So, what did you pick? I hope it's not invisibility, you would probably run around whispering to people's ears, pretending to be a ghost\" joked Erin.<br>\r\n\"That... that was my first idea\" Leah pouted \"But after looking at Grace I got a better one!\"<br>\r\n\"What? Me?\" Grace was puzzled.<br>\r\nLeah hugged one of her friend's titanic thighs. Five Leahs wouldn't be able to embrace it.<br>\r\n<br>\r\n\"You know, I don't like this whole bodybuilder things, being all sweaty and tired, and I don't want to have all the problems of having a gigantic body\"<br>\r\n\"Yeah, fitting through average door is impossible and washing every nook and cranny of body with a few-feet-deep trenches between unbendable muscles takes a lot of time and effort\" Grace nodded.<br>\r\n\"But, on the other hand being big and strong allows you to lift anything easily and defend yourself, because beautiful girls like me might have some problems with shady types in dark alleys\"<br>\r\nHearing that, Erin crossed her arms and rolled her eyes \"Then don't go to dark alleys, dumbass\"<br>\r\nPretending she didn't hear that, Leah continued \"...and so, I present you... LEAHULK! (working title)\"<br>\r\n\"...huh?\" said simultaneously Erin and Grace.<br>\r\n<br>\r\nMeanwhile Leah closed her eyes and tensed all her muscles. After a second, she felt tingling and opened her eyes, to her (partial) and her friend's (complete) astonishment. <br>\r\nBehind Leah's clothes, her body grew. Quickly, and not by a large margin, but visibly indeed. Each end every muscle in her body filled with additional mass, making her previously slim body look more than toned - she was top notch fitness sized. Her clothing stretched, but did not tear - it must have grown along with the girl.<br>\r\n<br>\r\n\"Holy shit, it really works!\" Leah was amazed, she was constantly checking out her new, chiseled form.<br>\r\n\"Well yeah, we knew that after the first flight show Grace gave us. But you're nowhere near Hulk's size, Leah\" Erin ridiculed Leah.<br>\r\n\"Oh yeah? Come here sweetie, let's compare our biceps!\"<br>\r\n<br>\r\nThey lined up, Leah behind Erin and Grace in front of them as a judge (she couldn't be a contestant since her arms were bigger than both of her friends' bodies combined). They tensed their arms at the same moment, making them stand out. Erin was a sportswoman and she did have a well toned, healthy body with musculature bigger than that of an average woman, but right now she was outmatched by her friend. The one that a few hours ago would be disgusted by a thought of working out or doing sports. <br>\r\n<br>\r\nLeah caressed her friend's and her own arms. Erin's bicep was smooth while hers was bulky, and almost twice as big.<br>\r\n\"Looks like we have our winner - Leah!\" Grace pretended to be clapping.<br>\r\n\"Obviously, but that doesn't change the fact that she isn't THAT big! My volleyball lady coach was much bigger than her, and all she did was yell at us to run faster and jump higher.\" Erin grimaced at the unpleasant memory.<br>\r\n\"Well, that just means I have to use another trick\" and Leah closed her eyes, tensing all muscles again.<br>\r\n<br>\r\nAnd once again, she grew. This time she went from the top fitness to top bodybuilder sized. Every already powerful inch of her body turned into two or three, as her arms, legs, abs, even height, boobs and ass increased in size. After the change, Erin's still flexed arm was now overshadowed by Leah's relaxed one. Right now, the previously shortest girl was a few inches taller than her athletic friend. Leah's curvy body set new standards - although she had been hourglass before, now it was much more incredibly pronounced, as her waist didn't get much wider, just her muscle density there was far beyond human one (but below Grace's of course), but her boobs and butt grew not only in size, but muscles supporting them grew as well. <br>\r\n\"So? What do you think now?\" Leah asked Erin, caressing her new humongous breasts.<br>\r\n\"I think that now you'd be able to throw that bitch of trainer a few feet in the air. But, that's still not Hulk...\" she didn't finish, because she noticed bodybuilder girl tense once again.<br>\r\n<br>\r\nThis time, she got the Hulk size and even Erin finally gave up. How could she argue with a foot taller woman with Hulk's muscles, head-sized boobs and matching ass?<br>\r\n\"Hey Grace, can you extend your arm for a while?\" Leah asked her (still many times bigger than her) friend.<br>\r\n\"Yeah, sure\" she looked like she was trying to stop the girls.<br>\r\nLeah clenched her fists and punched extended palm with all her might. Fist made loud whiz midair, and the punch's power made room shake a little.<br>\r\n\"Sorry for hitting you, but I had to test something... How powerful is that, you think, Grace?\" <br>\r\n\"Well, I think you'd be able to punch a hole in a castle wall or throw a car. I think that's more than sufficient for self defense.\"<br>\r\nLeah was overjoyed.<br>\r\n\"But why did you grow THAT? You had outrageous curves before!\" Erin slapped Leah's butt.<br>\r\n\"I didn't want to look too manly!\"<br>\r\n\"And what do you plan now?\" Grace spoke \"Even while you're a few hundred pound of mass smaller than me, you'll still have all the problems of having the huge body\"<br>\r\n\"Tsk, tsk tsk. When I said I wanted to be like Hulk, it wasn't just about size\" and after that she straightened up and loosened all muscles, exhaling audibly. And with that, Leah shrunk to her initial size.<br>\r\n<br>\r\nErin hugged her by the waist and lifted her up. Leah tried to get out of now bigger girl's grasp, futilely.<br>\r\n\"I think I prefer you normal sized, with both of you titanesses here, the room was getting cramped\"<br>\r\n \"Hey, you have problems with my size?\" Grace stood up and flexed, making her look even bigger than already. Then she started to laugh.<br>\r\n\"Oh, you should see the look on your faces. So, what now? Erin, it's your turn!\"<br>\r\nBut Leah looked like she wanted to tell something first...<br>\r\n</span></div></div>",
            "created":1503254760,
            "id":2372042,
            "title":"Hulking out, with multiple stages of size"
        },
        "114232111":{
            "choices":[
                "Attribute borrowing!",
                "Something else!"
            ],
            "content":"<div class=\"\"><div> <span>The same procedure as before - typing, standing, being empowered and then itching body.<br>\r\n<br>\r\nAnd Erin followed all the steps in the exact order. When she stopped scratching, she looked at her friends, who waited impatiently for the redhead's power reveal.<br>\r\n\"And so? So? What did you choose? Tell us already!\" Leah said, and Grace just nodded.<br>\r\n</span></div></div>",
            "created":1503257820,
            "id":2372060,
            "title":"Erin makes a change!"
        },
        "1142321111":{
            "choices":[
                "Grace borrows Erin her size for a day",
                "Grace refuses, Erin goes to find her prey on campus"
            ],
            "content":"<div class=\"\"><div> <span>\"Leah, come here, please?\" Erin asked.<br>\r\n\"Sure... but why?\" <br>\r\n\"No questions! Just sit here and close your eyes for a moment, okay? It's necessary for my power presentation. I promise it won't be anything bad, okay?\"<br>\r\n\"Okay...\"<br>\r\n<br>\r\nAfter Leah sat down and closed her eyes, Erin extended her hand and touched Leah. Grace, who was watching this from the side, thought that nothing happened, but that wasn't true. She spotted gas-like strings of barely visible matter coming from Leah's curves and condensing in Erin's palm. It took only a few seconds, but Leah went completely flat on her chest and butt, with figure like young boy and in Erin's hand appeared jewel-like pendant. <br>\r\n<br>\r\n\"Okay, you may open your eyes. Inspect yourself\" Erin had a wide, devilish grin on her face when she was watching Leah's increasing horror.<br>\r\n\"WHAT THE FUCK DID YOU DO TO ME YOU...\" and after that followed series of swears, some of which Grace never heard.<br>\r\n\"Hey, hey, calm down, it's only temporary for now! You are like this because I went for Attribute Borrowing\" Erin grinned.<br>\r\n\"You mean stealing!\" Leah calmed down, but was still angry. The clothes, previously lying tight on her curvy body, now were hanging loosely, due to less-than-A-cup breasts and flat butt.<br>\r\n\"I just thought that it would be fun to see the same expression of terror on faces of bitches from the college! To take away their boobs, intelligence, height or whatever and wear it in front of them, but giving it all back before anybody gets suspicious\"<br>\r\n\"Wearing it?\" asked Grace.<br>\r\n\"Oh yes, exactly\" Erin put on the pendant.<br>\r\n<br>\r\nThe jewel shone a little, and Erin's body reacted - her curves filled with new mass, stretching her clothes to the brink of tearing. Her hips got enormously wide with ass bigger than any Hollywood star could ever dream of, and her bust, though painfully constricted by much-too-small bra, looked like small watermelons.<br>\r\n<br>\r\nErin caressed her improved curves.<br>\r\n\"I made it, so the 'borrowed' attribute adds to current, that's why I'm bigger then Leah - right now I have both our curves.\"<br>\r\n\"Just remember not to go too far with that power\" Grace warned.<br>\r\n\"Yeah, yeah, I made some restrictions - to use it I have to touch a person and think what I want to steal, and I can't make people disappear - in extreme situations, they will go to, like, 4 feet tall with pre-school muscles and curves. Also, the attribute can be returned in two ways - either by me grabbing the gem and willing to do so or by original owner wearing it.\" Erin took the pendant off (going back to her original size) and handed it to Grace.<br>\r\n\"Take a close look inside\"<br>\r\nGrace did, and noticed that inside small amber-like gem floated cartoonish outline presenting Leah's curves.<br>\r\n\"Nice!\" Grace gave it to Leah, who after a quick peek inside, put it on, growing to her original body, making the pendant disappear by turning to smoke.<br>\r\n<br>\r\n\"And? What do you intend to do with that power now, Erin?\" Grace curiously asked.<br>\r\n\"I'm glad that you asked, cos I have an odd favor to ask you... Can I borrow your muscles?\"<br>\r\n\"...what\" Grace was totally speechless.<br>\r\n\"I'd like to try and hit the gym once to see how you feel having that titanical body, to relive a day from your life! Please, I promise to return it to you the next day!\"<br>\r\n<br>\r\nGrace pondered. Erin was one of her besties, and Grace knew that she could be trusted, besides having a day-off (off being muscular behemoth) would be pretty interesting, but on the other hand if something happened to the pendant... That much power in wrong hands could end in Armageddon-sized catastrophe.<br>\r\n<br>\r\n\"So... what do you think Grace? Can I be you for a day?\"<br>\r\n</span></div></div>",
            "created":1503406860,
            "id":2372817,
            "title":"Attribute borrowing!"
        },
        "114232112":{
            "choices":[
                "No change, just love",
                "Change for a bigger pleasure"
            ],
            "content":"<div class=\"\"><div> <span>\"Uhm... Erin?\" Leah asked shyly.<br>\r\n\"Yes, what is it?\" she was just about to type her power description into the machine, but stopped.<br>\r\n\"I think you have the dentist appointment in about half an hour...\"<br>\r\n<br>\r\nErin looked at the watch, then muttered \"oh shit\" and ran outside like an arrow, telling Grace she'd be back in the evening.<br>\r\n<br>\r\n\"We're left alone then...\" Grace said, then squeaked, because she felt her thighs being groped from behind. It was Leah.<br>\r\n<br>\r\n\"Leah? What are you doing?\" Grace was really surprised, but it wasn't unpleasant. Even though she had inhumanly huge muscles, she felt her friend's soft palms caressing them passionately.<br>\r\n\"Since you started to grow beyond human size, I've fantasized about making love to that incredible, unbounded new you. And while I was too small, thanks to my new capabilities, I might survive making our fun time. So, what do you think? I have a few naughty ideas...\"<br>\r\n<br>\r\nGrace looked deeply into her friends eyes, filled with lust and thought to herself \"Aw hell, why not\". She grabbed Leah by the butt and gave her a french kiss. When she put smaller girl down, she was already in her 'bodybuilder' form.<br>\r\n<br>\r\n\"So? What are your ideas then, my lover?\" Grace put her hands to her hips, overshadowing Leah.<br>\r\n\"Well... either I just jump on you here and now and see how long can I hold against that bulging mass of yours, or I change\"<br>\r\n\"Change? How?\"<br>\r\n\"I thought about adding additional 'stages' to my power. One stage would give me the exact size of yours, making us equal partners, but two stages... Whoo, the second stage would make me much bigger than you now, and you'd be totally dominated. What is your choice then, milady?\"<br>\r\n</span></div></div>",
            "created":1503256620,
            "id":2372053,
            "title":"Leah wants to have a word with Grace, privately..."
        },
        "1142321122":{
            "choices":[
                "One stage more - equality",
                "Two stages more - domination"
            ],
            "content":"<div class=\"\"><div> <span>\"Okay then, let's make you bigger Leah\" Grace sat in front of the control panel.<br>\r\n\"Hey, I wanted to be the one typing!\" Leah complained.<br>\r\nGrace rolled her eyes \"I must make sure you won't go galactic sized or anything stupid like this, that would just be trouble not only for me, but maybe for all the galaxy\"<br>\r\n<br>\r\nLeah pouted but understood her to-be-lover's point of view.<br>\r\n\"So? Will we be equal or do I get to be one in charge?\"<br>\r\n</span></div></div>",
            "created":1503256860,
            "id":2372054,
            "title":"Change for a bigger pleasure"
        },
        "12":{
            "author_id":"up2nogd1",
            "author_name":"Lvmsclgrls",
            "choices":[
                "Grace makes all girls strong and muscular",
                "Erin changes them into super athletes",
                "Leah ramps up their muscles and strength",
                "Leah's younger sister runs in crying",
                "The girls go for beauty, brawns and brains"
            ],
            "content":"<div class=\"\"><div> <span>Grace looked up at her friends and smiled.  If she couldn’t trust her best friends, who could she trust?  And besides, if Grace was going to start off on an adventure, why not include Erin and Leah as well.  “I got a gift from my aunt.  The one that passed away recently.”<br>\r\n<br>\r\nLeah looked up, looking more excited than Erin, who continued to munch on her cereal.  Leah stood up and looked at the device.<br>\r\n<br>\r\n“What is it?  It looks like a Blackberry or something.”<br>\r\n<br>\r\nGrace nodded.  “Yes, it does look like that, but apparently it’s much more.”<br>\r\n<br>\r\nGrace pulled out the paper that came with it and handed it to Erin.  Grace then started describing it for both Erin and Leah.  They smiled with disbelief, then wonder.  Could this be real?<br>\r\n<br>\r\nGrace set it down on the coffee table and the three girls stared at it.<br>\r\n<br>\r\nErin put the cereal bowl down and looked at the paper.  “We can change history?  Can it make me a better athlete so I could have gotten a scholarship?”<br>\r\n<br>\r\nGrace nodded.  “Or smarter so I could have gotten a full ride academic scholarship.”<br>\r\n<br>\r\nLeah giggled.  “Or realize what a jerk Kevin Atkins is so I didn’t hook up with him.”<br>\r\n<br>\r\nGrace sighed.  “Come on Leah, surely you have loftier goals.  Besides, we all know you like the big athletic guys.”<br>\r\n<br>\r\nLeah shrugged her shoulders.  “I don’t know, I hadn’t really thought about something like this before.”<br>\r\n<br>\r\nErin chimed in.  “And what about the alternate universe thing?  That sounds really weird.”<br>\r\n<br>\r\nGrace stared at the device.  “Can we really change who we are?  I mean I could have studied more I guess, but is that all I can change?”<br>\r\n<br>\r\nErin looked at the device as well.  “Well why don’t you try it on something?  We all know you want to get a better body what with the old school bodybuilder and fitness pictures you have in your room.”<br>\r\n<br>\r\nGrace blushed.  She worried about putting those things up.  She had gone to the school’s gym, but didn’t care for the comments from the football players.  Considering they were playing for a junior college she didn’t think they so should be that condescending.  But what could she change to do something about any of that?  Grace shifted her weight and cleared her throat.<br>\r\n<br>\r\n“What should I try?”<br>\r\n<br>\r\nThe girls all stared at the device.  Erin licked her lips.  “Well we could see if it even works on you first.  You know, let’s try something.”<br>\r\n<br>\r\nErin picked up the device and began typing.  “Grace, flex up your arm.”<br>\r\n<br>\r\nGrace frowned.  “Why?”<br>\r\n<br>\r\nErin continued to type.  “Because I want to see if this can make you buff.”<br>\r\n<br>\r\nGrace’s mind started to race.  “By doing what,” she thought.  She pulled off her sweatshirt and tossed it onto the chair.  She had a thick white t-shirt on and no bra, having tossed on her outfit in the morning before class.  Her breasts were a little more than A cups anyway and her up and down figure didn’t sport much in the way of curves.  Her stomach was still flat, but soft.  Pulling her arm out, she flexed her bicep like a pro, having seen plenty of pictures and watched quite a few videos of both male and female bodybuilders.  However, her results were much different as nothing really happened.<br>\r\n<br>\r\nErin tried not to smile.  “You can flex down any time now.”<br>\r\n<br>\r\nLeah covered her mouth as she giggled.  Grace grimaced.  “Very funny.  Ha-ha.  Now is there a point to this?”<br>\r\n<br>\r\nErin looked at the device.  “Yeah, I put in that you started working out last week and doubled the size of your arm.  It came back that a minor alteration to this universe was noted.  It also said that a change to your DNA would need to be affected, but the sphere of influence over a week was still minor.”<br>\r\n<br>\r\nGrace swallowed as she stared at her arm.  “Wait, did you say double the muscle in my arm?  I’d hate for it to be twice as big with fat.”<br>\r\n<br>\r\nErin hummed a short “Hmmmmm.”  She hit a back button and typed again.  “Well OK, since you wanted muscle I made sure to add enough so we’d all notice.  I also made you really strong.  I know you’d get a kick out of that.”<br>\r\n<br>\r\nGrace swallowed as she rubbed her thumb across the fingers, still holding a fist, but not flexing.  “Are you sure?  And just how big did you make it?  And how strong?  Is there any more changes?  Did it give any more warnings?”<br>\r\n<br>\r\nLeah smiled.  “Oh quit worrying, we all know you’re going to love it.”<br>\r\n<br>\r\nErin laughed and hit Enter.  A quick white flash filled the room and as the girls blinked and realizing that somehow their memories were a bit different, they quickly focused back on Grace’s arm.  Grace had pulled her forearm down a bit in anticipation and once the flash faded, she felt a rush of energy like she had never felt before.  She felt strong.  Really strong, like she could lift anything.  It was intoxicating.  Invigorating!  Grace grit her teeth and squeezing her fist she pulled her forearm back up and watched along with her roommates as a bicep.  HER bicep slowly materialized out of nothing.  Hell, LESS than nothing into a small lemon, breaking the plane of her arm as the small amount of fat seemed to melt away and the muscle bulged hard against her alabaster skin.  The thin tricep muscle pressed down slowly to match her bicep which thanks to Grace’s flex had ground up into the size of a baseball.  Muscle fibers feathered their way across her bicep as it continued to harden with rippling mass the likes of which none of the girls had seen before.  Grace tensed and un-tensed a few more times crystallizing her mighty muscle further until it was a picture perfect specimen of what a bicep should look like.<br>\r\n<br>\r\nLeah continued to stare at Grace’s incredible bicep.  “Erin, what did you do?”<br>\r\n<br>\r\nErin was still staring at Grace’s bicep as well.  “I, I typed in that Grace had 12 inch arms with low bodyfat and was as strong as Kevin Atkins.”<br>\r\n<br>\r\nLeah sniffed.  “Kevin is a starting linebacker and is good enough to get a transfer to a bigger school.  At least that’s what he told me.  That must make Grace really strong.”<br>\r\n<br>\r\nErin nodded.  “Stronger than girl muscles that big should be able to lift I think.”<br>\r\n<br>\r\nGrace, still staring at her newly minted bicep, finally glanced down to see that while Erin apparently only typed in that her bicep would be bigger, the rest of her body had added quite a bit of muscle as well.  Grace rubbed her hard six pack abs and cooed as her fingers slid up and down across the ridges of muscular blocks.  She rubbed the sweatpants and could feel the hard thighs beneath the material.  There was no doubt that she was now as big as women she idolized and if her new memory served correctly, was much stronger!  Grace looked back at Erin.<br>\r\n<br>\r\n“Well now that we’ve proved that the device works.  What do you want to next?”<br>\r\n<br>\r\nThe three friends look back and forth at each other.  Erin looked at the device and smiled.<br>\r\n<br>\r\n“Well I know I’d like to be stronger as well.”<br>\r\n<br>\r\nLeah scrunched her face.  “Hmmm.  Maybe being as strong as Kevin would be fun.”  She giggled with a touch of deviousness.  “Or stronger.  Dump me will you?”<br>\r\n<br>\r\nGrace looked down.  “We could go back further; make all girls stronger than boys.”<br>\r\n<br>\r\nErin bit her lower lip.  “That may push us into another dimension, or would really change this one.  Besides, didn’t we want to improve ourselves to get ahead in life?”<br>\r\n<br>\r\nLeah stared at the device.  “But there is so much more we could do than just ask to get smarter or kick a ball further.”<br>\r\n<br>\r\nThe three girls all looked at each other again, all with varying ideas, but none of them exactly the same.<br>\r\n<br>\r\nAs their thoughts continued to churn….<br>\r\n</span></div></div>",
            "created":1358571600,
            "id":1511635,
            "title":"Decisions, decisions"
        },
        "125":{
            "choices":[
                "The girls decide they should have a trial run on just one of them first",
                "They do it and there are a few unforeseen consequences but no huge changes",
                "Oops, now their universe is prone to incidences of female Hulk outs and such!"
            ],
            "content":"<div class=\"\"><div> <span>“You’re right, Leah. Why does it have to be JUST kicking a ball further or getting smarter? I mean, this thing just put a bicep on Grace in seconds... can’t we just use it to make us all superpowered Amazonic wet dream geniuses by some kind of lab accident or miracle or something?” Erin posited. “That way, no altering history or messing with alternate universes.”<br>\r\n<br>\r\n“Superpowered Amazonic wet dream geniuses?” Grace raised an eyebrow and blushed a bit.<br>\r\n<br>\r\n“That might be a little inconspicuous, Erin. Not to mention that even if it happens slowly, don’t you think people might notice that all three of us have been suddenly grown freakin’ huge. I mean, sure we don’t need to worry about human history being rewritten on our account but isn’t that kind of asking for people to  carry us off to experiment on us?” Leah worried.<br>\r\n<br>\r\n“You said superpowered... maybe we can be like the Hulk.” Grace said.<br>\r\n<br>\r\n“Woah, I don’t want to be that big! Although, green might be fun for Halloween or something.” Erin looked thoughtful.<br>\r\n<br>\r\n“No, goofball. I mean... if we go for your suggestion and have some kind of lab accident or something to become superheroes... we can y’know - Hulk out... Think of it like this, there’s some chemical thing or whatever. The three of us are exposed and maybe over a month or two we all have a bit of a growth spurt... we can just pass it off as hormones or being late bloomers or just one of those things...” Grace trailed off.<br>\r\n<br>\r\n“OK, so we get to improve our normal looks and getting smarter... well, that’s not exactly hard to hide under a dress... and what by night we expose ourselves to gamma radiation to grow big, strong and superpowered?” Erin joked.<br>\r\n<br>\r\n“I don’t know. Maybe. Also, stop fixating on the Hulk part of it.” Grace shrugged.<br>\r\n<br>\r\n“Yeah but the more I think about it, the more I LIKE the Hulk part of it. I mean, imagine having all that power inside of you, like a coiled spring and you can just go from regular Erin in her clothes to ERIN THE HULK! Bursting out of your clothes and smashing giant flying metal snakes and stuff - THAT would be awesome.” Erin realised she had been getting a little too enthused and blushed. “Just saying.”<br>\r\n<br>\r\n“That would be cool... and I DO like superheroes.” Grace conceded. “You’re pretty quiet, Leah.”<br>\r\n<br>\r\n“Oh... I’m just thinking about this... I mean,  if it goes wrong - we can just use undo, right?” Leah asked.</span></div></div>",
            "created":1359954000,
            "id":1524022,
            "title":"The girls go for beauty, brawns and brains"
        },
        "1252":{
            "choices":[
                "Grace wakes up in a hospital",
                "Grace wakes up in her own bed",
                "Grace wakes up somewhere totally different"
            ],
            "content":"<div class=\"\"><div> <span>Erin barely even heard Leah's tentative question about being able to reverse things if anything went wrong, the more she thought about it the more she wanted to be smarter, sexier and able to grow into a muscular behemoth.  Her finger flew across the keypad as she rapidly typed up the scenario she had in mind.<br>\r\n<br>\r\n\"Hey, Erin,\" Grace said, with a hint of concern in her voice, \"what are you typing now?\"  Grace reached for the phone that was ostensibly hers but that she had yet to actually use. <br>\r\n<br>\r\nErin twisted away from Grace as she continued typing, \"there,\" she said finally, dramatically stabbing the enter key.  The same white flash occurred but this time there was no obvious result.<br>\r\n<br>\r\nGrace wanted to yell at Erin for using the phone again before the friends had really decided what they should be doing with it but she almost immediately forgot why she would mad about it.  Instead she found herself saying, \"We really should hurry if we're going to make it to the science hall before the class leaves for the field trip.\"<br>\r\n<br>\r\nLeah and Erin both agreed and Erin gave Grace the phone back.  Grace shoved it into her purse as she hurriedly tried to find her Science textbook and notes.  The other girls were similarly scrambling and Grace wondered why they thought they had time to mess with her new phone when they were running late for this trip that had been scheduled weeks ago.  If Grace had really stopped to think about it she wouldn't have been able to remember even having this science class in her curriculum and neither would the other girls but at the moment they were all focused on not missing this trip.<br>\r\n<br>\r\n*****<br>\r\n<br>\r\n\"C'mon you guys, hurry up,\" Grace called back to her friends as she jogged across the campus towards the science building and the waiting bus.  She was already eerily comfortable in her newly improved body and was getting frustrated at how slow her friends were.  Leah and Erin were obviously winded trying to match what to Grace was an effortless pace.  Grace bounded through the bus door and up the steps, offering apologies to the driver and their teacher for running late.  Seconds later Leah and Erin did the same and the trio moved to their seats as the bus ground into gear and began moving.<br>\r\n<br>\r\n\"Geez Grace, not all of us are athletes like you, have some mercy,\" Leah fumed when she got her breath back.  <br>\r\n<br>\r\nGrace shook her head, as fleeting images of running track and pumping iron in the gym flashed through her memory.  \"I could have ran much faster if I had wanted to and left you behind but this is an important trip.\"  Again if Grace had really thought about it she couldn't have said WHY it was important.  Erin was oddly silent, she merely smiled and patted her hair back into place.  \"I didn't mean to make you mad,\" Grace said by way of apology.  Leah shrugged and told Grace not to worry about it.  The girls spent the rest of the trip going over their notes and Grace often found herself not remembering writing them despite the fact they were obviously in her handwriting.  Most of the notes centered around something called augmentation of biological systems through radioactive infusion.  Once again Graces mind skittered around the blank spaces without recognizing they were blank when she tried to remember why she was taking this class.  \"It's important,\" she muttered to herself, something that Leah echoed seconds later.<br>\r\n<br>\r\n*****<br>\r\n<br>\r\nThe girls followed their class and teacher through some sort of scientific facility until they all reached a large room similar to an auditorium.  As the class spread out to find seats some sort of machine was unveiled in the middle of the room and everyone craned their heads to get a better look.  Grace scratched at her shoulder and wondered why she was wearing a t-shirt, normally she wore sleeveless shirts to show off her arms and shoulders better.  She began absently rolling her sleeves up as someone from the facility started talking about the machine that was on display.  \"Stop being such a jock,\" Leah joked as she poked Grace with her elbow.  Grace shrugged and tried to concentrate on the presentation but was having a hard time.  Her mind wandered to the workout she had planned for this afternoon, then to whether or not she would take up the guy she had met at the gym the other night on his offer to go out to the movies this weekend.  Before she knew it she was drifting off to sleep until she was suddenly shaken awake by Leah who looked and sounded completely panicked.  \"Grace, we have to get out of here, something is going wrong with the machine.\"  Grace looked around and realized that the room was almost empty and the rest of the class was racing through the doors that seemed to be slowly swinging closed automatically.  Some alarm was loudly shrilling and Grace wondered how she could have slept through this.  \"Grace, hurry,\" Leah said again.  Erin was looking oddly unconcerned even though by Graces estimation the doors would close before even she could sprint there.  Instead Grace ran directly for the device which was spewing smoke and wobbling in place while emitting a loud whine that was slowly increasing in pitch and volume.  \"Grace!\"  Leah screamed as she raced towards her fried.  \"Get away from that thing!\"  Graces first thought had been that she may be able to throw this thing through a window or something to get rid of it but even as she strained to pick it up heavy steel shutters crashed down over the windows at the same time the doors slammed shut.  Grace looked over her shoulder at Leah's terrified face and Erin's oddly serene smile changing into a look of shock.<br>\r\n<br>\r\n\"Grace, don't try to pick it up, back away from it or you'll get almost all the energy from it!\"  Erin shouted, starting to run towards the device as well.   <br>\r\n<br>\r\nGet the energy from it?  What was Erin talking about?  Grace looked down to see a series of lights on the machine all change to red at the same time.  \"Shit, that can't be good\" Grace said softly, just before the device she was holding exploded, hurling her across the room.<br>\r\n</span></div></div>",
            "created":1360904400,
            "id":1532670,
            "title":"Beautiful Brainy Powerhouse Orgin Story"
        },
        "12521":{
            "choices":[
                "Grace is fine",
                "Grace is not fine"
            ],
            "content":"<div class=\"\"><div> <span>Grace blinked her eyes and began to sit up.  A momentary thrill of panic ran through her as she realized she was connected to tubes and wires that were getting in her way.  As soon as she realized she was in a hospital bed she lay back again and allowed herself to relax slightly.  \"It's good to see that you're awake,\" a voice startled her into sitting up again.  \"Relax, relax, it's ok...\"  A doctor stepped forward into her line of sight and offered a soothing smile.  <br>\r\n<br>\r\n\"What happened?\"  The last thing Grace could remember was being trapped in a room at some science lab with an unknown device that was about to explode.<br>\r\n<br>\r\n\"You got a nasty bump on the head, something to do with that explosion at the research lab outside of town.  You and two others were brought here for a series of testing.  I didn't get filled in on all the details and probably never will, that place is involved in all sorts of government projects and secret squirrel nonsense is par for the course,\" the doctor said with a chuckle.<br>\r\n<br>\r\n\"Tests?\"  Grace rubbed the back of her head and found a painful lump.  \"Two others?  Are my friends ok?\"<br>\r\n<br>\r\n\"You're friends are fine, we had to hold you a little longer to make sure you weren't suffering from a concussion or anything else.\"  The doctor leaned in and shone a light in each of Graces eyes, nodding with satisfaction.  \"Looks like you're fine as well.  I'm not sure what this was all about but nothing showed up in your bloodwork.  We'll have you out of here in no time.\" <br>\r\n<br>\r\nThe doctor left while Graces mind tried to make sense of what she had just been told.  Every time she tried to put her finger on details that bothered her (like the fact the she couldn't seem to remember the name of the lab she been in or exactly where it was) her mind seemed to skip to something else.  Her frustrated efforts to remember details about what had happened to her were interrupted by Leah and Erin entering her room.  <br>\r\n<br>\r\n\"Oh my gosh, we were so worried about you,\" Leah gushed as she rushed to throw her arms around Grace.  Grace held her friend tightly while Erin stood, silent and enigmatic.<br>\r\n<br>\r\n\"We brought you a change of clothes,\" Erin said finally, setting an old backpack of Graces at the foot of the bed.  <br>\r\n<br>\r\nTrue to his word the doctor released Grace from the hospital shortly.  She dressed, sighing with satisfaction to be out of the hospital gown and into familiar and comfortable tank top and spandex short though they seemed a little more snug than she remembered.  She also realized her skin was tingling, especially around her breasts.  She adjusted her breasts in her sports bra in a futile attempt to get rid of the sensation.  \"Do you guys feel... weird?\" she asked her friends when she rejoined them.  Leah shook her head and Erin gave her another odd look that Grace couldn't read.  Grace looked at her friends, convinced that Leah's skin looked clearer, her eyes brighter and her hair more vibrant.  Something seemed different about Erin as well though Grace couldn't put her finger on it at the moment.<br>\r\n<br>\r\n\"Are you feeling ok?\"  Leah asked with some concern.  She was used to her friend being a literal pillar of strength and the distracted air and confusion Grace was displaying was out of character.<br>\r\n<br>\r\nGrace shook her head to clear it, \"Yea I'm fine,\" she said finally.  I think I just want to go back home and take it easy for a bit.  The three walked out of the hospital and Grace squinted in the bright sunlight, wishing her friends had also brought her a pair of sunglasses.  <br>\r\n</span></div></div>",
            "created":1360904400,
            "id":1532672,
            "title":"Grace wakes up in a hospital"
        },
        "125212":{
            "choices":[
                "The phone is in Graces room",
                "With all that's happened the phone was lost"
            ],
            "content":"<div class=\"\"><div> <span>The hospital was well within what Grace normally considered walking (or running) distance but today she just felt drained.  As though reading her mind Erin hailed a cab and paid for it to take the trio home.  Grace sighed with relief when she finally sank down onto their couch and put her feet up.<br>\r\n<br>\r\n\"Are you going to be ok here alone?\"  Leah asked for what was probably the hundredth time.  <br>\r\n<br>\r\n\"I'll be fine,\" Grace insisted even though she certainly didn't feel fine.  The weird tingling of her skin had intensified and she forced herself to not fidget.<br>\r\n<br>\r\n\"Alright,\" Leah said uncertainly as she and Erin left for their afternoon classes.  \"If you need anything text me ok?\"  Leah said as the door closed.<br>\r\n<br>\r\nGrace murmured something non-committal as she fired up her laptop, very glad that she didn't have anymore classes scheduled for today.  She attempted to take her mind off the odd way her skin felt by surfing the net but it wasn't working.  The tingling sensation was becoming maddening.  She once again attempted to adjust her breasts to be more comfortable, failing to notice that they had grown by at least a cup size since her accident.  She also hadn't noticed that any and all blemishes on her skin were slowly vanishing.<br>\r\n<br>\r\nAs she clicked aimlessly from website to website a familiar ad caught her eye, a shirtless guy was working out \"make serious gains with this one weird trick for building muscle.\"  She had seen it and similar ads hundreds of times before but she found herself unable to look away from it.  \"Holy crap, I am incredibly horny right now,\" she said out loud as she finally looked away from the screen.  She had read somewhere that near death experiences such as narrow escapes from certain death could bring dramatic boosts to the libido and it must be true because once she had started thinking about sex she couldn't stop.  Determined to take her mind off of this she retrieved her vibrator from her dresser (or battery powered boyfriend as Leah referred to them) and quickly brought herself to an orgasm though instead of feeling satisfied she was far from it.  The thought of wanting sex was becoming a burning need and a second session only seemed to make it exponentially worse again.  \"What the hell,\" Grace growled, feeling even more frustrated.  She pulled her shorts on (leaving her panties behind) and left her apartment to knock on the door across the hall.  <br>\r\n<br>\r\nHer mind was rebelling in shock from what her libido was contemplating.  Their neighbor Josh had been crushing on Grace pretty much since the girls had moved in though his awkward shyness had so far prevented him from actually making a move on her.  The girls had recognized the symptoms right away and Grace thought the puppy dog crush was cute but beyond that didn't seriously think about him.  Now though... now she wanted sex and he was the nearest guy she could think of.<br>\r\n<br>\r\n\"Hey Grace, what's going on?\"  Joshes roommate Max answered the door.  <br>\r\n<br>\r\n\"Is Josh in?\"  Grace asked, inwardly groaning as Max started shaking his head.<br>\r\n<br>\r\n\"No, not sure where's at.  Maybe the science hall?  He has some project he's working on for one of his classes.  He told me but I honestly wasn't paying very much attention, it was way over my head.\"  Max chuckled and Grace laughed with him as she sized him up.  Tall, decent looking, fairly fit and athletic.<br>\r\n<br>\r\n\"That's fine,\" Grace said smoothly changing gears.  Some part of her mind was screaming at her to stop as she stepped in close enough to brush her breasts against Max's chest.  \"Do you mind if I come in?\"  <br>\r\n<br>\r\nMax raised an eyebrow momentarily but shrugged and stepped back to let her in, \"Sure, what's up?\"<br>\r\n<br>\r\n\"Why don't you tell me,\" Grace said with a wicked grin as she grabbed his member through his pants.  Max's eyes flew open with surprise but it wasn't long before Grace had him right where she wanted, naked and underneath her as her body moved and thrashed.  <br>\r\n<br>\r\n\"Oh my gosh, Grace this is incredible.\"  Grace ignored him as she built rapidly to an orgasm.  She screamed as she came then felt overwhelming frustration as the fleeting sense of satisfaction vanished in another even more powerful sense of sexual need.  \"Wow,\" Max gasped as Grace started again.  This cycle continued multiple times, Grace was literally starting to foam at the mouth with rage and desire and Max was obviously becoming less and less comfortable with the increasingly frantic love making.  \"Grace,\" Max tried to get her attention as she grit her teeth and ignored him.  \"Grace,\" he tried again.<br>\r\n<br>\r\n\"Shut up, I'm not finished yet,\" Grace growled, feeling herself getting closer to yet another orgasm.  Max tried to get up and move Grace off of him but he was shocked at how strong she was.  She obviously worked out and was in great shape but even with that her strength seemed shocking for someone her size.  \"I said I wasn't done yet,\" Grace snarled again, grabbing Max's arms and pinning them over his head as she continued to fuck him like a machine.  She could feel two burning cores in her chest, one was the insatiable sexual need, the other was the increasing level of rage and frustration she was feeling from not being able to satisfy the first.  Max began to struggle and interrupt her rhythm and the rage tipped over some invisible point of no return at the same time she finally reached another orgasm.  \"I'm trying to enjoy this!\" She screamed at Max as the sensation of both the rage and orgasm  ripped through her body at the same time.  It was like their were floodgates somewhere inside of her opening.  She shakily stood up, looking down at Max as she panted.  Something was happening to her, something that should be frightening but instead she embraced it.  Max cowered away from Grace as she began to grow.<br>\r\n<br>\r\nGrace arched her back and roared out loud with the feeling of power rushing into her limbs.  Her arms ballooned with muscle and she roared again, leaning forward into a crab flex, watching her muscles expand.  She stood up, her head slamming hard into the ceiling but not feeling any pain as her body violently expanded thicker and wider in every direction.  She flexed over and over, reveling in the feeling of growth, of power.  The floor creaked beneath her ever increasing weight as she stepped slowly across the room toward Max who had backed away until he was up against the far wall, looking at Grace, completely terrified.  Grace could feel another pulse of power rippling through her body and she flexed hard one more time, shouting with the feeling of power as the final pounds of muscle packed themselves onto her already mind-blowing frame.  Max screamed with fright and that was the last thing Grace could.<br>\r\n<br>\r\n*****<br>\r\n<br>\r\n\"Wake up, wake up.\"  Grace sat up groggily as Leah shook her.  <br>\r\n<br>\r\n\"What's going on?\"  Grace looked around her room, she was sleeping in her own bed, it must have been a dream.  She started to get up and realized she was naked under the sheet.<br>\r\n<br>\r\n\"Did you sleep through whatever happened?\"  Leah looked frantic.<br>\r\n<br>\r\n\"Did I sleep through what?  What happened?\"  Grace pulled the sheet up to her chin and sat up, surprised that her breasts felt larger and heavier than usual. She tried to ignore it and concentrate on what Leah was trying to tell her.<br>\r\n<br>\r\n\"Something happened to the guys apartment.  It's totally destroyed, and Max is missing.\"<br>\r\n<br>\r\nGraces heart sank.  It must not have been a dream... her mind went immediately to the phone and Leah's earlier comment of being able to change things back.  Something was horribly wrong and Grace knew the phone was somehow involved.<br>\r\n</span></div></div>",
            "created":1360904400,
            "id":1532674,
            "title":"Grace is not fine"
        },
        "13":{
            "author_id":"up2nogd1",
            "author_name":"Lvmsclgrls",
            "choices":[
                "Making Grace muscular and stronger",
                "Making both of them bodybuilders",
                "Giving her and roomates bulging muscles",
                "Giving Grace superhuman strength and growth potential",
                "Making all girls more muscular and stronger"
            ],
            "content":"<div class=\"\"><div> <span>Grace looked at her friends, but then thought about Josh.  The two of them were secretly close friends.  Grace wanted more, but seemed to sense that he had a thing for muscle girls as he had commented about his jealously of the posters she had in her room.  Not that he’d spent much time there.  In any regard, if anyone would be able to figure out how best to test the phone out, it would be him.<br>\r\n<br>\r\n“The box had an old phone from my aunt that just passed away.  I figured I’d take it over to Josh to see what he thought.”<br>\r\n<br>\r\nErin smiled mischievously at Leah who shot the same look back at Erin.  Erin chuckled.<br>\r\n<br>\r\n“Sure thing.  It’s not like you have a major league crush on him or anything.”<br>\r\n<br>\r\nLeah giggled.  “Yeah, have fun talking tech.”<br>\r\n<br>\r\nGrace blushed and looked away.  “OK, so I like him.  But we’re just good friends right now.”<br>\r\n<br>\r\nErin and Leah laughed as Grace walked out of the apartment and across the hall.<br>\r\n<br>\r\nJosh was alone in the apartment on line at his computer looking at muscle girl sites.  He knew his roommate was at class so it gave him a brief time alone to peruse the sites he liked best without fear of interruption.  But just as he found some of the latest morphs he heard a knock on the door.  Grumbling silently he clicked off the internet and walked toward the door.  Peaking through the keyhole he smiled as he saw it was Grace.  He liked Grace, but was a bit uncomfortable with how best to ask her out.  Josh opened the door and smiled.<br>\r\n<br>\r\n“Hey Grace!  What’s up?”<br>\r\n<br>\r\nGrace smiled back and looked at him and then a bit passed him.  “Uh, do have a few minutes to talk, well, alone?”<br>\r\n<br>\r\nJosh nodded and moved to the side to allow her in.  “Sure thing, Max is at class.”<br>\r\n<br>\r\nGrace walked in, clutching the phone.  She walked in and turned toward Josh who nearly walked into her when she stopped.  Grace blushed as they touched and Josh turned to the side.<br>\r\n<br>\r\nJosh snickered at the event and stopped near his computer.  “You seem a bit flustered.  Is something wrong?”<br>\r\n<br>\r\nGrace smiled weakly.  “No, actually I’m excited.  My aunt left me something in her will.”<br>\r\n<br>\r\nJosh could see she was holding a phone.  It certainly looked like an older model.  Grace noticed him staring at the phone and pulled in a breath.<br>\r\n<br>\r\n“It’s this phone.  Only it’s not really a phone.”<br>\r\n<br>\r\nGrace went on to explain the message that came with the phone and Josh looked surprised but skeptical.  He raised one eyebrow.<br>\r\n<br>\r\n“Well you’ll forgive me if that sounds a bit farfetched.”<br>\r\n<br>\r\nGrace sighed again.  “Yeah, but I was wondering if you’d take a look at the phone for me.”<br>\r\n<br>\r\nJosh nodded his head.  “Sure.”<br>\r\n<br>\r\nGrace handed it over to Josh and he powered it up.  The information Grace had described came up on the phone and Josh grunted thoughtfully.  He scrolled down and began to think.  Just what would be something he’d like to see?  He looked back up at the nervous Grace and back at the phone.<br>\r\n<br>\r\n“Well Grace, the text pretty much said the same thing you described.  You mind if I give it a try?”<br>\r\n<br>\r\nGrace stepped closer and shook her head.  “Go ahead.  That’s why I came over here; I figured a techie like you would have a better idea of what to do.”<br>\r\n<br>\r\nJosh smiled and nodded slowly.  His mind began to wander with thought.  Seeing as he had just came off his favorite website with morphs of beautiful women he wondered if he could give Grace the kind of boost he saw on the internet.  He thought about making her more muscular and stronger or giving her the ability to grow really big and super strong.  He thought about making her roommates bigger and stronger too.  Or even the girls across campus.  Maybe he could join her and allow their pent up inhibitions to break down.  There certainly were several options.  He sighed, bit his lower lip and began to type.<br>\r\n<br>\r\nJosh had decided to try:<br>\r\n</span></div></div>",
            "created":1385333400,
            "id":1698681,
            "title":"Head over to see Josh"
        },
        "131":{
            "author_id":"up2nogd1",
            "author_name":"Lvmsclgrls",
            "choices":[
                "Tell her he had already changed her",
                "Ask to walk around campus",
                "Make some more changes"
            ],
            "content":"<div class=\"\"><div> <span>Josh decided to start out with something contained but outside normal.  Picking historical he thought about the morphed models and celebrities from the site he had been looking at.  What if Grace had those features?  For real!  So he typed in: Grace started working out with weights during high school and her body reacted swiftly.  She became the biggest, strongest, most beautiful person in school and is now the strongest on earth.  He looked up at the nervous but still smiling Grace and hit enter.  The phone let out a soft chime and came back with:  Parameters outside normal, change to current universe substantial.  Others will be affected.  For more information on the set and potential changes hit ‘more’, to make changes, including adding more detail hit ‘cancel’, to move forward hit ‘enter’.<br>\r\n<br>\r\nJosh paused.  He wasn’t yet sure what that meant and was thinking about hitting cancel when Grace spoke up.<br>\r\n<br>\r\n“So what did you try?”<br>\r\n<br>\r\nNow it was Josh’s turn to blush.  “I typed in that you were stronger and more muscular.  It came back that things would change.”<br>\r\n<br>\r\nGrace tittered.  “Really?  That sounds cool.  I would think there would be changes if I were different.”<br>\r\n<br>\r\nJosh started to breathe heavy at the thought and ignoring the warning bells going on in the back of this head, lightly shrugged his shoulders and throwing caution to the wind hit the Enter button.<br>\r\n<br>\r\nJosh’s vision soon blurred as the effects of the phone took effect and Josh took in the memories being placed into his head like a vivid dream.<br>\r\n<br>\r\nGrace was just an ordinary young girl entering high school until her sophomore year when she signed up for a weight lifting gym class.  Grace soon discovered that she was able to add more weight to her routine faster than anyone and her muscles grew harder and larger as a result.  With a focus on her arms Grace’s biceps grew larger at a disproportional rate.  By the time she was a Junior, Grace was the most muscular and strongest girl in school, with bigger biceps than any boy.  And as she reached her Senior year she was easily the biggest, strongest person in school with muscles big enough to challenge most bodybuilding men and arms to surpass all but a few of them.  She broke every shot put and discus record for girls and boys and could run faster and jump higher than any girl or boy as well.  Her attitude changed as those who gave her negative remarks were dealt with harshly and as her strength continued to grow after graduation she moved on to the toughest gym in the state and was challenging the biggest men and quickly surpassing them, crushing their egos, their records, and when necessary, their bodies as well.  By the time she turned 18 a month before heading to college Grace was the strongest person the world had ever seen with the body to match even though she was still only 5 foot 9.  On her birthday she celebrated by bench pressing a ton for reps and curling half a ton until she lost count.  Her muscles were bigger than most any man and when she flexed her arms, no man could match her!  Yet she somehow remained feminine and sexy with nearly ridiculous curves on her comic body style body.<br>\r\n<br>\r\nBy the time she started college she was still growing stronger!  Her entire body shifted into hardness never seen before as her strength leapt beyond what any human should be capable of achieving.  Her flexed bicep were bigger than his chest and harder than rock!  No man was even her league anymore and yet she continued to drive herself harder.<br>\r\n<br>\r\nJosh gulped with concern even as he was turned on beyond belief.  Now two months later as they neared the current time, Grace was growing bolder as her strength now approached super human.  Showing off at an event the crowd marveled as Grace was able to withstand machine gun fire against her seemingly indestructible body, lift up a large bus and bend the frame until she ripped the vehicle in half and flex up her biceps to nearly 50 inches around!  The government now feared what Grace would become and had decided to let Grace do pretty much anything she wanted as long as she didn’t hurt anyone.  She decided to stay in town and go to a local college since she wasn’t going to get any athletic scholarships as it was clear there wasn’t anyone who could compete with her at any level.  Other things clouded Josh’s mind that seemed just out of reach as his vision cleared and he stared at the now super powered Grace who no longer looked nervous and was dressed quite differently.  Josh’s jaw dropped open as he stared at the vision of mega muscles and super strength staring back at him.  Grace looked confident as she pulled her shoulders back to stretch her otherworldly muscles.  Josh blinked as she looked even prettier than before and her hair was thicker and shined with vigor.  The only thing that didn’t change was her height.<br>\r\n<br>\r\n“So did the phone do anything?  You mentioned that you were going to make some changes.”<br>\r\n<br>\r\nJason’s nervous look eased a bit as Grace’s expression softened and she pulled up her right arm slowly.  Jason realized that Grace wasn’t aware that he had done this with her aunt’s phone, so he shook his head.  “Um, no, not yet.”  Grace snickered as Jason looked down at a set of small bare feet connected to a set of legs that sported more muscle than he imagined any man had ever built up before.  Her bulbous calves were clearly seen on either side of her shins and nearly touched in the middle!  Her thighs were huge slabs of female beef cut diamond hard and flexed up two feet wide!  Jason gulped as he noticed the barely there bikini bottom and narrow, muscle packed midsection cut so deep it looked like actual bricks lined her abdominals.  Those narrow, muscle laden abs were surrounded by an ocean of pebble oblique muscles that curved out viciously to wider than wide lats.  But Jason’s gaze wasn’t at her side, it was at her front, specifically her chest.<br>\r\n<br>\r\n“Not that there’s anything I’d change.  I mean being the strongest person on earth times a lot is awesome.  And you more than anyone I know get the biggest kick out of these mountains of girl muscle.”<br>\r\n<br>\r\nJosh could only stare as the new Grace, the one staring at him seductively and wearing essentially a bikini with titanium links instead of string and sporting enough muscle across her nearly naked body to outshine any man alive was flexing up biceps bigger than he had thought could ever be possible.  Muscles stacked upon muscles in a ludicrous display of super human muscles expansion!  Her bicep was so large it pushed her thick forearm back from vertical and pushed up so high that it rose to the top of her head!  And not only was her arm massive there was no fat to be seen!  Her impossible bicep was pure, super powered, indestructible muscle stripped with uncountable pulsing muscle fibers that etched mega power across a bicep flexed up to twice the size of the next biggest bicep!<br>\r\n<br>\r\nGrace smiled knowingly as Jason looked at her mighty bicep with awe and lust.  “Yeah, they’re even bigger today.  I curled 10 tons with each arm for reps to warm up and wound up curling 12 tons by the end of the work out.  Can you imagine the strength it takes to lift 24,000 pounds with one arm?”<br>\r\n<br>\r\nJosh stared back at the super powered girl he had created.  Should he tell her what had happened?  Should he just go along with the changes to see what the world was like with a super powered friend who saw him as more than just a friend?  Or should he make some more changes, seeing as Grace wasn’t even aware he did anything?<br>\r\n<br>\r\nSmiling back at Grace, Josh decided to:</span></div></div>",
            "created":1385333520,
            "id":1698683,
            "title":"Making Grace muscular and stronger"
        },
        "133":{
            "author_id":"buffhamster",
            "author_name":"buff-hamster",
            "choices":[
                "Leah and Erin have no idea what just happened",
                "Josh messed up somehow and Leah and Erin are aware of their transformations",
                "Josh REALLY messed up and he and Grace were in a Universe where every woman..."
            ],
            "content":"<div class=\"\"><div> <span>“Ever since the age of 15,” Josh typed.  “Grace, Leah and Erin have been lifting heavy weights.  As a result, all three have physiques that would make any bodybuilder jealous, male or female.”  He thought for a moment before continuing.  “All three have a newly discovered gene that, when the right amount of stress is applied to the body, the muscle fibers grow faster and overall strength levels continue to climb.”<br>\r\n<br>\r\nTaking a deep breath and imagining Grace—or any other woman, for that matter—the size of the morphs he looked at online, Josh hit Enter.  The phone pinged and he glanced down at the message.<br>\r\n<br>\r\n“Historical Change?” the phone asked.  Reading the description the device gave him, Josh pressed “No.”<br>\r\n<br>\r\nA second message popped up on the phone next.  \"Sphere of influence?”  Josh glanced up at the pretty 18 year old, still looking nervously at him, and then typed:  “Only I (Jake Robinson) and Grace Swanson will realize things are different.”  Pressing Enter again and choosing “No” on “Alternate Universes” without even reading the text, he next heard Grace scream out in fright, as every muscle in her body began to swell rapidly.<br>\r\n<br>\r\n“Oh my God!  What’s happening to me?”  She yelled, as her biceps were already the size of tennis balls and her leg muscles were beginning to strain her shorts.  Rushing over to the full length mirror in the room, Grace watched her body continue to transform before her eyes, finally calming down when she realized what was happening.<br>\r\n<br>\r\n“Did…Did you do this, Josh?” she asked, as her clothes grew bigger to fit her larger physique.<br>\r\n<br>\r\nNow it was his turn to be nervous.  Not knowing if she was angry with him, Josh chose his words carefully.  “Yeah, I did.  Well, the phone did, I guess.  I just typed it in, you know?  Are you mad?  Should I cancel it or reverse it or something?”<br>\r\n<br>\r\n“No, I kind of like this,” Grace told him, flexing one of her enormous arms.  “Jesus, I just keep growing, don’t I?  How big did you make me?”<br>\r\n<br>\r\n“I didn’t specify.  I just typed, ‘A physique that would make any bodybuilder jealous, male or female.’”<br>\r\n<br>\r\n“Did you?” Grace replied, grinning at her reflection, realizing she now had the body she always dreamed of having.  And then some.  She was bigger than anyone on the football team and felt like she could out lift them all easily.<br>\r\n<br>\r\nHer transformation stopped eventually and Grace turned this way and that in the mirror, admiring her new physique, before turning back to Josh.  “So, how do you like the new me?”<br>\r\n<br>\r\nFor Josh, it was a fantasy come to life.  A woman as big as any morph he had seen online, standing in front of him.  A woman he knew had a huge crush on him.<br>\r\n<br>\r\n“I…I love it,” he told her, feeling his member press against his pants.<br>\r\n<br>\r\nJust then, there was a knock at the door and Leah walked in, wearing a tank top and possessing a physique as impressive as Grace’s.<br>\r\n<br>\r\n<br>\r\n<br>\r\nOption one: Leah and Erin have no idea what just happened<br>\r\n<br>\r\nOption 2: Josh messed up somehow and Leah and Erin are aware of their transformations<br>\r\n<br>\r\nOption 3: Josh REALLY messed up and he and Grace were in a Universe where every woman was huge and muscular  (Sorry, I ran out of space below.)</span></div></div>",
            "created":1429114440,
            "id":1964661,
            "title":"Giving her and roomates bulging muscles"
        },
        "135":{
            "author_id":"atccsc",
            "author_name":"atc",
            "choices":[
                "6 Months Ago",
                "20 Years Ago",
                "500 Years Ago"
            ],
            "content":"<div class=\"\"><div> <span>Josh sat there for a solid minute, his mind spinning with possibilities. Sure it could be bullshit, but if not this could be his shot to make his wildest fantasies come true. Josh shifted his legs to try to conceal the erection in his pants as his thumbs began tapping on the keypad.<br>\r\n<br>\r\n“What are you writing?” Grace asked with a smile.<br>\r\n<br>\r\n“It’s, uh... It’s a surprise.”<br>\r\n<br>\r\nJosh’s typing speed improved with his resolve. Rather than simply changing Grace or himself, Josh decided to go for it all:<br>\r\n<br>\r\n<span style=\"font-family:courier new, monospace\">Women have overtaken men as the physically dominant gender. While men have stayed the same, the average female is now significantly taller and more muscular than the average man.</span><br>\r\n<br>\r\nJosh wiped the sweat off his lip as he finished off his statement. Throwing caution to the wind, he widened the Sphere of Influence slider to include the whole world.<br>\r\n<br>\r\nAll that was left now was the Historical setting:<br>\r\n<br>\r\nWhen did the change occur?<br>\r\n</span></div></div>",
            "created":1388491020,
            "id":1718113,
            "title":"Making all girls more muscular and stronger"
        },
        "1351":{
            "author_id":"samnorton",
            "author_name":"Sam+Norton",
            "choices":[
                "She doesn't know the changes, and ask him what he did",
                "She knows about the changes, and kiss Josh of happiness"
            ],
            "content":"<div class=\"\"><div> <span>He decided to go crazy, and put only 6 months ago.<br>\r\nHe wanted to see if this phone was really this powerful.<br>\r\n<br>\r\nHe hit enter, and then:<br>\r\nHe saw Grace changing in front of him: she was smiling looking at him, waiting for his command surprise, after half a second she was looking DOWN at him, and the height difference was still growing; it didn't stop even when she reached the 7 foot ceiling, Like it was an usual thing, she bent her upper body, looming over Josh, like a blob ready to engulf him. The height grow was accompanied by an equal rapid muscle growth. Grace's muscle quickly filled her clothes, and on point of ripping they started morphing too, enlarging themselves to give more room to the muscles, still skin-tight. The result was a 8'3 tall Grace, with muscle bigger than bodybuilder's ones, huge mounds of power ready to be used, especially her 30 inch biceps, big and impossibly perky boobs, a curvy wide ass, with a small waist adorned by an 8 pack<br>\r\n<br>\r\nMeanwhile Josh's mind was receiving new information, giving explanation about this new and improved Grace.<br>\r\n6 months ago there was an event called later \"The pink event\": that day the average woman passed  from 5'7 of height and 150 pounds to an average of 8 feet and 400 pounds of muscles and boobs.<br>\r\nEvery woman now was the pinnacle of muscles and fertility.<br>\r\nCapable of lifting tons like tissues, everything-proof, faster than cheetahs but resilient as antelopes, they could swim faster than a shark and keep their breathing for a long time underwater. They became plant-like too if necessary, inhaling carbon dioxide and other poisonous gas in the atmosphere and exhaling oxygen, removing the global warming alarm, they were immune to every known poison and drug, their aging process slowed quite totally, in fact a 70 year old woman now looked like a 30 year old woman. they could sustain the highest and lowest temperature without harm. There was a lot more to discover about these women.<br>\r\n<br>\r\nFor a month after this pink event, there was the \"dark month\": some extremist feminist, unleashed a wave of male rape and domination, stating that it was time of the woman to rule the world and take control over the \"sperm-giver\". Fortunately there were stopped in time, inspired also by a speech given by the Us president wife:\"We don't have to treat males like second-class citizen only because now we are the stronger sex. If we use this new body to rape and dominate, we aren't superior, we are scum that deserve to disappear. With this body, we have to cooperate together to reach new and more ambitious goals\" Thanks to this speech and the good will of the majority of women, this domination movement was shut down in a quick time, and a new phase for mankind opened, a phase where the woman was the stronger (way stronger) sex.<br>\r\nNowadays, women are working especially in strength-related jobs, leaving men all the mental ones, there were made laws to protect male in case of rape and damages made by women etc... There were more marriages, divorce-rate lowered, and birth rate soared off the charts.<br>\r\nAt the end, it was quite a good thing this pink event.<br>\r\n<br>\r\nBut now, how will Grace react to her new body?</span></div></div>",
            "created":1496071140,
            "id":2327212,
            "title":"6 Months Ago"
        },
        "1353":{
            "author_id":"theats",
            "author_name":"TheATS",
            "choices":[
                "Grace remembers the original timeline and is overjoyed.",
                "Grace doesn't remember, but her personality is the same.",
                "Grace is completely different in this timeline, cruel and dominant."
            ],
            "content":"<div class=\"\"><div> <span>In truth the female population of the world had always been superior in this new reality, but it wasn't until around 500 years ago, when the american continent was discovered that their true superiority came to be. For you see when they came to the new world they found something incredible, all of the cultures where filled with dominating and huge amazons that ruled with and iron fist. The male population still had rights, but they where seen as inferior, there only for breeding and entertainment.<br>\r\n<br>\r\nThis discovery kickstarted the females all over the globe, who where already much fitter and stronger than the average male, to get into high gear and become more dominant and stronger than before. While the male population tried to resist, all rebellion was quickly squashed and done with. <br>\r\n<br>\r\nNow 500 years later, after many decades of trying to have the same rights as the females of the world the male population is allowed to have normal lives along the women... Despite this many of them still treat them as inferior, humiliating, crushing and raping them as they please.<br>\r\n<br>\r\nNow as all of this information and changes to the world come into focus in Josh's mind he sees as the image of his girlfriend, Grace, shifts into a 8'2\" tall amazon with muscles, that make her look as half as wide as she is tall, and are so decely packed that they are many times stronger than what they look like. Not only that it seems that not only her muscles and height where upgrated, but also her feminine figure, having become like a hourglass with an amazing ass and breasts.<br>\r\n<br>\r\nFinally as his mind sets into this new reality he remember as crucial fact and it is that Grace...</span></div></div>",
            "created":1483846680,
            "id":2260584,
            "title":"500 Years Ago"
        }
    },
    "info":{
        "author_id":"up2nogd1",
        "author_name":"Lvmsclgrls",
        "brief_description":"Grace receives a device that can change about anything, but with warnings.",
        "created":1357499700,
        "description":"<td align=\"left\" class=\"norm\">Grace, an 18 year old junior college freshman has just received a surprise from her great aunt’s estate.  The device doesn’t have many instructions and warned about the power afforded.  Her great aunt felt that Grace was the only one she could trust with something this dangerous.<br>\r\n<br>\r\nGrace is living in a small apartment with two friends from high school, Erin and Leah, and had made friends with two boys across the hall, Josh and Max, that went to the same junior college.<br>\r\n<br>\r\nGrace was kind and curious with normal interests, but secretly into some of the geekier pursuits such as video games and science fiction books and movies, which was one of the reasons she was friends with Josh.  But she also had a fascination for female fitness and some of the classic bodybuilding woman she saw on line.  Grace wasn’t any kind of athlete, but had recently joined a gym to see if she couldn’t get into better shape.<br>\r\n<br>\r\nWhat she had yet to realize was that the device was a doorway to multiple universes that could spawn from changes made through the device.  History could be altered to modify their current universe; a person (or group of people) could journey to other universes; or specific changes could alter events and results in unknown ways.<br>\r\n<br>\r\nThe initial characters include<br>\r\n<br>\r\nGrace, 18 years old<br>\r\n5 foot 9, 110 pounds, dark hair, rather thin.<br>\r\nDreams of being more muscular and stronger<br>\r\n<br>\r\nErin, 18 years old<br>\r\n5 foot 7, 125 pounds, cute with red hair and freckles.<br>\r\nVolleyball setter in high school, slight athletic build<br>\r\n<br>\r\nLeah, 19 years old<br>\r\n5 foot 4, 120 pounds, blonde hair, very pretty with a curvy body<br>\r\nLively and bubbly, the social organizer, but needs help from Grace with school work<br>\r\n<br>\r\nJosh, 19 years old<br>\r\n5 foot 10, 150 pounds, average build<br>\r\nPines after Grace, very smart but needs to save to go to a larger university<br>\r\n<br>\r\nMax, 18 years<br>\r\n6 feet 1 inch tall, 170 pounds and in good shape<br>\r\nFormer basketball player, met Josh at college<br>\r\n<br>\r\nI would prefer if no main characters would die or that you do not end the story unless it really must end. <br>\r\n<br>\r\nThere are a few ground rules tied to my own likes:<br>\r\n<br>\r\n- The bent is female muscle growth, so no negative female muscle comments or story additions<br>\r\n<br>\r\n- Giant 50 foot women are not what I would like.  Some height increases are fine, but keep the characters 8 feet or under.<br>\r\n<br>\r\n- Feel free to bring other characters into the story, but they need to be connected to the main characters somehow.<br>\r\n<br>\r\n- No one sentence additions unless you follow up with one of the selections.  The story will be fun if entries keep things moving forward.<br>\r\n<br>\r\n- No anthro (furries) please<br>\r\n<br>\r\n- I reserve the right to make changes to entries<br>\r\n<br>\r\nOther than that, have at it.</td>",
        "id":1912090,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1503406860,
        "modified":1503406860,
        "pretty_title":"Time for Female Muscle Growth"
    }
}