{
    "chapters":{
        "1":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Go to Damon's home",
                "Get something to eat",
                "Encounter thugs",
                "Start training right away",
                "Crash for the night"
            ],
            "content":"<div class=\"\"><div> <span>The freezing wind blew against Ryder's cuts and bruises. Despite the winter weather, the 16-year-old raccoon walk slowly on the city's streets. He didn't mind the cold. It was a lot better than the horrible atmosphere back home. Ryder's mother died when he was 13. Shortly after that, his dad became a major drunk and would beat him up at least 3 times a week. Ryder ran away from home having enough of his dad's abuse. His problems only got worse when he started living on the streets. Gang members and other street kids would beat him up until he was at the brink of consciousness just for the amusement. Tonight, they were bored again.<br>\r\n<br>\r\nRyder grew tired when he reached the city gym. There was a bench near the front entrance. It was not much but Ryder thought that it would be better than sleeping in a garbage dumpster again. He lied down on the bench and drifted off to sleep with a warm draft coming from the gym.<br>\r\n<br>\r\n\"Are you ok?\" Ryder was awakened by a black figure. After the sleepiness in his eyes cleared up, the black figure turned out to be a massive panther. He was at least 6 feet tall with a ton of muscle on him. Ryder was almost intimidated by him but after a night he had, he didn't really care. \"Mind your own business.\" Said Ryder turning to his side. \"Do you have a place to stay?\" Asked the panther.<br>\r\n\"I said mind your own business!\"<br>\r\n\"Do you have a place to stay?\"<br>\r\n\"No! Okay? I don't! Just leave me alone.\"<br>\r\n<br>\r\nThe panther took a deep breath to release his frustration. \"Look,\" he said, \"I am more than willing to give you a place to stay. It's going to be freezing tonight. You'll probably freeze to death if you stay here. Do you value your life at all?\" Ryder wanted this guy to leave him alone but for some reason, he couldn't ignore what he was saying to him. He gave in. \"Fine,\" he said, \"but you better not pull anything!\" Ryder got off the bench and went the same direction as the panther. \"I'm Damon by the way.\" Said the panther. \"Ryder.\" Damon took off the jacket he was wearing and put it over Ryder. It was like a blanket to him. \"Let's hurry and get out of this weather.\" Damon said. <br>\r\n</span></div></div>",
            "created":1319947980,
            "id":1214774,
            "title":"Tough Luck"
        },
        "11":{
            "author_id":"wolffurry",
            "author_name":"wolffurry",
            "choices":[
                "Get some good night's sleep",
                "Get to know Damon more"
            ],
            "content":"<div class=\"\"><div> <span>Ryder followed Damon for a while, walking in the freezing air of the city streets. Ryder could already feeling the cold reaching him through the panther's jacket until they finally stopped in front of a large house. \"Well, this is it.\" Ryder looked at the large 3 floor building as Damon got out a set of keys from his pocket and unlocked the door. They stepped inside as Ryder looked around the inside of the living room. There wasn't really anything special inside, just the usual furniture you would see inside any other home. \"This is my house. You're welcome to use it until you're comfortable.\" Damon watched as Ryder sat at the couch and smiled at the softness. \"Hey, you wouldn't happen to mind if I could, you know...Get a shower?\" \"Take as long as you like. It's upstairs through the first door on your right.\" Ryder immediately took off Damon's jacket and rushed upstairs.<br>\r\n<br>\r\nThe feeling of the warm water on his skin was the best thing to happen to him for as long as he could remember. He didn't care if it stung his wounds, he just wanted to get rid of all traces of the cold which had covered him ever since winter started. After the shower, Ryder realized that he didn't have any other clothes to put on. It's only when a knock came from the door with the panther's voice. \"If you need any new clothes, I'll go get you some.\" \"No, that's okay. I'll just put on my old clothes.\" \"Oh really? I saw how tattered and torn those rags are, and you're telling me that you're gonna pass up having some fresh new clothes to wear?\" He did have a point after all. After a brief pause, Ryder accepted his offer and saw Damon's arm outstretched from the half-open door, holding a t-shirt and shorts.<br>\r\n<br>\r\nWhen the two were now relaxing on the couch, Damon began asking the raccoon some questions. \"So why were you sleeping outside in the snow? You look much too young to be some homeless orphan or something. Don't you have a family?\" \"Well...That's the actual reason why I'm living out here in the first place.\" Ryder began explaining his story. About his mother's death, about his father's abuse, even about the recent beating he took earlier that night. Damon listened intently the whole time and looked solemn when Ryder was finished. \"I'm sorry to hear that.\" \"Yeah. This is actually the first time I told anyone about it.\" Damon patted him on the back. \"How about living here instead?\" Ryder was taken aback by his offer. \"What? Am I gonna have to work here as your butler or something?\" \"Hahaha, no! I mean living here as in living here in the same house as me! Plain and simple. I do get a little lonely here sometimes. We could be room mates, or have different rooms if that's what you want. Heck, I could be your new adopted father if you wanted me too!\" Ryder couldn't believe what he was hearing. He could feel his luck changing, right there on the spot. It was either continue living on the cold streets and get beaten up frequently, or live here with a kind panther that could very well protect him from almost anyone that tried to beat him before! \"No jokes? I get my own room and have you for a friend and or father? And I can even eat what's in the fridge?\" \"As long as you don't eat everything that's in the fridge, yes.\" \"Of course I accept!\" Ryder was feeling so happy right now that he could hug his new father! Which is what he did. After a short while, he realized what he was doing and let go. \"Oh, uh, sorry about that.\" \"No worries. I'm sure you'll get used to hugs from your new father.\" \"Or friend.\" \"Or friend.\"</span></div></div>",
            "created":1324482600,
            "id":1243680,
            "title":"A Panther's Home"
        },
        "112":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Start weightlifting",
                "Start push ups, sit ups, and pull ups"
            ],
            "content":"<div class=\"\"><div> <span>This seeme to good to Ryder. Too good. If there was one thing he learned on the street, it's that never trust anybody right away. Suspicion grew fast in Ryder's chest. He went back to defenstive mode and asked Damon, \"Say, if I'm going to be living with you, don't you think I need to know about you some?\" Damon chuckled a little and shrugged his boulder-like shoulder. \"Fair enough.\" He said. \"I'll tell you where I'm from and why I want to help you.\"<br>\r\n<br>\r\n<br>\r\n\"You and I have a lot in common Ryder,\" Began Damon. \"Just like you, I was on the streets, but I wasn't alone. I was part of a gang. We called ourselves the 'Rolling Rovers.' I joined up because my dad was gone most of the time drinking and my mom didn't want anything to do with me. I thought the gang would always be there for me. Turns out I was wrong. My gang had a drag race with a rival gang for control over a section of the city. I was chosen to drive for my gang. I was racing in high speeds and my competitior rammed against me and I tumbled off the road. I must've blacked out because the next thing I remember is waking up at the hospital.\"<br>\r\n<br>\r\n<br>\r\n\"The doctors said I was going to be okay after some physical therapy but I was dead to the Rolling Rovers. A member came to my room telling me I was out for nearly getting them busted. Once again, I was alone. I thought I was done until I did physical therapy. I actually enjoyed it. I was satisfied with the fact that I was getting stronger and faster every day. After I was done with the hospital, I wanted to take it up a notch, so I decided to give bodybuilding a try. As you can see, I never gave up on it.\"<br>\r\n<br>\r\n<br>\r\nRyder was blown away by Damon's story. He thought he had it bad but nothing could beat Damon's past. Even though Ryder thought Damon had it rough, he was really impressed on how it ended. Damon went from a scrawny punk kid to a massive bodybuilder! \"That's a really cool story,\" Said Ryder.\"So, why do you want to bring me in? There are many of other kids like me.\" That's true,\" Damon responded, \"But I see potential in you. You can get out of the streets and do things you never thought you could do. I want to see that happen.\" \"How?\" Ryder asked. Damon smiled at him and said, \"By being a bodybuiler!\"<br>\r\n<br>\r\n<br>\r\nRyder's ears perked up. \"What?\" He exclaimed. \"Think about it!\" Damon said. \"You'll look good and feel good about yourself. There are also some competitions that will pay a lot of money. You'll be on your own doing great in no time!\" \"But there is one flaw in your plan,\" Said Ryder. \"If I were to become a bodybuilder, it would take months if not years for me to see results let alone a competition.\" \"I didn't say it was going to be easy,\" Said Damon. \"That's part of the journey to make you tougher and be ready for anything! I believe you can do this. I literally can see it in your future. I will train you personally. You'll be the biggest guy around!\"<br>\r\n<br>\r\n<br>\r\nRyder pictured himself covered in muscle. He really liked the idea of becoming stronger than the guys who picked on him. Confidence grew faster and faster within him. \"Ok,\" He said, \"I'll do it!\" \"Great!\" Said Damon. \"You won't regret it! This is going to be awesome!\" \"When do we start?\" Asked Ryder. \"Tomorrow morning,\" Answered Damon, \"So get plenty of sleep. Tomorrow is going to be the start of the rest of your life!\"</span></div></div>",
            "created":1325031900,
            "id":1247449,
            "title":"Get to know Damon more"
        },
        "1121":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "Jog to the Gym",
                "Take a break"
            ],
            "content":"<div class=\"\"><div> <span>Ryder was both nervous and excited about tomorrow. He knew that bodybuilding was a difficult and long process, but Ryder went back to the thought of him muscular and strong. Nobody would want to pick on him then. Sleepiness came onto Ryder all of sudden and he looked at a nearby clock of the wall to see it was close to midnight. He decided to call it a night. He went upstairs to his room. Ryder's room wasn't luxurious but it had the necessities. It had a bed, closet, windows, and a lamp. Ryder didn't mind as long as he could get some sleep. He didn't bother uncovering the bed sheets. The moment he laid his body on the bed, Ryder went into a deep sleep.<br>\r\n<br>\r\nDamien came into Ryder's room wearing a tank top and spandex shorts and holding 30 lbs. dumbbells in each hand. It was 7:00 in the morning. Time to get up. Damien lifted the dumbbells to his chest and dropped them on the hard wooden floor. The loud crash woke Ryder up instantly. Ryder stood up disoriented and confused. \"Huh,\" said Ryder still groggy, \"What's happening? What's going on?\" \"Training,\" said Damien simply. \"Get dressed and meet me downstairs. Clothes are in the closet.\" Damien picked up the dumbbells and left the room.<br>\r\n<br>\r\nRyder walked towards the closet and opened it to find gym clothes in his size. He put them on and head followed Damien. Ryder found Damien sitting next to a table with two plates of scrambled eggs, bacon, and toast. \"Sit down and eat.\" said Damien. \"The first thing thing to know about bodybuilding is always eat.\" Ryder couldn't help himself but to eat. Finding food on the street was very hard for him. There were even times when he wouldn't eat for days. It was the best meal Ryder ever had. Ryder shoved the food into his mouth forgetting his table manners. Damien understood. Before too long, they were both done with breakfast. \"Follow me.\" Damien said to Ryder.<br>\r\n<br>\r\nDamien led Ryder to a door that had downward stairs behind it. The stairs led to Damien's basement turned personal gym. There were a rack of assorted dumbbells to the left of the room and a weight bench to the right. There was also a punching bag at the center of the room. Ryder stood impressed until Damien passed the 30 lbs. dumbbells from earlier into Ryder's hands. He could get a grip on them, but the dumbbells were really heavy to Ryder. He thought he couldn't move his arms with them. \"Give me 30!\" Damien commanded.The dumbbells got heavier as Ryder heaved them up to his chest. He felt his muscles and tendons in his arms straining. Every time Ryder let the dumbbells down to catch his breath, Damien would yell at him not to quit and keep going. After a long while, Ryder finally made his last rep and allowed the dumbbells to drop hard on the floor.<br>\r\n<br>\r\nDamien turned his attention to the weight bench. He added new weights on each side of the bar and told Ryder give him 10 reps with the bench. \"Are you kidding me?\" gasped Ryder with his arms numb. Damien just glared at him. There was something really frightening about Damien's eyes that made Ryder feel guilty and scared. He rushed to the bench.<br>\r\n<br>\r\nRyder lied down on the bench, his arms still aching from the dumbbells. Damien continued to glare at Ryder, so Ryder pushed the bar with the strength he had left. The bar was heavier than the dumbbells, maybe 15 lbs. heavier. Ryder pushed every rep with everything he had and the bar got heavier after each rep. He feared it would fall on him or his arms would snap off. Damien's yelling fueled Ryder's adrenaline until Ryder finally made 10 reps. Ryder laid his head back on the bench and let his arms hang on each side. Ryder didn't see it, but Damien let a small smirk pass him. Damien could see the potential in Ryder.      </span></div></div>",
            "created":1343356080,
            "id":1390161,
            "title":"Start weightlifting"
        },
        "11211":{
            "author_id":"bluribbonrabit",
            "author_name":"blueboxer",
            "choices":[
                "Train till they were tired...",
                "Make a fitness plan..."
            ],
            "content":"<div class=\"\"><div> <span>Taking a moment for a break, he thought just trying to meet his needs with food and shelter was tough, he'd never had to work so hard for something before. This was difficult and challenging, but really dedicating his life to something really took his mind off of the thoughts of his lovely late mother and his belligerent father.<br>\r\n<br>\r\n\"We ain't done yet? You ready for some cardio? Let's take a jog to the gym. Its a couple of blocks and a great way to greet the day,\" said Damon pepped and excited. Seeing his young pupil brought a sense of pride to him that he'd hadn't felt in many years.<br>\r\n<br>\r\nRyder grumbled a bit, but agreed. Grabbing his worn out sneakers by the door, the left had a hole in its sole, \"And when we're done with today's workout we can get you some new shoes. Some cross trainers for sure. We need to build your core first and most important thing when starting out.\" Walking and showing him how to keep his spine straight while even doing something as simple as jogging would reduce strain on his lower back. \"Too many amateur bodybuilders always start out with awful lower back problems. It usually kicks them out of the game far too early,\" he explained while keeping pace. \"You think I should get a whistle?\" Damon joked and laughed, his grin plain to see.<br>\r\n<br>\r\nRyder was just rolling with the punches. A couple of blocks he said like it was nothing. It would usually take Ryder a good day just to make it 'cross town at his normal pace, though Damon might have been right about the whole posture thing. He could feel himself being ten times better than he was yesterday. Maybe one day when he was huge and massive, he'd take in a kid and help that kid out. But first he had to beat the rascal panther to the gym to get a free protein shake before they started their next bit of training.<br>\r\n<br>\r\nWalking up the steps to the gym, felt great for Ryder as he beat Damon. Only because he stopped at a crosswalk. Silly guy, he'd dodge lights all the time just so he didn't have to wait. He had done a little parkour, so he liked taking the risk as he hopped and skidding over a moving vehicle.<br>\r\n<br>\r\nSeeing Damon coming the steps he was stressed with worry, \"Hey, you should be more careful next time. Crossing the street is serious business.\"<br>\r\n<br>\r\nPlayfully punching the big cat in the arm, \"Sorry 'dad'. I was in the moment.\"<br>\r\n<br>\r\nHe could see he had the spirit to win too. He'd make a great bodybuilding competitor. \"So what was that move back there you used to get on the car?\"<br>\r\n<br>\r\n\"O that was just a little parkour. A skill I picked from running away from some Truancy officers...\" Ryder bit on his words.<br>\r\n<br>\r\n\"Don't tell me the great Ryder Raccoon didn't finish high school?\"<br>\r\n<br>\r\nHe began to walk inside, kicking at the ground, his voice was low so others wouldn't hear him, \"School was a real drag, not my thing. They kept asking what was wrong with me. They didn't know about the stuff at home... I'd rather not talk about it, let's get back to training,\" he said trying to change the subject. <br>\r\n<br>\r\nDamon looked on, his expression on his face was of a serious, yet understanding nature. He didn't push so hard, knowing he might push Ryder away and he could run again. Getting his mind focused on training was the only way he was going to get him to open up to him. Grabbing vanilla protein shakes for two of them, the long-time employee female flamingo asked about the kid, as he said he was just he was taking care of him. No other strings attached, no sense of force, just simply the truth.<br>\r\n<br>\r\nRyder always felt like he had to run to get away from the things that were bad; from people, from situations and the world, even. He didn't think anyone cared for him anymore since his mother died, but this panther. This complete stranger saw something in him and he opened his whole life for him. He was giving him a place to stay, fresh clothes and food. He had done more for him than his real father had in the last 2 years. Not even asked for him to repay it back, out of the goodness of his heart. Now that was something, Ryder thought. With Damon, Ryder didn't feel he had to run, yet if he did he felt he would have to say goodbye and thank the panther for all that he had done.</span></div></div>",
            "created":1389837000,
            "id":1728182,
            "title":"Jog to the Gym"
        },
        "112111":{
            "author_id":"worshipper",
            "author_name":"worshipurmuscles",
            "choices":[
                "Measurements",
                "Back to the dinner to protect his girl"
            ],
            "content":"<div class=\"\"><div> <span>The two trained till they were beat. Then Ryder lifted some more, while Damon chatted with the staff. Yes, this was a good sign that Ryder wanted to keep going, motivated. Even better, was that he kept to the proper lifting techniques that Damon had demonstrated. By the time he was done, his veins were popping &amp; he was filling out his shirt. Now, a month had passed and it was time to see what Ryder was made of.</span></div></div>",
            "created":1434197340,
            "id":1991884,
            "title":"Train till they were tired..."
        },
        "11212":{
            "author_id":"worshipper",
            "author_name":"worshipurmuscles",
            "choices":[
                "After a week, muscles are starting to show",
                "After a week, stronger, but little visible muscle yet"
            ],
            "content":"<div class=\"\"><div> <span>After all that lifting, which was a shock to Ryder's body, Damien made him do a lot of stretching so as his muscles might be able to function for the day. Then Ryder had the rest of the day off to let his muscles repair &amp; build. Ryder spent much of the rest of the day stuffing his face &amp; downing protein shakes. Ryder could hardly lift his arms, but felt good none-the-less. He felt more of a man. He looked forward to the next day when they would work on his legs.<br>\r\n<br>\r\nRyder stood outside a pizza shack where he had just consumed a large pizza all by himself. The waitress who had taken care of him, came outside for her break. She was about Ryder's age and he found her to be very pretty. He loved how petite she was. Ryder wondered what it would be like to bench her. Suddenly, a guy came out, grabbed her by the arm, and told her to get back inside. Ryder did not like how the guy had grabbed her. The guy was more big &amp; bulky than muscular, but Ryder knew that after only one day of lifting, he was no match for him ... yet. The guy glared at Ryder telling him to stay away.<br>\r\n<br>\r\nRyder looked at his arms. They were not big after one workout, but the veins were showing. Now Ryder had even more motivation to bulk up. He would be back.</span></div></div>",
            "created":1343479200,
            "id":1391737,
            "title":"Take a break"
        },
        "112122":{
            "author_id":"nyx2857",
            "author_name":"Thoughtful Writer",
            "choices":[
                "3 years later",
                "5 years later"
            ],
            "content":"<div class=\"\"><div> <span>Ryder was working really hard with Damien as the week went by. Every day, the training got harder for him. The weights got heavier, the jogging track got longer, and Damien got more strict. Every time Ryder dropped from exhaustion, Damien would just get into his face and yell at him to keep going if he was to go anywhere. It was Monday morning and Ryder met Damien in the basement gym after his breakfast. Damien held a weight scale in one hand and a tape measure in the other. Ryder never saw Damien with those before. \"What's going on?\" Ryder asked him. Damien put the scale on the floor and said, \"We're are going to check your progress. Every week we will see how much muscle you're gaining. Step on the scale and we'll check your weight. I will then check your arm measurements with the tape measure.\" Ryder started to get excited about his progress. He definitely felt stronger since he started. Ryder looked at Damien in the eyes. \"Ok. Let's do it.\" Ryder said.<br>\r\n<br>\r\nRyder stepped onto the scale and waited for digits to show up on it. He knew he made some progress. He could feel it. Ryder started at 160 lbs. and scale showed 165 lbs. He only gained five pounds of muscle. That was it? All that hard work just for five meaningless pounds? Damien took Ryder's arm and wrapped around his bicep. After a second of checking, Damien said, \"You got 10 cm on your arms.\" Ryder did not expect this type of result. He was hoping to see more muscle definition but he came up short; just like how he felt towards himself on the street.<br>\r\n<br>\r\n\"Seriously,\" Ryder asked, \"That's it?\" Damien put his massive hand on Ryder's shoulder and squatted to his level. Damien could see Ryder was disappointed. \"I told you this wasn't going to be easy.\" He said to him. \"It's going to take a lot of time and effort. You can't expect results right away but you can do this if you want this enough. I wasn't joking when I said I saw potential in you. When you grow up, you will be the most confident and inspirational person anyone will ever meet. I can help you show you the way but you must choose what you want to do.\"<br>\r\n<br>\r\nRyder never heard Damien talk like that. It sounded like he actually believed in him. Nobody has ever thought of Ryder so strongly before. He then thought of the girl at the diner the other day. It would've been good if the new Ryder could help people like that on the side of bodybuilding. Ryder understood what Damien was trying to say and he trusted him that he would lead him the right direction. \"Ok,\" Ryder told Damien. \"Let's do this. I don't care how long this will take. I want to keep trying.\" Damien smiled and stood up. He then acted like his speech never happened and told Ryder to pick up the 50 lbs. dumbbells. </span></div></div>",
            "created":1343855280,
            "id":1395467,
            "title":"After a week, stronger, but little visible musc..."
        }
    },
    "info":{
        "author_id":"nyx2857",
        "author_name":"Thoughtful Writer",
        "brief_description":"A homeless teen is brought in by professional bodybuilder! What will happen?",
        "created":1319348100,
        "description":"<td align=\"left\" class=\"norm\">Ryder, a 16-year-old raccoon ran away from home and its been tough for him since. He's been ignored by \"normal\" people and beaten up by other street kids. It seems there is no hope for him, until Damon, a  34-year-old and bodybuilding panther came into his life! How will things look for Ryder now?<br>\r\n<br>\r\nRules:<br>\r\nNo gay stuff<br>\r\n<br>\r\nNo vore stuff<br>\r\n<br>\r\nNo sex<br>\r\n<br>\r\nMG only (No fattening)<br>\r\n<br>\r\nNo muscle growth until he pops</td>",
        "id":1820624,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1434197340,
        "modified":1434197340,
        "pretty_title":"Tough Muscle"
    }
}