{
    "chapters":{
        "1":{
            "author_id":"toelover222",
            "author_name":"AwesomeSauce",
            "choices":[
                "Pokemon",
                "Dragon Ball Z",
                "Naruto",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Please pick a world.</span></div></span></div>",
            "created":1312609740,
            "id":1162359,
            "title":"It Begins "
        },
        "11":{
            "author_id":"toelover222",
            "author_name":"AwesomeSauce",
            "choices":[
                "Humans ",
                "Pokemon"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Humans or Pokemon?</span></div></span></div>",
            "created":1312609740,
            "id":1162360,
            "title":"Pokemon"
        },
        "111":{
            "author_id":"toelover222",
            "author_name":"AwesomeSauce",
            "choices":[
                "Ash",
                "Max",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which boy should grow?</span></div></span></div>",
            "created":1312611360,
            "id":1162383,
            "title":"Humans "
        },
        "1112":{
            "author_id":"toelover222",
            "author_name":"AwesomeSauce",
            "choices":[
                "He started to grow",
                "Nothing happened"
            ],
            "content":"<div class=\"\"><div> <span>Max has always been small. He was often teased for his height at school. It only got worse when he started traveling with Ash and his friends. Everyone that they met was always taller than him, and Ash, May and Brock were also taller.  Every night he would pray and wish to be taller, but it never came true. One morning, he woke up, eyes glues with sleep, and searched for his shoes. By mistake, he grabbed Ash's shoes and slipped them on and walked out into the living room. Everyone laughed at him, seeing how Ash's shoes were about 5 sizes too big. \"Wow Max, you have really tiny feet\" laughed Brock. \"Nuh Huh!\" shouted max, kicking off the over sized shoes.\"Ash just has big feet!\"!\" Well,\" said Ash, propping up his feet on the table. \"I do have big feet\" He said with a large grin. Everyone stared in astonishment at Ash's huge feet. \"Hey shrimp!\" Ash said, looking at Max. \"Bring my shoes over here!\". Max picked up the shoes and brought them over to Ash. Just as he did, Ash shoved his foot in his face. \"How does that smell?\" he said with a laugh. Max was blinded by the large foot covering his face. The smell was awful! He pried Ash's foot off and ran to his room in embarrassment . If only he was tall! Then he could humiliate Ash like that. He wish harder then he ever had before. </span></div></div>",
            "created":1312613820,
            "id":1162406,
            "title":"Max"
        },
        "12":{
            "author_id":"toelover222",
            "author_name":"AwesomeSauce",
            "choices":[
                "Humans",
                "Saiyans"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Humans or Saiyans?</span></div></span></div>",
            "created":1312609860,
            "id":1162361,
            "title":"Dragon Ball Z"
        },
        "13":{
            "author_id":"toelover222",
            "author_name":"AwesomeSauce",
            "choices":[
                "Naruto",
                "Choji",
                "Kiba",
                "Shikamaru",
                "Sasuke"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who will grow?</span></div></span></div>",
            "created":1312609920,
            "id":1162365,
            "title":"Naruto"
        },
        "14":{
            "author_id":"toelover222",
            "author_name":"AwesomeSauce",
            "choices":[
                "Sure",
                "Nope"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Family Guy?</span></div></span></div>",
            "created":1312610040,
            "id":1162366,
            "title":"Other"
        },
        "141":{
            "author_id":"toelover222",
            "author_name":"AwesomeSauce",
            "choices":[
                "Peter",
                "Chris",
                "Brian "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which guy?</span></div></span></div>",
            "created":1312610100,
            "id":1162367,
            "title":"Sure"
        },
        "1413":{
            "author_id":"toelover222",
            "author_name":"AwesomeSauce",
            "choices":[
                "20 ft",
                "50 ft"
            ],
            "content":"<div class=\"\"><div> <span>Brian had had a long day. He spent all morning barking at sticks, then had lunch and spent the rest of the day digging up and burying bones. He was beat. As he walked up the stairs to go into Peter's room, he heard a loud bang coming from Stewie's room. He quickly ran over to see what the noise was about.  <br>\r\n\"Alright Stewie what've you done now\" he asked impatiently, glaring at him. \"Oh good, Brian. You're just in time to see my latest device\" exclaimed Stewie, looking excitedly at Brian. <br>\r\nHe lead him over to a ray gun. \"This\" said Stewie \"Is my latest invention. The size-enhancer ray. It takes any living or non-living organism and enhances it size to epic proportions!\" <br>\r\n\"Why would you ever need that!?\" asked Brian. \"I dunno, seemed like something cool to have\" said Stewie. \"That's it, I'm out of here.\" exclaimed Brian as he began to walk away. \"Wait wait wait!\" said Stewie, running after him. \"Don't you want to see it work?\" \"Fine\" replied Brian. Stewie ran over to the machine and pointed it at a small rubber ball in the center of the room. A green beam shot out of the ray gun and hit the ball, causing it to grow rapidly. It stopped when the ball was at eye level with Brian. \"See isn't it cool?\" said Stewie. \"Yeah great\" said Brian, rolling his eyes. \"I'm out of here\". \"Noooo. Lets grow more stuff\" said Stewie as he flipped the gun on again. The blast that was aimed at this crib rickashayed of the metal bar and hit Brian right in the back, causing him to fall over. \"Oh god are you okay?\" Yelled Stewie. \"Yeah I'm fine... but I think I'm growing!\" said Brian as his collar popped off. He quickly grew larger and larger, filling the room. Stewie was smashed up against the wall by Brian's rapidly growing paw. His toes quickly passed over Stewie's head. \"Ewwww It's smells so bad' Shouted Stewie from behind his paw.<br>\r\nBut, How big did Brian get?</span></div></div>",
            "created":1312611300,
            "id":1162382,
            "title":"Brian "
        }
    },
    "info":{
        "author_id":"toelover222",
        "author_name":"AwesomeSauce",
        "brief_description":"Giants of all shaped and sizes",
        "created":1312609500,
        "description":"<td align=\"left\" class=\"norm\">This is a giant story about boys who grow large.<br>\r\nJust a few quick things:<br>\r\n1: Only Boy Giants<br>\r\n2: Please no sex<br>\r\n3: No toilette stuff.<br>\r\n<br>\r\n<br>\r\nI'm not a grammar nazi, but please try to make it readable. I want all chapters (Choice excluded) to be a decent 5 sentences. long.<br>\r\nOther than that, go crazy!</td>",
        "id":1799647,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1312613820,
        "modified":1312613820,
        "pretty_title":"Big Boys"
    }
}