{
    "chapters":{
        "1":{
            "author_id":"misterwerder12",
            "author_name":"misterwerder",
            "choices":[
                "Growing",
                "Shrinking"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>At first:<br>\r\nShould a celebrity grow to a mega-giantess or should she shrink one ore more guys and play with them ?</span></div></span></div>",
            "created":1334379600,
            "id":1315183,
            "title":"Beginning"
        },
        "11":{
            "author_id":"misterwerder12",
            "author_name":"misterwerder",
            "choices":[
                "Selena Gomez",
                "Victoria Justice",
                "Miley Cyrus",
                "Miranda Cosgrove"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ok, hat celebrity hould grow to a mega giantess ?</span></div></span></div>",
            "created":1334379600,
            "id":1315186,
            "title":"Growing"
        },
        "111":{
            "author_id":"them",
            "author_name":"theM",
            "choices":[
                "One ",
                "Two",
                "Three"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Storyline number</span></div></span></div>",
            "created":1398315600,
            "id":1785991,
            "title":"Selena Gomez"
        },
        "1111":{
            "author_id":"them",
            "author_name":"theM",
            "choices":[
                "Selena tries it out right there",
                "She goes home to try it out"
            ],
            "content":"<div class=\"\"><div> <span>  Walking down the street, Selena was having a nice day. It was the middle of July and she decided to take a walk. She has on simply a pair of jean shorts and a white tank-top. She didn't care what press saw her. She was quite confedent that it was going to be a great day. She was indeed correct<br>\r\n  She seem to come across what seemed to be a home man. He didn't look threatening, in fact he looked rely sweet. Selena felt rely sorry for him and went up to the man.<br>\r\n<b>Selena</b>: Escuse me sir.<br>\r\n<b>Me</b>: You're (trying to remember) Selena Gomez, right.<br>\r\n<b>Selena</b>: Yeah, do you need some money. I got plenty I can spare.<br>\r\n<b>Man</b>: Oh no. But thank you. You don't rely want to know what just happened to me.<br>\r\n<b>Selena</b>: What?<br>\r\n<b>Me</b>: I found this. (He shows her a ring.) It took me a while to figure out but it can change the size and shape of anything, and as I heard it can do much more than that. But i couldn't control it.<br>\r\n  Selena didn't honestly believe this man's story but she did think it would be cool.<br>\r\n<b>Selena</b>: Can I try?<br>\r\n<b>Man</b>: You're more than welcome to. (Gives her the ring)<br>\r\n  Selena puts on the ring and manages to concentrate. A second later she opened her eyes and the man was not but a foot tall. She picked him up.<br>\r\nSelena: Wow, this rely works.<br>\r\nMan: Do you want to keep it? I think you can control it better than I could.<br>\r\nSelena: Sure, why not? You should live a normal life.<br>\r\nMan: Thank you. <br>\r\n  In just an few seconds the man was back on the ground and at normal height. <br>\r\nMan: But please tell no one else that i had it.<br>\r\nSelena: Whats your name<br>\r\nOliver: Oliver. (he leaves)</span></div></div>",
            "created":1398315600,
            "id":1786004,
            "title":"Goddess of the Rings"
        },
        "11112":{
            "author_id":"fuzzyboy",
            "author_name":"Fuzzywuzzy",
            "choices":[
                "Squish him with her foot. ",
                "Other."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Selena walks home and goes inside her house to see a perverted man smelling her shoes, underwear, bras and socks. She uses the ring and blinks. She opens her eyes to see him on the floor half the size of her foot. She decides to _________.</span></div></span></div>",
            "created":1417150800,
            "id":1894779,
            "title":"She goes home to try it out"
        },
        "1112":{
            "author_id":"grobnar",
            "author_name":"Grobnar ",
            "choices":[
                "It described a location in the Mediterranean, buried under the sea. ",
                "It showed a ritual to unlock one's inner goddess, whatever that meant..."
            ],
            "content":"<div class=\"\"><div> <span>Selena took a year off. Supposedly it was to recover from the burnout she was experiencing, but that was only half the tale. While she was on tour she entered a small little shop that was somehow larger inside than out. She explored aisle upon aisle of dusty books and display cases filled with old jewelry. The brunette wasn't interested in jewelry however, she had more than enough. Instead a particular tome caught her eye. <br>\r\n<br>\r\nShe silently grabbed the book and purchased it. When she got back to her hotel room she started looking through the ancient pages. Upon further examination she realized….</span></div></div>",
            "created":1491236940,
            "id":2299094,
            "title":"Growing Situation"
        },
        "112":{
            "author_id":"misterwerder12",
            "author_name":"misterwerder",
            "choices":[
                "Grow even more",
                "starts rampaging through the city",
                "instruct the surrounding people, that they should worship her"
            ],
            "content":"<div class=\"\"><div> <span>This Story begin in one of the richest region of Hollywood. Accurate in the mansion of Victoria Justice.<br>\r\nVictoria watches her own series \"Victorious\" when suddenly somebody knocks at the door. Victoria stand up from the coach and opens the door. But when she looks out, she doesn't see anybody. But then she looks downward and see a little liquid and a letter. she takes it and went inside her mansion. she opens the Letter and start reading. \" Dear Vctoria, your such a big star and thousands of people worship you, now it's the  time that veryone in the whole world should worship you!, Drink this Liquid and you get the power to change your height and the and the eight of somebody else. You just must to think about it, and it will happen!\".<br>\r\nAt first victoria thinks that tis was a joke, but then she gets curious. she drinks thewholeliquid and after it she feel  little bit strange. She looks down at her body. She wearing a red tank top which show her b-cup breasts, a tight jeans and knee height leather boots. he lokks at her not so big breats. then she starts thinking. \"hmmmm, that liquid makes me feel so strange, perhaps it could work\". Then she starts thinking about bigger breats. and after a few secondes, she fells that her boobs begin to grow.. they grow finally to the size of d-cup breats.<br>\r\n\"omg, they are so great!\" victoria say and grab her now massive boobs.<br>\r\nthen victoria starts to think about her whole body and then she starts growing. She finally stops at a height from 8 feet. But this was not enough foVictoria, she always want to be a very BIG girl and o she starts growing more and more. she outgrow her house and notice, that her clothes gow with her!<br>\r\nShe sops growing at a size of 1000 feet.<br>\r\nShe stands with her big black leather boots on the rest of her now tiny mansion. She was now as tall as the most skyscrapers, if not even taller.<br>\r\nNow she starts thinking, what she sould do now.<br>\r\n</span></div></div>",
            "created":1335848400,
            "id":1326885,
            "title":"Victoria Justice"
        },
        "1122":{
            "author_id":"ooo000",
            "author_name":"Me",
            "choices":[
                "She continues the rampage and then phones the president",
                "As she rampages, she suddenly becomes aware of the military coming towards her",
                "Satisfied she has made her mark she is tired and goes to find somewhere to sleep"
            ],
            "content":"<div class=\"\"><div> <span>As she stood there boots planted in the wreckage of hers and several neighbouring mansions she put her hands on her hips and smiled as she looked round at the tiny landscape below her. \"Hey this is sooo cool.....I'm soooo tall........time that everyone in the whole world should worship you?.......I like the sound of that, now to let the whole world feel the presence of a goddess\", she laughed loudly, which ominously echoed around the hills of Hollywood. The growth seemed to have affected her more than physically......With her comment she started walking, great strides, destructive strides.....as trees and buildings sunk under her boot soles. She looked round and saw her leather jacket, draped over the Hollywood sign, it had grown as well as she had picked it up before thinking herself to her present height and then accidentally dropped it. She walked over and put it on along with a pair of matching black leather gloves. Checking she had had her phone in her bag she walked towards the city crushing everything in her path. She then had a field day as she started methodically smashing everything in LA. \"This will give them a real reason to worship me....\", she laughed loudly, almost drowning out the sounds of death and destruction.......</span></div></div>",
            "created":1336280400,
            "id":1331156,
            "title":"starts rampaging through the city"
        },
        "11223":{
            "choices":[
                "She was still fast asleep and the millertery walked to her breast",
                "She wakes up and see the milliertry and she decides to eat them"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She goes to the biggest field in LA and lays down destoring near by buildings and she sleeps laying on her back but, the millertery was right on top and landed on her stomach uh oh! What's gonna happen next</span></div></span></div>",
            "created":1336539600,
            "id":1333299,
            "title":"Satisfied she has made her mark she is tired an..."
        },
        "112232":{
            "author_id":"misterwerder12",
            "author_name":"misterwerder",
            "choices":[
                "She rampages through L.A.   Destroying buildings and eat and squich peoples.",
                "She gets horny again and start masturbating in the city."
            ],
            "content":"<div class=\"\"><div> <span>When goddess Victoria fell asleep, six helicopters land on her sexy stomach.<br>\r\n100 soldiers went out of them and ran over her stomach towards her breasts.<br>\r\nBut Victoria wake up and see all the little soldiers on her stomach. When the soldiers notice that Victoria wake up they begin to shot on Victoria face.<br>\r\nBut Victoria just laughs evilly and grab ca. 70 soldiers and bring her to her face. She saw that they struggle for their lives, but Victori feel no mercy for them. She feel very dominant and throw all people in her giant mouth and swallow them alive.<br>\r\nThe 30 people who are still on her stomach look in fear at the goddess. Victoria smiles and grab them and whn the soldiers struggle for her life, Victoia feel very horny. She open her leather pants and showed the soldiers in her pussy. She begin to moan louder and louder and then she cums over the field. Victoria sets now on her back, resting for these great orgasm and then she notce, that she begin to grow again.<br>\r\nShe grow bigger and bigger and finally stops at a height of 1 mile. She looks around and saw that the most buildigs just go to her knee. She now felt more dominant then before and begin to realize that she can do waht she want now. </span></div></div>",
            "created":1336626000,
            "id":1333894,
            "title":"She wakes up and see the milliertry and she dec..."
        },
        "1122321":{
            "choices":[
                "Make the people respect her as a goddess",
                "Or does she eat them all!!"
            ],
            "content":"<div class=\"\"><div> <span>As she thought that wicked idea, she took of her leather boots and destroy LA bare footed. She destroied trees, rocks, boulders, people and anything that standed in her way and stomp after stomp, she also eats the people living there, she grabbed hundreds and hundreds and tossed them all in her giant mouth \"mmm delishius I never knew people tasted SO good!!! And you know what I'll have some MORE!!!\" she shouted as she was having an evil laugh and that made the people terrified and scattered to the nerest exit but no good! She blocked them ALL!!! They all begged for mercy but that only made Victoria even more hungry she can eat them all!!! And with that wicked smile on her face what's she planing this time???!!!</span></div></div>",
            "created":1336712400,
            "id":1334529,
            "title":"She rampages through L.A.   Destroying building..."
        },
        "11223211":{
            "choices":[
                "She was being controlled by the guy who gave her that potion (gental giantess)",
                "Or she is fine but just got mad with power (evil giantess)"
            ],
            "content":"<div class=\"\"><div> <span>The people scattered every where in panick until \"BE QUITE!! AND BOW DOWN TO YOUR NEW GODESSE!!!\" Victoria Justice  shouted in a stricted voice and in that spit second they all got on there knees and bowed down to her. Victoria justice exclaimed \" well well well now that I got your attention. I well be your new godesse and you well only worship me and no one else and you will be my slaves to rub my feet, brush my hair and do what ether I want with you and now everyone in the whole world well bow down to me and the world well be ruled...\" she was about to finish her sentance until \"not to people like you\" you said and then Victoria giggled as she grabs you,lefts you up to her face, looked at you with a steely look and replyed \"he he he really? Ha! I am a buteiful celeb, loved world wide, 2000 feet tall and more powerful then any human out there, there's nobody that's just like me\" <br>\r\n\"you crave power, you want to destroy and eat living and good people, you think your a some kind of godesse that's above anything just becuase you big. They well always be bad people like you\" you exclaimed and then she opened her hand and she slaps her other hand on it. Your still alive but barly but Victoria had something wired what was it?...</span></div></div>",
            "created":1336712400,
            "id":1334537,
            "title":"Make the people respect her as a goddess"
        },
        "112232111":{
            "choices":[
                "She well go to that guy and get revenge",
                "It was all a dream"
            ],
            "content":"<div class=\"\"><div> <span>That guy who have her the potion hated her and wanted her entire car'e to be destroied things were looking grim when you passed out and she was about to throw you into her giant mouth until she started fighting back from the inside and she broke free, she was shocked and felt a great deep guilt for everything she done when she looked around, she then put you down gentaly on the ground, unblocked all the exits with her goddess striagth and she ran away trying not to cause any more damage she done to a giant forest. She stopped at the beach cliff away from any cities, towns or villages and she sobboed \"what have I done?... I'm a monster, my career ruined... My entire life ruined\" she said to her self between the sobbing and the tears coming from her eyes and she contuied to cry and when she wanted to sleep, she have to sleep on the beach with her back laying on the cliffs \"everything... Everything I worked so hard for, everything I owned and everyone I loved... All gone\" she said between her tears what well happen...</span></div></div>",
            "created":1337749200,
            "id":1343742,
            "title":"She was being controlled by the guy who gave he..."
        },
        "1122321112":{
            "content":"<div class=\"\"><div> <span>It was all I pitch of black until the alarm click went of and woke Victoria up that looked like a dream, \"huh I'm back I'm My own room?\" she quistioned then she checked the news and the news paper and everything was normel with no giantess on any of the articals \"so the growing, the rampage, all a dream?\" she quistioned again then she looked outside the window andrawl of LA was normel they were untouch and unharmed in any way. \"thank you god it was all a dream\" she sighed in a collected relief. Later she found a package, she expected it to be a growth formula but it was a shrink formula, then the letter said \"dear Victoria Justice, I know how much you love your fans so I gave you this so that you can shrink a fan or two and make them do what ever you want, thank you from anyone\" \"hhmmm shrink any fan I want huh? That sounds like a great idea and I'll think I'll try that\" Victoria thought to her self. So she hosted a contest with the grand prize as to stay with Victoria Justice for how long you want, you won that contest but Victoria has somthing else planed for you but. That's a story for another time in the Victoria shrinking story...</span></div></div>",
            "created":1344661200,
            "id":1402389,
            "title":"It was all a dream"
        },
        "11223212":{
            "author_id":"gtsmicro",
            "author_name":"Gtsmicro",
            "choices":[
                "She continues her rampage",
                "She grows even bigger"
            ],
            "content":"<div class=\"\"><div> <span>Victoria laid on her stomach and lowering her head to scoop hundreds of people with her tounge and shoved them in her mouth.<br>\r\n<br>\r\n\"Oh man, you little ants are even more tastier then the last batch\" Victoria gloated licking her lips. \"I wonder what a sky scraper would taste like?\" As she looked towards the highest building filled with terrified civilians. <br>\r\n<br>\r\n\"Let's find out!\" she exclaimed lowering her hand and uprooted the building with hundreds of poor souls who were about to meet their fate. Victoria noticed that even the tallest skyscraper was just a palm sized doll house to her, which filled her with more arrogance of being an unstoppable goddess of destruction.<br>\r\n<br>\r\n\"Well aren't you all lucky mortals\" Victoria said looking down at the people trapped in the building on her palm \"you all get the pleasure of bringing happiness to your goddess by pleasing her stomach and her amusement!\" She started to slowly shove the skyscraper in her mouth, taking joy of the screams of her victims \"Her comes the Chu chu, with all of the passengers included!\" Victoria giggled as she shoved the building on her mouth and swallowed it whole, leaving the building to be burnt way by her stomach acid.<br>\r\n<br>\r\n\"Mmm that was so amazing, I should've made myself goddess years ago, now let's see what over punishments I will give to these teeny, tiny, mortals\" She cackled as she goes mad with power, it seams as thou nothing can stop her rain and terror on the planet anytime soon.</span></div></div>",
            "created":1462676880,
            "id":2144633,
            "title":"Or does she eat them all!!"
        },
        "113":{
            "author_id":"dittofury",
            "author_name":"cookiedude",
            "choices":[
                "crushed in my boobs?",
                "shoved up my ass?",
                "inserted into my cunt?"
            ],
            "content":"<div class=\"\"><div> <span>you've finally done it, you've made it to the set of Hannah Montana, you never really cared for the show but you always thought the hottest woman on earth starred in it, Miley Cyrus. Although you are still part of the tour group, there is no way Miley would even be bothered to go and meet them, why should she, she's most probably busy anyway. You sneak off quickly, you figure that if you get caught you'll just make some excuse up about going the bathroom and getting lost. eventually the lie becomes truth as you don't recognize any of your surroundings, \"where did the boiler come from? why are there so many electrical wires around here?\" eventually you get annoyed and just stop looking around, a large room, a big machine was the only inhabitant, it was almost as if you had walked right into Area 51, but no people. you begin to panic and look around frantically, you rest your head in your palms and just give up. 'I guess i'm not seeing Miley today' you think. \"Hello, are you okay?\" A voice sounded, a familiar voice, you turn to see Miley, standing there in all her beauty, you're speechless. eventually you make the simple reply, \"yea.\" Suddenly everything you say becomes stupid as you replay it in your mind, \"well, you look quite cute, come over here so I can get a look at you.\" You're close to fainting, Miley Cyrus called you cute, wow. you step closer to her, stumbling a little as your knees shake, you come to grips with yourself and try to walk right. left foot, STAMP, right foot, STAMP, left foot, *click*. 'what was that?' you think to yourself, you look down to see a button, the machine begins to make a whirring noise, you turn to see the machine pointing in you and Mileys direction, you turn back to Miley to see her standing on a red 'X' she hasn't noticed yet, she just continues to give you a breathtaking smile. a fraction of a second later, the machine hit, Miley jumped, as if she had received a static shock. \"I feel strange,\" she said. she grew a foot. \"What the--\" both of you say together, another, another,  another, I cant breathe, she said as she reached about 8 foot. \"it's your clothes,\" you shout, i guess the growing only affects organic material. she stops growing for a few seconds at 10 feet, you are still watching with awe, you want to help her get out of her clothes but you don't want her to think you're a pervert. \"i think it's stoooahhhh\" she shouted, as the temporary delay just made her grow quicker, at 15 feet all her clothes ripped off into shreds on the ground. at 20 feet her shoes her crushed under her wait. she stopped at 25 feet. she stares around, confused, you snap a photo on the sly then a video. you quickly conceal the phone as she looks down to you. \"You did this to me,\" she shrieked trying to conceal her nudity. \"I didn't mean to,\" you stutter back. \"Well now I'm going to make you pay,\" she reaches down and grabs him in her fist, she begins to giggle, \"how would you like to be.....</span></div></div>",
            "created":1335675600,
            "id":1325090,
            "title":"Miley Cyrus"
        },
        "1131":{
            "author_id":"headlesspuppy",
            "author_name":"Headlesspuppy",
            "content":"<div class=\"\"><div> <span>You look up at Miley in total terror. She grins and giggles evilly. Before you can run, she has you in her grasp. She places you in her titanic boobs and laughs evilly. \"Are you ready to die, bug?\" she asks. She then begins to press and squeeze her enormous breasts together. You try to stop the fleshy mounds from engulfing you, but there is nothing you can do. The last thing you hear is Miley's laugh and the words, \"Now to take over the world!\"</span></div></div>",
            "created":1412139600,
            "id":1864916,
            "title":"crushed in my boobs?"
        },
        "1132":{
            "author_id":"thegoldsheep",
            "author_name":"TheGoldSheep",
            "choices":[
                "*Try to escape*",
                "*Start licking*",
                "*Try to yell*"
            ],
            "content":"<div class=\"\"><div> <span>\"Uh-Erm\",you cant talk as it seems you don't have a choice. You are suprised when she turns around, bends over and looks back at you in her hands only a 1/4 inch tall compared to her, and lowers her hand down to ass level. With her free hand, she opens up her ass and shoves you into her butt crack. She giggles and pushes you deeper. All you see is darkness and butt flesh on all sides of you. \"So do you like the show?\", you figure she was talking about hannah montana but you werent sure, nor could you respond with your whole body in the rear of an actress. She than stands up and uses her ass muscles to squish you a little. Not enough to hurt you.</span></div></div>",
            "created":1395378000,
            "id":1764581,
            "title":"shoved up my ass?"
        },
        "1133":{
            "author_id":"misterwerder12",
            "author_name":"misterwerder",
            "choices":[
                "Grow even more",
                " have mercy with you and let you out",
                " loves it and don't let you out (perhaps grow more or search for more slaves("
            ],
            "content":"<div class=\"\"><div> <span>Her gigantic fingers grabs you and brings you up to her face. Meanwhile, Miley don't notice, that she still stands on the mark and so the machine fires against on her. She screams and begin to grow. She grow and grow and finally stop at a height of 100 feet. Then she look at you. \"you damn bug, why you do this to me?, no its time for revenge!\" She say with a dominant voice. you can't understand what you hear. Why she think, that you do this. you look around you, you were on the palm of mileys hand and you feel so insignificant, because you realize, that you are a bug to her. But then Miley close her hand and brings you down to her fabric. She shows you in her cunt until you are whole in. Then she starts jiggling because you squirming around in he fabric and tickle her. After that Miley _____________</span></div></div>",
            "created":1335848400,
            "id":1326964,
            "title":"inserted into my cunt?"
        },
        "11331":{
            "author_id":"cheeselover100",
            "author_name":"Cheeselover100",
            "choices":[
                "Crush him",
                "Eat him"
            ],
            "content":"<div class=\"\"><div> <span>While she was distracted with you wiggling in her cunt she still forgot about the machine as it kept on firing at her causing her growth to go up to 200 ft.\"Ugh, you damn bug, stop growing me\" Miley yells. She then takes you out and brings you up to her face and asked \"what should I do with you!\"</span></div></div>",
            "created":1463115960,
            "id":2146902,
            "title":"Grow even more"
        },
        "113312":{
            "author_id":"cheeselover100",
            "author_name":"Cheeselover100",
            "choices":[
                "Grow more",
                "Find more victims"
            ],
            "content":"<div class=\"\"><div> <span>Miley got an idea, she started to carefully take all of your clothes off and then she starts messing around with your other member once it is fully erected she grabs it and yanks it off (sorry if any guys out there reading this find this painfully real) and throws it in her mouth meanwhile you are flailing around on her palm screaming in pain. She then bits off your left leg, then the right, then the right arm, then the left, then ends the screaming and pain with the head, afterwards she just throws the remains into her mouth and it goes down with a gulp and a lump down her throat.</span></div></div>",
            "created":1463380140,
            "id":2148704,
            "title":"Eat him"
        },
        "114":{
            "choices":[
                "Miranda gets hit with a laser.",
                "Miranda drinks something.",
                "Other methods."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, now what will be the cause of her extreme growth?</span></div></span></div>",
            "created":1370149200,
            "id":1602561,
            "title":"Miranda Cosgrove"
        },
        "1143":{
            "author_id":"truleop",
            "author_name":"truleop",
            "choices":[
                "her feet were as big as a human",
                "her toes were as big as a human",
                "her nipple could cover a city"
            ],
            "content":"<div class=\"\"><div> <span>Miranda was sitting g at home, minding her own business and was beginning to get rather bored. So in private she took off her shirt and pants to reveal a pale flawless body. She began to take PFF her shoes and socks, revealing two soft and gorgoeus feet. Finally she took off her undergarments revealing small but perky breasts and a glistening wet pussy in thought of her dominating over many people. She began fingering herself and moaned and moaned. She felt a slight tugging on her skin as she grew to  </span></div></div>",
            "created":1400821200,
            "id":1801365,
            "title":"Other methods."
        },
        "11431":{
            "author_id":"truleop",
            "author_name":"truleop",
            "choices":[
                "are picked up and laid on her ankle",
                "you go towards her breast"
            ],
            "content":"<div class=\"\"><div> <span>She looked down and saw the tiny people below and was amazed that her wish had come true. People gazed up at her glorious body,meanwhile Miranda was still recovering from her orgasm. Unknowing to her and the people, many started moving towards her,as if drawn by the beautiful behemoth that was Miranda. They started climbing her feet and she didn't shoo them away,rather, she let them on. One tickled her foot and she started to laugh, shaking the ground and projecting her voice through the neighborhpod. As she wrinkled her toes in reaction, many fell down to their deaths and yet still they kept climbing.<br>\r\nYou, being one of the people drawn were one of the first to reach the top of her foot, she sees you and begins to move her hand towards you. Her fingertips grab you and she pulls you up to her face, saying \"you are going to be a very blucky person\". She lies down and let's you walk around her giant face. You reach the area b/n her lips and nose and feel the warm air breathing out of her gigantic beautiful nostrils. You climb on top of her lips, when she proceeds to lick them and you're astonished by the absolute size of her tongue. It extends outwards, almost reaching the clouds and you hear a loud \" schhluup\" as the tongue retreats back. You then</span></div></div>",
            "created":1400907600,
            "id":1801372,
            "title":"her feet were as big as a human"
        },
        "114312":{
            "author_id":"truleop",
            "author_name":"truleop",
            "choices":[
                "eats you",
                "makes you a foot slave"
            ],
            "content":"<div class=\"\"><div> <span>As you move towards her large (to you) fits, you feel her heavy breathing under you. Its as if you were on an ocean of porcelain skin and you can feel the softness of her snow white skin. As you reach her breasts, she orders you to climb them, which you heed and reach her nipple. Being the size of you, she says \"its okay, you can hug it\" which you then proceed to do. As her nipple became more erect, although you were already aroused, you become erect and miranda notices and smiles down at you, her gigantic face beaming in the sun. She picks you up to put you next to her gleaming wet warm pussy. She motions you towards it with her gigantic hands and you delve into where the clitoris is. She moans very loudly and says \"OH MY THAT HIT SPOT\". You're glad to have pleased her and continue towards the gaping cavern that was her pussy. Upon entering you ate met with hot sticky cum blasting its way out, its unbelievable show quickly she came and quickly proceeded down. Forcing you in with her fingers, you are choked up by her juices and are almost squished by her soft yet brutal fingertips. Finally, she </span></div></div>",
            "created":1400907600,
            "id":1801374,
            "title":"you go towards her breast"
        },
        "1143122":{
            "author_id":"truleop",
            "author_name":"truleop",
            "choices":[
                "she shrinks back down again ",
                "she picks you up out of her toenail and onto some more special places "
            ],
            "content":"<div class=\"\"><div> <span>Pulling you out of her wet pussy, she puts you on her feet and orders you to continue massaging her feet and licking it clean of the blood of the others she killed while you were worshipping her. Things began to take a turn for the worse when she begins to play around with her feet and toes. Shifting from lying Down on her back to her belly, your entire world is turned upside down and youbsturggle to hold on. Luckily you are caught by one of the wrinkleson her feet and land safelyin the cushion of her ball.making your way along her feet, she raises them up, giving you a view of her plump soft looking ass. She continues to kick her legs up and down and you feel very nauseous, but nevertheless you're happy to be serving your goddess. Miranda says \"you having fun back there\" and of course she can't hear you, but you continue worshipping her humongous feet and massage them no matter how much of it she actually felt, you being so miniscule to her. As you gain your composure, you breathe in heavily and smell the wonderful potpourri that was Miranda s feet. You begin to get the urge to have sex with her pinkie toe, wrich was about twice the size of you now (she's been growand mummy) . as you get closer to her pinkie toe, her constant wiggling of her tours makes it extremely difficult and you continue and finally reach her pinkie and commit yourself to cleaning, worshipping, and massaging every part of her foot starting from here. As you begin making hot love to her gigantic toe, you can feel the softness of her tour engulfing you, she was growing yet again and now, you fit snuggly into the wrinkles of her pinkie toe, but you didn't care, she was your world, in fact she was very close to rivaling the size of the world and you didn't want it to end there. As you kept on thrusting in SBD out of the wrinkles of her \"tiny\" pinky toe, she seems to have slammed her foot into the ground. You fall much slower than her foot and see how big Miranda grew from the air. Before you land, she turns herself around again and sees you faking and catches you right at the edge of her toenail. You hang on for dear life and drop down gently into her toenail, where you smell an even more pungent flowery smell of her feet. It seemed as if she was emitting serial desire and you come commence full on worship to the inside of her toenail. You begin to walk inside and see how roomy it was and begin having more sex with her toe (it's her big toe this time, but you're oblivious). Over the next few months, Miranda continued growing and it seemed difficult to worship even one of her feet entirely  until finally</span></div></div>",
            "created":1400907600,
            "id":1801378,
            "title":"makes you a foot slave"
        },
        "11431222":{
            "author_id":"truleop",
            "author_name":"truleop",
            "choices":[
                "Miranda POV",
                "touched"
            ],
            "content":"<div class=\"\"><div> <span>You were glad where you were, smelling in the sweet smell of her feet and her giant toenail was easily a big canopy over you while her toe was a giant need for you to lie on. Suddenly a giant fingernail easily bigger than new York city came out of the blue and picked you out along with some of the other gunk in her toe you were living off of. You came face to face with a super huge darkly colored lump on her body which you assumed was Mirandas nipple, however you didn't know that directly below you, there was a gaping I hole that could easily have fit Florida inside. As you come face to face with the lump, you hear a loud moan that shook your entire being and heard a voice that shook the earth under her, saying \"hope you have a good time down there, it's been awhile and you can see that my assets have quadrupled in size\". Say ing that they quadrupled in size was an understatement. You were positive that she was at least as big as the earth by now and most likely, all the people on earth migrated to Miranda's sensuous body (in fact, most were living in her toes and on her nipples). It really was difficult to get down from her fingernail, her clitoris was just so massive that you were just trying to cope with how you would worship your one and only goddess with such a small stature. When you were laid on her special area, she bellowed, and it felt as if her body was an earthquake, \" YOU BETTER MAKE ME FEEL GOOD TONIGHT, IF YOU DO, I'LL REWARD YOU HANDSOMELY \" and so you got to work, massaging her gigantic clit. While rubbing, many erotic noises filled your eardrums as well as the ears of many others and although they were extremely tiny moans to Miranda, it felt as if your ears would explode. She started to fondle herself and as her vagina gaped wide open, a sudden vacuum of air began to suck on you and you were pulled into the enormous canal that was Miranda Cosgrove's vagina. She vigorously fingered herself and it was a surprise you weren't hurt at all, inside her, the moans grew louder and louder, and suddenly it feel silent as Miranda gaped in a gulp of air. Finally a wave that could have covered the earth in water blew out and you heard her erotic screams of joy as you were erupted out from her canal and smacked face on into her fingertip. You wake up back on Miranda's giant toe and she must have noticed since she ordered you to rremassage her feet from toe to heel on both. Reluctantly, yet joyfully, you restart your work, smelling in the deepness of her feet and lick and kiss each and every corner. This goes on for a few years, she seemed to have stopped growing by the time the ridges on her toenails were mountains to you. You were happy to be serving your goddess and loved your gigantic toes, kissing them, loving them, lickng them all the way.</span></div></div>",
            "created":1401771600,
            "id":1806826,
            "title":"she picks you up out of her toenail and onto so..."
        },
        "11433":{
            "author_id":"truleop",
            "author_name":"truleop",
            "choices":[
                "big as the world",
                "bigger than the world"
            ],
            "content":"<div class=\"\"><div> <span>It came over her like a blanket of pleasure as she grew to enormous proportions, her body was growing at an extreme rate as she exposed herself to the world and exploded out of what used to be her home. She felt orgasm after orgasm until she stopped growing when her nipple could cover a city. Lying on her belly, she sat upright and looked down at the puny city that she one lived in. She truly felt like a goddess and want too sure of what to do, in fact she was quite afraid that she would crush all those beneath her. \"I don't want to hurt anyone, but I'm too big to possibly not do anything malevolent.\" She sat and thought while underneath her beautiful ass, people were still being crushed and as she wiggled get toes, the people of the city and the city itself trembled being that her toes were causing vibrations throughout the state. She finally thought \"hey, I could fit all of the people from the city onto my toes\" and so with an overpowering voice, she said \"anyone who wishes to live must go into my foot,\" and as she said that, she shifted her legs so the sole of her foot was flush with the city and waited half the day for people to get on. Soon enough people amassed on her toes and she saw the little specks and realized that if she collected all of them together, they would all fit on one of her pinky toes. \"Alright, you can live in my toenails and live off the gunk in there, and in return for this gracious gift, you'll have to clean and massage my feet to the best of your ability. Goddess Miranda barely felt anything on her massive toes let alone her feet, but she was happy to be the most powerful beyond in the world, possibly the world. She stood up to look upon the world and just realized how real she really was. As she looked across, she saw the curvature of the earth and looking down her feet looked about the size of Florida. She began getting dizzy and fainted in shock of how big she became. When she came to, she realized a tingling sensation on her feet, nipples and clitoris. She sat up to find remnants of explosions on those parts of her body. Becoming angry, she yelled \" HOW DARE YOU TREAT YOUR GODDESS THIS WAY \" as she began to rub her feet all over America, hoping to get the area where the bombs were coming from and soon enough after much destruction from underneath her perfect feet, the bombs stopped. Without realizing, she shifted her body and lied down on her belly and in doing so, the people on her feet were crushed and her pussy was directly over what was Kansas. Beginning to get aroused, she slid her fingers into her pussy and came ever so close to reaching an orgasm and as she thought of her nipples being the size of a city, she willed breast milk to erupt, covering a large portion of south west Abreasts Her gigantic eyes rolled and Miranda gasped in, sucking in many people in the process as she climaxed, releasing her fluids onto kansas utterly flooding the area and surprisingly, her breasts enlarged by two sizes as milk gushed out of her breasts, essentially both flooding and feeding most of what was the Rocky Mountains. She breathed out a sigh of relief, which blew away many buildings in California and her perfect body shifted once more to lay on her back. Her supple breasts and still erect nipples passed the clouds and she licked her lips, also licking the edge of the atmosphere at the same time. Her legs began rubbing over another and her fingers were still rubbing her clit hoping for another orgasm. Her feet and toes wrinkled in response to a slight breeze the flew over her and the country trembled under her perfectly porcelain body. She sat up and realized something war different, she had grown till she was</span></div></div>",
            "created":1402981200,
            "id":1813629,
            "title":"her nipple could cover a city"
        },
        "12":{
            "author_id":"misterwerder12",
            "author_name":"misterwerder",
            "choices":[
                "Selena Gomez",
                "Victoria Justice",
                "Miley Cyrus",
                "Miranda Cosgrove"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>which celebrity will shrink people down and and have fun with them ?</span></div></span></div>",
            "created":1334379600,
            "id":1315187,
            "title":"Shrinking"
        },
        "121":{
            "author_id":"them",
            "author_name":"theM",
            "choices":[
                "Lap, safest and you get to place your head by her belly button",
                "Bra, tightest and get to play with boobs",
                "Feet, give Selena a nice foot massage."
            ],
            "content":"<div class=\"\"><div> <span>You were walking down the street one day and you stop at a gas station to get a snack. You suddenly bump into this girl. You only got up to shoulders, she had dark black hair that went slightly past her armpits. She was wearing sandles, jeans and a bra that had no straps and barly covered her breasts. You looked at her face and you relised, it's Selena Gomez.<br>\r\n   \"oh, sorry\" you say \"it's alright\" \"hey, I'm a big fan\" \"thx, want a hug?\" \"sure\" Selena hugs you and you see you're hitting the bottom of her breasts and she's smothering you on her stumic and you're soon at her belly button. You don't mind, for some reason you find skin very attractive. When she stops hugging you're the size of her leg. \"hey, what's happening?\" you say scared \"sorry she say as she graps you and jumps into the back seat of her car.<br>\r\n   She sits you on her lab and starts exspaning. \"sorry, my spell didn't go quite right. I was trying to shorten the time it took to fill my car with gas than you bumped into me. And the spell broke loose when I hugged you. Instead of shrinking time I shrunk you\" <br>\r\n   You think for a minute \"so you mean to tell me youre a witch\" \"a very powerful one, yes\" \"I owe my friend 5 bucks\" \"no, please don't tell anybody, the poparatzee will be at my throut.\"<br>\r\n\"ok, you're secret is safe with me.\"<br>\r\n   Youre now the size of Selenas foot and you stop shrinking. \"how long will this last?\" \"about an hour to three\" \"good, that's how long my mom thinks I'll be gone\" \"alright, wanna go back to my hotel room.\" \"ok\" . You both go to the drivers seet. \"how old are you\" \"15, why\" \"just wanted to know, so do you want to ride on my lap, in my bra, or by my feet.\"</span></div></div>",
            "created":1338354000,
            "id":1348488,
            "title":"Selena Gomez"
        },
        "1212":{
            "choices":[
                "On the way there",
                "When you get to the hotel",
                "You start slipping and fall into her pants "
            ],
            "content":"<div class=\"\"><div> <span>\"Can I please ride in your bra Selena\" you ask. \"Of course you can little guy I am glad you choose that because they want someone to play with them\" Selena said as she put you into her cleavage. You start to move around and Selena loves it a lot. She starts driving back to her hotel room...</span></div></div>",
            "created":1376888400,
            "id":1648563,
            "title":"Bra, tightest and get to play with boobs"
        },
        "12122":{
            "author_id":"selah613",
            "author_name":"sel",
            "choices":[
                "do you edmit to sleana you have a crush on her",
                "do you keep quiet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>whenyou get to the hotel...</span></div></span></div>",
            "created":1416027600,
            "id":1887157,
            "title":"When you get to the hotel"
        },
        "12123":{
            "choices":[
                "Gets naked",
                "Asks if you want to play a game"
            ],
            "content":"<div class=\"\"><div> <span>You fall into her massive pants and into her enormous pussy. You wriggle around and she moans with pleasure. Finally you get back to her hotel and with the little light that comes in you find yourself looking at her backside. She takes an elevator up to her room and when she gets to her door she drops the keys. When she bends down to pick them up, you are squished against he butt. Thinking that it was a bug, she slaps her butt but luckily her hand hit inches from your tiny body. Then she unlocks the door and reaches into her pants to see what is in them. She pulls you out and exclaims, \" Oh, I'm so sorry!\" Then she puts you on her bed  and</span></div></div>",
            "created":1386824400,
            "id":1706906,
            "title":"You start slipping and fall into her pants "
        },
        "121231":{
            "author_id":"tysonj001",
            "author_name":"cuzzy bro",
            "choices":[
                "DO IT!",
                "SAY NO!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She puts you down and takes off all her clothing and she says.<br>\r\n\"I loved what you were doing in my pussy and you my friend are<br>\r\n not going anywhere until you give me more.\"</span></div></span></div>",
            "created":1444107600,
            "id":2044565,
            "title":"Gets naked"
        },
        "1212312":{
            "author_id":"jamilton",
            "author_name":"Joe",
            "choices":[
                "Pussy",
                "Booty"
            ],
            "content":"<div class=\"\"><div> <span>\"Why would you ever think about rejecting my beautiful body\" she says swaying her body in front of you. \"Well tough luck, because you felt really good inside my panties and I didn't have enough\" she followed cutting in on your pathetic unheard protests.<br>\r\n<br>\r\nWith that you then see her body get closer to you as she smothers you with her...........</span></div></div>",
            "created":1444194000,
            "id":2044854,
            "title":"Rejecting Selena Gomez?"
        },
        "12123121":{
            "author_id":"ghost385",
            "author_name":"Terrance32",
            "content":"<div class=\"\"><div> <span>Selena gomez stares at you seductively as she scoots her pussy closer every second giving you no time to react, you then stare in complete awe as she uses two fingers to reveal to you the pink caverns of her pussy. She then moans teasingly \" I always get what I want and my lust isn't  satisfied yet little man\" with that she grabs you by your feet and starts pumping you in and out of her pussy, making her moan with every thrust as she gets extremely horny. </span></div></div>",
            "created":1569205380,
            "id":2722225,
            "title":"Pussy"
        },
        "1213":{
            "author_id":"wh1t3f1n",
            "author_name":"F1N",
            "choices":[
                "Arrives at studio"
            ],
            "content":"<div class=\"\"><div> <span>Selena places you down on the floor of the car near her feet.<br>\r\n<br>\r\n\"You can massage them if you like\" She says<br>\r\n<br>\r\nYou suddenly feel strange and dizzy, you begin to move towards her feet to massage them like she asked, you suddenly realise that she has cast a spell on you, you look up at her and ask her, \"Where are we going?\"<br>\r\n<br>\r\nShe looks slightly annoyed that you didn't fall under her spell but she dosen't mention it.<br>\r\n<br>\r\n\"We are going to the set of Wizards Of Waverly Place to shoot an episode called harperella.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1344834000,
            "id":1403627,
            "title":"kidnapped"
        },
        "12131":{
            "author_id":"wh1t3f1n",
            "author_name":"F1N",
            "choices":[
                "You remain in the shoe",
                "Someone finds the shoe"
            ],
            "content":"<div class=\"\"><div> <span>You arrive at the studio and are thrilled to be where they actually shoot the series! You are riding in between Selena's breasts.<br>\r\n<br>\r\n\"Okay little one now i'm have to go and do some shooting so im gonna leave you hear now wait till i get back okay?\" She says<br>\r\n<br>\r\nYou nod and get prepared to await her return when you notice a large glass shoe, the spell that Selena tried to cast on you earlier had not full worn off and you found yourself walking towards the glass shoe.<br>\r\n<br>\r\nWhen you reach it you climb up the front of it and stand on the ledge, you lean forwards and thats when the spell breaks, you realise whats happening too late and fall into the shoe!<br>\r\n<br>\r\nYou desperately try to climb out to no avail, the sides are just too smooth. You begin to wait for Selena to get back and begin to grow tired, unintentionally you fall asleep.<br>\r\n</span></div></div>",
            "created":1344834000,
            "id":1403630,
            "title":"Arrives at studio"
        },
        "121311":{
            "author_id":"wh1t3f1n",
            "author_name":"F1N",
            "choices":[
                "She uses magic to save you",
                "she carrys on"
            ],
            "content":"<div class=\"\"><div> <span>You are awoken some time later by movement, you are still half asleep so it takes you a second to figue out what is happening.<br>\r\n<br>\r\nThe shoe is being carried towards the set by Dan Benson(AKA Zeke Beakerman) with you still inside of it!<br>\r\n<br>\r\nDirector speaking:\"Alright everyone hurry up and take your places, in this scene Zeke comes in with the glass shoe and tries it on Theresa to find it won't fit and then tries on Harper and it fits perfectly.\"<br>\r\n<br>\r\nAfter hearing what the director said you try desperately to escape the glass shoe whilst the scene unravels. You see Zeke bend down and sniff the glass shoe and then Theresa's foot, he repeats this several times unti Selena yells: \"Just try the shoe on already!\"<br>\r\n<br>\r\nZeke says: \"Oh thats a much better idea, i wish i'd come to this house first now.\"<br>\r\n<br>\r\nHe begins to slide Theresa's foot into the glass shoe and you panick and back away hoping that her foot would be too big to fit in the shoe but unfourtunately her foot fits fine but is too big overall, so whilst they are trying to shove her foot into the shoe you are being smushed against the front of the shoe by Theresa's big toe.<br>\r\n<br>\r\nEventually, they give up, much to your relief, but then as the scene unfolds some more you hear that Harper is going to try the shoe on!<br>\r\n<br>\r\nYou feel the pressue change as Zeke bends down to slip the shoe onto Harper, You begin to yell in a vain attempt that someone will hear you.<br>\r\n<br>\r\nSuddenly, you make eye contact with Selena and she looks shocked, suddenly she steps forward and says: \"Don't you think a real princess should try it on first?\"<br>\r\n<br>\r\nEveryone starts to complain so she waves her hands and they all stop, you become over joyed, Selena rescued you from being squished!<br>\r\n<br>\r\nBut then suddenly Zeke continues to move forwards, you wander what is happening and then freeze as you see Selena's beautiful ginourmous foot begin to descend towards you, you begin to cry out, wondering why she is doing this.<br>\r\n<br>\r\nAs Selena's foot begins to enter the glass shoe, you run to the front of it in some feeble attempt to escape her foot, but she has used magic to make the shoe the exactly right size for he foot.<br>\r\n<br>\r\nYou begin to sob as her foot knocks you down and begins to slide over your tiny body, you close your eyes and await the end.<br>\r\n<br>\r\n</span></div></div>",
            "created":1344834000,
            "id":1403668,
            "title":"You remain in the shoe"
        },
        "1213111":{
            "author_id":"pete95",
            "author_name":"Pete",
            "choices":[
                "Give in to her foot",
                "Try and survive"
            ],
            "content":"<div class=\"\"><div> <span>Once her foot enters you are just lauched to the front of her shoe, she starts to wiggle her toes and you beginning the feel light-headed due to the amount of stench and pressure.<br>\r\n<br>\r\nTwo hours you find yourself at selenas house, she sees you have finally woken up and says \"did you enjoy that\" and you said \"no\" and she said \"no? How about we play a game, lets see how long you can last taped to my foot\".<br>\r\n<br>\r\nSelena comes back to find him gone, she finally finds him and she does not looked pleased, she grabs the taped and sticks him on the under side of her foot and smiles.<br>\r\n<br>\r\nShe then says \"for running away like that your punishment is, you have to spend the rest of the day in the smelliest boots\".<br>\r\n<br>\r\nShe also casts a spell on you so you cant die, therefore you cant escape the torture.<br>\r\n<br>\r\nAs you see her foot lowering into the boot barefoot you start to squirm, but you cant move as she has taped you firmly on her foot.<br>\r\n<br>\r\nIt is pitch black, all you can do is smell a rancid foot.<br>\r\n<br>\r\nSeconds later you notice movements and you can tell she is about to get, she also shouts \"mum, im going for a jog\" your heart has just sunk, you try shouting but your face is pressed against her foot.<br>\r\n<br>\r\nShe wispers \"im going to enjoy this\" and then she leaves, every step she takes feels like hell and you just want to die.<br>\r\n<br>\r\nAs she is jogging you notice the tape has started to loosen due to the sweat, after some time you manage to slip out and as soon as that happens (she is still jogging) you are flung to her toes and her heel every second, after being flung continously you pass out again.<br>\r\n<br>\r\nYou wake up again due to a loud bang and selena shouting \"mum, im back\" she then sticks her feet up on the coffee table and takes her boots off, you fall out into a puddle of sweat.<br>\r\n<br>\r\nAnd she said \"drink up\" you look at her face as she has an evil smile, you are scared but dont want to drink her foot sweat.<br>\r\n<br>\r\nShe then says \"i will give you food\" and at this point you extremely hungry so you do as your told, once you have finished she brings her foot up to the table again,with a confused face, you ask her where you food is.<br>\r\n<br>\r\nShe gets her finger and scraps it in between each toe and gets all the toe jam and places it in front of you, and says \"eat!\"<br>\r\n<br>\r\nYou struggle to eat her toe jam but once your finished, selena starts to think about weither to stick you back in the sweaty boot or call her friends over so you can worship their feet.</span></div></div>",
            "created":1532066520,
            "id":2522244,
            "title":"She uses magic to save you"
        },
        "12131112":{
            "author_id":"superdragon98",
            "author_name":"bondtron98",
            "choices":[
                "Emma Watson, vanessa hudgens, and Miley cyrus",
                "Daisy Ridley, Peyton list, and bella thorne"
            ],
            "content":"<div class=\"\"><div> <span>Selena decides that she wants to see you suffer even more and puts her boots back on with you in them as she paces around the room calling up a few friends to come over and hang out. <br>\r\n<br>\r\nYou couldnt hear much of the conversations but you could make out parts of it when you werent being crushed into a puddle of sweat bhe her heel. <br>\r\n<br>\r\nYou heard the names</span></div></div>",
            "created":1551981060,
            "id":2627403,
            "title":"Friends of a goddess"
        },
        "1213112":{
            "author_id":"wh1t3f1n",
            "author_name":"F1N",
            "content":"<div class=\"\"><div> <span>You feel Selena begin to walk around, wearing the shoe that you're in, with every step that she takes her foot grinds your body into the shoe.<br>\r\n<br>\r\n\"Sorry about this, but i can't have anyone knowing i'm a witch now, and look at it this way you're privalliged to die beneath my beautiful soles!\"<br>\r\n<br>\r\nEvery time she lifts her foot off the ground you have a quick second to breath before you are once again assaulted by Selena's foot.<br>\r\n<br>\r\nYou hear her giggle, she seems to be enjoying this, the world takes on an odd angle and you slide up to the front of the shoe.<br>\r\n<br>\r\nShe begins to giggle more as she rubs her toes all over your face whilst crushing your head inbetween her toes and going on tip toes!<br>\r\n<br>\r\nYour body literally can't take the pressure any more, it compresses and flattens down against Selena's sole.<br>\r\n<br>\r\nShe realise that you've been flattened and takes off the glass shoe, when she finds that you have stuck to her sole she laughs and walks bear foot back to the studio with your body being trampled all the way.  </span></div></div>",
            "created":1344834000,
            "id":1403675,
            "title":"she carrys on"
        },
        "121312":{
            "author_id":"wh1t3f1n",
            "author_name":"F1N",
            "content":"<div class=\"\"><div> <span>You are awoken by talking very near to you, you are still half asleep so it takes you a second to figure out whats happening.<br>\r\n<br>\r\n\"Yeah, i'll be on set in a sec!\"<br>\r\n<br>\r\nThe shoe with you in it suddenly moves and you get a view of Jennifer Stones face(AKA Harper Finkle)<br>\r\n<br>\r\n\"I better see if this shoe fits before we start filming.\"<br>\r\n<br>\r\nYour blood runs cold as you hear this and you yell in hopes that she will hear you, but it doesn't work.<br>\r\n<br>\r\nShe places the shoe on the ground and begins to gently insert her foot whilst unknown to her you are trying to climb out, but the shoe just remains too slippery.<br>\r\n<br>\r\nHer foot finally reaches you and knocks you over, you begin to scream as her foot completely covers you body.<br>\r\n<br>\r\nShe stands up to test the shoe out, amazingly you are still alive but the pressure is slowly crushing your body.<br>\r\n<br>\r\nYou feel her sit down and begin to take her shoe off, you breath a sigh of relief and then realise that you are coming out of the shoe with her foot!<br>\r\n<br>\r\nYou begin to struggle against it but you have become firmly stuck to her foot!<br>\r\n<br>\r\nShe takes off the glass shoe and inserts her foot back into her boot, while this is happening you are still struggling until she re-inserts her foot into her shoe.<br>\r\n<br>\r\nYou feel the pressure increase while she walks forwards and your body can't take it, it flattens down and sticks to her sole where you will remain.</span></div></div>",
            "created":1344834000,
            "id":1403632,
            "title":"Someone finds the shoe"
        },
        "122":{
            "choices":[
                "She doen't notice you at all",
                "She finds you and she thinks your so cute she treats you very kindly and playful",
                "She finds you and treats you like a slave and a foot servent"
            ],
            "content":"<div class=\"\"><div> <span>Victoria justice annoced an creative arts contest sending there name, submission and photo and the winner well spend his/her vacation sleeping over her house. You won the contest by subminted 10 art pieaces, wrote your own story and wrote her a new song for her. you just arrived at Victoria Justice's front door \" oh the contest winner well in you go\" she said dragging you in to her house wearing her red jacket, white belly shirt, skinny jeans, pink lipstick, curvy hair and her favourite sandals. You are lucky you get the spend the week with Victoria justice and the bad luck of it is, she offers you a drink, you drink the whole thing and with in seconds you shrunk down to 1/2 an inche. You look around and thinking \"what's going on here\" and then just as you were lost you looked back and saw a giantess Victoria justice! towering over you and the affect lasts for the entire vacation just what is she up to...</span></div></div>",
            "created":1336539600,
            "id":1333311,
            "title":"Victoria Justice"
        },
        "1221":{
            "choices":[
                "You trie to get her attiantion and it worked ( gentale giantess Victoria)",
                "You stay hidden from her ( the evil giantess Victoria)",
                "She finds you"
            ],
            "content":"<div class=\"\"><div> <span>She didn't even notice you and she walked to her room going over you and you look at her as a POV position and you gaze at her butifule giantess body until you realised, you got shrunken down to 1/2 and inch and the affects well last for your whole vacation with the giantess Victoria justice and that's bad and you need to think fast on what to do</span></div></div>",
            "created":1336539600,
            "id":1333322,
            "title":"She doen't notice you at all"
        },
        "12211":{
            "choices":[
                "Her bed to take a cat nap",
                "The bathroom to take a shower"
            ],
            "content":"<div class=\"\"><div> <span>Victoria stood still and she heard you but she thought there was nobody there she stood still for just enough time to get to her feet and hitch a ride on her sandel with her toe to toe between you. \"oh no what I'm I going to say to the studios when they found out I lost my contest winner\" she thought so she check the rooms with you between her toes, you could feel the wind rushing with in every step of the way at time her foot stink almost made you fall of a cupple of times but you were still within toes. After Victoria looked in a few rooms she calms down and realise that she just need to relax and reliafe the stress so she went to...</span></div></div>",
            "created":1346821200,
            "id":1421498,
            "title":"You trie to get her attiantion and it worked ( ..."
        },
        "122111":{
            "author_id":"nalarue",
            "author_name":"nalarue",
            "choices":[
                "Cleavage",
                "Mouth"
            ],
            "content":"<div class=\"\"><div> <span>Victoria heads to her bedroom, with you still between her toes. As she is about to get in the bed she reaches down to pull of her sandals, but she doesn't notice you. Then she climbs into bed, and says \"Hopefully after this nap, I can find him.\" You take this opportunity to be able to reach her face more easily so you start on the bed but soon realize that as she is laying down, the depression she creates would suck you right in. So you end up climbing up to her knee and resume your journey. It goes along fine until you decide to climb her left breast, but as soon as you get the top she sits up suddenly, gasping. This throws you off and you land in her...?</span></div></div>",
            "created":1369285200,
            "id":1595637,
            "title":"Her bed to take a cat nap"
        },
        "1221112":{
            "choices":[
                "... try to run out of her mouth. ",
                "... grab on to her teeth and hope for the best. "
            ],
            "content":"<div class=\"\"><div> <span>You land on her soft, wet, and warm tongue. She closes her mouth around you and leaves you in darkness. The smell is wonderful, the thought of being on this gorgeous celebrate's tongue is mind blowing. She gets up to get herself a glass of water. With every step to her kitchen you slide around on the surface of her tongue. You hear the water pouring from the inside of her mouth and you are left with a quick decision as she opens her mouth to drink the water. As she lifts the glass to her open mouth you... </span></div></div>",
            "created":1451192400,
            "id":2080102,
            "title":"Mouth"
        },
        "12211121":{
            "choices":[
                "on the floor in front of her massive feet. ",
                "on her right breast.  "
            ],
            "content":"<div class=\"\"><div> <span>You stumble, slide, and fall many times on the escape due to the slick coating of saliva you're being coated with. However you maintain momentum and free yourself from the prison of her mouth. As you fall you hear the sound of Victoria drinking the water and relief fills your system, but you're luck is not being kind for the sake of heart for you land... </span></div></div>",
            "created":1451245920,
            "id":2080106,
            "title":"... try to run out of her mouth. "
        },
        "12212":{
            "author_id":"wh1t3f1n",
            "author_name":"F1N",
            "choices":[
                "She decides to sit down and think things through",
                "She continues to search the house for you"
            ],
            "content":"<div class=\"\"><div> <span>You are suspicious as to what Victoria would do to you if she found you so you make a quick move to hide, you somehow ended up on the table when you were shrunk so you ponder how to get down.<br>\r\n<br>\r\nYou hear Victoria going though the other rooms calling for you, thankfully it means she doesn't know that you've been shrunken yet.<br>\r\n<br>\r\nYou see Victoria's napkin hanging down off the edge of the table giving you easy access to a chair.<br>\r\n<br>\r\nAs you slide down the napkin you hear Victoia coming this way which makes you slide faster.<br>\r\n<br>\r\n\"I wonder where on Earth he went, what am i gonna say to the studios... i lost my contest winner?\"<br>\r\n<br>\r\nWhilst listening to this you have managed to climb to the bottom of the napkin and are now standing in the middle of the chair.<br>\r\n<br>\r\nYou glance up and fill with dread, Victoria is standing right over you facing the opposite direction!<br>\r\n<br>\r\nYou can hear her pondering what to do...</span></div></div>",
            "created":1344834000,
            "id":1403682,
            "title":"You stay hidden from her ( the evil giantess Vi..."
        },
        "122121":{
            "author_id":"wh1t3f1n",
            "author_name":"F1N",
            "content":"<div class=\"\"><div> <span>You stare up at her beautifully shaped ass hoping beyond hope that she doesn't decide to sit down, in the back of your mind it occurs to you somewhere that you could move now but you are in too much awe of the behemoth behind in front of you.<br>\r\n<br>\r\nYou hear her talking to herself: \"I've checked all the rooms, maybe he went out the front door, no wait i locked it when we came in, hmmmm... i need to think this through.\"<br>\r\n<br>\r\nAs she says this she begins to lower herself onto a chair... the chair you are standing on!<br>\r\n<br>\r\nDesperately, you make a dash to the side in an attempt to escape, but it's too late as her backside goes down ontop of you knocking you over, you turn and try to hold it up with your bare hands... to no avail.<br>\r\n<br>\r\nYou are squashed beneath Victoria's soft bum unable to move whilst being slowly crushed by the increased pressure.<br>\r\n<br>\r\nAs she finishes sitting down you hear her exclaim: \"Oh this chair is uncomfotable today, i wonder why?\"<br>\r\n<br>\r\nAs she says this she begins to slide and shift her butt around on the chair hoping to find a more comfortable position.<br>\r\n<br>\r\nEventually, your body can take no more and flattens beneath the terrible onslaught from her ass.<br>\r\n<br>\r\n\"Oh thats better\" She says \"Now where is he?\"<br>\r\n<br>\r\nAs she stands up and continues her search for you she has no knowledge of you being stuck to her cheeck, and there you remain, slowly becoming more and more faded into her jeans every time she sits down.<br>\r\n</span></div></div>",
            "created":1344834000,
            "id":1403858,
            "title":"She decides to sit down and think things through"
        },
        "122122":{
            "choices":[
                "Grab the napkin and use it as a parasoot ",
                "Hide in her shorts pocket she never think of looking for you there you thought"
            ],
            "content":"<div class=\"\"><div> <span>She stood There for moments, trembling of what will happen until you got an idea and quickly made a dash to her. \"where on earth would he be? Not like he shrunk after the drank I gave him\" Victoria thought out loud, you were rolling your eyes curse that's exactly what happen and now back to your plan...</span></div></div>",
            "created":1346821200,
            "id":1421726,
            "title":"She continues to search the house for you"
        },
        "1222":{
            "choices":[
                "You ask Victoria to go to Victoria's room and play a game ",
                "She wants to go out to the movies and see your favourite movie",
                "You want to go to her bed in her bedroom and get to know each other better"
            ],
            "content":"<div class=\"\"><div> <span>She finds you! She got down to her knees as you feel the ground shaking, she lowered her hand next to you, your not sure about this until \"come on come up my hand, there's no reason to be scared I won't hurt you I promise\" Victoria Justice said in a nice, kind, gental and angle like voice that you can't refuse and at that split second, you run and climed to her open hand and them she rises you up as you fell the wind on your face until you reach her giant face. She takes one look at you and she said \"ooahhh what a cute little guy you are *giggled* your just so cute!\" she said while you are amazed the fact that now she's giant sized and she looks even more butifule then before. Well what do you want to do first?...</span></div></div>",
            "created":1336626000,
            "id":1333821,
            "title":"She finds you and she thinks your so cute she t..."
        },
        "12222":{
            "choices":[
                "Action movie; avengers assemble",
                "Romatic movie or something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"alright then movie it is\" she said and she got her purse and puts you in her purse pocket for safety. She then got in her liemo and the driver drove her to the cinema. Victoria asked you \"what kind of movie you want to see?\"...</span></div></span></div>",
            "created":1336626000,
            "id":1333824,
            "title":"She wants to go out to the movies and see your ..."
        },
        "122221":{
            "choices":[
                "get to know each other better",
                "Play some games"
            ],
            "content":"<div class=\"\"><div> <span>They went to see avengers assemble. Later the movie kept playing and they are having a great time together all thoe they were some problems ( this one time Victoria almost ate him) but still a great time, when the movie was over they went out the cinema and into Victoria's limo<br>\r\n\"Oh my god the movie was actually better then I thought it would\" she exclaimed, you agree with her and then they gone home.<br>\r\nWhen Victoria came home she then lefted you from her purse with her hand to her face as she walks to her giant bed in her gigantic bedroom, then she asked \"so what do you want to do next?\"...</span></div></div>",
            "created":1336626000,
            "id":1334111,
            "title":"Action movie; avengers assemble"
        },
        "1222211":{
            "choices":[
                "12-15",
                "16-20"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"alright then\" Victoria said and then she asked \"how old are you?\" and then you replyed...</span></div></span></div>",
            "created":1336798800,
            "id":1335257,
            "title":"get to know each other better"
        },
        "12222111":{
            "choices":[
                "Was she serious and your gonna be her next meal",
                "Or was she just joking just to get a good laugh"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh yeah well that's a pretty good age with you being that talented\" Victoria said and you replyed \" yeah well I have been pretty good at my song lyrics and ive been doing a lot of stuff\" “What kind of stuff, exactly…” She then lowered her head and got as close to you as she could. “…my tender little morsel.”  You then quickly went to being so pale that all your colours have gone away and all there's left is white and started to shake like a leaf, what did she mean by that?!</span></div></div>",
            "created":1336798800,
            "id":1335658,
            "title":"15"
        },
        "122221111":{
            "choices":[
                "swallow you whole.''",
                "cook you into a fine meal.''"
            ],
            "content":"<div class=\"\"><div> <span>Victoria laughed as she picked you up in her hand and placed you in the palm of her right hand. She walks to her kitchen where she sets you on a small plate and puts a glass over it trapping you. You then see her pacing around mumbling to herself how she plans to eat you. When Victoria returns she removes the glass. She picks you up and says, '' I'm going to... </span></div></div>",
            "created":1451254920,
            "id":2080158,
            "title":"Was she serious and your gonna be her next meal"
        },
        "1222211111":{
            "author_id":"mikedaniels",
            "author_name":"Mikedaniels",
            "choices":[
                "Accept my fate",
                "Make a break for it"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Victoria then gets a mischevious smile as i begin to freak out, she raises up the glass and I...</span></div></span></div>",
            "created":1568306820,
            "id":2717146,
            "title":"swallow you whole.''"
        },
        "12222111111":{
            "author_id":"mikedaniels",
            "author_name":"Mikedaniels",
            "choices":[
                "Victoria puts her mouth at the end of the table (willing vore)",
                "Victoria leans over you and slurps you up into her mouth like pasta"
            ],
            "content":"<div class=\"\"><div> <span>Even though I am terrified, there something slightly arousing about the thought of the massive Victoria wanting to swallow me whole.<br>\r\nInstead of running, I stand straight as the glass is removed from over top of me. Victoria was clearly surprised to see you not running once the opportunity became available. <br>\r\n“Do you think this is a bluff? A game? I’m very serious right now. You WILL be my next meal.”<br>\r\nVictoria says to me with a snap.<br>\r\n“No not at all” I respond, “the idea actually is kind of interesting to me, the more I think about it, the more I want to slide down your gullet.” Victoria becomes visibly excited at this. She replies back, “well my little snack it looks like we are in the same page here, let’s not waste anymore time, I am starving.” A large growl erupts from her stomach. I can’t help but become aroused, as I know that powerful stomach will soon go to work on me. </span></div></div>",
            "created":1576248000,
            "id":2759076,
            "title":"Accept my fate"
        },
        "122221111111":{
            "author_id":"mikedaniels",
            "author_name":"Mikedaniels",
            "choices":[
                "Digested",
                "Freed"
            ],
            "content":"<div class=\"\"><div> <span>Victoria places her head at the end of the table, opening up her mouth and sticking her tongue out to lay on the table. I begin to walk over in her direction, as I get closer, I feel and smell her breath hitting me. Soon enough, I have arrived at the giant cave that is Victoria’s mouth. While being the food of a giantess sounds amazing, I start to get kind of nervous as I peer into my new home. <br>\r\n“I really don’t know if I can go through with this Victoria.” You say as you get increasingly more nervous. <br>\r\nShe cranks her back and replies, “I’m sure you are scared, it’s not every day you become a snack  for a goddess like me. I’m giving you the chance to go out in your own will and not like some animal, just get it over with because you’re going to end up digesting in my stomach regardless.”<br>\r\nShe’s right I think to myself, I need to just do it.” <br>\r\nShe puts her head back in the original position, tongue comes out. I walk onto her long and pink tongue. She begins to draw her tongue into her mouth with me on it. She makes a playful soft chomp of her teeth once you and her tongue were completely in her mouth, sending shivers down your spine. Her mouth is very warm and wet and I very much enjoy being in it. Victoria begins swishing me around in her mouth, putting me in cheek then the other. She did this for quite a while but eventually, the time comes... I feel her tongue start to move farther back into her mouth. Soon enough I realize that this is it, this is the moment I become a meal for Victoria. With a powerful flick of the tongue she begins working my body down her throat, feet first. As I begin my descent down the esophagus of the goddess I notice she is struggling to pull me down with her powerful throat muscles. I feel a finger push up against her throat, right above the bulge that I had created and start to massage me down. Slowly but surely, Victoria gets me to go down. I am now in her stomach, awaiting sure digestion.</span></div></div>",
            "created":1576249140,
            "id":2759079,
            "title":"Victoria puts her mouth at the end of the table..."
        },
        "1222211112":{
            "content":"<div class=\"\"><div> <span>Victoria takes you to her cutting board and gets out a kitchen knife. She then gets out a small eye dropper full of numbing medicine. She squeezes the dropper right over you and a drop plops down coveting you in a thick lair of numbing medicine. You wipe it off of your face, but within a few seconds, it rendered you immobile. You are now a helpless little rag doll ready for Victoria Justice to prepare into a meal. She grabs the knife and cuts off your arms and legs. You can still feel pain despite the numbing medicine. She then puts your four limbs and torso in her hand. You're blood pressure has been reduced because of the medicine keeping you alive for this horrible experience. She then places your torso and limbs on a hot skillit decorated with parsley, onions, bell peppers, carrots, and the antidote for the shrinking liquid Victoria fed you earlier. Each limb and torso grew until they were about 2 inches long each. She Stirrs the ingredients and you together with a wooden spoon and let you cook for several minutes. Despite being chopped up and cooked you're still barely alive. She Takes everything off of the skillet and places it on a plate In her dining room. She sits down and begins to eat. She plunges her fork into some vegetables and then your leg. Victoria then eats it and says, '' Mmmmm you taste delicious, but your main torso is probably better.'' She rolls you over on your belly and impales the fork through your back. She lifts you up to her mouth and scrapes you off the fork with her teeth. She throws you over to her teeth with her tongue and crushes you with her molars. <br>\r\n</span></div></div>",
            "created":1451256660,
            "id":2080172,
            "title":"cook you into a fine meal.''"
        },
        "122221112":{
            "choices":[
                "Play that game she wanted",
                "Or go to sleep"
            ],
            "content":"<div class=\"\"><div> <span>You were still pale and shaking like a leaf, which made VictorIa laugh a little bit.  \"relax like I'm acctuly gonna eat you, perishe the thought I just told you that so we could have good laugh\" she said but then you told her how it wasn't funny and this whole thing is making nervios like coming over to LA, meeting Victoria Justice, getting shrunken down and seeing her as a giantess godesse \"I-I-I'm sorry\" Victoria said between laughs \"it's you taking things seriously is acctuly pretty funny\" then you pouted at her for playing that cruel joke on you. Victoria then reached down And scooped you up As close to her face and then she apologies \"oh common it was just a little joke, you really need to lighten up here and have some fun\" you where still cross with her but, you forgave her a minute later. Seeing Victoria smile really brIghten your smile. Victoria asked \"what do you want to do now?\"...</span></div></div>",
            "created":1336798800,
            "id":1335677,
            "title":"Or was she just joking just to get a good laugh"
        },
        "1222211122":{
            "choices":[
                "On your own bed",
                "On my chest"
            ],
            "content":"<div class=\"\"><div> <span>\"okey I am getting a little tired and it is getting late\" said Victoria giving out a great big yawn and you agreed so, she change her cloths (in privete) while you change with the shrunken suit case with your pjs in them good thing she shrunked the bags too, once she's done changing into sweat pants with a cheap looking vest, she picked you up and she sat down on her bed asking you \"so you want to sleep...</span></div></div>",
            "created":1344747600,
            "id":1403473,
            "title":"Or go to sleep"
        },
        "12222111222":{
            "choices":[
                "travel down to her legs. ",
                "or, climb up to her mouth. "
            ],
            "content":"<div class=\"\"><div> <span>Victoria lays you on her chest right above her breasts and says, '' goodnight. ''  You feel like you want more from Victoria. As she doses off to sleep you think of the many possibilities of places to explore on her body. After all, she will be asleep anyway. You wait on her chest for a full hour to make sure she is asleep. After that, you get up and... </span></div></div>",
            "created":1451254200,
            "id":2080155,
            "title":"On my chest"
        },
        "1223":{
            "choices":[
                "Shove you in her bra!",
                "Push you in her underwear!!",
                "Or Throw you in her black leather boots and wear them while your in them!!!"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You try to run away but she got you in her hand as you feel the wind as she lefts you to her face. Your scared and wonder what is she going to do with you. \"now that I shunken you what should I do with?\"...</span></div></span></div>",
            "created":1336626000,
            "id":1333815,
            "title":"She finds you and treats you like a slave and a..."
        },
        "12231":{
            "choices":[
                "Rub her feet",
                "Gets horny"
            ],
            "content":"<div class=\"\"><div> <span>She shoved you in you thought you were in trouble but it wasn't so bad for now. \"how's that?\" Victoria asked \"not as bad as I thought you said, Victoria the squished her two boobs together making you suffocate while you were inside \"how's that now\" she asked then you replyed \"can't breath\" \"perfect\" she said with an evil smile on her face \"so what do I want to do with you now?\" she questioned herself and you did not like where this was going</span></div></div>",
            "created":1337749200,
            "id":1343785,
            "title":"Shove you in her bra!"
        },
        "122311":{
            "choices":[
                "You are getting an actul treat",
                "Or was it something else"
            ],
            "content":"<div class=\"\"><div> <span>It was cruel becuase her feet stink, it was a pian rubbing from top to bottom and that was just her right foot, done to Victoria's satafaction she then scooped you up right to her face \"great job you deserve a treat\" she said but what did she mean by that?</span></div></div>",
            "created":1337749200,
            "id":1343795,
            "title":"Rub her feet"
        },
        "1223112":{
            "choices":[
                "Play a game",
                "Kept being her slave"
            ],
            "content":"<div class=\"\"><div> <span>Victoria then open her mouth and tossed you side At first, there was no movement, which gave everyone a chance to look at all the gargantuan teeth that made up part of the floor and ceiling of their slimy cavern, dripping with saliva. Not to mention that big tongue they were standing on. Soon, however, the tongue began to move around violently, tossing you everywhere in the mouth except for the pit that served as a gateway to her stomach. It was a very rough ride, coupled with the fact that they were completely covered in saliva. Fortunately, luck was on your side. The mouth suddenly tilted down and opened once again. You landed back on Victoria's hand. You worked to readjust their vision to the giantess Victoria that looked down on you once again. \"well well well what to do to you next? Hmmmm?\" she said planing her next move what will she do<br>\r\n</span></div></div>",
            "created":1337749200,
            "id":1343805,
            "title":"Or was it something else"
        },
        "12231122":{
            "author_id":"redz028",
            "author_name":"hey you 64",
            "choices":[
                "force you to clean all 6 feet",
                "smother you with their feet"
            ],
            "content":"<div class=\"\"><div> <span>\"You can keep being my little foot slave, since you did a good job and all.  I think i'll invite a few friends over too.\"  Victoria tossed you in her boot, which smelled 100 times worse than her actual foot.  You cold here her muffled voice as she called 2 people on her phone.  A few hours had passed, and you feel Victoria pulling the boot off.  You roll out of her boot gasping for air, and see 6 gigantic feet in front of you, 30 toes wiggling just teasing you.  You look up, and see Victoria, along with Selena Gomez and Miley Cyrus staring down with a playful yet evil smile.  \"Since you are my foot slave, you also belong to all of my friends as well.  And don't worry, my feet are nothing compared to theirs.\"  And with that, the 3 giantesses...</span></div></div>",
            "created":1344834000,
            "id":1403867,
            "title":"Kept being her slave"
        },
        "122311222":{
            "author_id":"wh1t3f1n",
            "author_name":"F1N",
            "choices":[
                "You are told of the hidden power of the shink potion",
                "You are not infomed of the hidden power"
            ],
            "content":"<div class=\"\"><div> <span>Begin to whisper amongst themselves, you dread the outcome and try to make a dash for freedom, only to discover that you have been penned in at all side by the 6 giant feet.<br>\r\n<br>\r\nThe 3 giantesses laugh as they see that you were trying to escape.<br>\r\n<br>\r\n\"I don't think he likes our feet.\" Says Miley Cyrus<br>\r\n<br>\r\n\"How rude, i think you girls have lovely feet.\" Says Selena Gomez<br>\r\n<br>\r\n\"Thanks Selena your feet are gorgeous aswell!\" Says Victoria Justice<br>\r\n<br>\r\n\"I think we're going to have to teach him a lesson!\" Says Miley Cyrus<br>\r\n<br>\r\nAs she says this she lifts her foot and brings it down onto you.<br>\r\n<br>\r\n\"He's still struggling, i think he needs to be punished more.\" Says Miley<br>\r\n<br>\r\nShe lifts her foot up with your head firmly wedged between her toes with you facing away from her soles.<br>\r\n<br>\r\n\"Selena, could you lift your foot up for me and hold it in the air?\" Said Miley<br>\r\n<br>\r\nSelena raised her foot into the air and moved it towards Mileys.<br>\r\n<br>\r\nEven though you are exausted from your time in Victoria's shoe you begin to stuggle and continue to do so even after you have been sandwhiched snuggly between Selena's and Mileys feet.<br>\r\n<br>\r\nThey move they feet from side to side in an attempt to futher squish you.<br>\r\n<br>\r\n\"It appears that he is still struggling.\" Says Selena \"This calls for extreme measures!\"<br>\r\n<br>\r\nSelena lays on her back with her feet pointing into the air.<br>\r\n<br>\r\n\"Victoria, would you come and sit ontop of my feet please, i have strong legs i can hold you up.\"<br>\r\n<br>\r\nYou panick as you hear this but have no energy left with which to escape, you turn onto your back and stare at the beautiful booty that is slowly descending towards you and wait for the end.<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1344834000,
            "id":1404063,
            "title":"smother you with their feet"
        },
        "1223112222":{
            "author_id":"wh1t3f1n",
            "author_name":"F1N",
            "content":"<div class=\"\"><div> <span>The huge obscenity stops breifly for a moment as the girls chatter amongst themselves.<br>\r\n<br>\r\n\"Should we tell him about the hidden properties?\" Questioned Miley<br>\r\n<br>\r\n\"Nah\" Said Victoria \"I've had my fun with him, what do you think Selena?\"<br>\r\n<br>\r\n\"I think we shouldn't tell him because one, this is going to be awesome, and two, it's going to feel so good!\" Exclaimed Selena<br>\r\n<br>\r\n\"Well ok then i was just making sure\" Said Miley \"Continue dropping!\"<br>\r\n<br>\r\nVictoria's butt continued to descend towards you until it made contact and firmly sandwhiched you inbetween her butt and Selena's foot.<br>\r\n<br>\r\n\"He's still alive dammit, i can feel him there!\" She announced whilst pressing and pivoting her foot against Victoria's bum.<br>\r\n<br>\r\n\"Write, okay hold on a sec, i have an idea!\" said Victoria whilst gesturing for the other two to follow. <br>\r\n<br>\r\n\"If we both put our backs against the walls in this narrow hallway and put our feet together and push then there's no way he will survive!\" She said<br>\r\n<br>\r\nThey both rested their backs against the wall and Selena lifted her foot up with you still flattened on it and connected her foot with Victoria's.<br>\r\n<br>\r\n\"Okay ready, on the count of three, one... two... Three!\"<br>\r\n<br>\r\nThe girls both push with all their combined giantess might and suceed in squishing you, and when they pull away your remains are scattered across both of their feet.<br>\r\n<br>\r\n\"Ohh finally it worked, he's dead\" Said Victoria<br>\r\n<br>\r\n\"Yeah come on lets go find some other poor sap to shrink\" Said Miley<br>\r\n<br>\r\nThe girls put their shoes on and left the house, but un-beknown to them the potion had caused you to live through death and you were still concious of all of your body splattered between the girls feet, and you would remain that way for eternity, forced to live on their soles for the rest of time<br>\r\n</span></div></div>",
            "created":1344834000,
            "id":1404073,
            "title":"You are not infomed of the hidden power"
        },
        "123":{
            "choices":[
                "She spots you and decides to play",
                "She doesn't spot you and you decide to hide ",
                "She spots you and thinks you are a bug"
            ],
            "content":"<div class=\"\"><div> <span>You go to one of Miley Cyrus' concerts and as usual she rocks the place down, you stand in the crowd and love every second of it singing to all the words and having an amazing time.<br>\r\nDuring the last song you see that the door to the backstage area is open.<br>\r\nTo get closer to Miley you sneak through the door.<br>\r\nThere is a flash and you are hit by a warm energy in the center of your chest once the light fades you see Miley in the distance she looks huge from where she is and she is heading straight towards you, her tight dress hugging her hips, her light brown hair bobbing up and down in time with her walk.<br>\r\nHer footsteps boom toward you and wake you from your trance just in time.</span></div></div>",
            "created":1339131600,
            "id":1355879,
            "title":"Miley Cyrus"
        },
        "1231":{
            "author_id":"fuzzyboy",
            "author_name":"Fuzzywuzzy",
            "choices":[
                "Miley wins the game",
                "You win the game",
                "Something happens"
            ],
            "content":"<div class=\"\"><div> <span>Miley sees you and lied down on her chest and puts her hands on her chin.\" Looky what I found. A little helpless tiny man. Lets play a game\". She said in a playful voice and stood to her full height. \"In this game it's like cat and mouse, except there are two options. Until I get tired I will try and try and step on you and squish you. If you succeed of not being crushed under my sexy feet then ill let you..............explore my body and have sex with me.\"when you heard that you got a boner like never before and miley giggled at how turned on you were.\" But if I get even a little bit of you i win. Or if i am about to crush you ill stop and you will be my................. Pet for the rest of your life. Now lets play. Remember that this game will stop when I get tired and that might be a while.</span></div></div>",
            "created":1416546000,
            "id":1891085,
            "title":"She spots you and decides to play"
        },
        "12313":{
            "author_id":"redz028",
            "author_name":"hey you 64",
            "choices":[
                "Victoria justice debby Ryan and Emily osment ",
                "Selena Gomez Emma Watson and Demi lovato"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You start to run and try and escape the stinky feet of Mikey cyrus.  After what seems like an eternity you run into feet that aren't hers.  \"Oh good help.  Now you will be under the feet of all of us.\"  Who's feet were they?</span></div></span></div>",
            "created":1416546000,
            "id":1891097,
            "title":"Something happens"
        },
        "1232":{
            "choices":[
                "Hide under the sofa",
                "Climb the sofa ",
                "Climb inside the boot"
            ],
            "content":"<div class=\"\"><div> <span>Her booming footsteps get closer and closer, fearing for your life you run.<br>\r\nLost in Miley's you have very little idea where to go or what to do but you know if you don't move now you will be squashed like a bug under the feet of the girl you just spent the last few hours admiring from afar.<br>\r\nYou take a quick look around and see a few places you could run to.<br>\r\nThere is a small red sofa with soft looking velvet cushions, after looking at it you realise you could climb to the top of that to try and get Miley's attention or you could cower beneath it.<br>\r\nThere are also a pair of Miley's black knee length boots one of which has fallen over and lies open on the ground. You could hide inside until its safe to come out.</span></div></div>",
            "created":1339131600,
            "id":1355895,
            "title":"She doesn't spot you and you decide to hide "
        },
        "12323":{
            "author_id":"xxxopper",
            "author_name":"ImABadPersonReally",
            "choices":[
                "Wait there until she takes them off",
                "Hit her toes in a attempt to be noticed"
            ],
            "content":"<div class=\"\"><div> <span>You make a dash for the tipped over black boot and hide inside. A foul smell filled your nose and you then realized this was a bad hiding spot. \"Agh, I cant wait to get out of these heels and into my comfy boots\" Miley says sounding exhausted. You then feel sick to your stomach, and you start to shake \"S-S-she cant mean these boots...right?\" You think to yourself. Just then you surroundings start to shift and shake and you realize she is putting the boots on! You see the opening of light fill with her fleshy, sweaty sole, you run to the toe of the boot to escape the gigantic toes that crept towards you, but it was no use, her toes engulfed you and you were stuck between her toes and her sole.</span></div></div>",
            "created":1401166800,
            "id":1803366,
            "title":"This Stinks...."
        },
        "124":{
            "author_id":"giantess18",
            "author_name":"Haro-Haze",
            "choices":[
                "Panties (front or back)",
                "Bra",
                "Under my feet (soo"
            ],
            "content":"<div class=\"\"><div> <span>You have just won a contest to go and meet the stars of Icarly after meeting with the actor that plays freddy and jennette mccrudy you go to Miranda cosgroves dressing room to meet her you have a huge celebrity crush on her<br>\r\n<br>\r\nYou enter without knocking to see that she is in the middle of getting changed you only se her in a purple thong starting to put on a black mini skirt with no bra on she sees you and gasps trying to cover herself you quickly take out your phone and get a picture of her boobs before she could cover them<br>\r\n<br>\r\nShe says \"get out you little pervert\" you close the door behind you not wanting to leave<br>\r\n<br>\r\nShe tells you to delete the picture now or you will be servilely punished but that only make you hard you adjust your pants to try and hide it from her <br>\r\n<br>\r\nShe then says you asked for it you look over at her as she graves a weird looking ray gun you ask \"what is that\" she answers you with a question \"did you ever notice that in alot of cartoons and tv shows how people grow and shrink... Well your about to live one\"<br>\r\n<br>\r\nYou begin to feel dizzy as you hear what sounds like mini-earthquakes moving towards you you look up to see a giant Miranda cosgrove and you can't help yourself but to look up her skirt<br>\r\n<br>\r\nYou my little pet now and till I get home your gonna be living in my...</span></div></div>",
            "created":1334379600,
            "id":1315463,
            "title":"Miranda Cosgrove"
        },
        "1241":{
            "choices":[
                "use you as a butt-massager",
                "squeeze you in between her boobs",
                "make you climb up and down her body"
            ],
            "content":"<div class=\"\"><div> <span>Miranda kneels down and grabs you and lifts you up to her skirt where you are then slid into her panties. You are scared a little by the confined space, but you can't help but feel horny by the sight of her pussy. Then without thinking you insert your dick into her massive pussy. Miranda notices this and starts to feel turned on. she puts one hand under her skirt, grabs the area of her panties, and presses her thumb down on the spot where you are, pushing you inside. This gets her even hornier and, without a second thought, pulls down her panties and presses you in with both thumbs, causing her to moan hard and loudly. Soon she reaches her climax which pushes you out like a torpedo, landing just in front of the horny giantess. <br>\r\nRecovering herself a little she looks down at you and grins evilly. \"Looks like you'll be my sex toy now, tiny boy.\" and with that she picks you up again, drops you into her panties and, like an elevator, up you go back up to her vagina.<br>\r\nOn her way home, she thinks of all the sexy things she could do to you, getting her horny and excited again. Finally, when she gets to her room, pulls you out of her panties and drops you on the bed, she decides to...</span></div></div>",
            "created":1336280400,
            "id":1331080,
            "title":"Miranda's panty slave"
        },
        "12411":{
            "author_id":"krock05",
            "author_name":"Krock05",
            "choices":[
                "She kills you under her ass",
                "You lick her ass"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She then makes all her close of and tells you to start liking her ass or she will kill you</span></div></span></div>",
            "created":1423371600,
            "id":1929766,
            "title":"use you as a butt-massager"
        },
        "124111":{
            "content":"<div class=\"\"><div> <span>Miranda looks over her shoulder at you as you do a poor job of massaging and licking her soft supple ass. She rolls over and you fall to the bed, her butt looming above you. It soon comes crashing down, all her weight pressing down on you through her butt. You scream and squirm and eventually make your way to her butt crack where you feel safety from the extreme pressure. That is until she picks you up and inserts you into her anus, slowly and sensually, taking pleasure from every second of it until you disappear completely in her ass. She soon falls asleep with you inside of her, that is, until she wakes up and her stomach rumbles. \"I got to go to the bathroom\" she says as she rushes to the bathroom and before she sits down, she farts and you get shot out onto the toilet seat. she then crushes you with the meat of her ass cheek and does her business. You can't see it and can't smell it but you hear it. Soon she leans to one side to wipe her butt and too much pressure is exerted on you and you pop like a ketchup packet under her meaty ass. </span></div></div>",
            "created":1453422840,
            "id":2092371,
            "title":"She kills you under her ass"
        },
        "1242":{
            "author_id":"giantess18",
            "author_name":"Haro-Haze",
            "choices":[
                "Her bedroom ",
                "Her shoe closet"
            ],
            "content":"<div class=\"\"><div> <span>Miranda lifts you up and drops you between her c-cup boobs and jiggles them around with you in them for fun she puts a jacket over her bra and leave not bothering to even put a shirt on<br>\r\n<br>\r\nAs she walk out the building to her limo ever step makes her boobs shake uncontrollable which cause you extreme pain and her extreme please as you can hear by her giggles\"hehe\"<br>\r\n<br>\r\nShe gets in the limo and when nobodys around she grabs her breast and pushes them together trapping you between to walls of soft squishy flesh with no air...you pass out and when you wake up you are in_________</span></div></div>",
            "created":1335589200,
            "id":1324621,
            "title":"Bra"
        },
        "12421":{
            "author_id":"misterwerder12",
            "author_name":"misterwerder",
            "choices":[
                "Miranda has some things to do for you",
                "Miranda goes out and takes you with her"
            ],
            "content":"<div class=\"\"><div> <span>you slowly open your eyes and see miranda cosgroves giant face infront of you.<br>\r\n\"Hello, little one, welcome back\" she laughs.<br>\r\n\"Where am I?\" you ask in fear.<br>\r\nBut you don't get answer, Miranda just laugh directly in your face, you look around and see a giant bed ... you must be in her bedroom!<br>\r\nThen you get an closer look at Miranda, you see, that she wearing a tank top which perfectly show her c-cup breats, a tight jeans and knee-height black leather boots.<br>\r\n\"well little pet,\" mIranda begin to speak very dominant \"frm now, you will learn to worship me, you are now my slave and you must akt like it. If you don't exactly do what i say it will hard consequences ! For the first time you will live in this!\"<br>\r\nMiranda shows a little mouse-cage. <br>\r\nThen she reached down at you and grabs you with her gigantic sexy fingers.<br>\r\nThen she put you in the cage and close it.</span></div></div>",
            "created":1335848400,
            "id":1326914,
            "title":"Her bedroom "
        },
        "1243":{
            "choices":[
                "get into the boot",
                "stay still",
                "someone else walks in"
            ],
            "content":"<div class=\"\"><div> <span>\"As my pet, you will be living under your masters feet.\" Miranda told you as she kicked off her boots. She hadn't been wearing socks and the smell immediately filled your space, it was absolutely horrible, bad enough to make your eyes tear up.<br>\r\n<br>\r\nYou looked up the giant icarly actress, too scared to even move. She dug her toes into the carpet as she instructed you to come over and climb into her boot.<br>\r\n<br>\r\nYou still didn't move and even contemplated running away, but you had enough common sense to not run. <br>\r\n<br>\r\nHowever you were still too stunned by this whole ordeal and stayed still, causing Miranda to get mad.<br>\r\n<br>\r\n\"I said get into the boot. If you don't I'll just have to crush you under my feet right now and shrink the next contest winner.\" She commanded.<br>\r\n<br>\r\nWhat do you choose to do?</span></div></div>",
            "created":1338094800,
            "id":1346336,
            "title":"Under my feet "
        },
        "12431":{
            "author_id":"wh1t3f1n",
            "author_name":"F1N",
            "choices":[
                "Victoria continues to wear the shoes with you in them",
                "Miranda comes back in"
            ],
            "content":"<div class=\"\"><div> <span>You slowly stumble forwards towards the collosal shoe's, not quite believing what is happening.<br>\r\n<br>\r\n\"Thats a good boy now, you keep doing as i command and maybe i will reward you.\" She said playfully<br>\r\n<br>\r\nShe begins to get impatient with your slow walking.<br>\r\n<br>\r\n\"Hurry up, there are many other contest winners out there i could get instead of you so hurry into my boot or i will end your pitiful existence right now!\" She boomed.<br>\r\n<br>\r\nGrowing more impatient of your slow moving miranda picks you up between her toes and drops you into her boot, they are black leather boots that retain much of they're heat and right away you can smell the acidic stench of her sweat, it is not a bad smell just not plesant either.<br>\r\n<br>\r\n\"Comfortable down there are we my little slave\" She dosen't wait for a response \"Good\" She giggles<br>\r\n<br>\r\nYou then realise that you are stuck to the inside sole of her shoe, your arms, legs and torso are stuck to the floor but your head is free to move.<br>\r\n<br>\r\n\"Also you might be a little sticky down there, i just did my toenails and it appears some of it rubbed off onto you whilst i was moving you\" She glances down and see's that you are stuck, \"That is precious now you wait right there and i will be back in a second.\"<br>\r\n<br>\r\nYou hear footsteps thunder away and try desperately to un peel yourself from the shoe but can't manage it. You suddenly hear more footsteps heading towards you and fear that miranda has returned, but instead you hear a different voice calling.<br>\r\n<br>\r\n\"Miranda! Miranda! oh where has she gone now?\"<br>\r\n<br>\r\nYou recognise the voice as that of celebrity Victoria Justice. You hear her begin to talk again.<br>\r\n<br>\r\n\"She's never around when you need her that girl!\"<br>\r\n<br>\r\nYou begin to yell in a vain attempt to make her hear you but it dosen't work, after just 2 minutes your voice has become hoarse and quite, suddenly you hear her utter words that makes your blood freeze.<br>\r\n<br>\r\n\"I wonder if Miranda would mind me trying on her boots, i mean i wouldn't be doing any harm and they look so nice and new, maybe just a quick go.\"<br>\r\n<br>\r\nYou look up and see victoria inserting her foot into the boot that you're in. You begin to scream, desperately hoping that she hears you but its to late as her toes quickly slide across your torso and face until her foot is completely inserted. Your head is directly below her soft arch and you hear her begin to zip up the boot, you close your eyes and wait for the end.<br>\r\n<br>\r\nYou hear her pulling on the other boot and zipping it up and you feel her begin to stand up, the pressure begins to build on your small body and then it reaches its peak and remains at that level of weight, you are amazed to find that you are still alive even when she has applied all of her weight onto you, you begin to struggle until she takes her first step.<br>\r\n<br>\r\nHer soft arch mashes into your face, crushing you into the shoe, with every step she takes you have a quick chance at air before her foot once again begins to assault your fragile body.<br>\r\n<br>\r\nYou feel that you cannot take much more of this, the smell and lack of air are beginning to cause you to pass out and the constant weight of victoria is slowly crushing you.<br>\r\n<br>\r\nWhat happens next...?</span></div></div>",
            "created":1344834000,
            "id":1403593,
            "title":"getting the boot"
        },
        "124311":{
            "author_id":"wh1t3f1n",
            "author_name":"F1N",
            "content":"<div class=\"\"><div> <span>Victoria continues to wander around in Miranda's boots with you in them.<br>\r\n<br>\r\n\"I wonder if Miranda would let me buy these off her, i don't know what it is but something is really comfortable about them!\"<br>\r\n<br>\r\nYou suddenly feel her freeze with her foot off you, you begin to gather hope, is she going to take the boots off, has she felt you under her foot? And then suddenly Victoria screeches and you feel and even greater force exerted on your body.<br>\r\n<br>\r\n\"Eww! There's something in my shoe, Ewww! Die! Die! Die!\"<br>\r\n<br>\r\nVictoria begins to stomp with the shoe you are in in an attempt to squish you, she stomps, she jumps up and down and exerts more force on the ball of her foot whilst pivoting it around trying to crush you.<br>\r\n<br>\r\nYour body can take no more, you bones crack and shatter your structure is flattened beneath her ginormous foot and you perish.<br>\r\n<br>\r\nYour body is further ground up by Victoria's foot for several minutes until the resulting mess is barely human.<br>\r\n<br>\r\nVictoria suddenly stops and exclaims, \" WOW! That feels so comfortable, you know what im going to take these shoes and send Miranda a check!\"<br>\r\n<br>\r\nVictoria then walks out the door still wearing the boots that contain your shattered remains beneath her sumptuous foot.</span></div></div>",
            "created":1344834000,
            "id":1403608,
            "title":"Crushing de-feet"
        },
        "12432":{
            "choices":[
                "the other contest winner",
                "somebody else"
            ],
            "content":"<div class=\"\"><div> <span>still too scared you find yourself unable to move. this ticks off the giant miranda before you. \"alright, suit yourself\" she says as she puts her boot back on and raises it over you. \"too bad, you could have been such a great foot slave\" and with that she stomps you down and crushes you like a bug. smearing your remains on the floor, she thinks about getting a new shrunk slave, but who?</span></div></div>",
            "created":1338094800,
            "id":1346403,
            "title":"stay still"
        },
        "12433":{
            "author_id":"redz028",
            "author_name":"hey you 64",
            "choices":[
                "Force him to smell all of our feet",
                "Surround him with our feet"
            ],
            "content":"<div class=\"\"><div> <span>In walks 3 people, and imediatley you knew you were in trouble.  Selena Gomez, Miley Cyrus and Victoria Justice all walk in, all wearing cowboy boots.  \"Can you believe this\" says Miranda, \"My little slave won't obey me.\"  \"Unbelievable\" said Miley.  Selena chirped in by saying \"Perhaps we should...</span></div></div>",
            "created":1339218000,
            "id":1356606,
            "title":"someone else walks in"
        }
    },
    "info":{
        "author_id":"misterwerder12",
        "author_name":"misterwerder",
        "brief_description":"celebritys rise to a mega giantess or shrink people\r\n",
        "created":1334399580,
        "description":"<td align=\"left\" class=\"norm\">In this interactive Story we are writing about the rise of celebritys and and her rise to a giantess.<br>\r\nBut please don't write one-sentence posts :)<br>\r\nFOR EVERY POST I WILL GIVE MANY GPs :)<br>\r\nThe celebrities are :<br>\r\n- Victoria Justice <br>\r\n  <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://i2.listal.com/image/1764323/936full-victoria-justice.jpg\" target=\"_blank\">http://i2.listal.com/image/1764323/936full-victoria-justice.jpg</a><br>\r\n  <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://photos-3.posh24.com/p/1150398/z/kandis_fest/victoria_justice_blue_mini_bro.jpg\" target=\"_blank\">http://photos-3.posh24.com/p/1150398/z/kandis_fest/victoria_justice_blue_mini_br...</a><br>\r\n- Miley Cyrus<br>\r\n  <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://photos-3.posh24.com/p/1043889/z/leighton_meester/miley_cyrus.jpg\" target=\"_blank\">http://photos-3.posh24.com/p/1043889/z/leighton_meester/miley_cyrus.jpg</a><br>\r\n  <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://photos-3.posh24.com/p/1043889/z/leighton_meester/miley_cyrus.jpg\" target=\"_blank\">http://photos-3.posh24.com/p/1043889/z/leighton_meester/miley_cyrus.jpg</a><br>\r\n- Selena Gomez<br>\r\n  <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.starflash.de/webspace/incoming/59923/0b02515604e0b3f85b36161b852b0937_57273fd49d.jpg\" target=\"_blank\">http://www.starflash.de/webspace/incoming/59923/0b02515604e0b3f85b36161b852b0937...</a><br>\r\n  <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://savedisneyshows.de/News/wp-content/uploads/2010/04/selena3.jpg\" target=\"_blank\">http://savedisneyshows.de/News/wp-content/uploads/2010/04/selena3.jpg</a><br>\r\n- Miranda Cosgrove<br>\r\n  <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://3.bp.blogspot.com/-MHuiU9Im9FA/Tw41MoHJJxI/AAAAAAAAEUQ/emohoh3SWh8/s1600/936full-miranda-cosgrove.jpg\" target=\"_blank\">http://3.bp.blogspot.com/-MHuiU9Im9FA/Tw41MoHJJxI/AAAAAAAAEUQ/emohoh3SWh8/s1600/...</a><br>\r\n  <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.miranda.4fans.net/wp-content/uploads/2010/08/miranda-cosgrove-creative-arts-emmys-01.jpg\" target=\"_blank\">http://www.miranda.4fans.net/wp-content/uploads/2010/08/miranda-cosgrove-creativ...</a></td>",
        "id":1861379,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1576249140,
        "modified":1576249140,
        "pretty_title":"Rising of the celebrity mega giantesses"
    }
}