{
    "chapters":{
        "1":{
            "author_id":"butterchuk",
            "author_name":"butters",
            "choices":[
                "Strapped to a lab table",
                "Strapped to a chair",
                "chained to a wall"
            ],
            "content":"<div class=\"\"><div> <span>Tom is a young guy living his dream of being a reporter, he is working a an intern at the paper he is inspiring to work at. He is 24 years old, 5 foot 10\", light brown haired, of average size around 160 lbs with good looks, lives alone with his cat, Felix, and is currently too busy with work to do anything else in his life.<br>\r\n<br>\r\nOn this cold autumn morning, Tom is getting up bright and early at around 5, preparing the food for the cat, and ironing his shirt for today's day at the office. Running a bit late, i might add, as he is ironing with a bit of toast in his mouth, little did he know, there was a team of people right outside his apartment complex, waiting on him.<br>\r\n<br>\r\n- - - - - - - -- - - - - - - - - - - - - - - - - --  -- - - - - - - - - - - - - - - - - - - - - - - - <br>\r\n<br>\r\n\"Josh, do you think he left already? he seams to be running quite late today.\" said a young slim scientist to the other more larger one, \"No Mitch, he is in there and about to come out any minute, just you wait.\" replied the larger one, \"just be patient, he will be out, and when he is, we will nab him in a sac.\" e continued, holding the sac in his hands while making sure that most of him was covered by the bush he was standing behind of. Not that the bush seamed to do much, he was after all wearing a white lab coat in broad day light.<br>\r\n<br>\r\n- - - - - -- - - - - - - - - -- - -- - - -- - - - - -- - - - - - - --  -- - - - - - - -- -  -- - - -<br>\r\n<br>\r\nWith the cat fed and his shirt ironed, our main man walks out the door and down the stairs to exit the building, not remotely thinking of the possibility of a couple of scientist waiting for him out side. <br>\r\nAs he exits the building the two scientist, Josh and Mitch, tackle and bag Tom, Mitch used to play american football, not all scientist hate sport.<br>\r\n<br>\r\nWinded and caught by surprise, our main man Tom was helpless as the duo carried him into their van and drove off to an unknown location. Josh riding in the back seat sedated the guest to ensure a smooth and peaceful journey.<br>\r\n<br>\r\nHours later, as Tom regains his senses, he finds him self...</span></div></div>",
            "created":1260062940,
            "id":801810,
            "title":"Drive by"
        },
        "11":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "\"You were supposed to start your new job today.\"",
                "\"You were just taking a coffee break but never came back.\"",
                "\"Did you forget that we were meeting for breakfast today?"
            ],
            "content":"<div class=\"\"><div> <span>Tom looks around.  He struggles to move and finds that he is strapped on what seems to be an examination table.  Bright flourescent lights over head are making it hard for him to see the rest of the room.<br>\r\n\"Hey,\" he calls out.  \"What's going on?\" His voice echoes around the room with no response.  He pauses to think about what had brought him to this room.  He couldn't remember. Then he began to question some more.  Who was he.  He didn't know his name, where he lived or anything else.  Just then he heard the sound of a door being opened and footsteps heading his way.<br>\r\n\"Oh, I'm so sorry.\" the voice echoed from behind his.  \"I was checking on my computer in the other room.\"  A slender young man reached over Toms body and started to unstrap him.  <br>\r\n\"Sorry about this but you were unconscious and I didn't want you to fall off the table.  We couldn't find anything wrong so we hoped that you would wake up.\"<br>\r\n\"What Happened to me?\"  Tom was feeling a little better with the straps off but he didn't know where he was, why he was here or even who he was and he wasn't sure that he could trust this guy, even if he did seem helpful.<br>\r\n\"My name is Mitch by the way.\" He held out a hand to Tom who was struggling to sit up.  \"Steady there, you may be dizzy.  We found you passed out in the lobby and brought you up here. Do you work here?\"  <br>\r\n\"Uhh,  No,\" Tom answered.  \"At least I don't think so.  I don't really know....\"  Tom faded off as he struggled to complete the sentence.<br>\r\n\"Don't worry.\" Mitch replied.  \"It will probably come back to you.  Meanwhile I think you should probably sit down until we figure out what happened.\"<br>\r\n\"So far, so good.\" Mitch was thinking.  The amnesia drug had wiped out Tom's memory.  Now to get the rest of the plan going.\"<br>\r\n\"Let's check your ID.\" Mitch suggested.<br>\r\nTom reached in his pocket and pulled out a wallet.  He checked the drivers license.  His name was Caleb Fergison.  That didn't seem familiar.<br>\r\n\"Let me check.' Mitch took the license and left the room.  Tom/Caleb was left alone but not for long.   Soon the door opened and Mitch was back and this time he was not alone.  Behind the slender Mitch was a taller, bulkier guy.  Seeing Tom, the big guy smiled broadly and called out.<br>\r\n\"Caleb, We've been looking all over for you.\"<br>\r\nI work for the University</span></div></div>",
            "created":1265927580,
            "id":834655,
            "title":"Strapped to a lab table"
        },
        "111":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "The production of fat cells",
                "Control of Tom's metabolism"
            ],
            "content":"<div class=\"\"><div> <span>\"I work for the university and was waiting for you to begin your training.  You are a new intern in a research project we are doing.  We were worried.  Are you all right?\"<br>\r\n\"I think so.\"Tom said slowly, \"But I don't remember anything about a job or the university and I don't even know your name.\"<br>\r\n\"First things first, Caleb.\" The big guy smiled at Tom.  \"My name is Hal and you will be working with me on the research.  You were really excited about it because you wanted to go for a Masters and this experience would look good on an application.  Remember now?\"<br>\r\nTom couldn't remember anything about a job or even his name but somehow his mind began to accept what he was being told.  Caleb began to feel like his name and he did want to work on a research project.<br>\r\nMitch was pleased.  Tom seemed to be accepting the new story about his identity just like they had hoped.  Now to see how the other parts of the experiment were working.  First, Tom had received a drug to block the inhibitions to eating.  He should no longer recognize that he was full and keep eating.  Second there was a drug to enhance his sense of smell and taste to make food more appealing.  They needed their subject to be a willing eater and once that was established they would begin to test the rest of the experiment.</span></div></div>",
            "created":1279658040,
            "id":921398,
            "title":"\"You were supposed to start your new job to..."
        },
        "1111":{
            "author_id":"ukej",
            "author_name":"ukej",
            "choices":[
                "Caleb doubles in weight over night",
                "Caleb becoms chubby ",
                "Nothing happens "
            ],
            "content":"<div class=\"\"><div> <span>\"Don't you remember, buddy?\" Hal boomed as he slapped 'Caleb' on the back, almost knocking the poor boy over. <br>\r\n<br>\r\nNow, Caleb really couldn't remember a thing he looked down to see a nylon t-shirt tucked into some elastic waist shorts, and seeing his now hairless body, \"have I always looked so boyish?\" he thought to himself. He stuttered a no before Hal cut him off \"well you're here to see the affects of obesity on young men\" he said as we warped his arm around the impressionable young man and led him off to another room.<br>\r\n<br>\r\n\"B-but I'm not f-fat\" Caleb said in a meek voice, almost like he was questioning it, \"not now but soon you will be! Boomed a proud Hal\".<br>\r\n<br>\r\nMitch watched on as the impressible Caleb formed a new identity right before him, \"yes Caleb, soon you'll be splitting those seams and we'll have to change you into something more... <i>fitting</i>\" he began laughing and patted Caleb's flat tummy.<br>\r\n<br>\r\nCaleb looked at the two men and wondered momentarily why he would agree to such a thing, but didn't really question it; he was putty in their hands thanks to the drugs they'd used, they could reprogram him into their obedient little lab rat...<br>\r\n<br>\r\n\"Now drink up, buddy\" Hal gleefully said as he handed Caleb a class of thick pink liquid. <br>\r\n<br>\r\nIt teased like creamy and felt thick, Caleb drank it all up, just like the good boy they where training him to be.<br>\r\n<br>\r\nThe scientists then took him to his room, they explained that he was to sleep on sight for the duration of the experiment, and side stepped his questions about how long that would be, putting him to bed soon after they left the room to discuss their expectations for the morning...    </span></div></div>",
            "created":1401818580,
            "id":1806647,
            "title":"The production of fat cells"
        },
        "11112":{
            "author_id":"butterchuk",
            "author_name":"butters",
            "choices":[
                "Caleb Starts to pack on serious weight in front of Mitch",
                "The scale malfunctioned"
            ],
            "content":"<div class=\"\"><div> <span>As morning approaches Caleb stirs in his sleep...<br>\r\n<br>\r\n\"uurg\" Caleb moans as he stirs awake, raising both hands to his head.<br>\r\n\"oh, my head!\" feeling a banging headache, like he had been drinks last night and was left with the worst hang-over. Caleb opens his eye to take in his surroundings, confirming that he is still in the research facility, white walls, white lights, white bed and white bed clothes.<br>\r\n<br>\r\nHe lies on the bed for a while, not really feeling the energy to move, still nursing his head hoping that what ever force was trying to pry it open would give up eventually.<br>\r\n<br>\r\nLazily he moved a hand down to his stomach, it was curiously met with a soft cushion. He played with the said cushion for a minute or two before realising it was part of him, feeling the sensation of moving a part of his own body. <br>\r\n<br>\r\nHe put his hand under the bed sheet to get a better feel, still not feeling up to moving his head or his other hand, as his hand slipped under this sheet, he came in contact with the \"cushion\" a lot sooner than he thought he would, feeling how soft and warm it felt, tracing his way to the middle of it with his index finger. He couldn't help but notice how much warmer he was getting as he kept tracing his finger around.<br>\r\nArrived at the middle, his finger fell into a hole, he could feel that half the finger was now incased in the warm and soft mass, then it clicked, that was his belly.<br>\r\n<br>\r\n\"Oh my god\" Caleb shouted in a wave of panic as he thrusts the sheet into the air revealing his body from the soft white sheets. He quickly sat upright \"urgh!\" feeling the pain in his head as he does so, looking down at his form, also taking a lot of effort to sit up. Gazing down at what once was his flat stomach, now sits a sizeable bit of chub, folding over and spilling onto his lap a little, grabbing it with both hands trying to contain it, but just causing it to jiggle.<br>\r\n<br>\r\n*Door Opens*<br>\r\n<br>\r\n\"Caleb are you alright? We heard you yell?!\" Mitch said has he entered the room, clipboard at the ready.<br>\r\n<br>\r\nCaleb just sat there in silence, holding onto his belly, confused and alarmed.<br>\r\n<br>\r\n\"I see we are making progress!\" Notes down Mitch as he approaches the bed.<br>\r\n\"Are you shocked of the results of the serum you took last night? I say we couldn't be prouder!<br>\r\nTell me, how do you feel?\" Mitch holding up his clipboard attentively awaiting Caleb's feedback.<br>\r\n<br>\r\n\"urgh, I feel awful, feels like I partied too hard last night! Banging headache!\" raising a hand to his head, noticing that he is not sweating a bit.<br>\r\n\"and is it me or is it really hot in here?\" He said as he wiped his brow.<br>\r\n<br>\r\n\"A Headache you say? And you feel warm?\" said Mitch as he looks down at his clipboard and scribbles in a few notes, flipping through pages at the back.<br>\r\n\"Ah, don't worry, everything is under control, your headache will disappear in the next hours or so. If you wouldn't mind though getting up and coming over here to the scale so we can assess the success of the serum.\" Mitch lent a hand to Caleb helping him off the bed and ushering him to the scale in the corner of the room, which had a mirror in front of it.<br>\r\n<br>\r\nCaleb felt heavy, feeling his body jiggle a bit with every step, noticing how tight his underwear felt, hearing his steps thunder a bit as he went.<br>\r\n<br>\r\nOnce in front of the mirror Caleb gasped, he was a site, he felt heavy and he looked heavy!<br>\r\nHis face filled out a bit, he had a small double chin, his pecs were now small moobs, his arms were thicker, his belly was big and wide, followed by some wide hips and thick thighs.<br>\r\nHe looks like he must have put on 80lbs! <br>\r\n<br>\r\nHe started to run his hands around his form, looking down at it and taking a closer look at his fat, it was soft, a lot softer than it look, feeling it's weight, raising it, letting it back down, grabbing his belly and noticing stretch marks in the middle, running all along the side onto his sizeable and wide love handles. Following them down to his back where he was met with his sizeable ass, his cheeks were big! No wonder his hips are wide, that ass filled his underwear to the max, testing the fabrics elasticity.<br>\r\n<br>\r\n*Beep Beep* A noise under his feet indicated the scale was don't measuring.<br>\r\n253lb in big red letter read in the display.<br>\r\n{93lb gain!} Caleb thinks to him self <br>\r\n{I'm so fat now! I wonder if it'll stop here or if they ask me to take more serum?} Jiggling his love handle noticing it's getting rather sweaty<br>\r\n{so so so warm in here, I wish there was a window} he thinks as he looks around the room, catching Mitch in the act of staring at his ass.<br>\r\n<br>\r\nMitch was busy writing notes down in his clipboard and staring at Caleb's rather large behind, the noise broke his gaze at Caleb's ass.<br>\r\n\"Erm, Marvelous progress! Well Done Caleb\" Mitch stumbles to congratulated Caleb.<br>\r\n<br>\r\n{Was he just checking me out?} Caleb thinks to him self feeling his face turning a little red as he blushes.<br>\r\n<br>\r\n\"But we haven't finished yet, your body temperature should increase until further effects of the serum take place, that is why you have a headache and your getting warmer\" Just as Mitch said those words...<br>\r\n*Beep Beep*<br>\r\nThe scale beeps again.</span></div></div>",
            "created":1401825600,
            "id":1806679,
            "title":"Caleb becoms chubby "
        },
        "1112":{
            "author_id":"mikeyboy20",
            "author_name":"IronLotus",
            "choices":[
                "They Slow down Tom/Caleb's metabolism",
                "They moniter his eating first",
                "they do neither and test something else. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>They would later test the rate of Tom/Caleb's metabolism. They would see how much they could slow it down so that whatever he ate turned to fat quickly. <br>\r\n</span></div></span></div>",
            "created":1300915260,
            "id":1075003,
            "title":"Control of Tom's metabolism"
        },
        "11121":{
            "author_id":"butterchuk",
            "author_name":"butters",
            "choices":[
                "Waking up to a large surprise",
                "Caleb starts to sleep walk"
            ],
            "content":"<div class=\"\"><div> <span>Caleb now sat in Hal's lab, a floor below to the one he woke up in, about to be injected with some groundbreaking experimental drug created by someone he can't seem to remember. As alarm bell rang off in Caleb's mind, he clearly chose to ignore them, as he put his arm out to Hal to receive the first dose.<br>\r\n<br>\r\nFeeling the sting, the rush from the foreign substance in his body and then lights out happened all within a minute. Caleb fell like a mannequin on the floor from the chair he was sat on with a thud.<br>\r\n<br>\r\n-------------------<br>\r\n<br>\r\nHal couldn't believe how well this was going, Caleb was accepting his new role as assistant/lab-rat and had not yet remembered anything that would complicate things. <br>\r\nWell I mean, shame he hit the floor as he passed out, but these things happen. <br>\r\n<br>\r\nHal picks Caleb up off the floor and lays him down on the sofa in the lab, gives him another 5 different shots (might as well while he is out cold) and returns to his paperwork, waiting for his lab-rat to wake up so he can monitor the effects.<br>\r\n<br>\r\n--------------------<br>\r\n<br>\r\nCaleb awoke a few hours later, his head hurt a little bit, he did remember falling and even though it doesn't hurt that much, he thought it would be wise to stay laying down.<br>\r\n\"Hey Hal, how long was I out for?\" Caleb asks Hal, who is sitting at a near by computer terminal.<br>\r\n\"About a few hours, sorry for the fall, I didn't expect the drug to make you pass out\" apologised Hal<br>\r\n<br>\r\nAs Caleb laid in silence on the sofa, a loud nice erupted from his slim midsection. <br>\r\n\"I guess you must be hungry Caleb, help your self to the fridge in the hall\"<br>\r\n<br>\r\nCaleb carefully got up and walked to the fridge, finding it rather full of tasty looking treats. Being a sweets man, Caleb grabs a large creamy trifle and a spoon for the near by cutlery drawer and goes back to sit on the sofa, taking a spoonful of the dessert on the way.<br>\r\n<br>\r\nThe taste and texture totally blew Caleb's mind, it was like nothing he'd ever tasted, even though it looked store bought. Puzzled a little bit, worried non, our hero plows through the trifle at an alarming rate, guess he was hungry after all.<br>\r\n<br>\r\nHal made appropriate notes as he observed caleb from security camera feed on his computer, so to not look like he was staring, feeling a bit proud as the serums he created seem to be doing their job.<br>\r\n______________<br>\r\n<br>\r\nFeeling a little bit satisfied, after eating the large trifle, Caleb starts to feel a little bit sleepy, so he puts the dish down on the floor and lays down on the sofa, resting a hand on his bloated gut. As he lays there his stomach starts to make some loud noises, like gurgling, but Caleb hardly notices as he drifts off to sleep...</span></div></div>",
            "created":1351601760,
            "id":1456610,
            "title":"They Slow down Tom/Caleb's metabolism"
        },
        "11122":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "casserole",
                "chicken"
            ],
            "content":"<div class=\"\"><div> <span>Hal and the research team were watching as Tom who now believed he was Caleb sat down in the conference room.  They hadn't said anything to him about the project just that he would be meeting with Hal in a few moments.  The research team wanted to know how Tom responded to the treatment before making any more adjustment.  First they wanted to know if enhancing his sense of smell and taste would affect his eating.  So far, Tom hadn't noticed the buffet table set up in the conference room.  Two hot trays held an Italian pasta casserole and chicken and dumplings.  It wasn't a well balanced meal but the test was to see which aromas attracted Tom and if he could resist eating.  Garlic bread and creamy bread pudding completed the spread.  As they watched, Tom began to fidget and look around.  He got up.  Hal was capturing this all on video to document Tom's changes during the experiment.  Tom was borderline skinny with slacks hanging on his bony hipbones. He moved with purpose toward the buffet.  Since the buffet was barely visible behind a low partition, it was clearly the aroma that drew him.  Now the question was.  would Tom eat.<br>\r\nThey watched as Tom glanced furtively around the room and picked at the serving utensils.  He turned to go back to the table, then lost control.  Tome rushed back and served himself a huge plate of </span></div></div>",
            "created":1319330640,
            "id":1211186,
            "title":"They moniter his eating first"
        },
        "111222":{
            "author_id":"gowide",
            "author_name":"Gowide",
            "choices":[
                "Caleb finished the chicken",
                "Caleb starts the casserole."
            ],
            "content":"<div class=\"\"><div> <span>Tom rushed back and served himself a huge plate of savory chicken and dumplings.  <br>\r\nHal chuckled at Tom's furtive demeanor.  He kept looking to the side as if to see if anyone might steal the food from him.  He looked a bit like a starving dog.  The treatment seemed to be working and the aroma of the chicken seemed to win over the casserole.  Hal suspected that his new drugs would help Tom transition easily to Caleb and Hal had plans to provide Caleb with all the proper information to facilitate this.<br>\r\n<br>\r\nCaleb was finishing the third piece of stewed chicken and was wiping up the sauce with a dumpling.He looked up furtively and checked to see if anyone was looking.<br>\r\n<br>\r\n\"Show time.\"  Hal announced to the crew.  \"I'm going in.\"<br>\r\n<br>\r\nCaleb looked up when Hal entered and tried to hide the plate.  Sauce was dripping from his chin onto his shirt front.<br>\r\n<br>\r\n\"What' the idea?'  he asked.  <br>\r\nCaleb looked embarrassed.  \"I smelled that food and I just couldn't stop eating.  I'm sorry. I don't know..  it sure tasted good.\"<br>\r\n\"You know that was lunch for the volunteers.  I never thought  you would help yourself.  You always such a pig?\"<br>\r\n\"I''m really sorry.  It's not like me really.  I swear I never smelled anything so good.  I didn't eat that much.\"<br>\r\n\"Not much?  You ate half of the chicken.  You think that's not much?\"<br>\r\n\"Well, there isn't enough for the volunteers now.  You happy, pig?\"<br>\r\nHal gave Caleb a disgusted look and left the room.  Then he returned to the observation room and watched.<br>\r\nFor a time Caleb sat but then started looking furtively at the food.  <br>\r\n</span></div></div>",
            "created":1319591580,
            "id":1212963,
            "title":"chicken"
        },
        "13":{
            "author_id":"butterchuk",
            "author_name":"butters",
            "choices":[
                "Lab Rat",
                "Taste tester",
                "Slave"
            ],
            "content":"<div class=\"\"><div> <span>Winded and caught by surprise, our main man Tom was helpless as the duo carried him into their van and drove off to an unknown location. Josh riding in the back seat sedated the guest to ensure a smooth and peaceful journey.<br>\r\n<br>\r\nHours later, as Tom regains his senses, he finds him self...<br>\r\n<br>\r\nCold and alone. As he regains his senses he can feel he is being held upright by something around his wrists, with his back against the cold hard stone wall.<br>\r\n<br>\r\nFreaking out a little bit by his current situations he tries to fight his restraints, to find his is bound at the ankles as well, and the wall behind him felt really cold on his bare skin. He made a mental note, he had nothing on apart from his underpants, this room looked like a basement and that the wall opposite him is a full wall-sized mirror. He could notice from his reflection that he was indeed having a bad hair day, running late in the morning usually resulted in that.<br>\r\n<br>\r\nSuddenly a voice booms in the room from some very well-hidden speakers....<br>\r\n<br>\r\n\"Hello Tom\" the deep distorted voice boomed, making quite obvious they were using some voice modifying software.<br>\r\n<br>\r\nTom could only stare at him self with a slight freaked out look on his face.<br>\r\n<br>\r\n\"We hope you had a pleasant ride here\" the voice carried on booming, Tom's face could only turn from freaked out to puzzled by the last remark, he is chained to a wall, what does the trip in have to do with it!?<br>\r\n<br>\r\nThe voice continued to boom \"You have been selected, due to the convenience of your life-style and your skills as our personal...\"</span></div></div>",
            "created":1315076340,
            "id":1180309,
            "title":"chained to a wall"
        },
        "132":{
            "author_id":"spunky",
            "author_name":"Ace Jones",
            "choices":[
                "Salty Dog.",
                "Taz the Tasmanian devil from Taz Mania the animated series."
            ],
            "content":"<div class=\"\"><div> <span>\"Taste tester\" the booming voice said.<br>\r\n<br>\r\n\"Taste tester? oh i get it, i get to taste test something don't i?\" Tom asked the booming voice.<br>\r\n<br>\r\n\"That's right and you're in for a literally speaking great big fat surprise of sorts\" the booming voice said.<br>\r\n<br>\r\nRight after he was done speaking, a tube filled with a mysteriously colored liquid came down from the ceiling itself as the tube placed itself within Tom's mouth and Tom   <br>\r\ncouldn't help but consume the liquid itself until the tube was empty and went back up into the ceiling itself.<br>\r\n<br>\r\nAfter a few moments, Tom's transformation commenced as his arms and legs transformed into that of fat animated furry super sized arms and legs, next animated fur started growing all over his body, then an animated furry nose replaced his regular nose and finally, he rapidly started gaining weight until he was finally super sized having now broken the chains against the wall that held him there to begin with.<br>\r\n<br>\r\n\"What have you transformed me into?! Tom said.<br>\r\n<br>\r\n\"I've transformed you into a how i would say super sized animated anthropomorphic creature namely...</span></div></div>",
            "created":1401827700,
            "id":1806698,
            "title":"Taste tester"
        },
        "133":{
            "author_id":"creater1",
            "author_name":"Cre8r 1",
            "choices":[
                "Tom Resists Feeding (Dark Stimulation to be Explained)",
                "Tom Eats Everything & Becomes Immobile by the End of the Day",
                "Kidnapper/Feeder/Scientist's P.O.V. What's Going On?"
            ],
            "content":"<div class=\"\"><div> <span>\"You have been selected, due to the convenience of your life-style &amp; your skills as our personal slave, sex slave to be precise\". Tom's eyes bugged out at the thought of what would have to do for these strange people, if they were people at all.<br>\r\n<br>\r\n\"To satisfy our needs, you must first be made emotionally docile &amp; reliant on us for fat fulfillment, sweet satisfaction, &amp; round relief through advanced hypnotherapy.\" Tom must have fainted again because the last thing he remembers are these little needles injecting themselves slowly into the back of his neck. He felt something attach itself to his inner ears, lungs through the nasal orifice, mouth, &amp; over his eyes. Then after a few beeps, Tom felt overwhelmed when his perspective of the room went crazy with lights, sounds, &amp; smells. He slept &amp; dreamt so weirdly; no dreams, yet he still remember having something, it was like being a lucid dreamer, but no dream so to speak, just a spiral of darkness &amp; endless whispers. When Tom awoke he was dizzy, hardly having any memories left as it slipped out of his mind till like water from a broken dam.<br>\r\n<br>\r\nWhen the dizzyness wore off &amp; Tom was cognizant &amp; awake, he noticed he was strapped down to a futon with a long table of food in front of him. a banquet of rich &amp; fattening foods. He looked &amp; smelled the food &amp; went manic because need of something to eat after a dreamless sleep. Then looking at the heart monitor screen that changed with the wavelength of a voice as it was speaking, it greeted him. \"Greetings subject Slv-1. Your first official feeding is taking place, we have gathered some of the most delicious foods on the planet you will be fed all of it with your head free to move. Be warned if you disobey, you will be forced to eat by the nanobots in your muscles that control you &amp; then undergo <b>Dark Stimulation</b> Therapy. It will be explained later what that means after you have finished eating. Now we are releasing your head &amp; neck restraints, do not resist, just eat &amp; enjoy...\" Then the banquet was brought up to him by robotic servants who cut it up &amp; fed me every massive morsel of meat, every carbohydrate of calories &amp; corpulence, &amp; every liquidy lipids of lard. Did I resist? or how about going to the kidnapper/feeder/scientist's perspective.</span></div></div>",
            "created":1413337920,
            "id":1871746,
            "title":"Slave For Stimuli"
        }
    },
    "info":{
        "author_id":"butterchuk",
        "author_name":"butters",
        "brief_description":"Male weight gain story about a young reporter who gets taken by a mad team of scientist.",
        "created":1260061680,
        "description":"<td align=\"left\" class=\"norm\">Tom is a young 24 year old go-getter, pursuing his dream to become a journalist at the prestigious news channel \"NTV\". Although he is currently serving an inter-ship at his local news channel \"South South-Kensington News\".<br>\r\nNot that details got him down, he was happy to be serving an inter-ship in the first place and just got on with it.<br>\r\n<br>\r\nSo, another day, another report!<br>\r\n... But today will be a very different day, involving very different reports.<br>\r\n<br>\r\n_____________________________________<br>\r\n<br>\r\n<div class=\"bquote\">Don't be shy! Come on in and Add some chapters, this story can go anywhere you want to take it! (within the concept of experiments, inflation, weight gain, a little mpreg maybe, ecc.)</div></td>",
        "id":1624254,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1413337920,
        "modified":1413337920,
        "pretty_title":"The Catch"
    }
}