{
    "chapters":{
        "1":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Will & Bob",
                "Story1",
                "Story2",
                "Story3",
                "More Characters/Storylines"
            ],
            "content":"<div class=\"\"><div> <span>Ok, to start off the story, we have to decide on a main character. As there is only one at the moment(mine) I will leave the options as 'Story1, Story2, etc.' and edit them as the Stories appear.<br>\r\n<br>\r\nThe last option in every chapter is to be \"other\" which will lead to a choice chapter, so that others can add. All the other options are yours to do with as you please.<br>\r\n<br>\r\nPlease at least check my first chapter if you plan to make a new character, as it will help show you the setup for the character introductions.</span></div></div>",
            "created":1297400400,
            "id":1052349,
            "title":"The Beginning After The End"
        },
        "11":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "William",
                "Robert",
                "Mark",
                "Rebecca",
                "I've decided not to use this story(obligatory Other choice)"
            ],
            "content":"<div class=\"\"><div> <span>Main Characters: William Gonfree, and Robert Willians, Mark Sinto, and Rebecca Tresdon.<br>\r\nBackgrounds:<br>\r\nWilliam: One of the few surviving experimental subjects<br>\r\nAge: 17<br>\r\nPowers: Unknown<br>\r\nBack Story: Unknown, he lost all of his pre-16 memories and was picked up off the side of the rode by bob and a few fellow scavengers<br>\r\n<br>\r\nRobert: A scavenger trying to survive in the wake of the events that made the world a wasteland.<br>\r\nAge: 22<br>\r\nPowers: None<br>\r\nBack Story: Grew up in a tough neighborhood, but never actually lost his ability to care, he always acted the hero, and was beat up a lot for it, because of this, he's become quite adept at physical combat, and can handle hoards of mutant animals at once. Prefers to be called Bob.<br>\r\n<br>\r\nMark Sinto: Was the lead researcher on DNA manipulation. Is married to Rebecca.<br>\r\nAge: 42<br>\r\nPowers: None<br>\r\nBack Story: Graduated Top of his class in the most prestigious college he could get into. Blames himself for the world becoming a desolate wasteland.<br>\r\n<br>\r\nRebecca Tresdon: Was the assistant researcher in charge of life-sign monitoring in the human subjects. Is married to Mark, changing her name to Rebecca Sinto.<br>\r\nAge: 39<br>\r\nPowers: None<br>\r\nBack Story: Graduating in the top 3 GPA scores in her classes, she was a very intelligent woman. Wishes she could have changed the outcome of the experiments.<br>\r\n<br>\r\nso, whose eyes will you watch out of?</span></div></div>",
            "created":1297400400,
            "id":1052354,
            "title":"Will & Bob"
        },
        "111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "approach it?",
                "leave it alone?",
                "other"
            ],
            "content":"<div class=\"\"><div> <span>In an alley, between some crumbling buildings in some unknown city that has been abandoned for years, two men are searching for anything that might be considered valuable in this hole of a planet they call home. The first is a man that goes by the very generic name of Bob, his real name is Robert Willians, but he’s said he’d prefer Bob, Bob’s an average looking 20 something guy, an average build, a tough looking face, that sort of thing, the second, a man, well, boy more than man really,is you, by the name of William, William Gonfree, you are only about 17 or so by your looks. You and ‘Bob’ have been on many a scavenger hunt together, mostly ‘cause the Group you live with likes how your names are so similar, even if they are different parts of the name.<br>\r\n<br>\r\n\tA ‘Group’, for lack of a better term when they were first formed, is basically a place where many people seek refuge. You two belong to Group Omega 32, a very run-down Group at that, not more than maybe half the walls can actually hold any kind of weight other than the pressure from the wind that buffets them nearly every day. The world went downhill a few years back, ten, twenty? No one really remembers, but it happened, some kind of infestation rushed all over the world, North, South, East, West, it didn’t matter where you were, the infestation got you. Some called it a disease, some an infection, the threat has died down a lot since the first time someone found a way to ward off whatever it was, but it was still there.<br>\r\n<br>\r\nLooking around you notice something on the ground that could prove valuable, do you...</span></div></div>",
            "created":1297400400,
            "id":1052361,
            "title":"A Beginning From An End"
        },
        "1111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "A little back story on this world while we're waiting.",
                "Skip straight to the main story.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>“Hey Bob!” you yell, crouching over something in a pile of garbage and other things, pieces of cement and plaster from the decaying buildings part of said pile, “What?! What is it! I’m busy over here!” Bob called back, “whatever it is, it can wait, I think I found a car battery over here, gonna see if it still has any juice!” Shaking your head at Bob, you bend down and pick up an old hand-held T.V. set, small 5 or so inch screen, long, but twisted, antennae, and a few knobs for changing channel. “Let’s see what’cha got little guy.” you whisper, as you flip the power switch and turn a knob or two, “Hm, nothing, huh? Well I didn’t really expect much, I mean, almost nothing works around here nowadays anyway.” You're about to toss it when it’s screen slowly starts to glow white, the screen a bit fuzzy, and filled with static, so most of whatever’s showing isn’t clear, but there is something showing all right. “H-hey Bob! Come here man! I got a working television!” you exclaim, watching the screen while trying to get some discernable sound from it.<br>\r\n<br>\r\n\tBob, who was busy hooking the car Battery up to a special machine that he’d made at the Group, Drops the attachment wires and runs over to you. “No way! You found a WORKING T.V.?! that’d fetch a huge price at the trade in post! Well, come on! Let’s see it!” he says, while trying to get around all the junk between him and his partner. “Well, it’s not 100% working, the picture’s a bit fuzzy, and it’s a hand-held one, really old too, so it’s only black and white, but it seems to have picture at least.” you respond, showing Bob the hand-held. “Hm, well, let’s see…” Bob mumbles, as he checks the knobs and switches. “Ah, here we go! The volume is right here! And this...” Bob pulls out what seems to be an old pair of headphones, “this should fix the static a bit, hopefully.” Bob checks for a head-phone jack. “What is this?! There’s no where for these to plug in!”, “well, Bob, that’s ‘cause this is an OLD set, so it was a little before the time of head-phones.” you joke, making fun of Bob, who in turn glares at you. “Ok, ok, I was just joking, don’t get so mad, but it’s true, we’ll need to find some other way to clear up the sound.”<br>\r\n<br>\r\nAround this time, the sound from the machine cleared up a bit, maybe the wind blew something blocking the signal out of the way, or sun spots were acting up, even though sun spots usually work the other way, anything’s possible ya know, and they could hear what sounded like a plea for help, not the kind you’d usually hear in anticlimactic action shows or movies, where it’s a girl screaming “Help! Help! Please help me!” no, this was a man, and he somehow sounded calm, and panicked at the same time. “-ease, if you- -ting this you must s—d for help, it----- they’re everywhere! Please! If you- ge-ing this, these…THINGS, must be s---ped. If they get out i---  all over again! The-“ the message ends abruptly there as some kind of furry ropes, or tentacles, maybe hands, grab the man and drag him beyond the view of the Fuzzy picture. A few seconds later, some kind of head, almost seeming human, and yet animal somehow, poked into view, then the screen lost all picture and was just static.<br>\r\n<br>\r\nYou two are watching, amazed, “How do you suppose they did it?” Bob asks, “Did what?” William replies, “ Broad casted that movie of course, smart guy, I mean it was really well made, better than anything we could make now, must have found a way to play and broadcast an old movie or somethin’.” Bob answers, going into a dream world of thoughts. You, seeing that Bob isn’t paying attention anymore, turn back to the hand-held, only to see it is completely black. “Great, batteries had enough time to play that before they died, but couldn’t last ‘till I turned the darn thing off? Well that’s fine, ‘least we know it works now.” He complains as he flips it over to check the batteries.</span></div></div>",
            "created":1297400400,
            "id":1052365,
            "title":"And So It Starts"
        },
        "11111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Continue.",
                "Return to main story."
            ],
            "content":"<div class=\"\"><div> <span>(not switching characters, but giving the background info on my side characters like I said I would...just in story form.)<br>\r\n“We’ve done it! We’ve finally done it!” Mark Sinto yelled as he looked over the results on the computer’s monitor. “We’ve done it! Our 8 years of research and work has finally paid off! We have our first successful human test! He’s adapting to the infusions better than I’d ever hoped he would!” Rushing past the many terminals and beakers that lined the tables around him, Sinto worked his way to the tank that held a single young boy, not more than maybe 5 months old. “This boy, he shall be our crowning achievement!”<br>\r\n<br>\r\n\tSinto is a Scientist, working for a lab that calls itself the STE, or Scientific Terrestrial Experimentation, lab, it’s whole purpose is to help bring mankind further into the path of perfection. It’s latest attempt, was an experiment meant to combine humans with the abilities of animals, in a way that would only transfer the good parts, such as strength, or speed, while keeping out the parts that might damage the human mind, such as the Instincts of a cat to chase almost anything smaller than itself that moves, or a bird’s need to go south for the winter. Of course they don’t head straight into human testing until they know it might be possible in a human, in other words, a few animal tests are needed.<br>\r\n<br>\r\n\tEight years ago, the lab had started with a over 200 thousand mice, today, of those they started with, only 10 remained, but those 10 were ten times stronger than normal mice, almost as smart as an average cat, and around twice as big as the average mouse, those were successes. They did many tests, always wondering why some would fail, then they figured it out, all of the mice that survived where less than 3 days old during the infusion of animal DNA! It appeared that the animals were more acceptable of the DNA the younger they were, so it was decided that only newborn animals would be used, and the adults used to breed in case of more being needed. After mice it was rats, cats, dogs, and so on and so forth until finally, they came to the monkeys, the closest they could get to humans without illegal testing. Their first few were failures, no one could figure it out, what was the difference? Sinto was the one that figured it out, the bodies of the monkeys were maturing too much inside the parent, they had to have the Infusion happen before the immune system was finished in the body so the animal’s body wouldn’t fight it in such a way that it turned into a violent internal fight for survival.<br>\r\n<br>\r\n\tThen came the news of success, thousands of people, wanting to be ‘improved’ came and offered themselves as testers, they were all willing to get a chance at being ‘Super human’ even if only for a while. Many were set off by the news that the subjects had to be unborn kids, and that they might die, but many people who wanted a way of either getting an amazing child, or an abortion actually came, they lost most of the kids, only a handful made it through the rest of their time in the womb, some even lived a while after that, showing signs of amazing feats such as: strength, speed, and dexterity.<br>\r\n</span></div></div>",
            "created":1297400400,
            "id":1052368,
            "title":"23 years earlier."
        },
        "111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "End Of Back Story",
                "Not much to do, but, Other."
            ],
            "content":"<div class=\"\"><div> <span>This brings us to the shouting Sinto, after many months, they had a baby that, although weak and barely alive, was still alive after a month of being out of it’s mother’s body. “Yes, this one is coming along nicely, hopefully it will last, maybe even be able to live outside of this tube. What was it again?” Sinto asks himself as he checks his clipboard, “Ah yes, raven and dragon, interesting combination, the cunning and dexterity of a fox, with the power and majesty of a dragon, I do hope he makes it through, I’d like to see what comes of it. I’m so glad we found those dragon remains…everyone thought they were dinosaurs, but after cloning, what do we get? A dragon! It’s simply astounding.” After he’s done taking the measurements on the tank, Sinto walks away and leaves to give his announcement and findings to the rest of the scientists.<br>\r\n<br>\r\n\tAfter Sinto leaves, a strange sound can be heard coming from the tank with the child in it, it was almost a whirring noise, but also a little like the grinding of something on the wall or glass, if anyone was to hear it it’d make their skin crawl. All of a sudden, the glass around the tank cracks, an alarm sounds, and about twenty people rush in, the crack grows, and the child inside the tank squirms, as if writhing in pain. “No! Wha-What’s going on here!?” Sinto yells, as he rushes towards the tank, and starts hitting keys on the terminal control for it. “Sinto! Watch out!” A woman, Rebecca Tresdon, Yells, right as some kind of creature jumps off a table next to him. “What is that?!” yells a nearby scientist. “That…that’s one of our mice! It’s mutated!” another scientist said, “how’d it get free?!”, “ I don’t know, nor do I care, kill it! It’s attacking Sinto!” Rebecca screams, as she grabs a nearby Scalpel and grabs the mouse preceding to stab it and cut off it’s head so that it was sure to be dead.<br>\r\n<br>\r\n\tSinto, scratched up and bleeding, walks back over to the terminal and attempts to diagnose the tank’s problem. A few minutes later, the tank is stabilized, and the child inside is floating in the liquid oxygen like it’s supposed to. “Well, it seems the problem’s under control for now. Get a mechanical team up here to replace the glass on the tank as soon as possible, understood?” He says into a walky-talky, “And see if you can figure out how the mouse got out of it’s cage.” “Yes Professor Sinto!” the radio answers back. Turning to Rebecca, Sinto says, “Thank you, I might have been seriously hurt if you hadn’t killed that thing, but didn’t it seem odd?”, “Odd? How so?” Rebecca asked, “Well, all the mice we have left, are supposed to be pretty docile, the rats too, but that one just jumped at me, it was like it was insane with rage or something.” Sinto answers, “Yes, I suppose it is a bit strange, that one of our animals would attack you without provocation, but-“ before Rebecca could finish the sentence, the PA shrieks on, “We’ve got a situation in Lab 4! The animals have all escaped! Repeat, be on the look out for any experiments! We have reason to beli-“ there’s a loud sound in the background before the system goes completely quiet.<br>\r\n<br>\r\n\tFor a while the room was as silent as the PA as everyone tried to understand what the announcement meant, then, all at once, almost everyone in the room jumped up and started running for the door, screaming something about evacuation, escape, hiding, or some other such survival tactic. Meanwhile, Sinto and Rebecca have been too shocked to really do anything, until someone bumps into Sinto, snapping him out of his shock, “We need to go too! If all the animals are as violent as the mouse, we’re in danger here!” He says, grabbing Rebecca and pulling her towards the door. “But, how do we get out? Lab 4 is between us and the entrance, and the back door is way too far to try and run to! Besides, even if we did make it out, how would we out run the animals that are bound to chase us?!” Rebecca asks, panic easily showing on her face, “If we can make it to the weapons in the security station, we may stand a chance, I mean, that mouse was bigger, but not much harder to kill than a regular one, there’s a good chance a gun can take out any of the animals we have here, we can eliminate all of them if we have to!”<br>\r\n<br>\r\n\tStill in a little shock, Rebecca follows Sinto out the door and into the hall, heading for the Security Station, and relative safety. Five minutes later, and numerous close calls with animals, a cat, rat, and about ten more mice to be exact, they make it to the security station. “So, now what? Just make a break for it?” Rebecca asks, eyeing her pistol, “I’ve never used a gun before, I don’t think I’ll make a good partner in this plan.”, “Don’t worry, if it comes to shooting, I’ve had a few lessons, hopefully we can just get out and run, but if not, I’m also setting this place to lockdown and self-destruct, to ensure these things don’t get out.” Sinto assures her, and then, taking her hand and pressing a button on the underside of the Security terminal, makes a run for the doors, about 20 feet away, as the gates are closing<br>\r\n</span></div></div>",
            "created":1297400400,
            "id":1052371,
            "title":"Back To The Laughing"
        },
        "1111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Home Sorta Safe Sweet Home",
                "They Run Into Trouble"
            ],
            "content":"<div class=\"\"><div> <span>“Yo, William, you comin’, or what?” Bob yells, hopping into the trucks driver-side seat, “Yeah, Yeah, I’m coming, not much left here anyway.” You yell back, grabbing the hand-held and your bag of assorted junk, and get in the passenger side, “So, Bob, you think of a way that this thing worked without batteries?” you ask showing Bob the battery slots, completely empty, filled with dust, and rusted, no signs of having a single battery in it for at least 5-6 years. “Nah, Technology isn’t my thing, but I can say this, if we can get it to do it whenever we want it to, we’ll be rich! Even the most, uh…what was that word you used?”, “Aristocratic?”, “Yeah, yeah, that, aristocratic, what’s that mean anyway? Well, never mind, even those rich idiots’ll pay big bucks for something that runs without an energy source!” Bob finishes with a big hearty laugh as they drive off into the desert wasteland towards their Group bunker.</span></div></div>",
            "created":1297400400,
            "id":1052372,
            "title":"Present Day"
        },
        "11111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Later, After The Sell",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>A few hours later, you and Bob are within sight of the bunker, which turns out to look more like a fortress, albeit a run down one. If one were to look at it they’d see a big, bulky looking building, with what seemed to be metal sheets for walls, a really tall watch tower-like structure rising up from the middle, a big stone wall surrounding the whole thing. The gate, looking like it’s about to fall over in it’s trains, slowly opened for you, screeching as it went. Inside the wall, was a bunch of smaller buildings, one would assume them to be the places where the residents of the bunker slept. Run down old things, that looked like they might fall in on themselves any second.<br>\r\n<br>\r\n\tWhile we’re describing stuff, let’s get a little detail on a menace to the survivors of the catastrophe that made this world like this, the Teone(Tay oon), the name was given, by someone, no one really knows who, but it’s in some language no one knows. A teone can come in many different forms, they are usually mutated versions of a mammal, reptile, bird, or other form of life, and a few plants have even been reported. The teone, according to some rumors, where created by the radiation after a few places where nuked, to stop whatever it was that was destroying the world and killing millions, no one knows why there were nukes launched if it was a disease that was the cause of death, but there was even a rumor that they were alive before the nukes where ever launched, that they were the cause of all the death, but that is only speculation, no one really knows if nukes were actually used or whether all the destruction was due to the creatures or disease that spread around the world all those years ago.<br>\r\n<br>\r\n\tAs you two ride in, a few people come out to welcome you back, and to check out your haul. After saying your hellos, and fighting off a few people trying to take the stuff you collected, you went into the main building heading for the Trade-In station. “Hey, Will, how much ya think we’ll make fo’ this haul?” Bob asked, carrying two bags, “Well, that depends on the customers now doesn’t it, Bob? But I’d say a good five-twenty, at least, lots more after we check the hand-held to see how it works.” you laugh, seeing the shocked expression on Bob’s face, “I was only jokin’ Bob, it won’t make near that much, the hand-held might come close if we can get it to run without batteries like it did, but ‘till then, I’d say two-ten, maybe.” Bob gives him a little shove, “Man, come on, don’t get my hopes up like that, I mean, five-twenty would pay us a lot of weeks of rations. So don’t do that to me, it might make me do somethin’ rash if you do that at the wrong time.”, “Rash? You mean like go kill a random teone to get a piece of trash I call really valuable? Like you did that one time?” you jokes, remembering the scene well, Bob rushing off towards a well known teone hotspot, to get a transceiver Will had called valuable, and coming back, bloody and almost out of energy, clutching the near worthless transceiver. “That wasn’t funny, I nearly died out there, and all ‘cause you had to lie to me!” Bob yelled, Grabbing you with his free hand. “Dude, come on, I didn’t lie, I said it’d be very valuable, IF we had the rest of the machine, if we had a working machine for that to attach to, we’d be able to contact the other Groups and form a strategy, and maybe even a working society, not this worthless system, I mean, sure, it works, but we aren’t organized, and we barely survive teone assaults, and then there’s the fact that to contact other groups, we need tons of fuel for our vehicles, and run the risk of becoming teone food.” you say as you pry Bob’s hand off of your shirt a lot easier than someone your size should be able to. “Boy, Will, I’m always surprised at your strength. Still a bit blurry on that past of yours, huh?  ‘Cause I’d sure like to know how you’re so much stronger than me.” Bob says, looking at the 5 bags William is carrying, “Yeah, still got nothin’, can’t remember anything since before ya found me. But anyway, enough about that, we gonna go get the pay for this week or not?” Will says as he walks off towards the inner area of the bunker, Bob trying to keep up.<br>\r\n</span></div></div>",
            "created":1297400400,
            "id":1052387,
            "title":"Home Sorta Safe Sweet Home"
        },
        "111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "That Night",
                "Later That Day"
            ],
            "content":"<div class=\"\"><div> <span>“I can’t believe those cheap jerks!” Bob yells, holding a little pouch in front of him, “I mean, they aren’t usually nice or anything, but they were worse than usual today! They didn’t even give us a good price on any of that stuff we brought! Only a measly one-eighty. What happened to that two-ten you predicted?!”, “Oh, Come on Bob! I’m not psychic, I can’t guess right one-hundred percent of the time. Besides, maybe they’re not getting good trade lately or something.” you replie, picking up your screwdriver, which you had found a few months back on a scavenge trip, and start taking the hand-held apart. “Hey! What are you doing?! If you break that thing we’ll never get it sold!” Bob yells, getting up to grab the device. you looks up calmly, “Bob, you try to grab this from me and it’s guaranteed to break, and if that happens, I’ll break you, so please sit down, and let me work. I’m trying to figure out what made it work without batteries.” “But, what if you-“, Bob says, getting interrupted by a pop as the hand-held opens up. “There we go, now let’s see what makes you tick little guy.” you announce, pulling out tweezers and a smaller screwdriver, also found during scavenger trips.<br>\r\n                                                                             (Meanwhile)<br>\r\nA few hundred miles away, in a burnt and almost completely destroyed building, an odd sound is heard, before it fades away. A little hut is set up a few miles from the building, but even at that distance, the sound is heard quite clearly, a figure can be seen standing at the window. “Oh man…here it goes again.” The man says, grabbing a young boy, no older than seven, and his wife, and going over to a trap door. “Come on, we know the drill, that sound means hide, so let’s go.” Opening the door, he lets the kid and the mother down first. He looks once more out the window, “I hope this one isn’t as bad as the last one, had to clean guts out of the house for weeks.” The door closes, right as a sound that could only be described as a rock slide, or other such catastrophic event, could be heard, getting closer to the hut, with no hills in sight.</span></div></div>",
            "created":1297400400,
            "id":1052391,
            "title":"A Few Hours Later"
        },
        "1111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "The Teones Arrive!",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>you opened your eyes, and yawns, “Oh, man, how long was I asleep?” Looking over, you sees Bob lying on a bed, and lamp light coming in from the window. “Oh, that long huh?” Stretching, you stans up and look at the pieces of the hand-held in front of you, “Well, whatever happened to make it work probably won’t happen again anytime soon, it looks like every other hand-held we’ve found before, only in a little better condition.” Deciding to go for a walk, you get up and walk outside, stretching again, you look around, not seeing anyone, “Hm, where is everyone, it’s a bit late, sure, but there’s usually someone-“ you stop as you see a light in a window of the main building, “The Meeting Room!? What’s going on?” you ask yourself as you runs towards the doors leading to the room.<br>\r\n<br>\r\n\t“Ok, everyone here?” a gruff-looking man asks, looking around, “Well, if anyone missed the call, there’s nothing we can do, we don’t have a lot of ti-“ He is interrupted as the door bangs open, you stand there breathing heavily, as you trie to say something, “s-s-sorry I’m late, but, whoo, I ran as fast as I could when I saw the light on, what’s happening?” “Well, Mister Gonfra, was it? We just received word that a large group of Teones are heading our way, we’re putting our heads together to think of a way to stop them.”, the gruff man says, he is the leader of the Group, ‘Strong Arm’ Stromil, as he’s been nicknamed, he’s the strongest man in the entire group, his full name is Stromil Tolan, “Uh, it’s GonFREE, sir, not  Gonfra, but anyway, sounds good, should I go get Robert?” you ask, slowly opening the door, ready to dart off and wake Bob up. “No, no, he’s not one of the smartest fellows here from what I remember, so he probably wouldn’t help much.” Stromil says, motioning for you to have a seat. “I see your point, even if it was a little rude, sir, but don’t you remember? He’s had the most experience dealing with the teones, I mean, he did survive a trip to a hotspot, alone, and brought back an item so small it must have been really hard to find.” “True enough,  Mr. Gontree, but we have no time to get him, so, please sit, and we shall discuss our strategy.” you slowly sit down, sighing, feeling bad about leaving Bob out of this.<br>\r\n<br>\r\n\tBob wakes up a few minutes after Will left. “Rrn, Will? You there?” getting up, Bob looks around, not seeing Will, he concludes that he must have gone for a night time stroll around the group bunker. “Well, let’s see how he did with that hand-held.” Bob looks at the desk, seeing the pieces, “Well, that’s perfect, I wonder if he can put it back together again, ‘cause everyone knows I can’t.” Bob sits back down on the bed, “Hope he gets back soon, it’s really dark out there, a teone could easily sneak in undetected.” Laying back down, he decides not to worry, Will does this every now and then anyway, Bob goes back to sleep, deciding to worry about it later.<br>\r\n</span></div></div>",
            "created":1297400400,
            "id":1052399,
            "title":"Omega 32"
        },
        "11111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "After The Fight",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>                                                                         (A Few Hours Later)<br>\r\nYou're standing on the outer wall of the bunker, looking out at the distant city, that you and Bob had just finished scavenging, “Man, they’re coming from that direction? We were just there, glad we got out when we did.” you says, as you hold the small switchblade, the only weapon he’s ever used, not being good enough at aiming with a gun to be trusted with one. “Yeah, tell me about it, last wave came from that way too, it’s like there’s a nest or something over there. But even if there was, there’d have to be a huge number of ‘em, more than 1 million times the amount sent in most waves, I mean, there isn’t time for them to make babies and have them grow up, unless they grow up in like, I don’t know…a week? ‘cause that’s how long the breaks usually are.” The guy next to you replies, holding an old, repaired almost to great condition, AK-47. “But with this thing, I don’t think we have much to worry ‘bout!” he says, patting his gun, “Best gun in the world, far as I’m concerned.” you look at him oddly, “You’ve tried other guns?” “No, just this one, but I only needed to try it once to know it was for me, I just knew it was made for me as soon as I fixed it up the first time, hasn’t jammed once!” Giving a nice loud laugh, the man, Jim Spade, or the ‘Jack of Spades’ as he’s called, grabs a long spear, “And this, my man, is my weapon for those fast ones that I just can’t seem to get a lock on!” Jim Swings it around a bit, before putting it down. “Hey, do you hear that?” you ask as you look out in the direction the creatures were said to be coming, “Hear what? I don’t hear anything. You alright?” Jim asks, right before something whizzes past his head, slamming into the wooden pole two feet behind him. “The heck was that!?” Jim screamed as he hit the floor, “I don’t know, but it came from over there, wait, there’s that sound again!” you yell as you duck, just in time to miss being skewered by more of the objects. “What could it be!?” Jim yells as he hides, peeking out of his cover to check for anything every now and then, “I don’t know, Wait! These things…they’re stingers!? Bugs? Oh, no, the only bugs that I know that have stingers, are flying ones! There’s flying teones with projectile attacks?!” you grab a dirty and dented Walkie-Talkie, “We’ve got some trouble here guys, if I’m right, we seem to have some new teones! These are either mutations of bees, or wasps, or both, I don’t know, but they have projectile stingers, watch out!”<br>\r\n<br>\r\n\tBob, still sleeping in his little hut, is awakened by a very loud bang, “Whoa!? What was that?!” he yells after getting up off the floor, hearing more bangs, he peeks out a window and sees people on the wall, and little bursts of light, followed almost instantly by the bang he’d been hearing. “Uh, oh, a teone assault?! Why didn’t anyone wake me up?” he whispers, grabbing his knife and pistol from his closet, And runs into the night “Hope Will’s all right.”</span></div></div>",
            "created":1297400400,
            "id":1052403,
            "title":"The Battle"
        },
        "111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Explanation Required",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Waking up, you notice one thing first, that you're still alive, the next thing you notice is that there’s a lot of light, most likely sun light, but your eyesight is so blurry, you can’t tell, and the last thing you notice is the sharp pain in your lower left leg. “Ow, ow, ow, what happened?” you asks to no one in particular, trying to get up, your eyesight slowly clearing, letting you figure out that it was indeed sun light that you were seeing, “Man, how long was I out? What happened?” almost instantly things started flooding back into your mind, the flying teones, the blood from Jim as he tried to kill one of the bugs, Bob rushing up and killing a bunch of them before taking a hit to the chest, a burning pain in your chest, followed by black, “Wait, if the pain was in my chest?” you wonder looking at your chest, nothing showed, no blood, no gaping wound in your body, nothing, just a stinger in your leg. “If it wasn’t a hit, what made me-“ fully awakened from the stinger’s poison, you realize something, “Bob!!” you yell, standing up, then falling back to the ground, the pain in your leg too intense. “Yes, kid?” Bob says, walking into your line of sight, “You finally awake, bud?”</span></div></div>",
            "created":1297400400,
            "id":1052407,
            "title":"Like The Night After"
        },
        "1111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "OK, Now Explanation Time",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>                                                                       (Desert Hut)<br>\r\n<br>\r\nOpening the trap door, the man looks around carefully, “Well, seems safe enough I suppose, at least they seem to be gone. Dang things are coming out of there more and more often, we might have to start living down there” he says, as he gets out, helping his wife and kid up, “I can’t believe it’s still working, even after all this time. I thought it would be done, but it seems to be working harder and better than ever before.” The wife looks at the building as well, “I agree, what went wrong?” “If I knew that we’d have found a way to stop them by now.” The man says, “It’s all our fault this world is like this now, if only the self-destruct had worked as it was supposed to...” The man, Mark Sinto, sits down, with his head in his hands. “But it’s not your fault! No one expected the sudden aggression, it didn’t appear until years after we had finished the experiments on the animals! The aggression was probably the result of the genes that were infused, getting so mixed together by the breeding when we tested for birth problems in the animals.” The woman, Rebecca Tresdon, now Rebecca Sinto, says, trying to comfort him. “Yes, I suppose you could be right, but I should have seen it coming, I mean, I did notice the increase in aggression, but it was so slight, I marked it to just poor care causing fear of humans.” Mark replies, still holding his head in his hands, when suddenly another noise is heard. “No way, not another one, not that fast!” Mark yells, jumping up and looking towards the building. “No, it’s not Mark, the sound, it’s different this time, I’ve never heard anything like it.” Rebecca says, listening to the sound, “I have.” Mark says, eyes widening, “We have to go, now!” he yells, running to the truck, miraculously undamaged, even after all the stampedes of monsters from the building. Following quickly behind, Rebecca, and their kid, Michael Sinto, Rush to the truck, “What is it Mark?! I’ve never seen you so worked up.” She asks, buckling herself and Michael up. “We don’t have time, I’ll answer later!” Mark says, gunning the truck as soon as Rebecca is buckled in, Behind them, a huge boom is heard, followed by the building crumbling to the ground.</span></div></div>",
            "created":1297486800,
            "id":1052410,
            "title":"Explanation After This"
        },
        "11111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "How Might The Sinto Family Be Doing?",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You limp up to the hut that was your home while there were still people left of your group, “So, Bob, how’d you survive? I saw you get hit, right in the chest, I was sure that was a death blow.” Bob smiles, “Don’t tell me that’s something else you don’t remember, you have to remember it, you’re the one that saved me after all.” you flinch, “What? I saved you? No way, I don’t believe it, I blacked out right after you were hit, felt like I was shot through the heart like you.” “Ha-ha! Well, I guess there’s nothing to it but to tell ya then, it goes something like this. See, I was falling, right off that wall, as I was, I was taking as many as I could out with my pistol, got about fifty-two or so, and, so, all of a sud-“ you cut him off there, “Whoah, wait, fifty-two?! Yeah right, even if you are really good, you couldn’t take fifty-two out while falling off the wall, there isn’t enough time before you hit the ground!” “Ok, ok, ya got me, I only got forty-five!” Bob says, before laughing as hard as he can, harder than someone who was shot through the heart ought to have been able too. “Anyway, as I was sayin’, all of a sudden, this figure just seems to appear in front of me, I try to shoot, but as fast a it appeared, it vanished, and there were no more teones in the sky ‘bove me, and as I thought I was gonna hit the ground, I am caught in mid-air, and set down as gently as possible, and your face is hovering over me, a blank look in your eye, probably from you bein’ unconscious now that I think of it, and the weirdest thing, you got wings! Big, black, wings, looked like a mix of a dragon’s wings wit’ a black bird’s, it was shaped like the wings in them books you like, but with feathers.” you're speechless for a bit, “No way, no freakin’ way, I can’t be a freak with wings, I mean, do you see any wings?!” you ask, turning around, “No, no, there aren’t any wings on your back right now, but there are the holes from ‘em.” Bob says, looking at the holes in the back of the shirt, right around the shoulder blade area, you feel the holes on your back, then fall still, trying to process the new information. “Awesome!!” you yell, walking around, barely noticing the pain in your leg any more, “I have wings, now, how do I get them out, flying would be awesome!” jumping around, you try everything you can think of to summon the wings, “Come on! What do I have to do to get the wings to appear!?” You say, sitting down and leaning forward in defeat, “Man, I thought it’d be easier to make ‘em appear than this, I mean, the only thing I haven’t done is, cutting my back open, and just doing the most obvious thing, and yelling APPEAR!” as soon as you yell appear, you get a sensation and a little prick on his back, “Bob, please, don’t tell me that it was actually that easy to get them to come out.” you say, looking over to Bob, “Uh, it wasn’t that easy?” Bob says, staring back in shock, “Well, at least we got ‘em out, now, let’s see…” you concentrate for a bit, and the wings vanish, “all right, and if that worked, maybe,” you concentrate again, your wings re-appearing, “Ha! It worked! All I have to do, is yell appear and disappear, and I can even yell it mentally like I just did, this is awesome, I can go anywhere I want now!” To prove it, you run outside. Well, sort of, you limp more than run, but you gets outside, and jump into the air, forgetting one crucial thing, you didn’t know how to actually fly with them yet.</span></div></div>",
            "created":1297486800,
            "id":1052419,
            "title":"Group Omega 32 Again"
        },
        "111111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Back To William and Bob",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>After driving for hours, Mark starts to finally slow down, “Mark, can you tell me what that was now?” Rebecca asks, staring at Mark, “Right, well, let’s see, I remember that sound from when we were doing our human experiments, I would think you would too, after all, it was one of the worst catastrophes of the whole time we were experimenting, not including the final animal revolt, that sound was heard, and almost as soon as it was, a couple scientists just died, right where they were standing, almost as if something had just stopped their hearts, brain and lungs all at the same time, no damage was done to them, they were all perfectly healthy when they died, the only thing linking them was the experiment that they were working on, a fox-lion hybrid DNA infusion, into their kid, upon further investigation, it was decided, that somehow, the child, although supposedly to young to even form a single coherent thought, had somehow gotten what seemed like supernatural powers, it’s brain activity had spiked while the deaths had occurred, as if he had mentally told their bodies to die.” Mark says, stopping for a small break to let the story sink in, “And then not that long after, objects were found floating all over the place, the same sound could be heard, along with the increased brainwave activity again. We aren’t sure how it happened, but I’m starting to think that perhaps the Japanese could have been right about a fox having supernatural powers.” Mark looks ahead, and notices a city, “Well, perhaps there’ll be survivors here that can help us, and if not, we have enough fuel to last a while.” He says, motioning to the seven ten-gallon tanks sitting in the bed of the truck.</span></div></div>",
            "created":1297486800,
            "id":1052424,
            "title":"Desert Road, 120 Miles From Hut"
        },
        "1111111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Skipping Ahead To The Sinto's Arrival",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>A few yards out from the bunker wall, a shape could be seen awkwardly bouncing up and down, as if jumping to reach something that wasn’t there. “Yo Bob! I think I’ve gotten the hang of this now!” you yell, right before tripping and hitting the ground, “Yeah, Will, you got it, just like every other little kid that can’t walk, you’ve got fallin’ down pat! Ha-ha!” Bob calls back, laughing and going over to check on his friend, “Ha-ha, very funny Bob, you think you could be a bit more helpful? I’m not used to these wings yet, but I think I’m getting there.” you say, getting up, “Now, let’s see, I move this muscle to flap that wing, and this one to flap that one, I move it this way to flap up and down, and that way for forward and back.” After reminding yourself of the self-taught movements, you jump again, this time actually taking off, and going into the sky. “Whoah! Bob, look! I’m flying! I can’t believe it! I’m actually in the air soaring around and-“ you stops there as you makes a mistake, “Falling!” you yell, as you plummet towards the ground, “ok, ok, what went wrong, think, Will, before you get hurt.” you twist and turn a few times, before your wings start flapping in sync again, and you catch yourself just a few feet from impact, shooting off along the ground then back into the air. </span></div></div>",
            "created":1297486800,
            "id":1052427,
            "title":"Group Omega 32 Bunker, Outskirts"
        },
        "11111111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "After The Story",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>A few hours later, you and Bob are sitting in what used to be the main room of the bunker. “Hey Bob, shouldn’t we leave and try to get to one of the other groups? I mean, we’re all alone here, it’s a bit, I don’t know, lonely.” you comment, looking around at all the empty chairs at the empty stalls, where all the trading used to happen. “You know, you’re right, Will, we should, let’s head off in the mornin’, when the nocturnals have gone to sleep again.” Bob answers, getting up and heading to the door, “But fo’ now, let’s head to bed, I’m about as tired as I can be, running all over the place to make sure you didn’t hurt yo’self while you were learnin’ ta fly.” you grab a fruit that wasn’t rotten, from a stall not too far away, and head after Bob, “Yeah, sounds good, I could use a break, I am pretty tired from- Wait, do you hear that?! There’s a car coming!”<br>\r\n<br>\r\n\tAnd there was, Mark drove up to the closed gates and got out of the car, “Hey! Can anyone hear me?! My family and I would like to request shelter here!” Mark waits a few minutes, then moves to get back in the truck, “Hey, hold on!” you yell, just poking your head out from behind the wall, “I’ll let you in, just give me a sec.” After you say that, you rush over to the switch for the gate, before noticing something, you had your wings out still, “Oh! Better not have these out, might frighten them.” you concentrate, making the wings vanish, “Ok, I’m opening it up!” you yell, hoping they can hear you, before starting to turn the crank to opening the gate.<br>\r\n<br>\r\n\tDriving in, Mark, Rebecca, and their son, Michael, look around, noticing the lack of people first, and the damage to the buildings second, “What happened here?” Mark asks, as you walk over to the parked car, “Where is everyone?” “Well, we had a bit of a problem a few nights ago, Bob and I were the only two that made it as far as I know.” you answer, opening the door for Rebecca, “So, what brings you here? We don’t really have much, but what we have, you can help yourself to, we’re leaving in the morning any way. Oh, and my name’s William, Will for short, sorry for not introducing myself.” “Well, Will, we were sorta forced out of our home for reasons we can’t really explain, but, we would be glad to travel with you when you leave in the morning, because that thing might still be coming, and if it’s got our scent, the only way to survive is to run.” Mark says, looking back the way they came, not seeing anything, he turns back to the building and moves towards the entrance, “So, where’s this Bob you were talking about?” looking a bit confused, you look out in the direction that Mark had looked, then realizes he was just asked a question, “Oh, he’s probably getting ready for bed, after all, we’re going to leave as early as we can, so we can miss as much of the afternoon sun as we can, along with have as much daytime between us and the nocturnal teones. and what did you mean, 'it might still be coming'? What might still be coming?” Mark looks at you seriously for a few seconds, then sighs, “I guess I have to tell you now, well, we, my wife and I, were scientists a long time ago and I had just…” Mark begins, telling you the story of the ones who started all the destruction that swept over the world.</span></div></div>",
            "created":1297486800,
            "id":1052432,
            "title":"They're Here~...No Not Ghosts"
        },
        "111111111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "The Next Morning",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>“I can’t believe it, so, you mean that you MADE the teones?!” you exclaim, after hearing the story, “I can’t believe it, why would you- but, wait, what happened to the self-destruct? Shouldn’t all of the teones have been killed?” “Yes, they should have, but there was a malfunction in the self-destruct, only about half of the explosives actually went off, and the rest somehow didn’t blow at all, I don’t know what happened, I wasn’t crazy enough to go back in there, so something happened, and now a super-being made from a human is rampaging out in that direction somewhere, and probably heading our way, it can kill just by wanting to, we can’t stop it, not without another beast just as strong, but controllable on our side, and we don’t have one of those.” Mark says, you notice a quick glance at Michael. “So, what you’re saying, is, we’re doomed? I don’t think so, that thing may be able to kill with a thought, but it’s not un-killable! We just need to hit it before it has time to retaliate!” you say, stepping back, “And we’ve got as many guns as you could want here, Snipers, machine guns, pistols, rifles, you name it, we’ve probably salvaged it at one time or other.” Grabbing a door to the closet near-by, you yank it open and reveal an arsenal of guns, all fashioned out of broken gun parts found while scavenging, “Not the best condition they’ve ever been in, but they work, we were here for almost 12 years, and these guns have held perfectly for the whole time!” Grabbing a gun, you hand it to Mark, “Here, test them if you want, I’m not a marksman, so I can’t hit anything I aim at.” Cautiously, Mark takes the gun and looks it over, “Yes, looks like it’s in good shape, your plan might just work!” Mark stands up, “But, in case it doesn’t, I’m going to be the only one to stay back and try, the rest of you are going to leave like planned, just leave me a vehicle, and I’ll catch up after it’s dead, or if the plan goes wrong...” “What!? Are you crazy?! I won’t let you face it alone! You’ve got a family to think of!” you yell, looking over at Rebecca and Michael, “I won’t let you leave them alone and take the chance of dieing! I’ll stay too! I may not be able to shoot, but I can hold my own in a fight!” “No, even if you stayed, you heard what it can do! It’d take you down the second it saw you coming!” Marks says, getting serious, “I won’t let a young man like you kill himself, especially not for me, I started this, I’ll be the one that finishes it, or die trying.”</span></div></div>",
            "created":1297486800,
            "id":1052437,
            "title":"After The Story"
        },
        "1111111111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "The Start Of The End",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>You're is in the passenger seat of the truck, “I can’t believe he talked me into letting him stay, he’s going to get himself killed.” you say, looking at the ever shrinking bunker building. “Nah, He’s got a fire in ‘im that’d burn even the sun!” Bob laughs, driving the truck down the barely visible road leading towards the nearest Group Bunker, “He’ll be fine, you just watch, he’ll be comin’ up in the Jeep or the truck he arrived in, and be smilin’ like crazy, sayin’ ‘I did it!’ or somethin’, I can tell!” Bob starts to laugh again, before a loud bang is heard, and a shockwave shakes the truck, “The heck was-“ Bob starts, before hitting the brakes, “No way! It’s not possible!” He mutters to himself, looking into the rear view mirror. Behind them, a plume of smoke, so thick it almost looked like it could crush you if it touched you, rose from the earth, right where the bunker was supposed to be. Rebecca shields Michael’s eyes, with tears starting to flow, before wiping them and looking away. “I thought you said he’d be ok!” you yell, jumping out of the car, wings appearing, and taking off.<br>\r\n<br>\r\n\t“Will!” Bob yells, his hand missing Will by a few inches, “Dang that kid, always rushing to the rescue, no matter how dangerous it is.” Hearing a slight gasp, Bob turns, noticing how Rebecca is staring after you. “Aw, man, now I gotta explain this…thanks a lot Will.” Bob mutters, turning around, “Don’t worry, everything’ll be all right, I’ll get ya to the bunker and go back for ‘em, ok, lets go!” he says, hitting the gas before they had time to ask any questions, “Dang it Will, I’ll kill ya if you die.” He says to himself.<br>\r\n</span></div></div>",
            "created":1297486800,
            "id":1052442,
            "title":"The Next Morning"
        },
        "11111111111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Final Showdown Coming Up",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Gasping for breath, Mark curses himself for not thinking things through enough, with his back to a wall, one arm, either dead, or paralyzed, and a broken leg, he stares at the creature before him, well, not a creature, per say, but it didn’t look as human as one would think, from something born from a human, fur covering his mostly humanoid form, almost head to toe, a few splotches of skin here and there, eight long, but still a bit fluffy, tails reminiscent of the fox that it had been taken from, along with what seemed to be the mane of a lion, it’s head a strange fusion of man and beast, a tiny bit of human can be seen in it, but it, for the most part, just seems to be a mash-up of canine and feline facial structures, it’s body is almost muscular enough to be taken for the body of a professional bodybuilder, if not for all the animalistic features, the legs resembling a somewhat more human version of an animal’s legs, just changed enough to support the weight of a bipedal creature, it’s arms, too muscular, and at the same time somehow thin, to be human, with at least an inch or two long nails at the end. Looking more beast than man, the creature makes it’s way towards Mark, sending anything in it’s path flying out of the way, with a mere glance, the way it was moving would have made it look almost majestic, if it weren’t for the misshapen body it had, a result of the early testing they did.<br>\r\n<br>\r\n\tOne step and the creature was closer, Mark noticing an odd feeling in his chest. Another step, Mark could feel the strange sensation getting stronger, as if a hand was wrapped around his heart, ready to squeeze. A third step, Mark’s heart is racing, trying to push against this feeling of pressure covering it. One last step, the creature now close enough to reach out and cut him open, Mark closed his eyes and waited for the end, he knew it was almost over, he couldn’t move, he could barely breath, he was in horrible pain, and this demon-like creature, this, mass of species rolled into one creature, was going to kill him, he was so sure, until he heard a thump, felt a breeze, and heard another soft set of thumps. No sooner did those thumps sound, than Mark felt something amazing, his limb were healing! He was feeling better and better, almost as if months were passing in the blink of an eye, and that feeling of pressure on his heart, it was gone! Then hands, he could feel hands picking him up, lifting him into the air, carrying him away, and then, the sound of wings, the sensation of lifting even higher, and a breeze on his face. Not once did he open his eyes during this whole time, so amazed by what had happened, that he was still alive, that he was flying, or perhaps he was dead, maybe this was an angel, come to take this dead man to his final resting place for eternity. A thought entered his head, a thought he hadn’t had in a while, since leaving his home to escape the creature he had just had a showdown with, rest, he was tired and his body knew it, his mind telling him to sleep. So, he did.<br>\r\n</span></div></div>",
            "created":1297486800,
            "id":1052445,
            "title":"Final Return To The Bunker"
        },
        "111111111111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "The Crossroads Of Power",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Wondering how you had knocked that creature out so easy, even with your enhanced, super-human strength, you carried the sleeping Mark to the nearest hilltop, making sure to put him far enough from the edge that no matter what happened, he wouldn’t fall off while he slept, then, turning towards the bunker, you once again take to the sky, steeling yourself for the fight to come, you may have knocked it out with the surprise attack, but, it might have awoken by now, and you doubted it would be so careless this time.</span></div></div>",
            "created":1297486800,
            "id":1052448,
            "title":"Thoughts Before The Clash"
        },
        "1111111111111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Return To Reality",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Upon landing, you take out the knife you had, got into a battle ready stance, and slowly walked in, making sure to listen and look for any movement or activity, not wanting to be caught off guard, because, if what Mark had said was true, only the first strike would truly matter, after that, you’d be in danger of your body failing on you, or being slammed into the ground by an invisible force. A sense of danger arose in your mind, something didn’t feel right, no breathing, no footsteps, no noises whatsoever, it was quiet, and you was thinking what most people in a situation like this are thinking, that it was too quiet. Perhaps the creature was still unconscious after all, or it had woken up and run off while you had taken Mark to a safe place, or perhaps- your thoughts are cut off, your guessing cut short as you turn a corner, only to find the creature floating in mid-air, it’s back to you, the blood from the wound you had given it flowing, but not in the direction one would expect, it was re-entering the wound, all sand, dust, and other contaminants separating from the blood. The wound itself had opened up a bit more, to allow the blood to enter easier, the creature giving grunts of displeasure, so low, that you almost couldn't hear it, even from this distance. You, wanting to get closer so as to get a better chance for a fatal blow on the first strike, snuck forward, not a sound to be heard in your silent steps, you was at least 20 feet away, closer, 10 feet, almost within striking distance, you take one more step, raise your knife, and swing! The creature isn’t fazed as the knife pierces it’s back, piercing right where a heart should be, the creature gives a grunt, and the knife disappears, sucked into the creatures body, the wound sealing, and another grunt from the creature, the knife popping out of it’s mouth, and dropping to the ground. Turning around, the creature stares at you, even as the blood finishes returning to where it had come.<br>\r\n<br>\r\nAs the creature stares at you, you can feel the odd sensation of pressure, on your heart, your lungs, even some on your brain, as if someone was starting to squeeze, having a tough time breathing, thinking, and now convulsing a bit, as the pressure on your body intensifies, you start to back up, trying to get away, trying to tell your wings to take you into the sky, to get away, but you can’t, your body barely registering the command to move, the pressure starting to make you feel faint. The world, starting to rock a bit as your eyes fight to stay open, starts to fade, grey and black replacing the colors, the world all but becoming a bleak, desolate, and colorless world around the creature, as if the creature was absorbing all the color, as if it wanted nothing else to have any color. Your heart starting to beat faster and faster, your brain starting to hurt, your lungs having a hard time sucking in air, an image flashes, an image of a laboratory, of some tubes, of a woman, crying as she stares from behind glass, then another woman, hand on the glass tube a few down, crying, mouth moving in wordless questions, a doctor standing behind her, or maybe a scientist, resting a hand on her shoulder, probably attempting to reassure her that everything will be all right. Then that scene shifted, to the same glass, only this time, there was no woman crying in front of you, only scientists and doctors, laughing and chatting wordlessly, apparently happy about something, the door in the back opening, a man walking in, pointing towards you while discussing something with the others. Once more the scene has changed, this time, you're once again behind glass, but this time the room is different, only one man in it, walking around, looking at an instrument or two, before a huge smile crosses his face, as he stares at the screen, he yells once, then again, standing up straight, he rushes toward you, all the while, shouting wordlessly, as if he had just won the world’s most valuable treasure. He comes to the glass, looks at you for a second, then looks at the monitor that you just noticed at the bottom of the glass, before laughing soundlessly again and rushing out of the room, almost as soon as he leaves, a crack appears on the glass in front of you. For a third time the images moving through your head change, becoming that of something you recognized, of the bunker, broken, burned, all but destroyed, something lying on the ground in front of you, a body, no, more than a body, a family, a man, a woman, a child. It was the Sintos! The ones you had been trying to protect, lying there, lifelessly, as if they had been dead for a while now, but what had happened? you was sure that Mark was no where near this place, and that his family was even farther away, then something caught his attention, like in all his visions since the world went grey, there was no sound accompanying this something, yet you could tell, there was a fight, a scuffle, a lot of noise, if only you were able to hear, moving in the direction you could feel the commotion coming from, you rounded the corner of an almost undamaged wall, only to see something that burned you more than anything before. It was Bob, Held by his throat above the creature that had attacked you, Bob, who was barely alive by the looks of it, lifted a gun to the beasts head, and with a silent flash, the beast dropped him and fell to the ground. Hoping it was over, that the grey you was seeing would fade back into color, that you would be able to help your friend, you began to move toward Bob, toward the only friend you’d ever had, only to freeze, as a long furry tentacle shot through his chest, the creature rising behind Bob, another tentacle, one of it’s many tails, shooting through his chest again, before it, along with the other, tore Bob in two.</span></div></div>",
            "created":1297486800,
            "id":1052459,
            "title":"The Fleeting Past"
        },
        "11111111111111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Reject His Offer",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>The vision vanishing, replaced once more by the grey world that was your reality, the vision being nothing more than a hallucination, a vision of the future perhaps, should you not survive. The thought made your blood run cold, your mind telling you, through all this pain, you had to kill it, to defeat the undefeatable, to somehow kill something that seemed almost immortal. your fear for what might happen to your friends began to solidify into determination, the determination began to become energy, and the energy became strength. The pounding of your heart began to lessen, your mind began to calm, your lungs began to bring in more air, the feeling of pressure, the pain, the fear, it was disappearing, as if it had never been there, as if, you were on equal terms with this creature, as if, as if you had just ascended to a whole knew playing field in your life.<br>\r\n<br>\r\nThe world, though no longer shaking, was still as grey as ever, only the creature had any color left, looking around, you saw a shape, a little blob on a wall, there was color there! you looked around again, seeing little splotches of color everywhere, then the colors began to move, they moved left, right, up, and down, in every possible direction, and they started to grow, become more than just dots, or splotches on the wall, they began to take shape. It was then that you realized, these splotches and dots weren’t on the walls at all, they were past them, you were seeing something that was no where near you, that was possibly hundreds of miles away, you were seeing the creatures known as Teones, and people, and you even saw a few things you didn’t know , but what you were seeing wasn’t just them moving around, doing whatever it is they usually do, they were coming, everything you could see was coming, to help either you or the creature, who hadn’t made a move since you had woken up.<br>\r\n<br>\r\nSilence. Even though the vision was gone, you still heard nothing, were you deaf now? Or was it just that quiet here? You soon got your answer, as , to your amazement, the creature in front of you spoke, in a clear, human tone, as if it was human, as if he wasn’t a giant mess of man and beast, “I commend you, William, for surviving that experience, and for being so calm in the face of this dire situation, I am Nayo, I was born in a test tube, just like you, but, I have many abilities that make me far superior to you and all the rest of the creatures that roam the earth. I wish you to join me, for you can not hope to defeat me, and though you are young, and inexperienced with your strengths, I can use something like you, a spy perhaps, to gather information and help me put an end to the humans who think they can overthrow me. Now choose, you shall bow before me, one way or the other!” <br>\r\n</span></div></div>",
            "created":1297486800,
            "id":1052461,
            "title":"Reality Check"
        },
        "111111111111111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Fight!",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Waiting to see if he would say more, you're silent for a few moments, before answering, “I may be a test subject like you, I may be different, but if you think I am like you, that I hate everyone for being so cruel, so selfish…so stupid, then you are wrong,” You state, starting to glow a bit, your vision clearing, color returning to the world, the shapes you were seeing through walls, and rocks, fading away, “I lived among them, thinking I was one of them, I learned about them, I saw what you did to them, all those creatures you send out, the things that you have do all the work for you. I remember now, I remember your voice, it was what woke me up back then, it was you that caused all this destruction, why?! Just to wipe them out for being weaker than you?! I won’t let that happen! I will stop you!” you scream, the area near you bursting into flames, your feet leaving the ground, your eyes going blank, starting to glow a faint white, then a little blue, before finally returning to normal, “You may have those powers, to grip at peoples minds, hearts, souls, with their fears, and their weaknesses, but what happens when there is no fear? When there is no weakness? What then? You become weak, pathetic, a being so low that even an ant can topple you!” A burst of heat shoots from you, Nayo backing up, his attitude of superiority, the look of being so sure of victory, replaced by that of uncertainty, not quite fear, “I will not let you harm this world!” Another blast. The flames around you changing from red to blue. Snarling, Nayo charges, in hopes of ending it as quickly as possible, and it did end, in a bright flash…<br>\r\n<br>\r\n___________________________<br>\r\n<br>\r\nIn the world, all time seemed to have stopped, Bob, just driving back towards the bunker to help, was stuck in mid air, having gunned his truck up and over a hill, getting air born. The Teones that were flying, some of the only non-threatening ones, mainly used as spies to find the humans, were stuck, mid flap, over the road. But time hadn’t stopped for you or Nayo, no, though your bodies didn’t move so much as an inch, you were having a very intense fight. For you, the world was not colored, but not the grey and black that you saw, no, this time, everything was white, white sky, white ground, white everything, to the point that it looked like you were running on nothing. you clashed like two mystical creatures, a Minotaur, or in other words, a beast-man, against a gryphon, half bird, half beast, the fight was more evenly matched than you had hoped it would be, even with your newfound determination, you had a few doubts for victory, just because of the size of you opponent, but for every hit Nayo landed on you, you landed the same, if not more, because your size meant more dexterity.<br>\r\n<br>\r\nThe fight went on, for what felt like days, but weren’t even minutes, because of the force that had frozen the world in that moment of time, but this fight wasn’t a fight of physical strength and endurance, no, it was a fight of mental strength, and the determination to defeat the other, and both had plenty of that. This fight was your Fire, the creation of your determination to protect the ones you called friends, against Nayo’s supernatural force, his mental ability to send anything near him in any direction he pleased. Brute force against brute force, supernatural against supernatural, the fight waned on, to the point where you were both covered in scars, cuts, and almost every other kind of injury known, a few that were unknown, but even with all this, the fight went on, as if you didn’t feel so much as a pinprick of pain.<br>\r\n<br>\r\nThe world around you, felt like an open space and a small white box all at once, there were walls, and at the same time there weren’t walls, sometimes you would hit a wall, and other times you wouldn’t, it was all so white, neither of you could see any of these walls, if they were even really there, you wish that you could, you’d be able to fight better, if you knew where not to move. A flame shooting from the circle of continuous flame that surrounds you, you directs it straight at Nayo, but a wall blocks it, Nayo giving a laugh, and races towards you, intent on skewering you with his claws, maybe his tails. Nayo started laughing, “Ha-ha! And you said you’d never let me hurt them! What a joke! You aren’t even worthy of fighting me like this! Coward, stop running away whenever I get near! Just give up, and let me rip you to pieces already!” almost as soon as he finishes, Nayo is hit, squarely in the face, by a fist, you standing there, an intense look on your face, Nayo flying off, missing any invisible walls that might be there, “Yes, I did say I’d stop you, but I’m not a stupid brute like you, I don’t just rush in with no regard to safety, I plan, I think, and because of that, I will win.” you state, as if it’s a fact, believing it so hard in your heart that, to you, it was a fact, and this fact was starting to impact Nayo’s view of the world, he was starting to feel something he’d never felt before, fear. Fear that he might lose, that he might die, but most importantly, a fear that he was going to lose his power, the power to manipulate the Teones, his ability to tell them what to do, and they’d do it. ‘No!’ He thought, ‘I can’t lose! I am the King! I am the most powerful being on this planet, I can not be beaten!’ having re-found his resolve, Nayo feels something strange a feeling he’s had before, a new tail, a new ability, and more importantly, another step towards being a god of this world!<br>\r\n<br>\r\n“Will.” Nayo says calmly, catching you off guard, “Have you ever heard the legends of the foxes in Japanese folk lore?” you're stunned, that this killer, this brute of a creature, would actually stop fighting and ask a question, “Only a little, I heard that foxes are believed to have supernatural powers.” you answer, “Yes, and no, there is a difference between a fox with powers, and one without, and what, you might ask, is the difference? Well, Will, it’s the amount of tails they have!” Nayo explains, showing his tails, “The more tails a fox has, the more powerful it becomes, a one tailed fox, is the everyday fox, though, those no longer exist, seeing as they became Teones a long time ago, or just plain died, a two tail is stronger, able to use maybe a small illusion power or something, but if it obtains a new tail, it gets more power, possibly transformation, or levitation, nothing big, but as the tails increase, the power gets stronger and stronger, imagine an eight tail, that, my prey, is what you’ve been fighting, but it gets better, according to their belief, a fox can have as many tails as it wants, but ten is the highest so far, you see, to them, a ten tail is a god, or goddess, depending on gender, and a nine tail? It’s not quite there, it’s what they would call a demi-god. Will, I have just gotten a ninth tail, you face not a mere supernatural being anymore, you face a being that is so close to becoming a god, that it’s power rivals theirs!” as if to prove his point, you're picked up by an invisible force, slammed into the ground, and held there, “And you want to know another belief they have? If a kitsune,  that is what they call us ‘magical’ foxes, eats a power source, a really strong one, if they devour it, they gain it’s power, and often gain a new tail! I think you’d make a fine tail, you were able to stand on almost equal ground with me when I had eight tails, perhaps you are strong enough to give me ten tails if I were to devour your power!” Nayo starts floating closer to you, tails moving towards you, to rip you up, and allow Nayo to feast.</span></div></div>",
            "created":1297486800,
            "id":1052478,
            "title":"Reject The Beast"
        },
        "1111111111111111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "The End Of The Storm",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Seeing all this, hearing all this, it made you even more determined to defeat him, if you lost now, Nayo would surely wipe out the rest of the world, all your friends, your family, if they were still alive, gone. Pushing on the invisible ground under you, you start to try and get up, “Give it up, I have you there to stay, you may have almost been a match for me before, but my power was multiplied greatly when I gained my new tail.” Nayo says, moving slowly closer, wanting to savor his victory. But even with that news, the way it was stated so surely, that it was a fact, and there was nothing you could do about it, you kept trying, you pushed and pushed and pushed, then, you moved, you lifted, you rose, as if you didn’t have any weight at all on your back anymore, looking at Nayo, you see he’s not moving, his eyes still staring at where he was, as if he was still there, “What’s going on?” you asks yourself, “Oh well, better not waste this opportunity!” and with that you rushes at Nayo, hitting his face as hard as you can, leaving an impact crater on his face, another punch, another impact crater, but still nothing happened, it was as if Nayo didn’t feel anything, or couldn’t, continuing for a while, you have left a lot of marks on Nayo’s body, but still nothing happened, all of a sudden, you found yourself laying on the ground again, held down by an intense force, back in you original spot, then the weight just stops, looking over, you see Nayo, getting hit by invisible punches, in every spot you had punched!<br>\r\n<br>\r\nMoments later, Nayo lay on the ground in a bloody heap, barley able to move, not able to focus enough to begin the regeneration process like he had before, you walk up, and look down, “Demi-god, yeah, sure you are, and I am a human without wings or supernatural abilities. I win.” you claim, breathing heavily, as a sword appears in your hand, and you cleaves Nayo’s head off.<br>\r\n<br>\r\nAs soon as you cleaves Nayo’s head off, the world around you changes and becomes normal once more, Nayo’s body standing in front of you, looking ready to pounce, before falling to the ground, breathing, but unmoving, as if he was alive, but too tired to do anything at all. Your mind racing, wondering how long he’d stay down, you rushed around, gathering objects, and un-destroyed tech, and getting your tool set from your miraculously undamaged cabin, you set to work.<br>\r\n</span></div></div>",
            "created":1297486800,
            "id":1052480,
            "title":"Fight!"
        },
        "11111111111111111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Epilogue",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Bob rushes into the mostly destroyed bunker, looking for you, “Will! Will! Where are ya buddy?! Are ya alive!?” He shouts, running around, looking everywhere, before finding you, sitting around a table, eating, “Oh, hey Bob, I thought you’d be at the other bunker by now, what are you doing here?” you ask, actually surprised that Bob had returned, “I came looking for you, wanted to see if you were still alive, and here you are, not looking the best you ever have, but alive!” Bob answers, giving you a hug, “Hey, Bob, can you stop that please? You know I’m not one for hugs.” you complain, but don’t try to pry him off, letting him do what he wants, knowing he wanted to make sure his friend was actually there. “Oh, and Bob, I’d like you to meet my new pet! Here boy!” You call, giving a little whistle, and a clap of your hands. A sound was heard, loud and fast, like the beating of something heavy on the ground, before Nayo appeared around the corner, panting, and acting every bit like a pet, “He’s called Nayo, he was the creature destroying everything, I made a collar for him, it sends his human mind into a state of sleep and therefore makes him a little less violent.” As you finished saying this, Nayo growls and leaps at Bob, pinning him to the ground, “No! Nayo, bad, bad Nayo!” you shout, getting up, Nayo, whimpers a bit, like a dog that was just hit, but gets off of Bob, “I told you not to do that Nayo, you’re a bad Nayo! Now say you’re sorry.” Bob was about to protest that, if the human part was asleep, he shouldn’t be able to speak, but then Nayo spoke, “Sorry, I thought you were going to hurt master.” Nayo says, looking sad. Bob stood there speechless for a bit, before asking, “How did you manage to make that collar? I mean, tech like that didn’t even exist in the time before the big disaster, how could you, a kid born after the disaster, possibly make something like this?!” “I’m not sure, actually, I had just finished my fight, when I got worried that he might get up, and then the design for the collar just sorta popped into my head, by the way, you remember that transceiver you almost died getting? Well, turns out, that was the most important part of the collar! You, Bob, my friend, helped save the world.” you say, before jerking up and looking worried, “Oh no…I forgot Mark! I’ll be right back, Nayo, no hurting Bob, you protect him, got it?” Before Nayo could answer, you fly off.<br>\r\n<br>\r\nLanding on the edge of the cliff, you look around, searching for Mark, not seeing him where you left him, you start walking towards the spot, you listens for movement, or any sound at all, and finally hear breathing, and a heartbeat, both quick, and hard, making it sound scared, moving towards the sound, you turns the corner around a big rock, and find Mark sitting there, wide-eyed, scared out of his mind, “Will?! Will is that really you?!” Mark says, sounding relieved before getting up and moving towards you, “I thought that the creature was coming for me, I don’t know how I got up here, but-“ he stops short, noticing your wings, “Oh, so you’re one of ours too? Well, at least you aren’t violent, so, what happened? Where is the creature?” “Come on, I’ll show you, but we have to fly, and believe me, that’s no easy task, me carrying someone while I fly, I haven’t had much practice.” you answer, grabbing Mark, and turning around, “Uh, can’t we just find a way down, maybe climbing? Something…I don’t know…safer, perhaps?” Mark says, seeing just how high you really were, and getting a bit scared. “Ha-ha, of course not, I got you up here didn’t I? I can get you down, I just need to be careful.” you says, grabbing Mark and jumping into the air.<br>\r\n</span></div></div>",
            "created":1297486800,
            "id":1052484,
            "title":"The End Of The Storm"
        },
        "111111111111111111111111111":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "content":"<div class=\"\"><div> <span>A few years after your confrontation with Nayo, the world has gotten a lot better, the teones, well most of them, lost almost all, if not all, of their aggression, probably because Nayo wasn’t telling them what to do anymore. Speaking of Nayo, He was living a peaceful life, as a guard for your house. You had become world famous, for your collar, you had made many more for some of the more aggressive Teones still out there, so they could be made more docile, the collar was mainly used as a way to keep teones as a pet, it blocked off the part of the mind that made the creature it was attached to aggressive. You had gotten a wife, many had come asking to marry you, not one had gotten a yes, there were many beautiful ones out there, but all of them only wanted to marry him for his wealth, and fame, but there was one woman, you knew she was the one, she wasn’t the best looking, or the richest or most amazing of the girls, by any standard, but to you, she was perfect, her name was Michelle Landsen, and you married her. Robert, or Bob, as almost everyone still called him, was now the leading trainer in the new military that was forming, he taught everything from how to use guns and blades, to how to take a bullet and keep right on moving. Because of his job, he never had a chance to find a girl he liked, so he is still single. Mark,  Rebecca, and their son, went on to continue their research, hoping to recreate the way you had turned out right, making sure not to use fox DNA in their experiments, for obvious reasons. All in all, the world had gotten back on it’s feet, after so many years of having to fight their hardest for survival, the people of the earth, got to relax, until the next time Mark and Rebecca make a mistake.</span></div></div>",
            "created":1297486800,
            "id":1052487,
            "title":"Epilogue"
        },
        "111112":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Use What I've Given To Make Your Own Story",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><a rel=\"nofollow\" href=\"http://www.writing.com/main/interact/item_id/1750574-The-World-After/map/1111111\" target=\"_blank\">http://www.writing.com/main/interact/ite...</a><br>\r\n<br>\r\nHere ya go, it was only 2 chapters away. ^.^</span></div></span></div>",
            "created":1297400400,
            "id":1052378,
            "title":"Return to main story."
        },
        "1111121":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Babara",
                "Dick or Tim"
            ],
            "content":"<div class=\"\"><div> <span>Main Characters: Barbara Maelstrom, Dick Wittington and Tim Royal <br>\r\n<br>\r\nBarbara: An Experiment Scavenger trying to find a new home<br>\r\nAge: 16<br>\r\nPowers: Flight and Echolocation Fused with a Little Brown Bat, cane grow wings, fangs and larger ears at will<br>\r\nBackstory: Barbara has been wandering as long as she can remember now she seeks a permanent home<br>\r\n<br>\r\nDick: Experiment Scavenger travels with other scavengers and tries to keep his abilities under wraps<br>\r\nAge: 18<br>\r\nPowers: Agility and climbing ability, Fused with a Cat can grow claws and fangs at will<br>\r\nBackstory: Dick tries to keep his feline powers a secret fearing he might be shunned because of them<br>\r\n<br>\r\nTim: Fellow Scavenger in Dick's group also an experiment<br>\r\nAge 14<br>\r\nPowers: Increased strengh and ability to roar fused with a Lion can grow claws, fangs and even a tail at will<br>\r\nBackstory: Part of Dick's group and looks up to Dick like a big brother<br>\r\n<br>\r\nWhose eyes do you want to look out of? </span></div></div>",
            "created":1362632400,
            "id":1545560,
            "title":"These Characters"
        },
        "11111211":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin Story",
                "Another Character's Story"
            ],
            "content":"<div class=\"\"><div> <span>Trivia about Barbara<br>\r\n<br>\r\nName: Barbara Maelstrom<br>\r\nSpecies: Human/Bat Hybrid<br>\r\n<br>\r\nFavorites: <br>\r\nFavorite Book: Redwall by Brian Jacques<br>\r\nFavorite Color: Red<br>\r\nFavorite Music: Classic Rock<br>\r\nFavorite Comfort Food: Hot Cocoa with Marashmallows  <br>\r\n<br>\r\n</span></div></div>",
            "created":1362632400,
            "id":1545595,
            "title":"Barbara's Fun Facts"
        },
        "11111212":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Dick",
                "Tim"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which one?</span></div></span></div>",
            "created":1362632400,
            "id":1545561,
            "title":"Dick or Tim"
        },
        "111112121":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin Story",
                "Another Character's Story"
            ],
            "content":"<div class=\"\"><div> <span>Name: Dick Wittington <br>\r\nSpecies: Human/Cat Hybrid<br>\r\n<br>\r\nFavorites<br>\r\nFavorite Book: Good Omens by Terry Pratchett and Neil Gaiman <br>\r\nFavorite Color: Red<br>\r\nFavorite Music: Classic Rock<br>\r\nFavorite Comfort Food: Club Sandwiches</span></div></div>",
            "created":1362632400,
            "id":1545600,
            "title":"Dick's Fun Facts"
        },
        "111112122":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin",
                "Another Character's Story"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Name: Tim Royal<br>\r\nSpecies: Human/Lion Hybrid<br>\r\n<br>\r\nFavorites:<br>\r\nFavorite Book: My Teacher is an Alien by Bruce Corville <br>\r\nFavorite Color: Black<br>\r\nFavorite Music: Rock n Roll<br>\r\nFavorite Comfort Food: Raisin Bran</span></div></span></div>",
            "created":1362684180,
            "id":1545603,
            "title":"Tim's Fun Facts"
        },
        "11112":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Make Your Own Story With What I've Given So Far",
                "Other"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span><a rel=\"nofollow\" href=\"http://www.writing.com/main/interact/item_id/1750574-The-World-After/map/1111111\" target=\"_blank\">http://www.writing.com/main/interact/ite...</a><br>\r\n<br>\r\nhere ya go, main story continues there, you could have also used the outline ^.^</span></div></span></div>",
            "created":1297400400,
            "id":1052373,
            "title":"Skipping Back Story"
        },
        "12":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "A bit of both(it'll be a story that switches off pretty often, until they meet)",
                "Michael(only Michael, unless he dies or is un-usable for some reason)",
                "Nate(same as above)",
                "Other(don't want this story)"
            ],
            "content":"<div class=\"\"><div> <span>Main Characters: Michael Sinto, Nate Gonfree<br>\r\n<br>\r\nSide Characters: The rest<br>\r\n<br>\r\nBackgrounds:<br>\r\n<br>\r\nMichael Sinto: Son of Mark and Rebecca Sinto, could be considered a genius for his age.<br>\r\nAge: 19<br>\r\nPowers: None<br>\r\nBack Story: Having been 5 during the last big war between Teone and Humans, he was just barely able to understand the carnage that happened, He'd been in hiding since he was born, protected by his parents. Is constantly getting in trouble for outsmarting people to make a living.<br>\r\n<br>\r\nNate Gonfree: Son of William Gonfree and his wife. Completely oblivious to the horrors of Teones.<br>\r\nAge: 11<br>\r\nPowers: None yet, some may develop, considering who his father is.<br>\r\nBack Story: Nothing really, he's a young eleven year old boy, nothing special has happened to him, yet.<br>\r\n<br>\r\nAnd thus appears the character choices.</span></div></div>",
            "created":1308978000,
            "id":1134164,
            "title":"Resurgence"
        },
        "121":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "He makes it home",
                "There's a little trouble on the way there.",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>In a small town called Little Haven, a place that lives up to the name, a most peaceful place, not a crime to be heard of, not even an injury in quite a while, if you were to look around you'd see many a happy face, and many teones, once feared beasts, now friends and guardians. Here, in this quaint little town, sits a house, as ordinary as any, and in the house, a man, once called hero, now considered on the verge of madness.<br>\r\n<br>\r\nThis Man sits at his desk, scribbling note after note, one after another, after another, in a seemingly endless stream of movement, the desk surrendering some of it's load to the floor, which happily accepts. These notes, the piles and piles of thoughts, are not being written willingly, for it was as if the words themselves forced their way from his mind and out of his hand.<br>\r\n<br>\r\nFor hours he writes, hand cramping, but still moving, fatigue attempting to overtake him, and yet his hand keeps moving. finally, after what seemed like days, his hand slows to a stop, the last piece of paper slipping to the floor, as his front door opens.<br>\r\n<br>\r\n\"Daddy! We're Home!\" Calls a young boy, walking in with his mother.<br>\r\n____________________________________________________________________________ ________________________<br>\r\n<br>\r\nMeanwhile, in a community known as Rockwall, A young man is running.<br>\r\n<br>\r\nCries of, \"Hey! Get back here!!\", \"There he is!\", and \"Get him!\" can be heard, as he dashes through crowds, over fences and around obstacles, as he attempts to out maneuver his pursuers.<br>\r\n<br>\r\nManaging to lose them after a few fancy moves, the young man stops to catch his breath, \"Man, I didn't think they'd take it that hard, all I did was beat them in that card game of theirs, they were the ones who made the bets.\" he says to himself, looking at the small wad of money he had, \"Well, time to get home then.\"</span></div></div>",
            "created":1308978000,
            "id":1134175,
            "title":"The Return of the End, and a Beginning."
        },
        "13":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Amanda",
                "Jonathan",
                "New Story",
                "New Story",
                "New Story"
            ],
            "content":"<div class=\"\"><div> <span>Main Characters: Amanda Franken and Jonathan XXX<br>\r\n<br>\r\nAmanda: A scanger who is incresingly becoming more animal then human, Abhors people and seems be growing more and more animal traits<br>\r\nAge: 16<br>\r\nPowers: Venom, is fused with a rattlesnake, has poisnous bite and scaly skin<br>\r\nBack story: After the tragic death of her parents she fled to the wilderness only keeping the company of her animal friends whom she trusts more then humans<br>\r\n<br>\r\nJonathan XXX: A mysterious figure who seems to have been sent to watch over Amanda.<br>\r\nAge: 18<br>\r\nPowers: Flight has been fused with Raven DNA can grow black wings at will<br>\r\nBackstory: Seems obliged to watch over Amanda due to a debt with someone<br>\r\n</span></div></div>",
            "created":1362114000,
            "id":1541785,
            "title":"Story 2"
        },
        "131":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin Story",
                "Another Character's Story",
                "Another Character's Story "
            ],
            "content":"<div class=\"\"><div> <span>Before you enter Amanda's story here are some fun facts<br>\r\n<br>\r\nName: Amanda Franken<br>\r\nSpecies: Human/Rattlesnake Hybrid<br>\r\n<br>\r\nFavorites<br>\r\nFavorite Book: The Jungle Books by Rudyard Kipling<br>\r\nFavorite Color: Blue<br>\r\nFavorite Music: Classic Rock<br>\r\nFavorite Comfort Food: Spaghetti and Meatballs</span></div></div>",
            "created":1362546000,
            "id":1545175,
            "title":"Amanda's Random Character Trivia"
        },
        "1311":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "No more questions are asked we eat breakfast",
                "Suddenly something happens",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>I always feel happier when I'm asleep then when I'm awake, when I'm asleep I can go back to when I was a normal human girl, when everything was innocent, when I didn't have to constantly worry about being eaten by something.<br>\r\n<br>\r\nBut very soon I know I have to wake up, the light of dawn is creeping into my den, it rouses me from my sleep. I have no choice, I have to get up.<br>\r\n<br>\r\nI yawn sleepily, I smell something delicious being cooked<br>\r\n<br>\r\nI peer out of my den and see Jonathan stirring a bubbling pot of something<br>\r\n<br>\r\nJonathan is one of the few humans I willingly tolerate, and mostly because he is half animal like me, He's half raven I'm half rattlesnake. I first met him shortly after I first ran away to the forest after my parents died, I didn't want him near me at first but he insisted he would protect me as long as I was alive...And I admit it's a good thing he does stick around has he knows how to cook and I don't if it wasn't for him I'd have to survive on raw squirrel and frog and other stuff like that...Eww. <br>\r\n<br>\r\n\"Good morning Sleepyhead.\" Jonathan says cheerfully \"Sleep well?\"<br>\r\n<br>\r\n\"Oh yeah...\" I yawn \"Pretty good.\"<br>\r\n<br>\r\n\"Well I'm making this woodland stew for breakfast...I hope you don't mind...\"<br>\r\n<br>\r\nSuddenly Jonathan gasped and dropped the spoon<br>\r\n<br>\r\n\"Amanda!\" He gasps \"You're transforming more!\"<br>\r\n<br>\r\n\"Transforming more?\" I'm too tired to really comprehend this<br>\r\n<br>\r\n\"\"You're face is becoming more snake like!\" He said \"And I think I see a tail starting to grow!\"<br>\r\n<br>\r\nI look at my backside and indeed a tail is starting to sprout<br>\r\n<br>\r\n\"It seems I'm not the only one growing a tail.\" I said mildly \"I don't believe those tail feathers were there yesterday.\"<br>\r\n<br>\r\nJonathan looks down and indeed he has long black tail feathers growing from his posterior<br>\r\n<br>\r\n\"Oh.\" Jonathan said \"I guess I'm also transforming as well.\"<br>\r\n<br>\r\nHe puts his fingertips delicately on my face normally I can't stand being touched, but for whatever reason I tolerate it now.<br>\r\n<br>\r\n\"Do you feel all right?\" He asks \"Do you feel different on the inside?\"<br>\r\n<br>\r\n\"Right now I'm just hungry.\" I said</span></div></div>",
            "created":1362546000,
            "id":1545202,
            "title":"Morning"
        },
        "13111":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "A sound in the bushes",
                "Nothing Happens"
            ],
            "content":"<div class=\"\"><div> <span>We sit down and eat our breakfast, the silence is somewhat awkward, but we try to simply put it behind us and enjoy the quiet of the forest.<br>\r\n<br>\r\nThe stew really is pretty good, very meaty and flavorful, I'm quickly draining the last bits from the bowl with my forked tongue<br>\r\n<br>\r\n\"That was really good.\" I sigh</span></div></div>",
            "created":1369337280,
            "id":1595671,
            "title":"Breakfast"
        },
        "13112":{
            "author_id":"kyuremfan24",
            "author_name":"kyuremfan24",
            "choices":[
                "an other human / animal hybrid apeared from the bushes",
                "Amanda's legs & Jonathan's arms feels weird"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>when Jonathan was ready to serve the breakfast something happend</span></div></span></div>",
            "created":1453933200,
            "id":2095380,
            "title":"Suddenly something happens"
        },
        "132":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin Story",
                "Another Character's Story",
                "Another Character's Story "
            ],
            "content":"<div class=\"\"><div> <span>Just some random facts before Jonathan's story<br>\r\n<br>\r\nName: Jonathan XXX<br>\r\nSpecies: Human/Raven Hybrid<br>\r\n<br>\r\nFavorites<br>\r\nFavorite Book: The Halloween Tree by Ray Bradbury<br>\r\nFavorite Color: Black<br>\r\nFavorite Music: Classical<br>\r\nFavorite Comfort Food: Potato Chips</span></div></div>",
            "created":1362546000,
            "id":1545176,
            "title":"Jonathan's Random Trivia"
        },
        "14":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Ichabod Crane",
                "Pandora Nygma",
                "Alice Tetch",
                "New Story",
                "New Story"
            ],
            "content":"<div class=\"\"><div> <span>Main Characters, Ichabod Crane and Pandora Nygma and Alice Tetch<br>\r\n<br>\r\nIchabod: A survivor of the experiments<br>\r\nAge 17<br>\r\nPowers: Agility and climbing ability fused with a Cat, can also grow claws and fangs at will<br>\r\nBackstory He travels with his only friend Pandora in search for their parents<br>\r\n<br>\r\nPandora: Ichabod's friend and fellow experiment<br>\r\nAge: 16<br>\r\nPowers: Flight fused with Blackbird can grow black wings and tail feathers at will<br>\r\nBackstory: Ichabod's only friend loyal and trustworthy they travel the land in serch of their parents<br>\r\n<br>\r\nAlice: Lonely Girl kept captive 'for her own good' by a scientist<br>\r\nAge: 14<br>\r\nPowers: Flight and Echolocation fused with a Vampire Bat, can grow bat wings, fangs and larger ears at will<br>\r\n<br>\r\nWhose eyes do you want to look out of?</span></div></div>",
            "created":1362546000,
            "id":1545138,
            "title":"Ichabod Crane and Pandora Nygma and Alice Tetch"
        },
        "141":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin",
                "Another Character's Story",
                "Another Character's Story "
            ],
            "content":"<div class=\"\"><div> <span>Random Facts about Ichabod Crane<br>\r\n<br>\r\nName: Ichabod Crane<br>\r\nSpecies: Human/Cat Hybrid<br>\r\n<br>\r\nFavorites<br>\r\nFavorite Book: Dracula by Bram Stoker<br>\r\nFavorite Color: Green<br>\r\nFavorite Music: Classical<br>\r\nFavorite Comfort Food: Tuna Salad Sandwiches (He IS part Cat) </span></div></div>",
            "created":1362546000,
            "id":1545177,
            "title":"Ichabod Crane's Random Trivia"
        },
        "142":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin Story",
                "Another Character's Story",
                "Another Character's Story "
            ],
            "content":"<div class=\"\"><div> <span>Random facts about Pandora Nygma<br>\r\n<br>\r\nName: Pandora Nygma<br>\r\nSpecies: Human/Blackbird Hybrid<br>\r\n<br>\r\nFavorites<br>\r\nFavorite Book The Midnight Zoo by Sonya Hartnett <br>\r\nFavorite Color: Green<br>\r\nFavorite Comfort Food: Strawberries and Cream</span></div></div>",
            "created":1362546000,
            "id":1545178,
            "title":"Pandora Nygma's Random Trivia"
        },
        "143":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin Story",
                "Another Character's Story",
                "Another Character's Story "
            ],
            "content":"<div class=\"\"><div> <span>Some things you should know about Alice Tetch<br>\r\n<br>\r\nName: Alice Tetch<br>\r\nSpecies: Human/Vampire Bat Hybrid<br>\r\n<br>\r\nFavorites<br>\r\nFavorite Book: Alice in Wonderland by Lewis Carroll<br>\r\nFavorite Color: Blue<br>\r\nFavorite Music Classical<br>\r\nFavorite Comfort Foods: Tea and Crumpets </span></div></div>",
            "created":1362546000,
            "id":1545179,
            "title":"Alice Tetch's Random Trivia "
        },
        "15":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Story4",
                "Story5",
                "Story6",
                "Story7",
                "More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>some more spots to add your side to this world's story.</span></div></span></div>",
            "created":1308978000,
            "id":1134141,
            "title":"More Characters/storylines"
        },
        "151":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Jack",
                "XXX",
                "Other"
            ],
            "content":"<div class=\"\"><div> <span>Main Characters: Jack and XXX<br>\r\n<br>\r\nJack: A somewhat sociopathic character on the run from the law<br>\r\nAge: 16<br>\r\nPowers: Increased stretch and razor sharp teeth Fused with a Hyena<br>\r\nBackstory: Juvenile Delinquent with a history of torturing victims before killing them<br>\r\n<br>\r\nXXX: Mysterious figure who shows up and disappears without reason or rhyme <br>\r\nAge: Unknown<br>\r\nPowers: Increased speed and strengh fused with a Black Panther has black fur, can blend with the shadows<br>\r\nBackstory: Unknown</span></div></div>",
            "created":1362632400,
            "id":1545572,
            "title":"Story4"
        },
        "1511":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin Story",
                "Another Character's Story",
                "Another Character's Story "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Name: Jack<br>\r\nSpecies: Human/Hyena Hybrid<br>\r\n<br>\r\nFavorites<br>\r\nFavorite Book: Fifty Shades of Grey (He just finds it funny)<br>\r\nFavorite Color: Purple<br>\r\nFavorite Music: Death Metal<br>\r\nFavorite Comfort Food: Raw Meat</span></div></span></div>",
            "created":1362632400,
            "id":1545590,
            "title":"Jack's Random Trivia"
        },
        "1512":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin Story",
                "Another Character's Story",
                "Another Character's Story "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Name: XXX<br>\r\nSpecies: Human/Black Panther Hybrid<br>\r\n<br>\r\nFavorites<br>\r\nFavorite Book: Don Juan by Lord Byron<br>\r\nFavorite Color: Black<br>\r\nFavorite Music Classical<br>\r\nFavorite Comfort Food: Salmon Croquettes  </span></div></span></div>",
            "created":1362632400,
            "id":1545591,
            "title":"XXX and the Random Trivia"
        },
        "152":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Mary Sue",
                "Dextar",
                "New Character"
            ],
            "content":"<div class=\"\"><div> <span>Main Character Mary Sue and Dexter<br>\r\n<br>\r\nMary Sue: A gorgeous Experiment Girl who travels the land with her soul mate Dexter<br>\r\nAge: 16<br>\r\nPowers: Increased speed and strength Fused with an African Elephant, can grow trunk and tucks at will<br>\r\nBackstory: Extremely poetic and sensitive Mary Sue seems to not care about how sucky her life is as long as she has Dexter<br>\r\n<br>\r\nDexter: Somewhat nerdy young man travels with Mary Sue<br>\r\nAge: 16<br>\r\nPowers: Fused with a Beaver can grow long front teeth for chopping down trees in no time flat<br>\r\nBackstory: Dexter is the sane one in this duo, seems to be the only one who can keep Mary Sue in line<br>\r\n<br>\r\n</span></div></div>",
            "created":1362693540,
            "id":1545687,
            "title":"Mary Sue and Dexter"
        },
        "1521":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin",
                "Another Character's Story",
                "Another Character's Story "
            ],
            "content":"<div class=\"\"><div> <span>Name: Mary Sue<br>\r\nSpecies: Human/Elephant Hybrid<br>\r\n<br>\r\nFavorites:<br>\r\nHarry Potter and the Deathly Hollows by J.K. Rowling<br>\r\nFavorite Color: Pink<br>\r\nFavorite Music: Anything by the Backstreet Boys<br>\r\nFavorite Comfort Food: Bananas Foster</span></div></div>",
            "created":1362694020,
            "id":1545692,
            "title":"Mary Sue"
        },
        "1522":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin Story",
                "Another Character's Story",
                "Another Character's Story "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Name Dexter<br>\r\nSpecies: Human/Beaver Hybrid<br>\r\n<br>\r\n<br>\r\nFavorites<br>\r\nFavorite Book: The Secret Zoo by Brian Chick<br>\r\nFavorite Color: Brown<br>\r\nFavorite Music: Show Tunes<br>\r\nFavorite Comfort Food: Toasted Pumpkin Seeds</span></div></span></div>",
            "created":1362693840,
            "id":1545690,
            "title":"Dexter's Fun Facts"
        },
        "15221":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Something nasty appears",
                "Other   "
            ],
            "content":"<div class=\"\"><div> <span>I was napping on a riverbank after I had to fight the urge to build a dam over said river when I felt her presence near me.<br>\r\n<br>\r\n\"Hey there my Buck Toothed Sweety!\" Mary said putting a flower behind my ear<br>\r\n<br>\r\n\"Hey there.\" I said yawning Mary is great girl but you have to have the patience of a saint to put up with her weirdness, fortunately I do have the patience of a saint.<br>\r\n<br>\r\n\"What a beautiful forest!\" Mary said spreading her arms wide \"Doesn't it just give you a warm and fuzzy feeling?\"<br>\r\n<br>\r\n\"Yeah.\" I said \"Kind of like the feeling you get when you're chewing through a tree.\"<br>\r\n<br>\r\nI yawned again and said \"You want to go for a swim?\"<br>\r\n<br>\r\nBut before we can go in the water... </span></div></div>",
            "created":1362694380,
            "id":1545698,
            "title":"Dexter's Story"
        },
        "153":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Wilma's Story",
                "Samantha's Story",
                "Another Character's Story "
            ],
            "content":"<div class=\"\"><div> <span>Main Characters: Wilma White and Samantha Scarlet<br>\r\n<br>\r\nWilma White: A young woman who protects all those who develop animal powers and teaches them how to use them to full ability, Samantha is her star pupil.<br>\r\nAge: 18<br>\r\nPowers: Flight, fused with a Bald Eagle, can sprout bird wings and tail at will<br>\r\nBack story: Unknown, she seems touchy about it<br>\r\n<br>\r\nSamantha Scarlet: A young teenager, rejected by her family after her Animal Traits started developing<br>\r\nAge: 14<br>\r\nPowers: Increased strengh and stamina, fused with a Horse, can turn her legs into Horse legs for more speed<br>\r\nBack story: Lived a happy life until her Animal Powers developed then she was driven away by her own family</span></div></div>",
            "created":1369139160,
            "id":1594198,
            "title":"Story6"
        },
        "1531":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin Story",
                "Another Character's Story",
                "Another Character's Story "
            ],
            "content":"<div class=\"\"><div> <span>Name: Wilma White<br>\r\nSpecies: Human/Bald Eagle Hybrid<br>\r\n<br>\r\n<br>\r\nFavorites<br>\r\nFavorite Book: Pride and Prejudice by Jane Austin <br>\r\nFavorite Color: White<br>\r\nFavorite Music: Classical<br>\r\nFavorite Comfort Food: Fish &amp; Chips </span></div></div>",
            "created":1369139400,
            "id":1594201,
            "title":"Wilma's Random Facts"
        },
        "1532":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Begin Story",
                "Another Character's Story",
                "Another Character's Story "
            ],
            "content":"<div class=\"\"><div> <span>Name: Samantha Scarlet<br>\r\nSpecies: Human/Horse Hybrid<br>\r\n<br>\r\nFavorites<br>\r\nFavorite Book: The Familiars by Adam Jay Epstein and Andrew Jacobson <br>\r\nFavorite Color: Red<br>\r\nFavorite Music: Pop<br>\r\nFavorite Comfort Food: Carrot Cake  </span></div></div>",
            "created":1369139700,
            "id":1594205,
            "title":"Samantha's Story"
        },
        "15321":{
            "author_id":"twiga",
            "author_name":"Twiga",
            "choices":[
                "Bird Feet",
                "Feathered Arms"
            ],
            "content":"<div class=\"\"><div> <span>I was blissfully asleep when the sun started to rise, it wasn't until I heard the Rooster crowing that my ear flickered, when I felt my ear that's when I realized something was wrong!<br>\r\n<br>\r\n\"I'm transforming again!\" I cried<br>\r\n<br>\r\nI sprung out of bed and carefully stepping over my fellow students I went over to my teacher Wilma White<br>\r\n<br>\r\n\"Ms. White! Ms. White!\" I said \"I'm transforming again!\"<br>\r\n<br>\r\n\"I can see that Dear.\" Ms. White says \"You've grown Horse's ears.\"<br>\r\n<br>\r\n\"I'm not sure how much of this I can take!\" I say \"I don't want to turn into a smelly old horse!\"<br>\r\n<br>\r\n\"Don't fret.\" Ms. White says \"Stress will only make you sick...I'm transforming as well...\"<br>\r\n<br>\r\nShe revealed to me she now had... </span></div></div>",
            "created":1369338000,
            "id":1595674,
            "title":"Morning in the Forest"
        },
        "154":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "Ulrika, the humantaurian",
                "more options",
                "Jimba, the shemale lion"
            ],
            "content":"<div class=\"\"><div> <span>Life on Earth has changed a lot, the entire fauna have now human female bodies, and is scarce. However, there is still a binary gender system so there are just shemales and females. Every single remaining being has human feet, human legs, human torso and human breasts, but heads, arms, tails and skin varies from species to species.<br>\r\n<br>\r\nA few scenarios can be explored: One is in a new settlemen in Scotland, where a tribe of humantaurian girls live, just looking for males to survive, having two functional vaginas make them more versatile to breed numbers. The second is the african Savanna, where lions roam free, preserving their own feral ways of life. Of course, there are outer regions that can be explored too.</span></div></div>",
            "created":1474738080,
            "id":2214069,
            "title":"Story7"
        },
        "1542":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "Judomeda, the iguana empress of Altun Ha",
                "more options",
                "Maria and Karla, the hopefull human couple"
            ],
            "content":"<div class=\"\"><div> <span>The pyramids of Altun Ha, in the old dead country of Belize, were now settled by a race of iguanas. There is something special with reptiles, since their bellies, breasts and soles are extremely soft while the rest of their bodies are scalled. Also, instead of milk their breast produce vodka, reptiles are inmunne to alcohol effects, and this society is just advancing into an ancient age society. Shemales of these species still have their genitals hidden unless needed, also they still lay eggs.<br>\r\n<br>\r\nNot so far from there, in the now dysmal populated Mexico City, a human girl and a human shemale are just married, trying to reconstruct the civilization by tamming any living being in the old Chapultepec Zoo, where the last panda lives. Teaching other species to be civilized seems the only way to reconstruct the recently fallen world, but it's a hard way to go.</span></div></div>",
            "created":1474738920,
            "id":2214071,
            "title":"more options"
        },
        "15422":{
            "author_id":"dekarserverbot",
            "author_name":"EveryoneKtoA",
            "choices":[
                "Pichi, the newborn female bird",
                "reader's choice"
            ],
            "content":"<div class=\"\"><div> <span>A bird population that just appeared in the chappel of notre damme, the birds have had a bad time trying to get used to their lack of talons and their new human feet, but they are finally getting used to this toes, they still conserve their birdish behaviors and beaks, the nests are full of eggs that are going to hatch soon</span></div></div>",
            "created":1474739280,
            "id":2214075,
            "title":"more options"
        },
        "155":{
            "author_id":"js173",
            "author_name":"Nash Contra",
            "choices":[
                "Story8",
                "Story9",
                "A Few More"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Even more for you.</span></div></span></div>",
            "created":1308978000,
            "id":1134143,
            "title":"More"
        },
        "1551":{
            "author_id":"grongo",
            "author_name":"Grongo",
            "choices":[
                "Jack Castle",
                "Marty Winger",
                "Another Character"
            ],
            "content":"<div class=\"\"><div> <span>Here are our two main characters<br>\r\n<br>\r\n<b>Name:</b> Jack Castle<br>\r\n<b>Age:</b> 45<br>\r\n<b>Powers: </b>increased resilience, size and strength<br>\r\n<b>Appearance:</b> Doc Castle's DNA has been fused with that of an African Elephant. As a result he stands at 7' 9\" tall, his body is very bulky and stout. His head looks like that of an elephant, with tusks, ears and a trunk he can control easily. He has grey, leathery skin that is extremely thick and resistant to bullets and blunt trauma<br>\r\n<b>Back Story: </b>Doc Castle is one of the older surviving experiments. He was forced to survive in this harsh world from a young age, which made him develop a serious and stern demeanor, along with a very strong sense of honor. Those traits coupled with his high natural strength pushed him to become a lawman in the city of Junktown, one of the few civilized settlements in this ruined world. He can usually be found breaking up bar brawls, punishing outlaws or repelling raiders.<br>\r\n<br>\r\n<b>Name:</b> Marty Winger<br>\r\n<b>Age:</b> 16<br>\r\n<b>Powers: </b> has a pair of black wings on his back which grant him flight<br>\r\n<b>Appearance:</b> Marty Winger's DNA has been fused with that of a Raven. He has black, messy feathers over his entire body, thin bird like legs and a beaked head resembling that of a raven. He has a pair of wings on his back, that he normally keeps tucked in.<br>\r\n<b>Back Story: </b> Marty's parents abandoned him to fend for himself at a very young age. He became a scavenger and street urchin, and he developed a cowardly and shy personality, often flying away at the slightest sign of danger. He eventually ended up in Junktown, where he met jack Castle. Jack decided to take the young raven boy under his wing, even making him his deputy. Thanks to Jack, Marty has become more confident, but he is still rather cowardly and shy, and likely to fly away in the event of a confrontation.<br>\r\n<br>\r\nOur main setting:<br>\r\n<b>Junktown</b><br>\r\nJunktown started out as a small trading post where travelers, merchants and nomads could exchange scavenged goods for water or food. More and more people elected to stay in Junktown, and it quickly grew into a small city, with around 400 inhabitants. Tall walls made out of scrap and old cars and trucks protect the city from raiders, but the only two lawmen, Jack Castle and Marty Winger struggle to keep the peace inside the walls.</span></div></div>",
            "created":1587465120,
            "id":2822033,
            "title":"The saga of Jack Castle and Marty Winger"
        }
    },
    "info":{
        "author_id":"js173",
        "author_name":"Nash Contra",
        "brief_description":"What will happen in an apocalypse caused by the unforeseen events of DNA manipulation?",
        "created":1297481340,
        "description":"<td align=\"left\" class=\"norm\">This story is set in a world where man has tried to take the best 'attributes' such as speed, strength, and even flight, from animals and genetically fuse it with humans via DNA manipulation. The experiments were harsh, only 3 of every 7 or so made it through alive, and even less lived longer than a few days after. The experiments were done on unborn children, since if they were too old, the immune systems would fight off the DNA of the creature used in such a way as to actually leave visible damage, and none that were infused after they were born were able to survive.<br>\r\n<br>\r\nRules:<br>\r\nOnly 8, so listen up.<br>\r\n1) At least 4-5 sentences unless it's a choice chapter, and not too many of those (a choice chapter is only to follow a chapter with too many choices for one page, no stopping a story and making one just because you can.), and make it readable, please? <br>\r\n2) This isn't for kids, but it's not strictly for adults either, there can be violence, and death, and even a little blood, but nothing too extreme.<br>\r\n3) At the start, you must describe the main character(s) of your story, if you only have one main, he/she can't die, or else the story is over, no \"continue as...\" option, but if you have more than one, you can switch to the one still alive, however, there is no introducing a new main mid-story, you can introduce secondary/side-characters, but they are not usable for switching if your main/s die.<br>\r\n4) Side characters can be left out of the 'background' explanations, but are to be talked about at least a bit eventually.(people can gain powers, if there's a logical reason. Ha! logic, in a work of fantasy, that's a novel idea xP)<br>\r\n5) You can have characters that have powers, but nothing so over the top that it's impossible for them to lose in every fight. example: \" 'generic name' has the ability to insta-kill simply by wanting too.\"<br>\r\n6) All skills have to be something that's gained from an animal, even if that power is from a myth/legend, like the kitsune of Japan, or fox spirits, a person infused with a fox can have multiple tails and gain supernatural powers from said tails.<br>\r\n7) Leave an 'Other' option on all chapters so others can add as they like.<br>\r\n8) On the character introduction pages, you can only choose from the main characters on who you want to be.<br>\r\n<br>\r\nAnd that's it, enjoy the world that we all create together.<br>\r\n<br>\r\nP.S. I will check on the grammar every now and then, if it's really bad, I'll re-write/delete depending on how bad it is, like if I can't read it at all, I'll likely delete it, but if I can understand what's going on, even if only barely, I'll attempt to make it readable for others.(I won't change the plot or anything, promise)</td>",
        "id":1750574,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1587465120,
        "modified":1587465120,
        "pretty_title":"The World After"
    }
}