{
    "chapters":{
        "1":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "ein Raubtier",
                "ein Nagetier",
                "ein Reptil",
                "ein Mensch",
                "etwas anderes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Als du aus deinem Bett aufstehst streckst du dich erstmal und gehst mit müden Augen ist Bad. Du gehst zum Spiegel und beäugst dich erstmal. Du siehst einfach hervorragend aus, schliesslich bist du ..........</span></div></span></div>",
            "created":1190869200,
            "id":447926,
            "title":"Wer bist du?"
        },
        "11":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "ein Tiger ",
                "ein Wolf",
                "eine Katze",
                "ein Cerberus (Höllen-Hund mit drei Köpfen)",
                "etwas anderes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Du bist .........</span></div></span></div>",
            "created":1190869200,
            "id":447920,
            "title":"Was für ein Raubtier?"
        },
        "111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/2155745/\" target=\"_blank\">http://www.furaffinity.net/view/2155745/...</a> oder weiblich <a rel=\"nofollow\" href=\"http://twokinds.deviantart.com/art/Flora-s-Vacation-at-the-Beach-34359484\" target=\"_blank\">http://twokinds.deviantart.com/art/Flora...</a> <a rel=\"nofollow\" href=\"http://twokinds.deviantart.com/art/Meet-me-in-the-Sunlight-16779192\" target=\"_blank\">http://twokinds.deviantart.com/art/Meet-...</a> <a rel=\"nofollow\" href=\"http://twokinds.deviantart.com/art/Bonus-Image-01-23553695\" target=\"_blank\">http://twokinds.deviantart.com/art/Bonus...</a></span></div></span></div>",
            "created":1190869200,
            "id":739656,
            "title":"M oder W"
        },
        "1112":{
            "choices":[
                "Hunger hin oder her, mehr Frühstück!",
                "Der Tag schreit nach Aktion, ich werde einige Freunde anrufen..."
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://www.deviantart.com/download/60521214/Tiger_Lady_by_KonnaYasha.jpg\" target=\"_blank\">http://www.deviantart.com/download/60521...</a><br>\r\nBehutsam benetzt du dein Gesicht mit etwas Wasser und beginnst dann, dir die Zähne zu putzen. Nach einem weiteren Blick in den Spiegel beschließt du, dass der Tag beginnen kann und du zum Frühstück bereit bist. Deine Küche ist das, was man von der Küche einer Großkatze erwartet: Überall türmen sich Käfige verschiedenster Nager, Vögel und Reptilien. Lässig greifst du in den erstbesten Käfig und holst eine Maus heraus. Das sollte für den Anfang genügen. Bedächtig setzt du dich an den Küchentisch, öffnest dein Maul und wirfst das zitternde Mäuslein gelangweilt hinein. Amüsiert verfolgst du, wie es zwischen deinen Zähnen hin und her läuft und verzweifelt nach einem Ausweg sucht. Sein seidiges Fell tränkt sich mehr und mehr mit deinem Speichel, bis du das Gefühl hast, ein nasser Miniaturwischmob würde in deinem Maul umherrennen. Als dein Magen knurrt, bereitest du dem Spiel ein Ende und beförderst die Maus mit einem Schluck in deinen Rachen. der schwere Kloß rutscht langsam deinen Hals herunter und macht schließlich im Bauch halt. Langsam spürst du es in deinen geräumigen Magen gleiten. Als die Maus im Todeskampf in deine Magenwände zwickt und verbittert quietscht, raschelst du laut mit der Morgenzeitung, um die Geräusche zu übertönen. Die Tiere, die behaupten, man solle sein Essen vor dem Verzehr töten, sind dir seit jeher suspekt.<br>\r\n<br>\r\nDer erste Hunger des Tages ist überstanden, was willst Du heute noch tun?</span></div></div>",
            "created":1191560400,
            "id":724168,
            "title":"Frühstück"
        },
        "11121":{
            "choices":[
                "Ein Schläfchen wäre jetzt das Richtige...",
                "Wo ich ja nun das Frühstück beendet habe, kann ich ja das Mittagessen vorbereite"
            ],
            "content":"<div class=\"\"><div> <span>Da du nun schonmal am Frühstückstisch sitzt, kannst du auch gleich mehr essen, als diesen jämmerlichen Happen von Maus. Du lehnst dich zurück und greifst mit deiner Pfote in einen neuen Käfig. Innerlich verdrehst du die Augen, als du siehst, was du herausgefischt hast: Es ist ein Eichhörnchen und von deinen früheren Schlemmerorgien weisst du, das diese Spezies gerne und viel um ihr Leben fleht.<br>\r\n\"Bitte friss mich nicht, große und mächtige Tigerin!\" fängt es an.<br>\r\n\"Warum? Ich habe Hunger!\" antwortest du.<br>\r\n\"Aber... Ich bin doch noch so jung und möchte mein Leben genießen\"<br>\r\nAus Erfahrung weisst du, was jetzt geschehen wird. Das Eichhörnchen wird anfangen zu weinen und dir von seiner großen Familie zu erzählen, die es eigentlich ernähren müsste. Um diese Unannehmlichkeiten zu umgehen, wirfst du dir das Tier zwischen die geöffneten Kiefer und verschluckst es im selben Augenblick. Der Kloß, den du diesmal in deinen Bauch wandern fühlst, ist größer, etwas schwerer und vor allem quirliger. Als das Hörnchen in deinem Magen beginnt, der Maus bei Kratzen und Zwicken zu helfen, lehnst du dich zurück und beginnst zu schnurren. Du stellst dir vor, wie die beiden durch deinen Magen rennen und lässt ihre Geschmäcker nochmals in deinem Maul Revue passieren. Dann setzt die Verdauung ein.</span></div></div>",
            "created":1191646800,
            "id":450960,
            "title":"Noch ein Häppchen"
        },
        "111211":{
            "content":"<div class=\"\"><div> <span>Mit vollem Magen kehrst du jetzt wieder dorthin, wo du hergekommen bist: dein Bett. Zufrieden schmatzend legst du dich mit dem Bauch auf dein Bett und schläfst sofort ein, während der Tag draußen eigentlich erst richtig beginnt. Als wäre er die Strafe für soviel Faulheit, überkommt dich ein scheußlicher Schmerz, der dich aus deinen Träumen reißt. Du maunzt gequält und lokalisierst dann das Hypozentrum der Unannehmlichkeiten: dein Magen. Als du etwas in dich hineinlauschst, kannst du tief in deinem Bauch noch immer kleine Pfoten tappsen hören und ahnst bereits, was vorgefallen ist. In der Vergangenheit hatten dich mehrere Bekannte darauf hingewiesen, dass man Eichhörnchen vor dem Verzehr stets töten sollte, denn so, wie sie um ihr Leben flehen, kämpfen sie auch darum. Das spezielle Exemplar in deinen Eingeweiden versucht immer wieder, den starken Eingangsmuskel des Magens zu überwinden und sich die Speiseröhre wieder hochzuarbeiten. Bei vielen anderen Tieren hätte das vielleicht geklappt, aber ein Tigermagen gibt ungerne wieder das frei, was in ihn gelangt ist und eine dazugehörige Speiseröhre ist problemlos imstande, ein rebellisches Eichhörnchen in seine Grenzen zu weisen. Du stellst derweil fest, das es nur einen Weg gibt, deine Schmerzen zu beenden. Du musst mit deinem bereits verzehrten Essen verhandeln. \"Hallo?\" fragst du ins Leere. Das Getappel in deinem Magen hört aprupt auf. \"Eichhörnchen, machst du das?\" \"Ja, nätürlich! Glaubst Du allen Ernstes, dass ich mich von einem stickigen Tigerbauch zu Soße verwandeln lasse?!\" hörst du zur Antwort. Du grübelst... Wenn das Hörnchen versucht, sich deine Speiseröhre hinaufzuarbeiten, kommt es dabei nicht mit deiner Magensäure in Kontakt. Das würde bedeuten, dass du die Schmerzen ertragen musst, bis es einen Erschöpfungstod stirbt. Die einzige andere Verhandlungsbasis wäre dein Hinterausgang. Du schauderst leicht bei dem Gedanken, ein quirliges Eichhörnchen deinen empfindlichen Darmtrakt passieren zu lassen, aber ein erneuter Krampf erinnert dich an die Handlungsdringlichkeit. \"Hör zu!\" rufst du in deinen Bauch hinein \"Du hörst mit diesem Gehampel auf und ich entspanne dafür die Muskeln um meinen Magen etwas, sodass du in den Darm gelangen kannst und über mein Hinterteil wieder das Licht der Welt erblickst.\" nach kurzem Zögern ist das Hörnchen einverstanden. Du legst dich mit deinem Rücken auf das Bett und versuchst, dich vollkommen zu entspannen. Plötzlich durchfährt dich ein noch viel stechenderer schmerz als der Vorhergehende: Das Eichhörnchen hat sich mit Wucht durch deinen erschlafften Magenausgang gebohrt und beginnt nun seine Reise durch den Darm. In dem nächsten zwei Stunden zwickt es nur mal gelegentlich, ansonsten scheint das Hörnchen darauf bedacht, dich nicht zu sehr zu stören. Nach einer weiteren Stunde spürst du den Drang, auf die Toilete zu gehen. Du hättest nicht gedacht, wie problemlos ein Eichhörnchen durch deinen Allerwertesten passt. Sachte fällt es unter dir auf den Boden. Du öffnest ihm die Tür, lässt es frei und gehst wieder schlafen.<br>\r\nFür heute hast du vom Fressen genug...</span></div></div>",
            "created":1191646800,
            "id":451146,
            "title":"Späte Rache"
        },
        "11122":{
            "choices":[
                "Sammy, ein jüngerer Fuchs",
                "Balduin, ein Bär"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Du schaust in dein Telefonbuch und überlegst, wer für den heutigen Tag als deine Gesellschaft in Frage kommt. Schlussendlich musst du dich zwischen zwei alten Freunden entscheiden.</span></div></span></div>",
            "created":1191646800,
            "id":450971,
            "title":"Am Telefon"
        },
        "111221":{
            "choices":[
                "\"Könnte ich den selben Weg gehen, wie die Ratte eben?\"",
                "\"Empfindest du auch das, was ich für dich empfinde?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Hallo?\" fragt eine schnarrende Stimme am anderen Ende des Apparats missgelaunt. Scheinbar hast du ihn geweckt. Als er dich am Telefon erkennt, hellt sich seine Stimmung jedoch merklich auf. Seit jeher ist Sammy in deiner Umgebung stets etwas verlegen und wortkarg, was bei männlichen Tieren nur auf eines schließen lässt... \"Hast du zufällig Lust, mir heute Gesellschaft zu leisten, Sammy? Mir ist so langweilig\" maunzt du in den Hörer. \"Och, ich könnte dich auch bei mir zum Essen einladen, schließlich warst du lange nicht mehr hier\" gibt er zurück. Tatsächlich hat er Recht, du weisst kaum noch, wie es in Sammy's Bau aussieht und schließlich einigt ihr euch auf einen Brunch bei ihm. Du bist jetzt froh, nur die Maus zum Frühstück gefressen zu haben.<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://th06.deviantart.net/images3/150/i/2004/132/b/9/Anthro_Fox.jpg\" target=\"_blank\">http://th06.deviantart.net/images3/150/i...</a><br>\r\nEine Stunde später bist du bei Sammy, dessen Bau hell durch die Vormittagssonne ausgeleuchtet ist. Nach einer eingänglichen Begrüßung geleitet er dich zu seinem Esstisch. Im Gegensatz zu deiner Küche lassen sich nirgendwo Käfige erkennen. Auf dem Teller vor dir liegt dafür eine fette Ratte, die der Fuchs anscheinend selbst gejagt und schließlich gefesselt auf deinen Teller gelegt hatte. Er selbst begnügte sich mit einer Maus, kaum fetter als dein heutiges Frühstück. Nachdem ihr etwas geredet habt, beginnt ihr mit dem Essen. Zu deinem großen Bedauern gehört Sammy zu denen, die ihr Futter in Teilen vorziehen. Du sprichst ihn nicht weiter darauf an und überlegst, wie du die riesige Ratte vertilgen willst. Als du ihre Krallen siehst, beschließt du, sie vorher nicht von ihren Fesseln zu befreien. Du legst dir das verschnürte Tier auf die Zunge und schließt dein Maul bedächtig über ihm. Du musst erst etwas Speichel sammeln, um die Ratte zu schlucken, aber es gelingt dir schließlich. Etwas enttäuscht, weil die Ratte kaum zappelt, lässt du dich in den Stuhl sinken. \"Mhh... Delikat\" sagst du zu Sammy, der dir die ganze Zeit zugeschaut hat. \"Ist irgendwas nicht in Ordnung?\" fragst du ihn endlich. Zu deiner großen Überraschung rückt Sammy sofort mit seinem Anliegen heraus.</span></div></div>",
            "created":1191646800,
            "id":724183,
            "title":"Sammy"
        },
        "1112211":{
            "choices":[
                "...merkst du noch immer, wie Sammy in deinem Magen umhertapst",
                "...ist Sammy tot und du gehst nach hause "
            ],
            "content":"<div class=\"\"><div> <span>\"Was?!\" du springst auf. \"Sammy, du weisst doch, was mit Futter geschieht, das man frisst, oder?\" Der Fuchs schaut beschämt nach unten. Nach kurzer Pause sagt er zögerlich: \"Es ist mein Wunsch... Ich möchte von dir gefressen werden. Was auch immer in deinem Bauch mit mir geschieht, was ich davor erlebe wird mich dafür entschädigen.\" Du schüttelst den Kopf über Sammy's Einfältigkeit, doch fährst gleichzeitig mit den Augen über ihn, um festzustellen, dass es nicht schwierig wäre, ihn im Ganzen zu vertilgen. \"Denk lieber nochmal darüber nach!\" rätst du ihm \"Dein Wunsch wäre entgültig...\" Der Fuchs beteuert dir erneut, dass er sich seiner Sache sicher ist. Flach legst du dich nun auf den Boden der Küche und reißt dein imposantes Maul auf. Sammy stellt sich davor und du merkst, wie er tief in deinen Rachen blickt. Langsam legt er eine zitternde, seidige Pfote auf deine Zunge und du schmeckst erstmals delikaten Fuchsgeschmack. Nach kurzer Zeit legt er auch die zweite Pfote auf deine Zunge und nach einer Minute steht er komplett in deinem Maul. Als du es schließt, muss sich der Fuchs zusammenkauern, aber er klagt nicht. Aus deinem vorderen Rachenraum vernimmst du die jetzt doch leicht verängstigten Geräusche Sammys, der jetzt freie Sicht auf den Anfang deiner pulsierenden Speiseröhre. \"Bereit?\" fragst du zwischen zusammengepressten Zähnen. \"Ähh... Schon immer!\" Der Fuchs versucht, seine Unsicherheit zu vertuschen, aber du hättest ihn mittlerweile vermutlich sogar gefressen, wenn er es sich anders überlegt hätte. In diesem Moment wird dir klar, das du im Begriff bist, einen Freund zu fressen und willst Sammy ausspucken. Just in diesem Moment jedoch rutscht dieser mit der Vorderpfote ab und löst deinen Schluckreflex aus, sodass du nurnoch erschrocken feststellen kannst, wie ein zappelnder, schwerer und aufgrund seiner Größe auch schmerzender Kloß deinem Magen entgegen wandert. Auf Höhe deiner Lunge steckt der Kloß plötzlich fest. \"Sammy? Alles okay bei dir?\" \"Ich stecke fest!\"kommt es zur Antwort gedämpft aus deiner Brust. Du hörst den Fuchs leise Keuchen, als die Muskeln deiner Speiseröhre beständig auf ihn eindrücken. Nach kurzer Zeit löst sich die Masse in deiner Brust erneut und reist in deinen Mage weiter. Als Sammy deinen Pförtnermuskel passiert, hört man ein deutliches Platschen und der Aufprall reißt dich beinahe zu Boden. Durch deine Bauchwand unterhältst du dich noch etwas mit deinem Freund. Gelegentlich schluckst du etwas Luft, um ihm das Atmen zu erleichtern. Du schläfts ein.<br>\r\n<br>\r\nAls du aufwachst...</span></div></div>",
            "created":1191646800,
            "id":450994,
            "title":"Der freiwillige Nachtisch"
        },
        "11122111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "50 meter",
                "10 meter"
            ],
            "content":"<div class=\"\"><div> <span>Ein eigenartiges Magengefühl weckt dich.<br>\r\n\"Sammy bist du das?\" flüsters du in dich rein.<br>\r\n\"Ja. Was ist los? Dein Magen ist viel größer geworden.\" hörst du dumpf aus deiner Magengegend.<br>\r\n\"Wie meinst du das?\" fragst du.<br>\r\n\"Ich glaube ich werde nicht verdauut, sondern ich schrumpfe.\" sagt Sammy.<br>\r\nErschrocken siehst du dich um und sagst:\"Du schrumpfst nicht. Ich wachse.\"<br>\r\n\"Wie groß bist du?\" hörst du Sammy fragen.<br>\r\n\"Ich schätze ................</span></div></div>",
            "created":1249448400,
            "id":744339,
            "title":"...merkst du noch immer, wie Sammy in deinem Ma..."
        },
        "11122112":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Ist der Türrahmen schon immer so klein?\" (Du bist etwas gewachsen)",
                "Ist der Türrahmen schon immer so groß?\" (Du bist etwas geschrumpft)"
            ],
            "content":"<div class=\"\"><div> <span>\"Sammy, bist du noch da?\" fragst du. <br>\r\nAber Sammy ist komplett verdaut und dein Magen ist wieder auf Normalmaß zurückgeschrumpft. <br>\r\nDu fühlst dich irgendwie eigenartig und gehst mit Schuldgefühlen nach hause.<br>\r\nAls du durch die Eingangstür gehst stößt du mit dem Kopf an den Türrahmen. <br>\r\nDu reibst dir deinen Kopf und denkst:\".........</span></div></div>",
            "created":1217394000,
            "id":563223,
            "title":"ein merkwürdiger Morgen."
        },
        "112":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich oder weiblich</span></div></span></div>",
            "created":1190869200,
            "id":447947,
            "title":"M oder W"
        },
        "113":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich oder weiblich</span></div></span></div>",
            "created":1190869200,
            "id":447948,
            "title":"M oder W"
        },
        "114":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/1460497/\" target=\"_blank\">http://www.furaffinity.net/view/1460497/...</a> oder weiblich <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/1629920/\" target=\"_blank\">http://www.furaffinity.net/view/1629920/...</a></span></div></span></div>",
            "created":1190869200,
            "id":734194,
            "title":"M oder W"
        },
        "12":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "eine Maus",
                "ein Meerschweinchen",
                "ein Eichhörnchen",
                "eine Ratte",
                "etwas anderes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Du bist ........</span></div></span></div>",
            "created":1190869200,
            "id":450581,
            "title":"Was für ein Nagetier?"
        },
        "121":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/2295761/\" target=\"_blank\">http://www.furaffinity.net/view/2295761/...</a> oder weiblich <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/503477/\" target=\"_blank\">http://www.furaffinity.net/view/503477/</a></span></div></span></div>",
            "created":1190890560,
            "id":748113,
            "title":"M oder W"
        },
        "1211":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Frauenarzt",
                "Allgemeinmediziner",
                "mehr"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Nach 10 Jahren der intensiven Ausbildung kaufst du dir eine Praxis mit den erforderlichen Gerätschaften.<br>\r\nWelche art Arzt bist du überhaupt?</span></div></span></div>",
            "created":1192251600,
            "id":705798,
            "title":"Arzt"
        },
        "12113":{
            "author_id":"emeralwizard",
            "author_name":"lord of emeralds",
            "choices":[
                "Ja",
                "Nein"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hals-Nasen-Ohren-Arzt?</span></div></span></div>",
            "created":1269968640,
            "id":859247,
            "title":"mehr"
        },
        "122":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich oder weiblich</span></div></span></div>",
            "created":1190955600,
            "id":448298,
            "title":"M oder W"
        },
        "123":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich oder weiblich</span></div></span></div>",
            "created":1190955600,
            "id":448299,
            "title":"M oder W"
        },
        "124":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich oder weiblich</span></div></span></div>",
            "created":1190955600,
            "id":448300,
            "title":"M oder W"
        },
        "13":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "ein Drache",
                "eine Echse",
                "ein Dinosaurier",
                "ein Alligator",
                "etwas anderes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Du bist ........</span></div></span></div>",
            "created":1190869200,
            "id":449209,
            "title":"Wer bist du?"
        },
        "131":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich oder weiblich</span></div></span></div>",
            "created":1190955600,
            "id":448301,
            "title":"M oder W"
        },
        "132":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich oder weiblich</span></div></span></div>",
            "created":1190955600,
            "id":448302,
            "title":"M oder W"
        },
        "133":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich oder weiblich</span></div></span></div>",
            "created":1190955600,
            "id":448303,
            "title":"M oder W"
        },
        "134":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich oder weiblich</span></div></span></div>",
            "created":1190955600,
            "id":448304,
            "title":"M oder W"
        },
        "135":{
            "author_id":"emeralwizard",
            "author_name":"lord of emeralds",
            "choices":[
                "Ja",
                "Nein"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bist du ein Saurier?</span></div></span></div>",
            "created":1269967920,
            "id":859239,
            "title":"etwas anderes"
        },
        "14":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "ein Mann",
                "eine Frau"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Du bist .......</span></div></span></div>",
            "created":1190869200,
            "id":503404,
            "title":"Wer bist du?"
        },
        "141":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Dem Direktor zuhören",
                "Das Internat erforschen",
                "Andere Story"
            ],
            "content":"<div class=\"\"><div> <span>Du bist grade aus dem Auto deines Vaters ausgestiegen da siehst du ein riesiges Anwesen das dir ein ungutes Gefühl einflösst. \"Im ersten Moment hat jeder angst.\" versucht dich dein Vater zu beruhigen. \"Also dann, Tschüss.\" verabschiedes du dich von deinem Vater und gehst durch das Tor. Erst jetzt siehst du wie groß das umgebaute Schloß ist und siehst eine Menschen menge vor dem Eingang stehen.<br>\r\nDu stellst dich dazu und siehst den Direktor der grade seine Ansprache macht.</span></div></div>",
            "created":1191560400,
            "id":740743,
            "title":"Das Vore-Internat"
        },
        "1411":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Du schaust erstmal was für Wesen dabei sind.",
                "Du unterhälst dich mit einem Menschen."
            ],
            "content":"<div class=\"\"><div> <span>\"Ich bin der Direktor und heiße euch an unserem Internat Willkommen.<br>\r\nBevor ihr eure Zimmer zugeteilt bekommt werdet ihr erstmal mit einigen anderen Jugendlichen zusammengebracht. <br>\r\nIhr müsst nicht erschrecken, Sie unterscheiden sich kaum von euch.<br>\r\nAlso dann. Ihr könnt kommen.\"<br>\r\nDu erschreckst kurz als aus einer großen Tür einige riesige tierähnliche Wesen herraus kommen.<br>\r\nSie stellen sich einfach hinter euch und sehen friedlich aus.<br>\r\n\"Ich möcht das ihr euch miteinander bekannt macht. Denn das sind eure Mitschüler.\"</span></div></div>",
            "created":1191560400,
            "id":733631,
            "title":"Die Ansprache"
        },
        "14111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "einem Drachen (30 meter groß) gehören.",
                "einem Känguru (40 meter groß) gehören."
            ],
            "content":"<div class=\"\"><div> <span>Du schaust dich um siehst Drachen die 25 meter groß sind, Wölfe die zwischen 1,80 und 5 meter groß sind, Füchse die 1 bis 7 meter groß sind, Mäuse die 0,10 bis 10 meter groß sind, Känguru die 10 bis 30 meter groß sind und viele andere Wesen die Menschliche Kleidung tagen.<br>\r\nPlötzlich spürst du ein feucht warmen Hauch im Nacken und du drehst dich um.<br>\r\nEine riesige Augenparie blickt dich an.<br>\r\n\"Wie es aussieht sind wir Zimmergenossen.\" sagen dir die Augenparien.<br>\r\nDu schaust genauer hin und erkennst das die Augenpartie zu </span></div></div>",
            "created":1191560400,
            "id":731566,
            "title":"Unerwartete Freundschaft"
        },
        "141111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/2549724/\" target=\"_blank\">http://www.furaffinity.net/view/2549724/...</a> <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/1916325/\" target=\"_blank\">http://www.furaffinity.net/view/1916325/...</a> <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/1781717/\" target=\"_blank\">http://www.furaffinity.net/view/1781717/...</a> <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/2541982\" target=\"_blank\">http://www.furaffinity.net/view/2541982</a> oder Weiblich <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/698015\" target=\"_blank\">http://www.furaffinity.net/view/698015</a> <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/342651/\" target=\"_blank\">http://www.furaffinity.net/view/342651/</a> <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/1652202/\" target=\"_blank\">http://www.furaffinity.net/view/1652202/...</a> <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/1084915/\" target=\"_blank\">http://www.furaffinity.net/view/1084915/...</a></span></div></span></div>",
            "created":1247979600,
            "id":731580,
            "title":"M oder W"
        },
        "141112":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "den kräftigen Körperbau von selbst bestätigt.(Männlich)",
                "die üppigen Kurven von selbst bestätigt.(Weiblich)"
            ],
            "content":"<div class=\"\"><div> <span>Der Direktor öffnet die riesigen Tore und lässt euch rein.<br>\r\n\"Komm mit.\" sagt das Känguru und geht langsam los damit du den riesigen Schritten mithalten kannst.<br>\r\nEs ist dir ein wenig mulmich als das Känguru eine Tür öffnet und dich vorgehen lässt. <br>\r\nDu stellst deine Koffer ab und hörst hinter dir ein lautes Rumsen.<br>\r\nSchreckhaft drehst du dich um und siehst wie dein Zimmengenosse seine riesigen Schuhe ausgezogen hat und in die Ecke geworfen hat.<br>\r\nDer Geruch von Schweiß zieht durch das Zimmer und du hälst dir die Nase zu. <br>\r\nDu willst nicht unhöflich sein und hälst deine Klappe. <br>\r\n\"Endlich aus den engen Schuhen raus.\" sagt das Känguru und lässt sich auf sein Bett fallen.<br>\r\nAls du dich umschaust siehst du ein Bett für deine größe zwischen seinen Füßen.<br>\r\nMit zugehaltender Nase setzt du dich hin und ziehst auch deine Schuhe aus.<br>\r\nDu weisst eigendlich nicht ob dein Zimmergenosse Männlich oder Weiblich ist, was sich eigendlich durch ...</span></div></div>",
            "created":1191560400,
            "id":450838,
            "title":"Ab aufs Zimmer"
        },
        "1411122":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Könntes du mir die Füße Massiren?",
                "Willst du dich nicht langsam einrichte?"
            ],
            "content":"<div class=\"\"><div> <span><a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/104493/\" target=\"_blank\">http://www.furaffinity.net/view/104493/</a><br>\r\n\"Hey Kleiner. Ich heiße Roo und du?\" kommt mit einem freundlichen Ton von deiner Zimmergenossin.<br>\r\n\"Ämm, Ben.\" entgegnes du ihr ängstlich.<br>\r\nSie steht auf und beugt sich zu dir runter was dich weiter erschrecken lässt.<br>\r\n\"Du brauchst vor mir keine Angst zu haben. Ich werde dir schon nichts tun.\" versucht Sie dich zu beruhigen und setzt sich vor dich auf den Boden.<br>\r\nDu weisst nicht warum, aber deine Angst verfliegt langsam und das mulmige Gefühl ist auch wie weggeblasen.<br>\r\n\"Eine Sekunde.\"sagt Roo zu dir und zieht die Socken aus.<br>\r\nEin beissender Geruch von ihrem Fußschweiß treibt dir fast die Tränen in die Augen und du nimmst nurnoch diesen Geruch war.<br>\r\n\"Tut das gut.\" hörst du Sie nur sagen als Sie ihre Socken im hohen Bogen in die Ecke wirft.<br>\r\nIrgend wie ist der Geruch ihrer verschwitzten Läufe nicht so ekelerregend wie du erst dachtes und Roo fragt dich:\"...........\"</span></div></div>",
            "created":1191560400,
            "id":731624,
            "title":"Eine nette Unterhaltung"
        },
        "14111221":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Wo soll ich eigendlich Schlafen?",
                "Darf ich mich hier mal umschauen?"
            ],
            "content":"<div class=\"\"><div> <span>\"Könntes Du mir die Füß massiren?\" fragt Roo dich mit netten unterton und hält dir ihre 6 meter großen Füße hin.<br>\r\n\"Na klar.\" sagst du und drückst gegen ihre Fußballen.<br>\r\nAlles war verschwitzt und roch intensiver als vorher nach ihr.<br>\r\n\"Ohh, genau da.\"bittet Sie dich und du schlägst so fest du kannst an dieser stelle ihres Ballens.<br>\r\nSie entspannte sich immer mehr und spielte mit ihren Zehen während du die Kängurusohle wecksels.<br>\r\n\"Ben das reicht. Danke.\" Damit ist deine restangst verschwunden und du wirst von Roo aprubt hochgehoben.<br>\r\n\"Dafür bekommst du einen Kuss.\" Sie spitzt die Lippen und nähert sich deinem Gesicht.<br>\r\nAber als die Lippen dein Kopf berühren wirst du durch die saugwirkung in ihren Mund gezogen.<br>\r\nDa bleibst du aber nicht lange und wirst sofort wieder ausgespuckt.<br>\r\n\"Also das nenn ich mal einen Kuss.\" fällt dir als einzigstes ein als du wieder auf Roo´s Handfläche bist und fragst:\"</span></div></div>",
            "created":1191560400,
            "id":450857,
            "title":"Eine extreme Fußmassage"
        },
        "141112211":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Na gut .",
                "Ich penn in einem deiner Schuhe."
            ],
            "content":"<div class=\"\"><div> <span>\"Na, da.\" Roo zeigt in die Ecke wo Sie sich ihrer Schuhe entledigt hatte und sagt nurnoch \"Upps!\"<br>\r\n\"Du mußt wohl diese Nacht bei mir im Bett schlafen.\" Ich sah genauer hin und erkannte reste von einem zertrümmerten Bett die unter ihren Schuhen hervorragen.<br>\r\n\"Oder hast du eine andere Idee?\"<br>\r\nDu überlegst kurz und sagst \".....\"</span></div></div>",
            "created":1191560400,
            "id":451652,
            "title":"Upps."
        },
        "1411122111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "in ihr Ohr zu klettern und Sie versuchen so zu wecken.",
                "eine Erkundungstour zu machen."
            ],
            "content":"<div class=\"\"><div> <span>\"Also gut dann machen wir das so.\" sagt Roo und macht sich fertig für die Nacht.<br>\r\n\"Ähm. Dürfte ich wohl bitten. Wir sind hier in keiner Peep-show.\" sofort drehst du dich um und machte dich ebenfalls Bettgängich.<br>\r\nDu hörst das Bett knarzen und drehst dich wieder um und siehst die atraktive Roo hab zugedeckt in Unterwäsche im Bett liegen.<br>\r\n\"Komm her ich helf dir hoch.\" sagt Sie und hält ihre Hand öffen auf deiner höhe.<br>\r\nVorsichtig steigst du aus ihre Hand, die dich auf das Kopfkissen befördert.<br>\r\n\"Gute Nacht, Keiner!\"<br>\r\n\"Gute Nacht, Große!\"<br>\r\nSie dreht sich weg und schläft sofort ein.<br>\r\nDu weisst noch nicht was du von dieserm Internat halten sollst.<br>\r\nAber bisher findes du es hier ganz OK.<br>\r\nPlötzlich hörst du ein lautes Geräusch was sich sofort als Schnarchen herrausstellt.<br>\r\n\"Hey, Roo. Wach auf.\" schreist du ihr endgegen. <br>\r\nAber du bist einfach nicht laut genug.<br>\r\nAlso entscheides du dich dafür  ...</span></div></div>",
            "created":1191560400,
            "id":722371,
            "title":"Gute Nacht"
        },
        "14111221111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "mobilisierst deine Kräfte und kletters wieder raus",
                "wartes bis Sie aufwacht und dich befreit"
            ],
            "content":"<div class=\"\"><div> <span>Das Gescharche geht dir langsam auf den Keks und du gehst auf ihren Nacken zu.<br>\r\nDu kletters auf Ihren Hals und gehst vorsichtig richtung Ohr.<br>\r\nAls du an der Ohrmuschel ankommst versuchst du es nochmal.<br>\r\n\"Roo, du schnarchst.\" schreist du ihr direkt in den Gehörgang.<br>\r\nAber Roo schlägt nach dir als ob du eine Fliege währst.<br>\r\nDas hat zufolge das du stolperst und in die Ohrmuschel rutscht.<br>\r\nPanisch versuchst du halt zu finden.<br>\r\nAber unaufhaltsam gleites du mit den Füßen voran in Roos Gehörgang.<br>\r\nRoo lässt sich davon nicht stören und schläft weiter.<br>\r\nDu steckst gute 3 meter in ihrm Gehörgang, kurz vor ihrem Trommelfell und kommst kaum voran.<br>\r\nDu ........</span></div></div>",
            "created":1191733200,
            "id":724249,
            "title":"Im Ohr."
        },
        "141112211111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Du schläfst bist zum morgen.",
                "Du wirst von Roo eingeatmet."
            ],
            "content":"<div class=\"\"><div> <span>Du nimmst deine letzten Kräfte und schafst es endlich raus.<br>\r\nRoo hat inzwischen aufgehört zu schnarchen und atmet ruhig durch die Nase.<br>\r\n(Dann leg ich mich wieder hin) denkst du dir und gehst vorsichtig über Ihre Schnautze und springst auf das Kopfkissen.<br>\r\nDer Luftstrom aus Roos Nasenlöcher wärmt dich angenehm und lässt dich beruhigend einschlafen.</span></div></div>",
            "created":1248843600,
            "id":734179,
            "title":"Weiter schlafen"
        },
        "1411122111112":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "schluckt. (Magen)",
                "einatmet. (Lungen)"
            ],
            "content":"<div class=\"\"><div> <span>Plötzlich wirst du aus dem Schlaf gerissen und bemerkst das Roo kräftig einatmet.<br>\r\nUngebremst saugt dich der Luftstrom ein und lässt dir keine Cance um nach Hilfe zu rufen.<br>\r\nAuf einmal bleibst du im schnodder stecken und willst um hilfe rufen als Roo nochmal tief einatmet.<br>\r\nDu weisst nur das du grade noch in Roos Nasenhöhle warst als der Luftstrom dich weiter hinein zieht.<br>\r\n(Na toll. Ich stecke vor Roos Rachenklappe.) denkst du als Roo plötzlich ......</span></div></div>",
            "created":1249534800,
            "id":739789,
            "title":"Du wirst von Roo eingeatmet."
        },
        "14111221112":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "ob du in einem Ihrer Schuhe schlafen möchtes",
                "was da Draussen wohl um diese Zeit abgeht"
            ],
            "content":"<div class=\"\"><div> <span>Du hälst das Gescharche nicht mehr aus und suchst eine Moglichkeit vom 10 meter hohen Bett runter zu kommen.<br>\r\nDir fällt sofort Roos Schwanz in die Augen der an der Bettkante runterbaumelt.<br>\r\nSofort kletters du an dem langen Känguruschwanz runter und bemerkst wie Sie sich beim Rumdrehen den Schwanz hochzieht.<br>\r\nAber du warst schneller und kommst grade noch auf den Boden.<br>\r\nDann bemerkst du das Roo ihr Schnarchen eingestellt hat und nurnoch ruhig atmet.<br>\r\nDu überlegst .......</span></div></div>",
            "created":1191733200,
            "id":451664,
            "title":"Festen Boden unter den Füßen"
        },
        "141112211121":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Du wirst von Roo nicht bemerkt und in dem Schuh eingesperrt.",
                "Du wachst vor Roo auf und kletters wieder raus."
            ],
            "content":"<div class=\"\"><div> <span>Da Roo endlich mit dem Krach aufgehört hat suchst du einen weg zurück aufs Bett.<br>\r\nAber du findes nichts woran du hochkletter könntes.<br>\r\nNach reiflicher überlegung gehst du in die Ecke, wo mal dein Bett stand, und kletters in einen der riesigen Schuhe.<br>\r\nDer Scheißgeruch ist immernoch vorhanden und das Innere ist noch gut aufgewärmt.<br>\r\nLangsam krichst du in die vorderste Stelle wo sich normalerweise Roos Zehen aufhalten und kuschels dich an der Sohle ein.</span></div></div>",
            "created":1191733200,
            "id":451671,
            "title":"Gemütlich"
        },
        "1411122111211":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Roo geht in den Sportunterricht",
                "Roo geht in den Unterricht."
            ],
            "content":"<div class=\"\"><div> <span>\"Scheiße. Keine Socken mehr da. Dann muß ich heute ohne Socken auskommen.\" dieser Satz weckt dich unsanft aus dem Schlaf und lassen dich aufschrecken.<br>\r\nEs gibt einen Ruck der dich hinwirft.<br>\r\nDu siehst wie dein Ausgang verschlossen wird und Roos riesiger Fuß verdichtet deine bewegungsfreiheit.<br>\r\n\"Roo, nicht ich bin hier drinnen.\" aber deine Rufe bleiben ungehört.<br>\r\n\"Ben, wo bist du? Ach der taucht schon wieder auf.\" sagt Roo und geht dann los.<br>\r\nJeder ihrer Schritte ist für dich eine tortur.<br>\r\nImmerhin bist du in einen riesigen Schuh und wirst von ihren Zehen fast zerdrückt.<br>\r\n</span></div></div>",
            "created":1191906000,
            "id":503755,
            "title":"Gefangen"
        },
        "1411122111212":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "hörst du Schritte. (Roo kommt ins Bad)",
                "bemerkst du ein Waschbecken (für deine größe) in der Seifenschale."
            ],
            "content":"<div class=\"\"><div> <span>Du reibst dir den Schlaf aus den Augen und bemerkst diesen intensiven Schweißgeruch.<br>\r\n\"Ach ja. Ich bin in einem Schuh.\" sagst du zu dir.<br>\r\nLangsam kriechst du aus den riesigen Sportschuh und schaust dich erstmal um.<br>\r\nRoo schläft immer noch und schnarcht wieder.<br>\r\nErstmal willst du den Schweißgeruch von dir abbekommen und gehst zur Türe mit der aufschrift WC.<br>\r\nZu deinem Glück ist hier eine kleinere Türe eingelassen, die du ohne Probleme öffnen kannst.<br>\r\n\"Und wo soll ich mich waschen?\" fragst du dich als du erkennst das alles auf die Größe deiner Mitbewohnerin abgestimmt ist.<br>\r\nDir ist nur eine Strickleiter aufgefallen die vom Waschbecken runterhängt.<br>\r\n(Na toll. Morgensport.) denkst du dir als du dich an die Strickleiter begibst.<br>\r\nNachdem du endlich oben angekommen bist ...........</span></div></div>",
            "created":1247202000,
            "id":722367,
            "title":"Der erste Morgen"
        },
        "14111221112121":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "sieht dich.",
                "sieht dich nicht. (Du hast dich versteckt)"
            ],
            "content":"<div class=\"\"><div> <span>Die Türe öffnet sich und Roo kommt mit verschlafenen Blick rein.<br>\r\nOhne einen blick auf dich zu werfen geht Sie zum Klo und zieht ihre Unterhose runter.<br>\r\nSicherheitshalber sagst du nichts und schaust weg während Roo ihren Intimbereich freilegt.<br>\r\n\"Mmmmmmhh.\" hörst du aus Roo´s Richtung und drehst dich wieder um.<br>\r\nSie sitzt auf der Kloschüssel und scheint zu kacken.<br>\r\nDann hörst du ein Ohrenbetäubenden Lärm aus der Schüssel.<br>\r\nPpppppfffffffffffffff mit einem anschließenden platschen.<br>\r\nEin unerträglicher Gestank erfühlt den Raum.<br>\r\n\"Ahh. tut das gut.\" sagt Roo und greift nach dem Klopapier.<br>\r\nSie wischt sich ihr Arschloch sauber und steht auf ohne ihre Unterhose wieder hoch zu ziehen.<br>\r\nStatt dessen zieht Sie sich noch ihr Hemd aus und wirft beides in einen Wäschenkorb.<br>\r\nSie dreht sich zum Waschbecken und ............ </span></div></div>",
            "created":1247202000,
            "id":722385,
            "title":"Roo's morgenliches Ritual"
        },
        "141112211121211":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Sauber und fertig für den Tag.",
                "Roo hat probleme mit der Mundhygiene."
            ],
            "content":"<div class=\"\"><div> <span>\"AAAh\" schreit Roo als Sie dich bemerkt und verdeckt ihren Intimbereich mit ihren Händen ab.<br>\r\n\"Entschuldigung.\" kommt als ein zigstes aus deinem Mund und du drehst dich um.<br>\r\n\"Du musst dich nicht Entschuldigen. Ich hab mich nur erschrocken.\" sagst Sie mit einer erleichternder Stimme.<br>\r\n\"Ich hatte völlig vergessen das ich seit gesten dich als Mitbewohner hab.\" hangt Sie noch an ihren Satz.<br>\r\n\"Da du mich schon Nackt gesehen hast macht es auch nichts mehr. Du darfst dich umdrehen.\"<br>\r\n\"Es tut mir trotzdem leit.\" sagst du noch als du dich wieder umdrehst.<br>\r\n\"Was treibt dich um sechs Uhr in der früh schon ins Bad?\" fragt Sie dich und beugt sich zu dir runter.<br>\r\n\"Ich wollte mich Waschen. Aber alles ist zu groß für mich.\" antwortest du dem Kängurumädchen.<br>\r\n\"Kein Problem. Zieh dich aus.\" sagt Sie und lässt Wasser ins Waschbecken.<br>\r\nOhne Schamgefühl ziehst du dich aus und steigst in das lau warme Wasser.<br>\r\nWährend du dich im Waschbecken wäscht, nimmt Roo ihre Zahnbürste und putzt sich die Zähne.</span></div></div>",
            "created":1247202000,
            "id":722405,
            "title":"Vergessliche Roo"
        },
        "1411122111212111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Roo's Handy klingelt",
                "Eine eigenatrtige art zu frühstücken"
            ],
            "content":"<div class=\"\"><div> <span>Roo nimmt einen schluck Wasser in den Mund und spuckt wie gewohnt ins Waschbecken (auf dich).<br>\r\nDas ausgespuckte Wasser roch angenehm Minzig.<br>\r\n\"Upps. Tut mir Leid, Ben.\"sagt Sie und fischt dich aus dem Spuckwasser.<br>\r\n\"Wir sollten aufhören uns dauernd zu entschuldigen. Sonst sprechen wir über nichts anderes.\" sagst du scherzhaft, worauf Roo kichern muss.<br>\r\n\"Ok. Aber lass mich dich erstmal abtrocknen.\" <br>\r\nVorsichtig lässt Sie dich auf ein Papiertaschentuch fallen und rubbelt dich trocken.<br>\r\nNachdem du Sauber bist geht Roo mit dir in den Wohnbereich und setzt dich auf den Tisch.<br>\r\n\"Wir haben das ganze Wochenende Zeit uns kennen zu lernen. Was sollen wir machen?\" fragt Sie dich.<br>\r\n\"Ähm. Wie währe es wenn wir uns erstmal was anziehen. Nicht das noch jemand reinkommt.\" <br>\r\n\"Nicht notwendig. Die Tür ist abgeschlossen.\"<br>\r\n\"Dann lass uns erstmal Frühstücken.\" schlägst du vor.<br>\r\n\"Ja gut. Warte hier. Ich komm gleich wieder.\" sagt sie und geht in einen Nebenraum.<br>\r\nWährend du auf Sie wartest, bemerkst du erst das nichts (außer dem zerschmetterten Bett und den eingelassenen Türen) für deine Größe ist.<br>\r\nDann kommt Roo mit einem Tablett wieder.<br>\r\nVorsichtig stehlt Sie es vor dich hin und setzt sich auf einen speziellen Stuhl mit einem Loch für ihen kraftvollen Schwanz.</span></div></div>",
            "created":1247202000,
            "id":734845,
            "title":"Samstag"
        },
        "141112211122":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "siest du Roo.",
                "greift dich ein Fluraufsichts-Drache"
            ],
            "content":"<div class=\"\"><div> <span>Du gehst zur großen Zimmertür und bemerkst eine kleinere eingelassende Türe, die für deine größe perfekt zugeschnitten ist.<br>\r\nLangsam öffnes du die Tür und siehst einen leeren endlos langen Flur.<br>\r\nDu bist sehr neugierig was in dem Gebäude noch so alles ist und gehst einfach mal los.<br>\r\nNach einer weile fällt dir ein großer Schatten auf, der dich verfolgt.<br>\r\nAls du dich umdrehst ........</span></div></div>",
            "created":1191733200,
            "id":451674,
            "title":"Der Flur"
        },
        "1411122111221":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "meinen Beutel",
                "meine Socke"
            ],
            "content":"<div class=\"\"><div> <span>\"Wo willst du um diese Zeit noch hin?\" fragt dich Roo mit hochgezogender Augenbraue.<br>\r\n\"Du hast gescharcht. Da konnt ich nicht schlafen.\" antwortes du ihr mit zurückgezogenen Gesicht.<br>\r\n\"Ist mir Igal. Wir kriegen noch Probleme.\" mit dem Satz packt Sie dich und geht schnell zurück in euer Zimmer.<br>\r\n\"Damit du nicht mehr ausbückst nehme ich dich besser in ......</span></div></div>",
            "created":1191733200,
            "id":451678,
            "title":"Zurück aufs Zimmer."
        },
        "14111221112211":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "wirst müde und schläfst ein",
                "durchwühlst den Beutel und machst eine geauenhafte entdeckung"
            ],
            "content":"<div class=\"\"><div> <span>Ohne zu zögern zieht Roo eine Hautfallte auf und lässt dich in ihren Beutel rutschen.<br>\r\nUnsanft landes du in diesem fleischigem Gefängnis und hörst Roo sagen:\"Ich lasse dich Morgenfrüh auch wieder raus.\"<br>\r\nDarauf spürst du wie sich der ganze Beutel dreht und du unter einigen Schulsachen begraben wirst.<br>\r\nEs ist sehr warm hier drinnen und ein sanfter Herzschlag beruhigt dich etwas.<br>\r\nDu .......</span></div></div>",
            "created":1191733200,
            "id":451682,
            "title":"Im Beutel"
        },
        "141112211122111":{
            "author_id":"conelskie",
            "author_name":"conel",
            "choices":[
                "...kämpfst dich aus dem Buch und kletterst aus dem Beutel. ",
                "...befreist dich aus dem Buch und versuchst wieder einzuschlafen."
            ],
            "content":"<div class=\"\"><div> <span>Als du wieder aufwachst wunderst du dich wo du bist, erinnerst dich aber schnell. Gefangen im Beutel eines 30-Meter großen Kängurus Namens Roo. Nun ja, gefangen war ein bischen übertrieben immerhin hatte sie gesagt das sie dich wieder aus dem Beutel lassen würde.<br>\r\nHoffentlich.<br>\r\nRoo schien noch zu schlafen, hin und wieder drehte sie sich und der gesamte Inhalt in ihrem Beutel (der auch noch auf ihre Größe gefertigt war) schlug immer wieder über dich zusammen. Gerade als du dich wieder aus einem riesigem Buch herusgekämpft hast, kommt dir der Gedanke aus diesem Beutel herauszuklettern ehe von einem riesigen MP3-Player erschlagen zu werden. Andererseits willst du nicht Roo womöglicherweise verärgern, da ein 30-Meter großes Tier nicht zu unterschätzen war...<br>\r\nWährend du nachdenkst dreht sich deine Zimmergenossin wieder und das verdammte Buch fällt abermals auf dich drauf und du...</span></div></div>",
            "created":1191992400,
            "id":452456,
            "title":"Gefangen im Beutel"
        },
        "1411122111221112":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Roo will eine Minze und erwischt dich.",
                "Roo durchsucht ihren Beutel und räumt ihn aus."
            ],
            "content":"<div class=\"\"><div> <span>Roo dreht sich nochmal um und befreit dich von ihrem Buch.<br>\r\nDas kann nicht so weiter gehen und du suchst dir einen geeigneteren Schlafplatz.<br>\r\nSofort fällt dir eine riesige Dose auf die leicht geöffnet ist.<br>\r\nOhne zu zögern kletters du über ihren Beutelinhalt und springst in die Dose.<br>\r\nKurz nachdem du in die Dose springst dreht Roo sich auf ihren Bauch (und somit auf ihren Beutel) und verschliesst den Deckel.<br>\r\nDu konntes nicht mehr erkennen was in der Dose ist, aber der Geruch von Minze lässt dich nur vermuten, das hier Minz-Bonbons sind.<br>\r\nAber das ist dir erstmal igal und du schläfst beruhigt ein.<br>\r\nPlötzlich wirst du durch Roos aufrechte haltung gewäckt.<br>\r\n</span></div></div>",
            "created":1192078800,
            "id":452670,
            "title":"Ein ruhiger Ort"
        },
        "14111221112211121":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Sie Schluckt dich runter",
                "Sie spuckt dich aus"
            ],
            "content":"<div class=\"\"><div> <span>Es gab einen kräftigen Ruck und du spührst wie die Dose sich dreht.<br>\r\nEin ploppen bestätigte das öffnen der Dose und grelles Licht blendet dich.<br>\r\nPlötzlich dreht sich der ganze Raum und du rutscht raus.<br>\r\nAls du ins Freie rutschst siehst du Roos offen stehenden Mund.<br>\r\n\"NEIN ROO.\" schreist du, aber Sie hört dich nicht.<br>\r\nSchutzlos fällst du in ihr riesiges Maul und landes auf ihrer roten Zunge.<br>\r\nDu schafst es nicht einmal um hilfe zu rufen, da schliesst sich das Maul hinter dir.<br>\r\n\"ROO, ICH BIN IN DEINEM MUND.\" schreisst du erneut.<br>\r\nAber Sie scheint abgelenkt zu sein.<br>\r\nDu kannst nur von Glück sprechen das Roo dich wie ein Bonbon lutscht und nicht zubeißt.<br>\r\nSie schmeckt dich besonders gut ab, bis Sie \"Hey Erin, die Minze die du mir gegeben hast schmeckt interessant.\" sagt.<br>\r\n</span></div></div>",
            "created":1192078800,
            "id":452809,
            "title":"In Ihrem Mund"
        },
        "141112211122111212":{
            "author_id":"conelskie",
            "author_name":"conel",
            "choices":[
                "...in der Schulkantine seid.",
                "...noch in eurem Zimmer seid."
            ],
            "content":"<div class=\"\"><div> <span>Du schreist und schreist, während ihre Zunge dich hin und her durch ihren Mund bewegt. Immer und immer wieder schleckt ihre Zunge über dich, oder du liegst auf dieser und versuchst nicht durch die Schleck-Bewegen in Roo's rachen zu gleiten.<br>\r\n<br>\r\nNach einigen Minuten öffnet sich vor dir ihr Maul, ihre Zunge bewegt sich schneller als sonst, und du hörst Roo sagen: \"Hm...schmeckt irgendwie nicht wirklich wie 'ne Minze...\" Dann spürst du wie sie erschrocken die Luft einzieht. <br>\r\nWieder öffnet sich ihr Maul und sie spuckt dich auf ihre offene rechte Hand aus.<br>\r\nDu landest auf etwas hart (und komplett durchnässt von ihrem Speichel) in diese.<br>\r\n\"Oh Gott! Alles in Ordnung Kleiner?\" hörst die Roo entsetzt fragen.<br>\r\n\"ALLES IN ORDNUNG?!\" brüllst du sie wütend an. \"Du hättest mich fast gefressen!\"<br>\r\n\"Woher sollte ich wissen das du hier drin bist?!\" verteidigte Roo sich und hob mit der linken die Dose, auf der das Logo einer bekannten Minze-Firma stand.<br>\r\nDu blickst zu ihr auf. Roo trug ein bauchfreies, schwarzes T-Shirt mit dem Logo einer dir unbekannten Band von Anthro's und eine blaue Jeans, eng anliegende Jeans.<br>\r\nVon Roo's Speichel durchnässt und nur in Shorts drehst du dich auf der Stelle und schaust dich um, bemerkst dabei das ihr...<br>\r\n</span></div></div>",
            "created":1198040400,
            "id":477313,
            "title":"Glück gehabt!"
        },
        "14111221112211122":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Eine Menschenklasse",
                "Eine Mixklasse (Anthros/Menschen)"
            ],
            "content":"<div class=\"\"><div> <span>\"Ben, wo bist du?\" fragt Roo in ihren Beutel und nimmt ein Teil nach dem anderen raus.<br>\r\nMit einem kräftigen Schlag öffnes du den Deckel der Dose und fällst auf Roo´s Hand.<br>\r\n\"Morgen Schlafmutze. Wie hast du geschlafen?\" fragt Sie dich und hebt dich auf Augenhöhe.<br>\r\n\"Naja, es ging so. Du hast dich die ganze zeit bewegt und mich durch deinen Beutel geschleudert.\" antwortes du ihr und reibst dir den Schlaf aus den Augen.<br>\r\n\"Das tut mir aber leid. Ich besorge dir heute noch ein eigenes Bett.\" verspricht Sie dir und setzt dich auf den Boden.<br>\r\nSofort machst du dich fertig und guckst auf den Lehrplan.<br>\r\n\"Roo, weißt du wo der Raum 101 ist?\" fragst du.<br>\r\n\"Ja, ich bring dich hin.\" sagt Sie und pack dich vorsichtig zwischen Daumen und Zeigefinger.<br>\r\nAbrupt geht Sie mit dir los und setzt dich vor Zimmer 101 ab.<br>\r\n\"Danke.\" sagst du und gehst rein.</span></div></div>",
            "created":1247461200,
            "id":724263,
            "title":"Unterrichts beginn"
        },
        "141112211122111221":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Biologie",
                "mehr auswahl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Was für eine Unterrichsstunde?</span></div></span></div>",
            "created":1247461200,
            "id":724265,
            "title":"Entscheidung"
        },
        "1411122111221112211":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Ein weiblicher Hund (80 meter groß)",
                "mehr auswahl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Lehrerwahl<br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/2455177/\" target=\"_blank\">http://www.furaffinity.net/view/2455177/...</a><br>\r\n<a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/2513145\" target=\"_blank\">http://www.furaffinity.net/view/2513145</a><br>\r\n<a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/1015823/\" target=\"_blank\">http://www.furaffinity.net/view/1015823/...</a></span></div></span></div>",
            "created":1247547600,
            "id":732796,
            "title":"Entscheidung"
        },
        "14111221112211122112":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "männlicher Husky (100 meter)",
                "mehr auswahl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Oder ein <br>\r\n<br>\r\n<a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/468926/\" target=\"_blank\">http://www.furaffinity.net/view/468926/</a></span></div></span></div>",
            "created":1247720400,
            "id":726413,
            "title":"mehr auswahl"
        },
        "141112211122111221121":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "den Anthrologieschen Körper vor.",
                "mehr auswahl"
            ],
            "content":"<div class=\"\"><div> <span>Als du durch die (in einer größeren Tür eingelassen) Tür (mit deinen 10 Menschlichen Schulkameraden) gehst siehst du einen riesigen Raum voll mit übergroßen Tischen und Stühlen.<br>\r\nAm vordersten Tisch ist eine Leiter angebracht der mit einer extra Menschengröße angefertigten Sitzreihe bestückt ist.<br>\r\n\"Oh man. Ist das Riesig.\" sagt ein Mädchen hinter dir.<br>\r\nDu ignorierst Sie und setzt dich schnell in die Mitte der Sitzgelegenheit.<br>\r\nAls sich alle hingesetzt haben, öffnet sich die großer Tür und ein riesiger Husky mit hellgrauen Fell und einer Aktentasche kommt ins Zimmer.<br>\r\n\"Guten Tag, Schüler. Mein name ist Herr Balto und heute werde ich Ihnen die Biologielehre näher bringen.\" sagt er und setzt sich an sein Lehrerpult.<br>\r\n\"Ihr werdet Festsellen das hier keine Unterrichsstunden, sondern ganze Unterrichstage eingeführt wurden. Naja, ab und zu auch mal eine Woche.\" erwänt er noch zum schluss und nimmt ein großes Buch in die Hand (Pfote).<br>\r\n\"Erstmal die Anwesenheit. Peter Ackermann. Ben Damm. Katarina Dick. Florentina Eberlein. Benjamin Falk. Stefanie Klein. Alexander Maier. Anna Neumann. Sven und Svenja Wolf. Seit ihr Verwandt?\" fragt er, worauf beide still nicken.<br>\r\n\"Also gut dann sind ja alle da. Heute nehmen wir uns .......\"<br>\r\n</span></div></div>",
            "created":1247720400,
            "id":726435,
            "title":"Herr Balto"
        },
        "1411122111221112211211":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Ihr unterhaltet euch uber die eigenartigen Unterrichsmetoden",
                "Ihr lehrnt fleißig"
            ],
            "content":"<div class=\"\"><div> <span>Mit einem leichten lächeln steht euer Lehrer auf und zieht seine Sachen aus, bis er nackt vor euch steht.<br>\r\n\"Fangen wir an. Dies ist das männliche Glied.\" sagt er und holt das mächtige Gehänge aus seiner Vorhaut.<br>\r\nIhr zuckt schreckhaft zurück als sein 8 meter langer Penis vor uns auf den Tisch fällt und die Luft mit einem moschusartigen Geruch umgibt.<br>\r\n\"Keine Angst.\" versuch er euch zu beruhigen. \"Also, wie gesagt: dies ist das männlich Glied. Es ist bei allen männlichen Anthro's in einem Penis-Sack den man Vorhaut nennt. Wenn das Männchen erregt ist wird der Penis größer und aus seinem Sack gedrückt.\" erklärt herr Balto und grinst euch freundlich an.<br>\r\n\"Hat wer eine Frage? Niemand, gut. Dann steht alle auf und zieht euch aus.\" sagt er zu euch.<br>\r\n\"Ähm..... . Wieso sollen wir uns ausziehen?\" fragt Peter.<br>\r\n\"Damit ihr eure Sachen nicht einsaut. Ihr werdet alle meinen Penis und den Penis-Sack studieren, während des Tages.\" antwortet er und zieht sein Penis zurück unter die Vorhaut.<br>\r\nIhr zieht euch mit einem unguten Gefühl aus und stopft eure Sachen in eure Schultaschen.<br>\r\n\"Gebt mir eure Taschen. Ich beware sie für euch auf.\" sagt herr Balto und öffnet seine Hand(Pfote) vor euch.<br>\r\nNachdem er eure Taschen in seinen Aktenkoffer gelegt hat, kert er zurück mit kleinen Taschenlampen zurück und legt sie vor euch hin.<br>\r\n\"Keine Angst. Es ist ein bischen eng da drinnen aber solange ihr da drinnrn seit werde ich mich bemühen euch nicht weh zu tun. Jetzt nimmt sich jeder eine Taschenlampe in da kann es los gehen.\" <br>\r\nEr geht ganz dich an den Tisch und zieht mit seinen Fingern seine Vorhaut auf.<br>\r\nWährend er sich so positioniert, bekommt es Peter mit der Angst zu tun und versuchst abzuhauen.<br>\r\nAber herr Balto schneidet ihm den Fluchtweg ab und nimmt ihn Vorsichtig hoch.<br>\r\n\"Das verschlechtert nur deine Note.\" sagt herr Balto und setzt ihn direkt in seinen Penis-Sack.<br>\r\nIhr anderen nehmt euren Mut zusammen und klettert einzelnt in herr Balto's Genital-Sack.<br>\r\n\"Also nehmt alles unter die Lupe und für Fragen bin ich immer offen.\" mit beendigung des Satzes schliesst sich hinter euch die Vorhaut und hüllt euch in die dunkele Kammer.</span></div></div>",
            "created":1247720400,
            "id":732809,
            "title":"Der Genitalbeteich."
        },
        "14111221112211122112111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Herr Balto hat alles mitbekommen und Hilft.",
                "Herr Balto hat nichts mitbekommen."
            ],
            "content":"<div class=\"\"><div> <span>Herr Balto zieht sich wieder an und kratzt sich unbewusst im Schritt.<br>\r\nIhr werdet zimlich schmerzhaft gegen sein Glied gedrückt und müsst euch aus einer kleinen Hautfalte befreien.<br>\r\nAls ihr endlich sicher sitzt, bemerkt ihr diese rhythmischen Bewegungen.<br>\r\nHerr Balto geht ins Lehrerzimmer und setzt sich auf seinen Platz und relaxt.<br>\r\n\"Diese Wesen müssen einen Dachschaden haben. Mit Lebewesen so umzugehen.\" sagt Peter und klettert richtung Ausgang.<br>\r\n\"Hey warte. Ich komme mit.\" sagt erst einer bis sich nach und nach alle andern dem anschliessen(Ausser Du).<br>\r\nDu schausst nur zu wie deine neun Klassenkameraden verzweifelnd an der schleimige Wand versuchen hochzuklettern.<br>\r\n\"Wir sitzen hier Fest.\" heult Anna und rennt hoffnungslos richtung Ausgang.<br>\r\n\"Wow.\" sagt Peter als Anna ein ganzes Stück höher gekommen ist und in einer Fallte erstmal sich hinsetzt.<br>\r\nAlle rennen Los und schaffen es bis kurz bis kurz vor dem Ausgang.<br>\r\nDir fällt auf wie der riesige Penis langsam härter wird und willst sie noch warnen, als du plötzlich von dem riesen Organ begraben wirst.<br>\r\nDu kannst nurnoch schreie hören.</span></div></div>",
            "created":1248843600,
            "id":734184,
            "title":"Ihr unterhaltet euch uber die eigenartigen Unte..."
        },
        "1411122111221112211212":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Ja",
                "Nein"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>wie währe es mit dem Verdauungstragt?</span></div></span></div>",
            "created":1249275600,
            "id":737834,
            "title":"mehr auswahl"
        },
        "1411122111221112212":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Ja",
                "Nein"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sportunterricht oder doch nicht?</span></div></span></div>",
            "created":1248843600,
            "id":734195,
            "title":"Sportunterricht"
        },
        "14111221112211122121":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Ja ",
                "Vieleicht was anderes"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Drei in einem <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/1460497/\" target=\"_blank\">http://www.furaffinity.net/view/1460497/...</a></span></div></span></div>",
            "created":1248843600,
            "id":734198,
            "title":"Lehrerwahl"
        },
        "14111221112211122122":{
            "author_id":"emeralwizard",
            "author_name":"lord of emeralds",
            "choices":[
                "Ja",
                "Nein"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Wie wärs mit Chemie ?</span></div></span></div>",
            "created":1269358620,
            "id":855456,
            "title":"Chemie"
        },
        "141112211122111221221":{
            "author_id":"emeralwizard",
            "author_name":"lord of emeralds",
            "choices":[
                "Nicht-Anthro",
                "Anthro"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Welche art von lehrer</span></div></span></div>",
            "created":1269360720,
            "id":855461,
            "title":"Entscheidung"
        },
        "1411122111221112212211":{
            "author_id":"emeralwizard",
            "author_name":"lord of emeralds",
            "choices":[
                "der nun 80m große Direktor",
                "ein ganz normaler Mensch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Wer genau ?</span></div></span></div>",
            "created":1269360900,
            "id":855463,
            "title":"Entscheidung"
        },
        "14111221112211122122111":{
            "author_id":"emeralwizard",
            "author_name":"lord of emeralds",
            "choices":[
                "Ja",
                "Nein"
            ],
            "content":"<div class=\"\"><div> <span>Als du und deine Schulkameraden den Raum betreten habt seht ihr nur riesige Tische und Reagenzgläser. \"Kommt vor und setzt euch.\"hört ihr von vorn und seht an einem der vordersten Tische eine Leiter. Ihr klettert hoch und setzt euch, vor euch steht der Direktor nur ist er viel größer als ihr ihn in Erinnerung habt. \"Ich bin Gestaltwandler\"sagt er mit einem Blick in eure erstaunten Gesichter \"hat noch jemand Fragen?\" </span></div></div>",
            "created":1269362280,
            "id":855468,
            "title":"große Überraschung"
        },
        "141112211122111221221111":{
            "author_id":"emeralwizard",
            "author_name":"lord of emeralds",
            "choices":[
                "Säuren und Basen",
                "Das Element Radium"
            ],
            "content":"<div class=\"\"><div> <span>\"Ja, ich hab eine\" meldet sich ein Junge neben dir. \"Was ist das hier für eine Einrichtung ?\" \"Dieses Internat dient der Integration von Anthros.\"erklärt der Rektor mit einer ausschweifenden Geste. \"Dann wollen  wir mal zum Unterricht kommen heute behandeln wir...\"</span></div></div>",
            "created":1269449340,
            "id":856048,
            "title":"Was ist das hier ?"
        },
        "14111221112212":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Du schläfst ein",
                "Du kannst nicht schlafen und versuchst zu flüchten"
            ],
            "content":"<div class=\"\"><div> <span>Ohne zu zögern lässt Sie dich einige Meter in die tiefe fallen.<br>\r\nZum glück landes du weich in einer ihrer Sportsocken die noch leich feucht sind und nach ihren Füßen riecht.<br>\r\n\"Und damit du nicht auf dumme Gedanken kommst.\" sagt Roo und zieht sich ihre Socke mit dir drinnen über ihren stark verschwitzten Fuß.<br>\r\nDu liegst äusserst ungünstig zwischen ihren Zehen und bemerkst nur wie Sie sich hinlegt.<br>\r\n\"Du wolltes ja unbedingt ärger machen. Das hast du jetzt davon. Schlaf jetzt.\" sagt Roo leicht erzürnt und lässt dir ein wenig platz zum hinlegen.</span></div></div>",
            "created":1191819600,
            "id":451761,
            "title":"Riesige Socken und riesige Füße"
        },
        "14111222":{
            "author_id":"yarrek",
            "author_name":"yarrek",
            "choices":[
                "\"Willst du mit mir ein bisschen das Internat erkunden?\"",
                "\"Könntest du mir mal kurz bei was helfen?\""
            ],
            "content":"<div class=\"\"><div> <span>\"Willst du dich nicht einrichten?\"<br>\r\n\"Öhm...klar...wo?\" fragst du, immernoch etwas verwundert über dieses seltsame Internat. \"Da hinten...\" antwortete Roo freundlich, und deutete in eine Ecke des Raumes, in der ein Bett, Schrank und Tisch mit zwei Stühlen standen, alles deiner Größe angepasst. Roo's Schuhe hatten nur knapp deine zukünftige Bleibe verfehlt und lagen ganz in der nähe. Du zuckst mit den Schultern, und eilst zu dem kleinen Schrank um deinen ganzen Kram aus deinem Rucksack in den Schrank zu räumen.<br>\r\nRoo hatte sich neben dir auf den Bauch gelegt und sah dir beim auspacken zu. Ihr unterhaltet euch ein bisschen, und seid kurz darauf schon gute Freunde. Deine Zimmergenossin hatte lange, dunkelbraune Haare, war freundlich, sehr neugierig und etwas keck. Außerdem sah sie verdammt gut aus und trug passend dazu sommerliche Klamotten.<br>\r\nAls du fertig mit einräumen bist, fragt dich Roo...</span></div></div>",
            "created":1200459600,
            "id":487691,
            "title":"Schnelle Freundschaft"
        },
        "141112222":{
            "author_id":"yarrek",
            "author_name":"yarrek",
            "choices":[
                "... so etwas wie eine Nuss steckte zwischen zwei Zähnen.",
                "... das Roo gelogen hatte, da steckte gar nichts! (Nicht gut...)"
            ],
            "content":"<div class=\"\"><div> <span>Sie stellte die Frage mit einem unwiderstehlichem Lächeln. \"Gerne, bei was denn?\" Roo's lächeln wurde etwas unsicher als sie sagte \"Also, ich nehms dir nicht übel wenn du nein sagen würdest... würde zumindest ich sagen wenn ich an deiner Stelle wäre... Ähm...Ich hab hinten zwischen den Backenzähnen irgendetwas stecken, und ich kriegs einfach nicht raus, und da du ja so klein bist...könntest du da vielleicht in meinen Mund klettern und mal nachschauen?\" Sie sieht dich immer noch mit ihrem zaghaftem Lächeln an, ihr Blick hatte jetzt etwas bittendes. <br>\r\nDu schaust sie nur entgeistert an. In ihr Maul klettern?! Ihr kennt euch erst seit einer Stunde, und dann gleich so was? Kannst du ihr trauen? Andererseits- warum sollte Roo dich fressen wollen? Kängurus waren ja immerhin Pflanzenfresser...hoffentlich...<br>\r\nImmer noch etwas verwirrt antwortest du langsam \"... Ok...\" Das Känguru-Mädchen sieht dich erleichter und glücklich an \"Wirklich?! Danke! Vielen Dank, du bist ein Schatz! Endlich werd' ich dieses Ding los was da drin steckt!<br>\r\nÄhm... vielleicht solltest du nicht unbedingt mit deinen besten Klamotten in meinen Mund steigen- Speichel und so, du verstehst?\" Du nickst und ziehst deine Schuhe, Strümpfe, Hose und dein Sweatshirt aus. \"Bereit?\" fragte Roo etwas nervös, worauf du einfach nur nickst. Du kannst es immer noch nicht fassen was du gleich machen wirst. <br>\r\n<br>\r\n\"Ok Kleiner. Nochmals Danke!\" Roo zwinkerte dir noch einmal zu, dann öffnete sie ihr großes Maul und rollte ihre Zunge dir bis fast zu den Füßen aus.<br>\r\nIhr heißer Atem schlägt dir ins Gesicht als du auf die weiche, rosa Zunge steigst. Ein unvergleichbares Gefühl, denkst du dir, als du barfuß auf ihrer Zunge stehst. Behutsam gehst du immer weiter über die Zunge in Roo's Maul hinein, vorbei an den großen mächtigen Zähnen. Ein ums andere mal rutscht du auf dem weichen, feuchten Untergrund aus und fällst der lange nach hin, worauf deine Klamotten den Speichel um dir herum aufsaugen. <br>\r\n<br>\r\nAls du endlich bei den Backenzähnen bist fällt dir etwas ein- Roo hatte dir nicht gesagt wo genau das was-auch-immer-Ding zwischen ihren Zähnen steckte. Laut rufst du \"Roo, wo genau bei zwischen Backenzähnen?\" - \"Von dir aus gesehen die linke Reihe, in der Mitte!\" antwortete sie, worauf sich die ganze Zunge hektisch ihn und her, vor und zurück bewegte. Abermals landest du der Länge nach auf dem feuchten Organ wirst aber gleichzeitig auch noch von diesem herumgewirbelt, panisch stellst du fest das du langsam Richtung Rachen rutschst, doch da hörte Roo auch auf zu sprechen. <br>\r\n<br>\r\nOk, nicht mehr Fragen, das war eine schlechte Idee. Nächste mal land ich in ihrem Magen, denkst du dir als du dich wieder aufgerappelt hast und zu den besagten linken Zähnen vorkämpfst. Nach einer Weile erreichst du die Stelle und siehst...</span></div></div>",
            "created":1203742800,
            "id":503737,
            "title":"Ab ins Maul!"
        },
        "1411122221":{
            "author_id":"yarrek",
            "author_name":"yarrek",
            "choices":[
                "...setzt dich vor den zwei Duschen ab (eine groß, eine klein).",
                "...lächelt plötzlich böse. Anscheinend hatte sie etwas anderes mit dir vor."
            ],
            "content":"<div class=\"\"><div> <span>Zwischen den Backenzähnen steckte etwas, dass aussah wie die Hälfte einer riesigen Erdnuss.<br>\r\nNach ein oder zwei Minuten von klettern, ziehen und ein paar Ausrutschern hast du es geschafft die Nuss heraus zu ziehen. Roo stöhnte erleichtert auf und seufzte dann ein sehr erleichtert klingendes „Gott sei dank ist das Ding endlich draußen.“.<br>\r\nSie umwickelt dich mit ihrer großen agilen Zunge und befördert dich so (zu deiner großen Erleichterung) aus ihrem Maul wieder auf den Zimmerboden.<br>\r\n<br>\r\nDu bist komplett durchnässt von ihrem Speichel und zitterst ein bisschen Aufgrund der Wärmeunterschieds zwischen ihrem Maul und dem Zimmer. Roo sieht dich dankbar aber auch bewundern an.<br>\r\n„Vielen, vielen Dank Ben!“ sagte sie und ihre Lippen verzogen sich zu einem warmen Lächeln als sie fortfuhr „Nicht jeder der so groß wäre wie du wär einfach in Maul geklettert. Danke das du mir vertraut hast.“<br>\r\nIhr Blick wurde plötzlich etwas keck und sie sagte „Und hier ist deine Belohnung...“. Roo spitzte ihre Lippen und küsste dich sanft. Ihre großen, weichen Lippen drückten zärtlich gegen dein Gesicht und ihr Kuss verwarte so lange auf dir um mehr als nur freundschaftlich zu sein, aber entfernte sich jedoch zu schnell um bedeutend mehr zu sein...<br>\r\n<br>\r\nVerwundert (aber auch angenehm überrascht) siehst du in das Gesicht des riesigen Anthro-Kängurus das dir spielerisch zu zwinkerte. Was zur Hölle soll das nun wieder bedeuten?, fragst du dich und murmelst ein verlegendes „Danke.“ Ihr seht euch eine Weile stumm an, Roo's Blick wurde etwas träumerisch...dann hüstelte sie und sah betreten weg. „Du... ähm... solltest dich vielleicht duschen. Macht keinen guten eindruck wenn du mit Speichel verklebten Haare in der Mensa auftauchst...“ – „Wo ist denn das Bad?“ Sie deutete zu der zweiten Tür im Raum, in der eine weitere kleine eingearbeitet war, die auf deine Größe angepasst war. Dir sank ein bisschen das Herz in die Hose als du die Entfernung siehst. Für Roo waren es vielleicht ein paar Schritte, für dich aber eine lange Strecke bis zum Bad. Sie schien deine Gedanken erraten zu haben, da sie aufstand und sagte „Am besten ist es glaub ich wenn ich dich immer zum duschen mitnehme. Für mich sind es ja nur ein paar Schritte aber du würdest eine halbe Ewigkeit brauchen.“ Roo beugte sich vor, umschloss dich mit ihrer felligen Hand und setzte dich auf ihre Schnauze. Zufrieden lächelnd ging Roo so in das Badezimmer, während du alle Mühe hast das Gleichgewicht zu halten.<br>\r\n<br>\r\nIm Bad blieb sie vor einem (für dich riesigen) Spiegel stehen, der über dem Waschbecken hing. Vorsichtig lehnst du dich ein bisschen nach vorn um mehr zu sehen. De erkennst das dort, wo man normalerweise die Seife auf dem Waschbecken lag, eine weiteres viel kleineres Becken samt Spiegel angebracht war, alles für deine Größe angepasst.<br>\r\nDu schaust wieder auf den großen Spiegel. Du siehst dich im Spiegelbild auf Roo’s Schnauze balancieren und betrachtest auch noch ihren sportlichen Oberkörper, der von ihrem engen bauchfreien Top betont wurde. „Na, siehst du etwas was dir gefällt?“, kichert Roo amüsiert worauf du im Gesicht etwas rot anläufst und ausweichend fragst „Ähm... wo ist es jetzt die Dusche?“ Roo...<br>\r\n</span></div></div>",
            "created":1207371600,
            "id":516461,
            "title":"... so etwas wie eine Nuss steckte zwischen zwe..."
        },
        "14112":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "die weiblichen Züge",
                "die Männlichen Züge"
            ],
            "content":"<div class=\"\"><div> <span>\"Was soll die Freakshow hier?\" sagt ein Mädchen in denem Alter.<br>\r\nDu schaust sie leicht grinsend an und sagst:\"Der Zoo hat heute woll den Tag der offenen Tür.\"<br>\r\nDarauf muss sie sich das Lachen verkneifen und schaut dich ebenfalls an.<br>\r\n\"Hi. Mein Name ist Florentina, aber nenn mich Flo.\" sagt sie mit einem unwiderstehlichen Lächeln.<br>\r\n\"Ähm, ich heiße Benjamin, aber alle nennen mich Ben.\" entgegnest du ihr.<br>\r\n\"Oh man. Ich hoffe das diese riesen Viecher so freundlich sind wie sie aussehen.\" sagt Flo und stellt ihre zwei Koffer ab.<br>\r\nEin riesiger (70 Meter große) Wolf schaut auf euch runter und räuspert.<br>\r\n\"Ähm, wer ist hier ein Viechß\" sagt der Wolf.<br>\r\nLeicht verschreckt schaut ihr an diesem Giganten hoch und bemerkt <br>\r\nWeiblich <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/1218924/\" target=\"_blank\">http://www.furaffinity.net/view/1218924/...</a><br>\r\nMännlich <a rel=\"nofollow\" href=\"http://www.furaffinity.net/view/1218907/\" target=\"_blank\">http://www.furaffinity.net/view/1218907/...</a> <a rel=\"nofollow\" href=\"http://download.lavadomefive.com/members/riproarrex/Rocky/RockyCornered.jpg\" target=\"_blank\">http://download.lavadomefive.com/members...</a></span></div></div>",
            "created":1248757200,
            "id":734519,
            "title":"Du unterhälst dich mit einem Menschen."
        },
        "141121":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Ihr schaut euch um. ",
                "Ihr sucht euch ein ruhigen Ort und wartet auf Cassies Rückkehr."
            ],
            "content":"<div class=\"\"><div> <span>\"Ähm. Entschuldigung i...ich hab das nicht so gemeint.\" versucht Flo den riesigen Wolf (stotternd) zu beruhigen und schaut verängstig auf den Boden.<br>\r\n\"Naja. Da will ich nicht gleich so sein.\" sagt der riesige Wolf und hockt sich hin.<br>\r\n\"Üprigens. Ich heisse Cassie und wie soll ich euch nennen?\" sagt sie mit einem breiten Grinsen.<br>\r\n\"Ich heisse Ben und das ist Flo.\"antwortes du schnell und gehst ein großen Schritt zurück, aus Angst vor ihren Zähnen.<br>\r\n\"Na wenn ihr euch schon kennt, werdet ihr Zwei bei mir einziehen.\" sagt Cassie und setzt ihre riesige Hand(Pfote) neben euch.<br>\r\n\"Jetzt kommt schon. Ich hab nicht den ganzen Tag Zeit.\" sagt Sie und nimmt mit ihrer anderen Hand (Pfote eure Koffer.<br>\r\nSchnell (aber Vorsichtig) klettert ihr auf ihre Handfläche und setzt euch zwischen ihre Handballen.<br>\r\nSofort steht Cassie auf und geht in das Gebäude.<br>\r\n\"Ihr werdet euch bei mir wohl fühlen.\" sagt Cassie und öffnet eine weitere Tür wo ihr ein Bett, eine Essecke, ein Schreibtisch und eine Küche (alles in Cassies größe) stehen seht.<br>\r\n\"Also, das ist euer neues Zimmer.\" sagt Sie und setzt euch auf den Boden.<br>\r\n\"Ich muss jetzt weg. Ich treff mich noch mit Jemandem. Macht es euch so lange Gemüdlich\" sagt Cassie noch bevor Sie hinter euch die Tür zu zieht.<br>\r\n</span></div></div>",
            "created":1248757200,
            "id":734018,
            "title":"Cassie"
        },
        "1411212":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Cassy hat euch vergessen.",
                "Cassy setzt sich zu euch und unterhält sich mit euch."
            ],
            "content":"<div class=\"\"><div> <span>\"Ich fühl mich wie in einem schlechten Si-Fi-Film.\" sagt Flo und geht ein paar Schritte ins Zimmer.<br>\r\n\"Als ob man geschrumpft wurde.\" entgegnes du Flo und folgst Ihr.<br>\r\n\"Hey guck mal da hängt ein etwas am Bett runter.\" sagt Sie und zeigt auf eine Jeans.<br>\r\n\"Lass uns aufs Bett klettern.\" befahl Flo schon fasst und klettert an dem Beinteil der Jeans hoch.<br>\r\nDir fällt nichts besseres ein und kletters ihr hinterher.<br>\r\nOben angekommen bemerkt ihr ein Wäschechaos und du fragst:\"Und was jetzt?\" <br>\r\n\"Ich hatte vor auf Cassys Kopfkissen zu warten bis sie wiederkommt.\" antwortet Sie dir und klettert über den Wäscheberg.<br>\r\n(Naja. Besser als hier rumzustehen) sagst du dir und folgst ihr.<br>\r\nDir kommen Gerüche in die Nase die du noch nie in so einer starken Form wahrgenommen hast und geniesst es eigenartigerweise.<br>\r\n\"Kommen dir die Gerüche auch so fastzinierend schön vor wie mir?\" fragst du Flo.<br>\r\n\"Wo du es ansprichst. Irgendwie schon.\" antwortet sie dir und setzt sich auf das riesige Kissen.<br>\r\nDu setzt dich dazu und ihr unterhaltet euch noch etwa eine Stunde.<br>\r\n\"Ich finde Cassy irgendwie nett.\" sagt Flo als dann die Tür auf geht und Cassy reinkommt.</span></div></div>",
            "created":1248757200,
            "id":734061,
            "title":"Ben und Flo im Zimmer eines Riesen."
        },
        "1412":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "durch die Hintertür zu gehen",
                "den Garten zu erforschen",
                "in den Wald zu gehen"
            ],
            "content":"<div class=\"\"><div> <span>Du wurdes noch nicht endeckt und die Ansprache scheint alle zu langweilen.<br>\r\nNur das Gebäude sieht Interessant aus und du schleichst dich weg.<br>\r\nAls du um die Ecke gehst siehst du eine Hintertür, einen riesigen Garten und einen Weg in den da hinter liegenden Wald. Du entscheides dich ......</span></div></div>",
            "created":1193461200,
            "id":457289,
            "title":"Eine Wahl"
        },
        "14123":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "liegt etwas großes vor dem Ausgang.",
                "bewegt sich der ganze Baumstumpf."
            ],
            "content":"<div class=\"\"><div> <span>\"Die können mich mal. Ich geh doch nicht in ein Internat.\" sagst du dir und gehst in richtung Wald.<br>\r\nBeherzt gehst du über einen weißen Grenzstich und an einem Schild mit merkwürdigen Schriftzeichen vorbei.<br>\r\nEigenartige Tierlaute hörst du aus dem tiefen Wald und überlegst welche Tiere solche Laute von sich geben.<br>\r\nEs sind nur ein paar Schritte als dich dann doch die Angst ergreift und du zurück willst.<br>\r\nAber als du dich umdrehst siehst du nichts ausser Wald.<br>\r\n\"Wo ist der Ausgang.\" Fragst du dich mit verzweifelnder Simme.<br>\r\nSofort rennst du los und merkst das es schon dunkel wird.<br>\r\n\"Oh man. Was zur Hölle ist hier los?\" fragst du ins nichts und schaust dich nach einem sicheren Schlafplatz um.<br>\r\nEin hohler Baumstumpf (wo du grade so reinpasst) ist das einzigste was du findes.<br>\r\nSofort kletters du rein und legst den Koffer vor den Zugang.<br>\r\nDie Waldgeräuche werden lauter und Erde scheint in einem rhythmus zu beben.<br>\r\nÄngstlich kauerst du dich zusammen und schliesst die Augen.<br>\r\nIrgendwann bist du dan eingeschlafen.<br>\r\nAls du aufwachst ...........</span></div></div>",
            "created":1248757200,
            "id":734040,
            "title":"Der mysische Wald"
        },
        "1413":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "keine Angst (Warum auch, es ist deine Frau.)",
                "Angst. (Sicher ist Sicher)"
            ],
            "content":"<div class=\"\"><div> <span>Hauptfiguren <a rel=\"nofollow\" href=\"http://download.lavadomefive.com/LD5%20Artists/Markie/slides/Alldragonesses.html\" target=\"_blank\">http://download.lavadomefive.com/LD5%20A...</a><br>\r\n<br>\r\nNach deiner Morgenwäsche gehst du in die Küch und bereites das Frühstück vor.<br>\r\n\"Markie. Könntes du mal eben in den Garten kommen?\" hörst du deine Frau sagen.<br>\r\n\"Ja. Ich komme Eve.\" antwortes du und gehst durch die Verandatür in den hochumzäunten Garten.<br>\r\n\"Was ist los?\" fragst du.<br>\r\n\"Markie. Wie lange sind wir jetzt verheiratet?\" fragt sie dich.<br>\r\n\"Das mussten jetzt 5 Jahre sein. Wieso? Du willst doch nicht die Scheidung?\" fragst du verzweifelt.<br>\r\n\"Nein, das will ich nicht sagen. Ich muss spätestens Morgen zurück in mein Land.\" sagt sie mit trauer in den Augen.<br>\r\n\"Wie meinst du das? Du bist doch in deinem Land?\" fagst du.<br>\r\n\"Naja. Nicht ganz. Ich muss dir etwas sagen.\" sagt sie und geht ein paar Schritte zurück.<br>\r\n\"Komm aus den Punkt.\" sagst du ihr und gehst zu ihr.<br>\r\n\"Bitte halte Abstand. Ich zeige dir jetzt was du geheirates hast.\" stöhst sie dich weg und geht noch ein paar Schritte in die mitte des Garten.<br>\r\nSie schliesst ihre Augen und atmet einmal tief durch:\"Bitte hab gleich keine Angst.\"<br>\r\nMit schrecken siehst du wie sich ihre Haut schuppig grün verfärbt und eine Transformation durchmacht.<br>\r\nLangsam zerreißen ihre Sachen und fallen von ihrem wachsenen Körper.<br>\r\n\"Wrrraaaaaaahhhhhh.\" schreit Eve und verwandelt sich in einen 70 meter großen Drachen.<br>\r\n<a rel=\"nofollow\" href=\"http://www.sizeshift.com/dragoness/displayimage.php?album=lastup&amp;cat=0&amp;pos=173\" target=\"_blank\">http://www.sizeshift.com/dragoness/displ...</a><br>\r\n<a rel=\"nofollow\" href=\"http://www.sizeshift.com/dragoness/displayimage.php?album=lastup&amp;cat=0&amp;pos=103\" target=\"_blank\">http://www.sizeshift.com/dragoness/displ...</a><br>\r\n<br>\r\nSie steht nackt in ihrer Drachenform in dem Garten und nur wenige centimeter mit ihren riesigen Fußklauen vor dir.<br>\r\nDu hast .........</span></div></div>",
            "created":1249707600,
            "id":746447,
            "title":"Glücklich Verheiratet"
        },
        "14131":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Magen",
                "Vagina oder Darm"
            ],
            "content":"<div class=\"\"><div> <span>\"Wow.\" ist das einzigst was dir einfällt, als Eve sich in ein Drachen zu dieser enormen größe verwandelt.<br>\r\nEve bückt sich vorsichtig zu dir runter und schaut dich mit ihren orangeschimmernen Augen lächelnd an.<br>\r\n\"Und. Was sagst du?\" fragt Eve dich unsicher.<br>\r\n\"Was soll ich dazu sagen? Wow. Ich wusste schon immer das du etwas Besonderes bist, aber gleich so besonders.\" sagst du ihr und streichels über einen ihrer Zehen.<br>\r\n\"Naja. Und was sagst du dazu das du mit einem Drachen verheirates bist?\" fragt sie und streicht mit ihrer Kralle dir unter dem Kien.<br>\r\n\"Du bist meine Frau und ich liebe dich. Igal was du bist. Ob ein Drache oder ein Mensch.\" antwortes du ihr.<br>\r\n\"Da bin ich erleichtert. Ich habe mit mir gradezu gekämpft um dir mein Geheimnis zu verraten.\" sagt sie und lächel erleichtert.<br>\r\n\"Und? Wo ist dein Land?\" fragst du.<br>\r\n\"Dazu wollte ich jetzt kommen. Meine Welt ist nur für die mytische Wesen und das Portal lässt keine Menschen durch.\" sagt sie mit tränen in den Augen.<br>\r\n\"Und warum mußt du wieder zurück?\" fragst du.<br>\r\n\"Weil ich nur 10 jahre in der Menschenwelt überleben kann. Dann ist meine Magie verbraucht.\" antwortet sie und muss sich die Tränen verkneifen.<br>\r\n\"Ich will nicht das du stirbst.\" heulst du.<br>\r\nEve verwandelt sich wieder zurück und umarmt dich. (immernoch nackt)<br>\r\n\"Ich will dich aber nicht verlassen. Also will ich dich fagen ob du mit willst.\" sagt sie.<br>\r\n\"Ja. Aber wie willst du das anstellen wenn das Portal keine Menschen durchlässt?\" fragst du.<br>\r\n\"Vertraust du mir?\" fragt sie dich.<br>\r\n\"Was für eine Frage. Natürlich!\" antwortes du.<br>\r\n\"Ok. Ich werde dich in meinem Körper mitnehmen. Ich hoffe das ist in Ordnung?\" fragt Eve.<br>\r\n\"So lange ich bei dir bleiben kann.\" sagst du.<br>\r\n\"Na gut. Dann würde ich vorschlagen das du alles einpackst was du mitnehmen willst. Denn wir kommen nie wieder zurück.\" sagt sie und gibt dir einen Küss.<br>\r\nDu eillst ins Haus und packst alles an Wäsche ein was in deinen Koffer passt.<br>\r\nMit dem Koffer gehst du wieder raus und siehst Eve in ihrer Drachengestalt.<br>\r\n\"Schon fertig?\" fragt sie.<br>\r\n\"Ich hab mich schliesslich beeillt damit wir schnell aufbrechen können.\" antwortes du und gibst die schweren Koffer in Eves große Klaue.<br>\r\n\"Dann lass ich dir die Wahl wie ich dich mitnehmen soll.\" sagt sie.</span></div></div>",
            "created":1249707600,
            "id":741869,
            "title":"Verheiratet mit einem Drachen."
        },
        "141311":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Ihr fliegt durch das Portal",
                "Eve macht ein Zwischenstop (Toilettenpause)"
            ],
            "content":"<div class=\"\"><div> <span>\"Wie sieht es aus wenn du mich in dein Maul nimmst. Oder ist es dir zu riskant mich zu verschlucken?\" fragst du und kletters auf ihre Hand(Klaue).<br>\r\n\"Ich hab eine bessere Idee. Ich schlucke dich direkt runter und nehm dich in meinen Futtersack (ein Vormagen). Da ist noch mein Frühstück und du bist sicher vor meinen Magensäften. Oder vertraust du mir nicht?\" sagt Eve.<br>\r\n\"Ich liebe dich zu sehr als dir zu misstrauen.\" antwortes du ihr.<br>\r\n\"Ok. Dann würde ich vorschlagen das du dich ausziehst. Du willst dir sich nicht deine Klamotten versauen.\" rät sie dir.<br>\r\nDu ziehst dich wir vorgeschlagen aus und packst alles in deinen Koffer.<br>\r\nFertig? Na dann. Willkommen bei Dagoness-Air bitte alle einsteigen.\" sagt sie und muss lachen.<br>\r\nSchnell beruhigt sie sich wieder, hebt sie dich hoch vor ihr geöffnetes Maul und streckt ihre Zunge raus.<br>\r\nDie Zungenspitze winkt dich ran als ob Eve sagen will \"Komm Rein\".<br>\r\nOhne irgendwie Angst zu spühren gehst du auf Eves Zunge und schaust in die Mundhöhle mit den schleimigen Speichelfäden die an den rasiermesserscharfen Zähnen runtertropfen.<br>\r\nNachdem der warme Atem dir ins Gesicht schlägt sagst du:\"Mmmh. Mizig. Naja, dann wollen wir mal.\":zu dir und wanderst über die schleimige Zunge ins Maul.<br>\r\nAls du dann mittig in Eves Maul stehst, schliesst sich die Zahnreihe hinter dir.<br>\r\nAber anstatt dich in dunkelheit zu hüllen, leuchtet das ganze Fleisch mit einem leichten rotschimmer um dich herum.<br>\r\n\"Mmmmh.\" hörst du aus dem Rachen und wirst durch ein zucken der Zunge umgeworfen.<br>\r\nPlötzlich hebt sich die Zunge an und du rutscht in ihren Rachen.<br>\r\nEs ist für dich ein berauchenes Gefühl und ohne weitere verzogerung öffnet sich unter dir die Speiseröhre und lässt dich in diese warme Tunnelrutsche.<br>\r\nWie ein Kleinkind schießt du durch den Tunnel der sich unter dir weiter öffnet und über dir sich wieder schliesst.<br>\r\nWährend du ihre Speiseröhre runtergleites, streicht Eve mit ihrer Klaue deine Position entlang.<br>\r\nPLOP macht es und du landes in Eves Vormagen.<br>\r\nSelbst hier ist alles angenehm erleuchtet und du bemerkst das du in Rührei mit Toast stehst das (was sie gefrühstückt hatte) mit ihr mitgewachsen ist.<br>\r\n\"Ich hoffe es ist gemühtlich in meinem Futtersack.\" grollt um dich herum.<br>\r\n\"Ja. Mach dir keine Sorgen.\" sagst du.<br>\r\n\"Dann kannst du das Frühstück nachholen, wovon ich dich abgebracht habe.\" grollt es wieder.<br>\r\n\"Danke. Aber ich bräuchte noch meinen Morgenkaffee.\" sagst du in die Fleischhöhle.<br>\r\n\"Eine Sekunde.\" sagt Eve und nimmt ihre menschliche Gestalt wieder an.<br>\r\nWährend der Verwandlung schrumpfst du mit ihr und alles wird dunkel.<br>\r\n\"Hey, wer hat das Licht aus gemacht.\" rufst du.<br>\r\n\"Du willst doch deinen Morgenkaffee und in meiner Drachen-form ist mein Körper leider zu groß für das Haus.\" sagt sie in einer weichen Stimme.<br>\r\n\"Heißt das ich bin mit dir mitgeschrumpft?\" fragst du.<br>\r\n\"Ja. Geh mal aus dem Weg. Hier kommt dein Kaffee.\" sagt Eve und ein warmer Wasserfall aus Kaffee läuft in den Magen.<br>\r\n\"Möchtes du sonst noch etwas, bevor wir uns auf den Weg in meine Welt machen, mein Schatz?\" fragt sie und reibt sich über ihren Bauch.<br>\r\n\"Nein, danke meine süsse Drachenlady.\" sagst du und merkst wie alles wieder hell wird.<br>\r\n\"Ok. Dann flieg ich mal los.\" grollt Eve.<br>\r\nPlötzlich dreht sich der Vormagen und du wirst von Kaffee und Rühreitoast begraben.<br>\r\nWährend des Fluges spürst du jeden Flügelschlag und geniesst dein Frühstück.</span></div></div>",
            "created":1249707600,
            "id":741865,
            "title":"Liebe geht in den (vor)Magen"
        },
        "1413111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "ein Drache kommt vorbei.",
                "Eve furzt."
            ],
            "content":"<div class=\"\"><div> <span>Nach einer Weile gibt es einen Ruck und du hörst Eve:\"Wir sind jetzt vor dem Portal. Willst du nochmal einen letzten Blick auf deine Welt werfen bevor wir durchfliegen?\"<br>\r\n\"Wenn es dir nichts ausmacht.\" antwortes du und hörst ein merkurdiges Geräusch von oben auf dich zukommen.<br>\r\n(Eve schluckt Luft runter und baut druck in ihrem Magen auf)<br>\r\nPlötzlich gurgelt es unter dir und ein kräftiger Luftstrom rülpst dich nach oben.<br>\r\nDu fiegst so schnell durch die Speiseröhre, das du an ihrem Rachen vorbeifliegst und du in der verrotzen Nasenhöhle landes.<br>\r\n\"Upps. das war wohl ein bisschen zu stark.\" kichert Eve und reibt sich über ihr verlängertes Nasenbein.<br>\r\n\"Du kannst auch so einen Blick auf deine Welt werfen. Krieche nur vor zu meinen Nüstern.\" sagt sie.<br>\r\nWie sie dir vorgeschlagen hat, kriechst du vorsichtig durch ihren schnodder und guckst aus ihre Nase.<br>\r\n\"Wo sind wir überhaupt?\" fragst du und schaust auf ein altes Schloss.<br>\r\n\"Das ist England. Ist das nicht wunderschön?\" seuftzt sie und schwenkt ihren Kopf damit du mehr durch ihre Nüstern sehen kannst.<br>\r\n\"Ja. Aber lass uns jetzt aufbrechen. Ich bin bereit.\" antwortes du ihr.<br>\r\n\"Ok. Dann geht es wieder nach unten.\" sagt sie und schnieft einmal kräftig.<br>\r\nDu wirst durch den Luftzug wieder zurück in den Rachen gezogen und nach einem kurzen schlucken von deiner Frau in ihren Futtersack befördert.<br>\r\n\"Wääch.\" sagst du und versuchst den Rotz im Kaffeepool abzuwaschen.<br>\r\n\"Ok. Dann mal los.\" sagt Eve und fliegt durch einen schimmernen Lichtkreis.<br>\r\nEin flaues Gefühl bekommst du und hörst Eve sagen:\"Home sweet Home.\"<br>\r\n\"Geht es dir gut, Liebling?\" frgt sie dich mit einer besorgten Stimme.<br>\r\n\"Ja. Mir ist nur ein bisschen flau im Magen.\" sagst du und bemerkst wie sie eine Kurve fliegt.<br>\r\n\"Wir sind gleich zuhause. Da kannst du wieder raus.\" sagt sie und nach einer Weile bemerkst du wie Eve einen Sturzflug mit anschliessender Landung macht.<br>\r\n\"Also da währen wir.\" hörst du sie sagen.<br>\r\n\"Na dann. Willkommen in unsern Liebesnest.\" sagt sie zu dir und du wartes darauf das sie dich wieder hochrülpst.<br>\r\n\"Hey, mein Drachenschatz. Wann rülpst du mich wieder hoch?\" fragst du.<br>\r\n\"Einen Augenblick.\" sagt sie und dann hörst du wieder ein schlucken.<br>\r\nPlötzlich öffnet sich der Schliessmuskel über dir und ihr Drachenschweif gleitet langsam zu dir runter.<br>\r\n\"Hald disch fescht.\"(Halt dich fest) hörst du von oben und du greifst fest zu.<br>\r\nPlötzlich geht es ganz schnell und du wirst samt Drachenschwanz hochgezogen.<br>\r\nIn wenigen augenblicken bist du aus Eves Körper und fällst auf eine überdimensionale Couch.<br>\r\nDu sortierst kurz deine Sinne und siehst dann das Eve sich ein Höschen mit BH angezogen hat während du noch im Futtersack warst. <a rel=\"nofollow\" href=\"http://download.lavadomefive.com/LD5%20Artists/Markie/slides/Dragoness%20233.html\" target=\"_blank\">http://download.lavadomefive.com/LD5%20A...</a>        <br>\r\nDu schaust dich weiter um und erkennst das ihr in einer Höhle seid die mit Möbeln ausgestattet ist.<br>\r\n\"Was ich dir noch sagen wollte... naja. Ich hab mich die ganze Zeit nicht getraut es dir zu sagen, aber in meiner Welt sind Mensch die Untertanen der Drachen.\" sagt sie mit mit einem 'verzeih mir Gesicht'.<br>\r\n\"Wenn ich also mal Besuch bekomme müsstes du ....\" \"Ja ja. Ich spiele den Untertan.\" unterbrichst du sie und kratzt dir grinsend an dem Kopf.<br>\r\n\"Das ist lieb von dir. Aber das gilt nicht für dehnen den ich es verrate.<br>\r\nPlötzlich bebt es und ........</span></div></div>",
            "created":1249899120,
            "id":751007,
            "title":"Home sweet Home"
        },
        "14131111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Ihr unterhaltet euch über die Regeln.",
                "Eve bekommt hunger"
            ],
            "content":"<div class=\"\"><div> <span>Das Beben gehört einer 450 meter großen Drachen-Dame in einer Goldrüstung die vor Eves Höhle stehen bleibt und sich runter bückt. <a rel=\"nofollow\" href=\"http://download.lavadomefive.com/LD5%20Artists/Markie/slides/Dragoness%20257.html\" target=\"_blank\">http://download.lavadomefive.com/LD5%20A...</a><br>\r\n\"Hallo Eve. Wusste ich doch das du durch das Portal gekommen bist.\" sagt die Drachenfrau.<br>\r\n\"Ich fühle mich über ihren Besuch sehr geehrt. Meine Königin Ronnie.\" erwieder Eve.<br>\r\n\"Ach Eve nicht so förmlich. Und ausserdem heiße ich seid einiger Zeit Nina.\" sagt die riesige Drachen-Dame und guckt auf die Couch.<br>\r\n\"Wenn haben wir denn hier?\" sagt Nina und greift vorsichtig mit ihrer riesigen Klauenkrallen nach dir.<br>\r\n\"Das ist Markie. Ähm er ist mein Ehemann.\" sagt Eve und hält die Klaue von Nina fest.<br>\r\n\"Wie es aussieht hast du deine Strafe in der Menschenwelt gut genutzt.\" sagt Nina und zieht dich aus der Höhle raus.<br>\r\nEve fliegt hoch zur aufstehenen Königin und bleibt in deiner nähe.<br>\r\n\"Was meint sie mit Strafe?\" fragst du Eve und wirst von Nina höher gehoben.<br>\r\n\"Naja. Eve hat einige Untertanen gefressen und unser Gesetz verbietet es sich an unsere Untergebenen gütlich zu tun.\" antwortet dir Nina und setzt dich wieder auf den Boden.<br>\r\n\"Also ich muss wieder gehen. Ich hab noch einen Termin um meine Füsse zu säubern.\" sagt sie mit einem lachen und zeigt ihre Blutverschmierten Sohlen.<a rel=\"nofollow\" href=\"http://download.lavadomefive.com/LD5%20Artists/Markie/slides/Dragoness%20245.html\" target=\"_blank\">http://download.lavadomefive.com/LD5%20A...</a><br>\r\n\"Aber Aya wird dich heute noch besuchen kommen. Ach ja, hast du deinem kleinen Ehemann schon gesagt das er dem Status der Sklaven angehört?\" fragt Nina.<br>\r\n\"Ja. Ich sag ihm eh noch ein paar verhaltensregeln.\" antwortet Eve und hebt dich vorsichtig hoch.<br>\r\n\"Na dann. Bist zum nächsten mal.\" verabschiedet sich Nina und geht weg.<br>\r\n\"Oh man. Das ist die Herrscherin über Avalon.\" erklärt dir Eve und geht mit dir wieder rein.<br>\r\n</span></div></div>",
            "created":1249880400,
            "id":742560,
            "title":"Königin von Avalon"
        },
        "141311111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "kommt Aya in die Höhle",
                "Eves Magen knurrt"
            ],
            "content":"<div class=\"\"><div> <span>\"Meinst du das Avalon aus der König Arturs Geschichte?\" fragst du eifrig.<br>\r\n\"Ja. Das hier ist Avalon. Und?\" sagt Eve als ob das nichts besonderes währ und setzt sich mit dir auf ihrer Handklaue hin.<br>\r\n\"Also wo fangen wir an?\" fragt sich Eve und sieht dich überlegt an.<br>\r\n\"Genau. Die Menschen in Avalon verehren uns Drachen und stehen unter unseren Schutz. Es gibt aber immer wieder Ausnahmen. Diebe, Mörder und ähnliches.\" sagt Eve.<br>\r\n\"Und warum wurdes du für die Jahre in meine Welt geschickt?\" fragst du.<br>\r\n\"Darüber rede ich ungerne. Aber da du es bist. Ich sah wie Menschen von einem Waldbrannt eingeschlossen waren und eillte zur hilfe. Aber die Flammen waren zu heiß für die Menschen und ich nahm alle in mein Maul.\" sie säufzt auf \"Als ich dann aus dem Flammenmeer ging, stolperte ich und verschluckte die Menschen ausversehen. Aber die rutschen in meinen Magen und wurden Lebendig verdauut.\" sagt sie.<br>\r\n\"Das ist tragisch.\" versucht du sie zu trösten.<br>\r\n\"Naja. Ich erzähle mal weiter. Ach ja. Wir lassen die Menschen leben solange sie uns gehorchen. Aber da muss man sich keine Sorgen machen. Wir sind schliesslich dessen Götter. Aber ausserhalb von Avalon gibt es ein unentlich großes Reich wo Drachentöter, Sklavenhändler und andere Feinde von Avalon leben. Die dürfen wir allerdings ohne zu zögern töten. Ich hoffe das schockiert dich nicht?\" fragt sie mit einem zögerlichen lächeln.<br>\r\n\"Nein. Wieso? Andere Länder ander Sitten.\" antwortes du und lachst.<br>\r\n<br>\r\nPlötzlich ..........</span></div></div>",
            "created":1249880400,
            "id":742551,
            "title":"Ihr unterhaltet euch."
        },
        "1413111111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Nina",
                "Kali"
            ],
            "content":"<div class=\"\"><div> <span>\"Hi Eve.\" hörst du vom Höhleneingang.<br>\r\nEin 40 meter großer lila Drache rennt auf Eve zu und umarmt sie. <a rel=\"nofollow\" href=\"http://download.lavadomefive.com/LD5%20Artists/Markie/slides/The%20Dragoness%20Books%20Aya%2001.html\" target=\"_blank\">http://download.lavadomefive.com/LD5%20A...</a><br>\r\nDurch diese überraschende Umarmung fällst du aus Eves Handfläche und landes ohnmächtig zwischen ihren Oberschnkeln.<br>\r\n\"Wow. Vorsichtig. Ich hab dich ja auch vermisst.\" sagt Eve und drückt Aya vorsichtig von sich weg.<br>\r\n\"Aber was ist los?\" fragt Aya.<br>\r\n\"Mir ist grade mein Man......... ähh Sklave runter gefallen.\" korrigiert Eve sich selbst.<br>\r\n\"Upps. Wo ist er?\" fragt Aya.<br>\r\n\"Weiss ich nicht.\" antwortet sie besorgt und drückt ihre Schenkel zusammen um die Couch besser abzusuchen.<br>\r\nDu wurdes versehentlich von zwei riesigen Schuppenwalzen eingeschlossen.<br>\r\n\"Wo bist du mein Kleiner?\" weckt dich aus der Ohnmacht.<br>\r\n(Wow. Was ist grade passiert?) denkst du und siehst die schuppigen Wände.<br>\r\n\"Eve?\" sagst du und wirst durch ein Licht geblendet.<br>\r\n\"Da bist du ja.\" hörst du Eve sagen.<br>\r\n\"Owww. Ist der Süss. Darf ich ihn bitte mal halten?\" fragt Aya und nimmt dich ohne ein Antwort abzuwarten hoch.<br>\r\n\"Warum is der Nackt?\" fragt Aya.<br>\r\n(Markies Koffer. Wo hab ich die versteckt?) denkt Eve und antwortet:\"Ähm. Er hatte grade ein Bad genommen.\"<br>\r\n\"Dann gib ihm eben seine Kleidung und setz ihn in sein Käfig. Ich wollte mit dir einen Spatziergang machen.\" sagt Aya und gibt dich in Eves Hände.<br>\r\n\"Sekunde. Ich kann ihn doch mitnehmen?\" fragt sie.<br>\r\n\"Mach was du willst. Ich warte draussen.\" sagt Aya und geht aus der Wohnhöhle.<br>\r\n\"Oh man. Das war knapp. Ich hoffe es geht dir gut?\" fragt sie dich und setzt dich auf ihren Nasenrücken.<br>\r\n\"Ja. Ich war nur ein bisschen irritiert als ich zwischen zwei schuppigen Wänden zu mir kam.\" sagst du.<br>\r\n\"Aya will mit mir einen Spaziergang machen. Dann kannst du auch etwas von meiner Welt sehen. Kletter einfach auf meinen Kopf. Deine Koffer hab ich n meinem Horn festgemacht.\" sagt sie noch und geht dann zum Ausgang.<br>\r\nVorsichtig kletterst du zwischen ihren Augen hoch und krabbels in ihre Haare.<br>\r\nOhne Probleme entdeckst du deine Koffer und ziehst dir erstmal etwas lockeres an.<br>\r\n\"Fertig. Dann lass uns doch ....... besuchen.\" sagt Aya.</span></div></div>",
            "created":1249966800,
            "id":742958,
            "title":"Ayas vorschlag"
        },
        "14131111111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "\"Wir wollen mit ein paar Drachentöter spielen.\"",
                "\"Wir wollen ein bisschen miteinander reden.\""
            ],
            "content":"<div class=\"\"><div> <span>\"Na dann lass uns Nina Besuchen gehen.\" sagt Aya und ihr Drei macht euch auf den Weg.<br>\r\nIhr geht an einem Dorf vorbei wo allle Menschen sich ehrfurchtsvoll vorbeugen.<br>\r\nVorsichtig kletterst du auf Eves Diadem um eine besseren Ausblick zu haben.<br>\r\n\"Wow. Was für eine Aussicht.\" sagst und geniesst die frische Luft.<br>\r\n\"Und Eve, wo warst du die letzten Jahre?\" fragt Aya.<br>\r\n\"Ähm. Ich war in den nördlichen Provinzen. Um andere Drachenkolonien zu finden.\" lügt Eve ohne rot zu werden.<br>\r\n\"Und? Hast du welche gefunden.\" fragt Aya.<br>\r\n\"Leider nein. Nur Menschen die mich umbringen wollten.\" lügt Eve weiter.<br>\r\n\"Aber lass uns von was anderes sprechen. Was hat sich hier verändert?\" versucht Eve von dem gelogenden Thema abzulenken.<br>\r\n\"Ach nicht viel. Königin Ronnie will nicht mehr so verehrt werden und hat ihren namen in Nina geändert.\" sagt Aya.<br>\r\n\"Ja. Das wusste ich schon. Nina hatte micht schon besucht.\" sagt Eve.<br>\r\n\"Wenn man vom Teufel spricht. Da ist sie ja.\" sagt Aya.<br>\r\nDu guckst in die Richtung in die das halb wüchsige Drachenweib zeigt und du siehst wie Nina auf einer riesigen Wiese sitzt und lauter Menschen an ihren Fußsohlen. <a rel=\"nofollow\" href=\"http://download.lavadomefive.com/LD5%20Artists/Markie/slides/Dragoness%20248.html\" target=\"_blank\">http://download.lavadomefive.com/LD5%20A...</a><br>\r\n\"HALLO. NINA.\" ruft Aya und lässt dich fast taub werden.<br>\r\n\"Hey. Wie geht es euch?\" fragt Nina.<br>\r\n\"Großartig.\" antwortet Aya.<br>\r\n\"Ihr könnt jetzt aufhören.\" befielt Nina den Menschen.<br>\r\nSie gehorchen und gehen bei seite.<br>\r\n\"Na was führt euch hier her?\" fragt Nina und steht auf.<br>\r\n</span></div></div>",
            "created":1249966800,
            "id":742582,
            "title":"Nina"
        },
        "141311111112":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Mir schmerzt es da unten. ",
                "Mir tuen die Zähne weh."
            ],
            "content":"<div class=\"\"><div> <span>\"Ich würde gerne mit euch reden. Aber mir schmerzen meine Fußsohlen weh.\" sagt Nina und zeigt euch ihre Sohle.<br>\r\n\"Ich kann nichts erkennen. Du vieleicht?\" sagt Aya.<br>\r\n\"Nee. Sieht alles normal aus.\" antwortet Eve.<br>\r\nDir fällt etwas schimmerndes auf was sich in Ninas Sohle gegraben hat.<br>\r\n\"Hey Eve. Ich seh da was.\" sagst du und kletters auf Eve Maul.<br>\r\nEve geht näher mit ihrer Schnauze an Ninas Klaue und du erkennst ein Schwert was in ihrem Fuß steckt.<br>\r\nSofort ziehst du es raus wobei Nina ein erleichterndes säufzen rauslässt.<br>\r\n\"Ahhhhh. Wer war das denn?\" fragt Nina und beugt sich zu Eve.<br>\r\n\"Wenn haben wir den da? Wenn das nicht der kleine Mann von Eve ist?\" sagt sie mit einem weichen lächeln.<br>\r\n\"Ich hoffe ich könnte helfen.\" sagst du respektvoll zu der großen Drachen-Lady.<br>\r\n\"Oh ja. Du brauchst auch eine Aufgabe in dieser Welt. Was kannst du den so?\" fragt sie und setzt sich wieder in ihre vorherige Position.<br>\r\n\"Ähm naja ich war damals ein Arzt.\" sagst du und kletters wieder zurück in Eves Haare.<br>\r\n\"Wenn es so ist dann könntes du mir sicher noch bei anderen Problemen helfen.\" sagt Nina und lächelt.<br>\r\n\"Und? Was für Beschwerden haben Sie?\" fragst du.</span></div></div>",
            "created":1250925780,
            "id":748124,
            "title":"Ninas kleines/großes Problem"
        },
        "1413111111121":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Vagina",
                "Arschloch"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>\"Wo genau?\"</span></div></span></div>",
            "created":1250925840,
            "id":748126,
            "title":"Schmerzen"
        },
        "14131111112":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "erreicht ihr Kali Heim.",
                "knurrt Eves Magen."
            ],
            "content":"<div class=\"\"><div> <span>Kaum geht ihr los, da fällst du von Eves Kopf runter.<br>\r\n\"EEEVVVVVEEEE.\" schreißt du während du fällst und hoffst auf rettung.<br>\r\nGlücklicherweise hört dich deine Frau und fängt dich auf.<br>\r\n\"Hey. Nicht das du mir noch verloren gehst.\" kichert Eve und auf ihre Augenhöhe.<br>\r\n\"Ich glaube du bist dort besser aufgehoben.\" sagt Eve und öffnet ihr Maul.<br>\r\nOhne zu zögern springst du von ihrer Klauenfläch und landes auf ihre feuchte Zunge.<br>\r\n\"Wow. Der hat es aber eillig.\" lacht Aya und schaut in Eves Maul.<br>\r\nEve schliesst ihr Maul und (Glup) schon rutscht du wieder den engen Schlauch runter.<br>\r\n\"Mmmh.\" brummt es um dir, als du in ihren leeren Futtersack fällst.<br>\r\n\"Lecker.\" sagt Eve und leckt sich über ihre Lippen.<br>\r\n\"EVE. Was machst du da? Du wirst ihn noch Töten.\" sagt Aya panisch.<br>\r\n\"Ach nein. Ich hab ihn in meinen Futtersack geschickt.\" antwotet Eve mit einem kichern. <a rel=\"nofollow\" href=\"http://download.lavadomefive.com/LD5%20Artists/Markie/slides/Dragoness%20290.html\" target=\"_blank\">http://download.lavadomefive.com/LD5%20A...</a><br>\r\nDu lehnst dich zurück und bemerkst wie Eve weiter geht.<br>\r\n\"Hast du Hunger, mein Kleiner.\" hörst du Eve sagen.<br>\r\n\"Ja. Das währe nett.\" sagst du.<br>\r\nEve bückt sich und entwurzelt einen Apfelbaum.<br>\r\n\"Das müsste reichen.\" sagt Eve und lutscht die Zweige ab.<br>\r\nDu hörst wie Eve schluckt und kurz darauf fallen hunderte Äpfel in den Futtersack.<br>\r\n\"Danke. Eve.\" sagst du und beißt in einen eingespeckelten Apfel.<br>\r\n(Wow. Ist das lecker.) denkst du und bemerkst das eigendlich der Drachenspeichel so wundervoll schmeckt.<br>\r\n\"Eve. Dein Speichel schmeckt einfach fantastisch.\" sagst du.<br>\r\n\"Ja ja. Ich weiss Aya.\" hörst du und bemerkst das die zwei sich unterhalten.<br>\r\n\"Was hast du gesagt?\" hörst du Eve sagen und bemerkst wie sie dich auf den Bauch klopft.<br>\r\n\"Ach. Nicht wichtig.\" antwortes du und geniesst den Aufenthalt.<br>\r\nNach einiger Zeit ......</span></div></div>",
            "created":1249966800,
            "id":742989,
            "title":"Eine Reise in Eves Magen."
        },
        "141311111122":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Im Maul.",
                "In der Nasenhöhle."
            ],
            "content":"<div class=\"\"><div> <span>Plötzlich rumpelt es in der Nebenkammer und du hörst Eve sagen:\"Oh man. Hab ich hunger.\"<br>\r\n\"Eve mach jetzt nichts Falsches.\" sagst du.<br>\r\n\"Mach dir keine sorgen. Ich seh schon was leckeres.\" sagt Eve.<br>\r\nAuf einmal dreht sich die ganze Vorratskammer, weil Eve sich nach etwas bückt und hochnimmt.<br>\r\n\"Hey, vorsichtig.\" rufst du ein bisschen sauer, als sich der Vormagen wieder aufrichtet.<br>\r\nAusser Eves Herzschlag ist es ganz still, bis dann Eve wieder Schluckt.<br>\r\n\"MOOO!\" hörst du von oben langsam näherkommen.<br>\r\n(Eve muss wohl eine Kuh verschlingen.) denkst du still und siehst eine ausbuchtung an dem Futtersack vorbeigleiten.<br>\r\n\"Mmmh. Ich hatte schon lange keine Kuh mehr als Zwischensnack.\" sagt Eve und reibt sich über ihren Bauch.<br>\r\n\"MOOOO!\" hörst du noch immer aus der Nachbarkammer und fragst dich wiso die Kuh nicht sofort verdauut wird.<br>\r\n\"MOo....!\" die Kuh verstummt.<br>\r\nPlötzlich rumpelt es wieder und Eve muss kräftig Rülpsen.<br>\r\n\"Buuuurrrrrrrrbbbb.\" der Magenwind schiesst dich wieder nach oben durch die Speiseröhre.<br>\r\nVöllig perplex durch die rasante fahrt musst du erstmal schauen wo du bist.<br>\r\n</span></div></div>",
            "created":1250139600,
            "id":743613,
            "title":"knurrt Eves Magen."
        },
        "141311112":{
            "author_id":"emeralwizard",
            "author_name":"lord of emeralds",
            "choices":[
                "Eve will mehr über Asgard erfahren",
                "Eve erklärt ihm die Regel"
            ],
            "content":"<div class=\"\"><div> <span>Als ihr euch gesetzt habt kannst du einfach nicht länger an dir halten \"Ich dachte schon sie bringt mich um.\" \"Ich mach mir mal was zu essen.\"sagt Eve schmunzelnd und geht in die weiter hinten gelegene Speisekammer. \"Ich muss dir was gestehen\" sagst du als sie zurück kommt \"ich bin nicht der normale Mensch für den du mich hältst ich bin Magier das Oberhaupt der Magier um genau zu sein außerdem kenne ich Nina ich habe früher mal Verhandlungen mit ihr geführt.Ich komme auch eigentlich nicht aus der welt die wir gerade verlassen haben ich komme aus einer Welt bekannt als Asgard dort leben alle möglichen magischen Wesen und auch Menschen in vollkommener Harmonie.\" </span></div></div>",
            "created":1269197640,
            "id":854618,
            "title":"Markies Geständnis"
        },
        "14131112":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Vagina",
                "Anus"
            ],
            "content":"<div class=\"\"><div> <span>Pfffffffffffffff.<br>\r\nGase verbreiten sich und ein überweltigender süsser Duft schießt dir in die Nase.<br>\r\n\"Upps. Das war wohl noch das Chilli von gestern.\" kichert Eve und dir wird trotz des süsslichen Aromas schwindelig und du fällst um.<br>\r\nAls du wieder zu dir kommst ,ist es dunkel und niemand war zu sehen.<br>\r\n\"Eve?\" fragst du noch etwas benommen in den dunkelen Raum.<br>\r\nAber es kommt keine antwort.<br>\r\n(Wo ist sie nur?) fragst du dich.<br>\r\nPlötzlich hörst du ein lautes Geräusch hinter dir.<br>\r\n\"Eve?\" fragst du und drehst dich um.<br>\r\nDann bemerkst du das du auf einem gigantischen Bett bist und Eve hinter dir schläft.<br>\r\n\"Wow. Bist du schön.\" sagst du zu Eve (in deinen wissen das sie dich nicht hört.) und gehst zu ihrem Maul.<br>\r\nVorsichtig küsst du ihre Oberlippe und erinnerst dich an den himmlischen Duft als sie gefurzt hat.<br>\r\nDir fällt die entscheidung nicht schwer was du jetzt tust.<br>\r\nOhne zu zögern kriechst du unter die Bettdecke und bemerkst schon einen angenehmen Duft.<br>\r\nEs erregt dich als du an ihrem Körper entlang gehst.<br>\r\nIhre wohlgeformten Brüste reibst du beim vorbeigehen und hörst ein weiches Stöhnen von ihrem vibrierenden Körper.<br>\r\n\"Oh man ist das Geil.\" sagst du und gehst an ihrem Bauch vorbei.<br>\r\nJetzt hast du einen noch unwiderstehlicheren Duft der sich hier unten vermischt in der Nase.<br>\r\nDann hörst du ein rumpeln und ein kräftiges furzgeräusch.<br>\r\nDir fällt auf das Eve nicht nur aus ihrem Hintern gefurzt hat, sondern auch einen Vaginalfurz abgelassen hat.<br>\r\nDer Geruch beider Gase ist wahnsinnig berauschend, so das du in sie eindringen willst.<br>\r\nAber wo?</span></div></div>",
            "created":1251360720,
            "id":751101,
            "title":"Eve furzt."
        },
        "14132":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "(Viellecht hat sie recht) du drückst auf die Hupe.",
                "(Heilige Scheiße. Du bist ein Drache) du verhälst dich ruhig."
            ],
            "content":"<div class=\"\"><div> <span>\"Also das ist meine wirkliche Gestallt.\" sagt Eve und hockt sich zu dir runter.<br>\r\n\"Ach du Heilige Scheisse. Du bist ein Drache.\" schreißt du und gehst ein paar Schritte zurück.<br>\r\n\"Hey, warte.\" sagt Eve und will nach dir greifen.<br>\r\nAber bevor sie dich erreichen kann, hast du deine Beine in die Hand genommen und rennst ins Haus.<br>\r\n\"Markie. Bitte ich wollte dich nicht erschrecken.\" grollt es von draussen.<br>\r\nSchnell rennst du ins Obergeschoss und versteckst dich unter dem Bett, im Schlafzimmer.<br>\r\n\"Markie. Ich kann dich sehen.\" hörst du aus dem offen stehenem Fenster.<br>\r\nVorsichtig guckst du zum Fenster und siehst ein riesiges Oranges Drachenauge.<br>\r\n\"Komm schon. Ich will nur mit dir reden.\" sagt Eve und bewegt ihren Kopfvom Fenster weg.<br>\r\nVorsichtig kommst du aus deinem Versteck und denkst (Bitte lass mich in ruhe).<br>\r\nPlötzlich kommt ein riesiger schuppiger Finger durch das Fenster und versucht dich zu greifen.<br>\r\n\"Verschwinde du Monster.\" schreißt du wütend und rennst in den Flur. <br>\r\n\"Ich muss Hilfe rufen.\" sagst du dir und rennst schnell in die Küche zum Telefon.<br>\r\nBeim wählen schaust du aus dem Fenster und siehst wie Eve die Telefonleitung mit ihrer Klaue kappt.<br>\r\n(Scheiße. Wo ist mein Handy?) fragst du dich und dann fällt dir ein das es noch im Auto liegt.<br>\r\nVorsichtig gehst du aus der Haustür und bewegst dich auf deine Smart zu.<br>\r\n(Bitte bemerk mich nicht) sagst du dir immerwieder und schliesst das Auto auf.<br>\r\nEve hat nicht bemerkt wie du in dein Auto einsteigst und guckt durch jedes Fenster.<br>\r\n\"Markie, wo bist du?\" sagt sie spielerisch und geht um das Haus.<br>\r\nJeder Fußstampfer lässt die Umgebung leicht Beben.<br>\r\nDu wühlst in der Zeit panisch das Handschuhfach durch bis du endlich das Handy in der Hand hälst.<br>\r\nDu fängst an zu verzweifel als du erkennst das der Akku leer ist.<br>\r\n\"Scheiße. Warum pasiert mir sowas?\" flüsters du in verzweiflung und willst wieder ins Haus.<br>\r\nAber als du aussteigen willst ist es zu spät.<br>\r\nEves riesige Fußklaue kommt auf dich zu und scheind dich zu zermalmen.<br>\r\nAber du hast glück und wirst zwischen ihren Zehen eingeklemt.<br>\r\nEve geht wieder in den Garten und nimmt dich unbewusst mit.(Zwischen ihren Zehen eingeklemt.)<br>\r\n\"Ach Markie. Bitte ich bin immernoch die selbe die du damals geheirates hast.\" sagt sie und geht weiter um das Haus.<br>\r\n</span></div></div>",
            "created":1249880400,
            "id":746011,
            "title":"Auf der Flucht"
        },
        "141321":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "jetzt auf den weg.",
                "in ein paar Stunden auf den weg."
            ],
            "content":"<div class=\"\"><div> <span>\"Markie. Bitte, ich will mit dir Reden.\" sagt Eve etwas traurig und kauert sich heulend hin.<br>\r\n(Bitte lass mich keine Scheisse bauen.) denkst du dir und drückst auf die Hupe.<br>\r\nEin lautes Nööööööhhhhhhhhht kommt von Eves Fußklauen.<br>\r\n\"Markie.\" sagt Eve in einem freundlichen Tön und holt dich samt Smart vorsichtig mit ihren Krallen aus ihren schuppigen Zehen.<br>\r\nDu bekommst panik als Eve dich im zerquetschten Auto hoch zwischen ihre Nasenlöcher hebt und auf ihre Schnauze stellt.<br>\r\n\"Verwandels du dich bitte zurück?\" fragst du.<br>\r\n\"Das geht nicht mehr.\" sagt Eve.<br>\r\n\"Ok. Dann tu mir bitte nichts.\" sagst du mit angst in der Stimme.<br>\r\n\"Warum sollte ich dir was antuen? Ich liebe dich und würde dir nie irgend etwas böses wollen.\" sagt Eves Augenpaar zu dir und hat eine freundliches orangen schimmern.<br>\r\n\"Ich steig jetzt aus. Und bitte. Fress mich nicht.\" sagst du noch unsicher und versuchst die verzogende Autotür auf zu drücken.<br>\r\nDoch die Tür ist verklemmt und lässt sich nicht öffnen.<br>\r\nDas Augenpaar beobachtet dein verzweifelder versuch die Türe zu öffnen und dann hörst du Eve \"Sekunde ich helfe dir.\" sagen.<br>\r\nKurz darauf siehst du wie sich ihre spitzen Fingernägel in die Karosserie graben und dein Auto hochhebt.<br>\r\n(Was hat sie vor?) fragst du dich und siehst plötzlich ihr Maul vor deiner zerbeulten Karre auftauchen.<br>\r\n\"Keine Angst.\" sagt das riesige Maul und öffnet sich leicht.<br>\r\nVorsichtig beisst Eve den Motor ab und spuckt ihn aus.<br>\r\nEin weiterer Biss folgte sofort und panisch kletterst du so weit wie möglich zum Kofferraum.<br>\r\nIhre monströsen Zähne graben sich vorsichtig in die front von deinem Auto und reißt alles weg.<br>\r\n\"So. Jetzt kannst du raus.\" sagt Eve und setzt dich zurück auf ihren Nasenrücken.<br>\r\nDu atmes noch etwas schnell durch den Schock von ihrem Maul und steigst auf ihre Schnauze.<br>\r\n\"Also. Was willst du mir sagen? Ausser das du ein furcherregender Drache bist.\" fragst du und schaust ihr in die Augen.<br>\r\nDie Augen ziehen sich in einen traurigen Blick und sie sagt:\"Mein Leben ist in dieser Welt zuende. Und ich muss in meine Welt zurückkehren.\"<br>\r\nIhr Blick lässt deine Angst verschwinden und du fragst:\"Kann ich dir irgendwie helfen?\"<br>\r\n\"Nein. Aber ich will dich fragen ob du mit mir mitkommen willst.\" sagt sie und Tränen wandern von ihren Augen über ihre Wangen.<br>\r\n\"Ja, aber was wird aus meinem Leben in dieser Welt?\" fragst du.<br>\r\n\"Sobald wir in meine Welt überwechseln, werden alle Erinnerungen an uns aus Deren Gedächnis gelöscht.\" anwortet sie.<br>\r\n\"Ich weiss nicht. Ich hab ........\"\"Ich werde dich beschützen.\" unterbricht sie dich.<br>\r\n\"Wenn ich jetzt nein sage werde ich mir das den rest meines Lebens vorwerfen.\" sagst du.<br>\r\n\"Heißt das Ja?\" fragt sie dich im glücksrausch.<br>\r\n\"Ähm. Ja.\" antwortes du und bemerkst wie Eve vor freude hüpft.<br>\r\n\"Ok. Dann machen wir uns ..............\"</span></div></div>",
            "created":1250571600,
            "id":746567,
            "title":"(Viellecht hat sie recht) du drückst auf die Hupe."
        },
        "1413211":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Unterhalten hin oder her. Erstmal etwas zuessen machen.",
                "Eine ruhige unterhaltung"
            ],
            "content":"<div class=\"\"><div> <span>Ohne das du noch ein Wort raus bekommst nimmt Eve anlauf und schwingt sich in die Luft.<br>\r\nDu kannst dich nirgends festhalten und wirst durch den starken Wind zwischen ihre Augen befördert.<br>\r\n\"EVE. STOP.\" schreist du panisch.<br>\r\n\"Upps.\" sagt sie mit einem kichern und greift dich mit zwei Krallen.<br>\r\n\"Hier bist du sicher aufgehoben.\" sagt sie und wirft dich auf etwas weiches, nasses.<br>\r\n(Wo bin ich?) fragst du dich und bemerkst wie Eve dich dich in ihr Maul geworfen hat.<br>\r\n\"Nein. Bitte nicht schlucken.\" schreist du.<br>\r\n\"Keine Angst mein kleiner Schatz. Lehn dich zurück und geniess den Flug.\" sagt sie wobei ihre Zunge hektisch hin und her zuckt.<br>\r\nAls sie dann ihr Maul schliest, bemerkst du das das Fleisch um dich herum Licht abgibt.<br>\r\nDu hört auf sie und legst dich auf ihre Zunge.<br>\r\n(Bitte nicht schlucken.) sagst du dir immer wieder und versucht dich zu entspannen.<br>\r\nPlötzlich fühlst du wie dein Körper kribbelt.<br>\r\n\"So wir sind jetzt in meiner Welt.\" sagt sie mit zuckender Zunge.<br>\r\nNach wenigen minuten öffnet sich Eves Maul und ihre Zunge schmeist dich durch die Luft.<br>\r\nDu landes auf etwas weiches und siehst das Eve dich auf ein Kissen befördert hat.<br>\r\n\"Da wir jetzt endlich unser Heim erreicht haben. Können wir uns über uns Unterhalten.</span></div></div>",
            "created":1250924100,
            "id":748119,
            "title":"Das Drachen-Hort"
        },
        "142":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Fuchs (80 meter)",
                "Drache (70 meter)",
                "andere Tiere"
            ],
            "content":"<div class=\"\"><div> <span>Nach deiner Morgenhygiene gehst du an den Frühstückstisch und isst dir eine schnitte Brot.<br>\r\nEs dauert nicht lange, da stört dich das klingel von deinem Telefon.<br>\r\n\"Hallo. Folrentina Klein.\" antwortes du in den Hörer.<br>\r\n\"Ja Flo. Hier ist ihr Chef. Sie müssen sofort zu einer Flutkatastrophe und dort ein Bericht darüber verfassen.\" befiehlt dein Chef.<br>\r\n\"Wird gemacht.\" gibst du noch von dir und legst auf.<br>\r\n(Oh man. Das leben eines Reporters ist anstrengend.) denkst du dir und machst dich fertig zur Abreise.<br>\r\nIn weniger als einer Stunde ereichst du den Flughafen und erwischt noch rechtzeitig einen Hubschrauber der zum Katastrophengebiet unterwegst ist.<br>\r\n\"Verzeihung. Ich gehöre zum Rettungsteam.\" lügst du dich in den Helikopter und kommst auf diese Art zur Flut.<br>\r\nEs dauerte nicht lange bis ihr zum Landeanflug ansetzt und du die ersten Blicke auf das Spektakel werfen kannst.<br>\r\n\"Der Damm ist gebrochen. Also wird das Wasser nicht weiter steigen.\" versucht dich der Pilot zu beruhigen.<br>\r\nIhr landet direkt an dem reissenen Fluss und seht unzählige Menschn auf den Dächern am ausharren.<br>\r\n\"Die bis jetzt geretetten bitte ich in den Hubschrauber einzusteigen.\" sagt der Pilot und hebt ab als alle bereitz geretteten im Hubschrauber sitzen.<br>\r\nDu bist jetzt alleine und weisst nicht wie du helfen kannst.<br>\r\nPlötzlich bebt die Erde in einem eigenartigen rhythmus und ein riesiger ........ waatet durch das Wasser.</span></div></div>",
            "created":1249275600,
            "id":737812,
            "title":"Der Job ruft"
        },
        "1421":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Weiblich",
                "Männlich",
                "Taur"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Weiblich: <a rel=\"nofollow\" href=\"http://www.taurinfox.com/art/2002/vixen.jpg\" target=\"_blank\">http://www.taurinfox.com/art/2002/vixen....</a><br>\r\nMännlich: <a rel=\"nofollow\" href=\"http://www.taurinfox.com/art/2002/intheden.jpg\" target=\"_blank\">http://www.taurinfox.com/art/2002/inthed...</a><br>\r\nTaur Männlich <a rel=\"nofollow\" href=\"http://www.taurinfox.com/art/2002/forest_taur.jpg\" target=\"_blank\">http://www.taurinfox.com/art/2002/forest...</a> , Weiblich <a rel=\"nofollow\" href=\"http://www.taurinfox.com/art/2002/defending_the_forest.jpg\" target=\"_blank\">http://www.taurinfox.com/art/2002/defend...</a> oder Zwitter <a rel=\"nofollow\" href=\"http://www.taurinfox.com/art/2008/Herm-Foxtaur.jpg\" target=\"_blank\">http://www.taurinfox.com/art/2008/Herm-F...</a></span></div></span></div>",
            "created":1249275600,
            "id":744322,
            "title":"Fuchs (80 meter)"
        },
        "14211":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "In einem riesigen Zimmer. (Die Wohnung der Füchsin)",
                "Weitere Wahl"
            ],
            "content":"<div class=\"\"><div> <span>Ausserhalb des Gefahrenbereichs siehst du diese riesige Fuchsfrau, wie sie vorsichtig sich auf die Menschen zubewegt.<br>\r\nSchnell schnappst du deine Kamera und knipst wie verrückt.<br>\r\n\"Ich will euch helfen.\" sagt die Füchsin und deugt sich zu den vom Wasser eingeschlossenen Menschen.<br>\r\nSie nimmt so viele in ihre Hand wie sie nur kann und bemerkt das, dass Wasser steigt.<br>\r\n\"Wir haben keine Zeit mehr. Ich hoffe ihr nehmt mir das nicht Übel.\" sagt das Fuchsmonster und wirft alle in ihr Maul um ihre Hände frei zu haben um die letzten Menschen zu retten.<br>\r\nDu fotografierst immernoch und machst dich durch den Blitz aufmerksam.<br>\r\n\"Scheiße!\" schreist du als die Füchsin sich auf dich zubewegt.<br>\r\n\"Schuldigung. Ick daf kaine Schpuren hinta lassn.\"(Entschuldigung, Ich darf keine Spuren hinter lassen.) versucht sie mit vollen Maul zu sagen und greift dich.<br>\r\nSobald du auch in der Gewalt der Füchsin bist geht sie mit euch aus die Richtung aus der sie gekommen ist.(Fluss aufwärts.)<br>\r\nEin schimmerndes Licht siehst du in einer Felswand wo das Wasser rausfliest.<br>\r\n\"Bite fesct halden.\"(Bitte Festhalten.) sagt die Füchsin und spingt in die Felswand.<br>\r\nDu fühlst dich wie hin und hergerissen als ihr in eine Art Portal schreitet.<br>\r\nIhr alle habt einen kurzen Black-Out und seht direkt ein helles Licht.<br>\r\n<br>\r\nWo seid ihr?</span></div></div>",
            "created":1249448400,
            "id":739235,
            "title":"Heldenhafte Füchsin"
        },
        "142111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "erbricht sie sich.",
                "hustet sie ein paar Menschen aus."
            ],
            "content":"<div class=\"\"><div> <span>Sie stürzt und ihr fallt alle auf auf einen nassen Teppich.<br>\r\n\"BUURRP.\" hörst du hinter dir und siehst wir die Füchsin die Menschen ausspuckt.<br>\r\nDie Füchsin keuchte erschöpft:\"Ich hoffe es geht allen gut.\"<br>\r\nFast alle waren vor Angst erstarrt, ausser ein paar Männern.<br>\r\n\"GUT? DU MONSTER HAST UNS ENTFÜHRT!\" schreit ein Mann der den anderen Menschen aus der Speichelpfütze hilft.<br>\r\n\"Hey. Ich habe euch grade das Leben gerettet.\" erwiedert die Füchsin und fängt an zu Husten.<br>\r\n\"UND WARUM HAST DU UNS ENTFÜHRT?\" schreit der Mann wieder.<br>\r\n\"Es darf niemand wissen das ich existiere.\" hustet sie.<br>\r\n\"WARUM DIE RETTUNG?\" schreit der Mann.<br>\r\n\"Ich hab die Wanne überlaufen lassen und das ist in eure Welt geströmt. Ich wollte das niemanden was passiert.\" hustet sie.<br>\r\n<br>\r\nPlötzlich ........</span></div></div>",
            "created":1249448400,
            "id":739264,
            "title":"Eine Erklärung"
        },
        "1421111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Sie kommt wieder.",
                "Sie brauch noch etwas."
            ],
            "content":"<div class=\"\"><div> <span>(Büüh) Sie erbricht sich und einige Menschen werden von der Magensäure weggespühlt.<br>\r\n\"Es tut mir leid. Mir steckte noch etwas in meinem Hals.\" sagt sie erleichtert.<br>\r\n\"DU MEINST WOHL JEMANDEN!\" schreit der Mann wieder als er einer Frau aus der Kotze hilft.<br>\r\n\"Es tut mir unentlich Leid. Aber ihr werdet ab heute bei mir leben müssen.\" sagt sie und stehlt sich hin.<br>\r\nVorsichtig steigt sie über euch und nimmt eine Kehrschaufel.<br>\r\nVon Panik überflutet rennt ihr zur Wand (wo ihr durch gekommen seid) und schlägt und tretet dagegen.<br>\r\nVorsichtig stellt sie die Kehrschaufel vor euch und sagt:\"Das Portal ist zu und wird nicht mehr aufgehen. Kommt lieber auf die Schufel. Ich muss hier mal eben sauber machen.\"<br>\r\nIhr tut was die Füchsin sagt und geht auf die Plastikschaufel.<br>\r\nEtwas ruppig hebt sie die Schaufel an und stellt euch in ein Nebenzimmer auf einen Tisch.<br>\r\n<br>\r\n\"Ok. Ich mach mal eben sauber und dann komm ich zurück.\" sagt sie und geht weg</span></div></div>",
            "created":1249448400,
            "id":739294,
            "title":"erbricht sie sich."
        },
        "14211111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Badezeit ist zu ende",
                "Ein Besucher klopft an die Tür"
            ],
            "content":"<div class=\"\"><div> <span>Ihr habt nicht mal eine Minute um euch zu unterhalten, als Sie wiederkommt.<br>\r\n\"Also das ist erledigt.\" sagt sie zu sich selbst und setzt sich vor euch auf eine Couch.<br>\r\n\"Ich weiss das ihr immernoch Angst vor mir habt, aber wenn ich euch töten wollte hätt ich es schon längst getan.\" sagt sie mit ruhiger Stimme.<br>\r\n(Irgend wie hat sie ja recht.) hörst du aus den Reihen.<br>\r\n\"Also ich wollte vorhin ein Bad nehmen und einige von euch brauchen das wohl auch nach meinem Kotzen.\" sagt sie und legt ihre Hand(Pfote) vor euch.<br>\r\nEinige gehen zögerlich zu ihr und klettern auf ihre Hand.<br>\r\n\"Ich komme gleich wieder.\" sagt sie und geht mit einer Hand voll Menschen weg.<br>\r\nEin Mann geht auf dich zu und sagt:\"Sie haben doch diese Fotos gemacht.\"<br>\r\n\"Ja.\"<br>\r\n\"Hi, mein name ist Georg.\"<br>\r\n\"Meiner ist Folrentina. Aber alle nennen mich Flo.\"<br>\r\n\"Sag mal Flo. Meinst du das diese Füchsin uns nur helfen will?\"<br>\r\n\"Ich denke schon.\"<br>\r\n<br>\r\nBOOM BOMM BOOM.</span></div></div>",
            "created":1249448400,
            "id":739639,
            "title":"Badezeit"
        },
        "142111111":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "kommt ihr Mann nach hause.",
                "kommt ihr Sohn nach hause."
            ],
            "content":"<div class=\"\"><div> <span>Die Füchsin kommt mit den Menschen und durchnässten Fell wieder und setzt sich vor euch auf einen Stuhl.<br>\r\n\"So. Das währe erledigt.\" sagt sie und schüttelt sich ihren Kopf trocken.<br>\r\nDas Wasser spritzt nur so durch die Gegend und trifft auch euch.<br>\r\nErst nachdem sie sich geschüttelt hat, bemerkt sie ihren Fehler und guckt besorgt.<br>\r\n\"Upps. Das tut mir leid. Hier, damit könnt ihr euch abtrocknen.\" sagt sie und legt ein Taschentuch vor euch.<br>\r\nWortlos geht ihr zum Taschentuch und trocknet euch ab.<br>\r\n\"Habt ihr hunger oder durst?\" fragt sie freundlich und steht schon vorbereitet auf.<br>\r\nEin durcheinander von \"Ja/Hunger/Durst\"kommt von euch, wobei du nur einen quelenden Durst verspührst.<br>\r\n\"Sekunde ich hol euch etwas.\" sagt sie und geht weg.<br>\r\nNach einer Weile kommt sie wieder und hat zwei große Gläser in der Hand(Pfote).<br>\r\n\"Ich hoffe es macht euch nichts aus in eurem Trinken zu schwimmen. Ich hab keine Mini-gläser.\" kichert sie und stellt die zwei Gläser vor euch ab.<br>\r\n\"Ich helfe euch.\" sagt sie und hebt euch vorsichtig einen nach dem anderen ins Glas.<br>\r\nErst jetzt bemerkt ihr das Orangensaft in den Gläsern ist und findet es halb so schlimm in dem eigenden Trinken zu schwimmen.<br>\r\n\"Ok. Ich mach euch schnell etwas zu essen und dann könnt ihr euch erstmal erholen.\" sagt sie und geht wieder weg.<br>\r\nPlötzlich ...........</span></div></div>",
            "created":1250312400,
            "id":744338,
            "title":"Badezeit ist zu ende"
        },
        "15":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "ein Kangaroo",
                "eine Kuh",
                "ein Pferd",
                "ein Mytisches Tier",
                "ein Meerestier"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Du bist ........</span></div></span></div>",
            "created":1190869200,
            "id":448305,
            "title":"Wer bist du?"
        },
        "151":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich oder weiblich</span></div></span></div>",
            "created":1190955600,
            "id":448306,
            "title":"M oder W"
        },
        "1512":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Macro (50 meter)",
                "Normal (Menschengröße)",
                "Micro (2 zentmeter)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Werlcher größen ordnung gehörst du an?</span></div></span></div>",
            "created":1194843600,
            "id":463284,
            "title":"Welche größe?"
        },
        "15121":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "ein paar Menschen.",
                "(weitere Ideen)"
            ],
            "content":"<div class=\"\"><div> <span>Du warst grade in der Stadt um einige erledigungen zu machen als dir ein neues Geschäft ins Auge fällt.<br>\r\n&gt;Sklaven Haus&lt;<br>\r\nInterssehalber gehst du rein und endeckst lauter Käfige mit verschiedene Anthros und Menschen, in verschiedenen größen.<br>\r\n\"Willkommen in unserem Laden.\" begrüßt dich ein kleiner Anthro-Tiger und schaut an deinen muskulösen Beinen hoch.<br>\r\n\"Kann ich Ihnen helfen?\" fragt Er freundlich und weisst auf die Auswahl an Sklaven hin.<br>\r\n\"Ähm, eigendlich wollte ich nur mal reinschnuppern was das für ein Geschäft ist.\" antwortes du ihm freundlich und beugst dich zu ihm runter.<br>\r\n\"Keine Scheu. Diese Sklaven wurden so erzogen das Sie alles machen was man ihnen sagt.\" versucht der Tieger dich zu überzeugen.<br>\r\nDu hast dich bereits entschieden und willst ihm einige Sklaven abkaufen.<br>\r\n\"Ja Ok. Ich schau mich um und such mir ein Paar raus.\" antwortes du ihm und gehst durch die Regale. <br>\r\nDich reitzt es schon seit Jahren einen Sklaven zur belustigung zu haben und findes ......</span></div></div>",
            "created":1194843600,
            "id":463285,
            "title":"Sklaven handel"
        },
        "151211":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "(Böse absichten)",
                "(Gute absichten)"
            ],
            "content":"<div class=\"\"><div> <span>Du greifst ins Regal und holst einen Käfig mit 10 kleine nackte Menschen raus.<br>\r\nSofort gehst du zur Kasse und stehlst den Käfig ab.<br>\r\n\"Eine Gute Wahl.\" sagt der Tiger und scennt das Etikett.<br>\r\n\"Das macht 20 € ohne Käfig.\" du greifst in deinen Bauchbeutel und holst einen 20 € schein raus.<br>\r\n\"Danke. Einen Käfig brauch ich nicht.\" sagst du freundlich und hebst den Käfig auf Beutelhöhe.<br>\r\nOhne scheu lässt du deine Sklaven in deinen Beutel gleiten und setzt den Käfig wieder ab.<br>\r\nDu verabschiedes dich kurz und gehst dan nach Hause.<br>\r\nDu hoffst das die Kleinen nicht zerdrückst und guckst zwischendurch immer wieder in den Hautsack.<br>\r\nEinige versuchen sich in deinem Beutel einen sicheren Platz zu suchen, damit Sie nicht unter deinem Krims-Kram verschüttet werden. <br>\r\nDich amüsiert das nur und du gehst in dein Heim.<br>\r\n\"Entlich zu hause.\" denkst du laut und streifst deine Schuhe ab.<br>\r\nNachdem du dich entkleidet hast setzt du dich in deinen Sessel und holst deine Sklaven aus dem Beutel .....</span></div></div>",
            "created":1194843600,
            "id":463287,
            "title":"Zuhaus"
        },
        "152":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich(dann natürlich Stier)",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich oder weiblich</span></div></span></div>",
            "created":1190955600,
            "id":449208,
            "title":"M oder W"
        },
        "153":{
            "author_id":"nipeda",
            "author_name":"nipeda",
            "choices":[
                "Männlich",
                "Weiblich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Männlich oder weiblich</span></div></span></div>",
            "created":1190955600,
            "id":448308,
            "title":"M oder W"
        },
        "154":{
            "author_id":"conelskie",
            "author_name":"conel",
            "choices":[
                "Greif / Greifin",
                "Phoenix",
                "...(weite Optionen)..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Du bist ein / eine...</span></div></span></div>",
            "created":1198040400,
            "id":477316,
            "title":"Mystische Tiere...?"
        },
        "1541":{
            "author_id":"conelskie",
            "author_name":"conel",
            "choices":[
                "...männlichen Teiles deiner Rasse",
                "...weiblichen Teiles deiner Rasse"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>...und bist ein perfekt aussehender Vertreter des...</span></div></span></div>",
            "created":1198040400,
            "id":477318,
            "title":"männlich oder weiblich?"
        },
        "15412":{
            "author_id":"conelskie",
            "author_name":"conel",
            "choices":[
                "...bist du ein Macro (30-Meter groß)",
                "...bist du normalgroß, undt stolz darauf. (1,70 m)"
            ],
            "content":"<div class=\"\"><div> <span>Du betrachtest dich (in deinen Schlafklamotten gekleidet) mit deinen bersteinfarbenen Augen im Spiegel. Du hast einen kräftigen, schönen dunkelgrauen Schabel, hellbraune Federn, deren Enden in's schwarze übegehen, die deinen deinen Körper bis zur Hüfte bedecken. <br>\r\nSchlaftrunken fährst du mit deinen ebenfalls dunkelgrauen Adlerklauen gähnend durch dein (durch den Schlaf zerzausten) schulterblattlangen, dunkelblonden Haaren.<br>\r\nDeine breiten Schwingen ähneln den Flügeln eines Kaiseradlers (worauf du ziemlich stolz bist) und ab der Hüfte beginnt bei dir der Übergang von den Adlerfedern in ein dunkelbraunes, schwarz geflecktes Pumafell, und als du dich beginnst zu Strecken, wedelt etwas dein Pumaschwanz mit, dessen Ende leicht von langen, schwarzen Federn bedeckt ist, damit du beim fliegen besser Steuern kannst. Deine starken, sportlichen Beine und dein wohlgeformter Körper sehen insgesamt (für die Männer) sehr Ansprechend aus.<br>\r\nAuserdem...</span></div></div>",
            "created":1198040400,
            "id":477322,
            "title":"Die Greifin erwacht"
        },
        "1542":{
            "author_id":"emeralwizard",
            "author_name":"lord of emeralds",
            "choices":[
                "männlich",
                "weiblich",
                "ungeschlechtlich"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Bist du ....?</span></div></span></div>",
            "created":1269458640,
            "id":856101,
            "title":"Phoenix"
        }
    },
    "info":{
        "author_id":"nipeda",
        "author_name":"nipeda",
        "brief_description":"Eine Deutsche Interactive Vore Story (German)",
        "created":1190879940,
        "description":"<td align=\"left\" class=\"norm\">Macro, Micro, Vore, Unbirthing, Wachsen, Schrumpfen.<br>\r\n<br>\r\nFür echte Vore-Fans dürfte das verständlich sein.<br>\r\n<br>\r\nEs geht um Anthro-Wesen (Menschliche Tiere die Kleidung tragen und reden können.)<br>\r\n<br>\r\nEs muss ein größenunterschied sein der es möglich macht das Opfer ohne probleme zu verschlingen.<br>\r\n<br>\r\nWer sich ein genaueres Bild machen will wie der Größenunterschied sich auswirkt kann sich auch unter <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://vms.bigfurs.com/\" target=\"_blank\">http://vms.bigfurs.com/</a> informiren.<br>\r\nSchreibt in den Anfang einer Story-kette einen Link wo eine Abbildung des Anthros ist. (<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.furaffinity.net\" target=\"_blank\">http://www.furaffinity.net</a> <a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.deviantart.com\" target=\"_blank\">http://www.deviantart.com</a> und ähnliche seiten)<br>\r\n[Alle Bilder die entnommen werden sind in den meisten Fällen Urheberrechtlich geschutzt. z.B. Copyright]<br>\r\nNichts blutiges. Nur was oben steht.<br>\r\n<br>\r\nViel spaß beim schreiben <img loading=\"lazy\" style=\"\" src=\"https://images.Writing.Com/imgs/writing.com/writers/e15/wink.png\" alt=\"*Wink*\" class=\"emoteZ\" title=\"Wink\" border=\"0\" width=\"15\" height=\"15\"></td>",
        "id":1324374,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1514725620,
        "modified":1514725620,
        "pretty_title":"Deutsche Furry Vore"
    }
}