{
    "chapters":{
        "1":{
            "author_id":"sean1613",
            "author_name":"sean 13 16",
            "choices":[
                "family room",
                "your room",
                "mom's room",
                "sister's room",
                "kitchen"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This is a simple way to start it off, here are you shrunk?</span></div></span></div>",
            "created":1305785220,
            "id":1108810,
            "title":"Where are you shrunk"
        },
        "11":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "The couch",
                "The coffe table",
                "The floor",
                "The counter separating the kitchen and family room",
                "Beanbag chair"
            ],
            "content":"<div class=\"\"><div> <span>You walked into your family room so you could watch some t.v. before your mom or sister decided they want to steal it from you. You hadn't been feeling too good all day and thought something relaxing might help. As your walking across the room a sharp painful headache hits you and you stumble forward as you black out. <br>\r\n<br>\r\nWaking up you slowly open your eyes since the headache seems to have left them a bit sensitive to the light. Once your sure they are fine you sit up while opening your eyes and take a look around. Every thing is strange looking. You start to panic when you Notice you've actually been shrunken down. A loud booming sound is heard followed by huge earthquake like tremors. You sister and mom enter the room. Looking around Quickly you see that you are on....</span></div></div>",
            "created":1503219300,
            "id":2371843,
            "title":"family room"
        },
        "12":{
            "author_id":"orr4eva",
            "author_name":"4eva",
            "choices":[
                "You shrink fast (1 inch tall)",
                "You shrink fast (3 inches tall)",
                "You shrink fast (6 inches tall)",
                "You shrink fast (Near microscopic size)",
                "You shrink slowly throughout the day."
            ],
            "content":"<div class=\"\"><div> <span>Despite it being a Friday, today seemed like a considerably long day at school. You finally make it to the comfortable confines of your home, where you seem to be home alone for now. Walking through your bedroom door, you drop down your backpack and flop onto your bed; letting out a deep sigh. You were actually supposed to be going on a school trip that would last for the duration of the weekend which would also be a three day weekend due to a Teacher's Workday. You were at your house because you forgot to pack a couple of things. As your search through a box, something inside of it catches your eye. You pick up what seems to be some kind of glass vial filled with a clear liquid that looked like ordinary water. <br>\r\n<br>\r\n\"What is this?\" you ask aloud as you turn the vial around in all angles to examine it. You pull off the top of the vial and take a whiff... it had no smell. You then decide to drink a small sip to test it.<br>\r\n<br>\r\nPSSSShhhhhhhh........<br>\r\n<br>\r\nYou spit out the liquid and through away the vial, but you already swallowed some of it.<br>\r\n<br>\r\n\"That was disgusting, were the hell did that come from?\"<br>\r\n<br>\r\nYou are about to continue packing when you suddenly get a large headache. You haven't really been feeling good this whole day and you wonder if it's worth it to go on the school trip. After some consideration you finally decide to call the assembler of the trip and explain that you didn't feel good and wouldn't be able to make it. You then decide to take some Aspirin pills and then watch some TV.</span></div></div>",
            "created":1306241280,
            "id":1111852,
            "title":"Let the Fun Begin!"
        },
        "124":{
            "author_id":"orr4eva",
            "author_name":"4eva",
            "choices":[
                "Stay in the bedroom.",
                "Explore outside the room.",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>Before you can even turn your television on, your body starts to have a very strange tingly under your skin feeling spread throughout it. You notice your clothes begin to feel very loose and heavy. Everything in your room is growing and expanding! You realize that you are shrinking! You watch as everything gets bigger and bigger, your clothes are starting to slip off of you. You rip off the clothing, knowing that if you don't do it now while you have the size and the strength, it will probably smother you! <br>\r\n<br>\r\nYou were completely naked and still shrinking, by now you were under the height of your nearby dresser. You collapsed to the ground very soon, between the headaches, tingly feeling and the shock; you pass out on your bedroom floor.<br>\r\n<br>\r\nA few minutes later you wake up except it was like you were in a whole new world. You were surrounded amongst a jungle of tree-sized tan strands of fabric. You climbed up one of these strands until you reached the frayed surface on top. From up here you realized that you were on top of a single carpet strand out of the millions throughout the house. You could see the items of your bedroom like your dresser and bed, tower like gigantic buildings. The ceiling was like a sky, seemingly several miles above. <br>\r\n<br>\r\n\"Shit, this is crazy\", you say aloud, \"I'm going need to get someone's help.\" You think that it shouldn't be that big of a problem but then you remember that your mom and older sister both think you are on that field trip still! It would already be hard enough to get their attention at this size but when they aren't expect to see you for next three days? Things are a little more complicated. <br>\r\n<br>\r\nYou need to figure out your next move. What will that be?<br>\r\n</span></div></div>",
            "created":1306252080,
            "id":1111940,
            "title":"Complicated Predicament"
        },
        "1242":{
            "author_id":"orr4eva",
            "author_name":"4eva",
            "choices":[
                "Try to climb onto her.",
                "Let her go and find a safer way.",
                "Reader's Choice"
            ],
            "content":"<div class=\"\"><div> <span>\"If no one is expecting me to come home for the next few days, there is no need to stay inside this bedroom...\", you think aloud, \"Maybe my Mom or my sis is home. They would help me if I can get to them!\" You walk amongst the top of the carpet strands, careful not to fall in between them and into the abyss under the carpet. It would make a few moments but you would finally reach your vast bedroom door. The door was closed but you were easily able to walk under the large gap under the door. You were now in the hallway. The hallway was no long an enclosed, sort of cramped walkway but a large expanse of carpeted floor and a few doors on the walls. <br>\r\n<br>\r\nYou look to see where you should travel next when suddenly the ground vibrates with intense energy. A thunderous booming is heard in an rhythmic pattern. You look down the hallway to see the source pop into view. It was you older sister, but now a giantess, no, at your very insignificant height, she was much more. She was a goddess to you. You cried out and waved your arms as she walked down the hallway towards your direction. She wore a plaid v-neck shirt that showed her well-developed cleavage and wore tight fitting jeans. Her beautiful blonde hair flowed with each step from bare-feet crashing onto the hallway floor; causing the loud noises and the earthquakes! \"Sis!\", you cried out but 1) your voice was too small, 2) even if she heard you, you were way too tiny to be seen, 3) it didn't help that she was too busy talking on her cell phone.<br>\r\n<br>\r\n\"Yeah, I think he likes her but just doesn't want to show it to act cool!\", your sister (sis') says on the phone with a loud powerful voice. As she got closer, you realized just how insignificant you were. She seemed to be more than a mile in height! Her barefeet were easily larger than more than a couple of aircraft carriers placed top and bottom. You stayed near the wall of the hallway as to avoid her gigantic foot as she stepped right next to you. You cringed as the ground shook more than ever from her being so close. You look up and see that your sis seems to be adjusting something on her clothes for a quick second. Now can be your chance to do something.</span></div></div>",
            "created":1306253040,
            "id":1111945,
            "title":"Sis!"
        },
        "13":{
            "author_id":"azra",
            "author_name":"Azra",
            "choices":[
                "They smile - they shrank you on purpose!",
                "They don't know what happened!"
            ],
            "content":"<div class=\"\"><div> <span>You woke up to a common feeling in a room not your own. You could feel the large weight on top of you, pinning you down into her bed. You could feel and taste and smell her feet as she rubbed them over your face - one blocking your nose, the other with plump, painted toes pointed into your mouth. Nothing unusual so far. Then you could feel your sister's feet join your mother's on your face. Her smaller, pale toes rubbed your cheeks in loving reassurance and mockery as she held your head stiff, allowing your mom to fit more of her foot into your mouth. You glanced at the bedside clock - 9:15am. Your exam had started a quarter of an hour ago. Looks like you weren't going to school today. You'd pleaded with your mom for weeks about this. Finally, after weeks of good behaviour and submission to her and your sister your mom had agreed to let you take your last exam today after you'd allowed her to stomp and squish your unprotected groin for an hour straight. Your mom loved you dearly, you knew that, but she also took great pleasure in dominating you physically, especially by standing on your boy-parts and sitting on your face.<br>\r\n<br>\r\nYour sister was doing something. You couldn't hear what because she'd clamped her feet over your ears, but she was scattering pixie dust over your face and your mom's right foot and was reciting something that sounded somewhere between a curse and wedding vows as your tongue lay against the bottom of your mom's meaty sole and her toes tickled the back of your throat. Suddenly she stopped, and everything changed. She released your ears but only briefly as she coiled her toned cheerleader legs around your neck and held your face tight to the bed, strangling you. Your mom looked so excited she was trembling, her immense gelatinous bum jiggling where it lay against your beaten groin as she pinched her purple-painted toes shut over your nose and, with a loving kiss, shoved her big foot down your throat to her ankle. You choked, tried to breath but your mouth and nose were blocked. You bucked your hips, but were tied securely to the bedposts. Soon, your body gave in, and you went under, the bottom of your mom's foot on your tongue.<br>\r\n<br>\r\nYou were still on your mom's bed, but they were nowhere to be seen. You walked to the edge of the room, head still spinning, and pumped into the wall. It was warm, soft and squishy. And smelled just like your mother's foot. \"No-!\"<br>\r\n<br>\r\nYou opened your mouth and dragged your tongue across the surface. You had to know. \"That taste ...\" Panicking, you stuck your tongue out again and licked again and again, but no matter what the taste and smell were coming back now. Suddenly you felt a slightly softer texture in the wall, a different variety, and then you heard massive, earth-rattling giggling as your sister moved her feet away from you and your mom and sis stared down at your now shrunken body.<br>\r\n<br>\r\nYou were used to submitting to your mom and big sister's dominant fetishes - they took care of you after all - but this was something new entirely!<br>\r\n<br>\r\n\"What ... what is this?\"</span></div></div>",
            "created":1326893100,
            "id":1260912,
            "title":"mom's room"
        },
        "131":{
            "author_id":"gamedragon642",
            "author_name":"Gamedragon642 ",
            "choices":[
                "Your sister leaves you as her thong to forever be with her ass",
                "She pushes you into her asshole and digests you",
                "She gives your mother a turn"
            ],
            "content":"<div class=\"\"><div> <span>You now only about a foot tall sitting there dazed and confused while your mom and sister stare at you with immense anticipation. Your mother firmly grasped your body and before you could ask what was happening your sister bent over and slid her panties to the side. You were slightly turned on but mostly terrified as your mom gave you a big kiss she cramed your bode between your sisters ass checks (not in her ass but the same way thing sits outside of there ass) she then sets her panties back to where they were and put on an insanely tight pair of leggings. And with that you were stuck now all you are is a thong strap for your sister. As you hear your mother and sister laugh at you you begin to lose consciousness as your sisters ass fumes are to much for you to handle you pass out with only being in your new home for about 30 seconds.<br>\r\n<br>\r\n<br>\r\nWhat happens in the story next?<br>\r\n</span></div></div>",
            "created":1576393380,
            "id":2759779,
            "title":"Your sisters new thong "
        },
        "14":{
            "choices":[
                "Ask Your Sister To Crawl Into Her Bed With Her Friends",
                "Study The Underwear",
                "Use Your Sisters Bathroom",
                "Go Somewhere Else",
                "She Wakes Up"
            ],
            "content":"<div class=\"\"><div> <span>You're Josh, a 15 year old boy living together with your super sexy mother and sister.<br>\r\nYour friends have always talked about your family's voluptuous bodies, even though it creeps you out, you know it's true. Both your mother and sister have massive asses, which noone else in town could compete with, they were big, but not too big, as well as thick but soft. The perfect asses in their opinions. Even though your mother has a slight bigger ass than your mother.<br>\r\nTheir chests are massive, and they are even trying to show maximum cleavage at all times.<br>\r\n<br>\r\nYour mother likes to wear thongs that seem too small for her butt size, often resulting in the strings preassuring against her body, and dissapearing into her asscrack. Her massive pussy struggles to break free from the small prison, showing a cameltoe and slightly pours out of her thong, thus there is pretty much no room left in her thong.<br>\r\n----------------------------------<br>\r\n<br>\r\nIt was about midnight.<br>\r\nYou woke up from a terrible nightmare, scared you almost to death. You really didn't want to sleep alone. Even though your sister takes every opportunity she can get to humiliate and embarress you, you still know that deep down, she still loves you.<br>\r\nAs thunder and lightning boomed outside, the hallway you now walked through seemed to be part of a horror movie.<br>\r\n<br>\r\nBut finally you stood in front of your sisters room. You didn't want to knock but rather gently wake her up. you slowly pushed the door opened and walked in, the slight scent of morning and rich perfume hits your nose, the slight smell of female bodies made you slightly horny. But you didn't really want to think about that while in your sisters room.<br>\r\nAs you walked towards the bed, she had the cover over her head, but something wasn't right...<br>\r\nYou saw 3 pairs of feet, curious of who it was, you uncovered the sleeping beauties.<br>\r\n<br>\r\nIt was your sister's two best friends.<br>\r\n<br>\r\nSamantha, 18 years old, african american with a huge ass, pretty much the only one you can at least compare with your sister's.<br>\r\nShe is really hot too, if you thought you'd had a chance on her, you would totally hang out with her more.<br>\r\nShe also come here regulary to use the gym in your basement<br>\r\nPictures:<br>\r\n<a rel=\"nofollow\" href=\"http://gallys.rk.com/rb/405/1.jpg\" target=\"_blank\">http://gallys.rk.com/rb/405/1.jpg</a><br>\r\n<a rel=\"nofollow\" href=\"http://gallys.rk.com/rb/405/2.jpg\" target=\"_blank\">http://gallys.rk.com/rb/405/2.jpg</a><br>\r\n<br>\r\n<br>\r\nLindsay. 17 years old, caucasian, blond hair and light blue eyes, very tanned. Her ass is slightly smaller than Samanthas, but makes up for it with her huge breasts, but don't be fooled, compared to normal people, her ass is still high above average.<br>\r\nPictures:<br>\r\n<a rel=\"nofollow\" href=\"http://gallys.rk.com/mo/178/serving-some-ass-angelina-monstercurves-pic-1.jpg\" target=\"_blank\">http://gallys.rk.com/mo/178/serving-some...</a><br>\r\n<a rel=\"nofollow\" href=\"http://gallys.rk.com/mo/178/serving-some-ass-angelina-monstercurves-pic-2.jpg\" target=\"_blank\">http://gallys.rk.com/mo/178/serving-some...</a><br>\r\n<a rel=\"nofollow\" href=\"http://gallys.rk.com/mo/178/serving-some-ass-angelina-monstercurves-pic-3.jpg\" target=\"_blank\">http://gallys.rk.com/mo/178/serving-some...</a><br>\r\n<br>\r\n<br>\r\nThe scent of female bodies and perfume hits you harder. You remember now, your sister was at a big party today, she's probably drunk as hell, you could probably get away with asking if you can sleep in her bed, if you play your cards right, you might be lucky.<br>\r\n<br>\r\nOn the floor next to you were a big pile of thongs and bras, seeing as it's such a big pile, it's probably underwear from all three girls.<br>\r\nSince you've always been interested in underwear design, you feel tempted at studying them.<br>\r\n<br>\r\nThis whole thing got you so excited that you need to use your sisters bathroom, but is it worth spoiling the moment?<br>\r\n<br>\r\nYou think this is a bad idea, and decides to go somewhere else.<br>\r\n<br>\r\nOr your sister and her friends wake up, they are upset that you snuck in and removed the covers</span></div></div>",
            "created":1305857040,
            "id":1109233,
            "title":"Your Sister's Room!"
        },
        "142":{
            "choices":[
                "Shrink",
                "Transform into a small thong",
                "Transform into a medium bra"
            ],
            "content":"<div class=\"\"><div> <span>As the booming of the storm outside gave you chills, you decided to leave your sister alone for now, there isn't often you were given the chance to study 3 girls underwear. So you dashed over there, sat down and picked up underwear after underwear. There were all different kinds of underwear, different colors. There was a wide range of thongs, crunches, panties, wedged ones. Some of them even smelled used, suppose they forgot to wash some of them.<br>\r\n<br>\r\nAs the storm sounded angry, a lightning shot you through the roof, causing you to</span></div></div>",
            "created":1305874380,
            "id":1109366,
            "title":"Study The Underwear"
        },
        "15":{
            "author_id":"akplez",
            "author_name":"Mr. Phorcys",
            "choices":[
                "Kitchen ",
                "Bathroom ",
                "Backyard",
                "Basement",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kitchen or somewhere else?</span></div></span></div>",
            "created":1503179880,
            "id":2371592,
            "title":"kitchen"
        },
        "151":{
            "author_id":"sinzdarkcorner",
            "author_name":"Sinz",
            "choices":[
                "Your sister",
                "Your mom"
            ],
            "content":"<div class=\"\"><div> <span>You go into the kitchen feeling hungry for breakfast, no one else is awake yet which gives you plenty of time to yourself in the morning. You look into the fridge for something to eat and drink. Left over bacon from last night is in a tupperware container, guess you're having bacon, but what to drink? There's milk, but that's so ordinary compared to the different juices you see. There's some Hawaiian Punch, Sunny Day, but what's that blue juice? Mom must've picked it up the other day. Oh well, might as well try something new. You grab the juice and open it, then you take a few chugs to taste it, but you drank too much too fast and something starts happening, you feel sick to your stomach and start feeling different. Your head starts spinning, what is this? Some sort of sweet flavored alcohol? Why isn't it in the freezer where alcohol should be? Something else happened, when your head levels, everything is bigger! You're just an inch or two tall! Then you hear thuds, someone is coming!</span></div></div>",
            "created":1547747340,
            "id":2604162,
            "title":"Kitchen "
        },
        "155":{
            "author_id":"taiprime",
            "author_name":"TAI001 ",
            "choices":[
                "Attic",
                "Private study",
                "Somewhere else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where else could you be?</span></div></span></div>",
            "created":1503219540,
            "id":2371844,
            "title":"Somewhere else"
        }
    },
    "info":{
        "author_id":"sean1613",
        "author_name":"sean 13 16",
        "brief_description":"you are shrunk in you home with your mom and your older sister go wild",
        "created":1305785100,
        "description":"<td align=\"left\" class=\"norm\">hello, i love these types of stories so here it goes.<br>\r\nYou - whatever you look like<br>\r\n<br>\r\nMom -(40) tall, blond haired, big breasts, nice ass, and long legs, wold probably help you after she's played with you<br>\r\n<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.nndb.com/people/652/000044520/coolidge1.jpg\" target=\"_blank\">http://www.nndb.com/people/652/000044520/coolidge1.jpg</a><br>\r\n<br>\r\nOlder Sister -(18) tall, blond hair, nice breasts, small ass, would torture you endlessly<br>\r\n<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.henryhusak.eu/img/karolina-beauty.jpg\" target=\"_blank\">http://www.henryhusak.eu/img/karolina-beauty.jpg</a></td>",
        "id":1777598,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1576393380,
        "modified":1576393380,
        "pretty_title":"Shrunk in your home"
    }
}