{
    "chapters":{
        "1":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Trait Changer",
                "Swap by Touch",
                "Change your own body",
                "Clothes Morph",
                "Body Control"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Here is your option to enter one of the five choices.</span></div></span></div>",
            "created":1288501200,
            "id":984287,
            "title":"Choose your story"
        },
        "11":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Boy",
                "Girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Are you a teenage boy or a teenage girl?</span></div></span></div>",
            "created":1288501200,
            "id":984291,
            "title":"Trait Changer"
        },
        "111":{
            "author_id":"wassel29",
            "author_name":"Wassel",
            "choices":[
                "His mother",
                "His sister",
                "His friend Billy"
            ],
            "content":"<div class=\"\"><div> <span>Sean let out a yawn, scratching at his shaggy blond locks and dropping his Xbox controller onto the floor, having had enough of shooting up zombies for one night. His day so far had been a bit of a bust, having nothing but a pile of Geography homework (he had still yet to do) for company and all of his friend's either stuck at home in similar situations or out with their respective girlfriend's, presumably having a heck of a lot more fun than he currently was.<br>\r\n<br>\r\n\"Bah, who needs a girlfriend when you've got porn?\" he scoffed, pulling an old, worn out magazine from under his bed, trying to convince himself that it was a much better substitute in his given situation; girlfriend-less and seemingly doomed to stay that way. It wasn't even as if Sean was ugly or anything, being your average 16 year old kid, slightly short and scrawny perhaps, his appearance almost always a mess, but he wasn't hideous, it just seemed that all the girls he was interested in were far more impressed by chiseled jaws and washboard abs, things that only seemed to be found amongst the popular jocks or on the high school football team. They certainly weren't interested in an unathletic, slightly plain looking slacker who spent most of his time playing computer games or whacking off to the small collection of porn he'd somehow managed to accumulate.<br>\r\n<br>\r\nThose girls were all just bitches and sluts, he would tell himself in the hopes it would make him feel better, their only reason for sleeping with the kind of guys who spent most of the day pushing Sean up against lockers and tripping him up in the hallway was to climb the school social ladder. Still, that didn't stop him fantasizing about them, wishing he had some of those babes in his room instead of old pictures of incredibly fake breasted women, flaunting their bodies for his masturbatory pleasure. Picturing one girl, Kelly Simpson, captain of the cheerleading squad, he furiously worked his cock, imagining she was the big breasted slut on page 12, lying spread eagle with a long black dildo sticking out of her wet snatch. \"Oh yeah, oh yeah, you like that bitch?\" he gasped through gritted teeth, really getting into the fantasy, \"You like my big cock inside you huh? You like my big fucking dick?\" It was at that exact moment that he got somewhat of a shock, his relatively average sized penis seeming to have suddenly grown within his hand, pushing up and inch or two towards the ceiling. \"No...fucking...way\"\" he exclaimed, shortly before his body finally reached critical mass and he spurted out all over the pages of his magazine.<br>\r\n<br>\r\n\"Oh shit! That's all I need,\" he squealed, jumping to his feet and rushing to quickly clean up the mess, annoyed that he'd ruined one of his only good spank mags, the incident with his growing dick having been all but completely forgotten. <br>\r\n<br>\r\n\"What are you doing?\" a voice suddenly said from behind just as he'd managed to get his pants back on, giving him somewhat of a shock as he turned round to see...</span></div></div>",
            "created":1288587600,
            "id":985140,
            "title":"Boy"
        },
        "1111":{
            "author_id":"saracen1187",
            "author_name":"Triss Merigold",
            "choices":[
                "...he swapped a trait with her",
                "...she was changing.",
                "...he swapped her traits with someone else."
            ],
            "content":"<div class=\"\"><div> <span>Sean was partly horrified to see his mother standing there, and he tried not to look down at the stained porn mag lying on the floor, hoping his mother would do the same. But he sighed as he saw her eyes divert down towards the floor. <i>\"Shit!\"</i> he thought. \"I wish you would try and find yourself a girlfriend you know\" was all she said to him, as she then gave him a disapproving shake of her head. She obviously thought it wasn't healthy for her teenage son to be staying indoors 'wacking' off to porn magazines.<br>\r\n<br>\r\n\"Easier said than done mom!\" Sean grumbled, as he zipped up his pants and use his foot to close the magazine. He'd just have to buy himself another one from the store he reckoned. Right now all he wanted was his mom off his back and out of his room.<br>\r\n<br>\r\n\"Do you want something mom??\" he asked her.<br>\r\n<br>\r\n\"I need you to pop to the store and get some milk and bread honey\" she responded. \"I also...need you to get me some sanitary towels\" she then told Sean, knowing what his reaction would be.<br>\r\n<br>\r\n\"Oh fuck no, MOM!\" Sean protested.<br>\r\n<br>\r\n\"Watch your language!\" she admonished him. She then handed him a $10 bill and walked out of his room, leaving him standing there. Sean just grumbled away to himself and stared at the money in his hand, then he finished 'cleaning' up and put on his sneakers. He said nothing to his mother after descending the stairs, and instead just left the house, heading off in the direction of the store. Sean was annoyed to discover the earphones to his ipod were broken, and he tossed them away while grumbling.<br>\r\n<br>\r\nIt was then that Sean caught sight of a fetching young woman in her early 30s across the street. She looked about 5' 2\" inches tall, but she was given a boost by the black, 3-inch stiletto pumps she wore along with her boot-cut, stonewash jeans, white pvc belt and pink tank top that showed off her C-cup breasts nicely. She had short, stylish blonde hair and a healthy application of make-up on her pretty face. She was just stepping out of her car and was carrying a large black purse with pink detail.<br>\r\n<br>\r\n\"I'd love to hit that ass!\" Sean muttered, as he felt his cock stirring again.<br>\r\n<br>\r\nSuddenly he felt a peculiar surge of 'energy' inside him, and when he next looked at the hot woman...<br>\r\n</span></div></div>",
            "created":1368965940,
            "id":1592796,
            "title":"His mother"
        },
        "1112":{
            "author_id":"wassel29",
            "author_name":"Wassel",
            "choices":[
                "Reverse the growth and tell Becky she was imagining things",
                "Have a little more fun with his Becky's body",
                "Forget Becky, time to experiment on his own body"
            ],
            "content":"<div class=\"\"><div> <span>Standing there in the doorway, with her hands on her hips, scowling at Sean was his older sister Becky; the bane of his family existence. She was only two years older than he was but you would hardly believe it from the way she acted, always bossing him around and treating him like a little kid, possibly due to some inferiority complex she'd developed due to her vaguely tomboyish appearance.<br>\r\n<br>\r\n\"None of your damn business Becky!” Sean replied, angry that she had once again just barged her way into his room without knocking as well as slightly flustered at almost being caught whacking off, “Now get the hell out of my room will you?\" Fortunately he'd managed to get his pants back on just in time; unfortunately the soiled porn mag was still lying on the floor open for all to see, something her eyes surely wouldn’t fail to notice. \"Shit!\" he thought, quickly reaching to dispose of the evidence before she did, finding that Becky's nosiness’ far outmatched his own reflexes.<br>\r\n<br>\r\n\"Oh I get it, jerking off again to your little dirty magazine where you?\" she smirked, half in disgust, half with a very knowing sense of superiority, like she was actually glad to get the chance to humiliate him. \"You’re such a little perv!\"<br>\r\n<br>\r\n\"Fuck off!\" Sean replied, becoming even angrier, well aware that she would milk this for all it was worth.<br>\r\n<br>\r\n\"Well I suppose it is the closest you’re ever going to get to an actual real life woman, God knows no self respecting girl would ever want to go near a weasely little perv like you, never mind go out with you.\" Her smug sense of satisfaction was more than evident as the words dripped from her mouth, the fact that she'd somehow managed to snag herself a boyfriend despite being a total bitch and having the body of a 12 year old (one of the perks of having popular friend's) deluding her into thinking she was somehow better than he was.<br>\r\n<br>\r\n\"Just shut the hell up Becky,\" he snapped, picking the magazine up off the floor and waving in above his head, \"These women might not be real but at least they look the part, they're not fucking surfboards!\"<br>\r\n<br>\r\nThe surfboard comment really seemed to do the trick, turning the tables and riling Becky up instead, having always been somewhat self conscious when it came to her practically nonexistent chest, going so far as to wear padded bras in an effort to compete with her more well endowed friends. \"Screw you you little dickweed! I bet your pecker is about the size of...of...of a pickle!\"<br>\r\n<br>\r\n\"Maybe but at least I’ve got bigger tits than yours, itty-bitty-titty-Becky!\" Sean continued, laughing and twisting the knife even more, \"Maybe if they were a bit bigger you wouldn't have to stuff your underwear every day!\"<br>\r\n<br>\r\nBecky's face was practically crimson now, her cheeks puffing out and he fists tightly clenched, looking as if she was about to claw her brother's eyes out at any second. She didn't however and instead something far stranger happened, the mention of her tits being \"bigger\" suddenly causing an unexplained expansion beneath her shirt, almost as if her tits were actually getting bigger. \"Whoa...what the hell?\" Becky suddenly shrieked, looking down to see her chest filling out, her once tiny A cups quickly transforming into D's then Double D’s. Sean watched equally fascinated, putting a halt to his taunting as he watched his sister's boobs stretching out her shirt, utterly amazed and completely mystified by the remarkable sight. \"My boobs! OH MY GOD, MY BOOBS!\" Becky squealed with delight as the growing finally came to a stop, groping at her two new large, firm mounds with her hands, squeezing and pinching at them to make sure they were real.<br>\r\n<br>\r\nWhile this was going on, a thought suddenly occurred to Sean, remembering the incident earlier when he'd watched his cock grow in his hand, putting two and two together and coming out with four. \"Holy crap, I did that! I made her tits grow!\" he thought, realizing the possibilities such a power could have, deciding to...<br>\r\n</span></div></div>",
            "created":1288587600,
            "id":985221,
            "title":"His sister"
        },
        "11122":{
            "author_id":"wassel29",
            "author_name":"Wassel",
            "choices":[
                "Make her breasts even bigger, along with other parts of her body",
                "Make a few changes to his own body to show her up"
            ],
            "content":"<div class=\"\"><div> <span>\"Oh God, this is incredible...they're so big!\" Becky continued, grinning like a maniac, waving her hands around giddily as she searched Sean's room for a mirror. \"I can't believe this has happened, I've got to see what they look like!\"<br>\r\n<br>\r\nSean meanwhile, still sat there on the floor watching as his sister rushed to the mirror hanging on the back of his closet, captivated by sight of his once flat chested sister's now large, buoyant breasts. She might have been his sister, but boobs were boobs, and from the look of them, from the way they stretched out her little pink t-shirt, these particular boobs were as attractive to him as any fake pair in his spank magazines. \"This is awesome!\" he thought to himself, giggling inwardly, \"I've must have like some super body changing power or something, it's the only explanation.\"<br>\r\n<br>\r\nA grin grew on his face as Becky, now standing in front of the mirror admiring herself, began hopping up and down, watching as her chest, jiggled and bounced in time with every movement. She was clearly overjoyed that she had somehow miraculously developed a pair of double D's in about 30 seconds, seemingly not even questioning how it could have happened, her mind much more firmly focused on how her friend's would react, imagining the jealous looks on each of their faces. \"Tiffany's gonna puke when she sees these!\" she laughed, returning to her groping, paying no notice to the fact her little brother was sitting less than 5 feet behind her.<br>\r\n<br>\r\n\"Well, well, well, looks like itty-bitty-Becky has finally grown a pair,\" Sean snorted, making his presence felt again, causing Becky to quickly spin around, seeing him standing up off the floor, chuckling away to himself with a creepy little smirk on his face.<br>\r\n<br>\r\n\"That's right pickle-dick,\" Becky beamed, thrusting out her chest proudly towards him, having the upper hand once more, \"Who's the surfboard now? Definitely not me with my big bouncy boobies. I bet even half of your porno sluts couldn't compete with me now.\"<br>\r\n<br>\r\n\"I bet you're right,\" he smiled, thinking how his sister would look if her tits were to actually outmatch <i>all</i> of the models in his magazine, figuring it might be quite fun to find out.<br>\r\n<br>\r\nBecky couldn't quite understand the strange look on her brother's face or why he was acting so weird, having assumed that a pair of breasts like hers would have left him speechless, drool pouring out his mouth as he ogled her figure. His eyes were certainly glued to her chest, but his smile, his voice...it was really quite creepy and she figured it was just him being a pervy little weirdo so thought nothing more of it, instead deciding to use her new assets to continue her teasing. \"Yeah well, take a good look you little perv, cause this is the last time you'll...\" she began, stopping mid sentence as she cupped her mound, realizing that they were suddenly growing again, quickly overflowing in her hands, \"Oh wow, they're doing it again!\"<br>\r\n<br>\r\nSean concentrated hard on his sister's chest, ignoring her words, willing them to grow bigger and bigger, feeling his cock twitching a little in excitement (both at her giant jugs as well as the knowledge that he was the one in control). It didn't talk long at all for the expanding mounds to spill out from underneath Becky's hands, tugging hard at her shirt, causing it to ride up her stomach revealing her belly button. The outline of her now useless A cup bra was also visible, squashed up tightly against the material, being dwarfed by the now grapefruit sized orbs. \"Ohhh God!\" Becky squealed, a loud snap causing her to jump, wincing in pain slightly as the bra straps finally gave way, her chest pushing out several more inches, pulling the bottom of her shirt even further up her body.<br>\r\n<br>\r\n\"Oh yeah, that's more like it,\" Sean grinned, assuming they had to be like double G cups or something now, if not bigger. Surely there was no way his sister could be so calm and cool about her freakishly large boobs now.<br>\r\n<br>\r\n\"Oh...oh God...oh wow...\" she gasped, trying to catch her breath as she stared down at the results of the further transformation. She really did look like some sort of super inflated porn star, her boobs far too large for her small, thin frame, bulging out from every side, threatening to burst right out of her shirt. Becky far from being freaked out however, seemed even more happy and amazed, her eyes lighting up as she squeezed her massive hooters between her arms, then pulled the broken bra out from underneath her t-shirt and tossed it carelessly to the floor. \"Hah ha! Take a load at me now, I'm even bigger!\" she laughed, jiggling her chest up and down at Sean, \"I'm like the biggest girl in school now, there's not a single guy who wouldn't want a piece of this big titty queen!\" <br>\r\n<br>\r\nAs hot as she looked with those big hooters, this wasn't exactly the reaction Sean was after, wanting to teach her a lesson not turn her into an even bigger big boobed bitch-monster. \"Shit, who knew my stupid sister liked big tits almost as much as I do?\" he though, looking slightly annoyed and dejected, something that Becky didn't fail to pick up on.<br>\r\n<br>\r\n\"Aww, what's the matter little pickle-dick?\" she mocked, leaning closer towards him and shaking her big jiggling tits, \"You upset because your sister has a huge big rack that a runty little perv like you is never ever going to get to see?\"<br>\r\n<br>\r\nWell he certainly wasn't going to take that from her, deciding to...</span></div></div>",
            "created":1288674000,
            "id":985887,
            "title":"Have a little more fun with Becky's body"
        },
        "111221":{
            "author_id":"wassel29",
            "author_name":"Wassel",
            "choices":[
                "He changes his own body now",
                "He decides to further torment his sister"
            ],
            "content":"<div class=\"\"><div> <span>\"We'll soon see about that,\" Sean smiled, prepared to make his sister eat her words.<br>\r\n<br>\r\nBefore she could even reply it began to happen again, causing Becky to let out a sharp intake of breath as she felt her breasts ballooning outwards once more, creating an increased tightness across her chest as the little pink shirt began digging into her skin. \"Oh crap, not again,\" she gasped inwardly, having only just gotten over the last growth and not sure her clothes could take much more. Her nipples were now clearly evident, poking out hard and erect, haven gotten much larger as her boobs grew and Becky was becoming worried they might actually pierce through her shirt. Sean meanwhile was just enjoying the show, staring tantalized at his sister's display, licking his lips deviously at the sight of her big swelling nips. As he felt a little growth of his own within his pants, his eyes then gazed down the rest of Becky's body, wondering if there was any other changes he might make.<br>\r\n<br>\r\n\"Well her ass and hips are pretty much nonexistent,\" he said, thinking how uneven it looked now that she had a pair of watermelons currently growing from her body, \"Guess I can easily do something about that.\"<br>\r\n<br>\r\nInstantly Becky's hips began to swell, becoming wider and fuller as her ass followed suit and moving her attention from her giant jugs for a moment, she dropped her hands down towards her backside, feeling a tightening within her skirt. \"Oh God, it's happening here as well!\" she squeaked, becoming slightly worried as to what exactly was going on (if still a little excited that her seemingly boyish figure was quickly disappearing), \"I'm getting an ass!\"<br>\r\n<br>\r\n\"Wow, that's hot!\" Sean smirked, watching as two shapely globes began pressing hard against the denim material, molding itself to them as well as her quickly expanding hips. There was no way anyone could ever mistake her for a boy now, her body incredibly voluptuous and curvy, her stubby legs joining in the growth as well as her short dark hair (Sean figuring he may as well go the whole way and completely transform her into something that wouldn't look too far out of place in a porno).<br>\r\n<br>\r\n\"Jesus!\" Becky squeaked, her eyes going wide as she snapped back towards the mirror, grabbing at her now shoulder length hair, utterly stunned at what was happening. She didn't get much of a chance to examine these new changes however, a loud tearing noise quickly drawing her attention back to her insanely stretched top, the seams under her armpits having given way as the hem now rode up all the way to the bottom of her swelling globes. \"Oh my fucking God, they're...they're<i> too</i> big!\" she squealed, staring in horror at the now basketball sized breasts making a mockery of her small body.<br>\r\n<br>\r\nSean however, disagreed, absentmindedly rubbing at the crotch of his jeans with one hand, the sight of such giant hooters putting him into somewhat of a frenzy. \"I don't know sis, I think they could go a little bigger,\" he grinned, ogling his sister with a look of manic desire.<br>\r\n<br>\r\n\"Shut up Sean, you little perv!\" she angrily told her leering brother, disgusted at the obvious pleasure he seemed to be getting from her condition, no longer feeling confident and sexy as she had moments before, terror gripping her as she inflated out of control. She was just about to turn away, run out of the bedroom and get away from his lecherous stare when another, much louder rip reverberated around the room, followed by several more; her t-shirt tearing in several more places, trying desperately to relieve the pressure on her boobage. \"NOOOOO, NOT AGAIN!\" she cried, but it was too late, the fragile material finally giving way, surrendering in a battle it was destined never to win as Becky's gigantic chest burst out, smacking loudly against her stomach as they came to a jiggling rest.<br>\r\n<br>\r\nSean's eyes almost popped out of his head as he saw the two massive globes of undulating tit flesh fly out, his cock painfully pressing against the front of his jeans. Never before had he imagined such an epic pair of perfect breasts could possibly exist, even the most ludicrously enhanced porno starlet paling in comparison to his sister's new bust. Each giant orb had to be at least the size of a beach ball, creamy and pale, tiny little blue veins visible beneath her overly stretched skin, resting atop of her stomach as the bottoms gently brushed her skirt. They were also incredibly full and firm looking, without even a hint of sag or stretch marks visible, with two large, thumb sized nipples jutting out from the center of her saucer like areola; nipples that just begged to be pulled and tweaked and played with, something that was currently running through Sean's mind as he gazed in awe at his monstrously busty sister, drool practically forming in his mouth.<br>\r\n<br>\r\n\"Stop it! Stop staring at me!\" Becky shrieked, flusteredly trying to cover herself up with her hands, pressing her huge boobs against her chest, the creamy flesh overflowing from her grasp. It didn't matter how hard she tried, it was simply impossible, her bosom being far too large for her to get a grip of, settling for covering her nipples with each hand, turning away so that they weren't in direct sight of her brother's glaring eyes. <br>\r\n<br>\r\n\"Well don't just stand there, get me something to cover myself with!\" Becky snapped, feeling incredibly self conscious and embarrassed, desperately wanting to run for the door but not sure she'd even fit anymore. Sean didn't move though, caring little about his sister's discomfort and more about his own, his pants feeling so tight now, he thought he might pass out.<br>\r\n<br>\r\n\"I don't think so sis, it'd be such a shame to cover up a pair of tits like those,\" Sean chuckled, rubbing at himself again, \"Besides, just think how popular with the guys you'll be now. With breasts the size of yours you could even take up modeling.\" He smirked as he said this, indicating down to the spank mag his sister had chastised him about earlier, finding the irony delicious.<br>\r\n<br>\r\nBecky grimaced, the sight of her brother touching himself while staring at her naked, freakishly large breasts being too disgusting to even think about, wondering why the hell he wasn't reacting as she was; frightened, freaked out and tremendously confused. \"Ugh, you're so horrible,\" she spat, getting quite mad, \"Stop fucking playing with your little shrimp of a cock and do something you idiot!\"<br>\r\n</span></div></div>",
            "created":1288760400,
            "id":986115,
            "title":"Make her breasts even bigger"
        },
        "1112212":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Leave her there",
                "Make her even less curvy than she'd been before the transformation"
            ],
            "content":"<div class=\"\"><div> <span>Sean wasn't done with his fun yet. He debated between either making Becky's boobs so big that she couldn't get up, or making her the complete opposite of what she currently was: a rail. In the end, he chose to do the first, and then maybe the second option. Smiling in anticipation, Sean cracked his knuckles as though he was getting down to work.<br>\r\n<br>\r\nBecky started to whimper as her tits once more began to inflate, popping out of her tiny palms and swinging to the floor. As the massive beach ball-sized mounds of flesh began to grow even larger, she started to lean toward the floor, unable to compensate for the shift in her center of gravity. Glaring over at Sean, she hissed, \"You little idiot, help me! What the fuck is going on here?\"<br>\r\n<br>\r\n\"I have no clue sis, but I'd watch out. Seems like you're about to fall,\" Sean remarked. As he spoke, Becky still futilely tried to cover her now coffee-cup lid sized nipples with her little palms. Suddenly she started to falter, losing her balance as the weight of her breasts suddenly swung her forward. Abandoning any attempt at coverage, Becky windmilled her arms in an attempt to stop her fall, but it was useless.<br>\r\n<br>\r\nShe slammed into the carpet, wincing as she bounced off her own boobs. Closing her eyes in discomfort, Becky tried to push herself off the floor using her arms, but little to her knowledge, Sean had made them weaker than a three-year olds. Becky flounder on the floor, unable to shift her position at all. As he rubbed himself and watched his older sister struggle, Sean decided what to do with her. In the end he decided to...</span></div></div>",
            "created":1306731600,
            "id":1116661,
            "title":"He decides to further torment his sister"
        },
        "1113":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Nod his head",
                "Shake his head"
            ],
            "content":"<div class=\"\"><div> <span>Shit, shit, shit, Sean thought. Why the hell was Billy here? He'd told Sean he had homework to do. Billy looked away as Sean scrambled to finish cleaning up his mess. Had he seen him?<br>\r\n<br>\r\n\"What do you want?\" Sean asked, an edge in his voice. Billy nervously said, \"I was just wondering if I could borrow your English book. I left mine at school and we have that paper....\" His voice trailed off as he noticed the annoyance in his friend's face.<br>\r\n<br>\r\nFine, Sean thought, as he picked up his book and tossed it over to Billy. Billy didn't move, and instead asked, \"What's wrong Sean? I know I walked in on you an all, but still, you seem pissed about more than that.\" <br>\r\n<br>\r\n\"Cuz I don't fucking have a girlfriend, or even a life right now, okay? Everybody else is off having fun, and I'm still stuck here at home,\" Sean retorted. Billy replied with some nonsense about how girlfriends don't matter, when Sean thought, Could he just lose that annoying voice already?<br>\r\n<br>\r\nTo his surprise, Billy stopped talking immediately. He was still trying to form the words, but nothing was coming out. Alarmed, he grabbed at his throat, his eyes wide in shock. The meaning of what was going on hit Sean like a tidal wive. HE had done that. He, Sean, had just made his friend's voice disappear. His dick growing suddenly popped back into his head, and Billy realized what was going on. Motioning to Billy to calm down, and telling him he was going to figure out what was going on, Sean headed off to the bathroom.<br>\r\n<br>\r\nHe needed to test his power, before he told anyone about it (IF he told anyone about it). Sean, tired of being seen as weak, decided to give himself a six-pack. Before his eyes, his skin contracted and tightened, while his muscles burned a little. Feeling a little out of breath with a tingling sensation, Sean lifted his shirt and was shocked to see perfect abs. It almost looked like they'd been photoshopped on. Sean grinned, knowing exactly what he was going to do. He strolled back out to Billy, dropping his shirt so he didn't make any changes.<br>\r\n<br>\r\nLeaving Billy speechless, Sean picked up his favorite porn mag and selected his favorite model. Starting with Billy's face, he grew out his brunette hair until it brushed his bellybutton. Sean picked up his hair in puzzlement, wondering why it had grown so quickly. Sean then slowly changed his friend's face, until the head of the porn model (with some slight alterations to make it even hotter) was on top of Billy's body. Seeing that Billy was beginning to wonder, Sean decided to make the rest of the change quick.  As he concentrated, Billy shrank a few inches, and his arms began to lose what little muscle they had. Sean didn't want Billy trying to fight back. As he thought of that, Sean quickly strengthened his own muscles so he'd be able to overpower Billy if need be. <br>\r\n<br>\r\nSean changed the rest of Billy, leaving his chest and groin for last. Sean gave Billy huge boobs, and watched in delight as Billy looked down to see his shirt pushing out. Billy's t-shirt no longer fit him correctly, and looked more like a tightly stretched crop top than anything else. Sean then gave Billy the porn model's delicious ass and genitals, nearly splitting his baggy jeans in the process. <br>\r\n<br>\r\nBilly, still without his voice, started to run at Sean, with the intent of tackling him. Holding just one arm out, Sean was able to hold his friend back, and after about five minutes of his silent struggle, he gave up and sat down, waiting for Sean to explain.<br>\r\n<br>\r\nSean said, \"Billy, as you can see, I've made you into a girl. I just discovered this transforming power, and I needed to see how far it could go. Since you interrupted me while I was whacking off to my porn models, I made you into one. Since neither you or I are getting some as far as I know, you're now my temporary girlfriend, whether you like it or not. It's useless to fight back, and if you behave, I'll give you your voice back.\"<br>\r\n<br>\r\nAs a last minute decision, Sean decided to see if he could give Billy an increased sex drive. It turned he could, because as soon as he thought that, Billy involuntarily flicked his eyes down to Sean's pants, where there was a raging hard-on. Does Billy...</span></div></div>",
            "created":1306904400,
            "id":1117841,
            "title":"His friend Billy"
        },
        "11131":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Like it",
                "Repulsed"
            ],
            "content":"<div class=\"\"><div> <span>Billy was horrified and disgusted by his own body, and by his friend Sean's actions. He'd come over to get a book, and ended up becoming a girl, by his own friend's hand. Why him? Did Sean have a reason for this, or was it just that Billy had shown up at the wrong time, and it was just convenience?<br>\r\n<br>\r\nBy the hungry look in Sean's eyes, Billy knew there was only one way this could end. He was pretty sure that Sean had never had sex, and neither had Billy. He'd only ever masturbated, just like Sean had been doing when he walked in on him. He never thought that his first would be as a girl. <br>\r\n<br>\r\nTrying not to just run away like he wanted to, Billy simply nodded, bracing himself for what was coming. Smiling, Sean told Billy to go strip in the bathroom and wait for him to call him back out. As Billy hopped off the bed, his breasts jiggled, and he winced. Damn, he thought. I had no idea these could hurt so bad. No wonder there's sports bras. Walking back to the bathroom, Billy was conscious of Sean's eyes burning a hole in his shorts as they stared at his ass that was almost bursting through the seams.<br>\r\n<br>\r\nSean picked up his cell phone, and adopting Billy's voice by using his new power, quickly called Billy's mom. He told her he'd be out until late that night, and that he might need to sleep over at Sean's to work on a project due the next day. She was fine with both, and smiling deviously as he said goodbye, Sean began to think of all he was going to do tonight. He wasn't worried about being overheard. His dad was on a business trip, and his mom and sister were off running errands and then going to his sister's piano recital. He'd have the house to himself until at least 8, and it was only 4 now. <br>\r\n<br>\r\nHis cock was still at full attention, ready for the first action of its entire life. Giving Billy his voice back but warning him not to complain, he called his former friend back out to his room. For several minutes, Sean simply stood there with his mouth open as he looked at Billy's body. Reverently, he walked toward Billy, his hands outstretched. When he reached Billy, he grabbed his breasts and started playing with them. He hadn't seen boobs in person since he'd breastfed. Oh, and that time he'd \"accidentally\" walked into the girl's room. Does Billy...</span></div></div>",
            "created":1307077200,
            "id":1118885,
            "title":"Nod his head"
        },
        "111312":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Sean changed Billy again",
                "Sean wants to go out...but Billy has nothing to wear!!"
            ],
            "content":"<div class=\"\"><div> <span>Billy wanted to throw up when he felt his body respond to Sean's touch. Every sensation of pleasure that his brain was trying to feel, Billy blocked. Soon he felt pain as Sean began getting rougher and rougher with his fondlings, and he winced every time Sean dug his hands into his delicate skin. He tried pulling away when he felt Sean's young cock pushing his vagina open, but Sean firmly pinned him to the bed and kept pushing in. <br>\r\n<br>\r\nA short two minutes later, Billy was full of Sean's sperm, and it's sticky warmness made his insides churn with disgust. Sean was embarrassed that he'd come so quickly, but Billy didn't dare comment on that. He sighed when he saw Sean's cock begin to grow hard again, and trie to say that he wanted to go to the bathroom to clean up. Instead, Sean forced Billy onto his knees and shoved his cock into his face. It grew harder and harder in Billy's mouth until Sean shoved it down his throat. Billy gagged and tried to pull away, but Sean came at that moment and Billy ha to swallow every last drop of Sean's cum under his watchful eye. Sean even made him lick it off his own breasts. Holding his mouth, Billy dashed into the bathroom, his breasts painfully bouncing, and retched right into the toilet. The taste of cum a second time just made him gag again, and he kept throwing up until there was nothing left in his stomach. Billy stayed in the bathroom, reviewing his situation when... </span></div></div>",
            "created":1316667600,
            "id":1192828,
            "title":"Repulsed"
        },
        "1113121":{
            "author_id":"megb83",
            "author_name":"meg83",
            "choices":[
                "Continue ",
                "Continue "
            ],
            "content":"<div class=\"\"><div> <span>Saen decided to change Billy from a porn looking girl into a average girl next door look with normal size tits.<br>\r\n<br>\r\nBilly came back into the room still not wanting to be there but his body is betraying him as he feels really turned on and that is making him feel sick at the same time.</span></div></div>",
            "created":1583949600,
            "id":2800147,
            "title":"Sean changed Billy again"
        },
        "112":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Boyfriend",
                "Best friend"
            ],
            "content":"<div class=\"\"><div> <span>Alice stared into the mirror, scrutinizing her body.  As she stood there, wishing that her breasts were just a little bit bigger, she watched the front of her shirt push out.  Shocked, she shook her head to clear her thoughts.  Alice pulled off her shirt to see if what she thought had just happened really did.  Indeed, her former B cup breasts had ballooned into what looked like some beautiful D's.  They were pushing painfully against her bra, and uncomfortable, Alice whipped it off, letting her new breasts breathe.<br>\r\n<br>\r\nAs she processed what had just happened, she massaged her chest, loving the way her new breasts heaved when she breathed.  Looking back into her mirror, she decided to make some slight changes to her body, just enough that it wouldn't be entirely noticeable.  Concentrating, she slimmed down her waist and gave herself some toned abs.  Next, she tightened up her butt and increased its size by a little, to match her new breasts.  Alice made her blue eyes larger, and gave herself long, luscious lashes.  She plumped her lips and grew her hair out to her boobs.  <br>\r\n<br>\r\nCritically viewing her figure now, looking for any little flaw she could find, she pinpointed every thing that she thought was wrong.  She made her legs longer, more toned, and slimmer at the thigh. When she was finally done, she looked into the mirror and saw herself, but she saw a more attractive and sexy girl than was there before.  Before, she had considered herself pretty. Now, she knew, she was a knockout.<br>\r\n<br>\r\nGoing to her closet to put on some clothes, she sees a miniskirt that has never fit her right. It was one of the sexiest things she owned, but she had never felt comfortable in it. Smiling, Alice pulled it off the hanger and slipped it on. Staring in the mirror, she concentrated and made her curves fill out the skirt perfectly.  As she admired her new figure, she puzzled over what to wear for a bra. As she combed her closet, she spied her friend Jessie's bra that she had left at her house last week. Checking the tag, she confirmed what she thought...that Jessie was a 36C. That was at least better than her B.  Not wanting to make her breasts smaller and really wanting to wow Kyle at the party, she squeezed her way into the bra, loving the way it pushed her boobs up and in, creating deep cleavage. <br>\r\n<br>\r\nAlice wasn't sure she owned a shirt worthy of this cleavage, until she spotted a simple gold tank top. Stepping back one last time she decided she needed a little color. In amazement, she watched her skin bronze in an instant. As she pulled on a pair of strappy gold heels, Alice hopped her way down the stairs. Slipping out the door without any of her family noticing, Alice hopped into her car to pick up her...</span></div></div>",
            "created":1288501200,
            "id":984302,
            "title":"Girl"
        },
        "1121":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "They go to the party."
            ],
            "content":"<div class=\"\"><div> <span>When she pulled up to her boyfriend's house, she beeped her horn so he would know she was there.  When he hopped into the car, his eyes widened, taking in Alice's outfit and body.  His eye lingered longingly on her boobs, and Alice jiggled them teasingly. She said, \"Wait a minute, then you can see.\" <br>\r\n<br>\r\nThey pulled into the grocery store's parking lot and parked in a corner.  In the dusk of the night, she stepped out of the car and let Kyle see her.  His eyes widened in shock.  \"Baby, you look amazing tonight,\" Kyle muttered, and Alice blushed.  <br>\r\n<br>\r\nHe stepped out of the car and, looking to see if anyone was around, grabbed her by the waist and kissed her.  Kyle pushed her against the car, his lips melding with hers as he massaged her breasts.  They passionately made out for a few minutes until someone beeped their horn.  Hurriedly, they jumped into the car to talk.  \"What did you do to yourself? I love it,\" Kyle said.<br>\r\n<br>\r\nAlice pondered for a moment and then replied, \"I don't know really.  I was just looking in the mirror, when all of the sudden, I wished I had bigger boobs.  And then I did.  So I made some...renovations.\"<br>\r\n<br>\r\n\"That's amazing! Can you change anyone else?\" Kyle asked.<br>\r\n<br>\r\n\"I hadn't thought of that.  Let me try.\"<br>\r\n<br>\r\nAlice thought deeply, and suddenly Kyle's triceps hardened, and he seemed taller in the seat.  As he ran his fingers over his new abs, Kyle looked up at Alice in amazement.  \"Baby, this is incredible.  But just so you know, I loved you before you did all this too.\"<br>\r\n<br>\r\n</span></div></div>",
            "created":1288501200,
            "id":984424,
            "title":"Boyfriend"
        },
        "11211":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Stay at the party",
                "Go to Alice's house"
            ],
            "content":"<div class=\"\"><div> <span>Kyle put his arm protectively around Alice.  She felt incredibly sexy and hot, and was pleased when she could feel all the guys staring at her.  She loved feeling Kyle's hard muscles encircling her, and as he led her to the music, she felt like she could dance like anyone in the world.  Feeling the music in her core, Alice let loose, capturing everyone's attention with her curves.  As she danced with Kyle, she felt him grow hard, and teasingly she rubbed her hand against his crotch, making it seem accidental.  Alice pulled Kyle away from the noise, and as he poured her a punch, she let him know that her parents would be at her brother's school play until around 11, and they would have the house to themselves.  \"You know,\" Alice said, \"it's only 9 right now. Let's...\"</span></div></div>",
            "created":1288501200,
            "id":984433,
            "title":"They go to the party."
        },
        "112112":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "You (Alice)",
                "Someone else"
            ],
            "content":"<div class=\"\"><div> <span>\"go to my house,\" Alice finished.  Kyle agreed, and they headed out to Alice's car again.  When they got to Alice's house, they headed straight up to her room.  Kyle sat on the bed, and Alice began to give him a fashion show.  Every time she came out of the bathroom, she had a new sexy outfit on, and every time Alice only teased him more and more.  Eventually, she let Kyle take her, and when he had climaxed, she looked at him. <br>\r\n<br>\r\n\"What's it like as a guy? To come so easily?\" Alice queried.  Kyle shrugged, but Alice had a different idea.  Screwing up her pretty face in concentration, she began to change something.  Alice and Kyle both felt an intense heat in their crotches, and when Alice opened her eyes, she was a beautiful girl with a huge dick, and Kyle was a hot guy with a little something missing.  As Kyle protested, Alice simply pushed on.  Eventually, Kyle agreed, and they began to have sex. It was totally different for both of them.  Alice had Kyle lay down on the bed, and she climbed on top of him and pushed her dick into his new vagina.  Kyle moaned, looking horrified as soon as he did so.  Alice relished the intense throbbing, the swell of pleasure as she pushed into Kyle.  Kyle began to get into it, squeezing his vagina, making Alice cry out.  Suddenly, Alice lost control, and she came while she was still in Kyle.  Kyle sighed, knowing he hadn't orgasmed, as Alice panted, exhausted from the exertion.  <br>\r\n<br>\r\nSmiling, Alice chirped, \"I get why you like this so much,\" taking hold of her dick.  Kyle simply shrugged, and Alice's face fell.   \"You didn't come did you?\" Kyle nodded.  \"I don't all the time either, and now I see how hard you have to try.\"<br>\r\n<br>\r\nThey both went quiet, when Alice had an idea.  \"What if we went all the way, completely switched roles?\"  Sensing Kyle's hesitation, she pushed forward.  \"It will be fun.  I can make you look like whoever you want.\"<br>\r\n<br>\r\n\"Make me...</span></div></div>",
            "created":1288501200,
            "id":984446,
            "title":"Go to Alice's house"
        },
        "1121121":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Agree",
                "Disagree"
            ],
            "content":"<div class=\"\"><div> <span>\"you,\" Kyle finished.  <br>\r\n<br>\r\n\"Then I'll be you,\" Alice added, and she began to change them, part by part.  Deciding to let Kyle play with these while she was working, Alice first concentrated on swapping her boobs with his pecs.  Kyle looked down, watching his chest swell, and Alice suddenly felt light on top.  Kyle leaned forward, feeling topheavy, and then realized what he had.  \"Go on, feel them,\" Alice urged.  Watching intently, Alice kept her eyes on Kyle as he closed his eyes, and began to rub his breasts.  <br>\r\n<br>\r\nGrinning, Kyle said, \"I didn't know how good this felt for you.  These are fantastic!\"  Alice returned the grin, and then glanced down at her own body.  She saw a hot, boobless girl with the upper chest of a chiseled guy.  Checking the time, Alice kept working, spending extra time on their faces.  As she watched Kyle transform into herself, Alice realized that had he kept his eyes open, and not just played with himself, he would have been seeing the reverse.<br>\r\n<br>\r\nTo let Kyle know she was all done, she gently kissed him on the lips.  Or at least, she thought she kissed him gently.  Kyle winced, obviously in pain, when Alice realized she was crushing his slender waist.  Loosening her hold, she continued.  Alice's dick pushed itself up, but Alice tried her hardest to ignore, truly wanting Kyle to get the full experience.  Kyle looked up at Alice, and he said, \"I want to orgasm, I know what you need to make it.\"<br>\r\n<br>\r\nConfused, Alice nearly jumped when Kyle grabbed her dick, and then she realized what he was going to do.  Kneeling at the foot of the bed, Kyle took Alice's cock into his mouth, holding back his gag as he did so, and began to suck.  Alice was in heaven.  This almost felt like Kyle's vagina had, and she understood why Kyle had liked blowjobs so much.  As Kyle began to get into it, Alice forgot who she was and pushed her cock farther down Kyle's throat, enjoying the experience immensely.  Kyle's eyes widened in horror, and when he tasted her precum, he tried to pull away, but Alice pleaded him, reminding him of all the times she had blown him.  Alice came, great white streams of her cum flowing into Kyle's mouth.  He swallowed, grimacing as he did so, and stood up.  <br>\r\n<br>\r\nAlice, realizing how awful that must have been for Kyle, decided to make this extra special.  She gave him a gentle kiss, and caressed his face.  One hand slowly moved down his spine, and landed firmly on his butt, as the other wandered to his breasts.  Kyle gasped when Alice began to rub his breasts, moaning in pleasure as she squeezed them.  Alice pulled out of the kiss, moving her tongue down Kyle's throat and circling each breast.  Her cock was beginning to harden, but she was committed this time.  Kyle continued to moan quietly, and Alice began to gently enter him.  As she pushed in, she tapped his clit in a rhythm, bringing him to the edge.  Finally, the two of them came together, both gasping in pleasure.  Kyle rode the waves of his climax for several minutes, and when he had finally finished, he sat up to speak to the exhausted Alice.<br>\r\n<br>\r\n\"That was incredible.\"  Alice simply nodded, and Kyle stood up, and began examining his girlfriend's body before the mirror. \"Alice, could you help me get dressed? I really want to know what it feels like.\"<br>\r\n<br>\r\nAlice pulled herself of her bed, and picked up the bra that was too small for her.  \"This is a size too small, so it's going to pinch a little, but works.\"  She pulled the bra over Kyle's breasts and hooked it for him in back, and then handed him a thong to put on.  As he slipped it on, she picked up the skirt and shirt from the floor, placed them in the hamper, and got her sexiest dress for Kyle.  She tossed him the dress and then pulled on his pants and shirt from the floor, admiring the ease with which she got dressed.  When she looked over, she saw Kyle was still puzzling over the dress, and laughing, she helped him put it on.  As she asked him to model for her, she made slight adjustments to Kyle's body to fill out the dress the best way she could.  When she was done, Kyle looked in the mirror and gasped.  <br>\r\n<br>\r\n\"Damn Alice, you look hot in this,\" Kyle exclaimed.  \"Do you want to switch for a day?  We could be each other in school, then switch back at the end of the day.\"<br>\r\n<br>\r\nAlice couldn't believe that her boyfriend, the one who had been reluctant to try this game, was suggesting this.  Does she...</span></div></div>",
            "created":1288501200,
            "id":984451,
            "title":"You (Alice)"
        },
        "11211212":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Make Kyle back into a uglier version of himself, but leave the vagina.",
                "Transform Kyle into another girl and drop him off at a strip club."
            ],
            "content":"<div class=\"\"><div> <span>Alice hesitated.  \"I don't know Kyle,\" Alice responded.  As soon as the words had left her mouth, she heard her mom open the door.  Without a word, Alice hopped onto her roof and jumped down, sprinting towards Kyle's house.  There was no way that they could get caught like this.  <br>\r\n<br>\r\nWhen she finally made it to her boyfriend's house, she opened the door, and was slightly startled when his mom started to hug her, asking how the party was.  Shit! she thought.  She forgot to switch voices with Kyle.  For a few seconds she panicked, when suddenly she remembered her power.  Alice focused on her throat, and felt an odd burning sensation.  Clearing her throat, she spoke in Kyle's deep timbre.  \"It was great Mom.  Alice and I had fun.\"<br>\r\n<br>\r\n\"Oh that's fantastic sweetie! Go upstairs and finish your homework for tomorrow.\" Alice took this opportunity, and had to stop herself from sprinting up to Kyle's bedroom, locking the door behind her.  Sitting at his desk, Alice patted her pockets, searching for Kyle's phone.  When she found it, she immediately texted her number, asking Kyle to meet her at the grocery store.  She wanted to switch back.  Alice didn't know if she could make it through the day tomorrow as her boyfriend, no matter how much she loved him.<br>\r\n<br>\r\nWhile she waited for him to respond, Alice went through Kyle's messages, when suddenly her eyes narrowed.  There was a whole dirty conversation between Kyle and Natalie, a girl form school, complete with pictures.  Furious, Alice went through all of his texts between Natalie, and started to cry.<br>\r\n<br>\r\nHow could Kyle, who had said he loved her this very night, do this to her? How did she deserve this, any of this?  Clenching her fists, she began to think of a fitting punishment.  As ideas raced through her mind, she approved and rejected them, filing them away into folders in her brain.  Minutes later, Kyle's phone buzzed.  It lit up with a text from her phone. Kyle said he would pick her up in five minutes.  Alice had forgotten she couldn't drive.  <br>\r\n<br>\r\nFinally, she thought of a fitting punishment.  Does she decide to...</span></div></div>",
            "created":1288587600,
            "id":985084,
            "title":"Disagree"
        },
        "112112122":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Walk away",
                "Go into the club"
            ],
            "content":"<div class=\"\"><div> <span>Kyle beeped the horn, and Alice grabbed his wallet and ran outside, telling his mom that he had forgotten to pick something off for a project and that his friend Alex was driving him to the store.  By the time she had yelled her consent, she was already in the car.  <br>\r\n<br>\r\nAlice tried not to act mad, and Kyle, focused on the road, didn't notice anything wrong.  He pulled into the store's parking lot, parking in front of the clothing store, it's neon red \"Open\" sign illuminating the front seat.  Alice thought through her plan quickly before she acted, and then spoke. \"Kyle, I know what you did with Natalie,\" she said, holding up his phone.  \"You're a backstabbing cheater, and we're through.  Now you're going to get what you deserve.\"  She took his arm into her strong grasp, making her muscles bigger as she did so, in order to keep control of the situation. <br>\r\n<br>\r\nTaking him into the clothing store, she walked carefully over to the women's lingerie section.  Selecting a 36DD bra and matching thong, she tossed them over her arm and then went to the women's clothing section.  Picking a tiny miniskirt and lowcut top, she pulled Kyle, confused and whimpering, over to the dressing rooms.  In the room, she made him strip down to nothing, and then she hooked the bra on and slid the thong up his thighs.  Next, she slid the miniskirt up and pulled the top down.  He looked like a total slut.<br>\r\n<br>\r\nAlice didn't want him to look like her anymore, so she brought up a mental image and filled it out.  She increased Kyle's breast size even more, until he was almost toppling over.  Kyle looked in amazement at his expanding chest, and began to play.  Slapping his hands away, she continued, warning him to stay quiet.  She made his butt push the skirt out until it was barely covering his cheeks, and then changed his hair color to a bleach blonde.  She made his lips even bigger and redder than earlier, and angled his face so it was incredibly sexy.  He grew several inches before her, and Alice had to snag a pair of shoes to fit, making sure to choose the highest ones she could, knowing that he wouldn't be able to walk in them.  She took all the tags off the clothes, and then went up to the register, telling the woman that they would just be wearing the clothes out, and elbowed Kyle so that he would smile and giggle, deflecting her suspicions.  Paying with Kyle's credit card, she signed and then supported Kyle, wobbling on his heels, as she walked out.<br>\r\n<br>\r\nKyle seemed to have caught on, and finally realized what Alice was doing.  \"No, Alice, don't do this.  I'm not a hooker, and you're not like this.\"<br>\r\n<br>\r\n\"I didn't think you were a liar either.  Just a night, and then you'll never use a girl again.\"<br>\r\n<br>\r\nAlice roughly pushed Kyle into the car, taking the wheel, and gripped it with her strong hands.  When she drove up to the strip club, Kyle tried to protest, saying that this was where some kids from school went, but Alice simply waved him away and brought him to the back door.  Presenting him to the owner as a dancer and prostitute for the night, Alice smugly grinned as Kyle was pulled into the club.  <br>\r\n<br>\r\nDoes Alice...<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</span></div></div>",
            "created":1288587600,
            "id":985099,
            "title":"Transform Kyle into another girl and drop him o..."
        },
        "1121121222":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Leave him in the parking lot",
                "Change them back"
            ],
            "content":"<div class=\"\"><div> <span>She went back to her car, and wanting to get in to see what Kyle was forced to do, she began to make herself an attractive middle aged man so she wouldn't get carded.  When she was done, she was tall, had dark graying hair, straight teeth, a square jaw, and a massive penis.  She flexed, her shirt nearly ripping from the stretching.  Pulling out a sweater she had grabbed at the clothing store, she pulled it over her head, and admired her look.<br>\r\n<br>\r\nConfidently strolling into the club, Alice was waved on by the attendant after she paid, and took in her surroundings.  The light was low, the music was loud, and the air was filled with a dusky smell.  Taking a seat in one of the cushioned chairs, Alice scoured the room for a sight of Kyle.  She spotted what she took as the owner leading him to the stage, which was filled with girls slithering around poles.  The owner was pushing Kyle up the stairs, saying some harsh words, and Kyle grew meek and went up.<br>\r\n<br>\r\nAlice chuckled when she saw Kyle's new outfit.  He had been put in a sparkly, low cut dress with the sides missing and matching wedge heels.  As the manager watched, Kyle began to swing around the pole.  Suddenly, a man tapped Kyle on the wrist and motioned to his lap.  Grimacing, Kyle sat down and began to give him a lap dance, feeling his cock grow hard underneath his gyrating butt.  <br>\r\n<br>\r\nAlice was shocked when she began to feel herself getting an erection.  Penises seemed to have minds of their own!  Horrified by her own erection, Alice began to get up when she saw Kyle tucking some bills into his breasts and then being pushed over to what looked like a boy from school.  Better yet, it was one of Kyle's senior friends, Tom, an eighteen year old who could legally enter the clubs.  Kyle gingerly sat down on his lab, and started to try to escape when Tom began to grope his boobs.<br>\r\n<br>\r\nWhen Tom held out a wad of bills and motioned to a dark curtain, Kyle tried to refuse until he saw the stern glance from the manager.  When the two emerged from the room, Kyle looked like he was about to puke, and Tom looked very satisfied.  Alice decided that Kyle had enough, and motioned him over.  <br>\r\n<br>\r\nFor kicks, Alice pulled Kyle onto her lab and waved a few bills in front of his face.  Her cock enjoyed Kyle's gyrations, and when Alice thought Kyle was ready, she pulled him off, and then walked him out of the club under the guise of wanting some alone time.<br>\r\n<br>\r\nWhen Alice got out, she revealed her identity, and Kyle started to grow angry.  \"How could you do that? I had to suck Tom's dick! Tom's DICK!!\" Kyle repeated.  \"I'm never going to see him the same again!\"<br>\r\n<br>\r\nDoes Alice...</span></div></div>",
            "created":1288587600,
            "id":985106,
            "title":"Go into the club"
        },
        "11211212222":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Teachers",
                "Students"
            ],
            "content":"<div class=\"\"><div> <span>Alice changed Kyle back into her, and then began to swap them back.  When she was done, she changed into her original clothes, and began to drive them back.  As they drove in silence, Alice decided that she was still furious with Kyle.  Reminding him that they were through, she added, \"And I'm taking away your dick.  That way, you can't cheat on anyone ever again.\"  With that, Kyle began to protest, but the change had already started.  He felt his cock melt away under his grasp, and it was replaced by a vagina.  Smiling maliciously, Alice dropped Kyle off at his house and then drove home, ready for the next day at school.  <br>\r\n<br>\r\nThe next day, Alice hopped into her car and drove to school.  When she gets there, does she decide to mess with...</span></div></div>",
            "created":1288587600,
            "id":985108,
            "title":"Change them back"
        },
        "12":{
            "choices":[
                "a highschool student.",
                "a college student.",
                "a single",
                "married couple with no kids.",
                "married couple with kids."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You have been given the gift to swap two people's bodies, including yourself, by simply touching them. The only thing you have to remember is that the swap only lasts for a day.<br>\r\n<br>\r\nAre you..</span></div></span></div>",
            "created":1455015720,
            "id":2101821,
            "title":"Swap by Touch"
        },
        "122":{
            "choices":[
                "A boy.",
                "A girl."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are a college student. But are you a boy or a girl?</span></div></span></div>",
            "created":1455015780,
            "id":2101822,
            "title":"a college student."
        },
        "1222":{
            "choices":[
                "The nerdy kind of girl.",
                "The sociable kind of girl.",
                "Another kind of girl."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You're a girl of course, but what kind of a girl?</span></div></span></div>",
            "created":1455741120,
            "id":2105674,
            "title":"A girl."
        },
        "12221":{
            "author_id":"bodyswapwriter",
            "author_name":"BodySwapWriter",
            "choices":[
                "Continue",
                "Readers Choice"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Nell and you are from from New Jersey and are a freshman in college. You are tired of having one or two friends and wish you had a different life but that dream is about to come true to an extant....<br>\r\n<br>\r\nPicture of Nell: <a rel=\"nofollow\" href=\"http://i.ytimg.com/vi/pGsdHWdZGyU/hqdefault.jpg\" target=\"_blank\">http://i.ytimg.com/vi/pGsdHWdZGyU/hqdefa...</a></span></div></div>",
            "created":1455856980,
            "id":2106259,
            "title":"The nerdy kind of girl."
        },
        "12223":{
            "author_id":"redpandaman",
            "author_name":"RedPandaMan",
            "choices":[
                "Hot and sexy type",
                "Cool and chill type"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ah yes, more types of girls, and more decisions...</span></div></span></div>",
            "created":1483494060,
            "id":2258761,
            "title":"Another kind of girl"
        },
        "13":{
            "choices":[
                "Continue.",
                "Continue."
            ],
            "content":"<div class=\"\"><div> <span>Yatsi woke up with a start. Almost as if by instinct. He looked sideways from his bed to the digital clock that stood his cabinet. It read the time to be precisely 05:59 am. Milliseconds later it rang to announce the commencement of the day that lay ahead. <br>\r\n<br>\r\nIt was quite annoying too. It had the ringtone that resounded of a Kalashnikov rifle firing off a full clip on a shooting range. His friends hated him for it; said it was the worst wake-up call in the universe. And it often resulted in him being bodily thrown out of his collage dorm by his comrades, with cushions trailing behind him. But Yatsi liked it. It was the only sound that would always ensure he would wake up exactly when he needed to.<br>\r\n<br>\r\nToday however Yatsi did not need to be woken. For he had barely slept a wink throughout the restless night. You see today was his birthday. More importantly: his 18th birthday. The day he became man in cossack society. A day of great honour for him, and for his kin. All of his closest friends, family and comrades would be celebrating with him today.<br>\r\n<br>\r\nIn barely containable excitement he went to bath, dress, freshen up and shave his grime away that he had accumulated during the night. He donned his felt mittens, beanie and boots; pulled on his woolen trousers and put his arms through his furry trenchcoat jacket. Ready to face the frosted cold of the russian steppe - although he wasn't as sure facing the day - he stepped out of the musky warmth of his wooden cabin and headed back to his village.<br>\r\n<br>\r\n========<br>\r\n<br>\r\n7 hours later.<br>\r\n<br>\r\nIt had been a grand feast. Skinned oxen, boar, deer and hare were impaled and rotating on barbecue-stands that bordered the dining tables, all of which surrounded a colossal hearth which blazed away with the fury of a train locomotive's oven, keeping the longhouse comfortably warm despite the maelstrom raging outdoors in the snows. Vodka, Schnaps, Cider, Ale, drinks of all manners were passed around to keep mugs filled and visitors happy. <br>\r\n<br>\r\nOld grey men with walrus moustaches told old tales of struggles on the farm and victories in the army to toddlers; the woman laughed as they traded gossip about the latest exploits of their children.<br>\r\nIt was truly the cossack way of celebration.<br>\r\n<br>\r\nYatsi sat next to his uncle Vendreski, whom continued to make subtle hints about him now being old enough to join him in the true tribulations of manhood: bear-hunting on the steppe. Of course Yatsi's mother Liarrsa slapped him whenever he mentioned it, telling Vendreski she would not have her son be use as bait.<br>\r\n<br>\r\nYatsi just shook his head and moved on to see his closest friend, Tesla.<br>\r\n<br>\r\nTesla beamed when he saw Yatsi approach: \"Comrade, come here you fool! Congradulations! You're old and over the wall from today on!\" And he gave Yatsi the gut-squeezing hug that only russians knew how to give.<br>\r\n<br>\r\nRecovering the air that had been forced from his windpipes, Yatsi said: \"I'm glad you made it. Please save me, I beg you. I don't want to listen to another uncle go on about how many german tigers he'd managed to single-handedly stop in his days and how much we teenagers of today are a bunch of wimps. It gets old and boring fast.\"<br>\r\n<br>\r\n\"Then come here-\" Tesla beckoned: \"-come sit with us. My sister is dying to see you.\" he pulled him like a trailer all the way to the corner of the longhouse.<br>\r\n<br>\r\n\"Yatsi!\" a girl jubilated. It was Tanja - Tesla's twin sister. She shared the same jetblack hair as he. \"Come sit here next to me. Tell me how your day has been.\" She scooted over to make room on the bench.<br>\r\n<br>\r\n\"Full of smoke and too much drinking.\" Yatsi said as he gratefully snuggled next to her.<br>\r\n<br>\r\n\"That's my sister you're touching with your vile butt, pal!\" Tesla jokingly protested.<br>\r\n<br>\r\n\"Ignore him, Yatsi.\" Tanja said as she laid an arm across his neck and pulled him closer into intimate range: \"My brother's just jealous that doesn't get to sit this close to me anymore.\"<br>\r\n<br>\r\n\"Won't Kakarov mind?\"Yatsi asked. He was Tanja's boyfriend.<br>\r\n<br>\r\n\"He would actually!\" Kakarov declared from behind Yatsi. \"Get your own girl.\" he said as he pulled Yatsi into a clamp-like grip that made him grunt. Kakarov was a bear of a man. He stood a full 7 feet tall and had to duck through most door-frames. His size contrasted strikingly against Tanja's petite frame.<br>\r\n<br>\r\nAfter having finished crushing Yatsi's bones to dust, Kakarov rejoiced: \"And so we have the man of the hour; the tower of power! Congradulations on your b-day, Yatsi! How's it feel to be slightly less of a loser?\"<br>\r\n<br>\r\nYatsis clutched his mashed ribs, gasping: \"Painful...\"<br>\r\n<br>\r\n\"Good.\" said Kakarov: \"Now keep away from my girl. There's plenty elsewhere.\"<br>\r\n<br>\r\n\"Oh?\" said Tanja hotly, indignantly: \"Since when am I YOUR girl??\"<br>\r\n<br>\r\n\"That's not what I meant, my sweatings...\" it was amusing to see the giant grovel to someone tiny compared to him. Tanja just gave him the hand.<br>\r\n<br>\r\nTesla tugged at Yatsi's sleeve: \"Oi comrade! Take a look! Minsc!\"<br>\r\n<br>\r\nYatsi's heart raced. His sweatheart! Here of all places? His gaze followed Tesla's pointing finger and came to rest on the woman whom made him feel small all his life.<br>\r\nMinsc. She was the paragon of Slavic beauty. With translucent milky pale skin that was more delicate than porcelain. Her fair blond hair bordered on the side of virgin snow. Her eyes the crystal grey that all cossack women longed for. She had a soft oval face and a cute button nose. And she wore the woolen skirt and ski pants in such a way that Yatsi thought he would faint.<br>\r\n<br>\r\n\"Just get on with it already, you wuss!\" Kakarov intoned from the side, having seen Yatsi's reaction: \"I know for a fact she's single. I asked friends. Just ask her out before another bloody year passes.\"<br>\r\n<br>\r\nYatsi's meek smile subsided to a grim grin: \"I did. Yesterday. Asked her if she would come as my companion for my name day.\"<br>\r\n<br>\r\n\"Well?\" Kakarov asked impatiently: \"Why the hell isn't she sitting next to you then, my stupid comrade?\"<br>\r\n\"It...didn't word.\" Yatsi mumbled.<br>\r\n<br>\r\n\"Speak up. Why?\" the group was staring Yatsi down by now; he know he'd not get away without telling them the reason.<br>\r\n\"You can tell us, Yatsi.\" Tanja said gently: \"Did she say something...or did you 2 just not zing?\"<br>\r\n<br>\r\n\"She...err...to be frank...well...err...she's not into guys.\" and Yatsi bowed his head in mortifying shame. His friends stared at him, wide eyed.<br>\r\n<br>\r\n\"Well that sucks.\" Tesla frowned.<br>\r\n\"Awwh. That's such a pity.\" Tanja said.<br>\r\n<br>\r\nBut Kakarov came from nowhere: \"I don't get it.\" he said with a blank look.<br>\r\n\"That's because you're a moron, comrade.\" Tesla sneered at his insensitivity.<br>\r\n<br>\r\n\"Oh yeah, you gypsy scrap collector?\" Kakarov retorted. He and Tesla's following conversation then devolved into a shouting mach of the usual rude, crude, crass and vulgar russian humour as insults got hurled to and fro. Tanja tried vainly to dismantle the fight.<br>\r\n<br>\r\nDepressed, Yatsi sighed and stood up. He walked onwards mindlessly away from his squabbling companions. He tried to head into the general direction Minsc had disappeared from. He'd lost sight of her.<br>\r\n<br>\r\nHe was just about to head back to the bar when a skeletal hand grabbed his shoulder and yanked him into a shadowy corner. What the....?<br>\r\n<br>\r\nYatsi looked to see the one responsible only to be taken aback at staring at his oldest uncle: Kohler Kalb. The man was a canvas of scars and wounds, a clear survivor of the Great War. He had a missing left arm from the elbow up and wore an eye-patch over his right eye. Looking downward would reveal a wooden leg. Kohler was always seen as someone scary by the children. He was a bitter, bitter man, and never made an attempt to even be delightful anyone in his conversation. He was avoided by most. Only Yatsi ever seemed to pay any attention to him at all and even then he was unpleasant to speak with.<br>\r\n<br>\r\nYatsi did his best not to be rude by covering his nose in the presence of the man from which a sour odor - the one in which someone had not bathed for days on end - emanated.<br>\r\n<br>\r\n\"Boy!\" he breathed into Yatsi's face with ancient tobacco breath: \"So Alendrenski's brat is finally a man, is he?!\"<br>\r\nAlendrenski - he was Yatsi's grandfather.<br>\r\n<br>\r\n\"Yeah...\" Yatsi ventured.<br>\r\n\"Well isn't that magnificent! To celebrate a fool like you. You young ones celebrate too much. For nothing. For everything. You people disgust me.\" and he coughed point blank into Yatsi's face which only pulled tightly.<br>\r\n<br>\r\n\"Is there something I can do for you, uncle? Get for you? A drink maybe?\" Yatsi asked coldly.<br>\r\n\"Bah! There's nothing of interest you can get me! Unless you're god or something! Can you get me back my leg, huh? Or maybe my arm?\"<br>\r\n<br>\r\nYes, Kohler was always so rudely in people's face whenever they offered him the least bit of kindness or pity.<br>\r\n\"Then let go of me. Now!\" Kohler glared, then released his grip on Yatsi's shoulder.<br>\r\n<br>\r\n\"Anyway...\" he spat on the floor.\"...I only came to your stupid little party to give you this. Your grandfather, Alendrenski, was the only  true comrade I knew. I promised him I'd give it to you, before he died.\" <br>\r\nAnd he handed Yatsi a small quaint little dirty wooden box with a strange insignia covering it. Yatsi's face was total puzzlement over this. His grandfather? But he'd never met his grandfather even!<br>\r\n<br>\r\n\"I was supposed to give this to your father, but your idiot old man passed away and left you for the orphanage. I was instructed by Alendrenski to give this to his closest male bloodline when he turned of age. Guess that's you. Although in my opinion, boy, I'd never have given something as valuable to an insect like yourself.\"<br>\r\n<br>\r\nYatsi turned the box over. It was as old as the mountains. Looking up he asked: \"What is it...uncle?\"<br>\r\nKohler was nowhere to be seen.<br>\r\n<br>\r\nFrowning Yatsi went a silent room to investigate the funny little box.</span></div></div>",
            "created":1368507600,
            "id":1589831,
            "title":"Mark of the Shapeshifter."
        },
        "131":{
            "choices":[
                "Continue.",
                "Continue."
            ],
            "content":"<div class=\"\"><div> <span>Yatsi knew it was bad manners for the guest of honour to leave his own party at any time, but to be honest he was tired of festivities. He wasn't in the mood for the dry dull anecdotes of his elders, nor was he in the mindset for going wild with his friends. His reminder of how Minsc had rejected his confession to her yesterday felt like the swallowing of a bitter pill. Man, love sucks. Rejected love even more so.<br>\r\n<br>\r\nHowever more importantly, he was curious. Yatsi wanted to find out what on the good green earth his crazy uncle Kohler had given him. The rest of his birthday gifts had been mindless repeating offerings of more wine and alcohol - which was basically the cossack way of replenishing the stock of the host whose stores you were depleting.<br>\r\n<br>\r\nBut this queer little box was something else. For its small size it carried a deep weight about it; as if ancient forgotten magic inhabited its contents. Yatsi grinned at the ridiculous thought. Yeah right. He was probably just excited out of his wits and with his curiosity eating at him.<br>\r\n<br>\r\nSo Yatsi found a secluded secure room on the 2nd floor. He turned on the light to illuminate the compact wooden room. In private, he turned all his focus and attention to the innocent looking little box.<br>\r\n<br>\r\nHe fumbled with it for a few minutes before giving up. Oh come on! The lid was sealed more tightly than a clay horse's arse! Yatsi then took out his pocket-knife and pried the lid open between the tiny crevasse. Finally, at last it burst due to being forcefully opened,  and enveloped Yatsi's face with a billowing cloud of dust - most likely as a result of wood-lice having feasted on the box.<br>\r\n<br>\r\nAfter Yatsi had managed to get his coughing fit under some control, he looked upon the insides of the box with teary bloodshot eyes.<br>\r\n<br>\r\nDisappointingly, only a piece of paper. Fragile, torn and historic looking. Well that was dramatically anticlimactic! Yatsi scowled. He wasn't sure whether he expected some kind of treasure-like artefact or gold or diamonds or something. Ah well. Here's to hoping that it can always be a treasure-map!<br>\r\n<br>\r\nMore puzzlement. More confusion. More 'what the hell is this supposed to be?'. The lettering on the feeble paper was outmoded baltic - a sub dialect of old russian. Peering closely, he could just make out what it said if he focused hard.<br>\r\n<br>\r\nIt read something akin to the following:<br>\r\n<br>\r\n===<br>\r\n<br>\r\n\"I Alendrenski, 4th of his name, leave the following to my lineage. May it serve all those who come after me, as it served myself and my ancestors. This is the legacy of our bloodline. This is the legend of our family.\"<br>\r\n<br>\r\nBeneath this stood a scribbling far less coherent that the top title:<br>\r\n<br>\r\n\"Mark of the Shapeshifter.\" and beneath that the supposed mark. It was unlike anything Yatsi had ever seen. It wasn't exactly epic or or artistically impressive. But it was unique in a very queer type of way.<br>\r\n<br>\r\nImagine a circle with a diagonal cross being drawn out from the center. The cross end points ended past the circle circumference, then all of them bended sideways to form something similar to a swastika, although not entirely as the ends were askew at 45 degrees. In seemingly random fashion dots were scattered inside and around the circle. A triangle formed the centerpiece eye.<br>\r\n<br>\r\nBelow this symbol stood more words; they even less legible.<br>\r\n<br>\r\n\"Use this Mark very wisely. It will allow the Wearer to take the form of any human he pleases, whether that human is reality, a work of fiction or the Wearer's own imagination.<br>\r\n<br>\r\nAs caution, be warned however that once the Wearer had taken the shape of another, he or she will remain that way for a total of 24 hours, 14 minutes and 17 seconds. The Wearer shall not be able to revert back to his or her original form, nor will he or she be able to take on another shape till the relapsing time period had passed.<br>\r\n<br>\r\nThe Mark is not required to be used once worn, but the Wearer be pleased to know that it can be used indefinitely and infinitely.<br>\r\n<br>\r\nThe Wearer, if in an alien shape to his original form, may choose if he or she so desires to, to remain in that alternative shape for as long as necessary, even till death. However the Wearer can not change back or take another shape until the required 24 hours, 14 minutes and 17 seconds of relapsing time had passed.<br>\r\n<br>\r\nI Alendrenski, 4th of my name, leave these instructions in the hope that the reader and next Wearer will be aided in some way to discover the Mark's potential in ways I had never been able to.\"<br>\r\n<br>\r\nAnd below these words stood scribbled as if in a hurry, this time in a blue pen:<br>\r\n\"From your loving grandfather, may this aid in your life, my dear comrade. Happy birthday, Yatsi!\"<br>\r\n<br>\r\n===<br>\r\n<br>\r\nYatsi looked up with glazed eyes. Then he said: \"What the f###?\"<br>\r\n<br>\r\nThis has got to be this most deplorable, most depraved attempt at a hoax that Yatsi had ever seen. This has Kohler's sick humour written all over it. Oh come on! He had to read the little scrap paper several times over before he could decipher it; then he had to read it several times more yet just to understand what on earth it meant.<br>\r\n<br>\r\nThis was borderline stupidity with the poorest attempt at a laugh yet devised. This Mark and Wearer business is downright moronic. Like some kind of instructions to superpowers or something. Ugh.<br>\r\n<br>\r\nAnd what the hell exactly was this rubbish about his grandfather actually having written his name, Yatsi's name, in that last sentence?!! Yatsi wasn't even born then! How in the seven hells was his grandfather supposed to know the name of his unborn grandchild?? Ugh. The writer of this little prank was retarded.<br>\r\n<br>\r\nYatsi had enough of pretending to be Indiana Jones. He stood up and stretched his back, then made his way for the door.<br>\r\n<br>\r\nThen he stopped. Dead in his tracks. He looked at his upper left hand which still held the silly paper. <br>\r\n<br>\r\nIt was burning. Like agonizing fire! But there was nothing on it. Yatsi gasped and mashed his teeth in agony. It felt like a thousand hornets was busy stinging his upper left hand!! Blood started to ooze from the surface, as if someone was busy carving into his skin with a scalpel. By this point Yatsi was crying like babe; he collapsed in a shuddering heap on the floor, his right hand clutching desperately to his left that was causing him the most excruciating pain imagination could invent.<br>\r\n<br>\r\nBy then he could see black lines forming all over the surface of the pained skin of his left hand. Like an invisible tattoo artist drawing  with ink where the pain focused. It was the mark from the paper. Its outlines slowly forming a less and less ambiguous picture until a solid replica stood there on Yatsi's shivering hand.<br>\r\n<br>\r\nIn soul-releasing relief, the pain stopped. Suddenly and inexplicably. Yatsi gazed at his hand in shock and awe. A perfect tattoo where there had been none a minute ago. What...what was that?<br>\r\n<br>\r\nYatsi didn't know what made him look at the paper he had dropped; he just had to know whether it was the same mark. To his final heart-stopping shock Yatsi saw that the Mark was missing from the paper!!!<br>\r\n<br>\r\nNothing, just an empty space. The words and instructions from his grandfather was still there, but the mark...gone. Vanished. What witchcraft was this? Yatsi wondered flabbergasted.<br>\r\n<br>\r\nHe needed help. He needed to get back to his friends quickly. Whirling with haste he knocked his head into the mantle-piece of the room, landing himself a concussion on his forehead.<br>\r\n<br>\r\nStars and stripes was the last thing Yatsi saw before unconsciousness took him into her dark embrace.</span></div></div>",
            "created":1368507600,
            "id":1589883,
            "title":"The inside of the box."
        },
        "1311":{
            "choices":[
                "Continue.",
                "Continue."
            ],
            "content":"<div class=\"\"><div> <span>Yatsi awoke to find himself drowning. Water forcing itself up his nose, make him choke and puke out the liquid. He sat up gasping the breath of life only to find a fist meeting his nose and sending him back lying down.<br>\r\n<br>\r\n\"And that's for making us worry a fierce one, you jerk.\" came Kakarov's perpetual gruff voice.<br>\r\n<br>\r\nAs Yatsi's vision cleared from white lights, the blurry blobs before him conformed to become the faces of his friends. Tesla, Tanja and of course Kakarov whom held the jug with which he'd splashed water over Yatsi's face to wake him.<br>\r\n<br>\r\n\"Wakey, wakey, Kapitan idiot!\" Kakarov said.<br>\r\n<br>\r\n\"I'm alive?\" Yatsi asked. His forehead felt sore. He bet if he looked in a mirror, he'd see the mother of all bumps.<br>\r\n<br>\r\n\"Not for long you're not, comrade. I ought to brake your silly little neck. I was worried sick about you. I had stalked the halls, the basement, even the stinking attic in search for your worthless rump.\"<br>\r\n<br>\r\nTanja intervened, more gently and soothing than Kakarov, as usual. Her expression was a motherly myriad of concern, annoyance and relief: \"We were really worried about you, Yatsi. We didn't know where you had vanished so suddenly without warning. We looked everywhere and couldn't find a trace of you.\"<br>\r\n<br>\r\n\"One moment you were with us; the next: poof. Gone. Don't scare us like that.\" Tesla admonished.<br>\r\n<br>\r\nBut Kakarov wasn't done giving Yatsi the short end of his tongue: \"What did you have? Half a bottle of Red Bear. You pussy. You wouldn't be able to hold your liquor if your ruddy life depended on it. Next time you hit the wall, do so where I can find you so I can drag your intoxicated arse back to bed.\"<br>\r\n<br>\r\n\"I wasn't drunk.\" Yatsi said simply, sitting up and crossing his legs. He rubbed his forehead gingerly, but the stinging pain made him winch.<br>\r\n<br>\r\n\"Oh yeah? Then what were you doing here: the most hidden part of the bleeding house for pity's sake, you idiot?\"<br>\r\n<br>\r\n\"I hit my head. I think. I was going to return to you guys shortly.\" Yatsi said.<br>\r\n<br>\r\nTesla tilted his head too the side; his face with an quizzical expression: \"Hey Yatsi, what's up with your hand. Don't tell me you ran off for a tattoo?\"<br>\r\n<br>\r\n\"Oh wow, that's cool. Where can I get one?\" Kakarov asked, impressed.<br>\r\n<br>\r\nA dark cloud crossed Yatsi's face as he peered at his hand. He looked spooked. For a moment he had thought maybe Kakarov had been right. That Yatsi had been overcome by drinks. But the mark...that same strange symbol...he hadn't dreamt it being drawn on his hand, as if by a ghost, after all. It was real. Yatsi felt like waking up from a nightmare, only to find the next cycle of nightmares facing him.<br>\r\n<br>\r\nTanja looked at Yatsi with further concern: \"You okay? You look like you've just seen a ghost.\" <br>\r\nNah. Just a fricken symbol disappearing from a scrap of paper and re-appearing as ink seared into the flesh of my skin. Nothing remotely supernatural at all! Yatsi wanted to say.<br>\r\n<br>\r\nThen Kakarov pulled him up: \"Come on, birthday boy. It's half past sleepy time. We should be in bed.\"<br>\r\n<br>\r\n\"Wait? What?\" Yatsi asked with confusion: \"How late is it? What's the time?\"<br>\r\n<br>\r\n\"Well if you must know, IT'S ONLY BLOODY MIDNIGHT!\" Kakarov shouted in his ear.<br>\r\n<br>\r\n\"I've been asleep...that long?\" Yatsi asked stunned.<br>\r\n<br>\r\nTesle grinned: \"Now you know why we thought you were maybe kidnapped or something. You missed half the party. Although I suppose you can count yourself lucky on that count. Actually we should be thanking you. We were sent to find you by your mother, and we got to skip cleaning the after mess. Nice move, Yatsi.\"<br>\r\n<br>\r\n\"Wow. Sorry. Really sorry. Didn't mean for that.\"<br>\r\n\"Forget it.\" Kakarov said; his usual robust self back: \"Come on. Just tell me: where the hell'd you get a tattoo parlor in this place?<br>\r\n<br>\r\n\"Fisrt tell me, Yatsi-\" Tanja interjected as they made their way downstairs: \"What were you doing there, all alone?\"<br>\r\n<br>\r\nYatsi didn't know what to say. Instead, he gave her the badly damaged box and the paper-scrap he had found within. Tanja looked at the seemingly useless items with furrowing brows: \"Okay, I don't get it.\" she said looking up. \"You're gonna have to explain them to me, Yatsi.\"<br>\r\n<br>\r\nAt the bottom of the stairway, Yatsi saw that all the tables, chairs, food and people were gone. The aftermath of the party was all that remained in the form of the village dogs feasting off scrap leftovers that had fallen to the floor.<br>\r\n<br>\r\n\"Be off with ya, ye mongrel mutts!\" Kakarov barked at them, throwing a fork to make them scatter back outside.<br>\r\n<br>\r\n\"You can't read this, Tanja?\" Yatsi asked.<br>\r\n\"No it's all gibberish.\"<br>\r\n<br>\r\n\"Let me see.\" Tesla requested, his arm extended. He studied it for a while and just scratched his head after Kakarov's ever impatient prompt at what the blazes the paper scrap was.<br>\r\n<br>\r\n\"Just a bunch of nonsense words.\" Tesla answered, one eyebrow raised.<br>\r\nKakarov confirmed in turn that he couldn't decipher what the paper was supposed to mean either.<br>\r\n<br>\r\n\"You all seriously can't read it??\" Yatsi asked astonished.<br>\r\n<br>\r\n\"Where'd you get it?\" Tesla asked in turn.<br>\r\n<br>\r\nYatsi smiled slyly: \"Kohler.\"<br>\r\n<br>\r\n\"You're kidding?\" Tesla asked; this time with both eyebrows raised 2 inches: \"That jerk-off? I wouldn't even have touched that box if I'd known it was from that complete nutter.\"<br>\r\n<br>\r\n\"Yeah.\" agreed Kakarov: \"That one's lost his most of his marbles of late. He's more batty that bats themselves are. He tried to gut me with a broken bottle once. Crazy basterd.\"<br>\r\n<br>\r\n\"Yeah, but you probably asked for it.\" Tesla sneered.<br>\r\n<br>\r\n\"He scares me. He's always so sour.\" Tanja intoned the last affirmation that none of them regarded Kohler very highly.<br>\r\n<br>\r\nYatsi ignored them: \"He said that the little box was relic from my grandfather, Alendrenski. That it was for my 18th name day.\"<br>\r\n<br>\r\n\"That's what HE said. Hope you didn't pay the bugger anything. You didn't, did you?\" Kakarov asked with a seriousness that implied you'd have to be mentally deranged to have done so.<br>\r\n<br>\r\n\"No. He just gave it to me - with the usual insults - then left. Disappeared without a trace.\" Yatsi said.<br>\r\n<br>\r\n\"Kind of like you did, heh comrade?\" Tesla smiled.<br>\r\n\"Right. Sorry about that. Again.\"<br>\r\n<br>\r\nTanja suddenly yawned: \"I'm tired. Can we go to sleep. We can continue this discussion tomorrow. Preferably after noon.\"<br>\r\n<br>\r\n\"Great. Now I have to walk an hour to get back to my hut.\" Yatsi complained.<br>\r\n<br>\r\n\"Forget it. Come sleep in my house for the night. You'd get to be wolf food before you even made it past the red square.\" Tesla said patronizingly.<br>\r\n<br>\r\n\"I don't want to impose-\"<br>\r\n\"Oh shut up, comrade Yatsi. Nobody cares what you think right now. Goodnight Kakarov.\" Tesla lifted his fur cap to him.<br>\r\n<br>\r\n\"Wait, don't I get an invitation??\" Kakarov moaned.<br>\r\n<br>\r\n\"One: you can wait until you're married to my sister before I'd let your unworthy rear-end in MY home. Two: you live across the damn street; you don't need shelter.\" Tesla sneered.<br>\r\n<br>\r\n\"That's not fair!!!\" Kakarov raged.<br>\r\n\"Goodbye my love!\" Tanja said, blowing a kiss in his direction. Kakarov looked miserable left behind.<br>\r\n<br>\r\n=====<br>\r\n<br>\r\nYatsi catched the blanket too late; it smacked into his nose with a thud.<br>\r\n\"Ow.\"<br>\r\n<br>\r\n\"Right. There's your bed. There's your soap. There's your blanket. Sleep well and don't let the bed-bugs bite. Or was that ear-crawlers? Can never remember. Keep your eyes closed and your hands the heck out off my sister's room. Oh wait, you're not Kakarov. Whatever. Don't do so anyway. Anything else you need, comrade?\" Tesla rambled off.<br>\r\n<br>\r\n\"That really hurt my nose, you know.\" Yatsi said.<br>\r\n<br>\r\n\"And a good night to you too!\" Tesla smirked.<br>\r\nSLAM! The door reverberated for a few seconds before reaching equilibrium.<br>\r\n<br>\r\nAlmost like a child that was keeping a secret cash of candy away from his parents, and just waiting for them to leave, Yatsi ripped out the piece of paper on which the Mark and its instructions had stood.<br>\r\n<br>\r\nWhat was that all about?! They couldn't read the paper! None of them could! What was going on!?<br>\r\nYatsi was glad on hindsight that he hadn't told his friends about the Mark having moved from the paper to his left hand. They'd have thought him insane. Or more humiliatingly: drunk.<br>\r\n<br>\r\nHe read the instructions over and over once more. This time with far less incredulous snorting disbelief after having seen the supernatural event that had resulted in him having a blistering tattoo edged into him!<br>\r\nIf he was to believe anything that the stupid set of instructions said, then he could shape shift. Just like a werewolf in the folklore! Although it appeared the shapeshifting was limited only to humans. Interesting.<br>\r\n<br>\r\nBut wait. If all this hocus pocus garbage was actually real, wouldn't that be seeking for trouble if he used the Mark? Then Yatsi remembered that he'd have to supposedly only stay in that form for one day. The shifting would not be permanent. Like Pandora whom could not contain her overwhelming curiosity, so too could Yatsi not contain his.<br>\r\n<br>\r\nHowever, after half an hour later of nothing happening, Yatsi felt like the fool Kohler said he was. He'd voiced random names of his friends and family. Thought about their faces. Chanted outloud the instructions as if recounting a spell. Obviously this Mark had some secret so as to activating its powers. Something more complicated. Ugh. He'll figure it out later.<br>\r\n<br>\r\nSinking his head into his pillow, Yatsi wondered what he'd actually do if he had the ability of shapeshifting mastered at his finger-tips.<br>\r\nOh I know. Minsc. I'd make myself whatever she found ideal in a mate. Ah who am I kidding? She's only into girls. Fate is a bitch.<br>\r\n<br>\r\nAs Yatsi was dozing off into the nether realm of the dreamworld, he didn't notice the Mark on his hand glow an eerie green.</span></div></div>",
            "created":1368507600,
            "id":1589945,
            "title":"The First Shift."
        },
        "13111":{
            "choices":[
                "It was Tesla.",
                "It was Tanja."
            ],
            "content":"<div class=\"\"><div> <span>The moth in Yatsi's room panicked. With the paraffin lamp turned off, its source of light had disappeared, leaving it blind and prone to bump mindlessly against the wooden cabin walls. Then - a faint green glow became alerted the moth to salvation!<br>\r\n<br>\r\nIt made an immediate bee-line (or rather moth-line) to Yatsi's left hand and landed upon the Mark which radiated a pale green light; the light shone the same way as daylight piercing the clouds of the heavens - laser beams that fell like pyres.<br>\r\n<br>\r\nThe moth fluttered its wings happily, content in having found a source of warmth.<br>\r\n<br>\r\n====<br>\r\n<br>\r\nYatsi's mind was in that unique twilight world which bordered the land of the sleeping and the waken. He was sort of semi-unconscious, yet not quite. While he had light dreams, he also had a slight rein over his thoughts.<br>\r\n<br>\r\nHis thoughts raced through the events that had occurred during the day. He felt like he was riding a cloud, looking downwards on himself as he partied with his friends, ate himself into sickness and listened to the infuriatingly dull tales of his uncles.<br>\r\n<br>\r\nThen without warning, Yatsi's point of view was jerked with sickeningly swiftness into another memory.<br>\r\nIt was the day before - on his way to Minsc's house. Yatsi saw the following in the third person.<br>\r\n<br>\r\n-------<br>\r\n<br>\r\nYatsi was walking swiftly. His strides were jumpy and nervous; anxiety clearly showed on his face. He was clutching a little carton container in his twitching hands. Upon reaching Minsc's home, he knocked on the front door. Yatsi almost bulked and ran, but luckily he steeled himself.<br>\r\n<br>\r\nThe door opened, revealing Minsc in all her glory. She stood there, so small and pretty and innocent; Yatsi thought his feet would thaw and sink into the snow he was standing on - that's how hot she made him feel.<br>\r\n<br>\r\nBefore he could shamefully stutter a feeble greeting, Minsc took the initiative: \"Well hello there, Yatsi! So good to see you!\" and she pulled him into her den.<br>\r\n<br>\r\n\"Ah...hi, Minsc.\" was all he could muster.<br>\r\n<br>\r\n\"Tomorrow's your big day, huh? You must be so excited. I bet your family is already unlocking their cellars; getting ready for all the big drinking!\" Her unquenchable enthusiasm always took many off guard; even those standing to pick a fight with her walked away with smiles. She had the natural talent of putting others at ease.<br>\r\n<br>\r\n\"Yeah...I can't wait.\" he said.<br>\r\n<br>\r\n\"Then what are you doing here of all places? All alone in the cold? You should be home, getting ready. Helping your mother cook. Or are you taking a quick escape from the preparation work; skipping the decorations? Don't worry, I won't tell anyone.\" she said with a wink and a smile than made Yatsi wonder if his feet would set the pine flooring on fire.<br>\r\n<br>\r\n\"Err...no. Actually I came by to see you, Minsc.\"<br>\r\n<br>\r\n\"Oh, for little old me? Do I get an invitation as well? You didn't have to come personally. Although that's so sweet. You're such a fine person, Yatsi.\"<br>\r\n<br>\r\n\"No, Minsc.\" said Yatsi with a face that resembled the rising morning sun: \"I didn't just come here to invite you-\"<br>\r\n<br>\r\n\"You need some help with the preparations?! Ooh, just give me a sec and I'll get my coats. I love organizing parties!\" she said eagerly and ignorantly, slapping her palms together in excitement.<br>\r\n<br>\r\nYatsi grabbed her arm; Minsc looked back, puzzled: \"No, Minsc. Listen...\"<br>\r\nThe look in his eyes made her realize he had to something heavy to say.<br>\r\n<br>\r\n\"Did I do something wrong, Yatsi?\"<br>\r\n<br>\r\n\"No. It's...I...ugh...\" he sighed. Then with a blush that would have set candles ablaze, he threw everything on the table: \"I came here to confess to you!!\" he blurted. \"I came here...ask you to be my mate...to be my girlfriend...I came here to ask you to be my my woman for my name day.\"<br>\r\n<br>\r\nMinsc stared at him blankly, nothing in her face betrayed what she thought.<br>\r\n\"I brought you this.\" Yatsi gave her the little carton box and opened it -  it was a porcelain hairpin; intricate little roses and birds decorated its hem: \"I know I'm late in asking. But I've never been surer. Please, take it.\"<br>\r\n<br>\r\nThe tears forming in Minsc's eyes made Yatsi slump like a rotten vessel under a tide of depressed emotions.<br>\r\n\"Oh Yatsi...\" she cried.<br>\r\n<br>\r\n------<br>\r\n<br>\r\nAs Yatsi exited Minsc's home, he swore in a language most unbefitting for the ears of small children. He kicked a stray can with as much vehement force as he could muster. It mashed into a thousand and one splinters against the lamp-post.<br>\r\n<br>\r\nDamn. Life is cruel. So Minsc was a lesbian. Yatsi felt hollow. Like someone had removed his guts. Like all the life was drained from him. She was so kind as she had laid it out to him in the gentlest of ways. Only Minsc would be able to reject someone in a soft gentle sense. But it still remained unpleasant.<br>\r\n<br>\r\nAs Yatsi tramped through the knee thick snow, he remembered not thinking himself odd for wishing he had been born a girl at that moment in his life.<br>\r\n<br>\r\nThe image of his dream then evaporated; like a pictured flushed down a drain.<br>\r\n<br>\r\n====<br>\r\n<br>\r\nOnce more Yatsi woke instinctively. Something was off. Badly off. The Mark was led hot! Bolts of green energy lanced from it! He jumped out of bet, spooked. But his horror had just begun. He was changing. Transforming. Shapeshifting.<br>\r\n<br>\r\nAt first Yatsi thought he was shrinking as he lost a league of his height. The ceiling grew higher; the room bigger in his perspective. His shirt and shorts grew baggy, ill-fitting and undersized. Yet his throat was too dry to scream.<br>\r\n<br>\r\nThen Yatsi thought he was growing younger. The hairs on his face, forearms and calves regressed into obscurity and his skin became smooth as silk. His stumpy fingers became dainty twigs. His feet shortened from a size 10 to 7.<br>\r\n<br>\r\nYatsi tried to see in the mirror what was happening, but his vision was obscured by brown hair falling across his face, adding oil to flame of his petrified confusion. <br>\r\n<br>\r\nHis head itched as his hair lengthened at an impossible pace and crawled downwards. Like cheese strips being cut from a cheese-girder it grew and snaked past his ears, then his neck, then his shoulders. Past his shoulder-blades, to the small of his back, then his sternum. They just continued to grow was his hips until it surpassed his butt.<br>\r\n<br>\r\nThen came the true sports. Yatsi felt his strength literally ebbing away as the muscles in his arms, legs, neck and torso degressed to add their collective masses elsewhere in his body. He felt no pain at least, only a numbness as if shot by a tranquilizer. Weakened, he fell to the ground sitting on his rear and knees as if paralyzed.<br>\r\n<br>\r\nThe reshaping of his bones and rearrangement of his flesh squeezed the air from his lungs, making him groan a bit. The groans grow steadily higher in pitch until he was squeaking in a high soprano voice.<br>\r\nA tugging on his throat alerted him to the disappearance of his adam's apple. His shoulders slendered and his midriff pinched into a narrow waistline. His hips grew wider, outward; whilst his knees grew inwards and together.<br>\r\n<br>\r\nFat collected on his upper arms, his thighs and rump. He was surprised to rise half an inch of the ground as his rear-end expended slightly. Still Yatsi did not shout or scream.<br>\r\n<br>\r\nThen his face felt like hot candle wax being remolded. He could feel with his fingers how his features softened.  His jawline and cheeks became less prominent. His lips swelled to become puffy and his pointed nose shrunk to a cute button snout. His bushy eyebrows became slender feathers and his scratchy skin became smooth like polished marble.<br>\r\n<br>\r\nFinally the pivotal moment. Yatsi now understood what was happening. He could but watch despairingly as the rod of his manhood retreated to become the inverted emptiness of girlhood. His scrotum followed suit, becoming the nether lips of a labia. He felt green in his new pristine face at the sight, but he wasn't even given the chance to watch this indignity in peace.<br>\r\n<br>\r\nHorrifyingly, his chest began to feel sensitive. Touching his nipples, he could feel mass rally behind them. Like 2 missiles slowly rising from their silos, he gradually grew a pair of respectable breasts. His night-shirt was lifted along with his impressive rack, exposing part of his stomach. Yatsi gasped.<br>\r\n<br>\r\nYatsi was in complete, total, utter, absolute shock. But who could blame him? All had happened under a minute.<br>\r\n<br>\r\nGradually, with dread and hesitation, Yatsi made his way back to the mirror. His entire axis of balance was thrown out of order; he had to crawl to it on his knees. Lifting the suffocating strands of long hair from his face, Yatsi gawked at himself.<br>\r\n<br>\r\nIn the reflection a scared-looking girl his age, breathing heavily, stared back with saucer eyes. This couldn't be. This must be a dream. This wasn't real. Yatsi prodded his new sizable bosoms gently as if to confirm their existence and just eyed himself stupidly.<br>\r\n<br>\r\nThe Mark's intense green glow then receded back into the black ink. Then Yatsi's normal self was back. What the hell is this?!! Am I high??<br>\r\n<br>\r\nA knock came from door: \"Hey, everything alright in there? What was all that commotion about? I'm coming inside.\"<br>\r\nAh damn.</span></div></div>",
            "created":1368594000,
            "id":1590342,
            "title":"Activation."
        },
        "131112":{
            "choices":[
                "Continue.",
                "Continue."
            ],
            "content":"<div class=\"\"><div> <span>Yatsi rammed his weight against the door so as not to let it open. NO! Not NOW of all times. He couldn't let anyone see him like this! Dammit.<br>\r\n<br>\r\nIf he had any misgivings about magic, then they were completely misspelled by now: he was officially a true believer of whatever the hell kind of powers the Mark possessed. On one side he was ecstatic: it worked! It bloody worked! He had transformed, shapeshifted; just as his grandfather had foretold. This was amazing!<br>\r\n<br>\r\nOn the other hand he was seriously peeved. I mean what the f###?! Why did he have to go turn into a blasted GIRL of all things?? This is NOT what he had in mind when he tried to discover the secrets of the Mark. How the heck was he going to explain this everyone? Never mind that; how the heck was he going to turn back? He could still turn back right?! Right??!!<br>\r\n<br>\r\nAnd now he was about to be discovered. Damn. Nevermind how he's supposed to convince anyone who he was, what would happen if they discovered an unknown person - a fricken girl of all things - in his room. Chuck him out? <br>\r\n<br>\r\nThe knocking continued and intensified: \"Hey, open up. Seriously, this isn't funny any more! Answer me! Say something if you're naked or whatever. Hello?!\" It was Tanja, she sounded desperate. Yatsi dared not answer in his new voice.<br>\r\n<br>\r\nThe door began to be pushed inwards. Snap! Yatsi was grievously weaker in this form; normally he would have easily won against the pixie-like Tanja when it came to mashing their strength against opposite ends of a door, but now she was steadily gaining leeway.<br>\r\n<br>\r\nOh no! Then the worst case scenario just got a great deal worse. In the struggle Yatsi's sleeping shorts fell off - his waist having shrunk to far more petite proportions had resulted in the baggy boxer not being able to hang on to his finer waistline anymore, thus exposing the entirety of his lower half. He stood there, helplessly hemmed against the door, clothed in only an ill-fitting shirt, his posterior visible for all the world.<br>\r\n<br>\r\nThe door kept grazing inwards.<br>\r\n<br>\r\nScrew it! Yatsi thought, and chose the lesser of two evils. He let go of the door and grasped for his dropped boxers to pull them back on for the sake of dignity. And unfortunately, with nothing to resist it from opening, the door opened to reveal an angry looking Tanja.<br>\r\n<br>\r\n----<br>\r\n<br>\r\n\"Finally! Jeesh! What was that all about! Yatsi, what's going in there...and woa...what the...who are you supposed to be, honey?\" Tanja asked with barely contained disapproval: \"You're not allowed in here! And...WHAT THE HECK ARE DOING WEARING YATSI'S CLOTHES? Please don't tell me this is what I think it is? Yatsi you pervert.\" she said in contempt.<br>\r\n<br>\r\nYatsi's crimson face would have made red roses look bleak in comparison; he tugged his shirt downwards to cover his midriff and had to use his remaining hand to keep his boxers from falling down. For the first time in his life he couldn't for the life of him think of something clever to say.<br>\r\n<br>\r\nTanja strided over to Yatsi and put her hands on her hips, glaring at the shamefaced cossack: \"Well, honey? Did the cat catch your tongue or something? Speak up. You're in big trouble, missy. How'd you get in my house? And where is Yatsi. WELL?\"<br>\r\n<br>\r\nPerhaps he was an idiot; or maybe he merely sucked at lying, but right then Yatsi couldn't think of anything to say other than the truth: \"I...I am Yatsi.\"<br>\r\n<br>\r\n\"Oh I'm not into that fetish, honey. So you can take your clothes and go right back to whatever whorehouse you came from. And you'll do so now if you don't want me to get the politsiya.\" Tanja said crossly.<br>\r\n<br>\r\nNow that made Yatsi's string snap: \"No you idiot.\" He truly sounded queer in his new squeaky voice: \"I mean I AM Yatsi.\"<br>\r\n<br>\r\n\"And I'm Putin. Now get out.\" Tanja said, starting to pull Yatsi's arm to the door.<br>\r\n<br>\r\nGrowing desperate: \"Wait! LISTEN TO ME! Will you just stop, comrade! I AM Yatsi. Do you see this mark on my hand? I just transformed into a girl! It's some kind of magic. Will you just listen to me, Tanja!\" This did not bode well.<br>\r\n<br>\r\n\"How do you know my name? Forget the politsiya, I think I need to call the lunatic asylum. And WHERE IS Yatsi, you bitch?\" It seemed Tanja would remain resolute in not believing him.<br>\r\n<br>\r\nOptions were becoming few and far between, so Yatsi said something he had promised Tanja never to say outloud: \"Tanja, when you were 16, you made me promise never to tell anyone about Spoednikska, your dog which you had stolen from the pound because it had been maltreated. It died despite our efforts a week later. You were very sad about it for a long time.\"<br>\r\n<br>\r\nTanja stopped in her tracks as if flash-freezed. Expecting a kinder and warmer reaction from Tanja, Yatsi was sorely disappointed to received the mother of all slaps in the face. Tanja's eyes burned of molten fury.<br>\r\n\"Yatsi you skunk! How could you betray me!\" she shouted with tears in her eyes to the roof: \"And you, you harlot, I can't believe he would say something so personal and private between ourselves to someone like you!\" she spat.<br>\r\n<br>\r\nA great. Talk about backfire, Yatsi thought as he rubbed his pained chin. Hell hath no fury like the girl whose most guarded secrets her best friend had squandered. It appeared Tanja still didn't believe he was Yatsi.<br>\r\n<br>\r\n\"Wait, wait!\" Yatsi tried to prevent another hit: \"September 13, 2004. You were drowning in the Krask lake. I pulled you from the broken ice. From then on you always had a phobia for lots of water. You said to me that day: 'Don't let me go again!' \"<br>\r\n<br>\r\nIt seems this time Tanja was subdued. The silence of the night became overbearing as she gazed at Yatsi with eyes that were becoming steadily wider and wider in realization. She swallowed.<br>\r\n\"Y-you, y-ou're Y-yatsi??\"<br>\r\n\"Yes! Yes!\"<br>\r\n<br>\r\nIn a totally random act, without warning, she strode up to him, pulled open the hem of his shorts and eye'd the contents.<br>\r\n\"Hey, hey, hey, hey! Where the heck are you looking!\" WTF?? Yatsi grabbed his boxers back from Tanja and jumped back, his face flushed at the prospect of another girl staring at a new organ he himself had not had the courage to look upon.<br>\r\n<br>\r\nTanja's mouth was open and her jaw hanging: \"But...how? You are Yatsi. But...you're a girl!!\" Her eyes got a glassy glazed look in them.<br>\r\n<br>\r\n\"Thanks, I noticed.\" Yatsi said with dripping sarcasm.<br>\r\n<br>\r\n\"Were you always a girl?\" she asked with astonishment.<br>\r\n<br>\r\n\"No. Only for the last 3 minutes.\" he asnwered.<br>\r\n<br>\r\n\"You ARE Yatsi.\" she declared: \"Only he's that much of a smartass.\"<br>\r\n<br>\r\n\"Thanks. I think.\"<br>\r\n<br>\r\n\"But-but-but...HOW? What?\" she asked.<br>\r\n<br>\r\n\"That's gonna take a while to explain.\" Yatsi said, relieved that he wasn't about to spend time getting thrown out of the house and shivering in the snow.<br>\r\n<br>\r\nTanja suddenly looked horrified: \"Oh no. I had said all those horrible things about you. I called you a harlot...and-and-\"<br>\r\n<br>\r\n\"Nevermind. I've had worse. I'm only grateful you actually believed me.\" Yatsi said.<br>\r\n<br>\r\nAn awkward silence befell between them. Neither knew what to say next.<br>\r\n<br>\r\n\"So...\" said Tanja, with a quizzical expression: \"...I didn't know they had sex-change operations that went that fast. Not that I'm judging.\" she said hurriedly, with her palms upward.<br>\r\n<br>\r\n\"That's not even remotely funny. I didn't ask for this.\"<br>\r\n<br>\r\n\"Was it aliens then?\" Tanja could have a real weird sense of humour at times, Yatsi reflected.<br>\r\n<br>\r\n\"Please Tanja...\"<br>\r\n<br>\r\n\"Oh I know. It was-\"<br>\r\n<br>\r\n\"Tanja! Listen!\" He explained for the next 10 minutes everything that had happened from the moment Kohler had given him the box to the point where the Mark had embedded itself into his left hand to the point where he was standing before her as a girl.<br>\r\n<br>\r\n\"So...you don't know why this happened?\" Tanja asked, as she rubbed the scars of the Mark which was still present on Yatsi's feminized left hand.<br>\r\n<br>\r\n\"I know WHY it happened and HOW it happened. I just don't know why I turned into a girl of all things. I haven't figured out how the Shapeshifting actually works. You can't tell anyone about this, you hear?\"<br>\r\n<br>\r\n\"Well...you can't stay in here. And you can't stay dressed like that.\" Tanja said.<br>\r\n<br>\r\n\"What's wrong with the way I'm dressed?\"<br>\r\n<br>\r\nTanja pulled her mouth to the side and raised an eyebrow.<br>\r\n\"Never mind.\"<br>\r\n<br>\r\nTanja took Yatsi silently with her. They easily passed Tesla's room without harassment. His laborious epic snoring announced to all within 3 blocks that he was still sleeping like a rock (and snoring like an avalanche).<br>\r\n<br>\r\n\"Can you turn back? Are you stuck like this?\" Tanja asked Yatsi once they were in her room and it safely locked.<br>\r\n\"For the next day. I can't undo a shapeshifting for another 24 hours.\"<br>\r\n<br>\r\nTanja smiled slyly at him.<br>\r\n\"What's so amusing?\"<br>\r\n<br>\r\nTanja ignored him as she dug in her closet for a pair of extra PJ's.<br>\r\n\"Here. You look like an idiot. More than usual I mean. Wear this till we can figure something out for tomorrow .\" She yawned: \"You know birthday-boy, you really are taking your toll on my beauty sleep.\"<br>\r\n<br>\r\n\"What about Tesla? What if he sees me?\" Yatsi asked.<br>\r\n\"You should have thought of that before you went for the sex-change operation, comrade.\" Tanja smirked.<br>\r\n\"Har Har.\"<br>\r\n<br>\r\n\"We'll just tell him you're some lost cousin or whatever that's visiting. Tesla's pretty dim once you get to know him well.\" Tanja said. \"Hopefully before he realizes what's up, you'll be back your ugly self.\"<br>\r\n<br>\r\nTanja made Yatsi a bed on a spare mattress and sleeping bag. After discussing the bizarre events of the day and Yatsi's transformation, and how they would deal with it the following day, they both signed off for sleep.<br>\r\n<br>\r\nDespite his alien body and his irrational apprehension of touching any of the girl parts that weren't there an hour before, Yatsi found himself drifting to the dreamworld once more.</span></div></div>",
            "created":1368637140,
            "id":1590472,
            "title":"Identity Crisis."
        },
        "1311121":{
            "choices":[
                "Continue.",
                "Continue."
            ],
            "content":"<div class=\"\"><div> <span>Whoever said that third time's the charm needs to go fling himself off a cliff, Yatsi thought. The reason: for a third time in 24 hours Yatsi awoke instinctively, this time with far less appeal than the first or second. Opening his eyes revealed Tanja sitting on top of him and thoughrally inspecting every inch of his body the way a stamp collector viewed his inventory - and the body she was busy inspecting didn't add much to aid the blood that was rushing to his face like boiling water.<br>\r\n<br>\r\nLike a camper woken by a monster tarantula crawling over his face, Yatsi ejected himself from his sleeping bag and out from beneath Tanja: \"Yeeeeaaahh!!! What the hell, comrade!!!?\" Yatsi's new high voice sirened out.<br>\r\n<br>\r\n\"Nope. You're still a girl.\" she stated the brutally obvious, an amused smile decorating her face.<br>\r\n<br>\r\n\"Don't do that! You just scared twenty years of my life away!\" Then as if remembering something vital, Yatsi checked himself in her cabinet mirror. Sigh. And here he was hoping to a bad dream. Clearly last night's transformation had crossed from his nightmares to his reality.<br>\r\n<br>\r\nThe brunette staring back mimicked his scowl as Yatsi's face showed his clear displeasure of being stuck as a female for the known day. Her eyes also darted in response to Yatsi's to see the surface of her pristine left hand which still held the pitch black mark sitting obnoxiously on her skin.<br>\r\n<br>\r\nAnd then there was the infernal hair! It hanged all over him like infesting weeds. Yatsi even sneezed away several stray strands that were blockading his nasal openings. Tanja seemed to find that hilarious as she let forth a spurt of barely contained giggling.<br>\r\n<br>\r\n\"Oh Yatsi, you really are a mess! You must be the cutest girl I've ever seen woken!\" she said.<br>\r\n<br>\r\nYatsi growled: \"This isn't funny. I need to find a way to reverse this as fast as possible. There's no way I'm staying a girl for more than a whole day!\"<br>\r\n<br>\r\n\"Oh?\" said Tanja hotly: \"And what's wrong with being a girl, heh?\"<br>\r\n<br>\r\nYatsi groaned: \"That isn't what I meant-\"<br>\r\n<br>\r\n\"Oh don't even try slipping out of that one!\" Tanja said as she catapulted a cushion into Yatsi's unexpecting face.<br>\r\n<br>\r\n\"Umngff.\" Yatsi said: \"You and Tesla must be hating my face. Okay look, I'm sorry. That was insensitive of me.\"<br>\r\n<br>\r\nTanja pulled her face, her mouth going to the side: \"Humff. You've been bitching the whole of last night about how 'terrible' and 'unfair' this was of you being a woman. Well guess what, Yatsi? I've been one my whole life, and I'm not whining about it like a pre-schooler. And I happen to like it. So get over it. You might actually enjoy today.\"<br>\r\n<br>\r\n\"Alright, alright!\" Yatsi said, clearly distraught that he had upset her: \"I'm sorry. I truly am. I didn't know I sounded like that. Please forgive me. Tanja?\"<br>\r\n<br>\r\nTanja looked at him with one furious eye from the side; then her face cracked into a bright smile: \"Oh Yatsi It's just really impossible to stay angry at you, you fool you! Fine, I forgive you. To be fair I find the thought of turning into a boy to be gross.\" she shivered: \"Yeah...that would suck. So that makes us even. I know how you feel.\"<br>\r\n<br>\r\nYatsi looked relieved: \"I need to find a place to stay for the day. Preferably isolated. Somewhere with as few people I know as possible. Hopefully no one will realize anything was wrong till I've got this sorted out. I can't go home this way.\"<br>\r\n<br>\r\n\"You can just stay here with me, Yatsi. I can think of plenty fun things for us to do till you wear off your shape-shifty thing.\" He didn't exactly like the sound of that one. And not because of Tanja's mispronounciation of the word shapeshift. Still, it was a far better option than wandering lost.<br>\r\n<br>\r\n\"What about Tesla? Won't he ask what I'm doing here?\"<br>\r\n<br>\r\n\"Leave that to me. He won't have anything to say if one of my girl friends visit me. But what about your mother, Yatsi? Won't she wonder where you are?\"<br>\r\n<br>\r\nYatsi just showed off a grim grin. His mother Liarrsa was the most unmotherly individual on the face of this earth. With the death of his late father, she went off on some bizarre drunken spree leaving Yatsi to raise himself from the local orphanage. She wasn't exactly all that far apart from street swatters. Yatsi let her live in bis cabin after he found work to afford one. Liarrsa wasn't always in touch with reality. No. She wouldn't be missing Yatsi if he was missing for weeks.<br>\r\n\"Nah. She won't notice.\"<br>\r\n<br>\r\n\"Good. That's settled. You camp out here for the day.\" Then without forewarning of any kind, Tanja pulled off her night-shirt to reveal nothing was to be left to the imagination.<br>\r\n<br>\r\nIf Yatsi had been an Eastern Slavic cartoon character, then his nose would have spouted an arcing fountain of blood in modesty. His hands went to cover his eyes as if they had gotten pepper in them and he rotated a full 180 degrees as if performing a marching turnabout.<br>\r\n\"Whoa, whoa, whoa, whoa, whoooaaa!!! Have you lost your senses, comrade Tanja! I'm right here!\"<br>\r\n<br>\r\nTanja stopped midway undressing: \"Heh? What are you on about? We're both girls now.\"<br>\r\n<br>\r\n\"It's NOT right!\" Yatsi said. Tanja just laughed at him.<br>\r\n<br>\r\n\"Oh Yatsi. It's so sweet to see someone so shielded and innocent.\"<br>\r\n<br>\r\n\"That isn't the point.\" he said. \"Cover yourself for pity's sake.\"<br>\r\n<br>\r\n\"I don't figure what you're so modest about. I already saw everything you had to offer. Now it's only fair trade between girls.\" Tanja said with a wicked smile.<br>\r\n<br>\r\n\"Oh sweet grief. Don't remind me.\" Yatsi said through his fingers as he remembered how Tanja had stargazed his altered genitals the previous evening: \"Tesla is SO going to murder me with a capital M.\"<br>\r\nThe irony wasn't lost on Yatsi in that Tesla had warned him in particular to \"keep his hands out of his sister's room\". He wondered if the rule still applied in the current circumstances in which Yatsi was a female. Tanja was proving to be a wild one.<br>\r\n<br>\r\nSomething smashing lightly against Yatsi's back alerted him that Tanja had thrown clothes at him: \"You can look, lover boy. I'm done. There's yours.\"<br>\r\n<br>\r\nYatsi cautiosly peeked around to find Tanja standing (thankfully) fully clothed, combing and brushing her hair, in front of her cabinet.<br>\r\nThen Yatsi looked down to the floor to see what it was Tanja had sent airborn into his back.<br>\r\n<br>\r\nTo his dismay he saw the pile included stockings, a v-necked shirt, panties and most skin-crawlingly: a bra. You gotta be s####ing me, right?<br>\r\n<br>\r\n\"You cannot be serious. Tell me you aren't serious, Tanja.\" Yatsi said, cherry-faced.<br>\r\n<br>\r\n\"You're gonna be thanking me, big boy. Oh, what? You're going to be wearing your old clothes? Is that what you're thinking? Then think this: just how much are you going to stand out in your oversized coat and trousers? Don't be stupid, Yatsi.\"<br>\r\n<br>\r\nYatsi knew she had a point. A very fine point. Russian clothing didn't have much middle ground between the sexes. Keeping a low profile would be best in what Tanja was offering him. On the other hand, Yatsi didn't particularly like the way Tanja was smirking at him, clearly enjoying his obvious discomfort at the prospect in what he considered cross-dressing. Pink pajamas was one thing; stockings another.<br>\r\n<br>\r\nYatsi tentatively picked up the array of clothes. But he paused when he saw Tanja eyeing him expectantly: \"Oh all right. I won't look.\" she said.<br>\r\n<br>\r\nSo, as if diving into a freezing swimming pool to get the cold over with, Yatsi discarded his borrowed pj's and set upon the task of cladding in his first female attire. To his mortifying embarrasment, he found the snug fit of the panties against his lower abdomen to be pleasantly soft. As if to cover up his shame, he covered them quickly with the alternatingly purple and black coloured stockings, followed by the woolen over skirt.<br>\r\n<br>\r\nThen Yatsi hit a tiny snag. The bra. He struggled and fumbled with it for a full minute, but for the life of him couldn't gain progress. He didn't know how to hook the wires or clasps. Resigning, he looked over to Tanja whom was pretending not to notice, whilst she was staring into space, whistling and swaying to and fro. It was clear she was waiting for Yatsi to beg for assistance.<br>\r\n<br>\r\nUgh. Yatsi just smiled thinly and shook his head: \"I need help.\"<br>\r\n<br>\r\nTanja was on him in a split-second, clearly enjoying his indoctrination into sisterhood. However, without jeering she kindly showed him the ropes: bending him over slightly, pulling on the cups and showing/telling him how to hook the claps properly. Of course the instructions went through one ear and out the other, as he was too preoccupied with Tanja digging her fingers into the cups to re-align Yatsi's new breasts with the awkwardly situated bra. Upon completion, Yatsi's face burned with the intensity of the sun.<br>\r\n<br>\r\nTanja handed Yatsi the v-neckline shirt, which he donned without hassle.<br>\r\n\"Err...thanks...I think.\"<br>\r\n<br>\r\nTanja's face was all teeth: \"Wait, hold still. Let me do something about all that hair, Rapunzel.\" She folded the cables of fur into a ponytail, tying it with a string; something for which Yatsi was grateful for - now he no longer had to stroke hair out of his eyes.<br>\r\n<br>\r\n\"Say hello to the new you. Hey, you're not bad on the eye, Yatsi.\" Tanja said, beaming at her work: \"Actually, I guess we can't be calling you Yatsi anymore.\"<br>\r\nYatsi merely rolled his eyes.<br>\r\n<br>\r\n\"No I mean it. We should call you something else in the meantime. What would happen if I referred to a girl with a name like Yatsi. People would stare.\" Names ending with 'tsi' was a distinctly robust sound and clearly indicative of a male person.<br>\r\n<br>\r\n\"Then what pray would you call me?\"<br>\r\n<br>\r\n\"I present to the world-\" Tanja announced, shoving Yatsi in front of the mirror: \"- Yenzee.\"<br>\r\n<br>\r\nYatsi snorted.<br>\r\n\"Girls don't make pig noises, Yenzee!\" Tanja admonished: \"Now let's go get breakfast.\"</span></div></div>",
            "created":1368741420,
            "id":1591222,
            "title":"Yenzee."
        },
        "14":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Highschool student",
                "College Student",
                "Married couple with no kids"
            ],
            "content":"<div class=\"\"><div> <span>Please Remember!<br>\r\nStory 4: Clothes Morph<br>\r\n- change bodies by putting on someone's clothes<br>\r\n- change into the last person to wear those clothes.<br>\r\n- You must have full outfit to swap.  <br>\r\n- Body parts change with corresponding clothes: Shirt, bra, bikini top, etc for head to waist.  Skirt, shorts, pants, underwear for legs down.  Shoes/sock not necessary to change feet.  Dresses morph the whole body.<br>\r\n- Only morph back to your body when you put something of your own on.<br>\r\n<br>\r\n<br>\r\n<br>\r\nAre you...</span></div></div>",
            "created":1289797200,
            "id":994271,
            "title":"Clothes Morph"
        },
        "142":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Girl",
                "Boy"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Girl or boy?</span></div></span></div>",
            "created":1289797200,
            "id":994278,
            "title":"College Student"
        },
        "1421":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Stay home to experiment more",
                "Go out with her new look"
            ],
            "content":"<div class=\"\"><div> <span>Katie shrugged on her roommate Ashley's sweater, and bent down to grab her purse off the floor when she felt her bra strap digging uncomfortably into her back.  When she went to the mirror to adjust it, Katie was shocked to see that her chest had inflated, her breasts stretching the front of her shirt.  Katie quickly ripped off her blouse to inspect her breasts, and was delighted to see that they had grown at least two cup sizes.<br>\r\n<br>\r\nShe rummaged through her things, looking for a better shirt, when she found a sexy tank top that had never fit her right around the boobs.  When she put in on, she watched in dismay as her chest shrank again, back to her normal size.  As she pondered what had just happened, Katie realized that the change had happened when she had put on Ashley's sweater.<br>\r\n<br>\r\nAshley had considerably larger breasts than Katie, and she also had nice abs, something Katie had never worked for.  Katie pulled the top back over her head and unhooked her bra.  Slipping the sweater on, Katie watched, fascinated by the way her stomach hardened and her breasts ballooned.</span></div></div>",
            "created":1289797200,
            "id":994285,
            "title":"Girl"
        },
        "14212":{
            "author_id":"despicableme",
            "author_name":"despicableme",
            "choices":[
                "Meet up with her boyfriend",
                "She's single, she teases some guys."
            ],
            "content":"<div class=\"\"><div> <span>Tearing herself away from the mirror, Katie remembered that she had a party to get to.  She carefully selected one of Katie's shirts, so she wouldn't change back, and as a second thought, grabbed one of her bras as well.  No need to be uncomfortable!  Katie stepped back to admire her reflection, when she had an idea.<br>\r\n<br>\r\nHer housemate Morgan had an amazing ass.  Would she be able to have that if she slipped on one of her skirts?  Katie raced across the hall, and was delighted to see that Morgan had already left.  Rummaging through her dresser, Katie grabbed a miniskirt she hadn't seen Morgan wear in ages.  When she slipped it on, she felt her butt fill the skirt, and she grew about an inch with the addition of Morgan's long legs.<br>\r\n<br>\r\nWhen she went to put her shoes on, Katie found that they no longer fit, as she had Morgan's feet as well as her legs, and snagged a pair of her heels that were sitting by the door.  Praying that the girls wouldn't miss the clothes, Katie headed out to the party.</span></div></div>",
            "created":1289797200,
            "id":994290,
            "title":"Go out with her new look"
        },
        "15":{
            "author_id":"cale55",
            "author_name":"Sonic42",
            "choices":[
                "Aelita- 17 yrd sister, nice body, head captain for her cheerleading squad",
                "Janet- 15 yrd girlfriend, hot body, head captain for the girls volley ball team "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You fell away at 10:00 pm on a saturday night. Who body do you wake up in?</span></div></span></div>",
            "created":1330491600,
            "id":1286513,
            "title":"Body Control"
        },
        "151":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Go to school",
                "Go to your sisters boyfriends house (your feeling a lityle horny)",
                "Knock yourself out to control anotger person"
            ],
            "content":"<div class=\"\"><div> <span>You were playing an intense round of (favorite game) at around 9:50 pm you were almost to the top 10 when out of nowhere you losed. You were so upset, that was one of the best games you've ever done! Your sister comes in telling you to shut up and that she is trying to sleep for the big game tomorrow... which you tedpobd with a \"get the hell out of my room!\"<br>\r\n<br>\r\nShe tells you to watch your language (she treats you like such a baby) and leaves. You were so upset that you kicked your wall so hard it broke. Your anger disappeared as you knelt down in horror to inspect the damage, to your surprise there seems to be a extra hidden room in there.<br>\r\n<br>\r\nCuriosity took over so you pushed in yourself in the tiny hole that your foot had gone through, as you got in you were meeted with a huge draft of wind. You turned on your flashlight and saw that it was empty except a tiny parcel in the middle of the room. You waled over to it and saw it was partially open, all you needed to do was pull on the edges and--<br>\r\n<br>\r\nYou felt like your body was being stripped apart your mind was being poked by a foreign being that you did not fully understand. You suddenly feel like a switch has been flipped, you realize your new abilities are within reach you just need to fall asleep.<br>\r\n<br>\r\n--you are pushed back against the rooms wall, the parcel is now even more opened you didn't dare try and open it further, especially since you have just unlocked your new abilities. You step out of the room and cover the hole  with a poster of (favorite game) and see the time: 10:00 pm time for bed, you smile you had never felt more excited to go to bed.<br>\r\n<br>\r\nYou fell asleep at around the same exact time as ypur older sister Aelita, she was pretty hot and she was in her Senior year. You fell asleep dreaming ahout the things you'd do in the morning.<br>\r\n<br>\r\n                            In the morning<br>\r\n<br>\r\nYou start stirring at around 7:00 am, your alarm was beeping at you, for a split second you thought that you had just hallucinated the entire room and or were going crazy. Thise thoughts extinguished when you saw your arm: it was long and slender. You sat up in your new bed and looked down, you saw two large mounds of flesh sticking out if your chest which you promptly took a hold of,  they felt soft and squishy.<br>\r\n<br>\r\nYou let go of them to look into the mirror on the other side of the room: <a rel=\"nofollow\" href=\"https://thumbs.dreamstime.com/b/beautiful-sexy-woman-pajamas-smiling-young-adult-attractive-sensuality-pretty-blonde-babe-pink-white-bed-52602065.jpg\" target=\"_blank\">https://thumbs.dreamstime.com/b/beautifu...</a><br>\r\nYou were simply amazed at how well your new abilities worked, you just realized that you need to go to your sisters highschool since that was what your new alarm was signaling. You got up  and changed (you may have taken a tiny peek at your new form once or twice) into her cheerleaders outfit.<br>\r\n<br>\r\nOnce that was done you looked into the mirror amd smiled: <a rel=\"nofollow\" href=\"https://cdn7.bigcommerce.com/s-pqndnq/images/stencil/1280x1280/products/904/12145/JHC1026_a__77549.1410470799.jpg%20https://cdn7.bigcommerce.com/s-pqndnq/images/stencil/500x659/products/904/12145/JHC1026_a__77549.1410470799.jpg?c=2\" target=\"_blank\">https://cdn7.bigcommerce.com/s-pqndnq/im...</a><br>\r\n<br>\r\nYou walked out of your sisters room and stepped into your room yo see your form still passed out, ypu expected this but wanted to see it for yourself. You walk down into your living room to see your other family members.<br>\r\n<br>\r\nWhat do you do now?</span></div></div>",
            "created":1545087960,
            "id":2590217,
            "title":"Aelita- 17 yrd sister, nice body, head captain ..."
        },
        "1511":{
            "author_id":"cale55",
            "author_name":"Sonic42",
            "choices":[
                "yes",
                "no",
                "yes but it's very limited at the moment"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Do you have access to your sister's mind to impersonate her perfectly?</span></div></span></div>",
            "created":1545467460,
            "id":2591834,
            "title":"Go to school"
        },
        "1513":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Mom, Teresa ",
                "Dad, John",
                "Other sister, Natalie"
            ],
            "content":"<div class=\"\"><div> <span>Aelita was a great person to control but you wanted to be another person in your family to change into, your choices are...<br>\r\n<br>\r\nYour mom, Teresa- <a rel=\"nofollow\" href=\"http://cdn.vthumbs.com/thumbs/300px/content/2016-03-17/217266_01.jpg\" target=\"_blank\">http://cdn.vthumbs.com/thumbs/300px/cont...</a><br>\r\n<br>\r\nYour Dad, John- <a rel=\"nofollow\" href=\"https://talentnetworkinc.com/wp-content/uploads/2013/04/Curt-Wootton-Headshot-3.png\" target=\"_blank\">https://talentnetworkinc.com/wp-content/...</a><br>\r\n<br>\r\nYour other sister, Natalie- <a rel=\"nofollow\" href=\"http://xxxpicz.com/xxx/sexy-college-girls-hot-sexy-girls-photo-gallery-pinterest-girl-photo-gallery-and-college-girls.jpg\" target=\"_blank\">http://xxxpicz.com/xxx/sexy-college-girl...</a><br>\r\n</span></div></div>",
            "created":1545437880,
            "id":2591708,
            "title":"Knock yourself out to control anotger person"
        },
        "15131":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Inspect your new body",
                "Follow about her routine"
            ],
            "content":"<div class=\"\"><div> <span>You want to see how your mom's life is so you un-control your sister and wake up in your bed. You quickly fall back asleep and when you wake up again you're downstairs in the dining room eating cereal. You look down and see two C breasts dangling in your dress skirt, short blond hair is tickling the back of your neck. You look forward and see your dad reading the newspaper, and Natalie getting ready for school, and Aelita (seemingly unaware that you have taken control of her body just a few minutes ago) is acting normal and grabs her stuff, says, \"bye! See you tonight!\", and gets into her car.<br>\r\n<br>\r\nYou smirk, you now have the most power in the family since your dad always follows mom in decisions. <br>\r\n<br>\r\nSo what do you do now?<br>\r\n<br>\r\n</span></div></div>",
            "created":1545482520,
            "id":2591878,
            "title":"Mom, Teresa "
        },
        "15133":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Explore more of thos body",
                "Go to her and Aelita's school"
            ],
            "content":"<div class=\"\"><div> <span>Natalie seems like a good option, so you un-control Aelita and wake up in your bed. You quickly go back to sleep anticipating the moment when you wake up again. You wake up in Natalies room and apparently looking into a mirror. <br>\r\n<br>\r\nYour sister was pretty hot, even though she was a year younger than Aelita, her boobs were the biggest in the family: at around DD-cup size. Today however, they were your boobs and so you cupped tgem in your hands and squeezed, they were pretty soft actually but really sensitive.<br>\r\n<br>\r\nYour new long brown hair she got grom your dad, and the hourglass figure she got from mom, but with that you decided to...</span></div></div>",
            "created":1545483000,
            "id":2591879,
            "title":"Other sister, Natalie"
        },
        "151332":{
            "author_id":"baymaster08",
            "author_name":"Baymastercraz",
            "choices":[
                "Accept it and suck his divk",
                "Try to deny him the chance"
            ],
            "content":"<div class=\"\"><div> <span>You smile as you let go of your new breasts and say \"time to see what it's like having the best body in school\" and leave the house along side a rather dazed Aelita. When you get to the end of the walkway you see Natalie's or now your boyfriend beckoning you to ride with him which you gladly accept, you see Aelita get into another car with her friends and watch them drive off. When you get half way to the school you notice the car slow to a stop on the side of the road, \"damn, I guess I forgot to refuel\" your new boyfriend explains as he looks rather lustfully towards you , \"uhh that's not good, how are we going to get to school?\" He suddenly rolls up the tinted Windows and looks over at you \"actually I have something else planned\". He suddenly grabs at you and starts to kiss you straight on the lips which is a huge surprise for an unsuspecting you.<br>\r\n<br>\r\nYou don't know what to do, it you breakaway now he'll get suspicious but you didn't sign up for this! He suddenly gives you a chance to get some air and as he watches you gasp for air he says \"you okay babe? Usually you can go for a lot longer than just ten seconds\" you struggle to come up with a response \"uhh well I had a weak breakfast, didn't get much in me\" he nods then get he another signature lustful look, \"well maybe I can fill you right up\" he starts to unzip his pants and you suddenly realize your really poor taste in words.<br>\r\n<br>\r\nWhat do you do!?</span></div></div>",
            "created":1571467440,
            "id":2735139,
            "title":"Go to her and Aelita's school"
        }
    },
    "info":{
        "author_id":"despicableme",
        "author_name":"despicableme",
        "brief_description":"This is a group of body switch stories that anyone can add to.  Don't be afraid to add!",
        "created":1288540920,
        "description":"<td align=\"left\" class=\"norm\">The rules for this story are:<br>\r\n1) Please use proper grammar and spelling.  NO CHATSPEAK!<br>\r\n2) Try not to change the character's personality.<br>\r\n3) No killing anybody.<br>\r\n4) No random new powers.<br>\r\n<br>\r\nYour options for beginning the story are:<br>\r\n<br>\r\nStory 1: Trait Changer<br>\r\n- Can change your traits or anyone else's by just thinking<br>\r\n<br>\r\nStory 2: Swap by Touch<br>\r\n- You can swap two people's bodies, including yourself, by simply touching them<br>\r\n- Swap only lasts for a day<br>\r\n<br>\r\nStory 3: Change Your Own Body<br>\r\n- Change your own body by simply thinking, the changes last for 24 hours<br>\r\n<br>\r\nStory 4: Clothes Morph<br>\r\n- change bodies by putting on someone's clothes<br>\r\n- change into the last person to wear those clothes.<br>\r\n- You must have full outfit to swap.  <br>\r\n- Body parts change with corresponding clothes: Shirt, bra, bikini top, etc for head to waist.  Skirt, shorts, pants, underwear for legs down.  Shoes/sock not necessary to change feet.  Dresses morph the whole body.<br>\r\n- Only morph back to your body when you put something of your own on.<br>\r\n<br>\r\nStory 5: Body Control<br>\r\n- when you go to sleep, you can take over the body of anybody<br>\r\n- your body stays asleep, and the person whose body you are in doesn't know you have taken it over<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n</td>",
        "id":1720876,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1583949600,
        "modified":1583949600,
        "pretty_title":"Body Switch Stories"
    }
}