{
    "chapters":{
        "1":{
            "author_id":"shadoe",
            "author_name":"Zelda",
            "choices":[
                "These really aren't choices, just more guidlines: no lang., drugs, sex, etc."
            ],
            "content":"<div class=\"\"><div> <span>The boy was roughly jerked from bed and forced to stand at sword point.  Barely awake, he was shoved forward into the familiar fire room where he saw his parents, younger sister, and older brother.  His captors were garbed in black, each with a sword, and the boy noticed that each had the caricature of a raven pierced by a dagger branded onto their right hand. <br>\r\nThe five were lead to the front of their small farm house and lined up facing the house, the dark forest and haunting moon framing them in the background.  The family watched in horror as their house and barn were torched, listening to the frantic, terrified whinnying of the horses, the screaming of lambs and chickens.<br>\r\nThey were all bound as one of the men came forward.  The man sliced the necks of the mother and father in one swift, fluid motion.  His older brother lunged forward in bitter anguish and fury and he too was cut down.<br>\r\nHis captor looked toward him and sneered.  “Going to try a swing at me, boy?  Think you can take me down like your brother?  Or are you too afraid you’ll end up like them- dead!”  The boy ran forward and just as the man went for him, he ducked under his legs, got behind him, and threw his arms around his neck, using the rope that bound his wrists against the man’s neck to choke him.  The boy clung to the man with all his might as his opponent jumped up, clawing at his hands.<br>\r\nThe surrounding men rushed forward to help their comrade rid himself of the crazed child.  The more they tugged, the tighter he squeezed until finally, one of them managed to slice him across the face with a dagger.  He fell limply to the ground unconscious.<br>\r\n <br>\r\nKyron mounted his horse, avoiding the eyes of Ciaphis, his comrade.  He dreaded their arrival at the Summit and yet he knew he could not run.  He still remembered the torturous days in the pit.  He would have died if not for his only friend bargaining a way out for him.  Kyron shuddered and set his horse off a steady canter, his comrade not far ahead.<br>\r\nThe sun would rise soon and Kyron was determined to be as far away from this place as possible.  It reminded him too much of his past.  A chill wind blew across the plains and he pulled his cloak tighter around him.  They started into a gallop as they got further into the field trying to find cover as quickly as possible.  <br>\r\nThe white light of the moon’s groping rays shined down upon them and, to Kyron’s disgust, illuminated the pale brand of a pierced raven on his right hand.  It was the mark of who he was.  A selected few, he had been told.  Only the best get the honor of such a mark.  Honor!  There was no honor to it.  Killing in the dead of night, settling grudges, ending family lines, resolving unpaid debts; all of these considered an honor.  He had had enough of this “honor.”<br>\r\nThey entered the woods on the other side of the clearing.  Suddenly, Ciaphis stopped and held up his hand.  He silently dismounted and stepped forward, listening.  At the Summit His nick name was (he was coined) the Hound because of his keen sense of smell, sight, and hearing.  He could track down anything, anywhere.<br>\r\nThe winds abruptly change directions and the scent of men and horses, not their own, washed over them.  Shouting, Ciaphis jumped back onto his horse and kicked it into gallop once more.  Kyron raced after him, desperately trying to leave behind their pursuers who he could hear crashing through the brush not far behind.  Branches whipped across his face, tearing at his flesh.  An arrow flew by his head, missing him by mere inches.  Kyron bent low over his horse, urging him to go faster.  Frothing at the mouth, his horse lunged forward in obedience, sensing the danger behind.<br>\r\nTrees went by in a blur and the sounds of pursuit softened.  Still tense, Kyron kept up the speed hoping to catch up to his companion who was now out of his field of vision.  He probed the darkness, squinting against the wind.  Kyron left the wood once more and entered the open plain.  The surrounding land seemed somehow unfamiliar, but unless Ciaphis had turned somewhere when Kyron had not seen him, they should have been headed toward the Summit.  He slowed down, and then, hearing nothing, stopped.  Where was he?  Surely he could no longer be headed up the mountain.  He looked to the stars, trying to pinpoint his location.<br>\r\nThe sounding of something soaring through the air found his ears and Kyron whipped around.  He dove off the horse just as the arrow pierced his shoulder.  His horse screamed and bucked, racing off into the night leaving him on the ground with horses racing towards him from whence he had just come.  He stood quickly, that is as quickly as his pierced shoulder would let him, and raced for the forest that nearly completely surrounded him.  <br>\r\nA barrage of arrows hailed down on him just as he entered the protection of the trees.  A few found their mark.  He shouted in agony as his left calf, thigh, and upper arm were pierced.  He stumbled onward, breaking off the arrow shafts for lack of time to properly remove them.  The horses crashed through the woods behind him.<br>\r\nKyron limped forward as fast as his injured leg would allow.  They were nearly upon him now.  He could see their dark outlines.  He glanced back and then found himself tumbling head over foot down a steep hill, hitting a tree or a log here or there but unable to stop the perpetual fall.  Then he hit a tree against his back, spinning him around and his legs slipped over the side of a cliff.  His hands grasped desperately at the soil, fingers clawing uselessly into the ground.  Finally, just as he was hanging all the way over, his fingers on a ledge, the only thing holding him, his descent stopped.  His feet struggled to find a ledge but nothing would support his weight.<br>\r\nSweat and blood streamed down his face despite the cold air and his breathing came in short bursts.  He looked down but could see nothing in the dark, bottomless gorge.  Kyron tried pulling himself up but his arrow-pierced arm gave way.  He was loosing blood fast and his eyes were beginning to loose focus.<br>\r\nThe clip-clop of hooves of the hard Earth broke the silence of the night.  The horse stopped and its rider dismounted and walked a leisurely pace to the edge.  <br>\r\nKyron looked up into the eyes of the Hound.  “Tisk, tisk, tisk.  Look what you’ve gotten yourself into now, Scar.  You always did seem to be good at getting yourself into trouble.”  He held a dagger in hand.<br>\r\n“Ciaphis! Pull me up!”  Kyron’s voice was weak.  His companions squatted down, fingering the dagger.<br>\r\n“Now you see, Kyron, that would be helping you and I just can’t do that.  I have orders to follow.”  A look of fear crossed Kyron’s face.<br>\r\n“You can’t mean…”<br>\r\n“Oh yes,” Ciaphis said with a twisted grin.  “And that is why I must do this.”  He drove the dagger through Kyron’s hand and into the ground.  Kyron screamed.  “Goodbye…my friend.”  He released the blade and Kyron fell into the darkness.   <br>\r\n <br>\r\n“What happened to him mother?  He looks terrible. Look at all of those scars!”<br>\r\n“Your father found him in the river.”<br>\r\n“Who is he?  Where did he come from?”<br>\r\n“I don’t know darling.”<br>\r\n“Oh, mother!  Look at his hand!  Why he is one of those horrid mercenaries.  Shall I go get father?”<br>\r\n“No.”<br>\r\n“But moth-”<br>\r\n“Your father and I have already discussed this.”<br>\r\n“But mother!  He kills people!  He probably got this while trying to do someone in.”<br>\r\n“Now listen here, young lady.  Don’t you talk like that.  We don’t know him or his circumstances so we haven’t any right to judge him.  And even if he is one anyway, he is injure none the less and I’m not about to let him bleed to death.  Now, did you sterilize the needle like I asked you to?”<br>\r\n“Yes, mother.”<br>\r\n“Bring it here.  Would you also bring me a warm cloth?  Thank you.”<br>\r\nKyron’s eyelids fluttered open.  The room around him was a blur but he could make out the outlines of two people, one sitting beside him and one standing behind the other.  He tilted his head to the side, ever so slightly, to get a better view of his surroundings.<br>\r\n“Oh mother!  I do believe he is awake!  I just saw his head move.”  The girl’s mother leaned toward Kyron.  His eyes moved toward hers as his vision became clearer.<br>\r\n“I do believe you’re right.  Sir, we mean you no harm.  My husband found you in the river.  You’ve got some nasty wounds here that I am going to stitch up for you.  It might sting a bit but just try to hold still.”<br>\r\nKyron closed his eyes waiting for the bite of the needle but then his eyes flew open.  He looked toward his right hand and then back at the woman.  She looked at him seriously.<br>\r\n“I don’t know what business you have with that on you but you have my word that we won’t tell a soul.”<br>\r\nKyron looked at her a moment longer and then relaxed again.  Something about her seemed… different or…familiar.  There was something strange about her.  <br>\r\nHalf an hour later the two left and Kyron was alone in the room.  His bed was the most comfortable he could ever remember sleeping in and the fire was lit on the other side of the room providing a dull glow.  His torn and blood-stained clothes had been taken away to be mended and his sword, which by some miracle he still had, was in the front room for “safe keeping.”  Kyron had been told dinner would be ready in a while and if he wanted any, they would bring it to him.  <br>\r\nAnd yet, despite all of the comfort and hospitality of this family, all he could think of was his betrayal.  Why would the Master do something like that?  Why had he not used the traditional pit?  But what bothered him most was Ciaphis.  He had been so willing to follow the Master’s orders, even joyful, but then as Kyron hung off the cliff and Ciaphis said his goodbyes, his faced changed.  He looked almost pleading as he released Kyron.  Kyron just didn’t know what to think.<br>\r\n <br>\r\nTwo weeks had passed, most of which was spent sleeping, and Kyron was walking around the house and, occasionally, into the yard with the use of a cane.  He had gotten to know the family better now.  He knew that the father’s name was Cyril, the mother’s Shettai, and the fourteen-year-old daughter’s Vaissana.  Every day Cyril would go out to work the land while Shettai and Vaissana would make butter and cheese, to sell at the market once a week, tend to the house, make meals, sew, and wash clothes.<br>\r\nThat evening at the dinner table Kyron made an announcement.  “I would like to thank you, Cyril, Shettai, and Vaissana, for taking me in in my time of need.  I feel that I have burdened you long enough and have decided to take my leave.”<br>\r\nThe table was silent. Finally, Cyril spoke.  “Have you got anywhere to go?”<br>\r\n“Surely you won’t go back to-” Vaissana stopped with a stern look from her father.  All of the time he had been here, save when he’d first woken up, they had all avoided the subject of what Kyron really was: a mercenary.  <br>\r\n“I plan to find work and start fresh.  Probably in somewhere like Eastport.  That way I don’t have to worry about bumping into any old…friends.”  The family glanced at each other nervously.<br>\r\n“Do you have any transportation?”<br>\r\n“I’ll walk.”<br>\r\nAt this point Shettai broke in.  “All the way to Eastport?  That must be 30 leagues at least.”<br>\r\n“I’ve had worse situations.  I’m sure I’ll make it.”<br>\r\n“But winter’s coming and you’re still not completely healed.  You have no food or money for the journey and what if the p-person who did this to you finds you?  What would you do then?”  She looked at him tearfully.  Why was she so upset?  By the way she had been acting around him the past two weeks she had made it quite clear that she was uncomfortable around him and yet here she was, tearful at the mention of his departure.  <br>\r\nKyron looked down at his plate in an awkward silence.  Cyril looked at his wife with worry laden eyes.  When he did not answer, Shettai got up from the table and walked quickly to her bedroom.  Vaissana slipped one quick glance at her father and then ran after her mother.  Cyril looked to Kyron who, in turn, stood up quickly, knocking over his chair in the process.  He picked up the chair and then mumbled his thanks for the dinner and he too headed for his room.<br>\r\nThat night Kyron gathered what little he had together in the room he was staying in and sat down to write a letter explaining his absence they would discover in the morning.  He had just finished when there was a gentle knock at his door.  It creaked open.<br>\r\nVaissana poked her head through the door.  “I heard noises in here…and I couldn’t sleep.  Do you mind if I come in?”<br>\r\n“Uh, no.  Come in.”  He had never dealt with children at the Summit so when he had arrived here things had been quite unusual for him.<br>\r\nShe came in and sat on the bed while Kyron rolled up the scroll on the desk.<br>\r\n“Why are you leaving?  Do you not like it here?”<br>\r\nKyron thought a moment and then answered.  “Its not that I don’t like it here, I just…feel as if I have burdened your family long enough with my stay.”<br>\r\n“I don’t think you’re a burden.  Sometimes you’re actually kind of funny.”<br>\r\n“Funny?”  he said perplexed.  Funny is the last thing he would have described himself as.<br>\r\n“You’re always sitting at the window or locked up in this room silent and frowning.  You remind me of the old hermit past town.  He’s like that too.”<br>\r\nKyron looked at her quizzically.  How was that funny?  Silence followed.<br>\r\n“Mother was very sad tonight.  When I went in with her she was crying.”<br>\r\n“What made her upset?”  He still could not think of what he had said that could have made her react the way she did.<br>\r\n“She said you remind her of her brother.  Having you around makes her sad but if you leave, she won’t have anyone to remind her anymore.”<br>\r\n“May I ask what happened to her brother?”<br>\r\nVaissana looked to the floor and twiddled her thumbs.  “Mother doesn’t like to talk about it but she told me once.  You see, there is another reason she’s uncomfortable around you.  Her brother was killed by a Summit mercenary just like you.”<br>\r\nKyron’s head spun and stomach knotted and he slumped back into the desk chair.<br>\r\n“Are you O.K.?”<br>\r\n“Vaissana?  Do you remember her brother’s name?”<br>\r\n“I don’t know.  She told me a long time ago.”<br>\r\n“Just think.  What did it start with?”<br>\r\n“An “S” I think.  No, a “T,” or maybe an “E?”  Yes.  Something like Ed-, Ez-, El…Eld…?”<br>\r\n“Was it Eldrin?”<br>\r\n“Yes! That was it!  Eldrin.”<br>\r\nKyron turned green.<br>\r\n“Oh my.  Are you O.K.?”<br>\r\n“You’re my…”<br>\r\n“Shall I get help?”<br>\r\n“I’m your…”<br>\r\n“I’ll go get you a bucket.”<br>\r\n“We’re…”<br>\r\nVaissana reached for the door knob.<br>\r\n“No, wait!”  He reached out and grabbed her arm.  “I-I need to speak to your mother.”<br>\r\n“But she’s asleep.”<br>\r\n“Look, this is very important.”<br>\r\n“I’ll get into trouble for waking them.  Besides, she would be indecent for guests at this hour.”<br>\r\n“I’m not a guest- well I was- am- I mean-”<br>\r\n“Can’t it wait until morning?  Mother gets up very early.”  <br>\r\n</span></div></div>",
            "created":1194227460,
            "id":460691,
            "title":"Discovery"
        },
        "11":{
            "author_id":"gigigirl",
            "author_name":"GiGi",
            "choices":[
                "What will Kyron do now that he realizes he still had a family waiting for him?"
            ],
            "content":"<div class=\"\"><div> <span>Eldrin....The very memory caused an ache clear to his bones. Kyron lay in his bed throughout the night, unsure of what he should do or say. Memories of that night never left him; his mind as scarred as his body. He thought all he loved had perished. To learn that they hadn't filled him with a mixture of hope and fear, Kyron never entertained the thought of ever having a family or believing anyone survived. <i>My sister, how I have cried for you</i>, he thought miserably. A long, torturous night gave way to an uncertain morning. Kyron arose, cleansed and dressed himself slowly. Walking out of his bedroom, he was met by an anxious Cyril. <br>\r\n<br>\r\n\"My child came to me in the night and told me of your conversation. Are you Eldrin? Are you he?\"<br>\r\n<br>\r\nKyron nodded slowly.<br>\r\n<br>\r\n\"I never forgot who I was. I believed my family had perished that awful night. Someone, she, lived. I should not tell her. It may not be safe for any of you if the truth be revealed to her.\"<br>\r\n<br>\r\nCyril, a tall, imposing figure with very kind eyes, bristled. \"No one will dare oppose me on my lands! If you are my wife's kin, you will be welcomed as family. If trouble comes to this door, they will be made to regret such a rash decision. Go, she is waiting to speak with you.\"<br>\r\n<br>\r\nKyron walked slowly into the room where Shettai stood preparing the morning meal. She stopped, sensing his presence. He wanted to leave when he saw her shudder. Dropping the knife she held, Shettai turned and threw her arms around him, weeping.<br>\r\n<br>\r\n\"When I saw you, I knew in my heart that my brother lived! May praises be sent into the heavens, my dear Eldrin lives!\"<br>\r\n<br>\r\nSoon, he wept with her. He wasn't alone anymore. Again, he found himself surrounded by a family. Darkness fled his being and was slowly being restored to live and light once more. Feeling Cyril's beefy hand on his shoulder, Kyron felt his fear live him, also. He would live to see--and fight, another day.</span></div></div>",
            "created":1322098140,
            "id":1227902,
            "title":"These really aren't choices, just more guid..."
        }
    },
    "info":{
        "author_id":"shadoe",
        "author_name":"Zelda",
        "brief_description":"Kyron is a mercenary; he is betrayed & found by a middleclass family & learns the truth ",
        "created":1194226080,
        "description":"<td align=\"left\" class=\"norm\">I started this as a school project in 9th grade and never got around to finishing it (no, I did not turn it in unfinished- it was too long so I started over).  The Raven's Summit, taking place somewhere in that time period of castles and nobility, is about a man named Kyron who is part of a mercenary organization.  After a series of events he is betrayed, killed (or so his master thought), and discovered by a medium-class family, at which point he discovers an astonishing reality.  The main Characters are Kyron (Scar or Eldrin), Ciaphis (the Hound), Shettai, Vaissana, Cyril, and other mercenaries at the Summit.  The mercenaries are identified by \"the caricature of a raven pierced by a dagger branded onto their right hand.\"  All input is very much appreciated and encouraged! I hope you like it!</td>",
        "id":1343151,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1322098140,
        "modified":1322098140,
        "pretty_title":"The Raven's Summit"
    }
}