{
    "chapters":{
        "1":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Original Era. (Kid to Teen Goku period)",
                "Z Era (Enter the Sayian, Freeza, Cell, and Buu sagas.)",
                "The Super Era (Let's meet Lord Berrus, God of Destruction)",
                "GT (Enter the Dark Star Dragon Balls and Goku now a kid again.)",
                "Let's try a What if story. We can still choose between the eras."
            ],
            "content":"<div class=\"\"><div> <span>Okay. So were in the Dragon Ball Universe. Now, let's decide. Do we want to start of with the Original era, the Z era, the Super era, or the GT era? Or do we want to go into What if Scenarios? Like What if Gine went with Goku to to Earth, or What if Bardok convinced the Sayians?<br>\r\n<br>\r\nWhat would you like?</span></div></div>",
            "created":1586655060,
            "id":2817381,
            "title":"Someone is getting diapered."
        },
        "12":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Sayian Saga",
                "Freeza Saga",
                "Androids/Cell Saga",
                "Majin Buu Saga."
            ],
            "content":"<div class=\"\"><div> <span>Okay, so we're in the era of Z, where we will meet Gohan, Goten, Trunks, Raddits, Vegeta, Bra, Android 18, etc. (remember, no including Cell or Majin Buu into the interactive story. Only the mention of their saga)<br>\r\n<br>\r\nBut what saga of Z are we wanting to start in? Sayian? Freeza? Android/Cell? Majin Buu saga?</span></div></div>",
            "created":1586655780,
            "id":2817388,
            "title":"Z Era (Sayian, Freeza, Cell, and Buu sagas)"
        },
        "124":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Goku",
                "Goten",
                "Gohan",
                "Present Trunks",
                "Someone else."
            ],
            "content":"<div class=\"\"><div> <span>Okay, so we've got the saga we want. The Sayians have been dealt with, including Vegeta turning sides to good. Freeza was defeated. Cell was finished and Android 17 and 18 turned good. Future Trunks already have been back to the Z fighter's present, and Young Trunks and Goten have already become rambunctious toddlers of 5 and 6. Gohan and Videl have hit it off. Oh, and Goku is alive once more.<br>\r\n<br>\r\nNow we have to decide. Who's getting diapered among the characters? </span></div></div>",
            "created":1586656140,
            "id":2817393,
            "title":"Majin Buu Saga."
        },
        "1242":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "He likes them. And maybe also wants to be babied.",
                "He's getting punished for some reason.",
                "He had an accident while either at home or staying at someone's place.",
                "He's got a weak bladder.",
                "Other reasons."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, so we got Goten getting diapered. Now we need to decide how it happens.</span></div></span></div>",
            "created":1586656500,
            "id":2817399,
            "title":"Goten"
        },
        "12423":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "At his home. Gohan may or may not be around at this point.",
                "At Gohan and Videl's house. He's staying at their place.",
                "At Android 18's place. Krillan and Marron are vacationing for 3 years.",
                "At Bulma's place. Perhaps Trunks joins him in getting diapered.",
                "He's at someone else's house."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, it's long after Buu has been defeated and Uub is now on the way. And Goten had an accident of some sort, but before we get into that detail, where does this take place that he wets himself?</span></div></span></div>",
            "created":1587182400,
            "id":2820351,
            "title":"He had an accident."
        },
        "124233":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "\"Sleep with me if that will help you feel better.\" (She's like his 2nd mother.)",
                "\"Sleep in the living room.\"",
                "\"Sleep in the crib in the nursery.\" (Possible babying happens.)",
                "\"Sleep in my tummy.\" (She knows the practice of unbirth.)",
                "Another option."
            ],
            "content":"<div class=\"\"><div> <span>Okay, so it's been some months since the defeat of Buu. And Uub has not arrived yet.<br>\r\n<br>\r\nAt this time, Chi Chi was taking Goku someplace to get him over his fear of needles, because this frequent avoidance of the doctors was something she would no longer tolerate, but she knew she'd never get him through the door with his fear still ripe. While she would be off helping Goku with his fear, they had required someone to look after Goten. Gohan and Videl were away on their honeymoon, having just gotten married a month ago. Tien was off training students of his own, and admitted that for time being, he'd have no time for child care. Bulma had her hands full with Trunks as it was, with Vegeta off doing some training while Goku got his needle fear dealt with. She wasn't gonna go anywhere near Master Roshi with his perverted mind. And while Krillan was off on a Daddy and Daughter Vacation package from his new police job, to give him a 3 year break from the service, 18 was by herself while her husband and daughter were of on the trip.<br>\r\n<br>\r\nNot admitting she felt lonely to Chi Chi, she offered her babysitting service, and was told it would be some time while Goku was trained to overcome his fear of needles. 18 stated she had no quarrel with the time it would take. The longer it took, the more time she could have to spend with a child to care for. While Goten was at her place. He was amazed at how fun 18 was, and it was like she was being the \"fun\" mother. They'd have sparring matches, get yummy foods to eat, and even watch movies together. the schools in the area were in dire need of repairs, even though summer was coming to it's end, and stated all kids would have a year or so away from school to everything was in working order. Goten didn't openly admit it at this time, but, he kind of wanted to stick around, even if at one point, his real mom and dad would be back to pick him up. For the time being though, he enjoyed his time with 18.<br>\r\n<br>\r\nThen, one night while he was sleeping in the guest room. He woke up to a wet feeling. He removed the covers, to see he had wet the bed. \"Oh no!\" Goten exclaimed, afraid 18 was gonna be mad.<br>\r\n<br>\r\nGoten soon saw lights turn on in the hall, and heard 18's footsteps approaching. He pulled the covers back to hide his accident, and 18 opened the door and turned on the light. \"Goten? Are you okay? I heard you scream. What happened?\" 18 asked.<br>\r\n<br>\r\nGoten was trying to think of something to say. He could have said anything, from, just having a bad dream, to he heard something hit the window, and it surprised him. Anything......... but his mind just seemed to go blank on an excuse and he hung his head low and blushed as he pulled back the covers to reveal the wet spot on his bed, and his wet PJ's. He started to tear up, and was thinking 18 would be mad with him.<br>\r\n<br>\r\nJust then, something unexpected happened. 18 hugged him, \"Shhhh. It's okay Goten. Accidents happen. Don't worry. I'm not mad. Trust me. It takes a lot to get under my skin, and this doesn't even come close to qualifying. Trust me Goten.\"<br>\r\n<br>\r\nGoten was surprised she was so understanding and was glad she knew he didn't mean for this to happen. \"W-What do we do now?\"<br>\r\n<br>\r\n\"Well, for starters these sheets need to get washed, which means the guest room is out of order for ya,\" 18 told him.<br>\r\n<br>\r\n\"Okay, so, where do I sleep?\"<br>\r\n<br>\r\n18 smiled maternally, \"Well, I have a couple options. You can.........\"</span></div></div>",
            "created":1604300100,
            "id":2933026,
            "title":"At Android 18's place. She's alone."
        },
        "1243":{
            "author_id":"elmer7780",
            "author_name":"elmer7780",
            "choices":[
                "Ever since defeating Cell, Gohan became incontinent.",
                "Simply, ChiChi wanted to baby him again.",
                "This all started due to kinkplay with Videl."
            ],
            "content":"<div class=\"\"><div> <span>The half-saiyan lies in his bed, half-naked in his room with just a diaper covering his crotch. You might be wondering why this sixteen year old and soon to be seventeen boy who saved the Earth from Cell and helped stopped Majin Buu is dressed like an overgrown baby.<br>\r\n<br>\r\nWell...it's complicated.<br>\r\n<br>\r\nHow did he end up in this situation?</span></div></div>",
            "created":1604264460,
            "id":2932819,
            "title":"Gohan"
        },
        "1245":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Future Trunks. He's stuck in the past.",
                "Bulma",
                "Chi Chi",
                "Videl",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, so it wasn't Goku, Gohan, Goten, or Trunks getting diapered. If not them, then who?</span></div></span></div>",
            "created":1586656200,
            "id":2817395,
            "title":"Someone else."
        },
        "12455":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "Krillen",
                "Android 18",
                "Android 17",
                "Bra. Trunks' little sister.",
                "Someone else."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Okay, so not Future Trunks stuck in the past. Not Bulma, Not Chi Chi, and Not Videl. Who then?</span></div></span></div>",
            "created":1586656320,
            "id":2817397,
            "title":"Someone else."
        },
        "13":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "Just before the events of the first arc",
                "The super saiyan god arc",
                "The resurrection F arc or the Goku black arc",
                "The tournament of power",
                "After the events of Super"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The era of Super, the time of Beerus, the return of Freeza, Zamasus attempted take over, the tournament of power and the Broly movie. Now, where does this tale of fighters and diapers take place in the timeline of super?</span></div></span></div>",
            "created":1586744820,
            "id":2817910,
            "title":"The Super Era (Let's meet Lord Berrus, God ..."
        },
        "135":{
            "author_id":"dolleo",
            "author_name":"Dolleo",
            "choices":[
                "A mysterious alien comes to the planet earth",
                "An experiment at capsule Corp goes wrong",
                "A poorly worded wish or something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>With the tournament of power (and the events of the Broly movie depending on your view on canon) behind our heroes how does one or many of them find themselves back in diapers</span></div></span></div>",
            "created":1586745360,
            "id":2817913,
            "title":"After the events of Super"
        },
        "15":{
            "author_id":"weatherwatcher",
            "author_name":"Talcane",
            "choices":[
                "What if Gine went with Goku to Earth?",
                "What if Bardok Convinced the Sayians of Freeza?",
                "What if Raddits turned good?",
                "What if Goku landed at Capsule Corp.?",
                "Lets try some other what ifs."
            ],
            "content":"<div class=\"\"><div> <span>So, we're entering what if territory. Which \"What if\" scenario would you like?<br>\r\n<br>\r\n1. What if Gine went with Goku to Earth?<br>\r\n<br>\r\n2. What if Bardok Convinced the Sayians of Freeza?<br>\r\n<br>\r\n3. What if Raddits turned good?<br>\r\n<br>\r\n4. What if Goku had landed at Capsule Corp.?<br>\r\n<br>\r\nOr do we try some other what if?</span></div></div>",
            "created":1586655480,
            "id":2817384,
            "title":"The What Ifs."
        }
    },
    "info":{
        "author_id":"weatherwatcher",
        "author_name":"Talcane",
        "brief_description":"Characters from the Dragon Ball franchise get diapered for various reasons. Have fun.",
        "created":1586654760,
        "description":"<td align=\"left\" class=\"norm\">So, the characters of the Dragon Ball universe are getting diapered for reasons you get to decide. Be it age regression, experiments gone wrong, never potty trained, etc. And I will allow any era of the Dragon Ball universe to be used. Original, Z, Super, GT. <br>\r\n<br>\r\nThings that are allowed:<br>\r\n1. Diapering.<br>\r\n2. Breastfeeding.<br>\r\n3. Age Regression<br>\r\n4. Unbirth<br>\r\n5. Lesbian couples<br>\r\n6. Babying<br>\r\n7. Using the Dragon Balls for Gender Swap.<br>\r\n8. Bad Guys turning good.<br>\r\n9. Future Trunks stuck in the Z era's or Super era's present. (His past.)<br>\r\n10. pregnancy<br>\r\n<br>\r\nThings Not allowed:<br>\r\n1. Gender Swap without the use of unbirth or Dragon Balls.<br>\r\n2. Gay male Couples. (This includes using Gender Swap to make Gay male couples.)<br>\r\n3. Age regression to the point that the character is not conceived. (Sperm and Egg Are Separate.)<br>\r\n4. Using the Dragon Balls to kill of characters.<br>\r\n5. Killing off the characters.<br>\r\n6. Destruction of the world of universe to end the story.<br>\r\n7. Heavy description of usage of diapers.<br>\r\n8. Cock vore<br>\r\n9. Oral vore<br>\r\n10. Breast vore<br>\r\n11. trying to use loopholes to get around things listed that are not allowed.<br>\r\n12. Cell's character<br>\r\n13. Majin Buu's character.<br>\r\n14. No Time travel. (This excludes having future Trunks stuck in the Z or Super present.)<br>\r\n15. Age Progression to elderly age. (I know Roshi's already like 900 years old, but no progressing him or others further.)<br>\r\n16. No absorption.  (One reason I said Majin Buu and Cell are not allowed as characters interacting with the others in the story.)<br>\r\n17. No Miscarriages if someone's regressed to the time a woman is pregnant with the character.<br>\r\n18. No Abortions. (This is considered killing a character.)</td>",
        "id":2218792,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604300100,
        "modified":1604300100,
        "pretty_title":"Dragon Ball D (Diapers)"
    }
}