{
    "chapters":{
        "1":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Kindergarten",
                "Grade school  1-4",
                "Grade school 5-8",
                "High school",
                "College/University"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which school do you want to focus on?</span></div></span></div>",
            "created":1523077200,
            "id":2476202,
            "title":"Start of the school day."
        },
        "12":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Gwendolyn Hamilton.",
                "Emily Tanner.",
                "Ken Misasagi.",
                "Billy Williams.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Which character do you want to follow?<br>\r\n<br>\r\nGwendolyn Hamilton: A third grade girl who in spite of her youth has no problem hauling around her beach ball sized breasts in fact she's a great deal stronger than she looks.<br>\r\n<br>\r\nEmily Tanner: an energetic second-grader still getting used to her hourglass figure particularly how the people around her react to it.<br>\r\n<br>\r\nKen Misasagi: the first grade the younger brother of Tim Misasagi who enjoys being naked even more than him stripping off his clothes at every opportunity in letting his nearly floor length member swing in the breeze.<br>\r\n<br>\r\nBilly Williams: A shy fourth-grader who still getting used to a growth spurt that affected him beneath the belt, especially how his new equipment react whenever he sees a cute girl.</span></div></div>",
            "created":1523941200,
            "id":2481016,
            "title":"Grade school  1-4"
        },
        "121":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "She makes it to class.",
                "On her way to class she runs into one or more of her friends.",
                "On her way to class she runs into a bully."
            ],
            "content":"<div class=\"\"><div> <span>Gwendolyn Hamilton walked down the hall on her way to class massive beach ball sized breasts bobbing up and down unrestrained by a bra of any sort. Gwendolyn was for the most part a very cute young girl with blonde hair done up in pigtails, big green eyes, a freckled face, cute button nose and lightly tanned skin from all her outdoor activities. The parts of her that he would however were downright sexy with massive wobbling breasts and a round heart-shaped ass.<br>\r\n<br>\r\nSome people wondered how such a little girl  to be around such immense curves but Gwendolyn had never had any problems with that. She was a stronger than she looked down a lot stronger than any third-grader had any right to be. She had once caused quite a shock at a local gym when she in complete seriousness complained to an employee that there was something wrong with the dumbbells because the 50 pound weights she had seen other patrons grunting and straining as they pumped weren't heavy when she picked them up. </span></div></div>",
            "created":1524373200,
            "id":2482986,
            "title":"Gwendolyn Hamilton."
        },
        "1211":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "A female classmate",
                "A male classmate",
                "The teacher"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Gwendolyn walked into class not expecting her day to be any different than a normal school day not knowing things to were going to be very different when she caught the attention of...</span></div></span></div>",
            "created":1542258000,
            "id":2578441,
            "title":"She makes it to class."
        },
        "125":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "Cathy Wild",
                "Ryan Kiba",
                "more choices"
            ],
            "content":"<div class=\"\"><div> <span>Cathy Wild: a fourth grader who loves all things cat, usually wearing a cat collar, cat hairband and a cat anal plut. her boobs are big yet petite with a big ass. she loves pet play, especially with her childhood friend, Ryan Kiba<br>\r\n<br>\r\nRyan Kiba: fourth grader with a massive cock. let his hair grow like a lion's mane. likes to say his name with a Japanese inflection as \"Raion/Lion\". loves walking Cathy like his pet</span></div></div>",
            "created":1524200400,
            "id":2482282,
            "title":"More choices."
        },
        "1251":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Before class she runs into her best friend Ryan Kiba.",
                "She was running a little late so she had to go straight to class.",
                "She went into a bully who makes fun of her love of cats."
            ],
            "content":"<div class=\"\"><div> <span>Cathy Wild walked down the hallway hips swaying wide to make sure the cat tailed anal plug she had was swinging back and forth. Her bouncing breasts and jiggling ass were on full display as a side from her collar, headband, and backpack she was naked something allowed by the schools extremely lax dress code.</span></div></div>",
            "created":1524286800,
            "id":2482582,
            "title":"Cathy Wild"
        },
        "1252":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "the lion hunts as it goes to school",
                "the lion walking the kitten",
                "mama lion with baby lion"
            ],
            "content":"<div class=\"\"><div> <span>Ryan Kiba was smiling as he walked to school completely naked, letting his beastly cock out for all to see. His lion-like hair made others see him as a beast in bed if his already established reputation didn't. Was he walking alone?<br>\r\n<br>\r\n<br>\r\noption 1: yes he was, but he doesn't mind<br>\r\noption 2: no he wasn't. he had his childhood friend, Cathy, holding her leash as she walked like a cat<br>\r\noption 3: no he wasn't. he had his well-built mama with him, with a serious case of bedhead(describe her appearance, and RC on the name)</span></div></div>",
            "created":1524286800,
            "id":2482612,
            "title":"Ryan Kiba"
        },
        "12523":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Ryan heads into class.",
                "Abeba gives her son a tit fuck.",
                "Some bullies make fun of Ryan for being a mama's boy and he tells them off.",
                "Some bullies make fun of Ryan for being a mama's boy and Abeba handles it."
            ],
            "content":"<div class=\"\"><div> <span>Ryan wasn't alone as he walked down the halls however alongside him was his mother Abeba. Abeba was tall and beautiful beautiful even though she also looked like she had just gotten out of bed with her messy hair sticking out at odd angles and the only stitch of fabric on her body being a backpack slung over one shoulder. Her breasts were enormous each chocolate brown sphere being large enough to cover her entire torso by itself. <br>\r\nAbeba was actually a college student is attending the same elevator school as her son who was the result of a teenage pregnancy. Her classes and begin in till later in the day so she sometimes walked her son to class.<br>\r\nThe two of them arrived outside the door for Ryan's homeroom. Abeba knelt down hugging her son pulling him into her cavernous cleavage and giving him a kiss, not a maternal kiss on the forehead or cheek but a full on the searing kiss on the lips which got his loins stir in causing his member to stand up and have been to the underside of his mother's breast. </span></div></div>",
            "created":1524286800,
            "id":2482744,
            "title":"mama lion with baby lion"
        },
        "125234":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "show how tough baby lion is in the bed",
                "what happens when you hurt a mama lion's cub?"
            ],
            "content":"<div class=\"\"><div> <span>\"Hahaha, look at the mama's boy over there getting a French Kiss by his mama!\" a snarky voice said. They looked to see a bunch of boys but their dicks were smaller than Ryan's.<br>\r\n<br>\r\n\"Let mama handle this, sweetie,\" Abeba said as she walked over to the boys.<br>\r\n<br>\r\n<br>\r\noption 1: she jerks them off, hard, saying Ryan can handle her plus three more moms easy<br>\r\noption 2: she asks them if they know what a mama lion does if someone hurts her young</span></div></div>",
            "created":1524373200,
            "id":2482751,
            "title":"Some bullies make fun of Ryan for being a mama&..."
        },
        "1252341":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Ryan asks for a hand job.",
                "Abeba gives her son a goodbye and they go about their day's.",
                "There interrupted by the arrival of Cathy Wild.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Abeba walked over to the boy's her hips and breasts swaying in a mesmerizing manner she'd gone perfected. When she got close enough she knelt down and grabbing two of them by their dicks and moving her elbows to capture a third member in her cleavage. She started jerking them off and hard normally she'd be more delicate with people she was pleasuring for the first time but if these weird little boys are going to act without any manners they were going to receive any either.<br>\r\n<br>\r\nIt didn't take long for the boys to cum and cum again splattering both Abeba and the floor around her with jizz. She kept it up into the boys moans turned from pleasurable to pained and they fell to the floor cocks limp and aching.<br>\r\n<br>\r\n\"Pathetic.\" Abeba said as she stood up licking some of the cum off her arm. \"My little boy can sleep with me and three of my MILF friends and not tire out as easily as you lot did.\"<br>\r\n<br>\r\nRyan smiled his dick rock hard at the site of his mother putting those bullies in their place.</span></div></div>",
            "created":1524373200,
            "id":2482782,
            "title":"show how tough baby lion is in the bed"
        },
        "1253":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Katarin Roman.",
                "Romeo Manson.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Katarin Roman: A busty third-grader who loves to bake.<br>\r\n<br>\r\nRomeo Manson: A second grader was a big crush on an upperclasswoman.</span></div></span></div>",
            "created":1524459600,
            "id":2483525,
            "title":"more choices"
        },
        "12532":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Humongous breasts.",
                "Colossal ass.",
                "Stunning hourglass curves."
            ],
            "content":"<div class=\"\"><div> <span>Romeo walked down the hallway daydream about his crash. He had it bad for an upper-class woman named Alice. She was absolutely gorgeous and it was all Romeo could do to avoid popping a boner big enough to make it hard for him to walk when he thought of her. She was beautiful and sexual to the extreme especially her...</span></div></div>",
            "created":1542603600,
            "id":2579472,
            "title":"Romeo Manson."
        },
        "12533":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Gwen Brown",
                "Alice Williams",
                "Aamir Azoulay",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Gwen Brown: A bottom heavy rich girl who addicted to social media<br>\r\n<br>\r\nAlice Williams: an excitable young girl who loves magical girl anime and frequently cosplays. A hobby that would be easier if her breast didn't make up a sizable portion of her body mass.<br>\r\n<br>\r\nAamir Azoulay: A young Moroccan boy and major book one who loves heroic fantasy.</span></div></div>",
            "created":1526274000,
            "id":2493154,
            "title":"More choices."
        },
        "125331":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Realized she was in the wrong part of the school.",
                "Walked into someone.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Gwen Brown walked down the school hallway her blond hips and a massive ass, and in only in a tight pair of red spandex shorts, swung from side to side as she moved. Her Breasts sizable for her age although not nearly as oppressive as her backside were covered by a plain white T-shirt with plane with no bra to obscure her nipples or restrain her bounce.<br>\r\nAs always her eyes were glued to her top of the line iPhone as she browsed various social media sites. Her attention was finally pulled away from her phone when she...</span></div></div>",
            "created":1599791580,
            "id":2900824,
            "title":"Gwen Brown"
        },
        "125333":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "He realized he had wandered into the wrong part of the school",
                "Bumped into someone."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Aamir walked to class his head buried in a book. The his boy was dressed in a simple green T-shirt and blue shorts with his backpack over his shoulders. He continued on like this not really paying attention to where he was going to entail...</span></div></span></div>",
            "created":1529557200,
            "id":2510540,
            "title":"Aamir Azoulay"
        },
        "1253332":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "An older girls tits.",
                "The fat ass of a girl bending over to look through her locker.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Aamir stepped back and nearly stumbled when bumped into...</span></div></span></div>",
            "created":1600450080,
            "id":2905451,
            "title":"Bumped into someone."
        },
        "125334":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Isabella Rodrìguez.",
                "Sarah Wells.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Isabella Rodrìguez: A sporty, top heavy Hispanic girl who belongs to a trio of girls known as the \"Piranhas\" for their insatiable appetite for both food and sex that is at odds with their small size.<br>\r\n<br>\r\nSarah Wells: A blonde girly girl whose cutesy and fun loving personality can turn a sultry in a moment. The second member of the Piranhas.</span></div></div>",
            "created":1558414800,
            "id":2662263,
            "title":"More choices"
        },
        "13":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Alexandria Williams",
                "Riya Bhola",
                "Oscar Nill",
                "Tim Misasagi",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Which character do you want to follow?<br>\r\n<br>\r\nAlexandria Williams: A seventh-grade African-American student with the bottom heavy frame who knows exactly what her big butt does to people and revels in it.<br>\r\n<br>\r\nRiya Bhola: a sixth grade Indian girl whose breasts came in only recently and is almost constantly snacking to feed her growing curves.<br>\r\n<br>\r\nOscar Nill: an eighth grader who in spite of his quiet personality has plenty of sexual experience as the only male in his household using his massive cock to satisfy his sisters and mothers.<br>\r\n<br>\r\nTim Misasagi: a mixed race boy who grew up in a nudist household and has no problem showing off what he has packing downstairs.</span></div></div>",
            "created":1523941200,
            "id":2481013,
            "title":"Grade school 5-8"
        },
        "131":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "One of her friends.",
                "An upperclassman who was seriously eyeing her butt.",
                "A top-heavy bimbo who like to make fun of fat bottomed girls."
            ],
            "content":"<div class=\"\"><div> <span>Alexandria Williams walked down the hallway with a hip shaking strut that most people would consider it inappropriate for seventh grader and then again must seventh graders didn't have ass cheeks the size of beach balls and the hips and thighs to complement them. She had long ago decided that she was going to embrace physical gifts the best she could and with well on her way to developing into a grade A tease loving how a little shake of her backside made boys hard and girls wet.<br>\r\n<br>\r\nAsides from her overdeveloped downstairs Alexandria had triple D breasts black hair done up in braids and rich brown eyes. Brown eyes that as she walked down the hall settled on...</span></div></div>",
            "created":1524373200,
            "id":2482997,
            "title":"Alexandria Williams"
        },
        "1311":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "The two girls groped each other in greeting.",
                "The two girls playfully tease each other about their smaller parts.",
                "They're joined by a third person a boy."
            ],
            "content":"<div class=\"\"><div> <span>Alexandria smiled when she saw her friend Hillary Robin, Hillary was an Irish woman with short or messy red hair a top-heavy figure and large brown eyes. She was currently dressed in a white T-shirt and a pair of jeans shorts.<br>\r\nHillary returned Alexandria smiled when she noticed her friend and...</span></div></div>",
            "created":1524718800,
            "id":2484518,
            "title":"One of her friends."
        },
        "13112":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "The girls head to class.",
                "The girls start making out."
            ],
            "content":"<div class=\"\"><div> <span>\"Good morning fatass.\" Hillary said although there was no malice in the remark.<br>\r\n“Better fat than flat” Alexandria replied giving a shake of her hips. “Don’t you get carrying those Bimbo tits around?”<br>\r\nWith that: Alexandria reached out and groped Hillary’s Boobs.<br>\r\n“Not anymore than you do hauling oversized caboose everywhere.” As she said that Hillary reached around and slapped Alexandria’s ass.<br>\r\nThe two girls smiled at each other a seemingly volatile words the exchange merely being some friendly teasing and if the day went well perhaps some friendly foreplay.<br>\r\n</span></div></div>",
            "created":1573574340,
            "id":2745730,
            "title":"The two girls playfully tease each other about ..."
        },
        "1312":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "She decide to walk over to the upperclassman and start flirting.",
                "The upperclassman walked over to her and brazenly felt up her butt.",
                "She pretended to trip sticking her ass in the air and right at him."
            ],
            "content":"<div class=\"\"><div> <span>Alexandria's bouncing back side was attracting stairs as it always did and the younger woman noticed someone in particular who was very appreciative of the show she was giving out. It was an upperclassman at least a year older than her who looked at her as she passed and was licking their lips at the sight of her jeans clad ass.. For a moment Alexandria thought about how to respond before...</span></div></div>",
            "created":1542603600,
            "id":2579464,
            "title":"An upperclassman who was seriously eyeing her b..."
        },
        "132":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Riya's heads to the cafeteria for a second breakfast.",
                "Riya asks a male student if she could suck them off.",
                "Goes to class anyway but her hunger soon becomes distracting."
            ],
            "content":"<div class=\"\"><div> <span>Riya Bhola walked down the hallway breasts and butt bouncing unconstrained by underwear.She wore a red dress and had her hair tied back in a ponytail As she walked she munched on a granola bar crumbs sometimes falling onto the shelf of her cleavage. As she walked however her stomach growled her morning snack not cutting it in spite of the large breakfast she had eaten before leaving for school.</span></div></div>",
            "created":1524459600,
            "id":2483566,
            "title":"Riya Bhola"
        },
        "1323":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Her stomach growled loud enough to interrupt class.",
                "Riya fell asleep and started dreaming about food.",
                "Her friend noticed her state and tried to slip her a snack."
            ],
            "content":"<div class=\"\"><div> <span>Riya ignored her grumbling stomach and headed to class but it wasn't long into first period before her hunger became distracted. The teacher's social study lesson was a distant indistinct buzz as Riya could only focus on the pit in her stomach even as she tried to ignore it. It wouldn't be ignored for long however as eventually...</span></div></div>",
            "created":1558328400,
            "id":2662046,
            "title":"Goes to class anyway but her hunger soon become..."
        },
        "133":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "His mothers",
                "One (or more) of his sisters",
                "Everyone his family slept communally/"
            ],
            "content":"<div class=\"\"><div> <span>Oscar Nill stirred awake on a Monday morning. Oscar was a young 13-year-old boy with short black hair and tanned skin with bright green eyes. He lived a rather enviable existence being the only boy in a household otherwise comprised of exceptionally endowed and exceptionally horny women. With two mothers and six sisters all with massive libidos it was rare that Oscar got through the day without plenty of mind blowing bed shaking sex. Not to say he wasn't as well endowed and horny as his family however, possessing massive heavy balls and a long thick cock.<br>\r\n<br>\r\nHis family with an interesting collection of characters themselves.<br>\r\n<br>\r\nThere was his mothers, Jane Neil was an infamous playgirl in her youth who had surprised many of her friends when she decided to settle down although she and her wife maintained an open relationship. She was a tall Indian woman with short black hair and red eyes her figure was very top-heavy with breasts large enough to smother Oscar's entire body.<br>\r\nAimi Yamamoto was her wife and Oscar's other mother while Jane was tall and top-heavy Amy was short and bottom heavy just the right height to cuddle into her wife's breasts. She had long dark hair and soft features. Though her breasts were sizable being comparable to beach balls in their volume it was her ass having hips that reached out well beyond her shoulders and massive squishy cheeks that made for wonderful pillows.<br>\r\n<br>\r\nThen there were Oscar sisters, six women in total.<br>\r\nThe oldest was Pamela A 21-year-old engineering student with short brown hair and a top-heavy figure. She was blunt, forceful and went for what she wanted without hesitation or shame.<br>\r\nThe next oldest was Kaede 20-year-old photography student. She had a figure much like her mother Aimi but where her mother was soft and squishy Kaede was firm and bouncy. She's in many ways the opposite of her older sister in personality being polite cheerful and submissive. That may be why they get along so well while incest was not uncommon amongst the family Pamela and Kaede considered themselves girlfriends and were as deeply romantically involved as they were sexually though like their mothers it was an open relationship.<br>\r\nThe third oldest was Bonnie a top-heavy 18-year-old blond with long wavy hair and tanned skin. A proud and opened slut who loved fucking as many people as possible.<br>\r\nNext was Robin 17-years-old but even taller than Bonnie with a balanced hourglass figure and athletic frame with long straight red hair. She was a natural caregiver who loved doting on her lovers and the being submissive in bed.<br>\r\nMonica was 16 years old, short with long curly black hair and a massive beach ball ass she loved getting fucked in he had a rather amazing knack for carrying out other activities like eating or reading while getting screwed.<br>\r\nFinally there was Carman 14 years old and the youngest aside from Oscar himself. She was short with short kept brown hair and an  hourglass figure. She was incredibly energetic and even for her family have a incredible libido and probably spent more of her waking hours having sex than anything else.<br>\r\n<br>\r\nAs Oscar fully woke up he cuddled in closer to the warm body he was sharing bed space with rubbing his morning went against them.<br>\r\n---<br>\r\nWho was he sleeping with?</span></div></div>",
            "created":1525064400,
            "id":2486475,
            "title":"Oscar Nill"
        },
        "1331":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Jane gives him a boob job.",
                "Aimi gives him up butt job.",
                "Both of them stroked him off."
            ],
            "content":"<div class=\"\"><div> <span>Oscar was sleeping with his mother's, his sisters slept in separate bedrooms two girls to a room but the house was only so big so Oscar bunked with his parents not that any of them minded.<br>\r\nSpecifically Oscar and his mothers were in a three-person pile as Oscar lay on his Aimi's back and the broad hipped woman herself with a face down against her wife's breasts.<br>\r\nAs hummed happily to himself as he felt his cock slipped between his mother's wonderfully soft cheeks and began to harden more and more at the sensation before he felt the two women beneath him begin stirring awake themselves. The three of them gently untangle themselves from each other thing Oscar found himself sandwiched between his two mothers before...</span></div></div>",
            "created":1525410000,
            "id":2488214,
            "title":"His mothers"
        },
        "1332":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Pamela and Kaede",
                "Bonnie and Robin",
                "Monica and Carman"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which sisters were he sleeping with?</span></div></span></div>",
            "created":1525237200,
            "id":2487428,
            "title":"One (or more) of his sisters"
        },
        "13321":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Forceful sucking of Pamela.",
                "Kaede's gentle warm blow job.",
                "Someone else who snuck into the room that morning",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Oscar didn't have his own room but was welcomed to sleep in the room's of any of his sister's or his mothers' and that night he had chosen to spend the night with his older sisters. As he slowly stirred to wakefulness he felt a pair of lips wrapped around and swallow his dick and he knew immediately that it was the...</span></div></div>",
            "created":1525410000,
            "id":2488310,
            "title":"Pamela and Kaede"
        },
        "13322":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Started the morning with a three-way.",
                "Were all hungry and went to get breakfast.",
                "Heard someone knocking on the bedroom door."
            ],
            "content":"<div class=\"\"><div> <span>Oscar cuddled deeper into the loving embrace of his big sister Robin the Amazonian teenager practically wrapped around his body holding him close with his head buried in her ample chest. This pleasurable simplicity was interrupted when Oscar was elbowed in the back of his head. That would be Bonnie the buxom blond did everything big and loud even sleep. She laid splayed out on the bed snoring and occasionally fidgeting in her sleep.<br>\r\n<br>\r\nEventually the two women began to wake up in the three children...</span></div></div>",
            "created":1525496400,
            "id":2488989,
            "title":"Bonnie and Robin"
        },
        "133222":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "They finished breakfast and head off to school.",
                "Two of the girls get into an eating contest.",
                "One of the girls want to wash down her breakfast with Oscar's cum.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>The noise of yarns and groaned as they see kids got out of bed and was soon replaced by the sound of growling stomach's. The members of the Nill household were all pretty gluttonous due to their exceptional bodies and active lifestyles. The three children left the bedroom and headed to the kitchen not bothering to get dressed as the inside of the house was a clothing optional zone. The sleepy expressions on their faces disappeared as soon as they entered the kitchen and the smell of virtual mountains of breakfast food laid out on the kitchen's massive dining table it their noses.<br>\r\n<br>\r\nThey sat down to eat and the rest of the family was either already present or came in soon after them and joining their siblings for breakfast.</span></div></div>",
            "created":1526274000,
            "id":2493293,
            "title":"Were all hungry and went to get breakfast."
        },
        "134":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Ran into a friend of his.",
                "Ran into a girl he had a crush on.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Fifth-grader Tim Misasagi walked down the hallways of the school naked except for his backpack. The most this would've been the subject of a nightmare but for Tim was a completely normal and enjoyable experience. The Misasagi were a family of Nudists and Tim had no shame when it came to showing off his body. Not that he had anything to be ashamed of with a cock that hung past his knees.<br>\r\n<br>\r\nAs Tim walked down the hallway he...</span></div></div>",
            "created":1552626000,
            "id":2630611,
            "title":"Tim Misasagi"
        },
        "135":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Valerie Sher",
                "Thomas Root",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Valerie Sher: a seventh grade girl with wavy red hair and a curvaceous hourglass figure. Her energetic personality and growing curves mean she has a massive appetite and in something of a reputation as a walking garbage disposal.<br>\r\n<br>\r\nThomas Root: a sixth-grader whose oversized and overprotective balls means he needs to get off a lot more than most people.</span></div></div>",
            "created":1524200400,
            "id":2482279,
            "title":"More choices"
        },
        "1351":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "A big breakfast before school.",
                "Lunch in the school cafeteria.",
                "A fast food dinner out with her friends."
            ],
            "content":"<div class=\"\"><div> <span>Valerie licked her lips as she sat down at the table ready to pack into a meal. Like always it took her a few moments to adjust the position of her state so that her breasts didn't bump into anything she was ready to enjoy her meal specifically...</span></div></div>",
            "created":1532149200,
            "id":2523163,
            "title":"Valerie Sher"
        },
        "1353":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Cindy West.",
                "Grant Miller.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Cindy West: a fifth grade Puerto Rican girl who is cute as a button and buxom as all get out with beanbag sized tits. She's very fun loving and playful and loves to play with her friends whether that play is innocent or not.<br>\r\n<br>\r\nGrant Miller: A short statured sixth-grader whose huge cock and submissive personality makes him a favourite casual lover for his upper class women.</span></div></div>",
            "created":1525150800,
            "id":2486788,
            "title":"More choices"
        },
        "13531":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Class.",
                "One of her friends.",
                "The school doors, it was the end of the day."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cindy West walked down the hallway massive breasts bouncing and wobbling as she moved. She was smiling brightly in a cheerful mood as she normally was as she headed down the halls towards...</span></div></span></div>",
            "created":1558328400,
            "id":2662040,
            "title":"Cindy West."
        },
        "13533":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Ahna Idlout.",
                "Next choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ahna Idlout: A cute, cheerful and chubby seventh grader with a love for animals. Despite her thick figure she has a weakness for being groped.</span></div></span></div>",
            "created":1531717200,
            "id":2520608,
            "title":"More choices."
        },
        "135332":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Max Hawkins-Mittelman-White.",
                "Next choice."
            ],
            "content":"<div class=\"\"><div> <span>Max Hawkins-Mittelman-White: Child of a three-person polyamorous marriage (hence the last name.) Max is a shy young man who has trouble talking to women outside his family and normally has his large libido taken care of by his mothers or older sister. However more often than not when he sees a pretty girl his massive cock makes his feelings known for him.</span></div></div>",
            "created":1573515120,
            "id":2745409,
            "title":"Next choice."
        },
        "1353322":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Nicolas Hawkins-Mittelman-White.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Nicolas Hawkins-Mittelman-White: Child of a three-person polyamorous marriage (hence the last name.) Nicolas is a lot more bold and outgoing than his half brother Max, especially when it comes to women, there is little he likes better than pumping a load of cum into the holes of some a eager girl.</span></div></div>",
            "created":1573516080,
            "id":2745413,
            "title":"Next choice."
        },
        "14":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Megan King",
                "Jennifer Mason",
                "Mark López",
                "Nick Taylor",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Which character do you want to follow:<br>\r\n<br>\r\nMegan King: a busty tomboy who manages to maintain a active athletic lifestyle in spite of her bigger than beach ball breasts.<br>\r\n<br>\r\nJennifer Mason: shy bookworm with a full hourglass figure that she usually tries to unsuccessfully hide with baggy clothing.<br>\r\n<br>\r\nMark López: friendly and energetic young man with a deep love for big bootyed babies though he hasn't found anyone with a ass so big that his monster cock couldn't fill it.<br>\r\n<br>\r\nNick Taylor: a shorter student with a fondness for older women particularly those who are lactating.</span></div></div>",
            "created":1523941200,
            "id":2481010,
            "title":"High school"
        },
        "141":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "The morning she was heading into class.",
                "After noon, she was part of a sports club.",
                "After noon, she was meeting up with a lover for a date."
            ],
            "content":"<div class=\"\"><div> <span>Megan walked towards the front door of the school a broad smile on her face massive breasts bouncing and wobbling within the confines of her tight white T-shirt. An equally tight red hair of shorts encased her bubble butt. Her brown hair was tied up in two short pigtails and her green eyes sparkled in the sunlight.<br>\r\n<br>\r\n---<br>\r\nWhat time of day was it and why was she heading into the school?</span></div></div>",
            "created":1524373200,
            "id":2483217,
            "title":"Megan King"
        },
        "1412":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "One of her fellow players.",
                "Her boyfriend there to wish her luck.",
                "The site of two people having sex."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Megan was part of the girls soccer team and was heading in for afternoon practice. She walked into the locker room and was immediately greeted by...</span></div></span></div>",
            "created":1524718800,
            "id":2484756,
            "title":"After noon, she was part of a sports club."
        },
        "14121":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Maxie turned back around and decides to have some fun with Megan first.",
                "Megan gets changed and headed out onto the beginning practice.",
                "Megan gets change and heads out into the field gawking at the cheerleaders.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>As she walked into the locker room Megan saw a fellow player presumably there for practice. Her name was Maxie a tomboy with a voluptuous hourglass figure and short red hair.<br>\r\n\"Hey Megan nice to see you.\" Maxie said as she reached out and groped Megan's breasts.<br>\r\nShe also had something of a wandering hand but that many of her teammates minded.<br>\r\n\"Where's your girlfriend? Megan asked referring to Maxie's cheerleader girlfriend. \"Don't you and her have a good luck make out session before practice?\"<br>\r\n\"She's got practice on the other side of the field so I guess I'm going to have to do was just my awesome skill for today\"Maxie said smugly before turning towards the door out of the locker room jumping a little when Megan's slapped her on the ass.</span></div></div>",
            "created":1525237200,
            "id":2487483,
            "title":"One of her fellow players."
        },
        "14122":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "A muscular Adonis.",
                "Skinny boy with a thick cock.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>MeganSmiled when she saw her boyfriend waiting in the locker room to greet her. She licked her lips looking over her lover a...</span></div></span></div>",
            "created":1603317180,
            "id":2926440,
            "title":"Her boyfriend there to wish her luck."
        },
        "1413":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Male schoolmate",
                "Female schoolmate",
                "A \"normal\" teenager she had met online."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Megan was heading out of the school building smiling as she thought about her upcoming date. They have planned to meet up near the school before heading out and it didn't take long before Megan found her date a...</span></div></span></div>",
            "created":1524891600,
            "id":2485354,
            "title":"After noon, she was meeting up with a lover for..."
        },
        "14132":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "A short buxom burnet named Ellie.",
                "A pear-shaped upper-class woman named Julie.",
                "An hourglass figured cutie in baggy clothing named Jennifer.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Megan smiled as she saw her date...</span></div></span></div>",
            "created":1525237200,
            "id":2487481,
            "title":"Female schoolmate"
        },
        "141324":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "A chubby hourglass figured cutie named Christine",
                "More choices"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Who else could she be dating?</span></div></span></div>",
            "created":1567740060,
            "id":2714002,
            "title":"More choices."
        },
        "143":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "On his way to class he runs wants into one of his regular lovers.",
                "On his way to class he runs into a girl he didn't recognize.",
                "He makes it to class and takes in the sight of his fatassed homeroom teacher."
            ],
            "content":"<div class=\"\"><div> <span>Mark López walked down the hallway on his way to his home room. He was wearing a red T-shirt and had his backpack and slung over one shoulder but was completely naked from the waist down letting his sizable member flop around for all to see. Mark was always up for a quickie with a bootyful babe liked being able to get to the action as quickly as possible.<br>\r\n<br>\r\nMark had quite an handsome figure with short brown hair arbour and skin a slim but athletic figure which attract plenty of love is to his bed.</span></div></div>",
            "created":1524373200,
            "id":2483005,
            "title":"Mark López"
        },
        "1431":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "The two had to class.",
                "Mary asks for some anal sex.",
                "The two love birds are interrupted."
            ],
            "content":"<div class=\"\"><div> <span>Mark smiled when he laid eyes on his girlfriend Mary specifically her pronounced posterior. Mary was a young woman of average height with tanned skin and short blonde hair. Like her boyfriend she was only half dressed with a white T-shirt but naked below the belt. Mary had round firm breasts the size of her head and a pair of beach ball sized ass cheeks.<br>\r\n\"Hey beautiful.\" Mark said as he walked up beside Mary putting an arm around her waist and pulling her into a kiss.<br>\r\n\"Hey yourself.\" Mary said playfully.</span></div></div>",
            "created":1524805200,
            "id":2485044,
            "title":"On his way to class he runs wants into one of h..."
        },
        "14313":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "option 1",
                "option 2",
                "option 3"
            ],
            "content":"<div class=\"\"><div> <span>\"Hold it right there you two!\" a voice said.<br>\r\n<br>\r\nThey sighed and saw...<br>\r\n<br>\r\n<br>\r\noption 1: their teacher, saying they should get to class<br>\r\noption 2: the class rep, nice buns but too much of a prude<br>\r\noption 3: another of Mark's lovers(describe her)</span></div></div>",
            "created":1525150800,
            "id":2486980,
            "title":"The two love birds are interrupted."
        },
        "143132":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "They tried seduce the prudish woman.",
                "They blow her off and continue on to class",
                "They make a show of fucking just to make her mad.",
                "Something else"
            ],
            "content":"<div class=\"\"><div> <span>Both Mark and Mary both frowned as they heard the voice of their homeroom class representative, Alex Lilly.<br>\r\nShe was hot and just Mark's type at least as far as body went. With broad hips and a fat ass a little bigger than even Mary's. Unfortunately her personality was a was a major turn off in spite of her expansive boutique she was a major prude. In her mind school came before everything and she looked down on her classmates who indulge their carnal desires wantonly in spite of the fact that the school rules allowed it.<br>\r\nAside from her ass she had large round breasts smooth supple skin and long black hair that reached down to her mid back. She was wearing a black jacket over a white button up blouse and a black's kneelength skirt, though it probably would've been ankle-length on a slimmer girl, black rimmed glasses sat on her face.<br>\r\n\"Can't you control yourselves for 15 minutes you have classes to attend.\" Alex said condescendingly watching the bottomless couple.<br>\r\n<br>\r\nHow did Mark and Mary respond to their condemnation...</span></div></div>",
            "created":1525150800,
            "id":2486985,
            "title":"option 2"
        },
        "143133":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Unhappy the two women didn't like to share.",
                "Happy the two women were friends and happily shared Mark.",
                "Indifference, she had nothing against the girl but didn't much care about her.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Both Mark and Mary turned to see Anna Katt. Anna was another one of Mark's regular love is a short hourglass figure it girl with curly strawberry blond hair that fell around her shoulders. She wore round spectacles and was wearing a green sweater and slacks.<br>\r\nShe had something of a cute nerd look going on and she was certainly a bookworm and a straight A student. However that didn't make her reserved or shy however. She had a big libido and frequently invited Mark over for 'study sessions' where the two of them didn't learn anything except each other's anatomy.<br>\r\n---<br>\r\nHow did Mary respond to the new girl's arrival.</span></div></div>",
            "created":1525150800,
            "id":2487020,
            "title":"option 3"
        },
        "1432":{
            "author_id":"driver2017",
            "author_name":"Driver#",
            "choices":[
                "Jennifer Hayes; a new freshman student ",
                "Sandra Caroline; a senior transfer student from Mexico",
                "Ms. Fayes; the fresh out of college English teacher"
            ],
            "content":"<div class=\"\"><div> <span>On his way to class, he saw a large dark shadow cast over the floor of the hallway. As he looked up he saw something that instantly made his gigantic cock grow as he felt his balls begin to fill up. It was an ass. Not just any ass. It was a booty so big that it stuck out from the other side of the hallway. <br>\r\n<br>\r\nJust as he broke out of this sexual trance, whoever owned this monstrous ass began to walk away, out of Mark’s sight.<br>\r\n<br>\r\n“Fuck class,” he thought. “I gotta know who this girl is.”<br>\r\nHe dashed down the hallway, his erection still poking far out from his waist.<br>\r\n“No running! And take care of that thing Mr. López!” scolded a ridiculously busty teacher from behind.<br>\r\n“Sorry Mrs. Mikay!” Mark shouted but still ignored the request. As he turned the corner, he saw the biggest ass he has ever seen at this school filled with huge asses. He approached her as she walked away, making sure his hair was okay and catching his breath to make a good first impression. He thought about tapping her shoulder but her ass was far to big and wide to get anywhere near her back, the thought of which only excites Mark more. Instead he decided to tap the top of one of the girl’s jiggling cheeks. As he pressed his finger into her to get her attention, he felt how soft and plump her ass was. <br>\r\n“Uhh... excuse me” Mark said.<br>\r\n<br>\r\nThe girl turned around revealing herself to be</span></div></div>",
            "created":1567779900,
            "id":2714140,
            "title":"On his way to class he runs into a girl he didn..."
        },
        "144":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Nick turned a corner and runs headfirst into someone's bust.",
                "Nick sees his girlfriend one of the milkyest girls in school come to greet him",
                "He makes it to class without incident."
            ],
            "content":"<div class=\"\"><div> <span>Nick Taylor walked down the hallway to class wearing a white T-shirt and beige khaki pants with a green backpack holding his books. Nick smiled to himself as he eyed the bountiful breasts of his various schoolmates loved being surrounded by such busty babes all day especially when more a few of them produced delectable creamy milk from their delectable fatty tits.</span></div></div>",
            "created":1524459600,
            "id":2483467,
            "title":"Nick Taylor"
        },
        "1442":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Nick asked to drink Lorene's to milk.",
                "Lorene asked for some help milking her breasts.",
                "Something else."
            ],
            "content":"<div class=\"\"><div> <span>Nick's smile widened when he saw his girlfriend Lorene. He was one of the most buxom high school is in the entire school and that was certainly a high bar to clear. Each massive one tit was humongous large and round enough to obscure her entire torso. Her breasts were just big however they were productive as well Lorene producing litres of milk every day from her swollen nipples. <br>\r\nThe two teenagers approached and hugged one another Nick practically buried in his girlfriend's breasts before...</span></div></div>",
            "created":1526187600,
            "id":2492816,
            "title":"Nick sees his girlfriend one of the milkyest gi..."
        },
        "145":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Samantha Sanson",
                "Benjamin Musik",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Samantha Sanson: A buxom bookworm who often finds herself distracted from her reading by her delectable looking classmates.<br>\r\n<br>\r\nBenjamin Musik: A young man feminine in both appearance and demeanour Benjamin nonetheless has one very masculine piece of autonomy between his legs.</span></div></div>",
            "created":1524286800,
            "id":2482525,
            "title":"More choices"
        },
        "1453":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Christine Slater.",
                "Adam Penders.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Christine Slater: a chubby hourglass figured cutie with long black hair and a big appetite she's absolutely shameless about.<br>\r\n<br>\r\nAdam Penders: a nerdy student who shy around women.</span></div></span></div>",
            "created":1524632400,
            "id":2484491,
            "title":"More choices."
        },
        "14533":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Chloe Campbell.",
                "Bo Zhou.",
                "Danny Pepper."
            ],
            "content":"<div class=\"\"><div> <span>Chloe Campbell: a bottom heavy African-American student who wants to cultivate a reputation as the biggest slut in school, not an easy feat considering where she is.<br>\r\n<br>\r\nBo Zhou: Chloe's best friend a chubby top-heavy Chinese girl with a big appetite and an even bigger heart.<br>\r\n<br>\r\nDanny Pepper: Chloe's childhood friend who is one of the few people she knows who can match her in regards to libido.</span></div></div>",
            "created":1525150800,
            "id":2486794,
            "title":"More choices."
        },
        "145331":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Her friend Bo.",
                "Her friend Danny.",
                "A delectable looking student's she decided would be her next conquest."
            ],
            "content":"<div class=\"\"><div> <span>Chloe Campbell hummed happily to herself as she walked down the hall swinging her hips widen as she did so hoping to attract attention to her bountiful backside. A goal that was doubtlessly aided by the fact she was naked from the waist down only wearing a white hoodie.<br>\r\nChloe Campbell had one simple goal to be recognized by the rest of the school was the biggest slut there was. No easy task considering nearly everyone there from the little kids to the teachers had exceptional bodies and libidos. Still she wasn't discouraged always taking the opportunity to have a good lay and spread her reputation.<br>\r\n<br>\r\nAs she walked down the hall she smiled as she spotted...</span></div></div>",
            "created":1551416400,
            "id":2624941,
            "title":"Chloe Campbell."
        },
        "145333":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Continue with Danny Pepper.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Amending a slight mistake from the last chapter</span></div></span></div>",
            "created":1573505700,
            "id":2745371,
            "title":"Danny Pepper."
        },
        "1453332":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Catalina Hawkins-Mittelman-White.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Catalina Hawkins-Mittelman-White: oldest child of a three-person polyamorous marriage (hence the last name) Catalina is a busty knockout with an active sex life. Although she had a nice bubble butt she is somewhat jealous of her mother’s more bountiful bootys.</span></div></div>",
            "created":1573506480,
            "id":2745379,
            "title":"More choices."
        },
        "145334":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Abey Locklear",
                "Bell Johnson",
                "Terry Gray",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Abey Locklear: a bottom heavy an Native American student who is deeply involved in extracurricular activities at school.<br>\r\n<br>\r\nBell Johnson: a top-heavy farmer started getting used to life in the big city.<br>\r\n<br>\r\nTerry Gray: A skater punk more interested in a casual relationship than romance.</span></div></div>",
            "created":1525237200,
            "id":2487474,
            "title":"More choices."
        },
        "1453344":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Valentina Delgado",
                "Sunny Spink",
                "Arthur Cohen",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Valentina Delgado: a crude and shameless punk with a massive bust line and a huge appetite for food and alcohol and sex.<br>\r\n<br>\r\nSunny Spink: a bottom heavy gearhead with a love for fast cars and loose lovers.<br>\r\n<br>\r\nArthur Cohen: a young man who loves role-play both on the table top and in the bedroom.</span></div></div>",
            "created":1526274000,
            "id":2493151,
            "title":"More choices"
        },
        "14533444":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Valerie North and/or Daisy Christopherson.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Valerie North: A bottom heavy burnett book worm with a voracious sexual appetite. Her girlfriend is Daisy.<br>\r\n<br>\r\nDaisy Christopherson: a buxom red headed cheerleader from a wealthy family. Her girlfriend is Valerie.</span></div></span></div>",
            "created":1530075600,
            "id":2512590,
            "title":"More choices."
        },
        "145334442":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Alisha Anand",
                "Next choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alisha Anand: Alisha is girl with a thick hourglass figure she's unabashedly polyamorous and looking for love provided that love is willing to share.</span></div></span></div>",
            "created":1531717200,
            "id":2520580,
            "title":"More choices."
        },
        "1453344422":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Honey Morris",
                "Next choice."
            ],
            "content":"<div class=\"\"><div> <span>Honey Morris: a 10-year-old girl promoted ahead of her age and the high school because of her high intellect and faith that shines through particularly well when it comes to her studies of medicine and biology. Biology she has a rather striking one herself with beach ball sized breasts hanging from her chest.</span></div></div>",
            "created":1531717200,
            "id":2520584,
            "title":"Next choice."
        },
        "14533444222":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Juan Liong.",
                "Next choice."
            ],
            "content":"<div class=\"\"><div> <span>Juan Liong: A young girl from a poor family Juan sees her education as a way to improve her and her family's lot in life. Despite her oversized breasts sometimes getting in the way she is a passionate student of engineering though she sometimes struggles to balance her studies and her libido.</span></div></div>",
            "created":1531717200,
            "id":2520593,
            "title":"Next choice."
        },
        "145334442222":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Kai Kaiwi",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Kai Kaiwi: Hawaiian immigrant with a killer hourglass figure. She maintains a fit athletic body despite her insatiable appetite through frequent physical activity. This is led some of her friends to her friends to compare her to a shot saying that all she does is eat, move around and occasionally mate.</span></div></div>",
            "created":1531717200,
            "id":2520611,
            "title":"Next choice."
        },
        "1453344422222":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Adsila Nocosille",
                "Next choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Adsila Nocosille: A shy and polite bottom heavy girl fondness for cooking. Though normally reserved when it comes to sex her personality lips around becoming assertive and insatiable.</span></div></span></div>",
            "created":1531717200,
            "id":2520616,
            "title":"More choices."
        },
        "14533444222222":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Jonquil Higgins.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Jonquil Higgins: straight A student, student council president and popular with her teachers and classmates alike Jonquil is the archetypical goody two shoes. The one departure she has from her straight-laced demeanour is the fact that she is a massive slut who loves putting her thick hourglass figure to use pleasure and her partners. It's a good thing she's so well-organized she couldn't juggle all the lovers she has if she wasn't</span></div></div>",
            "created":1532235600,
            "id":2523171,
            "title":"Next choice."
        },
        "145334442222222":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Karen Stillwell.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Karen Stillwell: Long legs, broad hips and bouncy full curves there's nothing Karen loves more than dancing and she looks good when she's doing it.</span></div></span></div>",
            "created":1532235600,
            "id":2523174,
            "title":"More choices."
        },
        "1453344422222222":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Cindy Grant.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Cindy Grant: A fatassed prankster who loves to play practical jokes on her classmates. It's all meant in good fun however and if one of her classmates gets mad at her she's happy to use her big butt to cheer them up.</span></div></span></div>",
            "created":1532235600,
            "id":2523175,
            "title":"More choices."
        },
        "14533444222222222":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Candace Washington.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Candace Washington: The daughter of the proprietors of a successful bakery Candace always eats well but doesn't have the chubby physique you might expect as her oversight bust line seems to soak up every bit of fat.</span></div></span></div>",
            "created":1532235600,
            "id":2523177,
            "title":"More choices."
        },
        "145334442222222222":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Amelia Lewis.",
                "Maylyn Carver.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Amelia Lewis: a sweet, demure young woman with a rather blasé attitude towards her heart stopping bottom heavy figure.<br>\r\n<br>\r\nMaylyn Carver: a tall elegant fashionista with a huge bust line. Wants to start her own clothing line which specializes in accompanying the exceptionally endowed.</span></div></div>",
            "created":1550638800,
            "id":2620433,
            "title":"More choices."
        },
        "1453344422222222223":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Adanne García",
                "Shona Fintan",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Adanne García: an athletic brazilian girl with an hourglass figure and a stoic demeanour.<br>\r\n<br>\r\nShona Fintan: a loudmouthed fatassed Scottish slut doesn't care whether she's loved or hated so much as it she's just noticed.</span></div></span></div>",
            "created":1550725200,
            "id":2621028,
            "title":"More choices."
        },
        "14533444222222222233":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Debbi Lim.",
                "Abarrane Fisher.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Debbi Lim: Fat ass drummer for a garage punk band made up of her and her best friends. Excitable and energetic she can be insensitive getting carried away by her own enthusiasm and making people uncomfortable.<br>\r\n<br>\r\nAbarrane Fisher: lead singer and guitarist in the same band as Debbie. Has an hourglass figure and beneath her punkish exterior she secretly dreamed of being the mother to a huge family.</span></div></div>",
            "created":1550898000,
            "id":2622097,
            "title":"More choices."
        },
        "145334442222222222333":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Ai Katou",
                "Tsukiko Katou",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ai Katou and Tsukiko Katou: Twin sisters, not that you could mistake one for the other. Ai is a sweet submissive with a huge chest and Tsukiko is a fatass dominatrix.</span></div></span></div>",
            "created":1561417440,
            "id":2678067,
            "title":"More choices."
        },
        "1453344422222222223333":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Brooke Snow",
                "Next choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Brooke Snow: a cheerful redheaded girl with a thick hourglass figure who dreams of being the perfect housewife.</span></div></span></div>",
            "created":1571185200,
            "id":2733511,
            "title":"More choices."
        },
        "14533444222222222233332":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Dan Fernández",
                "Next choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Dan Fernández: and artistically inclined young man with pretty boring features and wavy brown hair, a romantic at heart he is always looking for 'the one' so to speak. Not that he'd turned down more casual offers of sex</span></div></span></div>",
            "created":1571185560,
            "id":2733513,
            "title":"Next choice."
        },
        "145334442222222222333322":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Ariel Boucher",
                "Next choice."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Ariel Boucher: a blonde French farm girl with gigantic tits. Active and aggressive she's looking for a partner who can keep up with her as well in day to day life as in the sack.</span></div></span></div>",
            "created":1571185800,
            "id":2733514,
            "title":"Next choice."
        },
        "15":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Hana Kim",
                "Duri Kim",
                "Patrick Ryan",
                "Theodore Hock",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Which can't fit you want to follow?<br>\r\n<br>\r\nHana Kim: and 21-year-old Korean woman studying culinary arts. With breasts big enough to cover her entire torso's in spite of their gravity defying firmness. Despite the sexiness of her body she's rather shy and reserved.<br>\r\n<br>\r\nDuri Kim: Hana's twin sister with a figure to match. Unlike her sister she's a proud slut always eager to hop in to bed with some pretty guy or gal preferably more than one at once.<br>\r\n<br>\r\nPatrick Ryan: a slightly built 20-year-old sociology student shy and withdrawn and more than a little nervous the only thing physically imposing about Patrick is his cock which hangs past his knees.<br>\r\n<br>\r\nTheodore Hock: a 21-year-old engineering student he might come off as a playboy because of his many girlfriends but he simply believes in open relationships. He's more than capable of satisfying his many girlfriends thanks to his massively long and thick dick.</span></div></div>",
            "created":1523941200,
            "id":2481002,
            "title":"College/University"
        },
        "151":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Getting up and making herself breakfast.",
                "Looking down at the other person in the bed.",
                "Beginning to masturbate."
            ],
            "content":"<div class=\"\"><div> <span>Hana Kim woke up on a Monday morning slowly stirring to wakefulness in the bed of her dorm room at the school's college. Slowly she sat up letting her bed sheets fall away from her massive bust line revealing her naked breasts. She rubbed the sleep from her eyes before...</span></div></div>",
            "created":1524373200,
            "id":2483104,
            "title":"Hana Kim"
        },
        "1511":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Hana heads off to class",
                "Is joined in the kitchen by her roommate.",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Hana got dressed wearing a simple green sweater and comfortable slacks and made her way to her dorm kitchen. She got to work whipping up a large breakfast she had a big appetite and although it would mean having to rush off to her first class she knew she didn’t get enough calories she’d be spacey and cranky all day.<br>\r\nHana started cooking deciding to have for breakfast the same thing she had every morning just about everything. Biscuits and gravy, Black putting, boiled eggs, breadfruit, yogurt, waffles, strudel, sticky buns, scrambled eggs, bacon, bagels, breakfast burritos, cereal, sausage breakfast, tacos, chicken curry, chorizo, cinnamon rolls, cream pie, cream the eggs on toast, croissants, crepe, doughnuts, egg Benedict, energy bars, English muffins, sausage, quesadilla, porridge, oatmeal, pop tarts, pork roll, peanut butter and jelly sandwichs, pancakes, omelettes, muffins, fruit putting, grits, grillades, ham and eggs, hash browns, French toast, apple, oranges, bananas.<br>\r\nShe laid out the food soon covering the whole table with plates before sitting down to eat. Hana eight quickly knowing she didn’t have the time before class to do anything else. The huge spread of food disappeared down her throat with lightning speed and soon the table was simply covered with empty dishes.</span></div></div>",
            "created":1604656740,
            "id":2935403,
            "title":"Getting up and making herself breakfast."
        },
        "1512":{
            "author_id":"novahamm",
            "author_name":"Hamn8r",
            "choices":[
                "sleeping with slutty twin",
                "sleeping with a guy",
                "sleeping with another girl"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She felt shifting, and noticed she was not alone in her bed. She looked to see another person in her bed. Was it her sister, a guy or one of her female classmates?<br>\r\n<br>\r\nAN: with the last option, RC on the girl, and describe her</span></div></span></div>",
            "created":1524373200,
            "id":2483109,
            "title":"Looking down at the other person in the bed."
        },
        "15121":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "She was surprised.",
                "She was surprised and angry.",
                "She wasn't surprised Duri regularly climbed into her bed at night.",
                "She wasn't surprise the sisters had slept together last night."
            ],
            "content":"<div class=\"\"><div> <span>Hana looked down to see the face of her twin sister facedown and cuddling into the massive pillows that were her breasts. Where Hana was shy and reserved Duri was bold and outgoing loving to flaunt her magnificent body and take as many people too bad as possible. For Duri getting gang banged by three people wasn't a wet dream it was a 'warm-up.'<br>\r\n---<br>\r\nHow did Hana react to her sister's presence.</span></div></div>",
            "created":1524459600,
            "id":2483500,
            "title":"sleeping with slutty twin"
        },
        "15122":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Her age, a fellow college student.",
                "The grade schooler she had a thing for shotas.",
                "An older guy."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She looked down at the guy sharing her bed who she is up with the night before licking her lips as she remembered his massive member stretching out her pussy.<br>\r\nThe man in question was...</span></div></span></div>",
            "created":1551330000,
            "id":2624549,
            "title":"sleeping with a guy"
        },
        "15123":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Smiled at her roommate turned bedmate.",
                "Smiled at her girlfriend.",
                "Woke her up and kicked her out of bed she didn't ask for this.",
                "Begin to hear Wendy start.sleep talking."
            ],
            "content":"<div class=\"\"><div> <span>It was one of her friends from school Wendy. The red haired Irish woman was short with a thick hourglass figure breasts and butt cheeks like overgrown watermelons. She was still asleep cuddling against Hana's side. Hana looked down at the shorter girl and...</span></div></div>",
            "created":1524373200,
            "id":2483126,
            "title":"sleeping with another girl"
        },
        "152":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "All men.",
                "All women.",
                "A mix of both."
            ],
            "content":"<div class=\"\"><div> <span>Duri stirred awake on a sunny Monday morning humming in pleasure as she felt her naked body up against the her bedmates. It was a rare occurrence indeed for Duri to be alone in a bed the buxom Korean woman was shamelessly sexual and had a libido large enough to require regular orgies to keep in check.<br>\r\nHana sat up in bed and looked around at the people who were her lovers last night's mining as she began to gently shake them away for some morning fun.<br>\r\n---<br>\r\nWho were they?</span></div></div>",
            "created":1525237200,
            "id":2487231,
            "title":"Duri Kim"
        },
        "153":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "His girlfriend.",
                "Another classmate who wanted to take him for a ride.",
                "The teacher who had been eyeing him lately."
            ],
            "content":"<div class=\"\"><div> <span>Patrick Ryan a slightly built young man with short blonde hair walked down the halls of his college trying not to attract too much attention to herself as went not an easy feat one a huge bulge between his legs was leading the way. Even completely soft his package was big enough that no comfortable clothing could obscure his member.<br>\r\n<br>\r\nEventually however he was stopped when he ran into...</span></div></div>",
            "created":1525237200,
            "id":2487239,
            "title":"Patrick Ryan"
        },
        "154":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Amy an athletic tomboy with a thick backside.",
                "Rebecca a top-heavy girly girl.",
                "Lani a seductress with a heart stopping hourglass figure."
            ],
            "content":"<div class=\"\"><div> <span>Theodore Hock sat at his desk working on some school work, the tanned skinned and red-haired young man occasionally fidgeted, I looked under his desk would've revealed why he has one of the doors many girlfriends was currently on her knees and between his legs sucking him off. <br>\r\n<br>\r\nThe girl in question was...</span></div></div>",
            "created":1525237200,
            "id":2487419,
            "title":"Theodore Hock"
        },
        "155":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Jazmine Peach",
                "Thomas Gray",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Jazmine Peach: A young woman from an upper class family she is every bit the classy dignified young lady you expect of her background except for two factors her enormous ass and her even bigger libido.<br>\r\n<br>\r\nThomas Gray: An energetic young film student who wants to follow his mother's footsteps in the porno industry. Though he primarily works behind the scenes he's not afraid to step in front of the camera and more than capable of satisfying his costars.</span></div></div>",
            "created":1524286800,
            "id":2482520,
            "title":"More choices."
        },
        "1551":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "The University building for her classes.",
                "A restaurant for a date.",
                "A sex club for an orgy to blow off some steam."
            ],
            "content":"<div class=\"\"><div> <span>Jasmine Peach walked down the street turning heads as she went. She didn't begrudge people for staring the shorthaired African-American woman had quite a impressive figure with round firm breasts the size of her head and a massive backside that could easily fill two chairs and then some with matching hips and thighs. The young woman was wearing a expensive purple custom dress and black shear tights which for many just added to her appeal.<br>\r\n<br>\r\nIt didn't take long for Jasmine to arrive at her destination...</span></div></div>",
            "created":1525237200,
            "id":2487423,
            "title":"Jazmine Peach"
        },
        "15512":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Her date with a man",
                "Her date was a woman"
            ],
            "content":"<div class=\"\"><div> <span>She was heading down to a local restaurant for her date. It was a rather upscale place Jazmine having had to book reservations well in advance to get a good table for herself and her date. She arrived and was soon shown to her seat wincing slightly as she sat down and heard the wood creek under her it didn't take long for her date to show up.</span></div></div>",
            "created":1525496400,
            "id":2488990,
            "title":"A restaurant for a date."
        },
        "155122":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "The waiter arrives and the two ordered their meal.",
                "The two began talking the conversation quickly turning raunchy."
            ],
            "content":"<div class=\"\"><div> <span>Her date arrived and Jasmine wasn't ashamed to say she was a little stunned. The woman was named Alice she was tall with long flowing blond hair, rich brown eyes and a fair complexion. She also possessed two absolutely gigantic boobs each round, firm, gently swaying knocker being more than large enough to cover her entire torso and currently contained in a tight red dress that showed off a more than generous amount of cleavage.<br>\r\nShe sat down at the table carefully positioning her chair and herself so that her bust line didn't knock into the table before smiling brightly at her date.</span></div></div>",
            "created":1526706000,
            "id":2495405,
            "title":"Her date was a woman"
        },
        "1552":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Class.",
                "A shoot.",
                "A date."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Thomas Gray walked down the hallway long blonde hair tied back wearing a jacket over a yellow shirt and beige her slacks. A small smile played on his face as he headed off to...</span></div></span></div>",
            "created":1531890000,
            "id":2521685,
            "title":"Thomas Gray"
        },
        "1553":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Elizabeth Geary",
                "Kane Lance",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Elizabeth Geary: A tall top heavy brunet with a most unusual hobby wrestling.<br>\r\n<br>\r\nKane Lance: Elizabeth boyfriend shorter and less athletic than just a some people wonder what she sees in him. Those who see his monster cock and performance in bed got us a question again.</span></div></div>",
            "created":1524459600,
            "id":2483485,
            "title":"More choices"
        },
        "15531":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Class",
                "The gym, she had a match",
                "The cafeteria",
                "Her boyfriend's house."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Elisabeth walked down the hallway massive breasts bobbing and hair swishing as she moved the green eyed fix and had her hair tied up in a ponytail as she headed towards her destination...</span></div></span></div>",
            "created":1525150800,
            "id":2486851,
            "title":"Elizabeth Geary"
        },
        "155312":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Was a girl",
                "Was a guy",
                "Was a kid?",
                "Wasn't there."
            ],
            "content":"<div class=\"\"><div> <span>Elisabeth walked into the locker room to get ready for her match quickly changing into a green leotard that was tight enough left nothing of her massive curves and camel toe to the imagination.<br>\r\nShe walked out into the gym ready for her match and stepped into the ring seeing that her opponent...</span></div></div>",
            "created":1525237200,
            "id":2487426,
            "title":"The gym, she had a match"
        },
        "155313":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Normal size breakfast.",
                "large breakfast sitting for an athletic young woman.",
                "supersize breakfast to feed her supersized bust.",
                "Meal that was strange not for its size but..."
            ],
            "content":"<div class=\"\"><div> <span>Elisabeth headed into the cafeteria to grab some breakfast for herself. She knew what she wanted going into what didn't take long to get everything together on a tray. She paid and sat down at a nearby empty table before digging into her meal a...</span></div></div>",
            "created":1525237200,
            "id":2487479,
            "title":"The cafeteria"
        },
        "15532":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "It was empty.",
                "His girlfriend Elizabeth.",
                "One of his friends (with benefits)."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Kain Lance stirred awake in his dorm room's bed, sitting up he looked around his bed to see...</span></div></span></div>",
            "created":1542690000,
            "id":2580134,
            "title":"Kane Lance"
        },
        "15533":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Abeba Kiba",
                "Kali Acharya",
                "Adrian Nikolaidis",
                "More choices"
            ],
            "content":"<div class=\"\"><div> <span>Abeba Kiba: A young mother with massive breasts who has gone back to college to finish her post secondary education.<br>\r\n<br>\r\nKali Acharya: an Indian child prodigy with T&amp;A the size of her head and sexual skill and stamina as far above her age as her grade level.<br>\r\n<br>\r\nAdrian Nikolaidis: A shy young man from a wealthy upper-class background.</span></div></div>",
            "created":1526187600,
            "id":2492827,
            "title":"More choices."
        },
        "155332":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Class.",
                "The cafeteria."
            ],
            "content":"<div class=\"\"><div> <span>Kail walked down the hallway humming happily to herself. She was wearing a tight red low-cut dress the thin fabric allowing her nipples to poke through. The hem of the dress stopped just past her ass though it was light and loose enough that it flared up with even slight movement showing off her bare butt, and she had plenty of butt and bust to show off with breasts each three times the size of her head and ass cheeks to match.<br>\r\n<br>\r\nShe pushed open the door and walked into...</span></div></div>",
            "created":1528606800,
            "id":2505492,
            "title":"Kali Acharya"
        },
        "155334":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Abra Najjar.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Abra Najjar: A tall, tough military brat whose butch looks are undercut by her enormous breasts.</span></div></span></div>",
            "created":1531717200,
            "id":2520625,
            "title":"More choices"
        },
        "1553342":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Amara Chailangka.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Amara Chailangka: A tall buxom knockout who loves swimming more than anything.</span></div></span></div>",
            "created":1531717200,
            "id":2520627,
            "title":"More choices."
        },
        "15533422":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Hayfa Hamid.",
                "More choices."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hayfa Hamid: A calm, relaxed to musician with a hourglass figure and an interest in massage both giving and receiving.</span></div></span></div>",
            "created":1531717200,
            "id":2520629,
            "title":"More choices."
        },
        "155334222":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Amata Herrera",
                "Grace Yumi",
                "More Options."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Amata Herrera: A history major with a thick hourglass figure and the voracious sexual appetite.<br>\r\n<br>\r\nGrace Yumi: a kinky fatassed psychology major.</span></div></span></div>",
            "created":1542085200,
            "id":2577465,
            "title":"More choices."
        },
        "1553342223":{
            "author_id":"ohshc",
            "author_name":"las moras",
            "choices":[
                "Aimi Tanaka",
                "Tanya Jones",
                "More choices."
            ],
            "content":"<div class=\"\"><div> <span>Aimi Tanaka: A black haired prodigy already in college despite only being in years. Belongs to a trio of girls known as the \"Piranhas\" for their insatiable appetite for both food and sex that is at odds with their small size.<br>\r\n<br>\r\nTanya Jones: A red haired MILF going back to college to finish her education.</span></div></div>",
            "created":1558414800,
            "id":2662265,
            "title":"More Options."
        }
    },
    "info":{
        "author_id":"ohshc",
        "author_name":"las moras",
        "brief_description":"A school for boys and girls all of whom share one thing in common sizable endowments.",
        "created":1523125560,
        "description":"<td align=\"left\" class=\"norm\">This story takes place in a school designed to cater for young men and women who have large endowments such as breasts and buttocks bigger than their head or cocks as long as their arms. The school provides education for everything from kindergarten at the University and has all the necessary facilities to make sure it's students have a comfortable pleasurable education.<br>\r\n<br>\r\nLike with my other stories I will not allow chapters containing nonconsensual sex or extreme violence. Chapters that break these prescriptions will be deleted</td>",
        "id":2154707,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1604656740,
        "modified":1604656740,
        "pretty_title":"School for the differently endowed"
    }
}