{
    "chapters":{
        "1":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "Your story",
                "Your Story",
                "Your Story",
                "Your Story",
                "More options"
            ],
            "content":"<div class=\"\"><div> <span>So here's the deal, some generous soul gifted me with year of basic membership. Im willing to give writers a chance to write the stories or interactives they wanted to write but never got the chance. And I'll adjust the age rating based on what's posted. I'm not fussed what you post, but I expect you to put some effort into it. I have one condition:<br>\r\n<br>\r\n1) If you add a one line or two line chapter or a short bridge chapter in general. YOU MUST ADD TO IT. No one line \"Does she do this?\" \"What about this?\" \"What about this?\". That stuff adds NOTHING to the website and if you post it, i'll delete it. If you have an account that adds nothing but that garbage to interactives I'll delete it as soon as I see it, otherwise I'll give you sometime based on how much you contribute to the site (I'll wait an hour for new accounts). If people keep spamming that instead of real chapters I may just delete this interactive, so don't abuse my kindness. But if you're here to write then have at it<br>\r\n<br>\r\n2) Put some effort into it. It doesn't need to be a masterpiece but make it obvious you put some thought into it and at least glanced at what you type. I won't enforce this one too harshly, as long as it's clear you're trying I'll likely leave you be<br>\r\n</span></div></div>",
            "created":1540200240,
            "id":2567022,
            "title":"Welcome to the party"
        },
        "11":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Pre Dragon Transformation (Celica human)",
                "Post Dragon Transformation (Celica dragon)"
            ],
            "content":"<div class=\"\"><div> <span>Thank you The ride has ended for being generous enough to host this interactive. <br>\r\n<br>\r\nHere we have characters from my Dungeons and Dragons group, Distortion World. There are 4 main characters (we just added a 5th but they haven’t played enough for me to gauge their personality accurately)<br>\r\n<br>\r\nRemember these four are adventuring together and trust each other. They are a team.<br>\r\nCharacters -<br>\r\nChuck the half orc-half dwarf<br>\r\n6’06” <br>\r\nTanned skin, black stringy hair, brown eyes<br>\r\nWears minimal clothing, usually just his loincloth. Muscular physique, wields a greataxe single handedly.<br>\r\nIs a bit of brute, loves showing his force and dominance over others. But deep down has a softer side.<br>\r\n<br>\r\nAzura the human<br>\r\n5’03” <br>\r\nPale complexion, pale blue hair, ice blue eyes<br>\r\nWears a light weight pale blue dress with white trim. Lean build, size B cup, is a caster and well versed in a wide array of magic.<br>\r\nA bit shy and meek, but protective of her friends (Chuck, Celica, Silver)<br>\r\n<br>\r\nCelica the human<br>\r\n5’05”<br>\r\nLightly tanned complexion, lavender hair, gold eye (is missing her right eye)<br>\r\nWears a green long sleeve tunic, black longcoat (purple trim), gray pants, brown boots. Semi muscular, size A cup, is a Ranger, prefers her longbow but can use a longsword and short sword for close quarter combat and has knowledge of casting magic but not her specialty.<br>\r\nShe is cold and indifferent to people, has been seen with a sadistic side. Cares greatly for her lover (Azura) but may playfully tease her. <br>\r\n<br>\r\nCelica-Alt the Storm Dragon<br>\r\n200’00”<br>\r\nBipedal dragon <br>\r\nLavender scales, black underbelly/neck scales and wing membrane, silver mane that starts at her scalp and runs down to her shoulders. Crimson eye (still missing the right eye)<br>\r\nOnce she took on this form, Celica became more sadistic and enjoys toying with others to a dark level. She still retains her love/affection for Azura but has a bad habit of showing her love in not normal ways (might swallow Azura to protect her). Enjoys playing/toying with Chuck and Silver but would never actually hurt them.<br>\r\n<br>\r\nSilver the half elf-half human<br>\r\n6’09”<br>\r\nNever seen out of his armor (you decide his skin tone), assumed he has silver hair, green eyes<br>\r\nWears full plate armor (silver in coloration), armor covers him head to toe. Is always seen with his greatsword (wielding one handed) and tower shield. <br>\r\nHe is proper and formal, acts as a morale compass. Will give his life for Celica in a heartbeat even if they don’t always see eye to eye. <br>\r\n<br>\r\nI included both variations of Celica (my character) due to the transformation that occurred during one of our campaigns. The Dragon Transformation did alter a lot about the group’s dynamics and how we played, and altered Celica’s personality.<br>\r\n<br>\r\nFeel free to add and go crazy. All I ask is that you try to stay true to the characters’ personalities above. </span></div></div>",
            "created":1550756820,
            "id":2620831,
            "title":"Tales From Distortion, A D&D story"
        },
        "111":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Original timeline",
                "Reboot timeline"
            ],
            "content":"<div class=\"\"><div> <span>Our campaign was met with a reboot, so I’m opening an original timeline route or a reboot route?<br>\r\n<br>\r\nOriginal - <br>\r\nFeatures all characters mentioned in previous chapter<br>\r\n<br>\r\nReboot -<br>\r\n(Due to in progress campaign, I’m going to be writing a lot more loosely)<br>\r\nCharacters include -<br>\r\nChuck the half orc-half dwarf<br>\r\n6’06” <br>\r\nTanned skin, black stringy hair, brown eyes<br>\r\nWears minimal clothing, usually just his loincloth. Muscular physique, wields a greataxe single handedly.<br>\r\nIs a bit of brute, loves showing his force and dominance over others. But deep down has a softer side.<br>\r\n<br>\r\nAzura the 1/2 elf 1/2 human<br>\r\n5’03” <br>\r\nPale complexion, pale blue hair, ice blue eyes<br>\r\nWears a light weight pale blue dress with white trim. Lean build, size B cup, is a caster and well versed in a wide array of magic.<br>\r\nA bit shy and meek, but protective of her friends (Chuck, Celica, Silver)<br>\r\n<br>\r\nCelica the human<br>\r\n5’05”<br>\r\nLightly tanned complexion, lavender hair, gold eyes<br>\r\nWears a green long sleeve tunic, black longcoat (purple trim), gray pants, brown boots. Semi muscular, size A cup, is a Ranger, prefers her longbow but can use a longsword and short sword for close quarter combat and has knowledge of casting magic but not her specialty.<br>\r\nShe is cold and indifferent to people, has been seen with a sadistic side.<br>\r\n<br>\r\nWarren the elf<br>\r\n6’03”<br>\r\nPale complexion, emerald eyes, long straight blonde hair<br>\r\nWears full plate armor, wields a Morningstar and tower shield, knows healing magic <br>\r\nIs a Cleric and Fighter mix<br>\r\nWarren is sadistic to an extreme level, he has been known to force others to fight for his amusement and still ends up killing the victor. He and Camilla clash a lot, never seeing eye to eye.</span></div></div>",
            "created":1561721280,
            "id":2679737,
            "title":"Pre Dragon Transformation (Celica human)"
        },
        "1112":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Uses potion on group mate ",
                "Uses potion on herself"
            ],
            "content":"<div class=\"\"><div> <span>Alright! Welcome to the Distortion World reboot.<br>\r\n<br>\r\nIntro - Time Eater, a powerful warlock, has begun crushing 4 worlds in on themselves thus creating a fifth world (Distortion World). 4 heroes are brought into the Distortion in order to save the realms. In order to do such, they’ll need to collect the 4 Cardinal jewels and the 4 legendary weapons. They’ll need to work as a team? But can they?<br>\r\n<br>\r\nLet’s find out...<br>\r\n<br>\r\nCamilla picked the lock on the chest and smirked when she saw the lock click clean off. She setthe metal piece aside as she opened the chest. Inside was single potion and a note. Written in Infernal the note translated to “Those who seek a transformation, drink the potion and watch your outside self reflect your inside self.” Camilla tucked the The note and potion into her coat then quickly caught up to the others. <br>\r\n<br>\r\n“Find anything?”’Azura asked as she looked to the Ranger. Camilla shook her head before hearing a groan. “Something to say, Warren?” Azura asked.<br>\r\n<br>\r\nWarren, the group’s main healer, rolled his eyes. “Locked chests and nothing? Seems a bit farfetchd.” He grumbled. Chuck growled as he cleaved through a hidden door and signaled for the others to follow. <br>\r\n<br>\r\nCamilla drew her short sword and took point with chuck beside her. There was nothing just an empty bedroom-like chamber. “Looks all clear.” The ranger said before working on getting the fire going. As she sat, she thought about the potion. She wanted to see what it did but she was also nervous. With a nod she decides...</span></div></div>",
            "created":1561721940,
            "id":2679742,
            "title":"Reboot timeline"
        },
        "112":{
            "author_id":"leon_wolf",
            "author_name":"Leon Wolf",
            "choices":[
                "Frostbite peak",
                "Desolate ridge ",
                "Lost zone"
            ],
            "content":"<div class=\"\"><div> <span>Post Dragon transformation! <br>\r\n<br>\r\nThe sun slowly crawled above the horizon, it’s orange light starting to cast upon the frozen tundra. Hunkered down in a snow cave were three humanoids. The first was a half orc-half dwarf, his greataxe laying beside him. His bedroll and blanket were scuffed in many spots and his pack was barely holding together. The next was a half elf-half human, beside him was his silver armor, greatsword and tower shield. His gear looked in better shape than the other male’s. Finally there was a human girl, her staff, rapier and spellbook all within easy reach. Her gear was very worn down and had seen better days. <br>\r\n<br>\r\nLooming over the trio was a massive dragon, her lavender scales shimmering in the faint light. Her body was pressed against the entrance to the snow cave preventing any cold air from seeping and ensuring the warmth of the fire did not escape. Her crimson eye opened as she let out a massive yawn, she flicked her tongue a few times before looking to the humanoids. “Wakey, wakey guys.” She said as she lumbered closer. <br>\r\n<br>\r\n“Five more minutes...” the human replied as she rolled over.<br>\r\n<br>\r\nThe dragon smirked as she nuzzles the human. “Come on Azura, you slept plenty.” She cooes. <br>\r\n<br>\r\nThe half orc yawns as he sits up. “What Chuck do today?” He asked.<br>\r\n<br>\r\nThe half elf groggily sits up and scratches his head. “Chuck why do you always talking like that?” He asked.<br>\r\n<br>\r\n“Chuck see Silver not mused. Chuck say Silver try.” Chuck laughed as he gathered up his belongings.<br>\r\n<br>\r\nSilver rolled his eyes as he stood and began getting his armor on. “Damn thing is heavy.” He mumbles as he adjusts how the full plate armor rests on him.<br>\r\n<br>\r\n“That way Chuck no wear armor!” Chuck belts loudly.<br>\r\n<br>\r\nThe dragon laughed watching the two men. Her attention returns to Azura, whom she nuzzles again. “Wakey Wakey.” <br>\r\n<br>\r\n“Five more minutes, Celica.” Azura responds as she pats the dragon’s snout. <br>\r\n<br>\r\nCelica smirks slightly. “Alright fine, you can sleep while we’re on route.” The dragon states as her long slinder tongue snakes out of her jaws.<br>\r\n<br>\r\nSilver and Chuck both shudder knowing what was next. They gathered up their supplies then sat back waiting. Azura felt something slimy wrap around her before being dragged around. “Celica! Wait!” She cries out as the dragon snaps her jaws shut around her. <br>\r\n<br>\r\nCelica chuckles as she tilts her head back and swallows. She purrs somewhat sadisticly as Azura slides down her throat. She looks down as the caster’s supplies and licks those up to, sending them to her stomach with their owner. Azura lands with a wet plop in the dragon’s stomach and shakes off. “Gods dang it Celica! Why are you like this?!” She calls up as she gathers her belongings.<br>\r\n<br>\r\n“You didn’t want to get up.” Celica chuckles as she stands. She looks to the guys. “You boys ready?” She asked.<br>\r\n<br>\r\n“Yeah, Let’s get going.” Silver says. He pulls out the map and unfolds it. “We have a few choices for our route to the Instinctive Aether. We can go through Frostbite peak, desolate ridge or try our luck with the lost zone. What do you guys think?”</span></div></div>",
            "created":1550861880,
            "id":2621492,
            "title":"Post Dragon Transformation (Celica dragon)"
        },
        "12":{
            "author_id":"blueblur2",
            "author_name":"Bluelink999 ",
            "choices":[
                "Your household ",
                "Other classmates cousins etc "
            ],
            "content":"<div class=\"\"><div> <span>Thanks to the ride has ended for this story interactive whatever you want to call it <br>\r\n<br>\r\nRules <br>\r\n<br>\r\n1. No male interaction <br>\r\n<br>\r\n2. Please keep it to butt stuff only no transformation and shrinking is allowed anything goes if it is kept to only asses <br>\r\n<br>\r\n3.you can make it willing or unwilling <br>\r\n<br>\r\nCharecters:<br>\r\n<br>\r\nYou: keep nameless age 17<br>\r\n<br>\r\nOlder sister: Shawna age 21 blonde hair flows down to shoulder blades is a bit ditzy and forgetful trips while walking up the stairs sometimes<br>\r\n<br>\r\nTwin sister: Kate age 17 dark brown hair flows same length as Shawna she is really caring to you and your family loves to help you or others out and is quite smart but is forgetful since she takes so attribes from Shawna with hair and how forgetful both are <br>\r\n<br>\r\nYounger sister: Sophie age 14 light brown hair flowing past her shoulders easily the one you get along best  with she likes anime and video games and you two talk about those all the time sometimes you and hear take tiny Walks in the forest to find stuff and make references to stuff often you also play video games in her room and sometimes you have sleep overs in which you take the floor <br>\r\n<br>\r\nMake another chapter to add any other characters but no more siblings you can make cousins friends and classmates etc ok have a nice time <br>\r\n<br>\r\n</span></div></div>",
            "created":1556341560,
            "id":2650933,
            "title":"A butt story "
        },
        "121":{
            "author_id":"blueblur2",
            "author_name":"Bluelink999 ",
            "choices":[
                "Sophie’s room",
                "Kate’s  or Shawna’s room "
            ],
            "content":"<div class=\"\"><div> <span>You say hearing your alarm go off it’s currently 8 am and it’s the beginning of the Easter break why were you up so early you don’t exactly know but you guess it was so you could make the most out this break as you get up and stretch you say to yourself <br>\r\n<br>\r\nYou:”*yawn* I should probably do a tiny bit of study so I don’t get murked by a teacher” <br>\r\n<br>\r\nAsfter that you get up still in your Pajamas which consisted of a short sleeved t-shirt and pants you sat down at your desk and did half an hour of study<br>\r\n<br>\r\nYou:”that should do it.” You say quietly you get up and have one last stretch before heading down for breakfast as you leave your room you hear Shawna say something to herself you knock on her door <br>\r\n<br>\r\nShawna:”come in.” You enter the door to see her on her computer at her desk <br>\r\n<br>\r\nYou:”hey get an early start on the break as well?” <br>\r\n<br>\r\nShawna:”yeah just doing a tiny bit of job hunting just applied to a cashier job that should help for summer.”<br>\r\n<br>\r\nYou:”okay good luck with that.” One that note you leave her room <br>\r\n<br>\r\nOnce you make your way down stairs you enter the kitchen to see Kate making breakfast <br>\r\n<br>\r\nKate:”hey.”<br>\r\n<br>\r\nYou:”hello is Sophie still asleep?”<br>\r\n<br>\r\nKate:”yeah she told me she’s sleep in a bit should be awake around ten. I made some breakfast for you if you want some?” <br>\r\n<br>\r\nYou:”yeah sure.” <br>\r\n<br>\r\nAs you two eat you two just chat about regular things from school friends and family turns out your parents are gone for the spring break you went to bead early last night so they couldn’t tell you but they left money for food and made sure to stock up and some as well.<br>\r\n<br>\r\nWhen you finish your food you both check the clock to see it’s 9 <br>\r\n<br>\r\nKate:”well it’s been nice but I’m going to go to my room since we are going on holidays in summer I’m going to try and get a job for it.” <br>\r\n<br>\r\nAh how could you forget holidays your going to a mobile home somewhere In Europe you think Italy but there’s a pool nearby with slides so that’ll be a treat<br>\r\n<br>\r\nYou:”okay see you around.” <br>\r\n<br>\r\nAs you two part ways you go back to your room and relax you lie in bead and read some books and stuff until ten pm you then<br>\r\n<br>\r\n————————————————————————<br>\r\nGo to Sophie’s room to play video games <br>\r\n<br>\r\nGo to Kate’s room <br>\r\n<br>\r\nGot to shawnas room <br>\r\n</span></div></div>",
            "created":1556343720,
            "id":2650942,
            "title":"Your household "
        },
        "1211":{
            "author_id":"blueblur2",
            "author_name":"Bluelink999 ",
            "choices":[
                "You enter ",
                "You shrink "
            ],
            "content":"<div class=\"\"><div> <span>You make a decision and decided to get out of bed and head for Sophie’s room as you walk there you think to yourself about what you are going to play you actually turn back to grab some video game styled cards in case you want to play that. <br>\r\n<br>\r\nYouraprroching her door as you continue to thinkablutehat game until you are face to face with her door then</span></div></div>",
            "created":1556344320,
            "id":2650945,
            "title":"Sophie’s room"
        },
        "1212":{
            "author_id":"blueblur2",
            "author_name":"Bluelink999 ",
            "choices":[
                "Shawna ",
                "Kate "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decide to not go to Sophie’s room and you then decided to go to <br>\r\n<br>\r\nShawna room to have a chat with <br>\r\n<br>\r\nKate’s room for a study session and also a chat </span></div></span></div>",
            "created":1556343900,
            "id":2650943,
            "title":"Kate’s  or Shawna’s room "
        },
        "15":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "Your Story",
                "Your Story",
                "Your Story",
                "More options",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Yes its a bridge chapter. I'm just getting the ball rolling. Btw if enough people start their own stories you might need to start one by hitting option 2 of someone's story chapter</span></div></span></div>",
            "created":1540200360,
            "id":2567024,
            "title":"More options"
        },
        "154":{
            "author_id":"7777",
            "author_name":"Just here for the poke story",
            "choices":[
                "Your story",
                "Your Story",
                "More options"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Only posting this to hit 3 chapters. I likely won't make anymore bridge chapters unless people fill up the slots</span></div></span></div>",
            "created":1540200540,
            "id":2567025,
            "title":"My last bridge chapter... hopefully"
        }
    },
    "info":{
        "author_id":"7777",
        "author_name":"Just here for the poke story",
        "brief_description":"I got a basic membership and I'm willing to give an interactive if you're willing to write",
        "created":1540200180,
        "description":"<td align=\"left\" class=\"norm\">So here's the deal, some generous soul gifted me with  year of basic membership. Im willing to give writers a chance to write the stories or interactives they wanted to write but never got the chance. And I'll adjust the age rating based on what's posted. I'm not fussed what you post, but I expect you to put some effort into it. I have one condition:<br>\r\n<br>\r\n1) If you add a one line or two line chapter or a short bridge chapter in general. YOU MUST ADD TO IT. No one line \"Does she do this?\" \"What about this?\" \"What about this?\". That stuff adds NOTHING to the website and if you post it, i'll delete it. If you have an account that adds nothing but that garbage to interactives I'll delete it as soon as I see it, otherwise I'll give you sometime based on how much you contribute to the site (I'll wait an hour for new accounts). If people keep spamming that instead of real chapters I may just delete this interactive, so don't abuse my kindness. But if you're here to write then have at it<br>\r\n<br>\r\n2) Put some effort into it. It doesn't need to be a masterpiece but make it obvious you put some thought into it and at least glanced at what you type. I won't enforce this one too harshly, as long as it's clear you're trying I'll likely leave you be<br>\r\n<br>\r\nAnd whoever gave me membership: thanks man</td>",
        "id":2172649,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1561721940,
        "modified":1561721940,
        "pretty_title":"Interactive for grabs"
    }
}