{
    "chapters":{
        "1":{
            "author_id":"kentasmeller",
            "author_name":"The Stink Sniffer",
            "choices":[
                "The Catgirl's Room",
                "Anime choices",
                "Video Game Choices"
            ],
            "content":"<div class=\"\"><div> <span>Your name is Cody your an 18 year old guy, who is currently unemployed and got no girlfriend. You would love to find one but you don't know if they would ever be into your stink fetish or if they ever found out they would want to get a way from you or not. Only hope is to fine that girl that would be into you no matter what, but you feel as the would be impossible to fine nowadays.<br>\r\n<br>\r\nAs you continue to walk in the streets you step on a piece of paper, as you look at your feet picking it up and having a look at it. <br>\r\n<br>\r\n<div align=\"center\">\"Stink Hotel. The Best place to cover your stink fetish needs where you get to meet your favourite game and anime characters and get to full fill your fetish and pleasures that you have always wanted.\"</div><br>\r\n<br>\r\nThis looks very interesting to you as it was just what you have always wanted, and now you can do it with your favourite characters from video games and anime it just got better. As there is no need to go and find it as you look up and see this massive hotel that is well over 1000 feet tall, as you can see the name on it is called \"Stink Hotel\" which is where you hope to head to.<br>\r\n<br>\r\nYou walk into the door, as you do it looks like as if the doors opened on their, own as you walk you see to ladies standing there wearing maid outfits, as they lean towards you planting their lips on both of your kisses giving you a small peck, before stand up straight again.<br>\r\n<br>\r\nLadies: Welcome to Stink Hotel enjoy your stay.<br>\r\n<br>\r\nAs you look at both at them, blushing a tiny bit from their kiss as you nod at them.<br>\r\n<br>\r\nYou: Thank you.<br>\r\n<br>\r\nAs the nod back allowing you to continue to walk to the a counter as you see another girl behind it. This one happens to wear a nurse costume. As you go to speak to her.<br>\r\n<br>\r\nYou: Too late for halloween isn't it?<br>\r\n<br>\r\nSaying as a joke, the girl in the nurse costume gives out a cute giggle before responding.<br>\r\n<br>\r\nNurse: No. Every employee here are girls and we like to dress up in cosplay so thats why you might be seeing me as a nurse, I know it looks bad on me but I thought it looked cute on me.<br>\r\n<br>\r\nYou: And it does, it doesn't look bad at all. It looks great on you.<br>\r\n<br>\r\nYou say making the nurse blush.<br>\r\n<br>\r\nNurse: Umm.... Thank you... Anyways, welcome to Stink Hotel where you to full fill your stink fetishes and pleasures, sign here and go to the elevator over there.<br>\r\n<br>\r\nSaying pointing opposite to her, as you look that way and see a elevator, then looks back at the Nurse. Nodding at her getting a pen and writing your name down. As you give her a smile, in which she does back. <br>\r\n<br>\r\nYou walk away from the counter, and head to the elevator it automatically opens it up allowing you to walk it as it closes. You see to your right another girl, this one is wearing a catgirl costume.<br>\r\n<br>\r\nYou: Cute costume.<br>\r\n<br>\r\nThe Catgirl blushes.<br>\r\n<br>\r\nCatgirl: Thank you.<br>\r\n<br>\r\nSaying as she lifts her butt leaning towards your direction and then relaxes her butt into her previous, leaving you wondering what she was hoping to accomplish. But then a stench hits you, it becomes stronger and worst, getting a strong smell of rotten eggs. You look over to the cat girl.<br>\r\n<br>\r\nCatgirl: Was it good?<br>\r\n<br>\r\nSaying that making you blush, as you nod saying yes.<br>\r\n<br>\r\nCatgirl: Well good, always good to fine someone liking my farts. But unfortunately most people that come here are only here for the characters from the games and anime and don't care about my stink.<br>\r\n<br>\r\nYou: Well I kinda enjoyed it, to be honest I wish I could smell more it.<br>\r\n<br>\r\nCatgirl: Really?!?!?<br>\r\n<br>\r\nYou continue to blush more making your face more red, seeing this.<br>\r\n<br>\r\nCatgirl: Well.... in this elevator you get to choose to go into your favourite game or anime and get to meet your favourite characters.. But if you want maybe I could full fill your fetishes for you instead. What do you say?<br>\r\n<br>\r\nSaying as she shows you the choices of anime and games as well as her floor which would lead into her room.</span></div></div>",
            "created":1383886800,
            "id":1691572,
            "title":"Welcome to the Stink Hotel!"
        },
        "12":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Dragon Ball",
                "Naruto",
                "Bleach",
                "other older anime (pre-2000)",
                "other newer anime (2000+)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Which anime do you pick?</span></div></span></div>",
            "created":1523941200,
            "id":2480675,
            "title":"Anime choices"
        },
        "121":{
            "author_id":"rainbowriderv",
            "author_name":"rainbowriderv",
            "choices":[
                "Mind Control Powers",
                "Immortality!",
                "To become stronger!"
            ],
            "content":"<div class=\"\"><div> <span>You find yourself facing a door, emblazoned with none other than a four-starred Dragon Ball. <br>\r\n<br>\r\nYou open the door, and step through, finding yourself just outside of the Capsule Corporation building. The sky is dark, and thunder cracks from the heavens. You look up, to see the wish-dragon Shenron above you.<br>\r\n<br>\r\n\"You are allowed one wish,\" his booming voice says. What do you wish for?</span></div></div>",
            "created":1545010260,
            "id":2589872,
            "title":"Dragon Ball"
        },
        "122":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Mini Man.",
                "Make people do your bidding.",
                "YOLO SWAG SOLO"
            ],
            "content":"<div class=\"\"><div> <span>You've always thought about Naruto characters unleashing their stench upon you, unknowing or not, so you walk into the Naruto door.<br>\r\n<br>\r\n<span class=\"clilac\">M</span><span class=\"cviolet\">A</span><span class=\"cgrape\">G</span><span class=\"cplum\">I</span><span class=\"cmagenta\">C</span>{c:r ose}A</span><span class=\"cmaroon\">L</span><br>\r\n<br>\r\n<span class=\"cblack\">A</span><span class=\"cgrey\">D</span><span class=\"clgrey\">V</span><span class=\"cindigo\">E</span><span class=\"cnavy\">N</span>{c:blue }T<span class=\"clblue\">U</span><span class=\"cpblue\">R</span><span class=\"cteal\">E</span><br>\r\n<br>\r\n<br>\r\nYou look around and see that you are in the Hidden Leaf Villiage, or Konohagakure.<br>\r\n<br>\r\nEverything around you grays as time suddenly freezes, text boxes appear in front of you asking<br>\r\n<br>\r\n[<b>What power do you wish for?</b>]<br>\r\n<br>\r\nA:<b> The power to shrink and be invincible while shrunk</b><br>\r\nB:<b> The power to mind control others (To make them fulfill your stink fetish)</b><br>\r\nC:<b> WHO THE FUCK NEEDS POWERS, I'M HARDCORE WITHOUT POWERS</b><br>\r\n</div></div>",
            "created":1531112400,
            "id":2516693,
            "title":"In Konohagakure"
        },
        "1221":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Going for the manly scents",
                "Going for the lovely lady smells",
                "Animal smells at their finest "
            ],
            "content":"<div class=\"\"><div> <span>You decided to press the button that said A:<b>The power to shrink and be invincible while shrunk</b> because there's alot of potentional to smell all the dirty smells you want.<br>\r\n<br>\r\nThe question is, what \"side\" do you swing for, male or female?<br>\r\n<br>\r\nA: Male Ninja's, though I would prefer not Kakashi, Iruka etc.<br>\r\nB: Female Ninja's, older people are ok here, but not excessively old people.<br>\r\nC: Maybe an animal, like Akamaru etc.</span></div></div>",
            "created":1531112400,
            "id":2516814,
            "title":"Mini Man."
        },
        "12211":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Naruto (The OG)",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>You are gay, or at least have a love for male feet. What ninja do you want? (I don't care about post time skip character differences etc, just keep it consistent with what was said first).<br>\r\n<br>\r\n<br>\r\nA: Naruto, the hyperactive child<br>\r\nB: Others (Because I can't put more choices)</span></div></div>",
            "created":1531112400,
            "id":2516818,
            "title":"Which Male Ninja?"
        },
        "122111":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Go for the Feet!",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>You look around and see that the general layout of the village is near the start of the anime. You decide to search for Naruto's home, which takes the better part of the day but you eventually find it. You shrink yourself and sneak in to the place Naruto calls home. You hear the sound of someone walking, and you see the colossal (To you) form of Naruto, and you see his sweaty feet along with his sweaty ass and sweaty armpits, its safe to assume he just got through training or something.<br>\r\n<br>\r\nYou immediately get a boner because of the thought of smelling all the sweat and smells that Naruto would produce. What area do you go for?<br>\r\n<br>\r\nA: Right for the feet, easy access and smelly too!<br>\r\nB: Others</span></div></div>",
            "created":1531112400,
            "id":2516823,
            "title":"Start of Series-Naruto"
        },
        "1221111":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Sneaky approach, he'll never trust you",
                "The early human gets the feet"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Question is, do you want a sneaky approach or do you want to straight up ask him?<br>\r\n<br>\r\n(Gonna add a chapter right after this, so don't you worry)</span></div></span></div>",
            "created":1531112400,
            "id":2517276,
            "title":"Sweaty Toes."
        },
        "12211112":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Naruto is on board!",
                "Naruto would rather you smell his friends"
            ],
            "content":"<div class=\"\"><div> <span>Y/N = Your Name<br>\r\n<br>\r\nYou walk up in front of Naruto, while he's just sitting in the chair thinking, and you suddenly grow yourself to your regular size, which quite obviously surprises him. <br>\r\n\"Who are you and how did you get here?\" He asks, wary of you since he's a ninja (In Training).\"I'm Y/N, and I was here the entire time\" You replied to the young Jiinchuriki, and he looked at you like you were crazy. He asked back \"I didn't see you, how were you here the entire time?\". You shrink down to about half your height, wait a second then grow back, a look of understanding blossoming on his face.<br>\r\n<br>\r\n\"Why are you here then?\" Naruto asked, and it was a perfectly valid question. You replied straightforwardly, \"I like your smells, and I want to experience them with your help.\". Naruto looks at you, strangely at first then asks \"You like my smells? You mean my sweaty feet and stinky ass?\". \"Yes\" you immediately replied, wanting to experience the smells as fast as possible. Naruto then replies _______________________<br>\r\n<br>\r\n1: \"Sure, I'll help you out\"<br>\r\n2: \"I'm not too comfortable about you smelling me, how about I try to sneak you into my friends houses instead?\"<br>\r\n<br>\r\n<font class=\"size1\" style=\"\">S</font><font class=\"size2\" style=\"\">T</font><font class=\"size25\" style=\"\">I</font><font class=\"size3\" style=\"\">N</font><font class=\"size35\" style=\"\"> K</font><font class=\"size4\" style=\"\">Y</font><font class=\"size45\" style=\"\">HEA</font><font class=\"size5\" style=\"\">VEN</font></span></div></div>",
            "created":1531112400,
            "id":2517282,
            "title":"Asking Never Hurt Anyone"
        },
        "122111122":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "\"Konohamaru\"",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>Naruto replied \"I'm not too comfortable about you smelling me, how about I try to sneak you into my friends houses so you can smell them instead?\" You then replied \"Any smell is good enough for me. Which friend are you going to bring me too?<br>\r\n<br>\r\nNaruto then replied _________.<br>\r\n<br>\r\nA: \"Konohamaru\" <br>\r\nB: Others</span></div></div>",
            "created":1532379300,
            "id":2523815,
            "title":"Things are always better with friends!"
        },
        "1221111221":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "His Ass",
                "Others"
            ],
            "content":"<div class=\"\"><div> <span>As Naruto said Konohamaru, you felt yourself become a little excited. Konohamaru, while not as old as say, Naruto or Sasuke, he still held a certain charm, and with a male ninja comes a lot of male scents that you were eager to smell. You say \"I'll gladly smell Konohamaru, but I'd prefer it to be stealthy instead this time, because I doubt Konohamaru has the same reasoning and kindness of you\". \"Sure\" Naruto replied, okay with you smelling Konohamaru instead of him. \"Where do you want to smell on Konohamaru?\" Naruto asked.<br>\r\n<br>\r\n\"I want to smell _________.\" You replied</span></div></div>",
            "created":1532380800,
            "id":2523826,
            "title":"\"Konohamaru\""
        },
        "12211112211":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Back Pocket, play it safe until later.",
                "To the source!"
            ],
            "content":"<div class=\"\"><div> <span>\"I want to smell his ass.\" You replied, eager to smell butt smell after being denied it by Naruto. Naruto says \"Hop in my hand, and I'll take you to Konohamaru\". You reply \"C'mon, put me on your feet, pretty please\" Naruto, caving in said \"Fine, but I better not catch you jacking it in there, and I'm only doing this since I'm not gonna see you again\" \"Thank you Naruto\" You replied, happy that you could smell Naruto anyway. Naruto puts on his sandals, and puts them in front of you, expecting you to jump on them, and you don't disappoint by jumping on his foot, getting a hard on already from the smell. You resist the urge to touch it because you know Naruto will get angry if you jerk it while on his foot.<br>\r\n<br>\r\nNaruto's voice comes booming from the heavens \"<b>We're about to leave, so you better be ready</b>\". Naruto's feet suddenly rises like a roller coaster, and falls back just as fast. Thankfully you were ready and was holding onto his sandal. After a couple of minutes which felt like seconds of rising and falling, Naruto stops, and you suddenly hear Konohamaru's voice shouting \"Naruto Nii-san!\" Naruto reply's back \"C'mon Maru, lets sit down and talk for a bit\". Naruto stealthily puts his hand next to you, and you realize that he's helping you get closer to Konohamaru's ass. You quickly hop onto his hand, and right as you touched it Naruto closed his hands a small bit and hides you from sight, while not being super uncomfortable for you. You feel yourself rise and start moving back and forth as Naruto presumably lifted his hands back up and started walking.<br>\r\n<br>\r\nYou feel yourself suddenly drop and see light fall upon you. You take a second to search your surroundings and see a stone block at your feet and two giant asses to your side. You look up and see Naruto's face to the right, and Konohamaru's face to the left. You go to the left to Konohamaru's butt, and you decide to go _________.<br>\r\n<br>\r\nA: Into a back pocket and remember, you're invincible, squish but can reform instantly unless the pressure is still on you.<br>\r\nB: Into the pants and underwear, closer to the source of the farts and potentially your new home<br>\r\n</span></div></div>",
            "created":1532383320,
            "id":2523836,
            "title":"His Ass"
        },
        "12211112212":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Konohamaru's Feet",
                "Others (Sorry)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Sorry about choice chapter<br>\r\n<br>\r\nA: His Feet<br>\r\n<br>\r\nB: Others</span></div></span></div>",
            "created":1532381100,
            "id":2523827,
            "title":"Where on Konohamaru?"
        },
        "122111122122":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Armpits.",
                "Readers choice it is."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about dem sweaty armpits<br>\r\n<br>\r\nA: Armpits it is<br>\r\nB: Readers Choice</span></div></span></div>",
            "created":1532381280,
            "id":2523828,
            "title":"Armpits"
        },
        "1221111222":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "YES!",
                "Nah, someone else. "
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the last Uchiha, commonly referred to as \"Sasuke-Teme\" by Naruto.</span></div></span></div>",
            "created":1566870120,
            "id":2708357,
            "title":"The last Uchiha?"
        },
        "1221112":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Going for the booty",
                "Others (Sorry)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This is gonna be the first of few choice chapters I submit here, because I simply don't have enough space to put all the choices.<br>\r\n<br>\r\nA: The smelly ass of Naruto.<br>\r\nB: Others (Sorry)</span></div></span></div>",
            "created":1531112400,
            "id":2516825,
            "title":"Choice Chapter (Sorry)"
        },
        "12211122":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Armpit, the sweatiest place on the body",
                "Other (For you)"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>This should be the last one, though I'll put others just in case<br>\r\n<br>\r\nA: Armpit Stink, Yummy<br>\r\nB: Other Option in case I missed any and other people want to add it.</span></div></span></div>",
            "created":1531112400,
            "id":2516828,
            "title":"Others (Sorry)"
        },
        "12212":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Sakura or Hinata",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Alright, female characters from Naruto. Let’s start out with the obvious choices.</span></div></span></div>",
            "created":1531112400,
            "id":2516918,
            "title":"Going for the lovely lady smells"
        },
        "122121":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Hinata",
                "Sakura"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Hinata or Sakura?</span></div></span></div>",
            "created":1531112400,
            "id":2517273,
            "title":"Necessary evil."
        },
        "1221212":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Younger Sakura",
                "Older Sakura"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is this Pre-Shippuden (Younger) or Post-Shippuden (Older) Sakura?</span></div></span></div>",
            "created":1535102160,
            "id":2538164,
            "title":"Sakura"
        },
        "12212121":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Stayed with the Flower.",
                "Closer to the source.",
                "More adventure!"
            ],
            "content":"<div class=\"\"><div> <span>You look around and immediately see many key characters, although they're younger then Shippuden, it seems as though you were  placed at the start of the series, right at academy graduation time, judging by the ages. It seems as if the cat girl knew where what time specifically you wanted to go to.<br>\r\n<br>\r\nYou sniff around the air and notice something. It seems as though you're right under someone staying still. It's odd how you never noticed, but you just now noticed how stinky and wonderful the smell is. You look up and see a pair of shorts covered by a red dress, the clothes Sakura wears all Pre-Shippuden, though something is odd. You see Sakura farting every so often, even though you had never seen her fart in the series before, so you assume this universe is specifically made for you to enjoy yourself. You quickly run onto Sakura's blue sandals while also comparing your height to hers. It seems as though you shrunk to about 4 inches tall, the height of an average middle finger.<br>\r\n<br>\r\n<br>\r\nSince Sakura had not taken being a Ninja serious yet, her senses weren't strong enough to sense you yet, which is a great boon for you. You could experience Sakura's smells and then move on to the next girl without her being any the wiser. You then hear the bell ring but stay on her shoe, knowing that anyone, even Sakura, would feel something your size crawling on her bare leg. <br>\r\n<br>\r\nWhat happens next?<br>\r\n<br>\r\nA: You stay on Sakura's shoe the entire day, without anyone noticing you.<br>\r\n<br>\r\nB: You can't resist temptation, and climb up her chair leg to smell her farts that you smelled earlier, but closer to the source.<br>\r\n<br>\r\nC: You fall off her foot, and take the chance to move onto another boy or girl (Please, no Iruka, Mizuki Etc, older females are fine though.</span></div></div>",
            "created":1535103540,
            "id":2538171,
            "title":"Younger Sakura"
        },
        "122121213":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Sakura",
                "Ino",
                "Hinata"
            ],
            "content":"<div class=\"\"><div> <span>As you are riding Sakura's sandal you fall off, just as she is entering the class. Sakura, being the teachers pet is the first one in line, prompting you to get stomped on by a bunch of random people, though being stepped on doesn't hurt in the slightest. After everyone steps over you, you stand up, feeling not uncomfortable at all, despite the grooves of the ninja sandals. Knowing this is great news, because now you can be more risky without fearing being squashed like a grape under an elephant. <br>\r\n<br>\r\nYou look around the class and, as is obvious you see a bunch of the Canon characters as kids. There's Hinata, Ino, Sakura, and even all of the guys. You decide that you will only go after girls for now and, considering there's 3 of them you have options.<br>\r\n<br>\r\nYou think in your head about the pros and cons of each one. With Sakura, she goes home to a family with no ninja training, meaning you can easily sneak around her house with no one finding you. The con is that there's no one else at Sakura's house, no one attractive you can switch too once you get bored of Sakura.<br>\r\n<br>\r\nWith Ino, her family is a ninja family, which will be much more likely to catch you, which is a big con. Another con is that there's not many girls to switch to, should you want to. The big pro, however is that Ino is hot, even as a pre-teen.<br>\r\n<br>\r\nFinally, with Hinata, she's really nice, so even if you get caught by her, she wouldn't torture you or anything. Continuing from that last statement, the likelyhood of Hinata catching you is nearly 100%, considering she has the Byakugan unlocked, which gives 360 degree vision while also able to see Chakra. You don't know if you have Chakra or not, but you probably do. A pro is that Hinata also has a little sister, Hanabi that has cute little feet you could smell if you want variety in your life, although you aren't sure if Hanabi is as nice as her sister.<br>\r\n<br>\r\nWho do you go to?<br>\r\n<br>\r\nA: Sakura, stay true to the original<br>\r\n<br>\r\nB: Ino, the sassy clan heiress<br>\r\n<br>\r\nC: Hinata, the shy and kind Hyuuga Heiress</span></div></div>",
            "created":1535190780,
            "id":2538608,
            "title":"More adventure!"
        },
        "122122":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "One of them",
                "someone else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about Ino or Tenten</span></div></span></div>",
            "created":1531112400,
            "id":2517278,
            "title":"someone else"
        },
        "1221221":{
            "author_id":"chaosjeff1",
            "author_name":"Mc Writer",
            "choices":[
                "Ino Yamanaka",
                "Tenten"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>The obvious question is, the blond from the Yamanaka clan that can implant her mind into others, or the weapon mistress with 100% accuracy that kinda looks like a panda?</span></div></span></div>",
            "created":1531198440,
            "id":2517285,
            "title":"Guess I gotta do this again. {b}SIGH{/b} "
        },
        "1221222":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "yes",
                "no"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Is she even from the leaf village?</span></div></span></div>",
            "created":1531112400,
            "id":2517279,
            "title":"someone else"
        },
        "12212222":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Mist",
                "another one"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Well what village is she from then?</span></div></span></div>",
            "created":1536245820,
            "id":2543799,
            "title":"no"
        },
        "122122222":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Sand",
                "Another one"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>How about the Sand village?</span></div></span></div>",
            "created":1536245880,
            "id":2543802,
            "title":"another one"
        },
        "1221222222":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Sound",
                "Another one"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Maybe the Hidden Sound Village</span></div></span></div>",
            "created":1536245940,
            "id":2543804,
            "title":"Another one"
        },
        "125":{
            "author_id":"yejdbdinsknsk8",
            "author_name":"Yejdbdinsknsk8",
            "choices":[
                "Totally Spies ",
                "Martin Mystery ",
                "More..."
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What about these Shows,there sort of anime’s </span></div></span></div>",
            "created":1593550320,
            "id":2859289,
            "title":"other newer anime (2000+)"
        },
        "13":{
            "author_id":"ridley23",
            "author_name":"writer49er",
            "choices":[
                "Metroid",
                "Mario",
                "Legend of Zelda",
                "something else"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>perhaps a nintendo game</span></div></span></div>",
            "created":1431666000,
            "id":1978510,
            "title":"Video Game Choices"
        }
    },
    "info":{
        "author_id":"kentasmeller",
        "author_name":"The Stink Sniffer",
        "brief_description":"Ever want to sniff your favourite anime and game characters then come to this story.",
        "created":1383831180,
        "description":"<td align=\"left\" class=\"norm\">Have you ever want to sniff your favourite game or anime characters than read this story, you get to go this lovely Stink Hotel, where you get to go to any door you want and a different door allows you to go to a certain game or anime which allows you to meet your favourite characters, and you get to have fun sniffing their odours and to full fill your wanted fantasies and your favourite pleasures so come and stay at the stink hotel where you would never want to leave!<br>\r\n<br>\r\nWarning: The man character is a guy, and There is both Male and Female pleasuring so if that isn't your song and dane then you might want to change the channel to something that does suit you, but for others that love this kind of stuff, then enjoy your time reading this story and making chapters of your own.<br>\r\n<br>\r\nRules for posting a story:<br>\r\n1. Swearing is allowed<br>\r\n2. Make the chapter at least just 1 paragraph (3 to 4 lines min.) long min. There is no Maximum, unless the characters limitation stop you<br>\r\n3. No Gore in anyway.<br>\r\n4. Only butt vore, if you want mouth vote please message me and make sure the character finds away out of the body.<br>\r\n5. Scats are allowed.<br>\r\n6. Use a lot of stink fetishes like farting, body odour etc.<br>\r\n7. Other fetishes are allowed to be used, not just stink although that is the main fetish for this story.<br>\r\n8. Have fun.<br>\r\n9. And before posting a chapter on here, please me message it, just so I don't have to go and fun it and delete it or edit. </td>",
        "id":1961746,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1593550320,
        "modified":1593550320,
        "pretty_title":"Stinky Heaven"
    }
}