{
    "chapters":{
        "1":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "When you wake up..."
            ],
            "content":"<div class=\"\"><div> <span> \"Wow.\" You think to yourself. \"I actually beat May! She used to always beat me, but for the first time, I got better marks than her. Hmm, Akane still beat me though. Come to think of it, May isn't in the top 5 anymore because of me. Hope she doesn't get mad at me or anything\".<br>\r\n<br>\r\n You are pretty pleased about your mark in the recent test and can't wait to tell your parents about it. But then again, you remember that there's another test on today and decide to hold the celebration back till later. As the morning bell goes, you quickly head to your roll call, to make sure you aren't late.<br>\r\n<br>\r\n When you arrive there, you sigh to yourself, remembering few things about this roll call. One thing you hate about your roll call is that none of your friends are in the same room. So, you don't really have anyone to seat with. Therefore, you always just seat in the back by yourself. <br>\r\n<br>\r\n However... There is an upside to make things better. Since you are in the back seat, noone notices you as you eavesdrop or fantasize about May and Akane. Ever since your freshmen years, you always took a like to May and Akane but you never had the heart to tell them how you feel. Not only that, countless boys have asked the two out but they always refused, saying that boys were disgusting. It's no suprise how popular they are. They are both very smart and Akane is even a great Athelete. Like everyday, you decide to eavesdrop on part of their conversation.<br>\r\n<br>\r\n You only manage to catch Akane say \"May's probably writing her will. Her parents are strict about her marks\" to another friend as the bells ring, notifying everyone that the first class is about to start.<br>\r\n<br>\r\n \"I guess it's test time again,\" You tell yourself, \"I think I will go the long way so I can take some fresh air before the test\". By the time you are near your classroom, the hallways are pretty much empty and there are only few students in yoru eyesight.<br>\r\n<br>\r\n As you walk along, heading toward your testroom, you hear couple of footsteps running up to you. Before you can turn around, you are knocked forward by none other than Akane and May.<br>\r\n<br>\r\n Before you can snarl your anger at them, May giggles \"Oops! Sorry Loser!\" at you and both of them run off into another hallway. One thing you notice is that your notebook was knocked away from you and has now slided all the way over to a locker. And the second thing you notice is that a girl is getting her books out in front of the locker that your notebook has landed in.<br>\r\n<br>\r\n You realise that this is going to look really perverted, so decide to just take the notebook quickly and pretend that it didn't happen. But as you crawl your way over to the notebook, your horomones take over and you can't resist but to look up. The third thing you notice is the nice long legs that rise up to a white lingerie that the girl is wearing. <br>\r\n<br>\r\nThe fourth thing you notice is the ringing of your ears as the girl feels your presence, turns around and shouts \"You!! Pervert!!\" and quickly runs off, looking embarassed...<br>\r\n<br>\r\n And the last thing you notice is a pink haired girl coming out from around the corner and poiting a wand of some kind at you. <br>\r\n<br>\r\n\"There!\" she tells you. \"I hope it works\" with not very confident tone. <br>\r\n<br>\r\n\"You're weird\" You quickly insult her.<br>\r\n<br>\r\nThe girl manages to reply looking a bit flourished \"Hmph. Well, I hope you enjoy my little spell, then! See ya later, kid!\"<br>\r\n<br>\r\n Next thing you know, there's a test paper in front of you and your eyelids feel like couple of rocks. You can't help yourself but to doze off...<br>\r\n<br>\r\n<br>\r\n <br>\r\n<br>\r\n</span></div></div>",
            "created":1212382800,
            "id":539034,
            "title":"Enjoy my little spell!"
        },
        "11":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Ready to crush you with her book!",
                "Reaching out to grab you! (Alternate Storyline)",
                "Trying to crush you, but you manage to jump off the chair. (Alternate Storyline)"
            ],
            "content":"<div class=\"\"><div> <span> The first thing that comes to your mind is... <br>\r\n<br>\r\n \"W...Where am I? ... What happened? ... Crap. I fell asleep in class... Well, I guess I'm not gonna get as good result as the last one... Wait... What happened to me?! Why is everything so big!? Oh no... This is NOT good! How did this happen?! Am I dreaming?\"<br>\r\n<br>\r\n Before you can think further, a shadow looms over you. You look up to see the Pink Haired Girl...</span></div></div>",
            "created":1212382800,
            "id":539066,
            "title":"F for Fail"
        },
        "111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Try and get help from one of the passerby",
                "Head toward one of the girls with an open locker",
                "Explore and try to find the Pink Haired girl"
            ],
            "content":"<div class=\"\"><div> <span> You don't even have time to scream as your whole vision is blocked by the front cover of a red book! <br>\r\n<br>\r\n \"Gotcha!\" The Pink Haired girl exclaims as she smacks you mercilessly with her book.<br>\r\n<br>\r\n From the damage, you are unable to open your eyes and you start to get afraid if you are now dead. Miracurously, you are able to open your eyes again and when you do so, you realise that you are under the chair that you were seating on a second ago, and that the Pink Haired girl is already leaving the room.<br>\r\n<br>\r\n You quickly pull yourself up, and follow her through the door. When you get outside the classroom, you can tell that students are getting ready for next class, as people are moving about in the hallway and others are getting their books from the locker room. You decide to...</span></div></div>",
            "created":1212382800,
            "id":539524,
            "title":"Gotcha!"
        },
        "1111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "You fail to dodge the incoming \"Bus\".",
                "You manage to dodge to the right."
            ],
            "content":"<div class=\"\"><div> <span> You decide that the first thing you should do, is to find help from someone because at your size, you won't last long. So, because there's no one you know in the hall at the moment, you guess that getting help from a girl is less riskier than getting help from a guy because, guys can be pretty cruel to other small animals, such as yourself...<br>\r\n<br>\r\n So you plan out all the story that you are going to tell to the girl that's going to help you. You are going to omit the part about you being a pervert and tell her that somehow a Pink Haired girl made you shrink...<br>\r\n<br>\r\n \"Here goes nothing\" You encourage yourself as you look around, to see who might be suitable. From the stairs to the left, there's a blonde girl coming toward you, with books in her arms. Because of that, she's quite slow and you once again tell yourself that you can pull this off. <br>\r\n<br>\r\n You quickly run toward her feet that seem like a bus each, to you, and stop at about 2 metres away from her. Your hopes rise as the girl's expression changes as she notices soemthing moving on the floor. However... The reaction you get is of a total opposite of what you expected... <br>\r\n<br>\r\n \"Ewww! Bug! I better squish it!\" She screams as she raises her right foot over you, balancing on her left foot. This catches you off guard and...</span></div></div>",
            "created":1212469200,
            "id":539529,
            "title":"Officially Bugged"
        },
        "11111":{
            "author_id":"slipstream",
            "author_name":"JackInTheirBox",
            "content":"<div class=\"\"><div> <span>You desperately try and dive out of the way in an attempt to escape a gruesome death.<br>\r\nHowever, you were never that good at P.E..<br>\r\n<br>\r\nThe enormous black shoe manages to descend down on your tiny form. You have no time to scream as the monolithic leather weight pushes you into the floor. You close your eyes, knowing death is imminent.<br>\r\nIndeed it is. The weight pushing down on you is too much to bear and your body is crushed flat under the girl's foot.<br>\r\n<br>\r\nThe girl examines the bloody mess on the sole of her shoe.<br>\r\n\"Ew!\" She casually rubs it on the floor, displaying more of your gory remains across the ground. Satisfied with how easily she squished the little bug, the girl walks away, unaware of what she had truly done.<br>\r\n<br>\r\nYou died. Next time, move faster.</span></div></div>",
            "created":1226811600,
            "id":608420,
            "title":"You Go Squish Now!"
        },
        "11112":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Get steppd on by another passerby",
                "Step on a sticky substance that makes you stop in your track"
            ],
            "content":"<div class=\"\"><div> <span> Miraculously you manage to dodge the incoming foot, only to be welcomed by the hard floor. You are managed for a mere second, which gives the girl enough time to start to lift her foot to try and stomp you again. You take a quick look around the area and quickly decide to run under the lockers for safety. You hear a sound of annoyance as the massive foot lands right next to you, making your bones shiver. As you are heading for the sanctuary, you...</span></div></div>",
            "created":1214370000,
            "id":548258,
            "title":"Head for the Sanctuary"
        },
        "111121":{
            "author_id":"magic681",
            "author_name":"Shadow Ninja",
            "content":"<div class=\"\"><div> <span>With all the massive and thus extremely loud stomping sounds going on around you whenever someone puts their foot down, you don't seem to notice that you're going partially deaf.<br>\r\n<br>\r\nMaking your way to the sanctuary, you never hear the massive footsteps behind you, and realise in horror when you turn around that its too late.<br>\r\n<br>\r\nYou dive foward in an attempt to avoid the unaware student passing by, with no avail. She casually brings her foot down you, crushing everything except your head, which is now seperated from yor body. It rolls away from your life-less non-existent body until it is, too, splattered by a passerby, leaving two massive red stains on the floor.</span></div></div>",
            "created":1251954000,
            "id":754814,
            "title":"Get steppd on by another passerby"
        },
        "111122":{
            "content":"<div class=\"\"><div> <span>You think to yourself, \"This is it! This i really it, I'm really going to die!\" But just as the girl is about to slam her foot down ontop of your stuck body, she stops and just stares at you squirming. She bends down and begins to look at you with wide eyes curious as to what kind of bug you are, but just as she does so, one of her friends comes by and steps on your legs crushing your lower body into a bloody splat.<br>\r\n<br>\r\nYou cry out in pain but to your dismay they arent able to hear you. The blonde girl forgets all about you and begins to talk with her friend. Her friend lifts her foot and reveals yor smushed body on the sole of her shoe. You begin to die and you lay there bleeding out as the blonde girl steps to the side of her friend. As she does so her shoe steps and grinds on the rest of your body, as she walks away she leaves a smear of blood on the floor along with you stuck to her shoe.<br>\r\n<br>\r\n                                                          Better Luck Next Time<br>\r\n<br>\r\n                                                                    THE  END</span></div></div>",
            "created":1253077200,
            "id":761468,
            "title":"Girlfriends Don't Mess Around"
        },
        "1112":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Climb in the bag and get her attention in the next class.",
                "Start Climbing Her legs that seems to go on forever, to you.",
                "Wait for her to be done with packing and follow her afterwards."
            ],
            "content":"<div class=\"\"><div> <span> Getting help would and is one of your main priorities because you are obviously helpless at this size. Looking around, there's a familiar face, or more like familiar back. You haven't talked to her much, but you know that she's in few of your classes like Physics and PE. Anyhow, she's standing up tall and is getting some things out of the locker with her bag on the ground. It's knocked over on to the side so it seems like you could easily climb in. You guess that there's few choices you can take to get her attention...</span></div></div>",
            "created":1212469200,
            "id":539530,
            "title":"Do I know her?"
        },
        "11121":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "PE",
                "Biology (Alternate Storyline)"
            ],
            "content":"<div class=\"\"><div> <span> Thinking about other options, you realise that there are so many factors that go against you. For example, what if you fell down while climbing her legs, or what if you couldn't keep up with her, when she was heading for her next class. So you take the least risky option and decide to climb into her open bag and wait it out...<br>\r\n<br>\r\n Two things you notice in here. One, it has a lot of junk and whatnot in it, ranging from pencil cases to personal necessities like make up and stuff... Two, it's boring as hell as there's no movement and all you can see outside the bag is the plain old ceiling...<br>\r\n<br>\r\n Few mintues pass and the bells ring again. Suddenly the bag starts to move as the girl quickly heads for her next class. You realise that the open end of the bag has many objects and because of that, the floor seems like it's moving. With no choice, you run toward the other side where there's no light but feels as if there's less junk.<br>\r\n<br>\r\n By the time the bag stops moving again, what class has the girl gotten to?</span></div></div>",
            "created":1212469200,
            "id":539534,
            "title":"All Aboard!"
        },
        "111211":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "You grab on to her socks and climb up to her toes.",
                "Unfortunately, you get knocked back by her toes and get stuck under them."
            ],
            "content":"<div class=\"\"><div> <span> One another thing you notice on the way to wherever that you were going, was that there was an odd smell that you couldn't quite figure out. Maybe a week old sandwich? Nah. How about...Strong perfume? Nah. Whatever it was, you just couldn't figure it out...<br>\r\n<br>\r\n As the journey goes on, you can hear more noises coming from the outside. This continues on until all you can hear are girl's voices, along with some faint noises of footsteps. Not long after that, the bag stops moving and drops rapidly to the ground with a thud. As the bag hits the ground, your world shakes and the things inside are flown about. Next thing you know, you are now in some kind of a cave and the smell from before has got even stronger...<br>\r\n<br>\r\n Wondering what class this was, you decide to look up, and automatically you squint and cover your eyes as the light is very bright... By the time you recover... You gasp in horror as you realise just where you are... Your actions of attention are futile as the girl's right foot starts to descend on you. The sheer size of the foot scares you and you instincitvely retreat to the toe end, until you realise that you just cornered yourself even more...<br>\r\n<br>\r\n Can you climb on to the top of her toes before she finishes putting her shoes on?</span></div></div>",
            "created":1212469200,
            "id":539538,
            "title":"Bright Light"
        },
        "1112111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Yes, but she thinks you are a bug.",
                "Nope, you have to look for someone else."
            ],
            "content":"<div class=\"\"><div> <span> Even though that your head feels dizzy from the stench the her shoe's giving off, you somehow manage to grab onto her sweaty socks and climb out of the dark and smelly prison before it's too late. As you make contact with the ground, you turn around, hoping that you were noticed by the girl. Did you?</span></div></div>",
            "created":1213678800,
            "id":545206,
            "title":"Quick Climb"
        },
        "11121111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Simply kick you away with her sweat soaked sock!",
                "Smash you with her right shoe!"
            ],
            "content":"<div class=\"\"><div> <span> As you make a sound landing and turn around to see what the girl's reaction was, you gain a glimpse of hope as the girl's expression becomes one of a curiousness. You decide to shout something to tell her that you need her help. Before you have the time, the girl starts to look like she is disgusted as she screams \"Eww, there was a bug in my shoes?!\". This somehow manages to faze you as all your other senses are nulled by the loud noise that rings your ears like crazy. While you are defenseless, the girl decides to...</span></div></div>",
            "created":1214542800,
            "id":548919,
            "title":"Yikes!"
        },
        "111211111":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "You were stuck to it, along for another ride...",
                "You were left on the floor of the girl's changing room..."
            ],
            "content":"<div class=\"\"><div> <span> Your vision is filled with an incoming socked foot as you are helpless to avoid it.<br>\r\n<br>\r\n \"Oomph\" is all you manage to say as the air is knocked out of your lung, while you are pushed along for a ride that you never agreed to. Despite the fact that it's a mere second or two, to you, not only is the pain great, the stench of her sweaty socks seems to fill your nostrils for much longer than that. Once the ride's over, as you bounce off the ground few times, your body feels as if it's been smashed all over. However, to make matters worse, you have no time to pull yourself up, before you can feel the ground vibrate. Knowing what it means, without having to turn around, you gather whatever energy you have left, to n your body against the possible impact. <br>\r\n<br>\r\n BOOM! goes the foot as it steps on top of you with deadly precision... However, this time, the socks were definitely sweatier and smellier, as you felt sick to your stomach automatically...<br>\r\n<br>\r\n When the foot lifted after less than a second...</span></div></div>",
            "created":1214542800,
            "id":548968,
            "title":"\"Oomph\""
        },
        "1112111112":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "\"I Will Finish You Off, Mr. Buggy\"",
                "\"I Better Add You To My Bug Collection\" (Alternate Storyline)"
            ],
            "content":"<div class=\"\"><div> <span> You can barely feel your body as you are crushed onto the ground by a girl's foot that was house sized, to you.<br>\r\n<br>\r\n After an awkward silence, you hear the girl mumble \"... Must be dead... Ewww, I hate bugs! Better leave it as it is...\". You are relieved on hearing this and hold your breath, to convince her so. While she starts to walk away, you think to yourself if you really deserve all this, just for peeking up a girl's skirt once... Despite being covered in sweat, dirt and foot odour, you tell yourself that you will probably be restored to normal if you find that Pink haired girl. Just incase there were any other giantesses around, you stay on the ground, playing dead, for few more minutes but you hear no movement. You stand up and take in the surroundings and shudder at just how helpless you are... You, of course, have never been in a girl's locker room before and ain't exactly sure of directions because from what you can tell, it has a different layout to the boy's one. <br>\r\n<br>\r\n You guess you better start walking around, because at your size, it could take you half a day to just get from one end of the room to the other, as the locker rooms are pretty large, even at your normal size. You don't even manage to go past a row of lockers, when you hear a door open from nearby. To your surprise and horror, Akane comes running in, panting hard. You wonder what she could have possibly been doing, that she's over 10 minutes late to the class. You soon realise that the real question you should be asking is, whether you can convince her that you aren't a pitiful bug, as all others have assumed you as. To think this through, you duck behind, in one quick motion, away from Akane's eyes. <br>\r\n<br>\r\n However, to even a greater horror, you hear Akane shout, \"Hey, what was that?\" in your direction. <br>\r\n<br>\r\n \"Please don't let it be me, Please don't let it be me.\" is all you manage mumble as you start to tremble. Your fears come true as you feel Akane walking toward the locker you are hiding behind. Realising how dangerous this situation is, you start running for your dear life, only to once again be reminded of the worthless exsistence you maintain, as Akane spots you and dashes. In less than two seconds, she covers more ground than you have, in the last ten seconds, blocking your path with her foot. You can't stop in time, and you crash face first into her socked foot. The smell of it dazes you and you fall on your ass for a split second, which leaves you vulernable to the enormus foot.<br>\r\n<br>\r\n Akane looks down upon you and smiles smugly. \"Heh, a bug, just as I thought. Well...\"</span></div></div>",
            "created":1217739600,
            "id":564688,
            "title":"The Late Bird Catches the Worm?!"
        },
        "11121111121":{
            "choices":[
                "Akane flattens you underneath her socked foot",
                "The other girls in the locker room notice you."
            ],
            "content":"<div class=\"\"><div> <span>Akane grins wider.<br>\r\n\"I guess that all bugs...\"<br>\r\nShe lifts a foot high in the air, and you pale. <br>\r\nNo.<br>\r\nShe couldn't!<br>\r\nAkane continues.<br>\r\n\"All bugs deserve to be crushed.\"<br>\r\nShe is!<br>\r\nAkane is going to crush you!!<br>\r\nYou scramble to your feet and immediatly run in the other direction.<br>\r\n<br>\r\nWhat happens?</span></div></div>",
            "created":1275800400,
            "id":895685,
            "title":"\"I Will Finish You Off, Mr. Buggy\""
        },
        "111211111211":{
            "content":"<div class=\"\"><div> <span>As you sprint across the floor of the changeroom, Akane begins to lower her foot.<br>\r\n<br>\r\nYou see the shadow pass over you.<br>\r\nAnd keep running.<br>\r\n<br>\r\nYou hear the slight whistling of air as Akane's massive socked foot flies through the air, towards you.<br>\r\nAnd keep running.<br>\r\n<br>\r\nSuddenly, you trip on a small crack in the floor and land face-first on the floor. You look up at your approaching doom.<br>\r\nAkane's enormous foot slams down on top of you, forcing your body against the ground, pulverizing you completly.<br>\r\nShe lifts her foot off of the ground and smirks.<br>\r\n\"Got it.\"<br>\r\nWith that, Akane spins on her heel and walks away, leaving a red smear on the bottom of her sock and on the floor.<br>\r\n</span></div></div>",
            "created":1275800400,
            "id":895689,
            "title":"Akane flattens you underneath her socked foot"
        },
        "111211111212":{
            "author_id":"violetsly",
            "author_name":"darkjak45",
            "choices":[
                "you dodge them all and escape"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>the only thing your running on is adrinaline and excitement, but others has come to help her kill you. you think the more that come the better.</span></div></span></div>",
            "created":1287118800,
            "id":975596,
            "title":"The other girls in the locker room notice you."
        },
        "1112111112121":{
            "author_id":"violetsly",
            "author_name":"darkjak45",
            "choices":[
                "keep looking for the pink hair girl "
            ],
            "content":"<div class=\"\"><div> <span>To you this is like dodge ball, but instead of ball there are girls who are trying to kill you. you are still running on adrinaline and the excitement. some of the girls are tireing out while others find the energy to keep going. when there is a pause in the confrontation you are hardly tired while they are tinking of a way to kill you they try a last ditch effort to kill you. they all try to kill you altogethere, but with you hardly tired you back up a couple ou steps and they miss. you say this is geting boring you run down the hall leaving the girls tired and out of breath. what to do now?</span></div></div>",
            "created":1287118800,
            "id":975602,
            "title":"you dodge them all and escape"
        },
        "11121111121211":{
            "author_id":"magic681",
            "author_name":"Shadow Ninja",
            "choices":[
                "Pink Haired Girl",
                "Goth Science Teacher"
            ],
            "content":"<div class=\"\"><div> <span>You manage to escape from the change room and run outside. You still have almost full stamina left, so you're good to go. In the main hallway, you stick to the sides and run ahead. With everything now appearing huge, you can hardly recognize the area.<br>\r\n<br>\r\nThinking back, the pink-haired girl had a magic wand, and since magic supposedly doesn't exist, you can only assume that she used some sort of science related trick on you, and the underground school Lab is the only place with such equipment. You decide to go down there. <br>\r\n<br>\r\nYou make your way to the stairs to the lab without been seen, it gets pretty easy when you're that small. At the bottom of the stairs, you are stopped by a closed door. You'll never be able to open it yourself like this. As if someone heard your thoughts, the door opens, and out comes...<br>\r\n<br>\r\nWho appears from the door?</span></div></div>",
            "created":1289365200,
            "id":991093,
            "title":"keep looking for the pink hair girl "
        },
        "11121111122":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Playing Deadly Games With Them",
                "Conducting Experiments on Them"
            ],
            "content":"<div class=\"\"><div> <span> \"I Better Add You To My Bug Collection\" Akane says as she plucks you off the ground with her thumb and point finger. You try to wriggle out of her grip, despite the fact that it's futile to resist. As you are brought to Akane's face, you can make out all these tiny blemishes and scratches on her face, that are probably invisible, if you were your original size. <br>\r\n<br>\r\n \"Hmm, you sure are an odd looking bug,\" Akane tells you, \"I think you will be happy with me, heh\". You only realise then, that you should be trying to communicate with her before it's too late! You scream your lungs out and even wave at her, but she is looking through her bag at the moment, with her other free hand. <br>\r\n<br>\r\n \"You know what, Buggy?\" Akane says in an odd tone, still searching through the bag. \"I will let you in on a little secret, heh\". You do not care very much about this \"secret\" of hers and you just hope that she turns around already and realises that she's holding her fellow classmate! <br>\r\n<br>\r\n \"The thing is, well, not many people know this, so you musn't tell anyone, heh\" giggles Akane, \"I collect bugs, much like yourself, as pets because, I find them very fun to play with\". You wonder if you have the worst luck in the world, as your hope of being rescued just became almost nothing. <br>\r\n<br>\r\n You realise you do have the worst luck as Akane pulls out a glass jar with small enough holes for air to come in, but not big enough for you to get out. \"There, am I prepared or what?\" Akane says cheerfully. From what you can see, Akane's really glad about this, because she doesn't even bother taking a good look at you, as she drops you in the jar and tells you to just hold on tight, till she gets home. As Akane finishes zipping the bag back up, it becomes dark and you can't make out anything but the cold glass surface and wall.<br>\r\n<br>\r\n Few times throughout the day, Akane pulls out a book and so on, but beside that, it is pretty uneventful, except one time when from your perspective, it was the biggest earthquake ever, as someone apparently bumped into Akane's bag...<br>\r\n<br>\r\n As the end of the day bell rings, you wonder what it's like at Akane's house, and drift off to sleep...<br>\r\n<br>\r\n When you wake up, it is silent and there is no movement, as far as you can tell. Neither is there any light. Little do you know, you are already at Akane's house and she is coming downstairs at that exact moment to take you upstairs.<br>\r\n<br>\r\n First, you hear the thumps along the ground. Then, you hear the zipper being opened, and next, comes the blindness from the bright light. Finally, the world being turned upside down as you are dumped out of the jar into Akane's sweaty hands. <br>\r\n<br>\r\n \"Heh, I wonder if bugs sleep?\" Akane asks no one in particular. \"Anyway, I hope you last longer than the other ones.\" You wonder if Akane really likes bugs, and also if there's any chance that she realises you are a human being. <br>\r\n<br>\r\n \"We should start playing, right away!\" Akane says as she encloses you within her palms, cutting off all the light and heading upstairs to her bedroom.<br>\r\n<br>\r\n You are oblivious to the fact that Akane plays with her bugs by...</span></div></div>",
            "created":1217739600,
            "id":565694,
            "title":"Your New Life As Nothing More Than Akane's Pet(AS)"
        },
        "111211111221":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "sexually",
                "curel torture"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of games?            </span></div></span></div>",
            "created":1332979200,
            "id":1304703,
            "title":"Playing Deadly Games With Them"
        },
        "1112111112211":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "butt",
                "vagina"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>As she grabs you she takes you to her...</span></div></span></div>",
            "created":1332979500,
            "id":1304705,
            "title":"sexually"
        },
        "11121111122111":{
            "author_id":"spacemarine6",
            "author_name":"spacemarine1998",
            "choices":[
                "farted",
                "scat"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>She takes you to her butt and pulls down her panties. She giggles \"Most bugs go in and don't come out.\"  You shriver as she puts you in and wedgies herself. Then she...</span></div></span></div>",
            "created":1332983280,
            "id":1304734,
            "title":"butt"
        },
        "111211111221111":{
            "author_id":"vezpool",
            "author_name":"Vezpool",
            "choices":[
                "Akane picks you up",
                "Akane flushes"
            ],
            "content":"<div class=\"\"><div> <span>Akane rips a loud, stinky fart on you, who are stuck halfway up her rectum. She begins fingering herself as she unleashes a barrage of quieter yet equally smelly farts. The torment continues for what seems like an eternity until you feel yourself being pushed by something soft and disgusting. You slide out of her anus in a log of shit and into her toilet.</span></div></div>",
            "created":1499822700,
            "id":2351790,
            "title":"farted"
        },
        "1112111112212":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "Pull you apart slowly",
                "Scrape off your skin with her teeth",
                "Readers choice"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>What kind of cruel torture?</span></div></span></div>",
            "created":1404436860,
            "id":1822287,
            "title":"curel torture"
        },
        "111211111222":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Sweaty Armpit",
                "Left Stinky Blue Sock on the Ground"
            ],
            "content":"<div class=\"\"><div> <span> As Akane gets to her room, she closes the in one quick motion and locks it right after. \"Finally, chance for us to play, heh. I bet you've been waiting for this moment buggy.\" Akane tells you, despite the fact that she thinks you are just a bug. You wonder why she's so passionate about bugs...<br>\r\n<br>\r\n \"Well, as you may know already, I had PE class today, and we had to play soccer out in the sun!\" Akane exclaims, as she showed sign of frustration. \"Even though I'm so fit, it was tremendous effort.\" she adds, as she brings you close and takes another good look at you.<br>\r\n<br>\r\n \"Honestly, I have never seen a bug like you.\" she comments. This whole time, you were waving and trying to get her to hear your voice but it seems to be ineffective.<br>\r\n<br>\r\n \"Oh yeh, just the other day, I read that bugs are attracted to chemicals like alcohol and sweat... Wonder if it's true...\" Akane says, as she puts you down on her bed and starts to strip to her underwear. \"Pee yew\" Akane says as her sweat odour from her armpits and feet are released into the open air of the bedroom. \"What did I tell you. Those PE lessons sure take it out of you\".<br>\r\n<br>\r\n First thing you notice, is that you just got turned on, as you never seen this much skin of a girl before, disregarding the fact that she's bigger than a mountain compared to you. Second thing is, that you can only agree with her as you feel nausea and can't believe that such a smart and fit girl like her can smell this bad. \"Hmm, I think I should do a quick experiment before I have a shower,\" Akane ponders to herself.<br>\r\n<br>\r\n While you wonder what is going on in her head, you don't react fast enough to Akane's lightning fast grip as she lifts you between her thumb and the point finger, only to carry you to her...</span></div></div>",
            "created":1217912400,
            "id":565693,
            "title":"Experiment #1. Do bugs like Sweat?"
        },
        "1112111112221":{
            "author_id":"foxboy",
            "author_name":"Dylan M",
            "choices":[
                "Akane takes you out, she wants to play a game of \"lover bug\"",
                "Your still in Akane's pit"
            ],
            "content":"<div class=\"\"><div> <span>While you wonder what is going on in her head, you don't react fast enough to Akane's lightning fast grip as she lifts you between her thumb and the point finger, only to carry you to her left armpit. To your horror, you can smell and almost taste the humid sweaty environment that is within Akane's left armpit. You are practically glued as soon as you touch the wet surface. I'mt was terrible, especially when you first hit the wet skin. Then darkness fell on you. You were trapped in the pit of despair, and the stench was more then you could handle. You can't believe how hot it is inside her pit. The skin is like trying to keep balance on a water bed, only this time it smells terrible, and is hot and sticky. You struggle to free yourself.<br>\r\n<br>\r\n\"Ohhh, that tickles, buggy!\" snickers Akane.<br>\r\n<br>\r\nYou groan, Akane still couldn't tell you were human and not some bug. Your struggling and the humid environment takes its toll on you and you pass out.<br>\r\n<br>\r\nWhen you regain consciousness...</span></div></div>",
            "created":1242363600,
            "id":691944,
            "title":"Sweaty Armpit (AS)"
        },
        "1112111112222":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Listen To Your Brain! Get Out!",
                "Stay Put! You Need to Save Energy!"
            ],
            "content":"<div class=\"\"><div> <span> Your vision is blurred by the sheer speed that the hand is moving and you are clueless as where abouts you are heading to. A mere second after the moving stops, you are thrown into an area where you immidiately notice that the air is much thicker , withouth even taking in a sniff or a blink. However, when you crash land, and gasp for air, there were no doubts about where you were. It smelt, felt and tasted just like it was before, except much stronger. You were definitely in one of Akane's socks that she wore to play Soccer in the afternoon. You don't dare open your eyes, as your face was covered in her still warm sweat, and getting them into your eyes could be fatal.<br>\r\n<br>\r\n \"Ok, from this moment on, I shall start the experiment, \"Do bugs really enjoy the smell of Sweat?\" you manage to pick up, despite the fact that it's muffled out to some extent. \"I wonder if three mintues is enough to make sure that the experiment is valid, heh. Do your best buggy, and even if you don't, don't get disappointed so much, I always repeat my experiment to increase their realiability!\" Akane assures you through the fabric.<br>\r\n<br>\r\n You are horrored by the fact that Akane is using you as some kind of a lab rat for some stupid and childish experiment! Your brain is constantly alarming you to get out of this hell, so you decide to open your eyes and run for the exit. When you do, you wish you hadn't as you notice that the walls of the sock are stained like someone puked on it. All... Over... The... Sock, that is... You remove it from your mind and look around, figuring out the exit and running towards it. However, your foot quickly becomes stuck to the sock material as it is almost as if you were running in mud, as your foot was sinking in constantly, flying bits of sweat in every direction, including your eyes and mouth.<br>\r\n<br>\r\n \"One minutes to go\" Akane exclaims, not talking to anyone in particular. You wonder if there's any point in getting out, because, as she said, you might have to repeat the experiment, meaning you will be put right back in... Do you bother trying to get out, or just cringe your nose and stay put?</span></div></div>",
            "created":1217912400,
            "id":565698,
            "title":"Running in the... Mud?"
        },
        "11121111122221":{
            "author_id":"numerio",
            "author_name":"Tex",
            "choices":[
                "continue"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Your stupid brain's right, GET OUT!!</span></div></span></div>",
            "created":1297780680,
            "id":1054365,
            "title":"Listen To Your Brain! Get Out!"
        },
        "111211111222211":{
            "choices":[
                "She drops you back in her dirty gym sock...",
                "She puts you somewhere else sweaty..."
            ],
            "content":"<div class=\"\"><div> <span>\tA simple though runs through your brain as you make your escape, “Get out, it freakin’ stinks in here”<br>\r\n<br>\r\n\tWith the cheesy smell of Akane’s foul foot sweat you make a make dash towards the opening at the end of the sock. The sticky floor at your feet slowed you tremendously, but eventually you managed to prevail. As you step out into the bright light, you look up to see Akane staring down at you with a look of minor surprise on her face.<br>\r\n<br>\r\n\t“Wow, the book might be wrong, “ Proclaims the blue-haired titaness, “But I guess I should repeat the experiment to double check” She decided to your horror. <br>\r\n<br>\r\nHow does Akane proceed with the experiment?<br>\r\n</span></div></div>",
            "created":1327550100,
            "id":1265411,
            "title":"Escape from Akane's Smelly Sock"
        },
        "1112111112222111":{
            "author_id":"agentfire",
            "author_name":"Agent",
            "choices":[
                "The test only lasts for a few minutes.",
                "She forgets about you and continues on with her day."
            ],
            "content":"<div class=\"\"><div> <span>\"Alright, buggy. Why don't we try two experiments in one?\" And with that, she dropped you back into her sock. You were utterly confused, until you saw a truly horrifying sight. Coming straight towards you, was Akane's smelly foot. \"This will both retest rather you like sweat or not, as well as test how much pressure you can handle.\" With that, her foot slipped in, sealing your fate. You were stuck under the bottom of her foot, right under her arch.</span></div></div>",
            "created":1432783740,
            "id":1984207,
            "title":"She drops you back in her dirty gym sock..."
        },
        "1112111112222112":{
            "choices":[
                "Her armpit",
                "Her ass crack"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>Where else does she put you where it's sweaty?</span></div></span></div>",
            "created":1422925620,
            "id":1927295,
            "title":"She puts you somewhere else sweaty..."
        },
        "11121111122222":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "\"How Much Force Bugs Can Withstand!\"",
                "\"Whether Bugs Can Swim In Thick Liquid!\""
            ],
            "content":"<div class=\"\"><div> <span> You decide not to waste energy, as you will be more likely than not to be quickly put back in, right after this experiment. <br>\r\n<br>\r\n \"And, Time's Up.\" Akane concludes. \"Book 1, Stink 0\". \"Hey, what do you know, the book was right. I guess bugs do like sweat and alcohol based chemicals.\" She mumbles to herself. \"Gah, I better go have a shower before the next experiment, I stink like foot right now\" Akane says. She bends down and hits the walls of the sock, shaking it slightly, which surprises you. \"Good work buggy. To reward you, I will let you take in the aroma of my feet, which you apparently enjoy! Have a rest while I go freshen up.\" Akane whispers. Hearing this, you realise the mistake you have made and you try to run toward the exit, but it's too late as the sock is lifted, tumbling you down to the toe section, as Akane ties off the exit, sealing you in the sock with no light and only stink and wetness.<br>\r\n<br>\r\n With series of booms, Akane is gone and you hear the water running. You imagine her in the shower and cry in sorrow as you need a shower yourself... <br>\r\n---<br>\r\n In the shower, Akane decided to ditch the idea of repeating and to do new ones... For example, whether the bugs can withstand great force pressing down on them, or whether the bugs can swim in dense liquids such as honey or phlegm.<br>\r\n---<br>\r\n While you were suffering in this acid hell, Akane has dried herself up and is now in new set of tank top and short pants that reveal her long and well built legs. As soon as Akane lifts up the sock and undoes the knot, whole heap of fresh air rushes in, making you cough for few seconds, not that anyone else can hear it.<br>\r\n<br>\r\n \"I hope you rested well, because we have few more experiments to do this evening. Starting with,\"</span></div></div>",
            "created":1217912400,
            "id":566074,
            "title":"How Generous of Akane..."
        },
        "111211111222221":{
            "choices":[
                "Step on you and put you out of your misery.",
                "Place you in a box to rest for a while."
            ],
            "content":"<div class=\"\"><div> <span>Akane decides to slip on a pair of sneakers and begins to giggle, smiling at you. <br>\r\n\"Ok lil buggy, lets see how much force you can withstand.\" She then places her sneaker's sole down ontop of you and slowly places more weight ontop of you.<br>\r\n\"How are you holding up lil buggy?\" she askes you even though she and you already know that answer. She places more weight down and u let out a loud scream of pain and prepare for the worst that is inevitably to come.<br>\r\n<br>\r\nShe lifts up her shoe just as you hear some of your bones crack/crunch, she looks down at you as u begin to squirm and try to crawl away but the pain is too much so u just lay there motionless.<br>\r\n<br>\r\n\"Hmm i guess you could stand my weight after all lil buggy, but you look like you are in pain so i think i will...\"</span></div></div>",
            "created":1253077200,
            "id":761503,
            "title":"How Muc Force Bugs Can Withstand."
        },
        "1112111112222211":{
            "author_id":"flamekidx",
            "author_name":"John_Smith",
            "content":"<div class=\"\"><div> <span>\"You look like you won't live long anyway, so I'll just squish you now.\" She lets out a small giggle and raises her huge sneaker over your broken body. Your body is screaming with pain, so you now WANT to let it end. The sneaker's sole falls down on your body, crushing it instantly with a sickening \"CRACK!\" Your bones are obliterated into pulp. Your body is permanently glued to the bottom of her shoe. She lifts up her leg and inspects the damage. She clicks her tongue. \"Hm. You weren't any fun. Oh well, better find another bug.\" She walks away, forgetting all about you, not knowing she squished a human under her feet, and that he was still stuck to that foot.</span></div></div>",
            "created":1256878800,
            "id":784217,
            "title":"Ending the pain."
        },
        "1112111112222212":{
            "author_id":"violetsly",
            "author_name":"darkjak45",
            "choices":[
                "she had half a piece of bread",
                "she got a bag of chips "
            ],
            "content":"<div class=\"\"><div> <span>she looked at your body and said your in too much pain to go on so i will let you rest. she finds a box in her closet and put it on the dresser she then slowly but carfully put you in the box. Akane then said here take as long as you like i will be back with some food to help you recover. you then fell asleep for a couple of minutes. then Akane return with...</span></div></div>",
            "created":1287032400,
            "id":975282,
            "title":"Place you in a box to rest for a while."
        },
        "111211111222222":{
            "author_id":"extornix",
            "author_name":"RoyalStalker",
            "choices":[
                "Make it (by a miracle)",
                "You don't make it and you're about to drown but you're saved "
            ],
            "content":"<div class=\"\"><div> <span>\"I hope you rested well, because we have a few more experiments to do this evening. Starting with a theory that says:<br>\r\n<br>\r\nBugs can swim in thick liquid such as honey, phlegm etc. And I just have the thing I need to prove this.\" Akane let's you out from the sock, puts you on the desk from her room and before leaveing she says with a small grin:\"Just wait there buggy I'll be back in a bit.\"<br>\r\n<br>\r\nAs the door closes you tremble in fear from only thinking of what it will happen to you and you start to weep.\"OMG! I'm done for! if I don't find a way out of this mess or Akane finds out that I'm human or not some sort of bug I will be in great danger! \"<br>\r\n---<br>\r\nAfter 10 minutes <br>\r\nYou were on deep thinkig, you looked around the room and you saw that the window was open. Without even thinking about the consequences you rushed toward the window and jumped (you were always good at sprint and jump) but when you looked down your whole world fell apart to see Akane looking up straigth at you with a vial in her hand waiting for you to fall in.\"That bitch! She let the window open on purpose to lure me into a trap! Shit!\"<br>\r\n<br>\r\nYou tried to not fall in the vial but it was to late, you felt right in it.\"Yuck! What is this?\" Seeing your strugeling she grins and says:<br>\r\n\" Hey, buggy it's time to see if the book was right or not!\" With this, she laid down the vial and said:\" Now buggy I'll give you 2 minutes to swim throught my spit and remember this phlegm was before I cleaned my teeth so it should smell but you won't mind right? Now....3....2....Prepare buggy 'cause you have only 2 minutes....1....and go!\" You try to swim but your quite exhausted and is difficult to swim throuth phlegm did you.....</span></div></div>",
            "created":1254546000,
            "id":769537,
            "title":"A Human-o- Liquid"
        },
        "1112111112222222":{
            "choices":[
                "She tries the experiment again, but with a different liquid.",
                "She decides on a different experiment."
            ],
            "content":"<div class=\"\"><div> <span>\tThough you are normally an accomplished swimmer, Akane’s sticky saliva smells faintly of her last meal, which most likely contained garlic or cheese. The strong scent was making you feel lightheaded and dizzy as you flailed your arms wildly. Within a few seconds, whether from the smell or your own exhaustion, you begin to fall beneath the liquid’s surface. In a desperate search for air you mistakenly swallow a gulp of Akane’s foul smelling spit, quickly discovering it tastes as bad as it smells.<br>\r\n<br>\r\n\tAs you begin to sink, two strong, yet feminine fingers grasp you, lifting your coughing form from the vial. Akane eyes you inquisitively as she ponders the course of her experiment. <br>\r\n<br>\r\n\tWhat does Akane decide to do?</span></div></div>",
            "created":1327551000,
            "id":1265432,
            "title":"Experiment Failure?"
        },
        "111211112":{
            "author_id":"flamekidx",
            "author_name":"John_Smith",
            "content":"<div class=\"\"><div> <span>She ,unfortunately, doesn't like your species of bugs, so she simply crushes you with her foot. you have no time to react, so you are pressured with the ton of weight that is her foot. As you pass on, you can faintly hear the girl say, \"Eww! Stupid bug! You got my shoe all messy! Now I Need to wash your icky mess off!\"</span></div></div>",
            "created":1225515600,
            "id":602690,
            "title":"Smash you with her right shoe!"
        },
        "11121112":{
            "author_id":"mr.x",
            "author_name":"Mr. E",
            "choices":[
                "Tickle her foot",
                "Climb in the Cute Brunette's Panties"
            ],
            "content":"<div class=\"\"><div> <span>She didn't see you and you're about to look somewhere else when a huge females foot comes crashing down next to you form the left.  you watch as the five toes crush a crumb underneath them into dust and are shocked that it was almost you crushed underneath the giant bare foot of an unaware high school girl.<br>\r\n<br>\r\nFrom Pogojo's Game, Shrink School RPG.  In the Girls Changing Room Before GYM<br>\r\n<a rel=\"nofollow\" href=\"http://www.flickr.com/photos/53737703@N05/4970499303/sizes/l/in/photostream/\" target=\"_blank\">http://www.flickr.com/photos/53737703@N0...</a><br>\r\n<br>\r\nYou look around you and see that your surrounded by Hot Giant teenage girls and most of them are naked!  theres one girl to the right of you taking off her clothes and you could tickle her sole because she has it lifted above the ground.  and theres a cute brunette in front of you that just took off her tight white panties and you could climb in them and get her attention. ( Who are we kidding here? the only reason youre going to climb into her underwear is to have a fun exploring adventure!)<br>\r\n<br>\r\nYou eventually decide to.....</span></div></div>",
            "created":1289541720,
            "id":992148,
            "title":"Inside The Girls Locker Room"
        },
        "111211122":{
            "content":"<div class=\"\"><div> <span>You decide to climb into the brunettes panties as they lay on the ground but sadly you didn't realize that the girl was putting them back on and you were  rocketed towards the sky straight toward her butt. The girl unaware of your presence in her panties  ended up snapping your neck, killing you and ended up changing into her uniform. The girl continued the rest of the day then left the school and went home unaware of your corpse in her panties.</span></div></div>",
            "created":1439199900,
            "id":2019302,
            "title":"exploring is never safe"
        },
        "1112112":{
            "author_id":"flamekidx",
            "author_name":"John_Smith",
            "choices":[
                "You are trapped under her foot during PE."
            ],
            "content":"<div class=\"\"><div> <span>You try and make a run for it. Unfortunately, the overpowering stentch saps your energy, slowing your reaction time, so you do not see that her toes are right in front of you. With a flick of the big toe, you are sent flying back. As you try to get up, the ball of her foot pushes down on you, crushing your tiny build. The odor is overriding your senses now, so you might lose consiousnes. You hold on for dear life as the humoungous foot pulverizes you.</span></div></div>",
            "created":1225515600,
            "id":602678,
            "title":"Unfortunately, you get knocked back by her toes..."
        },
        "11121121":{
            "author_id":"flamekidx",
            "author_name":"John_Smith",
            "choices":[
                "You can't hold on.",
                "You hold on till after PE."
            ],
            "content":"<div class=\"\"><div> <span>As she walks for the gym, she crushes you with every step. You can faintly hear the coach yelling out drills. 'Please don't run laps,' you think over and over again. ' You! You're running 15 laps, NOW!' you hear the coach yell near you. 'Damn!' you curse to yourself. As she runs laps, you slowly drift towards the light. You might not make it.</span></div></div>",
            "created":1225515600,
            "id":602681,
            "title":"You are trapped under her foot during PE."
        },
        "111211211":{
            "author_id":"flamekidx",
            "author_name":"John_Smith",
            "content":"<div class=\"\"><div> <span>Every step she takes, you are pressured with a top of weight. Slowly, but painfully, you pass on, forever cursed (or not, if this is your fetish) to stay crushed under the odor-filled heel of this beautiful giantess, day after day, till the end of time...<br>\r\n<br>\r\n                             The End! You died! You lucky person!</span></div></div>",
            "created":1225515600,
            "id":602684,
            "title":"You can't hold on."
        },
        "111211212":{
            "choices":[
                "You regain strength and explore",
                "Someone notices you"
            ],
            "content":"<div class=\"\"><div> <span>Despite the relentless pounding, you manage to keep a grip to life and make it to the end of P.E.<br>\r\nThe girl heads back to the locker room and pulls off her shoes.<br>\r\nOddly enough, the sweaty sock fibers cause you to stick and eventually fall onto the tile floor.<br>\r\nEventually...</span></div></div>",
            "created":1249880400,
            "id":742489,
            "title":"You hold on till after PE."
        },
        "111212":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Run to the dark area to hide?",
                "Grab onto her hands, and risk being crushed?"
            ],
            "content":"<div class=\"\"><div> <span> When the bag stops moving as the girl arrives to her class, you wonder just exactly what class this is. You carefully crawl your way to the part of the bag with light flooding in, just to check things out. As you look out, you immidiately recognise the ceiling to be part of a science lab, as it is the usual boring white ceiling. Except this time, it seems like it never ends, due to your diminshed size. You are guessing that this girl's one of those people who are really careless about their belongings because the bag's once again open enough so that you could climb out with a bit of try... However, before you actually manage to do so, the girl comes back and puts her hands into the bag to grab a book out. Do you...</span></div></div>",
            "created":1212642000,
            "id":540426,
            "title":"I always found Science Boring (AS)"
        },
        "1112122":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "\"Theory Lesson learning on how harmful Insects are!\"",
                "\"Practical Lesson on Dissecting Cockroaches!\""
            ],
            "content":"<div class=\"\"><div> <span> Not knowing when the next chance of getting out would come, you quickly grab onto her hands, that is just within your reach. Lucky for you, your miniscule body is hidden behind the Biology book that she has just got out. Few seconds later, the hands start to descend as she goes back to her seat. By the time the book is dropped onto the Lab table, you managed to get a proper grip, which allowed you to stay on the backside of the book. You now think about your options... Should you try to get this girl's help ? Or should you try to find that Pink haired girl by yourself ? <br>\r\n<br>\r\nYou are quite oblvious to the noises from outside until you hear the a female teacher shout, \"Class, today we will have a ...\"</span></div></div>",
            "created":1217739600,
            "id":564611,
            "title":"Heading Out of the Bag"
        },
        "11121222":{
            "author_id":"junky",
            "author_name":"Shrunk Maker",
            "choices":[
                "Still risk it and try to get her help",
                "Wait for a good chance to Get Away from this Maniac."
            ],
            "content":"<div class=\"\"><div> <span> \"Practical Lesson on Dissecting Cockroaches!\"<br>\r\n As you hear the words, you realise that if there's a Practical lesson on, this girl's going to be more likely to be distracted than a normal Theory lesson... This would work for you if you wanted to run away, but if you wanted her attention, this could backfire on a major scale... Anyhow, you squint out from the backside to see that the giants are moving about, gathering the necessary equipments for their prac.<br>\r\n<br>\r\n However... You feel a chill down your back as you hear the girl sigh and say, \"Uggh. Another prac dissecting dead things. Why don't we disect some small and alive insects? This ain't no fun at all. Maybe I shouldn't have picked Biology...\".<br>\r\n<br>\r\n After hearing this, you are alarmed and even scared for your life... What's your next choice?</span></div></div>",
            "created":1217739600,
            "id":564614,
            "title":"Dissecting Dead Things are No Fun"
        },
        "11123":{
            "choices":[
                "P.E",
                "Another class"
            ],
            "content":"<div class=\"\"><div> <span>You decide that hiding inside of the purse would probably lead to trouble, so you hide NEXT to the purse and wait for the girl to finish what she's doing.<br>\r\nEventually, she closes and locks her locker, picks up her bag and starts to head off to her next class.<br>\r\nYou dash after her, trying not to be seen by her or anyone else.<br>\r\nShe turns a corner and enters....</span></div></div>",
            "created":1252818000,
            "id":759880,
            "title":"Wait for her to be done with packing and follow..."
        },
        "111231":{
            "choices":[
                "You make into her pocket",
                "Someone notices you!"
            ],
            "content":"<div class=\"\"><div> <span>You follow the girl for a few more minutes and see her pass through the gym doors. You run as fast as humanly possilbe and manage to make it through the swinging doors before they crushed your tiny body.<br>\r\nYou accidentally slip on the tiled floor and fall on your face. When you get up, the girl has dissapeared, and you are alone in the girls changeroom, save for about 10-15 girls.<br>\r\nYou decide to search for this mystery girl, and eventually find her sitting on a bench in her dirty socks, chatting to one of her friends.<br>\r\nAs she pulls on one shoe, you sneak up next to her purse and try to climb the bench. Oddly enough, you do, and are looking at the girl's tight gym shorts.<br>\r\n\"If I climb into her pocket, I could talk to her if she get's alone..\"<br>\r\nWith that in mind, you head for her gym shorts pocket and.....</span></div></div>",
            "created":1252818000,
            "id":759884,
            "title":"P.E"
        },
        "1112312":{
            "content":"<div class=\"\"><div> <span>You were about halfway into the girl's pocket when another girl spotted you.<br>\r\n\"Hey! There's a big bug hanging from your pocket!\"<br>\r\nYou realise in horrer that if you don't hide soon, you will die.<br>\r\nThe girl turns to see where you are, and you make a mad dash to the end of the bench.<br>\r\nShe picks up her other shoe and slams it down on top of you, stunning you breifly.<br>\r\nYou get up and are met with the sight of an enormous hand flying straight to your body.<br>\r\n\"Oh hell...\"<br>\r\nThe girl's massive palm knocks you off of the bench and you land by her socked foot. Although you are only a foot away, the smell is incredible!<br>\r\nShe grins at you and raises her socked foot. You try to run, but she brings it down, pressing you to the ground once again. She raises her foot and stomps you again and again, until you can't seem to hold onto life anymore. She arcs her socked foot and places the ball of her foot on top of you, and starts to twist it back and forth.<br>\r\nWith all the relentless stomping and grinding, your vision fades...and you become a little red splat on the floor.</span></div></div>",
            "created":1252818000,
            "id":759885,
            "title":"Someone notices you!"
        },
        "1113":{
            "choices":[
                "Try to move out of the way in order to escape her hand.",
                "Freeze in terror and can't move at all and stare at her.",
                "Run from her and try to find the pink haired girl again."
            ],
            "content":"<div class=\"\"><div> <span>At this point you have no idea as to where to look for the pink haired girl. However, you see a girl who might be trustworthy with your life, a brown haired girl who is holding an ant collection in her hands walking down the hallway. You decide to approach her and try to get her help, but you wonder if she will see you. You get about 3 meters ahead of her and then start jumping up and down waving your hands in the air to get her attention, she doesnt stop though. She continues walking and steps on you. You close your eyes and you think that you are dead, but to your astonishment you are stuck in a groove in the sole of her shoe, so you are safe for now.<br>\r\n<br>\r\n\"God this is dangerous! I have to get out of this situation and soon,\" you think to yourself. Though when she gets to her locker she lifts up her foot and you fall to the floor, 6 inches seems like 20 feet to you at the size you are at. She notices you right away when she looks down to pick up some paper that fell from her locker. She squats down and believes you to be an ant from her collection. She reaches down to you and you begin to scream out in terror. As she gets closer you...</span></div></div>",
            "created":1253077200,
            "id":761476,
            "title":"A Brunette Comes A Stompin."
        },
        "11131":{
            "choices":[
                "Licks you and begins to try to eat you.",
                "Drops you and then trys to crush you."
            ],
            "content":"<div class=\"\"><div> <span>As she gets closer you lunge over to the left and run towards what you believe to be your home room. She chases you down the hall and almost crushes you under her sole as she screams at you to stop. <br>\r\n<br>\r\n\"STOP! HEY STOP,\" she yells at you an each yell sounds like a sonicboom to you. You keep running and finally get to the door and get inside before the door shuts. The girl follows you inside the room only to give up looking as there is a class going on at the moment. She leaves and you let out a sigh of relief. <br>\r\n<br>\r\n\"That was close.\" You turn around only to see an entire class of girls as big as skyscrapers infront of you. <br>\r\n<br>\r\n\"I wonder if I can sneak out of here without getting seen,\" you think to yourself, thus you begin to turn around when one of the girls gets up to go to the door and you freeze in your spot. You turn arouns slowly and notice that the girl coming towards you is none other then May.<br>\r\n<br>\r\nYou think to yourself, \"Well if it's May maybe she can help me.\" You get exicted when u notice its May so you get hiped up and begin to jump around to get her attention. She notices you and motions for 2 other girl to come with her. She picks you up and puts u in her hand and walks out the door. <br>\r\n<br>\r\nYou think. \"Thank god im saved, May is going to rescue me.\" But as she gets out the door she places you on the floor again. At this point your smile fades and she looks at you with a smile and places her foot on you playfully but not her full weight. she scream out in terror as she toys with you. The other 2 girls begin to talk to her then she tells them to toy with you.<br>\r\n<br>\r\nGirl number 1:\"This looks like fun May, where did u get this from?\"<br>\r\nGirl number 2:\"Crushing bugs is a duty for all girls i say, crushing this lil bug will be quite enjoyable.\"<br>\r\n<br>\r\nThey both laugh out loud and begin to push their shoe onto your body slowly but not enough to kill you yet.<br>\r\n<br>\r\nMay then looks back down to you and then smiles and says, \"How does it feel to be an even smaller loser?\"<br>\r\nShe then picks him up and places him to her face and laughs at him.<br>\r\n<br>\r\nAfterwards she...</span></div></div>",
            "created":1253077200,
            "id":761486,
            "title":"Caution Against Giantess'."
        },
        "11132":{
            "choices":[
                "An ant picks you up and takes you to it's queen",
                "You are mistaken for an ant egg"
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You are to scared to mvoe and she picks you up and puts you in her ant farm.<br>\r\nWhat happens?</span></div></span></div>",
            "created":1386717420,
            "id":1706063,
            "title":"Freeze in terror and can't move"
        },
        "112":{
            "choices":[
                "She suddenly throws her head back, opens  her mouth, and eats you like a snack.",
                "She puts you in her bag and walks to her next class."
            ],
            "content":"<div class=\"\"><div> <span>Before you can escape, she has you in her grasp. She lifts you up to eye level and studys you, a curious look in her eye. \"Wow!\" she says, \"My spell worked!\" As she stares at you, you can't help but feel nervous. You get worried about what might happen next...</span></div></div>",
            "created":1231909200,
            "id":633469,
            "title":"Reaching out to grab you! (Alternate Storyline)"
        },
        "1121":{
            "choices":[
                "She does!",
                "She opens her mouth and picks you out."
            ],
            "content":"<div class=\"\"><div> <span>As you sit there, wondering why you're terrified as you are, the twinkle returns to her eyes. \"Ya know,\" she says, \"I've always wondered what a shrunken boy would taste like.\" Before you can object, her head tilts back, she opens her mouth, and she drops you in without a word. As she uses her tongue to roll you around her mouth,you realize the fear was triggered when you heard her stomach rumble. After a minute with no swallowing, you start to wonder if she's ever going to swallow...</span></div></div>",
            "created":1231909200,
            "id":633472,
            "title":"She suddenly throws her head back, opens  her m..."
        },
        "11211":{
            "choices":[
                "You die...",
                "Hope!"
            ],
            "content":"<div class=\"\"><div> <span>As she swallows, saliva begins trickling by you in what looks like tiny streams. You can no longer hold on and slide towards the back, helpless to do anything. Going down her throat, you feel immense pressure from the sides, and you realize you are just a tiny bulge traveling down her neck. You close your eyes realizing there's not much you can do...</span></div></div>",
            "created":1231909200,
            "id":633476,
            "title":"She does!"
        },
        "112111":{
            "content":"<div class=\"\"><div> <span>As you reach the stomach, you realize being eaten may not be so bad... after all, she could have just as easily crushed you with her shoe. Yeah, it's not that bad... not even painful...<br>\r\n<br>\r\nOn the outside, the girl packs up her books and heads to her next class, not once regretting what she has done. As far as she is concerned, you are just another pervert, and she was happy to rid your school of you.</span></div></div>",
            "created":1231909200,
            "id":633478,
            "title":"You die..."
        },
        "112112":{
            "choices":[
                "There's somebody else inside!",
                "The girl who ate you speaks"
            ],
            "content":"<div class=\"\"><div> <span>You land in her stomach. It's warm and rumbly and unstable. You trudge around in goop up to your waist. You try to feel the walls for a way out but it's pitiful just trying to walk. Something snags your leg and you fall into the goop. You're sucked under by some force and are drowning in chaos just to breathe. <br>\r\n<br>\r\nEventually amist the chaos you notice there's a warm light around you and you're in a dry place. You're confused but you know for a fact that you're in the pink girl's belly.</span></div></div>",
            "created":1334808420,
            "id":1318765,
            "title":"Hope!"
        },
        "11212":{
            "author_id":"magic681",
            "author_name":"Shadow Ninja",
            "choices":[
                "Try running underneath the chair for cover (successfully)",
                "Try running underneath the chair for cover (fail)"
            ],
            "content":"<div class=\"\"><div> <span>She pulls you out and holds you to eye level.<br>\r\n<br>\r\n\"Lets see if you can avoid getting stomped by me!\"<br>\r\n<br>\r\nShe flings you away and you slam into the nearby wall and fall to the ground with a painful thud.<br>\r\n<br>\r\nRealising what she's going to attempt to do, you watch as she steps towards you in an effort to crush you.<br>\r\n<br>\r\nWhat do you do?</span></div></div>",
            "created":1270702800,
            "id":864422,
            "title":"She opens her mouth and picks you out."
        },
        "112121":{
            "author_id":"violetsly",
            "author_name":"darkjak45",
            "choices":[
                "she see she has underestimate you and called for help",
                "you continue to toy with her"
            ],
            "content":"<div class=\"\"><div> <span>You where very good at running and had alot of energy you could keep running for hours. you let her make the first move when its in your sight you dodge it and taunt her as she looks right at you you shout you have to do better than that to kill me. when you finish taunting her you run for cover by the chair.</span></div></div>",
            "created":1287118800,
            "id":975608,
            "title":"Try running underneath the chair for cover (suc..."
        },
        "1121212":{
            "author_id":"magic681",
            "author_name":"Shadow Ninja",
            "choices":[
                "Run to cover under a table",
                "Try your luck and run towards the door."
            ],
            "content":"<div class=\"\"><div> <span>Since the chair is now huge, it's leg is practically a wall. In addition to great stamina, you're pretty good at Parkour (getting from Point A to B as efficiently as possible using the environment; using wallruns, jumping over things, etc), you run up the leg of the wall and manage to grab onto the ledge of the chair. You pull yourself up, to see her raising her foot to bring down on you. But, there would be no reason to get on top of the chair if you didn't expect this move. You dive off the chair onto the ground once again, and roll on the floor to break your fall. You hear her foot smash against the wood, but much to your suprise, her foot goes <i>through</i> it. The full-sized chair is crushed mercilessly under her weight, as the wood explodes, causing you to duck as a piece flys over your head. Toying with her like this is aggrivating her, and this can lead to unpredictable events. She calms down a bit; \"Ha! Thats gotta crush the little worm!\"<br>\r\n<br>\r\nSince the chair is now gone, you have no cover. And judging by what she did to the chair, her strength must be unimaginable; you think what will happen if it is done on you. <br>\r\n<br>\r\nYou can either try to run to cover to a nearby table OR hope she doesn't see you and run towards the door.</span></div></div>",
            "created":1289278800,
            "id":990384,
            "title":"you continue to toy with her"
        },
        "112122":{
            "author_id":"magic681",
            "author_name":"Shadow Ninja",
            "content":"<div class=\"\"><div> <span>After staring at the size and coping with the intense pain, you get up and run for the chair. But the girl is too fast as she (casually) walks over you and kicks sidewides into the right boot. You slam into and as you lay there looking, you see her rising her boot up and positioning it over you.<br>\r\n<br>\r\nShe then stomps on you, splattering your body into paste. Your body is no match for her shoe as you explode into a massive red stain almost as big as the boot itself.</span></div></div>",
            "created":1270702800,
            "id":864455,
            "title":"Try running underneath the chair for cover (fail)"
        },
        "1122":{
            "choices":[
                "The bathroom",
                "Gym"
            ],
            "content":"<div class=\"\"><div> <span>\"What the hell are you talking about? I'm obviously dreaming you stupid fuck.\" You usually don't curse, especially around girls. And this pink haired girl is hot, really hot. Well, aside from the pink hair at least. She has big voluptuous breasts and a curvy body that compliments them. Maybe you're small enough to fit in her bra or panties. After all this is a dream. What's the harm?<br>\r\n<br>\r\n\"You are not dreaming, so be quiet.\" Is all she says. But she can't be telling the truth. This predicament is beyond real. It is ridiculous and absurd. You are positive that you are dreaming. <br>\r\n<br>\r\n\"Look, captain of the S.S. crazy! I don't care what you say. This. Is. Impossible!\" But she says nothing as she ambles through the school hallways with you perched reluctantly in her purse. Why does she even have a purse? Purses are meant for shopping, not school. Girls make you question lots of things.<br>\r\n<br>\r\n\"Can you at least tell me where were going?\" You ask, even though you know she won't give you an answer. Oddly, she does though. <br>\r\n<br>\r\n\"To...\"</span></div></div>",
            "created":1235538000,
            "id":657462,
            "title":"Where to?"
        },
        "11221":{
            "choices":[
                "The girl emerges from the stall and sees you.",
                "You shrink even more."
            ],
            "content":"<div class=\"\"><div> <span>\"To the bathroom. I've had to go ever since second period.\" You notice it's now seventh period. Wow, this girl could hold in pee for a long time. She hurriedly swings around a corner, giving you temporary whiplash and sets her bag down as fast as she can while she huddles into a stall. You can hear her unzip her jeans and try to keep focus on the main thing going on here. YOU HAVE SHRUNK! \"By the way, you better not look at me!\" She whispers as loudly as she can.<br>\r\n<br>\r\n\"Yeah, yeah. I think it would take me five years just to walk across the floor and into the stall, anyways. I mean, look at me!\" Of course she can't look at you at the moment, but she understands.<br>\r\n<br>\r\n\"I know, you're small. Get over it and own up to what you did to that innocent girl in the hallway.\" You hear her tear off a piece of toilet paper and reminisce. The view from underneath that girl's legs was spectacular. You will never forget. <br>\r\n<br>\r\nMeanwhile, another girl waltzes into the bathroom. You duck low inside the pink haired girl's bag so she won't notice and hear the sound of a door slam. It's okay to get up now. But you can't resist the urge. As quickly as you can, you hop out of the bag and run for the stall. Sliding through a crack in the wall, where the stall wasn't connected all the way, you can easily see everything. It nearly gives you a hard on... until you feel someone pluck you out from the crack.<br>\r\n<br>\r\n\"Hey!\" You squeal.<br>\r\n<br>\r\n\"You fail! That was a test you pervert and now you shall be punished for it!\" All of a sudden...</span></div></div>",
            "created":1235538000,
            "id":657463,
            "title":"Bad Move"
        },
        "112212":{
            "choices":[
                "The Gym",
                "The staff room"
            ],
            "content":"<div class=\"\"><div> <span>You begin to shrink even more. As you shrink the pink-haired girl walks out of the bathroom with you in her hand. You are now the size of a ant. Then the P.E teacher comes for the pink-haired girl. Suddenly the pink-haired girl screws up her right hand (which you are in but not squishing you). You hear there talk.<br>\r\n<br>\r\n\"Hey, do you have any athlete's foot powder on you?\"<br>\r\n\"Yes I do\"<br>\r\n\"Can I use it?\"<br>\r\n\"Yes you can\"<br>\r\n<br>\r\nYou hear the pink-haired girl take something out of her bag, putting some stuff on what being put on, and putting it back in.<br>\r\n<br>\r\n\"Thanks for that. I better be-\"<br>\r\n\"Wait, I forgot to put something in\"<br>\r\n<br>\r\nSuddenly you start to move. But you don't know where you are going because it is dark. Then some light comes brightly. As your eyes get used to the light you see whats happening. You see the P.E teacher and the pink-haired girl talking to each other. You look around the place you are in and found out you are in the P.E teacher's left trainer! You try to talk to the teacher to not put her foot on you but she can't hear you. So you listen to the rest of their talk<br>\r\n<br>\r\n\"Thanks for that\" <br>\r\n\"No problem, Miss Kelly\"<br>\r\n\"You better go to your lesson then\"<br>\r\n\"Ok, then. Bye!\"<br>\r\n<br>\r\nThe teacher puts her left trainer down (and you) and puts her left foot in. The bigness of the foot over takes you as you fall onto the floor. The sweat's smell, the shoe's smell, the heaviness of the foot and the consented slamming is making you dizzy. But there is a hole in the shoe so you can breath. you wonder were Miss Kelly is going...  </span></div></div>",
            "created":1246683600,
            "id":718749,
            "title":"Under Miss Kelly's foot"
        },
        "1122122":{
            "author_id":"mrswb",
            "author_name":"me",
            "choices":[
                "Try to escape",
                "Don't try you have accepted your fate"
            ],
            "content":"<div class=\"\"><div> <span>After wat seemed like hours of being in her trainer, she opens up a door and walks into the staff lounge.You hear small tidpits of conversation and all of the sudden you get thrown around as she sits down and starts talking to another teacher,\"Ugh, I hate this job, it'd be better if there were no boys.\" <br>\r\n\"I know, they so rude and impolite,\" said a voice you don't know. There was some more banter between them when the gym teacher slipped out of her shoe to relax. Her foot still was above the entrance of the shoe. This was probably your only chance of escape.</span></div></div>",
            "created":1252040400,
            "id":755347,
            "title":"The staff room"
        },
        "11221221":{
            "author_id":"mrswb",
            "author_name":"me",
            "choices":[
                "\"I have to get to my next class, bye!\"",
                "\"Have you heard the one about the Rabbi and the drunk Iman?\""
            ],
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You decided to throw caution to the wind and sprinted all out for the end of the shoe and you heard the gym teacher say...</span></div></span></div>",
            "created":1252126800,
            "id":756180,
            "title":"Try to escape"
        },
        "112212211":{
            "author_id":"mrswb",
            "author_name":"me",
            "content":"<div class=\"\"><span style=\"font-size:1.47em;\"><div> <span>You heard her say this and think nothing of it until her foot lands squarly on top of you and the entire stench, sweat, and weight of the socked foot hits you in the face and you pass out, never to wake up</span></div></span></div>",
            "created":1252126800,
            "id":756181,
            "title":"\"I have to get to my next class, bye!\""
        },
        "112212212":{
            "choices":[
                "Class is over and is breaktime",
                "Empty Hall"
            ],
            "content":"<div class=\"\"><div> <span>As you get to the end of Miss Kelly's trainer you hear her tell a joke to one of the other teachers. You grab a bit of the sock and started to climb out of her shoe. You got out just in as Miss Kelly goes to her class and you jumped off. <br>\r\n<br>\r\nYou looked around the staffroom and see the door open. You run through when... </span></div></div>",
            "created":1256706000,
            "id":783107,
            "title":"Out of the Shoe...?"
        },
        "11221222":{
            "author_id":"mrswb",
            "author_name":"me",
            "content":"<div class=\"\"><div> <span>By now you have been stepped on by god knows how many people and have decided to just sit there and die. Mrs. Kelly seemed happy to oblige. \"I have a free period that I'm going to the gym in a while, wanna come with?\", she said to the other teacher sitting next to her. \"Sure!\" said Mrs. Kelly. Her foot slammed into her trainer and you almost lose consciousness but you stay awake until she starts running laps with her friend in the gym. <br>\r\n<br>\r\n<br>\r\n<br>\r\nMrs. Kelly found a strange red stain on her sock that night.</span></div></div>",
            "created":1252126800,
            "id":756185,
            "title":"Don't try you have accepted your fate"
        },
        "11222":{
            "choices":[
                "Akane!"
            ],
            "content":"<div class=\"\"><div> <span>\"To gym class. I'm gonna be late if I don't hurry.\" Your ears perk up once you hear the word gym. Gym, a place where all girls can run around half naked in sports bras and short shorts without being watched by boys. It was perfect. This \"punishment\" was going better than expected.<br>\r\n<br>\r\n\"Okay,\" is all you can manage to say though.<br>\r\n<br>\r\nBoth of you stay in silence for a while. All you can hear is the squeaky sounds the pink haired girl's shoes made as they hit the ground with each step she took. \"What are you thinking?\" She asks you as she opens the door to high school. You aren't inside the changing room yet though, its a floor down and a long walk. The building reeks of pool water, and somehow distracts you, making you say the worst possible thing.<br>\r\n<br>\r\n\"Boobs.\" It was the truth.<br>\r\n<br>\r\nShe just shook her head at the response and pursed her lips. \"God, you really are a pervert. I guess I underestimated you.\" Silence. \"Actually, I didn't. Coming from you, I would expect a reply like that.\"<br>\r\n<br>\r\n\"C'mon, it was a joke! I'm not that big of a perv,\" you lie.<br>\r\n<br>\r\nShe snorts as she pulls open the door to the changing room.<br>\r\n<br>\r\n\"Yeah right.\"<br>\r\n<br>\r\nYou go silent as you see other girls changing, their boobs hanging out of the bras, their tight asses hanging out of their thongs. You nearly faint from overload of the scenery, but decide not to since you'd miss the show if you did. You turn around and see...</span></div></div>",
            "created":1235538000,
            "id":657464,
            "title":"Enormus Pool"
        },
        "112221":{
            "author_id":"joeqmafia",
            "author_name":"Joeq2",
            "choices":[
                "Explore",
                "Run away!"
            ],
            "content":"<div class=\"\"><div> <span> Akane was talking to May, the pink haired girl walked up closer to where they were sitting and put you on the chair. You are amazed by this show of girls showing off there boobs. There was one problem though the huge purse that you were in blocked your view. You look around for something to help you get out of this purse. You find a pack of gum that looks light enough to push up. Then you here somebody say something as you begin to push.<br>\r\n<br>\r\n\"What are we doing today after school?\"<br>\r\n<br>\r\nThis sounds like Akane.<br>\r\n<br>\r\n\"I have a alot of homework as it is so I can't hang out later.\"<br>\r\n<br>\r\nSomthing that May would have said.<br>\r\n<br>\r\nYou did it, the pack of gum is at a angle so that you can climp up and get out of there. Then you here somebody tell the girls to go into the gym. The pink haired girl leaves you behind in the purse. You climb out and the locker room is empty. What do you do?<br>\r\n<br>\r\n </span></div></div>",
            "created":1252818000,
            "id":759776,
            "title":"Akane!"
        },
        "1122212":{
            "author_id":"kageman",
            "author_name":"Stitevoli",
            "choices":[
                "She starts jogging, anything could happen.",
                "The girls do warmups, jumping jacks and push-ups."
            ],
            "content":"<div class=\"\"><div> <span>You begin your descent down the purse of your captor, but just as you think you're free, something terrible happens that sends chills down your spine.<br>\r\n<br>\r\n\"Hang on I left something in my bag\" The pink haired girl says.<br>\r\n<br>\r\nYou panic, and attempt to run behind the purse in hopes of avoiding eye contact with the girl. <br>\r\nHowever your efforts are fruitless, as a large shadow appears above you shortly before you find yourself picked up and rising up high into the air.<br>\r\n<br>\r\n\"So that's how it is huh? I try to teach you a lesson, but you just don't want to learn do you?\" she says <br>\r\n\"No wait, I can explain -\" you say as she cuts you off<br>\r\n\"No no, don't bother, I understand.\" she answers<br>\r\nYou start to lighten up in hopes that maybe you've convinced her you're not such a bad guy after all, however...<br>\r\n<br>\r\n\"I understand.. that you were planning on peeping on all these other girls. How dare you, do you even know why I shrank you in the first place??\" she asks angrily<br>\r\n\"I would never do that I swear\" you plead<br>\r\n\"I think you need to be punished mister.\" she grins \"You know earlier, you said you were thinking about boobs. Well I'll give you all the time in the world to think about them, and hopefully, this time you learn something from what's about to happen.\"<br>\r\n<br>\r\nShe begins to lower you down to chest level. Her enormous breasts in full view. You gulp.<br>\r\n\"uh oh\" you say<br>\r\n<br>\r\nShe unzips the front of her uniform until it reaches the middle of her breasts. As she brings you into her chest, all you can focus on is the amazing cleavage in-front of you.<br>\r\n<br>\r\n\"And don't you dare think about running away this time\" she says one final thing before she drops you down between her breasts.<br>\r\n<br>\r\nOnly your shoulders and head stick out from above her breasts as she zips her uniform back up and starts to head outside to track. Everywhere your hands reach out to, all you can find is soft flesh. Blanketed in darkness, you feel the heavy ripples and jiggling of her huge breasts around you as she moves about her business, every slight motion heaving her breasts onto your small body. Her smell is so intoxicating, so much that you begin to wonder if you'll withstand suffocating in here, let alone the fact that these ginormous jugs just may end up crushing you.<br>\r\n</span></div></div>",
            "created":1366167300,
            "id":1573233,
            "title":"Failed getaway"
        }
    },
    "info":{
        "author_id":"junky",
        "author_name":"Shrunk Maker",
        "brief_description":"Based off the Shrinking game by Pogojo. See inside to find out where to download it.",
        "created":1212406020,
        "description":"<td align=\"left\" class=\"norm\">With permission from Pogojo... I present you, \"Shrink School\", Interactive Style...<br>\r\n<br>\r\n<br>\r\n<br>\r\n This interactive story is based off the recent GTS genred game made by Pogojo. More information about the game can be found here:<br>\r\n<br>\r\n<a class=\"blue2roll\" rel=\"nofollow\" href=\"http://www.youtube.com/watch?v=ji6q3WaOsx8\" target=\"_blank\">http://www.youtube.com/watch?v=ji6q3WaOsx8</a><br>\r\n<br>\r\n<br>\r\nSince the game is only demo, more characters will be introduced, as well as changes to character profiles.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nCharacters:<br>\r\n<br>\r\n<u>You:</u><br>\r\n<br>\r\nA hard-working student who is very shy with other girls. You have a somewhat perverted side, and that have got you into this predicament where you were shrunk to a bug size.<br>\r\n<br>\r\n<br>\r\n<u>Pink Haired Girl (Name Unknown):</u><br>\r\n<br>\r\nA pink haired girl who seems as if she's unsure of her capabilities with her magic. She carries around a pink heart shaped wand, and with it, has shrunk you to punish you for perving on another girl.<br>\r\n<br>\r\n<br>\r\n<u>Akane:</u><br>\r\n<br>\r\nBlue haired girl, who seems very carefree and fit. She sometimes looks down on people by calling them \"Loser\". <br>\r\n<br>\r\n<u>May:</u><br>\r\n<br>\r\nA brunette girl who has  parents that expect a lot out of her, as she is irritated and depressed by the fact that she didn't go so good in the recent test. <br>\r\n<br>\r\n<br>\r\n<u>Miss (Name Unknown)</u><br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nPlease do not add to the story for now, as I will be adding to it.<br>\r\n<br>\r\nRules:<br>\r\nProper Grammar<br>\r\nNo other introduction of Characters<br>\r\nOthers must think that you are a bug, or some kind of toy (Excludes: Akane, May or the Pink Haired girl)<br>\r\nA Normal person cannot hear what you are saying (Excludes: The Pink Haired girl)</td>",
        "id":1433930,
        "image_url":"https://images.Writing.Com/imgs/writing.com/writers/listing-header-5000.gif",
        "last_full_update":1499822700,
        "modified":1499822700,
        "pretty_title":"Shrink School Story"
    }
}